{"url": "https://web.archive.org/web/20081006131457/http://www.politifact.com:80/truth-o-meter/mccainpledge/", "text": "Pledge of Allegiance E-mail\n\nThe following is the text of a chain e-mail that features Sen. John McCain's remarks about the Pledge of Allegiance, and an anecdote from his time as a prisoner of war in Vietnam.\n\nJohn McCain's remarks about the Pledge of Allegiance\n\nIn light of the recent appeals court ruling in California, with respect to the Pledge of Allegiance, the following recollection from Senator John McCain is very appropriate:\n\n'The Pledge of Allegiance' - by Senator John McCain\n\n'As you may know, I spent five and one half years as a prisoner of war during the Vietnam War. In the early years of our imprisonme nt, the NVA kept us in solitary confinement or two or three to a cell. In 1971 the NVA moved us from these conditions of isolation into large rooms with as many as 30 to 40 men to a room.\n\nThis was, as you can imagine, a wonderful change and was a direct result of the efforts of millions of Americans on behalf of a few hundred POWs 10,000 miles from home.\n\nOne of the men who moved into my room was a young man named Mike Christian.\n\nMike came from a small town near Selma , Alabama . He didn't wear a pair of shoes until he was 13 years old. At 17, he enlisted in the US Navy. He later earned a commission by going to Officer Training School Then h e became a Naval Flight Officer and was shot down and captured in 1967. Mike had a keen and deep appreciation of the opportunities this country and our military provide for people who want to work and want to succeed.\n\nAs part of the change in treatment, the Vietnamese allowed some prisoners to receive packages from home. In some of these packages were handkerchiefs, scarves and other items of clothing.\n\nMike got himself a bamboo needle. Over a period of a couple of months, he created an American flag and sewed on the inside of his shirt.\n\nEvery afternoon, before we had a bowl of soup, we would hang Mike's shirt on the wall of t he cell and say the Pledge of Allegiance.\n\nI know the Pledge of Allegiance may not seem the most important part of our day now, but I can assure you that in that stark cell it was indeed the most important and meaningful event.\n\nOne day the Vietnamese searched our cell, as they did periodically, and discovered Mike's shirt with the flag sewn inside, and removed it.\n\nThat evening they returned, opened the door of the cell, and for the benefit of all of us, beat Mike Christian severely for the next couple of hours. Then, they opened the door of the cell and threw him in. We cleaned him up as well as we could.\n\nThe cell in which we lived had a concrete slab in the middle on which we slept Four naked light bulbs hung in each corner of the room.\n\nAs I said, we tried to clean up Mike as well as we could. After the excitement died down, I looked in the corner of the room, and sitting there beneath that dim light bulb with a piece of red cloth, another shirt and his bamboo needle, was my friend, Mike Christian. He was sitting there with his eyes almost shut from the beating he had received, making another American flag. He was not making the flag because it made Mike Christian feel better. He was making that flag because he knew how important it was to us to be able to Pledge our allegiance to our flag and country.\n\nSo the next time you say the Pledge of Allegiance, you must never forget the sacrifice and courage that thousands of Americans have made to build our nation and promote freedom around the world. You must remember our duty, our honor, and our country.'\n\n'I pledge allegiance to the flag of the United States of America and to the republic for which it stands, one nation under God, indivisible, with liberty and justice for all.'\n\nPASS THIS ON... And on... And on! You can even send it back to me, I don't mind, because its worth reading again.\n\noh.....and then you have this clown, who refuses to place his hand on his heart and say the pledge...... Subject: Remember this picture on election day!\n\nLet's all remember this on election day...if you have family serving in the military, make sure you send it along. I don't care for Hillary, but at least she shows respect for the country she lives in! I had heard about this but a picture is definitely worth 1000 words! God save us!!!\n\nSenator Barack Obama, Governor Bill Richardson, Senator Hillary Clinton and Ruth Harkin stand during the national anthem.\n\nBarack Hussein Obama's photo (that's his real name).....the article said he REFUSED TO NOT ONLY PUT HIS HAND ON HIS HEART DURING THE PLEDGE OF ALLEGIANCE, BUT REFUSED TO SAY THE PLEDGE.....how in the hell can a man like this expect to be our next C commander-in-Chief", "images": ["https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-attack.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-issues.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/artheds_contribute.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-fom.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/favicon.ico", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/artheds_the-story.gif", "https://web.archive.org/web/20081006131457im_/http://sptmain.122.2o7.net/b/ss/sptmain/1/H.1--NS/0", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-home.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/artheds_browse.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/truthinpolitics-3.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/logopf_aboutbox.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/artheds_subscribe.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/spacer.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-stories.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-tom.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/artheds_search.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/logoset_aboutbox.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-rulings.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-candidates.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/graphics/knight-batten-190.gif", "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/navbar-images-chainemails.gif"], "top_img": "https://web.archive.org/web/20081006131457im_/http://www.politifact.com/media/img/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Pledge of Allegiance E-mail", "meta_data": {"description": "PolitiFact.com is a project of the St. Petersburg Times and Congressional Quarterly to help you find the truth in the presidential campaign", "keywords": "politics, presidential election, president, 2008 campaign, campaign 08, Democrats, Joe Biden, Hillary Clinton, Chris Dodd, John Edwards, Mike Gravel, Dennis Kucinich, Barack Obama, Bill Richardson, Republicans, Sam Brownback, Rudy Giuliani, Mike Huckabee, Duncan Hunter, John McCain, Ron Paul, Mitt Romney, Tom Tancredo, Fred Thompson, Obama Girl, video, TV, television, report, true, barely true, half true, mostly true, false, pants-on-fire, pants on fire, truth, truth-o-meter, facts, statements, research, analyze, speeches"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}