{"url": "https://en.wikipedia.org/wiki/Maggie_Lawson", "text": "Margaret Cassidy Lawson (born August 12, 1980) is an American actress who is best known for her role as Detective Juliet \"Jules\" O'Hara in the TV show Psych. From 2018 to 2019, she held the recurring role of Nathalie Flynn on Fox's Lethal Weapon's third and final season.\n\nEarly life [ edit ]\n\nLawson was born in Louisville, Kentucky to Judy, a homemaker and Mike Lawson, a hotel manager. She attended St. Stephen Martyr School, a Catholic grade school and then Assumption High School, an all-girls Catholic School in Louisville.\n\nCareer [ edit ]\n\nLawson started her career at the age of 8 in local community and dinner theater productions. She later became a youth TV host on WDRB Fox 41 Kid's Club in Louisville, and moved to Los Angeles for her first pilot at 15.[3]\n\nIn 2011, Lawson briefly returned to her roots in theater to star in the play Greedy, directed by James Roday, which played for a few weekends in Los Angeles.\n\nLawson starred in various sitcoms like Cybill, Boy Meets World and Home Improvement throughout her early career in both guest starring and supporting roles. She also made guest appearances on television series such as Smallville and Fear Itself, and co-starred in It's All Relative and Crumbs.\n\nFor Disney Channel, Lawson starred in a double role in Model Behavior featuring Justin Timberlake, and in the 2002 installment of Nancy Drew in the title role. Other film credits include Pleasantville, Nice Guys Sleep Alone and Cleaner.\n\nFrom 2006 to 2014, Lawson co-starred in the USA Network original series, Psych, as Detective Juliet O'Hara. She reprised her role in 2017 in Psych: The Movie and will do so again in the sequel set to air early 2020.[4]\n\nFollowing Psych, she scored leading roles in ABC's 2013 sitcom Back In The Game, CBS's 2014 sitcom pilot Save the Date and CBS's 2016 fantasy sitcom Angel from Hell. She also had short arcs on Two And A Half Men, The Great Indoors, and Netflix's The Ranch.\n\nAlso for Netflix, Lawson starred in the recurring role of Christa on the second and third seasons of horror-comedy series Santa Clarita Diet as well as the movie Spivak in 2018.\n\nFor Hallmark Channel, Lawson has starred in My Favorite Wedding and Christmas Encore in 2017, The Story of Us and the upcoming Christmas in Evergreen: Tidings of Joy in 2019.\n\nMost recently, Lawson starred in a recurring role as Dr. Natalie Flynn on the 3rd season of Lethal Weapon and was featured in Treehouse, the 6th episode of Hulu's monthly horror movie anthology Into The Dark.\n\nShe will play Kay, the female lead opposite Jason Biggs, in the upcoming FOX comedy series Outmatched, \"about a blue-collar couple [...] in South Jersey trying to get by and raise four kids, three of whom just happen to be certified geniuses.\"[5]\n\nPersonal life [ edit ]\n\nLawson is an avid animal lover and co-founder of the Tiger Frances Foundation, an animal rescue organization based in Los Angeles, California.\n\nShe dated her Psych co-star, James Roday, from 2006–2013.\n\nLawson was engaged to Back in the Game co-star Ben Koldyke on November 14, 2014,[6] and married him on August 8, 2015, on his family's ranch in New Mexico. In early 2017, Lawson filed for divorce from Koldyke.[7]\n\nFilmography [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/1200px-Maggie_Lawson_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/220px-Maggie_Lawson_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/1200px-Maggie_Lawson_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Maggie_Lawson", "title": "Maggie Lawson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/1200px-Maggie_Lawson_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}