{"url": "https://en.wikipedia.org/wiki/Shaunie_O%27Neal", "text": "Va'Shaundya Karlette \"Shaunie\" O'Neal (née Nelson; born November 27, 1974)[1][2] is an American television personality, entrepreneur, philanthropist and one of the executive producers of VH-1’s reality TV series, Basketball Wives, Basketball Wives LA, and Baller Wives. She was formerly a film marketer and wife of NBA center Shaquille O’Neal.[3][4]\n\nCareer [ edit ]\n\nO'Neal is one of the executive producers of Basketball Wives, a reality series that follows the wives, ex-wives, and girlfriends of professional basketball players. Another reality television show, Basketball Wives LA, follows the Los Angeles wives, ex-wives, and girlfriends of professional basketball players. O'Neal is the center of a third reality television series, Shaunie's Home Court, a reality series that follows the lives of her five children and family.\n\nPersonal life [ edit ]\n\nOn December 26, 2002, she married NBA player Shaquille O'Neal at the Beverly Hills Hotel. Before and during[5] their marriage, the couple had four children: Shareef (b. 2000), Amirah (b. 2001), Shaqir (b. 2003), and Me’arah (b. 2006). Shaunie has a son, Myles, from a previous relationship, while Shaquille O'Neal has a daughter, Taahirah, with his former girlfriend Arnetta Yardbourgh. Shaquille and Shaunie O'Neal separated after five years of marriage on September 4, 2007, but reconciled shortly after. On November 10, 2009, Shaunie filed for divorce, citing \"irreconcilable differences\".[6] Their oldest son, Shareef, is a standout basketball player, who committed to UCLA in 2018.\n\nReferences [ edit ]\n\n\n\n", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/U.S._flag_on_television.svg/36px-U.S._flag_on_television.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Shaunie_O%27Neal", "title": "Shaunie O'Neal", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}