{"url": "https://www.vulture.com/2017/04/alexis-bledel-handmaids-tale-role-she-was-born-to-play.html", "text": "Alexis Bledel. Photo: Hulu\n\nSpoilers ahead for Hulu’s The Handmaid’s Tale.\n\nA few minutes into her first scene in The Handmaid’s Tale, Alexis Bledel holds an orange. It’s a relatively insignificant moment, but it struck me, since, in her years of playing Rory Gilmore on Gilmore Girls, Bledel always seemed visibly uncomfortable with props. This hit a flash point when, in the awkwardly Photoshopped posters for Netflix’s Gilmore revival, it appeared that she had no idea how to hold everyday objects (I snidely tweeted about this, and Bledel later defended herself on national television). Bledel’s an easy target. She never quite shed her Rory persona, nor the sense you got in Gilmore Girls’s Stars Hollow that she was always in a daze watching the show’s Mach-five dialogue whiz by her. But in The Handmaid’s Tale’s oppressive, anxiety-inducing dystopia, Bledel is somehow right at home. You can see the fear in her eyes, the flickering resolve in her nervous composure, and a kind of punctured sadness in her posture. She even holds oranges the right way.\n\nIn the Handmaid’s pilot, Bledel’s character, Ofglen, makes a 180 in the eyes of Elisabeth Moss’s Offred. The two characters, who shop together but are the de facto property of two different men, suspect each other of being enthusiastic participants in Gilead’s totalitarian state. “I sincerely believe that Ofglen is a pious little shit with a broomstick up her ass,” Offred says in voice-over as she approaches her companion with a smile. “She’s my spy and I’m hers.” With Bledel as Ofglen, you instinctively believe Offred’s assessment. Hasn’t she always seemed too perfect? Too brittle? Too willing to be a snitch? (Or was that Rory Gilmore?)\n\nCloser to the end of the pilot, as Offred and Ofglen recover from a brutal “particicution,” they walk through town and end up stopping at what used to be an ice-cream shop. In a rare moment, they see each other’s faces straight-on, reflected in the windowpane. “They had the most amazing salted caramel, it was better than sex,” Ofglen says. “Like, good sex.” It’s the closest thing anyone has made to a joke, and it punctures the distrust between them. They start to talk, for real. Ofglen, we learn, had a wife (which makes her a “gender traitor” in puritanical Gilead) and son before she was forced into servitude. Like Offred, she tried to escape and, like Offred, she always suspected her partner. “It was nice to finally meet you,” she deadpans at the end of their conversation.\n\nThe Handmaid’s Tale’s theocratic regime is built upon men’s oppression of women, which further perpetuates women’s distrust of each other. In the book, it takes much longer for Ofglen to reveal her hidden depths, but in Bledel’s casting, the show gets the point across quickly. Even in Gilmore Girls, the actress always had a bit of an icy distance — which, while off-putting for some fans, worked to her advantage as Rory’s sense of entitlement became more a part of her personality in the show’s later seasons. While never one for witty banter, Bledel always felt more in her element when she tapped into Rory’s darker side. Consider the way, when confronted by Lorelai about sleeping with the married Dean at the end of Gilmore Girls’s fourth season, Bledel’s Rory drifts between defensive humor (“all those Trojan jokes worked”), defiance (“I hate you for ruining this for me!”), and, finally, despair.\n\nBledel didn’t always get a chance to flex her dramatic muscles on Gilmore, nor in most of her other film and TV roles which she tended to play as Rory Gilmore–alikes (Sisterhood of the Traveling Pants, Post Grad) or woefully against that type (we don’t need to talk about Sin City). Mad Men recruited Bledel to play a depressed housewife — a step in the right direction — but seemed too pleased with the trick of turning Rory into an emptied-out Donna Reed to ask much of her as an actress. The problem tended to be that the role that made Bledel recognizable never totally fit her abilities in the first place, but no one bothered to try getting her to do much else.\n\nBut Bledel finds new depths in The Handmaid’s Tale. The show gives her plenty of material in Ofglen’s false piety, and it’s thrilling to watch her dig into it. Underneath her hood, her watery eyes glimmer with anxiety, even as she tries to carve out a little friendship with Offred. She has a winning, rusty sense of humor. And when, in later episodes, Ofglen submits to terrible punishments, Bledel’s work becomes all the more potent. She doesn’t crumple into histrionics; instead, she’s eerily still, like a righteous doll. Ofglen isn’t defeated, and she’s definitely not pious, she’s angry: You think you know her, but you couldn’t be more wrong.", "images": ["https://pyxis.nymag.com/v1/imgs/11c/4b2/43ccca848c404695806b9faf2fe7968b12-21-alexis-bledel-handmaids-tale.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/04/21/21-alexis-bledel-handmaids-tale.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/11c/4b2/43ccca848c404695806b9faf2fe7968b12-21-alexis-bledel-handmaids-tale.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Jackson Mchenry"], "canonical_link": "https://www.vulture.com/2017/04/alexis-bledel-handmaids-tale-role-she-was-born-to-play.html", "title": "Alexis Bledel As Ofglen in The Handmaid’s Tale Is the Role She Was Born to Play", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Alexis Bledel As Ofglen in The Handmaid’s Tale Is the Role She Was Born to Play", "url": "https://www.vulture.com/2017/04/alexis-bledel-handmaids-tale-role-she-was-born-to-play.html", "description": "The actress reveals new depths as Ofglen.", "image": "https://pyxis.nymag.com/v1/imgs/11c/4b2/43ccca848c404695806b9faf2fe7968b12-21-alexis-bledel-handmaids-tale.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Alexis Bledel Is Great As Ofglen in The Handmaid’s Tale", "description": "The actress reveals new depths as Ofglen.", "image": "https://pyxis.nymag.com/v1/imgs/11c/4b2/43ccca848c404695806b9faf2fe7968b12-21-alexis-bledel-handmaids-tale.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@McHenryJD", "site": "@vulture"}, "description": "The actress reveals new depths as Ofglen.", "article": {"tag": "the handmaid's tale, hulu, tv, alexis bledel, rory no more, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "sailthru.tags": "the handmaid's tale, hulu, tv, alexis bledel, rory no more, vulture homepage lede", "author": "Jackson McHenry", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1493233560.0, "source": "https://www.vulture.com", "summary": ""}