{"url": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018", "text": "Though she had an enviably easy pregnancy, what followed was the greatest medical ordeal of a life that has been punctuated by them. Olympia was born by emergency C-section after her heart rate dove dangerously low during contractions. The surgery went off without a hitch; Alexis cut the cord, and the wailing newborn fell silent the moment she was laid on her mother’s chest. “That was an amazing feeling,” Serena remembers. “And then everything went bad.”\n\nThe next day, while recovering in the hospital, Serena suddenly felt short of breath. Because of her history of blood clots, and because she was off her daily anticoagulant regimen due to the recent surgery, she immediately assumed she was having another pulmonary embolism. (Serena lives in fear of blood clots.) She walked out of the hospital room so her mother wouldn’t worry and told the nearest nurse, between gasps, that she needed a CT scan with contrast and IV heparin (a blood thinner) right away. The nurse thought her pain medicine might be making her confused. But Serena insisted, and soon enough a doctor was performing an ultrasound of her legs. “I was like, a Doppler? I told you, I need a CT scan and a heparin drip,” she remembers telling the team. The ultrasound revealed nothing, so they sent her for the CT, and sure enough, several small blood clots had settled in her lungs. Minutes later she was on the drip. “I was like, listen to Dr. Williams!”\n\nBut this was just the first chapter of a six-day drama. Her fresh C-section wound popped open from the intense coughing spells caused by the pulmonary embolism, and when she returned to surgery, they found that a large hematoma had flooded her abdomen, the result of a medical catch-22 in which the potentially lifesaving blood thinner caused hemorrhaging at the site of her C-section. She returned yet again to the OR to have a filter inserted into a major vein, in order to prevent more clots from dislodging and traveling into her lungs. Serena came home a week later only to find that the night nurse had fallen through, and she spent the first six weeks of motherhood unable to get out of bed. “I was happy to change diapers,” Alexis says, “but on top of everything she was going through, the feeling of not being able to help made it even harder. Consider for a moment that your body is one of the greatest things on this planet, and you’re trapped in it.”\n\nThe first couple of months of motherhood have tested Serena in ways she never imagined. “Sometimes I get really down and feel like, Man, I can’t do this,” she says. “It’s that same negative attitude I have on the court sometimes. I guess that’s just who I am. No one talks about the low moments—the pressure you feel, the incredible letdown every time you hear the baby cry. I’ve broken down I don’t know how many times. Or I’ll get angry about the crying, then sad about being angry, and then guilty, like, Why do I feel so sad when I have a beautiful baby? The emotions are insane.” Her mother, Oracene Price, has been staying in Florida to help out. She has encouraged Serena to relax around her daughter and is making the case for a strict parenting style in an era in which children often have the last word. “Obedience brings protection; that’s what my mom told me,” Serena says. “That’s straight from the Bible, and she wrote it down on paper and gave it to me. I was always obedient: Whatever my parents told me to do, I did. There was no discussion. Maybe I had a little rebellious phase in my 20s, when I tried liquor for the first time. Maybe having a baby on the tennis tour is the most rebellious thing I could ever do.”", "images": ["https://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg", "https://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://assets.vogue.com/photos/5a54e047faf3bc4e2b3fab56/master/w_1600%2Cc_limit/01-serena-williams-vogue-cover-february-2018.jpg", "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/w_1280,c_limit/05-serena-williams-vogue-cover-february-2018.jpg", "https://assets.vogue.com/photos/5a54e0463ebd0571fa0cd192/master/w_1600%2Cc_limit/03-serena-williams-vogue-cover-february-2018.jpg", "https://assets.vogue.com/photos/5a54e046fb207660fa92173f/master/w_1600%2Cc_limit/02-serena-williams-vogue-cover-february-2018.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg"], "top_img": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/w_1280,c_limit/05-serena-williams-vogue-cover-february-2018.jpg", "keywords": [], "authors": ["Rob Haskell", "Rob Haskel", "Mario Testin"], "canonical_link": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Rob Haskell", "copyright": "Copyright (c) Condé Nast 2020", "description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.", "id": "5a54ddd4faf3bc4e2b3fab54", "keywords": "magazine,sports,enlargeinriver,serena williams", "news_keywords": "magazine,sports,enlargeinriver,serena williams", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a54ddd4faf3bc4e2b3fab54", "parsely-metadata": "{\"description\":\"Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.\",\"image-16-9\":\"https://assets.vogue.com/photos/5a54e065c5a4191ce869177d/16:9/w_1000,c_limit/07-serena-williams-vogue-cover-february-2018.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5a54e065c5a4191ce869177d/1:1/w_1000,c_limit/07-serena-williams-vogue-cover-february-2018.jpg\"}", "og": {"description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.", "image": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/w_1280,c_limit/05-serena-williams-vogue-cover-february-2018.jpg", "site_name": "Vogue", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback", "type": "article", "url": "https://www.vogue.com/article/serena-williams-vogue-cover-interview-february-2018"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "Serena Williams, Vogue’s February 2018 cover star discusses her difficult delivery for the first time and when she hopes to make her triumphant return to tennis.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5a54e04719d517509a5790e4/16:9/w_1280,c_limit/05-serena-williams-vogue-cover-february-2018.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Serena Williams on Motherhood, Marriage, and Making Her Comeback"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "https://www.vogue.com", "summary": ""}