{"url": "time.com/4775633/donald-trump-stephen-colbert-cnn-msnbc-chris-cuomo/", "text": "President Donald Trump says he thinks CNN’s Chris Cuomo looks like a “chained lunatic” on television. CNN’s Don Lemon is “perhaps the dumbest person in broadcasting” and CBS Late Show host Stephen Colbert is a “no-talent guy” who talks “filthy.”\n\nThose were just some of the comments Trump offered over dinner Monday night when asked about the media he consumes as President of the United States. But he did little to hide his frustration, explaining that he had been surprised that the journalistic criticism had gotten worse after the campaign. He also said he had been working on tuning out news that is critical of him.\n\n“I’ve been able to do something that I never thought I had the ability to do. I’ve been able not to watch or read things that aren’t pleasant,” he said, maintaining that he no longer watches CNN or MSNBC. “And it keeps you young.”\n\nThere was little doubt, however, that he remained acutely aware of what reporters and correspondents were saying about him. He has large flat-screen televisions set up in the Treaty Room in the White House residence and in his private dining room in the West Wing. He continues to have stacks of newspapers and magazines delivered to his office suite in the West Wing.\n\n“Washington Post, New York Times, they’re really, really dishonest,” he said, before directly addressing the TIME reporters he had invited for dinner. “You people are quite dishonest in all fairness.” He said he used to watch MSNBC’s Joe Scarborough but no longer does. He also claimed to have helped CNN president Jeff Zucker, an old friend and business colleague, get his job at the network.\n\nThe one network he praised was Fox News, saying he watches their shows and is responsible for its ratings bump.\n\nSpokespeople for MSNBC and CBS said the networks had no comment on the president’s criticism. A CNN spokesperson said, “His comments are beneath the dignity of the office of the President.” Trump’s claims about CNN’s Zucker have been repeatedly refuted by the executives involved.\n\nHere’s an extended excerpt of his conversation with TIME:\n\nFor instance I don’t watch CNN. I don’t watch MSNBC. Scarborough used to treat me great. But because I don’t do interviews and stuff and want to … He went the other way. Which is fine. He’s got some problems. But I don’t watch the show anymore. It drives him crazy. I don’t watch the show. I do watch Fox in the morning, and their ratings have gone through the roof because everyone knows I’m watching Fox. But they’re pleasant. And if I do something wrong they report on it. I don’t mean they – if I do something wrong. But it’s really, honestly it’s the most accurate. CNN in the morning, Chris Cuomo, he’s sitting there like a chained lunatic. He’s like a boiler ready to explode, the level of hatred. And the entire, you know the entire CNN platform is that way. This Don Lemon who’s perhaps the dumbest person in broadcasting, Don Lemon at night it’s like – sometimes they’ll have a guest who by mistake will say something good. And they’ll start screaming, we’re going to commercial. They cut him off. Remember? I’ve seen things where by mistake somebody they bring in a guest and it turns out to be a positive. And they go, I mean they get just killed. The level of hatred. And poor Jeffrey Lord. I love Jeffrey Lord. But sometimes he’s sitting there with eight unknown killers that nobody ever heard of. And CNN actually is not doing nearly as well as others. They’re all doing well because of me. But it’s not doing as well as others that are doing better actually. But Fox treats me very fairly. MSNBC is ridiculous. It’s just bad. It’s an ability I never thought I’d have. I never thought I’d have the ability to say, they’re doing a big story on me on CNN and I won’t watch it. And it’s amazing, it doesn’t matter. But it really, the equilibrium is much better. As far as newspapers and things, I glance at them. They’re really dishonest. I mean they’re really dishonest.\n\nTrump also brought up The Late Show host Stephen Colbert’s blistering and crude May 1 monologue, in which the comedian delivered an oral-sex joke about the president and Russian President Vladimir Putin:\n\nYou see a no-talent guy like Colbert. There’s nothing funny about what he says. And what he says is filthy. And you have kids watching. And it only builds up my base. It only helps me, people like him. The guy was dying. By the way they were going to take him off television, then he started attacking me and he started doing better. But his show was dying. I’ve done his show. … But when I did his show, which by the way was very highly rated. It was high—highest rating. The highest rating he’s ever had.\n\nGet our Politics Newsletter. Sign up to receive the day's most important political stories from Washington and beyond. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/05/donald-trump-after-hours-facebook.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/05/donald-trump-after-hours-facebook.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Zeke J Miller", "Michael Scherer"], "canonical_link": "https://time.com/4775633/donald-trump-stephen-colbert-cnn-msnbc-chris-cuomo/", "title": "President Trump Attacks 'Lunatic,' 'No-Talent,' 'Dumbest Person' in TV", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Donald Trump, Donald Trump media, Donald Trump Stephen Colbert, Donald Trump Chris Cuomo, Donald Trump Don Lemon, Donald Trump CNN, Donald Trump MSNBC", "news_keywords": "Donald Trump, Donald Trump media, Donald Trump Stephen Colbert, Donald Trump Chris Cuomo, Donald Trump Don Lemon, Donald Trump CNN, Donald Trump MSNBC", "description": "President Trump thinks Chris Cuomo looks like a \"chained lunatic\" on television and CNN's Don Lemon is \"the dumbest person is broadcasting.\"", "og": {"title": "President Trump Attacks 'Lunatic,' 'No-Talent,' 'Dumbest Person' in TV", "type": "article", "site_name": "Time", "url": "https://time.com/4775633/donald-trump-stephen-colbert-cnn-msnbc-chris-cuomo/", "description": "\"He's sitting there like a chained lunatic.\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/05/donald-trump-after-hours-facebook.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4775633/donald-trump-stephen-colbert-cnn-msnbc-chris-cuomo/", "description": "President Trump thinks Chris Cuomo looks like a \"chained lunatic\" on television and CNN's Don Lemon is \"the dumbest person is broadcasting.\"", "media": "https://api.time.com/wp-content/uploads/2017/05/donald-trump-after-hours-facebook.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4775633/donald-trump-stephen-colbert-cnn-msnbc-chris-cuomo/", "title": "President Trump Attacks 'Lunatic,' 'No-Talent,' 'Dumbest Person' in TV", "description": "\"He's sitting there like a chained lunatic.\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/05/donald-trump-after-hours-facebook.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}