{"url": "https://deadline.com/2018/02/a-wrinkle-in-time-ava-duvernay-crowdfunding-screenings-underprivileged-kids-1202301068/", "text": "Similar to the crowd-funding #BlackPantherChallenge which raised thousands of dollars for children to see Disney/Marvel’s Black Panther for free, Color of Change and AMC Theatres are teaming for Give A Child The Universe initiative which will give underprivileged kids the opportunity to see Ava DuVernay’s A Wrinkle in Time for free starting on March 9, the pic’s release date.\n\nStarting today, Give A Child The Universe encourages individual and group benefactors to purchase and donate tickets to the movie, enabling children to see A Wrinkle in Time at a matinee showing at their local AMC Theatres location. Using the donations, Color of Change will distribute tickets to a network of local partners, schools and community-based organizations, allowing children to enjoy this highly anticipated title regardless of economic challenges.\n\n“Color of Change believes in the power of images and supports those working to change the rules in Hollywood so that inclusive, empathetic and human portrayals of Black people and people of color are prominent on the screen,” said Rashad Robinson, executive director of Color Of Change in statement. “From Selma to now A Wrinkle In Time, Ava DuVernay has set out to change the rules in Hollywood for people of color and women. By casting a black teenage actress Storm Reid as the heroine at the center of this story, the filmmakers and the studio send a powerful message to millions of young people who will see someone like them embracing their individuality and strength to save the world. We are pleased to partner with AMC to ensure that as many young people as possible, regardless of economic and financial hardships, can see this groundbreaking film.”\n\n“The Wrinkle in Time story is one that children from all backgrounds and walks of life can identify with and draw inspiration from, and we are thrilled to celebrate this film in a meaningful way, through the vision of Ava DuVernay and in partnership with Color of Change,” said Nikkole Denson-Randolph, vice president, special content, AMC.\n\nThe #BlackPantherChallenge, launched by New York-based philanthropist Frederick Joseph, fueled over 400 GoFundMe drives that raised over $400K for kids to see the Marvel movie.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F02%2Fa-wrinkle-in-time-ava-duvernay-crowdfunding-screenings-underprivileged-kids-1202301068%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202301068&comment_count=2", "https://pmcdeadline2.files.wordpress.com/2018/02/wrinkle.jpg?w=1024"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/02/wrinkle.jpg?w=1024", "keywords": [], "authors": ["Anthony D'Alessandro"], "canonical_link": "https://deadline.com/2018/02/a-wrinkle-in-time-ava-duvernay-crowdfunding-screenings-underprivileged-kids-1202301068/", "title": "Underprivileged Children Will Be Able To See ‘A Wrinkle In Time’ Free At AMC Theatres", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Underprivileged kids will get the opportunity to see Ava DuVernay's A Wrinkle in Time for free starting on March 9.", "news_keywords": "A Wrinkle In Time, AMC, Ava DuVernay, Disney", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Underprivileged Children Will Be Able To See ‘A Wrinkle In Time’ Free At AMC Theatres", "url": "https://deadline.com/2018/02/a-wrinkle-in-time-ava-duvernay-crowdfunding-screenings-underprivileged-kids-1202301068/", "description": "Similar to the crowd-funding #BlackPantherChallenge which raised thousands of dollars for children to see Disney/Marvel’s Black Panther for free, Color of Change and AMC Theatres are teaming …", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/02/wrinkle.jpg?w=1024", "width": 1200, "height": 800}, "locale": "en_US"}, "article": {"published_time": "2018-02-23T16:45:20+00:00", "modified_time": "2018-02-23T17:13:47+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Underprivileged Children Will Be Able To See ‘A Wrinkle In Time’ Free At AMC Theatres"}, "image": "https://pmcdeadline2.files.wordpress.com/2018/02/wrinkle.jpg?w=1024", "card": "summary_large_image", "creator": "@AwardsTony", "title": "Underprivileged Children Will Be Able To See ‘A Wrinkle In Time’ Free At AMC Theatres", "description": "Underprivileged kids will get the opportunity to see Ava DuVernay's A Wrinkle in Time for free starting on March 9."}, "author": "Anthony D'Alessandro", "content_type": "Article", "post_id": 1202301068, "title": "Underprivileged Children Will Be Able To See 'A Wrinkle In Time' Free At AMC Theatres", "published_at": "2018-02-23 08:45:20", "image": "https://pmcdeadline2.files.wordpress.com/2018/02/wrinkle.jpg?w=296&h=166&crop=1", "comment_count": 2, "tags": "Disney", "topics": "Box Office", "body": "Similar to the crowd-funding #BlackPantherChallenge which raised thousands of dollars for children to see Disney/Marvel's Black Panther for free, Color of Change and AMC Theatres are teaming for Give A Child The Universe initiative which will give underprivileged kids the opportunity to see Ava DuVernay's A Wrinkle in Time for free starting on March 9, the pic's release date.\r\n\r\nStarting today, Give A Child The Universe encourages individual and group benefactors to purchase and donate tickets to the movie, enabling children to see A Wrinkle in Time at a matinee showing at their local AMC Theatres location. Using the donations, Color of Change will distribute tickets to a network of local partners, schools and community-based organizations, allowing children to enjoy this highly anticipated title regardless of economic challenges.\r\n\r\n“Color of Change believes in the power of images and supports those working to change the rules in Hollywood so that inclusive, empathetic and human portrayals of Black people and people of color are prominent on the screen,” said Rashad Robinson, executive director of Color Of Change in statement. “From Selma to now A Wrinkle In Time, Ava DuVernay has set out to change the rules in Hollywood for people of color and women. By casting a black teenage actress Storm Reid as the heroine at the center of this story, the filmmakers and the studio send a powerful message to millions of young people who will see someone like them embracing their individuality and strength to save the world. We are pleased to partner with AMC to ensure that as many young people as possible, regardless of economic and financial hardships, can see this groundbreaking film.”\r\n\r\n“The Wrinkle in Time story is one that children from all backgrounds and walks of life can identify with and draw inspiration from, and we are thrilled to celebrate this film in a meaningful way, through the vision of Ava DuVernay and in partnership with Color of Change,” said Nikkole Denson-Randolph, vice president, special content, AMC.\r\n\r\nThe #BlackPantherChallenge, launched by New York-based philanthropist Frederick Joseph, fueled over 400 GoFundMe drives that raised over $400K for kids to see the Marvel movie.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1519404320.0, "source": "https://deadline.com", "summary": ""}