{"url": "https://www.huffingtonpost.com/entry/interview-with-dr-darcy-sterling-of-es-famously_us_5986052be4b00833d1de287b", "text": "I fell in love with E!’s Famously Single when its initial season debuted last year. The premise is that “famous” people (some you may be unfamiliar with, especially if you aren’t an avid reality TV viewer or haven’t kept up with British personalities) live in a house together and participate in group therapy with exercises designed to teach skills for attaining and maintaining healthy relationships. Because they are well-known - some notorious for being polarizing on-screen - they aren’t necessarily meeting suitors with the best of intentions in the real world. They say they are looking for love but coming up short and having problems with trust. Dr. Darcy Sterling, a NYC therapist who frequently conducts relationship seminars with her wife Stephanie Concicki, is the expert that guides these dynamic personalities and shines the light on their cerebral, self-reflective sides.\n\nI spoke with “Dr. Darcy” (as she is known in the house) and posed some questions that have been on my mind since Season 1 and now, during Season 2 of Famously Single.\n\nBustle.com Famously Single Season 2 Cast (left to right): Chad Johnson, Malika Haqq, Calum Best, Dorothy Wang, Ronnie Ortiz-Magro, David McIntosh, Tiffany Pollard, Karina Smirnoff\n\nI love your work with the cast mates and the advice you give. How familiar are you with the personalities when you go in?\n\nI literally know nothing about the celebrities because I’m so not cool and I don’t watch any of the shows they’re on. I actually just started watching Jersey Shore and I’m so glad I was unfamiliar. To know the personalities beforehand could form my opinions and each of the cast mates gets a more objective opinion with me because I haven’t watched their shows. They tell me their stories for the first time just as a client in my office would do. It actually works to my advantage and to theirs that I’m painfully uncool. I’m hearing people’s stories on a daily basis so that’s like a reality show and I don’t crave that in my personal life as a way of decompressing from the day.\n\nI recommend watching Tiffany Pollard, AKA “New York,” after you watch Ronnie Ortiz-Magro in Jersey Shore.\n\nI will get right on that, Shira!\n\nWhat is most surprising to the cast about you, their therapist?\n\nSo, I think in Season 1, it was that I’m a lesbian because I don’t scream it and I can ‘pass,’ but in general, they are surprised I am who I purport to be. The greatest compliment is from my own clients (in my NYC practice) when they say ‘you’re exactly the same on the show as you are in the room.’ The connections that I make with the cast are sincere and last after the season wraps. I was just on the phone with Aubrey O’Day (from Season 1) last night and that happens a lot with those who were on the show. I haven’t seen Aubrey in person in over a year, but if any of them reach out, it’s consistent. I don’t know how to be somebody else. In the media world particularly there are people who put on a persona for TV that they don’t actually live. Cast mates are surprised that the connections they make with me are authentic and not TV relationships. We grow roots that flourish over time.\n\nBecause a member of my own family was once on a popular reality show, I always wonder how authentic the group therapy experience on Famously Single is. Are you ever asked to start again to get a more emotional reaction from a cast member, a ‘take 2’ for a better shot?\n\nI have never been asked to repeat a line or to ask a cast mate to emote more and I never would. Here’s the thing: The stories I’m getting are hard for people to tell me. I would never ask twice because we need a different angle. What you get is what it is. My priority is always to be fair to ‘my kids’ as I think of them. I don’t exploit them. I think that particularly with the cast from Season 1, they have already been through the ringer on other shows and were scared coming in. I was an unknown entity and they were pleasantly surprised and continue to talk about it today. They weren’t typecast and I can’t believe that in the unscripted world people are literally performing roles, that people remark on how real our experience was. I never asked to play a role and put on a persona that’s reassuring to me. It’s horrifying to me that they would ever go through that on another show. You don’t have to create anything with our show. You just leave people alone in a house, take some distractions away (limit cell phone usage) and see what happens.\n\nGoing back to Season 1, how did this opportunity come to you?\n\nI get asked that all the time. People think you’re this overnight sensation, but I had a relationship with E! It’s perfect that they planted the seed in me years ago when I came to New York and someone from E! contacted me to explore the conversation of ‘have you ever been on television?’ I hadn’t, but then spent the next 7 years with the thought and ultimately, I really wanted to do this thing that I do in my office - these are teachable skills and I love to teach and examine how people absorb information, break down concepts and deliver those concepts in a way that works for each individual. if we were all taught these skills, the divorce rate would be lower and there would be less anxiety and depression. No matter what the presenting issue is in therapy, it always boils down to a relationship issue, so my desire to be on TV was fueled by a greater desire to serve and teach people on a larger platform.\n\nTo some viewers, there are cast mates - this season, in particular, it’s David McIntosh (a fitness model who ‘loves women’ and has LOTS of personality) and Calum Best (a British personality who was also on Season 1) - who don’t necessarily appear ready for committed relationships because there seems to be maturing to do.\n\nYou can only teach when people are ready. We’re speaking to what people see on TV. I’m not going to spoil it for anybody, but Calum has been learning a ton and this is a process in which people need to hear something repeatedly. Then they need to walk away, sit with it, come away with deeper thoughts about it and the dialogue continues. It’s too simplistic to look at what David and Calum look like today and think they’re clearly not ready for it. Calum is much more ready today than when I met him 2 years ago. Who among us doesn’t repeat mistakes? I would have a much more rapid turnaround with clients if I gave answers and they were able to take actions immediately. The reality is that most people stumble and with the cast, that gets caught on camera.\n\nYou see what happens while you’re counseling but you don’t see everything when you’re not around. What has been most surprising to you about this process and now, watching the show?\n\nIt’s a therapist’s dream because when a cast member’s memory conveniently or otherwise doesn’t coincide with what a producer has told me: I can simply say ‘let’s go to the tape and see what happened.’ Afterwards, I get to be quiet and say ‘so help me with the disconnect.’ I can do that if I want to. I try not to though because, really, they don’t have cameras following them in their real lives. I want them to be able to take the work I did with them to their real lives. A good therapist knows how to ask the same question 5 different ways to hear inconsistencies. I’ve been told that I would make a good interrogator. It’s not the responsibility of the person I’m counseling to know what I’m searching for. It’s not their responsibility to respond with an answer I want to hear. If I feel a knot in my stomach, I know to keep going because I’ve had 22 years of practice. One thing that really surprised me was that Calum left for a period of time. I didn’t expect it. I was also surprised to see how emotive Ronnie is. I didn’t expect that from him maybe because he’s a boy from the Bronx. Does he present that way on Jersey Shore? You’ve seen more episodes than I have, but I’m on season 4 currently and I’m not seeing ‘emotive’ yet. Again, I’m glad I didn’t see the show before I worked with Ronnie but was really surprised to see that soft side to him.\n\nI LOVE Tiffany. What was your relationship with her like?\n\nTiffany and I were a slow burn. The way Tiffany presents herself is shocking at first and I was taken aback. However, today, I will tell you that SHE is the only member of the cast from Seasons 1 and 2 that has been in my home. Last month, we broke bread together and my wife loved her. She is an amazing human being. I like who Tiffany is when she is not armored up in the persona of ‘New York.’ I love Tiffany when she is vulnerable and...I don’t want to say ‘real’ because i think New York is real. You are seeing a part of her on the show and there are other parts. I read in your email contacting Famously Single that Tiffany and Brandi really did it for you. I think that’s because they’re both very maternal. I love Brandi also. I think Brandi was misunderstood on her other show (Real Housewives of Beverly Hills). The Brandi that you saw on Famously Single Season 1 didn’t get the air time on her other shows to convey more of her personality. I spoke to Brandi two weeks ago and I’m super tight with the entire cast - I should say, I’m tight with the girls. The boys just don’t reach out as much. But I was pretty close to Ronnie and spoke to him as recently as he and cast mate Malika (Haqq) were still together - when they wrapped filming (right before Thanksgiving).\n\nI was surprised you suggested Sammi (from Jersey Shore) come to the house so Ronnie could get closure on that past, long and complicated relationship.\n\nNow that I’m watching Jersey Shore, I stand by this a million percent. At the time, I didn’t understand their dynamic and I knew that it was unfinished business. It behooves you to bring that to closure in a dignified way, not the way conflict is resolved on other shows, but with respect. Relationships should end with the same respect and thoughtfulness they begin with. You don’t start another relationship when your heart is unavailable and I made that suggestion in protection of Malika. I didn’t want to see her turn into a rebound. That suggestion was done to service all three of them. If that had happened in my office with dignity and respect, no one would have been hurt. It would have been a completely healing experience. I respect Ronnie’s decision to not go there because it was too painful for him. At the same time, if it’s so painful that you can’t do it, then that tells you that you need to do it.\n\nDo you feel the cast left the house with the relationship advice that will impact their lives so they can enter into positive relationships?\n\nI hope I wet their appetites for learning the skills. I’m a good therapist but not that good that after 16 days everything would be fixed. My intention is to intrigue them and introduce them to the world of personal development, therapy and most importantly, relationship skills. The goal is that they continue the work in the real world when we wrap and leave the house. I realize, yes it’s 2017 and we have very strong personalities, but relationship skills are universal and haven’t changed over time. They need to be taught from a very early age and it’s really unfortunate that our society doesn’t do that and we then scratch our heads and wonder why the divorce rate is at 50 percent. My wife and I teach relationship skills in our practice and my hope is that the cast and most importantly, the viewers, learn that we all need these skills. I have gifted our course to people just getting married and still in the honeymoon phase. The idea is to get the skills before you’ve got the problem.\n\nFamously Single airs Sundays at 10 PM on E! To find out more about Dr. Darcy Sterling’s work, go to: https://relationshipskillsbootcamp.com/", "images": ["https://img.huffingtonpost.com/asset/5a1c8c21140000270050f758.jpg?ops=100_100", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=1778_1000", "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=scalefit_820_noupscale", "https://img.huffingtonpost.com/asset/59865556150000335d8b542d.jpg?ops=scalefit_820_noupscale", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=1778_1000", "keywords": [], "authors": ["Writer", "Blogger", "Regular Contributor To Local Newpapers In Bergen County", "Beauty Blogger", "Reality Tv Philosopher", "Stay Tuned For My Thesis"], "canonical_link": "https://www.huffpost.com/entry/interview-with-dr-darcy-sterling-of-es-famously_b_5986052be4b00833d1de287b", "title": "Interview with Dr. Darcy Sterling of E!'s Famously Single", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "Slurp": "noindex", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "I fell in love with E!’s Famously Single when its initial season debuted last year. The premise is that “famous” people (some you may be unfamiliar with,...", "og": {"title": "Interview with Dr. Darcy Sterling of E!'s Famously Single", "type": "blog", "image": {"identifier": "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/interview-with-dr-darcy-sterling-of-es-famously_b_5986052be4b00833d1de287b", "site_name": "HuffPost", "locale": "en_US", "description": "I fell in love with E!’s Famously Single when its initial season debuted last year. The premise is that “famous” people (some you may be unfamiliar with,..."}, "article": {"section": "Contributor", "published_time": "2017-08-05 19:49:28 -0400", "modified_time": "2017-08-08 23:08:23 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostBlog", "title": "Interview with Dr. Darcy Sterling of E!'s Famously Single", "image": {"identifier": "https://img.huffingtonpost.com/asset/598656e622000046001a4a31.jpg?ops=1778_1000", "width": 1778, "height": 1000}, "description": "I fell in love with E!’s Famously Single when its initial season debuted last year. The premise is that “famous” people (some you may be unfamiliar with,...", "creator": "ShiraWeiss"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5986052be4b00833d1de287b", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "contributor"}, "movies": [], "publish_date": 1501976968.0, "source": "https://www.huffingtonpost.com", "summary": ""}