{"url": "http://sandrarose.com/2017/12/meghan-markle-still-los-angeles-keeps-touch-prince-harry/", "text": "Meghan Markle is STILL in Los Angeles; How She ‘Keeps in Touch’ with Prince Harry\n\nPrince Harry's fiancée Meghan Markle is still in Los Angeles -- 5,400 miles away from her prince charming. Oddly, Meghan hopped a flight to Los Angeles a day after she made her first public appearance on Harry's arm since they announced their unlikely engagement.\n\nTongues were wagging in London when Meghan jetted to L.A. to visit her mom, Doria Ragland, for two weeks. Many Brits say it is highly inappropriate for a newly-engaged woman to suddenly abandon her fiancé and fly to another continent 5,000 miles away.\n\nBrits say Meghan tricked poor lovestruck Harry into proposing to her by promising she would move to London. She even shipped one of her rescue dogs to London just to show him she was serious.\n\nRelationship experts say women like Meghan, who are products of divorced parents, are damaged goods who show more ambivalence and tend to keep their significant others at arms length.\n\nThe 36-year-old American actress hardly saw Prince Harry in the year that they dated.\n\nShe lived in Toronto and they saw each other a handful of times in between his royal duties in London.\n\nShe also lived apart from her first husband, Trevor Engelson, before dumping him for a celebrity chef in Toronto.\n\nBut Prince Harry isn't in need of companionship while she's away. He invited his ex-girlfriend Cressida Bonas to a holiday concert at St. Luke's Church in London on Tuesday.\n\nA source tells E! News that both Harry and Meghan are \"big texters\" and that Harry loves to use an emoji or gif. They also FaceTime \"every day when they're apart\" and FaceTime is said to have \"played a huge role in their relationship.\"\n\nThe source says Meghan will fly back to London in time for Christmas -- which is 3 weeks away.\n\nMeghan's trip triggered intense debate on Sandrarose.com with some readers arguing that she had every right to \"take sone free time\". But others noted that she could have flown her mom to London for a visit.\n\nPhotos by WENN.com, Getty Images", "images": ["http://sandrarose.com/wp-content/uploads/2017/12/Prince-Harry-Meghan-Markle-wenn33420311.jpg?x56219", "http://sandrarose.com/wp-content/uploads/2020/04/wrestler-120x120.jpg?x56219", "http://sandrarose.com/wp-content/uploads/2017/12/Meghan-Markle-Prince-Harry-1-GettyImages.jpg?x56219", "http://sandrarose.com/wp-content/uploads/2020/04/cashmoney-120x120.jpg?x56219", "http://sandrarose.com/wp-content/uploads/2020/04/gwhitmer-120x120.jpg?x56219", "http://sandrarose.com/2017/12/meghan-markle-still-los-angeles-keeps-touch-prince-harry/favicon.ico"], "top_img": "http://sandrarose.com/2017/12/meghan-markle-still-los-angeles-keeps-touch-prince-harry/favicon.ico", "keywords": [], "authors": ["Julia Lyons", "Wutizagranny", "Desiree Edwards", "Malcom Flex", "Davine Puddin"], "canonical_link": "http://sandrarose.com/2017/12/meghan-markle-still-los-angeles-keeps-touch-prince-harry/", "title": "Meghan Markle is STILL in Los Angeles; How She ‘Keeps in Touch’ with Prince Harry", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://sandrarose.com", "summary": ""}