{"url": "en.wikipedia.org/wiki/Megyn_Kelly", "text": "American journalist\n\nMegyn Marie Kelly (born November 18, 1970)[4] is an American journalist and attorney who was a news anchor at Fox News from 2004 to 2017, and a talk show host and correspondent with NBC News from 2017 to 2018. She currently posts to her Instagram page and YouTube channel.[5]\n\nDuring her time at Fox News, Kelly hosted America Live, and before that, co-hosted America's Newsroom with Bill Hemmer. From 2007 to 2012, the two reporters hosted Fox News Channel's New Year's Eve specials. Kelly also hosted The Kelly File from October 2013 to January 2017. In 2014, she was included in the TIME list of the 100 most influential people.[6] Kelly left Fox News in January 2017 and joined NBC News. She started hosting the third hour of the morning show Today with her program titled Megyn Kelly Today in September 2017. The show was cancelled on October 26, 2018, and she left the network in January 2019.\n\nEarly life [ edit ]\n\nKelly was born in Champaign, Illinois,[7][8] to Edward Kelly, who taught at the State University of New York at Albany, and Linda (née DeMaio), a homemaker.[9] She is of Italian and German descent on her mother's side and Irish descent on her father's.[9] She was raised Catholic.[10] Her father died of a heart attack when she was 15 years old.[11]\n\nKelly attended Tecumseh Elementary School in suburban Syracuse, New York. When she was 9, her family moved to Delmar, New York, a suburb of Albany,[12][8] where she attended Bethlehem Central High School.[13] She obtained an undergraduate degree in political science from the Maxwell School of Citizenship and Public Affairs at Syracuse University in 1992[9] and earned a J.D. from Albany Law School in 1995.[14]\n\nKelly was an associate in the Chicago office of law firm Bickel & Brewer LLP. In fall 1996, she co-wrote an article for the American Bar Association's journal, Litigation, \"The Conflicting Roles of Lawyer as Director\".[15] She later worked at Jones Day for nine years, where one of her clients was the credit bureau Experian.[16]\n\nTelevision career [ edit ]\n\nEarly career [ edit ]\n\nIn 2003, Kelly moved to Washington, D.C., where she was hired by the ABC affiliate WJLA-TV as a general assignment reporter.[11] She covered national and local events, including live coverage of the confirmation hearings for U.S. Supreme Court Justice Samuel A. Alito, Jr. and Chief Justice John G. Roberts; the retirement of Justice Sandra Day O'Connor; the death of Chief Justice William Rehnquist; and the 2004 presidential election.[17] CNN president Jonathan Klein later said he regretted not hiring Kelly as a reporter at the beginning of her career, as she was \"the one talent you'd want to have from somewhere else\".[18]\n\nFox News [ edit ]\n\nIn 2004, Kelly applied for a job at Fox News.[17] She contributed legal segments for Special Report with Brit Hume and hosted her own legal segment, Kelly's Court, during Weekend Live. She appeared on a weekly segment on The O'Reilly Factor and occasionally filled in for Greta Van Susteren on On the Record, where most of her reporting focused on legal and political matters. She occasionally contributed as an anchor, but more often as a substitute anchor on weekends.[19] On February 1, 2010, Kelly began hosting her own two-hour afternoon show, America Live, which replaced The Live Desk.[20][21] She was a guest panelist on Fox News' late-night satire program Red Eye w/ Greg Gutfeld. In 2010, viewership for America Live increased by 20%, averaging 1,293,000 viewers, and increased by 4% in the 25–54 age demographic, averaging 268,000 viewers.[22] In December 2010, Kelly hosted a New Year's Eve special with Bill Hemmer.[23]\n\nKelly received media attention for her coverage of the results of the 2012 United States presidential election. On November 6, 2012 (the night of the election), Fox News' decision desk projected that Obama would win a second term after part of the results had been released. In response to Karl Rove's opposition to this projection, Kelly walked backstage to the decision desk on camera and spoke with them, and also asked Rove, \"Is this just math that you do as a Republican to make yourself feel better? Or is this real?\"[24][25][26][27]\n\nKelly left America Live in July 2013, and took maternity leave. On October 7, 2013, she began hosting a new nightly program, The Kelly File.[28][29] The Kelly File was occasionally the channel's ratings leader, topping The O'Reilly Factor.[30][31]\n\nIn December 2013, Kelly commented on a Slate on The Kelly File: \"For all you kids watching at home, Santa just is white, but this person is just arguing that maybe we should also have a black Santa,\" adding, \"But Santa is what he is, and just so you know, we're just debating this because someone wrote about it.\" Kelly also said that Jesus was a white man later in the segment.[32] Soon after, Jon Stewart,[33] Stephen Colbert,[34] Rachel Maddow,[35] Josh Barro,[36] and others satirized her remarks.[37] Two days later, she said on the air that her original comments were \"tongue-in-cheek\",[38][39][40][41][42] and that the skin color of Jesus is \"far from settled\".[43]\n\nIn June 2015, Kelly interviewed Jim Bob Duggar and Michelle Duggar of 19 Kids and Counting regarding their son Josh Duggar's alleged molestation of five girls in 2002. She later interviewed two of their daughters, Jill and Jessa. This show's Nielsen national estimates ratings of 3.09 million viewers, above its average 2.11 million, ranked with the 3.2 million for the Malaysia Airlines Flight 17 coverage and 7.3 million for the Ferguson riots coverage.[44]\n\nIn the Republican Party presidential debate on August 6, 2015, Kelly asked then-presidential candidate Donald Trump whether a man of his temperament ought to be elected president, noting that he has called various women insulting names in the past.[45] Kelly's moderating generated a range of media and political reactions and her professionalism was criticized by presidential candidate Trump.[46][47][48][49] Kelly responded to Trump's criticism by saying she would not \"apologize for doing good journalism\".[50] Trump declined to attend the Iowa January 28 debate that she moderated.[51] After the debate and off-camera, Ted Cruz said that Kelly had referred to Trump off-camera as \"Voldemort\", though Fox News denied it.[52] Bill Maher complimented Kelly as being \"so much better\" than the candidates who attended the January 28 debate and argued that she was a more viable candidate for the Republican nomination.[53] In an interview with CBS News Sunday Morning, Kelly reflected that she was disappointed with the lack of support she received from coworker Bill O'Reilly and CNN, the latter airing a Trump event the same time as the debate.[54][55] In April, at her request,[56] Kelly met with Trump at Trump Tower, having \"a chance to clear the air\".[57] The following month, after interviewing Trump and being met with mixed reception,[58] she expressed interest in doing another one with him.[59] In June, she criticized Trump for his claims against Gonzalo P. Curiel's impartiality.[60] In October, a contentious discussion between Kelly and Newt Gingrich on The Kelly File regarding Trump's sexual comments in a 2005 audio recording gained widespread social media reaction.[61]\n\nIn March 2016, it was announced that Kelly would host a one-hour prime time special on the Fox network, wherein she would interview celebrities from the worlds of \"politics, entertainment, and other areas of human interest\".[62] The special aired in May 2016, which is a sweeps month.[63] It acquired 4.8 million viewers, but came in third place in ratings.[64][65] Gabriel Sherman wrote of the stakes for Kelly as \"high\", elaborating that with Kelly being in the final year of her contract with Fox and having confirmed her ambitions, \"The special was essentially a public interview for her next job.\"[66] In July 2016, amid allegations of sexual harassment on the part of Fox News CEO Roger Ailes, Kelly was reported to have confirmed that she herself was also subjected to his harassment.[67][68] Two days after the report, Ailes resigned from Fox News and his lawyer, Susan Estrich, publicly denied the charge.[69] During her coverage of the 2016 Republican National Convention, her attire received criticism.[70] In a defense of Kelly, Jenavieve Hatch of The Huffington Post commented, \"If you're a woman on national television reporting on a political event from hot, humid Cleveland, wearing a weather-appropriate outfit makes you the target of an endless stream of sexist commentary.\"[71] In September, it was reported that Kelly would be collaborating with Michael De Luca to produce Embeds, a scripted comedy about reporters covering politics, to be aired on a streaming service.[72][73] Kelly appeared on the cover of the February 2016 issue of Vanity Fair.[74] In 2016, she was an honoree for Variety's Power of Women for her addressing child abuse.[75]\n\nNBC News [ edit ]\n\nMegyn Kelly with Russian President Vladimir Putin , June 2017\n\nIn late 2016, Kelly was alleged to be actively considering other news networks aside from Fox News, since her contract was months away from expiring.[76][77] In January 2017, The New York Times reported that she would leave Fox News for a \"triple role\" at NBC News in which she would anchor and host her own daytime program and in-depth Sunday night news show, along with taking part in the network's political and major news event coverage.[78][79] She departed Fox News on January 6, 2017, after the last episode of The Kelly File was aired.[80][81] In January 2017, People quoted an unspecified source that Kelly remained under a non-compete clause with Fox until July 2017 which would prevent her from working for a competitor until the clause expires or is canceled.[82]\n\nOn June 2, 2017, Kelly interviewed Russian president Vladimir Putin, first in a panel discussion she moderated at the St. Petersburg International Economic Forum and later in a one-on-one interview for the premiere episode of NBC's Sunday Night with Megyn Kelly, which aired June 4, 2017.[83][84][85] Kelly's daytime talk show, Megyn Kelly Today, premiered in September 2017.[86][87][88][89]\n\nKelly was being paid reportedly between $15 million and $20 million a year at NBC.[90] After an initial run of eight episodes in the summer of 2017, NBC decided to bring her newsmagazine show Sunday Night with Megyn Kelly back for summer 2018 after a hiatus for football and the Winter Olympics, but only periodically. However, this return never materialized.[91][92] Instead, Kelly continued to report stories for Dateline NBC during the summer of 2018, continuing her work for the show which she joined in 2017.[93]\n\nOn October 23, 2018, Kelly was criticized for on-air remarks she made on Megyn Kelly Today surrounding the appropriateness of blackface as part of Halloween costumes. She recollected that \"when I was a kid, that was okay as long as you were dressing up as like a character\", and defended Luann de Lesseps's use of blackface to portray Diana Ross. Later that day, Kelly issued an internal email apologizing for the remarks.[94] On October 26, 2018, NBC canceled Megyn Kelly Today.[95] It had been reported that Kelly was considering ending the program to focus on her role as a correspondent.[96] Her contract was terminated January 11, 2019, with Kelly due the entire amount from the contract. She was reportedly not subject to any non-compete clause under her NBC contract.[97][98][99]\n\nPost NBC [ edit ]\n\nOn January 11, 2019, Kelly announced she would be back on television that year without providing details.[100]\n\nWriting [ edit ]\n\nIn February 2016, Kelly signed an agreement with HarperCollins to write an autobiography scheduled for release later that year, in a deal worth more than $10 million.[101][102][103] The book, titled Settle for More, was released on November 15, 2016.[104][105]\n\nAccolades [ edit ]\n\nIn 2009, Kelly received an award from Childhelp for her work as a Fox News anchor covering the subject of child abuse. [106]\n\nKelly was honored with an Alumni Achievement Award from the Albany Law School in 2010 for her 15th class reunion. [107]\n\nShe was included in the 2014 Time list of the 100 most influential people. [108]\n\nlist of the 100 most influential people. On September 26, 2015, Kelly was inducted into the Hall of Fame at Bethlehem Central High School, her alma mater.[109]\n\nIn popular culture [ edit ]\n\nBombshell, a film portraying Kelly's career at Fox News, was released on December 13, 2019. Kelly is played by Charlize Theron, with other cast members including Margot Robbie as Kayla Pospisil (a composite character), Nicole Kidman as Gretchen Carlson, and John Lithgow as Roger Ailes. The film follows events at Fox News in the run-up to Ailes resigning from the organization.[110]\n\nPersonal life [ edit ]\n\nKelly married Daniel Kendall, an anesthesiologist, in 2001. The marriage ended in divorce in 2006.[111] In 2008, she married Douglas Brunt, who was then president and CEO of the cybersecurity firm Authentium,[112] and who became a full-time writer and novelist.[113] They have three children, son Yates (b. 2009),[114] daughter Yardley (b. 2011),[114][115] and son Thatcher (b. 2013).[116]\n\nPolitically, Kelly identifies as an independent, and told Variety in 2015 that she has voted for both Democrats and Republicans.[117]\n\nOn October 12, 2016, Kelly stated in a segment on her show with Fox News commentator Julie Roginsky that she is a lifelong Catholic.[118]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Megyn_Kelly_in_2012.jpg/220px-Megyn_Kelly_in_2012.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/0/01/A_coloured_voting_box.svg/30px-A_coloured_voting_box.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/29px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/25px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Vladimir_Putin_and_Megyn_Kelly_03.jpg/220px-Vladimir_Putin_and_Megyn_Kelly_03.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/30px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Megyn_Kelly_%282018-03-01%29_%28cropped%29.jpg/220px-Megyn_Kelly_%282018-03-01%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/d/dd/Megyn_Kelly_%282018-03-01%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Prime_Minister_Narendra_Modi_speaks_with_Russian_President_Vladimir_Putin%2C_Austrian_Federal_Chancellor_Christian_Kern%2C_and_Moldovan_President_Igor_Dodon_on_the_sidelines_of_the_St_Petersburg_International_Economic_Forum.jpg/220px-thumbnail.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Megyn_Kelly_%282018-03-01%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Megyn_Kelly", "title": "Megyn Kelly", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Megyn_Kelly_%282018-03-01%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}