{"url": "https://www.wellandgood.com/good-advice/fall-2017-career-horoscopes/", "text": "2/6 To thrive in your work, look to the stars for guidance, says Jennifer Racioppi, an astrologer and career coach. Her celestially minded advice can help you identify opportunities to forge ahead (or hold back!) and achieve success, however you define it. Here, in the first of a quarterly series of career-focused astrology forecasts for Well+Good, Racioppi reveals how you can harness the power of planetary movement—and wrap up 2017 on a stellar note. These days, professional women are expected to have it all: fantastic health, thriving relationships, career clarity, remarkable talent, an almost intangible combination of grace and grit. This high bar sometimes feels less like encouragement and more like crushing pressure, especially if expectations lead to overwhelming stress and burnout. Thankfully, in modern times of spiritual curiosity, the ancient wisdom of astrology provides a much-needed road map on the path to achieving purpose-driven success (despite the insane expectations). Definitions of achievement might involve climbing to the top of the corporate ladder, managing a business created from the ground up, or anything in between. It can feel overwhelming to figure out what you want to do, and once you know your goals, executing them can feel even more daunting—especially when you don’t have astrological knowledge on your side. Now’s the time to tune into astrology to help strategize your success. Astrology contains practical how-tos on managing time and relationships, living and leading from your strengths. It can also clarify murky topics such as life purpose and career direction. More than just entertainment, knowing and leveraging astrology provides ambitious, career-driven women with a competitive edge. You may just find it becomes your secret weapon to success. As the final quarter of 2017 commences, now’s the time to tune into astrology to help strategize your success, especially as night and day find their way into equal proportions this fall equinox. Curious what Q4 holds from an astrological perspective? Keep reading.\n\n3/6 SEPTEMBER September 20, 1:29 a.m. EDT\n\nNew moon, Virgo, 27 degrees This new moon crystallizes your desire to make a contribution and to know (and own) your purpose. Virgo represents precision and correlates with being pure of heart and devoted to service. With the moon, sun, Mercury, Mars, and Venus all in Virgo, it’s essential to stay focused on being of service; however, with five planets all traveling through Virgo, be careful of becoming overly practical and perfectionistic, too. Remain in touch with the causes that motivate you this new moon and evaluate how you want to give back to planet Earth. Chiron, who represents cosmic healing (and wounding) opposes this new moon. Dig deep, check in, and choose self-care that not only feels good—but also allows you to heal. Be extra kind to VIPs and subordinates alike. September 22 Thinking about asking for a raise? Now’s the time to strategize your next steps. Mercury, the planet that rules communication, makes a luscious angle of support to powerhouse Pluto. Use this supportive astrological aspect to think through your ideas and get your plan together. September 27 Innovation and swift change abound while good-luck Jupiter opposes revolutionary Uranus for the third and final time. Since late December of 2016, Jupiter in Libra has traveled opposite of Uranus in Aries, inspiring radical action on behalf of change. This might not have always felt easy, to say the least! This last transit between these two titans of the sky asks you to release that which isn’t working so you can own your independence in a whole new way. Leaders and entrepreneurs, this transit will help you set yourself apart. Let go of what’s not working so you can step into leadership in a whole new way. September 28 After turning retrograde on April 20, Pluto—the planet of transformation, rebirth, and shadows—stations direct on September 28. If you feel a sudden burst of energy to bust through blocks and address issues in your career you’d otherwise turn a blind eye to, the tiny but mighty dwarf planet may be to blame. Take a stand for your mission, but don’t get sucked into office politics. Stay in your power, but do not power trip.\n\n4/6 OCTOBER October 1 October kicks off with Mars supporting you to move forward with your goals, making an ideal angle to Pluto and putting you in the power seat. Clear the decks for Sunday, October 1, as you’ll want to use this Sunday to take good care of you. Use this day to strategize your goals for the month. October 5, 2:40 p.m. EDT\n\nFull harvest moon, Aries, 13 degrees An Aries full moon brings cardinal fire energy, suggesting you may have power fit to burst, highlighting leadership capacities. It’s time to delegate—and delegate intelligently. How can you share responsibilities with others more, and celebrate their wins? This moon in Aries brings to light the dichotomy of me (moon in Aries) vs. we (sun in Libra). With powerhouse Pluto squaring (making an awkward angle) to the sun and moon at this time, it’s essential to look at your shadow, especially because you don’t want it to hold you back in the office. Where does control hold you back from having stronger work relationships, and where does the disease to please push you forward for the wrong reasons? Checking in with your subconscious opens you to experience more freedom and lead from your strengths, which is something you’ll want to take advantage of with the full moon in Aries! Don’t let the energy stir in your body—use it productively by getting physical. Channel this force outside of the office in your sex life or at the gym. October 10 Jupiter, the planet of good luck, happiness, and abundance moves from Libra into Scorpio—signifying a significant shift in the cosmos. Jupiter, the largest planet of the solar system, takes about a year to run through a zodiac sign and will remain in Scorpio until November 8, 2018. This is great news for Scorpio suns, moons, and rising signs, as Jupiter’s support brings incredible strength to your work. It’s time to rise and get noticed. No matter your astrological sign, though, Jupiter traveling through Scorpio for the next year helps you access managerial instincts as you commit to being your absolute best in business. It also encourages getting in touch with your sexuality and using your feminine power to fuel your professional life. After all, orgasms and oxytocin are incredible resilience boosters! Also, depth psychology (which focuses on subtle and unconscious levels of your psyche) or esoteric healing arts will go a long way while Jupiter travels through Scorpio for the next 13 months. October 18 Mercury, the planet of communication, meets up with Jupiter, making this an ideal day to ink a deal. If you have new work to debut, use the prowess of Mercury and Jupiter together to think through your very best launch strategy. Making a big pitch? Tee up your emails. Mercury and Jupiter together signify good ideas and the ability to communicate your needs persuasively. Think, write, promote. October 19, 3:11 p.m. EDT\n\nNew moon, Libra, 27 degrees If you are managing a team or hiring, use this new moon to clarify your desires and set intentions for positive work relationships. Libra represents relationships and a drive toward balance, harmony, and justice. You may need to release something (or someone) that’s not serving you, or it may be time to face the fear of addressing issues that currently exist in team dynamics. Uranus—the planet of change, breakthrough, and surprises—directly opposes the moon and sun in Libra, suggesting that you need to expect the unexpected this new moon (and potentially even throughout this entire lunar cycle, until the upcoming new moon in Scorpio on November 18). However, with Jupiter the planet of luck and abundance on your side, you can still expect to feel gains. Venus in Libra supports matters of the heart tremendously; stay true to you (and your values.) Libra also correlates with fashion and beauty, so assess your wardrobe and ask yourself, “Am I dressing for the career I want?” October 22 The sun enters Scorpio, and the next two weeks offer some potent potential to get ahead. Bring your A-game to work. October 26 Many astrologers call today the luckiest day of the year, so use it to your advantage. Jupiter and the sun conjoin, meaning that the influence of good luck massively infuses this day. Schedule an important meeting. Launch a major project. Present. Pitch. Projects started today are blessed by the auspices of the stars. Now’s the time. Go!\n\n5/6 NOVEMBER November 4, 1:22 a.m. EDT\n\nFull beaver moon, Taurus, 11 degrees This full moon screams magic, so this won’t be your average Monday! With the full moon in Taurus—a sign that traditionally resists change—you can settle into your body and feminine spirit, nurturing yourself with honesty and grace (as well as sexually)! Remember, self-care and health are critical for high-performance lifestyles. Now’s the time to let intuition lead you forward in your career. This full moon calls you into spirituality, readying you to make the most of some game-changing career aspects coming in the next couple of weeks. With Neptune (the planet that represents your spiritual expansion) positively supporting this full moon, your intuitive capacities become expanded and illuminate. Jupiter in Scorpio swoops in, supporting you to treat yourself with love and honesty. Use it to get centered and become aware of what you need to do to launch and lead without frying yourself to a crisp. November 11 Innovative breakthrough abounds. Since late 2016, Saturn—the planet that rules structure and discipline—has traveled in an auspicious angle to Uranus, the planet of revolution. Today, these two planets make their third and final trine. Unleash innovative ideas and take a risk on behalf of your dreams. November 13 Venus, the ruler of love and beauty, meets up with auspicious, lucky Jupiter. As these two benefic planets merge and send blessings, you are poised to make major gains—especially when it comes to revenue-generating activities. Though this isn’t the best day to sign a contract (Mercury, the planet of communication makes a hard and confusing angle to Neptune, the planet of illusion), creativity abounds. Channel it toward finding ways to deliver more value for those you work for. If you are an entrepreneur, think about ways you can enhance your services. Last but not least, now’s the time to work on image, wardrobe, and branding. How do you want to present yourself professionally? November 18, 6:42 a.m. EST\n\nNew moon, Scorpio, 26 degrees This new moon in Scorpio ushers in the winds of change. Scorpio challenges you to go deep, access your truth, and transform. Not only are the sun and the moon aligned in this sign, but Jupiter and Venus (very close together) have also formed an auspicious conjunction just a few days prior, and they leave an afterglow! With Jupiter making a favorable angle to Neptune, you can expect support. Yet, with Mars squaring Pluto (Scorpio’s ruler), a power struggle may present itself. True to Scorpio’s spirit, the dark becomes illuminated during this moon phase. Use it to deepen your business acumen by sharpening your perception, which will allow you to turn up the volume on your intuition even more. Self-nurture and stay true to yourself. November 19 Going into work on Monday may feel tense. Mars, the planet of action, in Libra makes a challenging and hard angle to powerhouse Pluto in Capricorn. This is not the time to push your agenda forward. Own your power without power-tripping. Practice meditation. Bide your time; the holiday is right around the corner. Focus on gratitude instead. November 21 The sun enters freedom-loving Sagittarius. As the holiday season comes into full effect, let yourself soak up the inspirational effect of positive Sag. Practice gratitude for all that you’ve created and embrace the giving spirit.", "images": ["https://www.wellandgood.com/wp-content/uploads/2019/07/plant-paradox-diet-getty-HoxtonTom-Merton-600x400.jpg", "https://www.wellandgood.com/wp-content/uploads/2017/09/robson-hatsukami-morgan-296510.jpg", "https://www.wellandgood.com/wp-content/uploads/2019/04/WG-Plusfactor-Cookbook-April-150x150.png", "https://www.wellandgood.com/wp-content/themes/wellgood-2016/assets/img/spacer.gif", "https://www.wellandgood.com/wp-content/uploads/2020/04/GettyImages-1192882801-sized.jpg", "https://www.wellandgood.com/wp-content/uploads/2020/04/1753-Estee-CCA-Branded-Feature-1400px-v2.jpg", "https://www.wellandgood.com/wp-content/uploads/2019/07/lentil-balls-vegan-snack-attack-607x400.jpg", "https://www.wellandgood.com/wp-content/uploads/2019/07/MitoQ_CCA3_Branded-Feature-1400px-2-609x400.jpg", "https://www.wellandgood.com/wp-content/uploads/2019/07/GettyImages-455115875-599x400.jpg", "https://www.wellandgood.com/wp-content/uploads/2019/08/Stocksy_txp8d0248cbaYQ200_Small_1389457-forgot-my-bra-600x400.jpg", "https://www.wellandgood.com/wp-content/uploads/2020/03/1709-Kroger_CWU2-Feature_1400px.jpg", "https://www.wellandgood.com/wp-content/themes/wellgood-2016/assets/img/made-in-ny.png", "https://www.wellandgood.com/wp-content/uploads/2017/10/jennifer-racioppi-headshot-crop-150x150.jpg"], "top_img": "https://www.wellandgood.com/wp-content/uploads/2017/09/robson-hatsukami-morgan-296510.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wellandgood.com/good-advice/fall-2017-career-horoscopes/", "title": "Fall 2017 horoscopes for career and success", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=2", "msapplication-TileImage": "https://www.wellandgood.com/wp-content/uploads/2018/04/favicon-194x194.png", "msapplication-TileColor": "#da532c", "theme-color": "#ffffff", "fb": {"pages": 91915774693}, "twitter": {"card": "summary_large_image", "creator": "@JennRacioppi", "site": "@iamwellandgood", "title": "Fall 2017 horoscopes for career and success | Well+Good", "description": "Here's your Q4 guide to the cosmos, Including the *luckiest* day of the year—and the times when you'll have extra-powerful mojo at the office.", "image": "https://www.wellandgood.com/wp-content/uploads/2017/09/robson-hatsukami-morgan-296510.jpg"}, "description": "Here's your Q4 guide to the cosmos, Including the *luckiest* day of the year—and the times when you'll have extra-powerful mojo at the office.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Fall 2017 horoscopes for career and success | Well+Good", "description": "Here's your Q4 guide to the cosmos, Including the *luckiest* day of the year—and the times when you'll have extra-powerful mojo at the office.", "url": "https://www.wellandgood.com/good-advice/fall-2017-career-horoscopes/", "site_name": "Well+Good", "updated_time": "2020-01-24T09:11:01+00:00", "image": {"identifier": "https://www.wellandgood.com/wp-content/uploads/2017/09/robson-hatsukami-morgan-296510.jpg", "secure_url": "https://www.wellandgood.com/wp-content/uploads/2017/09/robson-hatsukami-morgan-296510.jpg"}}, "article": {"publisher": "https://www.facebook.com/iamwellandgood", "tag": "Career Advice", "section": "Good Advice", "published_time": "2017-09-22T13:39:10+00:00", "modified_time": "2020-01-24T09:11:01+00:00"}, "generator": "WordPress 5.3.2", "pocket-site-verification": "e5ab52bbadc2281f4803a907a07a48"}, "movies": [], "publish_date": 1506087550.0, "source": "https://www.wellandgood.com", "summary": ""}