{"url": "https://en.wikipedia.org/wiki/A-Teens", "text": "A-Teens[1] (stylized as A★TEENS or A*Teens) were a Swedish pop music group[2] from Stockholm, Sweden, formed by Niklas Berg in 1998 originally as an ABBA tribute band called ABBA-Teens and was later renamed A-Teens. The band members were Marie Serneholt, Amit Sebastian Paul, Dhani Lennevald and Sara Lumholdt. The band's debut album became a success around the world. In 2001, following their second album Teen Spirit, it was reported that the band had sold 2 million copies.[citation needed]\n\nAfter six years together, the band announced they would take a break in 2004 after the release of their Greatest Hits album. Each song from that album became a Top 20 hit in at least one country around the world.[3]\n\nHistory [ edit ]\n\nThe ABBA Generation (1999) [ edit ]\n\nThe original logo that the band used in their early days under the original name, ABBA-Teens\n\nIn 1998, Marie, Sara, Dhani, and Amit were musically united as the ABBA-Teens. However, the group's name was changed to the A-Teens to avoid litigation.[4] This choice allowed the band more freedom in creating their own style of music.\n\nThe official A-Teens logo\n\nIn early 1999, the band started the recording process of what would be their debut album, The ABBA Generation, consisting purely of ABBA covers reinterpreted with a modern pop and electronic flair to appeal to a new generation of young pop fans. Their first single, \"Mamma Mia\", topped the charts in over ten countries including their home country Sweden where it stayed at number one for eight consecutive weeks. The album hit the peak position in Sweden & Chile and became a top ten hit throughout the world. Further singles enjoyed similar success ensuring top ten placings across the globe, and the album overall sold more than 2 million copies worldwide,(Citation needed) being certified Gold or Platinum in over 22 different countries.\n\nThe band's music video for \"Dancing Queen\" features a plot very similar to the 1985 John Hughes film The Breakfast Club. In addition, the principal seen in the music video was played by Paul Gleason, the same actor who was the principal in the film. The single reached ninety-five on the Billboard Hot 100 and sold over 500,000 copies in the U.S. alone, being certified Gold.[citation needed]\n\nIn early 2000, the band embarked on a U.S. promotional tour, and on the verge of the release of their album in the United States, the band was invited to tour with Britney Spears that summer in her U.S. Tour. They also made several appearances on Disney and Nickelodeon to promote their music. The band's debut became a hit in North America, where the album reached seventy-one on the Billboard 200 Albums Chart being certified Gold in September 2000,[5] but its sales reached the million mark in 2001.\n\nThat month, the A-Teens won a Viva Music Award for Best International Newcomer, competing with the likes of Christina Aguilera and Blink-182,[6] and also the band announced what would be the lead single from their second album and their first to be an original song, \"Upside Down\", which would also become their signature song. The song was released to Swedish radios on 23 October 2000,[7] and was later unleashed worldwide. When the single was commercially released, it reached number two in Sweden and was later certified 2x Platinum.[8] The song became the band's biggest hit when it reached the top ten in several countries and when the single was released in the United States. The physical single reached number six on the Billboard Hot 100 Single Sales Chart,[9] selling over 500,000 copies in three weeks and being certified Gold.[10] In January 2001, the band was nominated for \"Best Swedish Group\" at the NRJ Awards.[11]\n\nTeen Spirit (2001) [ edit ]\n\nThe band's second album, entitled \"Teen Spirit\", featured a compilation of tracks that were not ABBA covers and when it was finally released on 26 February 2001, it debuted at number two in the Swedish Charts. This pop sensation hit reached the top ten in other countries and entered at number eighty-three on the World Charts,[12] number thirteen on the European Albums Chart,[13] number fourteen on CNN's WorldBeat Album Charts[14] and peaked at number fifty in the United States selling over 60,000 copies in its first two weeks,[15] ensuring Gold Status for sales exceeding the 500,000 copies in the United States alone.[16] Prior to the release of the album, the A-Teens became one of the first bands to broadcast one of their shows on MSN's Websites.[17]\n\nThe UK releases were delayed due to A-Teens' failure with their previous album in that country.[18] When \"Upside Down\" was released there in May 2001,[19] it became their biggest hit in the country.[20] The single peaked at number ten in the United Kingdom becoming their only top ten hit in that country.[21] The album was delayed and released after the second single, \"Halfway Around The World\" in late October 2001. The single barely made the top thirty and the album did not chart in the top 75.\n\nBefore they started their concert tour in the U.S. the band went to promote their album to Asia, with stops in Japan,[22] Singapore,[23] Malaysia where they did show for MTV Asia[24] and Thailand, with great success, especially in the former where Coca-Cola signed the band to become the face of the brand there and promote, \"We were the first international artists ever to appear on a soda can there. They printed 15 million of them; we went home with ten!\" Remembers Sara,[25] The cans were distributed around the country that year.[26] Also in 2001, the A-Teens performed as top billing during the Radio Disney Live! 2001 World Tour in Chicago and Philadelphia markets.\n\nThe group promoted their album with a forty-three-date tour with Aaron Carter around the U.S.[27] Back in Europe, the band toured with No Angels in Germany.[28][29] By the end of 2001, Teen Spirit went on to sell over 1 million copies worldwide and were invited by Walt Disney/Buena Vista to record the European soundtrack for the movie \"The Princess Diaries\". As the movie had already been released in North and South America, the movie was set to be released in Europe in the winter 2001. \"Heartbreak Lullaby\" a song written by Cathy Dennis (famous for writing Kylie Minogue's number one hit, \"Can't Get You Out of My Head\") and Kasmanaut, the video was shot in Germany in late October, in the middle of their tour.[30] The single was released in December 2001 and it became another top ten hit for the band in their home country spending four months inside the charts.[31]\n\nPop 'til You Drop! (2002) [ edit ]\n\nIn early 2002 the band started working on what would be their third studio album. In January a press conference was held in Stockholm with American rock musician Alice Cooper. They announced they would do a collaboration recording Cooper's classic, \"School's Out\".[32] The song was recorded on 25 January in Stockholm, Sweden. Two versions were recorded, a Pop Version and a Harder Version and both were planned to be included on A-Teens' third album due to be released mid-2002.[33]\n\nDuring the start of the year, many updates and reports were published on the band's official website anticipating the release of the album.[34] By March 2002, the band reported they had over fifteen tracks already recorded, giving names of tracks and telling the fans the direction they were going musically.[35] The band finished recording their album in late March that year with meeting with MCA executives to plan what would be the promotion and tour for the album.[36]\n\nIn May 2002 the band announced the first single to be taken from the album would be Elvis Presley's cover \"Can't Help Falling In Love\" to be launched to radios that month, and would also serve as the soundtrack of the then new Disney movie Lilo & Stitch.[37] A series of promotional stops in different TV Shows throughout the United States followed to promote both the movie and the album.[38][39]\n\nOn 18 June their third studio album, \"Pop 'til You Drop!\", was released exclusively in the United States.[40] The album was aimed to the American market putting on hold the release for the international markets. The album debuted at number forty-five on the Billboard 200 Albums Chart.[41] The single also received a commercial release in Australia and Sweden in September 2002.[42]\n\nThe band announced their first headlining tour in the United States. The Pop 'til You Drop! Tour, a thirty-date tour around the U.S., was held in the summer of 2002 with Baha Men, Jump5, LMNT and Play.[43][44] The tour ran from mid-July until the end of August throughout the United States and Canada. The concert tour consisted mainly of outdoor venues at amusement parks and amphitheaters. The tour consisted of songs from all three of their studio albums.\n\nLater in 2002, due to public demand, the album was released in several Latin American countries, including Mexico, where the band promoted in November.[45][46] The band had a concert planned in the Auditorio Nacional but was later canceled due to some problems with the set. The band was also invited to do a show for the King and Queen of Sweden and the then president of Mexico, Vicente Fox.[47] Their album reached number three on the international albums chart and number fourteen on the main album charts.[48][49] After the promotion in Mexico, the band headed to Europe to release their single \"Floorfiller\". The song became a top five hit in their home country[50] and reached the top forty in most European countries as well as becoming a hit in Latin America, but did not match the success of their previous releases.\n\nThe band appeared on CNN's The Music Room on December 2002, talking about pop music in Sweden.[51]\n\nNew Arrival (2003) [ edit ]\n\nBy the end of 2002 the A-Teens were in Europe, on the verge of what would be the international release of their third album, the band performed their hit single, \"Floorfiller\" at the 2002 Swedish Hit Music Awards as part of the promotion for their new album.[52]\n\nIn January 2003 the band announced the release dates of their third album for the international market[53] The band promoted in Germany and the Netherlands prior to the album's release.[54][55] On 27 January the album, entitled New Arrival (a reference to the ABBA album entitled Arrival), was released. It combined tracks from the last effort Pop 'til You Drop! and new tracks, making a whole new album, or a \"half-new album\", as they described it. Some of the material on these two albums was co-written by the members of the A-Teens. The majority of tracks, while recorded in Sweden, were the work of producers from the United States, Norway, Denmark and Sweden.[56] The album debuted at number four in Sweden and was certified Gold a few weeks after its release.[57] The second single taken from the album (first in some countries), was \"A Perfect Match\", the band shot the video for the song in Cuba,[58] the video was premiered on 26 February on ZTV.[59] When the single was released, it reached number two in Sweden and ensured top forty placings all over the world.[60] Worldwide releases of the album followed, including a release in Mexico, on 24 March, the band promoted in the country for almost a month,[61] their album reached number seven on the international album charts and number fifteen on the main album charts in late April that year.[62][63]\n\nBack in their homeland, the band embarked in their New Arrival Tour across Europe doing shows all over Sweden, Denmark, Russia and Slovakia.[64][65][66]\n\nThe band signed a promotional deal to promote Popdrinks in Sweden, with the song \"Bounce With Me\",[67] Amit graduated from high school and Marie Serneholt was named the third-sexiest woman in Sweden.[68]\n\nThe third single from the album (second in some countries), \"Let Your Heart Do All the Talking\" was meant to be commercially released, but after the lack of sales of the A-Teens album in a worldwide scale, the record label canceled the release, and just unleashed the song to radios.[69] Sales for \"New Arrival\" were lower than expected, selling fewer than 350,000 copies worldwide. The band still got a nomination in the Swedish Hit Music Awards for \"Swedish artist/group of the year\".[70]\n\nThe album also contains a cover from Murray Head's \"One Night in Bangkok\" (from the musical Chess). The music of this song is written by Benny Andersson and Björn Ulvaeus (the two male ABBA members), while the lyrics are written by Tim Rice. Other covers featured on the album include Shirley & Company's \"Shame, Shame, Shame\" and The Box Tops' \"The Letter\".\n\nGreatest Hits and break-up [ edit ]\n\nBy the beginning of 2004 the band announced their first Greatest Hits compilation was going to be released, a cover of Nick Kamen's \"I Promised Myself\" became the last single from the band.[71]\n\nThe band shot the video for the song in March 2004,[72] and was premiered on ZTV in early April, the song went to international radios on late April/May becoming the last hit of the band.[73] The album was a compilation of thirteen singles, which each one of them made the top twenty in at least one country[3] and three new tracks, two of them were written by the band members.\n\nPromotion for the album was slow, the band did a few shows in Sweden and international interviews to magazines.[74][75] Many were reporting the band was splitting up after six years in the pop world.[76] The band quickly denied the rumours on their official website.[77]\n\nThe single became another top-two hit for the band in Sweden, it became one of the band's biggest hits in South America (especially in Argentina) and the album became the band's first to not make the top ten in their homeland while it brought back the attention to them in other countries in Latin America and Eastern Europe.[78]\n\nThe album was just released in selected European countries, Asia and Latin America. It did not receive a U.S. release, although, when MCA Records went bankrupt and was absorbed by both Geffen and Interscope, the former had plans to release it in November, ready for the Christmas sales, but plans were scrapped when the band finished their tour and Dhani released his first solo single.[79]\n\nAfter \"Greatest Hits\" was released, the band announced a two-year break. On 15 April 2006, Serneholt's Swedish website officially announced that the A-Teens had parted ways. The members of the group wanted to pursue solo careers.[80] In one magazine Serneholt stated, \"The A-Teens are nothing but a memory now, we have all started our own projects.\" Lennevald confirmed his former groupmate's comment.\n\nSolo careers [ edit ]\n\nIn September 2004 Dhani Lennevald released \"Girl Talk\", his first single as a solo artist, in Sweden. There it peaked at number twenty-nine, ensuring Gold status after nine weeks on the charts.[81][82] Dhani and Universal Music parted ways in 2005.\n\nIn 2005, Marie Serneholt signed with SonyBMG and in early 2006, she released her first single as a solo artist titled \"That's the Way My Heart Goes\". It reached number two in Sweden in February, and was later released in Europe and certified Gold.[83] This was followed by the album Enjoy the Ride which peaked at number nine in her homeland. According to her personal MySpace page she is recording her second album. She participated in Melodifestivalen 2009 with the track \"Disconnect Me\". In 2011 she was the host for Melodifestivalen in Sweden. She also participated in Melodifestivalen 2012 with the single \"Salt and Pepper\". Serneholt was a judge on X Factor in Sweden where she was the mentor for the groups. Serneholt has also been working as a model and TV-host. Currently working as a TV host for shows like Bingolotto and other game shows.\n\nAmit Sebastian Paul made his debut as well. Songs in a Key of Mine is a mini-album with eight demos.[84] Amit Paul has released his first Solo album \"Songs In A Key Of Mine\" which features 12 songs in April 2008, with the first single \"Judge You\" was released soon after. Amit Paul has also a future career in business, and finished his Masters at the prestigious Stockholm School of Economics, where he did an internship at the management consultancy Bain & Company.\n\nSara Lumholdt released a cover of Olivia Newton-John's song \"Physical\" for a compilation album. She released the song under the name of Sara Love, and according to her official MySpace page she was working with producers from the United States and Europe to release more music. She released \"Glamour Bitch\" to her MySpace page and is said to be her debut single. Another single, \"First\", became available on iTunes in July 2008.\n\nDiscography [ edit ]\n\nFor a complete list of all the songs, see List of songs recorded by A-Teens\n\nTours [ edit ]\n\nPop 'Til You Drop! (2002)", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/c/c9/A_Teens_members.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/A_Teens_logo.svg/220px-A_Teens_logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c9/A_Teens_members.jpg/300px-A_Teens_members.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Logo_of_ABBA_Teens.jpg/220px-Logo_of_ABBA_Teens.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c9/A_Teens_members.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A-Teens", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/c/c9/A_Teens_members.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}