{"url": "https://www.independent.co.uk/life-style/love-sex/surprising-celebrity-couples-broke-up-before-getting-married-still-together-prince-william-kate-a7965926.html", "text": "It's easy to believe that all celebrity couples have a fairytale romance, but many have admitted that their trip to the alter wasn't always easy. In fact, some took time apart during their romantic journey.\n\nWe've rounded up all the couples that almost didn't end up together forever, and had at least one break up on the path to their wedding day.\n\nKristen Bell and Dax Shepard\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nDespite picture of true love now, Kristen Bell revealed to PopSugar that her now-husband Dax Shepard actually broke up with her shortly after they began dating.\n\n\"He sat me down and said, 'I can't have this right now. I think you're wonderful, but I am still dating other people,'\" she said. \"And then I, like, liquefied and fell to the ground, but I felt incredibly respected that he had the balls to tell me we weren't in the same place.\"\n\nOf course, shortly after, he knew he made a mistake.\n\n\"He called me and he was like, 'I don't know what I was thinking. I was dating someone else but they're just not as interesting as you, and I don't know what I'm doing,' and he came back,\" Bell told PopSugar.\n\nShepard and Bell got married in 2013 so everything obviously worked out for them, but she said that she doesn't let him forget that they almost were never married.\n\n\"But I still always remind him of when he broke up with me,\" she told PopSugar.\n\nChrissy Teigen and John Legend\n\nThey are the internet's favorite couple now, but John Legend revealed to The Guardian that his relationship with Chrissy Teigen was almost over after a particularly stressful day.\n\n\"I was really stressed and busy,\" Legend said. \"I was just like: 'I'd just be happier single right now.'\"\n\nWell Teigen wasn't having it; she told him no, they weren't breaking up.\n\nTechnically this wasn't a real breakup. Teigen later tweeted clarifying that she recognized that Legend was just having a particularly tough day.\n\n\"It wasn't a a typical breakup,\" she tweeted. \"He was on tour and his voice hurt and he was being a whiny face about everything and so yeah, I was like 'no.'\"\n\nStill it sure makes for a funny story knowing now how happy the couple is now.\n\nAdam Levine and Behati Prinsloo\n\nAdam Levine and Behati Prinsloo may be proud parents and a happily married couple today, but once upon a 2013 they ended things in a kind of messy way.\n\nThe couple began dating in 2012 after Levine broke up with Prinsloo's friend and fellow Victoria's Secret model Anne Vyalitsyna. Levine and Prinsloo dated until May 2013, when he reportedly began dating Sports Illustrated supermodel Nina Agdal.\n\nBut that relationship was short-lived. By July 2013, Levine and Prinsloo got back together and got engaged. They were married in June 2014, and Prinsloo gave birth to daughter Dusty Rose in September 2016. The couple is expecting another child together.\n\nJustin Timberlake and Jessica Biel\n\nJustin Timberlake and Jessica Biel may keep a low-profile about their love now, but back in 2011, Timberlake was public about how difficult the split from his then-ex-girlfriend Biel was.\n\nThe pair began dating in 2007 and broke up in March 2011. A few months later, in June, Timberlake gave a heartbreaking interview to Vanity Fair about how much Biel meant to him.\n\n\"She is the single-handedly most significant person in my life,\" he told Vanity Fair. \"In my 30 years, she is the most special person, OK? So I protect it, and until somebody shows me what would be more fulfilling at this point, that's what I have to do.\"\n\n\"I would rather not talk about her, because it's hurtful for me,\" he continued.\n\nIt probably didn't surprise many people when the couple rekindled their romance in October 2011. They were married in October 2012 and haven't looked back since.\n\nKristin Cavallari and Jay Cutler\n\nKristin Cavallari and Jay Cutler had a rocky road to get to where they are now.\n\nThe two began dating in 2010 and got engaged. But they broke off their engagement in July 2011 and called off their wedding.\n\nCavallari later wrote in her book \"Balancing in Heels: My Journey to Health, Happiness, and Making It All Work,\" that she broke up with Cutler in an effort to show him she was serious about confronting their relationship issue,s and because she didn't want to be a stay-at-home wife and mother.\n\nThe couple eventually went to therapy and got back together in January 2012. They were married in 2013.\n\nPink and Carey Hart\n\nPink and Carey Hart are the shining example that you can break up with someone and then come back even stronger.\n\nThe couple has broken up twice: they began dating in 2001, then split in 2003 for about a year. They got back together and she actually proposed to him in 2005 at the Pro 250 class finals. They were married in January 2006.\n\nThen the couple very publicly split in 2008, and he memorably appeared in the music video for her breakup anthem \"So What.\"\n\nThat should have been an indication that there was hope for a reconciliation because in 2009, they announced they were back together. Today, they have two children together -- Willow and Jameson.\n\nGabrielle Union and Dwyane Wade\n\nGabrielle Union and Dwyane Wade took their time getting to the alter, and one stop on their journey included a brief split.\n\nThe basketball star and the actor began dating in 2009 but briefly split in 2013. During that time, Wade reportedly fathered a child with friend and \"Basketball Wives\" star Aja Metoyer.\n\nBut Wayde and Union got back together soon after, and Wade said they had to work out scheduling and relationship issues together.\n\n\"We supported each other ... but at the end of the day we came back together and [said], 'Listen, we want to continue this, we want to continue to try to get better each day,' and she's been with me, and I've been with her all summer long. We're going strong now,\" Wade said on The Tonight Show.\n\nWade and Union were married in August 2014.\n\nWill and Kate Middleton\n\nPrince William and Kate Middleton stole the world's hearts when they had an over-the-top royal wedding, but many will be surprised to hear that this fairytale romance almost ended up heartbreak.\n\nThe royal couple began dating in 2003 during their time at the University of St Andrews in Scotland. They dated until 2007 when they split. Although Clarence House declined to comment about the split at the time, a biography later claimed that it was a mix of intense media attention, their busy schedules, and Will's partying with other women.\n\n\"We both were very young ... we were sort of both finding ourselves as such and being different characters and stuff, it was very much trying to find our way and we were growing up, and so it was just sort of a bit of space and a bit of things like that and it worked out for the better,\" he told the UK Press Association.\n\nBut as we all know, the couple eventually reunited in June 2010 and they were engaged later that year. They have two children together and are expecting a third.\n\nNick and Vanessa Lachey\n\nNick Lachey was involved in a pretty high-profile marriage -- and then split -- from ex-wife Jessica Simpson. But you may forget he and now-wife Vanessa Lachey had a pretty public split too.\n\nThey couple began dating in 2006 and split in June 2009, assuring fans that they remained \"good friends.\"\n\nApparently that was true, because by October 2009, they were back on.\n\n\"I am happy in a relationship,\" Lachey told Good Day Philadelphia, according to Us Weekly. \"I was single for a minute there, and then we've kind of patched things up.\"\n\nThe happy couple got married July 2011 and has three children together -- Phoenix, Camden, and Brooklyn.\n\nMegan Fox and Brian Austin Green\n\nMegan Fox and Brian Austin Green began dating in 2004 when Fox was just 18 and Green was 30. They were engaged in 2006, and seemed to be on the fast track to marriage until 2009 when they split.\n\nFox was in the middle of a successful franchise with \"Transformers\" so naturally rumors about their breakup and possible cheating ran amuck. But Fox had a pretty simply explanation for the breakup.\n\n\"Marriage isn't a realistic goal for someone who is 23, that's all,\" she said at the time.\n\nBut their breakup was pretty brief and the pair ended up marrying in 2010 when Fox was 24. They had a son Noah together in 2012 and another named Bodhi in 2014.\n\nThere appeared to be trouble in paradise again after Fox filed for divorce in 2015. But in 2016, Fox became pregnant again. Their divorce was put on hold and she gave birth to another baby boy named Journey.\n\nSince then, the couple seems to be doing better than ever.\n\nMichael Phelps and Nicole Johnson\n\nThey're a gold medal couple now, but Michael Phelps and Nicole Johnson will be the first ones to tell you that their relationship has not always been easy.\n\nThe couple began dating in 2007 and had a few breakups along the way -- including one from 2011 to 2014. They were engaged in 2015, and, at the time, Phelps shared how he always wanted to get Johnson back.\n\n\"I said to a couple of my friends if I ever had the chance to get her back, that would be it,\" Phelps told USA Today. \"She was the one I loved the most.\"\n\nJohnson told Cosmopolitan that the couple needed to grow separately in order to have a strong relationship today.\n\n\"Michael and I both know that had we tried to have a child and get married in the previous time we were together, it probably would not have ended pretty,\" she said. \"We both had a lot of growing up to do.\"\n\nThe couple had a son, Boomer, together in May 2016, and secretly married in June 2016. They are expecting another child together and announced it in the cutest way.\n\nRead more:\n\n• A day in the life of 26-year-old fitness Instagram star Kayla Itsines\n\n• 8 body-language tricks that are hard to master but will pay off forever\n\n• 20 modern classic movies everyone needs to watch in their lifetime\n\nRead the original article on INSIDER. © 2016. Follow Business Insider UK on Twitter.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/25/13/1-0.png", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/25/13/1-0.png", "keywords": [], "authors": ["Kristin Salaky"], "canonical_link": "https://uk.businessinsider.com/celebrity-couples-broke-up-got-back-together-married-2017-9/#megan-fox-and-brian-austin-green-10", "title": "11 surprising celebrity couples who broke up before ultimately getting married — and are still together", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/life-style/love-sex/surprising-celebrity-couples-broke-up-before-getting-married-still-together-prince-william-kate-a7965926.html", "title": "11 surprising celebrity couples who broke up before ultimately getting married — and are still together", "updated_time": "2017-09-25T14:11:35+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/09/25/13/1-0.png", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7965926"}, "original-source": "http://uk.businessinsider.com/celebrity-couples-broke-up-got-back-together-married-2017-9/#megan-fox-and-brian-austin-green-10", "description": "It's easy to believe that all celebrity couples have a fairytale romance, but many have admitted that their trip to the alter wasn't always easy. In fact, some took time apart during their romantic journey.  We've rounded up all the couples that almost didn't end up together forever, and had at least one break up on the path to their wedding day.  Kristen Bell and Dax Shepard", "keywords": "celebrity couple, marriage health relationships, Kate Middleton, Prince William, Love & Sex, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"author": "http://www.independent.co.uk/author/insider", "tag": "celebrity couple", "published_time": "2017-09-25T14:11:35+01:00", "modified_time": "2017-09-25T14:11:35+01:00", "section": "Love & Sex", "author_name": "Kristin Salaky, Insider", "content_type": "story", "word_count": 1827, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 2}, "twitter": {"title": "11 surprising celebrity couples who broke up before ultimately getti…", "description": "It's easy to believe that all celebrity couples have a fairytale romance, but many have admitted that their trip to the alter wasn't always easy. In fact, some took time apart during their romantic", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1506345095.0, "source": "https://www.independent.co.uk", "summary": ""}