{"url": "https://variety.com/2017/tv/news/nbc-2017-18-schedule-1202426365/", "text": "NBC is hoping to bring back the “Must-See TV” glow to its Thursday lineup with plans to move the breakout hit drama “This Is Us” to the 9 p.m. slot this fall.\n\nThe revival of “Will & Grace” will also head to Thursday, anchoring the night at 8 p.m. “This Is Us” emerged as a breakout hit for NBC this season in the Tuesday 9 p.m. slot. In February it will also get a plum showcase behind NBC’s Super Bowl telecast.\n\n“Our hope is to create the return of ‘Must-See TV’ on Thursday,” NBC Entertainment chairman Bob Greenblatt said in a conference call Sunday. The moves on Thursday were designed to “strategically surround (‘This Is Us’) with shows we think are very strong.”\n\nNBC formally unveils its new schedule to advertisers in New York on Monday.\n\nGreenblatt said NBC considered numerous scenarios for “This Is Us” in its second season but decided the Thursday move made sense, given NBC’s long legacy on the night that was once home to “Cheers,” “Friends,” “Seinfeld,” “Hill Street Blues,” “L.A. Law,” “ER” and other enduring favorites.\n\n“While it’s a little risky there’s a bigger case to be made for redoing Thursday night,” Greenblatt said. And with “This Is Us’s” undeniable ratings momentum in season one, “if there was one show we could move, it would be this one,” Greenblatt said.\n\nOn Thursday, the post-“This Is Us” 10 p.m. slot will be filled in the fall by the limited series “Law & Order True Crime: The Menendez Murders.” “The Blacklist,” which had held down the Thursday 10 p.m. berth this season, moves to Wednesday 9 p.m.\n\nNBC’s post-“Voice” time slot on Monday 10 p.m. went to the new patriotic drama “The Brave,” about elite military operatives, toplined by Anne Heche. That slot this season went to “Timeless,” the freshman drama that was canceled and un-canceled within 48 hours by NBC last week.\n\nMost of NBC’s other new series orders for the 2017-18 season are being held for midseason debuts. But NBC’s midseason lineup won’t fall in to place until after the Feb. 9-25 run of the Winter Olympics in PyeongChang, South Korea.\n\nGreenblatt emphasized that NBC was focused on further lowering the volume of in-season repeats and “spreading the wealth” of scripted programming into the summer. The Winter Olympics, the five “Thursday Night Football” games in the fall and the Super Bowl are pillars for the strategy.\n\n“We took all of the advantages we have and tried to use them to grow and expand the lineup in as many ways as we could,” Greenblatt said.\n\nThe comedy block of “Superstore” and “The Good Place” that had aired Thursday 8-9 p.m. this season will relocate to Tuesday 9-10 p.m., sandwiched between “The Voice” and “Chicago Fire.” The hope is the stronger lead-in will be a boost for the pair, which had a hard job of opening Thursday against ABC’s “Grey’s Anatomy” and CBS’ “The Big Bang Theory” this season.\n\nAfter “Will & Grace” ends its 12-episode run, Greenblatt indicated that NBC would refresh the Thursday 8-9 p.m. slot with “Superstore” and another comedy pairing, which would in turn open up the Tuesday post-“Voice” slot for new series. “There’s a little juggling going on,” he said.\n\nOn Sunday nights after regular season football ends, the schedule will include the return of Steve Harvey’s “Little Big Shots,” a new unscripted offering from Ellen DeGeneres, “Ellen’s Game of Games,” and the third season of the Jennifer Lopez starrer “Shades of Blue.”\n\nNBC FALL 2017-18 SCHEDULE\n\n(New programs in UPPER CASE; all times ET)\n\nMONDAY\n\n8-10 P.M. — The Voice\n\n10-11 P.M. — THE BRAVE\n\nTUESDAY\n\n8-9 P.M. — The Voice\n\n9-9:30 P.M. — Superstore\n\n9:30-10 P.M. — The Good Place\n\n10-11 P.M. — Chicago Fire\n\nWEDNESDAY\n\n8-9 P.M. — The Blacklist\n\n9-10 P.M. — Law & Order: SVU\n\n10-11 P.M. — Chicago P.D.\n\nTHURSDAY\n\n8-8:30 P.M. — WILL & GRACE\n\n8:30-9 P.M. — Great News\n\n9-10 P.M. — This Is Us\n\n10-11 P.M. — LAW & ORDER TRUE CRIME: THE MENENDEZ MURDERS\n\nFRIDAY\n\n8-9 P.M. — Blindspot\n\n9-10 P.M. — Taken\n\n10-11 P.M — Dateline NBC\n\nSATURDAY\n\n8-10 P.M. —Dateline Saturday Night Mystery\n\n10-11 P.M. — Saturday Night Live (encores)\n\nSUNDAY\n\n7-8:20 P.M. — Football Night in America\n\n8:20-11 P.M. — NBC Sunday Night Football\n\nNEW SERIES ORDERS\n\nDRAMA\n\n“THE BRAVE”\n\nFrom Keshet Studios and Avi Nir (executive producer of “Homeland”) comes a fresh, heart-pounding journey into the complex world of America’s elite undercover military heroes. While D.I.A. Deputy Director Patricia Campbell (Anne Heche) and her team of analysts wield the world’s most advanced surveillance technology from Washington, D.C., Adam Dalton and his heroic Special Ops squad of highly trained undercover specialists use their unbreakable bond and commitment to freedom to save lives of innocent people and execute missions in some of the most dangerous places in the world.\n\nThe cast includes Anne Heche, Mike Vogel, Sofia Pernas, Tate Ellington, Natacha Karam, Demetrius Grosse, Noah Mills and Hadi Tabbal.\n\nDean Georgaris will write and executive produce. Brad Anderson will direct and executive produce the pilot. Avi Nir, Alon Shtruzman, Peter Traugott and Rachel Kaplan also executive produce. “The Brave” is produced by Universal Television and Keshet Studios.\n\n“GOOD GIRLS”\n\nWhen three suburban moms get tired of trying to make ends meet, they decide it’s time to stick up for themselves by robbing the local supermarket at (toy) gunpoint. But when the manager catches a glimpse of one of them and the loot is far more than they expected, it doesn’t take long for the three best friends to realize the perfect getaway will be harder than they think. From executive producer Jenna Bans (“Scandal”) comes this comedy-infused drama that mixes a little “Thelma & Louise” with a bit of “Breaking Bad.”\n\nThe cast includes Retta, Mae Whitman, Reno Wilson, Manny Montana, Lidya Jewett, Izzy Stannard and Matthew Lillard.\n\nJenna Bans will write and executive produce. Dean Parisot directs and executive produces the pilot. Jeannine Renshaw also executive produces. “Good Girls” is produced by Universal Television.\n\n“LAW & ORDER TRUE CRIME: THE MENENDEZ MURDERS”\n\nStarring the incomparable Emmy and Golden Globe Award winner Edie Falco (“The Sopranos,” “Nurse Jackie”), this new eight-episode true-crime installment of the powerhouse “Law & Order” franchise delivers a gripping in-depth dramatization of the notorious murder case that changed America forever. When the Menendez brothers were tried on national TV for brutally killing their parents in Beverly Hills, their story became a national obsession. Now, the first edition of this anthology series delves into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down when the cameras stopped rolling.\n\nRene Balcer will write and executive produce. Lesli Linka Glatter will direct and executive produce. Dick Wolf, Peter Jankowski and Arthur W. Forney also executive produce. “Law & Order True Crime: The Menendez Murders” is produced by Universal Television and Wolf Films.\n\n“REVERIE”\n\nFrom Mickey Fisher, the creator of “Extant,” this grounded new thriller follows Mara Kint (Sarah Shahi), a former hostage negotiator and expert on human behavior who became a college professor after facing an unimaginable personal tragedy. But when she’s brought in to save ordinary people who have lost themselves in a highly advanced virtual-reality program in which you can literally live your dreams, she finds that in saving others, she may actually have discovered a way to save herself.\n\nThe cast includes Sarah Shahi, Dennis Haysbert, Jessica Lu, Sendhil Ramamurthy and Kathryn Morris.\n\nMickey Fisher will write and executive produce. Jaume Collet-Serra will direct and executive produce the pilot. Brooklyn Weaver, Darryl Frank and Justin Falvey also executive produce. Tom Szentgyorgyi is a consulting producer. “Reverie” is produced by Universal Television and Amblin Television.\n\n“RISE”\n\nFrom Jason Katims, writer and executive producer of “Friday Night Lights” and “Parenthood,” and “Hamilton” producer Jeffrey Seller comes a heartening new drama about finding inspiration in unexpected places. When dedicated teacher and family man Lou Mazzuchelli (Josh Radnor) sheds his own self-doubt and takes over the school’s lackluster theater department, he galvanizes not only the faculty and students but the entire working-class town. Inspired by a true story.\n\nThe cast includes Josh Radnor, Rosie Perez, Marley Shelton, Auli’i Cravalho, Damon J. Gillespie, Amy Forsyth, Rarmian Newton, Ted Sutherland, Casey Johnson, Taylor Richardson, Joe Tippett and Shirley Rumierk.\n\nJason Katims will write and executive produce. Mike Cahill will direct and executive produce the pilot. Michelle Lee, Jeffrey Seller and Flody Suarez also executive produce. “Rise” is produced by Universal Television, True Jack Productions and Seller Suarez Productions.\n\nCOMEDY\n\n“A.P. BIO”\n\nWhen a philosophy scholar loses out on his dream job and goes to work as a high school Advanced Placement biology teacher, he makes it clear he will not be teaching any biology. Realizing he has a room full of honor roll students at his disposal, he decides instead to use the kids to his own benefit.\n\nThe cast includes Glenn Howerton, Patton Oswalt, Lyric Lewis, Mary Sohn, Aparna Brielle, Jacob McCarthy, Nick Peine and guest star Vanessa Bayer (pilot only).\n\nMike O’Brien will write and executive produce. Lorne Michaels, Seth Meyers, Andrew Singer and Mike Shoemaker also executive produce. Osmany Rodriguez will direct. “A.P. Bio” is produced by Universal Television, Broadway Video and Sethmaker Shoemeyers Productions.\n\n“CHAMPIONS”\n\nVince, a charismatic gym owner with no ambition, lives with his younger brother Michael, a gorgeous idiot. Their simple life of women and working out is put on hold when the teenage son of Vince is dropped off on their doorstep by Priya (Mindy Kaling), one of his old high school flings.\n\nThe cast includes Anders Holm, Andy Favreau, J.J. Totah, Mouzam Makkar, Nina Wadia and guest star Mindy Kaling.\n\nCharlie Grandy and Mindy Kaling will write and executive produce. Michael Alan Spiller will direct and executive produce. Howard Klein also executive produces. “Champions” is produced by Universal Television, 3 Arts Entertainment, Eyes Up Productions and Kaling International.\n\n“WILL & GRACE”\n\nThat’s right, honey! A decade after their unforgettable eight-season run, comedy’s most fabulous foursome is back. Debra Messing, Eric McCormack, Sean Hayes and Megan Mullally reprise their infamous roles as Will, Grace, Jack and Karen in this exclusive 12-episode event. The legendary James Burrows, director of every original “Will & Grace” episode, returns along with a slew of razor-sharp jabs and dirty martinis. Behold once again, from the minds of Max Mutchnick and David Kohan, TV’s wittiest ensemble ever.\n\nThe cast includes Debra Messing, Eric McCormack, Sean Hayes and Megan Mullally.\n\nMax Mutchnick and David Kohan will write and executive produce. Alex Herschlag, Tracy Poust & Jon Kinnally also executive produce. James Burrows will direct and executive produce. “Will & Grace” is produced by Universal Television.\n\nALTERNATIVE\n\n“THE AWESOME SHOW”\n\nFrom executive producer/host Chris Hardwick (“The Wall”), executive producer Mark Burnett (“The Voice”) and Silicon Valley’s Singularity University comes a new series that will showcase the groundbreaking scientific and technological advances that are shaping the future, as well as celebrate the pioneers and communities at the forefront of this golden age of unprecedented discovery, innovation and opportunity. Each episode of “The Awesome Show” will be a rollercoaster ride through the world of innovation as told by the people who are shaping it and whose lives are affected by it. The series will highlight stories of revolutionary scientific and technological advances and will marvel at mankind’s tremendous feats, both now and in the future.\n\nMark Burnett, Chris Hardwick and Alex Murray executive produce. “The Awesome Show” is produced by Universal Television Alternative Studio in association with Brillstein Entertainment Partners and Fish Ladder.\n\n“ELLEN’S GAME OF GAMES”\n\nThe one and only Ellen DeGeneres returns to primetime to host an exciting new game show that’s one big party! Featuring super-sized versions of some of the most beloved games from “The Ellen DeGeneres Show,” as well as new ones, contestants will be pulled from the studio audience to maneuver massive obstacles while answering trivia questions, all under the pressure of Ellen’s mischievous and hilarious antics. With DeGeneres’ witty and comedic sensibility plus fun-filled games, each episode is sure to entertain the entire family and deliver lots of laughs. One lucky contestant will get the chance to win the grand prize, but everyone will have a blast!\n\nEllen DeGeneres, Jeff Kleeman, Ed Glavin, Mary Connelly, Andy Lassner, Kevin Leman and David A. Hurwitz executive produce. Russell Norman directs. “Ellen’s Game of Games” is produced by Warner Horizon Unscripted in association with A Very Good Production and Telepictures.\n\n“GENIUS JUNIOR”\n\nNo stranger to young geniuses, Neil Patrick Harris hosts an exciting new game show that celebrates the smartest kids in America. These talented “genius juniors” will team up to take on mind-blowing tests of logic, math, memory, spelling and more. Through escalating rounds, they will be tested in each area of the brain, culminating in an ultimate challenge to be crowned the smartest and brightest. The winning team will take home a life-changing prize — setting the stage for a big, bright future ahead.\n\nNeil Patrick Harris, Pam Healey, John Hesling, Phil Parsons and Ed Egan executive produce. “Genius Junior” is produced by Shed Media in association with Prediction Productions.\n\n“THE HANDMADE PROJECT”\n\nFrom executive producer and host Amy Poehler and co-host Nick Offerman comes a lighthearted competition celebrating the creativity and craftiness in all of us. Each week, eight amateur makers will take on a series of projects they must complete in their own unique way. As the competition escalates, the amateurs will be challenged to master progressively difficult skills, culminating in a final craft-off between the most creative and tenacious contestants. Shot in a serene outdoor setting, this friendly competition will focus on the character and camaraderie of DIY culture – and through it all, Poehler and Offerman will provide encouragement, guidance and plenty of laughs.\n\nAmy Poehler, Brooke Posch, Nicolle Yaron, Nick Offerman, Dave Becky and Anthony Dominici executive produce. “The Handmade Project” is produced by Universal Television Alternative Studio in association with Paper Kite Productions.", "images": ["https://pmcvariety.files.wordpress.com/2016/10/this-is-us-mandy-moore.jpg?w=1000", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fnbc-2017-18-schedule-1202426365%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202426365&comment_count=15", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2016/10/this-is-us-mandy-moore.jpg?w=1000", "keywords": [], "authors": ["Cynthia Littleton"], "canonical_link": "https://variety.com/2017/tv/news/nbc-2017-18-schedule-1202426365/", "title": "NBC 2017-18 Fall Schedule: ‘Must-See TV’ Revived on Thursday With ‘This Is Us,’ ‘Will & Grace’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "NBC is hoping to bring back the \"Must-See TV\" glow to its Thursday lineup with plans to move \"This Is Us\" to the 9 p.m. slot this fall.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202426365, "author": "Cynthia Littleton", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-14T09:30:56"}, "pmc-tag": "NBC,Upfront 2017", "title": "NBC 2017-18 Fall Schedule: ‘Must-See TV’ Revived on Thursday With ‘This Is Us,’ ‘Will & Grace’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "NBC 2017-18 Fall Schedule: ‘Must-See TV’ Revived on Thursday With ‘This Is Us,’ ‘Will & Grace’", "url": "https://variety.com/2017/tv/news/nbc-2017-18-schedule-1202426365/", "description": "NBC is hoping to bring back the “Must-See TV” glow to its Thursday lineup with plans to move the breakout hit drama “This Is Us” to the 9 p.m. slot this fall. The revival of…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/10/this-is-us-mandy-moore.jpg?w=1000", "width": 1000, "height": 562, "alt": "This is Us Mandy Moore"}, "locale": "en_US"}, "article": {"published_time": "2017-05-14T16:30:56+00:00", "modified_time": "2017-05-14T18:42:34+00:00"}, "twitter": {"creator": "@Variety_Cynthia", "site": "@variety", "text": {"title": "NBC 2017-18 Fall Schedule: ‘Must-See TV’ Revived on Thursday With ‘This Is Us,’ ‘Will & Grace’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/10/this-is-us-mandy-moore.jpg?w=1000", "alt": "This is Us Mandy Moore"}, "card": "summary_large_image", "title": "NBC 2017-18 Fall Schedule: ‘Must-See TV’ Revived on Thursday With ‘This Is Us,’ ‘Will & Grace’", "description": "NBC is hoping to bring back the \"Must-See TV\" glow to its Thursday lineup with plans to move \"This Is Us\" to the 9 p.m. slot this fall."}, "author": "Cynthia Littleton", "content_type": "Article", "post_id": 1202426365, "title": "NBC 2017-18 Fall Schedule: 'Must-See TV' Revived on Thursday With 'This Is Us,' 'Will & Grace'", "published_at": "2017-05-14 09:30:56", "image": "https://pmcvariety.files.wordpress.com/2016/10/this-is-us-mandy-moore.jpg?w=1000", "comment_count": 15, "tags": "Upfront 2017", "topics": "News", "appeared_in_print": "No", "body": "NBC is hoping to bring back the \"Must-See TV\" glow to its Thursday lineup with plans to move the breakout hit drama \"This Is Us\" to the 9 p.m. slot this fall.\r\n\r\n\r\n\r\nThe revival of \"Will & Grace\" will also head to Thursday, anchoring the night at 8 p.m. \"This Is Us\" emerged as a breakout hit for NBC this season in the Tuesday 9 p.m. slot. In February it will also get a plum showcase behind NBC's Super Bowl telecast.\r\n\"Our hope is to create the return of 'Must-See TV' on Thursday,\" NBC Entertainment chairman Bob Greenblatt said in a conference call Sunday. The moves on Thursday were designed to \"strategically surround ('This Is Us') with shows we think are very strong.\"\r\nNBC formally unveils its new schedule to advertisers in New York on Monday.\r\nGreenblatt said NBC considered numerous scenarios for \"This Is Us\" in its second season but decided the Thursday move made sense, given NBC's long legacy on the night that was once home to \"Cheers,\" \"Friends,\" \"Seinfeld,\" \"Hill Street Blues,\" \"L.A. Law,\" \"ER\" and other enduring favorites.\r\n\"While it’s a little risky there’s a bigger case to be made for redoing Thursday night,\" Greenblatt said. And with \"This Is Us's\" undeniable ratings momentum in season one, \"if there was one show we could move, it would be this one,\" Greenblatt said.\r\nOn Thursday, the post-\"This Is Us\" 10 p.m. slot will be filled in the fall by the limited series \"Law & Order True Crime: The Menendez Murders.\" \"The Blacklist,\" which had held down the Thursday 10 p.m. berth this season, moves to Wednesday 9 p.m.\r\nNBC's post-\"Voice\" time slot on Monday 10 p.m. went to the new patriotic drama \"The Brave,\" about elite military operatives, toplined by Anne Heche. That slot this season went to \"Timeless,\" the freshman drama that was canceled and un-canceled within 48 hours by NBC last week.\r\n\r\nMost of NBC's other new series orders for the 2017-18 season are being held for midseason debuts. But NBC's midseason lineup won't fall in to place until after the Feb. 9-25 run of the Winter Olympics in PyeongChang, South Korea.\r\n\r\nGreenblatt emphasized that NBC was focused on further lowering the volume of in-season repeats and \"spreading the wealth\" of scripted programming into the summer. The Winter Olympics, the five \"Thursday Night Football\" games in the fall and the Super Bowl are pillars for the strategy.\r\n\r\n\"We took all of the advantages we have and tried to use them to grow and expand the lineup in as many ways as we could,\" Greenblatt said.\r\n\r\nThe comedy block of \"Superstore\" and \"The Good Place\" that had aired Thursday 8-9 p.m. this season will relocate to Tuesday 9-10 p.m., sandwiched between \"The Voice\" and \"Chicago Fire.\" The hope is the stronger lead-in will be a boost for the pair, which had a hard job of opening Thursday against ABC's \"Grey's Anatomy\" and CBS' \"The Big Bang Theory\" this season.\r\n\r\nAfter \"Will & Grace\" ends its 12-episode run, Greenblatt indicated that NBC would refresh the Thursday 8-9 p.m. slot with \"Superstore\" and another comedy pairing, which would in turn open up the Tuesday post-\"Voice\" slot for new series. \"There's a little juggling going on,\" he said.\r\n\r\nOn Sunday nights after regular season football ends, the schedule will include the return of Steve Harvey's “Little Big Shots,” a new unscripted offering from Ellen DeGeneres, “Ellen’s Game of Games,” and the third season of the Jennifer Lopez starrer “Shades of Blue.\"\r\n\r\nNBC FALL 2017-18 SCHEDULE\r\n(New programs in UPPER CASE; all times ET)\r\nMONDAY\r\n8-10 P.M. — The Voice\r\n10-11 P.M. — THE BRAVE\r\nTUESDAY\r\n8-9 P.M. — The Voice\r\n9-9:30 P.M. — Superstore\r\n9:30-10 P.M. — The Good Place\r\n10-11 P.M.  — Chicago Fire\r\nWEDNESDAY\r\n8-9 P.M. — The Blacklist\r\n9-10 P.M. — Law & Order: SVU\r\n10-11 P.M. — Chicago P.D.\r\nTHURSDAY\r\n8-8:30 P.M. — WILL & GRACE\r\n8:30-9 P.M.  — Great News\r\n9-10 P.M. — This Is Us\r\n10-11 P.M. — LAW & ORDER TRUE CRIME: THE MENENDEZ MURDERS\r\nFRIDAY\r\n8-9 P.M. — Blindspot\r\n9-10 P.M. — Taken\r\n10-11 P.M — Dateline NBC\r\nSATURDAY\r\n8-10 P.M. —Dateline Saturday Night Mystery \r\n10-11 P.M. — Saturday Night Live (encores)\r\nSUNDAY\r\n7-8:20 P.M. — Football Night in America\r\n8:20-11 P.M. — NBC Sunday Night Football \r\nNEW SERIES ORDERS\r\nDRAMA\r\n“THE BRAVE” \r\nFrom Keshet Studios and Avi Nir (executive producer of “Homeland”) comes a fresh, heart-pounding journey into the complex world of America’s elite undercover military heroes. While D.I.A. Deputy Director Patricia Campbell (Anne Heche) and her team of analysts wield the world’s most advanced surveillance technology from Washington, D.C., Adam Dalton and his heroic Special Ops squad of highly trained undercover specialists use their unbreakable bond and commitment to freedom to save lives of innocent people and execute missions in some of the most dangerous places in the world.\r\nThe cast includes Anne Heche, Mike Vogel, Sofia Pernas, Tate Ellington, Natacha Karam, Demetrius Grosse, Noah Mills and Hadi Tabbal.\r\nDean Georgaris will write and executive produce. Brad Anderson will direct and executive produce the pilot. Avi Nir, Alon Shtruzman, Peter Traugott and Rachel Kaplan also executive produce. “The Brave” is produced by Universal Television and Keshet Studios. \r\n“GOOD GIRLS” \r\nWhen three suburban moms get tired of trying to make ends meet, they decide it’s time to stick up for themselves by robbing the local supermarket at (toy) gunpoint. But when the manager catches a glimpse of one of them and the loot is far more than they expected, it doesn’t take long for the three best friends to realize the perfect getaway will be harder than they think. From executive producer Jenna Bans (“Scandal”) comes this comedy-infused drama that mixes a little “Thelma & Louise” with a bit of “Breaking Bad.”\r\nThe cast includes Retta, Mae Whitman, Reno Wilson, Manny Montana, Lidya Jewett, Izzy Stannard and Matthew Lillard.\r\nJenna Bans will write and executive produce. Dean Parisot directs and executive produces the pilot. Jeannine Renshaw also executive produces. “Good Girls” is produced by Universal Television.\r\n“LAW & ORDER TRUE CRIME: THE MENENDEZ MURDERS” \r\nStarring the incomparable Emmy and Golden Globe Award winner Edie Falco (“The Sopranos,” “Nurse Jackie”), this new eight-episode true-crime installment of the powerhouse “Law & Order” franchise delivers a gripping  in-depth dramatization of the notorious murder case that changed America forever. When the Menendez brothers were tried on national TV for brutally killing their parents in Beverly Hills, their story became a national obsession. Now, the first edition of this anthology series delves into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down when the cameras stopped rolling.\r\nRene Balcer will write and executive produce. Lesli Linka Glatter will direct and executive produce. Dick Wolf, Peter Jankowski and Arthur W. Forney also executive produce. “Law & Order True Crime: The Menendez Murders” is produced by Universal Television and Wolf Films.\r\n“REVERIE” \r\nFrom Mickey Fisher, the creator of “Extant,” this grounded new thriller follows Mara Kint (Sarah Shahi), a former hostage negotiator and expert on human behavior who became a college professor after facing an unimaginable personal tragedy. But when she’s brought in to save ordinary people who have lost themselves in a highly advanced virtual-reality program in which you can literally live your dreams, she finds that in saving others, she may actually have discovered a way to save herself. \r\nThe cast includes Sarah Shahi, Dennis Haysbert, Jessica Lu, Sendhil Ramamurthy and Kathryn Morris.\r\nMickey Fisher will write and executive produce. Jaume Collet-Serra will direct and executive produce the pilot. Brooklyn Weaver, Darryl Frank and Justin Falvey also executive produce. Tom Szentgyorgyi is a consulting producer. “Reverie” is produced by Universal Television and Amblin Television. \r\n“RISE” \r\nFrom Jason Katims, writer and executive producer of “Friday Night Lights” and “Parenthood,” and “Hamilton” producer Jeffrey Seller comes a heartening new drama about finding inspiration in unexpected places. When dedicated teacher and family man Lou Mazzuchelli (Josh Radnor) sheds his own self-doubt and takes over the school’s lackluster theater department, he galvanizes not only the faculty and students but the entire working-class town. Inspired by a true story.\r\nThe cast includes Josh Radnor, Rosie Perez, Marley Shelton, Auli’i Cravalho, Damon J. Gillespie, Amy Forsyth, Rarmian Newton, Ted Sutherland, Casey Johnson, Taylor Richardson, Joe Tippett and Shirley Rumierk.\r\nJason Katims will write and executive produce. Mike Cahill will direct and executive produce the pilot. Michelle Lee, Jeffrey Seller and Flody Suarez also executive produce. “Rise” is produced by Universal Television, True Jack Productions and Seller Suarez Productions.\r\nCOMEDY\r\n “A.P. BIO” \r\nWhen a philosophy scholar loses out on his dream job and goes to work as a high school Advanced Placement biology teacher, he makes it clear he will not be teaching any biology. Realizing he has a room full of honor roll students at his disposal, he decides instead to use the kids to his own benefit.\r\nThe cast includes Glenn Howerton, Patton Oswalt, Lyric Lewis, Mary Sohn, Aparna Brielle, Jacob McCarthy, Nick Peine and guest star Vanessa Bayer (pilot only).\r\nMike O’Brien will write and executive produce. Lorne Michaels, Seth Meyers, Andrew Singer and Mike Shoemaker also executive produce. Osmany Rodriguez will direct. “A.P. Bio” is produced by Universal Television, Broadway Video and Sethmaker Shoemeyers Productions. \r\n“CHAMPIONS” \r\nVince, a charismatic gym owner with no ambition, lives with his younger brother Michael, a gorgeous idiot. Their simple life of women and working out is put on hold when the teenage son of Vince is dropped off on their doorstep by Priya (Mindy Kaling), one of his old high school flings.\r\nThe cast includes Anders Holm, Andy Favreau, J.J. Totah, Mouzam Makkar, Nina Wadia and guest star Mindy Kaling.\r\nCharlie Grandy and Mindy Kaling will write and executive produce. Michael Alan Spiller will direct and executive produce. Howard Klein also executive produces. “Champions” is produced by Universal Television, 3 Arts Entertainment, Eyes Up Productions and Kaling International.\r\n“WILL & GRACE”\r\nThat’s right, honey! A decade after their unforgettable eight-season run, comedy’s most fabulous foursome is back. Debra Messing, Eric McCormack, Sean Hayes and Megan Mullally reprise their infamous roles as Will, Grace, Jack and Karen in this exclusive 12-episode event. The legendary James Burrows, director of every original “Will & Grace” episode, returns along with a slew of razor-sharp jabs and dirty martinis. Behold once again, from the minds of Max Mutchnick and David Kohan, TV’s wittiest ensemble ever. \r\nThe cast includes Debra Messing, Eric McCormack, Sean Hayes and Megan Mullally.\r\nMax Mutchnick and David Kohan will write and executive produce. Alex Herschlag, Tracy Poust & Jon Kinnally also executive produce. James Burrows will direct and executive produce. “Will & Grace” is produced by Universal Television.\r\nALTERNATIVE\r\n“THE AWESOME SHOW”\r\nFrom executive producer/host Chris Hardwick (“The Wall”), executive producer Mark Burnett (“The Voice”) and Silicon Valley’s Singularity University comes a new series that will showcase the groundbreaking scientific and technological advances that are shaping the future, as well as celebrate the pioneers and communities at the forefront of this golden age of unprecedented discovery, innovation and opportunity. Each episode of “The Awesome Show” will be a rollercoaster ride through the world of innovation as told by the people who are shaping it and whose lives are affected by it. The series will highlight stories of revolutionary scientific and technological advances and will marvel at mankind’s tremendous feats, both now and in the future.\r\nMark Burnett, Chris Hardwick and Alex Murray executive produce. “The Awesome Show” is produced by Universal Television Alternative Studio in association with Brillstein Entertainment Partners and Fish Ladder. \r\n“ELLEN’S GAME OF GAMES”\r\nThe one and only Ellen DeGeneres returns to primetime to host an exciting new game show that’s one big party! Featuring super-sized versions of some of the most beloved games from “The Ellen DeGeneres Show,” as well as new ones, contestants will be pulled from the studio audience to maneuver massive obstacles while answering trivia questions, all under the pressure of Ellen’s mischievous and hilarious antics. With DeGeneres’ witty and comedic sensibility plus fun-filled games, each episode is sure to entertain the entire family and deliver lots of laughs. One lucky contestant will get the chance to win the grand prize, but everyone will have a blast!\r\nEllen DeGeneres, Jeff Kleeman, Ed Glavin, Mary Connelly, Andy Lassner, Kevin Leman and David A. Hurwitz executive produce. Russell Norman directs. “Ellen’s Game of Games” is produced by Warner Horizon Unscripted in association with A Very Good Production and Telepictures. \r\n“GENIUS JUNIOR”\r\nNo stranger to young geniuses, Neil Patrick Harris hosts an exciting new game show that celebrates the smartest kids in America. These talented “genius juniors” will team up to take on mind-blowing tests of logic, math, memory, spelling and more. Through escalating rounds, they will be tested in each area of the brain, culminating in an ultimate challenge to be crowned the smartest and brightest. The winning team will take home a life-changing prize — setting the stage for a big, bright future ahead.\r\nNeil Patrick Harris, Pam Healey, John Hesling, Phil Parsons and Ed Egan executive produce. “Genius Junior” is produced by Shed Media in association with Prediction Productions.\r\n “THE HANDMADE PROJECT”\r\nFrom executive producer and host Amy Poehler and co-host Nick Offerman comes a lighthearted competition celebrating the creativity and craftiness in all of us. Each week, eight amateur makers will take on a series of projects they must complete in their own unique way. As the competition escalates, the amateurs will be challenged to master progressively difficult skills, culminating in a final craft-off between the most creative and tenacious contestants. Shot in a serene outdoor setting, this friendly competition will focus on the character and camaraderie of DIY culture – and through it all, Poehler and Offerman will provide encouragement, guidance and plenty of laughs.\r\nAmy Poehler, Brooke Posch, Nicolle Yaron, Nick Offerman, Dave Becky and Anthony Dominici executive produce. “The Handmade Project” is produced by Universal Television Alternative Studio in association with Paper Kite Productions.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1494779456.0, "source": "https://variety.com", "summary": ""}