{"url": "en.wikipedia.org/wiki/Julia_Roberts", "text": "This article is about the American actress. For other people with the same name, see Julia Roberts (disambiguation) . For the American country music singer, see Julie Roberts . For the British jazz, rock and house music singer, see Juliet Roberts\n\nAmerican actress and producer\n\nJulia Fiona Roberts (born October 28, 1967)[1] is an American actress and producer. She established herself as a leading lady in Hollywood after headlining the romantic comedy film Pretty Woman (1990), which grossed $464 million worldwide. She has won three Golden Globe Awards, from eight nominations, and has been nominated for four Academy Awards for her film acting, winning the Academy Award for Best Actress for her performance in Erin Brockovich (2000).\n\nHer films have collectively brought box office receipts of over US$2.8 billion, making her one of the most bankable actresses in Hollywood.[2] Her most successful films include Mystic Pizza (1988), Steel Magnolias (1989), Pretty Woman (1990), Sleeping with the Enemy (1991), The Pelican Brief (1993), My Best Friend's Wedding (1997), Notting Hill (1999), Runaway Bride (1999), Erin Brockovich (2000), Ocean's Eleven (2001), Ocean's Twelve (2004), Charlie Wilson's War (2007), Valentine's Day (2010), Eat Pray Love (2010), Money Monster (2016), and Wonder (2017). Roberts was nominated for the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie for her performance in the HBO television film The Normal Heart (2014). In 2018, she starred in the Prime Video psychological thriller series Homecoming.\n\nRoberts was the highest-paid actress in the world throughout most of the 1990s[3][4] and in the first half of the 2000s.[5] Her fee for 1990's Pretty Woman was US$300,000;[6] in 2003, she was paid an unprecedented $25 million for her role in Mona Lisa Smile (2003). As of 2017 , Roberts's net worth was estimated to be $170 million.[7] People magazine has named her the most beautiful woman in the world a record five times.[8]\n\nEarly life and family\n\nRoberts was born on October 28, 1967, in Smyrna, Georgia,[1][9] to Betty Lou Bredemus (1934–2015) and Walter Grady Roberts (1933–1977).[1][9][10] She is of English, Scottish, Irish, Welsh, German, and Swedish descent.[11][12] Her father was a Baptist, her mother a Catholic,[13] and she was raised Catholic.[14][15] Her older brother Eric Roberts (b. 1956), from whom she was estranged for several years until 2004, older sister Lisa Roberts Gillan (b. 1965), and niece Emma Roberts, are also actors. She also had a younger half-sister named Nancy Motes (1976–2014).\n\nRoberts' parents, one-time actors and playwrights, met while performing in theatrical productions for the armed forces. They later co-founded the Atlanta Actors and Writers Workshop in Atlanta, off Juniper Street in Midtown. They ran a children's acting school in Decatur, Georgia, while they were expecting Julia. The children of Martin Luther King, Jr. and Coretta Scott King attended the school; Walter Roberts was their daughter, Yolanda Denise King's, acting coach.[16] As a thank-you for his service, Mrs. King paid Mrs. Roberts's hospital bill when Julia was born.[17]\n\nHer parents married in 1955. Her mother filed for divorce in 1971; the divorce was finalized in early 1972.[18] From 1972, Roberts lived in Smyrna, Georgia, where she attended Fitzhugh Lee Elementary School, Griffin Middle School, and Campbell High School.[19] In 1972, her mother married Michael Motes, who was abusive and often unemployed; Roberts despised him.[20] The couple had Nancy, who died at 37 on February 9, 2014, of an apparent drug overdose.[21] The marriage ended in 1983, with Betty Lou divorcing Motes on cruelty grounds; she had stated that marrying him was the biggest mistake of her life.[20] Roberts's own father died of cancer when she was ten.[22]\n\nRoberts wanted to be a veterinarian as a child.[23] She also played the clarinet in her school band.[24][25] After graduating from Smyrna's Campbell High School, she attended Georgia State University but did not graduate. She later headed to New York City to pursue a career in acting. Once there, she signed with the Click Modeling Agency and enrolled in acting classes.[26][27]\n\nActing career\n\n1980s\n\nRoberts made her first big screen appearance in the film Satisfaction (1988), alongside Liam Neeson and Justine Bateman, as a band member looking for a summer gig. She had previously performed a small role opposite her brother Eric, in Blood Red (she has two words of dialogue), filmed in 1987, although it was not released until 1989. Her first television appearance was as a juvenile rape victim in the initial season of the series Crime Story with Dennis Farina, in the episode titled \"The Survivor\", broadcast on February 13, 1987. Her first critical success with moviegoers was her performance in the independent film Mystic Pizza in 1988;[28] that same year, she had a role in the fourth-season finale of Miami Vice. In 1989, she was featured in Steel Magnolias, as a young bride with diabetes, and received both her first Academy Award nomination (as Best Supporting Actress) and first Golden Globe Award win (Motion Picture Best Supporting Actress) for her performance.[28]\n\n1990s\n\nRoberts became known to worldwide audiences when she starred with Richard Gere in the Cinderella–Pygmalionesque story, Pretty Woman, in 1990, playing an assertive freelance hooker with a heart of gold.[28] Roberts won the role after Michelle Pfeiffer, Molly Ringwald, Meg Ryan, Jennifer Jason Leigh, Karen Allen, and Daryl Hannah (her co-star in Steel Magnolias) turned it down.[29] The role also earned her a second Oscar nomination, this time as Best Actress, and second Golden Globe Award win, as Motion Picture Best Actress (Musical or Comedy).[28] Pretty Woman saw the highest number of ticket sales in the U.S. ever for a romantic comedy,[30] and made US$463.4 million worldwide.[31]\n\nRoberts starred as one of five students conducting clandestine experiments that produce near-death experiences in the supernatural thriller Flatliners, in 1990. Her next film was the commercially successful thriller Sleeping with the Enemy (1991), in which she took on the role of a battered wife who escapes her abusive husband, played by Patrick Bergin, and begins a new life in Iowa. Roberts played Tinkerbell in Steven Spielberg's Hook, and starred as a nurse in Joel Schumacher's romance film Dying Young; both films were also released in 1991, to a highly positive commercial response.[32][33]\n\nRoberts took a two-year hiatus from the screen, during which she made no films other than a cameo appearance in Robert Altman's The Player (1992). In early 1993, she was the subject of a People magazine cover story asking, \"What Happened to Julia Roberts?\".[34] Roberts starred with Denzel Washington in the thriller The Pelican Brief (1993), based on John Grisham's 1992 novel of the same name.[28] In it, she played a young law student who uncovers a conspiracy, putting herself and others in danger. The film was a commercial success, grossing US$195.2 million worldwide.[35][36] None of her next film releases – I Love Trouble (1994), Prêt-à-Porter (1994) and Something to Talk About (1995) – were particularly well-received by critics.[37][38][39] In 1996, she guest-starred in the second season of Friends (episode 13, \"The One After the Superbowl\"),[40] and appeared with Liam Neeson in the historical drama Michael Collins,[28] portraying Kitty Kiernan, the fiancée of the assassinated Irish revolutionary leader. Stephen Frears' Mary Reilly, her other 1996 film, was a critical and commercial failure.[41][42]\n\nBy the late 1990s, Roberts enjoyed renewed success in the romantic comedy genre. In My Best Friend's Wedding (1997), she starred opposite Dermot Mulroney, Cameron Diaz and Rupert Everett, as a food critic who realizes she's in love with her best friend and tries to win him back after he decides to marry someone else. The film was a global box-office hit[43] and is considered to be one of the best romantic comedy films of all time.[44][45] In 1998, Roberts appeared on Sesame Street opposite the character Elmo, and starred in the drama Stepmom, alongside Susan Sarandon,[46] revolving around the complicated relationship between a terminally-ill mother and the future stepmother of her children. While reviews were mixed,[46] the film made US$159.7 million worldwide.[47]\n\nRoberts paired with Hugh Grant for Notting Hill (1999), portraying a famous actress falling in love with a struggling book store owner. The film displaced Four Weddings and a Funeral as the biggest British hit in the history of cinema, with earnings equalling US$363 million worldwide.[48] An exemplary of modern romantic comedies in mainstream culture, the film was also received well by critics. CNN reviewer Paul Clinton called Roberts \"the queen of the romantic comedy [whose] reign continues\", and remarked: \"Notting Hill stands alone as another funny and heartwarming story about love against all odds.\"[49] She reunited with Richard Gere and Garry Marshall, both of Pretty Woman, to play a woman who has left a string of fiancés at the altar in Runaway Bride, also released in 1999. Runaway Bride received generally mixed reviews from critics,[50][51][52][53] but it did very well at the box office, grossing US$309.4 million around the globe.[54] Roberts was a guest star on the episode \"Empire\", of the television series Law & Order, with regular cast member Benjamin Bratt (at that time her boyfriend). She earned a nomination for Primetime Emmy Award for Outstanding Guest Actress in a Drama Series.[55]\n\n2000s\n\nIn 2000, Roberts portrayed real-life environmental activist Erin Brockovich in her fight against the Pacific Gas and Electric Company (PG&E) of California in the film Erin Brockovich, for which she received US$20 million;[56] Rolling Stone magazine's Peter Travers wrote, \"Roberts shows the emotional toll on Erin as she tries to stay responsible to her children and to a job that has provided her with a first taste of self-esteem\",[57] while Entertainment Weekly critic Owen Gleiberman felt that it was a \"delight to watch Roberts, with her flirtatious sparkle and undertow of melancholy\".[58] Erin Brockovich made US$256.3 million worldwide,[59] and Roberts won the Academy Award for Best Actress for her role. In December 2000, Roberts, who had been the highest-paid actress through the 1990s, became the first actress to make The Hollywood Reporter's list of the 50 most influential women in show business since the list had begun in 1992.[3]\n\nRoberts' first film following Erin Brockovich was the road gangster comedy, The Mexican (2001), giving her a chance to work with long-time friend Brad Pitt. The film's script was originally intended to be filmed as an independent production without major motion picture stars, but Roberts and Pitt, who had for some time been looking for a project they could do together, learned about it and decided to sign on. Though advertised as a typical romantic comedy star vehicle, the film does not focus solely on the Pitt/Roberts relationship and the two shared relatively little screen time together. The Mexican earned $66.8 million at the U.S. box office.[60]\n\nHer next film, the romantic comedy America's Sweethearts (also 2001), starred Roberts along with Billy Crystal, John Cusack, and Catherine Zeta-Jones. Directed by Joe Roth, the Hollywood farce centers on a supercouple, Gwen and Eddie, who separate when she dumps him for another man. Roberts portrayed Gwen's once-overweight sister and assistant who has been secretly in love with Eddie (Cusack) for years. Reviews of the film were generally unfavorable: critics' felt that despite its famous cast, the movie lacked \"sympathetic characters\" and was \"only funny in spurts.\"[61] A commercial success, it grossed over US$138 million worldwide, however.[62]\n\nIn fall 2001, Roberts teamed with Erin Brockovich director Steven Soderbergh for Ocean's Eleven, a comedy-crime caper film and remake of the 1960 Rat Pack film of the same name, featuring an ensemble cast including George Clooney, Brad Pitt, and Matt Damon. Roberts played Tess Ocean, the ex-wife of leader Danny Ocean (Clooney), originally played by Angie Dickinson, who is dating a casino owner played by Andy García. A success with critics and at the box office alike, Ocean's Eleven became the fifth highest-grossing film of the year with a total of US$450 million worldwide.[63]\n\nIn 2003, Roberts was cast in Mike Newell's drama film Mona Lisa Smile, also starring Kirsten Dunst, Maggie Gyllenhaal, and Julia Stiles. Roberts received a record US$25 million for her portrayal of a forward-thinking art history professor at Wellesley College in 1953 – the highest ever earned by an actress until then.[64] The film garnered largely lukewarm reviews by critics, who found it \"predictable and safe\".[65]\n\nEat Pray Love, September 2010 Roberts in Paris promoting, September 2010\n\nIn 2004, Roberts replaced Cate Blanchett in Mike Nichols's Closer, a romantic drama film written by Patrick Marber, based on his award-winning 1997 play of the same name.[66] The film also starred Jude Law, Natalie Portman, and Clive Owen.[66] Also in 2004, she reprised the role of Tess Ocean in the sequel Ocean's Twelve. The film was deliberately much more unconventional than the first, epitomized by a sequence in which Roberts' character impersonates the real-life Julia Roberts, due to what the film's characters believe is their strong resemblance.[67] Though less well reviewed than Eleven, the film became another major success at the box office, with a gross of US$363 million worldwide, mostly from its international run.[68] Unlike all the male cast members, Roberts did not appear in the series' third and final installment, Ocean's Thirteen (2007), due to script issues.[69] In 2005, she was featured in the music video for the single \"Dreamgirl\" by the Dave Matthews Band; it was her first music video appearance.[70] Roberts appeared in The Hollywood Reporter's list of the 10 highest-paid actresses every year from 2002 (when the magazine began compiling its list) to 2005.[5]\n\nBesides providing her voice for roles in the 2006 animated films The Ant Bully and Charlotte's Web,[71][72] Roberts made her Broadway debut on April 19, 2006, as Nan in a revival of Richard Greenberg's 1997 play Three Days of Rain opposite Bradley Cooper and Paul Rudd. Although the play grossed nearly US$1 million in ticket sales during its first week[73] and was a commercial success throughout its limited run, her performance drew criticism. Ben Brantley of The New York Times described Roberts as being fraught with \"self-consciousness (especially in the first act) [and] only glancingly acquainted with the two characters she plays.\"[74] Brantley also criticized the overall production, writing that \"it's almost impossible to discern its artistic virtues from this wooden and splintered interpretation, directed by Joe Mantello.\"[74] Writing in the New York Post, Clive Barnes declared, \"Hated the play. To be sadly honest, even hated her. At least I liked the rain—even if three days of it can seem an eternity.\"[75]\n\nHer next film was Charlie Wilson's War, with Tom Hanks and Philip Seymour Hoffman, directed by Mike Nichols; Roberts played socialite Joanne Herring, the love interest of Democratic Texas Congressman Charles Wilson. It was released on December 21, 2007,[76] to critical acclaim,[77] with Roberts eventually earning her sixth Golden Globe nomination.[78] Fireflies in the Garden, an independent drama in which Roberts played a mother whose death sets the story in motion, also starred Ryan Reynolds and Willem Dafoe; the film was screened at the 2008 Berlin International Film Festival and was subsequently shown in European cinemas—it did not get a North American release until 2011.[79] In 2009, Roberts starred with Clive Owen in the moderately successful comic thriller Duplicity, playing a CIA agent collaborating with another spy to carry out a complicated con.[80] For her performance, she received her seventh Golden Globe nomination. Also in 2009, Lancôme announced that Roberts would become their global ambassador for their company.[81]\n\n2010s\n\nIn 2010, Roberts played an U.S. Army captain on a one-day leave, as part of a large ensemble cast, in the romantic comedy Valentine's Day, and starred as an author finding herself following a divorce in the film adaptation of Eat Pray Love. While she received US$3 million up front against 3 percent of the gross for her six-minute role in Valentine's Day,[82] Eat Pray Love had the highest debut at the box office for Roberts in a top-billed role since America's Sweethearts.[83][84] Later in the year, she signed a five-year extension with Lancôme for US$50 million.[85]\n\nIn 2011, she appeared as a college teacher and the love interest of a middle-aged man returning to education in the romantic comedy Larry Crowne, opposite Tom Hanks, who directed and played the title role.[86] The movie received generally mediocre reviews with only 35% of the 175 Rotten Tomatoes reviews giving it high ratings,[87] although Roberts's comedic performance was praised.[88] In Mirror Mirror (2012), the Tarsem Singh adaptation of Snow White, Roberts portrayed Queen Clementianna, Snow White's evil stepmother, opposite Lily Collins.[89]\n\nIn 2013, Roberts starred alongside Meryl Streep and Ewan McGregor in the black comedy drama August: Osage County, about a dysfunctional family that re-unites into the familial house when their patriarch suddenly disappears.[90] Her performance earned her nominations for the Golden Globe Award, Screen Actors Guild Award, Critics' Choice Award, and Academy Award for Best Supporting Actress, amongst other accolades.[91][92][93][94] It was her fourth Academy Award nomination.[95]\n\nIn 2014, Roberts starred as Dr. Emma Brookner, a character based on Dr. Linda Laubenstein,[96][97] in the television adaptation of Larry Kramer's AIDS-era play, The Normal Heart, which aired on HBO; the film was critically acclaimed and Vanity Fair, in its review, wrote: \"Roberts, meanwhile, hums with righteous, Erin Brokovich-ian anger. Between this and August: Osage County, she's carving out a nice new niche for herself, playing brittle women who show their love and concern through explosive temper\".[98] Her role garnered her a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie.[99] She also narrated \"Women in Hollywood\", an episode of the second season of Makers: Women Who Make America, in 2014.[100] In 2015, Roberts appeared in Givenchy's spring–summer campaign,[101][102] and starred as a grieving mother opposite Nicole Kidman and Chiwetel Ejiofor in the little-seen film Secret in Their Eyes, a remake of the 2009 Argentine film of the same name, both based on the novel La pregunta de sus ojos by author Eduardo Sacheri.[103]\n\nIn 2016, she reunited with Garry Marshall again to appear as an accomplished author who gave her child for adoption in the romantic comedy Mother's Day, opposite Jennifer Aniston, Kate Hudson, Jason Sudeikis, and Timothy Olyphant. The film received \"overwhelmingly negative reviews\", but budgeted at US$25 million, was a moderate box office success, grossing US$48.5 million.[104] She also starred as a television director in the thriller Money Monster, directed by Jodie Foster and alongside George Clooney and Jack O'Connell.[105][106][107]\n\nIn Wonder (2017), the film adaptation of the 2012 novel of the same name by R. J. Palacio, Roberts played the mother of a boy with Treacher Collins syndrome.[108] The Times felt Roberts \"lifts every one of her scenes in Wonder to near-sublime places\",[109] as part of a positive reception,[110] and with a worldwide gross of US$305.9 million, Wonder emerged as one of Roberts' most widely seen films.[111][111] Roberts took on the role of a caseworker at a secret government facility in her first television series, Homecoming, which premiered on November 2, 2018 on Amazon Video.[112]\n\nFilm production\n\nRoberts runs the production company Red Om Films (Red Om is \"Moder\" spelled backwards, after her husband's last name[113]) with her sister, Lisa Roberts Gillan, and Marisa Yeres Gill.[114] Through Red Om, Roberts served as an executive producer of the first four films of the American Girl film series (based on the American Girl line of dolls), released between 2004 and 2008.[115]\n\nPersonal life\n\nRelationships and marriages\n\nRoberts had romantic relationships with actors Jason Patric, Liam Neeson, Kiefer Sutherland, Dylan McDermott, and Matthew Perry.[116][117] She was briefly engaged to Sutherland; they broke up three days before their scheduled wedding on June 11, 1991.[118] On June 25, 1993, she married country singer Lyle Lovett; the wedding took place at St. James Lutheran Church in Marion, Indiana.[119] They separated in March 1995 and subsequently divorced.[120] From 1998 to 2001, Roberts dated actor Benjamin Bratt.[121]\n\nRoberts and her husband, cameraman Daniel Moder, met on the set of her film The Mexican in 2000 while she was still dating Bratt. At the time, Moder was married to Vera Steimberg. He filed for divorce a little over a year later, and after it was finalized, he and Roberts wed on July 4, 2002,[122] at her ranch in Taos, New Mexico.[123] Together, they have three children: twins, a daughter and a son, born in November 2004,[124] and another son born in June 2007.[125]\n\nReligious beliefs\n\nIn 2010, Roberts said she was Hindu.[126] Roberts is a devotee of the guru Neem Karoli Baba (Maharaj-ji), a picture of whom drew Roberts to Hinduism.[127]\n\nIn September 2009, Swami Daram Dev of Ashram Hari Mandir in Pataudi, where Roberts was shooting Eat Pray Love, gave her children new names after Hindu gods: Laxmi for Hazel, Ganesh for Phinnaeus and Krishna Balram for Henry.[128]\n\nPhilanthropy\n\nRoberts has given her time and resources to UNICEF as well as to other charitable organizations. On May 10, 1995, Roberts arrived in Port-au-Prince, as she said, \"to educate myself\".[129][130] The poverty she found was overwhelming. \"My heart is just bursting\", she said.[129] UNICEF officials hoped that her six-day visit would trigger an outburst of giving: US$10 million in aid was sought at the time.[129][130]\n\nIn 2000, Roberts narrated Silent Angels, a documentary about Rett syndrome, a neurodevelopmental disorder.[131] The documentary was designed to help raise public awareness about the disease. In July 2006, Roberts became a spokeswoman for Earth Biofuels, as well as chair of the company's newly formed Advisory Board promoting the use of renewable fuels.[132] She supported Gucci's \"Chime For Change\" campaign that aims to spread female empowerment.[133]\n\nRoberts was the voice of Mother Nature in a 2014 short film for Conservation International, intended to raise awareness about climate change.[134]\n\nAwards and nominations\n\nFilmography\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/JuliaRoberts12.JPG/220px-JuliaRoberts12.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/5/54/Julia_Roberts_%2843838880775%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Julia_Roberts_2010.jpg/170px-Julia_Roberts_2010.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Julia_Roberts_%2843838880775%29.jpg/220px-Julia_Roberts_%2843838880775%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Ocean%27s11Cast.jpg/220px-Ocean%27s11Cast.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Julia_Roberts_2011_Shankbone_3.JPG/220px-Julia_Roberts_2011_Shankbone_3.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/54/Julia_Roberts_%2843838880775%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Julia_Roberts", "title": "Julia Roberts", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/5/54/Julia_Roberts_%2843838880775%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}