{"url": "https://www.theroot.com/why-are-tlc-going-on-tour-with-the-dude-from-sugar-ray-1793501848", "text": "Vince Bucci/Getty Images\n\nLast month, TLC celebrated the 25th anniversary of their groundbreaking debut album, Ooooooohhh ... on the TLC Tip.\n\nAdvertisement\n\nOoooooohhh... On the TLC Tip at 25 TLC touched down at the tail end of 1991 in a neon blaze, and it took a minute for people’s eyes to Read more\n\nLast week, TLC announced that they’ll be headlining the “I Love the 90’s Tour: The Party Continues,” which will feature Montell Jordan, Sugar Ray’s Mark McGrath, Naughty by Nature and Biz Markie. Presently, I’m wondering how a group that had one of the most infamous episodes of Behind the Music morphed into an edition of Unsung.\n\nAdvertisement\n\nIt’s no disrespect to the other acts on the bill, but as good as an idea about a novelty tour themed around the 1990s is, it feels like an odd fit for a group that sold 75 million albums and has been touted as the biggest-selling girl group of all time behind the Spice Girls.\n\n\n\nIf you switched out TLC for 702, Kut Klose, Jade, Brownstone, Divine or En Vogue without Dawn Robinson and Maxine Jones, it would sound more reasonable. I like and still listen to many tracks from the aforementioned, but they’re not TLC. They’re not the group that owned much of the 1990s on their own accord and whose success spilled over into the early 2000s before the untimely death of their third member, Lisa “Left Eye” Lopes.\n\nIn a press release about the upcoming tour, TLC’s remaining members, T-Boz and Chilli, stated: “We’re so excited to get back on the road this summer and give our fans some new TLC music along with our original hits. Being able to headline this tour with our friends and peers from the ’90s is SO AMAZING!”\n\nThe new music in question will come from their forthcoming album that the group used Kickstarter to raise funds to record. However, back in 2013, after releasing the trailer to their VH1 biopic, CrazySexyCool: The TLC Story, TLC announced that they had signed a deal with Epic Records—a deal that would offer an album primarily handled by longtime producer Dallas Austin. It also promised new songs written by Lady Gaga and Ne-Yo, and would feature contributions from Drake and J. Cole. What we got instead was yet another greatest-hits album and rumors that the women were dropped over their portrayal of their former manager, Pebbles, in the film.\n\nWhere did the album go? As for the fan-funded project, the Kickstarter campaign for it was launched in January 2015. It exceeded its contribution goal and gained widespread coverage after contemporary artists like Katy Perry donated money and publicity to the effort. But that album was set to drop by the end of that year, and only now will fans get what was promised by summer.\n\n\n\nAdvertisement\n\nThat album, like the tour, comes across as a bit odd, given the group’s stature at varying points at the peak of their career.\n\nI remember once going to the 1995 Budweiser Superfest to see TLC, Boyz II Men, Mary J. Blige and Montell Jordan perform. TLC ended up canceling their spot, so for some tourgoers, they’ll finally get to enjoy same-night performances of “Red Light Special” and “Somethin 4 Da Honeyz.” Still, when you think about the other acts on that bill who didn’t record a bop with Master P, you will see how, in comparison, they have managed to avoid going on tour with the dude from Sugar Ray.\n\n\n\nAdvertisement\n\nBoyz II Men are long past their peak, but they have consistently toured the world for years and now have a Las Vegas residency. Blige has been consistent for more than 25 years and enjoys a career that includes recording Christmas songs with Barbra Streisand that get played nonstop at Macy’s during the holidays. Blige also still releases singles that get airplay—singles that make her sound like Bryson Tiller’s auntie who aims to show her how to do the style she helped create. But hey, MJB has always kept cultural relevancy in her back pocket.\n\nEven last year’s Bad Boy Reunion Tour was presented as a much bigger deal.\n\n\n\nIn comparison, the anniversary of TLC’s debut album sort of came and went, and now they’re about to do a throwback-themed tour. Then again, it sort of makes sense because since the early 2000s, TLC have relied on a lot of gimmicks that have arguably soiled their legacy. Gimmicks like the 2005 UPN reality series R U the Girl, a show originally believed to be a contest that would allow the winner to join TLC full time but later proved to be nothing more than a contest whose winner provided guest vocals on a new single from T-Boz and Chilli.\n\nAdvertisement\n\nNeither T-Boz nor Chilli got to release full-fledged solo projects (not for lack of trying). On that, know that I will never forgive you people for not supporting T-Boz’s single “Touch Myself.”\n\n\n\nInterestingly enough, back in 2015, while talking about their Kickstarter album and touring with New Kids on the Block (also a peculiar pairing), T-Boz had this to say about the lack of legends today: “There used to be way more superstars back in the day than there are now. Now they’re sprinkled here and there. Like Beyoncé is doing well and Rihanna has great songs, but you don’t hear about great superstars like how it used to be.”\n\nAdvertisement\n\nThis isn’t the first time these two have made questionable comments about either artist. In 2014, T-Boz and Chilli did an interview with an Australian TV station and said this of Rihanna: “It’s easy to sell sex. We became the biggest girl selling group of all time with our clothes on and that says a lot. We could go around, too, with booby cakes out all day long.”\n\nTLC talked about multiple topics and, to their credit, were progressive and forward-thinking in a lot of their earlier works. Even so, raggedy men with limp dicks and dudes in general who simply can’t fuck remained a constant throughout their catalog. They also have plenty of sex-related material, like “This Is How It Works,” one of their best songs. You can talk about sex, but Rihanna and other artists can’t be topless every now and again?\n\nAdvertisement\n\nAnd as such, Rihanna was right when she posted a picture of TLC posing topless. Plus, this tweet: “When there’s no changing the fact that I’m me, and they’re well ... they’re them.” T-Boz would later deny talking about her.\n\n\n\nEven so, I recall Chilli taking to Twitter to ask people to not bring “Bey, ‘B’, queen B, or any variation ... of the word Beyoncé” into 2014. It’s not the first time that Chilli has publicly sniped about Beyoncé, but if there’s one thing I wish for Rihanna and Beyoncé, it’s that they never be as publicly petty toward those that come after them.\n\nAdvertisement\n\nTLC are legends, but when it comes to what’s happened to the group’s stature since the death of Left Eye, it reads as a long list of don’ts for the large acts of today. Don’t do a fake-replacement-member-themed reality show. Don’t talk too crazy about Pebbles if her ex-husband is the plug. Don’t trash the huge acts of today who are actually bigger than you’ve ever been, good old days of diamond-selling albums or not.\n\nFor those who attend the tour, have the time of your life. TLC still performs well. Nonetheless, for quite some time now, TLC has moved in ways that make me feel like, “Damn, homie. In high school you was the main, homie.” May Beyoncé and Rihanna never do an “I Love the 2010s Tour” with Meghan Trainor, two of the remaining members of Fifth Harmony and Jason Derulo.\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qjbzhsfi4hf3qmfj1csv.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qjbzhsfi4hf3qmfj1csv.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.theroot.com/why-are-tlc-going-on-tour-with-the-dude-from-sugar-ray-1793501848", "title": "Why Are TLC Going on Tour With the Dude From Sugar Ray?", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/f5zr3vuc90hrpnmx0nme.png", "keywords": "Culture, Beyonce, Rihanna, TLC, I Love The 90s Tour, I love the 90s Tour: The Party Continues, T-boz, Chili, left eye, sugar ray, biz markie, naughty by nature, The Root", "news_keywords": "Culture, Beyonce, Rihanna, TLC, I Love The 90s Tour, I love the 90s Tour: The Party Continues, T-boz, Chili, left eye, sugar ray, biz markie, naughty by nature, The Root", "twitter": {"url": "https://www.theroot.com/why-are-tlc-going-on-tour-with-the-dude-from-sugar-ray-1793501848", "card": "summary_large_image", "site": "@TheRoot", "title": "Why Are TLC Going on Tour With the Dude From Sugar Ray?", "description": "Last month, TLC celebrated the 25th anniversary of their groundbreaking debut album, Ooooooohhh ... on the TLC Tip.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qjbzhsfi4hf3qmfj1csv.jpg"}, "description": "Last month, TLC celebrated the 25th anniversary of their groundbreaking debut album, Ooooooohhh ... on the TLC Tip.", "og": {"title": "Why Are TLC Going on Tour With the Dude From Sugar Ray?", "type": "article", "url": "https://www.theroot.com/why-are-tlc-going-on-tour-with-the-dude-from-sugar-ray-1793501848", "description": "Last month, TLC celebrated the 25th anniversary of their groundbreaking debut album, Ooooooohhh ... on the TLC Tip.", "locale": "en_US", "site_name": "The Root", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qjbzhsfi4hf3qmfj1csv.jpg"}, "fb": {"app_id": 216290255435043, "pages": 26423400230}}, "movies": ["/ajax/inset/iframe?id=youtube-video-AqkI6tLv-l8&start=0"], "publish_date": null, "source": "https://www.theroot.com", "summary": ""}