{"url": "www.courts.ca.gov/selfhelp-conservatorship.htm", "text": "A mental health (LPS) conservatorship makes one adult (called the “conservator”) responsible for a mentally ill adult (called the “conservatee”). LPS conservatorships MUST be started by a local government agency, usually a county’s Public Guardian or Public Conservator.\n\nLPS conservatorships last for only 1 year. If they are needed longer than that, they must be restarted and the conservator must be reappointed by the court. The government agency may recommend that a family member of the conservatee be appointed as LPS conservator, but this happens usually only after the first year.\n\n\n\nThese conservatorships are only for adults who are gravely disabled as a result of a mental illness listed in the Diagnostic and Statistical Manual of Mental Disorders (DSM). The most common mental illnesses are serious, biological brain disorders, like:\n\nSchizophrenia,\n\nBipolar disorder (manic depression),\n\nSchizo-affective disorder,\n\nClinical depression, and\n\nObsessive-compulsive disorder.\n\nLPS conservatorships are not for people with organic brain disorders, brain trauma, developmental disability, alcohol or drug addiction, or dementia, unless they also have one of the serious mental illnesses listed in the DSM.\n\n\n\n\n\n\n\nDuties and Responsibilities of an LPS Conservator\n\nAn LPS conservatorship gives legal authority to the conservator to make certain decisions for a conservatee who is unable to take care of himself or herself. If asked, the court can give an LPS conservator the duty to take care of and protect the conservatee (conservator of the person) and also the power to handle the financial matters of the conservatee (conservator of the estate).\n\n\n\nThe conservator can consent to mental health treatment even if the conservatee objects. The conservator can agree to the use of psychotropic (mind-altering) drugs. However, the conservatee may refuse to take them if he or she is determined to have enough mental ability to make this decision knowingly and with enough understanding of the consequences.\n\n\n\nThe conservator can agree to place the mentally ill person in a locked facility if a psychiatrist says it is needed and the hospital agrees to take the person, whether or not the conservatee agrees. The conservator can decide where the mentally ill person will live when he or she is not in a locked psychiatric facility.\n\nThe LPS conservator can also make financial decisions for the conservatee, like paying the bills and collecting his or her assets and income.\n\nAn LPS conservator must have enough medical and social information before making decisions for the conservatee. And the conservator must only take actions that are in the best interest of the conservatee.", "images": ["http://www.courts.ca.gov/images/aoc-logo.png", "http://www.courts.ca.gov/images/centro-de-ayuda.jpg", "http://www.courts.ca.gov/images/icon-maginfyglass-18x18.png", "http://www.courts.ca.gov/images/shcflfmap.jpg", "http://www.courts.ca.gov/images/favicon.ico", "http://www.courts.ca.gov/images/LawLibrarianButton.jpg"], "top_img": "http://www.courts.ca.gov/images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "seniors_selfhelp", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "self help, california, conservatorship, senior help, senior housing, senior living, senior programs, guardianship, elder law, senior citizens law, senior conservatorship, guardianship forms, power of attorney"}, "movies": [], "publish_date": null, "source": "http://www.courts.ca.gov", "summary": ""}