{"url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/09/07/AR2009090702070.html?wprss=rss_opinions", "text": "A dangerous sentiment on the left threatens to derail what could be the biggest progressive achievement in half a century. It's the view that any health-care reform that doesn't include a public option isn't \"real\" reform and thus isn't worth doing. This mantra has become an article of faith among many Democrats who haven't necessarily thought through the matter but who take their cues from leaders advancing this argument. Unless liberals rethink this premise, and fast, Democrats will squander their best chance in a generation to end the scandal of the uninsured, bring health security to every American family and begin the long-term process of getting national health costs under control.\n\nThe first fallacy of the \"public option or nothing\" mantra is the notion that we'll never cover everyone without a Medicare-style program for Americans under 65. The experiences of Switzerland and the Netherlands prove that this isn't the case. Both have pioneered market-based universal health care. Both cover all their citizens using private insurers, and they do so for much less cost -- 10 percent of gross domestic product for the Dutch and 12 percent for Switzerland, compared with 17 percent in the United States, where nearly 50 million people are still uninsured.\n\nThose countries also boast better health outcomes than we do, even when compared to states with similar demographics, such as Connecticut and Massachusetts. Sick people in both countries are pursued as customers by private insurers (rather than shunned, as they are in the United States) because health plans are paid more for sick enrollees via a government-designed system of \"risk adjustment.\" The Swiss and Dutch achievements are important because conservative critics often act as though fully socialized systems, such as those in Britain and Canada, are the inevitable result of any drive for universal coverage. In fact, as these two countries show, it is possible to cover everyone without a \"big government takeover.\"\n\nA related fallacy is that the public option is the most important issue to debate. It's not. The central progressive breakthrough in any reform should be to make it possible for every American to access group health coverage outside the employment setting -- access that does not currently exist but which the proposed insurance exchanges would enable. What's critical, therefore, is the structure of these exchanges and the rules about who would be eligible to use them. Such questions have received disturbingly little attention but need to be front and center. For example, some legislation proposes barring people who enjoy employer-based coverage from seeking insurance from the new exchanges; this ban should be scrapped in favor of the proposal offered by Sen. Ron Wyden, under which employees could use the cash their companies spend on their benefits to buy coverage they prefer at the exchange.\n\nI respect those in my party who seek the single-payer system into which the public option might eventually evolve. But I don't agree that it's the best answer for the United States. Though single payer has merits, especially in administrative efficiency, it is also likely to freeze in place our fragmented, uncoordinated system of fee-for-service care. It would encourage providers to goose volume (to boost their incomes) rather than improve quality and would offer greater rewards for providers of acute care when we need a fresh focus on chronic disease management. Single payer also asks government to do things I don't think it is competent to do, such as setting prices across a large swath of the health sector in ways that seem certain to create damaging rigidities or resource misallocations (as happens in Medicare).\n\nFinally, if government is the sole payer, provider payments will become even more politicized than they are today. On the eve of beneficial innovations in drug therapies, devices and cost-effective ways to deliver better care, it is ill-advised to make the government's hand too rigid. Private health plans have many flaws, to be sure, but if sensibly regulated they're likely to respond more nimbly to disperse medical innovations.\n\nLiberals should make peace with the notion that a regulated market of competing private health plans can be the vehicle for getting everyone covered. Yes, it means that unlike some other advanced countries, we'll have billions of \"health\" dollars siphoned off by middlemen and marketers. But if liberals think of it as a jobs program, they'll learn to love it. If everyone's covered and insurer \"cherry-picking\" is dead, health insurance will come to look more like a regulated utility.\n\nThose on the left still seeking incentive should consider: In 2006, Sen. Ted Kennedy urged Massachusetts Democrats to support Mitt Romney's plan for universal coverage via a competing system of regulated private insurers, paired with an individual mandate and subsidies for low earners. Kennedy knew this would become a model for a bipartisan fix for the country. Now, a Kennedy-approved model is within reach. Liberals, far from resisting it as a setback, should celebrate it as a triumph.\n\nMatt Miller, a former Clinton White House aide, is a management consultant and the author of \"The Tyranny of Dead Ideas.\" In recent years he has advised and given paid speeches to doctor groups, hospitals, pharmaceutical firms and insurance companies, as well as to low-income advocacy groups promoting universal coverage.", "images": ["http://media3.washingtonpost.com/wp-srv/article/images/font_resize_large.gif", "http://media3.washingtonpost.com/wp-srv/article/images/font_resize_medium.gif", "http://media3.washingtonpost.com/wp-srv/article/images/font_resize_small.gif", "http://www.washingtonpost.com/wp-dyn/content/photo/2010/03/01/PH2010030102820.jpg", "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg"], "top_img": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg", "keywords": [], "authors": ["Matt Miller"], "canonical_link": "http://www.washingtonpost.com/wp-dyn/content/article/2009/09/07/AR2009090702070.html", "title": "Why the Public Option Isn't the Only Answer to Health-Care Reform", "meta_data": {"description": "Democrats would do well to reconsider the view that any health-care reform that doesn't include a public option isn't 'real' reform.", "DC.date.issued": "2009-09-08", "og": {"type": "article", "title": "Matt Miller - Why the Public Option Isn't the Only Answer to Health-Care Reform", "url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/09/07/AR2009090702070.html", "image": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg"}, "canonical_url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/09/07/AR2009090702070.html", "profile_description": "Democrats would do well to reconsider the view that any health-care reform that doesn't include a public option isn't 'real' reform.", "profile_picture": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg", "fb": {"app_id": 41245586762}}, "movies": [], "publish_date": 1252252800.0, "source": "http://www.washingtonpost.com", "summary": ""}