{"url": "https://web.archive.org/web/20180626015430/https://www.forbes.com/sites/scottmendelson/2018/06/25/fallen-kingdom-box-office-chris-pratt-bryce-dallas-howard-colin-trevorrow-ja-bayona-bd-wong-jurassic-world-3/", "text": "Universal\n\nJurassic World: Fallen Kingdom has earned $715 million worldwide, including $204m in China and a $148m domestic Fri-Sun debut weekend. It has already outgrossed (sans inflation) every Planet of the Apes movie, every King Kong or Godzilla movie and two out of the four previous Jurassic Park/Jurassic World flicks. The Legendary and Universal/Comcast Corp. flick is a big hit and likely headed for the $1 billion+ grossers club. So, yes, there will be a third Jurassic World movie, already dated for June 11, 2021. That’s a good thing too since Fallen Kingdom is essentially a feature-length set-up for what comes next.\n\nNo spoilers, but if you’ve seen Jurassic World: Fallen Kingdom you’ll know that the movie takes the franchise to a new status quo. Some of the excitement as that familiar John Williams tune (“Journey to the Island”) plays over the end credits is in wondering just how the next sequel will play out after this latest film’s game-changing finale. Then you realize that much of what you’ve seen has been a feature-length prologue for the next sequel. Jurassic World 2 spends two hours to get the chess pieces into position before promising that you’ll get the payoff in Jurassic World 3.\n\nThis kind of franchise filmmaking usually bugs the hell out of me. One of the things I appreciated about Jurassic World was that it was both a sequel to the Jurassic Park trilogy and a self-contained action-adventure movie that offered few clues about where the sequel might go. Whether or not Colin Trevorrow and friends had the long game mapped out or not, that first $1.672 billion-grossing summer sequel worked as a newbie-friendly popcorn entertainment first and as a world-building franchise installment second. To their credit, neither the filmmakers nor the studio dropped any sequel hints before or after Jurassic World opened.\n\nJ.A. Bayona’s Jurassic World: Fallen Kingdom, again written by Trevorrow and Derek Connelly, tries to have it both ways. It is a stand-alone adventure for folks who haven’t seen any of the Jurassic Park movies and for those who at least saw Jurassic Park and Jurassic World. But, as revealed in the third act, it is also feature-length set-up for the real game, a game that presumably begins in summer 2021. Jurassic World 3 is seemingly the movie that Trevorrow has been waiting to make from the beginning, and that Jurassic World and Fallen Kingdom were partially about getting the pieces into place.\n\nThat it gets away with this “don’t worry folks, you’ll get the movie you came to see next time” gambit is due to two particular factors.\n\nFirst, it works as a singular movie featuring Bryce Dallas Howard and Chris Pratt dealing with deadly dinos and duplicitous humans in a way that improves Jurassic World. If you thought that Clare and Owen were villains the last time, or that the dinosaurs should be left to die, this movie’s got your back. Even once it’s revealed as a feature-length prologue, it still offers plenty of in-the-moment thrills, chills and spills, along with some gorgeous widescreen cinematography that looks great in IMAX and Cinemark XD. It may be set up, but it’s a solid, three-star blockbuster in its own right.\n\nSecond, most importantly, we’re actually getting a sequel. The movie doesn’t spend its entire running time to set up a sequel that will never actually happen, since we all know there will be a “next time, on Jurassic World.” To be fair, this is a problem more common with origin story reboots or franchise-starters. Think Universal's Jem and the Holograms, WB's King Arthur: Legend of the Sword and Fox's Fantastic Four, where the entire “first” film is a pure set-up before we see the iconic characters as we wanted to see them, all ready to kick butt in a sequel that will never actually happen.\n\nJurassic World: Fallen Kingdom isn’t so different from “part two” sequels like Fox's Independence Day: Resurgence or Universal and Legendary's Pacific Rim: Uprising. They both end on a quasi-cliffhanger which promises a rather exciting and unique sequel that won’t actually happen since they bombed. Instead of making the \"neat new idea\" movie, they spent an entire sequel doing a poorly-received rehash of the first film to set up that third flick. It’s not quite the same, but imagine how much better Warner Bros./Time Warner Inc.'s Justice League would have performed if it was a “Justice League versus the Legion of Doom” movie teased by its post-credits sequence as opposed to a soft remake of The Avengers.\n\nFallen Kingdom still tells a story that is unique unto itself compared to its franchise predecessors. It starts off as an island adventure, shifts into an Indiana Jones-like second act and finally goes shockingly intimate and plays like a glorified haunted house movie in the finale. Oh, and since Jurassic World earned $1.672 billion three years ago, the filmmakers correctly had faith that enough moviegoers would show up to this one to justify at least a third installment. Unlike so many “you’ll get what you want next time” sequels and reboots, Treverrow, Bayona and friends wrote a check that they’ll be able to cash.\n\nI have no idea where the third film will go with this story and these characters, and that's pretty exciting. Unlike so many movies that promised a fantastic sequel fully aware that they might not get to make that movie, Jurassic World: Fallen Kingdom is a feature-length prologue to a film that will actually get made. It commits one of the gravest sins in franchise filmmaking but gets away with it just the same. That’s at least partially because they gave us a crowd-pleasing and standalone Jurassic World before getting into the long-term world-building. Jurassic World: Fallen Kingdom changed the game, but not before Jurassic World made sure that moviegoers wanted to play.", "images": ["https://web.archive.org/web/20180626015430im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F06%2FMV5BMjE0OTRmMWUtNDIzNS00NzQ1LWE2NzgtMTI2NjEwZGZmMzIyXkEyXkFqcGdeQXVyNjU2NTcyMzY%40._V1_.jpg", "https://web.archive.org/web/20180626015430im_/https://secure.gravatar.com/avatar/5e0887272964be6b258946209a00ffa2?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20180626015430im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F06%2FMV5BMjE0OTRmMWUtNDIzNS00NzQ1LWE2NzgtMTI2NjEwZGZmMzIyXkEyXkFqcGdeQXVyNjU2NTcyMzY%40._V1_.jpg", "keywords": [], "authors": ["Scott Mendelson"], "canonical_link": "https://web.archive.org/web/20180626015430/https://www.forbes.com/sites/scottmendelson/2018/06/25/fallen-kingdom-box-office-chris-pratt-bryce-dallas-howard-colin-trevorrow-ja-bayona-bd-wong-jurassic-world-3/", "title": "'Jurassic World 2' Broke A Key Rule Of Franchise Filmmaking And Got Away With It", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "'Jurassic World 2' Broke A Key Rule Of Franchise Filmmaking And Got Away With It", "image": "https://web.archive.org/web/20180626015430im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F06%2FMV5BMjE0OTRmMWUtNDIzNS00NzQ1LWE2NzgtMTI2NjEwZGZmMzIyXkEyXkFqcGdeQXVyNjU2NTcyMzY%40._V1_.jpg", "updated_time": "2018-06-25T13:12:26-04:00", "url": "https://web.archive.org/web/20180626015430/https://www.forbes.com/sites/scottmendelson/2018/06/25/fallen-kingdom-box-office-chris-pratt-bryce-dallas-howard-colin-trevorrow-ja-bayona-bd-wong-jurassic-world-3/", "description": "'Jurassic World 2' is a feature-length prologue for 'Jurassic World 3,\" but it works because we are absolutely getting a third 'Jurassic World.'", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "'Jurassic World 2' Broke A Key Rule Of Franchise Filmmaking And Got Away With It", "description": "'Jurassic World 2' is a feature-length prologue for 'Jurassic World 3,\" but it works because we are absolutely getting a third 'Jurassic World.'", "image": "https://web.archive.org/web/20180626015430im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F06%2FMV5BMjE0OTRmMWUtNDIzNS00NzQ1LWE2NzgtMTI2NjEwZGZmMzIyXkEyXkFqcGdeQXVyNjU2NTcyMzY%40._V1_.jpg", "creator": "@scottmendelson"}, "description": "'Jurassic World 2' is a feature-length prologue for 'Jurassic World 3,\" but it works because we are absolutely getting a third 'Jurassic World.'", "author": "Scott Mendelson", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Scott Mendelson", "section": "Business", "section_url": "https://www.forbes.com/media-entertainment/", "id": "blogAndPostId/blog/post/2595-51160", "published": "2018-06-25", "modified": "2018-06-25"}}, "movies": [], "publish_date": 1529856000.0, "source": "https://web.archive.org", "summary": ""}