{"url": "https://www.usatoday.com/story/life/movies/2017/05/03/joker-did-not-kill-heath-ledger-says-sister/101246100/", "text": "Andrea Mandell\n\nUSA TODAY\n\nAn untimely death, especially a famous one, can color the truth.\n\nI Am Heath Ledger, a new documentary about the actor supported by his family, dispels one common rumor: The Joker did not bring the Australian actor down.\n\n“Honestly, that’s been the biggest thing for us as a family,” says Kate Ledger, Heath’s elder sister, by phone. “He had an amazing sense of humor and certainly playing the Joker, for him it was one big gag. He had so much fun doing that. It was actually the exact opposite. There was no doom and gloom. ... That was a shock to me that people even thought that, really.”\n\nThe documentary hits theaters tonight (Wednesday) for one night only in partnership with Fathom Events, and then will air on Spike TV on May 17.\n\nLedger died on Jan. 22, 2008, at age 28 in New York City from an accidental overdose of prescription medication and sleeping aids. The role of the Joker would win him a posthumous Oscar for his work in The Dark Knight in 2009.\n\n“Like many of us, we read all sorts of insinuations online that Heath Ledger was taken down this dark spiral path to the depths of depression from his role as the Joker — this is the reason why we lost this bright star so early in his life,” says I Am Heath Ledger producer and co-director Derik Murray. “What was incredible, what was really quite amazing is that the truth behind that is so polar opposite.”\n\nI Am Heath Ledger begins during Ledger’s youth, utilizing hours of the actor’s own home videos. The film charts his quick rise in Hollywood. Less than a year after moving to Los Angeles, he booked the lead role in the 1999 hit teen rom-com 10 Things I Hate About You opposite Julia Stiles.\n\nThen Ledger pivoted, turning down opportunities like Spider-Man and making films that would lead him to work like Lords of Dogtown and his Oscar-nominated role in Brokeback Mountain.\n\n“As you see in the documentary, he could have very easily gone down that heartthrob career (path) and done a lot of those roles, and he chose not to right from the very beginning,\" says Kate. \"He wanted to be taken seriously as an actor. He was always in command of what he did. He wouldn’t just do something for the money.”\n\nKate Ledger says filmmakers have been knocking at her family’s door since her brother’s death, but it was the involvement of executive producer Matt Amato, her brother’s close friend, that gave them trust the documentary would be done right.\n\nPlus, they had Michelle Williams’ blessing. “We wouldn’t have done anything otherwise,” says Kate, revealing little about Ledger’s ex-girlfriend or their child together, Matilda (now 11), though she confirms the family sees both often. “I love them so much and I’m so protective of them that I don’t like to discuss them. Because it’s very private, their life, and I just like to keep it like that,” she says.\n\nThough Ledger’s parents, directors and friends (including Naomi Watts and Ben Harper) appear in the documentary, Williams does not. “She just felt she was not ready to be on camera and be talking about Heath, which we respected,” says Murray.\n\nToday, Kate Ledger says dealing with her brother’s death as the world watched nine years ago was indescribable.\n\n“It’s almost like two separate things. The shock itself was one thing and dealing with it in the public eyes was completely different — I actually can’t put it into words and I don’t think I’ll ever be able to,” says Ledger, who has since set up a scholarship in her brother’s name for emerging Australian talent. “Not too many people have to experience that. It’s hard enough to experience losing a loved one (without) doing it in front of everyone else. It’s horrendous.”", "images": ["https://www.gannett-cdn.com/-mm-/e53ebf636892716b2d5b22a986acd2d3a3dbeef6/c=0-25-358-227/local/-/media/2017/05/03/USATODAY/USATODAY/636294130388821015-I-AM-HEATH-photo.png?width=358&height=202&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/8da11378502b364fc0f9d780142c7a548c8ddd0c/c=0-0-358-477/local/-/media/2017/05/03/USATODAY/USATODAY/636294130388821015-I-AM-HEATH-photo.png?width=300&height=400&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/e53ebf636892716b2d5b22a986acd2d3a3dbeef6/c=0-25-358-227/local/-/media/2017/05/03/USATODAY/USATODAY/636294130388821015-I-AM-HEATH-photo.png?width=358&height=202&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/movies/2017/05/03/joker-did-not-kill-heath-ledger-says-sister/101246100/", "title": "'The Dark Knight's' Joker did not kill Heath Ledger, says sister", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'The Dark Knight's' Joker did not kill Heath Ledger, says sister", "description": "New documentary dispels myth that playing the Joker sent Ledger spiraling into depression.", "url": "https://www.usatoday.com/story/life/movies/2017/05/03/joker-did-not-kill-heath-ledger-says-sister/101246100/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/e53ebf636892716b2d5b22a986acd2d3a3dbeef6/c=0-25-358-227/local/-/media/2017/05/03/USATODAY/USATODAY/636294130388821015-I-AM-HEATH-photo.png?width=358&height=202&fit=crop&format=pjpg&auto=webp", "width": 358, "height": 202}, "type": "article"}, "article": {"author": "Andrea Mandell", "content_tier": "free", "opinion": "false"}, "description": "New documentary dispels myth that playing the Joker sent Ledger spiraling into depression.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/e53ebf636892716b2d5b22a986acd2d3a3dbeef6/c=0-25-358-227/local/-/media/2017/05/03/USATODAY/USATODAY/636294130388821015-I-AM-HEATH-photo.png?width=358&height=179&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'The Dark Knight's' Joker did not kill Heath Ledger, says sister", "description": "New documentary dispels myth that playing the Joker sent Ledger spiraling into depression."}}, "movies": [], "publish_date": 1493740800.0, "source": "https://www.usatoday.com", "summary": ""}