{"url": "https://people.com/parents/jessie-james-decker-eric-decker-more-kids/", "text": "Image zoom Jessie James Decker/Instagram\n\nJessie James Decker is lending her voice to a great cause.\n\nThe country pop singer, fashion designer, television star and Tide partner spoke to PEOPLE following her attendance at an event for Loads of Hope: a Tide’s community donation project held last Friday, designed to help give families a fresh start.\n\nGet push notifications with news, features and more.\n\n“I liked that it was a way of giving back. These families have crisis or disasters happening … people don’t realize something as small as having clean clothes just makes you feel so good about yourself,” said Decker, 29.\n\n“I remember being in school and there’s certain kids that weren’t as fortunate and they’d wear the same clothes over and over again and you know that they just hadn’t been washed,” she adds. “You could tell it made them insecure and made them feel bad, so I love that this is something for people to turn to when something like that happens.”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nRELATED VIDEO: How Has Jessie James Decker’s Life Changed With Addition of Baby Number Two?\n\n\n\nWhere her own family is concerned — she and her husband, Tennessee Titans wide receiver Eric Decker, are parents to son Eric Thomas II, 2 next month, and daughter Vivianne Rose, 3 — Decker says she isn’t ruling out adding to its number.\n\n“I do see more kids in the future,” she admits. “I don’t know if it is necessarily right now, but we’re not doing anything not to have more kids. We’re just leaving it up in the air and leaving it in God’s hands.”\n\n“I think we’ve always felt like we wanted three children,” Decker continues. “I came from a family of three kids. [For Eric], it was just him and his sister, and he said he always felt like they were missing a sibling and he wishes [his parents] would have had three. So I just didn’t want Vivi or Bubby to feel like they wish they had another sibling.”\n\nRELATED: Spring Training? Eric Decker Carrying Son, Wheeling Daughter Through Airport Is Peak #DadLife\n\nLittle Eric (a.k.a. “Bubby”) and Vivianne will make an appearance on the upcoming season of the couple’s E! reality series Eric & Jessie, but to a point, according to their mom.\n\n“You’re gonna see them because they’re in my life and I am a very hands-on mom. I do everything,” Decker explains. “But whenever they were filming just me and Eric or just me and my sister or something, I would schedule it around their naps.”\n\n“So I would have them start when the kids went to sleep and have them gone before the kids woke up so the kids never even knew a crew was there,” she adds. “I didn’t want to disrupt them as much as I could, even though it didn’t really feel disruptive to them because they’re used to their parents working and being in show business. But as much as I could shield them, I did.”\n\nFROM PEN: Former Bachelorette Emily Maynard Johnson Says She Wants 2 More Kids to Up Her Total to 5\n\nRELATED: Jessie James Decker Will Be “Protective” of Her Kids on New Season of Eric & Jessie: “They’re the First Priority”\n\nFor the time being, Decker can focus on the pregnancy of her younger sister Sydney — whom she has been very generous with when it comes to maternity wear.\n\n“I gave Sydney everything,” she tells PEOPLE. “I had boxes of maternity stuff and I went through everything and I just kept going, ‘Oh my God, these are the best … no, these are the best. You’re gonna love this, no this is the most comfortable, [these are] the best panties.’ So I just kept giving her everything, and it’s been fun to see her rocking all the new stuff.”\n\nEric & Jessie returns for a third season Wednesday, Sept. 6, at 10 p.m. on E!.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1198&h=627&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2099'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1198&h=627&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg", "keywords": [], "authors": ["Jen Juneau"], "canonical_link": "https://people.com/parents/jessie-james-decker-eric-decker-more-kids/", "title": "Jessie James Decker on Expanding Her Family with Eric Decker: 'We're Not Doing Anything Not to Have More Kids'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Eric Decker,Jessie James Decker,News,Parenting,TV", "news_keywords": "Babies,Eric Decker,Jessie James Decker,News,Parenting,TV", "description": "\"We're just leaving it up in the air and leaving it in God's hands,\" Jessie James Decker tells PEOPLE of having more kids with husband Eric Decker", "og": {"title": "Jessie James Decker on Expanding Her Family with Eric Decker: 'We're Not Doing Anything Not to Have More Kids'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/jessie-james-decker-eric-decker-more-kids/", "description": "Jessie James Decker is lending her voice to a great cause. The country pop singer, fashion designer, television star and Tide&nbsp;partner spoke to PEOPLE following&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1198&h=627&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg", "width": 1198, "height": 627}}, "pinterest": {"url": "https://people.com/parents/jessie-james-decker-eric-decker-more-kids/", "description": "\"We're just leaving it up in the air and leaving it in God's hands,\" Jessie James Decker tells PEOPLE of having more kids with husband Eric Decker", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/jessie-james-decker-eric-decker-more-kids/", "title": "Jessie James Decker on Expanding Her Family with Eric Decker: 'We're Not Doing Anything Not to Have More Kids'", "description": "\"We're just leaving it up in the air and leaving it in God's hands,\" Jessie James Decker tells PEOPLE of having more kids with husband Eric Decker", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1198&h=627&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjjd.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}