{"url": "https://en.wikipedia.org/wiki/Phil_Elverum", "text": "Phil Elverum (born Phil Elvrum; May 23, 1978)[1][2] is an American songwriter, producer and visual artist, best known for his musical projects The Microphones and Mount Eerie. Based in Anacortes, Washington, in the mid-2000s he began to spell his surname Elvrum as \"Elverum.\"\n\nEarly life [ edit ]\n\nPhil Elverum was born on May 23, 1978, in Anacortes, Washington.[1] Growing up Elverum's father regularly made mixtapes for him and his sister. He soon started to play the tuba but after three years moved onto drums.[1] At age 14 he started his own band \"Nubert Circus\", playing the drums and writing lyrics.[1] Elverum attended Anacortes High School.[3] After graduating he traveled across Canada with his then-girlfriend.[3]. In the summer of 1997, he moved to Olympia, Washington where he lived from until 2002.[3] Elverum attended Evergreen State College while touring on the side.[3][4]\n\nDuring his adolescence Elverum worked at Anacortes based record store The Business where he would record music in the backroom, after hours.[3] During his time there he met Beat Happening member Bret Lunsford who offered him a job as the drummer of the band D+.[1]\n\nCareer [ edit ]\n\nElverum is best known for having recorded and performed prolifically under the band names The Microphones (1996–2003) and Mount Eerie (2003–present). The Believer Magazine described his work as \"delicately sparse or layered and noisy, often in the same song. Lyrically, he focuses on memory, first-person storytelling, myth, naturalism, the everyday as sacred, and sense of place (in and out of Washington State)\".[5] Elverum uses mostly analog recording equipment and often works in his own studio spaces, where he has the time and freedom to experiment with sounds.[6] He records at a disused church in Anacortes, Washington called \"The Unknown\".[7]\n\nIn 2004, Elverum established the label P. W. Elverum & Sun, Ltd.,[8] through which he has released records by Mount Eerie and The Microphones, as well as The Spectacle, Thanksgiving, Woelv, Nicholas Krgovich, Key Losers and Wyrd Visions. Prior to this, he was closely linked to K Records and the Olympia, Washington music scene, where he produced recordings by Mirah, Little Wings, Beat Happening, The Blow, and others.\n\nElverum is also an occasional member of the Anacortes band D+ with Karl Blau and Bret Lunsford. His musical influences include Eric's Trip, Will Oldham, Björk, Nirvana, Popol Vuh, Sunn O))), and Angelo Badalamenti.[9][10]\n\nElverum is also known for his artwork and photography. Early in his career he produced limited-run fanzines and song booklets which would be sold during Microphones tours. Since establishing P.W. Elverum & Sun, Ltd., he began to experiment with letterpress printing and other elaborate packaging ideas for his releases.[11] In 2007, he published a hardcover book of film photography with a picture disc EP titled Mount Eerie pts. 6 & 7. This was followed in 2014 by Dust, a book of digital photography bound in stamped linen.\n\nIn 2005, Elverum created a 365-day comic calendar titled Fancy People Adventures, which was later syndicated by music website Tiny Mix Tapes.[12] In late 2008 Buenaventura Press published Dawn, a book and CD of journal entries and songs from winter 2002/03, during which Elverum lived in a remote cabin in Finnkonevika, Kjerringøy, Norway.\n\nElverum has also experimented with filmmaking, producing background visuals for his shows (released as a limited edition DVD entitled Fog Movies) and directing a promotional video for the 2012 Mount Eerie song 'The Place Lives'.[13]\n\nDiscography [ edit ]\n\nAs The Microphones [ edit ]\n\nAs Mount Eerie [ edit ]\n\nPersonal life [ edit ]\n\nElverum married Canadian artist and musician Geneviève Castrée in 2003. She recorded under the names Woelv and Ô Paon. Besides occasionally singing on each other's records and playing in one another's backing bands live, the couple did not collaborate artistically. In 2015, Castrée was diagnosed with inoperable pancreatic cancer following the birth of the couple's first child.[14] Castrée died on July 9, 2016.[15][16][17][18]\n\nElverum married actress Michelle Williams in July 2018 in a private ceremony in the Adirondacks.[19] In April 2019, People reported they had been separated since January.[20] In November 2019, it was reported that they were no longer married.[18]\n\nElverum described his parents as \"mystical about nature\", although these beliefs were not tied to a specific religion.[1] He has stated he does not believe in a god but that \"I'm a Buddhist. I think for me, as a child of the hippy generation, there's a stigma attached to casual Buddhists. I'm hesitant to flaunt it, like to put Buddha on my album cover or whatever\".[21][22]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Phil_Elverum_green_shirt.jpg/186px-Phil_Elverum_green_shirt.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Phil_Elverum_green_shirt.jpg/1200px-Phil_Elverum_green_shirt.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Phil_Elverum_green_shirt.jpg/1200px-Phil_Elverum_green_shirt.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Phil_Elverum", "title": "Phil Elverum", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Phil_Elverum_green_shirt.jpg/1200px-Phil_Elverum_green_shirt.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}