{"url": "https://www.biography.com/people/george-clooney-9251385", "text": "George Clooney is an actor known for his roles in the 'Ocean's Eleven' films and for his Oscar-winning performance in 'Syriana.'\n\nWho Is George Clooney? Actor and director George Clooney scored his breakout role in 1992 as Dr. Doug Ross on TV's ER. The hit show led to major film roles, including a turn as Batman. In 2005, Clooney won an Academy Award for his performance in Syriana. TIME magazine has called the actor \"The Last Movie Star,\" and People magazine twice named him the \"Sexiest Man Alive.\" In 2014, Clooney married international lawyer and activist Amal Alamuddin.\n\nEarly Life George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, into a well-known family of media and entertainment personalities. His father, Nick, spent many years as a television personality and news anchor. His aunt, Rosemary Clooney, had a long career as a singer and actress. Due to the nature of his father's work, Clooney and his older sister, Ada, moved several times to various locations throughout Kentucky and Ohio with their parents. In 1974, they settled down for good in a rambling, old Victorian home in downtown Augusta, Kentucky, a small town on the Ohio River about an hour south of Cincinnati. There, despite some name recognition, the Clooneys led a fairly modest life. They were a close-knit family, with Nick Clooney making sure to carve time out of his busy schedule in Cincinnati to be home in the evenings for dinner. At the Clooney supper table, the family often discussed current events. Nick, a true newsman, had grown up in awe of men like CBS news anchor Edward R. Murrow and, later, Walter Cronkite. Exposed to the entertainment industry at a young age, Clooney made his first television appearance at 5 years old, playing sketch characters on the local talk shows his dad hosted. In middle school, however, Clooney struggled with his talent for expression when he developed Bell's palsy, which causes partial facial paralysis. He eventually recovered from the illness.\n\nCatching the Acting Bug In school, Clooney was more focused on sports than books but still managed to be a good student. \"I pulled out my report cards...I had all A's and a B,\" the actor told Esquire magazine. A fairly good baseball player, he managed to land a tryout with the Cincinnati Reds at the age of 16. A baseball contract, however, never materialized. Clooney eventually opted for college. Staying close to home, he attended Northern Kentucky University, where he studied broadcast journalism. But Clooney didn't last long at college. He didn't think he had what it took to become a good television journalist, and he hated the constant comparisons to his father. He dropped out of school in 1981, without a thought as to what he would do next. Clooney stuck around the Cincinnati area for a while, finding work as a shoe salesman and, later, as a farmhand picking tobacco. He had been harvesting tobacco when he got a call from his cousin, Miguel Ferrer, the son of Rosemary Clooney and Academy Award winner Jose Ferrer. Miguel and his father were making a film in Kentucky about horse racing, and Ferrer offered Clooney a little acting work. Clooney hung around the set for a good three months, where he worked as an extra and even landed a few lines. To make extra money, he loaned his old Monte Carlo to his uncle and cousin for $50 a day. The movie never got released, but the experience gave Clooney the acting bug again.\n\nMove to Los Angeles Encouraged by his cousin Miguel, Clooney decided to move to Los Angeles to become an actor when the movie shoot was over. \"I had just spent the summer cutting tobacco, which is a miserable job. So that's what made me move to Hollywood,\" Clooney later told Esquire. To make ends meet, he picked up whatever work he could find. He even ran errands for his aunt and chauffeured her around town. Slowly parts came, even if they weren't the kind of roles he dreamed about. He landed a recurring role on the popular teen comedy The Facts of Life, from 1985 to 1987. From 1988 to 1991, Clooney also made guest appearances on the sitcom Roseanne. In 1992, he starred in the short-lived series Bodies of Evidence, playing a detective. On the drama Sisters, he played another detective and the love interest for Sela Ward's character. There were small movie roles, too, including the part of a lip-synching transvestite in a 1993 thriller called The Harvest. Clooney worked steadily in Hollywood, but he had yet to land a significant career breakthrough. Feeling that he was always on the cusp of something bigger, something greater, Clooney found his situation difficult. \"I had a work ethic,\" he told The New Yorker in 2007. \"I was making a couple of hundred grand a year, which is beating all the odds, so you don't really think things are going terribly. You actually feel like you're succeeding. [But] I wished I was doing better projects, and I didn't think I was going to get that chance.\"\n\nBig Break All that changed in 1994, when Clooney was cast in a new medical drama called ER. Clooney played Dr. Doug Ross, a caring pediatrician and a notorious ladies man, in the ensemble drama, which also featured Anthony Edwards, Julianna Margulies and Sherry Stringfield. Soon after its September 1994 debut, Clooney was on his way to becoming one of the show's breakout stars, attracting the attention of film industry movers and shakers. His classic good looks and easygoing charm made him a natural for the big screen. Clooney worked at a hectic pace, managing to appear in several films during his time on ER. He battled evil vampires with Quentin Tarantino in Robert Rodriguez's From Dusk to Dawn (1996). In the romantic comedy One Fine Day (1996), Clooney played a divorced father who falls for a single mother (Michelle Pfeiffer). Assuming the role of the caped crusader, Clooney starred as Batman in the summer blockbuster Batman & Robin (1997), which eventually netted more than $107 million. The following year, Clooney starred opposite Jennifer Lopez in Steven Soderbergh's Out of Sight (1998). He also had a role in Terrence Malick's war drama The Thin Red Line. In 1999, Clooney turned in his ER scrubs to pursue his film career full time. He starred in the Persian Gulf War tale Three Kings with Mark Wahlberg and Ice Cube that same year. Working with the Coen brothers, Clooney starred as a charming conman in O Brother, Where Are Thou? (2000), an imaginative retelling of the epic poem The Odyssey. He won a Golden Globe Award for his work on the film. Clooney also reteamed with Wahlberg for the popular disaster-at-sea film The Perfect Storm, based on Sebastian Junger's bestselling novel. The actor, who for so long had wondered if he'd truly make it big, was now Hollywood royalty.\n\nMovies 'Ocean's Eleven, 'Syriana' and 'Good Night, and Good Luck' In 2001, Clooney starred in the remake of Ocean's Eleven directed by Steven Soderbergh. He played Danny Ocean, a role originated by famed crooner Frank Sinatra. The comedic heist film featured an all-star cast, which included Brad Pitt, Julia Roberts, Bernie Mac and Matt Damon. It proved to be such a successful venture on- and off-screen that it spawned two sequels, Ocean's Twelve and Ocean's Thirteen. The following year, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002). The biopic focused on the life of Chuck Barris, host of The Gong Show and reportedly a CIA agent. Despite the film's poor box office performance and weak reviews, Clooney continued to work behind the scenes, serving as a producer on the 2004 political drama Syriana. The usually fit Clooney gained roughly 30 pounds to play a government agent in the film, which explored political intrigue and corruption in the Middle East. Badly hurt during the filming of a scene, he damaged the membrane around his spine. The injury caused spinal fluid to leak from his nose and left him with terrible back pain. After completing the film, Clooney underwent two surgeries to fix the problem. All of his hard work on Syriana did not go unnoticed. In 2005, Clooney won the Academy Award for best supporting actor for his role in the film. He was also nominated for another important project, Good Night, and Good Luck, that same year. The film examines the clash between distinguished news anchor Edward R. Murrow and Senator Joseph McCarthy. Clooney directed the film and co-wrote the screenplay, which served partly as a tribute to his newsman father. Widely praised, the black-and-white drama helped Clooney earn his first nominations, for best director and best original screenplay). 'Up in the Air' and 'The Descendants' Clooney's next starring role was in the 2009 dramatic comedy, Up in the Air, which earned him rave reviews. In the film, Clooney played Ryan Bingham, a consultant who specializes in firing employees. For The Ides of March in 2011, Clooney proved to be a triple-threat, serving as the project's star, director, and co-writer. The political drama featured Clooney as a presidential candidate and Ryan Gosling as one of his aides. Also that same year, Clooney gave another impressive performance in the family drama The Descendants directed by Alexander Payne. He won a Golden Globe for his turn as a husband and father who must cope with new challenges and unpleasant revelations after his wife is severely injured in a boating accident. 'Gravity' and 'Suburbicon' In 2013, Clooney received an Academy Award for Best Picture for producing Argo with Ben Affleck and Grant Heslov. The political thriller, directed and starring Affleck, was an adaptation of The Master of Disguise by former CIA operative Tony Mendez and \"The Great Escape,\" a Wired magazine article by Joshuah Bearman. Clooney was also featured in the sci-fi drama Gravity (2013), while 2014 saw the release of The Monuments Men, which Clooney starred in and directed. The following year, Clooney received the Hollywood Foreign Press Association's Cecil B. DeMille Award at the annual Golden Globes telecast. Clooney was back on the big screen in 2016, with featured roles in Hail, Caesar! and Money Monster. The following year, he again stepped behind the camera to direct Suburbicon, starring Matt Damon and Julianne Moore. Shortly after the release of Suburbicon, Clooney revealed in an interview with The Sunday Times that he was stepping back from acting. \"I acted for a long time and, you know, I’m 56. I’m not the guy that gets the girl anymore,\" he said, adding that his secure financial footing gave him the luxury to pursue the projects of his choosing. Later Career One such project turned out to be an adaptation of Joseph Heller's 1961 novel, Catch-22, about American servicemen attempting to maintain their sanity amid the looming threat of death in combat during World War II. Clooney was set to direct and star as Colonel Cathcart in the limited series, his first regular television role since ER in the 1990s. In June 2018, Clooney was honored with the Life Achievement Award by the American Film Institute, a ceremony that featured tributes from past collaborators like Laura Dern and Don Cheadle, as well as luminaries like President Barack Obama. Two months later, Clooney topped Forbes’ annual ranking of highest-paid actors, though it wasn't due to his screen work: The cash came from the recent sale of his tequila brand, Casamigos, which garnered him a cool $700 million up front, with the potential for another $300 million over the following decade.\n\nPolitical Causes An outspoken liberal, Clooney has been a frequent target of right-wing politicos and personalities, including FOX News's Bill O'Reilly. Beyond his disappointment with the election of George W. Bush as President in 2000, the actor was also an early opponent of the Iraq War, and later called the president \"dim\" in a 2003 interview. \"America's policies frustrate me,\" Clooney told a German television program. \"I think a war against Iraq is as unavoidable as it is senseless. I think it's coming. But I also think the real danger is going to be what happens after it.\" Following the September 11th attacks, Clooney organized a fundraiser that featured dozens of Hollywood stars and assembled more than $129 million for the United Way. Four years later, he donated $1 million to the United Way Hurricane Katrina Response Fund. In 2006, Clooney stepped up his involvement in political and social causes. He teamed up with his father and a few others to travel around the western region of Sudan, known as Darfur. Armed with a few small video cameras, Clooney and his father set out report on how the area had been ravaged by war and how the international community was struggling to set up refugee camps to help those in need. By leveraging Clooney's Hollywood status, they believed they could bring greater attention to the Darfur crisis and could help fuel global interest in helping the region. Their edited footage was broadcast on such programs as Oprah. Upon his return to the United States, Clooney brought his celebrity clout to Washington, D.C., where he spoke at a rally against the genocide in Darfur. Later he spoke to a special meeting of the U.N. Security Council. With other celebrities, including Brad Pitt, Don Cheadle, and Matt Damon, he formed a non-profit organization called Not On Our Watch to help the people in Darfur. In 2007, he and Cheadle were recognized for their work for Darfur. The pair shared a Peace Summit Award at the 8th Annual World Summit of Nobel Peace Prize Laureates in Rome. The following year, with his parents standing at his side, Clooney was officially appointed as a U.N. peace envoy. Following the tragic shooting at Marjory Stoneman Douglas High School in Parkland, Florida, in February 2018, Clooney and his wife, Amal, announced they were donating $500,000 to the March for Our Lives protest planned for the following month. Other entertainment A-listers followed their lead, with Steven Spielberg and Oprah Winfrey also announcing donations.", "images": ["https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2NDQ0NzIyNjk5/george-carlin-9542307-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2NDA2NDQ5Njc1/robin-williams-9532797-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE4MDAzNDEwNDE3OTExMzEw/jon-hamm-578408-1-402.jpg", "https://www.biography.com/.image/t_share/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTIwNjA4NjMzOTQ3OTgxMzI0/anthony-quinn-9449747-1-402.jpg", "https://www.biography.com/.image/ar_1:1%2Cc_fill%2Ccs_srgb%2Cg_face%2Cq_auto:good%2Cw_300/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTY4Mjc5OTY4NzQ3ODg5ODI5/black-background.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2MjA0OTI2NDc1/michael-douglas-9278088-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2NDQ5ODM0NTA3/george-reeves-9542357-1-4022.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxNzA2MDU4MjUz/george-lucas-9388168-1-402.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTIwNjA4NjM0MDYyNTM4MjUy/johnny-depp-9542522-1-402.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NDg0MDU0NzE0MzUzMTY3/george-lopez-189160-1-4022.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actor/george-clooney", "title": "George Clooney", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "Rw9Z4UJK89QUjgFzrFI2QbZmTRyWu_Cuy15hu4Y1MXw", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "description": "George Clooney is an actor known for his roles in the 'Ocean's Eleven' films and for his Oscar-winning performance in 'Syriana.'", "section": "Actors", "pagetype": "person", "item-id": "ci01a8bfd60cf8860b", "published": "2018-02-21T13:13:00Z", "modified": "2019-11-26T21:02:51Z", "dcterms.rightsHolder": "Biography and the Biography logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2020, "twitter": {"card": "summary_large_image", "site": "@bio", "url": "https://www.biography.com/actor/george-clooney", "image": "https://www.biography.com/.image/t_share/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "description": "George Clooney is an actor known for his roles in the 'Ocean's Eleven' films and for his Oscar-winning performance in 'Syriana.'", "domain": "www.biography.com"}, "og": {"type": "website", "url": "https://www.biography.com/actor/george-clooney", "title": "George Clooney", "description": "George Clooney is an actor known for his roles in the 'Ocean's Eleven' films and for his Oscar-winning performance in 'Syriana.'", "image": "https://www.biography.com/.image/t_share/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "George Clooney - Biography", "parsely-link": "https://www.biography.com/actor/george-clooney", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "parsely-post-id": "ci01a8bfd60cf8860b", "parsely-pub-date": "2018-02-21T13:13:00Z", "parsely-section": "Actors", "parsely-tags": "Amal Alamuddin Clooney,Brad Pitt,Matt Damon,Julia Roberts", "sailthru.title": "George Clooney", "sailthru.image.full": "https://www.biography.com/.image/t_share/MTE5NTU2MzE2MTg2NzczMDAz/george-clooney-9251385-1-402.jpg", "sailthru.date": "2018-02-21T13:13:00Z", "sailthru.description": "George Clooney is an actor known for his roles in the 'Ocean's Eleven' films and for his Oscar-winning performance in 'Syriana.'", "phx": {"content-item-id": "ci01a8bfd60cf8860b", "content-object-type": "ContentPerson"}}, "movies": [], "publish_date": 1519218780.0, "source": "https://www.biography.com", "summary": ""}