{"url": "https://people.com/tv/why-kim-kardashian-return-paris/", "text": "Kim Kardashian’s life changed dramatically after she was robbed at gunpoint in her Paris hotel room in October 2016. She spent months away from social media and hadn’t returned to the country for almost two years.\n\nOn Sunday’s episode of Keeping Up with the Kardashians, Kim, 37, explained why she decided to visit the City of Lights again for the Louis Vuitton spring/summer 2019 menswear show in June.\n\nGet push notifications with news, features and more.\n\nKim’s husband Kanye West planned to attend the fashion show because Louis Vuitton’s Men’s Artistic Director Virgil Abloh is a longtime friend of his from Chicago. While the rapper wanted to be there for his “brother,” West understood that Kim might have had reservations about going with him.\n\nImage zoom Abloh and West. Dominique Maitre/WWD/Shutterstock\n\n“I don’t want to put any pressure on you to go to Paris,” West, 41, told Kim. “I know that was really hard the last time you were in Paris. So I think just for the culture, for Kim K. to show up to the first black designer at [a] Louis Vuitton show who was the best man at my wedding, just the world would just love to see you there.”\n\nInitially, Kim said, “I have to think about it.”\n\nWhen the mother of three consulted her sisters, Khloé and Kourtney offered support of her one day trip to Paris.\n\n“I definitely want to be there to support Kanye and Virgil but the last time I was there obviously [was] like a horrific experience for me,” Kim said in an on-camera interview. “You know, I’m going really cautiously, and I think going for such a short period of time def helps me mentally. But I guess you never know what could happen.”\n\nKhloé, 34, agreed, “It’s time.”\n\nMomager Kris Jenner also encouraged her daughter to head to France.\n\n“You’re a really good friend to go back to a place where you’re not the most comfortable,” she told Kim. “But it’s a good putting your toe in the water.”\n\nRELATED VIDEO: Kim Kardashian Says She Was High on Ecstasy During First Wedding — and When She Made a Sex Tape\n\nKim expressed hope that the quick visit would help bring back a positive view of Paris.\n\n“I have so many special memories in Paris,” the KKW Beauty guru said. “I hope that this trip will just be so good that I can start to remember all the magical things about Paris and why Kanye and I fell in love with it.”\n\nIn the car after landing in Paris — where West was fascinated with the number of bike shops he saw in the city — the couple discussed lodging arrangements.\n\n“No more staying in small hotels,” Kim stated of why they wouldn’t be checking into a boutique hotel this time around.\n\nShe added to the cameras, “Being here in Paris, honestly, it’s like really nerve-wracking honestly, but I’m not trying to focus on anything negative.”\n\nImage zoom Kim arriving at the Louis Vuitton fashion show in Paris in June. Chesnot/WireImage\n\nWhen it was time to head to the show, Kim was warned that there were a lot of paparazzi outside the hotel and she had a bit of a freakout about making sure enough security were around.\n\n“There’s so many people, so much paparazzi, it just reminds me of everything that went on the last time that I was here,” Kim told the cameras. “I’m just hypersensitive to this right now.”\n\nKim and West got into the car safely and she even posed for the cameras upon arriving at the show. She ended up loving the new Louis Vuitton collection and so did West. He and Abloh embraced and cried in each other’s arms at the end of the show.\n\n“Kanye and Virgil have the sweetest moment and they’re both crying, all of our friends were crying,” Kim said. “It’s just such an emotional day. The fact that Virgil’s come this far. It’s just, it’s like a symbol. Like, they made it. They did it. They’re taking over the fashion world when everyone told them they couldn’t do it.”\n\nImage zoom West and Kim in Paris in June. Stephane Cardinale/Corbis/Getty\n\nBack in California, during a visit to Saved By the Bell’s The Max pop-up restaurant, Kim recounted to Khloé and Kourtney, 39, how happy she felt about her first trip back to Paris.\n\n“It was so good,” she told her sisters. “Like, honestly, I’m so glad we went. Like he had to be there.”\n\nThough Kim admitted, “For a second, I was like, I was so stressed out over my security, just the movement of everyone. But other that, it was fine. I didn’t really have a lot of anxiety.”\n\nThe reality star even believed she could go back for a longer visit.\n\n“I don’t think I’ll ever really forget my experiences in Paris — the good or the bad — and I think that’s okay,” Kim said in an on-camera interview. “It all has made me who I am. Thinking about it, I think I could go back and spend more time and feel safe and comfortable.”\n\nKeeping Up with the Kardashians airs Sundays on E! at 9 p.m. ET.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkim-kardashian8.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkanye-west5-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg", "keywords": [], "authors": ["Dana Rose Falcone"], "canonical_link": "https://people.com/tv/why-kim-kardashian-return-paris/", "title": "Inside Kim Kardashian’s Decision to Return to Paris 2 Years After Her Robbery", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kanye West,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,News,Style,TV", "news_keywords": "Kanye West,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Kris Jenner,News,Style,TV", "description": "“I don’t think I’ll ever really forget my experiences in Paris,\" Kim Kardashian said on Sunday's episode of Keeping Up with the Kardashians", "og": {"title": "Inside Kim Kardashian’s Decision to Return to Paris 2 Years After Her Robbery", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/why-kim-kardashian-return-paris/", "description": "Kim Kardashian’s life changed dramatically after she was robbed at gunpoint in her Paris hotel room in October 2016. She spent months away from social&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg", "width": 1231, "height": 645}}, "pinterest": {"url": "https://people.com/tv/why-kim-kardashian-return-paris/", "description": "“I don’t think I’ll ever really forget my experiences in Paris,\" Kim Kardashian said on Sunday's episode of Keeping Up with the Kardashians", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/why-kim-kardashian-return-paris/", "title": "Inside Kim Kardashian’s Decision to Return to Paris 2 Years After Her Robbery", "description": "“I don’t think I’ll ever really forget my experiences in Paris,\" Kim Kardashian said on Sunday's episode of Keeping Up with the Kardashians", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fkim3-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}