{"url": "https://www.indiewire.com/2017/07/best-tv-performances-actors-characters-shows-2017-1201851217/", "text": "Lead and supporting, heroes and villains — these are the people behind some of our favorite roles of the year.\n\nWhile storytelling is something we value deeply in the shows we watch, we often look to the key actors of these narratives as one of their ultimate signs of success. Some of our favorite shows thus far this year have owed so much to some staggering acting work. With two inevitable exceptions, we limited this overview to one performance per show, one role per actor. But there was some incredible range to be found in that work, which makes us excited for what the rest of 2017 has in store.\n\nREAD MORE: The 20 Best TV Episodes of 2017 (So Far)\n\nGillian Anderson, “American Gods”\n\nThe way that Gillian Anderson, a pop culture icon in her own right, managed to embody famous figures like David Bowie and Marilyn Monroe went well beyond imitation. Each vision we got of Media left us chilled and unsettled thanks to Anderson’s mastery over her gift, building layers upon layers in channeling characters who could have easily come off as cliché. Anderson doesn’t often get the opportunity to show us the full scope of her range, but “American Gods” was a wonderful exception.\n\nREAD MORE: Gillian Anderson Ruled ‘American Gods’: How the Many Faces of Media Were Chosen\n\nPopular on IndieWire\n\nThere’s a scene in “The Leftovers” series finale in which Nora, Carrie Coon’s long-suffering former fraud investigator, shuts her bathroom door, draws herself a bath, and… then she can’t get out. She’s trapped. She wrestles with the knob, bangs on the giant wooden barrier, and then throws herself against it with all her might.\n\nIt works. She breaks through, and that’s the point. The scene is meant, largely, to symbolize Nora’s breakthrough; that she wants to see her long lost love, Kevin (Justin Theroux), despite claims to the contrary. But what makes the scene work is Coon. It’s a moment of comedic absurdity amid a tragically romantic storyline, and Coon hits all the right notes. It’s reminiscent of when she flipped out on a parking barrier in Episode 2 and then went directly to her friend’s house to talk (and take a few bounces on a trampoline).\n\nCoon finds the truth in every moment, no matter how ridiculous, no matter how unbelievable. It’s what makes her closing speech so powerful, and it’s what makes Nora Durst one of the best characters of the 21st century. Coon understood the humanity of her role long before anyone could see past her darkness, and that guiding light made the journey to serenity immeasurably satisfying.\n\nREAD MORE: Why Do Machines Hate Carrie Coon on ‘Fargo’ and ‘The Leftovers’?\n\nRupert Friend, “Homeland”\n\nAfter taking the appropriate amount of time to grieve, we’ve come to the following conclusion: Rupert Friend’s “Homeland” swan song was a two-season affair. Perhaps Quinn really did die in Season 5, and Season 6 was just how Carrie (Claire Danes) had to say goodbye, with her one-time love living in her home, halfway to death’s door. She indeed got him the rest of the way, to a hero’s end. But while she did that for Quinn, Friend carried him throughout it all; through the reign of the Drone Queen to the heartbreak of losing Carrie all over again; through a brutal, infamous poisoning to wandering into drug dens with prostitutes. Quinn’s journey was long and complicated, but Friend found honesty and power in every grave choice and dangerous situation. The physicality alone demands respect, and Friend made us feel for Quinn more than we ever expected — no matter when you said goodbye.\n\nREAD MORE: ‘Homeland’: An Ode to Rupert Friend’s Quinn After a Divisive Finale\n\nKathryn Hahn, “I Love Dick”\n\nIt’s so easy for a performance to be dominated by a single emotion, something that makes Hahn’s starring role as Chris in “I Love Dick” all the more impressive. It’s a character that’s dealing with raging desire, crippling frustration, and all-consuming obsession, and Hahn plays all sides of that internal tug-of-war with equal ease. As Chris’ life gets yanked in multiple directions, Hahn somehow keeps her grounded in a fierce, intense drive toward self preservation. It’s hard to be hopelessly in love with an idea of a person, much less the person themself. But this is a performance that shows us why it’s a fundamental driver of what makes compelling drama in real life and in fictional versions of it. There’s an intense physicality to Hahn’s approach, too. It’s not just in the emotions that she betrays, it’s in the way that they take over every bit of movement and stillness. As a result, Chris becomes a character you can easily build an entire town around.\n\nREAD MORE: ‘I Love Dick’: Kathryn Hahn and Jill Soloway on Empowering Sex Scenes That Aren’t All About Ejaculation\n\nNeil Patrick Harris, “A Series of Unfortunate Events”\n\nPlaying multiple roles is one thing, but playing one character deliberately embodying multiple characters, all while trying to match a very strange and specific tone, is a unique challenge for any actor. Fortunately, Neil Patrick Harris proved more than up for it, making each of his many forms distinct but unified by his villainous desires. His twisting eyebrows and sly looks sold every quasi-absurd moment of the series. “A Series of Unfortunate Events” owes a lot to the look and feel sculpted by director Barry Sonnenfeld, but without actors like Harris selling it, it’d be nothing.\n\nREAD MORE: ‘A Series of Unfortunate Events’: Neil Patrick Harris on Playing Four Roles as One Villain and Why He Had to Watch Jim Carrey’s Take\n\nDamson Idris, “Snowfall”\n\nSneaking in just under the wire is a performance worthy of “The Wire’s” excellent young cast. 26-year-old Idris leads an impressive ensemble with the confidence and poise of someone twice his age. And while his accent work is so spot on that we can’t pick out the transplant from southeast London from a group of kids from the south side of L.A., it only speaks to how relaxed, inviting, and empathetic his performance becomes. Only one episode of “Snowfall” has aired, but we’ve seen enough of Idris to know he’s good for the long haul.\n\nREAD MORE: ‘Snowfall’ Premiere: John Singleton on The Rise of Crack During His Youth and Exposing ‘Terrifying’ CIA Operations\n\nSanaa Lathan, “Shots Fired”\n\nWe’ve seen hardass cops before. We’ve seen hardass lady cops before. But we haven’t seen Ashe Akino before, not the way Sanaa Lathan portrayed her in Fox’s limited series, “Shots Fired.” Constantly pulled between a far away family conflict and the immediate issues in the North Carolina town she’s been sent, Lathan knew when to not give a shit and when to dig in deep. Her priorities were so in line it made her all the more engaging, as she bonded with her ambitious new partner and busted heads of bad guys. It was an ideal turn for broadcast TV: fun enough to earn fans and challenging enough to push them to think deeper.\n\nREAD MORE: ‘Shots Fired’: How George Zimmerman’s Acquittal Led to Fox’s Powerful New Series — IndieWire’s Turn It On Podcast\n\nJude Law – “The Young Pope”\n\nGianni Fiorito/HBO\n\nJude Law had already taken unexpected roles in the past, and as IndieWire’s Anne Thompson points out, has transitioned from golden boy leading man to bold character actor with varying success. Nevertheless, Law vanquishes all of our expectations with the role of Lenny Belardo, the first-ever American pope in Paolo Sorrentino’s playful TV masterpiece. Good-looking yet inscrutable, Lenny as Pope Pius XIII oozes a distinct kind of charm, tinged with dangerous condemnation. Law is able to completely sell this brash and overweening fellow before pivoting to reveal a deep vulnerability, indecision and humility. Law trusted in Sorrentino blindly, and it paid off with one of the most complex and yet passionately alive characters on TV. He’s painfully soulful and electric all at once, and through Law’s performance we are now believers that if anyone had a direct line to God through prayer, it would be Lenny with his goddamned smile.\n\nREAD MORE: ‘The Young Pope’: How Jude Law Went Weird with Paolo Sorrentino for His Best Work In Years\n\nContinued on the next page: The rest of our picks, including cast members from “Doctor Who,” “Better Call Saul” and “Veep”\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["http://www.indiewire.com/wp-content/uploads/2017/03/fftvgsf-pilot_101-sc36-fn_00134_f_r_original_hires1.jpg?w=780", "https://i2.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/k.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/uploads/2017/07/best-tv-performances-of-2017-so-far.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2017%2F07%2Fbest-tv-performances-actors-characters-shows-2017-1201851217%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201851217&comment_count=3", "https://i2.wp.com/www.goldderby.com/wp-content/uploads/2020/03/tyson-apostol-eliminated.jpg?resize=230%2C135&ssl=1&w=300", "http://www.indiewire.com/wp-content/uploads/2017/06/sn_pilot_3304.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/04/db6ba48a-dba0-49f7-9b8c-f8a673668be4.jpeg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "http://www.indiewire.com/wp-content/uploads/2017/02/7feb3f60080a8f683a1ca477fde83f56c45a5a7f66f1dd2914935b70b988507dbe2bfa14145e1422c7555770e6eca22a1.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pmcvariety.files.wordpress.com/2020/04/thequarry_6-h_2020.jpg?resize=230%2C135&w=300", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/02/drew-carey-e1587181608936.jpg?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2017/07/best-tv-performances-of-2017-so-far.jpg?w=780", "https://pmctvline2.files.wordpress.com/2020/04/drag-race-recap-2.jpg?resize=230%2C135&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.indiewire.com/wp-content/uploads/2017/04/homeland_611_933-r.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/06/asoue_102_unit_3591_r.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/05/post-air-tl_304_bk_0228.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/06/ild_102_04990-1-fnl_rgb.jpg?w=780"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/07/best-tv-performances-of-2017-so-far.jpg", "keywords": [], "authors": ["Liz Shannon Miller Hanh Nguyen Ben Travers Steve Greene", "Liz Shannon Miller", "Hanh Nguyen", "Ben Travers", "Steve Greene"], "canonical_link": "https://www.indiewire.com/2017/07/best-tv-performances-actors-characters-shows-2017-1201851217/", "title": "The 15 Best TV Performances of 2017 (So Far)", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Reese Witherspoon, Jude Law, Gillian Anderson, Kathryn Hahn and more — these are the people behind some of our favorite roles of the year.", "news_keywords": "Best Of, Carrie Coon, Justin Theroux, The Leftovers", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Steve Greene", "content_type": "Article", "post_id": 1201851217, "title": "The 15 Best TV Performances of 2017 (So Far)", "published_at": "2017-07-06 11:13:32", "image": "https://www.indiewire.com/wp-content/uploads/2017/07/best-tv-performances-of-2017-so-far.jpg?w=300", "comment_count": 3, "tags": "The Leftovers", "topics": "Television", "body": "While storytelling is something we value deeply in the shows we watch, we often look to the key actors of these narratives as one of their ultimate signs of success. Some of our favorite shows thus far this year have owed so much to some staggering acting work. With two inevitable exceptions, we limited this overview to one performance per show, one role per actor. But there was some incredible range to be found in that work, which makes us excited for what the rest of 2017 has in store.\r\n\r\nREAD MORE: The 20 Best TV Episodes of 2017 (So Far)\r\nGillian Anderson, \"American Gods\"\r\n\r\n\r\nThe way that Gillian Anderson, a pop culture icon in her own right, managed to embody famous figures like David Bowie and Marilyn Monroe went well beyond imitation. Each vision we got of Media left us chilled and unsettled thanks to Anderson's mastery over her gift, building layers upon layers in channeling characters who could have easily come off as cliché. Anderson doesn't often get the opportunity to show us the full scope of her range, but \"American Gods\" was a wonderful exception.\r\n\r\nREAD MORE: Gillian Anderson Ruled ‘American Gods’: How the Many Faces of Media Were Chosen\r\nCarrie Coon, \"The Leftovers\"\r\n\r\n\r\nThere’s a scene in “The Leftovers” series finale in which Nora, Carrie Coon’s long-suffering former fraud investigator, shuts her bathroom door, draws herself a bath, and… then she can’t get out. She’s trapped. She wrestles with the knob, bangs on the giant wooden barrier, and then throws herself against it with all her might.\r\n\r\nIt works. She breaks through, and that’s the point. The scene is meant, largely, to symbolize Nora’s breakthrough; that she wants to see her long lost love, Kevin (Justin Theroux), despite claims to the contrary. But what makes the scene work is Coon. It’s a moment of comedic absurdity amid a tragically romantic storyline, and Coon hits all the right notes. It’s reminiscent of when she flipped out on a parking barrier in Episode 2 and then went directly to her friend’s house to talk (and take a few bounces on a trampoline).\r\n\r\nCoon finds the truth in every moment, no matter how ridiculous, no matter how unbelievable. It’s what makes her closing speech so powerful, and it’s what makes Nora Durst one of the best characters of the 21st century. Coon understood the humanity of her role long before anyone could see past her darkness, and that guiding light made the journey to serenity immeasurably satisfying.\r\n\r\nREAD MORE: Why Do Machines Hate Carrie Coon on ‘Fargo’ and ‘The Leftovers’?\r\nRupert Friend, \"Homeland\"\r\n\r\n\r\nAfter taking the appropriate amount of time to grieve, we've come to the following conclusion: Rupert Friend’s “Homeland” swan song was a two-season affair. Perhaps Quinn really did die in Season 5, and Season 6 was just how Carrie (Claire Danes) had to say goodbye, with her one-time love living in her home, halfway to death’s door. She indeed got him the rest of the way, to a hero’s end. But while she did that for Quinn, Friend carried him throughout it all; through the reign of the Drone Queen to the heartbreak of losing Carrie all over again; through a brutal, infamous poisoning to wandering into drug dens with prostitutes. Quinn’s journey was long and complicated, but Friend found honesty and power in every grave choice and dangerous situation. The physicality alone demands respect, and Friend made us feel for Quinn more than we ever expected — no matter when you said goodbye.\r\n\r\nREAD MORE: ‘Homeland’: An Ode to Rupert Friend’s Quinn After a Divisive Finale\r\nKathryn Hahn, \"I Love Dick\"\r\n\r\n\r\nIt’s so easy for a performance to be dominated by a single emotion, something that makes Hahn’s starring role as Chris in “I Love Dick” all the more impressive. It's a character that’s dealing with raging desire, crippling frustration, and all-consuming obsession, and Hahn plays all sides of that internal tug-of-war with equal ease. As Chris' life gets yanked in multiple directions, Hahn somehow keeps her grounded in a fierce, intense drive toward self preservation. It's hard to be hopelessly in love with an idea of a person, much less the person themself. But this is a performance that shows us why it’s a fundamental driver of what makes compelling drama in real life and in fictional versions of it. There's an intense physicality to Hahn’s approach, too. It's not just in the emotions that she betrays, it's in the way that they take over every bit of movement and stillness. As a result, Chris becomes a character you can easily build an entire town around.\r\n\r\nREAD MORE: ‘I Love Dick’: Kathryn Hahn and Jill Soloway on Empowering Sex Scenes That Aren’t All About Ejaculation\r\nNeil Patrick Harris, \"A Series of Unfortunate Events\"\r\n\r\n\r\nPlaying multiple roles is one thing, but playing one character deliberately embodying multiple characters, all while trying to match a very strange and specific tone, is a unique challenge for any actor. Fortunately, Neil Patrick Harris proved more than up for it, making each of his many forms distinct but unified by his villainous desires. His twisting eyebrows and sly looks sold every quasi-absurd moment of the series. \"A Series of Unfortunate Events\" owes a lot to the look and feel sculpted by director Barry Sonnenfeld, but without actors like Harris selling it, it'd be nothing.\r\n\r\nREAD MORE: 'A Series of Unfortunate Events’: Neil Patrick Harris on Playing Four Roles as One Villain and Why He Had to Watch Jim Carrey’s Take\r\nDamson Idris, \"Snowfall\"\r\n\r\n\r\nSneaking in just under the wire is a performance worthy of “The Wire’s” excellent young cast. 26-year-old Idris leads an impressive ensemble with the confidence and poise of someone twice his age. And while his accent work is so spot on that we can’t pick out the transplant from southeast London from a group of kids from the south side of L.A., it only speaks to how relaxed, inviting, and empathetic his performance becomes. Only one episode of “Snowfall” has aired, but we’ve seen enough of Idris to know he’s good for the long haul.\r\n\r\nREAD MORE: ‘Snowfall’ Premiere: John Singleton on The Rise of Crack During His Youth and Exposing ‘Terrifying’ CIA Operations\r\nSanaa Lathan, \"Shots Fired\"\r\n\r\n\r\nWe’ve seen hardass cops before. We’ve seen hardass lady cops before. But we haven’t seen Ashe Akino before, not the way Sanaa Lathan portrayed her in Fox’s limited series, “Shots Fired.” Constantly pulled between a far away family conflict and the immediate issues in the North Carolina town she’s been sent, Lathan knew when to not give a shit and when to dig in deep. Her priorities were so in line it made her all the more engaging, as she bonded with her ambitious new partner and busted heads of bad guys. It was an ideal turn for broadcast TV: fun enough to earn fans and challenging enough to push them to think deeper.\r\n\r\nREAD MORE: ‘Shots Fired’: How George Zimmerman’s Acquittal Led to Fox’s Powerful New Series — IndieWire’s Turn It On Podcast\r\nJude Law - “The Young Pope”\r\n\r\n\r\nJude Law had already taken unexpected roles in the past, and as IndieWire’s Anne Thompson points out, has transitioned from golden boy leading man to bold character actor with varying success. Nevertheless, Law vanquishes all of our expectations with the role of Lenny Belardo, the first-ever American pope in Paolo Sorrentino’s playful TV masterpiece. Good-looking yet inscrutable, Lenny as Pope Pius XIII oozes a distinct kind of charm, tinged with dangerous condemnation. Law is able to completely sell this brash and overweening fellow before pivoting to reveal a deep vulnerability, indecision and humility. Law trusted in Sorrentino blindly, and it paid off with one of the most complex and yet passionately alive characters on TV. He’s painfully soulful and electric all at once, and through Law’s performance we are now believers that if anyone had a direct line to God through prayer, it would be Lenny with his goddamned smile.\r\n\r\nREAD MORE: ‘The Young Pope’: How Jude Law Went Weird with Paolo Sorrentino for His Best Work In Years\r\n\r\nContinued on the next page: The rest of our picks, including cast members from \"Doctor Who,\" \"Better Call Saul\" and \"Veep\"\r\n\r\nPearl Mackie - “Doctor Who”\r\n\r\n\r\nThere comes a time in every Companion’s tenure on “Doctor Who” when he or she is beloved by the audience. It's understandable, since the Companion is our analog in this wacky world of flying police boxes, aliens and timey-wimeyness. From the very first episode though, Pearl Mackie's Bill instantly managed to worm her way into everyone’s hearts, even the Doctor’s two hearts. Mackie was able to sell a character who is overall sweet and happy, traits that usually come across on screen as simple-minded, with humor, poignancy and depth. She hands down asks the best questions of any Companion (“Yeah, hearts though, why two? Does this mean you have really high blood pressure?”) and delivers these inquiries with a puppy-like enthusiasm and openness. Because of this, Mackie is also able to rip out our hearts with the tiniest flicker of disappointment or sorrow in her eyes. Mackie has brought to life a character who has no pretense, no cynicism, no darkness. It’s such a shame that this is Peter Capaldi’s final season as the Doctor because their on-screen chemistry is a joy to watch, and Mackie has rejuvenated the franchise.\r\n\r\nREAD MORE: ‘Doctor Who’ Review: Killer Finale Hints at a Female Doctor and Delivers Some Major Timelord Plot Twists\r\nMichael McKean, \"Better Call Saul\"\r\n\r\n\r\nThe most amazing thing about Chuck McGill, as portrayed by Michael McKean, is that you understand him so clearly. He's so fully realized and believable and human that, at times, you almost forget what a terrible, loathsome person he is. You don't want Chuck to be real, but there's no escaping the fact that McKean's performance is so grounded. You don't want Chuck to be right, but the more we get to know him, the more we know that all too often, he is. The Season 3 cliffhanger has us very worried about what may come next, but no matter what comes next, Chuck will remain an unforgettable part of the show, one whose words of truth will forever haunt us.\r\n\r\nREAD MORE: ‘Better Call Saul’ Review: Bob Odenkirk and Michael McKean Spar in an Ultimate Clash of the Brothers\r\nElisabeth Moss, \"The Handmaid's Tale\"\r\n\r\n\r\nAs we've noted throughout the show’s early run, one of the true terrors of “The Handmaid’s Tale” is its gradual changes. We see each new violation on Moss’ face, playing a character who’s forced to limit her true range of expression in order to preserve her life. In scenes when paragraphs’ worth of thoughts and desires and fears need to be conveyed, Moss can do it in a look. In most cases, it's trite to say that the most important lines of dialogue are the ones that remain unspoken, but in this case, Moss turns that well-worn adage into a defining element of her performance. It makes the occasional reprieve from the horrors of Gilead all the more satisfying, to see a character who has been downtrodden so brutally be given the chance to truly come alive. Moss handles both aspects with equal grace and expertise, giving us a whole life’s history in a few select glances.\r\n\r\nREAD MORE: ‘The Handmaid’s Tale’: Intriguing Season 2 Secrets Revealed After Brutal Season Finale\r\nAubrey Plaza - “Legion”\r\n\r\n\r\nDrugged out. Alluring. Cunning. Sexy. Bat-shit crazy. Monstrous. These are just a few of the adjectives to describe Aubrey Plaza's Lenny. And while she plays multiple versions of the same character through different filters in the trippy comic book-inspired series, the common denominator is that she’s an undeniable, intoxicating scene-stealer. Plaza initially joined “Legion” expecting to read for the female lead, but after a few conversations with creator Noah Hawley, landed the role of David Haller’s (Dan Stevens) mental hospital chum and the face of an evil force which has taken up residence in his subconscious. Plaza brings intensity and an expressive physicality to each version of Lenny, making her insidious nature addictive. Although “Legion” seemingly wrote out the need for Lenny in the finale, we’re still hoping that Hawley is able to bring her back in some form in Season 2.\r\n\r\nREAD MORE: ‘Legion’: Aubrey Plaza Reveals How David Bowie and Beetlejuice Helped Her Become a ‘Rock Star’ Monster\r\nSam Richardson, \"Veep\"\r\n\r\n\r\nTry as the show might to stuff its weekly runtime with enough jokes to feed its hefty ensemble, a half-hour always feels like too short a time to spend in the world of “Veep.” It’s all the more valuable to have a character like Richard Splett to help cut through the cynicism, backstabbing, and distrust that permeates so much of the rest of the show. Much like his HBO Sunday comedy counterpoint Zach Woods, Richardson is an actor whose impeccable timing and finessed delivery made the show’s writing staff find more ways to get him involved. Much like his character, Richard is the unassuming encyclopedia of “Veep,” waiting to be taken off the shelf whenever needed. In the process, he’s ensured that each new layer of naïveté (and parenthood) that gets thrust in SplettNet’s direction will be met with the same cheery optimism.\r\n\r\nREAD MORE: ‘Veep’: Julia Louis-Dreyfus, Tony Hale and the Cast Pick Their Favorite Insults From Season 6\r\nJustin Theroux, \"The Leftovers\"\r\n\r\n\r\nThrough the three-season run of “The Leftovers,” Justin Theroux was the show’s physical and emotional anchor, as in times of distress and loneliness, Kevin Garvey was the closest the show came to an audience surrogate. He's a character who experienced loss, but Theroux’s performance always engaged with that grief in a more gradual way, as vestiges of Kevin’s old life and new one slowly began to slip away. As Kevin got whisked off to alternate planes of existence and put on an older man’s clothes, Theroux made sure that all of these narrative curveballs were centered in the series’ continual figure of redemption. Theroux embodied the uncertainty of an unforgiving world, keeping peace in times of relative serenity and reflecting the horror of a shifting reality. And when the last layers were finally pulled back, he showed the devotion that kept the series’ central romance alive across decades.\r\n\r\nREAD MORE: ‘The Leftovers’: 7 Unambiguous, Post-Finale Facts from Justin Theroux, Carrie Coon, and the Creators\r\nReese Witherspoon, \"Big Little Lies\"\r\n\r\n\r\nSingling out one performance from this ensemble is a bit of a fool’s errand, but as the hub through which this series runs, Witherspoon gets at the shadowy underbelly of this community better than anyone else could. Nearly every character on this show had something to hide, but one of Witherspoon's true accomplishments was being able to play Madeline’s insecurity in a way that straddled the line between shifty string-puller and well-intentioned matriarch. Even as Madeline seesawed back and forth between these two ideas, Witherspoon still wrangled some empathy out of lines instantly quotable lines, like the one HBO rightly plastered in every promo. Madeline operated on her own sense of righteousness and logic, but Witherspoon still was able to tap into the DNA of the show to give it its most compelling character.\r\n\r\nREAD MORE:‘Big Little Lies’ to ’13 Reasons Why’: In Defense of the One-and-Done Limited Series\r\n\r\nHonorable Mention: Kyle MacLachlan, \"Twin Peaks\"\r\n\r\n\r\n\r\nWhatever is happening on \"Twin Peaks\" this season, here's something we feel confident about saying: No one else could do the work that Kyle MacLachlan is doing. Playing approximately three characters (depending on your own interpretations), the many faces of Cooper have us confounded, bewildered, entranced and horrified (depending on the moment). All we honestly want is to see the good agent restored to his pure pie-and-philosophy-loving glory, but we also know that David Lynch and Mark Frost aren't inclined to give us happy endings. Still, we can't look away from MacLachlan whenever he's on screen — it's some of the most challenging but incredible acting of the year.\r\n\r\nStay on top of the latest TV news! Sign up for our TV email newsletter here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2017/07/best-tv-performances-actors-characters-shows-2017-1201851217/", "title": "The 15 Best TV Performances of 2017 (So Far)", "description": "Lead and supporting, heroes and villains — these are the people behind some of our favorite roles of the year.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/07/best-tv-performances-of-2017-so-far.jpg", "width": 780, "height": 482}}, "article": {"published_time": "2017-07-06T15:13:32+00:00", "modified_time": "2017-07-06T15:27:32+00:00", "author": "https://www.indiewire.com/author/hnguyen/", "section": "Television", "tag": "The Leftovers"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1499354012.0, "source": "https://www.indiewire.com", "summary": ""}