{"url": "https://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "text": "Note: contains major spoilers for Stranger Things.\n\nStranger Things season three is almost here. After what feels like years (well, more than a year anyway) they've finally confirmed a date: 4 July, 2019.\n\nSeason one landed like the mothership in Close Encounters: to gasps of wonder, yelps of fear and maybe even a few bassoon solos. The show is a spectacular blend of '80s pop-culture references, eerie storytelling and startling performances from a young cast.\n\nSeason two may've lacked the element of surprise, but it kept the ball rolling despite vocal complaints from critics about certain plot decisions (specifically episode seven: the one with the \"outcast\" street gang who were about as threatening – and plausible – as baddies from The A-Team.)\n\nCo-creators the Duffer brothers have also confirmed that a fourth season is in the pipeline, and producer Shawn Levy has even teased a possible fifth.\n\nSpeaking to Entertainment Weekly, Levy said: \"Hearts were heard breaking in Netflix headquarters when the brothers made four seasons sound like an official end, and I was suddenly getting phone calls from our actors' agents.\n\n\n\n\n\n\"The truth is we're definitely going four seasons [sic] and there's very much the possibility of a fifth. Beyond that, it becomes I think very unlikely.\"\n\n\n\n\n\nFirst things first, though: what can we expect from season three? Here's everything you need to know. \"I've heard the magic number is either four or five,\" Dustin actor Gaten Matarazzo later confirmed First things first, though: what can we expect from season three? Here's everything you need to know.\n\n\n\n\n\nStranger Things season 3 trailer: When is it coming?\n\n\n\nThe show dropped a new teaser back in 2018 in the form of a video advertising the brand new Starcourt Mall heading to Hawkins, Indiana. It didn't give much away about what we can expect from season three, but it does feature a very fun cameo...\n\n\n\n\n\n\"Aesthetically [the new season is] going to feel very different,\" Ross Duffer has promised . \"Everyone is going to this new mall, seeing movies, and, of course, the Hawkins pool is open for business. I think there'll be a sense of fun and joy.\"\n\n\n\n\n\nThe show's official Twitter account has been super active in the run up to the premiere, sharing tonnes of first look promo material and teasers.\n\n\n\n\n\nit's almost feeding time 🙃 pic.twitter.com/20gokeuKJs — Stranger Things (@Stranger_Things) March 19, 2019\n\n\n\n\n\nBut it was the official trailer, which dropped back in March this year, that truly set hearts racing.\n\n\n\n\n\n\n\n\n\nStranger Things season 3 release date: When will it air?\n\nNetflix\n\n\n\n\n\nThursday, July 4 was announced as the official premiere date. Netflix officially renewed Stranger Things for season three on December 1, 2017 , but didn't confirm either the episode count or when exactly the show would return. But finally, after an eternity,was announced as the official premiere date.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"They want to deliver something bigger and better than what they did last year. And so they really want to take the time to get it right,\" she added.\n\n\n\n\n\n\n\n\n\nBut how many episodes are we getting to binge? Back in January 2018, Levy revealed that this would be an eight or nine episode season\n\n\n\n\n\n\"The number of episodes will be dictated by the amount of story that excites us. We now know what is going to happen in season three to every character,\" he confirmed.\n\n\n\n\n\nReports surfaced in February that the new season would indeed run to eight episodes (one less than the previous run), which was officially confirmed in April . As with the previous two seasons, the Duffer Brothers will direct the first two episodes, with Levy directing the third and the fourth.\n\n\n\n\n\n\n\n\n\nStranger Things season 3 cast: Who's in it?\n\nNetflix\n\nThe stars are becoming more and more popular with casting agents by the week –David Harbour played the latest version of Hellboy in the recent reboot, Millie Bobby Brown (Eleven) starred in Godzilla: King of the Monsters, and Finn Wolfhard is returning to Derry (in flashback) for IT: Chapter 2.\n\nBut despite their stock rising, all of the main players are back for round three – and yes, that still means no Barb (and Bob *sobs*) – which means comebacks for: Finn Wolfhard as Mike, Millie Bobby Brown as Eleven, Noah Schnapp as Will, Gaten Matarazzo as Dustin, Caleb McLaughlin as Lucas, Winona Ryder as Joyce, David Harbour as Hopper, Natalia Dyer as Nancy, Joe Keery as Steve, Sadie Sink as Max and Dacre Montgomery as Billy.\n\nNetflix\n\nFans have particularly been enjoying the promo surrounding Billy.\n\nCharlie Heaton will also be returning as Jonathan, despite an incident at LAX airport back in October which saw him stopped and sent back to the UK (Heaton later apologised).\n\nAnother character who will also be back on our screens is Lucas's little sister Erica (Priah Ferguson).\n\nFerguson was promoted to main cast status in March 2018. Matt Duffer told Yahoo!: \"I love Erica. [Priah] was just a local hire we made in Atlanta. Erica wasn't even supposed to be in [season two] as much as she was. We fell in love with this girl. I thought she's very GIF-able, if that's a word.\"\n\nAnother, less well-loved character is also strongly tipped to return: Eleven's \"lost\" sister Kali, aka 008. \"It feels weird to me that we wouldn't solve [Kali's] storyline,\" Matt Duffer told The Hollywood Reporter. \"I would say chances are very high she comes back.\" So… Yay?\n\nWe know that Dr Brenner (Matthew Modine) is apparently still alive, so it would seem likely that we'll see more of him in seasons to come, provided Modine is up for it.\n\nLittle Women actress (and daughter of Uma Thurman and Ethan Hawke) Maya Hawke will join the cast of season three as Robin, an \"alternative girl\" whose boring day job gets much more interesting when she discovers the town's dark secret.\n\nRelated: All the Stranger Things cast members confirmed for season 3 return\n\nThere will also be at least three more new major characters joining in on the fun: first up is middle-aged Mayor of Hawkins, Larry Kline, who is described as \"a classic, 80s-style slick politician\".\n\nHe'll be played by Cary Elwes, of The Princess Bride and Saw fame.\n\nChristopher Polk/Getty Images for Turner\n\nThen there's a \"sexist\" and \"morally compromised news reporter in his 50s\" called Bruce (played by Jake Busey) and a \"sweet, neighbourhood elder\" called Patricia Brown who spends her time gardening and offering advice to the children in the neighbourhood.\n\nThere's also Francesca Reale as Heather, a lifeguard, Dakota James Alden Lane as another lifeguard, and Caroline Arapoglou as Winnie, who has her eye on Billy.\n\nOne character unlikely to return is Chester the dog. Noah Schnapp accidentally revealed his fate at Chicago's Stranger Con: \"I think he died, didn't he? He did. You can tell, I guess. Like, in this season, there's a grave for him that you see.\" WHOOPS. \"Oh, I don't think I was supposed to say that.\"\n\nThere's also a chance that we'll see more new faces, judging from the words of casting director Carmen Cuba.\n\nRelated: The Stranger Things kids are going to make A LOT more money in season 3\n\n\"There's a certain storyline that's challenging that we have to keep going back to the well for,\" she told The Hollywood Reporter last year.\n\n\"There's a lot of secrecy, and we can't say what parts we're looking for, so it's still a weird challenge.\n\n\"I know that if we said, 'We're looking for this and it's for Stranger Things,' we would have tonnes more options, but it's still a lot of work.\"\n\nSo keep your eyes peeled.\n\nOh, and despite rumours of some changes behind the camera, we can confirm that the Duffer brothers have no plans to quit Stranger Things.\n\nStranger Things season 3 theories and plot: What will\n\nThe official synopsis for season three reads as follows: \"It’s 1985 in Hawkins, Indiana, and summer's heating up. School's out, there's a brand new mall in town, and the Hawkins crew are on the cusp of adulthood. Romance blossoms and complicates the group's dynamic, and they'll have to figure out how to grow up without growing apart.\n\n\"Meanwhile, danger looms. When the town's threatened by enemies old and new, Eleven and her friends are reminded that evil never ends; it evolves. Now they'll have to band together to survive, and remember that friendship is always stronger than fear.\"\n\nPosted back in December 2018, a teaser for the third season also revealed all eight episode titles.\n\nThey're as follows:\n\n'Suzie, Do You Copy?'\n\n'The Mall Rats'\n\n'The Case of the Missing Lifeguard'\n\n'The Sauna Test'\n\n'The Source'\n\n'The Birthday'\n\n'The Bite'\n\n'The Battle of Star Court'.\n\nIt's important to remember, however, that Stranger Things released a similar teaser ahead of season two and a few of those episode titles had changed by the time the finished product hit Netflix – so prepare yourselves for potential alterations.\n\nThe Duffers have confirmed that, as with season two, there will be a time jump of one year between seasons two and three. Matt Duffer told The Hollywood Reporter: \"Even if we wanted to hop into the action faster, we couldn't. Our kids are ageing.\n\n\"We can only write and produce the show so fast. They're going to be almost a year older by the time we start shooting season three. It provides certain challenges. You can't start right after season two ended.\n\n\"It forces you to do a time jump. But what I like is that it makes you evolve the show.\"\n\n\"It's always about a year later,\" said Dyer (Nancy). \"So [just thinking] about what's gone on this year, like 'Where are we?'. Just seeing how the characters have grown in the meantime.... I get really excited about that story and where everyone's been.\"\n\n\"Season three is set in the summer, so right out of the gate that's a big difference,\" Levy confirmed.\n\nNetflix\n\n\"The first two seasons were very much school-based. This is that time of year where it's not about school, it's about the swimming pool and campfires and parades and Fourth of July and fireworks, so there's kind of a poppy fun to season three that's really enjoyable before things inevitably turn super dark.\"\n\nTalking up that light/dark contrast again, Ross Duffer has described season three as both the \"most fun\" yet, but also \"the grossest\" – citing influences ranging from John Carpenter's The Thing to David Cronenberg movies to George Romero zombie flicks.\n\n\"There are horror movies and horror masters that we haven't really paid tribute to as much in previous seasons that we are definitely going to get into this season,\" he said.\n\nRoss has also, somewhat upsettingly, described the third season as \"the final summer of [the central gang's] childhood. They're dealing with growing up, with these complicated new relationships.\n\n\"They're starting to fall apart a little bit, and maybe they don't love playing Dungeons & Dragons as much as they used to. Naturally, that's going to generate conflict.\"\n\nAfter that final shot of season two, we'll definitely see the Mind Flayer/Shadow Monster again, though he's done with the demo-dogs and will be exploring \"some new strategies\".\n\n\"We ended season two with a clear signal that the Shadow Monster was not eliminated, and maybe he's even identified his foe,\" said Levy. \"And that darkness, and the battle that it will require, grows in season three.\"\n\nRelated: Stranger Things team reveal secrets of the Shadow Monster in extract from new official companion book\n\nSeason three will further explore the mythology of the Upside Down, but don't expect clear answers.\n\nRoss Duffer says: \"There's no way [the kids] can ever truly fully understand this place. We have our Upside Down document which describes its rules and its mythology in quite a bit of detail, but I think we're just going to slowly parse that out, and maybe not even fully use all of it.\n\n\"Our favourite thing to do on this show is that these characters, especially the kids, are able to make these leaps about the Mind Flayer and how it operates and what it wants, but they're just basing this off of games that they've played. They don't really know for sure.\"\n\nTalking to IndieWire, creators Ross and Matt Duffer gave some teasers for the season, although admitted that at the moment they're currently \"just working with some writers and figuring out where it's going to go\".\n\nRelated: Stranger Things – 9 questions and theories that'll turn your world Upside Down...\n\nThey were able to say that the plan for season three is to be \"something almost weirdly more intimate\" and \"a lot of fun\".\n\nRoss said: \"I love the early days of seasons, because you are filled with all of these possibilities. We are having a lot of fun just bouncing around cool ideas.\"\n\nMatt hinted that the next season will focus more on character development than scale: \"It's not necessarily going to be bigger in scale. What I am really excited about is giving these characters an interesting journey to go on.\"\n\nRather confusingly, though, Natalia Dyer later suggested that this season \"feels very... big. I mean they all feel big, but this one feels maybe the biggest so far.\"\n\nBig, but also small? Sounds pretty Upside Down to us.\n\nNetflix\n\nRelated: Stranger Things season 3's Chief Hopper aka David Harbour has a bold new look\n\nDavid Harbour has also hinted at exploring some more of Hopper's backstory: \"We've also seen a lot of things, when Eleven goes down to his cellar and sees the boxes, we see a box that says Dad, a box that says New York, a box that says Vietnam. These are little Easter eggs for Jim, further layers of the onion that can be peeled back. \"More will be revealed on that front.\"\n\nHarbour also revealed a nugget or two that suggest his daughter Sara's history will be further explored in later seasons. Like the stuffed tiger toy that appears in Eleven's room, Will's castle and Sara's hospital room. Did Sara come into contact with the Upside Down?\n\nNetflix\n\nHe's also been talking up his character's potential romance with Joyce Byers by saying that they're \"built for each other\", while adding that we'll see a different side to Hopper now that he's adopted Eleven as his daughter.\n\n\"What's he like when there are no crimes, and when he's just raising a teenage daughter who's becoming a woman — I think it is probably the greatest challenge for him,\" Harbour outlined. \"It is probably much more terrifying than any Demogorgon could possibly be.\"\n\nAnd speaking of father figures, we'll get to see a lot more of Steve (Joe Keery) acting as a mentor to Dustin and the other kids. \"I'll just say we won't be abandoning the Dad Steve magic,\" hinted Shawn Levy.\n\nAmong the plot threads still dangling: the burgeoning relationship between Mike and Eleven (which we'll definitely see more of); the no less burgeoning friendship (and more?) between Hopper and Joyce; Dustin's jealousy of Lucas; Max's subdued but not beaten douchebag brother Billy...\n\nAnd some gubbins or other about trans-dimensional beasts.\n\nTalking of Billy though, Dacre Montgomery has spoken to The Wrap about whether he could be the 'monster' of the next season. \"That's really interesting — you mean using my body as a host?\" he responded.\n\nNetflix\n\n\"I don't know, I don't want to speculate too much. I feel like the Duffers [co-creators Matt and Ross Duffer] are so great, that they're going to have all kind of things up their sleeves. I'm excited to see where it goes.\"\n\nMillie Bobby Brown has got a pretty dark idea for how she wants season three to go for Eleven as she wants her to \"sacrifice herself in some way\".\n\n\"I want to have her really sacrifice her powers. If Eleven loses her powers, is she as powerful just as a character? I think that would be very cool,\" she explained. \"I want to build her to be a strong person without her powers... But right now it's very about her powers and I think taking that away slowly could be cool.\"\n\nFortunately for Schnapp, Will is going to be given a break in the new season. \"We're not going to put Will through hell for a third season in a row. He'll be dealing with stuff, but he won't be at rock bottom the way we forced the amazing Noah Schnapp to play,\" Levy outlined.\n\nBut it won't be plain sailing for the children as Levy also noted that there will be \"forces of evil that are new\" in season three, even if there will be \"plenty of summer fun AND light\" so that's nice.\n\nStranger Things seasons one and two are available to watch now on Netflix.\n\n\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Instagram and Twitter account.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.504xh;0,0.202xh&resize=1200:*", "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/44/1509550746-a.jpg?crop=1xw:1.0xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/millie-bobby-brown-stranger-things-3-1553084275.jpg?crop=0.660xw:0.671xh;0.186xw,0.303xh&resize=300:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.504xh;0,0.202xh&resize=1200:*", "keywords": [], "authors": ["Chris Longridge", "Ian Sandwell"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "title": "Stranger Things season 3 release date, cast, theories and everything you need to know", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "Stranger Things season 3: All you need to know", "description": "What's next for Eleven and the boys?", "url": "http://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.504xh;0,0.202xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2019-06-12 11:54:35", "published_time": "2019-06-12 11:54:00", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.504xh;0,0.202xh&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Stranger Things season 3 release date, cast, theories and everything you need to know", "description": "Here's all the knowledge we could glean about Eleven & co's next adventures.", "keywords": "Stranger Things, Stranger Things season 3, Stranger Things 3, Stranger Things season 3 release date, Stranger Things release date, stranger things season 3 cast, stranger things season 3 theories, stranger things season 3 trailer, Millie Bobby Brown, Finn Wolfhard, Noah Schnapp, stranger things season 3 auditions, stranger things season 3 date, stranger things season 3 script", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Noah Schnapp,Finn Wolfhard,Millie Bobby Brown", "sailthru.date": "2019-06-12T11:54:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.504xh;0,0.202xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.socialtitle": "Stranger Things season 3: All you need to know", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1560311640.0, "source": "https://www.digitalspy.com", "summary": ""}