{"url": "https://greysanatomy.fandom.com/wiki/Do_You_Believe_in_Magic", "text": "Do You Believe in Magic Season 9 Episode 22 Richard called Ben because he's worried about Bailey. Episode Information Airdate May 2, 2013 Written by Dan Bucatinsky Directed by Kevin McKidd Episode Guide Previous Next Sleeping Monster Readiness is All\n\n“ There's no such thing as magic. As far as we know. And while as surgeons, we study the secrets behind the human body's intricate network of cells, tissues and organs, when things go wrong, horribly, horribly wrong, there are only so many tricks we up on our sleeves to put a body back together. But there is a kind of power, more of a spell really, and when we get it right, it can be pretty damn magical. As surgeons, we are no stranger to the breaks and tears in the human body. In fact, we sacrifice the better part of our twenties learning every possible way to make it whole again. But there are some wounds a surgeon can't repair. Not on our own. It takes a kind of power we just don't have. There's no such thing as magic. Not in the traditional, abracadabra, genie in a bottle kind of way. But there is a magic in knowing that while not everything can be repaired, most everything can be survived. ” — Meredith Grey\n\nDo You Believe in Magic is the twenty-second episode of the ninth season and the 194th overall episode of Grey's Anatomy.\n\nContents show]\n\nShort Summary Edit\n\nThe doctors reach out to Bailey but she continues to shut everyone out. After an incident with Ethan’s grandmother, Owen fears the child could end up in foster care and a new craniofacial specialist arrives at Grey Sloan Memorial Hospital to work on a young patient. Meanwhile, a magician’s assistant is rushed into the ER after a magic trick goes terribly wrong.\n\nFull Summary Edit\n\nA patient is brought into the ER, while a magician and his assistant are screaming at each other next to the ambulance. The assistant yells that she said the safeword, but the magician yells back that he didn't hear her. Meanwhile, Meredith's voice over is talking about the existence of magic. Meredith, Heather, and Shane start working on the patient. They're then told that the trick that went wrong, was the \"saw the lady in half\". Meredith then reveals the deep cut in the woman's abdomen; she's really almost cut in half. Meredith yells to page Bailey.\n\nAt the coffee cart, Arizona grabs a coffee with the name Lauren on it. Another woman comes over and tells her that she's Lauren, as in on the coffee she's oversugaring. Arizona apologizes and Lauren takes Arizona's coffee. \"See you around, I hope,\" Lauren says before leaving.\n\nWhile Callie comes running to Meredith and her interns, who are taking the patient to the OR, to assist them, the magician once again tells them that he didn't hear \"Titanic\", which is their safeword. The assistant keeps talking about the trick, but the magician urges her to stop talking as she'll reveal how the trick works. Derek comes over too, saying Heather was with him an a Moyamoya case. Despite Heather's objections, Meredith tells him he can take her. Richard comes running towards them, saying he was paged. He informs them he's still taking care of Bailey's patients. Callie questions this, as Bailey is infection free. Before the elevator closes, Callie tells them to page her when the patient's stable enough for X-rays. In the elevator, Meredith questions how the patient could still be alive.\n\nOwen is urging Nancy to explain to her grandson that his dad may never wake up again. She asks him to talk to Ethan instead. Ethan wakes up, asking if his father's awake.\n\nCristina is talking to Alex about Paul Dawson, who would normally wake up after 8 days. She tells him the family expected Paul'd wake up exactly on the eighth day, while it could also be the tenth. Alex is wearing a sweater, looks depressed and is listening to music, so he's not hearing her. When she takes out one of his earphones, the music turns out to heavy metal. \"What is this, the soundtrack of your broken heart?\" she asks. She tells him to get over \"the hairball\", which is her new nickname for Jo. He tells her he's trying, but that he keeps running into her. When the elevator opens, Jo is ready to get in. \"Out of order, hairball! Take the stairs!\" Cristina says, and she pushes a button so the doors close.\n\nApril is treating a patient named Kim, with severe abdominal pain. Two of Kim's friends are with her, but they're totally drunk. They had a party for her 21st birthday. April is asking them questions, but they're too drunk too answer properly. One of the girls is taking pictures of Kim and pukes, which causes the other one to laugh.\n\nArizona and Callie are walking. Callie asks who Lauren is, but when Arizona starts explaining, Callie starts talking about Bailey, who, according to Arizona, is locking herself in her genome lab. Callie says Bailey should only be pissed at Jackson, who standing next to them, because he called the CDC. \"Who's pissed at me?\" he asks. Callie repeats that Bailey is pissed because he called the CDC. \"We all called the CDC,\" Jackson says. \"I didn't,\" Callie responds. She proposes to go talk to Bailey, but Arizona leaves as she has a consult. \"How can you go work when you know Bailey is mad at you?\" Callie asks her before walking away herself. Stephanie now walks towards Jackson. As he sees her, he remembers he forgot their dinner plans of the previous night, but he promises her he'll make up tonight.\n\nCallie is outside of Bailey's genome lab, trying to get Bailey to let her in, but Bailey keeps ignoring. Callie tells her that she never thought Bailey did anything wrong, but that she agreed to call the CDC so Bailey's name would be cleared. Bailey hears her, but just doesn't respond.\n\nIn the ambulance bay, Owen and Ethan are playing soccer. Ethan asks what happens if his father never wakes up, but Owen tells him not to worry. Nancy Dawson wants to go back to their hotel to get some sleep. Ethan wants to stay with Owen, but Owen tells him to go with his grandmother, saying he'll call if anything happens.\n\nRichard, Meredith, and Shane are operating on their patient. Meredith proposes to pack up the patient. Callie comes in, saying she'll take a look at the breaks as soon as the patient is stable. Richard says they're only doing damage control now. Callie says that Bailey ignored her, and Meredith asks Richard if she's spoken to him, but he wants to focus on the patient. Callie leaves.\n\nHeather presents the patient, Iris, a girl with Moyamoya disease. Her little brother keeps drawing the parents's attention. Alex explains how they'll operate. Heather tries to calm down the little boy, but he hits her with a toy soldier. He suddenly runs out, and the parents run after him. Iris tells the doctors to just tell her, as they'll be gone for a while.\n\nArizona enters a patient room, where she's greeted by Jackson and Dr. Lauren Boswell, whom she met earlier. Lauren is a craniofacial specialist who was flown in to help out with Tyler, a baby with part of his brain on the outside of his skull. Lauren says she's thrilled to be there, and Arizona asks her about her surgical plan. Lauren says she'd like to see more scans before making a decision. Before leaving, Lauren says she looks forward to talking again. Jackson thinks Lauren is a rock star.\n\nRichard explains to the magician and the assistant that they need to let their patient rest before they go back into surgery. The assistant blames the magician for cutting into his wife with a chainsaw.\n\nCristina is thinking out loud, how she could've treated Paul Dawson if she didn't introduce hypothermia. She concludes that she did the right thing.\n\nApril is trying to get her patient's friends to answer her questions, but they keep giggling until they see Jackson, whom they find hot. They wave him over. April yells that their friend will die of they don't start cooperating. They then tell her all the drinks they had at all the different bars and clubs they visited. When they tell that they a smokey nipple, a drink that causes smoke to come out of your mouth when you drink it, Kim coughs up blood.\n\nHeather, Stephanie, Jo, and Shane are watching the video of the magician cutting into his wife on YouTube. They try to figure out how the trick works. Alex walks by, and he is bumped because he saw Jo again. He runs into Meredith and Cristina. They tease him about his \"little broken heart\", and he walks away. Meredith tells Cristina that Bailey is mad and locked herself in her lab. Cristina then leaves to go talk to her. Meredith gets a page.\n\nHer patient is bleeding out of her abdomen. They bring her back to the OR. The magician holds back the assistant, who then yells that she and his wife were in love, which he would've noticed if he payed attention to her.\n\nCristina is outside Bailey's genome lab, saying she asked every doctor in the hospital if they have any idea how to wake up Paul. Bailey stays silent. \"Oh my God, you're right! Go global! Bailey, you are a genius!\" she says as she walks away. Callie and Arizona run into her, and they ask how it went with Bailey. \"So great!\" Cristina says. \"Did you get her to talk?\" Callie asks. \"No, why?\" Cristina says. Callie sighs, and tells Arizona to talk to Bailey in a bright and sunshiny way. Arizona tries to get Bailey talking by saying that she can be mad at them, that they can take it. Callie thinks the silent treatment is a cry for help, but Arizona thinks it's her way of saying to leave her alone. Arizona leaves to go check on her patient. \"Fine, you wanna give me the silent treatment? Well, I can give it right back!\" Callie says. She stays silent for a couple of seconds, and then begs for Bailey to talk.\n\nJackson enters the OR where April is operating on Kim. April has to take out the stomach. April says she needs another surgeon and that she paged Bailey, but Jackson tells her that Richard takes her cases. When April realizes that he is with the \"chainsaw lady\", Jackson says he'll scrub in with her.\n\nAs Richard, Meredith, and Shane are getting ready to open up their patient, Callie comes in, saying Bailey is mad at all of them. She thinks that Richard may get her to open the door for him, and Meredith agrees. He thinks that he is the one person that Bailey doesn't want to see right now, as he hurt her deeply and he's not sure he'll be able to repair that. He asks them to focus on saving the patient. Callie leaves, saying she'll come back for the pelvis when he's done.\n\nCristina is on the phone with a French doctor hoping they can help her wake up Paul, but she has no success. Stephanie tells her the Mexican doctors couldn't help them either. Cristina sends Stephanie off while she keeps thinking.\n\nDerek and Alex are operating on Iris when Jo comes in. Derek invites her to come closer to take a look, as Moyamoya is a rare disease. Jo feels a little awkward because Alex is in there. She starts asking questions, which Derek answers. He says that the brain needs to suck up blood, like a vampire, and that they need to be lucky for the procedure to work, which bothers Heather. It will also take a few weeks before it can work. Derek tells Jo to scrub in, as he'll allow her to help him close up the patient, which bothers Alex.\n\nApril and Jackson just took out the patient's stomach. Jackson confesses that owning the hospital is not that much fun, as he doesn't get to operate that much anymore. He compares himself to Lauren, who flies around the world to perform miracles. \"You're holding this place together, Jackson. That's pretty miraculous,\" April says.\n\nLauren shows Arizona Tyler's scans and explains her her surgery. Callie comes in to talk to Arizona, and Arizona introduces her to Lauren. Callie is fascinated by Lauren and her surgical plan. \"I'm a little bit in love with her,\" Callie whispers to Arizona.\n\nJackson is just in time to meet Cristina, Meredith, Arizona, Callie and Derek, who are waiting outside the restroom. When Bailey comes out, they try to get her to talk to them and they all apologize, but she just keeps on walking and ignoring them, and locks herself in her genome lab again. Arizona gets paged to the ER. \"Guess what, lady, this isn't even your lab! We bought it for you!\" Callie yells. She and the other think that was a little too much.\n\nOwen runs up to Arizona, who comes into the ER with Ethan. He had an overdose of Nancy's sleeping pills. He wants to help out, but Arizona says he's too close to the case. Owen blames Nancy, as they're now legally obligated to call social services, but he stops as soon as she starts crying.\n\nCristina runs up to Owen, who's still watching Arizona taking care of Ethan. Owen thinks he's stable. Arizona tells them that she's hopeful that he'll wake up soon and that she already called social services. The idea of sleeping pills gives Cristina an idea.\n\nStephanie asks why they're giving Paul sleeping pills if they want him to wake up. Cristina explains that the drug in the pills can reverse the effect of drowsiness when the chemical balance in the brain has been disturbed. \"This could actually wake him up,\" Owen says. Cristina says that it normally only takes a couple of minutes before the patient wakes up and gives him the drug.\n\nThe magician and the assistant are watching Kayla, the \"chainsaw lady\". They keep bickering until Meredith tells them to stop and just be there for Kayla. Danny, the magician, confesses that he knew how unhappy Kayla was in their marriage. He thought becoming more famous and earning more money would repair their marriage. He tells Cherise, the assistant, that she's the only one who understands Kayla.\n\nJo starts working on a computer next to Alex, and he makes it clear he wants her to leave. She asks him to talk. She doesn't want to avoid peds, so she asks to at least work together. He yells that it's her problem that Jason can't deal with her past. She then walks away and asks him to stay out of her business. \"Don't worry, I'm out!\" he yells.\n\nDerek's patient is squeezing in a ball. He explains that Iris's brain will have to suck up the blood she's been missing. Heather adds that that will happen in a few weeks. Iris's brother then starts running around in the room to get attention. Derek calms him down by saying that he needs to be nice to his sister, as they opened up her head to put magic in her head, giving her special powers. Derek walks away, and then Heather says that they put a vampire in her head. \"I'd watch out, kid,\" she says before leaving too.\n\nAs she and Jackson leave Kim's room, April overhears Kim's friends say that Kim will be able to drink again when it's spring break. She wants them to stop drinking and study, so they can become awesome. She and Jackson walk on, and she asks if he wants to go to Joe's. He says no because he has other plans. April remembers she's supposed to meet up with Matthew, but she proposes to have a drink at another time.\n\nCristina and Owen are still waiting for Paul to wake up. It's been an hour, and Owen mentions that there's a social worker downstairs to take away Ethan.\n\nMeredith is talking to Bailey about Kayla Wayne's case, but Bailey doesn't respond. She eventually walks away. We now see what Bailey is doing: she is testing herself for the infection. She puts the agar plate she just used on the table, and as the camera moves, we see that the table is filled with other agar plates, which were all negative for the infection.\n\nOwen enters Ethan's room and he wants to hear what happened. Ethan tells him he just wanted to sleep. Owen tells him not to take pills without his parents's consent. \"I don't think I have parents anymore,\" Ethan says. Owen says that he still has his dad. Ethan asks if they can try something to wake up his dad. Cristina, who just walked in, says that they're trying everything they can think of. \"We haven't given up on him. Neither should you,\" Cristina says. Ethan starts crying, and Owen consoles him, watched by Cristina.\n\nJackson and Alex leave the ER, and they hear something. They turn around and see Jo having a fight with Jason. Alex says he doesn't care and they continue walking.\n\nEthan is asleep. Outside the room, Nancy tells Owen that the social worker wasn't taking Ethan in custody as it were extraordinary circumstances, but she believes that it would be better if Ethan were taken. She says she can't do it, as she has cataracts and can't even drive anymore. There's no one else in the family who can take care of him. Owen wants to help her find a solution. Nancy thinks she lost her son. She says Ethan needs someone to take care of him, and that she can't do it.\n\nAlex and Jackson enter Joe's bar, where Stephanie is sitting at the bar. He tries to make an excuse, but she yells to shut up. She wants him to listen to her. She wants to know why they haven't hung out for 11 days. He says it is because he's head of the hospital, but she thinks it's not an excuse for standing her up. She wants him to treat her better. He kisses her.\n\nArizona gets in an elevator, where she meets Lauren. Lauren compliments her eyes. Arizona says she's happily married with Dr. Torres and that she only has one leg, but Lauren says that she already knew because there's only one Arizona Robbins on the Internet. Lauren walks out of the elevator.\n\nCherise is sitting next to Kayla's bed. Danny is outside the room, watching them. Shane and Heather are at the desk behind him, talking about the cases they had. They are still trying to figure out how the tricks works as well. Danny says that they want to know, as it only ruins the trick. Danny then walks away.\n\nRichard is outside Bailey's genome lab, watching her. Suddenly, Ben runs up to him. They shake hands, and Ben tells him he came as fast as he could. Meredith sees them and smiles, while Richard tells Ben that Miranda needs him. As Ben knocks, Bailey thinks it's another colleague and she rolls her eyes. When she hears his voice, she quickly opens the door. She wants to know who called him, but he says it's not important and hugs her. He tells her he's there for her, and that she doesn't need to keep doing things on her own. Bailey confesses that she blames herself for killing the three patients. Bailey says she doesn't believe that it won't happen again and that she's been testing herself for the infection all over again. She says that she still feels dirty all the time. She stars crying. \"They died, because of me,\" she says as she cries in his arms.\n\nOwen and Cristina lie in bed together in an on-call room. Cristina says he's changed, and that he wants a kid. \"I want you,\" he says convincingly, and they kiss. As they stop kissing, Owen sees her face, realizing she doubts what he just said.\n\nDerek and Meredith are having a tea party with Zola. Derek says Zola is perfect and worries that their new baby will steal her toys. Meredith says he will, as that's what kids do. He says that she has no idea what'll happen to her, but Meredith says that she'll handle her brother just fine. \"You're wearing your princess crown,\" Meredith says. \"I am,\" Derek agrees. \"She's very good at getting people to submit to her will,\" Meredith says. Derek \"drinks\" his tea, and he asks for more tea.\n\nAs Alex arrives home, he sees Jo sitting in front of the house in the dark. He starts saying he's doing his best at leaving her alone and questions why she's at his house. As she lifts up her head to ask if she can stay with him, Alex sees her face is bruised.\n\nCast Edit\n\nMeredith Grey\n\nCristina Yang\n\nAlex Karev\n\nMiranda Bailey\n\nRichard Webber\n\nCallie Torres\n\nOwen Hunt\n\nArizona Robbins\n\nApril Kepner\n\nJackson Avery\n\nDerek Shepherd\n\nLauren Boswell\n\nBen Warren\n\nDanny Wayne\n\nJo Wilson\n\nShane Ross\n\nHeather Brooks\n\nStephanie Edwards\n\nNancy Dawson\n\nJason Myers\n\nCherise\n\nPaul Dawson\n\nBrenda and Talia\n\nRob Kane\n\nSusan Kane\n\nEthan Dawson\n\nKim Welles\n\nDr. Knox\n\nParamedic (on the right)\n\nIris Kane\n\nDavid Kane\n\nKayla Wayne 1 of 32\n\nMain Cast Edit\n\nGuest Stars Edit\n\nUncredited Edit\n\nAna Valverde as Kayla Wayne\n\nMedical Notes Edit\n\nDiagnosis: Severe abdominal wound Pelvic fracture\n\n\n\nTreatment: Surgery\n\n\n\nKayla, 32, was brought into the hospital with tachycardia. She was hypoxic even after she was intubated. She had been sawed in half during a magic trick that went wrong. One of her kidneys and part of her large intestine were removed. Before they were able to repair all of the damage, they had to pack her and close. She developed abdominal compartment syndrome and so was taken back to the OR. After surgery, she was being monitored carefully to see if her condition would improve.\n\nDiagnosis: Coma\n\n\n\nTreatment: Sleeping pills\n\n\n\nPaul was still comatose after eight days. Cristina tried to think of a new treatment option for him. She tried treating him with sleeping pills, hoping it would reverse the effects as it has been known to do.\n\nDiagnosis: Abdominal rupture\n\n\n\nTreatment: Roux-en-y anastomosis\n\n\n\nKim, 21, came into the ER with stomach pain. April ran some tests and asked her friends about what she ate because she had an abdominal rupture. It turned out that the rupture was caused by the liquid nitrogen in one of her drinks. Due to the lack of remaining stomach tissue, April planned a Roux-en-y anastomosis, in which she would remove the stomach entirely and attach the small intestine to her esophagus.\n\nDiagnosis: Moyamoya disease Transient ischemic attacks\n\n\n\nTreatment: Omental flap\n\n\n\nIris, 6, was in the hospital with Moyamoya disease, which was to be treated with an omental flap. They were taking tissue out of her abdomen to place in her brain to restore proper blood flow. After surgery, Iris's hand was already getting stronger.\n\nDiagnosis: Encephalocele Facial cleft\n\n\n\nTreatment: Resection Bone graft Cranial reconstruction Cleft lip repair\n\n\n\nTyler was in the hospital with an encephalocele and facial cleft. Dr. Boswell was flown in as a specialist to help. Scans revealed that the encephalocele contained only fluid and no brain matter, so it just had to be removed and then his cranium reconstructed. Then they planned a cleft lip repair.\n\nDiagnosis: Facial laceration\n\n\n\nDoctors:\n\nTreatment: Bandage\n\n\n\nHeather was hit in the forehead by a toy and bandaged the wound.\n\nDiagnosis: Zolpidem overdose\n\n\n\nTreatment: Flumazenil\n\n\n\nEthan was brought back into the OR after overdosing on his grandmother's sleeping pills. He was given Flumazenil in the ER to reverse the effects of the Zolpidem.\n\nDiagnosis:\n\nTreatment:\n\nBailey continuously tested and re-tested herself for MRSA USA600, all of which yielded negative results.\n\nMusic Edit\n\nSong Performer Scene \"Elation\" Isbells Owen and Ethan play soccer.\n\nEthan goes to the hotel with his grandmother. \"Beat of the Drum\" Van She Cristina sends off Stephanie when she has no new information on how to wake up Paul Dawson.\n\nDerek and Alex are operating on the girl with the moyamoya disease.\n\nJackson and April talk while operating together.\n\nLauren Boswell explains her surgical plan to Arizona and Callie.\n\nJackson, Derek, Meredith, Callie, Arizona and Cristina try to get through to Bailey, but she locks herself in her lab again. \"Uneven Odds\" Sleeping at Last Cristina comes up with a plan to wake up Paul.\n\nWhen Richard is informing them on Kayla's condition, Meredith tells Danny and Cherise to stop fighting.\n\nDanny realizes how unhappy Kayla was in their relationship and that she wants to be together with Cherise.\n\nJo tells Alex she still wants to work together.\n\nThey have an argument and he assures her he'll stay out of her life. \"Rust or Gold\" Jill Andrews Stephanie wants Jackson to treat her better and Jackson then kisses her.\n\nArizona and Lauren are in the elevator together, where Lauren keeps flirting with Arizona.\n\nArizona says she's married and only has one leg, but Lauren confesses she already knew as she googled her.\n\nHeather and Shane try to figure out how the magician's trick works, but Danny says that only ruins it.\n\nBen, who was called by Richard, arrives at the hospital to support his wife.\n\nBailey finally opens the door of her lab to let him in. \"New York\" The Boxer Rebellion Bailey confesses to Ben she blames herself for killing the patients.\n\nCristina realizes Owen wants a kid, but he says he wants her and they kiss.\n\nWhile questioning how Zola and their baby will get along, Meredith and Derek are having a \"tea party\" with Zola.\n\nJo, who is sitting outside Alex's house, asks Alex if she can stay with him, revealing she was beaten up.\n\n\"Elation\" - Isbells \"Beat of the Drum\" - Van She \"Uneven Odds\" - Sleeping at Last \"Rust or Gold\" - Jill Andrews \"New York\" - The Boxer Rebellion\n\nNotes and Trivia Edit\n\nGrey's Anatomy 9x22 Promo \"Do You Believe in Magic\" (HD)\n\nThis episode's title originated from the song Do You Believe in Magic , originally sung by The Lovin' Spoonful .\n\n, originally sung by . This episode scored 8.87 million viewers.\n\nAlthough there are stills from this episode of Callie and Arizona in their bedroom, the scene wasn't in the episode itself.\n\nThis episode takes place on May 1, 2013, as seen on Bailey's agar plates.\n\nGallery Edit\n\nEpisode Stills Edit\n\nBehind the Scenes Edit\n\nQuotes Edit\n\n(standing in the elevator, talking about Jo) Cristina: You gotta get over the hairball. Alex: I've been trying but I keep running into her. (The elevator doors open and Cristina and Alex see Jo, who's ready to step in.) Cristina: Out of order, hairball! Take the stairs. (The elevator doors close.)\n\nBailey: I've been testing myself, and testing myself and testing myself. But it doesn't go away. The feeling... I... I feel so... dirty. (She looks down at her hands.) All the time, it's... (Ben takes her hands, but Bailey counteracts and she starts crying.) Bailey: No. They all died because of me. They died... (Ben takes her in his arms and comforts her.)\n\nLauren Boswell: I'm Lauren. Arizona: Uh, okay. Hi Lauren! Lauren Boswell: No, I mean Lauren, as in Lauren on the coffee you're way oversugaring. Arizona: Oh, yikes! I'm so sorry, you know what, I didn't even look up there and I just grabbed it. Lauren Boswell: It's okay, really, it's not a problem.\n\nCallie: Fine, you wanna give me the silent treatment? Well, I can give it right back. (pauses for a couple of seconds.) Oh come on, Bailey, talk to me!\n\nCristina: (on the phone) Ah, oui, bien sûr? Stephanie: Are you still on the phone with France about the coma fix? Cristina: No, I'm booking us a vacation in Nice. You want a facial the first day?\n\nSee Also Edit", "images": ["https://vignette.wikia.nocookie.net/greysanatomy/images/2/2b/9x22-8new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103025", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/3c/9x22-9new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103033", "https://vignette.wikia.nocookie.net/greysanatomy/images/6/6c/9x22-13new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103109", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190621202210", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/3e/9x22-23new.jpg/revision/latest/scale-to-width-down/185?cb=20130717103306", "https://vignette.wikia.nocookie.net/greysanatomy/images/9/99/9x22BTS2.jpg/revision/latest/scale-to-width-down/209?cb=20130717092943", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://slot1-images.wikia.nocookie.net/__cb1586963839864/common/skins/common/images/magnify-clip.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/e5/9x22-18new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103153", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b5/9x22-11new.jpg/revision/latest/scale-to-width-down/350?cb=20130717103049", "https://vignette.wikia.nocookie.net/greysanatomy/images/9/92/9x22-10new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103041", "https://vignette.wikia.nocookie.net/xavier-riddle-and-the-secret-museum/images/9/97/N2losLW-asset-kids-mezzanine1-16x9-N70Tdc3.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190910004306", "https://vignette.wikia.nocookie.net/greysanatomy/images/d/d8/9x22-12new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103103", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/8e/%22Uneven_Odds%22_-_Sleeping_at_Last/revision/latest/scale-to-width-down/248?cb=20130819230637", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/7f/9x22-16new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103133", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/26/%22Beat_of_the_Drum%22_-_Van_She/revision/latest/scale-to-width-down/248?cb=20150310025752", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/8b/%22New_York%22_-_The_Boxer_Rebellion/revision/latest/scale-to-width-down/248?cb=20150310025809", "https://vignette.wikia.nocookie.net/greysanatomy/images/6/6e/9x22-20new.jpg/revision/latest/scale-to-width-down/185?cb=20130717103217", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/21/9x22-19new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103207", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b5/9x22-11new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103049", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/3b/9x22-5new.jpg/revision/latest/scale-to-width-down/209?cb=20130717102954", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b5/9x22-11new.jpg/revision/latest?cb=20130717103049", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/8b/9x22-14new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103115", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/32/9x22-21new.jpg/revision/latest/scale-to-width-down/185?cb=20130717103227", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/5d/9x22-3new.jpg/revision/latest/scale-to-width-down/209?cb=20130717102938", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/7c/9x22BTS1.jpg/revision/latest/scale-to-width-down/247?cb=20130504074627", "https://vignette.wikia.nocookie.net/greysanatomy/images/0/06/Grey%27s_Anatomy_9x22_Promo_%22Do_You_Believe_in_Magic%22_%28HD%29/revision/latest/scale-to-width-down/300?cb=20131116180140", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/20/9x22-4new.jpg/revision/latest/scale-to-width-down/209?cb=20130717102946", "https://vignette.wikia.nocookie.net/final-space/images/7/7e/Final-Space.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200122100900", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/57/9x22-22new.jpg/revision/latest/scale-to-width-down/185?cb=20130717103259", "https://vignette.wikia.nocookie.net/greysanatomy/images/0/0d/9x22-17new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103140", "https://vignette.wikia.nocookie.net/greysanatomy/images/d/d7/9x22-2new.jpg/revision/latest/scale-to-width-down/209?cb=20130717102903", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/33/9x22-1new.jpg/revision/latest/scale-to-width-down/209?cb=20130717102856", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/3c/9x22-15new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103122", "https://vignette.wikia.nocookie.net/greysanatomy/images/f/f5/%22Elation%22_-_Isbells/revision/latest/scale-to-width-down/248?cb=20150310025733", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b4/%22Rust_or_Gold%22_-_Jill_Andrews/revision/latest/scale-to-width-down/248?cb=20130819230705", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/a3/9x22-7new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103019", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/37/9x22-6new.jpg/revision/latest/scale-to-width-down/209?cb=20130717103010"], "top_img": "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b5/9x22-11new.jpg/revision/latest?cb=20130717103049", "keywords": [], "authors": [], "canonical_link": "https://greysanatomy.fandom.com/wiki/Do_You_Believe_in_Magic", "title": "Do You Believe in Magic", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Grey's Anatomy Universe Wiki,greysanatomy,Do You Believe in Magic,Sleeping Monster,Dan Bucatinsky,Kevin McKidd,Readiness is All,Meredith Grey,Season 9 (Grey's Anatomy),Grey's Anatomy,Craniofacial Surgery,Tyler Sims,Ellen Pompeo", "description": "Do You Believe in Magic Richard called Ben because he's worried about Bailey. Episode Information Airdate May 2, 2013 Written by Dan Bucatinsky Directed by Kevin McKidd Do You Believe in Magic is the twenty-second episode of the ninth season and the 194th overall episode of Grey's Anatomy...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://greysanatomy.fandom.com/wiki/Do_You_Believe_in_Magic", "title": "Do You Believe in Magic | Grey's Anatomy Universe Wiki | Fandom", "description": "Do You Believe in Magic Richard called Ben because he's worried about Bailey. Episode Information Airdate May 2, 2013 Written by Dan Bucatinsky Directed by Kevin McKidd Do You Believe in Magic is..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Grey's Anatomy Universe Wiki", "title": "Do You Believe in Magic", "description": "Do You Believe in Magic Richard called Ben because he's worried about Bailey. Episode Information Airdate May 2, 2013 Written by Dan Bucatinsky Directed by Kevin McKidd Do You Believe in Magic is the twenty-second episode of the ninth season and the 194th overall episode of Grey's Anatomy. Contents[show] Short Summary The doctors reach out to Bailey but she continues to shut everyone out. After an incident with Ethan’s grandmother, Owen fears the child could end up in foster care and a new...", "url": "https://greysanatomy.fandom.com/wiki/Do_You_Believe_in_Magic", "image": "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b5/9x22-11new.jpg/revision/latest?cb=20130717103049"}, "apple-itunes-app": "app-id=1002364550, app-arguments=https://greysanatomy.fandom.com/wiki/Do_You_Believe_in_Magic"}, "movies": [], "publish_date": null, "source": "https://greysanatomy.fandom.com", "summary": ""}