{"url": "https://people.com/tv/jersey-shore-shows-ronnie-ortiz-magro-jen-harley-car-dragging/", "text": "Image zoom George Pimentel/Getty Images\n\nThe drama between Ronnie Ortiz-Magro and his on-off girlfriend Jen Harley once again dominated Thursday’s episode of Jersey Shore Family Vacation.\n\nWith boys’ weekend wrapping up in Las Vegas, Ronnie was grateful that his friends were in town to support him in the wake of his heated hotel room altercation with Harley. Little did they know, things were about to get a whole lot worse.\n\nGet push notifications with news, features and more.\n\n“Moments like this make you realize and remember that we’ve been through so much stuff together, ups and downs,” Ronnie said. “We’ve seen each other at our best moments and we’ve seen each other at our worst moments. It’s definitely good to have the guys around to help me keep my mind off things. Just the fact that they’re here and they want to be here means a lot to me. It shows that we are real brothers.”\n\n“What’s next for me is that I’m going to go spend time with my daughter and take the next steps to get all my ducks in a row,” he continued. “I have to become a better me — for myself, for the baby, for my future.”\n\nAnd while supportive, the guys were apprehensive about leaving their friend behind as they prepared to head home. (Ronnie and Pauly “DJ Pauly D” DelVecchio live in Vegas, but the rest of the cast lives on the East Coast.)\n\n“I’m a little concerned about leaving Ron,” admitted Vinny Guadagnino. “It’s not something that happens overnight, where someone just becomes magically better, but we did our best setting him up with the tools that he needed to succeed. He has a lawyer now, so he has a good support system around him. We can just hope for the best.”\n\nImage zoom Jen Harley/Instagram\n\nOne thing they certainly weren’t hoping for? A reconciliation between the volatile couple — but somehow, that’s exactly what happened. And when Ronnie revealed to Pauly that he and Jen had gotten back together, Pauly was shocked.\n\n“Here we go again,” he said. “I can’t even believe he’s still talking to this woman. She’s toxic. I want to support Ronnie, but this is crazy. I do not think Ron and Jen should ever get back together.”\n\nRELATED: Jersey Shore Cast Gave Ronnie ‘Tough Love’ During Drama with On-Off Girlfriend: ‘It Was Hard’\n\nBack in Jersey, the cast got together to surprise Deena Cortese, who’s expecting her first child, for lunch. The topic quickly turned to Ronnie, who wasn’t there, and Pauly caught everyone up on the latest. Needless to say, they weren’t pleased.\n\n“I am unfortunately not surprised,” Vinny said. “Ronnie tends to make bad decisions in relationships. It just sucks because we all know he shouldn’t be with her.”\n\nJenni “JWoww” Farley called the reconciliation “unbelievable.”\n\n“I don’t give advice, but if there’s anything that I could say to Ron and Jen, it’s keep that s— out of the public eye,” she said. “Deal with it inside your house.”\n\n“Sometimes you have your girlfriends and you give advice and they still stay with the guy and you’re like, ‘Now this is going to ruin our relationship, so just don’t tell me about it’ — I feel like that’s how it should be now,” Nicole “Snooki” Polizzi said.\n\nRELATED VIDEO: Jersey Shore‘s’ Ronnie Ortiz-Magro Apologizes After Public Feud with Girlfriend: ‘I Acted on My Gut’\n\nBut the show must go on, so they decided to plan a trip to the original shore house back in Seaside Heights. A week later, everyone packed up their bags and headed out. The only one who didn’t make it? Ronnie, who got into an even worse altercation with Harley the day before the trip. On June 24, Harley was arrested and charged with domestic battery after an incident in which it was alleged that she briefly dragged Ronnie with her car while their infant daughter was in the backseat.\n\nImage zoom LVMPD/Splash News\n\nShe was released from the Clark County Detention Center the following day after posting the $3,000 bail; the Clark County District Attorney’s Office later confirmed to PEOPLE that there was “insufficient evidence” to prosecute her. And when they heard the news, the roommates could hardly believe it.\n\n“The relationship is toxic,” Vinny said. “It’s insane staying in it.”\n\n“Homeboy is destroyed right now,” Jenni said. “He texted me yesterday [saying] he’s at urgent care.”\n\n“Literally, flesh was coming out of his arm. It was not okay,” said Nicole, while Deena added that Ronnie’s face was “all f—ed up.”\n\n“Honestly, I don’t want him to come,” Jenni admitted. “I really don’t, because I want him with his baby. Between her jumping a median with the f—ing baby in the car, she dragged Ron with the car, he’s in a f—ing sling and is covered in blood — like, done. Not speaking to her, and I’m going to keep it very light and sweet with Ron, because this s— is too crazy.”\n\nOnce the cast reunited at the house, Ronnie FaceTimed in from Vegas with his arm in a sling. And even though they were disappointed he wasn’t there, the roommates just wanted him to focus on himself.\n\n“He just needs to sit this one out, work on himself,” Vinny said. “Hopefully, this was a huge wake-up call for him and he can just figure it out on his own.”\n\n“I love, love, love Ron,” Jenni said. “It’s just like, one of those crazy cousins or brothers or sisters that you have that you wish just made better life choices.”\n\nJersey Shore Family Vacation airs Thursdays (8 p.m. ET) on MTV.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fjen-harley-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fronie-magro-jen-harley.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/jersey-shore-shows-ronnie-ortiz-magro-jen-harley-car-dragging/", "title": "Jersey Shore: Ronnie Ends Up in a Sling After Girlfriend Allegedly Drags Him with Car", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Jenni 'JWoww' Farley,Jersey Shore,Mike 'The Situation' Sorrentino,News,Pauly DelVecchio,Ronnie Ortiz-Magro,TV,Vinny Guadagnino", "news_keywords": "Jenni 'JWoww' Farley,Jersey Shore,Mike 'The Situation' Sorrentino,News,Pauly DelVecchio,Ronnie Ortiz-Magro,TV,Vinny Guadagnino", "description": "Jen Harley was arrested after she allegedly briefly dragged Ronnie with her car while their infant daughter was in the backseat", "og": {"title": "Jersey Shore: Ronnie Ends Up in a Sling After Girlfriend Allegedly Drags Him with Car", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/jersey-shore-shows-ronnie-ortiz-magro-jen-harley-car-dragging/", "description": "The drama between&nbsp;Ronnie Ortiz-Magro&nbsp;and his on-off girlfriend Jen Harley once again dominated Thursday’s episode of&nbsp;Jersey Shore Family Vacation. With boys’ weekend wrapping up in Las&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/jersey-shore-shows-ronnie-ortiz-magro-jen-harley-car-dragging/", "description": "Jen Harley was arrested after she allegedly briefly dragged Ronnie with her car while their infant daughter was in the backseat", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/jersey-shore-shows-ronnie-ortiz-magro-jen-harley-car-dragging/", "title": "Jersey Shore: Ronnie Ends Up in a Sling After Girlfriend Allegedly Drags Him with Car", "description": "Jen Harley was arrested after she allegedly briefly dragged Ronnie with her car while their infant daughter was in the backseat", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fronnie-magro1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}