{"url": "https://www.thisisinsider.com/kim-kardashian-responds-to-saint-west-car-seat-photo-controversy-2017-8", "text": "People accused Kardashian of breaking the law by putting son Saint West in a forward-facing car seat. Dia Dipasupil/Getty Images\n\nThe INSIDER Summary:\n\nKim Kardashian has responded to criticism over the position of her son Saint West's car seat.\n\nThe mom of two posted a photo of her 20-month-old son in a forward-facing car seat on Facebook this June.\n\nIn the comments, many people argued the car seat position was unsafe and broke California state law that requires toddlers under 2 to sit in rear-facing seats.\n\nHowever, the law doesn't apply to children who are over 40 inches tall or weigh more than 40 pounds.\n\nIn a new video, Kardashian explained that Saint West meets those requirements.\n\n\n\nLike other celebrity moms, Kim Kardashian West is used to being criticized for her parenting decisions.\n\nThe reality star recently defended her parenting skills in a new video, which we first read about on People.\n\nIn the video, posted to her website, Kardashian addressed accusations from Facebook users who claimed that she put her son Saint West in danger — and potentially even broke the law — by placing him in a forward-facing car seat.\n\nHere's the offending photo that Kardashian shared on Facebook this June:\n\nMany people in the comments suggested the position of the 20-month-old's car seat wasn't safe, and pointed to a California law passed in January 2017 that says children under the age of two must sit in rear-facing car seats.\n\n\"It's illegal to have a child facing forward in California that is less than 2 years old,\" one user commented. \"Please turn his car seat around, it's not too late!\" Another person wrote: \"Let's protect this handsome boy by making sure [the seat is] rear facing.\"\n\nHowever, the law also mandates that rear-facing car seats are not applicable to children with a height of 40 inches or more, or a weight of over 40 pounds.\n\nIn the video, Kardashian said that her son meets these requirements, and therefore can sit in a forward-facing seat.\n\n\"What people didn't know is that Saint is now the weight and height requirement to sit forward-facing,\" she said. \"Saint actually weighs more than North, if that is believable.\"\n\nAlthough Saint meets the requirements, as this September 2016 article from BabyCenter points out, when a child outgrows their rear-facing car seat's weight and height limits, they can be accommodated in a convertible seat with more room for their height and weight.\n\nBoth the American Association of Pediatricians and the National Highway Traffic Safety Administration recommend that children sit in rear-facing car seats until they are aged 2 or 3, or too big for them.\n\nWhile rear-facing seats are designed to give better support to a child's head, neck, and spine, according to the same article, they are also designed to protect their arms and legs.\n\n\"In a forward-facing car seat during an accident, your child's arms and legs fly forward and are more likely to be injured,\" Ben Hoffman, a pediatrician who specializes in injury prevention at the Doernbecher Children's Hospital at Oregon Health & Science University, told BabyCenter. \"In a rear-facing car seat, the chance of injuries to the arms and legs in a crash is less than 1 in 10,000.\"\n\nRegardless of where you stand on the debate, it's not the first time Kardashian has defended herself for how she chooses to parent her kids.\n\nIn July, the reality star responded to people who shamed her for dressing her 4-year-old daughter North West in a corset-style dress with a Snapchat video that showed her dress didn't feature a real corset, but rather a lace-up detail designed to look like one.\n\n❤️ A post shared by Kim Kardashian West (@kimkardashian) on Jun 6, 2017 at 4:30pm PDT Jun 6, 2017 at 4:30pm PDT\n\nPerhaps, next time, it's best not to judge other people's parenting at all.", "images": ["data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://www.thisisinsider.com/kim-kardashian-responds-to-saint-west-car-seat-photo-controversy-2017-8?width=600&format=jpeg&auto=webp", "https://i.insider.com/59514e95b4db9bd8098b4588?width=1200&format=jpeg", "https://i.insider.com/598495ebb9cd6c21008b468a?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/59514e95b4db9bd8098b4588?width=1200&format=jpeg", "keywords": [], "authors": ["Chloe Pantazi"], "canonical_link": "https://www.insider.com/kim-kardashian-responds-to-saint-west-car-seat-photo-controversy-2017-8", "title": "Kim Kardashian hits back at people who criticized her over a photo of Saint West's car seat", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Kim Kardashian hits back at people who criticized her over a photo of Saint West's car seat", "date": "2017-08-11", "news_keywords": "Kim Kardashian West, Kim Kardashian, Saint West, car seat, Safety, Child safety, Parenting, Moms, Motherhood, Celebrities, Chloe Pantazi", "description": "The reality star has responded to criticism over the position of her son Saint West's forward-facing car seat.", "author": "Chloe Pantazi", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Culture", "og": {"title": "Kim Kardashian hits back at people who criticized her over a photo of Saint West's car seat", "description": "The reality star has responded to criticism over the position of her son Saint West's forward-facing car seat.", "type": "article", "url": "https://www.insider.com/kim-kardashian-responds-to-saint-west-car-seat-photo-controversy-2017-8", "image": "https://i.insider.com/59514e95b4db9bd8098b4588?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Kim Kardashian hits back at people who criticized her over a photo of Saint West's car seat", "sailthru.date": "2017-08-11", "sailthru.tags": "Kim Kardashian West, Kim Kardashian, Saint West, car seat, Safety, Child safety, Parenting, Moms, Motherhood, Celebrities, Chloe Pantazi", "sailthru.description": "The reality star has responded to criticism over the position of her son Saint West's forward-facing car seat.", "sailthru.author": "Chloe Pantazi", "sailthru.verticals": "culture, health, people", "sailthru.image.full": "https://i.insider.com/59514e8c298d4a277e8b45b7?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59514e8c298d4a277e8b45b7?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Kim Kardashian hits back at people who criticized her over a photo of Saint West's car seat": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 250, "back-to-top": "variant", "sticky-section-titles": "control", "post-breadcrumbs": "control", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "variant"}, "viking-id": "598db041f158d75e008b458d", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": ["https://www.youtube-nocookie.com/embed/JWefxAyYGAs?ecver=2"], "publish_date": 1502380800.0, "source": "https://www.thisisinsider.com", "summary": ""}