{"url": "https://www.standard.co.uk/showbiz/celebrity-news/gwyneth-paltrow-i-ve-milked-every-opportunity-and-used-every-mistake-as-a-stepping-stone-a3554616.html", "text": "Gwyneth Paltrow has spoken about the pain of her divorce and how she has “ruthlessly” pursued success.\n\nThe actress opened up about how she coped with criticism from the media and about her split from Coldplay’s Chris Martin.\n\nPaltrow, 44, told Net-a-Porter’s digital magazine The Edit: “I’ve had an extraordinary life, where things have happened in a huge way — huge success, huge joy, huge pain, huge loss.\n\n“The reason I feel happy today is because I’ve milked the f*** out of every opportunity. I haven’t made one mistake that I haven’t used as a stepping stone to get somewhere else. I’m ruthless when it comes to using the hard things.”\n\nShe defended her wellness and luxury lifestyle brand Goop, which has been criticised for promoting £260 “sex dust” smoothies and pyjamas costing £225.\n\nShe said: “People were fine with me as an actress, but with Goop it was like, ‘Stay in your lane’. Women, in general, get a lot of pushback, especially if you’re successful and attractive.\n\n“I’m not saying I’m attractive. I mean when you’re considered attractive.”\n\nThe mother of two stood by the term “consciously uncoupling” — the phrase that she and Martin used when announcing their separation in 2014.\n\nShe said: “People are coming around. I know it’s a dorky term, but it’s very worthwhile.\n\n\"I’m always the person who gets shit at first, but then later people say, ‘Hey, maybe that’s a good idea,’ I don’t mind. I wanted to turn my divorce into a positive.\n\n“What if I didn’t blame the other person for anything and held myself 100 per cent accountable? What if I checked my own shit at the door and put my children first?\n\n\"And reminded myself about the things about my ex-husband that I love and fostered the friendship? What I put myself through to get there was the most difficult thing I’ve ever done in my life.”\n\nShe said she takes her children Apple, 13, and Moses, 11, everywhere so that she can use them as a “shield” against the paparazzi and also revealed that she even occasionally eased up on her fitness and healthy eating regime.\n\nPaltrow said: “I can’t be on a cleanse all the time… I did one for seven weeks last year and it was awful. My first meal of the day is normally lunch. I keep it light on carbs so my energy levels don’t peak and valley through the day.\n\n“At home, I loosen the reins: a glass of wine, maybe a baguette dripping in cheese, some fries… on vacation, I eat what I want — and there’s no exercising either.”\n\nTo read the full interview with Gwyneth Paltrow, read The EDIT at www.net-a-porter.com/magazine/404/12 and/or download The EDIT’s free app for iPhone, iPad and Android", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/01/13/editpaltrow0106a.jpg"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/01/13/editpaltrow0106a.jpg", "keywords": [], "authors": ["Rashid Razaq"], "canonical_link": "https://www.standard.co.uk/showbiz/celebrity-news/gwyneth-paltrow-i-ve-milked-every-opportunity-and-used-every-mistake-as-a-stepping-stone-a3554616.html", "title": "Gwyneth Paltrow: I’ve milked every opportunity and used every mistake as a stepping stone", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#dc062b", "og": {"url": "http://www.standard.co.uk/showbiz/celebrity-news/gwyneth-paltrow-i-ve-milked-every-opportunity-and-used-every-mistake-as-a-stepping-stone-a3554616.html", "title": "Gwyneth Paltrow: I’ve milked every opportunity and used every mistake", "description": "Gwyneth Paltrow has spoken about the pain of her divorce and how she has “ruthlessly” pursued success. The actress opened up about how she coped with criticism from the media and about her split from Coldplay’s Chris Martin. Paltrow, 44, told Net-a-Porter’s digital magazine The Edit: “I’ve had an extraordinary life, where things have happened in a huge way — huge success, huge joy, huge pain, huge loss.", "updated_time": "2017-06-01T13:34:29+01:00", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/01/13/editpaltrow0106a.jpg", "site_name": "Evening Standard", "type": "article", "locale": "en_GB"}, "fb": {"pages": 165348596842143, "app_id": 193840110715213, "admins": 36903991}, "ia": {"markup_url": "https://www.standard.co.uk/pwamp/fbi/3554616"}, "description": "Gwyneth Paltrow has spoken about the pain of her divorce and how she has “ruthlessly” pursued success. The actress opened up about how she coped with criticism from the media and about her split from Coldplay’s Chris Martin. Paltrow, 44, told Net-a-Porter’s digital magazine The Edit: “I’ve had an extraordinary life, where things have happened in a huge way — huge success, huge", "keywords": "Gwyneth Paltrow, Celebrity News, Showbiz", "article": {"tag": "Gwyneth Paltrow", "published_time": "2017-06-01T13:13:00+01:00", "modified_time": "2017-06-01T13:34:29+01:00", "publisher": 165348596842143, "section": "Celebrity News", "author_name": "Rashid Razaq", "content_type": "story", "word_count": 556, "image_count": 1, "video_count": 0, "embed_count": 1, "internal_link_count": 4, "external_link_count": 2}, "twitter": {"title": "Gwyneth Paltrow: I’ve milked every opportunity and used every mistake", "description": "Gwyneth Paltrow has spoken about the pain of her divorce and how she has “ruthlessly” pursued success. The actress opened up about how she coped with criticism from the media and about her split from", "card": "summary_large_image", "site": "@standardnews"}, "google-site-verification": "fI_fn7lv1QlqGWXMIJoqDICBG1ynAC0UDsrriO8e_m8", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Evening Standard"}, "movies": [], "publish_date": 1496319180.0, "source": "https://www.standard.co.uk", "summary": ""}