{"url": "www.hellomagazine.com/royalty/2018062149633/kate-middleton-spoils-prince-william-birthday/", "text": "The sweet way Duchess Kate spoils Prince William on his birthday The Duchess has always made sure that Prince William has a special birthday\n\nHappy birthday to Prince William, who turned 37 on Friday! Although the royal will be keeping his celebrations private – likely spending the day with his family at his Kensington Palace home or his country house, Anmer Hall, in Norfolk – we suspect that his wife, the Duchess of Cambridge, will have a few creative ideas in mind to make his day extra special. And what could be more special than a handmade gift from your loved ones? Kate, who is known for being arty, and their three children Prince George, Princess Charlotte and Prince Louis, have reportedly gifted William with a handmade scrapbook filled with some of the family's best memories, alongside pictures and drawings from the children.\n\nA precious gift from Kate and their children\n\nAccording to The Sun, Kate and the children have been collecting photos, paintings and drawings from family events over the last year to include in William's birthday present, adding to it whenever there was a special moment they wanted to remember. No doubt there will be plenty of sweet family moments with youngest son, Prince Louis, who celebrated his first birthday in April. Other special evets likely to be recorded are the recent Trooping the Colour ceremony, for the Queen’s birthday, and Kate's 'Back to Nature' garden created for the RHS – which Prince George and Princess Charlotte visited many times.\n\nKate's creative flair has seen her throw lavish parties for her husband's birthday in the past, including a stunning Arabian Nights themed party for the Prince's 24th birthday. They have also enjoyed a quiet weekend away in Cornwall for one of his birthdays, and since welcoming their children, the Prince has spent his birthday with his family. According to palace insiders, for his 35th birthday, William \"tucked into a birthday cake and a meal\" with wife Kate and Prince George and Princess Charlotte.\n\nMORE: The Cambridges and the Sussexes announce Royal Foundation split\n\nPrince William will likely the spending the day with his family\n\nIn honour of his 37th birthday, Kensington Palace released a throwback picture of the royal. The caption read: \"Thank you everyone for your lovely wishes on The Duke of Cambridge's birthday!\" The lovely photo sees William smiling at the camera during a trip to Tanzania from October 2018. The official royal family Twitter account also posted a collage of pictures with the Queen, and wrote: \"Happy Birthday to The Duke of Cambridge! #HappyBirthdayHRH.\" The message continued: \"The Duke of Cambridge is second in line to the throne. His Royal Highness undertakes a number of charitable activities and projects, and carries out public and official duties in support of The Queen, in the UK and overseas, alongside The Duchess of Cambridge.\"\n\nMORE: Prince William shares the sweetest photo of his youngest son Prince Louis in honour of Father's Day\n\nPrince William was born at St Mary's Hospital in London in 1984 to Prince Charles and Diana, Princess of Wales, weighing 7lbs 1 ½ oz. The royal enjoyed memorable birthdays as a youngster, with a particularly funny incident on his 13th birthday, when mum Diana surprised him with a very unique - and naughty - cake, which was adorned with figurines of topless women. Princes William and Harry have previously spoken about their mum's 'naughty' sense-of-humour. Chatting in a documentary, William said: \"She organised - when I came home from school - to have Cindy Crawford, Christy Turlington and Naomi Campbell waiting at the top of the stairs. I went bright red and didn't know what to say... I was completely and utterly awestruck.\"\n\nMake sure you never miss a ROYAL story! Sign up to our newsletter to get all of our celebrity, royal and lifestyle news delivered directly to your inbox.", "images": ["https://www.facebook.com/tr?id=1728383620790976&ev=PageView&noscript=1", "http://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-548/prince-william-family2-z.jpg", "https://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-547/prince-william-kate-birthday-t.jpg", "https://www.himgs.com/css/hello/img/logo.png", "http://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-547/prince-william-kate-birthday-t.jpg?filter=w600", "https://www.facebook.com/tr?id=858230647564408&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035866&cs_ucfr=1&cv=2.0&cj=1", "https://certify.alexametrics.com/atrk.gif?account=HS7uq1SZw320l9", "http://trc.taboola.com/1115066/log/3/unip?en=page_view", "http://www.himgs.com/css/hello/img/logo.png", "https://www.hellomagazine.com/imagenes/comunes/1.gif?resize=5px:3px", "http://www.himgs.com/imagenes/hello/common/subs-button-3.jpg", "http://www.hellomagazine.com/royalty/2018062149633/kate-middleton-spoils-prince-william-birthday/\n            https:/www.facebook.com/tr?ev=6015416512498&cd[value]=0.00&cd[currency]=USD&noscript=1", "http://www.himgs.com/imagenes/hello/common/hello-2008.png?v2", "http://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-549/prince-william-family-z.jpg"], "top_img": "https://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-547/prince-william-kate-birthday-t.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.hellomagazine.com/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/", "title": "The sweet way Duchess Kate spoils Prince William on his birthday", "meta_data": {"plantilla": "Plantilla de noticias (plantilla-noticias.html)", "title": "The sweet way Kate Middleton spoils Prince William on his birthday", "description": "The Duke of Cambridge turned 37 on Friday, and here's how we think Kate will be making her husband's birthday a special one", "keywords": "Kate Middleton, Prince William", "dc.title": "The sweet way Kate Middleton spoils Prince William on his birthday", "distribution": "global", "viewport": "width=device-width, initial-scale=1, maximum-scale=3, user-scalable=yes", "news_keywords": "Kate Middleton, Prince William", "og": {"title": "The sweet way Duchess Kate spoils Prince William on his birthday", "description": "The Duke of Cambridge turned 37 on Friday, and here's how we think Kate will be making her husband's birthday a special one", "image": "https://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-547/prince-william-kate-birthday-t.jpg", "updated_time": "2019-06-21T18:26:21+01:00", "url": "https://www.hellomagazine.com/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/", "type": "article", "site_name": "HELLO!"}, "fb": {"admins": 89982930077}, "article": {"published_time": "2019-06-21T18:26:21+00:00", "modified_time": "2019-06-21T18:26:21+00:00"}, "twitter": {"card": "summary_large_image", "site": "@hellomag", "creator": "@hellomag", "url": "https://www.hellomagazine.com/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/", "title": "The sweet way Duchess Kate spoils Prince William on his birthday", "description": "The Duke of Cambridge turned 37 on Friday, and here's how we think Kate will be making her husband's birthday a special one.", "image": "https://www.hellomagazine.com/imagenes/royalty/2019062174489/how-kate-middleton-spoils-prince-william-for-birthday/0-362-547/prince-william-kate-birthday-t.jpg"}, "hmn": "true", "botify-site-verification": "rAorMmkbfzd6yOwJ3PITFmdyCjOzGLug"}, "movies": [], "publish_date": 1561141581.0, "source": "http://www.hellomagazine.com", "summary": ""}