{"url": "https://www.bustle.com/p/trixie-mattel-won-rupauls-drag-race-all-stars-3-no-one-saw-it-coming-8391616", "text": "Fans of RuPaul’s Drag Race All Stars may have thought they had seen the last of the eliminated queens. However, Ru is always full of surprises and his biggest twist yet happened in the season finale. He brought back the eliminated queens who determined the top two for the season. Because of their decision, Trixie Mattel won Drag Race All Stars 3, and pretty much no one saw it coming. The eliminated queens returning to Drag Race changed everything, because for the first time in the series’ herstory, they had the real power.\n\nIn previous seasons of All Stars, Ru had made determinations of who the top queens would be through their performances in various challenges. This season, that changed. The eliminated queens were back as a “Jury of Queer Peers” in Ru’s words. They acted in similar roles to other iconic reality TV shows that maintain a jury pool, like Survivor or Big Brother.\n\nIn the end, the top two queens the jury chose were Trixie Mattel and Kennedy Davenport. Then it was between them to see who could win the crown.\n\nThis was a much more exciting returning twist than the first time the eliminated queens came back to the competition in Episode 7. Then, it could have given a returning queen the boost to ride and potentially win the competition. However, it ended up being rather anticlimactic. That is because the queen who returned, Morgan McMichaels, was sent back home the week after she’d returned. This second return of the queens was so much more dramatic, though.\n\nTheir decision brought up a central question for viewers: What does it mean to be the winning Drag Race Queen? This twist mattered so much because it is what fundamentally changed the competition and its future. In the past, it has been clear that the queen who was most successful throughout the competition deserved to be crowned queen. All Stars 3 was different.\n\nThe eliminated queens determined the top two based on who they felt needed the title and money the most. They chose to reward the queens that they felt needed a bigger platform or wouldn’t be as successful on their own without the win. It really was a backhanded compliment when the eliminated queens picked Kennedy and Trixie as the top two. The most successful and deserving queens in the competition were barred from competing, in that sense.\n\nOf course, that meant that Shangela was not going to even get a shot at the crown. She has one of, if not the largest fanbase of any of the queens this season and ended up winning tens of thousands of dollars throughout the competition. It was clear that Shangela had been the front-runner — however, her success outside this competition clearly kept her from being considered for the top two.\n\nShangela had won more challenges than anyone and she had never lost a lip-sync. She had proven throughout the competition that if it wasn’t BenDeLaCreme who would win, the crown should most logically be hers. Despite that, she wasn’t allowed to lip-sync for her legacy in the end.\n\nBut Shangela was not the only one who was robbed of an opportunity. While BeBe had clearly made some enemies with her demeanor throughout the show, she had been consistently one of the best after Shangela. However, it was obvious that the eliminated queens didn't want BeBe to potentially win two crowns. Again, in their view, she didn’t “need” the win.\n\nMore than in any previous season of Drag Race, the eliminated queens of All Stars 3 truly mattered. Despite BenDeLaCreme and Shangela absolutely dominating the competition, it was not to be that either of them would wear the crown. Finally, it was the eliminated queens' decision that allowed Trixie to win the crown. While some, (perhaps rightfully) think that twist was unfair or out of place, the season is now over. Ultimately, it is RuPaul’s drag world, and we’re all just living in it.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/16/2fcd737f-019a-47ba-8f18-04563ebca645-thth_103_portraits_01423r220200403-3458-1e1brpe.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/15/dd5820ce-2ff6-4aca-b52e-43e7c6ce6cad-screen-shot-2020-04-15-at-23029-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/3/16/effe4379-473c-4053-aa2a-f492d7002b66-87a0f0d1-c3e2-4d98-8331-3647a3899244-v_rpdr_allstars_s3_queens_2017_09_16_2017_1316_layered_retouched_press_2300px.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/3/16/effe4379-473c-4053-aa2a-f492d7002b66-87a0f0d1-c3e2-4d98-8331-3647a3899244-v_rpdr_allstars_s3_queens_2017_09_16_2017_1316_layered_retouched_press_2300px.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/a5a651dc-8bf0-431c-afd3-09c65bf476d5-thth_103_unit_00418r.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/469f5b19-7ef1-4007-ac39-11cc3090c544-screen-shot-2020-04-07-at-45323-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/3/16/effe4379-473c-4053-aa2a-f492d7002b66-87a0f0d1-c3e2-4d98-8331-3647a3899244-v_rpdr_allstars_s3_queens_2017_09_16_2017_1316_layered_retouched_press_2300px.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/trixie-mattel-won-rupauls-drag-race-all-stars-3-no-one-saw-it-coming-8391616", "title": "Trixie Mattel Won 'RuPaul's Drag Race All Stars 3' & No One Saw It Coming", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/trixie-mattel-won-rupauls-drag-race-all-stars-3-no-one-saw-it-coming-8391616", "type": "article", "title": "How That Final 'Drag Race' Twist Changed Everything", "description": "Fans of RuPaul’s Drag Race All Stars may have thought they had seen the last of the eliminated queens. However, Ru is always full of surprises and his biggest twist yet happened in the season finale. He brought back the eliminated queens who…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/3/16/effe4379-473c-4053-aa2a-f492d7002b66-87a0f0d1-c3e2-4d98-8331-3647a3899244-v_rpdr_allstars_s3_queens_2017_09_16_2017_1316_layered_retouched_press_2300px.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Fans of RuPaul’s Drag Race All Stars may have thought they had seen the last of the eliminated queens. However, Ru is always full of surprises and his biggest twist yet happened in the season finale. He brought back the eliminated queens who…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}