{"url": "https://abcnews.go.com/GMA/Culture/chris-cornells-widow-battle-addiction-led-suicide-loved/story?id=53228245", "text": "Chris Cornell's widow says his battle with addiction led to his suicide: 'He loved his life' \"He wanted to be there for his family,\" Vicky Cornell said.\n\nChris Cornell's widow opens up about her husband's addiction before his suicide\n\nChris Cornell's widow opens up about her husband's addiction before his suicide\n\n\u0097 -- The widow of the late singer Chris Cornell said she thinks her husband's battle with addiction prior to his apparent suicide last May is what led to his death.\n\n\"He loved his life,\" Vicky Cornell told ABC News' Robin Roberts in her first television interview since the family tragedy. \"He would never have ever left this world.\"\n\nWhile most remember the former Soundgarden and Audioslave frontman by his influential legacy in the music world, Vicky Cornell recalls him as a loving husband and father to their two children: Toni, 13, and Christopher, 12.\n\n“Our family was his everything,” she said. “As soon as he got off stage, he was a dad, he was a regular dad.”\n\nVicky Cornell, the widow of the late rocker Chris Cornell, opens up about her husband's battle with addiction before his death in an interview with ABC News' Robin Roberts. ABC News\n\nChris Cornell, 52, was found dead in a Detroit hotel room on May 18. His death was ruled an apparent suicide, according to the Wayne County Medical Examiner's Office.\n\nMedical reports note that though seven different drugs were found in his system, these were not a contributing factor to his death.\n\nVicky Cornell, and others in the medical community, however, argue that there is more to the story.\n\nChris Cornell and family attend the New York Screening of \"The Promise\" at The Paris Theatre in New York City, April 18, 2017. Nicholas Hunt/Getty Images, FILE\n\n\"He wanted to be there for his family, for his children. He loved his life,\" Vicky Cornell said. “I don't think that he could make any decisions because of the level of impairment.”\n\nDr. Richard Cote, the chair of the department of pathology at the University of Miami Miller School of Medicine, who conducted an independent analysis of Chris Cornell's autopsy, told ABC News that two drugs found in his system at the time of his death may have resulted in impaired judgment and motor functions.\n\n\"They were not at levels that would’ve caused his death; in other words, it wasn’t an overdose,\" Cote said. \"But what the two drugs did individually and in combination was to really impair his judgment and make him psychically unable to be responsive in ways that he normally would be responsive.\"\n\n'There were signs’\n\nVicky Cornell recalled the year before her husband’s death, when she said he fell back into addiction after being sober since 2003.\n\n“Approximately a year before he died, he was prescribed a benzodiazepine to help him sleep,” she said. “He had torn his shoulder … the pain in the shoulder was waking him up at night and it was keeping him up.”\n\nChris Cornell of Soundgarden performs during the Pemberton Music and Arts Festival, July 18, 2014, in Pemberton, British Columbia. Tim Mosenfelder/Getty Images, FILE\n\nThe new drugs changed her husband, she said.\n\n“The brain of someone who has a substance use disorder is different from that of … someone who doesn't,” Vicky Cornell said. “He relapsed.”\n\nDuring one weeklong period, “he took 20-something pills,” she said. “And in a nine-day period, 33.”\n\n\"He had really delayed speech,\" she recalled of the dark time when her husband's addiction took over. \"He was forgetful.”\n\nLast March, Chris Cornell reached out to a colleague for help, writing in an email, “Would love to talk, had relapse.”\n\nJust two months later, he uncharacteristically walked off stage in the middle of what would turn out to be his final performance and died hours later in his hotel room.\n\nVicky Cornell said explaining what happened to her children the following day was “the most tragic thing you can ever go through.”\n\n“They’re, you know, crying, ‘Is Daddy OK?’” she recalled. “And I said to my babies, \"Yeah … the ambulance is there and they're taking Daddy to the hospital, and I'm just going to go to the hospital.”\n\nVicky Cornell, the widow of the late rocker Chris Cornell, shared these family photos with ABC News. ABC News\n\nVicky Cornell said her memories of the night her husband died still weigh heavily on her.\n\n“I know that people say ... you can't blame yourself,” she said. “I'm trying not to, but there were signs.”\n\n'You think addiction is a choice, and it's not'\n\nShe said she is now making it her mission to raise awareness and destigmatize addiction, and encourage others to speak openly about the topic.\n\n“People think that addiction is like, ‘Oh, you were an addict,’” she said. “People don’t recognize it as a disease.”\n\n“You think addiction is a choice, and it's not,” she added. \"I think that if there was less stigma around it, more people would speak up.\"\n\nShe added that addiction has now \"crossed over all sorts of socioeconomic boundaries ... it's everywhere.\"\n\n“My husband was the furthest thing from a rock star junkie. He just wasn't,\" she said. \"He was the best husband, the greatest father. I lost my soulmate and the love of my life.”", "images": ["https://s.abcnews.com/images/Entertainment/chris-cornell-family-02-gty-mt-180220_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/chris-cornell-family-02-gty-mt-180220_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Catherine Thorbecke", "February", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245", "title": "Chris Cornell's widow says his battle with addiction led to his suicide: 'He loved his life'", "meta_data": {"description": "\"He wanted to be there for his family,\" Vicky Cornell said.", "keywords": "Chris Cornell, Vicky Cornell, suicide, addiction", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Chris Cornell's widow says his battle with addiction led to his suicide: 'He loved his life'", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245", "title": "Chris Cornell's widow says his battle with addiction led to his suicide: 'He loved his life'", "description": "\"He wanted to be there for his family,\" Vicky Cornell said.", "image": "https://s.abcnews.com/images/Entertainment/chris-cornell-family-02-gty-mt-180220_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-02-22T08:03:56Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,53228245", "ipad": "abcnewsipad://link/story,53228245", "googleplay": "https://goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Chris Cornell's widow says his battle with addiction led to his suicide: 'He loved his life'", "description": "\"He wanted to be there for his family,\" Vicky Cornell said.", "url": "https://goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/chris-cornell-family-02-gty-mt-180220_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,53228245", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,53228245", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/chris-cornells-widow-battle-addiction-led-suicide-loved-53228245"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}