{"url": "www.theringer.com/2017/5/4/16044794/keeping-up-with-the-kardashians-ratings-season-13-3aa5b249eee7", "text": "“I’m, like, dropping hints that I’m single,” a pristinely made-up Kim Kardashian tells a camera. The show quick-cuts to footage of Kim on a date. “I’m single,” she gushes bluntly. The scene from Kourtney & Kim Take New York is now a meme, and with good reason: It’s the Keeping Up With the Kardashians franchise, now in its 13th season, at its daffiest best.\n\nLike many viewers, scenes like this one are why I started watching Keeping Up With the Kardashians; I found the glossy infomercial to be incredibly relaxing. The premise was simple: an attractive, vapid family who loved butts and money tried to acquire fame (and more money). When they bickered, it was from a well-appointed ski chalet; when they gossiped, it was over delightfully large salads, and about 40 percent of the show is prolonged establishing shots of California scenery. The drama was low-stakes and always quickly resolved; a majority of the scenes took place in cavernous mansions or from aboard luxe Thai yachts. Everything confessional looked filtered through Snapchat’s pretty lens, every lightweight foible narrated cheerily by immaculately groomed social climbers. It was unparalleled basic-cable analgesic, a terrific show to half-watch while skimming Instagram. The family’s fortunes and faces changed dramatically over the years, but the show retained its marvelously banal tone.\n\nUntil, that is, the past few seasons, when the raunchy-but-family-friendly reality television began to move into startlingly dark territory. Cast members have experienced severe emotional hardship, including addiction issues, mental health challenges, and the armed robbery and assault of Kim Kardashian West in Paris last October. But despite featuring story lines based on these real, serious issues, KUWTK viewership is on a steep decline, and the family ties that made it so charming have frayed beyond recognition. The show reached its highest peaks in popularity as its titular sisters got married and had babies, but the more recent life chapters it has explored, such as the dissolution of long-term relationships and prolonged health problems, have proved less fan-friendly. The reality steamroller is attempting to dramatize its cast’s real-life misfortunes and foibles, but the result is something increasingly sour rather than delightfully soapy. It’s the only show I know that has grown less boring and more difficult to watch.\n\nWhen Keeping Up With the Kardashians premiered 10 years ago, in fall 2007, it was a reality-television remix of The Brady Bunch starring Paris Hilton’s closet organizer and her materialistic, blended family. Cheerful vulgarity was the Kardashian value; in the first few episodes, then-10-year-old Kylie Jenner danced on a stripper pole installed in the home, while Kim, Kourtney, and Khloe accepted a bikini-photo-shoot gig from their close friend, Girls Gone Wild founder and convict Joe Francis, and then Kris urged Kim to pose nude for Playboy. Along with the twin fixations on ass and fame came two more Kardashian themes: working hard and staying loyal. The family was crass, but they were crass together. “Momager” Kris was the show’s most antic and compelling comic figure, and there was something both new and immediately archetypical about her unpretentious, ultra-femme matriarchal striving.\n\nThe show was a runaway success, and Kris arranged a medley of business deals to parlay the family’s cable hit into a multimillion-dollar business, from endorsement deals to nightclub appearances to media exclusives. The Kardashian women started on lad mags and used their relationships and pregnancies to broker coverage in celebrity entertainment magazines like People, as BuzzFeed outlined in 2015. The sisters were heralded as body-positive entertainers and bemoaned as the ultimate avatars of vapidity — but they were rarely ignored. A New York Times Magazine profile of Kris from 2015 dubbed their business the “Kardashian/Jenner megacomplex” and declared that it had “not just invaded the culture but metastasized into it.”\n\nAs their celebrity increased, the sisters specialized. Khloe began as the sassy asshole but became the resident fitness expert. Kourtney perched in the healthy-mommy corner. As Kendall and Kylie grew up, they focused on high-fashion modeling and the beauty industry, respectively. Kim, meanwhile, ascended the rungs of fame from a sex-tape participant to a full-blown pop icon. Often dismissed as untalented, she is indisputably the most famous female hustler of all time, turning a $51 million profit on the business of personal branding in 2016.\n\nAs each sister honed her ventures with varying degrees of success (RIP, Kocktails With Khloé), the original show was always there, providing the free advertisement that accelerated their rise, plus excuses for the family to cavort in a variety of exotic locales for their yearly televised vacation.\n\nThe first few seasons of KUWTK closely resemble another E! show about a family of SoCal socialite sisters, Pretty Wild. Both productions focused on young, scandalous women in the L.A. club scene as they searched for fame, but Pretty Wild could not make the real, tawdry lives of its castmates fit into its narrative. Pretty Wild’s version of Kim, Alexis Neiers, has repeatedly discussed how far from reality her reality show was: While she was shown living at home and attending high school, she says she was living out of a motel and panhandling with an opiate use disorder. (Neiers is now sober and works as a doula.)\n\nKUWTK managed, for an improbably long time, to avoid the mistakes that killed Pretty Wild. Its sister stars were sexual, but, save Khloe’s early DUI arrest, law-abiding. Rather than sully Kim’s image, KUWTK rehabilitated it by showing her as a sober, docile daughter rather than the sexpot she’d been made out to be. The Kardashian sisters’ antics were almost always in service of the show rather than contrary to its narrative. At least, at first.\n\n“Fame today is a matryoshka doll: inside each celebrity is a series of smaller, hollow simulacra, and, at the very core, there is a hard little being who feels buried alive,” Andrew O’Hagan wrote for the London Review of Books in 2013. He was discussing the trapped, desperate Pretty Wild cast, but the idea applies elsewhere. That escalating fame requires some self-suffocation is true for the Kardashian brood — even its most obediently paparazzi-ready members.\n\nFamily life has gotten increasingly challenging for the Kardashian clan. The past few seasons of the show have undermined KUWTK’s emphasis on their once-unbreakable bonds. While Kim’s short-lived marriage to Kris Humphries brought the Kardashian brand temporary blowback, it didn’t create much of a hole in the show; plus, it opened the door for one of the most joyous plotlines, the ascendance of Kimye. Kris Jenner’s marriage to Caitlyn Jenner was once one of the show’s original hooks: The pilot episode features a celebration of their 16th wedding anniversary. Since the couple’s divorce in 2014, Caitlyn has been less present on the show (in part due to I Am Cait, a spinoff docuseries about her post-transition life).\n\nIf the show’s thorniest moments involved navigating divorce, it’d be one thing, but the behind-the-scenes story lines have gotten much darker. As a 17-year-old, Kylie Jenner began dating the adult rapper Tyga; another one of the show’s secondary cast members applauded Tyga for getting “in early.” The questionable legality of their relationship never became a plot point, although Rob Kardashian’s relationship with Tyga’s ex-girlfriend Blac Chyna did. “We have the best lives and the most fucked-up lives at the same time,” Khloe said last season, in the episode where 18-year-old Kylie learns her brother has impregnated her boyfriend’s ex-girlfriend.\n\nRob Kardashian, originally presented as a bashful heartthrob, disappeared from the show as tabloids documented his substantial weight gain, only to return after linking up with Tyga’s ex. For long stretches, KUWTK avoided addressing his absence, and when it brought Rob back into the fold, his troubles were referred to in vague terms. In Season 10, Kris claims Rob hasn’t “been in the best headspace lately,” but it is never entirely clear what his circumstances are, other than tension wrought by living with Khloe and Lamar Odom as their relationship fell apart. “Only Rob, Lamar, and I know what happened in the house and what was going on. And I definitely feel guilty,” Khloe tells her stepbrother Brody. As Lamar Odom’s substance abuse gained media attention, the subtext to Rob’s absence looked grim; the show has never adequately answered why the Kardashians were televising attempted interventions for Rob. Meanwhile, Scott Disick’s substance use has weighed on the series over the years, as an ugly early-season fight with a waiter has continued into a pattern of destructive behavior so toxic it has alienated him from Kourtney. On a recent episode, an infuriated Kim caught Scott on yet another bender, and her phone call relaying the relapse to Kourtney illustrated just how damaging his antics have been to his family unit.\n\nMost recently, this season the show has addressed two major crises. Kim, as mentioned previously, endured an armed robbery in Paris, one that understandably impacted her emotional well-being. She was so upset that, for the first time since becoming famous, she retreated from the public eye for the better part of six months. Shortly thereafter, Kanye West experienced a well-publicized bout of erratic behavior that led to hospitalization. In an Ellen interview, Kim stressed that while she had previously been “materialistic,” the hardship had changed her. “I just don’t care about that stuff anymore. I really don’t,” she said. Kim’s ordeals sound harrowing, and on the show she comes across as genuinely shaken, but the change of heart raises the question: What does someone who no longer cares to keep up with the Joneses do as the star of Keeping Up With the Kardashians? The show’s very premise is watching the family accumulate status markers.\n\nKUWTK’s hesitance to address head-on what seem to be serious personal problems is understandable from a human standpoint, but unsatisfying from a narrative standpoint. The show originally trafficked in bawdy but trite intimacies, but as its cast’s personal crises have intensified, its popularity has faltered. The episodes depicting Kim’s robbery and its aftermath failed to attract the huge ratings of earlier seasons. Viewership has been down on average per season since 2014, according to Forbes, and the robbery episode drew 1.58 million viewers. Compare that with the Season 6 episode where Kris Humphries proposed to Kim, which captured more than 3.3 million viewers, or the Season 4 finale, which broke the E! network record with 4.8 million viewers and showed a happy family gathering for the delivery of Kourtney’s baby Mason.\n\nThis is not because the show is necessarily clumsy at addressing high stakes — Kim’s robbery was handled as adroitly as it could have been — but because it isn’t built for them. As the Kardashians have grown more famous, the show’s story lines have started to make headline news months before they get the KUWTK treatment. This means that no plot point is surprising; to give viewers something they haven’t already read about in InTouch, the show needs to deliver something new, and doing so means getting even more intimate, or at least presenting the appearance of intimacy with the audience. I suspect one of the reasons, besides the sympathy it generates, that KUWTK is emphasizing the anxiety Kim has experienced after her assault is to give her a (well-deserved!) excuse not to be so forthcoming all the time. That is probably a wise personal choice, but one that will likely impact the show. And then there is the central question of tone. As the hardships in the lives of its cast have piled up, the show has morphed sharply from its original “happy-go-horny family shoots for the stars” premise, and not in a way that audiences seem to like.\n\nThere’s always the question of whether the Kardashians even need their reality show anymore. Khloe is a best-selling author, and her line of jeans is selling well. Kylie’s cosmetics line is also commercially successful. Kendall is achieving recognition as a model outside of the show. They have enough wealth, but the show is still the original engine of their celebrity. It is difficult to imagine reality stars lingering in the public eye after their show’s cancellation because there is no road map for it. Without The Simple Life, Paris Hilton ceded her crown to Kim. The Jersey Shore cast has receded into private lives of domesticity and ignominious career pursuits like fraud indictment and international DJing. The Kardashians have achieved an unprecedented degree of celebrity, but losing the show — their original vessel — would still strike a blow to their Q scores. And without a forum through which to mediate PR disasters like Kendall’s Pepsi commercial, it might be harder for the reality royals to mediate goodwill.\n\n“Death, divorce, mental illness, substance abuse, and profound loneliness cast a pall over the entire show,” Decider writer Matt Thomas argued in a 2015 essay about the undercurrent of sorrow in KUWTK. “It’s this sadness that makes the Kardashians fascinating to us in the same way the Kennedys once were (and perhaps still are to some). In one way they’re a triumphant family; in another, a tragic one.” Thomas is right that the Kardashians’ woes have kept the family an object of tabloid fascination, but not about their ultimate effect on the audience. Viewers, fed a fairy tale about fame, don’t necessarily want to watch a cautionary saga about celebrity dread. It’s impossible to keep up when things are so off the rails.", "images": ["https://cdn.vox-cdn.com/thumbor/BeUpiRPqZs40cGMwIDrPuOQKEoU=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15943546/1_eavWZfpiCCkUuc9YJP4D6Q.0.1501104025.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/2qfXG5Y9Z3uJjlXhZ59nkbi-vW4=/0x0:3000x2000/1200x800/filters:focal(1260x760:1740x1240)/cdn.vox-cdn.com/uploads/chorus_image/image/64057849/1_eavWZfpiCCkUuc9YJP4D6Q.0.1501104025.0.jpeg", "https://cdn.vox-cdn.com/thumbor/EfGMbkzrkOBkG45Uu44hyVCloEc=/0x0:750x423/1200x0/filters:focal(0x0:750x423):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8933193/1_6xfPPs0cArMFi3tAIpMSXg.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/MPgDDYpRD1Jbfdh5UQ8hps5EY-0=/0x0:700x40/1200x0/filters:focal(0x0:700x40):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8933191/1_6rlxJpq4ARgwoDBfxjawag.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "https://cdn.vox-cdn.com/thumbor/w_G490Mavu9nY2lo2dm7BUXvbyQ=/0x0:1012x569/1200x0/filters:focal(0x0:1012x569):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8933195/1_AN-ffgXyUc0mj2xEk0ZIOA.0.png"], "top_img": "https://cdn.vox-cdn.com/thumbor/BeUpiRPqZs40cGMwIDrPuOQKEoU=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15943546/1_eavWZfpiCCkUuc9YJP4D6Q.0.1501104025.jpeg", "keywords": [], "authors": ["Kate Knibbs", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "May"], "canonical_link": "https://www.theringer.com/2017/5/4/16044794/keeping-up-with-the-kardashians-ratings-season-13-3aa5b249eee7", "title": "The Dark Decline of ‘Keeping Up With the Kardashians’", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-05-04T10:43:44-04:00", "modified_time": "2017-05-04T10:43:44-04:00"}, "author": "Kate Knibbs", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "The reality juggernaut is currently in the middle of its most dramatic season to date, but fans are tuning out. Here’s how the 21st-century ‘Brady Bunch’ turned into a slow-boil tragedy.", "og": {"description": "The reality juggernaut is currently in the middle of its most dramatic season to date, but fans are tuning out. Here’s how the 21st-century ‘Brady Bunch’ turned into a slow-boil tragedy.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/BeUpiRPqZs40cGMwIDrPuOQKEoU=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15943546/1_eavWZfpiCCkUuc9YJP4D6Q.0.1501104025.jpeg", "alt": "(Getty Images/Ringer illustration)", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "The Dark Decline of ‘Keeping Up With the Kardashians’", "type": "article", "url": "https://www.theringer.com/2017/5/4/16044794/keeping-up-with-the-kardashians-ratings-season-13-3aa5b249eee7"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/2017/5/4/16044794/keeping-up-with-the-kardashians-ratings-season-13-3aa5b249eee7", "title": "The Dark Decline of ‘Keeping Up With the Kardashians’", "description": "The reality juggernaut is currently in the middle of its most dramatic season to date, but fans are tuning out. Here’s how the 21st-century ‘Brady Bunch’ turned into a slow-boil tragedy.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/xbt4u49Fpbi6Rlta191DtYwZhnw=/0x250:3000x1750/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/15943546/1_eavWZfpiCCkUuc9YJP4D6Q.0.1501104025.jpeg", "alt": "(Getty Images/Ringer illustration)"}, "site": "ringer"}, "sailthru.title": "The Dark Decline of ‘Keeping Up With the Kardashians’", "sailthru.tags": "general,the-ringer,front-page,tv", "sailthru.description": "The reality juggernaut is currently in the middle of its most dramatic season to date, but fans are tuning out. Here’s how the 21st-century ‘Brady Bunch’ turned into a slow-boil tragedy.", "sailthru.date": "2017-05-04T10:43:44-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/IyVDC9kuJvcK0poeStdztidiaXo=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55909575/1_eavWZfpiCCkUuc9YJP4D6Q.0.jpeg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/cjpfTEP-V-pf5yMrmRikxwVaQcc=/500x0:2500x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/55909575/1_eavWZfpiCCkUuc9YJP4D6Q.0.jpeg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": ["https://www.youtube.com/embed/bImP-cGh8FE?rel=0&showinfo=0"], "publish_date": 1493827200.0, "source": "http://www.theringer.com", "summary": ""}