{"url": "people.com/movies/everything-we-know-about-jennifer-aniston-justin-therouxs-divorce/", "text": "In a surprise announcement, Jennifer Aniston and Justin Theroux confirmed that they’re parting ways after two and a half years of marriage and nearly seven years together as a couple.\n\nThe pair announced their split with a statement released by Aniston’s longtime publicist on Thursday: “In an effort to reduce any further speculation, we have decided to announce our separation. This decision was mutual and lovingly made at the end of last year. We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.”\n\nGet push notifications with news, features and more.\n\nBefore the announcement, Aniston, 48, and Theroux, 46, seemed to thrive despite their frequent time on separate coasts. Both have been busy professionally this past year, with Aniston signing on for a new Apple TV series alongside Reese Witherspoon, and Theroux filming the comedy The Spy Who Dumped Me in Budapest.\n\nThe couple seemed happy celebrating the start of 2018 together with their annual vacation to Cabo San Lucas, Mexico. “Jen and Justin rang in the new year with friends. For the past few days, they have enjoyed the sunny Cabo weather,” a source said of their trip, where they were joined by a handful of close pals including Jason Bateman and his family.\n\nRELATED: Jennifer Aniston and Justin Theroux’s Split: How Time Apart Took a Toll on the Relationship\n\n“They have hosted friends by the pool and for dinner,” said the source. “They both seem great and very happy.”\n\nBut in the following months, Aniston and Theroux’s marriage began to fall apart. Below, a timeline of the actors’ split:\n\nFeb. 7: Aniston Shows Off Their Bel Air Estate\n\nAniston took Architectural Digest readers on a tour of the $21 million mansion she and Theroux purchased together in 2011.\n\nImage zoom Jennifer Aniston in Architectural Digest ArchDigest/Francois Dischinger\n\n“There was a time when I thought there was something romantic about picking up and trotting off somewhere different every three months,” Aniston recently told the outlet.\n\nRELATED GALLERY: The Sweetest Things Jennifer Aniston and Justin Theroux Said About Each Other\n\n“I look around at my husband and my dogs and our home, and there’s nowhere else I want to be.”\n\nRELATED VIDEO: Jennifer Aniston ‘Has Seemed Fine’ Since Split from Justin Theroux, Will ‘Continue to Be Friends’\n\nFeb. 10: Aniston Attends Ellen DeGeneres Party\n\nThe actress mingled with the A-list crowd at DeGeneres’ 60th birthday party. She attended the event solo but appeared to be in good spirits throughout the night. Aniston was even seen laughing and chatting with Pharell outside of the party.\n\nImage zoom\n\nFeb. 11: Aniston’s Birthday\n\nThe couple’s decision to split comes just days after the actress’s 49th birthday, which she and Theroux spent apart. Aniston celebrated in Malibu, California with a gathering alongside pals Courteney Cox, Andrea Bendewald, Leigh Kilton-Smith and Kristin Hahn on Sunday.\n\nImage zoom Jennifer Aniston celebrates birthday with girlfriends Aleen Keshishian/Instagram\n\nTheroux, meanwhile, was spotted out in New York City on Friday walking his dog. Last year, the duo vacationed together in Los Cabos, Mexico with friends.\n\nFeb. 13: Aniston Attends Amy Schumer’s Wedding Solo\n\nThe actress was among the star-studded guest list at Schumer’s surprise wedding to boyfriend Chris Fischer. While Aniston was one of 80 guests at the intimate ceremony in Malibu, Theroux remained in New York City for the occasion.\n\nRELATED VIDEO: Jennifer Aniston and Justin Theroux Were the Picture Perfect Couple During Their Last Vacation\n\nFeb. 14: Valentine’s Day\n\nJust a few days after spending Aniston’s birthday apart, the couple were noticeably not together on Valentine’s Day. Theroux was once again spotted walking his dog alone on the romantic holiday.\n\nThe couple spent Feb. 14 together the last two years. In 2016, the couple’s first Valentine’s Day as husband and wife – Aniston and Theroux vacationed together in Paris, France, posting sweet photos of a romantic dinner inside the Eiffel Tower.\n\nLast year, Theroux shared a photo of the white roses he bought for Aniston on Feb. 15. By that point, the bouquet had been torn to shreds by the couple’s dog, Sophie. “‘Happy day-after-Valentine’s Day, a——‘ — Sophie,” he jokingly captioned.\n\nImage zoom Anthony Harvey/Getty\n\nFeb. 15: Split Announcement\n\nAlong with their promise to remain, friends, Aniston and Theroux used their split announcement to shoot down any tabloid rumors as to what led to their separation.\n\n“Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly,” the announcement continued. “Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative. Above all, we are determined to maintain the deep respect and love that we have for one another.”\n\nRELATED: Jennifer Aniston ‘Has Seemed Fine’ Since Split from Justin Theroux, Will ‘Continue to Be Friends’\n\nFollowing the news, a source told PEOPLE Aniston is in positive spirits and has been spending time with friends.\n\n“Jen and Justin have been apart for several weeks,” a source close to the actress tells PEOPLE. “Jen has continued her life as usual. She has seemed fine. There has been no indication that she is upset.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1464&h=766&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjennifer-aniston2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fjen-aniston-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fjennifer-aniston8-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fsplash-aniston-8-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F02%2Fjennifer-aniston-architectural-digest.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1464&h=766&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjennifer-aniston2.jpg", "keywords": [], "authors": ["Mike Miller", "Jodi Guglielmi"], "canonical_link": "https://people.com/movies/everything-we-know-about-jennifer-aniston-justin-therouxs-divorce/", "title": "Everything We Know About Jennifer Aniston and Justin Theroux's Split", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Couples,Divorce,Jennifer Aniston,Justin Theroux,Movie Celebrities,Movie News,News", "news_keywords": "Couples,Divorce,Jennifer Aniston,Justin Theroux,Movie Celebrities,Movie News,News", "description": "A timeline of Jennifer Aniston and Justin Theroux's surprise split", "og": {"title": "Everything We Know About Jennifer Aniston and Justin Theroux's Split", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/everything-we-know-about-jennifer-aniston-justin-therouxs-divorce/", "description": "In a surprise announcement,&nbsp;Jennifer Aniston and Justin Theroux confirmed that they’re parting ways after two and a half years of marriage and nearly seven years&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1464&h=766&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjennifer-aniston2.jpg", "width": 1464, "height": 766}}, "pinterest": {"url": "https://people.com/movies/everything-we-know-about-jennifer-aniston-justin-therouxs-divorce/", "description": "A timeline of Jennifer Aniston and Justin Theroux's surprise split", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjennifer-aniston2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/everything-we-know-about-jennifer-aniston-justin-therouxs-divorce/", "title": "Everything We Know About Jennifer Aniston and Justin Theroux's Split", "description": "A timeline of Jennifer Aniston and Justin Theroux's surprise split", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1464&h=766&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjennifer-aniston2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}