{"url": "www.inquisitr.com/4307067/is-brad-pitts-body-odor-becoming-a-problem-for-friends-helping-him-through-angelina-jolie-divorce/", "text": "Brad Pitt smells bad. That’s the alarming claim being made in a recent article in The National Inquirer. According to the Enquirer, Brad has been living the “hippy” lifestyle, refusing to take showers and change his clothes as he continues to get over his divorce from Angelina Jolie and the separation from his children. He has also allegedly been sleeping on friends’ couches because he’s afraid that if he remains home alone, he will relapse into addiction.\n\nBut Gossip Cop, a site that’s become known for debunking celebrity rumors has said the report smells just as fishy as they claim Brad Pitt smells.\n\n“Brad’s gone days, if not weeks, at a time without taking a shower, so of course he stinks of body odor a lot of the time,” an alleged close friend of the War Machine actor reportedly told The National Enquirer, as reported by Gossip Cop.\n\nBut Gossip Cop has a different story that they claim they received from someone who is actually in Pitt’s inner circle.\n\n“We’re told Pitt isn’t living the lifestyle of a smelly drifter, and the claim otherwise is completely bogus,” Gossip Cop states.\n\nThe latest report in the ongoing Brad Pitt Angelina Jolie saga is that Brad Pitt was “allowed” to see his children to celebrate Father’s Day.\n\nBrad Pitt in America's national parks. 3 different covers. Get them on newsstands everywhere or subscribe here: https://t.co/BhT2EyJFQ8 pic.twitter.com/Np27cqLaXN — GQ Style (@gqstylemag) June 16, 2017\n\nPeople Magazine reported that the children of the Jolie-Pitt clan reunited with their father on Saturday. According to People, they were dropped off at Brad’s Los Angeles home where they spent the morning with him before leaving with their mother for a trip to France later that day.\n\nWe highly doubt that Brad would have not showered before spending time with his kids especially since it was a special occasion.\n\nBrad Pitt Assures Everyone \"He's Got Nothing to Hide\" After Truth-Telling GQ Interview - https://t.co/lGUMKAgM9Z pic.twitter.com/5JC7p5CSzI — TheCelebrityTalk (@TheCelebrityTlk) May 16, 2017\n\nBrad Pitt has previously discussed how he’s currently coping with the divorce. In an interview with The Associated Press– as reported by People-– he said that he was focused on “keeping the ship afloat” and “figuring out the new configuration of our family” in the aftermath of the break-up between him and Angelina.\n\nHis main focus seems to be on his kids and keeping their lives as peaceful as possible.\n\n“Kids are everything,” he said. Angelina Jolie and Brad Pitt have six children together: Maddox, 15, Pax, 13, Zahara, 12, Shiloh, 10, and twins Vivienne and Knox, 8. “Kids are your life. They’re taking all the focus, as they should anyway.”\n\nRELATED POSTS ON THE INQUISITR\n\nBrad Pitt Gets Early Father’s Day Visit From His Kids Before They Leave For Ethiopia\n\nAngelina Jolie And Kids Take Off, Leaving Brad Pitt To Spend Father’s Day Alone\n\nBrad Pitt And Angelina Jolie Divorce: What Brought Them Together? All The Wrong Reasons, Says Halperin\n\nHas Brad Pitt Found New Love After Angelina Jolie Divorce?\n\n[Featured Image by Rich Fury/Getty Images]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/Brad-Pitt-smells-bad.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4307067/is-brad-pitts-body-odor-becoming-a-problem-for-friends-helping-him-through-angelina-jolie-divorce/", "title": "Is Brad Pitt’s Body Odor Becoming A Problem For Friends Helping Him Through Angelina Jolie Divorce Aftermath", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}