{"url": "www.sheknows.com/entertainment/articles/1004789/the-new-lone-ranger-who-is-armie-hammer", "text": "Regardless of how frequently you watch movies or television, chances are good that you have seen Armie Hammer’s handsome mug at least once. You may not even recognize him by name, but boy oh boy, those All-American good looks are very easy on the eyes. Oh, and it doesn’t hurt that Hammer is also a ridiculously talented actor as well.\n\nHammer’s star has been on the rise for the last handful of years, with his most recent role in the film Call Me By Your Name getting lots of 2018 awards season buzz (that includes the Oscars!). Hammer’s been on the slow march to conquer Hollywood — and it looks like it’s been a successful campaign — with roles in The Social Network, Cars 3, The Man From U.N.C.L.E., The Lone Ranger and Nocturnal Animals.\n\nSo, who exactly is this handsome actor that is in seemingly every high-profile movie worth watching these days? Well, you should keep reading because we have some fun tidbits about Hammer that you’ll want to know.\n\nMore: 18 Movies You Need to See Before Awards Season\n\n1. He comes from a well-to-do family\n\nEven though he has no trust fund to speak of and prides himself on having earned his success on his own merit and ability, Hammer doesn’t hide the fact that he comes from a well-known and well-to-do family. His great-grandfather (with whom he shares the same name) was Armand Hammer, a successful 20th-century industrialist. The more senior Hammer was a bit of a jokester and reportedly sat on the board of the company Arm & Hammer despite having nothing to do with the company; he thought it was just a bit of a hoot. But Hammer’s life was a rich tapestry filled with political intrigue, a profitable oil business, and the rubbing of shoulders with various elites, including Leonid Brezhnev (whom Hammer eulogized in People magazine in 1982). Because of Armand Hammer’s success, his future generations were able to live comfortably and continue the family business, which Armie went on to benefit from as well before pursuing acting.\n\n2. He might be the cutest dad in Hollywood\n\nAt 31 years old, Hammer is already the father of two very adorable youngsters: Harper and Ford. Not only is he a dad, but he’s a very vocal and proud dad who clearly devotes lots of time to his children and makes them a priority in his life. Hammer is constantly posting photos of Harper and Ford on his Instagram and honey, it will surely melt your heart. Just look at the Hammer family’s 2017 Christmas card and tell me that’s not the cutest thing ever.\n\nMore: It’s (New) Hammer time! A Baby Boy for Armie Hammer & His Wife\n\n3. He’s not afraid to defend himself or clap back at hypocrites\n\nHe deleted his Twitter account in late 2017, but up until that time, Hammer didn’t hold back when it came to calling out other celebs for their hypocritical behavior or drawing our attention to various social issues. In fact, in September 2017 (shortly before his Twitter exeunt), he called out actor James Woods for allegedly disturbing behavior involving dating a minor. This came after Woods voiced disapproval for Call Me By Your Name‘s fictional portrayal of a 26-year-old man romantically pursuing a 17-year-old boy (problematic, to be fair, but arguably hypocritical of Woods to do in the first place).\n\n4. He has had some shady, somewhat criminal tendencies in the past\n\nHammer’s youth was spent, in part, doing some pretty naughty things that (as far as we can see) have stayed put in the past. According to Vulture, this includes setting the lawn his high school on fire after writing his name on it with lighter fluid. Additionally, he revealed in a 2013 Playboy interview about one of his first business ventures: selling copies of Playboy and small bottles of lotion to the boys at school. Oh dear.\n\n5. The way he won over his wife is very Nicholas Sparks-esque\n\nThe way Hammer won over his wife (which happened while she was someone else’s girlfriend, mind you!) is literally straight out of the notebook. Here’s how he recounted the events of their first meeting: “I was like, ‘You have to break up with your boyfriend because we have to start dating.’ I said, ‘You were made for me … And I was made for you. We were made to be together. So we can do this 30 years from now, when I’ve gotten married a couple of times and you’ve gotten married a couple of times, or we can start now and end up 60 years from now sitting on a porch in rocking chairs, talking about how good an adventure the whole thing was.'” Are you swooning? Because I might be swooning.\n\n6. He’s a genuine goofball\n\nDearol’ Armie is never one to shy away from making a joke or letting his inner goofball run free. That’s why his social media is littered withsillinessthat manages to make us all chuckle every now and again. This, of course, includes that one time in July 2017 when he posted a rather revealing gym selfie.\n\n7. He loves to post a good #TBT on Instagram\n\nHammer is never one to shy away from posting a solid #TBT photo on his Instagram and chances are, he’s going to poke fun at himself or give us a glimpse into the kind of youth he used to be before he got so famous. Take, for instance, this hilarious photo he posted where he is sporting some serious bleached hair and holding a dog. Priceless.\n\n8. His first acting credit was as “Student #2” on Arrested Development\n\n\n\nHammer has leading-man good looks, to be sure, but he didn’t break out of the shadows. No, instead he worked his way up, slowly building his resumé with bit parts, which led to small recurring roles on shows like Gossip Girl and then leading roles, like Call Me By Your Name. His first credited onscreen role is as “Student #2” on Arrested Development. Even though it’s a blink-and-you-miss-it kind of role, he certainly does leave a good impression.\n\n9. He’s a real Renaissance man…with a bit of grit\n\nAccording to Elle, Hammer is a man with refined, old-world tastes (this might be the WASP-y side of him coming out). “The actor is of almost atavistically manly pursuits. He owns a collection of vintage Olivetti typewriters, hopes to one day open a cigar factory, and amuses himself on movie sets by reading books on knots,” a 2013 Elle profile notes at one point. His own cigar factory? Really?\n\nBut it gets better from there because Hammer, ever the difficult one to pin down, is also revealed to be a gun enthusiast. Not in a worrying way, mind you, but he did grow up with guns and learned how to shoot while living in Texas for a spell, as the profile notes, too, and which he confirms in the profile: “It was a family activity kind of thing—go out and shoot a bunch of cactuses.”\n\nMore: The Good, the Bad & the Ugly Moments in Hollywood in 2017\n\nSo, is Armie Hammer your new favorite actor? Because frankly, he might be our new favorite as of right now.", "images": ["https://www.sheknows.com/wp-content/uploads/2020/04/leighton-meester.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2018/08/ruzyzj4hl0dzwbher77g.jpeg?w=150&h=150&crop=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/ceelo-green-unexpected-health-scare-ftr.jpg?quality=98&w=330", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.sheknows.com&path=%2Fentertainment%2Farticles%2F1004789%2Fthe-new-lone-ranger-who-is-armie-hammer%2F&ct=article&lob=&loc=us&env=desktop&post_id=1004789", "http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.sheknows.com/wp-content/uploads/2018/12/armie-hammer-2017-things-to-know_t31q27.jpeg", "https://www.sheknows.com/wp-content/uploads/2020/04/prince-william-kate-middleton-queen-health.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/Princess-Beatrice-Edoardo-Mapelli-Mozzi-1.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/thomas-rhett.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2019/12/khloe-kardashian-tristan-thompson.jpg?w=445&h=250&crop=1", "https://pmcspy.files.wordpress.com/2017/07/smart-bulbs.jpg?quality=98&w=330", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://media3.giphy.com/media/P23CcnIB01EDm/giphy.gif", "https://www.sheknows.com/wp-content/uploads/2018/12/armie-hammer-2017-things-to-know_t31q27.jpeg?w=695&h=391&crop=1", "https://www.sheknows.com/wp-content/uploads/2019/08/Dwayne-Johnson-Raising-Daughters.jpg?w=445&h=250&crop=1", "https://i0.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/chucky-fetti.png?quality=98&w=330#038;ssl=1", "https://pmcvariety.files.wordpress.com/2020/04/katie-lowes-akua-murphy-rachel-myers-alison-eakle.jpg?quality=98&w=330"], "top_img": "https://www.sheknows.com/wp-content/uploads/2018/12/armie-hammer-2017-things-to-know_t31q27.jpeg", "keywords": [], "authors": ["Julie Sprankles"], "canonical_link": "https://www.sheknows.com/entertainment/articles/1004789/the-new-lone-ranger-who-is-armie-hammer/", "title": "9 Things to Know About Armie Hammer, the Hero Taking Over Hollywood – SheKnows", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "Who is Armie Hammer, star of the buzzed-about 'Call Me By Your Name' as well as previous hits 'The Social Network' and 'The Lone Ranger'?", "generator": "WordPress 5.4", "author": "Julie Sprankles", "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Get to know the star of Call Me By Your Name", "url": "https://www.sheknows.com/entertainment/articles/1004789/the-new-lone-ranger-who-is-armie-hammer/", "description": "Who is Armie Hammer, star of the buzzed-about 'Call Me By Your Name' as well as previous hits 'The Social Network' and 'The Lone Ranger'?", "site_name": "SheKnows", "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/12/armie-hammer-2017-things-to-know_t31q27.jpeg", "width": 1024, "height": 581, "alt": "BEVERLY HILLS, CA - DECEMBER 03:  Actor Armie Hammer attends The Trevor Project's 2017 TrevorLIVE LA at The Beverly Hilton Hotel on December 3, 2017 in Beverly Hills, California.  (Photo by Jason LaVeris/FilmMagic)"}, "locale": "en_US"}, "article": {"published_time": "2013-07-03T14:00:00+00:00", "modified_time": "2018-07-10T02:25:39+00:00"}, "twitter": {"text": {"title": "Get to know the star of Call Me By Your Name"}, "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/12/armie-hammer-2017-things-to-know_t31q27.jpeg?w=1024", "alt": "BEVERLY HILLS, CA - DECEMBER 03:  Actor Armie Hammer attends The Trevor Project's 2017 TrevorLIVE LA at The Beverly Hilton Hotel on December 3, 2017 in Beverly Hills, California.  (Photo by Jason LaVeris/FilmMagic)"}, "card": "summary_large_image", "site": "@SheKnows", "creator": "@https://twitter.com/JulieLMS", "title": "Get to know the star of Call Me By Your Name", "description": "Who is Armie Hammer, star of the buzzed-about 'Call Me By Your Name' as well as previous hits 'The Social Network' and 'The Lone Ranger'?"}, "msapplication-TileImage": "https://www.sheknows.com/wp-content/uploads/2018/11/cropped-sk-favicon.png?w=270"}, "movies": ["https://www.youtube.com/embed/8BIEKwpPFYo?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1372860000.0, "source": "http://www.sheknows.com", "summary": ""}