{"url": "www.cheatsheet.com/entertainment/why-jamie-foxx-and-katie-holmes-still-refuse-to-talk-about-their-relationship.html/", "text": "While many celebrity couples like to keep their relationships private, Jamie Foxx and Katie Holmes give a whole new meaning to that as they have tried to keep their romance a secret for years. In 2017 though, the pair were photographed together walking hand in hand along a beach in Malibu, California, and everyone thought then that they were going to be more public with their relationship. But as it turns out, they still don’t want to talk about it.\n\nHere’s what we know about the ultra-private couple and why they still refuse to speak publicly about each other.\n\nFoxx and Holmes have never confirmed relationship\n\nLeft: Jamie Foxx in 2018 | Greg Doherty/Getty Images, Right: Katie Holmes in New York City | Monica Schipper/Getty Images Left: Jamie Foxx in 2018 | Greg Doherty/Getty Images, Right: Katie Holmes in New York City | Monica Schipper/Getty Images\n\nEven though the cat is out of the bag, Foxx and Holmes have never actually confirmed their relationship. In fact, they did the opposite and denied it on many occasions by pulling the old “just friends” line.\n\nSo, despite their Labor Day PDA photo, or picture of them grabbing dinner in NYC, or gazing into one another’s eyes at a pre-Grammy event, we shouldn’t expect these two to suddenly do red carpets together anytime soon.\n\nNext: Have they kept quiet because of Tom Cruise?\n\n\n\nDid they stay silent because of a Tom Cruise ban?\n\nIs Tom Cruise influencing Katie Holmes, and Jamie Foxx’s relationship? | Win McNamee/Getty Images Is Tom Cruise influencing Katie Holmes, and Jamie Foxx’s relationship? | Win McNamee/Getty Images\n\nFoxx and Holmes initially sparked dating rumors back in 2013, but up until 2012 the actress was married to Tom Cruise. One report claimed that as part of their divorce settlement, Holmes had to keep any new relationship under wraps for five years so Cruise wouldn’t be embarrassed.\n\nThat five-year mark was up in 2017 when the Malibu photo surfaced, but Gossip Cop debunked the allegation of a ban put in place by the Mission Impossible calling it “fiction.” Moreover, if Holmes and Foxx only kept quiet over the years because of some ban, then why wouldn’t they be more public now?\n\nNext: They spend time together out of the spotlight.\n\n\n\nThe couple spends most of their time together at home\n\nKatie Holmes has gone through extra measures to keep this relationship as private as possible. | Christopher Polk/Getty Images for NARAS Katie Holmes has gone through extra measures to keep this relationship as private as possible. | Christopher Polk/Getty Images for NARAS\n\nWith only of few photos of them out and about, the couple has gone to great lengths to remain under the radar and one way they do that is by spending time together at home.\n\nAn insider told People that on date nights they hang out at their houses in Los Angeles saying, “They only spend time together at each other’s homes” to avoid the paparazzi.\n\nNext: Foxx isn’t talking.\n\n\n\nFoxx ends interview after being asked about Holmes\n\nHe was not interested in answering that question. | Robyn Beck/AFP/Getty Images He was not interested in answering that question. | Robyn Beck/AFP/Getty Images\n\nDuring NBA All-Star weekend in February 2018, the Oscar winner showed everyone that he doesn’t appreciate being asked about his lady by abruptly ending an interview when a journalist went there.\n\nReferring to some pictures that were published a day earlier, ESPN’s Michael Smith asked, “Did you and Katie Holmes play basketball for Valentine’s Day?” Foxx responded by saying nothing at all and simply removed his microphone and walked away, proving that if you want to talk to him, don’t bring up Holmes.\n\nNext: They made a pact not to speak about their romance.\n\n\n\nThey agreed not to talk about relationship\n\nThey’re not open to sharing details. | Jewel SamadAFP/Getty Images They’re not open to sharing details. | Jewel SamadAFP/Getty Images\n\nOne of the main reasons, Foxx and Holmes have chosen not to discuss their love life is because it’s something they agreed upon early on.\n\n“Katie and Jamie have an agreement that they’ll never talk about their relationship or each other in the press,” a source close to the Dawson’s Creek alum explained to Us Weekly.\n\nThe source added that Holmes was happy with the way Foxx handled the ESPN interview because she “felt he was respecting their agreement.”\n\nNext: They are still going strong.\n\n\n\nWhy it works for them\n\nThis is perhaps the key to a lasting relationship. | Phillip Faraone/Getty Images for Mercedes-Benz USA This is perhaps the key to a lasting relationship. | Phillip Faraone/Getty Images for Mercedes-Benz USA\n\nSomething these two have proved is that keeping things private works for them. A source told Us Weekly that their relationship also works “because of the love, compassion, trust and support they have for each other.”\n\nThe source further explained that while they “lead their own separate lives, they confide in and rely on each other pretty heavily.”\n\nNext: They don’t need to give attention to breakup rumors.\n\n\n\nThey don’t have to deal with cheating, split rumors\n\nLeft: Katie Holmes | Nicholas Hunt/Getty Images, Right: Jamie Foxx | Charley Gallay/Getty Images Left: Katie Holmes | Nicholas Hunt/Getty Images, Right: Jamie Foxx | Charley Gallay/Getty Images\n\nFinally, there have been reports about Foxx allegedly cheating on Holmes, and the pair breaking up. But since the couple makes it a point to not talk about their relationship, they never have to address the made up splitsville rumors put out there by the tabloids.\n\nFollow Michelle Kapusta on Twitter @philamichelle.\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-in-Beverly-Hills-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katie-Holmes-at-the-Grammy-Awards-1-640x426.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Katie-Holmes-Jamie-Foxx-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katie-Holmes-at-the-Grammy-Awards-640x442.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katie-Holmes-and-Jamie-Foxx-640x430.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/why-jamie-foxx-and-katie-holmes-still-refuse-to-talk-about-their-relationship.html/", "title": "Why Jamie Foxx and Katie Holmes Still Refuse to Talk About Their Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/why-jamie-foxx-and-katie-holmes-still-refuse-to-talk-about-their-relationship.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "After photos of the pair holding hands surfaced in 2017, many thought they were going to go public with their relationship but they still aren't talking about it now.", "og": {"locale": "en_US", "type": "article", "title": "Why Jamie Foxx and Katie Holmes Still Refuse to Talk About Their Relationship", "description": "After photos of the pair holding hands surfaced in 2017, many thought they were going to go public with their relationship but they still aren't talking about it now.", "url": "https://www.cheatsheet.com/entertainment/why-jamie-foxx-and-katie-holmes-still-refuse-to-talk-about-their-relationship.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-13T19:58:16-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "relationship", "section": "Entertainment", "published_time": "2018-06-13T19:56:00-04:00", "modified_time": "2018-06-13T19:58:16-04:00"}, "twitter": {"card": "summary_large_image", "description": "After photos of the pair holding hands surfaced in 2017, many thought they were going to go public with their relationship but they still aren't talking about it now.", "title": "Why Jamie Foxx and Katie Holmes Still Refuse to Talk About Their Relationship", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Jamie-Foxx-and-Katie-Holmes-640x430.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528934160.0, "source": "http://www.cheatsheet.com", "summary": ""}