{"url": "https://en.wikipedia.org/wiki/Paul_Walker", "text": "This article is about the American actor. For other people named Paul Walker, see Paul Walker (disambiguation)\n\nAmerican actor (1973-2013)\n\nPaul William Walker IV[3] (September 12, 1973[4] – November 30, 2013) was an American actor and philanthropist best known for his role as Brian O'Conner in The Fast and the Furious franchise. Walker began his career as a child actor during the 1970s and 1980s, but first gained recognition in the early 1990s after appearing in the television soap opera The Young and the Restless. He soon transitioned into film, and received praise in 1999 for his performances in the teen films She's All That and Varsity Blues, which helped kickstart his career. Walker then gained international fame after starring in The Fast and the Furious.\n\nHe subsequently gained commercial success in a number of other action and thriller films, enjoying critical praise for his performances in Joy Ride (2001), Into the Blue (2005), and Running Scared (2006). Walker also enjoyed critical and commercial success in other genres, such as the survival drama Eight Below (2006) and the war film Flags of Our Fathers (2006). Later in his career, Walker featured as a presenter for the marine biology series Expedition Great White[5] and became known for his philanthropic efforts, founding the disaster-relief charity Reach Out Worldwide (ROWW) in 2010.[6]\n\nWalker died on November 30, 2013 at the age of 40 as a passenger in a single-car crash alongside friend and driver Roger Rodas. Walker's father and daughter filed separate wrongful death lawsuits against Porsche, which resulted in settlements. At the time of his death, Walker had not completed filming Furious 7 (2015), which was completed after rewrites and stand-ins, including his brothers Cody and Caleb, filling in for Walker. The song \"See You Again\" by Wiz Khalifa and Charlie Puth was commissioned for the film's soundtrack as a tribute to Walker.[7]\n\nEarly life [ edit ]\n\nWalker was born in Glendale, California, the son of Cheryl (née Crabtree), a fashion model, and Paul William Walker III, a sewer contractor and boxer who was a two-time Golden Gloves champion.[8][9][10] Paul's paternal grandfather had a boxing career as \"'Irish' Billy Walker\". Paul's ancestry was mostly English, with some German, Swiss, and Irish.[11] One of his grandfathers raced factory cars for Ford in the 1960s.[8] The oldest of five siblings, Walker was raised primarily in the Sunland community of Los Angeles and attended high school in the San Fernando Valley, graduating from Sun Valley's Village Christian School in 1991.[12][13] He was raised in a Mormon household.[9] After high school, Walker attended several community colleges in Southern California, majoring in marine biology.[14]\n\nCareer [ edit ]\n\nWalker began his small screen career as a toddler when he starred in a television commercial for Pampers. He began modeling at age two and began working on television shows in 1985 with roles in shows such as Highway to Heaven, Who's the Boss?, The Young and the Restless, and Touched by an Angel. That year he starred in a commercial for Showbiz Pizza.[15] Walker's film career began in 1986, with the horror/comedy film Monster in the Closet. In 1987, he appeared in The Retaliator (aka Programmed to Kill), a low budget cyborg action film, with Robert Ginty. He and his sister Ashlie were contestants on a 1988 episode of the game show I'm Telling!, in which they finished in second place. In 1993, he played Brandon Collins on the CBS soap opera The Young and the Restless. He and his co-star Heather Tom, who played Victoria Newman, were nominated for Outstanding Lead Actor and Actress in a soap opera at the Youth in Film Awards. In 1998, Walker made his feature film debut in the comedy Meet the Deedles, which finally gained him fame. This subsequently led to supporting roles in the movies Pleasantville (1998), Varsity Blues (1999), She's All That (1999), and The Skulls (2000).[citation needed]\n\nIn 2001, Walker's breakthrough role arrived when he starred opposite actor Vin Diesel in the successful action film The Fast and the Furious, the first film in the franchise. The film established Walker as a notable film star and leading man and led to his reprise of the role in the 2003 sequel 2 Fast 2 Furious. He continued his career with leading roles in films such as Joy Ride (2001), Timeline (2003), and Into the Blue (2005). He had a supporting role in Clint Eastwood's adaptation of Flags of Our Fathers (2006).\n\nWalker then starred in the action thriller Running Scared and Walt Disney Pictures' Eight Below, both released in 2006. Eight Below garnered critical-acclaim and opened in first place at the box office, grossing over US$20 million during its first weekend.[16] During the filming of Running Scared, director Wayne Kramer stated that \"[Walker] is that guy on some level\"[17] when comparing Walker with his character in the movie, Joey Gazelle. Kramer continued on to say that he \"loved working with [Walker] because as a director he's completely supportive of my vision of what the film is. And even better, he's completely game for it.\"[17]\n\nWalker starred in the independent film The Lazarus Project, which was released on DVD on October 21, 2008. He subsequently returned to The Fast and the Furious franchise, reprising his role in Fast & Furious, which was released on April 3, 2009.[18] Walker then appeared in the action film Takers, which began filming in September 2008 and was released in August 2010.[19]\n\nThe Coty Prestige fragrance brand Davidoff Cool Water for Men announced in January 2011 that Walker was going to be the new face of the brand as of July 2011.[20] He reprised his role in the fifth installment of The Fast and the Furious series, Fast Five (2011), and again in Fast & Furious 6 (2013). For this film, he won the 2014 MTV Movie Award as best on-screen duo, with Vin Diesel. He was part of an ensemble cast in Wayne Kramer's Pawn Shop Chronicles (2013), which was Walker's last film released before his death.\n\nShortly after his death, the Hurricane Katrina based film Hours, which he had completed earlier in 2013, was released on December 13, 2013. He had also completed the action film Brick Mansions, a remake of the French film District 13, which was released in April 2014. At the time of his death, Walker had been filming Furious 7, which was slated for release in July 2014. The film was completed by using his brothers Caleb and Cody as his body doubles/stand-ins and CGI, and was released in April 2015.[21] Walker was also set to play Agent 47 in the video game adaptation Hitman: Agent 47, but died before production began.[22]\n\nPersonal life [ edit ]\n\nWalker lived in Santa Barbara with his dogs.[9][23] He and Rebecca Soteros, a one-time girlfriend, had a daughter named Meadow Rain Walker,[24] who lived with her mother in Hawaii for 13 years and then moved to California to live with Walker in 2011.[25] Her godfather is Vin Diesel. At the time of his death, Walker was dating Jasmine Pilchard-Gosnell.[26] Walker was raised in a Mormon household, but later became a non-denominational Christian.[27]\n\nHe held a brown belt in Brazilian jiu-jitsu under Ricardo \"Franjinha\" Miller at Paragon Jiu-Jitsu[28] and was awarded his black belt by Miller posthumously.[29]\n\nWalker had an interest in marine biology, and joined the board of directors of The Billfish Foundation in 2006.[30] He fulfilled a lifelong dream by starring in a National Geographic Channel series Expedition Great White (later retitled Shark Men), which premiered in June 2010.[31][32] He spent 11 days as part of the crew, catching and tagging seven great white sharks off the coast of Mexico. The expedition, led by Chris Fischer, founder and CEO of Fischer Productions, along with Captain Brett McBride and Dr. Michael Domeier of the Marine Conservation Science Institute, took measurements, gathered DNA samples, and fastened real-time satellite tags to the great white sharks. This allowed Dr. Domeier to study migratory patterns, especially those associated with mating and birthing, over a five-year period.[33]\n\nIn March 2010, Walker went to Constitución, Chile to offer his help and support to the people injured in the 8.8 magnitude earthquake that struck on February 27. He flew with his humanitarian aid team, Reach Out Worldwide, to Haiti to lend a helping hand to the 2010 Haiti earthquake victims.[34]\n\nA car enthusiast, he competed in the Redline Time Attack racing series in which he raced on the AE Performance Team driving a BMW E92 M3. His car was sponsored by Etnies, Brembo Brakes, Öhlins, Volk, OS Giken, Hankook, Gintani, and Reach Out Worldwide.[35] Walker had been preparing for an auto show prior to his death.[36] Walker also had a large car collection of about 30 cars, a portion of which he co-owned along with Roger Rodas.[37] The collection included (but is not limited to):[38]\n\nRoger Rodas became Walker's financial adviser[42] in 2007 and helped to establish Reach Out Worldwide.[43] Rodas, a pro-am racer[44] was the CEO of Always Evolving, a Valencia high-end vehicle performance shop owned by Walker.[45] Walker was also close friends with his 2 Fast 2 Furious co-star Tyrese Gibson.[46] Vin Diesel considered Walker to be like a brother, both on and off screen, and affectionately called him \"Pablo\".[47] Walker's mother referred to her son as Diesel's \"other half\".[48]\n\nIn January 2020, twenty-one vehicles owned by the late actor Paul Walker were sold for a combined $2.33 million during spirited bidding at an annual car auction in Arizona.[49]\n\nDeath [ edit ]\n\nSite of Walker's death on Hercules Street in Santa Clarita (photo taken on April 5, 2015)\n\nOn November 30, 2013, at about 3:30 p.m. PST, Walker, 40, and Roger Rodas, 38, left an event for Walker's charity Reach Out Worldwide for victims of Typhoon Haiyan (Yolanda),[50] with Rodas driving[51] his Porsche Carrera GT. In a 45 mph (72 km/h) speed zone on Hercules Street near Kelly Johnson Parkway in Valencia, Santa Clarita, California, the car crashed into a concrete lamp post and two trees and burst into flames.[50][52] Rodas died of multiple trauma while Walker died from the combined effects of trauma and burns. Both of their bodies were burned beyond recognition.[51]\n\nThe curve where Walker and Rodas died is a popular spot for drifting cars.[53] No alcohol or other drugs were found in either man's system,[54] and neither mechanical failure nor road conditions appeared to play a role.[55] Police found no evidence of drag racing.[56] The investigation concluded that the car's speed – between 80 mph (130 km/h) and 93 mph (150 km/h) – and age of the tires were the primary reasons for the crash.[57]\n\nGrave of Paul Walker at Forest Lawn Hollywood Hills\n\nWith Furious 7 in the middle of filming at the time of Walker's death, Universal announced an indeterminate hiatus on the production, citing a desire to speak with his family before determining what to do with the film.[58]\n\nNumerous friends and movie stars posted tributes to Walker on social media.[59] His body was cremated and his ashes were buried in a non-denominational ceremony at Forest Lawn Memorial Park.[60] His life was later chronicled in the documentary I Am Paul Walker, which was released on August 11, 2018.[61]\n\nLegal repercussions [ edit ]\n\nIn December 2014, Walker's father, Paul III, filed a wrongful death claim against Rodas' estate seeking the return of or \"a proportionate share\" of revenue generated by a group of automobiles that were jointly owned by both Walker and Rodas.[62] In September 2015, Walker's daughter Meadow filed a wrongful death lawsuit against Porsche for the death of her father, claiming that the Porsche Carrera GT had numerous design defects including a history of instability, and that its seat belt placement can cause harm upon impact.[63] However, Porsche denied any wrongdoing and blamed Walker himself, stating: \"The perils, risk, and danger were open and obvious and known to him, and he chose to conduct himself in a manner so as to expose himself to such perils, dangers, and risks, thus assuming all the risks involved in using the vehicle.\"[64] In April 2016, U.S. District Court Judge Philip S. Gutierrez ruled in favor of Porsche in a separate lawsuit filed by Roger Rodas' widow Kristine.[65][66] The ruling had no bearing on two other cases against Porsche which have been filed by Walker's father, who is also the executor of the actor's estate, and his daughter.[66] Walker's father and daughter both reached an agreement with Porsche.[67]\n\nFilmography [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Fast_Five_Cast_2.jpg/250px-Fast_Five_Cast_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/9/91/PaulWalkerEdit-1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Grave_of_Paul_Walker.JPG/170px-Grave_of_Paul_Walker.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Paul_Walker_Signature.svg/150px-Paul_Walker_Signature.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Herculesstreet.jpg/220px-Herculesstreet.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Nissan_Skyline_-_2_Fast_2_Furious.JPG/220px-Nissan_Skyline_-_2_Fast_2_Furious.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/PaulWalkerEdit-1.jpg/220px-PaulWalkerEdit-1.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/91/PaulWalkerEdit-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Paul_Walker", "title": "Paul Walker", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/9/91/PaulWalkerEdit-1.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}