{"url": "https://www.self.com/story/kate-middleton-talking-mental-health-film", "text": "Kate Middleton wants kids to know it's OK to talk about mental health. The Duchess of Cambridge and soon-to-be mother of three provided a brief introduction for a new short children's film on the subject, titled \"Talking Mental Health.\"\n\n\"Mental health is how we feel and think,\" Middleton says in the intro. \"[It's] things that can't really be seen but that affect us every day, and talking about them can feel difficult.\"\n\nThe animated film was created by The Anna Freud National Centre for Children and Families, a U.K.-based mental health charity focused on children's care. \"[The video] helps us all talk about our mental health, what to say, and who to talk to when we have feelings that are too big to manage on our own,\" Middleton says.\n\nIn the film, kids (depicted as doodled thumbprints) introduce the concept of \"small feelings,\" or fleeting positive and negative emotions. Specifically, the kids discuss how they deal with unpleasant ones (reading, taking a bath, or eating KFC are suggested as classic cures). Then the film also delves into \"big feelings,\" and what kids should do if they feel like certain feelings are making it hard to move about their lives, like finding someone they trust to open up to.\n\nThese big feelings are ones that stick around too long—and can affect our mental health and how we see the world, the film explains. Dealing with them usually requires the help of others. In that case, the cute thumb people show kids what to do if someone they care about needs to open up to them about their mental health struggles. It advises them to really give their friend their undivided attention and maybe even help them find a grown-up who has the resources to offer them more guidance.\n\nMiddleton has become a strong supporter of having honest, open conversations around mental health. She and her husband, Prince William, as well as her brother-in-law, Prince Harry, collaborated on the Heads Together campaign, which focuses on reducing the stigma around mental illness. This past spring, Heads Together released a film series called #OKtoSay, which featured people who had struggled with mental illness in conversation with the person they first felt comfortable enough to open up about their experiences with.\n\n\"We all know that you cannot resolve a mental health issue by staying silent,\" Middleton and the princes wrote in a statement about the series. \"We hope these films show people how simple conversations can change the direction of an entire life.\"\n\nRelated:\n\nYou May Also Like: Watch This Mom Work Out With Her Little Ones", "images": ["https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/59c17b836371dc178cdd6bee/2:1/w_1280,c_limit/kate-film.jpg", "https://media.self.com/photos/59c13be2da2b6e71be38f8c5/4:3/w_2560%2Cc_limit/kate%252520middleton.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg"], "top_img": "https://media.self.com/photos/59c17b836371dc178cdd6bee/2:1/w_1280,c_limit/kate-film.jpg", "keywords": [], "authors": ["Molly Horan", "Molly Hora"], "canonical_link": "https://www.self.com/story/kate-middleton-talking-mental-health-film", "title": "Kate Middleton Introduces a Mental Health Film About Paying Attention to 'Small Feelings'", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Molly Horan", "copyright": "Copyright (c) Condé Nast 2020", "description": "Kate Middleton is featured in the introduction of a new short children's film that explains the concept of mental health to young viewers.", "id": "59c137cb684cd1140df34d9a", "keywords": "mental health,snd,kate middleton,depression,anxiety,news", "news_keywords": "mental health,snd,kate middleton,depression,anxiety,news", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59c137cb684cd1140df34d9a", "parsely-metadata": "{\"description\":\"Kate Middleton is featured in the introduction of a new short children's film that explains the concept of mental health to young viewers.\",\"image-16-9\":\"https://media.self.com/photos/59c13be2da2b6e71be38f8c5/16:9/w_1000,c_limit/kate%20middleton.jpg\",\"image-1-1\":\"https://media.self.com/photos/59c13be2da2b6e71be38f8c5/1:1/w_1000,c_limit/kate%20middleton.jpg\"}", "og": {"description": "She's delivering an important message.", "image": "https://media.self.com/photos/59c17b836371dc178cdd6bee/2:1/w_1280,c_limit/kate-film.jpg", "site_name": "SELF", "title": "Kate Middleton Introduces a Film About Kids' Mental Health", "type": "article", "url": "https://www.self.com/story/kate-middleton-talking-mental-health-film"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "She's delivering an important message.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/59c17b836371dc178cdd6bee/2:1/w_1280,c_limit/kate-film.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Kate Middleton Introduces a Film About Kids' Mental Health"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": ["https://www.youtube.com/embed/2hVAPFyukvY"], "publish_date": null, "source": "https://www.self.com", "summary": ""}