{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/15/bachelor-in-paradise-addresses-scandal-in-most-frustrating-way-possible-in-the-premiere/", "text": "In case you missed it, production on the popular “Bachelor” spinoff was shuttered in June after alleged “misconduct” took place during filming on set in Mexico. Producers did not elaborate, though within hours rumors were flying, namely that the situation involved two cast members; an incident in a pool; and “a drunk sexual encounter with a female contestant who may have been too intoxicated to consent,” according to reports.\n\nAD\n\nAD\n\nSoon, it emerged the two contestants were Corinne Olympios and DeMario Jackson — Olympios, 24, hired a lawyer and called the incident her “worst nightmare.” Jackson, 30, said his character was being destroyed with “false claims and malicious allegations.” A couple of weeks later, production company Warner Bros. completed an investigation of the footage, and found it “does not support any charge of misconduct by a cast member.” Olympios’s own investigation was competed to her satisfaction. A few days later, filming resumed, though Olympios and Jackson did not return.\n\nEven though the show went on, viewers were very aware of the fact that allegations occurred — ones that triggered the franchise to review its safety procedures. Yet before the premiere, producers appeared to treat the controversy as a harmless misstep, along with a cheery promo that some dubbed “horribly flippant.” (ABC Entertainment’s president, Channing Dungey, said they meant the trailer to be “cheeky,” and pulled them when it was clear that audiences weren’t amused.)\n\nBefore the premiere, the Hollywood Reporter published an interview with Robert Mills, head of ABC’s alternative programming, who said the show would address the controversy “head on.” According to THR, Monday’s episode would “air footage leading up to the shutdown, and Tuesday will see Chris Harrison hosting a ‘thought-provoking’ conversation with the cast about the show’s new rules and the topic of consent.”\n\nHowever, if you didn’t read about this plan ahead of time, it sure looked like the show was tastelessly using the scandal as bait for fans to tune in to Tuesday’s episode — as evidenced by many frustrated tweets from viewers. And while cliffhangers are certainly a much-used part of “The Bachelor” formula, maybe this wasn’t the time or place for that strategy.\n\nThe beginning of the episode looked like it would be different, as it featured host Chris Harrison on an empty beach.\n\nAD\n\nAD\n\n“As many of you already know, this was the season of ‘Paradise’ that looked like it might not happen. After two days of shooting, we decided to suspend production. Yes, there was trouble in paradise as accusations and allegations ran wild. It was an extraordinarily stressful and emotional time for our cast and all of our crew, including myself,” he said gravely.\n\nStill, he added, the goal of “Paradise” is to help former “Bachelor” cast members find love. But first, the producers wanted to show everything that happened during the two days before production came to a halt. “Let’s get this season started, a season that I can definitely say will go down in ‘Bachelor’ history as the most shocking, and yes, the most dramatic season ever,” Harrison said, a wink to longtime viewers who know that’s promised every season.\n\nSo the show went on, as the contestants were introduced and started pairing off — a couple scenes showed DeMario and Corinne bonding. Eventually viewers saw them laughing together, with Corinne sitting on his lap. They ran over to the pool, yelling hello to fellow contestant Alex Woytkiw, who was conducting an on-camera interview.\n\nAD\n\nAD\n\n“What’s going on with Corinne and DeMario, I don’t know. I know that they’re enjoying each other’s company. They seem like they are clicking,” Alex said, watching in amusement. ” ‘Paradise’ comes with potential to fall in love, and Corinne and DeMario are forging a relationship. They look like they have a connection.”\n\nAlex continued to narrate as Corinne and DeMario jumped in the pool. “Just to let the viewers at home know, Corinne has not changed out of her clothing. She is fully dressed, in the pool right now with DeMario. This is so romantic. It is approximately 4:30 in the afternoon right now, and Corinne and DeMario are already attached at the hip,” he laughed.\n\nThat was the last time Corinne and DeMario were seen together on camera. Throughout the episode, there were multiple teasers about drama. “Stay tuned for the moment … the cameras stopped rolling,” a voice-over said mischievously.\n\nThen, with about two minutes left in the show, the camera zoomed in on Corinne talking with Alex and another cast member, Amanda Stanton. A producer walked over. “Can I steal you for a minute?” he asked Corinne. Looking confused, Corinne stood up. Then they cut to another producer who found DeMario on the beach, walking with Alexis Waters. “I hate to do this, but I need him. I gotta talk to him in private,” the producer said.\n\nAD\n\nAD\n\n“What the f— is going on?” Alexis asked.\n\nThere was no answer. The next two minutes were a blur of activity, with dramatic music playing in the background. The contestants talked over each other: “I think DeMario left.” “Where’s Corinne?” A producer marched over. “Shut it down!” he barked at a camera operator, who lowered his camera to the sand.\n\nThings got blurry as other cameras were dramatically pointed to the ground, and the crew was ordered to stop filming. The cast grew increasingly confused. “I’m thinking it’s something with Corinne and DeMario from the first night,” one woman said in the background.\n\nThe contestants slowly packed up and headed back to their rooms. “It’s kind of like a chill fell over ‘Paradise,’” explained Danielle Maltby to the camera. “We’re just all looking at each other like, ‘What the f— is happening?’”\n\nAD\n\nAD\n\nEventually, viewers saw an empty beach as the spooky music continued, with a voice-over urging the audience to tune in on Tuesday night. A couple scenes showed the cast all gathered around Harrison saying sternly, “Do you want to be here?”\n\nObviously, there’s not much suspense — any “Paradise” viewer knows what happens next. And given the serious nature of the initial allegations, there was no reason not to explain everything upfront, no cliffhangers necessary.\n\nRead more:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V3D3MQT3WU3VVBTGSWPRFOQWN4.jpg&w=150", "https://www.washingtonpost.com/resizer/qOGBSJgbU8GKDxdCA_bXITxhWuY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V3D3MQT3WU3VVBTGSWPRFOQWN4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/qOGBSJgbU8GKDxdCA_bXITxhWuY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V3D3MQT3WU3VVBTGSWPRFOQWN4.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/15/bachelor-in-paradise-addresses-scandal-in-most-frustrating-way-possible-in-the-premiere/", "title": "‘Bachelor in Paradise’ addresses scandal in most frustrating way possible in the premiere", "meta_data": {"description": "Reality competition shows love a good cliffhanger, but that doesn't mean they're always a good idea.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/08/15/bachelor-in-paradise-addresses-scandal-in-most-frustrating-way-possible-in-the-premiere/", "image": "https://www.washingtonpost.com/resizer/qOGBSJgbU8GKDxdCA_bXITxhWuY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V3D3MQT3WU3VVBTGSWPRFOQWN4.jpg", "title": "Analysis | ‘Bachelor in Paradise’ addresses scandal in most frustrating way possible in the premiere", "description": "Reality competition shows love a good cliffhanger, but that doesn't mean they're always a good idea."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | ‘Bachelor in Paradise’ addresses scandal in most frustrating way possible in the premiere", "description": "Reality competition shows love a good cliffhanger, but that doesn't mean they're always a good idea."}, "last_updated_date": "2018-02-26T00:44:11.368Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1502726400.0, "source": "https://www.washingtonpost.com", "summary": ""}