{"url": "http://www.nytimes.com/2009/02/09/us/politics/09text-obama.html?_r=1", "text": "Number two is that, although there are some programs in there that I think are good policy, some of them aren't job creators. I think it's perfectly legitimate to say that those programs should be out of this particular recovery package, and we can deal with them later.\n\nBut when they start characterizing this as pork without acknowledging that there are no earmarks in this package -- something, again, that was pretty rare over the last eight years -- then you get a feeling that maybe we're playing politics instead of actually trying to solve problems for the American people.\n\nSo I'm going to keep on engaging. I hope that as we get the Senate and the House bills together, that everybody is willing to give a little bit. I suspect that the package that emerges is not going to be a hundred percent of what I want. But my bottom line is, are we creating 4 million jobs, and are we laying the foundation for long- term economic growth?\n\nThis is another concern that I've had in some of the arguments that I'm hearing. When people suggest that what a waste of money to make federal buildings more energy-efficient -- why would that be a waste of money? We're creating jobs immediately by retrofitting these buildings or weatherizing 2 million Americans' homes, as was called for in the package. So that right there creates economic stimulus, and we are saving taxpayers, when it comes to federal buildings, potentially $2 billion. In the case of homeowners, they will see more money in their pockets. And we're reducing our dependence on foreign oil in the Middle East. Why wouldn't we want to make that kind of investment?\n\nNow, maybe philosophically you just don't think that the federal government should be involved in energy policy. I happen to disagree with that. I think that's the reason why we find ourselves importing more foreign oil right now than we did back in the early '70s, when OPEC first formed. And we can have a respectful debate about whether or not we should be involved in energy policymaking, but don't suggest that somehow that's wasteful spending. That's exactly what this country needs.\n\nThe same applies when it comes to information technologies and health care. We know that health care is crippling businesses and making us less competitive, as well as breaking the banks of families all across America. And part of the reason is we've got the most inefficient health care system imaginable. We're still using paper. We're -- we're still filing things in triplicate. Nurses can't read the prescriptions that doctors -- that doctors have written out. Why wouldn't we want to put that on an -- put that on an electronic medical record that will reduce error rates, reduce our long-term cost of health care, and create jobs right now?\n\nEducation, yet another example. The suggestion is, why should the federal government be involved in school construction? Well, I visited a school down in South Carolina that was built in the 1850s. Kids are still learning in that school -- as best they can. When the -- when the railroad -- when the -- it's right next to a railroad, and when the train runs by the whole building shakes and the teacher has to stop teaching for a while. The -- the auditorium is completely broken down and they can't use it. So why wouldn't we want to build state-of-the-art schools with science labs that are teaching our kids the skills they need for the 21st century, that will enhance our economy and, by the way, right now will create jobs?", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "keywords": [], "authors": [], "canonical_link": "https://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "title": "Obama’s Prime-Time Press Briefing", "meta_data": {"article": {"published": "2009-02-10T00:58:30.000Z", "modified": "2009-02-10T05:46:05.000Z", "section": "U.S.", "tag": "Obama Stimulus Plan", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 1231547514999, "nyt_uri": "nyt://article/17dbb9dd-fe9c-58ab-94ab-e648f5006a4c", "pubp_event_id": "pubp://event/1667dc25dc93427cb7b100a370bca235", "description": "Following is a transcript of President Obama’s first press prime-press conference, as provided by Federal News Service.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "news_keywords": "Barack Obama,", "pdate": 20090209, "og": {"url": "https://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "type": "article", "title": "Obama’s Prime-Time Press Briefing", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "description": "Following is a transcript of President Obama’s first press prime-press conference, as provided by Federal News Service."}, "twitter": {"url": "https://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "title": "Obama’s Prime-Time Press Briefing", "description": "Following is a transcript of President Obama’s first press prime-press conference, as provided by Federal News Service.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/17dbb9dd-fe9c-58ab-94ab-e648f5006a4c"}}, "site": "@nytimes"}, "CG": "us", "SCG": "politics", "PT": "article", "PST": "Text", "url": "https://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/17dbb9dd-fe9c-58ab-94ab-e648f5006a4c", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2009/02/09/us/politics/09text-obama.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1234108800.0, "source": "http://www.nytimes.com", "summary": ""}