{"url": "https://deadline.com/2017/07/hbo-confirms-cyber-attack-hack-1202139202/", "text": "HBO confirms it has experienced a cyber attack “which resulted in the compromise of proprietary information.”\n\nIn a statement, the premium cabler said, “We immediately began investigating the incident and are working with law enforcement and outside cybersecurity firms. Data protection is a top priority at HBO, and we take seriously our responsibility to protect the data we hold.”\n\nHBO is not commenting on what content might have been stolen, is not naming specific titles or the amount of data accessed in the hack. This morning, HBO chairman and CEO Richard Plepler sent an email to HBO employees alerting them of the breach. You can read it in full below:\n\nDear Colleagues, As most of you have probably heard by now, there has been a cyber incident directed at the company which has resulted in some stolen proprietary information, including some of our programming. Any intrusion of this nature is obviously disruptive, unsettling, and disturbing for all of us. I can assure you that senior leadership and our extraordinary technology team, along with outside experts, are working round the clock to protect our collective interests. The efforts across multiple departments have been nothing short of herculean. It is a textbook example of quintessential HBO teamwork. The problem before us is unfortunately all too familiar in the world we now find ourselves a part of. As has been the case with any challenge we have ever faced, I have absolutely no doubt that we will navigate our way through this successfully. Richard\n\nThis is not the first time HBO has been the victim of a hack. The first four episodes of Game of Thrones‘ fifth season leaked shortly before the linear broadcast premiere in 2015. Netflix and ABC also were attacked. A hacker dubbed The Dark Overlord posted the first episode of Season 5 of Netflix’s Orange is the New Black in April when Netflix refused to pay a ransom. ABC was also targeted by hackers when eight episodes of the unscripted Steve Harvey game show Funderdome were released online early.\n\nHackers claimed to have stolen a digital copy of ABC parent Disney’s Pirates of the Caribbean: Dead Men Tell No Tales and threatened to release bits of it online — in increments — if their demands for an enormous amount of Bitcoin money weren’t met. Disney made clear it would not pay. The FBI investigated and Disney Chairman and CEO Bob Iger said later he believed the threat was a hoax.\n\nThe massive 2014 Sony hack is the most memorable of recent Hollywood cyber attacks, when thousands of emails and confidential information, including pay information for its top executives, were leaked online.\n\nNews of the HBO cyber attack was first reported by EW.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F07%2Fhbo-confirms-cyber-attack-hack-1202139202%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202139202&comment_count=10", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=200"], "top_img": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=200", "keywords": [], "authors": ["Denise Petski"], "canonical_link": "https://deadline.com/2017/07/hbo-confirms-cyber-attack-hack-1202139202/", "title": "HBO Confirms It Was Hit By Cyber Attack", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "HBO confirms it has experienced a cyber attack \"which resulted in the compromise of proprietary information.\"", "news_keywords": "HBO", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "HBO Confirms It Was Hit By Cyber Attack", "url": "https://deadline.com/2017/07/hbo-confirms-cyber-attack-hack-1202139202/", "description": "HBO confirms it has experienced a cyber attack “which resulted in the compromise of proprietary information.” In a statement, the premium cabler said, “We immediately began invest…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=200", "width": 200, "height": 200}, "locale": "en_US"}, "article": {"published_time": "2017-07-31T16:18:49+00:00", "modified_time": "2017-07-31T16:45:22+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "HBO Confirms It Was Hit By Cyber Attack"}, "image": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=240", "card": "summary_large_image", "title": "HBO Confirms It Was Hit By Cyber Attack", "description": "HBO confirms it has experienced a cyber attack \"which resulted in the compromise of proprietary information.\""}, "author": "Denise Petski", "content_type": "Article", "post_id": 1202139202, "title": "HBO Confirms It Was Hit By Cyber Attack", "published_at": "2017-07-31 09:18:49", "comment_count": 10, "tags": "HBO", "topics": "TV", "body": "HBO confirms it has experienced a cyber attack \"which resulted in the compromise of proprietary information.\"\r\n\r\nIn a statement, the premium cabler said, \"We immediately began investigating the incident and are working with law enforcement and outside cybersecurity firms. Data protection is a top priority at HBO, and we take seriously our responsibility to protect the data we hold.\"\r\n\r\nHBO is not commenting on what content might have been stolen, is not naming specific titles or the amount of data accessed in the hack. This morning, HBO chairman and CEO Richard Plepler sent an email to HBO employees alerting them of the breach. You can read it in full below:\r\nDear Colleagues,\r\n\r\nAs most of you have probably heard by now, there has been a cyber incident directed at the company which has resulted in some stolen proprietary information, including some of our programming. Any intrusion of this nature is obviously disruptive, unsettling, and disturbing for all of us.\r\n\r\nI can assure you that senior leadership and our extraordinary technology team, along with outside experts, are working round the clock to protect our collective interests. The efforts across multiple departments have been nothing short of herculean. It is a textbook example of quintessential HBO teamwork. The problem before us is unfortunately all too familiar in the world we now find ourselves a part of.\r\n\r\nAs has been the case with any challenge we have ever faced, I have absolutely no doubt that we will navigate our way through this successfully.\r\n\r\nRichard\r\nThis is not the first time HBO has been the victim of a hack. The first four episodes of Game of Thrones' fifth season leaked shortly before the linear broadcast premiere in 2015.  Netflix and ABC also were attacked. A hacker dubbed The Dark Overlord posted the first episode of Season 5 of Netflix's Orange is the New Black in April when Netflix refused to pay a ransom. ABC was also targeted by hackers when eight episodes of the unscripted Steve Harvey game show Funderdome were released online early.\r\n\r\nHackers claimed to have stolen a digital copy of ABC parent Disney’s Pirates of the Caribbean: Dead Men Tell No Tales and threatened to release bits of it online — in increments — if their demands for an enormous amount of Bitcoin money weren’t met. Disney made clear it would not pay. The FBI investigated and Disney Chairman and CEO Bob Iger said later he believed the threat was a hoax.\r\n\r\nThe massive 2014 Sony hack is the most memorable of recent Hollywood cyber attacks, when thousands of emails and confidential information, including pay information for its top executives, were leaked online.\r\n\r\nNews of the HBO cyber attack was first reported by EW.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1501517929.0, "source": "https://deadline.com", "summary": ""}