{"url": "https://web.archive.org/web/20031212201306/http://en.wikipedia.org:80/wiki/Buffy_the_Vampire_Slayer", "text": "Buffy the Vampire Slayer\n\nFrom Wikipedia, the free encyclopedia.\n\nBuffy the Vampire Slayer is a television series loosely based on the the movie of the same name. It first aired in March 1997 on the Warner Brothers network; after seven seasons, the final episode aired in May 2003 on the United Paramount Network (UPN). The series was created by Joss Whedon and produced by Mutant Enemy Productions. The show's title is often abbreviated simply to Buffy or BtVS.\n\nThe series follows the adventures of a former cheerleader chosen by fate to battle against the forces of evil, usually with the help of her loyal circle of misfit friends.\n\nIn addition to its critical success and cult appeal, the show functions as a contemporary parable, using supernatural elements as metaphors for personal anxieties, particularly those associated with adolescence.\n\nWarning: Wikipedia contains spoilers\n\nThe show's creator, Joss Whedon, has stated that one of his aims was to depart from the usual horror film formula. In a \"traditional\" horror film, a diminutive blonde girl would take a shortcut through a graveyard and either meet an unpleasant end, or be rescued by a handsome well-armed male hero. By casting that ostensibly \"vulnerable\" blonde as his heroine, and then turning that cliché on its head, Buffy presented a fresh paradigm which has been embraced by many as an emblem of female power. In Whedon's narrative, Buffy's male companion Xander is more likely to need rescuing. Buffy is more than capable of looking after herself, though her personal life is as confusing and painful as any teenage girl's. This combination of empowerment and empathy has earned Buffy a passionate following among fans.\n\nThe show is set in the fictional California town of Sunnydale, whose suburban high school rests on the site of a \"Hellmouth\", a gateway between our world and the darker demon realms. The Hellmouth serves as a nexus for a wide variety of evil creatures and foul misdeeds. The most prominent monsters in the Buffy bestiary are vampires, who are presented in the show in a variety of ways, selectively following traditional myths, lore, and literary conventions. Buffy and her companions also fight a wide variety of demons, shape-shifters, ghosts, gods, trolls and zombies, and are so frequently called upon to save the world from global annihilation (usually at least a couple of times a season) that they quickly find themselves, as one character puts it, \"needing to know the plural of apocalypse\". The mythology of the show is often inspired by traditional supernatural sagas and other cultural, fictional, and religious sources. In its seven-year run, the series also developed an extensive contemporary mythology of its own. The supernatural elements of the show almost always have a clear metaphorical or symbolic aspect.\n\nBuffy (played by Sarah Michelle Gellar) is \"The Slayer\", one in a long line of (often short-lived) young girls chosen by fate to battle the forces of darkness. This calling also mystically endows her with dramatically increased physical strength, endurance, agility, intuition, accelerated healing, and a limited degree of clairvoyance, usually in the form of prophetic dreams. Buffy fights under the direction of her \"Watcher\", Giles (Anthony Stewart Head), who begins the series as the high school's librarian. She is also assisted by several friends, who later in the series are nicknamed the \"Scooby Gang\" because of their distant resemblance to the teens in the cartoon Scooby Doo. The group battles demonic forces using a combination of physical combat, detective work, various forms of magic and sorcery, and the extensive research of ancient and mystical texts.\n\nThe show is noteworthy in part for its agile blending of genres, including horror, martial arts, romance, melodrama, farce, and witty comic banter. Unlike the movie, which, for the most part, was poorly received (and practically disowned by its author, Whedon), the TV series achieved great popular and critical success, appreciated equally by middle-aged TV critics and its primarily teen/twentysomething audience. Many attribute the show's success to the smartly written scripts and inspired vision of Whedon. The show and characters inspire an unusually strong emotional connection with fans.\n\nBuffy has also been noted for taking artistic risks in both format and content. The 1999 episode \"Hush\" included 26 minutes without any spoken dialog, and received an Emmy Award nomination for best teleplay. The 2001 episode \"The Body\", which revolved around the death of Buffy's mother, was included in over 100 major critics' Ten Best lists that year. And the late 2001 musical episode \"Once More, with Feeling\" has received many plaudits.\n\nCreator Whedon has noted that it was always his desire to have a gay character on the show. As Buffy's main premise involved characters who were stereotyped as weak outsiders becoming strong and powerful, he initially wanted to have a gay male character. Eventually it was decided that the character of Willow would discover her sapphic destiny (at the very time she was awakening to her Wiccan superpowers), and in season four she began a romantic relationship with the character of Tara. This created some controversy in the media: the producers and the network received criticism, both from those opposed to gay characters on television, and from some pro-gay viewers who felt that the initial physical tepidness of the relationship, as well as the fact that the gay characters were both \"witches\", was reinforcing negative stereotypes. The show's creative team insisted that their intent was not to sensationalize or exploit the gay relationship, and displays of physical affection between the two characters were introduced very slowly, eventually becoming a natural part of the show.\n\nBuffy is credited (alongside the teen drama Dawson's Creek) with playing a key role in the success of the Warner Brothers television network in its early years.\n\nA long-running aspect of the first three seasons was Buffy's perpetually tragic, doomed love for the vampire-with-a-soul, Angel, played by David Boreanaz. Angelus, as he was originally known, had his human soul restored by a gypsy curse, plaguing him with guilt over the two hundred years of murder and mayhem he had inflicted on a slew of innocent victims. The Angel character was so popular that a series featuring him, Angel, was spun off from Buffy; there were occasional \"crossovers\" between the two shows and it is rumored that these will continue even though Buffy is no longer on the air.\n\nAngel and Buffy have both inspired several comic book adaptations, magazines, companion books, novelizations, video games and additional spinoff proposals (including a cartoon series and a BBC drama), as well as countless websites, online discussion groups, and works of fan fiction.\n\nThe show has recently inspired several academic books and essays, including Reading the Vampire Slayer, edited by Roz Kaveney, and Buffy the Vampire Slayer and Philosophy edited by James B. South. Academic courses known as \"Buffy Studies\" are being offered at an increasing number of universities. Fans of both Buffy and Angel often use the term Jossverse to describe the rich universe the shows share.\n\nAs well as these non-televisual offspring, Buffy has exerted a marked influence on TV and film, with shows such as Smallville and Charmed as well as movies such as The Faculty and Bring It On owing something in their verbal and (in the first three instances) thematic style to the show. In addition, many Buffy alumni have gone on to write for or create other shows, some of which bear a striking resemblance to the outer reaches of the Buffyverse. Such Whedonesque endeavors include Tru Calling (Doug Petrie), Wonderfalls (Tim Minear), Still Life (Marti Noxon) and Jake 2.0 (David Greenwalt).\n\nMoreover, 2003 has seen a number of new shows going into production which feature strong girls/young women privy to some supernatural power or destiny that they are forced to come to terms with while trying to maintain a normal life. These \"post-Buffy\" shows include the aforementioned Tru Calling and Wonderfalls, as well as Dead Like Me and Joan of Arcadia. In the words of Bryan Fuller, the creator of Dead Like Me and Wonderfalls:\n\n[Buffy] really turned a corner for series storytelling. It showed that young women could be in situations that were both fantastic and relatable, and instead of shunting women off to the side, it put them at the center.\n\nSee also: Buffy the Vampire Slayer plot summary, List of Buffy the Vampire Slayer episodes", "images": ["https://web.archive.org/web/20031212201306im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20031212201306im_/http://en.wikipedia.org/upload/wiki.png"], "top_img": "https://web.archive.org/web/20031212201306im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Buffy the Vampire Slayer", "meta_data": {"robots": "index,follow"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}