{"url": "https://www.digitalspy.com/tv/ustv/a858931/unbreakable-kimmy-schmidt-season-4-ending-spoilers-jon-bernthal/", "text": "Warning: Contains spoilers for Unbreakable Kimmy Schmidt season four.\n\nUnbreakable Kimmy Schmidt fans were already thinking that six new episodes just weren't enough before the excellent first half of season four only went and ended on a cliffhanger, leaving everyone desperate for more.\n\nThe final season has been split in two as a result of Tina Fey launching her Tony-nominated Mean Girls musical and we'll have to wait until January 25, 2019 for the final episodes, meaning that's eight whole months of speculating about just what \"Phase Two\" is.\n\nTo recap, episode six 'Kimmy Meets an Old Friend!' ends with Kimmy (Ellie Kemper), Titus (Tituss Burgess), Lillian (Carol Kane) and Jacqueline (Jane Krakowski) watched by a mysterious foreign man who calls someone to say: \"I have eyes on the target. Moving to Phase Two.\"\n\nNetflix\n\nThat mysterious man is voiced by none other than The Punisher himself, Jon Bernthal, so while we're not entirely ruling out a surprise Marvel crossover (after all, the show does exist in the same world as Orange Is the New Black), it's likely that we haven't come across this character before and the initial assumption is that the target must be Kimmy.\n\nDuring the first half of season four, Kimmy comes across a true-crime documentary Party Monster: Scratching the Surface. What follows is a pitch-perfect spoof of the likes of Making a Murderer as DJ Fingablast investigates where his idol DJ Slizzard has gone, with it turning out that DJ Slizzard is actually the man who imprisoned Kimmy, the Reverend Richard Wayne Gary Wayne (Jon Hamm).\n\nEric Liebowitz Netflix\n\nThe spoof sees Unbreakable Kimmy Schmidt tackle toxic masculinity in brilliant fashion as DJ Fingablast's investigation leads him to the Innocence Broject, led by men's rights activist Fran Dodd (Bobby Moynihan), and his attempts to free Reverend Wayne along with other men persecuted by the world – such as Lord Voldemort.\n\nSo it would make sense that the mysterious man's target is Kimmy, potentially trying to find evidence that the whole bunker was a lie, especially after the documentary included the season three revelation that Kimmy is still married to the Reverend.\n\nHowever, we have a feeling that the mysterious man's target is actually Titus.\n\nEric Liebowitz Netflix\n\nLast season, Titus was involved in a sexual harassment storyline as he went to audition for Sesame Street and was propositioned by Lonny Dufrene (Bill Barretta) or, more specifically, his puppet Mr Frumpus.\n\nThis incident was again referenced in the first episode of season four as Kimmy found herself accused of sexual harassment at her new job, leading to Titus reflecting on his experience: \"I know you're just a sweet girl who don't know how to act, but every time you walked into that office, you made those nerds feel scared and powerless, like Britney Spears in Crossroads.\"\n\nThe episode ends with someone shaking hands with a puppet (likely Mr Frumpus) over a briefcase of cash and they are told: \"Consider it done\". It's unlikely to be a coincidence, so it could be that the exchange was so that someone could hire Bernthal's mystery character to find Titus (Phase One).\n\nNetflix\n\nTo what end, we don't know yet, but co-showrunner Robert Carlock has promised that the second half of season four will explain the \"creepy mystery things\" in the cliffhanger, but wouldn't comment if the mysterious man is looking for Kimmy or Titus.\n\n\"But it's all of a piece of larger arcs and stuff we've been talking about thematically within this season,\" he added. \"The series is all of a piece in our minds. We have stuff that we're setting up in let's call it season four A, whatever you want to call it, with Titus' job and Titus' love life… and the larger arc of Kimmy finding her way and finding herself.\"\n\nBut just in case we're wrong and the mysterious man is spying on Kimmy, we're going back to Party Monster to scour it for clues.\n\nUnbreakable Kimmy Schmidt is available to watch now on Netflix.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "keywords": [], "authors": ["Ian Sandwell"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a858931/unbreakable-kimmy-schmidt-season-4-ending-spoilers-jon-bernthal/", "title": "What Unbreakable Kimmy Schmidt's season 4 cliffhanger means for the final episodes", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "What Unbreakable Kimmy Schmidt's s4 cliffhanger means", "description": "Just what is *that Marvel star* up to?", "url": "http://www.digitalspy.com/tv/ustv/a858931/unbreakable-kimmy-schmidt-season-4-ending-spoilers-jon-bernthal/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-11-28 12:57:42", "published_time": "2018-06-07 11:04:00", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=1xw:0.75xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "What Unbreakable Kimmy Schmidt's season 4 cliffhanger means for the final episodes", "description": "Unbreakable Kimmy Schmidt's first half of season 4 ended on a major cliffhanger, so here's what it could mean for the final episodes.", "keywords": "unbreakable kimmy schmidt, unbreakable kimmy schmidt season 4 cast, unbreakable kimmy schmidt season 4, unbreakable kimmy schmidt jon bernthal, who is playing mysterious man in unbreakable kimmy schmidt, unbreakable kimmy schmidt season 4 release date, jon bernthal, unbreakable kimmy schmidt season 4 spoilers, unbreakable kimmy schmidt season 4 theories", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=0.6666666666666666xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Carol Kane,Jane Krakowski,Tituss Burgess,Ellie Kemper,Jon Bernthal,Netflix", "sailthru.date": "2018-06-07T11:04:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=1xw:0.75xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/23/1528357874-uks-401-unit-00323r2.jpg?crop=0.6666666666666666xw:1xh;center,top", "sailthru.socialtitle": "What Unbreakable Kimmy Schmidt's s4 cliffhanger means", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1528340640.0, "source": "https://www.digitalspy.com", "summary": ""}