{"url": "https://web.archive.org/web/20090924105940/http://www.rollcall.com:80/features/Health-Care_Policy-Briefing/health_care/38655-1.html", "text": "Rockefeller: An Opportunity We Can\u0092t Pass Up\n\nEarlier this month, the president outlined a clear vision for health care reform \u0097 a plan that will put families ahead of corporate profits, reduce skyrocketing health care costs and provide a strong pathway for more Americans to access meaningful and affordable care. With Congress back in session and back to work on health care reform, we must continue to build on the president\u0092s vision and capitalize on this profound opportunity to fix a broken system and make life better for millions of Americans.\n\nToday, it is an undeniable fact that millions of families carry the burden of failed health care policies and unmet promises. Too many feel as if they are walking a tightrope \u0097 just one serious illness threatens to throw them off balance and send them tumbling down.\n\nReal protection for the American people means health coverage must be accountable \u0097 the insurance that you buy today must be there when you need it tomorrow. Too many families who have paid their premiums faithfully every month for years expecting to be covered suddenly find themselves stuck with devastatingly high bills when they get sick; their plans don\u0092t actually provide coverage when they need it. It makes you wonder what the purpose of that health insurance is in the first place, if it offers no protection against the ruin that they hoped to avoid.\n\nAs chairman of the Senate Finance Subcommittee on Health Care, I believe we must continue to make tougher insurance regulation and greater transparency a top priority, and I will fight to protect families and businesses across the nation.\n\nThe Finance Committee has laid out its framework, but at this point it simply does not go far enough to protect Americans from devastating insurance practices or outright loss of coverage.\n\nMany Americans \u0097 46 percent \u0097 get their health coverage through large employers in the self-insured market. Any new insurance market reforms, such as a prohibition on rescissions and benefit caps, should apply to this market as well. Otherwise, we will be doing very little to improve the coverage of a significant number of Americans.\n\nIn West Virginia, the example of a local garment company, Corbin Limited, is a sad reminder of the self-insured market\u0092s risks. When Corbin declared bankruptcy in April 2003, 444 former employees were left with $2 million in medical bills. With a self-funded plan, Corbin was subject only to the Department of Labor\u0092s inadequate regulation and had no licensing requirements or solvency standards. When the company went under, its employees had no means of appeal.\n\nComprehensive health insurance reforms like prohibiting rescissions, eliminating pre-existing condition exclusions and protecting employees in case of bankruptcy must apply to all insurers and policies in every single market \u0097 including the self-insured.\n\nIn the Senate Commerce, Science and Transportation Committee, we recently heard testimony by Wendell Potter, who worked in the insurance industry for more than 20 years. He explained very clearly the tactics insurance companies use to keep policyholders in the dark. He said they deceive consumers with incomprehensible explanations of their benefits, often leading people to simply ignore them or throw them away.\n\nHe also said that more and more consumers are falling victim to deceptive marketing practices \u0097 which essentially encourage them to buy policies with high costs and limited benefits.\n\nConsumers can\u0092t make real choices because the insurance industry doesn\u0092t use standard terms or definitions. And consumers can\u0092t challenge insurance companies\u0092 decisions because the companies don\u0092t explain the terms of coverage in clear, understandable language. When insurance companies fail to meet their obligations to these people, it literally becomes a matter of life and death.\n\nThat\u0092s why since March, I\u0092ve been holding a series of hearings in the Commerce panel to get to the bottom of these misleading practices and demanding explanations from companies like CIGNA. And it\u0092s why I wholeheartedly believe that holding insurance companies \u0097 including self-insured plans \u0097 accountable for their actions has to be at the heart of any true health care reform.\n\nInsurance companies have seen their profits soar by more than 400 percent since 2001, while premiums for consumers have doubled. Right now, the insurance industry is profit-driven when it should be patient-driven.\n\nThey\u0092re unfairly raising prices, cutting people out of coverage for pre-existing conditions and, as one report I released through the committee revealed, systematically overcharging consumers who choose to see doctors outside of their networks.\n\nTo fight back, I have introduced the Consumers Health Care Act. In addition to creating a strong public insurance option that would put competitive pressure on insurance companies and help drive down costs, my legislation also creates America\u0092s Health Insurance Trust \u0097 created for consumers and run by consumers.\n\nThe president\u0092s speech marked the first time the public option has been clearly explained to the American people. He reopened the door to a serious discussion about a public insurance option \u0097 and the time to have that discussion is now.\n\nOur goal is comprehensive reform and that takes work, long hours, some disagreement, a lot of coming together and a deep commitment to bringing families real solutions once and for all. I share the president\u0092s confidence and resolve that we will succeed.\n\nSen. Jay Rockefeller (D-W.Va.) is chairman of the Senate Commerce, Science and Transportation Committee and the Senate Finance Subcommittee on Health Care.", "images": ["https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/rightnav_video.jpg", "https://web.archive.org/web/20090924105940im_/http://ad.doubleclick.net/ad/rollcall/premium;abr=!ie;sz=336x280;pos=top;tile=4;ord=16762139;;category=health_care", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/ip_mini_logo.png", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/rcsports_box.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/icon_email.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/branding-logo-small.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/rss2.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/ellistease.jpg", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/icon_text_down.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/delaurotease.jpg", "https://web.archive.org/web/20090924105940im_/http://ad.doubleclick.net/ad/rollcall/sponsorship_tools;abr=!ie;sz=100x75;tile=1;ord=16762139;;category=health_care", "https://web.archive.org/web/20090924105940im_/http://ad.doubleclick.net/ad/rollcall/premium_two;abr=!ie;sz=336x280;pos=bottom;tile=5;ord=16762139;;category=health_care", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/branding-logo-footer.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/TEASER-72hrs.jpg", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/icon_print.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/TEASER-hstreet.jpg", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/TEASER-092309-ISSUE.jpg", "https://web.archive.org/web/20090924105940im_/http://ad.doubleclick.net/ad/rollcall/leaderboard_two;abr=!ie;sz=728x90;pos=bottom;tile=6;ord=16762139;;category=health_care", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/icon_reprints.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/TEASER-basketball.jpg", "https://web.archive.org/web/20090924105940im_/http://www.rollcall.com/favicon.ico", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/saunderstease.jpg", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/TEASER-Speaker-Pelosi.jpg", "https://web.archive.org/web/20090924105940im_/http://ad.doubleclick.net/ad/rollcall/leaderboard;abr=!ie;sz=728x90;pos=top;tile=1;ord=16762139;;category=health_care", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/rockfellertease.jpg", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/ui/icon_text_up.gif", "https://web.archive.org/web/20090924105940im_/http://cdn.rollcall.com/media/newspics/bouslimantease.jpg", "https://web.archive.org/web/20090924105940im_/http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-bpaww&cg=0&cc=1"], "top_img": "https://web.archive.org/web/20090924105940im_/http://www.rollcall.com/favicon.ico", "keywords": [], "authors": ["Sen. Jay Rockefeller"], "canonical_link": "", "title": "Rockefeller: An Opportunity We Can\u0092t Pass Up", "meta_data": {"description": "Earlier this month, the president outlined a clear vision for health care reform -- a plan that will put families ahead of corporate profits, reduce skyrocketing health care costs and provide a strong pathway for more Americans to access meaningful and affordable care. With Congress back in session and back to work on health care reform, we must continue to build on the president s vision and capitalize on this profound opportunity to fix a broken system and make life better for millions of Americans.", "keywords": "Congress, Politics, Government, House of Representatives, Senate, Elections, Legislation, Campaigns, Democrat, Republican, Policy, Lobbying, News, Capitol Hill, Opinion, Committees, White House, Polls, Consultants, Beltway, congress, politics, government, house of representatives, senate, elections, legislation, campaigns, democrat, republican, policy, lobbying, news, capitol hill, opinion, committees, white house, polls, consultants, beltway"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}