{"url": "https://www.rollingstone.com/music/music-news/kelly-clarkson-i-lost-millions-for-dropping-co-writing-credit-with-dr-luke-201453/", "text": "Kelly Clarkson said she chose to forgo “hundreds of thousands of dollars,” if not “millions,” nearly a decade ago when she refused to share a co-writing credit with producer Dr. Luke for her 2009 hit, “My Life Would Suck Without You.”\n\nThe American Idol alum, who has spoken out against Dr. Luke (nee Lukasz Sebastian Gottwald) in the past, made the revelation during a recent interview with Z100.\n\n“I was making a point to the people working with me, going, ‘This is how much I don’t want to do this,'” she said. “I don’t care about the money. I don’t care about, oh, ‘You’re going to be the most famous person ever if you do this.’ That’s not what holds weight in my life.”\n\nClarkson clarified that while Dr. Luke did indeed pen the track, she made substantial changes to the song, and rightfully should have been given co-writing credit.\n\n“There’s a lot of times in my career where you don’t see my name on the song and that’s because sometimes I don’t write them,” she said. “A lot of times I do change the song in a way that probably you should ask for credit, but I don’t because the song was already great – I just made it more me. I think a lot of artists steal credit a lot from writers, which I think is super crappy because that’s their livelihood.”\n\nBut, “if I deserve it, I usually ask,” she continued. “And I did deserve it on [‘My Life Would Suck Without You’] just because I changed it a bit.” Clarkson also recalled how the topic was first broached, and how she vehemently refused to be associated with him.\n\n“They brought up writing credit at the end,” she went on. “They were like, ‘Well, you changed the song.’ And I was like, ‘I don’t want my name near his. I want to pretend this didn’t happen in my life and I want to forget it.'”\n\nLast year, Clarkson spoke out against Dr. Luke and in defense of Kesha, offering up her own take on the embattled music producer.\n\n“A lot of artists that have worked with him don’t work with him anymore for pretty good, solid reasons,” she said during an interview with Australia’s KIIS FM The Kyle & Jackie O Show. “He’s not a good person to me. We’ve clashed. I can’t really say anything other than that.”\n\nA rep for Gottwald did not immediately reply to Rolling Stone’s request for comment.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/kelly-clarkson-lost-millions-307a03bf-cf0c-4a5a-875c-f1929e75ac88.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fkelly-clarkson-i-lost-millions-for-dropping-co-writing-credit-with-dr-luke-201453%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=201453", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/kelly-clarkson-lost-millions-307a03bf-cf0c-4a5a-875c-f1929e75ac88.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/kelly-clarkson-i-lost-millions-for-dropping-co-writing-credit-with-dr-luke-201453/", "title": "Kelly Clarkson: I Lost 'Millions' Over Dr. Luke Disagreement", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Kelly Clarkson says she wanted to make \"a point to the people working with me\" by declining co-writing credit on \"My Life Would Suck Without You\".", "news_keywords": "Kelly Clarkson", "og": {"type": "article", "title": "Kelly Clarkson Lost 'Millions' for Dropping Dr. Luke Co-Writing Credit", "url": "https://www.rollingstone.com/music/music-news/kelly-clarkson-i-lost-millions-for-dropping-co-writing-credit-with-dr-luke-201453/", "description": "Singer says she wanted to make “a point to the people working with me” by declining co-writing credit on 2009 single “My Life Would Suck Without You”", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/kelly-clarkson-lost-millions-307a03bf-cf0c-4a5a-875c-f1929e75ac88.jpg", "width": 1024, "height": 764, "alt": "kelly clarkson refused share writing credit"}, "locale": "en_US"}, "article": {"published_time": "2017-09-14T17:06:24+00:00", "modified_time": "2018-06-25T16:10:53+00:00"}, "twitter": {"text": {"title": "Kelly Clarkson: I Lost 'Millions' for Dropping Co-Writing Credit With Dr. Luke"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/kelly-clarkson-lost-millions-307a03bf-cf0c-4a5a-875c-f1929e75ac88.jpg?w=1024", "alt": "kelly clarkson refused share writing credit"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Kelly Clarkson: I Lost ‘Millions’ for Dropping Co-Writing Credit With Dr. Luke", "description": "Kelly Clarkson says she wanted to make \"a point to the people working with me\" by declining co-writing credit on \"My Life Would Suck Without You\"."}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 201453, "title": "Kelly Clarkson: I Lost 'Millions' for Dropping Co-Writing Credit With Dr. Luke", "published_at": "2017-09-14 17:06:24", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/kelly-clarkson-lost-millions-307a03bf-cf0c-4a5a-875c-f1929e75ac88.jpg?w=1024", "comment_count": 0, "tags": "Kelly Clarkson", "topics": "Music News", "body": "Kelly Clarkson said she chose to forgo \"hundreds of thousands of dollars,\" if not \"millions,\" nearly a decade ago when she refused to share a co-writing credit with producer Dr. Luke for her 2009 hit, \"My Life Would Suck Without You.\"The American Idol alum, who has spoken out against Dr. Luke (nee Lukasz Sebastian Gottwald) in the past, made the revelation during a recent interview with Z100.\"I was making a point to the people working with me, going, 'This is how much I don't want to do this,'\" she said. \"I don't care about the money. I don't care about, oh, 'You're going to be the most famous person ever if you do this.' That's not what holds weight in my life.\"Clarkson clarified that while Dr. Luke did indeed pen the track, she made substantial changes to the song, and rightfully should have been given co-writing credit.\"There's a lot of times in my career where you don't see my name on the song and that's because sometimes I don't write them,\" she said. \"A lot of times I do change the song in a way that probably you should ask for credit, but I don't because the song was already great – I just made it more me. I think a lot of artists steal credit a lot from writers, which I think is super crappy because that's their livelihood.\"But, \"if I deserve it, I usually ask,\" she continued. \"And I did deserve it on ['My Life Would Suck Without You'] just because I changed it a bit.\" Clarkson also recalled how the topic was first broached, and how she vehemently refused to be associated with him.\"They brought up writing credit at the end,\" she went on. \"They were like, 'Well, you changed the song.' And I was like, 'I don't want my name near his. I want to pretend this didn't happen in my life and I want to forget it.'\"Last year, Clarkson spoke out against Dr. Luke and in defense of Kesha, offering up her own take on the embattled music producer.\"A lot of artists that have worked with him don't work with him anymore for pretty good, solid reasons,\" she said during an interview with Australia's KIIS FM The Kyle & Jackie O Show. \"He's not a good person to me. We've clashed. I can't really say anything other than that.\"A rep for Gottwald did not immediately reply to Rolling Stone's request for comment.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1505408784.0, "source": "https://www.rollingstone.com", "summary": ""}