{"url": "https://popculture.com/movies/2018/06/12/unforgettable-legally-blonde-quotes-honor-third-film/", "text": "The countdown is on for Legally Blonde 3, set to premiere in theaters on Valentine's Day 2020 and bring Elle Woods back into our lives for another adventure. Reese Witherspoon has had many memorable roles in her career, but none compare to the iconic, fierce and incredibly groundbreaking Harvard student, who broke stereotypes and won a huge tour cast in her first year of law school. In honor of the official production of next chapter in the Legally Blonde franchise, we rounded up some of the best lines from queen Elle Woods' through the years. Scroll through to read some of the 2001 film's most memorable quotes.\n\nSlide 1 of 9 Getting into Harvard (Photo: Facebook/Legally Blonde) After getting broken up with by boyfriend Warner, Elle applied to the prestigious law school and worked hard to prove she was just as smart despite her blonde locks. After he is surprised to see her on campus, she serves the best response to him refusing to believe she got accepted. \"What, like it's hard?\"\n\nSlide 2 of 9 Starting a movement (Photo: Facebook/Legally Blonde) We will never forget when Elle taught Paulette about the \"Bend and Snap,\" which people are still quoting, and practicing in their regular lives so many years later... thankfully with not too many broken noses.\n\nSlide 3 of 9 Fashion statements (Photo: Facebook/Legally Blonde) \"Whoever said orange is the new pink was seriously disturbed.\" A quote still relevant nowadays.\n\nSlide 4 of 9 A Flawless Defense (Photo: Facebook/Legally Blonde) It took her some time to get her groove in the courtroom, but Elle knew immediately Brooke Taylor-Windham was innocent because of her work as a fitness guru. \"Exercise gives you endorphins. Endorphins make you happy. Happy people just don't shoot their husbands, they just don't.\"\n\nSlide 5 of 9 The Perfect Comeback (Photo: Facebook/Legally Blonde) We all hated Vivian Kensington after she tried to bully Elle by finally inviting her to a college party, only to lie to her and saying it was a costume party. Rather than feeling humiliated after being the only one dressed up, Elle kept her head held high and served up one of the greatest comebacks in history. \"Oh, I like your outfit too, except when I dress up as a frigid b—, I try not to look so constipated.\" It took Vivian a few weeks to recover, off camera of course.\n\nSlide 6 of 9 Who doesn't quote this? (Photo: Facebook/Legally Blonde) After she is shocked by Warner introducing her to his new fiancee Vivian, and showing off her giant engagement ring, Elle served up another great one-liner that has become a staple phrase in the English language. \"Uh. I'm sorry. I just hallucinated.\"\n\nSlide 7 of 9 Iconic Ice Breaker (Photo: Facebook/Legally Blonde) You wish your intro during your college orientation ice-breaker was this legendary. \"Hi. I'm Elle Woods and this is Bruise Woods. We're both Gemini vegetarians.\"\n\nSlide 8 of 9 Bye Bye Warner (Photo: Facebook/Legally Blonde) After Elle shocks everyone by winning the court case, Warner comes crawling back to her side, but knowing she deserves better (Hi, Luke Wilson) than someone who left her behind, she rejects him by using his own words agains't him, but better. \"If I'm going to be a partner in a law firm by the time I'm 30, I'm going to need a boyfriend who's not such a bonehead.\"", "images": ["https://media.popculture.com/2018/06/legally-blonde-6-20037489.jpeg", "https://media.popculture.com/2018/06/legally-blonde-8-20037491.jpeg", "https://media.popculture.com/2018/06/legally-blonde-4-20037487.jpeg", "https://media.popculture.com/2018/06/legally-blonde-3-20037486.jpeg", "https://media.popculture.com/2018/06/legally-blonde-7-20037490.jpeg", "https://media.popculture.com/2017/05/default-1.png", "https://media.popculture.com/2018/06/legally-blonde-5-20037488.jpeg", "https://media.popculture.com/2018/06/legally-blonde-20037484.jpeg", "https://media.popculture.com/2018/06/legally-blonde-2-20037485.jpeg", "https://media.popculture.com/2017/05/legally-blonde-mgm-2001-fb-20001592.jpg"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/movies/2018/06/12/unforgettable-legally-blonde-quotes-honor-third-film/", "title": "9 Unforgettable 'Legally Blonde' Quotes in Honor of Third Film", "meta_data": {"description": "The countdown is on for Legally Blonde 3, set to premiere in theaters on Valentine's Day 2020 and bring Elle Woods back into our lives for another adventure.Reese Witherspoon has had many memorable roles in her career, but none compare to the iconic, fierce and incredibly groundbreaking Harvard [...]", "keywords": "MGM,Reese Witherspoon", "news_keywords": "MGM,Reese Witherspoon", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "9 Unforgettable 'Legally Blonde' Quotes in Honor of Third Film", "description": "The countdown is on for Legally Blonde 3, set to premiere in theaters on Valentine's Day 2020 and [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "9 Unforgettable 'Legally Blonde' Quotes in Honor of Third Film", "type": "article", "url": "https://popculture.com/movies/2018/06/12/unforgettable-legally-blonde-quotes-honor-third-film/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Movies", "description": "The countdown is on for Legally Blonde 3, set to premiere in theaters on Valentine's Day 2020 and [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1528732800.0, "source": "https://popculture.com", "summary": ""}