{"url": "https://www.nme.com/blogs/nme-blogs/taylor-swift-groping-trial-background-lawsuit-2122259", "text": "A civil court case involving Taylor Swift has just concluded in Denver, Colorado. The disagreement was between the 27-year-old singer and a 55-year-old former radio DJ called David Mueller, whom Swift says groped her at a concert in 2013; he lost his job as a result of the allegation, which he denied throughout the trial.\n\nOn Monday, August 14, the trial’s eight-person jury unanimously found Mueller guilty of assault and battery. Here’s everything you need to know about the lawsuit and how Swift’s case was won.\n\nWhen did the incident happen?\n\nOn June 2, 2013, when Swift was 23, she was carrying out a meet-and-greet with fans at her show in Denver, Colorado. Mueller, then 51, was a radio show host on Colorado station KYGO, and he posed with Swift for a photo alongside his then-girlfriend, Shannon Melcher. Swift says that as the three of them posed for a photo, Mueller reached under her dress and “latched on” to her “ass cheek”. She told her security team, who removed Mueller from the gig. She also told her mother and her management, who passed the photo on to the radio station employing Mueller. They did not inform the police.\n\nAdvertisement\n\nMueller was fired two days later, on June 4, 2013. The photo has since been leaked to TMZ.\n\nWhat happened next?\n\nMueller sued Swift, her mother, and her radio liaison Frank Bell in September 2015, claiming the accusations were false, and that they had wrongfully resulted in him losing his job. He claimed that a colleague, Eddie Haskell, was the one who had touched Swift’s bottom.\n\nSwift countersued Mueller in October 2015 for assault and battery. Her countersuit read: “Mueller’s newfound claim that he is the ‘wrong guy’ and, therefore, his termination from KYGO was unjustified, is specious. Ms Swift knows exactly who committed the assault, it was Mueller – and she is not confused in the slightest about whether her long-term business acquaintance, Mr. Haskell, was the culprit.”\n\nIn August 2016 Mueller tried to have Swift’s counter-suit thrown out of court. He failed, and in October 2016 Swift provided a pre-trial deposition, saying: “Right as the moment came for us to pose for the photo, he took his hand and put it up my dress and grabbed onto my ass cheek and no matter how much I scooted over it was still there. It was completely intentional, I’ve never been so sure of anything in my life.”\n\nWhat did the lawyers say as the trial began?\n\nThe Denver Post‘s Danika Worthington reported from the trial room that the jury consisted of eight people ranging from their 30s to “elderly women”. Six were women, two were men.\n\nMueller’s lawyer told the jury that sexual assault and falsely accusing someone of sexual assault are both “not tolerable”. He said the case was to determine if Mueller had touched Swift’s bottom and whether he was fired because of what Swift’s team told KYGO. He attacked Swift’s accounts and said someone else had committed the assault.\n\nAdvertisement\n\nSwift’s lawyer said the case was about “whether a woman can safely tell her employer that she was sexually assaulted”, adding that Mueller had changed his story a total of seven times, had lost evidence, and was motivated by “money, attention and revenge.”\n\nWhat were Swift and Mueller seeking in the trial?\n\nMueller was seeking $3m in damages after losing his $150,000 salary. His case was against Taylor Swift, Andrea Swift and Frank Bell.\n\nIn her countersuit, Swift was seeking just $1 (77p), using the trial “an example to other women who may resist publicly reliving similar outrageous and humiliating acts.” Newsweek reported that Swift was planning to donate “any financial reward from the trial to charities supporting survivors of sexual assault and gender-based violence.”\n\nWhat testimonies were made?\n\nOn August 8, David Mueller testified, saying his meeting with Swift was “weird and awkward.” He said: “I know my hand was touching her rib or her skirt and it went behind her. And her hand – or arm – went behind my arm.” When asked if he had grabbed Swift’s bottom he said: “No, I did not.” He ended his testimony saying: “I’m here to prove that I’m innocent. I had a good reputation in radio and I would like to get it back.”\n\ntestified, saying his meeting with Swift was “weird and awkward.” He said: “I know my hand was touching her rib or her skirt and it went behind her. And her hand – or arm – went behind my arm.” When asked if he had grabbed Swift’s bottom he said: “No, I did not.” He ended his testimony saying: “I’m here to prove that I’m innocent. I had a good reputation in radio and I would like to get it back.” On August 9, Taylor Swift’s mother Andrea Swift testified, saying “I went to the dressing room and I saw her face. I could see that there was something horribly wrong. She said: ‘Mom, a guy just grabbed my ass.’ I wanted to vomit and cry at the same time… she was really shaken. She was humiliated.” She added: “He sexually assaulted my daughter,” pointing at Mueller and saying: “Right there, that guy.”\n\ntestified, saying “I went to the dressing room and I saw her face. I could see that there was something horribly wrong. She said: ‘Mom, a guy just grabbed my ass.’ I wanted to vomit and cry at the same time… she was really shaken. She was humiliated.” She added: “He sexually assaulted my daughter,” pointing at Mueller and saying: “Right there, that guy.” The same day, Swift’s radio liaison Frank Bell said he had sought “appropriate action” when he told Mueller’s employers about the incident.\n\nsaid he had sought “appropriate action” when he told Mueller’s employers about the incident. On August 10, Taylor Swift testified against Mueller, saying it was “a definite grab. A very long grab. It was intentional… He stayed latched onto my bare ass cheek. I felt him grab onto my ass cheek under my skirt. He grabbed my ass underneath my skirt.” She went on, “He stayed latched onto my bare ass cheek as I lurched away from him. [His hand] didn’t let go. It was a very shocking thing. I had never dealt with something like this before.”\n\ntestified against Mueller, saying it was “a definite grab. A very long grab. It was intentional… He stayed latched onto my bare ass cheek. I felt him grab onto my ass cheek under my skirt. He grabbed my ass underneath my skirt.” She went on, “He stayed latched onto my bare ass cheek as I lurched away from him. [His hand] didn’t let go. It was a very shocking thing. I had never dealt with something like this before.” When Mueller’s lawyer Gabe McFarland said there was no sign of her skirt being lifted, Swift replied: “Because my ass is located in the back of my body.” McFarland also said that no one had actually seen contact made between Mueller’s hand and Swift’s rear, to which Swift responded: “The only person who would have a direct eye line is someone laying underneath my skirt, and we didn’t have anyone positioned there.” Asked if she thought Mueller had got what he deserved, she said: “I don’t feel anything about Mr. Mueller. I don’t know him.”\n\nThe meet-and-greet photographer Stephanie Simbeck also testified on Thursday, saying “I saw her [Swift] fall into the female [Shannon Melcher], and she had a shocked look, and I saw his [Mueller’s] hand grab her ass.” Simbeck said she didn’t know whether Mueller’s hand was inside or outside Swift’s skirt, but said that she could see Mueller inappropriately grabbing Swift from her position about five feet away.\n\nalso testified on Thursday, saying “I saw her [Swift] fall into the female [Shannon Melcher], and she had a shocked look, and I saw his [Mueller’s] hand grab her ass.” Simbeck said she didn’t know whether Mueller’s hand was inside or outside Swift’s skirt, but said that she could see Mueller inappropriately grabbing Swift from her position about five feet away. On Friday, August 11, Swift’s former bodyguard Greg Dent said: “I saw his hand under her skirt … Her skirt went up … She jumped.” Speaking about Mueller, he added: “I was definitely sure that he had been drinking, I don’t know what level. He wasn’t staggering or falling down.” The bodyguard said he had not intervened because he “took his cues” from Swift, who said she had continued with the meet-and-greet in order not to disappoint the queue of fans waiting for her.\n\nsaid: “I saw his hand under her skirt … Her skirt went up … She jumped.” Speaking about Mueller, he added: “I was definitely sure that he had been drinking, I don’t know what level. He wasn’t staggering or falling down.” The bodyguard said he had not intervened because he “took his cues” from Swift, who said she had continued with the meet-and-greet in order not to disappoint the queue of fans waiting for her. Mueller’s former KYGO co-host Ryan Kliesch testified on Friday that he had never seen Mueller “disrespect, demean, condescend or act inappropriately toward women.”\n\ntestified on Friday that he had never seen Mueller “disrespect, demean, condescend or act inappropriately toward women.” On the same day, Mueller’s ex-girlfriend Shannon Melcher, who appears in the photo with Mueller and Swift, testified that she had not seen Mueller touching Swift inappropriately, but added: “I don’t have eyes in the back of my head.” She said: “We took the photo quickly,” explaining that Mueller wasn’t very close when they were about to take the photo and saying: “he had to dive into the photo.” Melcher also said that she hadn’t noticed Swift “lurch” away from Mueller.\n\nWhat happened next?\n\nThe judge threw out Mueller’s case against Swift on Friday, leaving Mueller’s cases against Frank Bell and Andrea Swift for the jury to decide on.\n\nOn Monday, August 14, the jury unanimously agreed that Mueller had inappropriately touched Swift.\n\nSwift then released a statement saying: “I want to thank Judge William J Martinez and the jury for their careful consideration, my attorneys Doug Baldridge, Danielle Foley, Jay Schaudies and Katie Wright for fighting for me and anyone who feels silenced by a sexual assault, and especially anyone who offered their support throughout this four-year ordeal and two-year long trial process.\n\n“I acknowledge the privilege that I benefit from in life, in society and in my ability to shoulder the enormous cost of defending myself in a trial like this. My hope is to help those whose voices should also be heard. Therefore, I will be making donations in the near future to multiple organisations that help sexual assault victims defend themselves.”", "images": ["https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044.jpg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg", "https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044-696x442.jpg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044.jpg", "keywords": [], "authors": ["Larry Bartleet"], "canonical_link": "https://www.nme.com/blogs/nme-blogs/taylor-swift-groping-trial-background-lawsuit-2122259", "title": "Taylor Swift groping trial: everything you need to know about the case", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Taylor Swift and David Mueller are going through a civil trial with a jury to settle a long-running case about groping that began in 2013", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "Taylor Swift groping trial: everything you need to know about the case", "description": "Taylor Swift and David Mueller are going through a civil trial with a jury to settle a long-running case about groping that began in 2013", "url": "https://www.nme.com/blogs/nme-blogs/taylor-swift-groping-trial-background-lawsuit-2122259", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044.jpg", "width": 1000, "height": 635}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "section": "NME Blogs", "published_time": "2017-08-15T11:00:13+00:00"}, "twitter": {"card": "summary_large_image", "description": "Taylor Swift and David Mueller are going through a civil trial with a jury to settle a long-running case about groping that began in 2013", "title": "Taylor Swift groping trial: everything you need to know about the case", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2017/08/GettyImages-527338044.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1502794813.0, "source": "https://www.nme.com", "summary": ""}