{"url": "www.inquisitr.com/2145552/britney-spears-planning-secret-wedding/", "text": "Is Britney Spears planning a secret Las Vegas wedding?\n\nAccording to Life & Style magazine, the 33-year-old singer is doing just that with her boyfriend of eight months, Charlie Ebersol.\n\nAn inside source allegedly opened up to the magazine about Britney Spears’ relationship status and wedding plans.\n\n“They talk about getting married all the time. Britney has never been happier than she is now with Charlie! [Britney] wants something simple but memorable, nothing too over-the-top.”\n\nThe insider further claimed that Britney Spears and Charlie Ebersol were “mulling another quickie Las Vegas wedding,” a decision that the “Pieces of Me” singer made back in 2004 when she married Jason Alexander. However, Gossip Cop reported on Thursday that the rumored reports about Britney Spears’ secret wedding are not true.\n\n“Don’t go buying a gift just yet. There is NO wedding in the works.”\n\nBritney Spears NOT “Planning Wedding” To Charlie Ebersol, Despite Report (Exclusive) http://t.co/fDznztSgmX — Gossip Cop (@GossipCop) June 4, 2015\n\nAs mentioned above, Britney Spears married Jason Alexander in January 2004 at the Little White Wedding Chapel located in Las Vegas, Nevada. Multiple reports confirmed that Spears decided to marry her childhood friend on a whim.\n\nAccording to Today, the filed annulment petition provided further explanation of the 55-hour marriage.\n\n“Plaintiff Spears lacked understanding of her actions to the extent that she was incapable of agreeing to the marriage… Before entering into the marriage the plaintiff and defendant did not know each other’s likes and dislikes, each other’s desires to have or not have children, and each other’s desires as to state of residency.”\n\nIn an interview with Access Hollywood, Jason Alexander confirmed that the decision to get married was made on a whim.\n\n“It was just crazy, man. And we were just looking at each other and said, ‘Let’s do something wild, crazy. Let’s go get married, just for the hell of it.'”\n\nBritney Spears’ attorney, David Chesnoff, stated that she was not intoxicated when she decided to initially go through with the marriage.\n\nBritney got engaged to dancer Kevin Federline in July of the same year and became legally married in October.\n\nIn November 2006, Britney Spears cited “irreconcilable differences” when she filed for divorce from the father of her two sons. Britney and Kevin decided to share joint custody of their kids and reached a global settlement when their divorce was finalized in July 2007.\n\n[Image Credit: Jason Merritt/Getty Images]", "images": ["https://secure.gravatar.com/avatar/48664e2d74ff85f740a875090d2d043a?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2015/06/Britney-Spears-Charlie-Ebersol.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jonathan Franks"], "canonical_link": "https://www.inquisitr.com/2145552/britney-spears-planning-secret-wedding/", "title": "Is Britney Spears Planning A Secret Wedding In Las Vegas?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}