{"url": "https://web.archive.org/web/20160620220959/http://yournewswire.com:80/clinton-email-we-must-destroy-syria-for-israel/", "text": "A leaked Hillary Clinton email confirms that the Obama administration, with Hillary at the helm, orchestrated a civil war in Syria to benefit Israel.\n\nThe new Wikileaks release shows the then Secretary of State ordering a war in Syria in order to overthrow the government and oust President Assad, claiming it was the “best way to help Israel”.\n\nNewobserveronline.com reports:\n\nThe document was one of many unclassified by the US Department of State under case number F-2014-20439, Doc No. C05794498, following the uproar over Clinton’s private email server kept at her house while she served as Secretary of State from 2009 to 2013.\n\nAlthough the Wikileaks transcript dates the email as December 31, 2000, this is an error on their part, as the contents of the email (in particular the reference to May 2012 talks between Iran and the west over its nuclear program in Istanbul) show that the email was in fact sent on December 31, 2012.\n\nThe email makes it clear that it has been US policy from the very beginning to violently overthrow the Syrian government—and specifically to do this because it is in Israel’s interests.\n\n“The best way to help Israel deal with Iran’s growing nuclear capability is to help the people of Syria overthrow the regime of Bashar Assad,” Clinton forthrightly starts off by saying.\n\nEven though all US intelligence reports had long dismissed Iran’s “atom bomb” program as a hoax (a conclusion supported by the International Atomic Energy Agency), Clinton continues to use these lies to “justify” destroying Syria in the name of Israel.\n\nShe specifically links Iran’s mythical atom bomb program to Syria because, she says, Iran’s “atom bomb” program threatens Israel’s “monopoly” on nuclear weapons in the Middle East.\n\nIf Iran were to acquire a nuclear weapon, Clinton asserts, this would allow Syria (and other “adversaries of Israel” such as Saudi Arabia and Egypt) to “go nuclear as well,” all of which would threaten Israel’s interests.\n\nTherefore, Clinton, says, Syria has to be destroyed.\n\nIran’s nuclear program and Syria’s civil war may seem unconnected, but they are. What Israeli military leaders really worry about — but cannot talk about — is losing their nuclear monopoly.\n\nAn Iranian nuclear weapons capability would not only end that nuclear monopoly but could also prompt other adversaries, like Saudi Arabia and Egypt, to go nuclear as well. The result would be a precarious nuclear balance in which Israel could not respond to provocations with conventional military strikes on Syria and Lebanon, as it can today.\n\nIf Iran were to reach the threshold of a nuclear weapons state, Tehran would find it much easier to call on its allies in Syria and Hezbollah to strike Israel, knowing that its nuclear weapons would serve as a deterrent to Israel responding against Iran itself.\n\nIt is, Clinton continues, the “strategic relationship between Iran and the regime of Bashar Assad in Syria” that makes it possible for Iran to undermine Israel’s security.\n\nThis would not come about through a “direct attack,” Clinton admits, because “in the thirty years of hostility between Iran and Israel” this has never occurred, but through its alleged “proxies.”\n\nThe end of the Assad regime would end this dangerous alliance. Israel’s leadership understands well why defeating Assad is now in its interests.\n\nBringing down Assad would not only be a massive boon to Israel’s security, it would also ease Israel’s understandable fear of losing its nuclear monopoly.\n\nThen, Israel and the United States might be able to develop a common view of when the Iranian program is so dangerous that military action could be warranted.\n\nClinton goes on to asset that directly threatening Bashar Assad “and his family” with violence is the “right thing” to do:\n\nIn short, the White House can ease the tension that has developed with Israel over Iran by doing the right thing in Syria.\n\nWith his life and his family at risk, only the threat or use of force will change the Syrian dictator Bashar Assad’s mind.\n\nThe email proves—as if any more proof was needed—that the US government has been the main sponsor of the growth of terrorism in the Middle East, and all in order to “protect” Israel.\n\nIt is also a sobering thought to consider that the “refugee” crisis which currently threatens to destroy Europe, was directly sparked off by this US government action as well, insofar as there are any genuine refugees fleeing the civil war in Syria.\n\nIn addition, over 250,000 people have been killed in the Syrian conflict, which has spread to Iraq—all thanks to Clinton and the Obama administration backing the “rebels” and stoking the fires of war in Syria.\n\nThe real and disturbing possibility that a psychopath like Clinton—whose policy has inflicted death and misery upon millions of people—could become the next president of America is the most deeply shocking thought of all.\n\nClinton’s public assertion that, if elected president, she would “take the relationship with Israel to the next level,” would definitively mark her, and Israel, as the enemy of not just some Arab states in the Middle East, but of all peace-loving people on earth.", "images": ["https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/01/lions-gate-idf-border-police-east-jerusalem--70x53.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2014/08/Theresa-May-006.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/04/isis-passport-70x53.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2014/11/president-sisi-with-his-generals-at-a-military-parade.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/Syria-fight-Syria-for-Israel-790x350.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/Syria-fight-Syria-for-Israel.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/clinton-email-syria-israel.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/gravatar/1511651_10152594103870715_1942518842_o.jpg", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2014/08/Screen-Shot-2014-08-04-at-7.12.51-PM.png", "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2015/06/devastated-GAZA-UN-30-years-rebuild-70x53.jpg", "https://web.archive.org/web/20160620220959im_/https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=/7lYk1a4eFf26C"], "top_img": "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/Syria-fight-Syria-for-Israel.jpg", "keywords": [], "authors": ["Avner Eliyahu Romm", "Marv Sammons", "Javo Santo", "Muhammad Sohail Iftikhar", "Alan Folsom", "Gail Bergstrom", "Sm Farid Uddin Akhter", "Obadiah Zuen"], "canonical_link": "https://web.archive.org/web/20160620220959/http://yournewswire.com/clinton-email-we-must-destroy-syria-for-israel/", "title": "Clinton Email: We Must Destroy Syria For Israel", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WPSSO UM 1.5.5-1/G", "article": {"author": "https://www.facebook.com/seantut", "section": "News", "tag": "syria", "published_time": "2016-06-18T23:59:45+00:00", "modified_time": "2016-06-19T00:00:54+00:00", "publisher": "https://www.facebook.com/thepeoplesvoicetv"}, "wpsso": {"mark": "wpsso meta tags end"}, "fb": {"admins": "seantut", "app_id": 1715884468669256, "pages": 219195584894557}, "og": {"url": "https://web.archive.org/web/20160620220959/http://yournewswire.com/clinton-email-we-must-destroy-syria-for-israel/", "type": "article", "locale": "en_US", "site_name": "Your News Wire", "title": "Clinton Email: We Must Destroy Syria For Israel", "description": "A leaked Hillary Clinton email confirms that the Obama administration, with Hillary at the helm, orchestrated a civil war in Syria to benefit Israel.", "image": {"identifier": "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/Syria-fight-Syria-for-Israel.jpg", "width": 790, "height": 415}}, "twitter": {"domain": "yournewswire.com", "site": "@peoplesvoice_tv", "title": "Clinton Email: We Must Destroy Syria For Israel", "description": "A leaked Hillary Clinton email confirms that the Obama administration, with Hillary at the helm, orchestrated a civil war in Syria to benefit Israel.", "creator": "@seanshhh", "card": "summary_large_image", "image": "https://web.archive.org/web/20160620220959im_/http://cdns.yournewswire.com/wp-content/uploads/2016/06/Syria-fight-Syria-for-Israel-600x315.jpg"}, "canonical": "http://yournewswire.com/clinton-email-we-must-destroy-syria-for-israel/", "description": "A leaked Hillary Clinton email confirms that the Obama administration, with Hillary at the helm, orchestrated a civil war in Syria to benefit Israel."}, "movies": [], "publish_date": 1466294385.0, "source": "https://web.archive.org", "summary": ""}