{"url": "https://www.etonline.com/jeff-goldblum-reveals-his-moms-terrified-reaction-to-his-infamous-death-hoax-99308", "text": "Celebrity death hoaxes have become an internet staple, and one of the most frequent targets is beloved eccentric Jeff Goldblum.\n\nThe Jurassic Park star first became the victim of a fake obit in 2009 when rumors began circulating on Facebook that he died after falling off a cliff in New Zealand while filming a new project.\n\nFirst created by internet trolls and social media opportunists, and then spread by legitimately bereaved friends and unreputable blogs, the story took off like wildfire. And while Goldblum knew first-hand that he was still alive, many of his friends and family didn't have that luxury.\n\nSpeaking with The Talk on Wednesday, the 65-year-old actor -- who is currently starring in Wes Anderson's animated dramedy Isle of Dogs -- reflected on how the hoax really scared his mother.\n\n\"It went all over the world for a little bit for a couple of hours before I could set the record straight,\" Goldblum recalled. \"So people thought that I'd died. And those were the days when I had a telephone landline and my answering machine and before I could call everybody, I got a couple of messages that I wasn't able to pick up, from like, my mother. It was, 'Jeffrey, are you there? Are you there?'\"\n\n\"So be careful about gossip,\" he added. \"Be careful about spreading something that you haven't sourced entirely or that's not factual.\"\n\n'Thor: Ragnarok' Extended Scene: Jeff Goldblum's Grandmaster and The God of Thunder Meet (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Thor: Ragnarok' Extended Scene: Jeff Goldblum's Grandmaster and The God of Thunder Meet (Exclusive)\n\nOn Monday, Goldblum sat down on Watch What Happens Live with Andy Cohen where he also reflected on the death hoax -- which has resurfaced several times in the years since it first went viral -- and said that he got another message at the time from a close friend who \"very tearfully and hysterically left a message\" trying to find out if he was actually dead.\n\nIn reality, Goldblum told the New Zealand Herald in 2016 that not only has he never shot a film in the country, he's never even been there at all. And now, in the light of the hoax, he's not sure if he ever should visit.\n\n\"Could you imagine if that's the way I go?\" Goldblum joked. \"Wow. Could you imagine? 'They foretold the future, he actually did fall off a cliff in New Zealand.' It's got to happen some way!\"\n\nIn real life, Goldblum is actually healthy and happy and will soon be seen on the big screen reprising his role as mathematician and dino-adventurer Dr. Ian Malcolm in the upcoming Jurassic World: Forbidden Kingdom.\n\n'Jurassic World: Fallen Kingdom' Trailer: It's a Dino Rescue Mission! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Jurassic World: Fallen Kingdom' Trailer: It's a Dino Rescue Mission!\n\nRecently, the star sat down with ET where he opened up about returning to the mega-popular franchise and the possibility of his former co-star, Laura Dern, coming back to reprise her role as paleobotanist Ellie Sattler.\n\n\"I don't want to pass on gossip like my character,\" Goldblum said, \"but it would be good news to me and to everyone, [to] millions and billions of people all over the world… all over the universe and cosmos when Ellie Sattler returns.\"\n\nCheck out the video below to hear more from Goldblum about Fallen Kingdom, which stampedes into theaters June 22.\n\nJeff Goldblum Teases Possible Laura Dern Cameo in 'Jurassic World: Fallen Kingdom' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\n'Thor: Ragnarok' Extended Scene: Jeff Goldblum's Grandmaster and the God of Thunder Meet (Exclusive)\n\nJeff Goldblum Returns as Dr. Ian Malcolm in New 'Jurassic World: Fallen Kingdom' Teaser Featurette\n\nRicky Martin Mocks Death Hoax on Instagram\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-12/gettyimages-476050887.jpg?h=c673cd1c&itok=OI2INJGA", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/jeff_goldblum_gettyimages-935375840_1280.jpg?h=c673cd1c&itok=gF5wl0AP", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-03/jeff_goldblum_gettyimages-935375840_1280.jpg?h=c673cd1c&itok=zX-S-3Bw"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/jeff_goldblum_gettyimages-935375840_1280.jpg?h=c673cd1c&itok=gF5wl0AP", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/jeff-goldblum-reveals-his-moms-terrified-reaction-to-his-infamous-death-hoax-99308", "title": "Jeff Goldblum Reveals His Mom's Terrified Reaction to His Infamous Death Hoax", "meta_data": {"article": {"opinion": "false"}, "title": "Jeff Goldblum Reveals His Mom's Terrified Reaction to His Infamous Death Hoax | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/jeff-goldblum-reveals-his-moms-terrified-reaction-to-his-infamous-death-hoax-99308", "title": "Jeff Goldblum Reveals His Mom's Terrified Reaction to His Infamous Death Hoax", "description": "In 2009, the 'Jurassic Park' star was the victim of a fake news story about him dying in New Zealand, and he recently opened up about how his mom heard the rumor before he was able to debunk it.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/jeff_goldblum_gettyimages-935375840_1280.jpg?h=c673cd1c&itok=gF5wl0AP", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "In 2009, the 'Jurassic Park' star was the victim of a fake news story about him dying in New Zealand, and he recently opened up about how his mom heard the rumor before he was able to debunk it.", "title": "Jeff Goldblum Reveals His Mom's Terrified Reaction to His Infamous Death Hoax", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/jeff-goldblum-reveals-his-moms-terrified-reaction-to-his-infamous-death-hoax-99308", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/jeff_goldblum_gettyimages-935375840_1280.jpg?h=c673cd1c&itok=gF5wl0AP"}, "description": "In 2009, the 'Jurassic Park' star was the victim of a fake news story about him dying in New Zealand, and he recently opened up about how his mom heard the rumor before he was able to debunk it.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Movies, Jeff Goldblum, Laura Dern, Deaths, Jurassic World: Fallen Kingdom", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}