{"url": "people.com/tv/everything-khloe-kardashian-said-infidelity-lamar-odom/", "text": "Khloé Kardashian, just welcomed her first child — a baby girl! — amid rampant speculation about Tristan Thompson‘s alleged infidelities.\n\nA source previously told PEOPLE that though Kardashian, 33, was devastated, she would remain focused on motherhood, explaining that the scandal “doesn’t change that Khloé has dreamed of becoming a mom.”\n\nGet push notifications with news, features and more.\n\nIt’s also not the first time the Keeping Up with the Kardashians reality star has faced similar rumors. Before she was romantically linked to NBA boyfriend Thompson in September 2016, Kardashian dealt with allegations of extramarital affairs during her nearly eight-year relationship with ex-husband Lamar Odom.\n\nA source close to Odom, 38, told PEOPLE recently that “Lamar feels terrible for Khloé. He wasn’t sure if he should reach out and see how she’s doing. He feels for her.”\n\nKardashian and Odom wed on Sept. 27, 2009 — one month to the day after they met (and nine days after getting engaged) — but the marriage fell apart after the former basketball player’s cheating scandal and drug relapse, which led Kardashian to file for divorce in 2013.\n\nWatch the full special Born Kardashian streaming now on PeopleTV.com, or download the PeopleTV app on your favorite device.\n\nCheating rumors against Odom first circulated in January 2012, when a tabloid report claimed Odom cheated on Kardashian with a woman he met at a Washington, D.C., strip club. And in July 2013, the pair were confronted rumors claiming Odom had been unfaithful to Kardashian after playing a game for the Dallas Mavericks.\n\nRELATED: Everything We Know About Khloé Kardashian’s Romance with Tristan Thompson (So Far)\n\nImage zoom JAKE HOLLY/startraksphoto.com\n\n“Love is blind … Lamar was so great at making me feel like I was the only one and I’m this princess. I never speculated cheating … so I didn’t know about cheating … until before the DUI [in 2013],” Kardashian told Howard Stern in January 2016.\n\n“He was so good. So nothing was on his cell phones, [but] he had an assistant. They were all on his assistant’s phone, so he was really crafty,” she recalled as Stern asked the former Kocktails with Khloé host: “Doesn’t that feel awful when the assistant knows, and everyone knows?” To which Kardashian agreed, “Oh, it’s disgusting.”\n\nRELATED GALLERY: Khloé Kardashian & Lamar Odom: A Timeline of Their Relationship\n\n“But all these rumors kept coming out in the weeklies, and as much as I know they’re bull—-, where there’s smoke there’s fire. Something has to be right here,” Kardashian revealed. “It is humiliating on any level, but I found out he was cheating on me the majority of our marriage, I just didn’t know.”\n\nIn October 2015, Odom was rushed to the hospital after being found unconscious in a Nevada brothel. Near death, he spent four days in a coma, and Kardashian rushed to his side and called off their divorce proceedings temporarily.\n\nImage zoom Imeh Akpanudosen/Getty; JB Lacroix/WireImage\n\nMonths before, in July 2015, both stars had signed divorce papers, but the judgment had not yet been entered in court by the time Odom was hospitalized; thus, they were technically still legally married. As a result, Kardashian was making all of Odom’s medical decisions.\n\nUpon his recovery, Odom completed a 30-day drug rehab program.\n\nKhloé refiled for divorce once Odom recovered from the Nevada incident, and their split was finalized in December 2016.\n\nRELATED: Khloé Kardashian Opens Up About Lamar Odom’s Harrowing Ordeal: I’ll Always Be There for Him\n\nRELATED VIDEO: Khloé Kardashian’s BFF Khadijah Haqq Takes Aim at Tristan Thompson During Cheating Scandal\n\nIn July 2017, Odom penned an emotional first-person essay for The Players’ Tribune in which he touched on how his drug addiction and infidelity tore apart his marriage.\n\n“Anybody who’s lived a complicated, drug-infused life like I’ve lived knows the cycle — with women, cheating on my wife, s— like that,” he wrote.\n\nImage zoom Jerritt Clark/Getty Images\n\nOne of his “darkest” moments, he admitted, was when Kardashian caught him doing drugs with another woman. “I was in a motel room, getting high with this chick, and my wife (at the time) walked in. That probably was like rock bottom. First of all I was in a motel. A motel,” he remembered.\n\n“I’m a millionaire. I’d made it out of Jamaica, Queens, and won two NBA titles. And I’m in a motel, with some random person, doing coke. But I just wanted to get high with this girl, and I had no other place to go. I couldn’t take her home. You know, I was being a scumbag,” he wrote.\n\nOdom still thinks highly of Kardashian. Asked in January by BET’s Mancave about Khloé being pregnant, Odom said he’s “happy for her,” adding, “She took care of me, she’ll be a good mother. For real. She’s a great woman.”\n\nNow, a source told PEOPLE that when Kardashian got together with Thompson, her sisters were “really happy to see Khloe so excited about someone again because she hadn’t felt that way about a guy since Lamar. Eventually Tristan won over her family too … he really seemed dedicated to her, so this must be a shock to everyone.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1378&h=721&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-6.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkhloe-kardashian4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkhloe-kardashian-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2015%2F10%2Flamar-odom-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1378&h=721&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-6.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/tv/everything-khloe-kardashian-said-infidelity-lamar-odom/", "title": "Everything New Mom Khloé Kardashian Said About Infidelity After Ex-Husband Lamar Odom Cheated", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Kardashians,Khloé Kardashian,Lamar Odom,News,Tristan Thompson,TV", "news_keywords": "Babies,Kardashians,Khloé Kardashian,Lamar Odom,News,Tristan Thompson,TV", "description": "Khloé Kardashian, just welcomed her first child — a baby girl!", "og": {"title": "Everything New Mom Khloé Kardashian Said About Infidelity After Ex-Husband Lamar Odom Cheated", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/everything-khloe-kardashian-said-infidelity-lamar-odom/", "description": "Khloé Kardashian, just welcomed her first child — a baby girl! — amid rampant speculation about Tristan Thompson‘s alleged infidelities. A source previously told PEOPLE&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1378&h=721&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-6.jpg", "width": 1378, "height": 721}}, "pinterest": {"url": "https://people.com/tv/everything-khloe-kardashian-said-infidelity-lamar-odom/", "description": "Khloé Kardashian, just welcomed her first child — a baby girl!", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-6.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/everything-khloe-kardashian-said-infidelity-lamar-odom/", "title": "Everything New Mom Khloé Kardashian Said About Infidelity After Ex-Husband Lamar Odom Cheated", "description": "Khloé Kardashian, just welcomed her first child — a baby girl!", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1378&h=721&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fkhloe-kardashian-6.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}