{"url": "https://web.archive.org/web/20140723214059/http://bostonherald.com:80/inside_track/celebrity_news/2014/07/baby_joy_ryan_gosling_and_eva_mendes_are_thrilled_to_be", "text": "For months, legions of Ryan Gosling worshippers speculated - well, more like prayed - that their idol was again single. Eva Mendes, once a steady sight on his arm, had virtually vanished, canceling a May Cannes trip to support his directorial debut, Lost River, in which she also starred. After the no-show, Time even posted a story with the breathless headline are ryan gosling and eva mendes close to a split?\n\nSorry, superfans. On July 9, #Goslingbaby took over Twitter, heralding the news that the couple are expecting a child. And multiple sources tell Us the press-shy pair - so private that reps haven't confirmed the pregnancy - are counting down to an October due date.\n\nMore celebrity baby news: Kim Kardashian & Kate Middleton: Another baby for both?\n\n\"They're excited to become parents and are in love,\" another pal says of Gosling, 33, and Mendes, 40. \"They've just been keeping it to themselves because that's his whole MO.\" Those closest to the Oscar-nominated actor admit he can be guarded, but a confidant says the pregnancy - not planned, but welcomed - has him overjoyed: \"Ryan has already stepped into the role of caring father-to-be.\"\n\nNesting Time\n\nTo that end, Gosling is passionate about pampering his pregnant girlfriend. While Mendes holes up in his 1,300-square-foot house in L.A.'s Studio City, \"Ryan goes out and gets the groceries,\" the confidant says of the duo of three years. \"She's been wanting pasta, and he's cooking her meals.\" As of late, Mendes fills her time with prenatal yoga sessions and visits from her close-knit Cuban American family. The more, the merrier for Gosling. Adds the confidant: \"He cooks for them too!\"\n\nThe former Disney star, who grew up in a paper-mill town in Canada, spent most of June babyproofing the two-bedroom bachelor pad he bought for $1.5 million in 2008. And once the baby arrives, friends say, he'll be ready. Says a source, \"He's great with kids in general\" - a fact Mendes attested to after 2013's The Place Beyond the Pines. \"He loved playing with the little boy we used in the film to play our son,\" Mendes gushed at the time. \"It was adorable to see him in that light.\" For her part, she's an old hand. \"I have nine nephews and nieces,\" Mendes has said. \"I know how to carry a kid.\"\n\nThe Relationship\n\nThey were friends before they clicked on the Schenectady, New York, Pines set in the summer of 2011. Mendes was just months out of a decadelong relationship with writer George Augusto and looking to settle down, says an other source close to the Miami native. When filming ended, Mendes and Gosling stayed in touch, watching old movies at each other's places and listening to music. \"He'd sing covers of her favorite songs and send them to her,\" says the friend, adding that they got on so well, \"Eva said it was like hanging out with the male version of her.\"\n\nHis friends, however, balked, noting that they were total opposites. \"His group were mostly hipsters and basically said she was too 'Hollywood,'?\" recalls a Gosling source, adding that friends measured her against his ex Rachel McAdams, who they saw as a better fit. \"They loved Rachel and hoped they would reunite.\" A Mendes source says that at one point the actress confronted her guy after his crew was rude to her at a dinner party she hosted. Adds the Mendes source, \"She told him she needed him to smooth things out with them.\"\n\nGosling stood by her side. He visited her in Paris that November when she filmed Holy Motors, and she returned the favor when Gosling moved to Thailand for Only God Forgives in early 2012.\n\nWhile in Bangkok, they invited both their mothers to share a visit at the same time. \"Ryan's mother loved Eva and kept in touch with her,\" says the friend. Courting Donna, who homeschooled her son at one point, was the way to Gosling's heart, says the confidant. \"Ryan's most important person is his mom. Once she and Eva connected, he knew she was The One.\"\n\nFairy Tale Ending\n\nAs she and Gosling grew more serious, Mendes was careful not to jinx anything. \"I don't like talking about things that I want in the future,\" she told Marie Claire last year when asked if she envisioned motherhood and marriage. \"I feel by verbalizing such things, they won't come true.\"\n\nNow that at least the first part has materialized, Mendes can wait for the ring, says the confidant: \"They're just focused on raising their child as best they can.\"\n\nThe Ex Factor\n\n\"I had two of the greatest girlfriends of all time,\" Gosling has said of Sandra Bullock (2001-2002) and Rachel McAdams (2004-2007). Of McAdams (inset), he told GQ: \"We both went down swingin' and called it a draw.\"\n\nMendes dated writer Gorge Augusto for nearly a decade, starting in 2002. The romance unraveled in the years following her 2008 rehab stint, says an Augusto source. \"She moved on, but I don't think he's over her.\"\n\nHis Notebook Fury!\n\nGosling blew up when he heard The Notebook director Nick Cassavetes revealed the actor didn't like costar Rachel McAdams at first. (\"He's doing a scene with Rachel,\" Cassavetes recently told VH1, \"and he says, 'Would you take her out of here and bring in another actress to read off camera with me?'\") In response, \"Ryan called Nick, screaming,\" says a source close to the actor, who, of course, dated McAdams postfilming. \"He told him he was stirring up old stuff. Nick is on his s-t list!\"\n\n\n\n(c)2014 Us Weekly. First published in Us Weekly Magazine. Distributed by Tribune Content Agency, LLC", "images": ["https://web.archive.org/web/20140723214059im_/http://bostonherald.com/sites/default/files/styles/full/public/media/2012/08/20/032713eva.jpg?itok=9LsLxsLC&c=b769e4b267dc49f0525961cfdadaf93f", "https://web.archive.org/web/20140723214059im_/http://bostonherald.com/sites/default/files/images/favicon.ico", "https://web.archive.org/web/20140723214059im_/http://bostonherald.com/sites/default/files/partlycloudy_764.gif"], "top_img": "https://web.archive.org/web/20140723214059im_/http://bostonherald.com/sites/default/files/images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20140723214059/http://bostonherald.com/inside_track/celebrity_news/2014/07/baby_joy_ryan_gosling_and_eva_mendes_are_thrilled_to_be", "title": "Baby Joy! Ryan Gosling and Eva Mendes are thrilled to be expecting an October arrival", "meta_data": {"article": {"tag": "Inside Track", "modified_time": "2014-07-21T11:41:26-04:00", "published_time": "2014-07-21T08:32:00-04:00", "section": "Ryan Gosling"}, "parsely-page": "{\"link\":\"http:\\/\\/bostonherald.com\\/inside_track\\/celebrity_news\\/2014\\/07\\/baby_joy_ryan_gosling_and_eva_mendes_are_thrilled_to_be\",\"type\":\"post\",\"post_id\":\"1064519543\",\"title\":\"Baby Joy! Ryan Gosling and Eva Mendes are thrilled to be expecting an October arrival\",\"pub_date\":\"2014-07-21T12:32:00Z\",\"tags\":[\"Ryan Gosling\",\"Eva Mendes\",\"Tribune Content Agency\"],\"author\":\"Kevin O\\u0027Leary\",\"section\":\"Celebrity News\"}", "description": "For months, legions of Ryan Gosling worshippers speculated - well, more like prayed - that their idol was again single.", "keywords": "Ryan Gosling, Eva Mendes, Tribune Content Agency, Celebrity News, Inside Track", "twitter": {"description": "For months, legions of Ryan Gosling worshippers speculated - well, more like prayed - that their idol was again single.", "card": "summary", "title": "Baby Joy! Ryan Gosling and Eva Mendes are thrilled to be expecting an October arrival"}, "generator": "Drupal 7 (http://drupal.org)", "news_keywords": "Ryan Gosling, Eva Mendes, Tribune Content Agency, Celebrity News, Inside Track", "application-name": "The Boston Herald", "msapplication-TileColor": "#005e9b", "msapplication-TileImage": "213c8c33-9b77-486e-a54f-d4efd5a7fe09.png"}, "movies": [], "publish_date": 1405945920.0, "source": "https://web.archive.org", "summary": ""}