{"url": "en.wikipedia.org/wiki/Lisa_Kudrow", "text": "American actress\n\nLisa Valerie Kudrow[2] ( ; born July 30, 1963)[3] is an American actress, comedian, writer, singer, and producer. After making guest appearances in several television sitcoms, including Cheers, she came to prominence with her main role of Phoebe Buffay in Friends (1994–2004), receiving a Screen Actors Guild Award nomination. Kudrow initially portrayed Phoebe’s twin sister Ursula on the television sitcom Mad About You. Kudrow has received several accolades, including a Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series from six nominations, two Screen Actors Guild Awards from 12 nominations, and a Golden Globe Award nomination. Her Friends character was widely popular while the series aired and was later recognized as one of the greatest female characters in American television.\n\nKudrow starred in the cult comedy film Romy and Michele's High School Reunion (1997) and followed it with an acclaimed performance in the romantic comedy The Opposite of Sex (1998), which won her the New York Film Critics Circle Award for Best Supporting Actress and a nomination for the Independent Spirit Award for Best Supporting Female. In 2005, she went on to produce, write and star in the HBO comedy series The Comeback, which was revived nine years later for a second season. Kudrow received two Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series nominations for both seasons.\n\nIn 2007, Kudrow received praise for her starring role in the film Kabluey and appeared in the box office hit film P.S. I Love You. She produced and starred in the Showtime program Web Therapy (2011–2015), which was nominated for a Primetime Emmy Award. She is a producer on the TLC reality program Who Do You Think You Are, which has garnered her five Primetime Emmy Award nominations.\n\nKudrow has also made several notable film appearances, including roles in Analyze This (1999), Dr. Dolittle 2 (2001), Bandslam (2008), Hotel for Dogs (2009), Easy A (2010), Neighbors (2014) and its sequel Neighbors 2: Sorority Rising (2016), The Girl on the Train (2016), The Boss Baby (2017), Long Shot (2019) and Booksmart (2019). Her films have grossed over $2 billion worldwide.\n\nEarly life [ edit ]\n\nLisa Kudrow was born in Los Angeles, California, to Nedra S. (née Stern, born 1934), a travel agent, and Lee N. Kudrow (born 1933), a physician who specialized in the treatment of headaches.[4] She has an older sister, Helene Marla (born 1955), and an older brother, Santa Monica neurologist David B. Kudrow (born 1957). Kudrow was raised in a middle-class Jewish family and had a Bat Mitzvah ceremony.[5][6] Her ancestors emigrated from Belarus, Germany, Hungary and Poland, and some of them lived in the village of Ilya, in the Minsk area.[7] Kudrow's paternal grandparents were David Kudrow (born in Mogilev, Belarus) and Gertrude Farberman (born in Ilya, Belarus).[7] Her paternal great-grandmother, Mera Mordejovich, was murdered in Ilya during the Holocaust. Her paternal grandmother immigrated to Brooklyn, where her father grew up.[8]\n\nKudrow attended Portola Middle School in Tarzana, California. [9] She graduated from Taft High School in Woodland Hills, Los Angeles where then N.W.A. members Ice Cube and Eazy-E and actress Robin Wright also attended. Kudrow received her Bachelor of Arts degree in Biology from Vassar College, intending to become an expert on headaches like her physician father.[10] Kudrow worked on her father's staff for eight years while breaking into acting, earning a research credit on his study on the comparative likelihood of left-handed individuals developing cluster headaches.[11]\n\nCareer [ edit ]\n\nKudrow visiting her alma mater Vassar College in 2004\n\n1989–1994: Early career [ edit ]\n\nAt the urging of her brother's childhood friend, comedian Jon Lovitz,[5] she began her comedic career as a member of The Groundlings, an improv and sketch comedy school in Los Angeles. Kudrow has credited Cynthia Szigeti, her improv teacher at The Groundlings, for changing her perspective on acting, calling her \"the best thing that happened, on so many levels.\"[12][13] Briefly, Kudrow joined with Conan O'Brien and director Tim Hillman in the short-lived improv troupe Unexpected Company.[citation needed] She was also the only regular female member of the Transformers Comedy Troupe.[citation needed] She played a role in an episode of the NBC sitcom Cheers.[14] She tried out for Saturday Night Live in 1990, but the show chose Julia Sweeney instead.[15] She had a recurring role as Kathy Fleisher in three episodes of season one of the Bob Newhart sitcom Bob (CBS, 1992–1993), a role she played after taking part in the series finale of Newhart's previous series Newhart.[16] Prior to Friends, she appeared in at least two produced network pilots: NBC's Just Temporary (also known as Temporarily Yours) in 1989, playing Nicole; and CBS' Close Encounters (also known as Matchmaker) in 1990, playing a Valley girl.[4]\n\nKudrow was cast to play the role of Roz Doyle in Frasier, but the role was re-cast with Peri Gilpin during the taping of the pilot episode. Kudrow said in 2000 that when rehearsals started, \"I knew it wasn't working. I could feel it all slipping away, and I was panicking, which only made things worse.\"[5] Her first recurring television role was Ursula Buffay, the eccentric waitress on the NBC sitcom Mad About You. Kudrow would reprise the character on the NBC sitcom Friends, in which Kudrow co-starred as massage therapist Phoebe Buffay, Ursula's twin sister.[17]\n\n1994–2004: Breakthrough [ edit ]\n\nKudrow was the first Friends cast member to win an Emmy Award with her 1998 honor as Outstanding Supporting Actress in a Comedy Series for her starring role as Phoebe on Friends (NBC, 1994–2004).[18] According to the Guinness Book of World Records (2005), Kudrow and co-stars Jennifer Aniston and Courteney Cox became the highest paid TV actresses of all time, earning $1 million per episode for the ninth and tenth seasons of Friends.[19]\n\nDuring her tenure on Friends Kudrow appeared in multiple comedic films such as Romy and Michele's High School Reunion, Hanging Up, Marci X, Dr. Dolittle 2, Analyze This and its sequel Analyze That, and dramatic films, such as Wonderland and The Opposite of Sex. She also guest starred on numerous television series during Friends, including The Simpsons, Hope and Gloria, King of the Hill, and hosting Saturday Night Live.\n\n2004–present: Post-Friends [ edit ]\n\nKudrow starred as protagonist Valerie Cherish on the single-season HBO series The Comeback (premiered June 5, 2005), about a has-been sitcom star trying for a comeback. She also served as co-creator, writer, and executive producer. Nine years after the original season, HBO revived the series in 2014 for an abbreviated second season. Kudrow received two Emmy nominations for Outstanding Lead Actress in a Comedy Series for her work on The Comeback.[20]\n\nKudrow serves as the executive producer for the American version of the UK television series Who Do You Think You Are?, in which celebrities trace their family trees. The subjects of the first series included Kudrow herself, in which it was discovered her great-grandmother was murdered in the Holocaust.[21][22]\n\nKudrow co-created an improvised comedy web series, Web Therapy on Lstudio.com. The improv series, which launched online in 2008, has earned several Webby nominations and one Outstanding Comedic Performance Webby for Kudrow, who plays therapist Fiona Wallice. She offers her patients three-minute sessions over iChat.[20] In July 2011, a reformatted, half-hour version of the show premiered on Showtime,[23][24] before being cancelled in 2015 after four seasons.[25] Kudrow has guest starred on multiple television series such as Cougar Town, BoJack Horseman, Angie Tribeca, Unbreakable Kimmy Schmidt, and Scandal.[26]\n\nFollowing Friends, Kudrow has also appeared in films such as Easy A, Hotel for Dogs, Happy Endings, and Neighbors. In 2016, she reprised her role as Carol Gladstone in Neighbors 2: Sorority Rising,[27] and co-starred in the thriller film The Girl on the Train.[28]\n\nKudrow played Hypatia of Alexandria in season 4 episode 12 of The Good Place \"Patty\".[29]\n\nOn April 8, 2020, it was announced that Kudrow was cast as Maggie Naird in the upcoming Netflix comedy series, Space Force.[30]\n\nPersonal life [ edit ]\n\nOn May 27, 1995, Kudrow married French advertising executive Michel Stern. They have a son, Julian Murray Stern, who was born on May 7, 1998.[31][32] Kudrow's pregnancy was written into the fourth season of Friends, with her character, Phoebe, having triplets as a surrogate mother for her younger half-brother Frank (Giovanni Ribisi) and his wife Alice (Debra Jo Rupp).[33] In 2019, during an interview with Marc Maron, Kudrow revealed that she experienced body dysmorphic disorder while working on the show.[34]\n\nFilmography [ edit ]\n\nKudrow at the 2009 Streamy awards\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nKudrow has been honored with numerous accolades over her career. For her role in the sitcom Friends, she received six nominations at the Primetime Emmy Awards, winning in 1998 for Outstanding Supporting Actress in a Comedy Series. Kudrow has also received twelve nominations and two wins at the Screen Actors Guild Awards, as well as one win and eight nominations at the American Comedy Awards.", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Lisa_Kudrow.jpg/235px-Lisa_Kudrow.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg/220px-Lisa_Kudrow_at_TIFF_2009.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Lisa_Kudrow_3.jpg/220px-Lisa_Kudrow_3.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Lisakudrowvascol.jpg/220px-Lisakudrowvascol.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lisa_Kudrow", "title": "Lisa Kudrow", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}