{"url": "https://www.thewrap.com/2018-espys-15-things-you-didnt-see-on-tv/", "text": "The 2018 ESPYS celebrated not only the biggest achievements in sports on Wednesday night, but also the spirit and atmosphere of 2018 itself.\n\nThe sexual abuse survivors who spoke out against USA gymnastics and Michigan State coach Larry Nassar winning the Arthur Ashe Courage Awards created the most emotionally charged moment of the night. But there were many more tearjerkers throughout the three-hour show, including the heroes of the Marjory Stoneman Douglas High school shooting — Aaron Feis, Scott Beigel and Chris Hixon — being posthumously named Best Coach.\n\nWhile millions of viewers watched the 2018 ESPYS live on ABC, TheWrap was inside the Microsoft Theater in downtown Los Angeles.\n\nAlso Read: Danica Patrick's ESPYs Monologue Called 'Awkward, 'Cringey' (Video)\n\nHere’s what you didn’t see on TV.\n\nSexual abuse survivors make a lasting impact\n\nThe Arthur Ashe Courage Award is usually presented in the middle of the show but ESPN producers wisely moved it to the end of the night, knowing the importance of the 150 sexual abuse survivors taking to the stage together. The “sister survivors” of Nassar’s abuse over the past 30 years got the entire auditorium on their feet cheering them on. “The greatest tragedy of this is that it could have been avoided … all we needed was just one adult to stand between us and Larry Nassar,” Aly Raisman said in what would be the most impactful words of the night. All of the survivors stayed on the stage long after the end of the show, sharing their historic moment.\n\nCleveland fans aren’t laughing\n\n“It’s true that the ESPYS have never had a host like me before,” Danica Patrick said to open the show as the first female host. Danica’s jab at Cleveland soon sparked a groan from much of the audience — we guess there are some Browns and Cavaliers fans in the house after all. At least Odell Beckham Jr. found her joke about his hair being “questionable” funny.\n\nFew Fergie fans either …\n\nThe “real national anthem controversy” this year wasn’t about NFL players kneeling, Patrick said, as a picture of Fergie butchering the anthem at the NBA All-Star game appeared on the big screen. Oops.\n\nAlex Ovechkin or Putin?\n\nThere weren’t many Trump supporters in the crowd, however. The night’s first political joke from Patrick – “I haven’t seen a Russian this pleased with Washington since … at least two days ago” – was tied to the Stanley Cup Finals but we all know who it was really about. And it sparked the first big cheer of the evening.\n\nAlso Read: ESPYS Parties 2018: Snoop Dogg, Aly Raisman Kick Off Biggest Week in Sports (Updating Photos)\n\nWelcome to L.A., LeBron\n\nEveryone is on Team LeBron, it seems. When Patrick said James was the biggest off- season acquisition the crowd went wild … but there was deadly silence when she made fun of his thinning hair.\n\nOBJ’s calf flash\n\nOBJ was co-presenter for Biggest Breakout Athlete but it was his legs that had the real breakout moment in a very dashing pair of designer shorts. (The actual recipient was Donovan Mitchell, who joins the realm of past winners like Tom Brady, LeBron James and Dak Prescott.) Antonio Brown later showed off his legs in shorts too, these ESPYS veterans clearly know how hot it gets on the red carpet.\n\nQuiz time\n\nThe game played in the first commercial break to entertain attendees picked on random members of the audience. First up was none other than “Black Panther” star Chadwick Boseman, who thankfully knew the name of the biggest NBA scorer in league history. Seattle Seahawks QB Russell Wilson got thrown some movie trivia next but luckily he knew that Boseman starred in “Draft Day.”\n\nHug it out\n\nThe 27-strong US Women’s Hockey team took some time to gather on stage after they won for Best Game because “we’re a hugging team,” admitted one of the Olympic gold medal-winning players.\n\nNational karaoke champions?\n\nThe Notre Dame women’s basketball champions proved that they’re not only good at scoring, they’re also pretty good at karaoke. It was a little of a bumpy start when two of the players took to the stage to show off their singing skills, but like all the best teams, they had a miraculous comeback. In the next ad break however, the warmup host mistakenly said they were from Villanova.\n\nLeBron dominates the red carpet without even being there\n\nIn case you’ve been living under a rock, LeBron James has signed with the LA Lakers. While the former NBA champion wasn’t actually at the ESPYS, that didn’t stop every athlete on the red carpet from being asked what they thought about him coming to Los Angeles.\n\nKing James was also on the mind of one audience member who called out his name when any category was announced. No. 23 for Best College Athlete? No, we don’t think so. Biggest Breakthrough? Not this year.\n\nAlso Read: Tom Brady, LeBron James Lead 2018 ESPYS Nominations\n\nTop names miss TV spots\n\nThough they’re arguably the best athletes in the world, Tom Brady, LeBron James and Roger Federer won categories that weren’t deemed important enough to be featured on TV — possibly because they weren’t able to attend the show — and their victories were announced during a TV time out.\n\nEagles fans at it again\n\nPhiladelphia Eagles fans are known for being crazy and outspoken (to politely put it), and one middle-aged fanatic in a tuxedo proved that by screaming “PHILADELPHIA” when QB Nick Foles won the Championship Award for his Super Bowl LII win … but it was his young son who looked really embarrassed by the outburst.\n\nJon Stewart fires up the audience\n\nJon Stewart complained about the audience’s lack of response when presenting the Pat Tillman Award for Service to Jake Wood. “One cheer for the Marines? Really?” which woke the crowd up to the impact of what former college football player Wood has done in countries like Haiti and for the relief effort in the wake of Hurricane Harvey with Team Rubicon, a non-profit where military veterans lead humanitarian missions to disaster areas.\n\n“He’s also super tall and annoyingly handsome. Last night I saw him making his pregnant wife a hot coffee. I really don’t like this guy,” Stewart said bitterly.\n\nThe former “The Daily Show” host’s kick up the ass of the crowd — plus a very moving video of Team Rubicon’s work — earned Wood the first standing ovation of the night. And yes, he really did make Stewart look short.\n\nAlso Read: WWE Superstars, US Women's Ice Hockey Team Among ESPN Sports Humanitarian Awards Winners\n\nLaila Ali can throw a punch and hold a high note\n\nMuhammad Ali will go down in history as the best boxer ever, but who knew his daughter Laili Ali could belt out a song like Whitney Houston? When passed the mic in a break, Laili showed off her knockout singing chops and some hot dance moves. Oh, and she can box too. In related news, the NFL’s top rookies cannot sing …\n\nAlso Read: Jim Kelly to Receive Jimmy V Perseverance Award at ESPYS\n\nKelly Tough\n\nESPN named Wednesday the official Jimmy V Day in honor of the legendary college basketball coach who made a historic speech about battling cancer. Many athletes including NFL defensive end Calais Campbell wore Jimmy V pins on the red carpet in their support of cancer research. Former Buffalo Bills QB Jim Kelly was later honored with the 2018 Jimmy V Award for Perseverance – and his heartbreaking story of fighting adversity and “never giving up” brought many in the audience to tears. Kelly, whose cancer of the jaw returned this year, delivered another historical speech despite his struggling to speak and needing help to the stage from his two daughters. ESPN host Cari Champion went on to announce that $1.8 million has been raised in the past two days that will go directly to the Stuart Scott Memorial Cancer Research Fund.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2014/05/SPORTS-100.jpg", "https://www.thewrap.com/wp-content/uploads/2018/05/ESPYs-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/06/Tom-Brady-LeBron-James-ESPYS-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2018/07/2018-ESPYS-Red-Carpet.png", "https://www.thewrap.com/wp-content/uploads/2018/07/2018-ESPYS-Red-Carpet-160x105.png", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2018/03/Jim-Kelly-1-1-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg", "keywords": [], "authors": ["Debbie Emery", "Linda Xu", "Tim Baysinger"], "canonical_link": "https://www.thewrap.com/2018-espys-15-things-you-didnt-see-on-tv/", "title": "2018 ESPYS: 15 Things You Didn’t See on TV", "meta_data": {"parsely-title": "2018 ESPYS: 15 Things You Didn’t See on TV", "parsely-link": "https://www.thewrap.com/2018-espys-15-things-you-didnt-see-on-tv/", "parsely-type": "post", "parsely-pub-date": "2018-07-18T21:41:40-07:00", "parsely-section": "awards", "parsely-author": "Debbie Emery", "parsely-tags": "cari-champion, danica-patrick, espn, espys, jim-kelly, odell-beckham-jr", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "The \"sister survivors\" spark tears, Chadwick Boseman shows off his trivia skills and LeBron James is on everyone's mind at ESPN's annual awards show", "news_keywords": "cari champion, danica patrick, espn, espys, jim kelly, odell beckham jr", "original-source": "https://www.thewrap.com/2018-espys-15-things-you-didnt-see-on-tv/", "og": {"locale": "en_US", "type": "article", "title": "2018 ESPYS: 15 Things You Didn't See on TV", "description": "The \"sister survivors\" spark tears, Chadwick Boseman shows off his trivia skills and LeBron James is on everyone's mind at ESPN's annual awards show", "url": "https://www.thewrap.com/2018-espys-15-things-you-didnt-see-on-tv/", "site_name": "TheWrap", "updated_time": "2018-07-19T05:06:57-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/thewrap/", "tag": "Odell Beckham Jr", "section": "News", "published_time": "2018-07-19T04:41:40-07:00", "modified_time": "2018-07-19T05:06:57-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "The \"sister survivors\" spark tears, Chadwick Boseman shows off his trivia skills and LeBron James is on everyone's mind at ESPN's annual awards show", "title": "2018 ESPYS: 15 Things You Didn't See on TV", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg", "creator": "@debemery"}, "generator": "WooFramework 6.2.0", "sailthru.title": "2018 ESPYS: 15 Things You Didn’t See on TV", "sailthru.date": "2018-07-19T04:41:40+00:00", "sailthru.author": "Debbie Emery", "sailthru.tags": "espn,espys,danica patrick,cari champion,odell beckham jr,jim kelly", "sailthru.category": "awards,tv,culture,sports,news", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/07/ESPYS-Stage-2018-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1532000500.0, "source": "https://www.thewrap.com", "summary": ""}