{"url": "https://comicbook.com/starwars/2018/03/22/star-wars-the-last-jedi-rian-johnson-cameo/", "text": "When you get the chance to make a Star Wars film and have been a fan of the saga your whole life, it's hard to pass up an opportunity to appear on screen . The Last Jedi writer/director Rian Johnson might not have appeared in his film in an immediately recognizable capacity, but confirmed on the film's commentary track that he grasps Han Solo's golden dice from the cockpit of the Millennium Falcon in a close-up shot.\n\nAfter clashing with Rey on Ahch-To, Luke Skywalker boards the Falcon in an emotional scene, reflecting on his former ally Han Solo having been killed by Kylo Ren. Upon discovering the dice, Luke takes them from where they hung on the ship and pockets them, ultimately handing them over to his sister Leia in the film's final act.\n\nActor Mark Hamill filmed a majority of this scene, yet Johnson couldn't help but take advantage of the opportunity to lend his own talents to the film by sporting a glove to clutch the dice in the quick shot.\n\nThis is Johnson's second appearance in the Star Wars saga, as he was also a Death Star gunner in Rogue One: A Star Wars Story. The filmmaker returned the favor to Rogue One director Gareth Edwards, who made an appearance as a Resistance trooper during the battle of Crait .\n\nJohnson managed to sneak in quite a few cameos in The Last Jedi, with some being more obvious than others. Actors Joseph Gordon-Levitt and Noah Segan, who have appeared in all of Johnson's films, both made brief appearances, with Gordon-Levitt lending just his voice to an alien character while Segan played a Resistance pilot.\n\nTom Hardy, Take That singer Gary Barlow, and Princes Harry and William all shared a scene together where they played Stormtroopers, yet the scene was reportedly absent from the final cut.\n\nStar Wars fans may have recognized saga staple Warwick Davis' voice during the Canto Bight scene, as the actor voiced one of the aliens in the casino. Even Mark Hamill earned an additional role, providing the vocalizations for the alien who attempts to put coins in BB-8.\n\nYou can get The Last Jedi on Digital HD now and on Blu-ray March 27th.\n\nWhich cameo in The Last Jedi was your favorite? Let us know in the comments below!\n\n[H/T Film School Rejects]", "images": ["https://media.comicbook.com/2017/12/star-wars-the-last-jedi-spoiler-yoda-rian-johnson-mark-hamill-1067137-640x320.jpg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2017/12/star-wars-the-last-jedi-spoiler-yoda-rian-johnson-mark-hamill-1067137-640x320.jpg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/starwars/2018/03/22/star-wars-the-last-jedi-rian-johnson-cameo/", "title": "Star Wars: Rian Johnson Reveals His Secret 'The Last Jedi' Cameo", "meta_data": {"description": "When you get the chance to make a Star Wars film and have been a fan of the saga your whole life, it's hard to pass up an opportunity to appear on screen. The Last Jedi writer/director Rian Johnson might not have appeared in his film in an immediately recognizable capacity, but confirmed on the [...]", "keywords": "Star Wars: The Last Jedi,Rian Johnson", "news_keywords": "Star Wars: The Last Jedi,Rian Johnson", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Star Wars: Rian Johnson Reveals His Secret 'The Last Jedi' Cameo", "description": "When you get the chance to make a Star Wars film and have been a fan of the saga your whole life, [...]", "image": "https://media.comicbook.com/2017/12/star-wars-the-last-jedi-spoiler-yoda-rian-johnson-mark-hamill-1067137-640x320.jpg"}, "og": {"title": "Star Wars: Rian Johnson Reveals His Secret 'The Last Jedi' Cameo", "type": "article", "url": "https://comicbook.com/starwars/2018/03/22/star-wars-the-last-jedi-rian-johnson-cameo/", "image": {"identifier": "https://media.comicbook.com/2017/12/star-wars-the-last-jedi-spoiler-yoda-rian-johnson-mark-hamill-1067137-640x320.jpg", "width": 640, "height": 320}, "site_name": "Star Wars", "description": "When you get the chance to make a Star Wars film and have been a fan of the saga your whole life, [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1521648000.0, "source": "https://comicbook.com", "summary": ""}