{"url": "www.nielsen.com/us/en/insights/news/2018/perspectives-why-you-need-a-comprehensive-ott-strategy.html", "text": "Consumer comfort with the input button is changing viewing forever\n\nIt’s finally done. Without much in the way of fanfare, one of the TV industry’s most challenging obstacles has been cleared: consumers have mastered the art of accessing the wealth of content sitting behind the notorious “input button.”\n\nAccording to recent streaming meter data from Nielsen, consumers in homes with over-the-top (OTT) capabilities spend one out of every 10 minutes of TV usage with OTT platforms or apps. Whether they’re accessing this content through a variety of interfaces or one of many skinny bundles of local and national content, consumers are growing more accustomed to OTT as a primary “input.”\n\nAs all insiders know, this button—an often misunderstood piece of remote control real estate—unlocks a wide range of content for consumers with an array of devices. Historically, that content has fallen outside the scope of traditional audience measurement and monetization. Today, that’s no longer the case. Nielsen has introduced new technologies over the past two years to better understand over-the-top media consumption and allow new ways to market to interested consumers.\n\nSo how do advertisers, content owners and broadcasters already well positioned in the linear TV environment take advantage of where audiences are growing? Luckily, there are some strategies to utilize this change for the better.\n\nGo Where the Party Is\n\nLocal broadcasters have recognized the growth of OTT viewing, and many have taken aggressive steps to create their own apps and include their channel lineups in new skinny bundles offered by familiar and new names alike.\n\nWhen YouTube TV is advertised on nearly every backstop and billboard during the World Series, consumers are going to notice. As a content provider, ensure you reach this audience, or others will fill the void.\n\nDon’t box yourself into traditional advertising or content delivery paradigms\n\nThrough consumer adoption of smartphones, both advertisers and content providers learned you can’t maximize consumer engagement and marketing by simply repurposing the same product and ad models. OTT, like mobile, has the benefits of two-way data that drives precision in targeting and delivery. Advertisers can use OTT to go wide for broad branding campaigns and hypersegmented to motivate consumers to drive purchases.\n\nFor content providers, making different advertising options available combines the best of both worlds: the breadth of interest in high-quality content and improved outreach capabilities.\n\nTrack success and demonstrate value in OTT\n\nAdvertisers can’t assess the merits of OTT if viewing isn’t measured. According to Nielsen measurement, 11% of all viewing minutes in OTT-capable homes is going to these services, and the percentage is even higher among younger audiences. Teenagers ages 12-17 spend a quarter of their time on OTT-enabled TVs using streaming services, while young adults from 18-24 spend almost one in every five minutes with them.\n\nEnsuring that all viewing and ad exposure can be verified by a trusted source—regardless of whether it’s distributed broadly or selectively—will be the difference between “toe in the water” investments and long-term success.\n\nWith OTT, long-term is key. Amazingly enough, OTT seems to be just getting started; low-cost smart TVs and OTT devices have flown off the shelves this year. As features and capabilities expand—and service providers diversify and expand their offerings—the players that find their footing through early trials and experimentation will prove themselves to be the winners.\n\nThis article originally appeared on AdWeek.", "images": ["http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/youtube-footer@2x.png", "http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/twitter-footer@2x.png", "https://www.nielsen.com/wp-content/uploads/sites/3/2019/04/usflagicon.png", "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/n-square@2x.png", "https://www.nielsen.com/wp-content/uploads/sites/3/2019/04/jeff-wender.jpg?w=1110", "https://www.nielsen.com/wp-content/uploads/sites/3/2020/04/baseball-diamond-full-widthj.jpg", "http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/newsletter-icon@2x.png", "https://www.nielsen.com/wp-content/themes/nielsen-dotcom/dist/images/location-menu-submit.png", "https://www.nielsen.com/wp-content/uploads/sites/3/2019/08/full-width-image-millennials-with-media.jpg", "http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/fb-footer@2x.png", "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/n-tab@2x.png", "http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/in-footer@2x.png", "https://www.nielsen.com/wp-content/uploads/sites/3/2020/01/Total-Audience-Feb-2020-seo.jpg", "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/open-graph-default.png", "http://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/rss-footer@2x.png"], "top_img": "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/open-graph-default.png", "keywords": [], "authors": [], "canonical_link": "https://www.nielsen.com/us/en/insights/article/2018/perspectives-why-you-need-a-comprehensive-ott-strategy/", "title": "Why You Need a Comprehensive Over-The-Top Strategy. And Now.", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "msapplication-TileImage": "https://www.nielsen.com/wp-content/uploads/sites/3/2019/06/cropped-Logo-n-Square-Blue-RGB-1024x1024.png?fit=270%2C270", "og": {"url": "https://www.nielsen.com/us/en/insights/article/2018/perspectives-why-you-need-a-comprehensive-ott-strategy", "type": "website", "title": "Why You Need a Comprehensive Over-The-Top Strategy. And now.", "description": "The “input button,” an often misunderstood piece of remote control real estate, unlocks a wide range of content for consumers with an array of devices, and it’s no longer invisible to audience measurement.", "image": "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/open-graph-default.png"}, "twitter": {"image": "https://www.nielsen.com/wp-content/themes/nielsen-base/dist/images/open-graph-default.png"}}, "movies": [], "publish_date": null, "source": "http://www.nielsen.com", "summary": ""}