{"url": "en.wikipedia.org/wiki/Secret_in_Their_Eyes", "text": "For the 2009 film on which this film was based, see The Secret in Their Eyes\n\nSecret in Their Eyes is a 2015 American psychological thriller film written and directed by Billy Ray and a remake of the 2009 Argentine film of the same name, both based on the novel El secreto de sus ojos by author Eduardo Sacheri. The film stars Chiwetel Ejiofor, Nicole Kidman, Julia Roberts, Dean Norris, and Michael Kelly.\n\nThe film was released by STXfilms on November 20, 2015. It received mixed reception from critics, who praised its performances but compared it unfavorably to the original.\n\nPlot [ edit ]\n\nIn 2002, shortly after 9/11, Ray Kasten (Ejiofor), a counterterrorism agent for the FBI, and his friend Jessica \"Jess\" Cobb (Roberts), an investigator for the Los Angeles district attorney's office, meet new ADA Claire Sloan (Kidman). Jess and Ray receive a call about an unknown female body found in a dumpster near a local mosque, which Ray has been investigating for possible terrorist links. At the crime scene, both are devastated to discover that the victim is Jess's 18-year-old daughter, Carolyn (Zoe Graham), whose body has been bleached inside and out to destroy DNA evidence of both rape and murder.\n\nRay, who was supposed to meet Carolyn to plan a surprise party for Jess, feels responsible for what happened to her, while Jess feels the increasing need to move out of the city. While helping Jess pack, Ray notices pictures from a picnic thrown for law enforcement in which a young man is seen staring at Carolyn. Ray scans the photo and matches it to Anzor Marzin (Joe Cole), who is an informant in the terrorism probe. D.A. Martin Morales (Molina) is reluctant to go after Marzin, fearing it would compromise the terrorism investigation. Officer Reggie Siefert (Kelly) brings in a suspect named Aban Ghazala (Amir Malaklou), who Ray realizes is not the killer.\n\nRay forces Siefert to admit that he set up Ghazala as a patsy to protect Marzin. Ray and Detective Bumpy Willis (Norris) track down and arrest Marzin at Dodger Stadium. Claire argues with Ray over his methods while seemingly defending Marzin, saying he wasn't capable of the crime. Claire taunts Marzin, provoking him to expose himself and punch her, saying he's going to give Claire what Carolyn got. Ray beats Marzin, which leads to Morales ordering Marzin released. As Marzin gloats, an enraged Ray suggests they kill him before he gets away, but Jess refuses to go that route, saying death would be too easy on him. After his release, the police find Marzin's van, but Siefert burns it to destroy the evidence against Marzin.\n\nThirteen years later, Ray, now head of security for the New York Mets, returns to Los Angeles and reunites with Claire, now the D.A., while Jess, who has been asocial since the loss of her daughter, is Claire's top investigator. Ray has found a man named Clay Beckwith (Cole), who he believes is Marzin living under an alias. The investigation eventually leads to a shootout with Beckwith in which Siefert is killed. Beckwith and his men are arrested, but Jess insists that Beckwith is not Marzin.\n\nWhen Ray and Claire pay a visit to Jess's isolated farmhouse, she confesses that she found and killed Marzin thirteen years previously, shortly after Ray left Los Angeles. Later, Ray follows Jess into her barn and discovers that Marzin is actually alive, having been imprisoned in a cage for over a decade. Marzin begs Ray to ask Jess to talk to him. Ray pulls out his gun and leaves it with Jess as he goes outside and starts digging a grave. Ray hears Jess shooting Marzin. The two meet each other with a sense of relief while Claire officially closes Carolyn's case.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nOn January 20, 2015, STX Entertainment acquired the US rights to the film. STX also produced the film.[4]\n\nFilming [ edit ]\n\nPrincipal photography began on January 26, 2015, in Los Angeles.[5] On January 27, filming took place at the Santa Anita Park.[6]\n\nRelease [ edit ]\n\nSTX had initially scheduled the film for release on October 23, 2015,[7] but in July 2015, the film was moved back to its eventual November 20, 2015 release date.[8]\n\nThe film's first trailer was released on June 30, 2015.[9]\n\nHome media [ edit ]\n\nSecret in Their Eyes was released on DVD and Blu-ray in the United States on February 23, 2016.[10]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nSecret in Their Eyes grossed $20.2 million in North America and $12 million in other territories for a worldwide total of $32.2 million, against a budget of $19.5 million.[3]\n\nIn North America, the film opened alongside The Hunger Games: Mockingjay – Part 2 and The Night Before on November 20, 2015. In its opening weekend, it was projected to gross $7–9 million from 2,392 theaters.[11] The film made $170,000 from its early Thursday night screenings and $2.3 million on its first day. In its opening weekend, the film grossed $6.7 million, finishing fifth at the box office.[2]\n\nCritical response [ edit ]\n\nOn Rotten Tomatoes, the film has an approval rating of 39% based on 145 reviews, with an average rating of 5.3/10. The site's critical consensus reads, \"Secret in Their Eyes wastes its incredible cast on a remake that fails to improve upon—or even make a compelling case for its own existence in addition to—the remarkable original.\"[12] On Metacritic, the film has a score of 45 out of 100, based on 28 critics, indicating \"mixed or average reviews\".[13] On CinemaScore, audiences gave the film an average grade of \"B–\" on an A+ to F scale.[14] Writer Manuel Betancour of Remezcla states the film, \"offers a textbook example of what often gets lost in translation when foreign films are remade for American audiences.\"[15]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/4/41/Secret_in_Their_Eyes_poster.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/41/Secret_in_Their_Eyes_poster.jpg/220px-Secret_in_Their_Eyes_poster.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/41/Secret_in_Their_Eyes_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Secret_in_Their_Eyes", "title": "Secret in Their Eyes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/41/Secret_in_Their_Eyes_poster.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}