{"url": "https://en.wikipedia.org/wiki/Jenna_Dewan", "text": "American actress\n\nJenna Lee Dewan ( ; born December 3, 1980) is an American actress and dancer. She started her career as a backup dancer for Janet Jackson, and later worked with artists including P!nk, Missy Elliott, and Christina Aguilera. She is known for her role as Nora Clark in the 2006 film Step Up. She has also starred on the short-lived NBC series The Playboy Club and had a recurring role on the FX series American Horror Story: Asylum. She portrayed Freya Beauchamp on the Lifetime series Witches of East End, Lucy Lane in The CW series Supergirl and Joanna in the Netflix series Soundtrack. Dewan was hosted the reality television shows World of Dance and Flirty Dancing.\n\nEarly life [ edit ]\n\nDewan was born in Hartford, Connecticut, the daughter of Nancy Smith (née Bursch) and Darryll Dewan, who was a running back on the 1972 Notre Dame football team.[1] Her father is of Lebanese and Polish descent and her mother is of German and English ancestry.[2][3][4]\n\nAs a child, Dewan moved frequently; she mentioned in an interview that she lived in seven cities before reaching the seventh grade.[5] While attending high school at Notre Dame Preparatory School in Towson, Maryland, Dewan was a varsity cheerleader. She transferred to Grapevine High School in Grapevine, Texas. She was also a varsity cheerleader there and was voted prom queen during her senior year. She went to University of Southern California and was a member of the California Gamma chapter of Pi Beta Phi.[6][7]\n\nCareer [ edit ]\n\nDancing [ edit ]\n\nDewan first appeared in Janet Jackson's \"Doesn't Really Matter\" video in 2000 and later in \"All for You\" and the people All for theTour in 2001.[8] She credits working with Jackson for aiding her career, allowing her to later work with many other artists and giving her the experience necessary to co-star in the dance film Step Up.[9] In 2016, Dewan modeled as the face of dancewear manufacturer Danskin in a campaign and photo shoot that captured and featured her athleticism as a dancer.[10]\n\nActing [ edit ]\n\nIn 2006, Dewan co-starred with Channing Tatum in Step Up, as well as starring in Take the Lead that same year.\n\nIn August 2008, Dewan starred in the Lifetime made-for-television film Fab Five: The Texas Cheerleader Scandal which follows five rule-breaking teens. She portrayed the role of disciplinarian Coach Emma Carr. In November 2009, she appeared in the straight-to-DVD comedy American Virgin alongside Rob Schneider.\n\nIn March 2011, Dewan was cast in the NBC pilot of The Playboy Club. In May 2011, NBC picked up the series for a full season. She portrayed the role of Bunny Janie, a provocative Playboy bunny who works at a Playboy Club in Chicago in 1961. The series premiered on September 19 to 5.2 million viewers with mixed reviews from critics. Due to low ratings, NBC cancelled the series after just three episodes in October 2011.\n\nIn November 2011, Dewan starred in the film The Jerk Theory. This was first released in Germany in 2009. It was later released in the United States in November 2011.\n\nDewan appeared in the romantic-comedy film 10 Years, produced by her then husband Channing Tatum. The film was released on September 14, 2012. That same year, she appeared as Teresa Morrison in American Horror Story: Asylum, the second season of the horror television series.\n\nIn 2013, Dewan began starring in the Lifetime series Witches of East End as Freya Beauchamp, one of the lead characters. In late 2015, she began a recurring role in the CW series Supergirl as Lucy Lane. She also had a recurring role in ABC's The Resident. Dewan's upcoming projects include The Wedding Year, Berlin, I Love You and Soundtrack.[11][12][13][14][15]\n\n33andOut Productions [ edit ]\n\nAlong with friends Reid Carolin, Adam Martingano, Brett Rodriguez and Channing Tatum, Dewan started a production company called 33andOut Productions.[16] Their first production is a documentary called Earth Made of Glass that follows Rwandan President Paul Kagame and genocide survivor Jean-Pierre Sagahutu. It premiered at the 2010 Tribeca Film Festival.[17] Dewan and Tatum collaborated in a YouTube Premium web television series Step Up: High Water, where they executive produced together.\n\nPersonal life [ edit ]\n\nIn 2006, Dewan met actor Channing Tatum on the set of their film Step Up. They began dating shortly after filming had finished.[18] The couple became engaged in early September 2008 in Maui[19] and married on July 11, 2009,[20] at Church Estates Vineyards in Malibu, California.[21] Their daughter Everly Elizabeth Maiselle Tatum, was born in May 30th, 2013 in London, England.[22][23] In an interview on the Late Show with David Letterman, Tatum explained that his daughter Everly's two middle names are from Dewan's grandmother, Elizabeth, and his own grandmother, Maiselle.[24]\n\nOn April 2, 2018, after nearly nine years of marriage, the couple announced that they were separating.[25][26] Six months later, Dewan filed for divorce from Tatum.[27] Their divorce was finalized in November 2019.[28]\n\nIn October 2018, it was confirmed that Dewan is in a relationship with actor Steve Kazee.[29][30] In September 2019, it was announced that the couple were expecting their first child together.[31] In February 2020, she and Kazee announced their engagement.[32][33] The couple welcomed a son, Callum Michael Rebel, on March 6, 2020.[34]\n\nDewan is an animal rights activist and a vegan.[35] PETA declared her to be one of three \"Sexiest Vegans\" of 2017.[36]\n\nDewan is raising her daughter as a vegetarian but says she will let her decide what to eat when she is old enough.[37]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nWeb [ edit ]\n\nYear Title Role Notes 2008 Assorted Nightmares: Janitor Jennifer Episode 1 2017 Embarrasing Vision Boards from Our Past Herself\n\nProducer [ edit ]\n\nYear Title Role Notes 2010 Earth Made of Glass Executive producer Documentary 2018–2019 Step Up: High Water Executive producer Web television series 2020 Flirty Dancing Producer Television series\n\nMusic videos [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Jenna_Dewan_2012.jpg/220px-Jenna_Dewan_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Jenna_Dewan_2012.jpg/1200px-Jenna_Dewan_2012.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Jenna_Dewan_2012.jpg/1200px-Jenna_Dewan_2012.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jenna_Dewan", "title": "Jenna Dewan", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Jenna_Dewan_2012.jpg/1200px-Jenna_Dewan_2012.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}