{"url": "en.wikipedia.org/wiki/Flip_or_Flop", "text": "American reality television series\n\nFlip or Flop Genre Reality television Starring Tarek El Moussa\n\nChristina Anstead Country of origin United States Original language(s) English No. of seasons 8 No. of episodes 110 (as of December 21, 2019) Production Running time 30 minutes Production company(s) Pie Town Productions Release Original network HGTV Original release April 16, 2013 ( ) –\n\npresent Chronology Related shows Flip or Flop (franchise) External links Website\n\nFlip or Flop is a television series airing on HGTV hosted by the formerly-married couple Tarek El Moussa and Christina Anstead.[1] The show is the original show in the Flip or Flop franchise and was renewed for an eighth season which premiered on August 1, 2019.[2]\n\nOn December 12, 2019, the series was renewed for a ninth season which will premiere in August 2020.[3]\n\nPremise [ edit ]\n\nChristina Anstead and Tarek El Moussa were married real estate agents in Orange County, CA. After the real estate crash in 2008, they began flipping homes in the Orange County area.\n\nIn 2011, Tarek asked a friend to help him make an audition tape for HGTV filming an entire episode of the process of house flipping from start to finish. The audition tape was sent to HGTV and in 2012 the couple[4] was signed to make Flip or Flop [5]\n\nChristina's expertise is primarily in design, and she works with Tarek to find and renovate homes. She handles the designs of the new spaces and keeps everything on schedule. The show follows them as they buy homes, typically bank-owned, short sales or foreclosures, to renovate and resell.[6]\n\nHosts [ edit ]\n\nPersonal life [ edit ]\n\nTarek El Moussa and Christina Anstead met while working in the real estate industry. The couple married in 2009 and they have two children, a girl named Taylor Reese and a boy named Brayden James.[7] When the housing market plummeted after the October 2008 stock market crash they went from living in a $6,000 per month home to a $700 per month apartment, inspiring them to focus on flipping houses.[8]\n\nIn 2013, a registered nurse and viewer, Ryan Reade, contacted the network after seeing a lump on Tarek's neck during a Flip or Flop marathon. After Reade contacted producers, Tarek was diagnosed with testicular cancer [9]and thyroid cancer.[10] The El Moussas thanked Reade in a video that can be seen on HGTV.com.[11] Tarek has been in remission for six years.\n\nIn May 2016, the couple separated after an incident at their Southern California home. According to a Yorba Linda, CA police report, Christina called the police after Tarek fled their home with a gun, believing he was suicidal.[12] Tarek was found by the police, and maintained that he was never suicidal and had simply gone for a hike, taking a gun to protect himself from wild animals.[13] In January 2017, Tarek officially filed for divorce from Christina.[14]\n\nReal estate career [ edit ]\n\nTarek and Christina ran a real-estate agency, The El Moussa Group, in Orange County, California, an area with one of the largest foreclosure rates in the country. Tarek, Christina, and their partner Pete De Best, bought their first investment house in Santa Ana for $115,000. After selling the property for a profit of $34,000, the trio split the money and continued to flip houses, expanding their real estate investing business into Arizona and Nevada.[15] Following their divorce, The El Moussa Group was dissolved and is now run under the name Tarek and Associates.[16]\n\nIn 2018 Tarek and Christina co-founded a real estate education course called Real Estate Elevated.[17]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 13 April 16, 2013 ( ) May 28, 2013 ( 2013-05-28 ) 2 14 April 8, 2014 ( ) July 8, 2014 ( 2014-07-08 ) 3 15 October 7, 2014 ( ) July 7, 2015 ( 2015-07-07 ) 4 15 December 3, 2015 ( ) March 24, 2016 ( 2016-03-24 ) 5 15 June 9, 2016 ( ) September 22, 2016 ( 2016-09-22 ) 6 15 December 1, 2016 ( ) March 30, 2017 ( 2017-03-30 ) 7 20 June 15, 2017 ( ) September 6, 2018 ( 2018-09-06 ) 8 18 August 1, 2019 ( ) December 12, 2019 ( 2019-12-12 )\n\nReferences [ edit ]\n\n\n\n", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/42px-Ambox_current_red.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/14/Flip_or_Flop_Logo.jpg/250px-Flip_or_Flop_Logo.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Flip_or_Flop", "title": "Flip or Flop", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}