{"url": "https://web.archive.org/web/20190601033726/https://www.dailymail.co.uk/tvshowbiz/article-6196223/Justin-Bieber-Hailey-Baldwin-share-steamy-kiss-strip-swimwear-Italy.html", "text": "Advertisement\n\nHe has reportedly rented a $13,000 a night villa at the Belmond Hotel Caruso in Ravello to enjoy with the love of his life.\n\nAnd Justin Bieber and fiancée Hailey Baldwin continued to flaunt their chemistry as they shared a steamy kiss while enjoying some time aboard a luxury yacht on the Amalfi Coast on Friday.\n\nThe Canadian singer, 25, looked like he was having the time of his life as he spent quality time with his soon to be wife who was absolutely smokin' hot in a skimpy black bikini.\n\nLove is in the air: Justin Bieber and fiancée Hailey Baldwin continued to flaunt their chemistry as they shared a steamy kiss while enjoying some time aboard a luxury yacht on the Amalfi Coast on Friday\n\nGetaway: The Canadian singer, 25, looked like he was having the time of his life as he spent quality time with his soon to be wife who was absolutely smokin' hot in a skimpy black bikini\n\nHailey proved her rising model status as she showed off her impossibly flat stomach and perky cleavage in the tiny bikini top, which features exaggerated cup detailing.\n\nThe daughter of Stephen Baldwin teamed the look with matching bottoms, which put prominence on her long, lean legs.\n\nThe beauty oozed body confidence in the barely-there two-piece as she soaked up the sunshine with her love Justin, who was unable to peel his attention away from her as he kissed her.\n\nThe lovebirds proved they were well and truly meant for each other as they looked happy and relaxed in each other's presence.\n\nBikini-clad: Hailey proved her rising model status as she showed off her impossibly flat stomach and perky cleavage in the tiny bikini top, which features exaggerated cup detailing\n\nWow: The daughter of Stephen Baldwin teamed the look with matching bottoms, which put prominence on her long, lean legs\n\nPucker up: The beauty oozed body confidence in the barely-there two-piece as she soaked up the sunshine with her love Justin, who was unable to peel his attention away from her as he kissed her\n\nChilling: The lovebirds proved they were well and truly meant for each other as they looked happy and relaxed in each other's presence\n\nTaking a break from his hectic superstar schedule, Justin was clearly enjoying the slower pace of life as he went shirtless to exhibit his plethora of tattoos.\n\nThe Sorry hitmaker opted for a pair of navy swimshorts with a white drawstring and he sported longer locks.\n\nThe genetically gifted couple looked to be in the mood for some adrenaline as they enjoyed some time in the water before making their way back on board.\n\nJustin was seen attempting to dry himself off by propping a towel on his shoulders, while a pair of diving goggles rested on his head.\n\nTime to unwind: Taking a break from his hectic superstar schedule, Justin was clearly enjoying the slower pace of life as he went shirtless to exhibit his plethora of tattoos\n\nFun in the sun: The genetically gifted couple looked to be in the mood for some adrenaline as they enjoyed some time in the water before making their way back on board\n\nAll about her: Justin then positioned a towel on his mane to help it dry quicker, and made his Hailey were they began putting on a very passionate display\n\nIntense: While they were joined by a few pals on the yacht, they were nowhere to be seen as the twosome began intensely locking gazes and subsequently, locking lips\n\nJustin then positioned a towel on his mane to help it dry quicker, and made his Hailey were they began putting on a very passionate display.\n\nWhile they were joined by a few pals on the yacht, they were nowhere to be seen as the twosome began intensely locking gazes and subsequently, locking lips.\n\nIn between showering each other with kisses, Hailey and Justin seemed immersed in an intense conversation.\n\nBond: In between showering each other with kisses, Hailey and Justin seemed immersed in an intense conversation\n\nTime for dessert! The pair's PDA packed session appeared to happen following their lunch\n\nPassion: Justin looked well and truly in love as he ensured that the blonde beauty was kept close by\n\nJust the two of them! There was no signs of stopping as the pair continued their smitten display\n\nHe's a Belieber! Justin appeared to be wowed by Hailey's beauty as he softly touched her wet locks while she looked at him\n\nNo stopping: Despite their whirlwind engagement, the two seemed stronger than ever as the saucy display continued long into the afternoon\n\nAfter enjoying a steamy session in the sun with Hailey, Justin worked up a chill and decided to cover up with a grey hoodie.\n\nHowever, after the couple reached their destination he decided to exhibit his inkings by going shirtless yet again, while Hailey slipped into a neon yellow minidress.\n\nThe catwalk star's bright number perfectly complemented her bronzed glow and she accessorised with a statement gold necklace, while ensuring her locks were piled up off her face.\n\nHailey opted for maximum comfort in a pair of white trainers as she sauntered along with Justin. The What Do You Mean hitmaker opted for one of his signature style statement as he wore socks with sandals.\n\nCool: After enjoying a steamy session in the sun with Hailey, Justin worked up a chill and decided to cover up with a grey hoodie\n\nHot couple: However, after the couple reached their destination he decided to exhibit his inkings by going shirtless yet again, while Hailey slipped into a neon yellow minidress\n\nBright: The catwalk star's bright number perfectly complemented her bronzed glow and she accessorised with a statement gold necklace, while ensuring her locks were piled up off her face\n\nWalk this way: Hailey opted for maximum comfort in a pair of white trainers as she sauntered along with Justin\n\nPerky posterior: The model laid out on top of the yacht flaunting her enviable figure in a tiny black bikini\n\nTrendy: The What Do You Mean hitmaker opted for one of his signature style statement as he wore socks with sandals\n\nAll about him: Hailey flashed a coy smile as Justin garnered attention by putting on an animated display\n\nIt was soon time for another outfit change as Hailey switched her bold yellow number for a knitted pink jumper dress.\n\nThe cosy number fell at a thigh-skimming length and she opted for the same pair of comfortable trainers.\n\nHailey toted all of her belongings in a bright orange handbag while Justin appeared to be keeping his essentials in his pockets.\n\nThe pair continued to revel in each other's company as they indulged in chatter and giggles while sauntering along.\n\nStylish: It was soon time for another outfit change as Hailey switched her bold yellow number for a knitted pink jumper dress\n\nSwitching things up: The cosy number fell at a thigh-skimming length and she opted for the same pair of comfortable trainers\n\nJust what they need: Hailey toted all of her belongings in a bright orange handbag while Justin appeared to be keeping his essentials in his pockets\n\nWhat's so funny? The pair continued to revel in each other's company as they indulged in chatter and giggles while sauntering along\n\nFamous! The twosome were frequently stopped by adoring fans as they took in the Italian sights\n\nIt's likely the two are doing wedding planning while on their getaway. The couple obtained their marriage license one week ago in New York City, meaning they have only 53 days before the license expires.\n\nA local reporter from Il Vescovado told the site that they are staying in the small town of Ravello, which is on the Amalfi coast.\n\nThe villa comes with a private butler and chef as well as a private garden and stunning views of the Italian coast, the site added.\n\n'Yesterday, he spent €8000 ($9,500) on a bottle of Petrus wine. He also loves pasta alla bolognese and loves the privacy of Ravello,' the reporter claimed.\n\nTying the knot: It's likely the two are doing wedding planning while on their getaway. The couple obtained their marriage license one week ago in New York City, meaning they have only 53 days before the license expires\n\nInsider: A local reporter from Il Vescovado told the site that they are staying in the small town of Ravello, which is on the Amalfi coast\n\nImpressive: The villa comes with a private butler and chef as well as a private garden and stunning views of the Italian coast, the site added\n\nStepping up: The loved-up pair relaxed on the boat as Hailey showed off her enviable tanned long legs and Justin showed off his tattoos\n\nSpeaking of the couple's spending, the reporter revealed: 'Yesterday, he spent €8000 ($9,500) on a bottle of Petrus wine. He also loves pasta alla bolognese and loves the privacy of Ravello'\n\nTMZ report the singer's team have counselled him into getting paperwork drawn up to protect his reported $250m fortune, with Hailey thought to be worth around $2m.\n\nThe report claims the prenup is about to be signed, and the couple will not marry until all the paperwork is in order.\n\nDespite both Justin and Hailey taking their vows seriously, thanks to their religious views, it's thought they have both agreed a prenup would be sensible.\n\nMoney: TMZ report the singer's team have counselled him into getting paperwork drawn up to protect his reported $250m fortune, with Hailey thought to be worth around $2m\n\nProtection: The report claims the prenup is about to be signed, and the couple will not marry until all the paperwork is in order\n\nThinking it through: Despite both Justin and Hailey taking their vows seriously, thanks to their religious views, it's thought they have both agreed a prenup would be sensible\n\nDespite technically making it legal, the IMG Model insisted she was 'not married yet' via Twitter on September 14.\n\nAccording to TMZ, the Hillsong Church duo now have 53 days to make their nuptials official in New York state, and then they'll move into the $5M four-bedroom Ontario mansion mansion he bought.\n\nJustin and the Drop the Mic co-host - who got engaged on July 7 - previously dated off/on in 2015-2016, but they've been inseparable ever since June.\n\nEyebrows raised at the millennial duo (who first met in 2009) considering Bieber only split from his on/off girlfriend since 2010, pop diva Selena Gomez, six months ago.\n\nNo ceremony yet: Despite technically making it legal, the IMG Model insisted she was 'not married yet' via Twitter on September 14\n\nPlans: According to TMZ, the Hillsong Church duo now have 53 days to make their nuptials official in New York state, and then they'll move into the $5M four-bedroom Ontario mansion mansion he bought\n\nDating history: Justin and the Drop the Mic co-host - who got engaged on July 7 - previously dated off/on in 2015-2016, but they've been inseparable ever since June\n\nWhirlwind: Eyebrows raised at the millennial duo (who first met in 2009) considering Bieber only split from his on/off girlfriend since 2010, pop diva Selena Gomez, six months ago\n\nDrying off: The couple wrapped towels around each other and chilled out on the boat\n\nHolding hands: The couple enjoyed food together and packed on the PDA during lunch on the yacht\n\nGoing for a dip: The loved up pair donned their swimsuits as the slipped into the water\n\nSwimming: The couple jumped into the water for a snorkel after relaxing on the boat\n\nAffection: The model stroked her future husband on the back as the pair relaxed over lunch on the yacht", "images": ["https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/16/4472708-6196223-image-a-85_1537631252005.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/fff2/images/2018/9/22/6722d8d24b53237148acb61d6f514251.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/fff2/images/2018/9/22/c23fe2cde98314b638553943b80fd1b1.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470916-0-image-m-107_1537615724004.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470824-6196223-image-a-143_1537616969672.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/30/17/14159792-0-image-m-1_1559235410526.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470940-6196223-image-a-381_1537619311581.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472694-6196223-image-a-9_1537622277645.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470936-6196223-image-m-394_1537619771417.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/16/14202832-0-image-a-1_1559316922831.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/22/14216456-0-image-a-194_1559339839937.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470744-6196223-image-a-201_1537617612099.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470912-6196223-image-a-289_1537618489690.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470794-6196223-image-m-229_1537617730602.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/16/14203882-0-image-a-19_1559318020826.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/20/14211300-0-image-a-11_1559331375036.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470780-6196223-image-a-126_1537616600793.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/21/14213180-0-image-m-31_1559334455598.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4470948-6196223-Money_TMZ_report_the_singer_s_team_have_counselled_him_into_gett-a-1_1537621710127.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/16/14202550-0-image-m-5_1559315920302.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4470712-6196223-No_ceremony_yet_Despite_technically_making_it_legal_the_IMG_Mode-a-2_1537621710130.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472660-6196223-image-a-19_1537622725906.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/10/4469378-0-image-m-83_1537608312316.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/20/14210340-0-image-a-39_1559331551443.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/19/14117416-0-image-a-88_1559328102841.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470984-6196223-image-m-365_1537619246252.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470724-6196223-image-a-414_1537619915490.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/comments/articles/icon_comments_74.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470834-6196223-image-m-287_1537618484978.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470828-6196223-image-a-214_1537617659615.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/fff-logo-lowercase.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472662-6196223-image-a-16_1537622686777.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/16/14203644-0-image-a-30_1559317336946.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/fff-banner-extrawide.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470664-6196223-Fun_in_the_sun_The_genetically_gifted_couple_looked_to_be_in_the-a-393_1537619370439.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470674-6196223-image-a-227_1537617723214.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470718-0-image-a-108_1537615728908.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4470884-6196223-Protection_The_report_claims_the_prenup_is_about_to_be_signed_an-a-3_1537621710130.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/03/14219360-0-image-a-41_1559355540007.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470804-6196223-image-a-212_1537617649818.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470746-6196223-image-a-199_1537617606695.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/23/14217708-0-image-a-6_1559342859999.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470908-6196223-image-a-308_1537618926179.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470730-6196223-image-a-174_1537617203993.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4471004-6196223-image-m-311_1537618956193.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470990-6196223-image-m-354_1537619177607.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/fff-hub-banner-extrawide.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470998-6196223-image-a-312_1537618960124.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4471188-0-image-a-150_1537617013555.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470996-6196223-image-a-318_1537619009782.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470852-6196223-image-m-391_1537619365276.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/01/14219242-0-image-a-10_1559347360794.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470930-6196223-image-a-332_1537619079238.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470784-6196223-image-a-424_1537619967240.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470838-6196223-image-a-173_1537617203992.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470734-6196223-image-m-413_1537619905671.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/29/12/14095944-0-image-a-16_1559128324071.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470764-6196223-image-m-272_1537618392092.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/29/23/14124010-0-image-m-19_1559169888666.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4471000-6196223-image-m-359_1537619214335.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/00/14219162-0-image-m-24_1559347065786.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/16/4472704-6196223-image-a-89_1537631418956.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/23/14216968-0-image-m-10_1559340801094.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470660-6196223-image-a-403_1537619864733.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/23/14216806-0-image-a-18_1559340605344.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472686-6196223-image-a-14_1537622491443.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470806-6196223-image-a-280_1537618449923.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470994-6196223-image-a-366_1537619250115.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470700-6196223-image-m-226_1537617718519.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/comments/articles/btn_add-your-comment.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470766-6196223-image-m-421_1537619951547.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470906-6196223-image-a-257_1537618319636.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470716-6196223-Fun_in_the_sun_The_genetically_gifted_couple_looked_to_be_in_the-a-392_1537619370433.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470956-6196223-image-a-346_1537619138959.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470862-6196223-After_enjoying_a_steamy_session_in_the_sun_with_Hailey_Justin_wo-a-360_1537619218343.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/23/14217386-0-image-a-29_1559342100389.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/16/14203704-0-image-m-63_1559317841562.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470816-6196223-image-m-279_1537618442920.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/02/14220864-0-image-a-17_1559351736933.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470944-6196223-image-a-328_1537619055354.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4471002-6196223-image-a-355_1537619179815.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/00/14217628-0-image-m-76_1559343843876.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470854-6196223-image-a-276_1537618424293.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/30/21/14167630-0-image-a-3_1559249524927.jpg", "https://web.archive.org/web/20190601033726im_/https://secure-au.imrworldwide.com/cgi-bin/m?ci=us-910471&cg=0&cc=1&ts=noscript", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/29/04/14083864-0-image-m-1_1559102320405.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470720-6196223-image-a-422_1537619955946.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/19/14209910-0-image-a-51_1559329184555.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470980-6196223-image-a-363_1537619242826.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470808-6196223-image-a-131_1537616632880.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/hub_link.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470856-6196223-image-m-275_1537618414967.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470934-6196223-image-a-333_1537619079240.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470864-6196223-image-m-317_1537618999306.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470918-6196223-image-a-385_1537619327077.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/23/14217802-0-image-a-78_1559343244996.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/29/14/14100480-0-image-m-19_1559136715983.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472698-6196223-image-a-13_1537622444773.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/15/14198744-0-image-a-23_1559311866836.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/01/14218698-0-image-a-18_1559347696414.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/02/14221324-0-image-m-36_1559352773478.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470710-6196223-image-m-142_1537616965035.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/21/14214180-0-image-a-4_1559336008598.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/18/14206828-0-image-a-14_1559322726839.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470802-6196223-image-a-230_1537617736962.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/06/01/02/14220322-0-image-a-38_1559350889443.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/fff2/images/2018/9/22/3b9cfeedc1a41518a576868919110c84.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/29/13/14097522-0-image-m-40_1559131661126.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470830-6196223-image-a-270_1537618383181.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470860-6196223-image-m-331_1537619071665.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/16/4474594-0-image-m-549_1537629436829.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470668-6196223-image-a-187_1537617570780.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470848-6196223-image-m-269_1537618377927.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470970-6196223-image-a-356_1537619179816.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470844-6196223-image-a-139_1537616878565.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/14/4472692-6196223-image-a-5_1537621962046.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470756-6196223-image-a-231_1537617737002.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/14/14197590-0-image-a-1_1559309348610.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/fff-hub-promo-banner-inline.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/fff2/images/2018/9/22/28eb9c7c2d7163cfa016193863d5f8a0.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470840-6196223-image-m-172_1537617200991.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470732-6196223-image-a-228_1537617723214.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470954-6196223-image-a-380_1537619311581.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/fff2/images/2018/9/22/24f0915824bba2e2a1d340d86ea3decb.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1s/2019/05/31/14/14198962-0-image-m-1_1559311046815.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470842-6196223-image-a-219_1537617664234.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470972-6196223-image-m-306_1537618918424.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470946-6196223-image-a-307_1537618926178.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/09/4468772-0-image-m-36_1537605231527.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/furniture/fff/preload-inline.gif", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/i/sitelogos/dm_com_29.png", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4470958-6196223-image-a-123_1537616384024.jpg", "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/13/4470820-6196223-image-a-288_1537618489689.jpg"], "top_img": "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4471188-0-image-a-150_1537617013555.jpg", "keywords": [], "authors": ["Jabeen Waheed For Mailonline"], "canonical_link": "https://web.archive.org/web/20190601033726/https://www.dailymail.co.uk/tvshowbiz/article-6196223/Justin-Bieber-Hailey-Baldwin-share-steamy-kiss-strip-swimwear-Italy.html", "title": "Justin Bieber and Hailey Baldwin share a steamy kiss in Italy", "meta_data": {"keywords": "dailymail,,tvshowbiz,justin-bieber", "news_keywords": "dailymail,,tvshowbiz,justin-bieber", "description": "Justin Bieber and fiancée Hailey Baldwin continued to flaunt their chemistry as they shared a steamy kiss while enjoying some time aboard a luxury yacht on the Amalfi Coast on Friday.", "original-source": "https://www.dailymail.co.uk/tvshowbiz/article-6196223/Justin-Bieber-Hailey-Baldwin-share-steamy-kiss-strip-swimwear-Italy.html", "channel": "Celebrities,Entertainment,TV,Tv&Showbiz", "Rating": "General", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Justin Bieber and Hailey Baldwin share a VERY steamy kiss in Italy", "description": "Justin Bieber and fiancée Hailey Baldwin continued to flaunt their chemistry as they shared a steamy kiss while enjoying some time aboard a luxury yacht on the Amalfi Coast on Friday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-6196223/Justin-Bieber-Hailey-Baldwin-share-steamy-kiss-strip-swimwear-Italy.html", "image": "https://i.dailymail.co.uk/1/2018/09/22/12/4471188-0-image-a-150_1537617013555.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 6196223, "divclasspage": "articlePage", "robots": "noodp,noydir,all,noarchive", "googlebot": "noodp,noydir,all,noarchive", "mol": {"headline": "Justin Bieber and Hailey Baldwin PICTURE EXCLUSIVE: Engaged couple share a VERY steamy kiss as they strip down to their swimwear aboard a luxury yacht in Italy"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2018-09-22T12:38:46+0100", "modified_time": "2018-09-23T01:01:17+0100", "section": "TV&Showbiz", "tag": "Justin Bieber Hailey Baldwin share steamy kiss strip swimwear Italy", "author": "https://www.facebook.com/DailyMailCeleb"}, "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Justin Bieber and Hailey Baldwin share a VERY steamy kiss in Italy", "type": "article", "description": "Justin Bieber and fiancée Hailey Baldwin continued to flaunt their chemistry as they shared a steamy kiss while enjoying some time aboard a luxury yacht on the Amalfi Coast on Friday.", "url": "https://web.archive.org/web/20190601033726/https://www.dailymail.co.uk/tvshowbiz/article-6196223/Justin-Bieber-Hailey-Baldwin-share-steamy-kiss-strip-swimwear-Italy.html", "image": {"identifier": "https://web.archive.org/web/20190601033726im_/https://i.dailymail.co.uk/1/2018/09/22/12/4471188-0-image-a-150_1537617013555.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://web.archive.org/web/20190601033726/https://videos.dailymail.co.uk/video/mol/2018/09/22/5271452869910677934/1024x576_MP4_5271452869910677934.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/6196223/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/6196223/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1537616326.0, "source": "https://web.archive.org", "summary": ""}