{"url": "http://twilightsaga.wikia.com/wiki/Jacob_Black_and_Renesmee_Cullen", "text": "\"Jacob and Renesmee seemed alike in so many ways, both half-and-half beings, two things at the same time.\" ―Bella on Renesmee and Jacob's similarities.[src]\n\nJacob Black imprinted on Renesmee Cullen, the daughter of Bella Swan and Edward Cullen, at birth in Book 2 of Breaking Dawn. Jacob was initially in love with Bella, but she chose Edward and gave birth to Renesmee, a half-human, half-vampire hybrid.\n\nAs part of the imprinting, Jacob will only be a brother figure to Renesmee until she comes of age, by which time she may develop romantic feelings for him, and vice versa.\n\nIn the movies, Jacob is portrayed by Taylor Lautner and Renesmee by Mackenzie Foy.\n\n\"The murderer stared past Rosalie's shoulder at me, its gaze more focused than any newborn creature's gaze should be.\"\n\n\"Warm brown eyes, the color of milk chocolate—the exact same color that Bella's had been.\"\n\n\"My shaking jerked to a stop; heat flooded through me, stronger than before, but it was a new kind of heat—not a burning.\"\n\n\"It was glowing.\"\n\n\"Everything that made me who I was—my love for the dead girl upstairs, my love for my father, my loyalty to my new pack, the love for my other brothers, my hatred for my enemies, my home, my name, my self—disconnected from me in that second—snip, snip, snip—and floated up into space.\"\n\n\"I was not left drifting. A new string held me where I was. Not one string, but a million. Not strings, but steel cables. A million steel cables all tying me to one thing—to the very center of the universe.\"\n\n\"I could see that now—how the universe swirled around this one point. I'd never seen the symmetry of the universe before, but now it was plain.\"\n\n\"The gravity of the earth no longer tied me to the place where I stood.\"\n\n\"It was the baby girl in the blonde vampire's arms that held me here now.\"\n\n\"Renesmee.\" ―Jacob imprinting on Renesmee[src]\n\nContents show]\n\nPrehistory Edit\n\nJacob Black Edit\n\n\"She's the most wonderful person in the whole world.\" ―Jacob to Charlie about Renesmee.[src]\n\nQuileute shape-shifter Jacob Black was born and raised in La Push, Washington. After his mother died in a car accident and his twin sisters moved away, he became his father's only family. He phased for the first time when he was 16 years old.\n\nHe was originally in love with Renesmee's mother, Bella, and fought to win her over from her vampire boyfriend Edward Cullen. At the end of Eclipse, he tried to convince Bella that he was the better choice for her, but she chose Edward. Jacob ran away from home after receiving their wedding invitation and tried to escape his pain by living as a wolf. He returns to attend their wedding reception and nearly gets into a fight with Edward. His fellow wolves restrained him and took him away before he could phase.\n\nWhen the pack found out that Bella was pregnant, their immediate reaction was to kill Bella in order to kill her baby, who they believed to be a monster at the time. Jacob broke Sam's alpha order in order to protect Bella, and Leah and Seth joined him. During her pregnancy, he continues to protect Bella from the pack. After her daughter, Renesmee is born by cesarean section, Jacob imprints on her, and is completely over Bella. After Bella is thought to be dead, the wolves attack the Cullens. Jacob stops the fight and lets Sam know that he imprinted. Due to their absolute law that forbids killing imprints, the wolves are forced to leave and declare permanent peace.\n\nRenesmee Cullen Edit\n\n\"I love humans. And wolf-people, like my Jacob.\" ―Renesmee on Jacob.[src]\n\nRenesmee Carlie Cullen is the daughter of Bella and Edward Cullen, and was conceived during their honeymoon on Isle Esme. At first, Edward didn't want her because she was hurting Bella from the inside, but couldn't do anything to stop the pregnancy because Renesmee's aunt Rosalie was guarding Bella, at her own request. Rosalie's choice also influenced her husband Emmett, and parents Esme and Carlisle, and so Edward couldn't force Bella to have an abortion. While Bella was pregnant with Renesmee, she and Jacob felt incredibly drawn to each other and neither one of them knew the reason for this bizarre attraction because it wasn't based on their love for each other. In truth, Jacob was drawn to the unborn Renesmee, and vice versa. Renesmee had felt his presence from the womb, as well as the presence of the rest of her family.\n\nHistory Edit\n\nBreaking Dawn Edit\n\nIn Breaking Dawn, Jacob assumes that Bella has become a vampire after hearing that she and Edward have returned from their honeymoon and demands the pack to attack the Cullens. When Sam Uley, the Alpha wolf refuses, he decides to go alone. However, he finds out that Bella is pregnant with a vampire hybrid, much to his shock. He talks with Edward, who doesn't want the baby because it is killing Bella, but can't do anything because his sister Rosalie is guarding Bella, at her own request. Rosalie's choice also influences Rosalie's husband, Emmett, and their parents Esme and Carlisle, and so Edward can't force Bella to have an abortion. Jacob and Bella feel incredibly drawn to each other after that first encounter, which they both find as \"weird\". In truth, Jacob is really drawn to baby Renesmee and vice versa.\n\nUpon hearing of Bella's pregnancy, the pack then plans on killing Bella and the baby because they see it as a threat. Jacob rebels against Sam's authority as Alpha. He embraces his Alpha heritage and breaks away from the pack and runs off on his own. Seth and Leah Clearwater join him shortly after and help him guard the Cullen house and prevent Sam's pack from attacking.\n\nWhile guarding the Cullen house, Jacob visits Bella daily because of the gravitational force that compels him to be near her, despite the fact that he is still emotionally hurt by her rejection. Subsequently, Bella also feels the need to have him nearby.\n\nA few days later, Edward hears the baby's mind for the first time, and he learns that it loves both Bella and him. At that moment, his hatred for the baby replaces with newfound love, leaving Jacob feeling betrayed. Edward asks Jacob, as heir to the chief, Ephraim Black, for permission to change Bella into a vampire after the birth of the child in order to save them, and Jacob grants that permission.\n\nEverything has been carefully planned, but it all spins out of control when the birth happens one day early: the placenta suddenly detaches, and Renesmee begins to suffocate and tries to tear her way free, breaking several of Bella's bones in the process. Jacob performs CPR while Edward delivers the baby by cesarean section and then injects Bella's body with venom. Jacob is furious, believing that Bella had died giving birth, and goes to destroy the \"monster\" that killed her, but the moment they look into each other's eyes, he imprints on her. Jacob describes it as losing his connection to everything else, and the connection to Renesmee is the only one that matters now. Jacob is completely over Bella and the wolves are forbidden to harm Renesmee, because it is against pack law to hurt or kill the person a wolf imprints on - there is no exception to this of all the pack laws. The pack is then left with no choice but to make permanent peace with the Cullens.\n\nWhen Bella awakens two days later as a vampire, Edward takes her out on her first hunt to quench her thirst while Rosalie and Jacob stay near Renesmee for protection. Upon returning from her first hunt, she finds Jacob outside the house to test whether she was ready to see her child. She calls it ridiculous, passing it, then, indoors, and very cautiously, she meets her daughter. Bella is completely enraged when she learns that Jacob has imprinted on her baby, threatening him to stay away from Renesmee, and then lunges for his throat when she finds out that he has nicknamed the baby \"Nessie\", the nickname of the Loch Ness Monster. Seth jumps in the way of the attack and gets his shoulder and collarbone broken in the process.\n\nThe Cullens talk about leaving Forks to avoid Charlie, Bella's father. Jacob, however, does not want to be away from Renesmee and goes to visit him to tell him that the world is not what he thought it was. He also tells him that Bella was sick before and had to change \"a little\" in order to get better, without revealing that his daughter had become a vampire. He also tells him that if he could deal with the weird and pretend that things are normal, then Bella will be able to stay for a while longer. Charlie requests to be told as little as possible about the supernatural so that he may be able to deal with it. Jacob reveals himself by phasing in front of Charlie.\n\nCharlie wishes to see Bella, but Jacob insists on telling them everything first to give them a heads up. Bella does not like what Jacob has done and demands a full report. After telling her everything and Charlie's request, she is relieved, though still unsure about her self-control. After a long day without hurting Charlie, Bella feels amazed at her control and is thankful to Jacob. And so, Renesmee is able to stay with Jacob.\n\nOver the next three months, Jacob visits the Cullens daily to play with their daughter. Even though Bella and Edward know that his imprinting on their daughter was involuntary, they still feel annoyed by it all. But what bothers them most is Renesmee's rapidly growing state, which Jacob hides behind his smiles.\n\nIn early winter, Bella, Jacob, and Renesmee go hunting, and Bella catches sight of Irina from the Denali coven, who mistakes Renesmee for an immortal child (a human child transformed into a vampire) and reports to the Volturi. The Cullens decide to gather as many friends as possible to help them witness that Renesmee is not Newborn to avoid the Volturi's slaughter. Jacob feels anxious with each addition of human-feeding vampire but does not express it as he knows the purpose they play in saving Renesmee and their families.\n\nMeanwhile, Bella has a lawyer J. Jenks create fake IDs and documents for Renesmee and Jacob, hoping that they would be able to escape the Volturi and start a new life somewhere in Rio where they might run into Jasper and Alice. Knowing he will do anything to protect her, she finally comes to accept their relationship wholeheartedly.\n\nOn Christmas Day, Edward, Bella, Renesmee, and Jacob visit Charlie to celebrate the holiday. Jacob has braided a Quileute bracelet for Renesmee, which is the Quileute version of a promise ring. Edward is annoyed by his choice of gift, but Bella copes, knowing that they will have to hand their daughter over in his care: the bracelet is merely a sign of devotion. After Christmas, Jacob stands guard at Renesmee's tent planted near the clearing where the Volturi was said by Alice to arrive.\n\nDuring the Cullens' trial with the Volturi, Bella and Edward present their daughter to Aro, with Jacob acting as their bodyguard and Renesmee grabs his tail to pull him back when they retreat. Renesmee finds herself feeling slightly more relaxed with Jacob's presence. When the situation begins to escalate to violence, Bella, Edward, Renesmee, and Jacob share a tearful goodbye as they give her to him for protection, prompting the rest of their family and friends to say their goodbyes as well. Edward calls Jacob \"his son\" proving that he too has accepted him. The trial ends peacefully with the testimony of Nahuel, another vampire hybrid, and everyone is allowed to return to their peaceful lives. Their worries for Renesmee's unpredictable growth and life expectancy are also put at ease through this encounter.\n\nAfter hearing from Nahuel that Renesmee would be fully grown after seven years, Edward is impressed with Jacob for not having thought about her maturity even once. Bella remarks that she is in no hurry for Renesmee to grow up.\n\nNear the end of Breaking Dawn - Part 2, Alice has a vision of the confrontation turning violent, and Jacob takes Renesmee away at Bella's request, and manage to escape despite the approach of Santiago, a Volturi guard. However, the fight is prevented in the end, and Jacob and Renesmee stay with their families. At the end of the movie, Alice and Edward share a vision of Jacob and a fully grown-up Renesmee, confirming that they will be together in the future.", "images": ["https://vignette.wikia.nocookie.net/twilightsaga/images/c/c6/Quileute_bracelet.jpg/revision/latest/scale-to-width-down/250?cb=20130825095920", "https://vignette.wikia.nocookie.net/twilightsaga/images/b/b6/JBRC_Imprint.png/revision/latest/scale-to-width-down/250?cb=20120220020524", "https://vignette.wikia.nocookie.net/twilightsaga/images/0/0d/99b-listen_to_jacob%2C_bella.png/revision/latest/scale-to-width-down/250?cb=20111213160350", "https://vignette.wikia.nocookie.net/xavier-riddle-and-the-secret-museum/images/9/97/N2losLW-asset-kids-mezzanine1-16x9-N70Tdc3.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190910004306", "https://images.wikia.nocookie.net/__cb68/twilightsaga/images/8/89/Wiki-wordmark.png", "https://vignette.wikia.nocookie.net/adoptme/images/6/61/Wikia_from_DreamCraft.png/revision/latest/zoom-crop/width/100/height/56?cb=20200324164245", "https://vignette.wikia.nocookie.net/twilightsaga/images/0/07/1111.png/revision/latest/scale-to-width-down/250?cb=20110919175058", "https://vignette.wikia.nocookie.net/twilightsaga/images/6/60/Edward%2C_bella%2C_renesmee_y_jacob.jpg/revision/latest/scale-to-width-down/250?cb=20130131171250", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/twilightsaga/images/b/b9/Breaking-dawn-part-2-e.jpg/revision/latest/scale-to-width-down/300?cb=20120704114654", "https://vignette.wikia.nocookie.net/twilightsaga/images/b/bc/Jacob%2C_Renesmee_%26_Bella.jpg/revision/latest/scale-to-width-down/250?cb=20130430014054", "https://vignette.wikia.nocookie.net/twilightsaga/images/2/2e/Edward-jacob-renesmee-bella.jpg/revision/latest/scale-to-width-down/250?cb=20130214065139", "https://vignette.wikia.nocookie.net/twilightsaga/images/5/5f/Renesmee-baby.jpg/revision/latest/scale-to-width-down/250?cb=20120201042758", "https://vignette.wikia.nocookie.net/twilightsaga/images/b/b9/Breaking-dawn-part-2-e.jpg/revision/latest/scale-to-width-down/2000?cb=20120704114654", "https://vignette.wikia.nocookie.net/twilightsaga/images/7/70/Renesmeeuntaggedpic.jpg/revision/latest/scale-to-width-down/180?cb=20130223124752", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/twilightsaga/images/7/7f/Jacob-555644_429620497081182_285483444_n.jpg/revision/latest/scale-to-width-down/180?cb=20120728050833", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802"], "top_img": "https://vignette.wikia.nocookie.net/twilightsaga/images/b/b9/Breaking-dawn-part-2-e.jpg/revision/latest/scale-to-width-down/2000?cb=20120704114654", "keywords": [], "authors": [], "canonical_link": "https://twilightsaga.fandom.com/wiki/Jacob_Black_and_Renesmee_Cullen", "title": "Jacob Black and Renesmee Cullen", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Twilight Saga Wiki,twilightsaga,Jacob Black and Renesmee Cullen,Jacob Black,Renesmee Cullen,Breaking Dawn,Bella Swan,Edward Cullen,Hybrid,Taylor Lautner,Mackenzie Foy,Quileute,Shape-shifter", "description": "Jacob Black imprinted on Renesmee Cullen, the daughter of Bella Swan and Edward Cullen, at birth in Book 2 of Breaking Dawn. Jacob was initially in love with Bella, but she chose Edward and gave birth to Renesmee, a half-human, half-vampire hybrid. As part of the imprinting, Jacob will only be a...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://twilightsaga.fandom.com/wiki/Jacob_Black_and_Renesmee_Cullen", "title": "Jacob Black and Renesmee Cullen | Twilight Saga Wiki | Fandom", "description": "Jacob Black imprinted on Renesmee Cullen, the daughter of Bella Swan and Edward Cullen, at birth in Book 2 of Breaking Dawn. Jacob was initially in love with Bella, but she chose Edward and gave..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Twilight Saga Wiki", "title": "Jacob Black and Renesmee Cullen", "description": "Jacob Black imprinted on Renesmee Cullen, the daughter of Bella Swan and Edward Cullen, at birth in Book 2 of Breaking Dawn. Jacob was initially in love with Bella, but she chose Edward and gave birth to Renesmee, a half-human, half-vampire hybrid. As part of the imprinting, Jacob will only be a brother figure to Renesmee until she comes of age, by which time she may develop romantic feelings for him, and vice versa.", "url": "https://twilightsaga.fandom.com/wiki/Jacob_Black_and_Renesmee_Cullen", "image": "https://vignette.wikia.nocookie.net/twilightsaga/images/b/b9/Breaking-dawn-part-2-e.jpg/revision/latest/scale-to-width-down/2000?cb=20120704114654"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://twilightsaga.fandom.com/wiki/Jacob_Black_and_Renesmee_Cullen"}, "movies": [], "publish_date": null, "source": "http://twilightsaga.wikia.com", "summary": ""}