{"url": "https://friends.fandom.com/wiki/Lauren_Tom", "text": "Crew Lauren Tom Gender Female Date of birth August 4, 1961 Production Number of episodes 7\n\n\n\nLauren Tom (born August 4, 1961) is an American actress. She played Julie on Friends.\n\nContents show]\n\nBiography\n\nEarly life\n\nTom, a Chinese American, was born in Highland Park, Illinois, the daughter of Nancy (née Dare) and Chan Tom, who worked in the frozen food business. She was born on the same day as President Barack Obama: August 4, 1961. She was raised Catholic. In an article for Detour Magazine, Tom describes an experience she had as a child where other children were teasing her about her Chinese heritage. This caused her to become a rather introverted person which, in turn, is what originally inspired her to get into dancing.\n\nTheater\n\nAt the age of 17, Tom landed a spot with a touring company of A Chorus Line. She was cast in the Broadway version of the show less than a year later. She won an Obie Award for her off-broadway acting, and she's been in such other Broadway shows as Hurlyburly and Doonesbury. During her six years in New York Theatre, Tom worked with directors Peter Sellars and Joanne Akalaitis.\n\nFilm\n\nTom had several small parts in movies including Nothing Lasts Forever, Wall Street, See No Evil, Hear No Evil, and Blue Steel; but her biggest role to date was as a waitress in the Robin Williams/Tim Robbins film Cadillac Man. This role led to being a guest on The Tonight Show with Johnny Carson. Tom landed a starring role in the film The Joy Luck Club in 1993, which led to roles in such other films such as When a Man Loves a Woman and North.\n\nSince the mid-90s, Tom has starred in few films (focusing her work, primarily, in the voiceover business), with the exceptions of a supporting role in the 2003 hit comedy Bad Santa and the critically-acclaimed 2004 film In Good Company.\n\nTelevision\n\nLauren Tom's first role in television was that of Miko Wakamatsu on The Facts of Life. She subsequently appeared on The Equalizer, thirtysomething, Quantum Leap, Chicago Hope, Homicide: Life on the Street, Grace Under Fire and Pretty Little Liars, Supernatural, and a starring role in DAG, The Division, Monk, My Wife and Kids, Barbershop: The Series, Grey's Anatomy, Andi Mack, The Closer, and Men in Trees. On Friends, Lauren Tom played Ross' second season girlfriend, Julie.\n\nVoice acting\n\nTom began vocal work in the animated series Superman: The Animated Series (as Angela Chen). From there Lauren had minor roles on Pinky and the Brain, Extreme Ghostbusters and The Zeta Project before landing her lasting roles on King of the Hill and later Futurama.\n\nShe has also lent her voice to All Grown Up!, Rocket Power, Max Steel, Batman Beyond, Justice League Unlimited, Kim Possible, Numbuh Three (and Adult Numbuh Three in the episode \"Operation: I.N.T.E.R.V.I.E.W.S.\") and Numbuhs 44 and 45 on Codename: Kids Next Door, Teen Titans, Yan Lin, Susan, Alchemy on W.I.T.C.H., The Replacements, Legion of Super Heroes, Jake's mom, Counselor Chang on American Dragon: Jake Long, and Avatar the Last Airbender (as Joo Dee).\n\nOther animated movies Tom has voiced include Mulan II, Kim Possible: The Secret Files, Kim Possible Movie: So The Drama, Batman Beyond: Return of the Joker, the four Futurama movies Bender's Big Score, The Beast with a Billion Backs, Bender's Game, and Into the Wild Green Yonder.", "images": ["https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest/zoom-crop/width/100/height/56?cb=20200327133046", "https://vignette.wikia.nocookie.net/friends/images/6/63/Lauren_Tom.jpeg/revision/latest?cb=20121011215010", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://vignette.wikia.nocookie.net/friends/images/8/89/Wiki-wordmark.png/revision/latest?cb=20180501111732", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802"], "top_img": "https://vignette.wikia.nocookie.net/friends/images/6/63/Lauren_Tom.jpeg/revision/latest?cb=20121011215010", "keywords": [], "authors": [], "canonical_link": "https://friends.fandom.com/wiki/Lauren_Tom", "title": "Lauren Tom", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Friends Central,friends,Lauren Tom,Julie,Friends,Robin Williams,Ross,Second season", "description": "Lauren Tom (born August 4, 1961) is an American actress. She played Julie on Friends. Tom, a Chinese American, was born in Highland Park, Illinois, the daughter of Nancy (née Dare) and Chan Tom, who worked in the frozen food business. She was born on the same day as President Barack Obama...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://friends.fandom.com/wiki/Lauren_Tom", "title": "Lauren Tom | Friends Central | Fandom", "description": "Lauren Tom (born August 4, 1961) is an American actress. She played Julie on Friends. Tom, a Chinese American, was born in Highland Park, Illinois, the daughter of Nancy (née Dare) and Chan Tom..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Friends Central", "title": "Lauren Tom", "description": "Lauren Tom (born August 4, 1961) is an American actress. She played Julie on Friends. Tom, a Chinese American, was born in Highland Park, Illinois, the daughter of Nancy (née Dare) and Chan Tom, who worked in the frozen food business. She was born on the same day as President Barack Obama: August 4, 1961. She was raised Catholic. In an article for Detour Magazine, Tom describes an experience she had as a child where other children were teasing her about her Chinese heritage. This caused her...", "url": "https://friends.fandom.com/wiki/Lauren_Tom", "image": "https://vignette.wikia.nocookie.net/friends/images/6/63/Lauren_Tom.jpeg/revision/latest?cb=20121011215010"}, "apple-itunes-app": "app-id=963580101, app-arguments=https://friends.fandom.com/wiki/Lauren_Tom"}, "movies": [], "publish_date": null, "source": "https://friends.fandom.com", "summary": ""}