{"url": "http://transcripts.cnn.com/TRANSCRIPTS/1309/10/cfr.01.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nCROSSFIRE\n\nShould U.S. Trust Russia on Syria?\n\nAired September 10, 2013 - 18:28 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nANNOUNCER: Tonight on CROSSFIRE, as President Obama prepares to address the nation, he hits the pause button on attacking Syria. Should he follow Russia's lead or keep threatening a military strike?\n\n\n\nJOHN KERRY, SECRETARY OF STATE: Nothing focuses the mind like the prospect of a hanging.\n\n\n\nANNOUNCER: On the left, Van Jones. On the right, S.E. Cupp. In the CROSSFIRE, Joe Lieberman, who supports the strike on Syria, and Rick Santorum, who's opposed. Is Russia's diplomacy real? Or should the U.S. strike Assad now? Tonight on CROSSFIRE.\n\n\n\nVAN JONES, CO-HOST: Welcome to CROSSFIRE. I'm Van Jones on the left.\n\n\n\nS.E. CUPP, CO-HOST: I'm S.E. Cupp on the right.\n\n\n\nTonight, the world is giddy at the prospect of getting out of a U.S. military strike on Syria. It's all thanks to Russia's offer of a diplomatic solution, even though it's a phony one. Nevertheless, the president's team is more than happy to take credit for it.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nKERRY: Well, it's the credible threat of force that has been on the table for these last weeks that has, for the first time, brought this regime to even acknowledge that they have a chemical weapons arsenal.\n\n\n\nREP. NANCY PELOSI (D-CA), MINORITY LEADER: This is a victory for President Obama, if it is real.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCUPP: Van, it seems like Nancy Pelosi is ready to order the \"mission accomplished\" banner. Look, everyone wants to parachute out of this conflict. I get that. But the Russians have offered us not a parachute but a knapsack. A knapsack that will never open. This is nothing more than a delay tactic.\n\n\n\nJONES: Well, I disagree. First of all, I think the world is rightfully happy that we are off the path to war, possibly. The diplomatic option is a good thing. And frankly, everybody is giving John Kerry a hard time. I would rather for us to blunder on the path to peace than to stumble onto the path of war.\n\n\n\nCUPP: If this were proposal -- if this proposal were real and offered up by legitimate, good actors, I would be happy to consider it.\n\n\n\nJONES: Well, welcome to the real world, where you don't get the chance to pick who offers you a solution to this thing.\n\n\n\nLook, we've got two former presidential candidates and two former senators -- both the same person -- tonight on CROSSFIRE to help us with this thing.\n\n\n\nRICK SANTORUM (R), FORMER PENNSYLVANIA SENATOR: Two friends, I might add. And two friends.\n\n\n\nJONES: And two friends. Republican Rick Santorum is against attacking Syria. Democratic former senator, now independent, Joe Lieberman, he supports the strike.\n\n\n\nThe first question to you. You've got to be happy now. We've got a big diplomatic opening. You've got to be on President Obama's team now. You're happy, right?\n\n\n\nCUPP: Leading question.\n\n\n\nSANTORUM: If there's not going to be a military attack, that's a good thing. So if the president is willing to step down for whatever reason, look, he -- he went to the Congress because he didn't want to do this. If he wanted to do it, he'd said he had the power to do it. And he just decided not to.\n\n\n\nWhen you consider the fact that, whether it's on immigration or health care or on DOMA or on a whole variety of things --\n\n\n\nJONES: But are you --\n\n\n\nSANTORUM: -- he's done things that he doesn't have the power to do. Now he has the power to do something, and he went to Congress. So it's clear he didn't want to do this.\n\n\n\nJONES: You're on team Obama now.\n\n\n\nSANTORUM: I'm on team \"let's not broaden this war and put a much more complicated diplomatic situation and military situation in the hands of someone who's proved incapable of handling the situation.\"\n\n\n\nJONES: We'll argue about that later.\n\n\n\nCUPP: Senator Lieberman, why after two years and 100,000 people dead, two chemical attacks, two million refugees, why is pausing yet again to dither on this conflict the smart or moral decision?\n\n\n\nJOE LIEBERMAN (I), FORMER CONNECTICUT SENATOR: Well, I wish we were not pausing. I mean, I think President Obama made the right moral decision when he drew the red line --\n\n\n\nCUPP: Right.\n\n\n\nLIEBERMAN: -- and then when he said, after we had proof that chemical weapons were used to kill almost 1,500 innocents, including 426 children by Assad in Syria, that he was going to take military action.\n\n\n\nI was really surprised and disappointed when he decided to toss it to Congress. He was right. He had the legal authority to do it himself. I wish he had done it. If he had, I think the American people would have been happy now that he had done it.\n\n\n\nCUPP: Should he attack now? Should he attack now without Congress?\n\n\n\nLIEBERMAN: I -- well, I think, now that Russia has made this offer, even though it's hard to take it seriously coming from Russia which hasn't been our friend -- just look at the Snowden matter.\n\n\n\nCUPP: Right.\n\n\n\nLIEBERMAN: Look at Syria, where Assad -- John Kerry said correctly last week that he tried very hard to reach an agreement with Assad years ago as a senator and decided he was a liar.\n\n\n\nJONES: But you're not saying we should through this peace offering in the garbage can and then -- and then attack now. Is that what you're saying?\n\n\n\nLIEBERMAN: No, I'm saying that it's hard to take the proposal by Russia seriously, but it's important enough that we've got to challenge them to be serious about it and see if Syria really will, with international supervision and penalties, get rid of all their chemical weapons. If they did that, it would be a tremendous accomplishment.\n\n\n\nBut I think the president still has to face the fact, if nothing happens, that there was a chemical attack --\n\n\n\nSANTORUM: The bottom line is here we have no national security interests.\n\n\n\nJONES: We don't have any national security interests when children are being chemically --\n\n\n\nSANTORUM: Then we should be in Darfur. Then we should be in 50 other countries around the world.\n\n\n\nJONES: Hold on.\n\n\n\nSANTORUM: That is not --\n\n\n\nCUPP: What about --\n\n\n\nSANTORUM: That is not a reason.\n\n\n\nCUPP: What about al Qaeda?\n\n\n\nSANTORUM: I wish -- I wish -- that is the point. The point is we have no set national security interest, because the two sides of this conflict are both enemies of the United States. We have al Qaeda, who is basically the dominant rebel force right now, on one side and we have on the other side Hezbollah, Iran, Russia and Assad. JONES: I don't understand what you want to do, though. Here's my problem. You are a leader on Syria. You are a big supporter and, frankly, the author of the Syrian Accountability Act.\n\n\n\nSANTORUM: I was.\n\n\n\nJONES: And now you seem to have completely disappeared. What is it that you think that should happen? I want to show you -- show you these images that have shocked the world. Can we show these images?\n\n\n\nLook at these children. They're twitching. They're dying. What if one of the mothers of one of those children called this station right now and said to you, \"Why won't you help me? Why won't you help my children?\" You're saying there's no interest in doing that.\n\n\n\nSANTORUM: The reason the United States -- and I think Joe will agree with me on this. We may disagree on where we come out, but the reason the United States uses military forces for one reason and one reason only. It's in our national security interests.\n\n\n\nJONES: We have no moral obligation?\n\n\n\nSANTORUM: We have no moral obligation to use military force when it comes to a humanitarian situation. We have other obligations.\n\n\n\nJONES: Look, what -- but what can we do?\n\n\n\nSANTORUM: We need to get involved. We need to -- the Syrian Accountability Act was about political sanctions. It was about economic sanctions. It was no trip wire for military force. And when the president used the Syrian Accountability Act as reasons for Congress to support him, he misled the American public on that.\n\n\n\nCUPP: Senator Santorum --\n\n\n\nSANTORUM: As the author, I know that.\n\n\n\nCUPP: Senator Santorum, I know you. We go back a little ways. We've had some conservations about faith and morality and values, social conservatism. I don't understand -- help me understand -- how you square your conscience with not going in and ending a conflict where hundreds of thousands have died? How -- how are you not concerned that this will become another Rwanda?\n\n\n\nLIEBERMAN: They're fighting for their freedom, incidentally, which is what America's supposed to be all about.\n\n\n\nCUPP: Yes. And how -- aren't you worried this will be another Rwanda?\n\n\n\nLIEBERMAN: This didn't start out as al Qaeda.\n\n\n\nSANTORUM: I agree. And I called for military force 18 months ago.\n\n\n\nCUPP: Right. As did I. As did I.\n\n\n\nLIEBERMAN: I met with the opposition. And there -- these were patriots, Syrian patriots, freedom fighters --\n\n\n\nSANTORUM: Agreed.\n\n\n\nLIEBERMAN: -- who were sick of the dictator.\n\n\n\nSANTORUM: Agreed.\n\n\n\nLIEBERMAN: We held back and al Qaeda came in. I don't think al Qaeda is the dominant force in the opposition. I think from all I know it's the Syrian people who want to change from Assad. And they deserve --\n\n\n\n(CROSSTALK)\n\n\n\nJONES: I want to give him a chance to say something, because listen, I want to double down on peace. I don't want to double down on war. I think that we have diplomatic options we haven't exhausted. My quarrel with the president all week long has been we're rushing to war.\n\n\n\nBut my problem is, I want to double down on peace; some people want to double down on war. It seems like you're doubling down on nothing. What do you want us to do?\n\n\n\nSANTORUM: Let's -- let's --\n\n\n\nJONES: If you were the president, what would you do?\n\n\n\nSANTORUM: Well, first off, go back and look at the debates that occurred about 18 months ago. And I, in those debates, called for the president to intervene, to side with exactly the people that Joe Lieberman was talking about, and get involved, give them --\n\n\n\nJONES: So we had an interest then, but we don't have an interest now?\n\n\n\nHold on a second. How do we have an interest then and not now?\n\n\n\nCUPP: Everything has changed.\n\n\n\nSANTORUM: Everything has changed. Everything has changed. The people who are the rebels in Syria right now are not the same people that we --\n\n\n\nCUPP: That's right.\n\n\n\nSANTORUM: That we could have been partners with 18 months ago.\n\n\n\nLIEBERMAN: But it's not going to get better if we hang back. I mean, if we get involved in one level and support the moderates there -- and there are moderates there who are our friends -- then they'll have a better opportunity to control the country when Assad goes.\n\n\n\nRight now, I think we've got to hang tough. And tonight, the president's got a real challenge, but -- because of all of the twists and turns of the story -- but he's got a great opportunity to tell people why he thinks it's worth us carrying out limited but decisive attacks. CUPP: What does he need to say tonight? What does he need to say tonight?\n\n\n\nLIEBERMAN: Well, I think he needs to say, one, we can't -- we can't handle every problem in the world. But Americans, you know, we have a Declaration of Independence that talks about the self-evident truth that everybody -- not just Americans but in the world -- got from our creator the rights to life and liberty. And these people in Syria have been deprived of both of those rights.\n\n\n\nCUPP: Right.\n\n\n\nLIEBERMAN: But here's the point. If you let a dictator mass murder his people and you turn away from it, he's going to keep going. And every other madman is going to keep going.\n\n\n\nCUPP: Sure. And haven't we learned this lesson?\n\n\n\nSANTORUM: Two different -- two different lessons. First off, there are lot -- there are lots of dictators, unfortunately, in this world who are mass murdering their people. We've seen it. We've seen it under President Obama. We saw it under President Bush. It's under presidents for decades now. The United States has not stepped in unless there's a national security interest military. We've stepped in in other ways, but we have not stepped in militarily.\n\n\n\nBut the president is going to change that and say that humanitarian reasons and the reason we're going to step in and -- and engage in military conflict. We are broadening -- you want to talk about not being a cop on the beat. You want to talk about something you and folks that -- that have been advocating for us to have -- make peace not war. We've now opened up Pandora's box as to military use. It's a bad idea. It's not in the security interests.\n\n\n\nJONES: I want -- I want you to respond to this. My quarrel with the president is I think he did two things right and one thing wrong. I think he was right to say this is an outrage, and we're not going to let babies get gassed.\n\n\n\nCUPP: And then do nothing about it?\n\n\n\nJONES: I think that was right. I think he was wrong to rush into a war posture without talking to Congress, without bringing in the U.N., without bringing a global coalition, without exhausting --\n\n\n\nSANTORUM: He did that when he set the red line, with Russia. And he set the red line --\n\n\n\nCUPP: Months ago.\n\n\n\nJONES: And he did -- and I think he did. Because he waited -- and I'm surprised you say you wish we'd gone in -- because he waited, we now have a new opening.\n\n\n\nDo you disagree that the president, by putting those warships out there and waiting, don't you agree he created an opening now for peace? You're saying that the president has done nothing right this whole crisis?\n\n\n\nSANTORUM: If we believe Putin and Assad are legitimate actors in the diplomatic stage. Well, but that's who's come forward, and it's not --\n\n\n\nCUPP: It's who we got.\n\n\n\nSANTORUM: It's who we got. And so, look, I'm perfectly willing to let this play out. I want us to not strike Syria --\n\n\n\nJONES: You and me both.\n\n\n\nSANTORUM: -- because I think streaking Syria, at this point in time, will create a real problem for us militarily with Russia, with potentially others in the region.\n\n\n\nWe are taking -- and I think Joe will agree with me on this one. The whole Syria conflict at this point, has taken our eye off the ball. And the ball is Iran. Syria is a puppet state of Iran.\n\n\n\nLIEBERMAN: That's exactly the reason why we can't let Assad get away.\n\n\n\nCUPP: That's right. Iran is watching.\n\n\n\nLIEBERMAN: It's the biggest body blow we could land to Iran. He's their only ally in the Arab world. And this -- even this proposal, which if it works for Russia, will be a good thing. The price of it will be that Assad will stay there, and Iran will still have its No. 1 ally in the Arab world.\n\n\n\nCUPP: All right. Well, let's -- let's continue this over in the next -- in the next segment. There are a lot of creative solutions that don't involve bombing and killing people apparently.\n\n\n\nYes, there are and we'll talk about it when we get back. Thank you very much.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nJONES: Welcome back.\n\n\n\nTonight President Obama addresses the nation about Syria. He's hitting the pause button on the military strikes. That gives us time for some creative solutions. And we should keep the warships parked off of there. But what about helping refugees? What about an arms embargo? What about cyber-attacks, what about anything? It's all either war or nothing.\n\n\n\nI'm going to ask you: If there were a dome over Syria, so it was not about bomb or don't bomb, what are some of the creative things we could do that don't involve war? How do we win without war?\n\n\n\nLIEBERMAN: Unfortunately, if there were a dome over Syria, there was nothing we could do to stop the bloodshed. Because you've got a basically unfair fight here. The government has most of the fire power. Finally, the patriots, the freedom fighter Syrians, have gotten help from outside. But they're still getting decimated. So --\n\n\n\nJONES: This is America. You're saying there's nothing we can do? It's either Tomahawk missiles or nothing? We're the most creative --\n\n\n\nCUPP: But the dome doesn't exist, Van. The dome is fantasy land. Let's deal with reality.\n\n\n\nJONES: The fact -- let's get with reality. We have someone here --\n\n\n\nLIEBERMAN: Let me say something about the dome. Because the other reason it's gone --\n\n\n\nCUPP: Van Jones Dome.\n\n\n\nLIEBERMAN: The dome is unreal, but what that really reminds us of is that their neighbors there -- Israel, Iraq, Jordan -- they're all being -- Lebanon -- they're all being badly affected by what's going on in Syria. Our allies are.\n\n\n\nJONES: This is a crisis in our country, of imagination. How can we get out of this without bombs. You tell us.\n\n\n\nSANTORUM: That's why -- that's why Rick Santorum, 18 months ago, during the presidential campaign --\n\n\n\nJONES: Today.\n\n\n\nSANTORUM: -- said we should be arming the rebels.\n\n\n\nCUPP: That's right.\n\n\n\nSANTORUM: We should be supporting them militarily. We should be supporting them economically. We should be doing everything --\n\n\n\nJONES: That's all in the past.\n\n\n\nSANTORUM: We agree --\n\n\n\nJONES: And now we give up. Because we didn't do what you wanted so we just give up.\n\n\n\nSANTORUM: Because a lot of folks -- hello?\n\n\n\nJONES: Hello?\n\n\n\nSANTORUM: A lot of folks said no, we had no interest in this.\n\n\n\nJONES: Hey, listen.\n\n\n\nSANTORUM: Do you admit you were wrong?\n\n\n\nJONES: I'll tell you what: I'm going to shock you. I think the Democrats were wrong for not taking Syria more seriously earlier. But I think it's wrong, and I'm giving you an opportunity. I don't want to go to war. I think there are a lot of things we could do that would get us out of the situation without war. You are somebody who's got some ideas about it, but I don't hear anybody talking about what can we do.\n\n\n\nCUPP: Senator, you've said Assad -- Assad has to go. You've said Assad has to go. How do you do it without military intervention?\n\n\n\nJONES: What can we do?\n\n\n\n(CROSSTALK)\n\n\n\nSANTORUM: This is very difficult right now. When you look at the rebels and the composition of the rebel forces, you see -- you're seeing on YouTube how rebel forces are, you know -- these radical al- Qaeda folks are killing off other rebel leaders and are doing atrocities to the public also.\n\n\n\nJONES: But if you were president --\n\n\n\nSANTORUM: You are going to say we are going to come on the side of them and help them.\n\n\n\nJONES: That's terrible. Help us.\n\n\n\nSANTORUM: But we can't. No, what we have to do is do what we should have done from the very beginning, which is let's identify, as we can, and support and protect and defend the legitimate elements within the rebel forces. Begin the process of arming them, protecting them, et cetera.\n\n\n\nJONES: You agree with this?\n\n\n\nLIEBERMAN: I totally agree. I just want to say something. You've been using the word \"war.\" Nobody's talking about war. President Obama's not talking about war. He's not talking about any American boots on the ground. He's talking about limited, decisive attacks.\n\n\n\nCUPP: Whoa, whoa, whoa, whoa. Because you are not that naive, Senator Lieberman. You know that, even though President Obama is saying no boots on the ground, if one of our planes goes down, we're sending boots on the ground.\n\n\n\nLIEBERMAN: Yes, but that -- everybody's --\n\n\n\nCUPP: This is a lot bigger conflict than he thinks.\n\n\n\nLIEBERMAN: I don't believe so. It's not going to be a massive land invasion.\n\n\n\nIncidentally, what the president could have done when he decided to send it to Congress in taking the military action limited that he has in mind, is not a precedent. President Reagan did it in Grenada and struck at Libya when he thought the Libyans blew up a disco in Germany.\n\n\n\nYou know, President Clinton went into Bosnia, and people could argue we had no national security interests there, but a lot of people were getting slaughtered --\n\n\n\nCUPP: Right.\n\n\n\nLIEBERMAN: -- by the Serbs at that point. And it goes on and on. So --\n\n\n\nJONES: I'm glad the president went to Congress. I think the president going to Congress is the best thing that happened, because it gave us time. You don't agree with me.\n\n\n\nLIEBERMAN: No. Here's my concern when he did it. I don't think he had to do it. He himself said, and I think he was right, that he had the legal authority to take action himself as commander in chief under the War Powers Resolution, everything else. He took an enormous risk, and unfortunately, he's in a quagmire now, because the risk was that Congress would say no.\n\n\n\nJONES: Well, now they're both being delayed, and the U.N. is -- the U.N. is now a forum where -- I don't understand why you can say it's a bad thing. The delay gave us time.\n\n\n\nCUPP: Don't worry. The U.N.'s on it.\n\n\n\nSANTORUM: You may have not seen the polls. I'm not a great poll- watcher. But the American public is overwhelmingly against the president. The president's been making this case now for several weeks. They are against military action. They do not see any positive benefit for the United States in getting involved in a war between two radical elements of which neither are our friends.\n\n\n\nLIEBERMAN: Now I want to -- I want to quote you -- I'm quoting from the New Testament, Corinthians: \"When the sound of the trumpet is uncertain, who will follow into battle?\" So I think people are so confused about what's going on here. If --\n\n\n\nSANTORUM: The president says he has to do it, but then he goes to Congress.\n\n\n\nLIEBERMAN: If you looked at the polls earlier, there was authority for a limited strike without American boots on the ground, particularly if we had some support from other --\n\n\n\nCUPP: Let me ask you, Senator -- go ahead.\n\n\n\nSANTORUM: Here's the president says we need to do it, but I'm going to ask Congress. We need to strike, but it's not going to be decisive. Of course, the American people is going to say what the heck are we doing here?\n\n\n\nBecause here's the problem: If we actually do act, and if the Russians or the Iranians or somebody else say, \"You know what? You've drawn a line in the sand for us and we're going to -- we're going to act back,\" now we've put the United States in a much broader war with a president who is clearly over his head.\n\n\n\nJONES: Listen, I don't -- I do not agree the president is in over his head. First of all, let's be clear. This is a president who built a -- he built a coalition to --\n\n\n\nSANTORUM: Really?\n\n\n\nJONES: Let me finish. He isolated Iran.\n\n\n\nSANTORUM: A coalition?\n\n\n\nJONES: Let's walk through the list before we take him down too hard. He got -- he got Russia and China to be with us against Iran.\n\n\n\nSANTORUM: Stop right there. Stop. Whoa!\n\n\n\nLIEBERMAN: Forget Libya.\n\n\n\nJONES: Libya.\n\n\n\nSANTORUM: Stop at Iran. Is Iran pursuing the nuclear weapons program? They have not drawn down.\n\n\n\nJONES: The answer is -- Do you want a war? Do you want a war?\n\n\n\nSANTORUM: We have drawn a red line.\n\n\n\nJONES: Yes. We're doing cyber-attacks. We're doing an embargo.\n\n\n\nSANTORUM: We have drawn a red line with Iran, and we have done nothing publicly.\n\n\n\nCUPP: Let me ask you. This is a very good opportunity --\n\n\n\n(CROSSTALK)\n\n\n\nCUPP: This is a very good opportunity -- very good opportunity to talk about the U.N. The U.N. -- no one, maybe except Van, trusts the Russians in this new plan to seize chemical weapons from Assad. But I fear that a lot of people trust the U.N. to do that.\n\n\n\nThe U.N. does not have a terribly impressive track record when it comes to ending conflicts. Are you worried? Should the American people trust U.N. to oversee this new Russian plan?\n\n\n\nLIEBERMAN: The U.N. works sometimes. Other times it doesn't. The record is mixed. The question is what passes in the U.N.? If, as France --\n\n\n\nCUPP: Well, nothing if you're Russia and China.\n\n\n\nLIEBERMAN: France tabled a resolution in the Security Council today that basically embraced the Russian proposal that the Syrians get rid of their chemical weapons with international supervision and said that, if they didn't, then force was authorized by the U.N. Security Council. I thought that was great, because it called -- called Russia's bluff.\n\n\n\nAnd what do you think Russia did? They said that was unacceptable. They don't want a mandatory resolution with teeth in it. They want it to be a presidential statement of kind of appealing to Syria.\n\n\n\nCUPP: Senator Santorum, do you trust the U.N.?\n\n\n\nSANTORUM: It calls into question Russia's credibility with this entire proposal.\n\n\n\nCUPP: Do you trust -- wait, let me ask. Do you trust the U.N.?\n\n\n\nJONES: Hold on.\n\n\n\nSANTORUM: Pick an issue. The answer is no.\n\n\n\nCUPP: Exactly right.\n\n\n\nJONES: A hundred and seventy-two successful peacekeeping missions and negotiations for some. Listen, we always focus -- 172 --\n\n\n\nCUPP: Cambodia, Sri Lanka, Rwanda, Bosnia --\n\n\n\nJONES: The world is a tough, nasty place, and we focus on the places the U.N. has not been able to change human nature. But we are in a much safer world because of the U.N. than we would be without it.\n\n\n\nCUPP: That is not -- that is a total inaccuracy.\n\n\n\nJONES: Look right here: 172 peacekeeping --\n\n\n\nCUPP: I have a list, too, of atrocities that they have taken responsibility for and not changed. The world feels very good about itself when it allows the U.N. to take over, because it feels like it's doing something. It's false security.\n\n\n\nJONES: Well, listen -- Here's what I don't understand. When George W. Bush brought in the United Nations, people thought that was a good thing. He was trying to bring in the global community. I thought that you wanted us to build a big global coalition. I think we have a moment now to do so.\n\n\n\nAnd why do we have it? We have it for two reasons. One, he went to Congress, which you don't like. And two, because as much as we do not trust the Russians for their own interests, they are moving. Why are you mad at Congress and the U.N.?\n\n\n\n(CROSSTALK)\n\n\n\nSANTORUM: Name -- name the countries that are for the United States getting involved militarily in Syria.\n\n\n\nJONES: Well, apparently, there's France. Militarily?\n\n\n\nLIEBERMAN: The people that want us to --\n\n\n\n(CROSSTALK)\n\n\n\nJONES: You can answer that.\n\n\n\nLIEBERMAN: There's about 15 that signed that statement calling for action.\n\n\n\nSANTORUM: Action but not military action.\n\n\n\nLIEBERMAN: But you know what? The president has --\n\n\n\nSANTORUM: There's a big difference between action and military action. I'm for action. I'm just not for -- I'm not for a military strike. Particularly one that's not decisive and is not going to accomplish anything.\n\n\n\nLIEBERMAN: But here's the problem. I think a military strike today will hurt Assad. I think that's the reason why, at least in words, he's accepted this Russian proposal.\n\n\n\nI don't believe him for a minute. I'll believe it when I see it, when he gives us his chemical weapons.\n\n\n\nSANTORUM: Let's play it out.\n\n\n\nLIEBERMAN: But I think he's scared of a strike. We're going to hit his command and control.\n\n\n\nSANTORUM: Let's play it out. We strike Assad. We -- we knock out a few command and control operations. Then where do we go?\n\n\n\nLIEBERMAN: Then we give more support to the Syrian opposition. Because they will have a tremendous boost in morale.\n\n\n\nSANTORUM: Why can't we do that without striking?\n\n\n\nLIEBERMAN: We can, but we've got to strike him because he used chemical weapons. And if we don't, then he'll use them again.\n\n\n\nSANTORUM: And you don't have any -- you don't have any fear or concern that any other country will, as a result of us striking Syria, do something to -- to insert themselves even in that conflict or potentially against the United States?\n\n\n\nLIEBERMAN: They might but you know, when you're -- we can't -- we can't act out of fear of what might happen. We're strong. We're still the strongest country in the world.\n\n\n\nSANTORUM: We're not. We're not acting like -- we're not acting like a leader. We're not acting strong. We're acting like someone who said, don't knock this off my shoulder and you do. And so I -- OK, so I've got a fight back. We have to have --\n\n\n\n(CROSSTALK)\n\n\n\nLIEBERMAN: The shoulder was the high moral ground about --\n\n\n\nSANTORUM: It wasn't a high moral ground.\n\n\n\nLIEBERMAN: Hitler, Saddam Hussein, Assad have used chemical weapons.\n\n\n\nSANTORUM: Chemical weapons -- LIEBERMAN: You've got to say no.\n\n\n\nSANTORUM: Chemical weapons is very different than WMD that Iran is working on. That's where we should focus our attention.\n\n\n\nCUPP: OK. Thanks to Joe Lieberman and Rick Santorum. It was a great debate. We appreciate it.\n\n\n\nNext, we \"Cease Fire.\" There's something important here we need to agree on. Not just the two of us but the whole country.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nJONES: Tonight on CROSSFIRE, we've been debating and fighting about what to do about Syria. But now we're going to call a \"Cease Fire.\"\n\n\n\nNow I think, and I want to come back to a point I made. I think that I have to admit that you guys have been right about something. You guys have been out, you in particular, out there for two years saying we've got to do something about Syria, something about Syria.\n\n\n\nI hate your solution.\n\n\n\nCUPP: Yes.\n\n\n\nJONES: I don't like the war. But you are pointing to the right problem. And I think a lot of people on the left were ducking it, and we weren't dealing with it. And I think that what my lesson out of this is, even when we don't agree, we've got to listen to each other more than we did.\n\n\n\nCUPP: Well, and I appreciate that. And I will return a favor and say, look, I don't agree with your solutions either, but at least you've been consistent. I think a lot of Democrats and liberals have talked about President Obama's foreign policy as somehow morally superior to President Bush's. And you hold Obama to the same standard as you hold President Bush, and that -- that says a lot about your credibility.\n\n\n\nJONES: Here we go. The two of us, we agreed, and the world didn't come to an end.\n\n\n\nCUPP: Here's another thing we agree on: Your opinion matters. You can weigh in on our \"Fire Back\" question via Facebook or Twitter. \"Should the U.S. trust Russia's offer to rid Syria of chemical weapons?\" Right now 41 percent of you say yes; 59 percent say no.\n\n\n\nJONES: The debate continues online at CNN.com/crossfire. You can also go to Facebook and Twitter.\n\n\n\nFrom the left, I'm Van Jones.\n\n\n\nCUPP: and from the right, I'm S.C. Cupp. Join us tomorrow for another edition of CROSSFIRE.\n\n\n\nA special edition of \"ERIN BURNETT OUTFRONT\" starts right now.\n\n\n\n", "images": ["http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-close.jpg", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/nav-arrow.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "http://i.cnn.net/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "http://i.a.cnn.net/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-arrow.jpg"], "top_img": "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://transcripts.cnn.com", "summary": ""}