{"url": "https://www.nbcsandiego.com/entertainment/entertainment-news/Today-Hoda-Kotb-Maternity-Leave-Ends-419619513.html", "text": "Hoda Kotb returned to her second home Monday morning.\n\nKotb joined Savannah Guthrie and Matt Lauer on \"Today\" for the first time since announcing on Feb. 21 that she had adopted a daughter, Haley Joy Kotb.\n\n\"It's everything,\" she said of motherhood. Kotb added that she would regularly tune in to see her colleagues work when she was on maternity leave. \"I saw everybody,\" she said, \"and I'm blubbering like a baby.\"\n\nFans lined Rockefeller Plaza to herald Hoda's return.\n\nAdmitting she'd \"been a mess\" all morning, Kotb said she was nervous to be back on camera. \"I'm scared to be sitting here,\" she shared. \"I'm a little afraid that I might explode into tears.\"\n\nLauer lightened the mood, joking, \"I thought it was 'cause you were miserable being back and you just broke down in tears, but it's just all of the emotions of the last two and a half months.\"\n\nThough they had visited her at home, Guthrie and Lauer were glad to see Kotb back at work in Studio 1A.\n\n\"I'm feeling great. I don't think I've ever been this happy,\" Kotb said, reaching for a box of tissues to dry her eyes. After regaining her composure, the 52-year-old fourth-hour \"Today\" co-host said, \"I'm going to get professional! OK, I'm ready.\"\n\nKotb then got back to business. Six minutes later, Al Roker appeared via satellite from Washington, D.C., where he was reporting on the 139th annual Easter Egg Roll at the White House. \"Mwah! I miss you,\" the weatherman said. \"I'll bring you back some eggs for Haley Joy.\"\n\nAfter receiving a \"hug chain\" from fans, Kotb admitted it was \"a little hard\" saying goodbye to her daughter before work.\n\n\"But, I have to tell you, when I walked in, there's something about looking into the eyes of people who are just happy for you that makes me explode, which is why I was doing that with all of you guys and everyone who is out here,\" she said with a big smile. \"I'm blessed to be able to have this great family and a little girl at home waiting for me.\"\n\nToday Show Family Album\n\nAt 8:10 a.m., Kotb opened up about her adoption journey and revealed how motherhood has changed her.\n\n\"You think that by a certain stage in your life, I've had every experience that I've had, and then all of a sudden she shows up,\" the journalist said. \"I felt like in my life, I've had joy beyond what I could have imagined, but this is beyond a dream. Like, you had your dreams--and then this. I never believed in love at first sight until now.\"\n\nKotb joked that Haley \"probably thinks it's raining in her nursery, because I'm always looking at her and crying on her.\"\n\nHaley is the missing puzzle piece, she added. \"When they first handed me Haley, I was scared to hold her, and when they first put her in my arms, it was a perfect fit.\"\n\nThe Origins of Hoda Kotb and Kathie Lee Gifford's Friendship\n\nBefore she decided to become a parent, Hoda feared it might be \"too late,\" as she'd already been through cancer and a divorce. \"You just think, 'OK, I don't get everything and it's OK.'\"\n\nAfter a while, though, she began to wonder, \"Why not me?\" With her mind made up, she talked it over with her boyfriend, Joel \"Boots\" Schiffman.\n\n\"I said to Joel, I want to ask you something, and this is a big deal. I want you to think about it. I don't want you to answer right away.' I said, 'I would like to explore adoption with you,'\" Kotb said. \"He said, 'I don't need a minute. I'm in.'\"\n\nHaley Joy is better than she ever envisioned. \"When I look at her I see forever. I see past me,\" Kotb gushed as tears streamed down her cheeks. \"I see the future, which I guess I never saw.\"\n\n\"I want her to know she is loved by me, by my family and by everyone who's held her,\" Kotb said at the end of the segment. \"I don't think she's going to know what to do with all the love.\"\n\nBack in the studio, Kotb told Dylan Dreyer, Lauer and Guthrie, \"She is something. She's something. She's changed everything about me. Everything. Like, every single thing about me.\"\n\nLauer, 59, added, \"Joel is the perfect partner for this. He is such a wonderful, warm, great guy.\"\n\n\"Anyway, I have baby!\" Kotb said, trying to keep the tears at bay again. \"I have a baby! Hello! Thank you for making me feel so good. Coming back has been amazing. Thanks for loving me.\"\n\nWhen the 10:00 a.m. hour with Kathie Lee Gifford began, Kotb received a gift basket that included books, a lullaby album and a sash. Gofford cheered Kotb and laughed, \"Joel's daughter is finally graduating college and now he's got a brand new baby.\"\n\nKotb joked, \"Here we go again!\"\n\nShe again became emotional while discussing this new chapter of her life.\n\n\"I've loved her, I think, my whole life,\" Kotb said of Haley Joy. \"I think since forever.\" As Kotb wiped away her tears, Gifford said, \"She looks like you--she's got a big head and huge feet!\"\n\n\"I love it,\" Kotb laughed. \"I love her head.\"\n\nAfter waiting so long to become a mom, Kotb doesn't want to miss a moment of her baby's life. \"I sleep in the room with her so that whenever she starts crying I'm ready. When it's like 6:00 or last wakeup, I walk over and...I look at her and she's hungry and she needs changing. And I go, 'Well, good morning nugget.' She gets a smile: 'Hi.' Just like that,\" she told Gifford. \"I swear to you, if I could live in that moment...you know how you wish moments could last forever?\"\n\nEven in her \"worst moments\" as a mom, Kotb focused on gratitude: \"Because I would have begged — begged — for a day like this. I would have begged for that kind of day, to have a child. I don't know why I'm crying! I cry over everything! I'm normally not like this. I've become crazy!\"\n\n\"You can't believe how your heart can feel,\" Kotb added. \"I can't believe it feels this way.\"\n\nKotb, who apologized to viewers for \"so much baby talk,\" then told Gifford, \"I cannot believe this is my life...By the way, I am taking my time. I am enjoying moments that I know I would have raced through...As I'm doing it, I'm trying to linger, savor...enjoy every moment.\"\n\n\"I didn't know that I could feel that kind of contentment — just so satisfied with everything,\" Kotb said around 10:35, adding that she \"turned off\" her electronic devices to focus on what matters: making memories with her daughter.\n\n\"I realized there's so much love to be had,\" she told Gifford, \"and I think sometimes it's smart to block some of the negativity that's out there in the world and realize that your world could be beautiful — if you keep it tight like that.\"\n\n(E! and NBC are both members of the NBCUniversal family.)", "images": ["https://media.nbcsandiego.com/2019/09/Coronavirus-Pandemic-New-York-April-17.jpg?crop=60px%2C248px%2C4296px%2C2417px&resize=850%2C478", "https://media.nbcsandiego.com/2019/09/San_Diego_On_Light@3x-1.png?fit=381%2C120", "https://media.nbcsandiego.com/2019/09/San_Diego_On_Dark@3x-2.png?fit=381%2C120", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcsandiego.com/2019/09/goodnews2-apr17.jpg?resize=850%2C478", "https://media.nbcsandiego.com/2019/09/hodamom.jpg?crop=0px%2C0px%2C0px%2C0px&resize=850%2C478"], "top_img": "https://media.nbcsandiego.com/2019/09/hodamom.jpg?crop=0px%2C0px%2C0px%2C0px&resize=850%2C478", "keywords": [], "authors": ["Zach Johnson"], "canonical_link": "http://www.eonline.com/news/843879/hoda-kotb-returns-to-today-after-maternity-leave-i-might-explode-into-tears", "title": "Hoda Kotb Cries Happy Tears on Return to ‘Today’: ‘I Cannot Believe This Is My Life’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "og": {"site_name": "NBC 7 San Diego", "type": "article", "description": "“It’s everything,” she said of motherhood. Kotb added that she would regularly tune in to see her colleagues work when she was on maternity leave. “I saw everybody,” she said, “and I’m blubbering like a baby.”", "title": "Hoda Kotb Cries Happy Tears on Return to ‘Today’: ‘I Cannot Believe This Is My Life’", "url": "https://www.nbcsandiego.com/news/national-international/today-hoda-kotb-maternity-leave-ends/2061361/", "image": "https://media.nbcsandiego.com/2019/09/hodamom.jpg?crop=0px%2C0px%2C0px%2C0px&resize=850%2C478"}, "google-site-verification": "IEReflDAGG9alRk9BZvi1yyXoUkp8VVr2tQDgwleG2k", "fb": {"app_id": 96971132149}, "twitter": {"site": "@nbcsandiego", "creator": "@nbcsandiego", "description": "“It’s everything,” she said of motherhood. Kotb added that she would regularly tune in to see her colleagues work when she was on maternity leave. “I saw everybody,” she said, “and I’m blubbering like a baby.”", "title": "Hoda Kotb Cries Happy Tears on Return to ‘Today’: ‘I Cannot Believe This Is My Life’", "url": "https://www.nbcsandiego.com/news/national-international/today-hoda-kotb-maternity-leave-ends/2061361/", "image": "https://media.nbcsandiego.com/2019/09/hodamom.jpg?crop=0px%2C0px%2C0px%2C0px&resize=850%2C478"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/NBCSanDiego"}, "description": "“It’s everything,” she said of motherhood. Kotb added that she would regularly tune in to see her colleagues work when she was on maternity leave. “I...", "keywords": "Al Roker, D.C., electronic devices, Hoda Kotb, journalist, Kathie Lee Gifford, Matt Lauer, NBC, NBCUniversal, Rockefeller Plaza", "sailthru.title": "Hoda Kotb Cries Happy Tears on Return to ‘Today’: ‘I Cannot Believe This Is My Life’", "sailthru.description": "“It’s everything,” she said of motherhood. Kotb added that she would regularly tune in to see her colleagues work when she was on maternity leave. “I...", "sailthru.tags": "Al Roker, D.C., electronic devices, Hoda Kotb, journalist, Kathie Lee Gifford, Matt Lauer, NBC, NBCUniversal, Rockefeller Plaza", "sailthru.type": "article", "sailthru.date": "2017-04-17T07:15:08+00:00", "msapplication-TileImage": "https://media.nbcsandiego.com/2019/09/cropped-NBC_San-Diego.png?fit=270%2C270"}, "movies": [], "publish_date": 1492413308.0, "source": "https://www.nbcsandiego.com", "summary": ""}