{"url": "www.contactmusic.com/eddie-cibrian/news/leann-rimes-and-eddie-cibrian-fell-in-love-on-set-of-northern-lights_3744324", "text": "When Leann Rimes and Eddie Cibrian fell in love on the set of Northern Lights, things were already looking a little bleak for the American actor. Here was a guy with the looks of a genuine Hollywood leading star - a guy who had served his time on U.S. television (Sunset Beach), like many A-listers before him, George Clooney, Kevin Bacon, etc. So why has Cibrian - who turned 40 last week - lost his way in the tangled world of Hollywood?\n\nEddie Cibrian [L] and LeAnn Rimes [R] At The ACM Music Awards\n\nIn 2006, Cibrian joined the cast of Fox show Vanished midway through the series. The show focused on the disappearance of the wife of a Georgia senator, which is revealed as being part of a wider conspiracy. The family of the missing woman, a pair of FBI agents and a journalist are drawn into the ever-evolving mystery - sounds alright doesn't it? Well, it wasn't. And it was cancelled after nine of the thirteen episodes. Yep, that means Fox deemed it wasn't even worth revealing where the wife of the Georgian senator ended up.\n\nNext for Cibrian came a rather uninspiring casting as Jason Austin in the ABC remake of ITV's British drama Footballers Wives. Called Football Wives, the show actually boasted a pretty decent cast including Gabrielle Union, Lucy Lawless, Ving Rhames and James Van Der Beek, though, surprise surprise, the network chose not to pick up the show.\n\nEddie Cibrian Filming Ugly Betty In New York City\n\nFollowing the Football Wives disappointment, married man Cibrian had a much-publicized affair with LeAnn Rimes, the popular American country star. The couple went public with their romance in August of that year, with Cibrian filing for divorce from his wife Brandi Glanville. \"I can't change the past and I'm truly sorry that people got hurt along the way but not everything reported in the media is reality and continuing to rehash things publicly only makes it more difficult for everyone to heal,\" the actor said in a statement to E! Online.\n\nGuest spots on Samantha Who? Dirty Sexy Money and Ugly Betty followed for Cibrian and he later joined the cast of CSI: Miami as an officer from the Hollywood division. It's probably exactly the sort of thing that he needed to be doing, though Cibrian's contract was not picked up for the 2010-2011 season.\n\nWatch Eddie Cibrian and LeAnn Rimes Leaving The Malibu Fair:\n\n\n\nThat year, the actor guest starred as a bounty hunter on multiple episodes of NBC's drama series Chase though a huge opportunity came in March 2011,when Cibrian was cast as the lead in the NBC pilot for The Playboy Club, a big-bidget TV series focusing on the first Playboy Club in Chicago in 1962 and starring Hollywood actress Amber Heard.\n\nOut of nowhere, the show became the first cancellation of 2011-12 television season, though it appeared to be no fault of Cibrian, with critics tearing the writing apart. Despite his website dubbing the show one of the most anticipated of the year, Tim Goodman of the Hollywood Reporter said of The Playboy Club, \"It was [a] bad show, period. The writing was weak, the acting spotty and the sexism too ridiculous and obvious to comment on more than once.\"\n\nLeAnn Rimes has sold over 37 million records worldwide and retains a large following across the world. She has won several awards, including two Grammys, three ACMs, a CMA, 12 Billboard Music Awards and one American Music award, however, the majority of press attention in recent years has focused on her very public spats with Cibrian's ex-wife Brandi Glanville and her weight loss.\n\nEddie Cibrian [L] and LeAnn Rimes [R] At The Friend Movement Campaign Benefit\n\nCibrian is clearly a talented actor, who may yet find an interesting role on television despite the fickle nature of the American small-screen business. He needs network backing, good scripts and decent co-stars: not too much to ask for is it?\n\nUntil that role comes calling, he'll star in Tyler Perry's Single Moms Club set for release in 2014. After that, it's The Best Man Holiday - a comedy with Terrence Howard. Sigh.", "images": ["http://www.contactmusic.com/pics/mf/long_beach_grand_prix_150412/eddie-cibrian-the-36th-annual-toyota-procelebrity_3828515.jpg", "http://www.contactmusic.com/pics/me/espys_pre_party_inside_120711/eddie-cibrian-leann-rimes_3434000.jpg", "http://assets.pinterest.com/images/pidgets/pinit_fg_en_round_red_16.png", "http://www.contactmusic.com/pics/mf/long_beach_grand_prix_150412/eddie-cibrian-the-36th-annual-toyota-procelebrity_3828499.jpg", "http://www.contactmusic.com/pics/ma/ugly_betty_190708/eddie_cibrian_1982581.jpg", "http://images.contactmusic.com/newsimages/leann_rimes_and_eddie_cibrian_796233.jpg", "http://www.contactmusic.com/pics/la/ugly_betty_190708/eddie_cibrian_1982581.jpg", "http://www.contactmusic.com/pics/sn/20130701/020713_friend_movement_campaign_backstage/eddie-cibrian-leann-rimes-marcus-guest-friend-movement-campaign-benefit_3743238.jpg", "http://www.contactmusic.com/images/content/good-deeds-poster.jpg", "http://images.contactmusic.com/images/reviews2/sayitisntso.jpg", "http://pixel.quantserve.com/pixel/p-8d_Ymqt-8lLiA.gif", "http://images.contactmusic.com/images/m4vstill/the-best-man-holiday640.jpg", "http://www.contactmusic.com/sites/all/themes/contactmusic/img/icons/apple-touch-icon-precomposed.png", "http://www.contactmusic.com/videos/2011sep/eddie-cibrian-leann-rimes-spending-day-malibu-fair-with-children_10860.jpg", "http://www.contactmusic.com/pics/lf/acm_arrivals_2_020412/eddie-cibrian-leann-rimes-2012-acm-awards_3810181.jpg", "http://images.contactmusic.com/newsimages/leann_rimes_and_eddie_cibrian_783260.jpg", "http://images.contactmusic.com/newsimages/eddie_cibrian_and_leann_rimes_571577.jpg", "http://images.contactmusic.com/images/m4vstill/tyler-perrys-the-single-moms-club640.jpg", "http://images.contactmusic.com/newsimages/eddie_cibrian_and_leann_rimes_790832.jpg", "http://www.contactmusic.com/pics/ln/20130701/020713_friend_movement_campaign_backstage/eddie-cibrian-leann-rimes-friend-movement-campaign-benefit_3743212.jpg"], "top_img": "http://www.contactmusic.com/sites/all/themes/contactmusic/img/icons/apple-touch-icon-precomposed.png", "keywords": [], "authors": [], "canonical_link": "http://www.contactmusic.com/eddie-cibrian/news/leann-rimes-and-eddie-cibrian-fell-in-love-on-set-of-northern-lights_3744324", "title": "LeAnn Rimes and Eddie Cibrian Fell In Love On Set of \"Northern Lights,\" But At 40, What's Happened To His Career?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "og": {"site_name": "Contactmusic.com", "locale": {"identifier": "en_US", "alternate": "en_GB"}, "type": "article", "description": "Eddie Cibrian was considered a rising star in Hollywood and despite his consistent work, the quality roles are yet to come in.", "title": "LeAnn Rimes and Eddie Cibrian Fell In Love On Set of &quot;Northern Lights,&quot; But At 40, What&#039;s Happened To His Career?", "url": "http://www.contactmusic.com/opinion/leann-rimes-and-eddie-cibrian-fell-in-love-on-set-of-northern-lights_3744324"}, "fb": {"app_id": 484194351689370, "pages": 89728665371}, "article": {"publisher": "https://www.facebook.com/Contactmusic.com", "published_time": "2013-07-03T15:21:10+01:00", "modified_time": "2015-01-08T16:43:45+00:00"}, "keywords": "Headline,Eddie Cibrian,LeAnn Rimes,George Clooney,Kevin Bacon,Gabrielle Union,Lucy Lawless,Ving Rhames,James Van Der Beek,Brandi Glanville,Amber Heard,ABC,NBC,News,Story,Article", "description": "When LeAnn Rimes and Eddie Cibrian fell in love on the set of Northern Lights, things were already looking a little bleak for the American actor. Here was a guy with the looks of a genuine Hollywood leading star -...", "dc": {"title": "LeAnn Rimes and Eddie Cibrian Fell In Love On Set of &quot;Northern Lights,&quot; But At 40, What&#039;s Happened To His Career?"}, "sioc": {"num_replies": 0}, "x": 89728665371, "msvalidate.01": "6799AB310F15EC09413DD4C01C5F36E6", "wot-verification": "7dd3029245d6c8b4d746", "classification": "Arts, Entertainment, News and Media"}, "movies": [], "publish_date": 1372861270.0, "source": "http://www.contactmusic.com", "summary": ""}