{"url": "https://www.theringer.com/tv/2018/4/6/17206046/jersey-shore-family-vacation-premiere-questions", "text": "One of the most stressful things that came out of the great television boom is having to explain to someone that you didn’t watch [insert über-popular show]. Not everyone has watched The Sopranos, The Wire, or Breaking Bad, but the people who have watched those shows treat having a blind spot like it’s a federal offense. Most of the time, you’re just shamed into silence. And there’s nothing more uncomfortable than being among a group of friends theorizing about Lost or something, while you nod silently and consider chiming in, even though you have no clue what they’re talking about. (“So, yeah … that polar bear, huh?”)\n\nThis week, I had my own reckoning: You see, I never watched Jersey Shore. I knew the reality series was a massive hit on MTV, and I knew what a “Snooki” and a “the Situation” was, and I kept their livers in my prayers. But I just never tuned in. And as the cast’s spray tans faded into the sunset and out of the zeitgeist, it seemed like this particular pop culture shame would never be resurfaced.\n\nBut now they’re back. On Thursday night, the Jersey Shore crew—minus Sammi, and, for a moment, Mike “the Situation” Sorrentino, who is mired in a tax evasion trial—returned for a “family vacation” to Miami (because while Floribama Shore and Winter Break: Hunter Mountain are entertaining, everyone just wants to see the thing those shows are copies of). The thing about reboots is they can be pretty good gateways for people who missed out on a particular show at the peak of its popularity—and what better time to finally see what all the Jersey Shore fuss was about? Admittedly, this undertaking was also a bit nerve-racking—enough stories about a man yelling about the arrival of taxis and a woman binge-eating ham will do that to a newbie.\n\nBut Jersey Shore Family Vacation truly surprised me. Sure, the premiere episode still featured drunken tirades, but the reunion was also a group of people reconciling with “growing up” and the cruel passage of time that nobody—not even self-described guidos and guidettes—is immune to. Snooki and JWoww each have two children; Ronnie’s first child was born this week; Vinny is skinny; and Pauly D … all right, he hasn’t really changed—still very much a DJ.\n\nDespite being shockingly relatable, however, watching Family Vacation was still like being dropped into a strange country without any tour guide books. With the premiere in the can, here are 22 of the most pressing questions I had after my Jersey Shore experience.\n\n1. Before the premiere even starts, we get some highlights of the entire reunion along with some obscure quotes from the cast. “Things have changed but they really haven’t changed,” Ronnie, a modern philosopher, says. Then Vinny adds: “I can’t explain it, but put us all together and it’s a shit show.” Guys, I’m completely new to this, but isn’t that all self-explanatory, and kind of the point?\n\n2. Speaking of Ronnie, I literally can’t stop staring at this guy. How does this guy look even beefier than he did almost a decade ago? It’s like if you forced Guy Fieri to only chug creatine powder for three months and spray-tanned over his spray tan.\n\n3. Is it more surprising that JWoww has children, or that Snooki has children? JWoww seems pretty put together for a person whose nickname includes three Ws. “The fish, don’t kill them,” JWoww proclaims to her dimwitted-looking husband, Roger, before leaving for Miami.\n\n4. … Can we get an update on the goldfish throughout this season? I just want to be sure they’re OK and that Roger hasn’t killed them. I mean, LOOK AT THIS GUY!\n\nRoger is a sentient bowl of chili.\n\n5. Pretty early on, it’s become clear we’re not going to get to Miami for a while because the show is reintroducing everyone with quick life updates. And now, I know Vinny was “the relatable one,” but wow—is he the most normcore reality star of all time? The guy doesn’t have a spray tan, speaks at a normal volume, and seems to be living a healthy life out on Staten Island.\n\n6. Wait, Vinny also tweets about climate change?!\n\nPer my last tweet about global warming and ppl saying it’s bad when someone from “jersey shore” educates the president etc.I get the joke but why does having a summer shore house automatically make u stupid?No smart ppl ever partied with friends on weekends? — Vinny Guadagnino (@VINNYGUADAGNINO) December 29, 2017\n\nWho woulda thunk that “guy from Jersey Shore” would become a more reputable description than “guy from The Apprentice.”\n\n7. OH MY GOD, WAIT: HIS MOTHER LIVES ON THE SAME STREET AND STILL DOES HIS LAUNDRY?! I take back the time I said Vinny was “living a healthy life.” Vinny, you are 30 years old, what are you doing?\n\n8. So far, Vinny’s preached about maintaining his healthy lifestyle while Ronnie, who has a girlfriend who is seven months pregnant, has talked only about how important it is for him to not mess around in Miami. How much do you wanna bet they both break their vows by Episode 3? Is there any chance Vinny doesn’t hurt his liver and Ronnie doesn’t try to, in colloquial Jersey Shore terms, “smush”?\n\n9. Mike “the Situation” has this tax-evasion case pending, which he describes as the latest, greatest obstacle he’s faced—when he says this, the show cuts to him banging his head against a wall in a previous episode, and fighting with Ronnie, a much larger person. “They even have the nickname ‘the Situation’ in the paperwork,” Mike says of his legal situation. “The United States v. The Situation.” Is that true? I need that to be true.\n\n10. I don’t mean to judge, but aren’t these folks too old for this vacation? I just watched two moms and a boyfriend with a pregnant girlfriend wish their loved ones goodbye to go live in a villa and drink until they pass out for several weekends. It was truly jarring.\n\n11. Upon seeing their Miami villa, Snooki says, “Oh my God, this is like Italy.” Hasn’t she been to Italy?\n\n(Italy is not like this.)\n\n12. Vinny just showed up in a Dodge minivan.\n\nI think I love this man?\n\n13. Pauly D arrives with a blow-up doll. Sorry, perhaps I should explain: It’s a blow-up doll in the likeness of Sammi, the only original Jersey Shore member who isn’t at the villa for a reason other than tax evasion issues. She didn’t want to be part of the reunion, apparently, because she thought the getaway would be toxic and bad for her since she just started a new relationship—though her long, complicated history with Ronnie definitely feels like a factor as well.\n\n“If I have sex with her, is that still cheating?” Ronnie asks of the doll. I think that quote alone supports Sammi’s decision to not go on this vacation?\n\n14. This doll is seriously creepy. When you press a certain part of it, it blurts out old Sammi quotes. What is Pauly D’s doll budget? Is he just spending all of his DJ money on elaborate, technologically advanced dolls?\n\nThis nightmare doll couldn’t have been cheap.\n\n15. How did Pauly D explain the Sammi doll when he took a flight to Miami?\n\n16. JWoww on the Situation’s tax evasion: “The IRS is like the mafia: Don’t fuck with them.” Can I get that quote embroidered on a pillow?\n\n17. Snooki tries to move the Sammi doll, but it’s oddly heavy, and this ends up happening:\n\nI can’t believe I’m saying this, but guys, can you please just go hit the clubs and get blackout drunk? The more time you spend with Doll Sammi, the more terrifying this whole thing becomes.\n\n18. Mid-episode, the Situation’s, well, situation gets figured out. He pleads guilty, and the judge grants him the right to party in Miami for the reunion special. Or … was that the punishment all along?\n\n19. They do indeed go clubbing. Having not even watched the original show, it’s clear that this feels like a different vibe. Everyone except Pauly D is in some kind of relationship, it seems, which means all non-Pauly partygoers are just half-heartedly fist-bumping and taking shots of tequila, as if it was a contractual obligation (it probably is). I don’t want to jump the gun but, is the cast of Jersey Shore … tired of partying?\n\n20. Pauly D is grinding on this woman that he’s super infatuated with. As his wingman, Vinny holds the woman’s hand for balance while she twerks on Pauly, because she has a bad back.\n\nIs Vinny the best wingman of all time? I don’t think I need more evidence, honestly.\n\n21. The whole clubbing sequence was oddly eye-opening—not only did everyone except for Pauly seem weirdly out of place, but it was obvious that clubbing culture itself has evolved past them. “I don’t think anyone fist-pumps anymore,” Snooki proclaims. “But we still do. I will always fist-pump till the day I die.”\n\nIs this season going to end with the Jersey Shore crew having an existential crisis?\n\n22. I’m not overthinking this, right? These people have entered a new period of their lives, filled with real responsibilities. It seems like Family Vacation can end in one of only two ways: They’ll either realize this stuff is behind them, or they’ll spiral out of control and lose the lives they’ve built for themselves. Maybe it’ll be a bit of both.\n\nAm I going to stick around to see how it all plays out?\n\nHell yes. #TeamVinny4Life.", "images": ["https://cdn.vox-cdn.com/thumbor/DpKRQxoHVMBCQrJTw2uWzDaj5wE=/0x0:1292x724/1200x0/filters:focal(0x0:1292x724):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599629/Screen_Shot_2018_04_06_at_8.21.37_AM.png", "https://cdn.vox-cdn.com/thumbor/YUcoXf6gTYDBCNZezBaJ6L3U4lI=/0x0:1272x714/1200x0/filters:focal(0x0:1272x714):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599631/Screen_Shot_2018_04_06_at_8.22.01_AM.png", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/EINEYGqnvMFsGL2UmZbqaYdNVv4=/0x0:3000x2000/1200x800/filters:focal(1260x760:1740x1240)/cdn.vox-cdn.com/uploads/chorus_image/image/59292715/jersey_shore.0.jpg", "https://cdn.vox-cdn.com/thumbor/Jw0SV-UVOHJwf7cxnLTkzQWWe-k=/0x0:1276x722/1200x0/filters:focal(0x0:1276x722):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599623/Screen_Shot_2018_04_06_at_8.17.29_AM.png", "https://cdn.vox-cdn.com/thumbor/vj0VqAr2ov6oAzDN01nNjuAeR-M=/0x0:1286x714/1200x0/filters:focal(0x0:1286x714):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599637/Screen_Shot_2018_04_06_at_8.24.25_AM.png", "https://cdn.vox-cdn.com/uploads/chorus_asset/file/10599645/Jersey_Shore_2.gif", "https://cdn.vox-cdn.com/uploads/chorus_asset/file/10599647/Jersey_Shore_1.gif", "https://cdn.vox-cdn.com/thumbor/gpVthlf9DLm24iNzHv7jbimIiro=/0x0:1246x696/1200x0/filters:focal(0x0:1246x696):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599625/Screen_Shot_2018_04_06_at_8.19.45_AM.png", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/thumbor/zaFnZSuXzeEVRGo_fcE8yN3IXGE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10599487/jersey_shore.jpg", "https://cdn.vox-cdn.com/thumbor/emNMYLKn1DCGc3KrBIlaiSKF7zU=/0x0:1300x728/1200x0/filters:focal(0x0:1300x728):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599621/Screen_Shot_2018_04_06_at_8.15.33_AM.png", "https://cdn.vox-cdn.com/thumbor/C4OrXO57iFIZ7bLjQFWII4LGcHk=/0x0:1278x716/1200x0/filters:focal(0x0:1278x716):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599639/Screen_Shot_2018_04_06_at_8.25.03_AM.png", "https://cdn.vox-cdn.com/thumbor/AlGUlhGudnumZ0INnptRe8x5B3c=/0x0:1278x728/1200x0/filters:focal(0x0:1278x728):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10599635/Screen_Shot_2018_04_06_at_8.23.29_AM.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/zaFnZSuXzeEVRGo_fcE8yN3IXGE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10599487/jersey_shore.jpg", "keywords": [], "authors": ["Miles Surrey", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "Apr"], "canonical_link": "https://www.theringer.com/tv/2018/4/6/17206046/jersey-shore-family-vacation-premiere-questions", "title": "22 Questions About the ‘Jersey Shore Family Vacation’ Premiere", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2018-04-06T10:39:59-04:00", "modified_time": "2018-04-06T10:39:59-04:00"}, "author": "Miles Surrey", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Is Vinny the most normcore reality star of all time? What is Pauly D’s sex-doll budget? Will this season end with the cast coming to grips with the cruel passage of time?", "og": {"description": "Is Vinny the most normcore reality star of all time? What is Pauly D’s sex-doll budget? Will this season end with the cast coming to grips with the cruel passage of time?", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/zaFnZSuXzeEVRGo_fcE8yN3IXGE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10599487/jersey_shore.jpg", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "22 Questions About the ‘Jersey Shore Family Vacation’ Premiere", "type": "article", "url": "https://www.theringer.com/tv/2018/4/6/17206046/jersey-shore-family-vacation-premiere-questions"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/tv/2018/4/6/17206046/jersey-shore-family-vacation-premiere-questions", "title": "22 Questions About the ‘Jersey Shore Family Vacation’ Premiere", "description": "Is Vinny the most normcore reality star of all time? What is Pauly D’s sex-doll budget? Will this season end with the cast coming to grips with the cruel passage of time?", "image": "https://cdn.vox-cdn.com/thumbor/3CHEZLPhPhMlxDfPksyE4xvUdGo=/0x250:3000x1750/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/10599487/jersey_shore.jpg", "site": "ringer"}, "sailthru.title": "22 Questions About the ‘Jersey Shore Family Vacation’ Premiere", "sailthru.tags": "general,the-ringer,front-page,tv,pop-culture", "sailthru.description": "Is Vinny the most normcore reality star of all time? What is Pauly D’s sex-doll budget? Will this season end with the cast coming to grips with the cruel passage of time?", "sailthru.date": "2018-04-06T10:39:59-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/4QiIWrbcIVKVyOjM7QgFwionNNM=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/59292713/jersey_shore.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/CE3iKgQQdpE1hlP3dtSpK8Ho3xg=/500x0:2500x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/59292713/jersey_shore.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1522944000.0, "source": "https://www.theringer.com", "summary": ""}