{"url": "https://www.bustle.com/p/chris-harrison-is-rooting-for-sarah-hyland-wells-adams-just-as-much-as-bachelor-nation-9926845", "text": "There have been plenty of matches made on Bachelor shows, but which Bachelor Nation couple is host Chris Harrison rooting for most? Actually, it's not even a duo that met on one of the shows. Harrison is a big fan of Wells Adams and Sarah Hyland's relationship.\n\nIn a July 29 interview with E! News, the Bachelor host declared, \"I just love that relationship. I just think they are oddly perfect together. With Wells and Sarah, they just seem to fit and seem to mix and they complement each other and are a good couple.\" They really are a solid match.\n\nThe praise didn't stop there though. During that same E! News interview, Harrison said, \"They are an amazing couple and are crazy in love with each other. They are both quirky, goofy and funny.\" Anyone who follows the duo on social media can confirm everything stated in that Harrison quote. This is a very well-documented and entertaining couple.\n\nIt gets even better. The reality TV icon admitted that he really sees Adams and Hyland's relationship going the distance. According to Harrison, it is not a matter of if they will get engaged, but more of a question about when Adams will propose.\n\nThe father of two admitted, \"I don't know when this [engagement] is going to happen, but it will happen. If there is a couple I root for, it's them.\" Aside from having the one and only Chris Harrison in their corner, Adams and Hyland also have a contender to officiate their wedding if (when) they tie the knot. The host admitted that he would \"one hundred percent\" be down to take on that role if he was asked.\n\nSo what has Harrison so on board with this relationship? It could be Adams and Hyland's social media posts, which have lured in plenty of supporters to \"ship\" this match, but there is probably more to it.\n\nOut of all the contestants on The Bachelor and The Bachelorette, Adams is the only one who got to be the bartender on Bachelor in Paradise — twice. This means he had a lot more bonding opportunities with Harrison than most of the other reality show participants. He revealed, \"I got to know Wells more this summer than previous summers. We got to hangout and talk and he is a really good guy.\"\n\nEven though Adams and Hyland didn't meet on a Bachelor show, they did meet because of the Bachelor franchise. So it would make sense for Harrison to be so invested in this couple and want to officiate the ceremony if they end up getting married.\n\nThe Modern Family actor is a very vocal fan of the Bachelor franchise. During a January interview with Jimmy Kimmel, she explained the origin of their relationship. She revealed, \"I was following him.\" She explained,\n\n\"We had tweeted each other because I thought he was funny and he was a fan of the show. I saw him as the bartender and I was like, ‘That’s really cute.’\"\n\nEven so, it was Adams who ultimately made the first move beyond their public Twitter flirtation. Hyland said, \"Have you seen those memes of ‘Slide into the DMs?’ That. He slid into my DMs.\" This romance gives hope to people everywhere who are crushing on cast members from their favorite TV shows. Adams loves Modern Family. Hyland loves all of the shows in the Bachelor show. This relationship is a superfan's dream.\n\nJimmy Kimmel Live on YouTube\n\nAside from the cute origin story, this relationship has a very promising future as well. The two are very serious about each other and they are taking big steps to make it work. In a conversation with Brandi Cyrus on the July 20 episode of their Your Favorite Thing podcast, the Bachelor in Paradise bartender revealed that he is moving in with his girlfriend. He told his cohost,\n\n“My first thought [was], ‘Let’s go to California. Let’s move in with the lady.’ … If we’re gonna take the next step, this is the first step we’ve got to take, to decide if we can handle living with one another.”\n\nThis couple has everything going for them. They have social media support from their fans. They have Harrison \"rooting for\" them. They are about to be roommates. Most importantly, they have each other. But again, Harrison's seal of approval sure doesn't hurt.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2018/7/30/c71daff9-91d9-4663-ba77-22f23fa93e32-fangirls1-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/30/ea691470-44e0-4b81-a356-f9814beb515f-screen-shot-2018-07-30-at-114621-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/11/2942276e-7f98-4e0d-9e78-fffb077dd2ed-getty-1167464598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/30/ea691470-44e0-4b81-a356-f9814beb515f-screen-shot-2018-07-30-at-114621-am.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/3/20/c328eadf-9ae0-4257-99eb-e601f708c458-getty-916296824.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/15/8feb9158-e1b8-420e-952c-a847f4994e90-getty-1187049088.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/deb56653-5001-4dc5-8221-5f4faa452a84-getty-1150607041.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/30/ea691470-44e0-4b81-a356-f9814beb515f-screen-shot-2018-07-30-at-114621-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/chris-harrison-is-rooting-for-sarah-hyland-wells-adams-just-as-much-as-bachelor-nation-9926845", "title": "Chris Harrison Is Rooting For Sarah Hyland & Wells Adams Just As Much As 'Bachelor' Nation", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/chris-harrison-is-rooting-for-sarah-hyland-wells-adams-just-as-much-as-bachelor-nation-9926845", "type": "article", "title": "Chris Harrison Is Rooting For Sarah Hyland & Wells, Just Like The Rest Of 'Bach' Nation", "description": "There have been plenty of matches made on Bachelor shows, but which Bachelor Nation couple is host Chris Harrison rooting for most? Actually, it's not even a duo that met on one of the shows. Harrison is a big fan of Wells Adams and Sarah Hyland's…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/30/ea691470-44e0-4b81-a356-f9814beb515f-screen-shot-2018-07-30-at-114621-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "There have been plenty of matches made on Bachelor shows, but which Bachelor Nation couple is host Chris Harrison rooting for most? Actually, it's not even a duo that met on one of the shows. Harrison is a big fan of Wells Adams and Sarah Hyland's…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}