{"url": "https://www.etonline.com/rhoc-kelly-dodd-opens-up-about-dating-after-divorce-from-michael-dodd-exclusive-113567", "text": "Kelly Dodd has her priorities straight: first comes her daughter, then comes dating.\n\n“I have never introduced a guy to Jolie,” the newly single Real Housewives of Orange County star tells ET of dating while raising her 12-year-old. “I haven't had a boyfriend, so I haven't had the opportunity to introduce her to anybody. And I think it would take a lot for me to do that. I don't want Jolie to see guys coming in and out of my life. That just wouldn't be a good example.”\n\nThe 43-year-old is living her best single life, though, after splitting from her husband of 11 years, Michael Dodd, last year, admitting to keeping a “bench” of men in her rotation, including one named Alex, whom RHOC fans will meet before the end of season 13.\n\n“I’m very single,” she confirms. “I want somebody that I'm best friends with ... like fun, that I can have a great time with, we can laugh and have fun. And then, you know, like, a buddy. And then second, we have to have good sex -- very important -- and then third, like, somebody very, very smart. Really, I want a smart guy, and somebody that, you know, is driven. So, those are the things I'm looking for in a guy… and nice! That treats me nice. There's a lot!”\n\nKelly admits she never felt like she had that “best friend” dynamic with any of her partners, including Michael, who is nearly 20 years older than the reality star.\n\n“He's socially inept, you know what I mean?” she says. “He always made people feel awkward or whatever, but he's a great dad, he's a great husband. I just couldn't go out with him, let loose and have a good time. So, for whatever reason, I've never had a best friend I've been romantically involved in. Looking back, that's what I want for myself. Maybe that's why all my relationships have failed.”\n\nOne part of her relationship with Michael that is working, though? Co-parenting.\n\n“You know, [Jolie] always says, 'Mom, I'm happy that you and Dad are divorced,’” Kelly reveals. “She's at peace, she has fun with me -- it's like she gets one-on-one time with each parent. Our custody is one week on, one week off. So, we have, you know, we co-parent very well together.”\n\n“No complaints,” she adds. “It's really good. So, and we're trying to be friendly with each other and do things with her, so she doesn't feel, you know, uncomfortable or doesn't feel insecure. Because if we're cool with each other, she feels good.”\n\n“Listen, there's times where I wanna, like, smash Michael or talk bad about him, but ultimately I have a daughter and I have to think about her,” she notes. “So I really don't want to, you know, disparage Michael in any way in the press or anything like that, even though I want to.”\n\n“Michael and I, there's good days and bad days,” Kelly continues. “But I try to be as positive as I can and not think of the negative, ‘cause thinking in the negative just puts me in a bad place and doesn't get me anywhere. I still have issues and problems, but I just don't like to tell people about them.”\n\nThe former couple attempts to put those issues aside to create quality experiences for their girl, but it doesn’t always go as planned.\n\n'RHOC': Kelly Dodd Admits She and Vicki Gunvalson No Longer Speak (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'RHOC': Kelly Dodd Admits She and Vicki Gunvalson No Longer Speak (Exclusive)\n\n“One week he'll be, like, nice to me and he'll come over we'll go have, like, dinner and then the next minute he'll see something on the show he didn't like, like somebody dating and then he'll go off on me,” she admits. “But I know he just goes off on me for, like, a little bit and then he'll turn around and be nice to me again.”\n\nKelly, too, struggles with seeing her ex move on, even though she wants happiness for him. She exploded on co-star Vicki Gunvalson earlier this season for helping to set Michael up with a new woman.\n\n“I have a child with him, I've built up assets with him, I have had one of the best times of my life with him, he's my, you know, a great person,” she explains. “I mean, no matter what, no matter how or not in love with him [I am], you have a kid with them so it's like, ‘Is this person gonna be nice to my child?’ There's so many emotions that go into your ex dating ... I really want him to date, I want him to get married. I want those nice things for him because it actually gets him to, like, get off my back. But, I really want Michael to be happy.”\n\nAs for her own future, Kelly’s not sure she sees marriage again.\n\n“I don't know,” she confesses. “I'm not, like, opposed to it. But, it's not a must. I think marriage is to have children, you know? But if someone wants to get married, we have a really good relationship, then yes.”\n\nThe Real Housewives of Orange County airs Mondays at 9 p.m. ET on Bravo.\n\nRELATED CONTENT:\n\n'RHOC': Kelly Dodd Breaks Down Shannon Beador's 'Unhinged' Behavior in Jamaica (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n‘RHOC’: Tamra Judge Calls Shannon Beador Out for Using Her as a 'Punching Bag' (Exclusive)\n\n‘RHOC’ Star Kelly Dodd Admits She and Vicki Gunvalson Aren’t on Speaking Terms (Exclusive)\n\n'RHOC' Midseason Trailer Shows Shannon Beador Demanding Cameras to Stop Filming (Exclusive)", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/kelly.jpg?h=c673cd1c&itok=iOPeb68q", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gctah300_0.jpg?h=35278c44&itok=wFHc-B3i"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/kelly.jpg?h=c673cd1c&itok=iOPeb68q", "keywords": [], "authors": ["Brice Sander"], "canonical_link": "https://www.etonline.com/rhoc-kelly-dodd-opens-up-about-dating-after-divorce-from-michael-dodd-exclusive-113567", "title": "‘RHOC’: Kelly Dodd Opens Up About Dating After Divorce From Michael Dodd (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "‘RHOC’: Kelly Dodd Opens Up About Dating After Divorce From Michael Dodd (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/rhoc-kelly-dodd-opens-up-about-dating-after-divorce-from-michael-dodd-exclusive-113567", "title": "'RHOC': Kelly Dodd Opens Up About Dating After Divorce (Exclusive)", "description": "The ‘Real Housewives of Orange County’ star says she and her ex are figuring out a new dynamic as they co-parent their daughter, Jolie.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/kelly.jpg?h=c673cd1c&itok=iOPeb68q", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The ‘Real Housewives of Orange County’ star says she and her ex are figuring out a new dynamic as they co-parent their daughter, Jolie.", "title": "'RHOC': Kelly Dodd Opens Up About Dating After Divorce (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Brice Sander‍", "url": "https://www.etonline.com/rhoc-kelly-dodd-opens-up-about-dating-after-divorce-from-michael-dodd-exclusive-113567", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/kelly.jpg?h=c673cd1c&itok=iOPeb68q"}, "description": "The ‘Real Housewives of Orange County’ star says she and her ex are figuring out a new dynamic as they co-parent their daughter, Jolie.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, The Real Housewives, Kelly Dodd, The Real Housewives of Orange County", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}