{"url": "https://slate.com/culture/2018/07/first-time-emmy-nominee-reactions.html", "text": "Photo illustration by Slate. Photos by NBC, Netflix.\n\nThis year’s Emmy nominations may have been dominated by familiar shows like Game of Thrones, but there were also quite a few individuals being recognized for the very first time. The Television Academy has identified 36 performers who received their first nomination on Thursday, from entertainers for whom 2017 was a breakout year, like Cameron Britton and Tiffany Haddish, to long-overdue veterans like Saturday Night Live’s Kenan Thompson.\n\nBelow, we’ve rounded up some of the best reactions from first-time nominees.\n\nMegan Amram\n\nAn Emmy For Megan is living up to its name: The web series starring Amram, who also works as a writer on The Good Place, received two nominations. Amram took to Twitter with her reaction.\n\nTHANK YOU THANK YOU THANK YOU sincerely from the bottom of my heart to everyone who is celebrating #AnEmmyForMegan today. But remember: it's not called #TwoNominationsForMegan, it's called #AnEmmyForMegan. Because what matters is that trophy. SEE YOU ON THE WINNER'S PODIUM/STAGE — Megan Amram (@meganamram) July 12, 2018\n\nJessica Biel\n\nBiel was nominated for Lead Actress in a Limited Series or Movie for playing Cora Tannetti on The Sinner, which USA recently renewed for a second season (although Biel is rumored to be leaving the show). The actress told People she’d be celebrating her first nomination by spending some quality time with her three-year-old son: “We are going to cheers his orange juice in his sippy cup and my champagne in my champagne glass. And then I’m going to bed early! I’m like, Netflix and chilling. That’s my celebration.”\n\nCameron Britton\n\nBritton was nominated for Outstanding Guest Actor in a Drama Series for his role as serial killer Edmund Kemper in the Netflix crime series Mindhunter. The series is based on the murders Kemper committed between the 1960’s and 70’s, including the killing of his own mother and grandparents.\n\nWow. I feel like dancing and hugging my wife. https://t.co/41QM62Q8eh — Cameron Britton (@CameronBrittonH) July 12, 2018\n\nDarren Criss\n\nThis former star of Broadway and Glee received a nomination for his role as Andrew Cunanan in The Assassination of Gianni Versace: American Crime Story. “Zorro, Dr. Strange, Harry Dunne, Todd Alquist, and Jesus Christ … pretty incredible company to keep,” the actor said in a statement. “Humbled by your talent, Antonio Banderas, Benedict Cumberbatch, Jeff Daniels, Jesse Plemons, John Legend.”\n\nBetty Gilpin\n\nGilpin plays Debbie Eagan, who is known as “Liberty Belle,” on Netflix’s ’80s wrestling series GLOW. Gilpin tweeted her stunned reaction to the nomination:\n\nTiffany Haddish\n\nThis comedy queen, known for everything from hitting on Leonardo DiCaprio to a standout role in Girls Trip﻿, was nominated for her turn at hosting Saturday Night Live.\n\nOVERJOYED to be nominated for an #Emmy for when I hosted @nbcsnl!! I might even splurge for a new dress for this one!! Thank you everyone for your love and support! #sheready — Tiffany Haddish (@TiffanyHaddish) July 12, 2018\n\nJohn Legend\n\nSinger and songwriter John Legend was nominated for his titular role in Jesus Christ Superstar Live in Concert. His costar, Sara Bareilles, also snagged her first nomination for playing Mary Magdalene.\n\nThis is an appropriate gif for 13 Emmy nominations https://t.co/dA1ztaLVLM — John Legend (@johnlegend) July 12, 2018\n\n13 nominations for Jesus Christ Superstar this morning! John got two emmy nominations! If he wins, he will complete his EGOT and my spike tv award will probably be moved. But it’s ok I AM SO PROUD! — christine teigen (@chrissyteigen) July 12, 2018\n\nRicky Martin\n\nMartin’s Emmy nod was for his role in The Assassination of Gianni Versace: American Crime Story. He played Versace’s long-term partner, Antonio D’Amico.\n\nYes yes yes!!!!!! I’m so happy and humbled about this nomination. I think my head is about to explode. Joy joy joy THIS IS CRAZY!!! Thank you @MrRPMurphy https://t.co/GZvYKlVQ2l — Ricky Martin (@ricky_martin) July 12, 2018\n\nIssa Rae\n\nRae’s freshman nomination comes for her lead role on Insecure, which she created and co-wrote. The show has also earned her two Golden Globe nominations.\n\nAn Emmy nom?! So grateful to my #InsecureHBO family for making this possible and to you guys for the continuous love. Honored! pic.twitter.com/3eitZGKtiE — Issa Rae (@IssaRae) July 12, 2018\n\nKenan Thompson\n\nThis Emmy nomination for Thompson, who is currently SNL’s longest-employed actor, is well-deserved.\n\nWords cannot express how elated and humbled I am by these announcements today!!! Thank you from the bottom (cont) https://t.co/L73k4lSSi4 — Kenan Thompson (@kenanthompson) July 12, 2018\n\nLetitia Wright\n\nLast, but certainly not least, is Letitia Wright, who was nominated for her role as a supporting actress in the Black Mirror episode “Black Museum.”", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=18406752&cv=2.0&cj=1", "https://compote.slate.com/images/e96395ba-6c74-48e6-aa0f-ae2acb965b2e.jpeg?width=780&height=520&rect=2200x1467&offset=0x0", "https://pixel.quantserve.com/pixel/p-fw53_-Tq3MNK1.gif", "https://slate.com/media/components/adblock-message/slate-plus-promo.png", "https://www.facebook.com/tr?id=166975463695820&ev=PageView&noscript=1"], "top_img": "https://compote.slate.com/images/e96395ba-6c74-48e6-aa0f-ae2acb965b2e.jpeg?width=780&height=520&rect=2200x1467&offset=0x0", "keywords": [], "authors": ["Carmen Russo"], "canonical_link": "https://slate.com/culture/2018/07/first-time-emmy-nominee-reactions.html", "title": "“Elated and Humbled”: Kenan Thompson, Jessica Biel, and Other First-Time Emmy Nominees React", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "“Elated and Humbled”: Kenan Thompson, Jessica Biel, and Other First-Time Emmy Nominees React", "url": "https://slate.com/culture/2018/07/first-time-emmy-nominee-reactions.html", "description": "“Greetings from a shock and denial paralysis on my living room floor,” wrote GLOW’s Betty Gilpin.", "image": "https://compote.slate.com/images/e96395ba-6c74-48e6-aa0f-ae2acb965b2e.jpeg?width=780&height=520&rect=2200x1467&offset=0x0", "site_name": "Slate Magazine", "type": "article"}, "twitter": {"title": "“Elated and Humbled”: Kenan Thompson, Jessica Biel, and Other First-Time Emmy Nominees React", "description": "“Greetings from a shock and denial paralysis on my living room floor,” wrote GLOW’s Betty Gilpin.", "image": "https://compote.slate.com/images/e96395ba-6c74-48e6-aa0f-ae2acb965b2e.jpeg?width=780&height=520&rect=2200x1467&offset=0x0", "card": "summary_large_image", "site": "@slate"}, "article": {"published_time": "2018-07-13T19:41:12+00:00", "tag": "tv, emmys", "publisher": "https://www.facebook.com/Slate"}, "description": "“Greetings from a shock and denial paralysis on my living room floor,” wrote GLOW’s Betty Gilpin.", "news_keywords": "tv, emmys", "author": "Carmen Russo", "fb": {"app_id": 142011022527753}, "apple-mobile-web-app-title": "Slate", "application-name": "Slate", "msapplication-TileColor": "#660033", "msapplication-TileImage": "https://slate.com/media/sites/slate-com/icon.144x144.png", "theme-color": "#2c0022", "dfp-cache-buster": "7b1b9fb6f55280c03edfe3d6def54723514811de"}, "movies": [], "publish_date": 1531510872.0, "source": "https://slate.com", "summary": ""}