{"url": "www.mercurynews.com/2017/07/07/ben-afflecks-flirtation-with-lindsay-shookus-began-when-he-was-still-married-to-jennifer-garner/", "text": "Ben Affleck and “Saturday Night Live” producer Lindsay Shookus become publicly linked as a new couple when they were spotted grabbing dinner in Los Angeles Thursday night, but reports suggest they had become close and were even having an affair before their respective divorces.\n\nA People magazine report dates their friendship to at least May 2013 when five-time “SNL” host Affleck last appeared on the show. He was still married to actress Jennifer Garner at the time.\n\nThe next month, witnesses spotted Affleck and Shookus acting “flirty” at a premiere afterparty for the movie “The Heat.” They were at the bar of the Stone Rose Lounge on New York City’s Upper West Side, “chatting and laughing together.”\n\n“He definitely looked interested in her,” a partygoer told People at the time. The two later left together with other friends and headed to the nearby Mandarin Oriental hotel bar.\n\nSince then, Affleck would always stop by and visit her at the “SNL” studios whenever he was appearing on Jimmy Fallon’s show, according to a source. “They were both married at the time, but there was definitely a flirtation.”\n\nDarrell Hammond (left) and Lindsay Shookus (center) attend The Museum Gala at American Museum of Natural History on Nov. 16, 2006 in New York City. (Photo by Will Ragozzino/Patrick McMullan via Getty Images)\n\nBut Us Weekly, citing an insider close to Garner, alleges there was more than a flirtation. The insider said that Affleck and Shookus were having a “full-blown affair,” contending that, “They were sleeping together, sending each other cute texts and meeting up whenever they could.”\n\nGet more celebrity news and photos delivered to your inbox for free on weekdays.\n\nSign up for our Coffee Break newsletter here.\n\nBoth Garner and Shookus’ ex-husband, Kevin Miller, discovered the relationship in 2015, the Garner source claims, saying, “They were devastated when they found out about the affair.”\n\nBut Us Weekly also says that Garner has since come to terms with her estranged husband’s relationship with Shookus.\n\nThose who talked to People insist that Affleck and Shookus were “just friends” up until a few months ago. The romance is “relatively new,” a source told People, adding, “They’ve known each other for a long time. Marriages break up for a number of reasons.”\n\nYet another source backs up that claim that that their relationship has been platonic until recently, saying “this is newer waters for them. … They’ve been trying to take it slow but it’s progressing quickly. Their feelings are strong.”\n\nE! News previously reported that Affleck met up with Shookus in London recently, where they enjoyed a number of dates. A source told E! that they are in the early stages of a relationship, but insisted: “It’s more than a summer fling.”\n\nAffleck and Garner filed for divorce in April. They previously announced they were separating in 2015 after more than a decade of marriage. They have three children together — Violet, 11, Seraphina, 8, and Samuel, 5 — and continue to closely co-parent them.\n\nShookus previously married Miller, a then-fellow SNL producer, in 2010 before splitting a few years ago. They share one child.", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2017/02/14oscars_5.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "http://thumbnail.newsinc.com/32660881.sf.jpg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/02/14oscars_5.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/07/07/ben-afflecks-flirtation-with-lindsay-shookus-began-when-he-was-still-married-to-jennifer-garner/", "title": "Ben Affleck and Lindsay Shookus: friendship, flirtation or more began when he was still married to Jennifer Garner", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Reported new couple Ben Affleck and 'Saturday Night Live' producer Lindsay Shookus reportedly became friendly after he appeared on the show in May 2013.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Ben Affleck and Lindsay Shookus: friendship, flirtation or more began when he was still married to Jennifer Garner", "url": "https://www.mercurynews.com/2017/07/07/ben-afflecks-flirtation-with-lindsay-shookus-began-when-he-was-still-married-to-jennifer-garner/", "description": "Reported new couple Ben Affleck and ‘Saturday Night Live’ producer Lindsay Shookus reportedly became friendly after he appeared on the show in May 2013.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/02/14oscars_5.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2017-07-07T20:17:03+00:00", "modified_time": "2017-07-07T23:49:48+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Ben Affleck and Lindsay Shookus: friendship, flirtation or more began when he was still married to Jennifer Garner"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/02/14oscars_5.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1499356800.0, "source": "http://www.mercurynews.com", "summary": ""}