{"url": "www.metdaan.com/gwen-stefani-wedding-blake-cheating/", "text": "Can you believe your favorite diva Gwen Stefani is 48 years old? Time really flies. Since she rose up to the limelight, she has been quite busy making her fans happy. Her journey to fame was a long and turbulent one, and so was her love life. After one unsuccessful marriage, the artist has been dating country music artist Blake Shelton since 2015. The happy couple met on The Voice US. Although they got engaged, there have been rumors that Gwen called off the wedding because of ‘cheating rumors’. But, is this even true? You are about to find out in detail.\n\nGwen Stafani is an iconic figure in the world of music and show business, but how did she become so famous and adored? It was actually a long journey for her.\n\nGwen Renée Stefani was born on October 3, 1969, and she is not only a singer. Stefani is also a fashion designer, actress, and television personality!\n\nRemember her band No Doubt? That was her first start. Gwen was the co-creator and the lead singer of the band.\n\nThe band rose to fame in the mid-90s when they released their hit album Tragic Kingdom in 1995. Their hits included Just a Girl, Don’t Speak, Hey Baby and It’s My Life!\n\nShe soon found love in 1995, when she met Gavin on tour.\n\nThey got married in 2002.\n\nSadly, they divorced in 2016.\n\nThe couple has three children, but after 14 years of marriage, they divorced because of “irreconcilable differences”.\n\nRumor had it what Gavin cheated on her with their nanny, Australian lady Mindy Mann.\n\nIn March of 2016, Gavin opened up about the breakdown in his relationship. He added that their divorce caused him “a lot of pain and sadness”.\n\nGavin said in an interview:\n\n“It really teaches you perspective on life. It’s really health, happiness, and safety. After that, I don’t know what there is other than that.”\n\nAfter the divorce, Gwen found love once again.\n\nShe has been dating artist Blake Shelton since 2015.\n\nThey have been together for almost three years now. There was also a pregnancy rumor in 2017.\n\nAccording to Auntyacid, a source said:\n\n“They will get married one day but right now they are hyper-focused on getting pregnant. They believe there is still a chance for Gwen [to fall pregnant]. They are incredibly hopeful. Gwen and Blake started talking quickly about having a baby, but starting a family has not been easy for them. It’s something that they really want and it’s just not working out the way they wanted it to.”\n\nThe source goes on:\n\n“Blake told Gwen he does want kids of his own and Gwen was willing to try. With her, Blake has the exact relationship and family life he’d hoped to have with Miranda. Gwen’s everything he wants. They are so committed to one another.”\n\nThe pair then got engaged.\n\nBut after months of planning and thinking about having the wedding in June, Gwen allegedly called the wedding off.\n\nThe rumors said that the mother-of-three called it off after worrying that Shelton had been unfaithful.\n\nAccording to a source, this confrontation caused a huge fight, and Gwen said there won’t be a wedding.\n\nThe singer allegedly started feeling insecure and was bothered by the closeness of Blake and last year’s The Voice winner Chloe Kohanski.\n\nChloe was on Blake’s team, and Gwen saw more than a student-teacher relationship in them.\n\nA source went on to explain:\n\n“She started panicking about all the details — and about her future with Blake. Gwen and Blake had a massive fight and Gwen called off the wedding.”\n\n“Gwen feels as if she loves Blake more than Blake loves her right now. She told Blake all about her insecurities and how she couldn’t handle another heartbreaking divorce because of trust issues she needs to face.”\n\nSources also claim that now they are trying to work things out.\n\n“Most friends believe they will still walk down the aisle someday, but Gwen and Blake have some things to work on first. Trust is important and this isn’t the right time for a dream wedding. The last thing Gwen or Blake wants is another divorce.”\n\nHowever, according to the rumor-busting website, Gossip Cop, these rumors are false!\n\nThe website claims that Stefani and Shelton are not at war over Kohanski and that Stef’s rep told them the wedding is not off.\n\nAccording to the rep, the couple’s relationship is not “on the rocks.”\n\nThe site also adds that Chloe has a boyfriend.\n\nThe outlet also claims that Gwen isn’t insecure at all.\n\nFans simply don’t know who to believe right now, but one thing is for sure. Gwen and Blake are still together, and the pair went on a family holiday just before the new year.\n\nThey spent some quality time together with Gwen’s kids.\n\nBlake even taught them how to drive in a field full of mud! Moreover, they have also been spotted on a holiday in Mexico.\n\nGwen uploaded a photo to Instagram on the 18th of January and it all looks pretty well between these two.\n\nBlake is also set to perform at Luke Bryan’s Crash My Playa concert series.\n\nThe event takes place at the Riviera Maya in Mexico.\n\nIt seems like these two are having the time of their lives.\n\nHere is Gwen with her kids having a great time.", "images": ["data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%22341%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22620%22%20height%3D%22827%22%3E%3C%2Fsvg%3E", "http://www.metdaan.com/wp-content/uploads/2018/01/13-7.jpeg", "https://md.manaferra.com/wp-content/uploads/2020/03/md-logo.svg", "http://www.metdaan.com/wp-content/uploads/2019/01/dandruff-vs-lice-180x180.png", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%221156%22%3E%3C%2Fsvg%3E", "https://md.manaferra.com/wp-content/uploads/2020/03/md-black-logo.svg", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22534%22%20height%3D%22600%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22245%22%20height%3D%22150%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%221940%22%20height%3D%22500%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22500%22%20height%3D%22300%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22180%22%20height%3D%22180%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22245%22%20height%3D%22233%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22634%22%20height%3D%22559%22%3E%3C%2Fsvg%3E", "http://www.metdaan.com/wp-content/uploads/2018/01/01-118.png", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%22325%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22222%22%20height%3D%22300%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%22867%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%22434%22%3E%3C%2Fsvg%3E", "http://www.metdaan.com/wp-content/uploads/2018/01/7-214.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22615%22%20height%3D%22454%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22650%22%20height%3D%22366%22%3E%3C%2Fsvg%3E", "http://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.metdaan_com,DomainId.127693"], "top_img": "http://www.metdaan.com/wp-content/uploads/2018/01/01-118.png", "keywords": [], "authors": ["Metdaan Editorial Team"], "canonical_link": "https://www.metdaan.com/gwen-stefani-wedding-blake-cheating/", "title": "Did Gwen Stefani Call Off Wedding To Blake Shelton Because Of ‘Cheating’?", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no, viewport-fit=cover", "description": "Although they got engaged, there have been rumors that Gwen called off the wedding because of 'cheating rumors'. But, is this even true?", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Did Gwen Stefani Call Off Wedding To Blake Shelton Because Of 'Cheating'?", "description": "Read and find out what different sources have to say about the topic.", "url": "https://www.metdaan.com/gwen-stefani-wedding-blake-cheating/", "updated_time": "2018-08-09T12:15:16+00:00", "image": {"identifier": "http://www.metdaan.com/wp-content/uploads/2018/01/01-118.png", "width": 600, "height": 315}}, "article": {"section": "News", "published_time": "2018-01-20T14:20:39+00:00", "modified_time": "2018-08-09T12:15:16+00:00"}, "twitter": {"card": "summary_large_image", "description": "Although they got engaged, there have been rumors that Gwen called off the wedding because of 'cheating rumors'. But, is this even true?", "title": "Did Gwen Stefani Call Off Wedding To Blake Shelton Because Of 'Cheating'? - MetDaan", "image": "http://www.metdaan.com/wp-content/uploads/2018/01/01-118.png"}, "generator": "WordPress 5.4", "msapplication-TileImage": "http://www.metdaan.com/wp-content/uploads/2018/08/cropped-mobile-logo-3-270x270.png"}, "movies": [], "publish_date": 1516458039.0, "source": "http://www.metdaan.com", "summary": ""}