{"url": "https://www.monstersandcritics.com/smallscreen/what-happens-at-the-abbey-recap-the-murrays-a-slut-and-marissas-a-cheater-edition/", "text": "Cory and Murray are still arguing about Murray acting slutty at the party last weekend on What Happens at The Abbey on E!\n\n“He’s Dr. Jekyll, Mr. Ho,” Cory describes his boyfriend Murray when he has a shot of vodka.\n\n“I just wish I didn’t have to work with the kid,” Cory tells Kyle.\n\nYeah, well that’s the whole thing about not s**tting where you eat. #JustSaying\n\n“Cory and Murray have one thing in common, they both love Murray,” Kyle says.\n\nMurray tries to talk to Cory over the bar in the middle of their shift.\n\n“How can you be angry at me?” Murray asks.\n\n“You were being a drunk slut,” Cory says.\n\nMurray denies flirting with anyone, and Cory tells him he’s delusional.\n\nThen they have this little girl b***h fight that only lacks some slapping.\n\n“I can’t stand you, just get away from me,” Cory says.\n\n“You’re disgusting,” Murray snipes.\n\n“You’re disgusting,” Cory yells. “Chicken leg bitch!”\n\nMurray says Cory could get jealous of him standing too close to a plant.\n\nA few days later, Lawrence and Murray go out partying without Cory.\n\nIt’s a recipe for disaster. Murray gets really drunk, really fast.\n\n“Once again, hurricane Murray is passing through,” Brandi says.\n\nHis “straight” friend Giancarlo is there to dance with him and act anything but straight.\n\n“Giancarlo swears that he’s straight, but I don’t know how many straight dude tells other guys they smell good,” Elizabeth says.\n\nCory walks in while Murray is being too cozy with Giancarlo. Actually, he has shirt pulled up and his “straight” friend is feeling his abs.\n\n“He’s straight,” Elizabeth tells Cory, as they watch together.\n\n“Yeah, and I believe in unicorns,” Cory says.\n\n“Straight my ass,” Cory says.\n\n“I feel like telling Cory, Spoiler Alert! Your boyfriend is a slut,” Elizabeth says.\n\nCory and Murray have another argument in public.\n\nBut Murray’s too drunk to have a conversation.\n\n“Can you not throw a drink at me?” Murray asks, kinda politely. It’s hilarious.\n\nMarissa’s mom Debbie is in town to visit and convince her daughter to move back to New York.\n\n“I’m from an Italian family – moving out of the house is harder than quitting the mafia,” Marissa says.\n\nFulfilling all Italian mother stereotypes, Debbie’s worried Marissa isn’t eating.\n\n“The same thing that you’re doing here, you can do in New York,” her mom says.\n\nMarissa says she’s following her dream. Is it her dream to be a cocktail waitress?\n\nShe tells her mother that she’s invited to The Abbey that night.\n\n“Right, before we even go there, am I allowed to talk to people?” mom asks.\n\nYes, she may, but only if the people approach her.\n\nShe also tells her mom about Kyle.\n\n“Sometimes you’re a little quick,” her mom says.\n\nYes, Marissa, your mom did just imply that you’re a slut.\n\nTurns out, Marissa left a man back in New York. And he still thinks they’re a couple. #Oops\n\nWhen her mom gets to The Abbey, Marissa has Billy come take a pic with mom because mom loves Nick-the-Gardner.\n\nBut Mom Debbie doesn’t seem excited when she first meets Kyle.\n\n“OMG my mom is totally icing Kyle right now,” Marissa says.\n\nThe whole thing is so uncomfortable, I don’t even want to watch. #Awkward\n\nBut then she warms up. She does like getting her hands on the younger men.\n\n“Clearly, Kyle passed the mom test. A little too well,” Marissa says.\n\nHeidi Montage and her entourage hit The Abbey for drinks, and owner David Cooley greets them.\n\nHeidi is a regular.\n\nMarissa’s mom is bird-dogging Heidi Montag from across the bar.\n\nThen she goes for it.\n\n“Oh my God, I’m such a big fan,” Debbie squeals.\n\nThen she proceeds to tell Heidi her daughter’s whole story.\n\n“Marissa, come take a picture of me. Isn’t she cute?” she asks Heidi.\n\n“I told her all about you, Marissa,” Debbie says.\n\nHeidi is actually pretty gracious about the whole thing.\n\n“Heidi Montag is literally everything,” Marissa says.\n\nOh, jeez.\n\nGirl has some really inspirational role models. Bahaha!\n\nAt the end of the trip, her mom cries all the way to the airport.\n\n“Marissa, I love you, and you can always come home anytime,” she says.\n\nAfter she drops off Debbie at LAX, Marissa goes over the Kyle’s house to show him some headshots.\n\nAnd Marissa mentions that the laptop was a gift from her boyfriend back home.\n\n“Technically, I have a boyfriend back home,” Marissa’s a little sleazy. Poor guy back in New York is going to be humiliated when the show airs.\n\nKyle’s turned off. Don’t blame him.\n\nLawrence and Brandi go to see a fertility doc about having a baby together, and everything looks good.\n\n“It’s time to let the family in on the plan,” Lawrence says.\n\nLawrence and Brandi invite Lawrence’s dad to lunch at The Abbey to tell him they’re going to have a baby.\n\nDad’s concerned about what happens if they want to take their lives different directions.\n\n“Kid comes first,” Lawrence says.\n\n“We call this the house,” Lawrence gives his father a picture of Brandi’s uterus.\n\n“You couldn’t have done anything more to honor me as your father,” he says.\n\nI want to laugh really hard, but I think the guy is sincere.\n\nGlad it went smoothly for Lawrence and Brandi.\n\nIt’s not going smoothly for besties Kim and Elizabeth the day after the big party where they hooked up, with an audience, in their boss’s swimming pool.\n\n“Me and Elizabeth had our special moment,” Kim says.\n\n“This is classic straight girl oops,” Elizabeth says. Her feelings are hurt.\n\n“A few harmless kisses in a pool and she’s already renting a U-Haul for us,” Kim says.\n\n“I made out with you because I was drunk and having a good time,” Kim says.\n\n“If I was straight you would not have done what you did,” Elizabeth says.\n\n“I’m officially liking Kim romantically,” Elizabeth says in interview\n\nAshlee invites Daniel over to her house to make truffles. He thinks “truffles” are a code word for sex.\n\nTurns out Ashlee is a Beverly Hills trust fund baby. But she’s trying to start her own truffle business to prove she can make it on her own.\n\nDaniel thinks her truffles “taste like dirt.”\n\n“At first, I thought Daniel might be little bit nervous. But then I realize that Daniel is dumb as a brick,” Ashlee says.\n\nDaniel thinks he’s got it all going on.\n\n“I’d be a little intimidated by me too,” Daniel says. What? ROFL\n\n“You were a lot nicer at the pool,” Daniel says.\n\nAshlee says it’s more like doing charity work than having a date.\n\n“I’m not going to lie Ashlee. I think you struck out with me. But we can still be friends,” Daniel doesn’t take social clues very well as he’s ushered out the door as quickly as possible.\n\nNext week it appears they’re doing naked yoga. And now I don’t really ever want to see naked yoga.\n\nThings we’re left wondering\n\nWhy is Daniel’s ego so big? What am I missing here? I’m so not impressed by him.\n\nWill Elizabeth and Kim be able to stay friends after the hookup?\n\nWill Kyle totally give up on Marissa after her boyfriend revelation? Or is she cute enough to survive that?\n\nWhat Happens at The Abbey airs Sundays at 10/9c on E!", "images": ["https://www.monstersandcritics.com/wp-content/uploads/2017/05/ashlee-and-daniel.jpg", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/giancarlo.jpg", "https://www.monstersandcritics.com/wp-content/uploads/2020/03/cropped-cropped-mc-logo-stroke-1-1.png", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/facebook.png", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/kyle.jpg", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/email.png", "https://www.monstersandcritics.com/wp-content/themes/utility-pro/images/twitter.png", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/baby.jpg", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/kim.jpg", "https://secure.gravatar.com/avatar/?s=48&d=mm&r=g", "https://secure.gravatar.com/avatar/?s=40&d=mm&r=g", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/heidi.jpg", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/cory-and-elizabeth.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.monstersandcritics.com/wp-content/uploads/2017/05/dad.jpg"], "top_img": "https://www.monstersandcritics.com/wp-content/uploads/2017/05/giancarlo.jpg", "keywords": [], "authors": ["Sandy Malone"], "canonical_link": "https://www.monstersandcritics.com/smallscreen/what-happens-at-the-abbey-recap-the-murrays-a-slut-and-marissas-a-cheater-edition/", "title": "What Happens at The Abbey recap: The Murray’s a slut and Marissa’s a cheater edition", "meta_data": {"description": "What Happens at The Abbey recap: Murray is Dr. Jekyll and Mr. Ho, and Marissa has somebody at home that she forgot to mention to Kyle", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "What Happens at The Abbey recap: The Murray's a slut and Marissa's a cheater edition", "description": "What Happens at The Abbey recap: Murray is Dr. Jekyll and Mr. Ho, and Marissa has somebody at home that she forgot to mention to Kyle", "url": "https://www.monstersandcritics.com/smallscreen/what-happens-at-the-abbey-recap-the-murrays-a-slut-and-marissas-a-cheater-edition/", "site_name": "Monsters and Critics", "image": {"identifier": "https://www.monstersandcritics.com/wp-content/uploads/2017/05/giancarlo.jpg", "secure_url": "https://www.monstersandcritics.com/wp-content/uploads/2017/05/giancarlo.jpg", "width": 800, "height": 443}}, "article": {"publisher": "https://www.facebook.com/monsterscritics", "author": "https://www.facebook.com/SandyMaloneWIV/", "tag": "What Happens At The Abbey", "section": "Smallscreen", "published_time": "2017-05-22T03:00:27+00:00"}, "fb": {"app_id": 220249472958}, "twitter": {"card": "summary", "description": "What Happens at The Abbey recap: Murray is Dr. Jekyll and Mr. Ho, and Marissa has somebody at home that she forgot to mention to Kyle", "title": "What Happens at The Abbey recap: The Murray's a slut and Marissa's a cheater edition", "site": "@monstersandcrit", "image": "https://www.monstersandcritics.com/wp-content/uploads/2017/05/giancarlo.jpg", "creator": "@SandyMalone_"}, "p": {"domain_verify": "9abcc0658f1dd4ad8d86a2c33eba0388"}, "google-site-verification": "W0V7_Td7mscUYxsJwzRBhIxHF4JB2PnzdGVKDImP54o", "viewport": "width=device-width, initial-scale=1", "msapplication-TileImage": "https://www.monstersandcritics.com/wp-content/uploads/2019/05/cropped-monsters-critics-favicon.png"}, "movies": [], "publish_date": 1495422027.0, "source": "https://www.monstersandcritics.com", "summary": ""}