{"url": "http://www.cnn.com/2010/CRIME/10/05/celebrity.lawyer.wasser/index.html", "text": "Los Angeles, California (CNN) -- Laura Wasser is known around Hollywood as the \"Disso Queen,\" as in dissolution of marriage. As in d-i-v-o-r-c-e.\n\nThe first marital dissolution she ever handled was her own, in 1993. She met a guy while she was at Loyola Law School, married him, and it lasted a year. She filed the paperwork as soon as she passed the bar, landing -- permanently, she says -- in Splitsville.\n\nThe divorce was simple. There was no money to wrangle over, no kids. Still, Wasser vowed she'd never get divorced again because she'd never get married again.\n\n\"Everybody should get married -- once,\" Wasser said. \"I was 25.\"\n\nThese days, Wasser is a divorce lawyer to the stars and there's much more to fight over: Millions of dollars, high-end property, children blessed by the gene pool -- not to mention reputations that can anchor a record label or movie franchise.\n\nShe's currently trying to hammer out a settlement for Mel Gibson's wife, Robyn, and recently had dinner with Gibson's criminal lawyer, Blair Berk.\n\nShe dropped Britney Spears (another Berk client) when the pop star wouldn't follow her advice during a 2008 custody dispute. Before that, in 2003, she helped Angelina Jolie break away from Billy Bob Thornton with only the tiniest ripple of gossip.\n\nFollow CNN.com's Lawyers to the Stars series\n\nWasser is 42 now and is raising two boys at her home in the Hollywood Hills. The father of the youngest child lives with her. The father of the older boy is a friend and he visits often, she said. It's her family, as she defines it.\n\nShe is a second-generation celebrity lawyer. Her father, Dennis Wasser, handles the family affairs of studio moguls and billionaires. She works at his firm, giving the families of broken-hearted rockers and TV and movie stars the same TLC her father showers on their bosses.\n\nShe's also a devoted fashionista, and unlike most other celebrity lawyers, has been known to walk the red carpet on occasion. In July, she was featured in Vogue.\n\n\"My mom said I can die happy because I was in Vogue,\" Wasser said.\n\nShe was conceived on the night her father passed the California Bar exam (\"My parents did the math,\" she noted) and Dennis Wasser knew his little girl would follow in his footsteps. Her father chose the name Laura Allison Wasser so the initials would spell L.A.W.\n\n\"My mom wanted to name me Rebecca,\" she added. But then, her initials would have been R.A.W. meaning her destiny would be \"What -- a porn star?\" she joked. A sushi chef?\n\nIn the bureaucracy of law firms, most of the paperwork is identified by the initials of the lawyer generating it. \"There's another Laura in the office, so everyone just calls me \"Law,\" Wasser said.\n\nWasser and her younger brother grew up in Beverly Hills, attending high school with the privileged scions of Hollywood studio heads, agents, producers and directors. Her parents moved there when she was 6 because the schools were so good, she said. But, she insisted she wasn't spoiled, even if she is by her own admission \"a major clothes horse.\"\n\n\"A lot of these kids we were in school with got huge allowances and there was a car with a big bow on it in the driveway when they turned 16 and I couldn't for the life of me figure out why I was so deprived,\" Wasser recalled.\n\nShe had to negotiate for her car, agreeing to get a job to help pay the insurance. Then, she said, she wrecked the car, anyway. She also had to negotiate her allowance and curfew. She realizes now that the first seeds of a legal career were being planted.\n\n\"I'll tell you, I never thought I'd ever be going into law, and certainly not the same kind of law as my dad,\" she said. \"When I started clerking here, it kind of clicked. When you grow up with it, it's in your blood.\"\n\nBecause she was raised in zip code 90210, Wasser is familiar with the territory her clients tread. Besides, she said, \"Dissolution and custody matters are the great equalizers.\"\n\n\"Having done this for a while, you do realize that everybody has the same issues,\" she explained. \"It doesn't matter how much money you have or how much power you have, you are always afraid you're never going to see your child.\"\n\nShe advises her famous clients to try and work out a settlement because once legal papers are filed, marital discord becomes a matter of public record. She tells clients to remember what they once saw in the other person.\n\n\"Take yourself back to either when you were in dating, or when you were in the delivery room holding her hand. There must something you liked about him or her,\" she advises.\n\n\"In the midst of it, they hate each other because they're still in an adversarial position. As soon as the deal is done, people start liking each other more.\"\n\nAnd, she reminds clients that money they're paying her could be going to their kids. When they tear at each other in her office, she tells them to take it to a counselor. \"I'm not qualified. A counselor charges $150 an hour, and that's a whole lot cheaper than me,\" she says. \"Do you really want to pay me 25 grand over who gets the kids on Tuesday nights?\"\n\nWasser values discretion and says she's proud the Gibsons' divorce hasn't been in the headlines even though millions are at stake, while the breakup with girlfriend Oksana Grigorieva are endless tabloid fodder.\n\n\"Their dissolution, we haven't seen anything about it,\" Wasser said, referring to her client Robyn Gibson's divorce petition.\n\nShe said the best advice she received came from a legal opponent years ago:\n\n\"He said, 'Laura, you and I are going to be working together long after your client is gone. I was young and pretty passionate.\" She said she learned to be less adversarial.\n\nWasser is also keenly aware that she was born well-connected. \"My dad has been doing this for a while,\" she said. \"Any of the kids I went to high school with, the agent across the way at CAA, they call me. There's a lot of back-scratching going on. It's total word of mouth.\"\n\nPersonal: Wasser is a single mom with two boys. She vows to never marry again.\n\nClients: Robyn Gibson, Kate Walsh, Britney Spears, Angelina Jolie, and others who will go unnamed.\n\nQuote: \"I represent celebrities, but I am not a celebrity.\"", "images": ["http://i2.cdn.turner.com/cnn/2010/SHOWBIZ/09/29/celebrity.lawyer.wasser/tzvids.wasser.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/misc/advertisement.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/1px.gif", "http://i.cdn.turner.com/cnn/2010/CRIME/10/05/celebrity.lawyer.wasser/t1larg.wasser.jpg", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/icons/btn_close.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/mosaic/15x15_PLUS_bt.jpg", "http://i2.cdn.turner.com/cnn/2010/SHOWBIZ/09/30/celebrity.lawyer.singer/tzvids.marty.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/mosaic/bttn_close.gif", "http://i2.cdn.turner.com/cnn/2010/CRIME/10/04/celebrity.lawyer.braun/tzvids.harland.jpg", "http://i.cdn.turner.com/cnn/2010/CRIME/10/05/celebrity.lawyer.wasser/tzvids.wasser.jpg", "http://i2.cdn.turner.com/cnn/2010/CRIME/09/27/celebrity.lawyer.lohan.holley/tzvids.shawn.jpg", "http://i2.cdn.turner.com/cnn/2010/SHOWBIZ/10/01/celebrity.lawyer.allred/tzvids.gloria.allred.jpg", "http://i2.cdn.turner.com/cnn/2010/CRIME/09/28/celebrity.lawyer.berk/tzvids.blair.jpg", "http://cdn.cnn.com/cnn/1.gif", "http://i2.cdn.turner.com/cnn/2010/images/09/25/stacks.lawyer.quiz.jpg", "http://i.cdn.turner.com/cnn/images/1.gif"], "top_img": "http://i.cdn.turner.com/cnn/2010/CRIME/10/05/celebrity.lawyer.wasser/tzvids.wasser.jpg", "keywords": [], "authors": ["Ann O'Neill"], "canonical_link": "http://www.cnn.com/2010/CRIME/10/05/celebrity.lawyer.wasser/index.html", "title": "'Disso Queen' tends Hollywood's broken hearts", "meta_data": {"TITLE": "'Disso Queen' tends Hollywood's broken hearts   - CNN.com", "fb_title": "'Disso Queen' tends Hollywood's broken hearts", "description": "Laura Wasser is known around Hollywood as the \"Disso Queen,\" as in dissolution of marriage. As in d-i-v-o-r-c-e.", "AUTHOR": "By  Ann O'Neill, CNN", "SECTION": "CRIME", "fb": {"admins": 690014395, "app_id": 80401312489, "page_id": 129343697106537}, "og": {"type": "article"}, "viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.cnn.com", "summary": ""}