{"url": "https://www.cosmopolitan.com/entertainment/a22515534/kylie-jenner-body-diet-workout/", "text": "Kylie Jenner is pretty busy thanks to having a casual billion-dollar (almost) beauty empire, a reality TV show, and a new baby girl. She also happens to maintain a pretty solid health and fitness routine, which is an impressive and inspiring feat regardless of how busy you are. Wanna know exactly how she does it? Of course you do.\n\n1. She Exercises on Her Terms\n\nUnlike her siblings who go hard at the gym and chronicle everything from leg day to beach yoga on their social media, Kylie seems to work out infrequently. Actually, she only recently started getting into a regular gym routine post-baby.\n\n\"I planned my first workout for Monday,\" Kylie said during a Q&A with her best friend Jordyn Woods, which she filmed after she'd given birth to Stormi. \"I'm not even doing it to get in shape.\"\n\nSo how does Kylie exercise when she does feels like it? Thanks to Instagram, we know she takes walks with Baby Stormi, and goes paddle boarding (which both happen to double as photo opps, ahem):\n\nStrong is sexy, and clearly Kylie knows it.\n\n2. She Eats Fast Food When She Craves It\n\nAnyone who follows Kylie on Snapchat knows she loves In-N-Out Burger (saaaaame). The fast food was her biggest pregnancy craving, because—as she explained to her doctor in her birth announcement video—\"It’s just In-N-Out these days literally tastes like...nothing I’ve ever had.\"\n\n3. But She Also Tries to Eat Organic Meals\n\nWhen she's not indulging her In-N-Out cravings, Kylie tends to eat organic foods. \"Kylie eats like a typical teenager but she's also super aware of what she puts in her body when it comes to fresh and organic foods,\" Khloé Kardashian once said of her sister's daily diet.\n\n\n\n4. She Can't Eat Dairy\n\nKylie is lactose intolerant, so completely cutting out dairy had a big impact on her overall health. \"I didn't realize I was lactose intolerant. I just became lactose intolerant, like, this year,\" she explained back in 2015. Once she stopped consuming dairy, Kylie told E! News that she naturally slimmed down.\n\nFYI, if you're wondering whether it's common to develop lactose intolerance later in life, the answer is yes! You could even say it's pretty typical: The NIH reports that \"approximately 65 percent of the human population has a reduced ability to digest lactose after infancy.\"\n\n5. She's All About Home Cooking\n\nCooking at home is a great way to maintain a balanced diet, since you can make a cheesy (or in Kylie's case, a cheese-free) pizza topped with pepperoni one night, and a grain bowl packed with veggies the next. \"I love cooking these days,\" Kylie said in 2016. \"I like to make burgers. I also make spaghetti because my mom is obsessed with spaghetti. It's the first thing I learned to cook. I love potatoes; I'll make all different kinds of potatoes, like scalloped potatoes, mashed potatoes, candied yams.\"\n\nKylie often showcases her cooking adventures on social media. Here's some yummy footage of bacon from her Snapchat:\n\nP.S. Travis Scott has also revealed that she makes a mean peanut butter and jelly sandwich. The more you know!\n\n6. She Realized Cleanses Are BS\n\nKylie has absolutely no tolerance for them—as evidenced by the one time she documented her attempt at a juice cleanse on Snapchat, only lasted three drinks, and then decided to get sushi instead.\n\n7. She Rarely (If Ever) Touches Alcohol\n\nThere's nothing wrong with kicking back with a glass of wine, but Kylie—who is still under 21—hadn't drunk a drop of booze as of August 2017. \"You know, I've never had a drink before,\" she admitted in an interview. None of Kardashian-Jenner sisters are big drinkers (Khloé is the only one who even dabbles), so perhaps Kylie inherited this preference from her fam.\n\n8. She Works Out with Her Family\n\nBack in 2016, Kylie revealed that she works out with Kourtney and uses the same trainer as Kanye West:\n\nI work out with [my sister] Kourtney and her trainer, who is also Kanye's trainer. We work out for an hour. It's hard, but it makes me feel good. Kourtney likes to blast music. I'm really into Kanye's new songs. PartyNextDoor has a song called 'Party at 8,' which my friends and I have been listening to on repeat.\n\nBut even when she's breaking a sweat with a group, she does it on her terms. Khloé explained it best in a blog post on her website:\n\nKylie doesn't really work out. She did come with Kourt and me one time, when [our trainer] Don was training us. Don does four quarters in each session and Kylie only stayed for one quarter. When she was leaving, we were like, 'Hello?' She's like, 'No, I'm OK. I'm not feeling this.' And she just walked away. She doesn't have any remorse, either. We were like, 'Kylie, you only did one quarter!' and she's like, 'That's all I wanted to do.' OK then—you do you, Kylie!\n\n9. She Gets Seven Hours of Sleep a Night\n\nSleeping well has a huge impact on your energy levels and mood throughout the day, and despite her jam-packed schedule, Kylie gets close to eight hours of ZZZs every night. Or at least she did before she had a baby! Back in 2016, her day started at 7:00 a.m. and ended around midnight when she hit the hay.\n\n10. She Embraced the Normal and Healthy Changes Her Body Went Through Throughout Her Pregnancy\n\nKylie says her body changed a lot during her pregnancy (which, reminder, is to be expected!), and while it's certainly been an adjustment, she's embraced it. \"At such a young age to see your body go through such a change, and it is physically, mentally, and emotionally, a challenge,\" she said in her Q&A with Jordyn. \"It's also a beautiful thing, and it was such a great pregnancy and birth and I'm so happy and I would have done the same thing over again.\"\n\n\n\nSo very here for Kylie's positive relationship with exercise, food, and the physical changes her body has gone through!", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/get-that-butt-lead-bru-1529619658.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-05-19-at-7-16-32-pm-1526771802.png?crop=1.00xw:0.723xh;0,0.120xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.345xh;0,0.0280xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.345xh;0,0.0280xh&resize=1200:*", "keywords": [], "authors": ["Mehera", "Mehera Bonner Is A News Writer Who Focuses On Celebrities", "Royals"], "canonical_link": "https://www.cosmopolitan.com/entertainment/a22515534/kylie-jenner-body-diet-workout/", "title": "10 Things Kylie Jenner Did to Get the Body She Has Now", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "10 Things Kylie Jenner Did to Get the Body She Has Now", "description": "Just in case you're wondering.", "url": "https://www.cosmopolitan.com/entertainment/a22515534/kylie-jenner-body-diet-workout/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.345xh;0,0.0280xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-07-24 03:26:43", "published_time": "2018-07-24 03:21:00", "section": "Celebrities & Entertainment", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.345xh;0,0.0280xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "How to Get Kylie Jenner's Body - Kylie Jenner Diet and Workout Tips", "description": "Here's everything we know about Kylie Jenner's daily diet and workout routine.", "keywords": "kylie jenner diet, kylie jenner exercise, kylie jenner, kylie jenner body, kylie jenner workout", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.689xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment", "sailthru.date": "2018-07-24T15:21:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.345xh;0,0.0280xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-956216630-1532445963.jpg?crop=1.00xw:0.689xh;0,0", "sailthru.socialtitle": "10 Things Kylie Jenner Did to Get the Body She Has Now", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1532373660.0, "source": "https://www.cosmopolitan.com", "summary": ""}