{"url": "https://www.tvinsider.com/712038/ashlee-simpson-evan-ross-show-music/", "text": "After 13 years, Ashlee Simpson-Ross is once again ready to show the pieces of her through a new docuseries on E!. This time, she's joined by husband and Star actor Evan Ross.\n\nThe six-episode show, titled Ashlee+Evan, chronicles the celebrity couple as Ashlee returns to work after a decade of being a stay-at-home mom and how that changes the family dynamic. She and her spouse (who is the youngest son of Diana Ross) give viewers a glimpse into their everyday lives — the people in the circle, their creative process, and more. Through it all, they’re collaborating on projects including a duet album, which comes with a unique set of challenges.\n\nSee Also WWE Couple Miz and Maryse on Why 'Miz & Mrs' Is More Comedy and Less Drama The new parents chronicle a big move to Austin and birth of their first child Monroe Sky on the new USA Network docuseries.\n\nBefore the show’s premiere, Ashlee and Evan sat down for a Q&A to talk about why they agreed to have cameras follow them at this stage in the game.\n\nTake me back to when this project came about. Did you two have any trepidation about putting your life out there at this stage of the game?\n\nEvan: Yeah. We were definitely frightened [Laughs]. It all started with me and Ashlee working on our album. We wanted to film the process because we were having a lot of fun with it. For one, it was the first time we’ve ever done it together like this. It was something that was a long time coming so we really wanted to document it.\n\nThen it ended up kind of turning into something else. We started to realize a lot of where the inspiration came from comes from our actual life and our home life and our relationship and our family. Slowly but surely, we thought it would be nice to do a documentary or document it in some kind of way that was entertaining and [gave people a chance] to get to know us. It turned into a docuseries/reality show — we wanted it to feel very authentic. That’s how it all began, and here we are now.\n\nAshlee, you’ve been through the process before. What was it like to have the cameras back on you in this kind of environment?\n\nAshlee: It was definitely a different experience. It has been a long time, but it was nice this time to be a producer on the show. We had a hand in how it was shot and what we were doing. That was very nice but the first few days I had to get used to it.\n\nWhat's great about the show is you can feel the love with your family and your support system. There are things you go through and disagreements you have, like any other couple, but it’s not drama for the sake of drama. Did you get a sense that your approach to reality TV was different?\n\nAshlee: Definitely.\n\nEvan: Truthfully, we really did open up our world to the world, you could say. We didn’t want it to feel manufactured in any sort of way. We didn’t want to do something to just make people laugh or push the limits. We wanted it to feel like us. I hope and think we are entertaining enough. We really wanted to spread a positive message, too. The world is ready for positivity and love right now.\n\nThe first episode really sets the tone for the series; There are these touching, emotional moments with mom Diana Ross listening to the music you created. What was it like to have the family agree to be shown as part of the series?\n\nEvan: I just feel really lucky I have family that loves and supports us in the way they do. And that also trust that we’re going to do something that is right in the right kind of way. They did and do. It’s really special because they are such a huge part of our lives. My sisters, brothers, mom — especially my mom, who is such a huge inspiration in my life. She has been so supportive of me and Ashlee, marrying me and Ashlee. It was really special that we were wanting and willing to do it.\n\nWhat was it like watching the show back? When you’re in the moment, I’m sure it’s a different perspective.\n\nAshlee: The first time watching it I was a little nervous. Then I was happy how it came out.\n\nEvan: I was actually impressed that it really was us.\n\nAshlee: Me too.\n\nEvan: Even after the editing process we didn’t lose ourselves in it or what we were trying to do. It really felt right.\n\nAshlee: And the storylines are what was actually happening.\n\nEvan: It really was truthfully going on.\n\nViewers from all walks of life can certainly relate to juggling career and family — having one spouse travel for work while the other takes on the role of both parents. Even your friends are going through their own struggles, which we see on the show.\n\nAshlee: We have such incredible friends. I think going through the stories, sometimes we didn’t expect moments to happen. They just happened. There are moments in there that show the way we support our friends and we hope that comes to light. We would like to spread a little positivity.\n\nEvan: I think it’s nice being able to share these experiences with people. I think, even in a working relationship, all that stuff becomes hard. When one parent has to take over a lot of the parenting and the other is working. Then it switches. It is a real thing, we all deal with it. I’m sure because I know a lot of my other friends are going through it, as well. Everybody wanting to do the best we can, I think, that is what we are showing.\n\nWhat can we expect this season as it progresses? Are we going to be seeing the finished album?\n\nEvan: You’re definitely going to see us working our way up to a performance.\n\nAshlee: We go on a journey of being parents, trying to find our balance. For me, it’s about getting back to work again. You see all that.\n\nEvan: Then there is a lot of chaos and craziness.\n\nAshlee: Our friends are fun to watch. They are hilarious.\n\nAshlee, are we going to see your sister Jessica on the show?\n\nAshlee: Yes, she makes an appearance.\n\nhttps://youtu.be/F4hcizV3GkE\n\nWhat can you tell me about the album itself? I believe it was supposed to come out this fall. Is that still the plan?\n\nEvan: With every episode, a record will come. The first one is coming out a few days before the premiere on September 7. This way, you get to really live with us through the entire process of making this album. Even though, by the time we finish shooting, we’re still working on a lot of the music. We are still in the studio working. But you really get to see what is going on as we’re doing this album.\n\nWhat kind of vibe are you going for?\n\nEvan: It’s definitely soulful. You hear influences in our vocals. Ashlee, you always hear her rock vocals — that soulful, tone that gives such a raspy vibe.\n\nAshlee: It was different vibes we went through for this. We got to work with Verdine White of Earth, Wind & Fire.\n\nEvan: He has become someone close in our life. You get a taste of a lot of different inspirations we have in the music as you listen. It was definitely a passion project.\n\nAnd on top of that, you have a fashion line named after daughter Jagger Snow coming out! I don’t know how you juggle everything.\n\nEvan: I’m not sure either right now. But we have that, we’re working on that. We released that Zadig & Voltaire capsule, which we are really proud of and loved working with them. It was a nice lead-in to the unisex line we are creating now.\n\nAfter all you experienced in the docuseries, do you want this to be a one-and-done season or would you be open to doing more?\n\nEvan: We’d be open. We just have to figure out what it would be about. We had an amazing experience. It worked out nicely.\n\nAshlee: It did. It was a nice experience.\n\nIf the music resonates and the show is successful, could you follow it up with a tour? What are you hoping for once the show and music reach the public?\n\nAshlee: We would definitely love to do a tour together.\n\nEvan: We are even talking about it now, getting out there.\n\nAshlee: It has been fun to start to perform together, as well, learning with each other. So that has been cool.\n\nWith your background and being husband and wife, you certainly bring something different to the table. It adds a different dynamic to what is out there.\n\nAshlee: That's what we think. We make great music together, and it’s something we can start now and continue to do in the future. Keep it in the family.\n\nAshlee+Evan, Series Premiere, Sunday, September 9, 10/9c, E!", "images": ["https://www.tvinsider.com/wp-content/uploads/2020/04/best-lines-april-17-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/08/NUP_182461_1281-855x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2018/07/Untitled-design-57-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/comfort-tv-logo.gif?x=1", "https://www.tvinsider.com/wp-content/uploads/2018/08/NUP_182780_1342-1000x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/one-world-together-at-home-full-cover-304x195.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "https://www.tvinsider.com/wp-content/uploads/2018/07/Screen-Shot-2018-07-30-at-11.45.35-AM-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/whats-on.png", "https://www.tvinsider.com/wp-content/uploads/2018/09/NUP_182372_0169-408x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/07/NUP_183459_0002.jpg"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/08/NUP_182780_1342-1000x570.jpg", "keywords": [], "authors": ["Scott Fishman", "Tv Insider Staff", "Samantha Bergeson", "Paige Strout", "Matt Roush", "Jim Halterman", "Lauren Schuster"], "canonical_link": "https://www.tvinsider.com/712038/ashlee-simpson-evan-ross-show-music/", "title": "Ashlee Simpson-Ross & Evan Ross Open Up About Their New E! Show & Making Music Together", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "The celebrity couple opens up about their album and putting their lives in the public eye.", "url": "https://www.tvinsider.com/712038/ashlee-simpson-evan-ross-show-music/", "title": "Ashlee Simpson-Ross & Evan Ross Open Up About Their New E! Show & Making Music Together", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/08/NUP_182780_1342-1000x570.jpg", "width": 1014, "height": 570}}, "theme-color": "#00aeef", "title": "Ashlee Simpson-Ross & Evan Ross Open Up About Their New E! Show & Making Music Together", "description": "The celebrity couple opens up about their album and putting their lives in the public eye.", "author": "Scott Fishman", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/712038/ashlee-simpson-evan-ross-show-music/", "title": "Ashlee Simpson-Ross & Evan Ross Open Up About Their New E! Show & Making Music Together", "creator": "@tvinsider", "description": "The celebrity couple opens up about their album and putting their lives in the public eye.", "image": "https://www.tvinsider.com/wp-content/uploads/2018/08/NUP_182780_1342-1000x570.jpg?459", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}