{"url": "https://tv.avclub.com/what-is-james-van-der-beek-doing-in-what-would-diplo-do-1798191950", "text": "James Van Der Beek, not Diplo, stars in What Would Diplo Do? (Photo: Shane McCauley/Viceland)\n\nTV Reviews All of our TV reviews in one convenient place. Prev Next View All\n\nWhat Would Diplo Do? B- What Would Diplo Do? Season 1\n\nAdvertisement\n\nThe best celebrity impressions are usually the most accurate—if you don’t nail your halted speech patterns, the audience won’t realize that’s supposed to be Christopher Walken subbing for the story-time reader. But while imitation might be the sincerest form of flattery, it’s hardly the highest or most engaging type of comedy. Even the most entertaining bits work best in small or sketch-length doses.\n\nSo why would James Van Der Beek, in his first foray into showrunning, want to build an entire series around pretending to be world-famous DJ and record producer Diplo? That’s just one of several questions surrounding the premiere of What Would Diplo Do?, Viceland’s first scripted comedy. Despite an inspired turn in Don’t Trust The B— In Apt. 23, the Dawson’s Creek alum doesn’t have a significant comedy background. He might have played a more egotistical version of himself to great effect opposite Krysten Ritter, but would he be able to carry a whole series while channeling that self-deprecation through someone else? And why would Viceland make its scripted comedy debut with untested writers and producers?\n\nAll of these concerns might harsh the faux Diplo’s buzz, if he cared about haters, which he swears he doesn’t. But though the premise is a bit thin, What Would Diplo Do? is surprisingly funny. It combines elements of more traditional sitcoms with the semi-autobiographical comedies that remain en vogue—there are teachable moments, but they come long after insulting someone like Calvin Harris. And despite airing on a cool-kid outlet like Viceland, most of the boundary pushing has to do with the format, as well as Van Der Beek fully breaking out of his meme-ridden, teen-drama image.\n\nThough there are a handful of producers on deck, including Diplo himself, most of the credit goes to Van Der Beek. He’s taken great care in constructing the character, going beyond scanning social media feeds for most-used emojis and hashtags to nail the Tupelo native’s cadences, which the actor described as, oddly enough, “part Philly, part Latino” at the Television Critics Association press tour. But the faithfulness of this “adaptation” is ultimately irrelevant—the Major Lazer co-founder’s small-screen reality is far more interesting when it’s free-associating rather than trying to answer the question in the title.\n\nWhat Would Diplo Do? is also a bit of a self-contradiction, in that its loose structure—at TCAs, Van Der Beek and his co-EPs compared it to jamming in a garage band—belies the savviness that went into its creation. Dillon Francis plays the thoroughly clueless member of the Mad Decent squad, but is a real-life DJ and music producer, and can attest to just how close Van Der Beek’s approximation is. But that calculation can just as quickly get chucked in favor of what Van Der Beek calls a “guerilla” approach to producing the show, which also fielded pitches from the real Diplo like, “What if I joined a cult to get my song to number one?”\n\nThough a lot hinges on Van Der Beek’s performance, the rest of the ensemble is made up of talented performers, albeit in obvious roles. There’s a long-suffering assistant (Dora Madison), a put-upon handler (Michael Croner), and an avaricious manager (Bobby Lee) who only weathers the madness because of the inevitable payday. Together, they enable Diplo, who makes outrageous demands more out of a lack of awareness than a sense of entitlement. It’s a fine line, but Van Der Beek walks it; he acknowledges that Diplo is a man of extraordinary financial means and talent, so he makes sure he’s piss-poor in just about every other respect. Under the direction of music video vet Brandon Dermer, What Would Diplo Do? humanizes as much as satirizes its big-name subject.\n\nHere’s where it gets tricky—beyond the Twitter beefs and ass-related crowdfunding, there’s no easily summoned image of Diplo, which again, makes it hard to pick traits to heighten or send up. So the series takes aim at the EDM culture’s general bro-ishness, which ostensibly spawned the kind of guy who would inspire Van Der Beek to pick a fight with Denny’s. Though that’s not nearly as pointed of a parody, it does result in some Police Squad! and The Hotwives Of Orlando-like moments.\n\nAdvertisement\n\nThat’s probably not the high praise the show’s creators are hoping for—in fact, Van Der Beek et al. invoked series like Louie and films like This Is Spinal Tap when pitching the show, while admitting those were lofty ambitions. In that sense, the show’s creators and network display more self-awareness than their protagonist, not to mention give more recognition to their inspiration. But while they haven’t created anything as groundbreaking or enduring as that Louis CK series or Christopher Guest mock rockumentary, the folks behind What Would Diplo Do? have spun a solid half- hour comedy out of what could have just been a sketch (and was an ad). And there’s always room for a remix.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v6xuql2vwiafinfubo3h.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v6xuql2vwiafinfubo3h.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/what-is-james-van-der-beek-doing-in-what-would-diplo-do-1798191950", "title": "What is James Van Der Beek doing in What Would Diplo Do?", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "TV, Spike Jonze, Viceland, Diplo, James Van Der Beek, What Would Diplo Do?, Pre-Air, TV Club", "news_keywords": "TV, Spike Jonze, Viceland, Diplo, James Van Der Beek, What Would Diplo Do?, Pre-Air, TV Club", "twitter": {"url": "https://tv.avclub.com/what-is-james-van-der-beek-doing-in-what-would-diplo-do-1798191950", "card": "summary_large_image", "site": "AVTVClub", "title": "What is James Van Der Beek doing in What Would Diplo Do?", "description": "The best celebrity impressions are usually the most accurate—if you don’t nail your halted speech patterns, the audience won’t realize that’s supposed to be Christopher Walken subbing for the story-time reader. But while imitation might be the sincerest form of flattery, it’s hardly the highest or most engaging type of comedy. Even the most entertaining bits work best in small or sketch-length doses.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v6xuql2vwiafinfubo3h.jpg"}, "description": "The best celebrity impressions are usually the most accurate—if you don’t nail your halted speech patterns, the audience won’t realize that’s supposed to be Christopher Walken subbing for the story-time reader. But while imitation might be the sincerest form of flattery, it’s hardly the highest or most engaging type of comedy. Even the most entertaining bits work best in small or sketch-length doses.", "og": {"title": "What is James Van Der Beek doing in What Would Diplo Do?", "type": "article", "url": "https://tv.avclub.com/what-is-james-van-der-beek-doing-in-what-would-diplo-do-1798191950", "description": "The best celebrity impressions are usually the most accurate—if you don’t nail your halted speech patterns, the audience won’t realize that’s supposed to be Christopher Walken subbing for the story-time reader. But while imitation might be the sincerest form of flattery, it’s hardly the highest or most engaging type of comedy. Even the most entertaining bits work best in small or sketch-length doses.", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v6xuql2vwiafinfubo3h.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": ["/ajax/inset/iframe?id=youtube-video-SoAIzki2jOI&start=0"], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}