{"url": "https://www.thecut.com/2018/10/a-star-is-born-lady-gaga-costumes.html", "text": "Bradley Cooper and Lady Gaga in A Star Is Born (2018). Photo: Courtesy of Warner Bros. Pictures\n\nFashion happens faster than ever these days. Each week, we attempt to make sense of it in a column called, “What Is Fashion?”\n\nEven if you haven’t seen A Star Is Born, I know you’re probably one of the 11 million people who’ve at least watched the trailer. I know that you know that Bradley Cooper just wants to take another look at Lady Gaga. That he loves her face, and her eyes, but really her nose — so much, that he took a makeup wipe to her Italian-American features on set one day.\n\nIn order for L. Gaga to play Ally, a struggling singer-songwriter on the road to becoming a star, she had to strip herself down to the way she was before “Poker Face.” This meant not only wiping off her makeup, but also toning down her signature avant-garde style. She wears no dresses made of meat and emerges from no embryonic eggs. She doesn’t even carry a Celine bag. Instead, Gaga’s wardrobe in A Star Is Born is utterly unremarkable. Average, even. Which, of course, makes it highly remarkable.\n\nThis isn’t to say the clothes in A Star Is Born are great. They’re not. This is not a fashion movie, which you also probably knew. But Gaga’s — sorry, Ally’s — refusal to look stylish, or campy, or dress any part besides her own, is an extension of the makeup-wiping myth: It’s a way of asking us to focus on Stefani Joanne Angelina Germanotta, the talented American treasure, rather than Lady Gaga, the character. And for me, it worked.\n\nIn the first half of the movie, we see Ally with nothing but a T-shirt on, to steal a line from Jessica Simpson. She’s never looked and felt as beautiful as she does in these moments, now that she’s with Jackson Maine (Bradley Cooper). On their first “date,” her most prominent accessory is a frozen bag of peas, which Jack insists she buy after punching someone in the face on his behalf.\n\nAs for her first big moment on stage — the moment where she finally dives off the deep end — Ally wears pinstripe jeans with a chainlink belt, plus a simple white T-shirt knotted in the front. At first glance, the look is very “Adriana La Cerva, but make it country.” But knowing Gaga, those are her actual $325 Miaou jeans, and an old tee from the back of her closet. The knot is important, though, because nothing is ever simple with Gaga; she makes every appearance her own.\n\nLady Gaga and Bradley Cooper in A Star Is Born (2018). Photo: Courtesy of Warner Bros. Pictures\n\nAlly’s knotted T-shirt look returns a few times throughout the film, but as she drifts closer to the spotlight, her style becomes increasingly pop-y and removed from her “true self.” Still, the movie doesn’t judge her for her transformation (though drunk Bradley Cooper does). She’s just Ally being Ally — only a little more bedazzled.\n\nIf you’ve seen Five Foot Two, the documentary on Lady Gaga’s life up until now, then you know that she and Ally share the same “off duty” style: the same cropped T-shirts, jeans, and cowboy hats. The same leotards worn with low-waist sweatpants. It’s not a coincidence that A Star Is Born felt like a high-production combination of the documentary and a Joanne music video. (Personally, I can’t seem to get enough of all three.) But it’s also too simplistic to say that any of these is the more “authentic” version of Lady Gaga. Stefani-as-Gaga-as-Ally is merely a different costume, and this one is less distracting.\n\nI think I spotted a few outside references in Ally’s costumes. Her off-the-shoulder gown at the Grammys, for example, felt like a nod to Janet Gaynor’s in the original movie. Plus, there were a couple Judy Garland–esque neckties, and maybe one floral jumpsuit like Marisa Tomei’s in My Cousin Vinny. Meanwhile, Bradley Cooper gave us at least one shirtless Kris Kristofferson moment. But other than that, Gaga’s style in A Star Is Born isn’t special. It forces us to take her at face value. And man, does she have a great face.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/10/05/05-a-star-is-born-lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/10/05/05-a-star-is-born-lede.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/05/05-a-star-is-born-lede.w1200.h630.jpg", "keywords": [], "authors": ["Emilia Petrarca"], "canonical_link": "https://www.thecut.com/2018/10/a-star-is-born-lady-gaga-costumes.html", "title": "Lady Gaga’s Style Is Unremarkable in ‘A Star Is Born’", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Lady Gaga’s Style in A Star Is Born Is Remarkably Unremarkable", "url": "https://www.thecut.com/2018/10/a-star-is-born-lady-gaga-costumes.html", "description": "Just like her “no makeup” makeup.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/05/05-a-star-is-born-lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Lady Gaga’s A Star Is Born Style Is Remarkably Unremarkable", "description": "Just like her “no makeup” makeup.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/10/05/05-a-star-is-born-lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@emiliapetrarca", "site": "@TheCut"}, "article": {"published_time": "2018-10-05T14:36:00.000-04:00", "tag": "fashion, style, a star is born, lady gaga, what is fashion", "publisher": "https://www.facebook.com/cut"}, "description": "In ‘A Star Is Born’, Lady Gaga not only wiped off all her makeup, but also toned town her signature style. Her wardrobe in the film is utterly unremarkable. Average, even. Which, of course, makes it highly remarkable. Here, a closer look.", "sailthru.tags": "fashion, style, a star is born, lady gaga, what is fashion", "author": "Emilia Petrarca", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1538764560.0, "source": "https://www.thecut.com", "summary": ""}