{"url": "www.inquisitr.com/4773500/brad-pitt-jennifer-aniston-rekindle-romance-despite-justin-theroux-in-love-duo-caught-kissing-rumors/", "text": "After Angelina Jolie filed for divorce from Brad Pitt, Twitter found entertainment in imagining Jennifer Aniston’s glee. Jolie had reportedly been at least partly responsible for causing Jennifer and Brad’s split, leading some to speculate that Aniston felt gleeful over the crumbling of Pitt’s second marriage.\n\nIn recent months, however, the relationship between Jennifer and Brad reportedly has changed. Even though Aniston is now married to Justin Theroux, Jennifer allegedly just “can’t let go” of Pitt, and it’s rumored to be destroying her romance with Justin, as the Inquisitr reported. Now, Jennifer and Brad have gone from a platonic reunion to a rekindled romance, according to a new report.\n\nBrad Pitt, Jennifer Aniston: “Always In Love”\n\nYahoo quoted an insider’s claim that Brad and Jennifer have “always been in love.” Recalling the era when Pitt and Aniston were Hollywood’s golden couple, the source said that Jennifer and Brad have continued to have feelings for each other despite her marriage to Justin Theroux and his marriage to Angelina Jolie.\n\n“They were once the golden couple of Hollywood and apparently Brad Pitt and Jennifer Aniston still hold a soft spot in their hearts for one another.”\n\nQuoting Woman’s Day magazine, Yahoo reported that Pitt and Aniston recently just happened to encounter each other in Los Angeles during Jennifer’s dinner date. Aniston was with friends at Soho House. During her meal, Brad showed up and joined the group, according to the insider.\n\nBrad Pitt Caught Canoodling With Jennifer Aniston\n\nEven though Aniston and Pitt were in a public restaurant, Brad apparently could not resist the temptation, an observer told the publication.\n\n“Brad kissed Jen’s neck and whispered something into her ear before giving her a knowing glance.”\n\nOne insider, the former security guard to Pitt, revealed even more about Brad’s rumored feelings for Jennifer. Kris Herzog told the magazine that even though Pitt was married to Angelina Jolie and Aniston is still married to Justin Theroux, the former lovebirds never lost their love for each other.\n\nJennifer Aniston's marriage to Justin Theroux reportedly is troubled amid her renewed romance with Brad Pitt. Featured image credit: Francois Mori AP Images\n\n“Brad and Jen are in love and always have been,” declared Kris.\n\nMoreover, Herzog claimed that Pitt and Aniston have been spending a lot of time together in the wake of Angelina filing for divorce in 2016.\n\nBrad Pitt Not Totally To Blame For Jennifer Aniston’s Allegedly Troubled Marriage\n\nJolie and Brad famously met on the movie set of Mr. And Mrs. Smith during his marriage to Jennifer Aniston. Jennifer and Brad were married for five years before splitting in 2005. Aniston dated Justin Theroux for four years prior to tying the knot in in 2015.\n\nIn contrast, Pitt and Jolie were together for 11 years, although they were married for only two years. They are currently co-parenting six children, ranging in age from 16-year-old Maddox, 14-year-old Pax, and 13-year-old Zahara to 11-year-old Shiloh Jolie-Pitt and 9-year-old twins Knox and Vivienne.\n\nBrad and Angelina’s divorce has earned extensive publicity, including the battle for custody of the kids. But rumors that Pitt’s renewed romance with Aniston has hurt her marriage to Justin Theroux have remained unconfirmed. People Magazine pointed out that the rumors are linked to the seemingly separate lives that Jennifer and Justin live.\n\n“Despite tabloid claims of trouble due to their frequent distance, Aniston and Theroux’s two-year marriage is solid, [some insiders insist].”\n\nJennifer and Justin both have busy lives because of their careers, which often force them to work long distances apart. But even though Aniston and Theroux appear to be separated, one of the insiders said that Jennifer and Justin “have figured out a life that works for them.”\n\nAs for how Aniston’s rumored rekindled romance with Brad has affected her relationship with Theroux, Pitt isn’t getting all of the blame for any problems. According to the Hollywood Gossip, Jennifer’s marriage to Justin was in trouble even before her alleged reunion with Brad. An insider quoted by the publication said that Aniston’s and Theroux’s relationship “has been crumbling,” and Pitt’s ability to console Jennifer while she’s vulnerable reportedly has made her marriage to Justin even more troubled.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/02/Brad-Pitt-Jennifer-Aniston-Kissing.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Jennifer-Aniston-Justin-Theroux-Marriage-Troubled.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4773500/brad-pitt-jennifer-aniston-rekindle-romance-despite-justin-theroux-in-love-duo-caught-kissing-rumors/", "title": "Brad Pitt, Jennifer Aniston Rekindle Romance Despite Justin Theroux: ‘In Love’ Duo Caught Kissing [Rumors]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}