{"url": "www.washingtonpost.com/news/the-fix/wp/2018/01/09/oprah-might-run-for-president-we-did-the-opposition-research-for-you/", "text": "Not to mention the child sex abuse scandal.\n\nHere's a sampling of the awkward and potentially problematic issues that Winfrey might have to explain on the campaign trail.\n\nAD\n\nOprah and the child sex abuse scandal\n\nRemember the headache the defunct Trump University became for its namesake during his campaign? Some might prefer to forget the cascading disasters of the Oprah Winfrey Leadership Academy for Girls.\n\nAD\n\nWinfrey called the sprawling, $40-million complex her “gift” to poor South African girls when it opened in 2007 — complete with a yoga studio and beauty salon. She initially had to defend the luxurious complex against accusations that it looked elitist in a country wracked by poverty.\n\nShe defended the school in her typical heartwarming style: “If you are surrounded by beautiful things and wonderful teachers who inspire you, that beauty brings out the beauty in you,” Winfrey told reporters before the grand opening.\n\nAD\n\nThe girls had “never been told they are pretty or have wonderful dimples,” she said. “I wanted to hear those things as a child.”\n\nSeveral months later, a dorm matron was arrested and accused of sexually abusing at least half- a-dozen seventh- and eighth-graders.\n\nOprah was reportedly heartbroken. She cried for half an hour, she told reporters in a news conference after the matron's arrest. She accused school officials of covering up the scandal. They told the girls to “put on happy faces,” Winfrey said.\n\nAD\n\nShe dismissed the head mistress and promised to clean house at the academy.\n\nBut less than two years later, with the dorm matron's trial still pending, several girls were suspended or expelled after accusations that they tried to force other students into sexual and romantic relationships.\n\nAD\n\nAnd then the original accusations began to unravel.\n\nThe next year, the Guardian reported, Oprah settled with the headmistress, who had accused her of defamation by suggesting that she knew of the dorm matron's actions.\n\nA few months after that, the dorm matron was acquitted of all charges, the Guardian wrote. A judge had found the girls' accusations self-contradictory and not credible.\n\nThe matron told reporters that her life had been ruined. She was broke, unemployed and said she didn't know if she could ever forgive Winfrey, who continued to stand by the girls' accusations.\n\nAD\n\nThe academy continues to operate. It recently celebrated its 10th anniversary with a scandal-free story in Variety, which notes Winfrey's advice for the girls: “I want you to be president of your own life.”\n\nAD\n\nOprah turned a cancer patient on to junk science\n\nIf Winfrey becomes president, she would have enormous influence over American health care, including nominating the surgeon general and health secretary.\n\nShe's already selected “America's doctor.” That's Winfrey's term for Mehmet Oz, better known as Dr. Oz on her show, where he became famous for dispensing health advice in the mid-2000s — including the classic segment, “Everybody Poops.”\n\nToday, as The Washington Post wrote, Oz has his own show and may be the country's most influential physician. And he regularly uses that influence to promote treatments with no scientific basis, including, literally, “magic” beans.\n\nAD\n\nAD\n\nOz may not necessarily be politically toxic — Trump appeared on his show during the 2016 campaign — but he's become a pariah in the medical community. Winfrey booted him from her media network two years ago after a group of physicians accused him of “quack treatments.”\n\nNor is he the only accused quack Winfrey has embraced: As the Guardian wrote, she's been blamed for boosting Jenny McCarthy's anti-vaccine crusade. And Winfrey has repeatedly plugged a mystical self-help system called “The Secret,” which claims that thinking good thoughts (and buying DVDs) can cure emotional, financial and physical problems.\n\nWinfrey's first show about “The Secret” helped make a believer of Kim Tinkham, who had recently been diagnosed with breast cancer. She told Winfrey in 2007 that the system had inspired her to ignore her doctors, who told her she needed immediate surgery and treatment. “I've decided to heal myself,” Tinkham said.\n\nAD\n\nAD\n\nWinfrey tried to talk her out of it. “I'm really happy the message, or certainly some of the message, is reaching mass consciousness,” she said. But Tinkham could think healing thoughts and still get a partial mastectomy.\n\nThe Washington Examiner reported that Tinkham died three years later.\n\nOprah caused a hamburger panic\n\nMost people assume Winfrey — a backer of former president Barack Obama and Hillary Clinton — would run as a Democrat. So she'd certainly need to win California, or Texas if she somehow ran as a Republican. Both happen to be big beef states. The latter was also the site of Winfrey's infamous beef lawsuit.\n\nIt began with an episode of “The Oprah Winfrey Show” in 1996, amid widespread fears of so-called mad cow disease, a potentially fatal illness that humans can catch by eating certain organs of infected cattle.\n\nAD\n\nAD\n\nThough the disease's spread had actually peaked a few years earlier, according to the Centers for Disease Control and Prevention, Winfrey brought a vegetarian activist onto her show — and this happened:\n\n“You said this disease could make AIDS look like the common cold,” Winfrey told the activist, according to the Associated Press.\n\n“Absolutely,” the activist replied.\n\n“It has just stopped me from eating another burger!” Winfrey exclaimed, and her audience applauded.\n\nRanchers said beef prices crashed to a 10-year-low the next day.\n\n“Oprah accused of whipping up anti-beef ‘lynch mob,’ ” CNN reported two years later, after a group of ranchers sued Winfrey under a Texas law against making “disparaging statements about perishable food products.”\n\nAD\n\nA judge later downgraded the case to a defamation suit, but Winfrey was forced to relocate her show to Amarillo, where her fans packed the street outside the courtroom during the 1998 trial.\n\nAD\n\nA jury eventually decided that Winfrey had not been trying to sabotage the beef industry. Her fans drank champagne outside the courthouse, and the talk show host refused once again to eat a burger.\n\nMeat lovers remembered the spectacle for decades. “Why Does Oprah Continue to Bully Beef?” Beef Magazine wrote several years ago, and accused Winfrey of using her magazine to publish a hit piece against factory farms, of which the swing states boast more than a few.\n\nOprah defended a fake book\n\nWith the beef wars behind her, Winfrey returned to her staple brand of positivity, sometimes tinged with tragedy.\n\nIn fall 2005, she brought author James Frey onto her show, who had written a harrowing memoir about overcoming alcohol and drug addiction.\n\n“If you've ever had to live through this with somebody you love, here is a story that was written for you,” Winfrey told her viewers.\n\nAD\n\nThe rest of the segment was filled with passages from Frey's book, “A Million Little Pieces”:\n\nFrey regaining consciousness in an airplane with no memory and missing teeth; Frey getting dental surgery without anesthesia; Frey freebasing cocaine and “snort[ing] glue.”\n\n“I heave and it comes,” Frey recited from the book. “The burning vomit comes and comes again and again and again.”\n\nWinfrey enthusiastically recommended “A Million Little Pieces” for her book club. It sold more than 2 million copies over the next two months, the New York Times reported.\n\nThen reporters looked into Frey's stories and forced him to admit that he'd made many of them up.\n\nWhere he had written about getting high, driving a car into a police officer, fighting with the officer and spending three months in jail, police said, Frey had actually run his tire over a curb and politely paid bail for driving under the influence, CNN reported.\n\nWhere Frey wrote of being blamed for a teenager's fatal car accident, The Post wrote, the girl's parents could recall nothing of it.\n\nWinfrey stood by the author, even after he admitted to exaggerating many stories. “What is relevant is that he was a drug addict who spent years in turmoil,” she told Larry King. “It seems to be much ado about nothing.”\n\nNow critics turned on Winfrey, too. A Washington Post writer called her “deluded.” After a few days of humiliation, she invited Frey back on her show and, by common consensus, absolutely shredded him.\n\n“You conned us all,” she told the squirming author. “That's a lie. It's not an idea, James. That's a lie.”\n\nStill, the scandal did not end. The next year, Winfrey was back on King's show, denying that she had cruelly “annihilated” the author she once built up. In 2011, more than five years after the initial plug, Winfrey invited Frey onto her show yet again and apologized to him “for my lack of compassion.”\n\nSome noted at the time that Frey had a new book coming out.\n\nOprah thinks some Americans need to die\n\nWinfrey was promoting her most recent film, “The Butler,” in 2013 when she talked to the BBC about racism. The original interview seems to have disappeared online, but some of her words will live on:\n\n“There are still generations of people, older people, who were born and bred and marinated in it, in that prejudice and racism,” Winfrey said, according to MSNBC. “And they just have to die.”\n\nHer logic was celebrated by some — “Oprah Joins the Long Line of People Waiting for Old Racists to Die,” for example.\n\nBut right-leaning sites accused her of playing race politics to sell movie tickets.\n\nAnticipating the deaths of any potential voters, even old racists, can't lend itself to a positive presidential campaign.\n\nOprah palled around with Harvey Weinstein\n\nSpeaking of “The Butler,” it was co-produced by Harvey Weinstein, the movie mogul now accused of serial sexual assault. His fall from grace last year helped expose a culture of predation on women in Hollywood and inspired Winfrey's Golden Globes speech, which may in turn launch her presidential campaign.\n\nBut Weinstein's behavior was reportedly an open secret in the industry, which might make all the photos of Winfrey schmoozing around with him a political problem.\n\nConservatives are already gleefully cataloguing the pictures.\n\nUnlike with Frey, Winfrey at least never publicly defended Weinstein after the accusations went public. Rather, she condemned his “hideous behavior.”\n\nStill, her spokesman had to deny a TMZ report that Winfrey urged Weinstein to defend himself against the scandal. And in November, actress Kadian Noble told reporters that Weinstein had seduced her, in part, by introducing her to Winfrey and Naomi Campbell.\n\nThis led to a headline on Page Six: “Weinstein used Oprah and Naomi to seduce me.”\n\nFair or not, that's the stuff attack ads are made of.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/af059975-28c8-4691-aa32-82c8154c18e0.png&w=90&h=90", "https://www.washingtonpost.com/resizer/8yTA9T65CmyW_aGriaYRIlaHYUQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WVENBUW4MYYFVKFVI63VUMLFZY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/8yTA9T65CmyW_aGriaYRIlaHYUQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WVENBUW4MYYFVKFVI63VUMLFZY.jpg", "keywords": [], "authors": ["Avi Selk"], "canonical_link": "https://www.washingtonpost.com/news/the-fix/wp/2018/01/09/oprah-might-run-for-president-we-did-the-opposition-research-for-you/", "title": "Oprah Winfrey 2020? These scandals might work against her.", "meta_data": {"description": "Oprah turned a cancer patient on to junk science, defended a fake memoir and palled around with Harvey Weinstein. The attack ads write themselves.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-fix/wp/2018/01/09/oprah-might-run-for-president-we-did-the-opposition-research-for-you/", "image": "https://www.washingtonpost.com/resizer/8yTA9T65CmyW_aGriaYRIlaHYUQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WVENBUW4MYYFVKFVI63VUMLFZY.jpg", "title": "Analysis | Oprah might run for president. We did the opposition research for you.", "description": "Oprah turned a cancer patient on to junk science, defended a fake memoir and palled around with Harvey Weinstein. The attack ads write themselves."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Oprah might run for president. We did the opposition research for you.", "description": "Oprah turned a cancer patient on to junk science, defended a fake memoir and palled around with Harvey Weinstein. The attack ads write themselves."}, "last_updated_date": "2019-04-28T10:01:34.650Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1515427200.0, "source": "http://www.washingtonpost.com", "summary": ""}