{"url": "http://time.com/5036452/prince-harry-meghan-markle-relationship-timeline/", "text": "Prince Harry, Britain’s most eligible bachelor, is no longer quite so eligible following the announcement of his engagement to California-born actress and United Nations advocate Meghan Markle.\n\nThe newly-engaged pair, who revealed their engagement on Nov.27, dated for at least 15 months before Prince Harry popped the question. Despite having their relationship under heavy scrutiny by the international press, the couple has made a valiant attempt at keeping their romance as private as possible, appearing in public just a handful of times together since confirming their union.\n\nHere’s what you need to know about the royal relationship on everyone’s lips:\n\nHow did Prince Harry and Meghan Markle meet?\n\nPrince Harry, 33, and Los Angeles-born Markle, 36, met for the first time in London in July 2016, when they were introduced by a mutual friend, Markle confirmed in an interview with Vanity Fair in September.\n\nHow long have Prince Harry and Meghan Markle dated?\n\nA close friend of Harry’s confirmed to PEOPLE in late October 2016 that the pair had been dating seriously for around two months, meaning as of Nov. 2017 the pair have been together for roughly 15 months.\n\nOn Nov. 8 2016, the Royal Kensington Palace released a public statement in which Markle was referred to as Harry’s girlfriend for the first time. The unprecedented statement condemned the “wave of abuse and harassment” Markle had been subjected to. “Prince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her,” it said. “It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm.”\n\nWhen have Prince Harry and Meghan Markle appeared together in public?\n\nPrince Harry and Markle were photographed in public together for the first time in Dec. 2016, shopping for a Christmas tree at the Pines and Needles store in London. A few days later they were spotted while on a date to see the hit play The Curious Incident of the Dog in the Night-Time in London’s West End. The week before, Harry had made a 1,700-mile detour from his tour of the Caribbean to visit Markle at her Toronto home.\n\nMarkle attended her first public event with Harry in May this year, at the Coworth Park Polo Club in Ascot, England. Later that month, she attended part of the wedding of Kate Middleton’s sister, Pippa, to financier James Matthews. Harry was photographed driving the actress into the Middleton home later that day after picking her up from London after the ceremony. In March, Markle joined Prince Harry at a wedding in Jamaica for one of his close friends.\n\nThe pair made their first public appearance together at the opening ceremony of the international Invictus Games in Toronto, Canada, in September. They held hands at a wheelchair tennis event and spent time with Markle’s mother, Doria.\n\nMeghan Markle and Prince Harry attend wheelchair tennis on day 3 of the Invictus Games Toronto 2017 on September 25, 2017 in Toronto, Canada. Samir Hussein/WireImage\n\nWhat have they said about each other?\n\nMarkle commented on her relationship for the first time in September, in her interview with Vanity Fair in which she referred to Harry as her “boyfriend” numerous times. “We’re a couple,” she told the magazine. “We’re in love. I’m sure there will be a time when we will have to come forward and present ourselves and have stories to tell, but I hope what people will understand is that this is our time.”\n\nShe added: “This is for us. It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.”\n\nPrince Harry has not commented about the relationship quite as candidly as Markle; however, he did tell competitors at the Invictus Games in September that his girlfriend was “loving” the event. “I asked him how his girlfriend was enjoying it and he said ‘she loves it, she’s loving the games,’ which is awesome,” former U.S. air force master sergeant Kyle Burnett told reporters. It was the first time the Prince publicly spoke about Markle following the strongly-worded statement the Kensington Palace issued in November.\n\nThe pair have hinted at their feelings towards each other in non-vocal ways. In February this year, Prince Harry was seen wearing his half of a matching His & Hers bracelet set on the cover of Town and Country magazine. The resemblance of the blue-beaded piece of jewelry to a bracelet Markle was pictured wearing on her Instagram page two months before was no coincidence.\n\nWhat will Prince Harry and Markle’s wedding be like?\n\nThe event will take place in Spring 2018, but details about the nuptials remain under wraps. Prince Harry and Markle could opt for a large royal wedding like Prince William and Duchess Kate’s 2011 nuptials or choose a low-key ceremony somewhere outside of London, such as St. George’s Chapel at Windsor Castle, where Harry’s father, Prince Charles, had a service of blessing with his second wife, Camilla Parker Bowles, in 2005.\n\nAs for the honeymoon, Antigua’s Prime Minister invited Harry to spend his honeymoon on the Caribbean islands of Antigua and Barbuda during a visit in Nov. 2016 (making the royal turn “bright red,” according to sources on the ground). Sadly, the islands were badly hit by this year’s hurricane season so the royal couple might have to look elsewhere.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Kate Samuelson at kate.samuelson@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/war-veteran-coronavirus-fundraiser.jpg?quality=85&w=330", "https://api.time.com/wp-content/uploads/2017/11/gettyimages-854226588.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2016/12/prince-harry-meghan-markle-christmas-tree-shopping.jpg?quality=85&w=1200&h=628&crop=1", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/AP20103438417324.jpg?quality=85&w=523"], "top_img": "https://api.time.com/wp-content/uploads/2016/12/prince-harry-meghan-markle-christmas-tree-shopping.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Kate Samuelson"], "canonical_link": "https://time.com/5036452/prince-harry-meghan-markle-relationship-timeline/", "title": "A Detailed History of Prince Harry and Meghan Markle's Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "prince harry, prince harry meghan markle, prince harry meghan markle relationship timeline, prince harry meghan markle engaged, prince harry meghan markle engagement, harry markle engagement, meghan markle harry", "news_keywords": "prince harry, prince harry meghan markle, prince harry meghan markle relationship timeline, prince harry meghan markle engaged, prince harry meghan markle engagement, harry markle engagement, meghan markle harry", "description": "Prince Harry and Meghan Markle dated for at least 15 months before getting engaged. Here's a detailed timeline of their relationship.", "og": {"title": "A Detailed History of Prince Harry and Meghan Markle's Relationship", "type": "article", "site_name": "Time", "url": "https://time.com/5036452/prince-harry-meghan-markle-relationship-timeline/", "description": "Here's what you need to know about the royal relationship on everyone's lips", "image": {"identifier": "https://api.time.com/wp-content/uploads/2016/12/prince-harry-meghan-markle-christmas-tree-shopping.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5036452/prince-harry-meghan-markle-relationship-timeline/", "description": "Prince Harry and Meghan Markle dated for at least 15 months before getting engaged. Here's a detailed timeline of their relationship.", "media": "https://api.time.com/wp-content/uploads/2016/12/prince-harry-meghan-markle-christmas-tree-shopping.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5036452/prince-harry-meghan-markle-relationship-timeline/", "title": "A Detailed History of Prince Harry and Meghan Markle's Relationship", "description": "Here's what you need to know about the royal relationship on everyone's lips", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2016/12/prince-harry-meghan-markle-christmas-tree-shopping.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}