{"url": "https://web.archive.org/web/20080709210822/http://johnmccain.com/Informing/News/PressReleases/26d74083-c92b-44e9-9600-4e3c30b9a3fb.htm", "text": "For Immediate Release\n\nJuly 9, 2008 Contact: Press Office\n\n703-650-5550 Barack Obama's FISA Flip Front and Center\n\nToday Obama Abandons Pledge To Filibuster FISA Bill ARLINGTON, VA -- Today, McCain spokesman Tucker Bounds issued the following statement concerning Barack Obama's role in the Senate's terrorist surveillance debate: \"A few short months ago, Barack Obama outwardly opposed terrorist surveillance legislation, saying that he would filibuster any bill that includes immunity for American telecommunications companies that had been asked by the government to participate in the program. Today, the U.S. Senate will approve legislation providing the immunity Barack Obama supposedly opposed, and despite his promise, he will not support a filibuster. What Barack Obama will do is show that he's willing to change positions, break campaign commitments and undermine his own words in his quest for higher office.\" During The Primaries, Barack Obama Pledged To Filibuster Any Bill Which Contained Immunity For Telecommunications Companies Involved In Electronic Surveillance, But Now Backs A Bill That Would Do Just That In October 2007, The Obama Campaign Pledged He Would Filibuster \"Any Bill That Includes Retroactive Immunity For Telecommunications Companies.\" Obama Spokesman Bill Burton: \"To be clear: Barack will support a filibuster of any bill that includes retroactive immunity for telecommunications companies.\" (Greg Sargent, \"Obama Camp Says It: He'll Support Filibuster Of Any Bill Containing Telecom Immunity,\" Talking Points Memo's \"Election Central\" Blog, tpmelectioncentral.talkingpointsmemo.com, 10/24/07) Barack Obama Now Supports A Bill Reauthorizing Electronic Surveillance That Grants Immunity To Telecommunications Companies. Obama: \"Under this compromise legislation, an important tool in the fight against terrorism will continue. It does, however, grant retroactive immunity, and I will work in the Senate to remove this provision so that we can seek full accountability for past offenses. So I support the compromise, but do so with a firm pledge that as President, I will carefully monitor the program, review the report by the Inspectors General, and work with the Congress to take any additional steps I deem necessary to protect the lives and the liberty of the American people.\" (Ben Smith, \"Obama Backs FISA Compromise,\" The Politico's \"Ben Smith\" Blog, www.politico.com, 6/20/08) ###\n\n", "images": ["https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/articlerule.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/icons/digg.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/icons/delicious.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/icons/reddit.jpg", "https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/mccain_07_header_03.jpg", "https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/mccain_07_header_01.jpg", "https://web.archive.org/web/20080709210822im_/http://www.johnmccain.com/images/blank.gif", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/connect1_01.png", "https://web.archive.org/web/20080709210822im_/http://www.johnmccain.com/Images/icons-forward.jpg", "https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/button_search2.jpg", "https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/spacer.gif", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/connect2_03.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/icons/technorati.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/Informing/News/PressReleases/spacer.gif", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/spacer.gif", "https://web.archive.org/web/20080709210822im_/http://images.johnmccain.com/Images/mccain_07_header_02.jpg", "https://web.archive.org/web/20080709210822im_/http://www.johnmccain.com/Images/icons-print.jpg", "https://web.archive.org/web/20080709210822im_/http://johnmccain.com/images/connect2_02.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "John McCain for President", "meta_data": {"description": "John McCain 2008 - The Official Website of John McCain's 2008 Campaign for President", "keywords": "John McCain, McCain, mccain for president, John S. McCain, McCain 2008, president, presidential, 2008, campaign, election, straight talk, straight talk express, politics, political, john mccain, john mccain for president, senator john mccain, sen. john mccain, cindy mccain, john mcain, john mckaine, john maccane, jon mccain, john maccaine, john mccaine, mccain 2008, johnmccain.com, senator mccain, mccain 2000, mccain campaign, mccain hq, exploremccain.com, explore mccain, mccain exploratory committee, mccain exploratory"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}