{"url": "www.wsj.com/articles/the-examined-life-of-angelina-jolie-pitt-1446687750", "text": "THE MOST NOTICEABLE thing about Angelina Jolie Pitt—apart from her almost preternatural physical presence—is that nearly everywhere she goes she turns up more or less unattended (unless, of course, you count husband Brad Pitt and their brood of six). Arriving for an interview at a West Hollywood hotel suite to promote By the Sea, her upcoming movie with Pitt, she’s trailed only by a lone bodyguard—she doesn’t employ a manager or even a publicist. A few weeks earlier, photos of the Jolie-Pitt clan’s visit to a Subway in Glendale, California, had been splashed across multiple websites (“They’re just like us!”), but the trip from which Jolie Pitt has returned just before the interview—an outing to a lakeside retreat the couple owns near Pitt’s hometown of Springfield, Missouri—had gone entirely unnoticed. (“It’s a real Midwestern family kind of place,” says Tom Brokaw, who got to know Jolie Pitt during the making of her most recent film, Unbroken. “His whole family comes down, cousins, you name it.”) Likewise, the couple’s wedding ceremony at their château in the south of France in August 2014 was not followed by a romantic getaway featuring the typical telescopic paparazzi shots of sunbathing on a yacht. The two went back to work almost immediately, shooting the new film together on a tiny island in Malta, “while our children ran around the set,” says Pitt. “That this became our honeymoon is just f—ing funny.” WSJ. Magazine November 2015 All this under-the-radar normalcy would not be noteworthy in the least if the two stars weren’t the most staggeringly high-profile Hollywood couple since Elizabeth Taylor and Richard Burton (except with only three divorces between them and not nearly as much booze or bling). This month, in By the Sea, they’ll appear together for the first time in a decade, since the action-packed romp Mr. and Mrs. Smith introduced them to the world as a couple onscreen and (subsequently, they insist) off. Though the new film, by Jolie Pitt’s own account, is a “small” one, it will likely attract a lot of interest in the media juggernaut known as Brangelina—especially since the story involves a couple whose marriage is in deep crisis. The movie, set in an isolated seaside hotel in France, lays them emotionally bare in a way they’ve rarely been seen before, and certainly not together. “It was not easy,” says Jolie Pitt. “We just had to be brave and say, ‘OK, honey, we’re strong enough to do this; let’s somehow use this to make us stronger.’ ” Jolie Pitt wrote the script, her first, not long after her mother, Marcheline Bertrand, died in 2007. “I didn’t really know if I could make film and I didn’t think I could write film, so I wrote with a certain amount of freedom,” she says. “I gave myself the task that it would be about grief and how different people react to and process it.” In one scene, the local barkeep (played by a remarkable French actor, Niels Arestrup) talks to Pitt’s character, who is trying to restart a foundering writing career, about forcing himself to love his terminally ill wife enough to let her go. “That’s me speaking about my mother,” Jolie Pitt says. “I think maybe his character came from the purest place inside me.” The actress-writer-director Angelina Jolie Pitt occupies a rarefied station in contemporary culture, at once a Hollywood icon and compassionate humanitarian. A film by MediaStorm The most difficult scenes of the film were made harder by the fact that “we had to stay in our corners, like boxers, and not be husband and wife,” Jolie Pitt says. “It was very hard to do those scenes without Brad and I taking care of each other. Normally in between takes, you’d make sure that the other’s OK, but we had to be able to really get ugly.” At the end of the day, she adds, it was the kids who kept them from staying in character. “That might have been an absolute disaster. But as soon as we got home, it was bedtime stories, children’s needs and problems, the fights they’d had during the day. We had to immediately snap back to something that was uniting and positive and loving.” WSJ. Magazine 2015 Innovators Angelina Jolie Pitt\n\nRichard Serra\n\nKarl Ove Knausgaard\n\nMiuccia Prada\n\nThomas Heatherwick\n\nStewart Butterfield\n\nMark Parker For Pitt,By the Sea marked the first time he’d been directed by a woman, let alone his own wife, but he professes not to see the difference. The main thing, he says, is that the director has “the reins on the story and taste in the telling” so that the actors have “freedom to explore.” In his case, he adds, “My director has an elegant intuition for character. And anyway, I trust her with my life.” Occasionally, though, their husband-wife ease on set was a double-edged sword. “Being a couple, we have that shorthand that can be communicated in a look. Conversely, it means I knew immediately if she felt a take stunk.” If By the Sea—the third feature film Jolie Pitt has directed—could not be further in intent or plot from the couple’s comic debut, it’s consistent with Jolie Pitt’s pattern of taking on risky projects. As a director and screenwriter, she came out of the box in 2011 with In the Land of Blood and Honey, a romantic drama set in a place—1990s war-torn Bosnia—most Americans had managed to ignore. As a rule, actors who direct for the first time tend toward slightly less complicated fare; even Tom Hanks went with a comedy/drama about a one-hit-wonder rock band in the 1960s. Jolie Pitt’s period piece touched on issues of rape and captivity, was cast with local unknowns and was filmed simultaneously in Bosnian and English. Though ultimately well received, the film was hardly an obvious bet. “She called me to take a look at the script and after about 25 pages, I remember thinking, Wait, I have to go back and read this again,” says Graham King, the Oscar-winning producer (The Departed, Argo) who ended up investing in and producing the film with Jolie Pitt. “I did not expect Bosnia. It was an extremely bold choice for a first-time screenwriter.” ON POINT | Porselli sweater, price upon request, Porselli, Milan, Wolford tights, $53, wolford.com, Repetto bodysuit, $50, and shoes, $64, repetto.com Likewise, she campaigned hard to direct 2014’s Unbroken, the film based on Laura Hillenbrand’s best-selling bio of Olympic runner and war hero Louis Zamperini, despite the fact that the technical issues of filming the air-and-sea sequences would make for an especially brutal shoot. “Angie is not fearless; almost no one is,” says Hillenbrand. “But she is intrepid and bold and willing to look down her fears and do things anyway.” One of those fears stemmed from the love Jolie Pitt ended up feeling for the subject himself. “The bond between her and Louis was uncommon between filmmaker and subject, and she was very afraid of not getting Louis’s story right,” Hillenbrand says. “I felt the same enormous sense of obligation when I interviewed him and the other prisoners of war. These are the most painful, personal memories in these men’s lives. But she threw her whole heart and soul into it.” Hillenbrand says she was reassured that her book was in the right hands when Jolie Pitt, whom she now refers to as “a sister,” called to inquire about the uniforms of a high school track team Zamperini had raced against in the 1930s. Hillenbrand, known for her meticulous period research, had no idea what they looked like. “But I knew from the question that I could relax. It was a pleasing question to get even though it was impossible!”\n\nCéline dress, $3,250, Céline Madison Avenue, New York\n\nJolie Pitt was equally painstaking about By the Sea’s 1970s period wardrobe—including her oversize sunglasses, which Pitt’s character, Roland, keeps righting for his wife after she tosses them, a lot, onto tables, a mini pas de deux Jolie Pitt took from their actual marriage. “Brad hates that I always scratch my glasses,” she says, adding that in the film, the gesture shows that Roland still cares for her character, Vanessa. “Even when he wants to punch her in the face, he still fixes her glasses!” In life, Jolie Pitt says, “I wear the same thing every day, very much like now.” As she speaks, she’s in fairly minimalist garb (skinny black pants, a camel jersey T-shirt and camel flats) with equally minimal makeup (a bit of eyeliner) and jewelry (a Cartier tank watch, a diamond-encrusted gold wedding band). The far more self-conscious Vanessa, on the other hand, sports a collection of elaborate negligees and peignoirs, frilly 1970s blouses and midi skirts, and full-on eye makeup, including lashes, which we watch her apply each morning. According to King, Jolie Pitt’s attention to detail extends well beyond wardrobe. When she first approached him about In the Land of Blood and Honey, she was “extraordinarily well prepared,” he says. “She turned up in my office with the location, photos, storyboards, casting information. The train was leaving the station. When she said, ‘I’d love for you to produce this movie,’ I was already hooked.” He also came to admire her “hands-on” approach. “Whether it’s interviews, photo shoots or directing films, she gets involved herself,” he says. “Angie does not send people into meetings. There’s no manager or agent, no PR. When I first met her I couldn’t believe how accessible she was.” AUTEUR, AUTEUR | ‘I didn’t know if I could make film and I didn’t think I could write film, so I wrote with a certain amount of freedom,’ Jolie Pitt says of ‘By the Sea,’ her third movie as director, but the first screenplay she wrote. Haider Ackermann coat, $2,500, haiderackermann.com Even before Blood and Honey and Unbroken, Jolie Pitt was attracted to stories about real-life characters and bravery under all sorts of fire. Mariane Pearl, widow of Daniel Pearl, the Wall Street Journal reporter who was kidnapped and murdered in Pakistan in 2002, was thrilled when Jolie Pitt signed on to play her in A Mighty Heart, a 2007 film adaptation of her memoir. As early as 2004, Jolie Pitt optioned Franklin and Winston, Jon Meacham’s best-selling portrait of the genuine and all-important friendship between Roosevelt and Churchill during World War II. She says Anthony Hopkins has been attached to the project, as Churchill, for years but that she herself has no desire to play a role or direct. “I just wanted to see it get made, because I have a thing for those guys. It would give me an excuse to work on it and be around the characters.” HBO has expressed interest in the project, but more imminent on Jolie Pitt’s to-do list is a film for Netflix, First They Killed My Father, which begins shooting this month. Based on a memoir by Cambodian author and human rights activist Loung Ung, it chronicles her survival under the murderous Khmer Rouge. The whole family will relocate to Cambodia for the shoot, during which Jolie Pitt’s 14-year-old son, Maddox, whom she adopted from Cambodia when he was barely 1 (Pitt subsequently adopted him as well), will help with the research. “He’s going to sit with me while we watch the videos and re-create such a difficult time in his people’s history,” she says. “It’s important that the whole family understands all that it means to him and to us.” The Cambodian connection is both familial and visceral. Not only is it the place where Jolie Pitt had the “epiphany” that she could be somebody’s mother, but her initial experience in the country (while shooting Lara Croft: Tomb Raider) led to her lasting connection to the United Nations, for which she currently serves as special envoy for refugee issues. “I’d been expecting people who were bitter and unhappy,” she says, “and instead, they were full of light and kindness and humor.” She spent much of the shoot avoiding land mines, meeting land mine victims, learning about refugees. “I thought, There is so much I’m not aware of, and it’s a big world out there and I really need to educate myself.” She came back, did a lot of research and found herself deeply affected by the vast number of people around the world displaced by war. When she asked the United Nations High Commissioner for Refugees (UNHCR) to put together a learning trip (which she paid for herself), she ended up in Tanzania, at a camp where many refugees were missing limbs. “I called my mom from the airport and said, ‘I am never going to take my life for granted, I’m never going to complain. I want to be a part of this world.’ And not out of pity—I found the people so extraordinary, and I wanted to be around them and learn from their resilience.”\n\nDEEP FOCUS | Jolie Pitt has ‘never been a person who hides,’ says husband Brad Pitt. ‘She’s utterly forthcoming and sincere about who she is.’ Céline dress, $3,250, Céline Madison Avenue, New York", "images": ["https://si.wsj.net/public/resources/images/BN-KV570_1115JO_750V_20151020124823.jpg", "https://si.wsj.net/public/resources/images/BN-KV577_1115JO_750V_20151020124954.jpg", "https://si.wsj.net/public/resources/images/BN-LD448_magjol_NS_20151106133933.jpg", "https://si.wsj.net/public/resources/images/BN-KV582_1115JO_750V_20151020125058.jpg", "https://si.wsj.net/public/resources/images/BN-KV575_1115JO_750V_20151020124935.jpg", "https://si.wsj.net/public/resources/images/BN-KV571_1115JO_750V_20151020124849.jpg", "https://si.wsj.net/public/resources/images/BN-KV583_1115JO_1000V_20151020125121.jpg", "https://si.wsj.net/public/resources/images/BN-KV668_1115_j_G_20151020135521.jpg", "https://si.wsj.net/public/resources/images/BN-LB210_JOLIEC_750V_20151102152454.jpg", "https://si.wsj.net/public/resources/images/BN-KV578_1115JO_750V_20151020125014.jpg", "https://si.wsj.net/public/resources/images/BN-LJ111_INNOVA_8H_20151119155258.jpg", "https://si.wsj.net/public/resources/images/BN-LC677_magjol_NS_20151105013141.jpg"], "top_img": "https://si.wsj.net/public/resources/images/BN-KV668_1115_j_G_20151020135521.jpg", "keywords": [], "authors": ["Julia Reed", "Photographs Peter Lindbergh", "Styling Anastasia Barbieri"], "canonical_link": "https://www.wsj.com/articles/the-examined-life-of-angelina-jolie-pitt-1446687750", "title": "The Examined Life of Angelina Jolie Pitt", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=2.0", "dj.asn": "i-0b6a", "user.type": "nonsubscriber", "user.exp": "default", "page.section": "Article", "page.content.type": "Article", "page.content.source": "WSJ Online", "article.template": "full", "page.site": "wsj", "page.site.product": "WSJ", "page.region": "na,us", "article.id": "SB11429965440205254550404581291282456845812", "article.type": "Experiential", "article.type.display": "In Depth", "article.access": "freeforever", "article.origheadline": "WSJ. Magazine’s 2015 Entertainment/Film Innovator is a Hollywood icon, humanitarian activist and the writer-director of this month’s ‘By the Sea’", "article.headline": "The Examined Life of Angelina Jolie Pitt", "article.summary": "Angelina Jolie Pitt, WSJ. Magazine’s 2015 Entertainment/Film Innovator, is a Hollywood icon, humanitarian activist and the writer-director of this month’s ‘By the Sea’—in which she co-stars with husband Brad Pitt for the first time in a decade.", "apple-itunes-app": "app-id=364387007,app-argument=wsj://launch?articleid=SB11429965440205254550404581291282456845812&headline=The%20Examined%20Life%20of%20Angelina%20Jolie%20Pitt&weburl=https%3A%2F%2Fwww.wsj.com%2Farticles%2FSB11429965440205254550404581291282456845812", "al": {"ios": {"url": "wsj://launch?articleid=SB11429965440205254550404581291282456845812&headline=The%20Examined%20Life%20of%20Angelina%20Jolie%20Pitt&weburl=https%3A%2F%2Fwww.wsj.com%2Farticles%2FSB11429965440205254550404581291282456845812"}}, "article.page": "Page One", "article.section": "Page One", "article.published": "2015-11-05T01:42:00.000Z", "article.updated": "2015-11-05T01:42:00.000Z", "article.created": "2015-11-05T01:42:00.000Z", "dateLastPubbed": "2015-12-01T23:14:00.000Z", "author": "Julia Reed | Photographs by Peter Lindbergh, Styling by Anastasia Barbieri", "keywords": "angelina jolie,angelina jolie cancer,angelina jolie children,angelina jolie director,angelina jolie movies,angelina jolie united nations,brad pitt,brangelina,by the sea,jolie pitt,unbroken,wsj innovators,Angelina Jolie Pitt,political,general news,celebrity news,gossip,arts,entertainment,feature films,living,lifestyle,movies,actor interviews,interviews,arts & entertain,magazine - culture,ommm,onew,media", "news_keywords": "angelina jolie,angelina jolie cancer,angelina jolie children,angelina jolie director,angelina jolie movies,angelina jolie united nations,brad pitt,brangelina,by the sea,jolie pitt", "description": "Angelina Jolie Pitt, WSJ. Magazine’s 2015 Entertainment/Film Innovator, is a Hollywood icon, humanitarian activist and the writer-director of this month’s ‘By the Sea’—in which she co-stars with husband Brad Pitt for the first time in a decade.", "article.emb": "video_emb", "article": {"word_count": 4128, "image_count": 10, "video_count": 1, "embed_count": 3, "internal_link_count": 19, "external_link_count": 2, "publisher": "https://www.facebook.com/wsj", "opinion": "false"}, "robots": "noarchive,noodp", "language": "en-US", "twitter": {"title": "The Examined Life of Angelina Jolie Pitt", "description": "Angelina Jolie Pitt, WSJ. Magazine’s 2015 Entertainment/Film Innovator, is a Hollywood icon, humanitarian activist and the writer-director of this month’s ‘By the Sea’—in which she co-stars with husband Brad Pitt for the first time in a decade.", "image": {"identifier": "https://si.wsj.net/public/resources/images/BN-KV668_1115_j_G_20151020135521.jpg", "alt": "The Examined Life of Angelina Jolie Pitt"}, "card": "summary_large_image", "site": "@WSJ", "domain": "wsj.com"}, "fb": {"app_id": 368513495882, "pages": 8304333127}, "og": {"title": "The Examined Life of Angelina Jolie Pitt", "description": "Angelina Jolie Pitt, WSJ. Magazine’s 2015 Entertainment/Film Innovator, is a Hollywood icon, humanitarian activist and the writer-director of this month’s ‘By the Sea’—in which she co-stars with husband Brad Pitt for the first time in a decade.", "url": "https://www.wsj.com/articles/the-examined-life-of-angelina-jolie-pitt-1446687750", "image": {"identifier": "https://si.wsj.net/public/resources/images/BN-KV668_1115_j_G_20151020135521.jpg", "width": 553, "height": 369}, "locale": "en_US", "type": "article", "site_name": "WSJ"}, "cx_pv_id": "k94eticknha3eswi", "cx_shield": "{\"campaign\":10,\"placement\":\"cx-snippetad\",\"tag\":\"default\",\"type\":\"personalized\",\"paywallType\":\"paid\",\"bucket\":7}", "referrer": "always"}, "movies": [], "publish_date": null, "source": "http://www.wsj.com", "summary": ""}