{"url": "https://www.usatoday.com/story/life/music/2018/09/17/mac-millers-death-prompts-hard-lessons-addiction/1304415002/", "text": "The tragic death of Mac Miller on Sept. 7, widely assumed to be from an overdose, has provoked a much-needed conversation about how our culture thinks and talks about addiction and recovery. It’s a conversation that was already happening following Demi Lovato’s overdose in July. And while the two incidents sparked largely supportive reactions, with the rap community and beyond spending the week mourning Miller's passing, the two incidents weren't without ugly social media comments and ill-intended media coverage.\n\nIn one article, Lovato was blamed for \"surrounding herself with enablers\" before her overdose. And in the days after Miller's death, his ex-girlfriend, Ariana Grande, was hit with social media harassment blaming their breakup for his relapse, a claim perpetuated by some media coverage of his death that claimed his substance abuse issues became more challenging after their split.\n\nMore:Mac Miller's friend says Ariana Grande 'was an unbelievably stabilizing force in his life'\n\nIn Lovato's statement following her overdose, she described addiction as an \"illness (that) is not something that disappears or fades with time.\" And in the aftermath of Miller's death, other facts about addiction deserve to be revisited, a reckoning that's essential for our society to better understand people recovering from addiction and to help others get the treatment they need.\n\nMore:Remember Mac Miller's brilliance with these essential tracks\n\nMiller’s death was not a selfish act\n\nOne of the most harmful beliefs surrounding addiction and suicide is that a person is “selfish” for dying from an overdose or intentionally taking their own life, with Miller fans taking to Reddit to bemoan online commenters calling his death a selfish act. Blaming him for his death incorrectly reduces addiction to an issue of personal willpower. In reality, addiction is a disease, exacerbated by a social climate that doesn’t adequately support recovery, from the stigma that “addicts” face to a general lack of mental health resources.\n\nMiller’s addiction and death are not Ariana Grande’s fault\n\nMiller isn’t the only one being blamed for his death. Ex-girlfriend Grande experienced a rush of harassment blaming her for his passing, prompting her to turn off her Instagram comments and go silent on social media for days after his death. As much pain as Miller’s family, friends and fans may be feeling after his death, directing that anger at Grande is unfair, perpetuating the myth that someone’s addiction-related death is the fault of their loved ones, who maybe could’ve saved them had they behaved differently.\n\nGrande has previously spoken about the shaming she’s received about Miller’s addiction and recovery, posting a lengthy statement in May in response to a fan’s tweet blaming her for Miller getting a DUI. “I have cared for him and tried to support his sobriety and prayed for his balance for years,” she wrote. “But shaming/blaming women for a man’s inability to keep his (expletive) together is a very major problem … I will continue to pray from the bottom of my heart that he figures it all out and that any woman in this position does as well.”\n\n\n\nGrande’s statement gets at an important point, that there’s a temptation to blame the people surrounding someone who dies of addiction, particularly the women in their life, rather than offering compassion.\n\nMore:Mac Miller's friend says Ariana Grande 'was an unbelievably stabilizing force in his life'\n\nRecovery shouldn't have to be a silent struggle\n\nGrande makes another important point in her statement, about the years she suffered in silence while supporting Miller as he battled his addiction, writing, “Of course I didn’t share how hard or scary it was while it was happening, but it was.”\n\nWhile drug use often shows up in the lyrics of rap and hip-hop songs, young stars often fight the disease of addiction in silence. Of course, stars aren’t obligated to go public about their struggles with drugs and alcohol, with many choosing to navigate their journeys of recovery in private. Yet treating addiction as a sinful taboo, rather than an issue that can be managed with treatment like any other serious disease, only makes it more difficult for people to seek the resources they need to recover.\n\nFollowing Miller’s death, multiple stars came forward with their own stories of addiction and sobriety. One of the most compelling tributes came from Macklemore, who, like Miller, has been open about his struggles with substance abuse, writing in an Instagram caption that he and Miller “shared the same disease. A disease that is out to kill us, and when left untreated eventually will.”\n\nMore:Mac Miller's family, celebrity friends mourn his 'heartbreaking' death\n\nIn his post, he urged readers not to be ashamed to seek treatment, rather than struggling in silence. “On the surface people that appear to have it all, are not exempt from the gravity and cunning nature of this disease,” he wrote. “If you’re in the midst of addiction tell someone what’s going on. Don’t be a secret. Go to a 12 step meeting. Introduce yourself and you’ll be greeted with love and understanding from people that are fighting the same battle.”\n\nAlthough Miller’s admirable openness about his addiction may not have been enough to help him overcome it, he and Macklemore and the stars who all have shared their own recovery journeys with fans have helped dispel some of the shame that surrounds the issue.\n\nIf you or someone you know is struggling with substance abuse or addiction, you can call the Substance Abuse and Mental Health Services Administration National Helpline at 800-662-HELP (4357) any time of day or night.", "images": ["https://www.gannett-cdn.com/presto/2018/09/07/USAT/aafc8f00-98f1-4867-813d-26bec1f65048-MAC013.JPG?crop=1499,840,x0,y39&width=1499&height=840&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5832243674001_5832241716001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/09/07/USAT/aafc8f00-98f1-4867-813d-26bec1f65048-MAC013.JPG?crop=1500,1000,x0,y0&width=660&height=440&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/07/USAT/aafc8f00-98f1-4867-813d-26bec1f65048-MAC013.JPG?crop=1499,840,x0,y39&width=1499&height=840&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/music/2018/09/17/mac-millers-death-prompts-hard-lessons-addiction/1304415002/", "title": "Three hard lessons about addiction we learned after Mac Miller’s death", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Three hard lessons about addiction we learned after Mac Miller’s death", "description": "In the aftermath of Mac Miller's death, we need to re-examine how we treat people recovering from addiction.", "url": "https://www.usatoday.com/story/life/music/2018/09/17/mac-millers-death-prompts-hard-lessons-addiction/1304415002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/07/USAT/aafc8f00-98f1-4867-813d-26bec1f65048-MAC013.JPG?crop=1499,840,x0,y39&width=1499&height=840&format=pjpg&auto=webp", "width": 1499, "height": 840}, "type": "article"}, "article": {"author": "Maeve McDermott", "content_tier": "free", "opinion": "false"}, "description": "In the aftermath of Mac Miller's death, we need to re-examine how we treat people recovering from addiction.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/09/07/USAT/aafc8f00-98f1-4867-813d-26bec1f65048-MAC013.JPG?crop=1499,840,x0,y39&width=1499&height=749&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Three hard lessons about addiction we learned after Mac Miller’s death", "description": "In the aftermath of Mac Miller's death, we need to re-examine how we treat people recovering from addiction."}}, "movies": [], "publish_date": 1537113600.0, "source": "https://www.usatoday.com", "summary": ""}