{"url": "https://www.elle.com/culture/celebrities/a22102072/selena-gomez-justin-bieber-engagement-to-hailey-baldwin-feelings-tabloid-sources-roundup/", "text": "On Sunday, the day news of Justin Bieber's engagement to Hailey Baldwin broke, his on-off ex Selena Gomez looked unbothered on a boat named Justine. Since then, tabloids have run reports from their Gomez sources hammering home the fact that SELENA GOMEZ DOES NOT CARE ABOUT JAILEY GETTING MARRIED AND IS GREAT, THANKS. Others stressed how little she thinks about the Biebs and how honestly, it never would have worked out with him anyway.\n\nHere, a roundup of what they're all saying.\n\nTMZ just ran footage of paparazzi asking Gomez about Bieber's engagement. She said nothing, kept her glance away, did not make eye contact, and just entered her car. There was no hostile vibe as much as there was the clear impression Gomez did not feel like answering any questions then.\n\nGomez and Bieber don't talk anymore, so he's not really on her mind, a source told People. “They haven’t spoken in months. She hasn’t been talking about him since they ended things again earlier this year,” that source said. (Bieber and Gomez went on that permanent break at the end of February.) “It was never a healthy situation for Selena and Justin.\"\n\nBut Gomez is working on new music and projects. “She hasn’t been thinking about Justin. She’s in a great place and is very happy.\"\n\nAlso, Jelena was never ever going to work, a source close to Bieber told People. “Their relationship was always very complex and complicated. It was just too much baggage. It was like their past tainted everything. It wasn’t possible for them to have a future.”\n\nE!'s sources said Gomez was and wasn't surprised to hear her ex proposed that quickly to Baldwin. That said, she doesn't care and wishes the guy the best. (Bieber and Baldwin got engaged after dating for a month, and reports have come out suggesting Bieber had been planning to propose the entire couple weeks they were together.)\n\nE!'s first source: \"Selena was surprised an engagement happened this quickly but not surprised Justin would do something like this knowing who he is. At the end of the day though she doesn't really care. Selena is totally over him. She had tried again to make it work that last time and it didn't work out. Selena is definitely on a different path right now and in a much better place since Justin is out of the picture...She isn't focused on dating as much as she's just really focusing on herself. She's happy right now just spending time with her girlfriends and going to church.\"\n\nThe second source: Gomez was \"very shocked\" but at the same time, again, totally doesn't care. \"Selena knows that Justin makes rash decisions but wishes them both the best. She is truly focused on herself and Justin is no longer a topic of conversation in her life.\"\n\nThe third source: Gomez \"heard [Bieber] was getting very serious with Hailey, but an engagement was definitely a surprise. At the same time, she knows Justin very well and knows he is impulsive and makes emotional decisions. At this point, she's just trying to focus on her own life and her own happiness. She wishes him the best.\"\n\nGomez wants nothing but happiness for Jailey because she does not have a malicious bone in her body, Entertainment Tonight's source said. The source started by repeating this does not bother Gomez. “She does not care at all. What they do with their lives does not impact her. Selena is in such a great place and is surrounding herself with good positive people, and Justin and Hailey’s happiness doesn’t take away from her own happiness.\" Hollywood drama like this \"just roll off her back now. She has a much better perspective on life now that she’s removed herself from the Hollywood bubble.\" (Gomez recently moved out of Los Angeles.)\n\nA bit of Gomez believes Bieber is being so public with his Baldwin romance \"to make her upset,\" a source told Us Weekly. (A report came out that Bieber only dated Baskin Champion this spring to make her jealous, so this isn't the first time that possibility has been floated.) But Gomez's not buying it.\n\n“Anytime he has done this in the past, Selena doesn’t even see stories about him in the media,” the source said. “Her team makes sure she is protected from it, so it’s a waste of time on Justin’s end if that’s his goal. No one in her circle speaks about him when they are on the outs and she keeps her circle and team very small.”\n\nA second source told Us Weekly that Gomez doesn't care though. \"She’s over Justin and the last time they broke up allowed her to get over him fully.\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a22102072/selena-gomez-justin-bieber-engagement-to-hailey-baldwin-feelings-tabloid-sources-roundup/", "title": "How Selena Gomez Feels About Justin Bieber's Engagement to Hailey Baldwin", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "How Selena Gomez Feels About Justin Bieber's Engagement to Hailey Baldwin, According to Every Tabloids' Sources", "description": "\"Selena knows that Justin makes rash decisions but wishes them both the best.\"", "url": "https://www.elle.com/culture/celebrities/a22102072/selena-gomez-justin-bieber-engagement-to-hailey-baldwin-feelings-tabloid-sources-roundup/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-07-10 02:24:03", "published_time": "2018-07-10 02:24:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "How Selena Gomez Feels About Justin Bieber's Engagement to Hailey Baldwin - Tabloid Sources on Selena's Reaction", "description": "On Sunday, the day news of Justin Bieber's engagement to Hailey Baldwin broke, his on-off ex​ Selena Gomez looked unbothered on a boat named Justine​. Since then, tabloids have run reports from their Gomez sources about how she feels about the engagement. Here, a roundup of what they're saying.", "keywords": "hailey baldwin, how selena feels about justin's engagement, jailey, jelena, justin bieber, justin bieber engagement, selena gomez, selena gomez justin bieber, selena gomez justin bieber engagement", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=0.335xw:0.670xh;0.335xw,0.0224xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,justin bieber engagement,how selena feels about justin's engagement,Selena Gomez Justin Bieber Engagement,jailey,selena gomez justin bieber,hailey baldwin,jelena,justin bieber,Selena Gomez", "sailthru.date": "2018-07-10T14:24:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/justin-bieber-selena-gomez-hailey-baldwin-gettyimages-990811200-1-1531232199.jpg?crop=0.335xw:0.670xh;0.335xw,0.0224xh", "sailthru.socialtitle": "How Selena Gomez Feels About Justin Bieber's Engagement to Hailey Baldwin, According to Every Tabloids' Sources", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531160640.0, "source": "https://www.elle.com", "summary": ""}