{"url": "https://www.usatoday.com/story/life/tv/2018/09/13/emmys-2018-predictions-game-thrones-handmaids-tale-marvelous-mrs-maisel-atlanta/1210854002/", "text": "Will the Emmys be dominated by white walkers or handmaids?\n\nThat's the biggest question on TV fans' minds heading into the 70th Primetime Emmy Awards Monday (NBC, 8 EDT/5 PDT). Michael Che and Colin Jost will step out from behind their \"Weekend Update\" desk on \"Saturday Night Live\" to host the ceremony. And HBO's \"Game of Thrones,\" Hulu's \"The Handmaid's Tale\" and FX's \"The Americans\" compete for the best drama award, while FX's \"Atlanta\" and Amazon's \"The Marvelous Mrs. Maisel\" will vie for the outstanding comedy prize.\n\nBefore the trophies are handed out, we've made our best predictions about who will win in major categories and who should be standing onstage instead.\n\nDrama series\n\n\"The Americans\" (FX)\n\n\"The Crown\" (Netflix)\n\n\"Game of Thrones\" (HBO)\n\n\"The Handmaid's Tale\" (Hulu)\n\n\"Stranger Things\" (Netflix)\n\n\"This Is Us\" (NBC)\n\n\"Westworld\" (HBO)\n\nShould win: \"The Americans\"\n\nWill win: \"The Handmaid's Tale\"\n\nThe best drama race is, unfortunately, a fight between mediocre seasons from two previous winners. The seventh season of \"Game of Thrones,\" while full of battles and incest, was all over the place in quality and aired more than a year ago, which means it's a distant, fire-and-ice-filled memory. \"The Handmaid's Tale\" won last year, but its second season was maligned by many critics. Still, its continued buzz and political relevance mean \"Handmaid's\" will likely eke out a win, but it's a shame for the most deserving nominee, \"The Americans.\" FX's Soviet spy drama finally managed to worm its way into this category for a pitch-perfect final season, and it's one of the best shows in recent memory.\n\nMore:See the full list of the 2018 Emmy nominees\n\nComedy series\n\n\"Atlanta\" (FX)\n\n\"Barry\" (HBO)\n\n\"Black-ish\" (ABC)\n\n\"Curb Your Enthusiasm\" (HBO)\n\n\"GLOW\" (Netflix)\n\n\"The Marvelous Mrs. Maisel\" (Amazon)\n\n\"Silicon Valley\" (HBO)\n\n\"Unbreakable Kimmy Schmidt\" (Netflix)\n\nShould win: \"Atlanta\"\n\nWill win: \"The Marvelous Mrs. Maisel\"\n\nFew shows on TV are as daring as \"Atlanta,\" Donald Glover's auteur dramedy that's seemingly in a genre of its own, experimenting with form and offering some of the smartest, sleekest episodes on the air. Although the series is likely to triumph in some categories, the broader and much more fun \"Mrs. Maisel,\" a celebration of comedy itself, is likely to walk away with this prize.\n\nLead actress, drama series\n\nClaire Foy, \"The Crown\" (Netflix)\n\nTatiana Maslany, \"Orphan Black\" (BBC America)\n\nElisabeth Moss, \"The Handmaid’s Tale\" (Hulu)\n\nSandra Oh, \"Killing Eve\" (BBC America)\n\nKeri Russell, \"The Americans\" (FX)\n\nEvan Rachel Wood, \"Westworld\" (HBO)\n\nShould win: Keri Russell, \"The Americans\"\n\nWill win: Elisabeth Moss, \"The Handmaid's Tale\"\n\nFour women could easily have walked away with this trophy in a less competitive year (Moss, Russell, Oh and Foy), but thanks to her continually raw performance, this is Moss' category to lose, despite her series' decline in quality. More importantly, Russell's performance as Soviet spy Elizabeth Jennings is blisteringly good, barely holding it together as Elizabeth's world starts to crumble in the show's final season. That she's likely never going to nab an Emmy for this show is as big a crime as Moss never getting one for \"Mad Men.\"\n\nLead actor, drama series\n\nJason Bateman, \"Ozark\" (Netflix)\n\nSterling K. Brown, \"This Is Us\" (NBC)\n\nEd Harris, \"Westworld\" (HBO)\n\nMatthew Rhys, \"The Americans\" (FX)\n\nMilo Ventimiglia, \"This Is Us\" (NBC)\n\nJeffrey Wright, \"Westworld\" (HBO)\n\nShould win: Matthew Rhys, \"The Americans\"\n\nWill win: Matthew Rhys, \"The Americans\"\n\nBrown has a very good chance at picking up another Emmy for his show-anchoring performance as Randall on \"This Is Us,\" but, in a wildly optimistic prediction, I'm going with Rhys to collect the send-off award for his heartbreaking work on the final season of \"The Americans,\" as Jon Hamm did for \"Mad Men.\" Rhys' partner Russell might have been able to do this, too, if her category wasn't so much more competitive.\n\nMore:What the 2018 Emmy nominations got right and wrong\n\nLead actress, comedy series\n\nPamela Adlon, \"Better Things\" (FX)\n\nRachel Brosnahan, \"The Marvelous Mrs. Maisel\" (Amazon)\n\nAllison Janney, \"Mom\" (CBS)\n\nIssa Rae, \"Insecure\" (HBO)\n\nTracee Ellis Ross, \"Black-ish\" (ABC)\n\nLily Tomlin, \"Grace and Frankie\" (Netflix)\n\nShould win: Rachel Brosnahan, \"The Marvelous Mrs. Maisel\"\n\nWill win: Rachel Brosnahan, \"The Marvelous Mrs. Maisel\"\n\nSince \"Maisel\" debuted, Brosnahan has mopped up awards for her performance, for good reason. The actress, previously seen in supporting roles on \"House of Cards\" and \"The Blacklist,\" breaks out in a monumental way on the period drama, bringing to life Midge Maisel, the 1950s housewife who finds her true calling in stand-up comedy.\n\nLead actor, comedy series\n\nAnthony Anderson, \"Black-ish\" (ABC)\n\nTed Danson, \"The Good Place\" (NBC)\n\nLarry David, \"Curb Your Enthusiasm\" (HBO)\n\nDonald Glover, \"Atlanta\" (FX)\n\nBill Hader, \"Barry\" (HBO)\n\nWilliam H. Macy, \"Shameless\" (Showtime)\n\nShould win: Bill Hader, \"Barry\"\n\nWill win: Donald Glover, \"Atlanta\"\n\nHader has reinvented himself on HBO's \"Barry,\" a dark yet whimsical series about a hitman who dreams of becoming an actor. The show was a surprisingly satisfying treat last spring thanks to Hader's performance, which swings between deep despair and hope. But it's unlikely he'll topple returning champion Glover, who deservedly received wild acclaim for the second season of \"Atlanta.\"\n\nSupporting actress, drama series\n\nAlexis Bledel, \"The Handmaid's Tale\" (Hulu)\n\nMillie Bobby Brown, \"Stranger Things\" (Netflix)\n\nAnn Dowd, \"The Handmaid's Tale\" (Hulu)\n\nLena Headey, \"Game of Thrones\" (HBO)\n\nVanessa Kirby, \"The Crown\" (Netflix)\n\nThandie Newton, \"Westworld\" (HBO)\n\nYvonne Strahovski, \"The Handmaid's Tale\" (Hulu)\n\nShould win: Vanessa Kirby, \"The Crown\"\n\nWill win: Yvonne Strahovski, \"The Handmaid's Tale\"\n\nThree \"Handmaid's\" stars are competing in this category, which could split the vote among devoted Emmy voters, especially since Dowd won this category last year and Bledel won as a guest star. But this season's standout was Strahovski, as her character slowly evolved from collaborator to resister in the show's totalitarian dystopia. Despite Strahovski's strong effort, the real winner here should be Kirby's final outing as Princess Margaret on \"The Crown,\" a showcase for Kirby's considerable talents as the reckless princess battled melancholy after losing the love of her life.\n\nSupporting actor, drama\n\nNikolaj Coster-Waldau, \"Game of Thrones\" (HBO)\n\nPeter Dinklage, \"Game of Thrones\" (HBO)\n\nJoseph Fiennes, \"The Handmaid's Tale\" (Hulu)\n\nDavid Harbour, \"Stranger Things\" (Netflix)\n\nMandy Patinkin, \"Homeland\" (Showtime)\n\nMatt Smith, \"The Crown\" (Netflix)\n\nShould win: Matt Smith, \"The Crown\"\n\nWill win: David Harbour, \"Stranger Things\"\n\nIn the second season of \"The Crown,\" Smith elevated his portrayal of Prince Philip from generically unlikable to something far more nuanced, especially as the series gave context to his troubled childhood. But he'll likely lose out to Harbour's broodier turn on \"Stranger Things,\" more a leading performance anyway.\n\nSupporting actress, comedy\n\nZazie Beetz, \"Atlanta\" (FX)\n\nAlex Borstein, \"The Marvelous Mrs. Maisel\" (Amazon)\n\nAidy Bryant, \"Saturday Night Live\" (NBC)\n\nBetty Gilpin, \"GLOW\" (Netflix)\n\nLeslie Jones, \"Saturday Night Live\" (NBC)\n\nKate McKinnon, \"Saturday Night Live\" (NBC)\n\nLaurie Metcalf, \"Roseanne\" (ABC)\n\nMegan Mullally, \"Will & Grace\" (NBC)\n\nShould win: Betty Gilpin, \"GLOW\"\n\nWill win: Alex Borstein, \"The Marvelous Mrs. Maisel\"\n\nThe first season of \"GLOW\" is eligible for this year's Emmys, and it was in those early episodes that Gilpin's Debbie was a scene-stealer as a woman figuring out how to reclaim her body and identity after becoming a mother and getting divorced. But as fabulous as Gilpin is, industry veteran Borstein (\"Family Guy\") is likely to get long overdue recognition for her boisterous turn on \"Maisel.\"\n\nMore:The most shocking snubs in the 2018 Emmy nominations\n\nSupporting actor, comedy\n\nLouie Anderson, \"Baskets\" (FX)\n\nAlec Baldwin, \"Saturday Night Live\" (NBC)\n\nTituss Burgess, \"Unbreakable Kimmy Schmidt\" (Netflix)\n\nBrian Tyree Henry, \"Atlanta\" (FX)\n\nTony Shalhoub, \"The Marvelous Mrs. Maisel\" (Amazon)\n\nKenan Thompson, \"Saturday Night Live\" (NBC)\n\nHenry Winkler, \"Barry\" (HBO)\n\nShould win: Henry Winkler, \"Barry\"\n\nWill win: Henry Winkler, \"Barry\"\n\nDespite the role's iconic status, Winkler never won an Emmy for playing the Fonz on \"Happy Days.\" But he might finally get what he long has deserved, thanks to his role as a washed-up actor-turned-drama teacher in HBO's \"Barry.\" Winkler plays a man fighting to remain relevant in a profession he loves, but thankfully Winkler himself doesn't have to fight too hard.\n\nLimited series\n\n\"The Alienist\" (TNT)\n\n\"Genius: Picasso\" (National Geographic)\n\n\"The Assassination of Gianni Versace: American Crime Story\" (FX)\n\n\"Godless\" (Netflix)\n\n\"Patrick Melrose\" (Showtime)\n\nShould win: \"The Assassination of Gianni Versace: American Crime Story\"\n\nWill win: \"The Assassination of Gianni Versace: American Crime Story\"\n\nWhile not as popular or socially relevant as \"The People v. O.J. Simpson,\" the second installment of Ryan Murphy's true crime anthology was operatically epic, beautiful and grotesque at once. It has solid competitors in \"Patrick Melrose\" and \"Godless,\" but Murphy is an Emmy favorite, and \"Versace\" will easily slide to victory.\n\nLead actress, limited series/TV movie\n\nJessica Biel, \"The Sinner\" (USA)\n\nLaura Dern, \"The Tale\" (HBO)\n\nMichelle Dockery, \"Godless\" (Netflix)\n\nEdie Falco, \"Law & Order True Crime: The Menendez Murders\" (NBC)\n\nRegina King, \"Seven Seconds\" (Netflix)\n\nSarah Paulson, \"American Horror Story: Cult\" (FX)\n\nShould win: Laura Dern, \"The Tale\"\n\nWill win: Laura Dern, \"The Tale\"\n\nIn a staggering performance, Dern plays a woman who comes to realize that she was sexually abused as a child. HBO purchased \"The Tale\" at this year's Sundance Film Festival, and had the film been distributed in movie theaters instead of on premium cable, we'd be talking about Dern's Oscar chances. She's just that good.\n\nLead actor, limited series/TV movie\n\nAntonio Banderas, \"Genius: Picasso\" (National Geographic)\n\nDarren Criss, \"The Assassination of Gianni Versace: American Crime Story\" (FX)\n\nBenedict Cumberbatch, \"Patrick Melrose\" (Showtime)\n\nJeff Daniels, \"The Looming Tower\" (Hulu)\n\nJohn Legend, \"Jesus Christ Superstar Live In Concert\" (NBC)\n\nJesse Plemons, \"Black Mirror: USS Callister\" (Netflix)\n\nShould win: Benedict Cumberbatch, \"Patrick Melrose\"\n\nWill win: Darren Criss, \"The Assassination of Gianni Versace: American Crime Story\"\n\nThe race between Criss and Cumberbatch is a title match between two very talented guys in their career-best performances. In \"Versace,\" Criss makes everyone forget about \"Glee\" as Andrew Cunanan, who killed designer Gianni Versace and four other men in 1997. In \"Melrose,\" Cumberbatch takes us through the life of a deeply damaged man, who was abused in childhood and abused substances as an adult. Cumberbatch does something just a little bit harder than Criss, but Criss has the momentum, the flashier project and the Ryan Murphy machine behind him.", "images": ["http://www.gannett-cdn.com/media/2018/07/12/USATODAY/USATODAY/636669959066596952-DRAMA-THUMB-2.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/5c4402952fbe4fb249af8440b9c9d26b34fd2ac7/c=0-0-2993-1691/local/-/media/2018/06/25/USATODAY/USATODAY/636655216850461806-ATL-211-0244r.jpg?width=2993&height=1691&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/5c4402952fbe4fb249af8440b9c9d26b34fd2ac7/c=0-0-2993-1691/local/-/media/2018/06/25/USATODAY/USATODAY/636655216850461806-ATL-211-0244r.jpg?width=2993&height=1691&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/09/13/emmys-2018-predictions-game-thrones-handmaids-tale-marvelous-mrs-maisel-atlanta/1210854002/", "title": "Who will (and who should) win at the 2018 Emmy Awards", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Who will (and who should) win at the 2018 Emmy Awards", "description": "From sure bets such as \"The Marvelous Mrs. Maisel\" to hopeful long shots such as \"The Americans,\" we break down who will and who should win the top prizes at the 2018 Emmy Awards.", "url": "https://www.usatoday.com/story/life/tv/2018/09/13/emmys-2018-predictions-game-thrones-handmaids-tale-marvelous-mrs-maisel-atlanta/1210854002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5c4402952fbe4fb249af8440b9c9d26b34fd2ac7/c=0-0-2993-1691/local/-/media/2018/06/25/USATODAY/USATODAY/636655216850461806-ATL-211-0244r.jpg?width=2993&height=1691&fit=crop&format=pjpg&auto=webp", "width": 2993, "height": 1691}, "type": "article"}, "article": {"author": "Kelly Lawler", "content_tier": "free", "opinion": "false"}, "description": "From sure bets such as \"The Marvelous Mrs. Maisel\" to hopeful long shots such as \"The Americans,\" we break down who will and who should win the top prizes at the 2018 Emmy Awards.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/5c4402952fbe4fb249af8440b9c9d26b34fd2ac7/c=0-0-2993-1691/local/-/media/2018/06/25/USATODAY/USATODAY/636655216850461806-ATL-211-0244r.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Who will (and who should) win at the 2018 Emmy Awards", "description": "From sure bets such as \"The Marvelous Mrs. Maisel\" to hopeful long shots such as \"The Americans,\" we break down who will and who should win the top prizes at the 2018 Emmy Awards."}}, "movies": [], "publish_date": 1536768000.0, "source": "https://www.usatoday.com", "summary": ""}