{"url": "https://www.inquisitr.com/4220148/kourtney-kardashian-spends-night-with-new-boyfriend-younes-bendjima-has-a-long-morning-make-out-session/", "text": "It’s all happening in Kourtney Kardashian’s life. The Keeping Up With The Kardashians star has said that she is never going to get back to the father of her three kids, Scott Disick. Meanwhile, there are strong rumors about the Kardashian sister having a whirlwind romance with Younes Bendjima.\n\nThe couple reportedly had a sleepover in a hotel. They were all kisses during the goodbye session after the romantic timeout. According to reports, Kourtney and his 24-year-old new boyfriend met up at the Hotel Bel-Air on May 10. According to sources, it was the 36-year-old Kardashian sister who wanted to spend some private time with Younes. She wanted to go “somewhere discreet and private.”\n\nReports suggest this was not the first time the couple went to the Hotel Bel Air. In fact, the couple is seen at the hotel quite frequently. One source has revealed to E! News that the hotel is their favorite hangout. They often got to that hotel, even though they keep things quite “discreet.”\n\nThis time, they checked in on Wednesday night and checked out on Thursday morning. They apparently had breakfast in their room before checking out. According to another source, the couple left at 9 o’clock in the morning. They had their car at the valet station of the hotel. Kourtney dropped Younes at his home. However, the goodbye did not happen before the couple made out for around 20 minutes. One of the sources revealed that Kourtney is seen at that hotel with her new boyfriend “all the time.” The couple apparently loves the place because it is a quiet one.\n\nAnother source has revealed that the hotel is a hideout for many other celeb couples, who want to meet in private. People can notice them only when they are checking in or checking out because they mostly prefer staying inside their room.\n\n#KourtneyKardashian and #YounesBendjima Conclude Their Hotel Getaway With Steamy Makeout Session pic.twitter.com/R4voVQN41d — Biphoo Celebs (@smithjohn18395) May 13, 2017\n\nWhile fans may like to believe that Kourtney Kardashian has every right to move on, here is why Kris Jenner’s daughter no longer wants to get back to her ex. Something happened between the two in Dubai, and that is apparently damaging enough for the couple. They have split many times and got back again as well. However, this time, Kourtney does not want to give another chance to Disick.\n\nEven though the couple has been together for a decade now and there is apparently enough love between the two, Kourtney is not here to tolerate the kind of disrespect Scott caused during their family trip to the Middle East. Scott has been linked to many women over the last few years, even though there are reports that he wants to get back to Kourtney.\n\nKourtney Kardashian secretly spent a night with new boyfriend Younes Bendjima. [Image by Ethan Miller/Getty Images]\n\nAccording to reports, Scott proposed to the mother of his three kids in Costa Rica, even though there was no ring involved this time. However, Kourtney turned him down right away and left him disappointed, to say the least. Kourtney later said that, after Costa Rica, Scott should be aware that there was no future in their relationship anymore.\n\n“I think something I’ve learned on this trip is that we need to just move on,” E! News quoted her as saying. “I think the moral of the story is we are never getting back together.”\n\nKourtney Kardashian and Scott Disick are not getting back together. [Image by Ethan Miller/Getty Images for AG Adriano Goldschmied]\n\nKourtney was disappointed when she came to know that Scott secretly got a woman in his hotel room in Dubai. He secretly kept the woman in the hotel room during their family vacation. However, when Kourtney came to know about it, she confronted him and let him know how disrespectful his behavior was.\n\nIs Kourtney Kardashian finally moving on with a new boyfriend? Let’s wait and find out.\n\n[Featured Image by Rob Kim/Getty Images for Alice + Olivia]", "images": ["https://secure.gravatar.com/avatar/05e4b9c06764d31131bed66383e7dbb8?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Kourtney-Kardashian-Scott-Disick.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Kim-Kourtney-Khloe-Kardashian-Kris-Jenner.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Kourtney-Kardashian-new-boyfriend.jpg"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Sounak Mukhopadhyay"], "canonical_link": "https://www.inquisitr.com/4220148/kourtney-kardashian-spends-night-with-new-boyfriend-younes-bendjima-has-a-long-morning-make-out-session/", "title": "Kourtney Kardashian Spends Night With New Boyfriend Younes Bendjima, Has A Long Morning Make-Out Session", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}