{"url": "https://www.elitedaily.com/entertainment/celebrity/selena-gomez-the-weeknd-coachella/1862353", "text": "Like always, Coachella was the popular hangout spot for A-list celebs this weekend.\n\nThe star-studded grounds of Indio, California, were packed with famous musicians, models and actors listening to music and letting their guards down -- including Selena Gomez and The Weeknd.\n\nREX/Shutterstock\n\nOur fav couple was spotted cuddling on the festival grounds on Saturday, April 15, and they definitely weren't afraid to pack on the PDA.\n\nI mean, look at them. The literally can't stop making out.\n\nTake a breather, you two!\n\nAt this point, we aren't too surprised Selena Gomez and her famous bae DGAF about the cameras around them because they've already been spotted multiple times getting intimate in public places.\n\nBut, hey, they're still cute as hell and we still can't get enough of 'em. So let's look at more pics, shall we?\n\nOver the weekend, Selena was wearing a springy, light blue dress covered in daisies while Abel rocked a blue plaid shirt. It was a shockingly low-key Coachella look for celebrities.\n\nEither way, they looked adorable kissing in the crowd.\n\nOh, look! More kissing!\n\nLook at these hotties.\n\nMy personal favorite picture of the couple from Coachella is a painfully adorable selfie Selena posted on Instagram yesterday.\n\nIn the photo, Abel has his arm wrapped around her as she peeks at the camera above her shades. She looks totally smitten.\n\nC'MON, GUYS. QUIT BEING SO DAMN CUTE.\n\nWell, it's safe to say these two had a romantic getaway in Coachella Valley, but it wasn't all kissing and relaxation for both of them.\n\nOn Saturday night, The Weeknd stepped away from Selena and hit the stage for a duet with Nav where he sang \"Party Monster,\" \"Starboy\" and \"Some Way.\"\n\nI wonder if they got separation anxiety from the few moments they weren't together.\n\nWhile Selena and Abel were having the times of their lives at Coachella, Abel's ex Bella Hadid was nowhere in sight.\n\nInstead of taking a trip to Cali, the model flew to Dubai for a weekend full of boat chillin' and skydiving with friends.\n\nMaybe she was trying to avoid the massive PDA between Selena and her ex, or maybe she just isn't a festival-goer.\n\nEither way, if I were her, I definitely wouldn't want to be stuck witnessing the blatant affection happening on Saturday.\n\nBut based off the fact both Selena and The Weeknd have made their love IG official, it's getting pretty impossible to ignore it.\n\nCitations: Here's What Bella Hadid Was Doing While The Weeknd and Selena Gomez Cuddled Up at Coachella (Hint: It's Intense!) (E! News), Selena Gomez & The Weeknd Get Cozy at Coachella 2017 (Billboard)", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.elitedaily.com/elite-daily/2017/05/08090725/selena-gomez-the-weeknd.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/elite-daily/2017/05/08124205/selena-gomez-the-weeknd-coachella.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/elite-daily/2017/05/08124205/selena-gomez-the-weeknd-coachella.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/elite-daily/2017/05/08124205/selena-gomez-the-weeknd-coachella.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/selena-gomez-the-weeknd-coachella/1862353", "title": "Selena Gomez And The Weeknd Spotted At Coachella", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/selena-gomez-the-weeknd-coachella/1862353", "type": "article", "title": "Selena Gomez And The Weeknd Packed On The PDA At Coachella And There Are Pics", "description": "Like always, Coachella was the popular hangout spot for A-list celebs this weekend.\nThe star-studded grounds of Indio, California, were packed with famous musicians, models and actors listening to music and letting their guards down --…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/05/08124205/selena-gomez-the-weeknd-coachella.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Like always, Coachella was the popular hangout spot for A-list celebs this weekend.\nThe star-studded grounds of Indio, California, were packed with famous musicians, models and actors listening to music and letting their guards down --…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}