{"url": "https://en.wikipedia.org/wiki/Jon_Paul_Steuer", "text": "Jon Paul Steuer (March 27, 1984 – January 1, 2018) was an American actor and musician, best known for being the first actor to play Alexander Rozhenko in Star Trek: The Next Generation and for being the first actor to regularly portray Quentin Kelly on the ABC show Grace Under Fire. He was also well known for playing Johnny \"Viper\" Vennaro in the 1994 children's comedy film Little Giants. After spending several years as a musician, Steuer entered the culinary industry and owned his own restaurant in Portland, Oregon.\n\nLife and career [ edit ]\n\nActing [ edit ]\n\nSteuer was three years old and living in San Diego, California, when he began asking his mother, a former member of the United States Ski Team, about becoming an actor. Within a year, he was attending children's modeling shows at local shopping malls. His break came when another did not appear for one of these shows; Steuer leapt onto the stage and offered his services. A talent agent, impressed with the boy's hubris and performance, approached him and his mother afterward and offered to represent Steuer and obtain acting roles for him.[1]\n\nWithin a year, Steuer had received a minor guest-starring role on the television series Day by Day. In 1990, Steuer was cast as Alexander Rozhenko in the Star Trek: The Next Generation episode \"Reunion\". Although a number of young children auditioned for the role, Steuer was the only child able to sit still for the three hours it took for the make-up department to cast his Klingon facial prosthetics. The ability to be still for a long period of time won him the part. The producers of the series sought him out a year later to reprise the role. However, Steuer had only grown half an inch in height and, at six years old, did not have a deep enough voice. So the producers cast actor Brian Bonsall, who was more than two years older, as Alexander. Steuer later said he was very upset at being recast.[1]\n\nSteuer performed several more times over the next three years, including the 1991 comedy Late for Dinner, a guest shot in the episode \"Unpacking\" of the TV series The Wonder Years, and a role in the made-for-television movie When Love Kills: The Seduction of John Hearn (1993). In the fall of 1993, Steuer won the role of Quentin Kelly in the television series Grace Under Fire.[a] But the extensive press attention given to lead actress Brett Butler, due to her erratic behavior and substance abuse, and Butler's sexual misconduct (she lifted her skirt and flashed her breasts in front of Steuer), led him to quit the show.[3] Although he auditioned for TV and movie roles after leaving Grace Under Fire, producers and press kept asking him about Butler and what it was like to work with her. Unwilling to continue to submit to such intense scrutiny, Steuer quit acting. He told an interviewer for The A.V. Club in 2015: \"I wanted to forge on with acting after quitting the show, and I went out on a few interviews. But even then they'd turn into question-and-answer sessions with casting agents about Grace Under Fire. I was kind of blown away by how unprofessional people inside the industry were. It really soured me. I didn't want that kind of attention.\"[1]\n\nDuring his time on Grace Under Fire, Steuer was cast in the 1994 comedy film Little Giants. He co-starred alongside 13-year-old Sam Horrigan. Horrigan replaced Steuer in the role of Quentin Kelly after Steuer left Grace Under Fire.[4]\n\nCareer after acting [ edit ]\n\nSteuer eventually moved to Denver, Colorado. In 2003,[5] he and several other local musicians formed the glam punk band Kill City Thrillers. Steuer performed as lead singer for the band under the name Jonny P. Jewels. Within a few months, the band changed its name to Soda Pop Kids, and about 2005[6] the band and most of its members moved to Portland, Oregon. The band dissolved in November 2009.[7]\n\nIn March 2015, after several years working as a bartender and server, Steuer partnered with chef Sean Sigmon to open Harvest at the Bindery, a vegan restaurant located in Portland.[8]\n\nDeath [ edit ]\n\nSteuer died from a self-inflicted gunshot wound on January 1, 2018, aged 33, in Portland, Oregon.[9][10] Upon Steuer's death, the restaurant closed permanently.[11]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 1990 By Dawn's Early Light Timmy Tyler Television film 1991 Late for Dinner Little Frank 1993 When Love Kills: The Seduction of John Hearn Travis Television film 1994 Little Giants Johnny Vennaro\n\nTelevision [ edit ]\n\nReferences [ edit ]\n\nNotes\n\n^ [2] He replaced actor Noah Segan , who played Quentin in the pilot.\n\nCitations", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jon_Paul_Steuer", "title": "Jon Paul Steuer", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}