{"url": "https://www.cosmopolitan.com/uk/entertainment/a11646661/chris-pratt-anna-faris-relationship-timeline/", "text": "8th November 2018: Chris Pratt and Anna Faris agree to live no further than five miles away from each other for the sake of their six-year-old son, Jack.\n\nAs part of their divorce settlement, in a deal approved by a private judge, the pair agree to do this for roughly five years, according to an article by TMZ.\n\nHere's a detailed timeline of the rest of their relationship, from growing up 20 minutes from each other, to their split in 2017.\n\n1970s and 1980s: Chris and Anna grew up just 20 minutes from each other in Washington state.\n\nmy amazing mom teaching me to swim-@MomCBS pic.twitter.com/LgEsJJO4SL — Anna Faris (@AnnaKFaris) October 10, 2015\n\nBut they never actually met until they starred in a film together.\n\n2007: Chris, 28, and 30-year-old Anna meet for the first time when they star in the comedy Take Me Home Tonight. Look – they get engaged in the trailer!\n\nChris says he knew she was 'The One' immediately. But annoyingly she was married to actor Ben Indra at the time.\n\n“I knew I wanted to marry her pretty soon [after I met her,]” he told PEOPLE. “It took a while for me to admit it, because it would be crazy to be like, ‘I want to marry you’ the first day I met her. But I could have!”\n\nChris and Anna in 2008 Getty Images\n\nHe added in an interview with Elle, \"We were friends first, but she left her husband at the end of the movie, and we started dating when we were back in LA. So we were friends, and I was there for her. And we had just played love interests, so we had this tight bond spending so much time and spending nights in Phoenix, but we never crossed the line. But we were, I think, developing feelings for each other at the time, you know? The day that she told me she was leaving her husband, I knew that I was going to marry her.\"\n\nAnna and Ben split at the end of 2007, and are officially divorced in 2008.\n\nAnna and Ben Getty Images\n\n2008: Later on in 2008, the couple get engaged, and before they’re even married, they start wearing wedding rings. Chris said, “I just kind of wanted one. She got one and I was like, ‘I want one!’”\n\n2009: Parks And Recreation's first episode airs, and everyone falls in love with Chris' character Andy.\n\n9th July 2009: The couple tie the knot in a beautiful ceremony in Bali.\n\nMay 2012: Chris and Anna announce that they are expecting their first child.\n\nGetty Images\n\nAugust 2012: They welcome their son Jack. He arrives nine weeks early, and weighs just 3lb 12oz when he’s born.\n\n2013: Chris is so busy working on Jurassic World and Guardians Of The Galaxy that he only sees Jack twice in six months. He says, “From his seventh month to his 13th month, I saw him twice. It’s tough. Anna told me his first sentence was ‘Dada’s working.”’ Pause. “I wonder how old he’s going to be when his sentence is ‘Dada needs to get a job.”’\n\n2015: Anna opens up for the first time about rumours of Chris’ infidelity. She says, \"I had always kind of believed that part of the rumours of celebrity couples were sort of true because they had never been part of my life. I was like, 'Oh, maybe there's a kernel of truth to that.' It's been a little devastating because for us, it's like, 'What the heck?'\n\n“This has been blindsiding to us. We have an incredible relationship. It has been weirdly stinging.”\n\n2016: Chris talks about the couple struggling with the jealousy they both feel when the other one films a sex scene.\n\nGetty Images\n\n“We have an understanding of what we do for a living, and I think that if I was married to somebody who was, like a schoolteacher or a different job, maybe it’d be a little harder for them to comprehend what exactly goes down and the sacrifices you have to make.\"\n\nThe same year, Anna opens up again about how she is affected by rumours that Chris has cheated on her.\n\n“It made me feel incredibly insecure,' she told Isla Fisher on her own podcast, Anna Faris Is Unqualified. “Chris and I, we talk about this a lot. We grapple with a lot of the ideas of being a public couple.”\n\nShe says they were tested about a year ago when \"there were some tabloid rumours about strain in our relationship.\"\n\nShe tried to ignore it, but said, \"I just remember feeling so hurt in a way that bothered me, because I didn't want to think of myself as somebody who could be affected by tabloid shit.\"\n\nWhen Isla asks her what hurt the most and made her feel the most vulnerable, Anna explains that \"it was a combination of things.\n\n\"I take pride in how great my relationship is with Chris, but having said that, of course, in this crazy world where he's off doing movies and I'm in LA. raising our child, of course I'm going to feel vulnerable, like any normal human would.\"\n\n19th January 2017: Chris stars alongside Anna in her show Mom.\n\nLet the countdown begin!!! I am appearing in @MomCBS with my real life wife @AnnaKFaris this Thursday the 19th!!! pic.twitter.com/peEidwM4zq — chris pratt (@prattprattpratt) January 17, 2017\n\n4th May 2017: Chris posts a Mother’s Day tribute to Anna on his Instagram page. This is his last post featuring Anna before they announce their split.\n\n23rd June 2017: Anna posts a photo of Chris and Jack, and captions it: “My main men.” This is Anna’s last post on social media about Chris before their separation is announced.\n\n7th August 2017: Chris and Anna announce their separation. They both post statements on their social media.\n\n16th August 2017: Anna breaks her silence, and speaks about her and Chris' split for the first time. In a short statement at the beginning of her podcast, Anna Faris Is Unqualified, she thanks her fans and listeners for having her back, saying:\n\n“Hey dear listeners, I just want to thank you all so much for all the love I’ve been receiving, and I truly love you.”\n\n19th September 2017: Chris has nothing but nice things to say about Anna's Emmy appearance. \"I know she did great,\" Chris stated, via TMZ. \"Anna did an amazing job, man. She rules. Her and Allison, they both looked great. Go watch Mom on CBS.\"\n\nAnna at the Emmys Getty Images\n\n18th October 2017: Two months after the split, Anna maintains, in an interview with People, that they two are still very much part of the other's life. \"We’ll always have each other and be incredible friends.\n\n\"There is still so much laughter in our lives together, and he is so proud of me, still. We watched each other grow, and he still cracks me up all the time. And I think I crack him up—unless he’s a really good actor and great at faking laughter.\"\n\nShe also saw the internet's reaction to the breakup and gets it: \"It’s understandable that people seemed so invested in our happiness together,\" she said. \"All I can say about that is, it’s all true, that we truly adore each other, and we love each other, I think it still comes through.\"\n\n2nd December 2017: Chris officially files for divorce from Anna, citing irreconcilable differences.\n\nTMZ reveals that Anna filed her response to the divorce at the same time, with both parents requesting joint custody of their five-year-old son Jack.\n\n\n\nDivorce documents list the date of split as 13th July, nearly a month before the couple publicly announced their split with a statement on 6th August.\n\n18th April 2018: Chris opens up about the couple's divorce for the first time.\n\n\"Divorce sucks,\" Chris told Entertainment Weekly. \"But at the end of the day, we've got a great kid who's got two parents who love him very much.\n\n\n\n\"And we're finding a way to navigate this while still remaining friends and still being kind to one another. It's not ideal, but yeah, I think both of us are actually probably doing better.\"\n\n\n\nGetty Images\n\n29th August 2018: A year after they called time on their relationship, Chris Pratt and Anna Faris have been spotted on a walk together.\n\nThe former couple were seen on Monday and Tuesday going for walks, according to E!News. On Monday they were with their son Jack in Santa Monica, California, and on Tuesday morning they were together again.\n\nWhether this means anything romantic is on the horizon for them is unclear. Especially as Chris has been seeing Katherine Schwarzenegger since the beginning of the summer. And Anna has been dating cinematographer Michael Barrett since last November.\n\nGetty Images\n\n29th August 2018: A year after they called time on their relationship, Chris Pratt and Anna Faris have been spotted on a walk together.\n\nThe former couple were seen on Monday and Tuesday going for walks, according to E! News. On Monday they were with their son Jack in Santa Monica, California, and on Tuesday morning they were together again.\n\n\n\nWhether this means anything romantic is on the horizon for them is unclear. Especially as Chris has been seeing Katherine Schwarzenegger since the beginning of the summer. And Anna has been dating cinematographer Michael Barrett since last November.\n\nFollow Anna on Twitter.\n\n", "images": ["https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x1024/landscape_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x1024/landscape_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg?resize=1200:*", "keywords": [], "authors": ["Anna Lewis", "News Editor", "Anna Lewis Is The News Editor At Delish Uk", "Which Means She S Always Either Writing About Food", "Cooking Food Or Eating Food."], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a11646661/chris-pratt-anna-faris-relationship-timeline/", "title": "Chris Pratt and Anna Faris: a timeline of their relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Here's why Chris Pratt and Anna Faris agreed to live no further than five miles away from each other", "description": "Plus, a detailed timeline of their relationship", "url": "https://www.cosmopolitan.com/uk/entertainment/a11646661/chris-pratt-anna-faris-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x1024/landscape_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2018-11-08 04:35:20", "published_time": "2018-11-08 04:34:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x1024/landscape_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg?resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Chris Pratt and Anna Faris: a timeline of their relationship", "description": "From growing up 20 minutes from each other, to their recent split - here's a timeline of Chris Pratt and Anna Faris' relationship", "keywords": "chris pratt, anna faris, chris pratt anna faris, chris pratt anna faris split, chris pratt anna faris divorce, chris pratt anna faris separation, chris pratt anna faris instagram, chris pratt anna faris twitter, chris pratt anna faris son, chris pratt anna faris son jack, chris pratt anna faris statement, chris pratt instagram, chris pratt twitter, chris pratt facebook, anna faris instagram, anna faris twitter, anna faris facebook, chris pratt anna faris married, chris pratt anna faris marriage, chris pratt anna faris realationship, chris pratt anna faris relationship timeline, chris pratt anna faris timeline, chris pratt anna faris engaged,chris pratt anna faris propose", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x2048/square_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment", "sailthru.date": "2018-11-08T16:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x1024/landscape_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/cosmouk.cdnds.net/15/24/2048x2048/square_nrm_1433937221-chris-pratt-anna-faris-pictures-9.jpg", "sailthru.socialtitle": "Here's why Chris Pratt and Anna Faris agreed to live no further than five miles away from each other", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1541622840.0, "source": "https://www.cosmopolitan.com", "summary": ""}