{"url": "https://heavy.com/entertainment/2018/03/justine-skye-instagram-debut-album-age/", "text": "Justine Skye is one of the most prominent young artists of today. The 22-year-old is an actress, singer, songwriter, and model, and has already found plenty of success in the music biz.\n\nSkye is a Brooklyn native and grew up with a mother who was a music attorney. Both her parents are of Jamaican descent. Sometimes referred to as the Purple Unicorn, Skye is known for her signature purple hair, which she explains has “really has defined who I am.”\n\nRead on to learn more about the Instagram star and artist.\n\n1. Her Youtube Cover of Drake’s ‘Headlines’ Has over 2 Million Views\n\nJustine Skye – Don’t Think About ItDon’t Think About It” by Justine Skye is available everywhere now: https://jskye.me/dontthinkaboutit Justine Skye’s debut album ULTRAVIOLET is available to pre-order now: https://jskye.me/ultraviolet Directors: Laurieann Gibson & Life Garland Executive Producer: Life Garland & Michelle Ramjee Producers: Michelle Ramjee & Jamar Hawkins Director of Photography: Jason Cowan Editor/Post: Life Garland/RainySky Post Production Company: RainySky Films Follow Justine Skye: Instagram: http://instagram.com/justineskye Twitter: http://twitter.com/justineskye Facebook: http://Facebook.com/justineskye Tumblr: http://justineskye.tumblr.com Music video by Justine Skye performing Don’t Think About It. © 2017 Roc Nation Records, LLC http://vevo.ly/TiOqcG 2017-12-08T05:00:04.000Z\n\nSkye’s cover of “Headlines” by Drake has over an impressive 2 million views.\n\nAsked by Wonderland Magazine what her sound in five words would be, Skye says, “Fun, fresh, bold, honest, alive.”\n\nThe artist has worked hard for her success and discussed the energy that goes into being an “It” girl in a recent interview with E! Online. “I work out with my trainer like 4 to 5 times a week,” she tells E!. “I do 45 minutes of cardio, then we do dynamics and end with some weight training and abs work outs.”\n\nAnother thing you need to be an It Girl? Skye says self-motivation is key. “Sometimes I’ll listen to my own music to get me motivated,” Skye shares. And while pushing your boundaries may be uncomfortable, Skye believes it’s also necessary if you want to become an It Girl.\n\n2. She Was Signed to Roc Nation in 2016\n\nIn 2013, Justine signed with Atlantic Records. Three years later, she switched over to Roc Nation and Republic Records. “I had a record deal at Atlantic prior to my deal with Roc Nation, Atlantic and I decided to go our separate ways and Roc Nation showed a lot of interest, I met with their team and the rest is history sort of speak,” she says.\n\nIn 2016, Skye spoke on Hot 97 about transitioning to Roc Nation sayng, “Honestly, there’s nowhere I’d rather be. I’m from Brooklyn. To be signed to Jay Z’s label, that’s huge. That’s a huge accomplishment.” She goes on to say that Roc Nation really feels like her family, now.\n\nWhen Fader asked her how she said music helped her blossom, she responded, “Well, the Internet and music. There’s a space that some people get stuck in where all you have is the Internet – if your social medias got deleted today, you wouldn’t have anything. There are some people that are like that, and it’s cool because they benefit from it but if it was gone what is your job occupation? What do you do?”\n\n3. She Was Home Schooled\n\nGrowing up, Skye was very shy. Her Roc Nation bio states that it wasn’t until she attended a BMI panel that she started to come out of her shell.\n\nAccording to The Fader, Justine decided to be homeschooled at 16. She focused many of her teen years on her Tumblr page, where, in the words of The Fader, “her purple-tinted hair, brightly hued lipstick, and cool girl persona earned her thousands of notes and a massive following.”\n\nSkye has been printed on the covers of Vogue, V Magazine, Billboard, Fader, and more.\n\n4. She Has Made a Song with Tyga\n\nJustine Skye ft Tyga – Collide (Official Music Video)Justine Skye ft Tyga – \"Collide\" (Music Video) Produced by DJ Mustard Download on iTunes: http://smarturl.it/JSCollide Follow: http://www.twitter.com/justineskye http://instagram.com/justineskye http://www.facebook.com/justineskyefans 2014-10-08T21:56:22.000Z\n\nIn 2014, Justine made a song called “Collide” that featured Tyga.\n\nShe’s worked with a number of other successful artists, too. In 2015, she performed at an event called TIDAL10x20 which was created by Tommy Hilfiger and Jay Z.\n\n“I like to say I make A1 music, which is music that feels good,” Skye tells Paper Magazine.\n\nWhile speaking on Hot 97, Justine mentioned that she lives in NYC, but splits her time between LA and the Big Apple. “I go back and forth.” She also spilled the beans on her romantic life, saying she isn’t dating right now, but is interested in doing so.\n\n5. She Released Her Debut Album in January\n\nhttps://www.instagram.com/p/BgUmj-DHEqt/?hl=en\n\nIn January, Skye released her debut album, “Ultraviolet”, on Apple Music.\n\nWhy the name, “Ultraviolet”? Not only is it the color of Skye’s hair, but she says it’s how she feels right now. “It’s just extremely powerful and I feel like that’s the point that I reached, of power and confidence.”\n\nAccording to Harpers Bazaar, Skye pulled together an impressive team to help with her songs. Hit-Boy (a frequent collaborator with Beyonce and Kanye West) produced the song, “Lil’ Boy”.\n\nAt first, Skye explains, the album did not feel cohesive enough. “When we first started working on the album, we were just trying to get songs done.” But the music was missing a common theme. “So we scrapped everything and started over from scratch. We scrambled,” the Brooklyn native says. “We’re like, ‘Oh my God, what do we do?’ Everyone’s freaking out, mad at me. Like, ‘What do you mean, Justine? We just spent all this money on this!’ And I’m like, ‘It’s just not right! I don’t feel good about it!’ So we started over. They trusted me and they let me do my thing—and we did it.”", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=20567959cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://heavyeditorial.files.wordpress.com/2018/03/screen-shot-2018-03-16-at-10-02-10-pm-e1521252170772.png?w=556", "https://certify.alexametrics.com/atrk.gif?account=lfktn1QolK10vg", "https://heavyeditorial.files.wordpress.com/2018/03/screen-shot-2018-03-16-at-10-29-21-pm.png?w=780", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://1.gravatar.com/avatar/d0e679621edc4bd4e5d0567c3aab2d2b?s=71&d=https%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D71&r=PG"], "top_img": "https://heavyeditorial.files.wordpress.com/2018/03/screen-shot-2018-03-16-at-10-02-10-pm-e1521252170772.png?w=556", "keywords": [], "authors": ["S.M. Walsh"], "canonical_link": "https://heavy.com/entertainment/2018/03/justine-skye-instagram-debut-album-age/", "title": "Justine Skye: 5 Fast Facts You Need to Know", "meta_data": {"google-site-verification": "nfPVut3DNEWv3BaV0stQ8yOV3TeBg_TWFdQzQYaG8Qs", "robots": "noodp, noydir", "HandheldFriendly": "True", "MobileOptimized": 360, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#121212", "theme-color": "#121212", "description": "Justine Skye is a singer, songwriter, actress, and model, and has over 1.3 million Instagram followers. Learn more about Skye here.", "news_keywords": "Justine Skye age, Justine Skye good love, Justine Skye twitter, Justine Skye instagram, Justine Skye lifetime", "keywords": "justine skye age, justine skye good love, justine skye twitter, justine skye instagram, justine skye lifetime", "msvalidate.01": "D36F6DC077CF4906C4E074037A94917B", "generator": "WordPress.com", "author": "S.M. Walsh", "twitter": {"url": "https://heavy.com/entertainment/2018/03/justine-skye-instagram-debut-album-age", "card": "summary", "site": "@heavysan", "creator": "@heavysan"}, "fb": {"admins": 1041016861, "app_id": 1103740676351644}, "article": {"publisher": "https://www.facebook.com/heavycom", "published_time": "2018-03-17T02:04:17+00:00", "modified_time": "2018-03-17T03:59:17+00:00", "author": "https://heavy.com/author/shannonwalsh22/", "section": "Entertainment", "tag": "Lifetime"}, "og": {"image": {"identifier": "https://heavyeditorial.files.wordpress.com/2018/03/screen-shot-2018-03-16-at-10-02-10-pm-e1521252170772.png", "width": 556, "height": 313}, "site_name": "Heavy.com", "type": "article", "locale": "en_US", "url": "https://heavy.com/entertainment/2018/03/justine-skye-instagram-debut-album-age/", "title": "Justine Skye: 5 Fast Facts You Need to Know", "description": "Justine Skye is a singer, songwriter, actress, and model, and has over 1.3 million Instagram followers. Learn more about Skye here."}, "application-name": "Heavy.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.", "msapplication-task": "name=Subscribe;action-uri=https://heavy.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/6e68a7d5b8fce58735ab84f887ee5981?s=16", "ir-site-verification-token": 268982007}, "movies": [], "publish_date": 1521252257.0, "source": "https://heavy.com", "summary": ""}