{"url": "https://www.foxnews.com/entertainment/blac-chyna-and-rob-kardashian-drama-timeline-of-events", "text": "Rob Kardashian and Blac Chyna's relationship drama has escalated to new heights.\n\nChyna was granted a temporary restraining order on Monday, days after Kardashian posted explicit photos of her and accused her of cheating and stealing money from him. He claimed Chyna had their daughter, 7-month-old Dream, out of spite and her alleged drug addiction and alcoholism inhibited her from being a suitable mother.\n\nKardashian, of \"Keeping Up with The Kardashians\" reality show fame, took to social media to list a series of issues with his former fiancée Chyna, who operates a make-up line called \"Lashed by Blac Chyna.\"\n\nBLAC CHYNA, ROB KARDASHIAN AT RISK OF LOSING CUSTODY OF DAUGHTER DREAM?\n\nChyna, with her lawyer Lisa Bloom, said in her first on-camera interview Monday that she felt \"betrayed\" by Kardashian and she was seeking legal actions because though her ex doesn't respect her, he has \"to respect the law.\"\n\nThe formerly engaged couple have had plenty of break ups, make ups and social media rants. Here's a timeline of their relationship.\n\nJanuary 2016: Kardashian and Chyna begin dating\n\nThe couple's relationship was made public after Chyna posted a now-deleted photo on Instagram of her cuddling in Kardashian's arms. But even then there was drama -- especially with the Kardashian clan. At the time, Kylie Jenner was dating rapper Tyga, who used to date Chyna and is the father to their son King.\n\nChyna was also Kim Kardashian's former friend, but the relationship fell apart when Jenner began dating Tyga.\n\nFebruary and March 2016: Kardashian aims for healthier lifestyle, break-up rumors surface\n\nChyna fueled engagement rumors after posting a photo of a massive diamond ring on her ring finger. Those rumors were quickly squashed, but the relationship seemed to be a turning point for Rob Kardashian. He remained mostly out of the spotlight for years after battling depression and weight gain.\n\nKardashian, however, appeared to be starting a healthier lifestyle, People Magazine reported.\n\n\"Rob has fallen hard for Blac Chyna. She makes him super happy and this is the first time that he’s felt so optimistic about life in years,\" a source told the magazine.\n\nBut a month later, Kardashian sparked break-up rumors after deleting all photos with Chyna from his Instagram. Chyna also posted a meme with the caption: \"When you just get out of a relationship & your hoe friend welcomes you back into the World of Hoe.\"\n\nChyna and Kardashian, though, were then seen taking trips and making club appearances together.\n\nApril 2016: The couple announces their engagement\n\nAmber Rose, Chyna's best friend, confirmed the couple's engagement on Instagram.\n\n\"Congratulations to my Family @blacchyna and @robkardashian!!! 💍💍💍Pease don't let nothing or no one tear u guys apart! I never seen my sis so happy and I couldn't be more happy for her! Sometimes we find love in the strangest places 😉 Lol God Bless you 2! Now let's get this wedding together so y'all can start making some babies 👼🏽👼🏽👼🏽👼🏽 #TrueLove #putaringonitsouknowitsreal,\" Rose wrote in her post.\n\nThe ring seemed to be the same one Chyna was seen wearing in February.\n\nMay 2016: Chyna announces she is pregnant\n\nChyna announced she was pregnant with the couple's first child in an Instagram post. The photo showed her in \"emoji\" form wrapping her hands around her belly.\n\nSummer 2016: Another break-up?\n\nBreak-up rumors continued to swirl. In July, Kardashian deleted all his photos and unfollowed Chyna with no explanation. It was later revealed in their E! reality show, \"Rob & Chyna,\" which aired from September to December 2016, that Kardashian and Chyna got into an \"explosive fight.\"\n\nBy September, the pair were again spotted going on date nights and trying to work out their relationship. Chyna was about seven months pregnant.\n\nNovember 2016: Dream Renee Kardashian is born\n\nThe couple welcomed their daughter to the world on Nov. 10. This is the first child for Kardashian and the second for Chyna.\n\nDecember 2016: Another rocky moment\n\nOn December 17, Kardashian posted videos to Snapchat showing that Chyna had moved out of their home and had taken Dream with her. The videos reportedly showed Kardashian crying while filming Dream's empty nursery.\n\nAccording to Us Weekly, this was shortly after personal messages emerged from Chyna in which she allegedly called Kardashian \"fat\" and \"lazy.\" She also claimed that she would give Kardashian a year more of their relationship, before ultimately leaving him.\n\nOn December 23, less than a week after their split, the pair posted a Snapchat picture celebrating the holidays.\n\nBut just days later on Christmas, Chyna was not invited to Kardashian family Christmas celebrations. Kardashian matriarch Kris Jenner didn't include a stocking for Chyna in the Kardashian-Jenner clan lineup -- but did include one for her son King, and daughter Dream.\n\nJanuary 2017: Couple's first public appearance since Dream\n\nChyna and Kardashian made their first public appearance as a couple since the birth of Dream. The two visited a nightclub in New York City, according to E! News.\n\nMarch 2017: Reality show put on hold, couple reportedly split\n\nKardashian and Chyna reportedly split in early March and subsequently called off a second season of their show, \"Rob & Chyna,\" even though the show had been renewed to continue.\n\nA source at the time of their March break-up told Entertainment Tonight that the couple was working on co-parenting their daughter.\n\n\"[Rob and Chyna] realize Dream will connect them for life, and it’s not worth it for them to fight and get dramatic about their breakup,\" the source said. \"They’re forever connected by that beautiful girl, so there can’t be any bad blood.\"\n\nJuly 5, 2017: Kardashian posts explicit photos and posts of Chyna\n\nKardashian took to Instagram and accused Chyna of cheating, becoming an alcoholic and drug addict and exploiting him for his money. He posted a series of graphic photos Chyna allegedly sent to him.\n\n\"You will never see Dream again unless you stop the alcohol and drugs and cocaine and X and E,\" Kardashian wrote in one post. \"When was the last time you realized your daughter [has] been with me instead of that crazy house that you bring men in and out[?] I never been this disrespected in my life by a woman. A woman I just paid 16K rent and Ferrari I just bought and lambo and 400K in jewelry. Damn.\"\n\nHe continued with screenshots of text conversations allegedly between him and \"one of the men Chyna [has] been f-----g in the bed that we lay in with our baby under the roof that I pay for.\"\n\n“Everyone wonders how Chyna lost all that weight after the baby and she lies to everyone, but no I’m such [a] great husband that on our anniversary I paid 100K to do this surgery to get all everything fixed as much as they could,\" another post read.\n\nHis Instagram was taken down later that day, but he continued his rant on Twitter, alleging that Chyna had a baby with him \"out of spite\" to her ex, Tyga.\n\nJuly 7, 2017: Chyna hires lawyer, expected to obtain restraining order\n\nChyna hired lawyer Lisa Bloom, who also represented Kathy Griffin in the Donald Trump beheading photo scandal. Bloom announced on Twitter she gave Kardashian a \"notice\" and that she and her client will be \"in court Monday seeking restraining orders against\" Kardashian.\n\nBloom released a statement saying she is \"proud to represent Blac Chyna as she stands up for her rights as a woman and as a mother against\" Kardashian.\n\n\"Mr. Kardashian, you are now on notice: revenge porn is illegal. Cyberbullying your ex is harassment.\"\n\nTMZ also obtained legal documents where Chyna said Kardashian had been violent to her in the past. In one instance, Chyna claimed Kardashian shoved her to the ground, \"aggressively shoving me by the side of my arm and hitting me on the thigh.\"\n\nChyna claimed she hasn't been with Kardashian since last December and that \"Rob has been violent with me in the past and I am afraid to be around him.\"\n\nJuly 9: Rapper T.I. responds to Chyna-Kardashian drama\n\nT.I. is standing up after being called out in the Kardashian drama.\n\n\"Don't tell women's business. That's bad,\" T.I. told TMZ at Los Angeles International Airport on Saturday.\n\n\"It's a very very bad, it's poor character. It's flawed. If a women entrusts you man, and confide in you man, you don't ever let that — you don't do that. You don't do that. You know what I'm saying? Our secrets are sacred. We don't do that. That's a whole next level of f--kboi s--t,\" he continued.\n\nKardashian accused Chyna of having a threesome with T.I. and his wife Tameka \"Tiny Harris\" after the rapper reportedly commented on one of the reality TV star's post.\n\n“Why bring ya business to IG tho? Look, You got worked bro….but at least keep it to yourself, you letting the world know you a duck. I mean a BIG DUCK, a mighty duck, Ronald McDonald the Duck, Scrooge McDuck, Howard the Druck, Huey Dewy & Lewie… save the #DuckTales Just hold this L, kiss ya kid & cut ya losses& move on… u got no moves bro,\" T.I. wrote in the comment that Kardashian took a screenshot and reposted.\n\n\"Don’t speak on my daughter when u having threesomes with young Chy and Tiny ::: and I put that on my daughters life since u wanna speak on my daughter,,, damn shame. Chyna told me everything about your threesomes with you and her and Tiny. U got no moves bro ;;; Correction ::: TI paid Chyna to have sex with Tiny and him,\" Kardashian wrote in response last week.\n\nKardashian has kept mostly quiet since his social media rant.\n\nJuly 10: Chyna granted temporary restraining order; Kardashian's lawyer says his client 'regrets' social media rant\n\nA judge granted Chyna a temporary restraining order against Kardashian, according to E! News.\n\nKardashian's lawyers, Robert Shapiro and Sam Klein, appeared on the reality star's behalf. Shapiro told TMZ earlier in the day that Kardashian \"regrets\" his actions and said it was a \"spontaneous reaction\" to incidents.\n\nShapiro added \"Rob's only concern is for the well-being of baby Dream.\"\n\nIn an interview with ABC's \"Good Morning America,\" Chyna said she was \"devastated\" when she saw Kardashian had posted the nude photos she sent him privately.\n\n\"I was devastated, of course. I’m like, 'How could somebody, like, post these pictures of me?'\" Chyna said in her first on-camera interview. \"This is a person that I trusted. I just felt betrayed.\"\n\nChyna claimed she sent Kardashian the video of her with another man to tell him she had moved on from their relationship after he refused to leave her alone.\n\n\"If somebody keeps poking at you … you’re eventually gonna pop,” she said. \"[I thought,] maybe if I send this video to him, maybe he’ll just leave me alone.\"\n\nChyna defended herself from Kardashian's allegations that she became romantic with him for revenge.\n\n\"That’s not even my character. I see all these things on the Internet and I don’t even address it,\" she said. \"I was already Blac Chyna before the Kardashians.\"\n\nJuly 11: Chyna's lawyer threatens Chyna's ex-boyfriend with legal action\n\nChyna's ex-boyfriend, rapper Ferrari, whose real name is Dejanel Carter, reportedly posted now-deleted photos of himself and Chyna in bed to Instagram.\n\nFerrari was the man Chyna allegedly cheated on Kardashian with, according to his accusations posted to Instagram July 5.\n\nE! News reported that Bloom sent a letter to Ferrari on July 7 acknowledging they have \"become aware\" Ferrari has photos and may continue to post them.\n\nBloom threatened Ferrari with California's revenge-porn law and made it clear he doesn't have permission to distribute any sexually explicit photos of Chyna.", "images": ["https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/348/196/elvispresleyreuters.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/meghan-markle-red.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/07/348/196/em-rata-getty.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/AP20110019543582.jpg?ve=1&tl=1", "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rob-kardashian-blac-chyna-nbc.jpg", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/08/348/196/liz-hurley.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/270/152/Brad-Paisley.jpg?ve=1&tl=1", "https://a57.foxnews.com/a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/640/320/1862/1048/rob-kardashian-blac-chyna-nbc.jpg?ve=1&tl=1?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Lorenzo-twitter.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/lauren-sanchez-jeff-bezos.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/nickcordero.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Screen-Shot-2020-03-17-at-9.39.14-AM.png?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/270/152/PattonOswalt1.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/340/340/i-6nn3jxm-l.jpg?ve=1&tl=1"], "top_img": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rob-kardashian-blac-chyna-nbc.jpg", "keywords": [], "authors": ["Katherine Lam", "Katherine Lam Is A Breaking", "Trending News Digital Producer For Fox News. Follow Her On Twitter At"], "canonical_link": "https://www.foxnews.com/entertainment/blac-chyna-and-rob-kardashian-drama-timeline-of-events", "title": "Blac Chyna and Rob Kardashian drama: Timeline of events", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0, initial-scale=1.0", "description": "Blac Chyna was granted a temporary restraining order against Rob Kardashian.", "prism.channel": "fnc", "prism.section": "entertainment", "prism.aggregationType": "subsection", "pagetype": "article", "content-creator": "tiger", "dc.creator": "Katherine Lam", "dc.title": "Blac Chyna and Rob Kardashian drama: Timeline of events", "dcterms.abstract": "Blac Chyna was granted a temporary restraining order against Rob Kardashian.", "dc.type": "Text.Article", "dc.description": "Blac Chyna was granted a temporary restraining order against Rob Kardashian.", "dc.language": "en-US", "dc.publisher": "Fox News", "dc.format": "text/html", "dc.identifier": "urn:uri:base64:7dba186d-beff-57d8-9689-8c6d0e44efed", "dc.source": "Fox News", "dc.date": "2017-07-07", "dcterms.created": "2017-07-07T13:44:43-04:00", "dcterms.modified": "2017-09-27T09:05:08-04:00", "og": {"title": "Blac Chyna and Rob Kardashian drama: Timeline of events", "description": "Blac Chyna was granted a temporary restraining order against Rob Kardashian.", "type": "article", "image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rob-kardashian-blac-chyna-nbc.jpg", "url": "https://www.foxnews.com/entertainment/blac-chyna-and-rob-kardashian-drama-timeline-of-events", "site_name": "Fox News"}, "robots": "noarchive, noodp", "twitter": {"card": "summary_large_image", "site": "@foxnews", "title": "Blac Chyna and Rob Kardashian drama: Timeline of events", "description": "Blac Chyna was granted a temporary restraining order against Rob Kardashian.", "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/1024/512/rob-kardashian-blac-chyna-nbc.jpg?ve=1&tl=1", "url": "https://www.foxnews.com/entertainment/blac-chyna-and-rob-kardashian-drama-timeline-of-events"}, "fb": {"app_id": 116027085089150}, "article": {"opinion": "false"}, "classification": "/FOX NEWS/ENTERTAINMENT/EVENTS/Couples,/FOX NEWS/ENTERTAINMENT,/FOX NEWS/ENTERTAINMENT/GENRES/Reality", "classification-isa": "couples,entertainment,reality"}, "movies": [], "publish_date": null, "source": "https://www.foxnews.com", "summary": ""}