{"url": "www.newidea.com.au/palace-confirms-meghan-markle-kate-middleton-pregnant", "text": "Getty\n\nAccording to the publication bombshell report, both duchesses, 36, are preparing to raise the royal cousins as part of 'one big, happy family.'\n\nAn insider said, 'Kate and Meghan bonded over the men they married. Now they're bonding over being pregnant together.'\n\nWhile the pregnancies are the subject of plenty of palace buzz, In Touch reveals the duchesses have only shared the news with close family and friends.\n\nFor Meghan, the US publication claims the pregnancy is not just a huge joy but an 'enormous relief.'\n\n'She was a nervous wreck about conceiving,' a palace insider says, not only because of her age but 'because it didn't happen with her first husband,' producer Trevor Engelson, from whom she split in 2013 after two years of marriage and nine years as a couple.\n\nIn Touch\n\nThe pressure to give husband, Prince Harry, children 'felt like a huge weight on Meghan's shoulders,' says the source.\n\n'Everyone expected her to get pregnant immediately.'\n\nMeanwhile Prince William, 36, was 'initially shocked when Kate told him he's going to be a dad again', but now he sees it as a 'happy surprise.'\n\n'He and Kate have always wanted four kids,' the source tells.\n\nAnd this time around, adds the source, Kate gets to share her pregnancy journey with not only her young sister Pippa, 34, who is due with her first child in a few months, but her new sister-in-law, too.\n\nRelated: Confirmed: Prince Harry and Meghan Markle - 'Yes, it's twins!'\n\nGetty\n\nRelated: Kate Middleton and Prince William expecting fourth child\n\nRelated: Meghan and Harry's twin joy\n\nThe new duchesses are reportedly loving sharing their journey together.\n\nIn Touch reveals Kate 'has penned a pregnancy food list for Meghan that's full of nutritious things to eat and is advising her on how to balance motherhood with life as a royal,' says the source.\n\nFitness enthusiast Meghan, whose mother Doria Ragland is a yoga instructor, is returning the favour by teaching Kate pregnancy yoga.\n\nThe publication adds that the two pregnant women are happily letting their husbands dote on them.\n\n'William is doing his best to help Kate relax by being a hands-on father to George, Louis and Charlotte,' says the source.\n\n'He brings Kate tea and cookies in bed,' including lavender biscuits which are known to help with nausea.\n\nGetty\n\nKate, adds the source, is 'convinced she's having another girl because she's having the same cravings for sweets that she did when she was pregnant with Charlotte.'\n\nMeghan is hoping for one of each - a boy and a girl - the insider tells In Touch.\n\n'This is a dream come true for both couples.'\n\nThe royal family is yet to respond to In Touch's report.\n\nThe latest edition of New Idea Royals explores what REALLY happened at Prince Louis' royal christening.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/30120/untitled-design-10.png", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/30120/untitled-design-10.png", "keywords": [], "authors": ["Ben Simons", "Ben Simons Is A Digital Content Editor At New Idea Magazine. As A Self-Professed Celeb Expert", "Ben Always Finds The Best Scoop Of The Day."], "canonical_link": "https://www.newidea.com.au/palace-confirms-meghan-markle-kate-middleton-pregnant", "title": "‘Palace confirms: Meghan Markle and Kate Middleton both pregnant’", "meta_data": {"language": "en-us", "description": "A sensational report has claimed that Meghan Markle and Kate Middleton are expecting babies.", "news_keywords": "Meghan Markle, Kate Middleton, Meghan Markle pregnant, Kate Middleton pregnant, Meghan Markle and Kate Middleton both pregnant, pregnancy, royal pregnancy, meghan markle pregnant, kate middleton pregnant, prince william, prince harry, meghan and harry expecting a baby, kate and william expecting a baby, royal baby announcement, royal babies, royal baby, royals, the royals, royal family, royal family latest, royal family babies, royal baby news, meghan and kate pregnant, kate and meghan pregnant, queen elizabeth, Camilla Parker Bowles, prince charles, catherine duchess of cambridge, is kate middleton pregnant again, how many kids does kate middleton have", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/palace-confirms-meghan-markle-kate-middleton-pregnant", "title": "‘Palace confirms: Meghan and Kate both pregnant’", "description": "A sensational report has claimed that Meghan Markle and Kate Middleton are expecting babies.", "image": {"identifier": "http://www.newidea.com.au/media/30120/untitled-design-10.png", "width": 1500, "height": 800}}, "twitter": {"title": "‘Palace confirms: Meghan Markle and Kate Middleton both pregnant’", "description": "A sensational report has claimed that Meghan Markle and Kate Middleton are expecting babies.", "image": "http://www.newidea.com.au/media/30120/untitled-design-10.png", "url": "https://www.newidea.com.au/palace-confirms-meghan-markle-kate-middleton-pregnant"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1531361425.221, "source": "http://www.newidea.com.au", "summary": ""}