{"url": "www.theguardian.com/notesandqueries/query/0,5753,-14156,00.html", "text": "YESTERYEAR\n\n\n\nIs it true that Prince Charles would need to change his name if he ever became King of England, due to the misfortunes of previous King Charles'? Rob Moseley, Loughborough Uni Charles II spent much of his time consorting with a very attractive, extremely buxom, young lady called Nell Gwynne. Maybe our present Charles would welcome such misfortune! David Vickery, Croydon, UK My understanding is that upon accession the Monarch is entitled to be crowned as, and therefore known by, any name (s)he chooses. Hence King George VI (real name, I think, Albert, or Bertie), similarly King Edward VII's real name was I think Albert and King George V's real name was David. The last one does sound a bit unlikely, but I seem to remember reading it somewhere. Similarly, since the death of big bad much maligned Richard III, no-one seems to have been particularly keen to use the name Richard. On the other hand, each royal house has tended to have its preferred first names, so maybe we shouldn't read too much into these things. To answer the question, I don't think Prince Charles would have to change his name but he could if he wanted. Any suggestions for possible names? Cathy, London, UK He wouldn't need to but he could choose to. His full name is Charles Philip Arthur George and he can use whichever one he wants to. Since the last 2 Charleses weren't the greatest kings we've ever had he has said he will be styled George VII should he become King. Matt Stephenson, London, UK Edward VII was christened Albert Edward; George V was George Frederick Ernest Albert; Edward VIII was Edward Albert Christian George Andrew Patrick David but he was known as David (wouldn't you want to be with a name like that); George VI was Albert Frederick Arthur George and known as Bertie. As for Charles, what about King Arthur (II)? Graham Ralph, Gravesend, UK 'King Ian' has a nice ring to it... Lara, Bath The answer to the question is no. Charles Philip Arthur George has speculated that he may use his last given name. But remember, Edward VII and George VI, when christened, were not expected to succeed to the throne, as they had elder brothers, Charles was christened in full expectation that he would one day be king. I can't help hoping he will take Arthur as his regnal name. It would sneak one up on fate, which has denied us three Arthurs already - the heirs of Henry II, Henry VII and Victoria were all called Arthur, but never succeeded to the throne. Quentin Langley, Woking UK Queen Victoria did indeed have a son called Arthur but he was not her eldest son and not her heir. He lived well into adulthood and had children of his own. Susan Deal, Sheffield UK No. He would not be required to adopt a different regnal name but, as Matt Stephenson surmises, he probably would. My understanding is that he is happy enough with Charles as a 'personal' name, but that it too redolent of the accursed House of Stuart to be aceptable for regnal purposes. As for his other given names, his relationship with his father is hardly such that he would want to perpetuate him as King Philip (which anyway would be a bit rich as the son of Queen Elizabeth), and although he is a bit barmy, he is not (here I disagree with Quentin Langley) quite barmy enough to want to be King Arthur: can't we imagine the mick-taking that would arise? Would Camilla be the Lady of the Lake, and who would be his Merlin? That leaves the traditional choice of \"George VII\": boring and conventional - but what do we expect of the Hanoverians? Bernard Cross, Hemel Hempstead England\n\n\n\nAdd your answer\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "images": ["http://image.guardian.co.uk/football/site/Triangle_up.gif", "http://www.theguardian.com/favicon.ico", "http://pix01.revsci.net/E05516/a3/0/0/0/0/0/0/0/0/0/noscript.gif", "http://image.guardian.co.uk/sp.gif", "http://image.guardian.co.uk/film/site/freeserve/shared/1x1-trans.gif", "http://hits.guardian.co.uk/b/ss/guardiangu-global,guardiangu-network/1/H.20.3/82483?ns=guardian&pageName=Guardian+%3a+Is+it+true+that+Prince+Charles+would+need+to+change+his+name+if+he+ever+became+King+of+England%2c+due+to+the+misfortunes+of+previous+King+Charles%27%27%3f&ch=Guardian&c8=&c9=front&c11=Guardian&h2=GU%2fGuardian%2fNotes+and+Queries&c2=GUID:(none)", "http://static.guim.co.uk/static/99201/zones/news/images/logo.gif", "http://image.guardian.co.uk/sys-images/Guardian/Notes_and_Queries/General/1999/09/06/notes_queries_128x128.gif", "http://www.pixunlimited.co.uk/global/black_right_10x8.gif"], "top_img": "http://www.theguardian.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Is it true that Prince Charles would need to change his name if he ever became King of England, due to the misfortunes of previous King Charles''?", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://www.theguardian.com", "summary": ""}