{"url": "www.inquisitr.com/3967677/is-today-billy-bush-begging-to-be-on-dwts-even-willing-to-take-pay-cut/", "text": "UPDATE: 2/13/2017: Billy Bush is officially on the new season of DWTS.\n\nDancing With the Stars is in the process of putting together the list of contestants for the next show, and reportedly, former Today show host Billy Bush wants to do whatever he has to do to be on that list, even if that means taking a pay cut. Since he was fired from Today, Bush has not had a job, and allegedly took a killing on his New York City townhouse he bought when he thought he’d be moving to New York for Today.\n\nDWTS has been the place that stars go to either take a victory lap, or say they are sorry through dance, says the Inquisitr. Billy Bush left Today with many of his co-workers angry with him, after a video was released of him palling around with Donald Trump, talking about grabbing women against their will, and what you can do when you are entitled. Just after his exit, DWTS was showing interest in Bush, but at the time, his agent brushed them off, perhaps assuming that other offers would come rolling in, but they haven’t.\n\n‘Desperate’ Billy Bush Begging To Be Cast On ‘DWTS’ https://t.co/CPQNpIXobq via @radar_online — Wackymoe (@wackymoe) February 10, 2017\n\nRadar Online is saying that “disgraced former Today show host” Billy Bush is desperate to salvage what is left of his career with a spot on DWTS. A production insider associated with DWTS says that Bush is “begging to be on the cast of DWTS Season 24.”\n\nRELATED REPORTS BY INQUISITR\n\nBilly Bush ‘Today Show’ Colleagues Comment On His Suspension\n\nThe Real Reason The ‘Today Show’ And NBC Won’t Be Taking Billy…\n\nBilly Bush Lawyer Says Bush’s Career May Have Ended In 2005 If He…\n\n‘Dancing With The Stars’ Assumes Billy Bush Is Done, Wants Him To…\n\nAnd Billy Bush supposedly is willing to do whatever he needs to do to get a spot on the cast.\n\n“Billy said he would be willing to take a pay cut, and take a sum much lower than the other contestants.”\n\nBecause this woman is all women. Because this woman is my daughter. Because this woman is me. #whyiresist @realDonaldTrump @BillyBush_Real pic.twitter.com/PHtdXdUsfd — LunchLettersFromMom (@Resist_LoveMom) February 9, 2017\n\nBut sources are saying that many of the executives at ABC are having serious problems with allowing Billy Bush to come aboard Season 24 of DWTS. It seems that there are still plenty of people who want nothing to do with him, and think he would be negative for the ratings.\n\n“The higher-ups are tired of having celebs wanting to join DWTS as a way of doing damage control.”\n\nAn example of this would be Ryan Lochte, who signed up for DWTS as a way to say he was sorry for embarrassing the American men’s swim team after lying about an incident at the Rio Olympics.\n\n“A lot of them are also sick of having contestants who want to be cast as a way of reviving their broken career, which is exactly what some believe Billy is trying to do!”\n\nThe Observer says that Billy Bush is due for a win, after losing his job on Today, and reportedly taking a million dollar loss on his Chelsea townhouse. Bush bought the townhouse at 224 West 22nd Street after getting the Today job for $8.8 million, and then tried to relist it for $9 million.\n\nAfter no bites, the price was lowered, and finally, Bush accepted an offer of $7.43 million. The house has now been stripped, and is ready for whatever the new owners plan to do with it. But don’t feel too bad for Bush, because he has some other nice real estate holdings to visit now that he has officially sold his Chelsea place. Bush owns an Encino ranch-estate, and a home in Park City, Utah.\n\n#DWTS 2017 Cast Lineup: Billy Bush Tops List Of 12 Celebs Rumored To Be Joining Season 24 Cast https://t.co/rA2HzMjMA5 pic.twitter.com/xokUMu4xNv — TheScooponess (@TheScooponess) February 8, 2017\n\nDo you think that the producers at DWTS will give Billy Bush one of the positions on Season 24 of the ABC dance competition?\n\n[Featured Image by Craig Barritt/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/02/Is-Billy-Bush-Begging-to-Be-on-DWTS.jpg", "https://secure.gravatar.com/avatar/925dbac2ae40745f9073b6b5bc8d58a5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amy Feinstein"], "canonical_link": "https://www.inquisitr.com/3967677/is-today-billy-bush-begging-to-be-on-dwts-even-willing-to-take-pay-cut/", "title": "Is Billy Bush Begging To Be On ‘DWTS 2017?’ [UPDATE]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}