{"url": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "text": "HBO has lost quite a bit lately, but, to everyone’s surprise, has added some worthwhile compensation: Die Hard, Alien, Aliens, John Cassavetes’ A Woman Under the Influence and S. Craig Zahler’s controversial Dragged Across Concrete, plus Steve James’ iconic documentary Hoop Dreams, to name an ever-carousel-ing few. So, to help make sure you get the most out of your subscription, we’ve chosen our 50 favorite movies available on HBO right now, including Jordan Peele’s Us, John Wick: Chapter 3 and Alita: Battle Angel, three of our top picks for the best movies of 2019.\n\nYou can also check out our guides, some more updated than others, to what’s on other platforms like Netflix, Amazon Prime, Hulu and Redbox, as well as The Best Movies in Theaters. Visit the Paste Movie Guides for all our recommendations.\n\nYear: 1979\n\nDirector: Ridley Scott\n\nStars: Sigourney Weaver, Ian Holm, Yaphet Kotto, John Hurt, Tom Skerritt, Harry Dean Stanton\n\nGenre: Horror, Science Fiction & Fantasy\n\nRotten Tomatoes Score: 97%\n\nRating: R\n\nRuntime: 117 minutes\n\nWatch on HBO\n\n\n\n\n\nConduits, canals and cloaca—Ridley Scott’s ode to claustrophobia leaves little room to breathe, cramming its blue collar archetypes through spaces much too small to sustain any sort of sanity, and much too unforgiving to survive. That Alien can also make Space in its vastness feel as suffocating as a coffin is a testament to Scott’s control as a director (arguably absent from much of his work to follow, including his insistence on ballooning the mythos of this first near-perfect film), as well as to the purity of horror as a genre. Alien, after all, is tension as narrative, violation as a matter of fact. When the crew of the mining spaceship Nostromo is prematurely awakened from cryogenic sleep to attend to a distress call from a seemingly lifeless planetoid, there is no doubt the small cadre of working class grunts and their posh Science Officer Ash (Ian Holm) will discover nothing but mounting, otherworldly doom. Things obviously, iconically, go wrong from there, and as the crew understands both what they’ve brought onto their ship and what their fellow crew members are made of—in one case, literally—a hero emerges from the catastrophe: Ellen Ripley (Sigourney Weaver), the Platonic ideal of the Final Girl who must battle a viscous, phallic grotesque (care of the master of the phallically grotesque, H.R. Giger) and a fellow crew member who’s basically a walking vessel for an upsetting amount of seminal fluid. As Ripley crawls through the ship’s steel organs, between dreams—the film begins with the crew wakening, and ends with a return to sleep—Alien evolves into a psychosexual nightmare, an indictment of the inherently masculine act of colonization and a symbolic treatise on the trauma of assault. In Space, no one can hear you scream. Maybe that’s because no one is listening. —Dom Sinacola\n\nYear: 1986\n\nDirector: James Cameron\n\nStars: Sigourney Weaver, Bill Paxton, Jenette Goldstein, Paul Reiser, Lance Henriksen, Michael Biehn\n\nGenre: Science Fiction & Fantasy, Action & Adventure\n\nRotten Tomatoes Score: 99%\n\nRating: R\n\nRuntime: 138 minutes\n\nWatch on HBO\n\n\n\n\n\nJames Cameron colonizes ideas: Every beautiful, breathtaking spectacle he assembles works as a pointillist representation of the genres he inhabits—sci-fi, horror, adventure, thriller—its many wonderful pieces and details of worldbuilding swarming, combining to grow exponentially, to inevitably overshadow the lack at its heart, the doubt that maybe all of this great movie-making is hiding a dearth of substance at the core of the stories Cameron tells. An early example of this pilgrim’s privilege is Cameron’s sequel to Ridley Scott’s horror masterpiece, in which Cameron mostly jettisons Scott’s figurative (and uncomfortably intimate) interrogation of masculine violence to transmute that urge into the bureaucracy that only served as a shadow of authoritarianism in the first film. Cameron blows out Scott’s world, but also neuters it, never quite connecting the lines from the aggression of the Weyland-Yutani Corporation to the maleness of the military industrial complex, but never condoning that maleness, or that complex, either. Ripley’s (Sigourney Weaver) story about what happened on the Nostromo in the first film is doubted because she’s a woman, sure, but mostly because the story spells disaster for the corporation’s nefarious plans. Private Vasquez’s (Jennette Goldstein) place in the Colonial Marine unit sent to LV-426 to investigate the wiping out of a human colony is taunted, but never outright doubted, her strength compared to her peers pretty obvious from the start. Instead, in transforming Ripley into a full-on action hero/mother figure—whose final boss battle involves protecting her ersatz daughter from the horror of another mother figure—Cameron isn’t messing with themes of violation or the role of women in an economic hierarchy, he’s placing women by default at the forefront of mankind’s future war. It’s magnificent blockbuster filmmaking, and one of the first films to redefine what a franchise can be within the confines of a new director’s voice and vision. —Dom Sinacola\n\nYear: 2002\n\nDirector: Paul Thomas Anderson\n\nStars: Adam Sandler, Emily Watson, Philip Seymour Hoffman, Luis Guzman\n\nGenre: Comedy, Romance, Drama\n\nRotten Tomatoes Score: 79%\n\nRating: R\n\nRuntime: 95 minutes\n\nWatch on HBO\n\n\n\n\n\nIt may be hard to recall now that we’ve all rallied around his talent—allowing him to transcend the stigma of his Netflix deal while he still profits ludicrously off it—but there was once a time when the world doubted Adam Sandler. Long before the Safdies or even Noah Baumbach got their time getting tight with the Sandman, we have P.T. Anderson to thank for inspiring such hope. Compared to the scope of There Will Be Blood, or the melancholy of Boogie Nights, or the inexorable fascination at the heart of The Master, or the obsession and obfuscation of Phantom Thread, Punch-Drunk Love—a breath of fresh, Technicolor air after the weight of Magnolia—comes off like something of a lark for Anderson, setting the stage for the kind of incisive comic chops the director would later epitomize, and complicate, with Inherent Vice. A simple love story between a squirmy milquetoast (Sandler) on the verge and the woman (Emily Watson) who yanks him back to life, Punch-Drunk Love is as confounding as it is a delight, an expression of unmitigated, sputtering passion—sad and febrile and, most importantly, optimistic about what anyone is truly capable of doing. This might be as sincere as Anderson gets. —Dom Sinacola\n\n\n\nYear: 1987\n\nDirectors: Ethan Coen, Joel Coen\n\nStars: Nicolas Cage, Holly Hunter, John Goodman, William Forsythe, Francis McDormand\n\nGenre: Comedy\n\nRotten Tomatoes Score: 91%\n\nRating: PG-13\n\nRuntime: 95 minutes\n\nWatch on HBO\n\n\n\n\n\nUnderstated dramatic performances are all well and good, but it takes pinpoint control on behalf of both directors and cast to deliver the sustained overstated performances found throughout Raising Arizona. From its opening courtship sequence to the struggles of H.I. (Nicholas Cage) and Ed (Holly Hunter) to form a family by borrowing an “extra” from a family with a surplus to the final battle with the Lone Biker of the Apocalypse, the Coen brothers’ film remains an immensely beguiling and quotable farcical fable. —Michael Burgin\n\nYear: 1988\n\nDirector: John McTiernan\n\nStars: Bruce Willis, Alan Rickman, Reginald VelJohnson, Bonnie Bedelia, Alexander Godunov\n\nGenre: Action & Adventure, Thriller\n\nRotten Tomatoes Score: 93%\n\nRating: R\n\nRuntime: 114 minutes\n\nWatch on HBO\n\n\n\n\n\nDie Hard may be the “stickiest” film of its decade—how many best-laid plans have been derailed by running across John McTiernan’s masterful actioner on cable? As Officer John McClane and Hans Gruber, Bruce Willis and Alan Rickman, respectively, steal the show in career-defining roles, but even Henchman #10 (Asian man who eats candy bar, or Uli, to his friends) comes across more realized than most lead roles in today’s run-of-the-mill action flicks. Tightly plotted with cleverness to spare, Die Hard welcomes the scrutiny of multiple viewings without losing its humor or heart. Yippie ki-yay, indeed. —Michael Burgin\n\nYear: 1979\n\nDirector: Francis Ford Coppola\n\nStars: Martin Sheen, Marlon Brando, Robert Duvall, Dennis Hopper, Laurence Fishburne\n\nGenre: Drama, War\n\nRotten Tomatoes Score: 98%\n\nRating: R\n\nRuntime: 148 minutes\n\nWatch on HBO\n\n\n\n\n\nLet’s invoke Truffaut, because his spirit feels as relevant to a discussion of Francis Ford Coppola’s baleful adaptation of Joseph Conrad’s Heart of Darkness as to a discussion of a war film like Paths of Glory, and to considering war films in general. Maybe, if we take Truffaut at his word, Apocalypse Now can’t help but endorse war merely through the act of recreating it as art. Maybe that doesn’t stop the film from conveying Coppola’s driving theses: War turns men into monsters, leads them on a descent into a primal, lawless state of mind, and war is itself hell, an ominous phrase now made into cliché by dint of gross overuse between 1979 and today. If the film innately sanctions war by depiction, it does not sanction war’s impact on the humanity of its participants. In fact, Apocalypse Now remains one of the most profound illustrations of the corrosive effect nation-sanctioned violence has on a person’s spirit and psyche. It’s cute that in 40 years later we’re OK with quoting this movie in gratingly awful AT&T commercials, or repurposing its period backdrop for the sake of making King Kong happen for contemporary audiences for a second time, but there’s nothing cute, or even all that quotable, about it. Apocalypse Now sears, sickens and scars, branding itself in our memories as only the grimmest displays of human depravity truly can. —Andy Crump\n\nYear: 2001\n\nDirector: Todd Field\n\nStars: Tom Wilkinson, Sissy Spacek, Nick Stahl, Marissa Tomei\n\nGenre: Drama\n\nRotten Tomatoes Score: 93%\n\nRating: R\n\nRuntime: 131 minutes\n\nWatch on HBO\n\n\n\n\n\nBased on a story by Andre Dubus, Todd Field’s In the Bedroom is a quiet, understated and devastating exploration of grief in the aftermath of a happy family torn apart by the murder of Frank Fowler (Nick Stahl) by his girlfriend Natalie’s (Marisa Tomei) ex (William Mapother). Of course, Nick’s parents (Sissy Spacek and Tom Wilkinson) handle the loss of their son in very different ways, inevitably alienating themselves from each other, compounding their isolation and profound loss. Field’s directorial debut is an arresting (and emotionally exhausting) work, combining elements of romance, drama and the taut tension of a very good thriller to reveal and unfold the story at the core of the film, which is Spacek and Wilkinson’s joint and individual journeys to contend with the utterly life-shattering experience of unexpectedly losing a child. The shifts from grief to anger and blame to guilt to need are incredibly real, and Spacek and Wilkinson deliver stellar, deeply nuanced performances. Field was critically lauded for the restrained style of the film, and for good reason: This is a riveting character study, the deepest, fathomless of dives into the psychology of family in the midst of loss. —Amy Glynn\n\n\n\nYear: 1998\n\nDirector: Steven Soderbergh\n\nStars: George Clooney, Jennifer Lopez, Ving Rhames, Don Cheadle, Dennis Farina, Albert Brooks\n\nGenre: Thriller, Comedy, Romance, Drama\n\nRotten Tomatoes Score: 93%\n\nRating: R\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nAs through Jim Jarmusch’s eyes in Only Lovers Left Alive, Detroit via Steven Soderbergh is a metropolis equal parts romance and history, both a place where people can escape their typical lives for a time and a place that people want to escape to leave behind the suffocating weight of centuries of human industry. Though he photographs the city in the cobalt blues of cold temperatures and the biting grays of colorless winter, Soderbergh seems to revel in the weird sprawl of Metro Detroit, fascinated by how the violence of boxing matches at the State Theater can so quickly—as if it were only a matter of changing a green screen—lapse into the wealthy compounds of Bloomfield Hills or the crystalline hotel rooms of the Renaissance Center, where you can eat a $25 burger listening to gun shots in the street below. Out of Sight is by far the best Elmore Leonard adaptation, the only one to truly embrace Leonard’s hometown as a place far more magical—far more dangerous and upsetting and beautiful and enchanting—than any director has ever admitted before. The rollicking yarn about a bank robber and consummate prisoner Jack Foley (George Clooney) who meets U.S. Marshal Karen Sisco (Jennifer Lopez) mid-prison-break and then entertains dreams of going clean to weirdly woo her, the film’s dedicated to its Michigan metropolis because no other locale has similarly, best and marvelously charmed its way to the bottom. —Dom Sinacola\n\nYear: 1998\n\nDirector: George Miller\n\nStars: James Cromwell, Elizabeth Daily, Magda Szubanski, Mickey Rooney, Mary Stein\n\nGenre: Science Fiction & Fantasy, Comedy, Kids & Family\n\nRotten Tomatoes Score: 65%\n\nRating: G\n\nRuntime: 90 minutes\n\nWatch on HBO\n\n\n\n\n\nThree franchises mostly define George Miller’s almost five-decade career: Mad Max, Happy Feet and Babe—the latter comprised by the two films Miller wrote about the talking pig who thinks he’s a sheepdog. Miller has kept such a distinct visual language throughout these 50-some years, we can draw a direct aesthetic line between Fury Road’s lavish colors depicting the grotesque beauty of a post-apocalyptic hellscape, and Babe: Pig in the City’s old-school fairy-tale world, equally enchanting and deadly. It’s is a textbook example of solid sequel-making: Instead of blindly recreating the charming family drama of Babe, following the titular pig hell-bent on defying his social place in his world, Miller dials the story’s fantasy to 11 to take us to an awe-inspiring metropolitan city that’s a hodgepodge of the most beautiful and recognizable urban spots in the world. Pushing human characters even more to the background, Miller’s film tells of Babe’s latest exploit leading a group of plucky and downtrodden animals in their quests for freedom and dignity. Like so many classic children’s entertainments, in Pig in the City, horrors lurk around every corner but the possibilities of life’s wonders similarly shine. —Oktay Ege Kozak\n\nYear: 1994\n\nDirector: Steve James\n\nGenre: Documentary\n\nRotten Tomatoes Score: 98%\n\nRating: PG-13\n\nRuntime: 171 minutes\n\nWatch on HBO\n\n\n\n\n\nThe documentary labeled by none other than Roger Ebert as the single best film of the 1990s alternates often between beautiful and crushing, an intense profile of life in inner city Chicago pitted against dreams of escape—through basketball of all things. The story of two young men recruited by a wealthy, predominantly white high school to play basketball, Steve James’ Hoop Dreams, his first feature, obviously raises serious questions about how modern education exploits race and socioeconomic status, but shot over the course of five years and condensed from 250 hours of footage, the film’s true accomplishment is its sprawl, leaving out seemingly absolutely nothing in its portrayal of multiple families. Yet, that it was snubbed from a nomination in the Academy’s best documentary category, leading to public and critical outcry? It doesn’t get more illuminating, more heartbreakingly real than this. Both of the young Illinois men profiled—William Gates and Arthur Agee—had older brothers gunned down in Chicago street violence in the years that followed the film’s release, one in 1994 and another in 200: The film is never far from the reminder of just how life-saving these dreams can be. —Jim Vorel\n\nYear: 1986\n\nDirector: John Cassavetes\n\nStars: Gena Rowlands, Peter Falk, Katherine Cassavetes\n\nGenre: Drama\n\nRotten Tomatoes Score: 93%\n\nRating: R\n\nRuntime: 155 minutes\n\nWatch on HBO\n\n\n\n\n\nPopularly derided during much of his career, John Cassavetes left a body of work that, in retrospect—over 25 years after his death—seems more and more an uncompromising portrait of middle America: Here, he points, be dragons. And in A Woman Under the Influence, perhaps more than in any of his other films, Cassavetes’ characters are provided arguably no respite from their incomprehensible realities. For Mabel (Gene Rowlands) just as much for her husband Nick (Peter Falk), absolutely nothing makes sense, be it her devastating descent into mental illness or his inability to accept that his life is no longer the one he imagined. Cassavetes makes it clear that whatever tragic things happen to this family, none of it is particularly fair. There is only what happens and the consequences, and in A Woman Under the Influence, such indifference in the universe is told with painstakingly rich detail. —Dom Sinacola\n\nYear: 2011\n\nDirector: Justin Lin\n\nStars: Vin Diesel, Paul Walker, Dwayne Johnson, Jordana Brewster, Chris Bridges, Tyrese Gibson, Gal Gadot, Sung Kang, Elsa Pataky\n\nGenre: Action & Adventure\n\nRotten Tomatoes Score: 77%\n\nRating: PG-13\n\nRuntime: 131 minutes\n\nWatch on HBO\n\n\n\n\n\nEarly in Fast Five, director Justin Lin’s third film in the Fast & Furious—which just so happens to be the title of his previous film—franchise, U.S. Diplomatic Security Service agent Luke Hobbs (The Rock) reminds his team of elite operatives, “And above all else we don’t ever, ever let them get into cars.” Of course referring to a cadre of international outlaw thieves (?) led by Dominic Torretto (Vin Diesel) and ex-supercop Brian O’Conner (Paul Walker), Hobbs is the first character in the storied series to just come in and state all of the previous films’ subtext out loud: These people’s symbiotic connection to automobiles makes them superheroes. What Dominic Torretto would then insist: Their symbiotic relationship to each other makes them gods. Because the magic of the Fast & Furious movies, crystallized in Fast Five, is that it finally realizes that the logical next step from a powerful relationship between man and machine is a powerful relationship between man and machine and man, everything operating in ultra-rare synergy down to the laws of physics, which bend to the will of our titular crew. Stealing $100 million but causing so much more in public property damage—it’s OK as long as a drug lord suffers most. Which he does, after Dom and Brian drag a multi-ton safe through the streets of Rio de Janeiro, reality at their mercy, justice (existential and cosmic) on their side. Fast Five isn’t stupid—it’s the saaviest movie in the bunch, the cornerstone of the series’ mega-success—just extremely comparable to Vin Diesel’s body: over-big, over-blunt and wielded with the overwhelming belief that the world revolves around it. When something’s got this much mass, it grows its own gravity. —Dom Sinacola\n\nYear: 2019\n\nDirector: Jordan Peele\n\nStars: Lupita Nyong’o, Winston Duke, Tim Heidecker, Elisabeth Moss, Shahadi Wright Joseph, Evan Alex\n\nGenre: Horror, Thriller, Comedy\n\nRotten Tomatoes Score: 93%\n\nRating: R\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nUs clarifies what Get Out implies. Even after only two films, Jordan Peele’s filmmaking seems preconfigured for precision, the Hitchcock comparisons just sitting there, waiting to be shoved between commas, while Peele openly speaks and acts in allusions. Us, like Get Out before it but moreso, wastes nothing: time, film stock, the equally precise capabilities of his actors and crew, real estate in the frame, chance for a gag. If his films are the sum of their influences, that means he’s a smart filmmaker with a lot of ideas, someone who knows how to hone down those ideas into stories that never bloat, though he’s unafraid to confound his audience with exposition or take easy shots—like the film’s final twist—that swell and grow in the mind with meaning the longer one tries to insist, if one were inclined to do so, that what Peele’s doing is easy at all. A family comedy studded with dread, then a home invasion thriller, then a head-on sci-fi horror flick, Us quickly acquaints us with the Wilson family: calming matriarch Adelaide (Lupita Nyong’o), gregarious dad Gabe (Winston Duke), daughter wise beyond her years Zora (Shahadi Wright Joseph) and adorable epitome of the innocent younger brother, Jason (Evan Alex). Though far from shallow, the characters take on archetypal signifiers, whether it’s Zora’s penchant for running or that Gabe’s a big guy whose bulk betrays a softer heart, Peele never spoonfeeding cheap characterizations but just getting us on his wavelength with maximum efficiency. Us isn’t explicitly about race, but it is about humanity’s inherent knack for Othering, for boxing people into narrow perspectives and then holding them responsible for everyone vaguely falling within a Venn diagram. Regardless of how sufficiently we’re able to parse what’s actually going on (and one’s inclined to see the film more than once to get a grip) the images remain, stark and hilarious and horrifying: a child’s burned face, a misfired flare gun, a cult-like spectacle of inhuman devotion, a Tim Heidecker bent over maniacally, walking as if he’s balanced on a thorax, his soul as good as creased. Divorced from context, these moments still speak of absurdity—of witty one-liners paired with mind-boggling horror—of a future in which we’ve so alienated ourselves from ourselves that we’re bound to cut that tether that keeps us together, sooner or later, and completely unravel. We are our undoing. So let the Hitchcock comparisons come. Peele deserves them well enough. Best not to think about it too hard, to not ruin a good thing, to demand that Us be anything more than sublimely entertaining and wonderfully thoughtful, endlessly disturbing genre filmmaking. —Dom Sinacola\n\nYear: 2019\n\nDirector: Chad Stahelski\n\nStars: Keanu Reeves, Halle Berry, Ian McShane, Mark Dacascos, Lance Reddick, Laurence Fishburne, Anjelica Houston, Asia Kate Dillon, Randall Duk Kim, Jason Mantzoukas\n\nGenre: Martial Arts, Action & Adventure\n\nRotten Tomatoes Score: 90%\n\nRating: R\n\nRuntime: 131 minutes\n\nWatch on HBO\n\n\n\n\n\nThe promise of John Wick: Chapter 2 is in superposition. Depending on how one comes into John Wick: Chapter 3 – Parabellum, from which angle, that promise is simultaneously fulfilled and squandered. Chad Stahelski’s third and by no means last entry in the saga of laconic gentleman terminator John Wick (Keanu Reeves), the Baba Yaga of every gangster’s worst nightmares, either lives up to previous entries as far as setting the standard for visceral, eardrum-squelching violence, or it fails to take the series in the direction presaged by the apocalyptic cliffhanger of the previous chapter. No, every living human in New York is not a secret assassin, plunging John Wick into a race against time through a Dantean Hell of his own devising, but John Wick does pretty much murder everybody in the City before traveling to Morocco, where he murders even more people, before returning to New York, where he continues decimating the urban center’s population. As Continental Manager Winston (Ian McShane) puts it, John Wick needs to decide whether he’s the boogie man or, simply, a man. Whether John Wick is a videogame or something more existential. He chooses both: By the time we reach the final action spectacle, during which the forces aligned against John Wick wear the kind of body armor requiring an exorbitant amount of kill shots and then, halfway through the melee, a weapon upgrade, we’ve lapsed completely into the realm of the first-person shooter, realizing we’ve already made our way through numerous, ever-increasingly difficult levels and boss battles with an impeccable kill/death ratio.\n\nThe limitless beauty of the John Wick franchise, crystalized in Chapter 3, is that alluding to videogames when talking about the movie doesn’t matter. None of this matters. As videogames and action movies parabolically draw closer and closer to one another, John Wick 3 may be the first of its kind to figure out how to keep that comparison from being a point of shame. Accordingly, each action set piece is an astounding feat, from the first hand-to-hand fracas in narrow library stacks, to a comic knife fight amidst cases of antique weapons, to a chase on horseback and, later, a chase on motorcycles care of katana-wielding meanies. John Wick 3 revels in its ludicrous gore without losing sight of the very real toll of such unmitigated havoc. It’s as much a blast of blood and guts as it is an immersive menagerie of pain, a litigation of the ways in which we imbibe and absorb and demand violence, in which we hyperstylize death. Every gun shot, body blow, shattering jaw and gut slicing rings out sonorously from the screen, so that even if yet another faceless henchperson loses their life, leaving this mortal plane unnoticed, at least the act of violence that ended them will be remembered. —Dom Sinacola\n\nYear: 2003\n\nDirector: Andrew Jarecki\n\nGenre: Documentary\n\nRotten Tomatoes Score: 97%\n\nRating: R\n\nRuntime: 107 minutes\n\nWatch on HBO\n\n\n\n\n\nThis is the story of Arnold Friedman and his son Jesse, convicted of multiple counts of child molestation that supposedly took place in the basement of their home in a quiet New York suburb during the ’80s. In Capturing the Friedmans, filmmaker Andrew Jarecki interviews the victims and prosecutors, but never reaches a conclusion as to the veracity of the charges, tacitly acknowledging that guilt and innocence are fluid concepts in such sensational and shameful circumstances. Instead, he documents the implosion of the family and the destruction of an already tenuous marriage. Surely, the details of the abuse are disturbing, but almost as unsettling is the cruelty with which the two older Friedmans reject their mother in blind loyalty to their shamefaced father and numb younger brother, further facilitating the family’s emotional separation. —Emily Reimer\n\nYear: 2006\n\nDirector: Martin Campbell\n\nStars: Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright\n\nGenre: Martial Arts, Action & Adventure\n\nRotten Tomatoes Score: 95%\n\nRating: PG-13\n\nRuntime: 144 minutes\n\nWatch on HBO\n\n\n\n\n\nWith a crag-like, angular face, a sculpted body and the venomous delivery of “Does it look like I give a damn?” when asked about whether he wants his martini shaken or stirred, the James Bond of Casino Royale (Daniel Craig) is as broken, and deliriously determined to keep going, as the (deliberately post-9/11) world around him. The 21st entry into the then-40-plus-year-old franchise was more than just a reboot, and more than just a back to basics—it was a recalculation of what Bond would have to mean to the culture around him. And while what makes the character and the series interesting is this need to be reactive to the culture, Casino Royale insists that the audience, in addition to Bond himself, can feel every gut punch, kick, gunshot, wave of nausea, wave of paranoia and, perhaps most importantly, every heartbreak. Sent on his first mission as a double-0 agent to win a poker game with a man who’s financing terrorism, this Bond is most visceral as one with folly, mistakes and hubris. He makes risky bets, he jumps the gun, he exposes his heart. Craig established himself as a James Bond of the Fleming vein, not the wise-cracking, invincible superhero Bond had become over the course of the series, but flawed, mean, a tender bastard not yet used to the traumatic, unforgiving experiences of being the hired gun of Her Majesty’s Secret Service. Mixing maximalist set pieces and the high tension drama of psychosexual mind games, Casino Royale gives Bond grit, a splintered heart and a palpable sense of mortality. —Kyle Turner\n\nYear: 2019\n\nDirector: S. Craig Zahler\n\nStars: Mel Gibson, Vince Vaughn, Tory Kittles, Michael Jai White, Jennifer Carpenter\n\nGenre: Thriller, Drama\n\nRotten Tomatoes Score: 75%\n\nRating: R\n\nRuntime: 158 minutes\n\nWatch on HBO\n\n\n\n\n\nIt’s more apt a title than most to describe the manner in which writer-director S. Craig Zahler pulls us from place to place over the course of a few days in the lives of old school cops Brett (Mel Gibson) and Anthony (Vince Vaughn). We meet them in the few hushed minutes before they brutalize a suspect; they seem much too self-aware and articulate to be as racist as one would assume, given their propensity for violence, and Zahler never quite justifies nor condemns their copious, morally questionable (and often despicable) actions. All in the name of supporting their families under the threat of losing their jobs, so they say; Zahler gives fascinating, quick-witted lines and hilarious rapport and insightful mini-soliloquies to his two leads, so he obviously wants them to be remembered as tragic figures more than outright villains. Equally venomous and Victorian, offensive and outraged, Dragged Across Concrete is a potboiler in the purest sense, a wicked tale of two cops putting their skills to more lucrative use, a sad bit of pulp that describes our current economic despair as tonally on-point as the economic despair of any American decade since forever—a movie about racist white cops starring Mel Gibson and his notable Hollywood conservative friend, Vince Vaughn. Were one to overlook Zahler’s obvious mastering of atmosphere and dread and bleakly compelling genre indulgence, one would find Problematic: The Movie, a measured provocation meant to make questionable choices in order to—if we’re being charitable—ultimately condemn these two men to the loser’s heap of history. Unlike the endings to Zahler’s previous films, Bone Tomahawk and the endlessly entertaining Brawl in Cell Block 99, Dragged Across Concrete’s final half hour exhausts itself to an inevitable, somber conclusion. The right person has won, but only at the cost of great trauma in his wake. And as for Brett and Anthony, their defeat is swift, melacholic and, perhaps best of all, stupid: Zahler’s final refutation for the very beliefs he also seems, sometimes and unfortunately, to be all about. —Dom Sinacola\n\nYear: 2019\n\nDirector: Daniel Minihan\n\nStars: Timothy Olyphant, Ian McShane, Brad Dourif, Molly Parker, Paula Malcolmson, Anna Gunn, John Hawkes\n\nGenre: Western, Drama\n\nRotten Tomatoes Score: 98%\n\nRating: NR\n\nRuntime: 109 minutes\n\nWatch on HBO\n\n\n\n\n\nA decade has passed in Deadwood between the show’s finale and Deadwood: The Movie, and longer has come and gone in the real world. Beloved characters have vacated the town, passed away with the beloved actors behind them. Deadwood isn’t used to that much temporal space. The longest narrative gap it ever weathered over the course of its 2004-2006 run was a seven month stretch hastening an affair and a bonanza gold mine. It’s a show where events and episodes occur over hours, where the threat of even minor change can send its entrenched group of outcasts to the brothel-worn mattresses. As South Dakota looks to enter the United States, Deadwood is about to finish the painful pubescence it began during the show and finally grow up. It left off with seething, begrudging closure—the kind found after a lopsided armistice—when gold magnate George Hearst (Gerald McRaney) strong-armed Alma Garret (Molly Parker) into selling her lucrative claim by, among other things, having her husband murdered. With all parties in that conflict returning to town to celebrate this new statehood, irredentism and its dictatorial opposite come into conflict. Hearst may own the town, but nobody stays bitter like a Deadwood resident.\n\nTragic reunions, new beginnings, and those signature beatings—all the run-ins, disappointments and excitements good fan service requires are included in its wide-ranging story. Some of these developments are propped up by flashbacks that could be clip show-ish; others more delicate and wistful recollections whose images reignite the pain we haven’t seen these characters experience in 10 years. They’re obsessive fragments, moments of time snipped, captured, and replayed like a haunting tune stuck in their heads. The focus on memory feels natural, but it’s perhaps even more understandable when taking into account the Alzheimer’s diagnosis of show creator David Milch (who also wrote the film). The “curiosity, bitterness, and incredulity” of mental decline meets the “unflinching dignity” of idealism, something seen in every corner of Deadwood’s hard, angry, honorable inhabitants. Time, and the perspective its passage brings, is new for the show. But its addition only serves to cement its legacy as one of the best ever. —Jacob Oller\n\nYear: 1988\n\nDirector: Roman Polanski\n\nStars: Harrison Ford, Emmanuelle Seigner, Betty Buckley, John Mahoney\n\nGenre: Drama, Thriller, Mystery & Suspense\n\nRotten Tomatoes Score: 76%\n\nRating: R\n\nRuntime: 121 minutes\n\nWatch on HBO\n\n\n\n\n\nFrantic is not one of Polanski’s more highly regarded films in most circles, yet its first act is about as convincing an exhibition of talent as any in his oeuvre. In many ways, Frantic is a conventional mystery-thriller about an American doctor (a suitably frayed Harrison Ford) in Paris searching for his kidnapped wife—something probably about due for an action-oriented Liam Neeson remake—but Polanski elevates the material to great heights, or at least does before the absurd twists of the plot catch up with him. It’s really in the first act that Frantic earns its title, but not through the frenetic style that a modern director would employ to interpret it. Polanski allows Ford to give us that quality in his performance, and in restraining the editing and composition of the piece, to give us the space to really take that performance in. Where Polanski and his team shine brightest, though, is in the mood of that first hour or so. Working with a Hollywood budget, Polanski delivers a rich neo-noir atmosphere while avoiding all the aesthetic cliches that implies. Paris comes alive through the lens of Witold Sobocinski, but it’s an old life, history dimly radiating from every corner of the frame. In that opening hour Ford’s displaced and distressed American seems most at risk not from his wife’s kidnappers, but from the worn details that surround him and the way the light seems folded into ancient shadows: the overwhelming sense of our insignificance in a storied place—even when we’re in crisis. —Chad Betz\n\nYear: 2001\n\nDirector: John Cameron Mitchell\n\nStars: John Cameron Mitchell, Michael Pitt, Miriam Shor\n\nGenre: Comedy, Musical, Drama\n\nRotten Tomatoes Score: 92%\n\nRating: R\n\nRuntime: 91 minutes\n\nWatch on HBO\n\n\n\n\n\nThis troubled yet lovable “slip of a girly boy” is the best thing that happened to us since Frank N. Furter. With this film, John Cameron Mitchell not only proved himself as a bona fide rocker with a killer set of legs, he also got to show off his writing and directing skills, prompting him to further explore his talents with Shortbus (2006) and Rabbit Hole (2010). The film tells the story of Hansel Schmidt (Cameron Mitchell), growing up in communist East Germany, fascinated with rock music and already seemingly very in tune with his sexuality. This self-awareness is enhanced when he meets Luther Robinson (Maurice Dean Wint), an American soldier who wins Hansel’s heart with licorice drops and jelly rolls. Hansel needs some sugar in his bowl! Hansel and Luther get married, but in order for Hansel to leave the country, he needs to undergo an official sex change. Hansel takes on his mother’s name, Hedwig, and agrees to the operation—but wakes up to find that something went wrong. All she’s left with is a one-inch mound of flesh between her legs—the infamous “Angry Inch.”\n\nHedwig and Luther’s romance doesn’t last, and soon Luther leaves her for another man. To deal with her pain, Hedwig forms a rock band with some Korean Hausfraus, before meeting Tommy Speck (Michael Pitt), a fair-skinned, innocent-looking young boy whom she believes to be her soul mate. Tommy, whose Christian background stops him from pursuing the affair any further, leaves Hedwig—but not before she christens him with his stage name: Tommy Gnosis. When he goes off to become a famous rock star, Hedwig is appalled to find he is performing the songs she had written for him. Fueled with hurt and humiliation, Hedwig and The Angry Inch—now consisting of Eastern European musicians—follow Tommy’s tour in order to preach their predicament to the masses.\n\nMost of the film’s songs are performed live, and with songs like “The Origin of Love,” “Wig in a Box” and “Angry Inch,” one can totally imagine Hedwig fanatics going wild in small, atmospheric theaters for decades to come—just around midnight. —Roxanne Sancto\n\nYear: 2006\n\nDirector: Spike Lee\n\nGenre: Documentary\n\nRotten Tomatoes Score: 97%\n\nRating: NR\n\nRuntime: 255 minutes\n\nWatch on HBO\n\n\n\n\n\nPart indictment of FEMA and the U.S. Army Corps of Engineers, part celebration of the unfailingly resilient spirit of New Orleans, Spike Lee’s four-hour-long look at “The City That Care Forgot” a year after the near-obliteration of Hurricane Katrina is an exhausting, comprehensive, worthwhile experience. There’s a reason so many residents refer to the catastrophe as the “Federal flood” and not Katrina itself—Lee’s Peabody-winning doc examines the systemic failure at all levels of government to maintain the storm barriers and deal with the consequences of their negligence. It’s political, it’s racial, it’s accusatory and it’s utterly compelling viewing. It’s also inspiring, thanks to the resolute locals shown struggling to survive and rebuild in the disaster’s aftermath. This is very much a Spike Lee joint; don’t expect anyone in the Dubya administration to come away without a tongue-lashing. But the heart and soul of the doc is the people of New Orleans, and they won’t let you down—on the contrary. —Amanda Schurr\n\nYear: 2016\n\nDirector: Ti West\n\nStars: Ethan Hawke, John Travolta, Taissa Farmiga, Karen Gillan, James Ransone\n\nGenre: Western, Action & Adventure\n\nRotten Tomatoes Score: 76%\n\nRating: R\n\nRuntime: 104 minutes\n\nWatch on HBO\n\n\n\n\n\nOne of the most heartbreaking scenes of any film of 2016 was one of the most heartbreaking scenes of any film in 2014—then it was in slickly excellent Keanu Reeves mass-slaughter vehicle John Wick, and two years later it’s in Ti West’s otherwise pretty fun-filled neo-Western, In a Valley of Violence. To even mention the former means sauntering smugly into spoiler territory with the latter, but West, who’s proven he’s one of our deftest genre handlers still figuring out what he wants to do when he grows up, knows you can’t really spoil such an archetypal plot anyway. Instead, with his latest film, by giving up scares for shoot-outs, the typically horror-centric writer-director isn’t interested in re-configuring classic tropes as much as he is in rubbing those tropes against reality to see what sparks. And while In a Valley of Violence doesn’t burn the traditional Western formula to dust, it does give a cadre of impeccable character actors a wide-open sandbox to squat over and dump into. More, maybe, than any other recent revisionist Westerns, like Bone Tomahawk or The Hateful Eight, In a Valley of Violence is built around interrogating the genre’s tried and true archetypes—its cinematic language even—rather than upholding, modernizing, or (in the case of Tarantino’s take) obliterating them out of existence. Ethan Hawke finds the perfect workmanlike take on the Man With One Name, Paul, a gunslinging drifter and former Union soldier, by playing him as blankly as he can, owing his opaque demeanor to the Eastwoods and Bronsons of Sergio Leone’s classics. Meanwhile, the film is far funnier than any of its pedigree would suggest, aided in part by the arrival of John Travolta as the surprisingly rational U.S. Marshal. Like Kurt Russell in Bone Tomahawk, Travolta’s is a reassuring presence, as effortless as it is wearied, the anchor which the film’s increasingly stylized violence can never totally lift. Still, West is an impeccable craftsman, his storytelling chops as fatless and near-faultless as ever. As much could be expected from any genre director these days, really, and West is, undoubtedly, up to the task of trying his hand at any of the kinds of films he loves. —Dom Sinacola\n\nYear: 2003\n\nDirectors: Robert Pulcini, Shari Springer Berman\n\nStars: Paul Giamatti, Hope Davis, Judah Friedlander, James Urbaniak\n\nGenre: Comedy, Drama\n\nRotten Tomatoes Score: 94%\n\nRating: R\n\nRuntime: 100 minutes\n\nWatch on HBO\n\n\n\n\n\nHarvey Pekar’s “American Splendor” books are fascinating: Pekar believed that even the most mundane and seemingly uncomplicated lives were worth documenting. American Splendor showcases this theory by combining real footage of Pekar, fictionalized versions of characters from his life—maintaining both stylized caricatures and naturalistic drama—and even animated segments pulled from the comics to create a cohesive whole that presents an ordinary life as a fascinating experience. —Ross Bonaime\n\n\n\nYear: 2015\n\nDirector: Guillermo del Toro\n\nStars: Tom Hiddleston, Jessica Chastain, Mia Wasikowska\n\nGenre: Horror, Drama\n\nRotten Tomatoes Score: 73%\n\nRating: R\n\nRuntime: 119 minutes\n\nWatch on HBO\n\n\n\n\n\nCrimson Peak follows the traditions of gothic romance by design: “I made this movie to present and reverse some of the normal tropes, while following them, of the gothic romance,” del Toro says on the Arrow Blu-ray’s audio commentary track, a note made during the introduction between his protagonist, Edith Cushing (Mia Wasikowska), and her first of two love interests, Sir Thomas Sharpe (Tom Hiddleston), a baronet come to the U.S. to win over her father, the magnate Carter Cushing (Jim Beaver), and obtain financial backing for his very own clay-mining contraption. The exchange between Thomas and Edith in this scene is crucial to what the film’s trying to accomplish: “I’m sorry,” he says to her, the manuscript on her desk having caught his eye. “I don’t mean to pry, but this is a piece of fiction, is it not?”\n\nIt is. It’s her fiction, in fact, a piece she’s written for publication in the pages of The Atlantic Monthly. With a glance, the story has ensnared him. “Ghosts,” he remarks, an inscrutable smile on his lips. Edith goes on defense, stammering, “Well, the ghosts are just a metaphor, really,” but Thomas isn’t finished: “They’ve always fascinated me. You see, where I come from, ghosts are not to be taken lightly.” Thomas means this as flattery and not admonition, and flattered is how Edith reacts, excitement spreading across her face at encountering a kindred spirit to accompany the actual spirits she’s yet to meet. Thomas gets it. When she speaks with him, Edith doesn’t need to compromise her fondness for ghost stories, as she must with her peers. She can openly appreciate them on their own terms. And so can Crimson Peak. Del Toro adores the production components of the gothic romance; he’s enamored with the pomp, the circumstance, the costumes. They give him a veil of propriety, because Crimson Peak doesn’t pull its punches. The audience finds out what kind of film it is from the opening shot of Edith’s face, decorated by open wounds, and from the follow-up sequence, in which young Edith (Sofia Wells) is visited in dead of night by her late mother’s blackened osseous specter. Crimson Peak doesn’t care about catering to taste or achieving universality. It cares about freaking its viewers the hell out. After all, if “horror” as a genre acts as a massive umbrella sheltering all manner of aesthetics and approaches, the exercise should always be about sending an audience away with a powerful need to sleep with the lights on. —Andy Crump\n\nYear: 1996\n\nDirectors: Joe Berlinger, Bruce Sinofsky\n\nGenre: Documentary\n\nRotten Tomatoes Score: 100%\n\nRating: NR\n\nRuntime: 150 minutes\n\nWatch on HBO\n\n\n\n\n\nIf you’ve never heard of the West Memphis Three, do some research before you begin—you’ll want to be prepared. Within only a minute of the film’s opening, as Metallica’s “Welcome Home (Sanitarium)” noodles forebodingly over pixelated camcorder videos, intolerable images taken straight from police evidence glance across frame, so quickly and frankly you’ll immediately question if they are, in fact, real. Of course, they are—they are images no person should ever have to see, and yet Joe Berlinger and Bruce Sinofsky use them only to expose the unbelievable horror at the heart of the appropriately named Paradise Lost. What unfolds over the following two and a half hours is just as heartbreaking: a trio of teenage boys (one with an IQ of 72) is put on trial for the brutal murders of three prepubescent boys, the only evidence against them a seemingly forced confession by the young kid with the below-average IQ, and laughably circumstantial physical proof. The film explores the context of West Memphis, its blindly devoted Christian population and how the fact that these teenagers dressed in black and listened to Metallica somehow led to their predictable fates at the hands of a comprehensively broken justice system. With surprising access to everyone involved in the trial, as well as a deft eye for the subtle exigencies of any criminal case such as this, Paradise Lost is a thorough, infuriating glimpse of the kind of mundane evil that mounts in some of America’s quietest corners. Welcome home. —Dom Sinacola\n\nYear: 2015\n\nDirector: Alex Gibney\n\nGenre: Documentary\n\nRotten Tomatoes Score: 95%\n\nRating: NR\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nAlex Gibney’s up-close examination of Scientology, its practices and the controversies that surround the religion founded by science-fiction writer L. Ron Hubbard is also a stirring portrait of eight former adherents, who tell their stories of how they came to practice Scientology and their reasons for leaving the church. While much of the ideological content in Gibney’s film has circulated on the Internet for years, there was still a number of items to be learned from watching the film and hearing from the men who made it. While Going Clear is part exposé and part condemnation of a controversial religion, director Gibney has said that he was most interested in “the journey of the key characters in the film”—and how people got lost in the ‘prison of belief.’” —Christine N. Ziemba\n\n\n\nYear: 2002\n\nDirector: Michael Moore\n\nGenre: Documentary\n\nRotten Tomatoes Score: 95%\n\nRating: R\n\nRuntime: 123 minutes\n\nWatch on HBO\n\n\n\n\n\nWhatever you think of Michael Moore, whether you see him as a half-wit, a provocateur or a genius documentarian activist, you may pause to consider what he might feel about Bowling for Columbine’s continued relevance and substance 16 years after its release, almost 20 years after the high school massacre referenced in its title took place. The truth: Not much has changed in America since 1999, or since 2002, and if you feel some type of way about that assertion, consider that the same evidence Moore presents to make his case in the film is as relevant in 2018 as it was at the time of the film’s original theatrical run. Paranoia and anxiety wrought by rampant fear mongering has not lessened, but increased exponentially, if not in volume then in broadcast range. America has more guns than people, even though gun ownership has dropped substantially in the intervening years. Racist Americans are more openly racist. Gun owners insist more loudly than ever on their right to bear weapons of mass murder. The list goes on. Moore likely did not intend Bowling for Columbine to be a text of enduring significance. That it’s still important today is likely as sobering to him as it is to any. —Andy Crump\n\nYear: 2015\n\nDirector: Dee Rees\n\nStars: Queen Latifah, Michael Kenneth Williams, Mo’Nique, Charles S. Dutton, Mike Epps\n\nGenre: Drama\n\nRotten Tomatoes Score: 89%\n\nRating: R\n\nRuntime: 113 minutes\n\nWatch on HBO\n\n\n\n\n\nIt may have taken 20 years to make it, but when Bessie finally arrived, she came, she saw and she conquered. The HBO film has garnered 12 well-deserved Emmy nominations, with Queen Latifah, co-stars Michael Kenneth Williams and Mo’Nique, and director Dee Rees all getting the nod. One scene in particular—with the reverse paper bag test—is one of Bessie’s finest moments, as it encompasses all that makes the HBO film so wonderful. There’s Queen Latifah in all her glory, finally setting up her own tour and making sure everyone knows who’s boss. There’s the hilarity when she lets down one of the hopefuls auditioning—“You must be darker than the bag to be in my show!” After all, Bessie is an incredibly funny movie at times. And there’s the whole inversion of the brown paper bag test. Where Bessie Smith grew up in a world that demanded black women performing back-up be lighter than a brown paper bag, Bessie makes up a new rule that gives her back some agency and sets a different tone (literally and figuratively) for her showcase. Bessie was, in no way, your average blues performer and for that reason Lili Fini Zanuck and her husband Richard D. Zanuck knew they couldn’t just deliver your average black-performer-who-grew-up-poor-and-made-it-big biopic. The familiar story of a talented woman done in by a man (or many men), or childhood tragedies, or her own celebrity was not Bessie’s story—she wasn’t lighter than a brown paper bag, and, thankfully, wasn’t presented as such. —Shannon M. Houston\n\n\n\nYear: 2018\n\nDirector: Jennifer Fox\n\nStars: Queen Latifah, Michael Kenneth Williams, Mo’Nique, Charles S. Dutton, Mike Epps\n\nGenre: Drama\n\nRotten Tomatoes Score: 99%\n\nRating: NR\n\nRuntime: 114 minutes\n\nWatch on HBO\n\n\n\n\n\nJennifer Fox has just done something utterly brilliant, and you need to see it. Be prepared to feel uncomfortable, because The Tale, adapted from her narrative memoir of the same name, will do a number on your head, in the way that a particularly vivid nightmare sometimes can, whether you personally have a childhood sexual abuse story or not. This film was made three years ago. It’s not a response to or the property of any movement, any hashtag; it’s not finally, finally pulling back the veil on the terrible stories no one ever told until now. We have always told these stories. They have always existed and we have always told them. We just didn’t do it with hashtags. To even characterize this film as “a story about sexual abuse” would be a shallow read on a very deep work of art. The Tale is, at a certain level, “about” sexual abuse. But focus on that for too long and you’ll miss the astonishing, courageous, gorgeous mosaic of ways in which it is deliberately, doggedly and totally not. This is a film about the morphing quicksand terrain of human memory and it’s about the stories we tell ourselves in order to stay sane and most of all it’s about the Plinian, volcanic power of emotional honesty. If you want to talk about the spirit of the moment, the guiding spirit of the times, maybe we need to pan back from anything as specific as sexual abuse of girls and women and talk about why being honest is the ultimate act of revolution. Plenty of people make autobiographical films. The Tale is so deeply and specifically autobiographical that it almost becomes something else. Fox as director and writer puts her documentarian’s tools to work to create a meta-textual tapestry depicting the ways in which our memories inform (and misinform) our self-concept. And this beautiful, gripping, disturbing film deserves to be looked at with as much nuance as it offers. It manages to dive so deeply into the personal that it explodes into something universal. —Amy Glynn\n\nYear: 2018\n\nDirectors: Aaron Horvath, Peter Rida Michail\n\nStars: Greg Cipes, Khary Payton, Tara Strong, Scott Menville, Hynden Walch, Will Arnett, Kristen Bell, Nicolas Cage\n\nGenre: Superhero, Animation, Science Fiction & Fantasy, Action & Adventure\n\nRotten Tomatoes Score: 91%\n\nRating: PG\n\nRuntime: 92 minutes\n\nWatch on HBO\n\n\n\n\n\nWith Teen Titans Go! to the Movies, the long-running Cartoon Network series joins the ranks of still-running animated series that were deemed popular enough to get a movie of their very own. Much like The Simpsons Movie and South Park: Bigger, Longer & Uncut, the show’s creators use the opportunity to distill and put on display what has made the show so popular in the first place. The result is one of the funniest “superhero” films of the year, and one that allows Robin and company to join Deadpool—Statler and Waldorf style—on the balcony poking fun at the clichés, blindspots and foibles of the current Big Genre on Campus. When Teen Titans Go! debuted on Cartoon Network in 2013, its chibi design, juvenile humor and overall zany approach drew mixed reactions from fans of the source material. For some, it stemmed from the disappointment of not getting a renewed “serious” series. (The original Teen Titans animated series had ended seven years earlier.) For others, the succession of booty jokes—or any joke hammered at relentlessly for 10-11 minutes—quickly grew tiresome. In Teen Titans Go! to the Movies, creators Michael Jelenic and Aaron Horvath pull off what we’ll call a “reverse-Hobbit,” showing how the characters from those 11-minute bursts of mayhem stand up just fine to the “rigor” of an 88-minute theatrical release. (Granted, they have more than 200 episodes to draw from and no dearth of tired tropes to target.) The premise of “Robin wants his own movie. What must he do to get one?” is all the framework directors Horvath and Peter Rida Michail need to support a sustained skewering of the current frenzy of superhero moviemaking. —Michael Burgin\n\nYear: 1999\n\nDirector: Wim Wenders\n\nGenre: Documentary, Musical\n\nRotten Tomatoes Score: 91%\n\nRating: G\n\nRuntime: 105 minutes\n\nWatch on HBO\n\n\n\n\n\nA good 15 years before Obama moved to lift the embargo, Wim Wenders helmed this exuberant introduction to a members club in Havana that closed in the 1940s, only to find worldwide popularity in the 1990s. Wenders’ camera follows his friend, American musician Ry Cooder, as he gets the band of legendary Cuban talents back together for an album and a few transcontinental performances. The soundtrack is, unsurprisingly, exceptional. So too are the individual players and their stories: Take Ibrahim Ferrer, a soft-spoken septuagenarian with a dulcet falsetto, or Omara Portuondo, a soulful chanteuse and dancer who once performed with Nat King Cole. Wenders’ film is more than just a journey of discovery for Cooder and his accompanying son Joachim, or for the group’s members, many of whom had never been to the U.S. (where they sold out Carnegie Hall); it’s the viewer’s passport to an indigenous African-Spanish sound theretofore blockaded by politics. Back in the studio, back in front of a crowd, back with each other, the Club’s members are positively radiant. It’s damned near impossible for audiences to not bask in that warmth. —Amanda Schurr\n\nYear: 2018\n\nDirector: Bradley Cooper\n\nStars: Bradley Cooper, Lady Gaga, Andrew Dice Clay, Dave Chappelle, Sam Elliott\n\nGenre: Drama, Romance\n\nRotten Tomatoes Score: 90%\n\nRating: R\n\nRuntime: 135 minutes\n\nWatch on HBO\n\n\n\n\n\nBradley Cooper’s A Star Is Born reminds us that clichés exist for a reason: They embody a whiff of universal truth that can hit us right between the eyes when it becomes our reality. This latest remake of a perennial Hollywood story doesn’t offer many new insights, but it reaffirms what we know—or what we think we know—about relationships, artistry, the trappings of fame and the demands of the entertainment industry. Its comforting familiarity is both its greatest limitation and its appeal—there are certain songs we love hearing over and over again, and A Star Is Born’s tale of “making it” is one we apparently never tire of. Cooper, who makes his directorial debut and also co-wrote the adaptation, stars as Jackson Maine, a roots-rocker of considerable popularity. But not all is right with the man: Tinnitus is robbing him of his hearing, and his addiction to drink and drugs is becoming worrying to those around him. One night after a show, he goes looking for a bar, stumbling upon a performance from Ally (Lady Gaga), who belts out an impassioned rendition of “La Vie en Rose.” Jackson is captivated by this aspiring singer-songwriter. She tells him she’s been told she’s not pretty enough to make it in the music business. He tells her she’s beautiful. A Star Is Born quickly throws these two mismatched souls together, as Jackson brings her onstage at his next sold-out show to duet with him on an arrangement he’s put together of one of her songs. The performance goes viral. Ally suddenly is in huge demand. The two become lovers. You know every word by heart. His Cooper acknowledges the clichés of his setup while asserting that there’s something eternal and cyclical about their underlying tenets. Yes, we’ve seen all manner of stories about fading stars, rising stars, the toxicity of ego and the struggle to balance career and romance—as you watch this new movie, you feel like you’ve known its contours all your life—but the predictability is part of these characters’ tragedy. —Tim Grierson\n\nYear: 2019\n\nDirector: Alex Ross Perry\n\nStars: Elisabeth Moss, Amber Heard, Cara Delevigne, Ashley Benson, Dan Stevens, Agyness Deyn, Gayle Rankin\n\nGenre: Drama\n\nRotten Tomatoes Score: 83%\n\nRating: R\n\nRuntime: 134 minutes\n\nWatch on HBO\n\n\n\n\n\nHer Smell chronicles the fall and rise of Elisabeth Moss’s Becky Something, a Courtney Love surrogate and frontwoman of the punk rock band Something She; Becky talks like a Wonderland character but acts like an uncaged animal. Moss being an actress whose greatest asset is her eyes, and Perry being a filmmaker who fixates on the human gaze, Becky spends the movie staring either at other characters or into the camera. Her eyes burn like toxic twin moons. The movie’s first three quarters light the match of her self-immolation. In the punk rock world there’s little more stultifying than commercial success; add in a poisonous personality and an enthusiastic drug habit and Becky’s unmaking—by her own hand—is assured. Yet, the film’s final act redeems her, such as Perry’s movies redeem anyone. In contrast to his other work, Her Smell is compassionate, even tender; Becky, later seen sober, washed up and repentant for her years as a monster fed on abusing her ex-husband (Dan Stevens), her bandmates (Agyness Deyn, Gayle Rankin) and her mother (Virginia Madsen), sings a devastatingly moving cover of Bryan Adams’ “Heaven” to her daughter in a moment equally as gentle as it is painful. Even in the recovery phase, Her Smell delicately walks a perilous tightrope and arrives on the other side as the masterpiece of Perry’s career. —Andy Crump\n\nYear: 1997\n\nDirector: George Armitage\n\nStars: John Cusack, Mini Driver, Dan Aykroyd, Alan Alda, Joan Cusack\n\nGenre: Comedy, Mystery & Suspense\n\nRotten Tomatoes Score: 79%\n\nRating: R\n\nRuntime: 107 minutes\n\nWatch on HBO\n\n\n\n\n\nIn the role that probably set the foundation for High Fidelity’s Rob, John Cusack plays Martin Q. Blank as a vaguely charming, vaguely confident, vaguely organic hitman—the kind of guy one would never suspect is good at killing people for a living. Except: Blank is from the vaguely wealthy Detroit suburb of Grosse Pointe, which means that he’s one of many formless Michigander schlubs who go one to do things no one has ever expected of them. Before the 2008 Recession, Oakland County, one of Detroit’s surrounding counties, a very popular member of the Metro Detroit family, was among the absolute richest counties in the country. Like Orange County rich. And still no one seems to really remember that—back in even 1997, when the car companies were slaying, no one expected much from a Michigander. Grosse Pointe Blank epitomizes that befuddling state-wide middle child complex in John Cusack’s thoroughly, anxiously casual performance. —Dom Sinacola\n\nYear: 2018\n\nDirector: Morgan Neville\n\nGenre: Documentary\n\nRotten Tomatoes Score: 98%\n\nRating: PG-13\n\nRuntime: 94 minutes\n\nWatch on HBO\n\n\n\n\n\nMorgan Neville’s winning portrait Won’t You Be My Neighbor? withholds darkness. Which makes sense since the Oscar-winning director of 20 Feet From Stardom has turned his attention to Fred Rogers, a kindly TV personality who entertained a couple generations of kids with his benign PBS program Mister Rogers’ Neighborhood. Rogers died in 2003 at the age of 74, and this year marks the 50th anniversary of his landmark show, so expect plenty of tributes over the next several months. Appropriately, as an official chronicling of the man’s life and legacy, Won’t You Be My Neighbor? isn’t remotely innovative. We get polished interviews from colleagues, family members and Rogers’ widow. There are plenty of clips from his show, as well as other archival material. There’s a gimmick-y recurring use of animation to illustrate parts of his story that’s the only truly cloying element of a film that mostly eschews mawkishness. And yet, Won’t You Be My Neighbor? is a stunningly moving film that also feels just the teensiest bit radical. That word will be used a lot during this golden anniversary for Mister Rogers’ Neighborhood, as his fans remind everyone that, rather than starring a smiling square who couldn’t have looked less manly, the show was actually a pretty progressive program that frankly discussed everything from race relations to John F. Kennedy’s assassination. Neville accentuates Rogers’ unembarrassed sweetness as an example of his principled stand against bigotry and injustice, making the case with conviction and gusto.\n\nAt my True/False screening, the audience was warned before Won’t You Be My Neighbor? that we ought to have Kleenex in hand to prepare for what we were going to experience. I’m an unashamed movie crier, but I resent being prepped for how I should feel about a movie I’m about to see. And yet, the warning was warranted: The tears elicited from Won’t You Be My Neighbor? are a testament to Neville’s tasteful, loving (but not fawning) depiction of a decent, unassuming man. The movie’s not just a balm in the age of Trump—it’s an opportunity for viewers to reconnect with their own decency, and Neville’s gentle skill at arguing for goodness ends up being a minor miracle. —Tim Grierson\n\nYear: 2018\n\nDirector: James Wan\n\nStars: Jason Momoa, Amber Heard, Patrick Wilson, Nicole Kidman, Willem Dafoe, Yahya Abdul-Mateen II, Dolph Lundgren\n\nGenre: Superhero, Action & Adventure, Science Fiction & Fantasy\n\nRotten Tomatoes Score: 66%\n\nRating: PG-13\n\nRuntime: 143 minutes\n\nWatch on HBO\n\n\n\n\n\nPaying environmental catastrophe lip service is an expected thematic conceit for movies in 2018, but no one (hypothetically) wants to pay to sit in a damp two hours and 20 minutes of guilt when every film in this Universe to come before was either suffocatingly grim or unfairly tasked with shouldering the entire weight of Hollywood’s misogyny. All Wan had to do was deliver a blisteringly colorful spectacle. Aquaman is dumb and loud and really dumb and too long and dumb but also wonderfully creative and shameless; it’s both the superhero film we need, and the one we deserve.\n\nThe plot, as is the case in almost every DCEU entry, is as bloated as it is messy and predictable, a whale carcass washed up on shore sliced in half by Atlantean plasma lasers during a Two Towers-league battle with an army of crab people. Those action scenes, though. Revolutionary at best, innovative at worst, Wan and his team have taken what Justice League incapably worked around—talking/interacting/fighting/living underwater—and transformed that obstacle into a marvelous strength, using the omnidirectional freedom of subterranean saltwater violence to make up for the “everyone is flying” bullshit of Zack Snyder’s wet dreams while never abandoning the unique physics (limitations) of all that wetness. A late film battle scene between Orm’s hordes and the aforementioned talking crustaceans is astounding: a feat of design and imagination for which James Wan should understand that this is most likely why he’s on this Earth. Likewise, while the surface scenarios featuring Arthur and Mera searching for a lost trident that holds the key to saving the world just add needless fat to an already drowning runtime, one rooftop, wall-obliterating sequence shines, a demonstration of Wan’s formidable grip on action grammar, pushing long takes and swooping crane shots to establish a seamless, real-time geography for Mera (Amber Heard), Arthur (Jason Momoa) and Black Manta (Yahya Abdul-Mateen II) to just wreck each other’s day. Bell towers explode; the living rooms and privacy of more than two Sicilian grandmothers are violated. Granted, the scene exists for its own sake, devoid of narrative stakes and sense, but that’s hardly ever been a valid argument against any contemporary studio movie anyway. If Justice League was a self-aware course correction, then Aquaman is course correction as business model, a denial of much of what Snyder established, leaning hard into Momoa’s charm and Wan’s old-school fantasy proclivities. May Martha bless us, everyone. —Dom Sinacola\n\nYear: 2019\n\nDirector: Joe Cornish\n\nStars: Patrick Stewart, Rebecca Ferguson, Louis Ashbourne Serkis, Dean Chaumoo, Tom Taylor, Rhianna Dorris, Angus Imrie\n\nGenre: Action & Adventure, Science Fiction & Fantasy, Kids & Family\n\nRotten Tomatoes Score: 89%\n\nRating: PG\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nWhat better time to retell the King Arthur origin story as a witty, charming and rousing family fantasy/adventure? The Kid Who Would Be King reminds its core audience—and perhaps even some adults—that we might still find hope in our future leaders if passé values like compassion, chivalry, compromise, virtue and honor are remixed back into society. Any creative tasked with reinvigorating a public domain myth would do well to take notes from writer-director Joe Cornish’s thrillingly fresh take on the Arthurian legend. The legend tells, in the form of boisterous opening narration accompanied by some colorful children’s textbook animation, that Arthur and his brave knights were able to defeat Arthur’s evil sister, Morgana (Rebecca Ferguson), and cast her into the bowels of hell. However, Morgana vowed to come back and cover the land in darkness when the land is once again bitterly divided the way it was before Arthur’s time. Cut to post-Brexit England, where half the country despises the other half, which Morgana understandably takes as an invitation to unleash her army of minions to take back the land. Will a hero of Arthurian stature show up to challenge her once again? That hero, in true ’80s-style children’s fantasy fashion, comes in the form of a meek but pure-of-heart 12-year-old named Alex (Louis Ashbourne Serkis, an 11 on the instant adorability meter), who not only has to contend with the surrounding culture and media constantly reminding him how his country’s about to implode, but has to defend himself and his even nerdier best friend, Bedders (Dean Chaumoo), against school bullies Lance (Tom Taylor) and Kaye (Rhianna Dorris). Those familiar with the Arthurian legend might predict where this story’s going simply by looking at the character names, but Cornish’s specialty, as evidenced by his terrific London alien invasion adventure Attack the Block, lies is in applying sci-fi/fantasy tropes to invigorating new settings. The Kid Who Would Be Kid hits the family classic trifecta: Spectacular fun for kids and adults, full of important themes and a rebellious attitude in regard to the wide range of things grownups are messing up. —Oktay Ege Kozak\n\nYear: 2018\n\nDirector: Carlos López Estrada\n\nStars: Daveed Diggs, Rafael Casal, Janina Gavankar, Ethan Embry, Tisha Campbell-Martin\n\nGenre: Drama, Comedy\n\nRotten Tomatoes Score: 94%\n\nRating: R\n\nRuntime: 95 minutes\n\nWatch on HBO\n\n\n\n\n\nMovies like Blindspotting, kitchen sink movies in the business of tackling as many subjects and relevant social issues as they can squeeze into two hours, tend to risk overstuffing: They try to be about everything, so end up being about nothing. Let Blindspotting serve as an object lesson in keeping the sink tidy and organized, its \"about everything\" narrative built around an anchor, being Oakland, that holds the \"everything\" in place, from police violence, to gentrification, to cultural appropriation and code switching, to workaday prejudice and systemic racism. Blindspotting is about Oakland first, the contemporary woes weighing Oakland down second and the overarching problems of the time we live in a close third. Above all else it is about the vigor of Daveed Diggs and Rafael Casal, its co-leads and authors, who, having spent nine years writing the script, have finally realized their vision, an ode to their hometown and a timelapse snapshot of America. The film is uplifted by Diggs’ and Casal’s raw talent as storytellers, poets and MCs—Diggs’ hyperkinetic rapping is one of the film’s best merits—but its backbone is a product of the emphasis put on its backdrop. —Andy Crump\n\nYear: 2016\n\nDirectors: Ethan Coen, Joel Coen\n\nStars: George Clooney, Tilda Swinton, Josh Brolin, Ralph Fiennes, Jonah Hill, Alden Ehrenreich, Christopher Lambert, Channing Tatum, Scarlett Johansson\n\nGenre: Comedy\n\nRotten Tomatoes Score: 86%\n\nRating: PG-13\n\nRuntime: 106 minutes\n\nWatch on HBO\n\n\n\n\n\nThe period zaniness of Joel and Ethan Coen’s Hail, Caesar! is an ode to old Hollywood—and much more—as only they can do, tracing the efforts of James Brolin’s studio scandal fixer through a parade of 1950s soundstages, back lots and actors. His latest potential headline concerns the abduction of a Biblically epic movie star—George Clooney having a helluva good time doing his best Chuck Heston/Kirk Douglas amalgam—by what turns out to be a tea sandwich-serving think tank of communists. Other subplots have Scarlett Johansson’s starlet plotting out her unwed motherhood in the public eye and the screen makeover of an unsophisticated cowboy by Ralph Fiennes’ debonairly enunciating director, Laurence Laurentz. There are dueling gossip columnist twins (Tilda Swinton pulling double duty), a hapless film editor (Frances McDormand) and scattered movies-within-the-movie, which even pauses midway through for a thoroughly enchanting—and cheeky—Gene Kelly-styled song-and-dance number starring Channing Tatum as a heavily made-up matinee star with controversial extracurricular activities. Most of the main characters/performances take blatant inspiration from Hollywood legends of yore, and the cast seems to have as much fun as the Coens. Hail, Caesar! is by no means their best work, but it’s characteristically gorgeous, spiritedly acted and rife with political, religious and creative (sub)text for moviegoers as thoughtful and dorky as Joel and Ethan themselves. —Amanda Schurr\n\nYear: 1986\n\nDirector: Robert Harmon\n\nStars: C. Thomas Howell, Jennifer Jason Leigh, Rutger Hauer\n\nGenre: Horror, Thriller\n\nRotten Tomatoes Score: 61%\n\nRating: R\n\nRuntime: 98 minutes\n\nWatch on HBO\n\n\n\n\n\nIn horror films, there’s something alluring to a relentless and unstoppable killer whose motivation is only to destroy innocent life with nihilistic, almost supernatural fervor. Part of the reason the original Halloween is still so frightening lies in its chillingly effortless ability to present Michael Myers as a figure of death itself: no reason, no rhyme, he won’t stop until you stop breathing. The original The Hitcher operates on many of the same levels, as the simplicity of its premise about a couple (C. Thomas Howell and Jennifer Jason Leigh, who takes on a dual role, as the top and bottom halves of her body) hounded by a murderous maniac hitchhiker (Rutger Hauer) takes full advantage of the unresolved mystery surrounding the killer’s motivations. (Transform the truck from Duel into Rutger Hauer, and you get The Hitcher.) Director Robert Harmon’s film casts an appropriately icky, low-grade aura, perfectly fitting the killer’s philosophical point-of-view, an aesthetic approach that eludes the makers of the ill-fated 2007 remake, which looks too glossy to work on a visceral level. Also, with all due respect to Sean Bean, he’s no Rutger Hauer. —Oktay Ege Kozak\n\nYear: 1988\n\nDirector: Don Bluth\n\nStars: Gabriel Damon, Candice Hutson, Pat Hingle, Helen Shaver, Will Ryan\n\nGenre: Animation, Kids & Family\n\nRotten Tomatoes Score: 72%\n\nRating: G\n\nRuntime: 70 minutes\n\nWatch on HBO\n\n\n\n\n\nIt’s hard to overstate what a major development it was for Don Bluth to leave Disney in 1979 to form his own studio. Working during the actual reign of Walt Disney, starting as an in-betweener—the crucial artist whose job it is to fill in the frames of animation that add detail to the movement between poses—in 1955, he chafed under the cutbacks that hit the company in the ’70s just as he was about to direct films of his own. Ultimately he, Gary Goldman and 14 other animators jumped ship to start Don Bluth Productions. An American Tail (1986), the heartbreakingly true and important story of an immigrant family coming to America, was an incredible success from the standpoint of animation and storytelling. The company marketed the hell out of it and, for an animated film, it pulled decent numbers. It set the stage for The Land Before Time two years later in 1988, but already, the studio was struggling: Tail may have reached eyeballs and won acclaim, but it didn’t turn the studio a profit. Setting any story in the age of the dinosaurs is asking for tragedy, but you can still tell some tales of that era without focusing on the unavoidable fact that all their hopes and dreams and everything that they ever were is destined to be washed clean by nature. So what did Bluth and his team decide to do? Set the story during the end of days, of course.\n\nBeginning with a wonder-filled tour of the prehistoric landscape through which we’ll be roaming, The Land Before Time introduces our hero, a baby dino named Littlefoot (voiced by Gabriel Damon), paired with narration that tells us his herd is dying and the plants are shriveling. Bluth’s creative team and their financiers fought over the tone of the movie, and it’s easy to see why the money men were alarmed. Who wants a light-hearted kid’s movie to grapple with childhood orphaning and abandonment, all set while the inevitable end of the world plays out? Littlefoot is orphaned in the first few minutes of the film when a T-Rex violently kills his mother, then is joined on his journey by other orphaned or abandoned dino babies with their own neuroses. Littlefoot struggles at the head of his little band to keep the faith and continue plodding onward toward the legendary Great Valley when every circumstance along the way taunts them with doubt. The Land Before Time clearly wanted to be a movie that was about coping with loss, being changed by it, but it ended up an adventure movie with a happy ending that leaves most of that solemnity as weighty subtext. It’s debatably one of Bluth’s best movies, and I’d even argue one of the best animated movies of the ’80s. It was also one of the last bright spots of Don Bluth’s film catalogue. —Kenneth Lowe\n\nYear: 2006\n\nDirector: Werner Herzog\n\nStars: Christian Bale, Steve Zahn, Jeremy Davies\n\nGenre: Drama, Action & Adventure, War\n\nRotten Tomatoes Score: 90%\n\nRating: PG-13\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nAs PG-13 as a war movie can get, Werner Herzog’s cinematic re-creation of his own documentary (Little Dieter Needs to Fly) feels as if, like any Herzog film can, it was re-created on the fly. Rescue Dawn avoids a strict adherence to the truth of Dieter Dengler’s ordeal, in which he served as a pilot for the U.S. Navy during the Vietnam War, shot down over Laos then captured and tortured for months before escaping. It’s also historically inaccurate, as only any Herzog film can be, for the benefit of the more “ecstatic” truth the director was attempting to reach, ignoring the complaints of Dengler’s fellow prisoners’ accounts, which mostly have to do with how heroically Herzog portrays Dengler (Christian Bale) and how pathetically he imagines the others. Herzog saw himself in the real Dengler anyway—they were both born poor in Hitler’s Germany—and Bale seems to intuit the director’s projection, playing Dengler as an endlessly fascinating hybrid of wide-eyed innocent and arrogant American, fully committed to the freedom and opportunities for self-aggrandizement that being an American affords. And yet, Rescue Dawn doesn’t defend Dengler’s patriotism, or really have anything poignant to offer about American’s checkered military past. Instead, Herzog is concerned as ever with the tyranny of Nature and all powers like it, which happen to include war, America, the ambition of Man, whatever—an idealistic guy like Dieter Dengler can only suffer, survive and then tell his story later to a director who will warp its facts to keep the true extent of the man’s suffering from the cold, calculating judgment of the MPAA. —Dom Sinacola\n\nYear: 2018\n\nDirector: Clint Eastwood\n\nStars: Clint Eastwood, Bradley Cooper, Michael Peña, Laurence Fishburne, Diane Wiest\n\nGenre: Drama\n\nRotten Tomatoes Score: 70%\n\nRating: R\n\nRuntime: 116 minutes\n\nWatch on HBO\n\n\n\n\n\nEarly in Clint Eastwood’s latest directorial feature—somewhere around his 70th film—shambling Everyman Earl Stone (Eastwood) explains to a young person he’s just met the stickers that litter the back window of his equally shambling pickup, decals telling of the everywheres he’s been, man, comparable to the Johnny Cash song we’ll later hear him sing along to in the film. “That’s right, 41 states,” he recalls, then adds, “out of 50.” Most viewers would not need such a clarification—perhaps it’s a subtle nod to Earl’s casual racism, which the film will explicate further farther on, as in this case he’s talking to a Mexican man who will introduce him to the lucrative late-in-life career of drug muling, or perhaps Eastwood simply said that, because he’s acting, and left it in, because why not? Let’s move on, he seems to be saying. Let’s not get hung up on it.\n\n2018 was an odd year for the 88-year-old director, mostly because of The 15:17 to Paris, in which Eastwood followed Spencer Stone, Anthony Sadler and Alek Skarlatos as they played themselves reenacting their thwarting of the 2015 Thalys train attack, though Eastwood mostly seemed to want to tag along as they reenacted the European trip which led up to the heroic event. Their knowledge of Hitler’s suicide is questioned, their selfies are documented, their ordering of gelato detailed for much longer than any director, any viewer, would expect. And The Mule beautifully throws its much weirder predecessor into focus: In the twilight of his career, Clint Eastwood celebrates the things he loves about life, which happens to be driving, and pulled pork, and the American Southwest, and flowers, and big round butts, and the industriousness of working hard in order to enjoy the aforementioned everything, without judgment. Because Earl Stone, estranged from his family and definitely a bad father/husband, can somehow get an erection at such an advanced age, which Eastwood implies by having Stone engage in at least two threesomes. We’re not supposed to wonder how, but instead not get hung up on it—sex is good, and sex with more than one person, especially with more than one person who has a big round butt, is better. That doesn’t make you a bad person; it makes you a person who enjoys life before it’s gone. Ordering gelato, driving through the desert listening to Johnny Cash, making millions off of the illegal drug trade—that’s part of the mundane wonder of life, a life which must thrive against the forces of an American economy that in the past decade or so no longer leaves room for such pleasures, or understands that when a man is casually racist, it’s not because he’s actually racist, it’s because even at 88 he has so much more to learn, and that’s why life is worth pushing long past the point at which pushing seems futile. Does that make sense? Let’s move on. —Dom Sinacola\n\nYear: 2019\n\nDirector: Robert Rodriguez\n\nStars: Rosa Salazar, Christoph Waltz, Jennifer Connelly, Mahershala Ali, Ed Skrein, Keenan Johnson, Jackie Earle Haley\n\nGenre: Science Fiction & Fantasy, Action & Adventure\n\nRotten Tomatoes Score: 61%\n\nRating: PG-13\n\nRuntime: 116 minutes\n\nWatch on HBO\n\n\n\n\n\nAlita: Battle Angel begins with Dyson Ito (Christoph Waltz), doctor to cyborgs, scavenging through a junkyard full of spare parts in order to find anything he can use. What better way to start a film than with a metaphor about itself? Just like Dr. Ito, director Robert Rodriguez and co-writer/co-producer James Cameron sift through the remnants of established sci-fi and cyberpunk properties in order to glue together a recognizable and cohesive narrative within the confines of its genre. Considering the talent involved, it’s not surprising that the finished product is a frequently fun and kinetic, visually pleasing sci-fi/actioner, albeit one that doesn’t have a single new or fresh part embedded in it. Again considering the talent involved, that feels like a lost opportunity. Based on the popular manga, Gunnm, Alita: Battle Angel mostly takes its visual cues and narrative structure from a 1993 anime adaptation. That anime is barely an hour long, yet manages to pack in a sprawling cyberpunk universe with a deep and complex lore that supports whatever over-the-top tech fetish cyber action it throws at you. The story follows Alita (Rosa Salazar), whom Dr. Ito finds during his junk hunt and brings back to life. Her brain is human, but the rest of her is artificial. Just like a cyborg version of Jason Bourne, she doesn’t remember her past, but has supreme ass-kicking instincts, leading Ito to suspect some sinister military use in her past. The future world that Battle Angel inhabits is the lovechild of Blade Runner and Mad Max, a grimy post-apocalyptic city that’s also a grand, overpopulated cyberpunk metropolis. Apart from Alita gradually figuring out her ass-kicking skills, there’s another clear reason for giving the character amnesia: So she can be used as an exposition dump to settle the audience into the story’s world and the hodgepodge of various sub-plots that co-screenwriters James Cameron, Laeta Kalogridis and Robert Rodriguez cram into a two-hour runtime. However, when the fighting finally begins, Battle Angel gets its metallic ass in gear. Rodriguez pushes the confines of the PG-13 rating to create some genre- and source-material-appropriate hack-and-slash gruesomeness with a significant amount of cyborg bodies split in half, decapitated and torn to pieces. For fans of the manga and anime, there isn’t much in the way of new material to be found here, though nor is it likely to grate on one’s fandom to the extent that the Ghost of the Shell live-action adaptation did. For fans of futuristic sci-fi/action, it should provide an engaging experience. —Oktay Ege Kozak\n\nYear: 2016\n\nDirector: Paul Feig\n\nStars: Kristen Schaal, Maya Rudolph, Melissa McCarthy, Wendi McLendon-Covey, Ellie Kemper\n\nGenre: Comedy\n\nRotten Tomatoes Score: 90%\n\nRating: R\n\nRuntime: 125 minutes\n\nWatch on HBO\n\n\n\n\n\nUnlike The Hangover, which was basically a long comedy sketch, Bridesmaids is actually a movie. This is always the big question when it comes to comedies: Should you aspire to make a full cinematic experience and risk coming up short (Wedding Crashers) or do you simply shoot for non-stop emotionless laughs and achieve wild success at a less transcendent achievement (Anchorman)? Bridesmaids is a thoroughly hilarious, full-bodied story thanks to the brilliance of Kristen Wiig, and it has staying power in the pantheon of less aspirational film comedy. —Ryan Carey\n\nYear: 2018\n\nDirector: Susan Lacy\n\nGenre: Documentary\n\nRotten Tomatoes Score: 96%\n\nRating: NR\n\nRuntime: 133 minutes\n\nWatch on HBO\n\n\n\n\n\nIn Susan Lacy’s comprehensive new documentary, Jane Fonda in Five Acts, the legendary Hollywood actress and activist opens up for the cameras. Fonda is unnervingly candid with her own narration, talking through her history of eating disorders, her mistakes during her radical period and her childhood, which was privileged but deeply troubled. From her bombshell period during the release of Barbarella to her burgeoning political awakening in the ‘Nam era, the HBO-made doc probes into both the familiar and unfamiliar with an earnest and judicious use of nonfiction resources. The five acts in question are divided cleverly by Lacy into a chronological structure based on the definitive men in Fonda’s life: her father Henry, to start, and several of her husbands. If this might raise a quizzical eyebrow, it is in fact a telling deconstruction of Fonda’s glamorous and cloistered existence. Although her life, image and star persona were forever set to be owned and judged by men, Fonda has spent decades living and working on her own terms. Now 80 years old, seeing Fonda examine her long public life—acknowledging the mistakes she has made along the way—is unmissable. With its many talking heads and archival footage, the film is not exactly groundbreaking, but it is well-crafted, allowing Fonda’s frankness and courage in the face of an industry and an era set to work against her to stand out most of all. —Christina Newland\n\nYear: 2019\n\nDirector: Christopher Landon\n\nStars: Jessica Rothe, Israel Broussard, Phi Vu, Suraj Sharma, Sarah Yarkin, Ruby Modine, Rachel Matthews, Steve Zissis\n\nGenre: Horror, Comedy, Thriller\n\nRotten Tomatoes Score: 70%\n\nRating: PG-13\n\nRuntime: 120 minutes\n\nWatch on HBO\n\n\n\n\n\nBack in 2017, Happy Death Day, Christopher Landon’s delightful horror romp, looked like a closed circuit. Much as its heroine, Tree (Jessica Rothe), found a way to cut off the time loop that caused her, Groundhog Day style, to relive ad infinitum a birthday that ended with violent death at the hands of a masked killer, Landon appeared to have crafted that rarest thing: a franchise-proof slasher. When Happy Death Day wraps up, Tree’s would-be murderer is dead, she has her life figured out, and she doesn’t have to do the time warp again. Fin! But no film’s fully inoculated against the primal drive for more money, so here’s Happy Death Day 2U. The sequel opens on Ryan (Phi Vu), roomie of and pal to Carter (Israel Broussard), Tree’s love interest across timestreams, awakening in his car and running afoul of angry dogs, angry homeless people and angry students on his way back to his dorm. He goes about his day, takes a knife to the chest from a new Babyface killer, then wakes up to relive these mundane events. Turns out he’s responsible for that whole time loop thing. He’s a science nerd! For whatever baffling reason, he and fellow nerds Samar (Suraj Sharma) and Dre (Sarah Yarkin) have access to a crazy sci-fi plot device capable of —wait for it—creating quantum nonsense that births time loops. Ryan screws everything up afresh, forcing Tree to relive the same day again again, with a few key differences, and thus die more times than she has digits to save the day. Happy Death Day 2U makes deliberate moves away from horror, adding both science fiction and comedy to muddle the original mixture for better and also worse. For better: The film is even more of a gas than its predecessor. For worse: It’s not as much of a horror movie. Happy Death Day 2U has been made once before, back in 2013, when Joseph Kahn dropped Detention on the world and blew minds by breaking formula. But Landon’s version is still pretty damn good, further evidence that Rothe is a superstar in the making and that even the most anti-franchise film can produce a surprisingly strong sequel with enough enthusiasm and brash creativity. —Andy Crump\n\nYear: 2019\n\nDirector: David F. Sandberg\n\nStars: Zachary Levi, Asher Angel, Jack Dylan Grazer, Mark Strong, Grace Fulton, Ian Chen, Jovan Armand, Faithe Herman, Djimon Hounsou\n\nGenre: Superhero, Science Fiction & Fantasy, Action & Adventure\n\nRotten Tomatoes Score: 90%\n\nRating: PG-13\n\nRuntime: 130 minutes\n\nWatch on HBO\n\n\n\n\n\nThe best thing one can say about Shazam! is that, following on the fins of the wonderfully extravagant and amazingly stupid Aquaman, the latest DC movie is one more sign to assure the proletariat that the imprint has permanently dislodged its head from the asshole of Zack Snyder’s Murderverse. While Wonder Woman mused that, hey, maybe a DC movie need not labor over traumatized backstories and hypermasculinized mommy issues, and Aquaman suggested that blockbuster movies can have things like “color” and “humor,” Shazam! synthesizes those mommy issues into a positive treatise on family, doubling down on the jokes and bright primary shininess. The plot, by-the-numbers, floats somewhere between a Spielberg coming-of-age adventure, a Big reboot and a late-’80s horror comedy—think The Monster Squad in that it’s intended for kids but is too old for its ostensible demographic. If only Shazam! were as much a herald as its DCEU forebears, for better or ill, a sign of something new and exciting to come. It’s not. It is, despite its surprisingly gruesome violence, little more than another superhero movie that will make more money than the GDP of a small island nation. Leaning real hard into the jokes about horny teenage boys and meta-skewerings of superhero films, Shazam! can’t help but comment on its genre ad nauseam, though, unlike Deadpool, it never risks arguing against its own existence. It’s, more often than not, a very funny movie, and a superhero film with a budget under $100M is a (sigh—sorry, Mom) refreshing development for the genre. Plus, a diverse cast is always welcome, even if headlined by Zachary Levi, who must realize how goddamn lucky he is to get the one remaining superhero role where it conceptually pays off to be a generically attractive white guy. —Dom Sinacola\n\nYear: 2019\n\nDirector: Rob Letterman\n\nStars: Ryan Reynolds, Justice Smith, Kathryn Newton, Bill Nighy, Ken Watanabe, Chris Geere, Suki Waterhouse\n\nGenre: Science Fiction & Fantasy, Action & Adventure, Kids & Family\n\nRotten Tomatoes Score: 69%\n\nRating: PG\n\nRuntime: 104 minutes\n\nWatch on HBO\n\n\n\n\n\nStarring Ryan Reynolds as a PG version of Deadpool and wide-eyed baby angel Justice Smith, Pokémon Detective Pikachu tosses together the Pokémon fanbase with lightly grizzled noir cinema, a coming-of-age story and a dash of family drama. While that may seem like a meal with too many ingredients, the result is rather filling. Tim Goodman (Smith) exists at that stage of early adulthood when friends slip away to different corners of the globe, and one’s direction in life must be decided. Tim contents himself with the life he’s built as a junior insurance adjustor. When he learns his policeman father has been killed in the line of duty, he travels to the literal urban jungle of Ryme City, where humans and Pokémon live side by side in adorable harmony. Of course, his father’s death isn’t cut and dry. Soon, with the help of his father’s Pokémon partner, Pikachu, Tim becomes an investigator in his own right, navigating the not-so-mean streets of Ryme City and learning to dream bigger than he ever dared before. Visually the film builds on Pikachu’s love of noir by creating a neon noir world. Instead of relying on shadows and inky blacks to create mystery, cinematographer John Mathieson (Gladiator) uses the neon glow of city signs to banish nearly all shadows from the frame. Blacks create a nice contrast but only reach a complete lack of light in a car crash scene. Lighting the film’s darker moments with neon makes the transition to the sunnier, more family-focused moments a smooth one. And really: The cute factor of this film cannot be overstated. This film is fantasy, and the results are magical. It completely skips the uncanny valley in favor of a wickedly fun, albeit unnatural look, capturing the spirit of its source material as effectively as a well-aimed Poké Ball. —Joelle Monique\n\nYear: 2018\n\nDirector: Shane Black\n\nStars: Boyd Holbrook, Trevante Rhodes, Olivia Munn, Keegan-Michael Key, Jacob Tremblay, Sterling K. Brown, Alfie Allen, Thomas Jane, Augusto Aguilera\n\nGenre: Science Fiction & Fantasy, Action & Adventure\n\nRotten Tomatoes Score: 32%\n\nRating: R\n\nRuntime: 118 minutes\n\nWatch on HBO\n\n\n\n\n\nThere was no need for The Predator, a vague sequel to iconic action potboiler Predator and 1990’s dated, vulgar bloodbath, Predator 2, starring Danny Glover as Lt. Mike Harrigan, a weird old man who has no friends but does have a healthy obsession with oversized handguns and phallic metaphors that illustrate he might actually not know how penises work. As with most things in 2018, there was no need for a reboot, or sequel, or whatever, yet it exists anyway, and in the more-than-capable imagination of Shane Black, The Predator works—it works hard—to hybridize the many foundational successes of the Predator franchise. Aping the plot structure, humid aura of testosterone and ‘80s action-thriller chops of the original, as well as the meta-violent, tone deaf vulgarity of 2, The Predator is a funhouse of “fuck”-leaden witticisms and grotesque CGI bloodletting, an old-fashioned franchise staple infused with Black’s voracious knack for crafting the best the Hollywood machine has to offer. Which also means that it’s too often barely coherent, that it ends with obvious intentions for a sequel and a closing line that so shamelessly does not give a shit about anything you might leave the theater feeling like you just got royally trolled. Still, it’s difficult to deny that the film is a loud, bloated mess, wistful about everything in the Predator series except for the movie that began it all, John McTiernan’s bare-bones-and-sinew ode to the Platonic ideal of the male body, smeared in mud and galloping through the jungle. The Predator, instead, is an ode to the success of that first movie, to making movies simply because one can, not because one should. Here’s to hoping they make another. —Dom Sinacola", "images": ["https://cdn.pastemagazine.com/www/articles/2020/03/10/alien-hbo-ripley-main.jpg"], "top_img": "https://cdn.pastemagazine.com/www/articles/2020/03/10/alien-hbo-ripley-main.jpg", "keywords": [], "authors": ["Allison Keene", "Paste Staff", "Lacy Baugher", "Katy Mayfield", "Scott Russell", "Whitney Friedlander", "Jim Vorel", "Paste Movies Staff", "Ellen Johnson", "Garrett Martin"], "canonical_link": "https://www.pastemagazine.com/movies/hbo/best-movies-on-hbo/", "title": "The 50 Best Movies on HBO Right Now (April 2020)", "meta_data": {"title": "The 50 Best Movies on HBO Right Now (April 2020) - Paste Magazine", "description": "Here are the best movies HBO has to offer right now, including the first two 'Alien' films, 'Raising Arizona' and 'Punch-Drunk Love'.", "keywords": "a star is born, aquaman, clint eastwood, deadwood, frantic, george clooney, hbo, hbo go, hbo now, jennifer lopez, steven soderbergh, what to watch, shazam, alien, aliens, james cameron, ridley scott, sigourney weaver, john wick, keanu reeves, adam sandler, The 50 Best Movies on HBO Right Now (April 2020), Lists, Lists, Articles, Paste", "news_keywords": "a star is born, aquaman, clint eastwood, deadwood, frantic, george clooney, hbo, hbo go, hbo now, jennifer lopez, steven soderbergh, what to watch, shazam, alien, aliens, james cameron, ridley scott, sigourney weaver, john wick, keanu reeves, adam sandler", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "apple-mobile-web-app-title": "Paste Magazine", "og": {"image": {"identifier": "https://cdn.pastemagazine.com/www/articles/2020/03/10/alien-hbo-ripley-main.jpg", "width": 854, "height": 480}, "type": "article", "url": "https://www.pastemagazine.com/movies/hbo/best-movies-on-hbo/", "title": "The 50 Best Movies on HBO Right Now (April 2020)", "site_name": "pastemagazine.com", "description": "Here are the best movies HBO has to offer right now, including the first two 'Alien' films, 'Raising Arizona' and 'Punch-Drunk Love'."}, "article": {"tag": "adam sandler", "section": "Movies", "published_time": "2019-10-21T10:57:48-07:00", "modified_time": "2020-04-16T16:20:00-07:00", "publisher": "https://www.facebook.com/PasteMagazine"}, "twitter": {"card": "summary_large_image", "site": "@pastemagazine", "title": "The 50 Best Movies on HBO Right Now (April 2020)", "description": "Here are the best movies HBO has to offer right now, including the first two 'Alien' films, 'Raising Arizona' and 'Punch-Drunk Love'.", "image": "https://cdn.pastemagazine.com/www/articles/2020/03/10/alien-hbo-ripley-main.jpg"}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "viewport": "viewport-fit=cover, width=device-width, initial-scale=1.0, maximum-scale=1.0"}, "movies": [], "publish_date": 1571680668.0, "source": "https://www.pastemagazine.com", "summary": ""}