{"url": "https://www.rollingstone.com/music/music-news/craig-mack-flava-in-ya-ear-rapper-dead-at-47-127656/", "text": "Craig Mack, the rapper who had the first hit on P. Diddy’s iconic hip-hop label Bad Boy Records, died on Monday. He was 47.\n\nAccording to the New York Daily News, the rapper died of heart failure at his Walterboro, South Carolina home. His death was confirmed by Mack’s former producer Alvin Toney.\n\n“Craig Mack, you were the first artist to release music on Bad Boy and gave us our first hit,” Sean “Diddy” Combs tells Rolling Stone in a statement. “You always followed your heart and you had an energy that was out of this world. You believed in me and you believed in Bad Boy. I will never forget what you did for hip-hop. You inspired me, and I will continue to try to keep inspiring others. We will always love you.”\n\nMack is best known for the indelible classic “Flava in Ya Ear,” – a Top 10 hit in 1994 that sold over a million copies – and its subsequent remix featuring Notorious B.I.G, LL Cool J, Busta Rhymes and Rampage. The original would eventually reach No. 1 on the Billboard rap songs chart and No. 9 on the Hot 100 and earn a Best Rap Solo Performance Grammy nomination. “Craig is hip-hop’s George Clinton, because his stuff is really off the wall,” Diddy once told The New York Times. “He does what’s from his heart, which is where it starts for him. But his energy comes from somewhere else.”\n\nMack, born in the Bronx in 1970, helped make Bad Boy Records synonymous with New York hip-hop, kickstarting the label that would eventually make stars of Notorious B.I.G., Mase, 112 and more. In a 1995 profile in The New York Times, Mack said he was hooked on rap by his cousins at age nine and began to write his own lyrics at age 12. “I knew I wanted to be like LL Cool J and Run-D.M.C.,” Mack recalled.\n\nHe became friendly with members of another famous New York rap group, EPMD, and accompanied them on tour. He did odd jobs for the group and did not perform, but Mack still remembered the experience as a valuable one. “All the time I was getting an education learning about the studio and the road,” he explained.\n\nMack first started rhyming in the late 1980s. Under the name MC EZ, listed alongside DJ Troup, he released a single 12-inch on Fresh Records in 1988: “Just Rhymin'” b/w “Get Retarded.” The nimble B-side would become a fave among rap fans and was interpolated by Dr. Dre and LL Cool J for the single “Zoom.” Mack eventually met Diddy – who was at that time looking to set up Bad Boy after being fired from Uptown Records – outside the club Mecca in Manhattan. Mack freestyled for Diddy and earned a record contract.\n\nAfter breaking through with “Flava in Ya Ear” and its accompanying gold-certified album Project: Funk Da World, Mack struggled to replicate his initial success. He left Bad Boy Records and released Operation: Get Down in 1997 but did not score a hit from the album. Mack later appeared in the video for Diddy’s hit “I Need a Girl Part 1,” but his solo career never regained momentum.\n\nMack eventually became a minister in South Carolina and appeared to renounce his former life as a rapper in a 2012 video. The video, taken at the Overcomer Ministry commune in Walterboro, S.C., shows the group’s pastor Ralph Gordon Stair talking to Mack. “Craig Mack is dead,” Stair tells the congregation. “We have somebody that used to be Craig Mack.”\n\nIn Can’t Stop, Won’t Stop: The Bad Boy Story, the 2017 documentary chronicling the rise of Combs’ revered label and reunion tour, Mack can be heard discussing the possibility of returning to the stage, but declined because of his religious beliefs.\n\n“I don’t think anybody was disappointed,” Combs told Billboard last year. “We kind of respected his wishes. In this game, man, people don’t realize the music industry only has a one percent rate ratio, so sometimes it’s very stressful and it brings you only to places that you can go to and should go to, which is God. We can respect that because if any of us is still here, we’d have to go to him, too. Sometimes, people can’t walk back and forth in both worlds.”\n\nEarlier this year, Erick Sermon recruited Mack alongside Method Man and Mr. Cheeks for “Come Thru,” the first single off Sermon’s upcoming album. “I’m devastated over the news of Craig Mack,” Sermon tweeted. “We just finishing up his new album.”\n\n“It was a pleasure to know you & rock with you,” LL Cool J added. “You $tepped away from the game & did it your way.. I always respected that.”\n\n“I am grateful to have worked with him,” Missy Elliott tweeted. “He was so kind, funny & talented.”\n\nToney, who helped produce Project: Funk Da World, told the NY Daily News he was working on a documentary about Mack. “Nobody got to understand his story,” Toney said. “I wanted the world to know the talent he had. It was something I wanted people to enjoy, but it was cut short because he was very religious and wanted to go to church.”\n\nCraig Mack – “Flava in Ya Ear”\n\n\n\nCraig Mack – “Jockin My Style”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/craig-mack-dead-rapper-founder-bad-boy-records-f209f1f1-97b6-475f-bf48-f57baedd1753.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fcraig-mack-flava-in-ya-ear-rapper-dead-at-47-127656%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=127656", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/craig-mack-dead-rapper-founder-bad-boy-records-f209f1f1-97b6-475f-bf48-f57baedd1753.jpg", "keywords": [], "authors": ["Elias Leight", "Elias Leight'S Most Recent Stories", "See Toni Braxton S Homemade Video For", "Do It", "You Have A Tiktok Hit", "Now", "Quick", "Change The Title", "See Onipa S Bracing Video For", "Promised Land"], "canonical_link": "https://www.rollingstone.com/music/music-news/craig-mack-flava-in-ya-ear-rapper-dead-at-47-127656/", "title": "Craig Mack, ‘Flava in Ya Ear’ Rapper, Dead at 47", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Craig Mack, the former Bad Boy rapper who found success with \"Flava in Ya Ear,\" has died at the age of 46", "news_keywords": "Obituary", "og": {"type": "article", "title": "Craig Mack, 'Flava in Ya Ear' Rapper, Dead at 47", "url": "https://www.rollingstone.com/music/music-news/craig-mack-flava-in-ya-ear-rapper-dead-at-47-127656/", "description": "Former Bad Boy MC who left industry for religion dies of heart failure", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/craig-mack-dead-rapper-founder-bad-boy-records-f209f1f1-97b6-475f-bf48-f57baedd1753.jpg", "width": 1024, "height": 683, "alt": "Craig Mack, 'Flava in Ya Ear' Rapper, Dead at 46"}, "locale": "en_US"}, "article": {"published_time": "2018-03-13T13:07:00+00:00", "modified_time": "2018-06-25T15:52:12+00:00"}, "twitter": {"text": {"title": "Craig Mack, 'Flava in Ya Ear' Rapper, Dead at 47"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/craig-mack-dead-rapper-founder-bad-boy-records-f209f1f1-97b6-475f-bf48-f57baedd1753.jpg?w=1024", "alt": "Craig Mack, 'Flava in Ya Ear' Rapper, Dead at 46"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Craig Mack, ‘Flava in Ya Ear’ Rapper, Dead at 47", "description": "Craig Mack, the former Bad Boy rapper who found success with \"Flava in Ya Ear,\" has died at the age of 46"}, "generator": "WordPress 5.4", "author": "Elias Leight", "content_type": "Article", "post_id": 127656, "title": "Craig Mack, 'Flava in Ya Ear' Rapper, Dead at 47", "published_at": "2018-03-13 13:07:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/craig-mack-dead-rapper-founder-bad-boy-records-f209f1f1-97b6-475f-bf48-f57baedd1753.jpg?w=1024", "comment_count": 0, "tags": "Obituary", "topics": "Music News", "body": "Craig Mack, the rapper who had the first hit on P. Diddy's iconic hip-hop label Bad Boy Records, died on Monday. He was 47. According to the New York Daily News, the rapper died of heart failure at his Walterboro, South Carolina home. His death was confirmed by Mack's former producer Alvin Toney.\"Craig Mack, you were the first artist to release music on Bad Boy and gave us our first hit,\" Sean \"Diddy\" Combs tells Rolling Stone in a statement. \"You always followed your heart and you had an energy that was out of this world. You believed in me and you believed in Bad Boy. I will never forget what you did for hip-hop. You inspired me, and I will continue to try to keep inspiring others. We will always love you.\"Mack is best known for the indelible classic \"Flava in Ya Ear,\" – a Top 10 hit in 1994 that sold over a million copies – and its subsequent remix featuring Notorious B.I.G, LL Cool J, Busta Rhymes and Rampage. The original would eventually reach No. 1 on the Billboard rap songs chart and No. 9 on the Hot 100 and earn a Best Rap Solo Performance Grammy nomination. \"Craig is hip-hop's George Clinton, because his stuff is really off the wall,\" Diddy once told The New York Times. \"He does what's from his heart, which is where it starts for him. But his energy comes from somewhere else.\"Mack, born in the Bronx in 1970, helped make Bad Boy Records synonymous with New York hip-hop, kickstarting the label that would eventually make stars of Notorious B.I.G., Mase, 112 and more. In a 1995 profile in The New York Times, Mack said he was hooked on rap by his cousins at age nine and began to write his own lyrics at age 12. \"I knew I wanted to be like LL Cool J and Run-D.M.C.,\" Mack recalled.He became friendly with members of another famous New York rap group, EPMD, and accompanied them on tour. He did odd jobs for the group and did not perform, but Mack still remembered the experience as a valuable one. \"All the time I was getting an education learning about the studio and the road,\" he explained. Mack first started rhyming in the late 1980s. Under the name MC EZ, listed alongside DJ Troup, he released a single 12-inch on Fresh Records in 1988: \"Just Rhymin'\" b/w \"Get Retarded.\" The nimble B-side would become a fave among rap fans and was interpolated by Dr. Dre and LL Cool J for the single \"Zoom.\" Mack eventually met Diddy – who was at that time looking to set up Bad Boy after being fired from Uptown Records – outside the club Mecca in Manhattan. Mack freestyled for Diddy and earned a record contract.After breaking through with \"Flava in Ya Ear\" and its accompanying gold-certified album Project: Funk Da World, Mack struggled to replicate his initial success. He left Bad Boy Records and released Operation: Get Down in 1997 but did not score a hit from the album. Mack later appeared in the video for Diddy's hit \"I Need a Girl Part 1,\" but his solo career never regained momentum. Mack eventually became a minister in South Carolina and appeared to renounce his former life as a rapper in a 2012 video. The video, taken at the Overcomer Ministry commune in Walterboro, S.C., shows the group's pastor Ralph Gordon Stair talking to Mack. \"Craig Mack is dead,\" Stair tells the congregation. \"We have somebody that used to be Craig Mack.\"In Can't Stop, Won't Stop: The Bad Boy Story, the 2017 documentary chronicling the rise of Combs' revered label and reunion tour, Mack can be heard discussing the possibility of returning to the stage, but declined because of his religious beliefs.\"I don't think anybody was disappointed,\" Combs told Billboard last year. \"We kind of respected his wishes. In this game, man, people don't realize the music industry only has a one percent rate ratio, so sometimes it's very stressful and it brings you only to places that you can go to and should go to, which is God. We can respect that because if any of us is still here, we'd have to go to him, too. Sometimes, people can't walk back and forth in both worlds.\"    Earlier this year, Erick Sermon recruited Mack alongside Method Man and Mr. Cheeks for \"Come Thru,\" the first single off Sermon's upcoming album. \"I'm devastated over the news of Craig Mack,\" Sermon tweeted. \"We just finishing up his new album.\"\"It was a pleasure to know you & rock with you,\" LL Cool J added. \"You $tepped away from the game & did it your way.. I always respected that.\"\"I am grateful to have worked with him,\" Missy Elliott tweeted. \"He was so kind, funny & talented.\"Toney, who helped produce Project: Funk Da World, told the NY Daily News he was working on a documentary about Mack. \"Nobody got to understand his story,\" Toney said. \"I wanted the world to know the talent he had. It was something I wanted people to enjoy, but it was cut short because he was very religious and wanted to go to church.\"Craig Mack - \"Flava in Ya Ear\"Craig Mack - \"Jockin My Style\"", "onesignal": "wordpress-plugin"}, "movies": ["https://www.youtube.com/embed/PMbELEUfmIA", "https://www.youtube.com/embed/nk9RaIel9kc", "https://www.youtube.com/embed/dR1IEw-a7Qw", "https://www.youtube.com/embed/GNFqMx0gY7I", "https://www.youtube.com/embed/hpY_SSrVNzU"], "publish_date": 1520946420.0, "source": "https://www.rollingstone.com", "summary": ""}