{"url": "time.com/5049659/taylor-swift-interview-person-of-the-year-2017/", "text": "Taylor Swift, photographed Nov. 2017. Billy & Hells for TIME\n\nBefore the Harvey Weinstein allegations broke, and before #MeToo swept the Internet, Taylor Swift testified in court on Aug. 10 about being assaulted in a room full of people. Swift, who TIME recognized as one of the Silence Breakers who inspired women to speak out about harassment in this year’s Person of the Year issue, granted TIME her first interview since the trial.\n\nIn 2013, the singer-songwriter took a photo with a Colorado radio DJ after an interview. During that photo, Swift says, DJ David Mueller reached under her skirt and grabbed her rear end. Swift privately reported the incident to the station at which Mueller worked, and he was fired. Mueller then sued Swift for defamation; she countersued for a symbolic $1—and won.\n\nSwift refused to be bullied on the stand. Her straightforward testimony was lauded by many for its fierceness. When asked why the pictures taken during the assault didn’t show the front of her skirt wrinkled as evidence of any wrongdoing, she said simply, “Because my ass is located at the back of my body.” When asked if she felt guilty about Mueller losing his job, she said, “I’m not going to let you or your client make me feel in any way that this is my fault. Here we are years later, and I’m being blamed for the unfortunate events of his life that are the product of his decisions—not mine.”\n\nLike many of the women interviewed for the 2017 Person of the Year issue, Swift would not accept blame for the abuse she experienced. Her clear-eyed testimony marked one of several major milestones in the conversation around sexual harassment this year. Swift responded to questions about her experience from TIME in writing.\n\nWhy was it important for you to come forward about what happened to you?\n\nIn 2013, I met a DJ from a prominent country radio station in one of my pre-show meet and greets. When we were posing for the photo, he stuck his hand up my dress and grabbed onto my ass cheek. I squirmed and lurched sideways to get away from him, but he wouldn’t let go. At the time, I was headlining a major arena tour and there were a number of people in the room that saw this plus a photo of it happening. I figured that if he would be brazen enough to assault me under these risky circumstances and high stakes, imagine what he might do to a vulnerable, young artist if given the chance. It was important to report the incident to his radio station because I felt like they needed to know. The radio station conducted its own investigation and fired him. Two years later, he sued me.\n\nHow did you feel when you testified?\n\nWhen I testified, I had already been in court all week and had to watch this man’s attorney bully, badger and harass my team including my mother over inane details and ridiculous minutiae, accusing them, and me, of lying. My mom was so upset after her cross-examination, she was physically too ill to come to court the day I was on the stand. I was angry. In that moment, I decided to forego any courtroom formalities and just answer the questions the way it happened. This man hadn’t considered any formalities when he assaulted me, and his lawyer didn’t hold back on my mom—why should I be polite? I’m told it was the most amount of times the word “ass” has ever been said in Colorado Federal Court.\n\nWatch: Why the Silence Breakers Are the 2017 Person of the Year\n\nHow have people responded to your story?\n\nPeople have been largely very supportive of my story since the trial began in August, but before that, I spent two years reading headlines referring to it as “The Taylor Swift Butt Grab Case” with internet trolls making a joke about what happened to me. The details were all skewed, as they often are. Most people thought I was suing him. There was an audible gasp in the courtroom when I was named as the defendant. Once it hit the news that I was in Denver dealing with this, there was an outpouring of support on social media and I have never appreciated it more. I spoke to Kesha on the phone and it really helped to talk to someone who had been through the demoralizing court process.\n\nAfter this experience, what advice would you give to your fans?\n\nI would tell people who find themselves in this situation that there is a great deal of blame placed on the victims in cases of sexual harassment and assault. You could be blamed for the fact that it happened, for reporting it and blamed for how you reacted. You might be made to feel like you’re overreacting, because society has made this stuff seem so casual. My advice is that you not blame yourself and do not accept the blame others will try to place on you. You should not be blamed for waiting 15 minutes or 15 days or 15 years to report sexual assault or harassment, or for the outcome of what happens to a person after he or she makes the choice to sexually harass or assault you.\n\nIs this a watershed moment for the way we think about sexual assault and harassment in culture?\n\nI think that this moment is important for awareness, for how parents are talking to their children, and how victims are processing their trauma, whether it be new or old. The brave women and men who have come forward this year have all moved the needle in terms of letting people know that this abuse of power shouldn’t be tolerated. Going to court to confront this type of behavior is a lonely and draining experience, even when you win, even when you have the financial ability to defend yourself. Even though awareness is higher than ever about workplace sexual harassment, there are still so many people who feel victimized, afraid and silenced by their abusers and circumstances. When the jury found in my favor, the man who sexually assaulted me was court-ordered to give me a symbolic $1. To this day he has not paid me that dollar, and I think that act of defiance is symbolic in itself.\n\nThis interview has been edited and condensed.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Eliana Dockterman at eliana.dockterman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2019/12/Person-of-the-year-reader-poll-results.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-2.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2019/12/guardians-2019-journalists.jpg?quality=85&w=536", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-facebook-1.jpg?quality=85", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-facebook-1.jpg?quality=85", "keywords": [], "authors": ["Eliana Dockterman"], "canonical_link": "https://time.com/5049659/taylor-swift-interview-person-of-the-year-2017/", "title": "'I Was Angry.' Taylor Swift on What Powered Her Sexual Assault Testimony", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "taylor swift, taylor swift interview, taylor swift person of the year, taylor swift person of the year 2017, taylor swift time person of the year, taylor swift interview transcript, taylor swift time cover, time person of the year, taylor swift trial. person of the year 2017", "news_keywords": "taylor swift, taylor swift interview, taylor swift person of the year, taylor swift person of the year 2017, taylor swift time person of the year, taylor swift interview transcript, taylor swift time cover, time person of the year, taylor swift trial. person of the year 2017", "description": "Taylor Swift, recognized as one of the Silence Breakers on TIME's Person of the Year cover, spoke out for the first time about her trial.", "og": {"title": "'I Was Angry.' Taylor Swift on What Powered Her Sexual Assault Testimony", "type": "article", "site_name": "Time", "url": "https://time.com/5049659/taylor-swift-interview-person-of-the-year-2017/", "description": "Read TIME's Person of the Year interview with the pop star about her sexual assault trial", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-facebook-1.jpg?quality=85", "width": 1024, "height": 576}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5049659/taylor-swift-interview-person-of-the-year-2017/", "description": "Taylor Swift, recognized as one of the Silence Breakers on TIME's Person of the Year cover, spoke out for the first time about her trial.", "media": "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-facebook-1.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5049659/taylor-swift-interview-person-of-the-year-2017/", "title": "'I Was Angry.' Taylor Swift on What Powered Her Sexual Assault Testimony", "description": "Read TIME's Person of the Year interview with the pop star about her sexual assault trial", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/12/taylor-swift-person-of-year-2017-time-magazine-facebook-1.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}