{"url": "https://people.com/tv/chris-soules-enters-conditional-guilty-plea-car-crash/", "text": "Image zoom Source: Chris Soules/Instagram\n\nChris Soules has entered a conditional guilty plea regarding the 2017 car crash that left one person dead.\n\nAccording to court documents obtained by PEOPLE on Tuesday, the Bachelor alum, 37, has “entered a plea of guilty to the crime of: Leaving the Scene of an Accident Resulting in Serious Injury, an aggravated misdemeanor.”\n\nGet push notifications with news, features and more.\n\nIn the documents, the State of Iowa moved to amend the trial information — to charge Soules with leaving the scene of an accident resulting in serious injury — and the Bachelor alum “filed a written guilty plea to the amended charge, conditioned his plea of guilty upon the court’s acceptance of the terms of the parties’ plea agreement.”\n\nBut, “if the court rejects the plea agreement, the defendant will be afforded the opportunity to withdraw his guilty plea,” the documents state.\n\nRELATED: Chris Soules Returns to Instagram Almost One Year After Fatal Car Crash\n\nAccording to his written conditional guilty plea submitted to the Iowa District Court on Tuesday and obtained by PEOPLE, the aggravated misdemeanor charge “carries a maximum penalty of imprisonment of not more than two (2) years and/or by a fine of not more than six thousand two hundred and fifty dollars ($6,250.00) and a minimum penalty of a fine of six hundred twenty-five dollars ($625.00) along with a suspended jail sentence or a deferred judgment.”\n\nHe later states that in exchange for his guilty plea, the court “will order a confidential presentence investigation report (PSI) be completed in advance of sentencing and this document will be provided to the State and to me. I also understand that the instant plea to the aggravated misdemeanor will resolve any and all criminal matters, investigations, etc. arising from the accident on April 24, 2017 and no further prosecution or charges will be brought against me. … I understand the court may accept or reject the agreement or defer its decision as to acceptance or rejection until receipt of a PSI.”\n\nHis sentencing is set for Jan. 8 at 1:30 p.m.\n\nOn April 25, 2017, Soules was arrested and charged with leaving the scene of a car accident that resulted in the death of 66-year-old Vietnam veteran Kenneth E. Mosher.\n\nImage zoom Geilenfeld Funeral Home\n\nHe was arrested in Iowa after he allegedly crashed his truck into a tractor, running it off the road into a ditch. His vehicle was later found at a home that he was present at, and Soules allegedly refused to leave until officers obtained a search warrant several hours later.\n\nRELATED VIDEO: Andi Dorfman on Former ‘Bachelor’ Star Chris Soules After Deadly Car Crash: ‘He’s Hanging in There’\n\nIn his written conditional guilty plea, Soules detailed the crash and admitted his wrongdoing to not providing his vehicle’s registration number to police.\n\n“By way of factual basis, I hereby state that on or about April 24, 2017 in Buchanan County, Iowa, I was driving a vehicle that was involved in an accident resulting in serious injury to another person. I knew the accident occurred and knew it resulted in an injury to another person,” wrote Soules. “Though I immediately stopped, called 911 and identified myself, and rendered reasonable aid to the injured person — including requesting an ambulance and administering CPR while the ambulance was en route — I acknowledge I did not provide the registration number of the vehicle I was driving to 911 dispatch or law enforcement as required by Iowa Code 321.263.”\n\nImage zoom\n\nRELATED: Chris Soules’ Motion to Dismiss Felony Charge Denied by Iowa Supreme Court After Fatal Car Crash\n\nIowa State Patrol alleged that he fled the scene, violating the Iowa code that states: “If the accident causes the death of a person, all surviving drivers shall remain at the scene of the accident except to seek necessary aid or to report the accident to law enforcement authorities.”\n\nAfter entering a not guilty plea in May 2017 to the charge, Soules’ legal team filed a motion to dismiss the “failure to remain” charge on constitutional grounds, refuting the last sentence of the Iowa state code.\n\nThe attorneys said in court documents obtained by PEOPLE that “because Mr. Soules indisputably stopped his vehicle, returned to the injured driver, contacted law enforcement, provided aid to the injured driver, arranged for medical treatment for the injured driver, remained until emergency personnel responded to the injured party, and provided identification data, the State’s charge must be dismissed.”\n\nTheir request to dismiss was denied in January before being brought to the Iowa Supreme Court. In February, multiple outlets reported that an Iowa Supreme Court denied an appeal.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules-2000-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkenny-mosher-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/chris-soules-enters-conditional-guilty-plea-car-crash/", "title": "The Bachelor's Chris Soules Enters Conditional Guilty Plea", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Chris Soules,Crime News,News,TV", "news_keywords": "Chris Soules,Crime News,News,TV", "description": "On April 25, 2017, Chris Soules was arrested and charged with leaving the scene of a car accident that resulted in the death of 66-year-old Vietnam veteran Kenneth E. Mosher", "og": {"title": "Bachelor Alum Chris Soules Pleads Guilty in April 2017 Fatal Car Crash Case, Faces Misdemeanor Charge", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/chris-soules-enters-conditional-guilty-plea-car-crash/", "description": "Chris Soules has entered a conditional guilty plea regarding the&nbsp;2017 car crash&nbsp;that left one person dead. According to court documents obtained by PEOPLE on Tuesday,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/tv/chris-soules-enters-conditional-guilty-plea-car-crash/", "description": "On April 25, 2017, Chris Soules was arrested and charged with leaving the scene of a car accident that resulted in the death of 66-year-old Vietnam veteran Kenneth E. Mosher", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/chris-soules-enters-conditional-guilty-plea-car-crash/", "title": "Bachelor Alum Chris Soules Pleads Guilty in April 2017 Fatal Car Crash Case, Faces Misdemeanor Charge", "description": "On April 25, 2017, Chris Soules was arrested and charged with leaving the scene of a car accident that resulted in the death of 66-year-old Vietnam veteran Kenneth E. Mosher", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fchris-soules.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}