{"url": "https://www.gq.com/story/brendan-fraser-says-hfpa-denied-sexual-harassment-claims", "text": "Fraser said he declined to sign on to the proposed joint statement. \"I don't get the joke,\" he told me last week. Berk's intentions were irrelevant to him—whether they were meant in jest or otherwise, Fraser felt violated. \"I'm the only one who would know where I was touched on my body,\" he told me.\n\nFraser also said that the HFPA declined to share the full results of their investigation with him, or explain what methodology or evidence they used to draw their conclusion: \"What I said to them was, 'Show me the investigator's report, and then I'll know what I'm signing off on.’ ” The HFPA, according to Fraser, showed him a summary of their findings but refused to share the full report the organization said those findings were based on, citing witness-confidentiality concerns. \"They're kind of behaving like wolves in sheep's clothing about it, saying, 'Oh, we want him to heal.' Well, the first step in that direction would be: What am I healing from? Can I please see this report? What is it? They commissioned an investigation. They received their report. And they're not giving any details about it, and they're not giving up the report itself.\"\n\n\"I myself was not shown either report,\" Berk told me, referring to the investigator's findings and the proposed joint statement. \"But [I was] told the statement would absolve me of any wrongdoing.\" Asked if he had faced any discipline from the HFPA, Berk wrote: \"None at all.\"\n\nThe HFPA did not respond to multiple requests for comment.\n\nBrendan Fraser at the Hollywood Foreign Press Association's Annual Installation Luncheon on July 30, 2003, in Beverly Hills. Gregg DeGuire/Getty Images\n\nIn 2003 Fraser, through his representatives at the time, privately sought and received an apology from Berk and the HFPA, though Berk told me in February that the letter admitted \"no wrongdoing,\" describing it as \"the usual 'If I've done anything that upset Mr. Fraser, it was not intended and I apologize.’ ” Fraser didn't speak publicly about the incident until earlier this year, when he described it to GQ. He was inspired in part, he said, by seeing friends and former colleagues speak about their own difficult experiences with assault and harassment in Hollywood, and in part by the realization that Berk was still a member of the HFPA and an attendee at the most recent Golden Globes ceremony.\n\nSince his account of what happened to him in the summer of 2003 was published, Fraser has had ample time to reflect. \"If I was a woman, I question if Berk would've even been in a job in 2003,\" Fraser told me. (In 2014, Berk took a voluntary leave of absence from the HFPA after the publication of his memoir, With Signs and Wonders, which contained material about the organization and its membership that other HFPA members reportedly took issue with; after six months, he resumed full membership.) Fraser said that he was angry at himself for having stayed quiet in 2003, and now he felt like he was being asked to do so again. \"It's about being stripped of your identity, and of a power play being pulled to tamp it down, and being sort of backhandedly complicit in it by keeping quiet, entering into an agreement that you won't talk.\"\n\nThis past January, an estimated 19 million people watched the Golden Globes, which is voted on and presented by the HFPA. In Hollywood, the Golden Globes are closely watched as precursors to the Academy Awards, though the voting body of the HFPA, which is kept secret, consists of less than one hundred journalists (compared to more than 6,500 Oscar voters), representing outlets as far-flung as Brazil's Sci-Fi News and Italy's Il Manifesto. The HFPA holds private press conferences and junkets throughout the year with Golden Globe hopefuls: Actors and actresses are asked to appear before members to answer questions and often take photos with them afterward—a cozy arrangement that some in Hollywood have questioned.\n\n“It’s about being stripped of your identity, and of a power play being pulled to tamp it down...”\n\n\"I want to find some way to make medicine out of this poison, which is not specific just to this enterprise,\" Fraser told me. \"There's a system in place that's unwritten. If you abide by it, you will be rewarded. If you don't, you won't be. But outside of that, I want to end this episode, this chapter, in my own life and career and move on, just as I'm hopeful that others will be able to in years to come.\"", "images": ["https://media.gq.com/photos/5a84b084c0fcdc28d27c7d78/3:2/w_775%2Cc_limit/Brendan-Fraser.jpg", "https://media.gq.com/photos/5b16be3214e42f67f857d050/master/w_1600%2Cc_limit/brendan-fraser-2003-gq.jpg", "https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_1280,c_limit/brendan-fraser-me-too-gq.jpg", "https://www.gq.com/verso/static/gq/assets/logo-header.d739eb0c2af2cf500d0c7ebecd1d6597474e69aa.svg", "https://www.gq.com/verso/static/gq/assets/logo-reverse.2fe772617ee3b7f2fc81c9f7237c17495b42eaee.svg", "https://media.gq.com/photos/5b16bd4d23090e307e3152d9/master/w_1600%2Cc_limit/brendan-fraser-philip-berk-gq.jpg", "https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_2560%2Cc_limit/brendan-fraser-me-too-gq.jpg"], "top_img": "https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_1280,c_limit/brendan-fraser-me-too-gq.jpg", "keywords": [], "authors": ["Zach Baron", "Zach Baro"], "canonical_link": "https://www.gq.com/story/brendan-fraser-says-hfpa-denied-sexual-harassment-claims", "title": "UPDATED: Brendan Fraser Says the HFPA Denied His Claims of Sexual Harassment", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Zach Baron", "copyright": "Copyright (c) Condé Nast 2020", "description": "According to Fraser, after finally investigating his 15-year-old claim, the HFPA tried to explain that Berk's actions were intended as \"a joke.\" But Fraser's not laughing.", "id": "5b170000133fe616d11668a6", "keywords": "culture,entertainment,#metoo", "news_keywords": "culture,entertainment,#metoo", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b170000133fe616d11668a6", "parsely-metadata": "{\"description\":\"According to Fraser, after finally investigating his 15-year-old claim, the HFPA tried to explain that Berk's actions were intended as \\\"a joke.\\\" But Fraser's not laughing.\",\"image-16-9\":\"https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_1000,c_limit/brendan-fraser-me-too-gq.jpg\",\"image-1-1\":\"https://media.gq.com/photos/5b15aeaf789de149f33ecf06/1:1/w_1000,c_limit/brendan-fraser-me-too-gq.jpg\"}", "og": {"description": "After an internal investigation, the Hollywood Foreign Press Association says the act was intended as \"a joke.\" But Fraser's not laughing.", "image": "https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_1280,c_limit/brendan-fraser-me-too-gq.jpg", "site_name": "GQ", "title": "UPDATED: Brendan Fraser Says the HFPA Denied His Claims of Sexual Harassment", "type": "article", "url": "https://www.gq.com/story/brendan-fraser-says-hfpa-denied-sexual-harassment-claims"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@gqmagazine", "description": "After an internal investigation, the Hollywood Foreign Press Association says the act was intended as \"a joke.\" But Fraser's not laughing.", "domain": "https://www.gq.com", "image": {"src": "https://media.gq.com/photos/5b15aeaf789de149f33ecf06/16:9/w_1280,c_limit/brendan-fraser-me-too-gq.jpg?mbid=social_retweet"}, "site": "@gqmagazine", "title": "UPDATED: Brendan Fraser Says the HFPA Denied His Claims of Sexual Harassment"}, "fb": {"app_id": 606963029328755, "pages": 7962048097}}, "movies": [], "publish_date": null, "source": "https://www.gq.com", "summary": ""}