{"url": "www.vogue.com/article/selena-gomez-doesnt-care-about-justin-bieber-hailey-baldwin-engagement", "text": "In the aftermath of Justin Bieber’s quickie engagement to Hailey Baldwin, and his light-on-the-punctuation celebratory Instagram on the matter, all eyes seemed to turn expectantly to Selena Gomez and collectively ask in a sing-songy voice: “Are you okay?” This is only natural, given that she is one-half of the couple formerly known as Jelena, and had dated Bieber on and off since 2010—back when he used to have a bowl cut and wear his favorite color, purple, all the time. The concern was especially palpable since Bieber and Gomez had been together as recently as a few months ago, only reportedly breaking up in March.\n\nHowever, as much as the tabloid-consuming public loves a love triangle and salivates over the idea of a woman scorned, I’m going to go out on a limb and say that if there’s anyone we should be worried about right now, it would not be Selena Gomez. Beliebers may not be fine—whether because they wanted to marry Bieber themselves or because they longed for Bieber and Gomez to end up together at last—but something tells me Selena Gomez is more than fine herself. And not just because she stepped out looking perfectly happy in new hair extensions this week or because a source bluntly told Us Weekly: “Selena doesn’t care.”\n\nFor one, Gomez was always the more mature, has-her-shit-together member of the relationship. She was never the one getting arrested for a DUI in a rented Lamborghini in Miami. She has never urinated in a restaurant mop bucket. She has, especially by child Disney star–turned–teen pop idol standards, largely skirted controversy and scandal. And perhaps she is not the spontaneous, splashy engagement type either, which may be why she is no longer with someone who clearly is. All good thoughts to Bieber and Baldwin, but statistically speaking, drawing on the history of young celebrity engagements, Gomez is probably not the person we should be concerned about here.\n\nFurthermore, for Selena Gomez, marrying Justin Bieber could very possibly feel akin to marrying your high school boyfriend at age 25, which a lot of people, in 2018, simply do not want to do. The long—so long—history of their relationship was absolutely part of what made people root for them, but it could always be a valid deal-breaker. “It was never a healthy situation for Selena and Justin,” a source tells People. A “Bieber pal” echoed to the magazine: “Their relationship was always very complex and complicated. It was just too much baggage.”\n\nLastly, while it may not be exactly ideal that her on-and-off beau of eight years is snap-engaged to a model, Gomez has made it clear that she is not the weepy, emo type—at least not in public. Exhibit A: It was The Weeknd, not Gomez, who released a breakup album after their split and cried on stage at Coachella. If anything, Gomez’s reputation is less a discernible track record of being the woman scorned and more as the heartbreaker herself.\n\nFrom here on out, it would be best to think about Selena Gomez like the Cazzie David of the Bieber/Baldwin engagement. Instead of wondering if she’s okay, or pitying her, we would be wise to consider that she a) may have dodged a bullet, b) in all likelihood, chose to no longer date Justin Bieber, and c) unlike Baldwin, simply cannot stand for the current state of his hair/mustache.\n\nLike David, there are already glimmers that Gomez is living her best single life, as her friend and former assistant Theresa Mingus posted a photo of them to Instagram on a boat in New York not long after the news of Bieber’s engagement broke. Raising a glass to strong, independent women, probably.", "images": ["https://assets.vogue.com/photos/5b46162fca34920c328ecb31/master/w_2560%2Cc_limit/00-story-selena-gomez-fine.jpg", "http://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg", "http://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://assets.vogue.com/photos/58584b45a6984b8c49fabbb0/1:1/w_90%2Cc_limit/michelle-ruiz.jpg", "https://assets.vogue.com/photos/5b46163940e04a767cc294ca/16:9/w_1280,c_limit/00-social-selena-gomez-fine.jpg", "http://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg"], "top_img": "https://assets.vogue.com/photos/5b46163940e04a767cc294ca/16:9/w_1280,c_limit/00-social-selena-gomez-fine.jpg", "keywords": [], "authors": ["Michelle Ruiz", "Michelle Rui"], "canonical_link": "https://www.vogue.com/article/selena-gomez-doesnt-care-about-justin-bieber-hailey-baldwin-engagement", "title": "Selena Gomez Isn’t Worried About Justin Bieber and Hailey Baldwin’s Engagement, So Don’t Worry About Her", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Michelle Ruiz", "copyright": "Copyright (c) Condé Nast 2020", "description": "In light of Justin Bieber’s engagement to Hailey Baldwin, questions have been raised about Gomez’s state of mind. On the contrary, she’s not the one we should be worried about here.", "id": "5b4610415317810c1cea49a0", "keywords": "news,selena gomez", "news_keywords": "news,selena gomez", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b4610415317810c1cea49a0", "parsely-metadata": "{\"description\":\"In light of Justin Bieber’s engagement to Hailey Baldwin, questions have been raised about Gomez’s state of mind. On the contrary, she’s not the one we should be worried about here.\",\"image-16-9\":\"https://assets.vogue.com/photos/5b46162c00744a63160fbe82/16:9/w_1000,c_limit/00-promo-selena-gomez-fine.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5b46162c00744a63160fbe82/1:1/w_1000,c_limit/00-promo-selena-gomez-fine.jpg\"}", "og": {"description": "She’s fine.", "image": "https://assets.vogue.com/photos/5b46163940e04a767cc294ca/16:9/w_1280,c_limit/00-social-selena-gomez-fine.jpg", "site_name": "Vogue", "title": "Something Tells Me Selena Gomez Is More Than Okay", "type": "article", "url": "https://www.vogue.com/article/selena-gomez-doesnt-care-about-justin-bieber-hailey-baldwin-engagement"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "She’s fine.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5b46163940e04a767cc294ca/16:9/w_1280,c_limit/00-social-selena-gomez-fine.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Something Tells Me Selena Gomez Is More Than Okay"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "http://www.vogue.com", "summary": ""}