{"url": "https://www.bbc.co.uk/news/uk-44055385", "text": "Image copyright Reuters\n\nAfter months of speculation, Meghan Markle's wedding dress was revealed.\n\nThe pure white, boat neck gown was designed by British designer Clare Waight Keller, the artistic director of French fashion house Givenchy.\n\nCrowds saw the full gown - which had been kept a closely-guarded secret - as Ms Markle stepped out at St George's Chapel at Windsor Castle at midday.\n\nThe designer\n\nThe designer, Clare Waight Keller, was appointed the first female artistic director at Givenchy in 2017 and presented her debut collection for spring/summer earlier this year.\n\nMs Markle, who met Ms Waight Keller this year, chose to work closely with her on the design because of her \"timeless and elegant aesthetic, impeccable tailoring, and relaxed demeanour\", Kensington Palace said.\n\nShe previously served as the creative head of three globally-influential fashion houses - Pringle of Scotland, Chloé, and now Givenchy.\n\nMedia playback is unsupported on your device Media caption \"Really proud\": Meghan's designer Clare Waight Keller from Givenchy describes the dress\n\nThe Birmingham-born designer, now the artistic director of Givenchy, said it was a collaborative process with the royal bride, adding: \"I think she loved the fact that I was a British designer, and working in a house such as Givenchy which has its roots in a very classical, beautiful style.\"\n\nAccording to Sara McAlpine, fashion features editor at Elle magazine, Givenchy has a history of bringing in talent from the UK with past designers at the brand including John Galliano and Alexander McQueen.\n\nMeanwhile, bridal couture expert Emma Meek said choosing a woman who is the first female creative head at the fashion house could be a \"political statement\" from the bride.\n\nThe bodice\n\nThe minimalist pure white gown has a boat neck, framing the shoulders and emphasising Ms Markle's waist, and three-quarter length sleeves.\n\nThe haute couture dress is made of double-bonded silk cady cushioned by an underskirt in triple silk organza.\n\nImage copyright Getty Images\n\nThe neckline differs from the Duchess of Cambridge's high V-necked lace-covered gown in 2011.\n\nKensington Palace later released Ms Waight Keller's design sketches, which she is giving to Meghan as a keepsake.\n\nImage copyright Clare Waight Keller\n\nThe veil\n\nMs Markle wore a five metre-long white silk veil covering her face which included floral detail representing all 53 countries of the Commonwealth. The bride suggested the design because the Commonwealth will be a central part of her and Prince Harry's official work after they are married.\n\nImage copyright Rex/Shutterstock\n\nThe designer spent significant time researching the flora of each country and much care was taken to ensure that every flower was unique.\n\nMs Markle also chose her two other favourite flowers - Wintersweet found in Kensington Palace and the California poppy, from where she was born - to be adorned on the veil.\n\nImage copyright PA\n\nThe design of Ms Markle's veil is similar to the Duchess of Cambridge's, which was made of layers of soft, ivory silk tulle which also had a trim of hand-embroidered flowers.\n\nDavid Emanuel, who designed Diana, Princess of Wales's dress, said it was \"very clever\" to include the Commonwealth flowers in the veil.\n\n\"I think Diana would have approved,\" he said.\n\nImage copyright Clare Waight Keller\n\nThe material\n\nDressmakers spent hundreds of hours - including regularly washing their hands every 30 minutes - to make the long veil, which is hand-embroidered in silk threads and organza.\n\nEmma Meek, the head of luxury bridal boutique Miss Bush, said compared to the understated dress, the \"enormous silk veil\" is where the \"craft and meaningful decoration\" lies.\n\nImage copyright REX/Shutterstock\n\nImage copyright Getty Images\n\nImage copyright Reuters\n\nImage copyright Getty Images\n\nThe tiara\n\nMs Markle's veil was held in place by Queen Mary's diamond bandeau tiara, loaned to her by the Queen.\n\nIt is named after the wife of King George V, the Queen's grandfather.\n\nAt the centre of the bandeau is a detachable brooch of 10 brilliant diamonds, which was given to Queen Mary as a wedding present in 1893. The brooch was later made into the tiara in 1932.\n\nThe headpiece also includes diamonds and platinum in 11 sections. Ms Markle also wore earrings and bracelet made by Cartier.\n\nImage copyright PA\n\nImage copyright PA\n\nUnlike the Duchess of Cambridge - who borrowed a 1936 Cartier \"halo\" tiara from the Queen - Ms Markle wore her hair up, rather than loose.\n\nThe bride's hair was styled by Serge Normant, with make-up by long-time friend and make-up artist Daniel Martin.\n\nThe bouquet\n\nPrince Harry handpicked several flowers on Friday from their private garden at Kensington Palace to add to the bespoke bridal bouquet designed by florist Philippa Craddock.\n\nIt includes forget-me-nots which were Diana, Princess of Wales' favourite flower. They were specifically chosen to honour the memory of the late princess.\n\nThe small bouquet also features scented sweet peas, lily of the valley, astilbe, jasmine and astrantia, and sprigs of myrtle, all bound with a naturally dyed, raw silk ribbon.\n\nImage copyright REX/Shutterstock\n\nLondon-based florist Ms Craddock also created the floral displays at the chapel, which was filled with white garden roses, peonies and foxgloves, branches of beech, birch and hornbeam.\n\nFloral designer Ms Craddock, who started her business nine years ago, has worked for the V&A, Kensington Palace, Hampton Court Palace, Alexander McQueen, Christian Dior and British Vogue.\n\nImage copyright PA\n\nMs Markle previously said on her now-deleted Instagram account that peonies make her \"endlessly happy\". Soon after the couple started dating, Ms Markle posted a picture of a bouquet of pink and white peonies on the social media site.\n\nThe shoes\n\nThe wedding shoes are based on a Givenchy refined pointed couture design made of a silk duchess satin.\n\nWhat are people saying?\n\nSara McAlpine, from Elle magazine, said the dress was \"definitely in keeping with her [Ms Markle's] style\", adding: \"She's always had a very pared-back style in terms of very simple, refined.\"\n\nShe added that Ms Markle is \"signalling change\" with the choice of fashion house Givenchy, which has addressed the lack of diversity on catwalks. The \"progressive\" brand is a well thought-out choice for the bride, Ms McAlpine said.\n\nEmma Meek added that the design references Givenchy's history of dressing Audrey Hepburn and her classic and timeless style, adding it is very \"presidential\".\n\nImage copyright Getty Images Image caption Audrey Hepburn modelled a Cloque silk evening dress, by Givenchy. Hepburn famously wore gowns by the designer in the films Breakfast at Tiffany's and Sabrina.\n\n\"It brings back that non-fussy, refined simplicity. I am calling it the 'last word in first lady dressing',\" she added. \"It also has a very American feel to it, quite sporty, preppy.\"\n\nElizabeth Von Der Goltz, from fashion brand Net-A-Porter, added: \"Audrey having been an actress, and Meghan as an actress seemed really fitting.\"\n\nMeanwhile, Vogue's digital editor Alice Casely-Hayford agreed the choice of Waight Keller was \"brilliant recognition for fashion's female industry leaders\".\n\nShe said despite the speculation that Erdem or Ralph & Russo would design the dress, the choice was \"the perfect fit\".\n\nShe added it was \"incredibly beautiful in its timelessness and surprisingly understated\".\n\nJade Beer, editor of Brides magazine, said: \"Had anyone been looking at the Givenchy Spring 2018 couture collection, they would have seen all the hallmarks of Meghan's wedding dress - bateau necklines, more fluid structure and a nod to soft tailoring.\n\n\"Real women will look at this dress and feel it is the definition of the ultimate chic understated wedding gown.\"\n\nWhat was Prince Harry wearing?\n\nImage copyright Rex/Shutterstock\n\nBoth Prince Harry and the Duke of Cambridge wore the frockcoat uniform of the Blues and Royals. Prince Harry was given permission from the Queen to get married in his uniform.\n\nBoth outfits were tailored at Dege & Skinner on Savile Row, specialists in military uniforms.\n\nAll pictures subject to copyright.", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/8DDA/production/_101641363_hi046911815.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/185D1/production/_101639799_hi046910891.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/6AB2/production/_101641372_hi046914058.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=uk::news.uk.story.44055385.page&x1=[urn:bbc:cps:5a78ed51-d25a-4a48-b179-9309f5abb407]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_PS]&x12=[NEWS]", "https://ichef.bbci.co.uk/news/320/cpsprodpb/2385/production/_101639090_hi046910333.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/127C2/production/_101641757_givenchy.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/28A5/production/_101650401_sketch2.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/8DDA/production/_101641363_hi046911815.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/1512A/production/_101641368_hi046912788.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/14ED2/production/_101641758_hi046914528.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/176FA/production/_101649959_sketch.jpg", "https://ichef.bbci.co.uk/images/ic/720x405/p067qgb5.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/1A3A/production/_101641760_hi046909841.jpg", "https://news.files.bbci.co.uk/include/newsspec/19854/assets/app-project-assets/bbc_news_logo.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=17986528&cv=2.0&cj=1", "https://news.files.bbci.co.uk/include/newsspec/19854/assets/app-project-assets/google_play_store.svg", "https://ichef.bbci.co.uk/news/320/media/images/81563000/jpg/_81563299_464x2_line.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/B4EA/production/_101641364_hi046912826.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/C94E/production/_101643515_pa-36589638.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png", "https://news.files.bbci.co.uk/include/newsspec/19854/assets/app-project-assets/ios_app_store.svg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/117B4/production/_101640617_8a168e33-b37d-44b8-b09c-61e7bbc00546.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/320/cpsprodpb/DBFA/production/_101641365_harry-arrives.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/B17A/production/_101643454_hi046909889.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/1C92/production/_101641370_hi046913143.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/8DDA/production/_101641363_hi046911815.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.co.uk/news/uk-44055385", "title": "Royal wedding 2018: Meghan Markle's Givenchy dress in detail", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Meghan Markle's wedding dress is designed by Givenchy artistic director Clare Waight Keller", "x-country": "hk", "x-audience": "Domestic", "CPS_AUDIENCE": "Domestic", "CPS_CHANGEQUEUEID": 128491954, "og": {"title": "Meghan's dress in detail", "type": "article", "description": "Meghan Markle's wedding dress is designed by Givenchy artistic director Clare Waight Keller", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/uk-44055385", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/8DDA/production/_101641363_hi046911815.jpg", "alt": "BBC News. Meghan Markle arrives for the wedding ceremony to marry Prince Harry at St George\"s Chapel, Windsor Castle"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "UK"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCNews", "title": "Meghan's dress in detail", "description": "Meghan Markle's wedding dress is designed by Givenchy artistic director Clare Waight Keller", "creator": "@BBCNews", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/8DDA/production/_101641363_hi046911815.jpg", "alt": "Meghan Markle arrives for the wedding ceremony to marry Prince Harry at St George\"s Chapel, Windsor Castle"}, "domain": "www.bbc.co.uk"}, "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.co.uk", "summary": ""}