{"url": "http://www.guttmacher.org/statecenter/updates/2013/statetrends42013.html", "text": "by Elizabeth Nash, Rachel Benson Gold, Andrea Rowan, Gwendolyn Rathbun and Yana Vierboom\n\nReproductive health and rights were once again the subject of extensive debate in state capitols in 2013. Over the course of the year, 39 states enacted 141 provisions related to reproductive health and rights. Half of these new provisions, 70 in 22 states, sought to restrict access to abortion services. In sharp contrast to this barrage of abortion restrictions, a handful of states adopted measures designed to expand access to reproductive health services. Most notably, California enacted the first new state law in more than seven years designed to expand access to abortion, and five states adopted measures to expand access to comprehensive sex education, facilitate access to emergency contraception for women who have been sexually assaulted and enable patients’ partners to obtain STI treatment.\n\nAbortion\n\nTwenty-two states enacted 70 abortion restrictions during 2013. This makes 2013 second only to 2011 in the number of new abortion restrictions enacted in a single year. To put recent trends in even sharper relief, 205 abortion restrictions were enacted over the past three years (2011–2013), but just 189 were enacted during the entire previous decade (2001–2010).\n\nForty-five percent of the abortion restrictions enacted over the last three years fall into four categories: targeted restrictions on abortion providers (TRAP), limitations on insurance coverage of abortion, bans on abortions at 20 weeks postfertilization (the equivalent of 22 weeks after a woman’s last menstrual period) and limitations on medication abortion. States enacted 93 measures in these four categories from 2011 through 2013, compared with 22 during the previous decade.\n\nThe number of new abortion restrictions ballooned from 43 enacted in 2012 to 70 in 2013. Four states were key to this increase. North Dakota and Texas, which did not have legislative sessions in 2012, together enacted 13 restrictions in 2013. In addition, the 2012 elections brought changes to the legislature in Arkansas and the governor’s mansion in North Carolina that created environments more hostile to abortion; after adopting no abortion restrictions in 2012, these two states together enacted 13 new restrictions in 2013.\n\nThis legislative onslaught has dramatically changed the landscape for women needing abortion. In 2000, the two states that were the most restrictive in the nation, Mississippi and Utah, had five of 10 major types of abortion restrictions in effect (see Appendix). By 2013, however, 22 states had five or more restrictions, and Louisiana had 10.\n\nIn 2000, 13 states had at least four types of major abortion restrictions and so were considered hostile to abortion rights (see Troubling Trend: More States Hostile to Abortion Rights as Middle Ground Shrinks); 27 states fell into this category by 2013. In contrast, the number of states supportive of abortion rights fell from 17 to 13, while the number of middle-ground states was cut in half, from 20 to 10. The proportion of women living in restrictive states went from 31% to 56%, while the proportion living in supportive states fell from 40% to 31% over the same period.\n\nAgainst this backdrop, it is particularly noteworthy that California moved to significantly improve access to early abortion services by expanding the types of providers permitted to perform either medication or surgical abortions. Legislation enacted in September allows physician assistants, certified nurse midwives and nurse practitioners to provide abortions during the first trimester. Thirty-nine states limit the provision of abortion services to licensed physicians (see Overview of Abortion Laws). Also this year, Colorado repealed its pre-Roe abortion law. Although these measures are not enforced, 12 states continue to have pre-Roe laws on the books (see Abortion Policy in the Absence of Roe).\n\nDespite this progress, the overwhelming preponderance of legislation concerning abortion was aimed at restricting access to the procedure. Four types of restrictions dominated the legislative scene during 2013: abortion bans, restrictions on abortion providers, limitations on the provision of medication abortion and restrictions on coverage of abortion in private health plans. Together, legislation in these four categories accounted for 56% of all restrictions enacted over the year.\n\nBans on Abortion\n\nOvertly flouting the standard established by Roe v. Wade, two states enacted laws banning abortion early in pregnancy. In March, the Arkansas legislature overrode a veto by Gov. Mike Beebe (D) to ban abortions occurring more than 12 weeks after a woman’s last menstrual period. Later that month, North Dakota enacted a ban on abortions occurring after a fetal heartbeat is detected, something that generally occurs at about six weeks after a woman’s last menstrual period. Legal challenges were quickly filed to both measures and enforcement is blocked while litigation proceeds. Additionally, the North Dakota legislature also approved an initiative that will be placed on the November 2014 ballot to ban abortion entirely by defining a person as a “human being at any stage of development.” Currently, no state has a law in effect prohibiting abortions early in pregnancy (see Abortion Policy in the Absence of Roe).\n\nAntiabortion legislators in 11 states introduced measures aimed at banning abortion later in pregnancy based on the spurious belief that a fetus can feel pain at that point of development, and three new laws were enacted in Arkansas, North Dakota and Texas. These laws ban nearly all abortions performed at or beyond 20 weeks postfertilization (the equivalent of 22 weeks after the woman’s last menstrual period). All three have gone into effect, bringing to nine the number of states with a 20-week ban in effect (see State Policies on Later Abortions ). (A similar 20-week ban was passed by the U.S. House of Representatives in June; although introduced in the Senate late in the year, the measure was not voted on.)\n\nTargeted Regulation of Abortion Providers (TRAP)\n\nEight states enacted onerous and irrelevant licensing requirements targeting abortion clinics and providers in 2013. These laws are designed to discourage medical professionals from providing abortion and make it impossible for clinics to remain open (see TRAP Laws Gain Political Traction While Abortion Clinics—and the Women They Serve—Pay the Price). Most often, these restrictions require abortion providers to have admitting privileges at a local hospital, mandate transfer agreements with hospitals or impose onerous structural requirements on clinics.\n\nFour states (Alabama, North Dakota, Texas and Wisconsin) enacted laws that require providers to have admitting privileges at a local hospital. These measures effectively give hospitals veto power over clinics’ ability to provide services. All four were immediately challenged in court; enforcement of the Alabama, North Dakota and Wisconsin laws was temporarily blocked, but the U.S. Supreme Court cleared the way for implementation of the Texas requirement as the litigation proceeds. Nine states now have laws requiring abortion providers to have hospital privileges; four are in effect (see State Policies on Targeted Regulation of Abortion Providers).\n\nOhio has long required abortion providers to have an agreement with a hospital allowing the transfer of patients needing emergency care. In June, the state adopted a new provision prohibiting public hospitals from entering into these transfer agreements. Including Ohio, nine states require abortion providers to have transfer agreements, measures that do little to add to existing patient safeguards in the event of an emergency.\n\nOver the course of 2013, five states implemented new structural standards for abortion providers. North Carolina and Texas enacted measures requiring abortion clinics to meet essentially the same standards required for comprehensive ambulatory surgical centers (ASCs) that provide more invasive and risky procedures and use higher levels of anesthesia. Alabama adopted somewhat more limited requirements relating to emergency care and fire safety. Virginia, meanwhile, finalized regulations to implement its 2011 TRAP law. Finally, Indiana, which had already required sites where surgical abortion was performed to adhere to standards similar to those for ASCs, extended these requirements to apply to sites where only medication abortion is performed. Including these new requirements, 26 states now require abortion facilities to essentially meet ASC standards.\n\nMedication Abortion\n\nSeventeen states have adopted restrictions on medication abortion over the last three years— making it one of the most frequent targets of abortion opponents (see Medication Abortion Restrictions Burden Women and Providers—and Threaten U.S. Trend Toward Very Early Abortion). In 2013 alone, eight states moved to ban the use of telemedicine in administering the medication, despite the fact that telemedicine is rapidly gaining acceptance as a way to expand access to health care. Over the course of the year, seven states (Alabama, Indiana, Louisiana, Mississippi, Missouri, North Carolina and Texas) enacted laws effectively banning the use of telemedicine for medication abortion. In addition, the Iowa Board of Medicine adopted regulations prohibiting the use of telemedicine for medication abortion. Over the course of the year, courts blocked enforcement of the Iowa regulations, as well as earlier laws that had been enacted in North Dakota and Wisconsin. As of December, 14 states have measures in effect blocking the use of telemedicine to provide medication abortion (see State Policies on Medication Abortion).\n\nThe second way states have moved to restrict access to medication abortion is by requiring use of an outdated protocol that mandates a high dose of the medicine (in contrast to a widely used evidence-based protocol that permits a lower dose), prohibits its use after 49 days of pregnancy and requires the woman to make an extra trip to the clinic. In 2013, Texas adopted a variation on this approach by permitting use of the lower dose but retaining the two other limitations. The state joins Ohio in requiring use of the outdated protocol.\n\nFinally, Oklahoma adopted a law in 2010 designed to ban medication abortion entirely. In 2012, the state’s supreme court overturned the law and in November, the U.S. Supreme Court declined to take the case. As a result, the ban is not in effect.\n\nPrivate Insurance Coverage of Abortion\n\nStates adopted three types of restrictions on insurance coverage of abortion. Michigan’s new measure is the most expansive of those enacted in 2013, it prohibits abortion coverage in private health plans except when the woman’s life is endangered. This brings to nine the number of states with restrictions that apply to all private health plans (see State Policies on Restricting Insurance Coverage of Abortion).\n\nThe Michigan provisions also specifically prohibit plans participating in the health exchange from providing coverage beyond situations when the woman’s life is endangered. Three other states (Arkansas, North Carolina and Pennsylvania) also enacted provisions that greatly restrict abortion coverage in the health exchanges established under the Affordable Care Act and only allow coverage in cases of life endangerment, rape and incest. Additional abortion coverage in Arkansas, Michigan and Pennsylvania is available only through the purchase of a separate rider at an additional cost. Including these four states, 24 states have banned abortion coverage in health exchanges.\n\nNorth Carolina enacted a measure prohibiting health plans for county or municipal employees from covering abortion except in cases of life endangerment, rape or incest. The Georgia Board of Community Health approved a health plan for state employees that will not cover abortion except in cases of life endangerment. Nineteen states now limit abortion coverage for state employees.\n\nOther Major Abortion Restrictions\n\nStates adopted a wide range of other major abortion restrictions in 2013.\n\nParental Involvement. Three states enacted provisions designed to make it more difficult for minors to obtain abortions without parental involvement. Arkansas enacted a measure that makes it a crime to assist a minor in obtaining an abortion without parental consent, even if the procedure is performed in a state where parental involvement is not required. Montana Gov. Steve Bullock (D) allowed a parental consent requirement to go into effect without his signature; enforcement of the law is blocked pending a legal challenge. Oklahoma, which has long required parental consent and notification, adopted a measure that made the process for complying with the law more cumbersome by adding requirements such as documentation from parents proving parenthood. Finally, the Illinois Supreme Court cleared the way for the state’s 1995 parental notice law to go into effect, bringing the number of states requiring parental involvement before a minor receives an abortion to 39 (see State Policies on Parental Involvement in Minors’ Abortions).\n\nPublic Funding for Abortion. Iowa continued its policy of paying for abortions only in cases of life endangerment, rape, incest and fetal impairment. However, the state now requires the governor’s office to approve all instances where reimbursement is provided. Most states pay for abortion only in cases of life endangerment, rape or incest; Iowa is one of six states with a slightly broader standard see State Policies on State Funding of Abortion Under Medicaid). Seventeen states pay for all or most medically necessary abortions for low-income women (see Insurance Coverage of Abortion: Beyond the Exceptions for Life Endangerment, Rape and Incest).\n\nWaiting Periods. South Dakota effectively extended its 72-hour waiting period by declaring that weekends and holidays could not be counted toward the requirement; this could extend the waiting period to a maximum of six days in some cases, giving the state the most restrictive waiting period requirement of the 26 such requirements in the country (see State Policies on Counseling and Waiting Periods).\n\nCounseling. Ohio and Kansas expanded their existing counseling requirements. Ohio moved to require providers to test for a fetal heartbeat at least 24 hours before an abortion and inform the woman of the “statistical probability” of carrying the pregnancy to term if a fetal heartbeat is detected. Kansas enacted a measure requiring that abortion counseling materials include information on fetal pain, the risk of breast cancer and premature birth; the measure also delineates the exact text for written counseling materials (see State Policies on Counseling and Waiting Periods).\n\nUltrasound. Wisconsin and Indiana both adopted measures that require women to undergo an ultrasound prior to obtaining an abortion and listen to a detailed description of the image; the provider must offer her the option to view the image and listen to the heartbeat. Twenty-two states now regulate the provision of ultrasound by abortion providers (see State Policies on Requirements for Ultrasound).\n\nSex Selection and Genetic Impairment. Kansas, North Carolina and North Dakota enacted provisions criminalizing abortion for the purposes of sex selection. The North Dakota measure also prohibits the provision of an abortion because the fetus has been “diagnosed with either a genetic abnormality or the potential for a genetic abnormality.” This brings to six the number of states that ban abortion for purposes of sex selection, in line with a recent push by abortion opponents both in the U.S. and internationally (see A Problem-and-Solution Mismatch: Son Preference and Sex-Selective Abortion Bans).\n\nWithholding Information. Kansas and Montana enacted laws that shield medical professionals from liability for withholding information that may have resulted in a woman obtaining an abortion.\n\nState Employees. Kansas enacted a measure prohibiting state employees from participating in or facilitating abortions unless the procedure is performed outside of normal working hours at a facility not funded or operated by the state.\n\nRefusal. A new law adopted in North Carolina allows any health care facility to refuse to provide abortion services; the previous law had allowed only hospitals to refuse. The law also expands the types of medical providers who may refuse to participate in an abortion to include professionals such as pharmacists, counselors and social workers, or their employees; previous law had applied only to physicians and nurses (see Refusing to Provide Health Services).\n\nFamily Planning\n\nTwenty states enacted measures relating to access to family planning services in 2013, including measures that set funding levels, determine the types of providers eligible for funding and affect access to emergency contraception.\n\nFamily Planning Programs\n\nOf the 17 states that passed budgets with line items for family planning funding, only Maine cut funding drastically; following on the heels of a 25% cut in 2012, the state slashed funds by an additional 33% in 2013. In contrast, New Hampshire reversed the 57% cut to family planning funding that had been adopted in 2011, restoring funds to their previous level. A similar attempt to reverse funding cuts in New Jersey came up short when Gov. Chris Christie (R) vetoed family planning funding for the fifth time.\n\nAlthough family planning funding remained relatively stable in 2013, attempts to restrict family planning providers’ eligibility for state and federal funds continued apace. A new tiered system for determining priority for state and federal family planning funds in Ohio puts family planning providers at the bottom of a long list. A similar system in Oklahoma excludes specialized family planning providers not affiliated with health departments from receiving funds. Colorado, Kansas, Michigan and Texas re-enacted their existing restrictions, although the measure in Kansas is blocked due to a legal challenge. At year’s end 10 states have abortion-related restrictions on family planning providers (see State Family Planning Funding Restrictions).\n\nFederal courts blocked measures enacted in Arizona and Indiana that would have excluded family planning providers who have any association with abortion services from being able to participate in the massive Medicaid program, citing that Medicaid patients have the right to seek treatment from the Medicaid provider of their choice (see Besieged Family Planning Network Plays Pivotal Role).\n\nThese injunctions cleared the way for abortion providers in Arizona and Indiana to be reimbursed for the family planning services they provide to Medicaid enrollees. In sharp contrast, Texas abolished its longstanding and successful federal-state family planning expansion after being told by the federal Centers for Medicare and Medicaid services that it was impermissible for the state to exclude providers who had some association with abortion. The state replaced it with a much smaller and entirely state-funded program (see State Medicaid Family Planning Eligibility Expansions).\n\nEmergency Contraception\n\nHawaii enacted a new law requiring that a woman who has been sexually assaulted receive medically accurate and unbiased information on emergency contraception from the hospital treating her injuries. The law also requires the hospital to dispense the medication when requested by the woman. Hawaii is the 18th state to provide protections to women who have been sexually assaulted (see Emergency Contraception).\n\nHowever, two states moved to restrict access to emergency contraception. In May, Oklahoma enacted a measure that would have required a minor younger than 17 to obtain a prescription to access the medication, despite the fact that the federal Food and Drug Administration ruled that minors of any age may obtain emergency contraception without a prescription; in August, a state court temporarily blocked enforcement of the measure. Also in 2013, Missouri passed a measure prohibiting the state from requiring pharmacies to carry prescription or nonprescription drugs or devices, including contraceptives, such as emergency contraception.\n\nSexually Transmitted Infections\n\nIn 2013, Hawaii, Nebraska and Vermont expanded access to treatment for STIs. Hawaii and Nebraska enacted provisions allowing health care practitioners to prescribe or dispense prescriptions for gonorrhea or chlamydia to a patient’s partner without first seeing the partner. Vermont, which had had a law allowing partner treatment for some STIs, enacted a new law expanding the conditions for which partner treatment is permitted. Twenty-eight states now explicitly permit treatment of a patient’s partner (see Partner Treatment for STIs).\n\nSex Education\n\nTwo states enacted measures to expand access to sex education in 2013. A new law in Colorado effectively prohibits abstinence-only instruction by requiring sex education in the state to be scientifically proven to delay sexual debut, reduce adolescents’ number of sexual partners, reduce the frequency of sex, and increase their contraceptive use. Illinois enacted three separate laws related to sex education. Although school districts can still decide for themselves whether to provide sex education, the new law requires any sex education that is taught in the state to be medically accurate and age-appropriate and include instruction on contraception and abstinence. The package also requires health education, which is mandatory for all school districts, to contain medically accurate information on abstinence as well as age-appropriate instruction on teen dating violence and child sexual abuse prevention. These new laws bring to nine the number of states requiring that the sex education provided in the state be medically accurate and include information on contraception (see State Policies in Brief: Sex and HIV Education.)\n\nAt the other end of the spectrum, new laws in North Carolina and Kansas could limit access to comprehensive and medically accurate sex education. A new law enacted in Kansas prohibits an individual who is associated in any way with an abortion provider from providing sex education. Meanwhile, a new law in North Carolina requires that sex education in the state must inform students that having an abortion increases the risk of a subsequent preterm birth. In Montana, Gov. Bullock (D) vetoed a measure that would have required parental consent for students participating in sex education.\n\nFetal Issues\n\nThree states enacted laws regarding assault on pregnant women or fetal homicide. Arkansas adopted a measure allowing a fetus to be considered a victim of homicide at any point in gestation; a similar measure was allowed to go into effect in Montana without the governor’s signature. Instead of considering a fetus an independent victim, Colorado amended its statute criminalizing assault on a pregnant woman to include penalties for causing a pregnant woman to miscarry.\n\nPregnancy\n\nTennessee enacted a law requiring publicly funded substance abuse facilities to give preference to pregnant women, there are now 10 states that require facilities give pregnant women priority access (see Substance Abuse During Pregnancy). It also prohibits the state from filing for protective services for a newborn if a woman who is less than 20 weeks into her pregnancy seeks substance abuse treatment as part of prenatal care. (A similar bill in New Mexico was effectively vetoed when Gov. Susana Martinez (R) took no action on it.) Finally, the budget adopted in Indiana allocated $250,000 for “prenatal substance use and prevention.”\n\nAPPENDIX: STATES BY HOSTILITY TO ABORTION RIGHTS, 2000 AND 2013", "images": ["https://www.guttmacher.org/sites/default/files/styles/scale_900x720/public/images/clip_image002_000.jpg?itok=sfEtJZaw", "https://www.guttmacher.org/sites/default/files/favicon.ico", "https://www.guttmacher.org/sites/default/files/styles/scale_900x720/public/images/more-restrictions-2011-2013_sm.png?itok=goN5JAv1", "http://www.guttmacher.org/sites/all/themes/gutt/logo.svg"], "top_img": "https://www.guttmacher.org/sites/default/files/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://www.guttmacher.org/laws-affecting-reproductive-health-and-rights-2013-state-policy-review", "title": "Laws Affecting Reproductive Health and Rights: 2013 State Policy Review", "meta_data": {"viewport": "width=device-width, initial-scale=1", "HandheldFriendly": "true", "MobileOptimized": "width", "description": "by Elizabeth Nash, Rachel Benson Gold, Andrea Rowan, Gwendolyn Rathbun and Yana Vierboom Reproductive health and rights were once again the subject of extensive debate in state capitols in 2013. Over the course of the year, 39 states enacted 141 provisions related to reproductive health and rights. Half of these new provisions, 70 in 22 states, sought to restrict access to", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "Guttmacher Institute", "type": "article", "url": "https://www.guttmacher.org/laws-affecting-reproductive-health-and-rights-2013-state-policy-review", "title": "Laws Affecting Reproductive Health and Rights: 2013 State Policy Review", "description": "by Elizabeth Nash, Rachel Benson Gold, Andrea Rowan, Gwendolyn Rathbun and Yana Vierboom Reproductive health and rights were once again the subject of extensive debate in state capitols in 2013. Over the course of the year, 39 states enacted 141 provisions related to reproductive health and rights. Half of these new provisions, 70 in 22 states, sought to restrict access to abortion services. In sharp contrast to this barrage of abortion restrictions, a handful of states adopted measures designed to expand access to reproductive health services.", "updated_time": "2016-05-06T14:54:15-04:00"}, "twitter": {"card": "summary_large_image", "creator": "@Guttmacher", "url": "https://www.guttmacher.org/laws-affecting-reproductive-health-and-rights-2013-state-policy-review", "title": "Laws Affecting Reproductive Health and Rights: 2013 State Policy", "description": "by Elizabeth Nash, Rachel Benson Gold, Andrea Rowan, Gwendolyn Rathbun and Yana Vierboom Reproductive health and rights were once again the subject of extensive debate in state capitols in 2013. Over"}, "article": {"published_time": "2013-12-31T13:11:42-05:00", "modified_time": "2016-05-06T14:54:15-04:00"}}, "movies": [], "publish_date": 1388513502.0, "source": "http://www.guttmacher.org", "summary": ""}