{"url": "https://www.vulture.com/2017/11/marvels-runaways-recap-season-1-episode-1.html", "text": "Marvel’s Runaways Reunion Season 1 Episode 1 Editor’s Rating 4 stars * * * * Previous Next » Photo: Paul Sarkis/Hulu\n\nMarvel’s Runaways has had a rocky journey from comics to television. Created in 2003 by writer Brian K. Vaughan and artist Adrian Alphona, the original comic prompted Marvel to consider a Runaways movie, which reached early casting stages before being shelved in the early aughts. Enter Josh Schwartz and Stephanie Savage, a pair of TV veterans with experience making both a California-based teen soap (The O.C.) and an adaptation of YA source material (Gossip Girl). They bring Runaways to the screen as Marvel Television’s first series for Hulu, where it stands separate from the studio’s other shows on Netflix and ABC.\n\nThis separation is important: The original Runaways comic relied on teen characters who were far away from the superheroes of the Marvel universe. The Avengers weren’t going to fly out to Los Angeles for a group of kids who thought their parents are evil, and so the Runaways had to depend on each other to survive. While existing within a superhero universe, the Runaways comic was always more of a teen drama with heavy genre elements, prioritizing character development while eschewing superhero conventions. The heroes wouldn’t wear costumes, and the distinct wardrobes created by Alphona were extensions of constantly evolving personalities.\n\nSchwartz and Savage understand that appeal: There’s very little about the Runaways pilot that indicates this show exists in a superhero world. The episode begins with a runaway, Destiny (Nicole Wolf), but she isn’t one of the main characters. Destiny plays a key role later in the episode, but her time on this series is limited, and the help she receives from two members of the Church of Gibborim will ultimately doom her. With its shaky handheld camerawork and sickly green palette, the cold open is a tense, gritty introduction to the world of Runaways, providing a seedy image of Los Angeles that is wiped away when the story jumps to the wealthy neighborhoods where the central teenagers live.\n\nThe title sequence sets the tone for the rest of the episode, providing glimpses of different L.A. environments — from lavish homes to grimy streets and rolling hills — backed by synth-heavy chillwave music. It’s sunny and colorful, but also a bit sinister, teasing the darkness at the root of these teenagers’ privileged lives. It also has some cheeky teases of future plot points, like an inflatable dinosaur pool toy, the significance of which longtime fans will immediately understand.\n\n“Reunion” is the first fictional work directed by Brett Morgen, a documentarian who has worked on films like the Academy Award–nominated On the Ropes, Cobain: Montage of Heck, and this year’s Jane. Morgen is a filmmaker committed to verisimilitude, and he’s an inspired choice to direct a superhero project with a grounded perspective. One of the most impressive things about this episode is the sense of place, and Morgen provides a strong impression of each different setting, whether it’s a bus driving into L.A., an opulent mansion in Brentwood, or a goth girl’s bedroom. One of the most striking locations is a white room heavily inspired by 2001: A Space Odyssey, and the production design serves as exposition, indicating the alien nature of the characters in the scene. (The H.R. Giger-esque breathing tube is a great touch.)\n\nThe first half of “Reunion” plays like the usual teen soap about rich young people, introducing each of the main cast members and establishing their relationships with their parents before following them at school. It’s clear early on that Runaways is making significant changes to the source material, most prominently by giving Nico Minoru (Lyrica Okano) an older sister who has been dead for two years. Amy Minoru’s death splintered Nico’s group of childhood friends, and Runaways begins as Alex Wilder (Rhenzy Feliz) tries to get the gang back together on the anniversary of Amy’s death.\n\nAlex is a loner, and his parents are concerned that his isolation will be irreversible if he doesn’t let others into his life. The Wilders genuinely care about their son, and the small detail of Geoffrey (Ryan Sands) recognizing a video game that Alex hasn’t played in a while shows that he tries to be engaged in his life. There’s much more tension in Nico’s domestic situation: Her mother Tina (Brittany Ishibashi) is icy and angry, and she lashes out at Nico when she goes into Amy’s impeccably preserved bedroom to get a pair of tights. Robert (James Yaegashi) has much more empathy for his daughter’s situation, and it’s clear that Amy’s death has driven a wedge between him and Tina.\n\nAll of the changes made to the source material work in this series’ favor, providing new opportunities to delve deeper into the character relationships. While the comic didn’t spend any time with the teens at school, they all attend the same elite private academy in the show, and that social hierarchy has a direct impact on how they interact with each other. Chase (Gregg Sulkin) is a jock who makes fun of the people he used to make fun of jocks with, Gert (Ariela Barer) is a punky feminist crushing on him, Karolina (Virginia Gardner) is a perfect blonde church girl, and Molly (Allegra Acosta) is the freshman eager to find her tribe.\n\nMolly is also Gert’s adopted sister on the show, and Barer and Acosta create an affectionate sibling dynamic that leaves plenty of room for playful ribbing, whether it’s Gert criticizing Molly for auditioning for the dance squad or Molly commenting on Gert’s desperation when she tries to talk to Chase. The entire main cast has a similarly natural chemistry: These separate characters were once a tightly knit group, and moments like Karolina and Nico’s weepy interaction in the school bathroom are imbued with a longing to reconnect with a friend who has drifted away.\n\nIn the comics, Karolina is the daughter of two actors, but the TV show reimagines her mother Leslie (Annie Wersching) as the head of the Scientology-esque Church of Gibborim, a clever shift that makes a lot of sense with the L.A. setting. Connecting Karolina to a church also adds a new layer to her closeted sexual orientation, which is hinted at when she’s transfixed by two women making out at a party. In an act of rebellion, Karolina takes off the bracelet she received when she was initiated into the church at birth, and her flesh becomes a sparkling pastel rainbow. She passes out immediately after removing her bracelet, and when two of Chase’s lacrosse teammates try to take advantage of her, Chase realizes that maybe he shouldn’t have abandoned his old friends for aspiring rapists.\n\nChase, Karolina, and the rest of the gang eventually make their way to Alex’s house for pizza with a side of sadness as they talk about how Amy’s death pushed them apart. But a trip to the Wilder study to pilfer liquor brings these teens back together in a way they never could have expected: A stack of coasters is actually the key to a secret door, and adolescent curiosity compels them to venture into the mysterious passageway, which is considerably older than the house built above it. Standing on the balcony of some sort of underground temple, the kids watch their parents engage in a strange ritual, wearing creepy robes as they bring Destiny into their circle. She’s drugged and placed in a weird glowing container, and although the teens don’t know what the hell is going on, they know that it’s not good.\n\nThe concept of Runaways is dark, but there’s plenty of humor in this episode to endear viewers. The dialogue is briskly paced with plenty of quips, and there are some fun visual gags sprinkled throughout: a poster declaring “Sitting Is the New Cancer!” behind a group of students hunched over their standing desks, a close-up of Chase’s butt as Gert walks behind him at school. The funniest moment is when Molly’s mom, Stacey (Brigid Brannagh), tells her that if breathing exercises and chamomile tea don’t sooth her menstruation cramps, she should go the bathroom and give herself an orgasm for natural pain relief.\n\nBut Molly isn’t dealing with period cramps. She actually has superstrength, and the manifestation of her power marks the point when Runaways goes from typical teen soap to something more fantastic. Brian K. Vaughan is credited as an executive consultant to the series, and while it’s not clear how much say he had on the final product, the pilot’s faithfulness to the spirit of his comic suggests that he had a hands-on role. The superhero elements will clearly be used to explore aspects of the adolescent experience from angles that wouldn’t be possible in a more realistic story, and this episode’s commitment to character indicates that Runaways has made it into the right creative hands after years trapped in development hell.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2017/11/20/recaps/20-runaways-101.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/11/20/recaps/20-runaways-101.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/20/recaps/20-runaways-101.w1200.h630.jpg", "keywords": [], "authors": ["Oliver Sava"], "canonical_link": "https://www.vulture.com/2017/11/marvels-runaways-recap-season-1-episode-1.html", "title": "Marvel’s Runaways Series-Premiere Recap: Teenage Dream", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Marvel’s Runaways Series-Premiere Recap: Teenage Dream", "url": "https://www.vulture.com/2017/11/marvels-runaways-recap-season-1-episode-1.html", "description": "The new Marvel show turns a typical teen soap into something fantastic.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/20/recaps/20-runaways-101.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Marvel’s Runaways Premiere Recap: Teenage Dream", "description": "The new Marvel show turns a typical teen soap into something fantastic.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/20/recaps/20-runaways-101.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-11-21T02:00:00.185-05:00", "tag": "tv, tv recaps, overnights, recaps, marvel's runaways, hulu", "publisher": "https://www.facebook.com/Vulture"}, "description": "The new Marvel show turns a typical teen soap into something fantastic. A recap of Marvel’s Runaways season 1 episode 1 ‘Reunion’.", "sailthru.tags": "tv, tv recaps, overnights, recaps, marvel's runaways, hulu", "author": "Oliver Sava", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1511247600.185, "source": "https://www.vulture.com", "summary": ""}