{"url": "https://variety.com/2018/film/news/scarlett-johansson-exit-rub-and-tug-trans-backlash-1202872981/", "text": "Scarlett Johansson has exited the drama film “Rub and Tug” a little more than a week after her casting sparked backlash amid trans groups and activists, a source with knowledge of the situation confirms to Variety.\n\n“In light of recent ethical questions raised surrounding my casting as Dante Tex Gill, I have decided to respectfully withdraw my participation in the project,” Johansson told Out Magazine, which first reported the news, in a statement. “Our cultural understanding of transgender people continues to advance, and I’ve learned a lot from the community since making my first statement about my casting and realize it was insensitive. I have great admiration and love for the trans community and am grateful that the conversation regarding inclusivity in Hollywood continues. According to GLAAD, LGBTQ+ characters dropped 40% in 2017 from the previous year, with no representation of trans characters in any major studio release.”\n\n“While I would have loved the opportunity to bring Dante’s story and transition to life, I understand why many feel he should be portrayed by a transgender person, and I am thankful that this casting debate, albeit controversial, has sparked a larger conversation about diversity and representation in film,” the statement continues. “I believe that all artists should be considered equally and fairly. My production company, These Pictures, actively pursues projects that both entertain and push boundaries. We look forward to working with every community to bring these most poignant and important stories to audiences worldwide.”\n\nNew Regency won an auction for the movie on July 2, and it was set to be directed by Rupert Sanders, who previously worked with Johansson on “Ghost in the Shell.”\n\n“Rub and Tug” focused on Dante “Tex” Gill, a crime kingpin who used his massage parlor as a front for prostitution in the ’70s and ’80s. Gill lived his life as a trans man, which led many on social media to wonder why a trans actor wasn’t tapped for the role.\n\n“Oh word?? So you can continue to play us but we can’t play y’all?” Trace Lysette, a transgender actress best known for appearing on Amazon’s “Transparent,” wrote on Twitter after the casting announcement. “Hollywood is so f—ed… I wouldn’t be as upset if I was getting in the same rooms as Jennifer Lawrence and Scarlett for cis roles, but we know that’s not the case. A mess.”\n\n“Actors who are trans never even get to audition FOR ANYTHING OTHER THAN ROLES OF TRANS CHARACTERS,” tweeted Jamie Clayton, another transgender actress known for her role on “Sense8.” “THATS THE REAL ISSUE. WE CANT EVEN GET IN THE ROOM. Cast actors WHO ARE TRANS as NON TRANS CHARACTERS. I DARE YOU.”\n\nJohansson’s rep previously sent a statement to several media outlets in response to the backlash, which didn’t help to quell the controversy: “Tell them that they can be directed to Jeffrey Tambor, Jared Leto, and Felicity Huffman’s reps for comment.”\n\nGLAAD responded to the news with a statement on Friday, celebrating the decision as well as those who spoke out against the casting.\n\n“Scarlett Johansson’s announcement, together with the transgender voices who spoke out about this film, are game changers for the future of transgender images in Hollywood,” said GLAAD president and CEO Sarah Kate Ellis. “Hollywood changed how Americans understand gay and lesbian lives, and TV is starting to do the same for transgender people with authentic transgender portrayals being major hits with critics and audiences. The film industry has a real opportunity to do the same.”\n\nIt’s currently unclear where production stands on “Rub and Tug” after Johansson’s exit.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Fscarlett-johansson-exit-rub-and-tug-trans-backlash-1202872981%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202872981&comment_count=606", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=681&h=383&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=1000", "keywords": [], "authors": ["Alex Stedman"], "canonical_link": "https://variety.com/2018/film/news/scarlett-johansson-exit-rub-and-tug-trans-backlash-1202872981/", "title": "Scarlett Johansson Exits Trans Film ‘Rub and Tug’ Amid Backlash", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Scarlett Johansson has exited \"Rub and Tug\" a little more than a week after her casting sparked backlash amid trans groups and activists.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202872981, "author": "Alex Stedman", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-13T11:11:05"}, "pmc-tag": "Rub and Tug,Scarlett Johansson", "title": "Scarlett Johansson Exits Trans Film ‘Rub and Tug’ Amid Backlash", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Scarlett Johansson Exits Trans Film ‘Rub and Tug’ Amid Backlash", "url": "https://variety.com/2018/film/news/scarlett-johansson-exit-rub-and-tug-trans-backlash-1202872981/", "description": "Scarlett Johansson has exited the drama film “Rub and Tug” a little more than a week after her casting sparked backlash amid trans groups and activists, a source with knowledge of the s…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=1000", "width": 1000, "height": 563, "alt": "Scarlett Johansson exits trans movie"}, "locale": "en_US"}, "article": {"published_time": "2018-07-13T18:11:05+00:00", "modified_time": "2018-07-13T22:57:21+00:00"}, "twitter": {"creator": "@https://twitter.com/a_sted?lang=en", "site": "@variety", "text": {"title": "Scarlett Johansson Exits Trans Film ‘Rub and Tug’ Amid Backlash"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=1000", "alt": "Scarlett Johansson exits trans movie"}, "card": "summary_large_image", "title": "Scarlett Johansson Exits Trans Film ‘Rub and Tug’ Amid Backlash", "description": "Scarlett Johansson has exited \"Rub and Tug\" a little more than a week after her casting sparked backlash amid trans groups and activists."}, "author": "Alex Stedman", "content_type": "Article", "post_id": 1202872981, "title": "Scarlett Johansson Exits Trans Film 'Rub and Tug' Amid Backlash", "published_at": "2018-07-13 11:11:05", "image": "https://pmcvariety.files.wordpress.com/2018/07/scarlett-johansson.jpg?w=1000", "comment_count": 606, "tags": "Scarlett Johansson", "topics": "News", "appeared_in_print": "No", "body": "Scarlett Johansson has exited the drama film \"Rub and Tug\" a little more than a week after her casting sparked backlash amid trans groups and activists, a source with knowledge of the situation confirms to Variety.\r\n\r\n\"In light of recent ethical questions raised surrounding my casting as Dante Tex Gill, I have decided to respectfully withdraw my participation in the project,\" Johansson told Out Magazine, which first reported the news, in a statement. \"Our cultural understanding of transgender people continues to advance, and I’ve learned a lot from the community since making my first statement about my casting and realize it was insensitive. I have great admiration and love for the trans community and am grateful that the conversation regarding inclusivity in Hollywood continues. According to GLAAD, LGBTQ+ characters dropped 40% in 2017 from the previous year, with no representation of trans characters in any major studio release.\"\r\n\r\n\"While I would have loved the opportunity to bring Dante’s story and transition to life, I understand why many feel he should be portrayed by a transgender person, and I am thankful that this casting debate, albeit controversial, has sparked a larger conversation about diversity and representation in film,\" the statement continues. \"I believe that all artists should be considered equally and fairly. My production company, These Pictures, actively pursues projects that both entertain and push boundaries. We look forward to working with every community to bring these most poignant and important stories to audiences worldwide.\"\r\n\r\nNew Regency won an auction for the movie on July 2, and it was set to be directed by Rupert Sanders, who previously worked with Johansson on \"Ghost in the Shell.\"\r\n\r\n\"Rub and Tug\" focused on Dante “Tex” Gill, a crime kingpin who used his massage parlor as a front for prostitution in the '70s and '80s. Gill lived his life as a trans man, which led many on social media to wonder why a trans actor wasn't tapped for the role.\r\n\r\n\"Oh word?? So you can continue to play us but we can’t play y’all?\" Trace Lysette, a transgender actress best known for appearing on Amazon's \"Transparent,\" wrote on Twitter after the casting announcement. \"Hollywood is so f---ed... I wouldn’t be as upset if I was getting in the same rooms as Jennifer Lawrence and Scarlett for cis roles, but we know that’s not the case. A mess.\"\r\n\r\n\"Actors who are trans never even get to audition FOR ANYTHING OTHER THAN ROLES OF TRANS CHARACTERS,\" tweeted Jamie Clayton, another transgender actress known for her role on \"Sense8.\" \"THATS THE REAL ISSUE. WE CANT EVEN GET IN THE ROOM. Cast actors WHO ARE TRANS as NON TRANS CHARACTERS. I DARE YOU.\"\r\n\r\nJohansson's rep previously sent a statement to several media outlets in response to the backlash, which didn't help to quell the controversy: \"Tell them that they can be directed to Jeffrey Tambor, Jared Leto, and Felicity Huffman’s reps for comment.\"\r\n\r\nGLAAD responded to the news with a statement on Friday, celebrating the decision as well as those who spoke out against the casting.\r\n\r\n\"Scarlett Johansson’s announcement, together with the transgender voices who spoke out about this film, are game changers for the future of transgender images in Hollywood,\" said GLAAD president and CEO Sarah Kate Ellis. \"Hollywood changed how Americans understand gay and lesbian lives, and TV is starting to do the same for transgender people with authentic transgender portrayals being major hits with critics and audiences. The film industry has a real opportunity to do the same.\"\r\n\r\nIt's currently unclear where production stands on \"Rub and Tug\" after Johansson's exit.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1531505465.0, "source": "https://variety.com", "summary": ""}