{"url": "comicbook.com/dc/2018/06/14/aquaman-movie-nicole-kidman-jason-momoa-amber-heard/", "text": "Jason Momoa debuted as Aquaman in the DC Extended Universe in last fall's Justice League, with the character getting his own film this December. The new issue of Entertainment Weekly offers our first look at Nicole Kidman's character in the film, Queen Atlanna, alongside Momoa and Amber Heard as Mera. Check out the cover below.\n\n(Photo: Entertainment Weekly)\n\nAtlanna debuted in 1959's Adventure Comics #260, which focused on the early years of Arthur Curry. The comic depicted Atlanna getting washed ashore by a hurricane, ultimately falling in love with lighthouse keeper Tom Curry, resulting in Arthur's birth.\n\nIt's unclear exactly how closely to her comics origins the film will stick, though Kidman has professed her enthusiasm over the experience.\n\n\"I got to be [like] a mermaid!\" Kidman revealed to The Hollywood Reporter last year. \"I got to be a queen, I got to wear a crown...I have a particular way of looking.\"\n\nThe upcoming film was directed by James Wan, who mastered the horror world with films like The Conjuring and Insidious before making the leap to big-budget actions films with Furious 7. Kidman teased that Aquaman will appeal to fans of a variety of demographics.\n\n\"I got to lie on a rock with my hair strewn, and blood,\" Kidman pointed out. \"And I kind of liked it.\"\n\nWan also teased that the world he's exploring in the film marks uncharted territory for the filmmaker.\n\n“The water world my movie takes place in is so separate and so far apart from previous DC movies it’s like I’m making my own sci-fi fantasy film,” Wan shared with Entertainment Weekly. “This is a whole new underwater world nobody has seen before in live action.”\n\nFans of Aquaman enjoyed his appearance in Justice League, though the ways in which his underwater encounters were handled left much to be desired. According to former president of DC Entertainment Geoff Johns, the new film will appease devout fans.\n\n“The underwater stuff has never been executed like this before,” Johns confessed. “The visual effects shots coming in are just beautiful. James can switch modes from horror to big bright colorful action to really emotional scenes. He’s so able to hit all these different genres.”\n\nFootage from the film was recently screened at CineEurope, likely confirming audiences' first look at an Aquaman trailer debuting in the near future.\n\nAquaman lands in theaters on December 21.\n\nHow do you think Atlanna looks in the new image? Let us know in the comments below!\n\n[H/T Entertainment Weekly]", "images": ["https://media.comicbook.com/2018/06/aquaman-entertainment-weekly-cover-jason-momoa-nicole-kidman-1115988.jpeg", "https://media.comicbook.com/2018/06/nicole-kidman-aquaman-queen-atlanna-1115990-640x320.jpeg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2018/06/nicole-kidman-aquaman-queen-atlanna-1115990-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/dc/2018/06/14/aquaman-movie-nicole-kidman-jason-momoa-amber-heard/", "title": "'Aquaman' Movie Reveals First Look at Nicole Kidman as Atlanna", "meta_data": {"description": "Jason Momoa debuted as Aquaman in the DC Extended Universe in last fall's Justice League, with the character getting his own film this December. The new issue of Entertainment Weekly offers our first look at Nicole Kidman's character in the film, Queen Atlanna, alongside Momoa and Amber Heard as [...]", "keywords": "Aquaman,Jason Momoa,Nicole Kidman,Amber Heard", "news_keywords": "Aquaman,Jason Momoa,Nicole Kidman,Amber Heard", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "'Aquaman' Movie Reveals First Look at Nicole Kidman as Atlanna", "description": "Jason Momoa debuted as Aquaman in the DC Extended Universe in last fall's Justice League, with [...]", "image": "https://media.comicbook.com/2018/06/nicole-kidman-aquaman-queen-atlanna-1115990-640x320.jpeg"}, "og": {"title": "'Aquaman' Movie Reveals First Look at Nicole Kidman as Atlanna", "type": "article", "url": "https://comicbook.com/dc/2018/06/14/aquaman-movie-nicole-kidman-jason-momoa-amber-heard/", "image": {"identifier": "https://media.comicbook.com/2018/06/nicole-kidman-aquaman-queen-atlanna-1115990-640x320.jpeg", "width": 640, "height": 320}, "site_name": "DC", "description": "Jason Momoa debuted as Aquaman in the DC Extended Universe in last fall's Justice League, with [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1528905600.0, "source": "http://comicbook.com", "summary": ""}