{"url": "http://abcnewsradioonline.com/music-news/2018/1/30/legendary-producer-quincy-jones-disses-taylor-swifts-songwri.html", "text": "Mert & MarcusQuincy Jones, the legendary, award-winning producer who brought us Michael Jackson's Off the Wall, Thriller and Bad, knows a thing or two about music. And apparently, he's at best lukewarm about Taylor Swift's songwriting talent.\n\nIn an interview with GQ, Jones says he's a big fan of artists like Bruno Mars, Kendrick Lamar, Drake, Jennifer Hudson and Mary J. Blige. When asked his opinion on Taylor's music, though, Jones says, \"We need more songs, man. F***ing songs, not hooks.\"\n\nWhen GQ points out that Taylor is considered one of the greatest modern-day songwriters, Jones laughs, \"Whatever crumbles your cookie.\" GQ then asks Jones what's missing in Taylor's music.\n\n\"Knowing what you're doing. You know what I mean?\" Jones responds. \"Since I was a little kid, I've always heard the people that don't wanna do the work. It takes work, man. The only place you find success before work is the dictionary, and that's alphabetical.\"\n\nGQ then asks Quincy to put his money where his mouth is: \"So if you were producing a record for Taylor Swift,\" the publication asks, \"what would you have her do?\n\n\"I'll figure something out. Man, the song is the s**t,\" responds Quincy. \"That's what people don't realize. A great song can make the worst singer in the world a star. A bad song can't be saved by the three best singers in the world. I learned that 50 years ago.\"\n\nBut, GQ points out, Taylor is considered to have great songs.\n\n\"But they don't know, man. They don't know,\" Jones counters. \"I've come and gone through seven decades of this s**t. Seen all that. Seen how that works. Ignorance is no thing.\"\n\nThen again, Jones also tells GQ that he didn't think Elvis Presley could sing.\n\nCopyright © 2018, ABC Radio. All rights reserved.", "images": ["http://abcnewsradioonline.com/universal/images/transparent.png", "http://dlgie0dznny76.cloudfront.net/wp-content/uploads/2015/10/21160010/START_HERE_PODCAST_ICON_600x600_APODCASTS.jpg?__SQUARESPACE_CACHEVERSION=1526932874504", "http://pixel.quantserve.com/pixel/p-53469zSReurz-.gif", "http://c.statcounter.com/4890009/0/dcd35c0c/1/", "http://abcnewsradioonline.com/storage/layout/new-banner0102.png", "http://abcnewsradioonline.com/storage/music-news-images-january-2018/M_TaylorSwiftSnakeRing_082817.jpg?__SQUARESPACE_CACHEVERSION=1517337820810"], "top_img": "http://abcnewsradioonline.com/storage/music-news-images-january-2018/M_TaylorSwiftSnakeRing_082817.jpg?__SQUARESPACE_CACHEVERSION=1517337820810", "keywords": [], "authors": [], "canonical_link": "http://abcnewsradioonline.com/", "title": "ABC News Radio", "meta_data": {"Robots": "index,follow", "description": "Music News From ABC News Radio", "og": {"title": "ABC News Radio", "description": "ABC News Radio. Trusted. Credible. Complete. Online. America's largest commercial radio news network.", "image": "http://abcnewsradioonline.com/storage/abcnewsradio.png", "type": "News", "url": "http://abcnewsradioonline.com/", "site_name": "ABC News Radio"}, "fb": {"app_id": 111042768157, "admins": "USER_ID"}}, "movies": [], "publish_date": 1517241600.0, "source": "http://abcnewsradioonline.com", "summary": ""}