{"url": "https://www.billboard.com/articles/columns/hip-hop/8021967/cardi-b-offset-relationship-timeline", "text": "HIP-HOP Cardi B and Offset's Relationship: A Timeline\n\nOffset of Migos and Cardi B attend the BET Hip Hop Awards 2017 at The Fillmore Miami Beach at the Jackie Gleason Theater on Oct. 6, 2017 in Miami Beach, Fla.\n\nCardi B took to Instagram on Wednesday (Dec. 5) to announce her split from husband Offset in a video confession.\n\n“We’ve got a lot of love for each other but things just haven’t been working out for us for a long time,\" Cardi said. \"It’s nobody’s fault, I just guess we grew out of love. But we’re not together anymore.\"\n\nThe duo's relationship began in early 2017, and has since brought cheating scandals, a secret marriage, baby Kulture Kiari Cephus and some hot collaborative tracks.\n\nFollowing Cardi B's announcement, Billboard has compiled a complete timeline of Cardi B and Offset's relationship, from their early collaboration days to their split.\n\nDec. 2016: Cardi B Teases \"Lick\" Collaboration With Offset\n\nWhile it is possible that the two never met during recording, the pair were linked nearly a month prior to the Gangsta Bitch Music Vol. 2 release. In a since-deleted Instagram post by Cardi B, she danced and made it rain in the club while teasing the collaborative track.\n\nFeb. 2017: Super Bowl Date\n\nAccording to a Migos interview with Rolling Stone, Offset admitted that after watching Cardi rise as an artist, he had a publicist set up a dinner in New York with a group of women, including the Bronx rapper in early 2017. “I was like, ‘Damn, I am on her!’ ” he said. “I am like, ‘Shit, I like Cardi B!’ ”\n\nHowever, it wasn't until the Super Bowl that the couple were first seen holding hands in public. Cardi B was also spotted in a live video streamed by Offset, which was later reposted by fan accounts.\n\nNew couple alert? #CardiB and #Offset of the #Migos went to the Super Bowl together. A post shared by Bossip.com (@bossipofficial) on Feb 6, 2017 at 5:56am PST\n\nFans of both Migos and Cardi B tweeted hilarious captions to paparazzi shots of the couple, noting that they were about to become serious #RelationshipGoals.\n\nPresident Offset & First Lady Cardi B pic.twitter.com/OKQjWwrxnC — ronald isley (@yoyotrav) February 7, 2017\n\nFeb. 14: Cardi Posts a Telling Video On Her Instagram\n\nOn Valentine's Day, Cardi B posted an Instagram video of her and her \"babe\" Offset. Judging by the pair's outfits and the stadium seats in the background, it's a video from their hot date to the Super Bowl earlier that month.\n\nMarch 2017: Cardi Denies Relationship Rumors\n\n“I’m not saying I’m dating an Atlanta guy,\" Cardi said during a Fader interview after being asked about the potential relationship. She refused to offer any further comment on the speculations.\n\nApril 2017: Offset Also Denies Relationship Rumors\n\nSoon after, during a Migos interview with Tim Westwood, Offset only offered a playful smirk on the subject of Cardi B, while the rest of the group laughed. \"Shout out Cardi B,\" said Migos member Quavo. Earlier that month, Westwood received the same silent treatment when he asked Offset about his relationship to the Bronx rapper.\n\nMay 2017: Cardi B and Offset Attend the Met Gala After Party\n\nCardi B and Offset were seen at the Met Gala after party together at 1 Oak nightclub. According to reports, the couple appeared more smitten than ever. Cardi B dressed in a dazzling blush pink sheer dress, while Offset rocked a velvet turtleneck with chains.\n\nJune 2017: Cardi B Still Doesn't Confirm Her Relationship With Offset\n\n“It’s been a blessing, me meeting him and meeting his friends,\" Cardi B told Fader about her friendship with Migos. \"I see how hard they work. And that motivated me to work even harder.” While she didn't confirm any romantic ties to the Atlanta rapper, she stated \"a lot of positive things came out of that [meeting].\" Later that month, the two attended the BET awards separately.\n\nJuly 2017: Offset Buys Cardi a $60,000 Chain\n\nWhile backstage at a Meek Mill concert, Cardi B and Offset appeared happier than ever as she flashed her personalized chain gifted to her by Offset.\n\nCardi B and Offset at Meek Mill's Concert Tonight pic.twitter.com/7JMZGVMiKj — Daily Cardi (@DailyCardi) July 25, 2017\n\nCelebrity jeweler Elliot Avianne posted the chain to his Instagram account with the caption: \"Bloody Moves.\" The chain included a Cardi B-esque hand with red nails, rings and a red bandana.\n\nBloody Moves... @iamcardib ---- A post shared by Eliantte (@elliotavianne) on Jul 25, 2017 at 8:33am PDT\n\nAug. 2017: Cardi Shuts Down Engagement Rumors\n\nIn a since-deleted Instagram post, Offset posted a video rocking a massive ring on his pinky finger. However, Cardi B denied engagement rumors at the 2017 MTV Video Music Awards. “It is not true,\" she said to Us Weekly and other reporters.\n\nOct. 11, 2017: Offset Wishes Cardi a Happy Birthday With Loving Instagram Post\n\nMigos were on tour promoting their second album Culture in New Zealand on Cardi B's birthday, but that didn't stop Offset from posting adorable videos and photos of the two in honor of the big day. Offset shared an intimate video with his girlfriend, and a candid photo with the caption: \"H A P P Y B D A Y U ARE AMAZING TO ME YOU GOT IT OUT DA MUDD NO HELP NOBODY WAS BELIEVING AT FIRST BUT THAT MADE YOU GO HARDER U NOT WEAK U TAKE CARE YA WHOLE FAMILY AND ME ---- I L O V E Y O U.\"\n\n????????????????????---------------------------- S H E M I N E S I T S Y O U R D A Y A post shared by OFFSET (@offsetyrn) on Oct 10, 2017 at 10:41pm PDT\n\n@iamcardib H A P P Y B D A Y U ARE AMAZING TO ME YOU GOT IT OUT DA MUDD NO HELP NOBODY WAS BELIEVING AT FIRST BUT THAT MADE YOU GO HARDER U NOT WEAK U TAKE CARE YA WHOLE FAMILY AND ME ---- I L O V E Y O U ---------------- A post shared by OFFSET (@offsetyrn) on Oct 10, 2017 at 10:23pm PDT\n\nIn her true Cardi B style, she realized the negative implications of her beau not being in town for her birthday. “Oh, my gosh, I’m not getting no dick on my birthday,” Cardi told Rolling Stone in her 2017 cover story. She wouldn't have anyway, as she noted, “Because I got my period.”\n\n?Oct. 21, 2017: Cardi B Says She's Single\n\nIn since-deleted Instagram posts, Cardi B captioned a selfie \"single\" and a separate photo \"Peace nikka,\" fueling rumors that she and Offset had broken up.\n\nWait #CardiB are you and #Offset dunzo? #Nahhhh #CardiSet A post shared by The Shade Room (@theshaderoom) on Oct 21, 2017 at 7:20pm PDT\n\nThoughts #Roommates? -- A post shared by The Shade Room (@theshaderoom) on Oct 21, 2017 at 7:36pm PDT\n\nOct. 22, 2017: Cardi & Offset are Back On\n\nIt wasn't long before Cardi B reacted to the slew of breakup rumors by sending out a series of hilarious tweets. \"Reasons why me and Offset got into it,\" she began on Twitter, \"I thought he stole my purple blanket but it wasn't him so I'm still looking for the suspect.\" The \"Bodak Yellow\" star also added that \"on a serious note,\" she is still head over heels for her man, who was \"gifted to [her] from Jesus.\"\n\nReasons why me and Offset got into it ...I think he stoled my purple blanket --but it wasn’t him so I’m still looking for the suspect — iamcardib (@iamcardib) October 22, 2017\n\nWhy my dad was yelling at me cause somebody told him me and Offset broke up--..and I’m quick cut my dad off so don’t get comfortable ---- — iamcardib (@iamcardib) October 22, 2017\n\nNaaa but on a serious note I really loveeeee my man --he was gifted to me from Jesus ?? — iamcardib (@iamcardib) October 22, 2017\n\n?Later that month, she explained the situation further on her Instagram Story. \"So listen babes, I exaggerated a lil bit earlier cause I was really upset and the Bronx girl in me always have to go to the extreme. I came to my senses now. I'm sorry ... waffle house on me?\" she wrote.\n\nOct. 29, 2017: Offset Proposes to Cardi B\n\nJudging by their turbulent relationship, it is safe to say no one saw this coming. During a sold-out performance for Power 99's Powerhouse in Philadelphia, Offset got down on one knee to pop the question to the Bronx rapper on stage. Of course, the crowd went wild and Cardi B said yes. Later, she showed off the massive, $500,000 teardrop-shaped rock backstage.\n\n#PressPlay : That rock though -- #CardiB #Offset @carditv A post shared by The Shade Room (@theshaderoom) on Oct 27, 2017 at 8:48pm PDT\n\nDec. 21, 2017: Cardi B Mentions Offset in \"Bartier Cardi\"\n\nCardi B wrapped up her incredible year with the release of her single “Bartier Cardi,\" making sure to reference her fiancee Offset in the lyrics: “Cardi put the p---y on Offset/Cartier, Cardi B brain on Offset.”\n\nDec. 24, 2017: Offset Accused Of Cheating On Cardi B\n\nAn alleged video surfaced of what appeared to be Offset with another naked woman in a hotel. The Migos rapper reportedly claimed that his iCloud was hacked. Days later, a model named Celine Powell claimed to be pregnant with Offset’s baby.\n\nAlthough both Offset and Cardi denied the cheating rumors, Cardi was spotted without her engagement ring during a New Year's Eve public appearance.\n\nJan. 9, 2018: Cardi Addresses Cheating Rumors\n\nIn a since-deleted tweet, the Bronx rapper shared her opinion on the rumors surrounding her situation with Offset. “Why is it a problem that I want to take my time with a decision on my relationship ?” she wrote. “Why do I have to explain myself? I don’t ask ya why you still with that man that lives with his mom, that don’t pay your bills … Since when you guys had perfect relationship?”\n\nJan. 14, 2018: Offset Gets a Cardi B Tattoo\n\nIn a since-deleted Instagram video, Cardi caresses Offset's neck and reveals his new \"Cardi B\" tattoo.\n\nAre you feeling Offset's Cardi B neck tattoo? pic.twitter.com/SpSB7vWGQU — Hip Hop Weekly (@HipHopWeekly) January 14, 2018\n\nFeb. 2018: Cardi B Says She's Not Pregnant\n\nIn a since-deleted Instagram post, Cardi B shared a video of her lip-synching and dancing along to a remix of the 2017 hit \"Ahora Dice.\" After an internet troll commented asking the Bronx rapper to share her \"secret,\" referring to a possible baby-bump stomach, Cardi fired back: \"No b*tch I'm just getting fat. Let me fat in peace.\"\n\nMarch 19, 2018: Cardi B Addresses Offset Cheating Rumors\n\nAs Cosmopolitan's April cover star, Cardi B opened up about her situation with Offset. “It’s like everybody is coming down my neck like, ‘Why are you not leaving him? You have low self-esteem.’ I don’t have low self-esteem...I know I look good,\" Cardi told Cosmopolitan in an interview. \"I know I’m rich, I know I’m talented. I know I could get any man I want -- any basketball player, football player. But I want to work out my shit with my man, and I don’t got to explain why. I’m not your property. This is my life...I’m going to take my time, and I’m going to decide on my decision...it’s not right, what he fucking did -- but people don’t know what I did, ’cause I ain’t no angel.” She wrapped up with a hilarious question for her haters: \"Since when are all these women dating pastors and deacons?”\n\nMarch 29, 2018: Cardi B Issues a Warning\n\nCardi B released the single \"Be Careful With Me,\" that would later appear on her Invasion of Privacy album. While the entire song addresses the ups and downs of their relationship, in the chorus, the rapper gives a clear warning to -- who else could it be? -- Offset: \"Be careful with me/do you know what you doin'?/Whose feelings that you hurtin' and bruisin'?/You gon' gain the whole world/But is it worth the girl that you're losin'?\"\n\nApril 7, 2018: Cardi Reveals Her Baby Bump On SNL\n\nAfter months of denying pregnancy rumors, Cardi announced that she was in fact, pregnant with Offset's baby. She also took the stage on Saturday Night Live to perform \"Be Careful With Me\" in a dazzling white gown, accentuating her now-huge baby bump.\n\nApril 9, 2018: Cardi Addresses Cheating Rumors Again\n\nIn an interview with GQ, Cardi B once again commented on the rumors surrounding her and Offset's rocky relationship. \"For a long time we was in love with each other but we didn't really trust in each other,\" she said. \"It was like a competition of who's gonna hit each other up first. I don't want to hit him up first; he will hit me up first. People used to put things in my head: 'He gonna leave you. He be f--king with mad bitches.' People used to put things in his head: 'Cardi, she's a dog. Don't trust her.' We never really trusted each other because I always feel like he could get any girl he wants -- what makes me think he's gonna want me? I think he felt the same way. N---as want to be with me, and bitches wanna be with him.\"\n\nShe also mentioned that Offset is a great business partner. \"I don't really know the music business too well,\" she admitted. \"So I always feel like people taking advantage of me, he's always making sure that I'm well taken care of or that I learn something.\"\n\nMay 2018: Offset and Cardi Attend the Met Gala Separately\n\nA pregnant Cardi B swept the crowd at this year's met gala in a jewel-encrusted dress and matching headpiece, making her red carpet appearance with designer Jeremy Scott.\n\nOffset, on the other hand, attended the gala with his Migos members in Versace suits. Cardi B and Offset later attended the Met Gala after party together.\n\nJune 20, 2018: Cardi B and Offset Share Rolling Stone Cover\n\nRolling Stone's June cover featured pregnant Cardi with Offset kissing her belly alongside the caption, \"Cardi B & Offset: A Hip Hop Love Story.\"\n\nJune 25, 2018: Cardi Admits The Pair Were Already Married\n\nCardi B took to Twitter to tell the spontaneous story of her marriage to Offset in Sept. 2017. While there was no ring or dress involved, the Bronx rapper ended her announcement with another message to her haters. \"Well now since you nosey lil f--ks know, at least you can stop saying I had a baby out of wedlock,\" she wrote.\n\nThis why i name my album “Invasion of privacy” cause people will do the most to be nosey about your life .Welp fuck it . pic.twitter.com/U3uHFOT3qK — iamcardib (@iamcardib) June 25, 2018\n\nJuly 10, 2018: Baby Kulture Finally Arrives\n\nAccording to TMZ, as a tribute to Offset, whose real name is Kiari Cephus, the couple decided to name their new daughter Kulture Kiari Cephus.\n\nOct. 9, 2018: Cardi Addresses Cheating Rumors Again\n\n\"When I got married with my dude, we still had a lot of doubts, because our relationship is not like everybody's,\" she told W in an interview. \"He was always traveling, and I was always traveling. We're artists. So I used to see him, like, twice a week, and, you know, he's known for having different women, and I'm known for, like, not taking sh*t from guys. But we really loved each other, and we was scared to lose each other.\"\n\nNov. 2018: Offset Hints at Collab Album With Cardi\n\nIn an interview with The New York Times, Offset hinted that him and wifey Cardi could possibly drop a joint album, Beyonce and Jay-Z style. “I have no distractions,” he told The New York Times. “And me and her? We haven’t even dropped an album yet. That’s a whole other realm.” He also added that marrying Cardi was “the best thing that’s happened” to him. “I’d seen [Cardi’s] potential, her vision, her grind,” he said. “Whatever she does, she’s going to master it. She’s like me...she brings excitement and pressure to me, but I like that…I have a wife and a child -- that changed my whole everything. I was a young hothead, but now I understand the value of life.”\n\nDec. 5, 2018: Cardi Announces Her Split From Offset\n\nCardi B shared a video to Instagram announcing her split from Offset after a long and emotional journey.\n\n\"There you go, peace and love,\" she captioned the Instagram video.\n\nDec. 9, 2018: Offset Gets Emotional About Cardi on Twitter\n\nThe rapper let everyone know how he felt about the breakup with one simple tweet: \"FUCK YALL I MISS CARDI.\"\n\nFUCK YALL I MISS CARDI — OFFSET (@OffsetYRN) December 9, 2018\n\nDec. 15, 2018: Offset Tries to Get Cardi Back -- In a Very Public Way\n\nThe day after his 27th birthday, Offset took to social media to comment on their relationship again, this time with a very candid apology to his ex. \"I only have one birthday wish, and that's to get my wife back,\" he said in a video posted to Instagram. He went on to apologize for \"breaking your heart, breaking our promise, breaking God's promise and being a selfish, messed-up husband\" and made it clear that wasn't ready to give up: \"I wanna be able to spend the rest of my life with you.\"\n\nHis apology turned into an even more public affair when he crashed Cardi's headlining set at Rolling Loud in Los Angeles that night. Offset showed up with a lavish floral arrangement that read \"TAKE ME BACK, CARDI,\" a gesture that didn't go over so well. He and his flowers were quietly removed from the stage.\n\nCARDI B MADE OFFSET LOOK LIKE A FOOL LMAO pic.twitter.com/v4JPYLHVKU — emily nunez (@nunezemilyy) December 16, 2018\n\nDec. 16, 2018: Cardi and Offset Both Address What Happened at Rolling Loud\n\nIn a set of videos shared on Instagram, Cardi thanked fans for their support -- but politely told them to stop making Offset feel bad with negative comments on the Internet. \"Violating my baby father is not going to make me feel any better, because at the end of the day, that's still family,\" she said.\n\n\"I'm not saying that I'm gonna get back together with him,\" Cardi clarified. \"I just don't like that bashing online thing.\"\n\nOffset left his own thoughts on Twitter following his failed public apology to Cardi. \"All of my wrongs have been made public, i figure It’s only right that my apologies are made public too,\" he explained.", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://static.billboard.com/files/media/04-cardi-b-offset-2017-billboard-1548_0-1024x677.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?5483f7d85ab28d1d2c44"], "top_img": "https://static.billboard.com/files/media/04-cardi-b-offset-2017-billboard-1548_0-1024x677.jpg", "keywords": [], "authors": ["Emina Lukarcanin"], "canonical_link": "https://www.billboard.com/articles/columns/hip-hop/8021967/cardi-b-offset-relationship-timeline", "title": "Cardi B and Offset's Relationship: A Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-12-16T17:06:36-05:00", "published_time": "2018-12-05T16:27:01-05:00"}, "description": "Cardi B and Offset's relationship timeline.", "og": {"description": "Cardi B and Offset's relationship timeline.", "image": {"identifier": "https://static.billboard.com/files/media/04-cardi-b-offset-2017-billboard-1548_0-1024x677.jpg", "height": 677, "width": 1024}, "title": "Cardi B & Offset's Relationship Timeline | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/hip-hop/8021967/cardi-b-offset-relationship-timeline", "site_name": "Billboard"}, "title": "Cardi B and Offset's Relationship: A Timeline", "twitter": {"card": "summary_large_image", "description": "Cardi B and Offset's relationship timeline.", "image": "https://static.billboard.com/files/media/04-cardi-b-offset-2017-billboard-1548_0-1024x677.jpg", "title": "Cardi B and Offset's Relationship: A Timeline", "site": "@billboard"}}, "movies": [], "publish_date": 1544045221.0, "source": "https://www.billboard.com", "summary": ""}