{"url": "https://people.com/style/kim-kardashian-send-haters-bae-kkw-fragrance/", "text": "Kim Kardashian West has said she could give “zero f—s” about her critics, and in the spirit of Valentine’s Day, the KKW Beauty mogul has decided to show her haters some love, by way of a fragrance delivery. But anyone on the receiving end of Kardashian West’s fragrance largesse might want to check their present against her color-coded gift list first, because they might be in some petty – sorry, we mean pretty – rarefied company among anyone who’s ever had beef with the star.\n\nKardashian West’s new Kimoji Hearts KKW Fragrances just dropped on KKWFragrance.com today and to celebrate, the star mailed out boxes filled with a large, hollow chocolate heart made by Chef Chris Ford (with the fragrance stashed inside) to special people in her life. Each recipient gets box filled with one of the three new scents — BFF, Bae and Ride or Die — and Kardashian West took special care to decide who gets which.\n\nGet push notifications with news, features and more.\n\n“Alright guys. I am writing the list for my press boxes. I’m going to send them to way more than this, but I decided this Valentine’s Day, everyone deserves a Valentine, so I’m going to send them to my lovers, to my haters, to everyone that I think of because it is Valentine’s Day after all,” the reality star said on Instagram Story as she showed colored Post-It notes with names written on them identifying who gets which fragrance.\n\nImage zoom\n\nEach fragrance comes in a different color packaging – Bae in blue, Ride or Die in purple and BFF in pink – so the assumption is that each color corresponds with the chocolate heart each named celebrity will be receiving via hand-delivery. A scan of the “Bae” recipients might indicate that Kardashian West has designated a certain type of person to receive that fragrance – namely, a long list of people she’s had beef with in the past.\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nAmong them? Taylor Swift, Wendy Williams, Sharon Osbourne, Blac Chyna, Naya Rivera, Piers Morgan, Sarah Michelle Gellar, Janice Dickinson, Chloë Grace Moretz, Pink, Bette Midler and Chelsea Handler. Some of these recipients crossed Kardashian West within the past few days (hi, Wendy Williams) while others go back several years (that would be you, Sarah Michelle Gellar) – further proving the star’s claim that she “remembers everything.” Of course, the most famous is Taylor Swift, who has been trading barbs via song with the star and her husband for years.\n\nRELATED PHOTOS: See Every Eerily Accurate Kim Kardashian Clone (Including Paris Hilton!) for Yeezy Season 6\n\nRELATED VIDEO: Kim Kardashian Says She Gives ‘Zero F—’ In Wake Of Her ‘Bo Derek’ Braids Controversy\n\nAccording to her list, her true Valentines, including her sisters, momager Kris Jenner, Paris Hilton (recently reunited for Yeezy), LaLa Anthony, Chrissy Teigen and Cher, will be getting either the BFF or Ride or Die boxes instead. However, the actual deliveries might have gotten mixed up in the mail – both Hilton and Jenner posted videos of themselves breaking into the “Bae” boxes initially designated for the Naya Riveras of the world.\n\nNot long after posting her haters list, Kardashian West clarified on Twitter that not everyone who got the Bae box fall into that category. “Let me just say all haters didn’t get bae. some of my real bff’s got bae too and my mom!” she said.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Funknown.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1337&h=700&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1337&h=700&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-1-1.jpg", "keywords": [], "authors": ["Kaitlyn Frey"], "canonical_link": "https://people.com/style/kim-kardashian-send-haters-bae-kkw-fragrance/", "title": "Kim Kardashian Sends Her Haters the New 'Bae' KKW Fragrance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Beauty,Beauty News,Fragrances,Kim Kardashian,News,Style News", "news_keywords": "Beauty,Beauty News,Fragrances,Kim Kardashian,News,Style News", "description": "Kim Kardashian's sending her enemies like Taylor Swift and Wendy Williams a Valentine's Day present", "og": {"title": "Kim Kardashian's Sending All Her Haters — Including Taylor Swift — Her New 'Bae' KKW Fragrance", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/kim-kardashian-send-haters-bae-kkw-fragrance/", "description": "Kim Kardashian West has said she could give “zero f—s” about her critics, and in the spirit of Valentine’s Day, the KKW Beauty mogul has&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1337&h=700&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-1-1.jpg", "width": 1337, "height": 700}}, "pinterest": {"url": "https://people.com/style/kim-kardashian-send-haters-bae-kkw-fragrance/", "description": "Kim Kardashian's sending her enemies like Taylor Swift and Wendy Williams a Valentine's Day present", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-1-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/kim-kardashian-send-haters-bae-kkw-fragrance/", "title": "Kim Kardashian's Sending All Her Haters — Including Taylor Swift — Her New 'Bae' KKW Fragrance", "description": "Kim Kardashian's sending her enemies like Taylor Swift and Wendy Williams a Valentine's Day present", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1337&h=700&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-1-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}