{"url": "snobette.com/2017/07/rihanna-hassan-jameel-relationship-timeline/", "text": "While Rihanna‘s public make out session with new beau Hassan Jameel in late June 2017 marked an official coming out party for the couple, in reality the handsome couple had been showing up randomly on social media months before their pool party.\n\nThough Navy members pushed back on social media posts claiming news of a new Rihanna love interest, at the same time they were perplexed by Rihanna’s schedule or lack thereof. Once easy to track, from November 2016 onward, suddenly she was disappearing for days at a time and showing up in odd places by herself that didn’t follow prior patterns. When she was spotted, it was often in an airport coming/going from London, Paris and in one case Tokyo.\n\nAs it relates to where she’s been spotted, keep in mind Hassan was born in Saudia Arabia, and he graduated from Sophia University in Tokyo in 2001, plus has an MBA from London Business School. As well, he continues to have business dealings in Tokyo related to both the university and Abdul Latif Jameel aka ALJ, a family business he helps run that owns the rights to the distribution of Toyota vehicles in Saudi Arabia. And it’s a guess, but it appears he has a place in London as he’s been spotted shopping in grocery stores in Mayfair, an affluent area in the West End of London.\n\nBased on everything we could put together, it looks like things began to bubble for Rihanna and Jameel sometime in October 2016 though when they met for the very first time is anyone’s guess. The romance really began to kick into high gear in November 2016 and the deal was sealed when they rang in 2017 together together, followed by a two-week trip to Maldives.\n\nWhat follows is an obsessive time line of key events in their romance. (And shout out to Lipstick Alley for the assist. There are a billion gossip sites, but only one Lipstick Alley.)\n\nJuly 10, 2016: Naomi Campbell and Jameel attend a Stevie Wonder concert in London. Whether their relationship was ever deeper than friendship is not known. This was their first public outing and seemingly also their last.\n\nAugust 28, 2016: Drake presents Rihanna with the Michael Jackson Video Vanguard Award at the MTV’s Video Music Awards. Whether she curved his attempt to kiss her is hotly debated for days to follow.\n\nSeptember 11, 2016: Rihanna is spotted with fans backstage at a Drake concert in Los Angeles looking less than perky. This appears to be the beginning of the end of her short-lived relationship with Drake. This will mark the final time she attends a Drake concert.\n\nSeptember 29, 2016: Rihanna presents her Fenty by Rihanna collection in Paris. Drake is no where to be found, and while Campbell isn’t either, she had model-related work obligations that may have made attending impossible.\n\noct 2 2016. I wonder if this is when rih n hassan started dating (that’s him getting the elevator) pic.twitter.com/u5AAH2wkfR — (@rihalitea) December 19, 2018\n\n\n\nOctober 2, 2016: Rihanna and Campbell are spotted in Paris arm in arm, seemingly happy as larks. Watch carefully at the end of the video below and listen to Campbell. There is speculation that the tall man opening the door is Jameel, who Campbell happily greets as “Hassi.” This appears to be the final time Rihanna and Campbell are captured together on camera.\n\n# A post shared by badgalriri (@badgalriri) on Oct 8, 2016 at 7:29pm PDT\n\nOctober 8, 2016: Rihanna posts a loud and clear declaration about exes on Instagram. Clearly she is closing the door on her relationship with Drake, perhaps allowing space for another to open.\n\n#Nobu at #RoyalMonceau with @badgalriri #Matsuhisa A post shared by Alizée Walheim (@alizeewalheim) on Oct 24, 2016 at 12:44pm PDT\n\nOctober 24, 2016: Instagram account @alizee posts a picture of herself on a grand staircase in Paris luxury hotel Ruffles, where she claims she was having dinner with Rihanna and her “new man,” a reference she will eventually edit out.\n\nOctober 28, 2016: Rihanna is spotted arriving at JFK Airport in New York, all smiles. In a possible case of speaking reality into existence, she’s carrying a Prada tote featuring a Chris Chemin’s illustration of two lovers kissing that reads “Impossible True Love.”\n\nNovember 2016: A photograph emerges on the Instagram account of @e.finesse1 that was described by the Navy as a Thanksgiving Day event in London. Rihanna is shot wearing a chic floral Balenciaga top hugged up with a young boy, who some say is a relative of Jameel’s.\n\nThe timing of this photo is highly questionable simply because Thanksgiving in the United States was celebrated on the 24th and Rihanna was spotted on an Ocean 11 set in Brooklyn, on November 22nd and 23rd. As well, Brits as a practice don’t celebrate Thanksgiving.\n\nNovember 24-25, 2016: Another reason the timing of the above photo is questionable is that Jameel is listed as attending a Sophia University council meeting in Tokyo, Japan on the 24th and 25th.\n\nNovember 25, 2016: If ever there was any question Rihanna and Drake are over and out, it becomes crystal clear in Dubai, where both had concerts on the same weekend. While booked at different locations, Dubai isn’t that big, and never once are the two stars spotted together.\n\nNovember 30, 2016: Rihanna spends time in her homeland to celebrate the 50th anniversary of Barbados’ independence. Prince Harry provides an assist.\n\nDecember 24, 3016: Rihanna once again heads home to Barbados to spend Christmas with her family.\n\nROBYN FENTY LOOKING WAY BEYOND STUNNING Lastnight #NYE jamming to my ol time fave classic song by Kevin little walking into 2017 like ….. A post shared by Robyn follows• (@sade_s2_riri) on Jan 1, 2017 at 4:42pm PST\n\nDecember 31, 2016: Rihanna spends a very low-key, paparazzi-free New Year’s Eve in London, but is spotted in a short video clip providing evidence she spent the evening with Jameel.\n\nRobz lastnight chillin and smokin #toyroom LONDON #NYE 2017 GORGEOUS A post shared by Robyn follows• (@sade_s2_riri) on Jan 1, 2017 at 4:50am PST\n\nDecember 31, 2017: New phone who dis?\n\nJanuary 1, 2017: Twitter user @nicki_lima14 9, who claims her father works for Jameel, starts spilling endless tea about the burgeoning romance, including a tweet that reads, “Ya’ll motherfuckers don’t talk about Rihanna and Drake, she is happy with a new man in London.”\n\nJanuary 2, 2017: A GLOWING Rihanna is shot arriving at New York’s JFK airport looking like she’s floating through the place. Again she carries the “true love” Prada tote.\n\nFebruary 20, 2017: Happy Birthday, Rihanna! Where are you??\n\nFebruary 22, 2017: @nicki_lima14 continues to blab, writing, “He is my dad[‘s] boss, [not] my friend, he is super cool and will do anything for Rihanna. Plus he is the one who [took] her to [Maldives].” Excuse me, what??\n\nFebruary 27, 2017: No one seems to know how long Rihanna was chilling in Maldives, but Vogue notes her last public appearance was at the Grammy Awards on February 12th. The magazine marks her return to New York on the 27th by writing about her new hair color and describes her time away as a two-week vacation. Nice!\n\nFebruary 2017: Sometime during the month, Rihanna and Naomi unfollow each other on Instagram. While some argue Naomi was upset to discover Rihanna was dating Jameel, others have said Campbell was unfriended for her shabby treatment of Rihanna’s model fave and friend, Slick Woods, who tweeted (and quickly deleted) about being treated poorly by an iconic black model.\n\nThe latter argument carries some weight if only because it seems unlikely that it took until February for Campbell to discover Rihanna and Hassan were dating. There’s another theory floating around that Rihanna found out Campbell had been saying ugly things about Rihanna to Jameel in an attempt to keep them apart.\n\nIt’s possible all or parts of these things are true and the friendship finally reached a breaking point or perhaps (we hope!) the two are just on a break from each other. After all, sometimes friendships are put to the side in the beginnings of a serious love affair.\n\nOn that note, while there may be such a thing as a girl code whereby friends don’t date friend’s exes, the rule is utterly null and void if Campbell’s relationship was minor and Rihanna’s is a full blown meaningful romance. The power of destined love is of a far higher order than any friend code. ‘Nuff said!\n\nMarch 6, 2017: Rihanna presents her Fenty by Puma line in Paris and Naomi isn’t in attendance. Slick Woods opens the show.\n\nMarch 7, 2017: On “Watch What Happens Live,” a caller asks Campbell why she and Rihanna are no longer following each other on Instagram. Dripping with sarcasm, Campbell replies, “Everything’s fine.”\n\nApril 1, 2017: Rihanna is shot by a fan in Tokyo. Nobody knows why she’s there though in one very blurry picture she appeared to be accompanied by a tall, attractive stranger sporting Jameel-esque stubble.\n\nMay 5, 2017: Rihanna and Campbell attend the Met Ball and when they spot each other on the red carpet the temperature immediately drops to frosty with a side of shade.\n\nRihanna today with her new boyfriend Hassan in Spain ☀️ pic.twitter.com/oiVVllQbWe — Rihanna Diva (@RihannaDiva) June 28, 2017\n\nJune 28, 2017: Location: A pool in Ibiza, Spain; the love story officially goes worldwide. While some protested the invasion of their privacy, it’s possibly Rihanna and Jameel were aware of the looming paparazzi and decided it was time to let their relationship go public. They were shot in an outdoor pool, after all!\n\nAs well, it’s rumored that London and Paris photographers knew about the relationship prior and had been protecting her wish to keep things on the low. Adding to the theory, after they were spotted in the pool, they were photographed out and about in Ibiza the following day.\n\nJune 30, 2017: Rihanna’s father, Ronald Fenty, confirms his status as a typical Caribbean parent when he comments to The Sun he’s not yet sold on Jameel. “She told me she had a new boyfriend about a month ago,” he stated, and added, “He’s going to have to buckle up, she’s a hard-working girl, she’s very independent and ambitious. Nobody can tell her what to do. She doesn’t want to be lifted up, she wants to get up there herself. Hopefully he’s a little bit more liberal and has spent more time in Europe and South America.” Thanks, Dad, love ya!\n\nWhere does the romance go from here? Well, Rihanna has always liked to keep things semi-private and probably will continue to do so, and since both have access to private planes, it’s a good bet she will continue to dip in and out of the public eye. (Rumor has it that Jameel has already used private planes to visit Rihanna in Los Angeles and also flew out a Teddy Bear gift on a private plane.)\n\nThat said, both Rihanna and Jameel share an interest in using their power for good so keep an eye on Rihanna’s charity Diamond Ball on September 14, 2017 in New York. If ever there was an event for her to officially introduce him to the world, we’d bet money on that being it.", "images": ["https://snobette.com/wp-content/uploads/2017/07/rihanna-tokyo.jpg", "https://snobette.com/wp-content/plugins/instagram-feed/img/placeholder.png", "https://snobette.com/wp-content/uploads/2017/07/rihanna-nicki_lima14-B.jpg", "https://snobette.com/wp-content/uploads/2017/11/logo.jpg", "https://snobette.com/wp-content/uploads/2017/07/rihanna-jfk-jan-2-2017.jpg", "https://snobette.com/wp-content/uploads/2017/07/Rihanna_JFK_NewYork_013.jpg", "https://snobette.com/wp-content/uploads/2017/07/Untitled-collage-1024x640.jpg", "http://snobette.com/wp-content/uploads/2017/11/logo.jpg", "https://www.facebook.com/tr?id=472057803574483&ev=PageView&noscript=1", "https://snobette.com/wp-content/uploads/2017/07/rihanna-sad-in-california-at-drake-concert.jpg", "https://snobette.com/wp-content/uploads/2017/07/rihanna-nicki_lima14.jpg", "https://snobette.com/wp-content/uploads/2017/07/Untitled-collage.jpg"], "top_img": "https://snobette.com/wp-content/uploads/2017/07/Untitled-collage.jpg", "keywords": [], "authors": [], "canonical_link": "https://snobette.com/2017/07/rihanna-hassan-jameel-relationship-timeline/", "title": "Rihanna And Hassan Jameel Romance Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Rihanna and Saudi businessman Hassan Jameel went public with their relationship in June 2017 but the timeline for their relationship began almost a year before.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Rihanna And Hassan Jameel Romance Timeline", "description": "Rihanna and Saudi businessman Hassan Jameel went public with their relationship in June 2017 but the timeline for their relationship began almost a year before.", "url": "https://snobette.com/2017/07/rihanna-hassan-jameel-relationship-timeline/", "site_name": "SNOBETTE", "updated_time": "2020-01-18T02:04:20+00:00", "image": {"identifier": "https://snobette.com/wp-content/uploads/2017/07/Untitled-collage.jpg", "secure_url": "https://snobette.com/wp-content/uploads/2017/07/Untitled-collage.jpg", "width": 1920, "height": 1200}}, "article": {"publisher": "https://www.facebook.com/TheSnobette", "tag": "Naomi Campbell", "section": "Rihanna", "published_time": "2017-07-19T18:42:42+00:00", "modified_time": "2020-01-18T02:04:20+00:00"}, "msapplication-TileImage": "https://snobette.com/wp-content/uploads/2017/11/favicon-1.jpg"}, "movies": ["https://www.youtube.com/embed/_rj7_84pi9E"], "publish_date": 1500489762.0, "source": "http://snobette.com", "summary": ""}