{"url": "https://www.businessinsider.com/jessica-chastain-husband-gian-luca-has-premium-prosecco-brand-fiol-2018-6", "text": "We met with Gian Luca Passi de Preposulo, the fashion executive and husband of Hollywood actress Jessica Chastain.\n\nHe and two childhood friends created their own prosecco brand, Fiol, in 2010.\n\nPassi de Preposulo says that the industry's obsession with keeping prices low has led to a compromise in quality in some cases.\n\nThe trio are on a mission to position Fiol as a recognisable, premium prosecco brand.\n\n\n\nGian Luca Passi de Preposulo popped up on the media radar last June when he married Hollywood actress Jessica Chastain in the grounds of his family estate in Italy.\n\nThe wedding was attended by a number of celebrities, including Anne Hathaway and Emily Blunt, as well as some of the fashion elite — and it sparked a flurry of news reports titled asking \"Who is Jessica Chastain's husband?\"\n\nGetty/Frazer Harrison\n\nPassi de Preposulo is PR director of events and entertainment at Italian fashion house Moncler, and previously worked for Armani. He splits his time between Milan and New York.\n\nHowever, when Business Insider met him at Mark's Club in London, it was to discuss his premium prosecco brand Fiol, a partnership between him and his childhood friends and co-founders, brothers Pietro and Giovanni Ciani Bassetti.\n\nPassi de Preposulo told Business Insider that he tasted his first glass of fizz aged nine or 10 at his family home,\n\nVilla Tiepolo Passi, a 17th-century estate in Treviso which is less than an hour's drive from Venice.\n\nThe Passi de Preposulos are a family of counts and countesses, although Italy no longer recognises the aristocracy. Meanwhile the Ciani Bassetti family have been making wine for over 400 years.\n\nGiovanni Ciani Bassetti (left) is pictured with Gian Luca below.\n\n\"We grew up surrounded by prosecco,\" Passi de Preposulo said. \"The harvest was a very specific time of year for us.\n\n\"Every year we would do the harvest with our parents and grandparents and at the end there was a big celebratory lunch and dinner with all of our family and friends — that was where I had my first prosecco tasting.\"\n\nAt 19 he moved to Milan and began working in the fashion industry, while Pietro and Giovanni went into banking.\n\n\"Our base was Treviso (under an hour's drive from Venice) where our family are still nowadays, so we'd go back there every summer, Easter, and Christmas holidays. We always loved being back to our roots.\"\n\nAlmost a decade later, the trio decided to go into business together. \"We said, 'Why don't we do something together as friends, leverage our experience in business?'\"\n\nThis coincided with the beginning of the prosecco boom, he said, thanks in large part to the financial crisis of 2008.\n\n\"Before then people just considered prosecco a cheap version of Champagne,\" Passi de Preposulo said. \"But following the crisis those seeking an affordable sparkling wine found prosecco and this incredible wave of success started that just didn’t stop and is still growing now.\"\n\n'The war of the poor'\n\nGetty/Pascal Le Segretain\n\nWhile prosecco is undoubtedly a hugely popular category, Passi de Preposulo says people lack knowledge on the brands they're ordering and purchasing, and ultimately make decisions based purely on price.\n\n\"When people ask in a bar 'Can I have a glass of prosecco,' the bartenders don't know what they're giving you, and you don't know what you’re drinking.'\n\n\"It's pretty fascinating,\" he went on. \"Because when you order anything else you know exactly what brand gin, whisky, beer, coffee, juice, even water — you know what you like.\"\n\nThe industry, he says, has been so solely focused on keeping the price point low, which has generated what he calls \"the war of the poor,\" causing some producers to also compromise on quality.\n\nIt's certainly true that supermarkets, in the UK at least, have gone big on Italian bubbles — and it's not unusual to see a bottle on offer for £7 or £8, especially in the summer months.\n\nThe growth of the sparkling wine category in Britain, however, slowed in 2017, according to UHY Hacker Young, after years of double-digit growth. It led the accountancy group to suggest we could be approaching \"peak prosecco.\"\n\n\"Prosecco may have reached a 'Burberry moment' — where the brand suffers from overexposure and loses its luxury/aspirational image through overstocking at supermarkets and over appearance on novelty t-shirts etc,\" the firm wrote.\n\nMaking Fiol the Belvedere of the prosecco world\n\nPassi de Preposulo told Business Insider he believes that the industry has wasted an opportunity — one that Fiol wants to seize — to create a premium, recognisable brand. He sees an opportunity to position Fiol as the Belvedere or Grey Goose of the prosecco world.\n\n\"One thing I learned from the fashion industry is that if you start low you can only go lower, you have to position the brand high to begin with,\" he said.\n\nOn the other hand, he added that when it comes to prosecco there is a certain scale to take into consideration. \"If you're selling it for £25, you'd be out of the market, people would just spend £5 more and buy Champagne.\"\n\nFiol is now sold in the US, Canada, and in Europe, and currently retails in the UK for £13.95 a bottle at Great Western Wines.\n\nPassi de Preposulo says the trio wanted to created a blend that combines the traditional taste of the wine they grew up drinking, but also to \"dispel the myth of prosecco being acidic with lots of bubbles.\"\n\nThe extra dry prosecco is light in colour and has a thin and constant bubble. It has won a number of awards, most recently gold in the Prosecco Masters in 2017 and 2018.\n\nIt is a prosecco DOC (Denominazione di Origine Controllata) classification which means the quality is assured to a certain standard, and that it comes from specific territories in north-east Italy.\n\nA bottle of prosecco, which is primarily made with \"glera\" grapes, shouldn't be kept beyond two years, according to Passi de Preposulo.\n\nThe beauty of this is that — unlike with a \"grand cru\" Champagne or equivalent — \"when you pop a bottle you don't have to worry about whether this is this the perfect occasion, 'Should I save it?\" according to Passi de Preposulo. \"You just open another and another.\"", "images": ["https://i.insider.com/5b2b836b1ae66220008b5ff2?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b2b6b881ae66256008b5113?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b2b810d1ae6621f008b4685?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b2b73fa1ae6623a008b4638?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "https://i.insider.com/5b325d641ae66224008b5391?width=24&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5b2b747b1ae6624d008b54ae?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b325d641ae66224008b5391?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b2b82951ae66225008b54af?width=1200&format=jpeg", "https://www.businessinsider.com/jessica-chastain-husband-gian-luca-has-premium-prosecco-brand-fiol-2018-6?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5b2b82951ae66225008b54af?width=1200&format=jpeg", "keywords": [], "authors": ["Rosie Fitzmaurice"], "canonical_link": "https://www.businessinsider.com/jessica-chastain-husband-gian-luca-has-premium-prosecco-brand-fiol-2018-6", "title": "Jessica Chastain's fashion executive husband has his own brand of fizz — and he wants to make it the Belvedere of the prosecco world", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Jessica Chastain's fashion executive husband has his own brand of fizz — and he wants to make it the Belvedere of the prosecco world", "date": "2018-06-28", "news_keywords": "Jessica Chastain, Prosecco, Alcohol, Gian Luca Passi de Preposulo, Rosie Fitzmaurice", "description": "Business Insider met Gian Luca Passi de Preposulo at Mark's Club in London to discuss his prosecco brand Fiol, a partnership between him and his childhood friends and co-founders, brothers Pietro and Giovanni Ciani Bassetti.", "author": "Rosie Fitzmaurice", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Life", "og": {"title": "Jessica Chastain's fashion executive husband has his own brand of fizz — and he wants to make it the Belvedere of the prosecco world", "description": "Business Insider met Gian Luca Passi de Preposulo at Mark's Club in London to discuss his prosecco brand Fiol, a partnership between him and his childhood friends and co-founders, brothers Pietro and Giovanni Ciani Bassetti.", "type": "article", "url": "https://www.businessinsider.com/jessica-chastain-husband-gian-luca-has-premium-prosecco-brand-fiol-2018-6", "image": "https://i.insider.com/5b2b82951ae66225008b54af?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Jessica Chastain's fashion executive husband has his own brand of fizz — and he wants to make it the Belvedere of the prosecco world", "sailthru.date": "2018-06-28", "sailthru.tags": "Jessica Chastain, Prosecco, Alcohol, Gian Luca Passi de Preposulo, Rosie Fitzmaurice", "sailthru.description": "Business Insider met Gian Luca Passi de Preposulo at Mark's Club in London to discuss his prosecco brand Fiol, a partnership between him and his childhood friends and co-founders, brothers Pietro and Giovanni Ciani Bassetti.", "sailthru.author": "Rosie Fitzmaurice", "sailthru.verticals": "thelife, thewire, yourmoney", "sailthru.image.full": "https://i.insider.com/5b2b82751ae6623b008b4642?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5b2b82751ae6623b008b4642?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@LifeInsider"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "variant", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "control", "commerce-product-card-button-font": "variant1", "commerce-button": "control", "post-breadcrumbs": "control", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "variant"}, "viking-id": "5b2b65be1ae6621a008b5439", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1530115200.0, "source": "https://www.businessinsider.com", "summary": ""}