{"url": "https://people.com/celebrity/amber-rose-defends-blac-chyna-rob-kardashian-relationship/", "text": "Three weeks after Rob Kardashian‘s explosive social media rampage against his ex-fiancée Blac Chyna, Amber Rose has weighed in on the controversy.\n\nOn Tuesday’s episode of Complex’s Everyday Struggle, Rose, 33, who is best friends with Chyna, 29, addressed the roller coaster relationship between the two stars — and refuted allegations that Chyna only dated Kardashian, 30, for money and fame.\n\nGet push notifications with news, features and more.\n\n“I taught Chyna a lot about feminism, and now she’s living it — she’s living out all the bulls—, basically,” said Rose, noting that revenge porn is “very much a thing.”\n\nIn his July 5 tirade, Kardashian took to Instagram and Twitter to repeatedly share graphic and expletive-ridden content about his ex — including three naked photos — while accusing her of drug use, alcohol abuse and infidelity. Chyna and her legal team accused him of violating California’s revenge porn laws, and a judge has since granted her a set of restraining orders against Kardashian. The two are scheduled to return to court on Aug. 8.\n\n“People look at the media and just be like: ‘She’s like this’ — but Chyna is an amazing mom, she’s an amazing person, and she’s extremely loving,” said Rose. “I was around when her and Rob first met. I’ll tell you firsthand that they very much loved each other. It was very real.”\n\nGiven Chyna’s complicated history with Kardashian’s famous family — she shares a 4-year-old son with Kardashian’s sister Kylie Jenner‘s former boyfriend Tyga — news of her relationship with Kardashian, which began in January 2016, launched an onslaught of speculation about the nature of the romance.\n\nThe two welcomed daughter Dream Renée last November, and in his recent Twitter spree, Kardashian accused Chyna of having a baby with him “out of spite.” But according to Rose, both Chyna and Kardashian genuinely wanted to have a child together.\n\n“They both wanted to have Dream,” said Rose. “It wasn’t a mistake, it wasn’t an ‘entrapment,’ it wasn’t anything like that. I remember when her and Rob met, how they fell in love and how happy they were. They’re just not happy anymore. That’s life. It just happens.”\n\n“It just goes back to people being uncomfortable with women making their own decisions in life,” she continued. “Chyna was with Rob, she had a baby with him, they both wanted Dream, [who] is a beautiful baby. S— didn’t work out and she opted to leave. She did not want to be in that situation anymore, and that made people uncomfortable.”\n\n“People look at Chyna like: ‘She got Rob for everything, she’s taking his money,’ ” she added. “She’s not that type of person, and neither am I. We’re not out trying to finesse motherf—ers. We have our own money. People fail to realize we got money, we got cars … we’re straight.”\n\nOf Kardashian’s social media attack, Rose said it was “some sucker ass s—.”\n\n“You don’t do that,” she said. “I understand [he was hurt]. But how about she’s hurt as well?”\n\n“At the end of the day, I can speak for my friend Chyna — I know what they really had, I was there,” she continued. “If you’re not happy in a relationship, you’re going to be out. Rob should have been a mature adult and had a conversation with Chyna and been like, ‘You know what Chyna, I’m very frustrated, I feel like you used me.’ And she could have then said, ‘You know what? I didn’t, I actually cared about you, but I’m not trying to be in this situation with you anymore.’ ”\n\n“He didn’t have to go on the internet and be petty, and now he’s dealing with revenge porn,” she added. “You can’t do s— like that. It’s time to grow up and handle your business properly. You have a kid that’s going to forever see that s—.”\n\nFROM PEN: Blac Chyna Reveals The Shocking Moment Rob Kardashian Uploaded Her Most Intimate Photos Online\n\nIn an exclusive sit-down with PEOPLE earlier this month, Chyna slammed critics questioning the sincerity of her relationship with Kardashian, speculating that she was just out for his money.\n\n“I make my own money — I’ve been making my own money for a very, very long time,” she said. “My first job was at McDonald’s when I was 15. Years later, right after I had King, I wanted to do something that expressed myself, so I started Lashed Cosmetics. The lipsticks, the full skincare line, the beauty bar and 88Fin clothing trickled down from that.”\n\n“Nobody supports me at all,” she added. “If anything, I’ve gotten other people more money … I’ll leave it at that.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Famber-rose2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Famber-rose2.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/celebrity/amber-rose-defends-blac-chyna-rob-kardashian-relationship/", "title": "Amber Rose Defends Blac Chyna & Rob Kardashian's Relationship Despite Twitter Spree, Says Dream 'Wasn't a Mistake'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Amber Rose,Babies,Blac Chyna,Dream Kardashian,News,Rob Kardashian,TV", "news_keywords": "Amber Rose,Babies,Blac Chyna,Dream Kardashian,News,Rob Kardashian,TV", "description": "According to Blac Chyna's best friend Amber Rose, \"I remember when her and Rob met, how they fell in love and how happy they were — they're just not happy anymore\"", "og": {"title": "Amber Rose Defends Blac Chyna & Rob Kardashian's Relationship Despite Twitter Spree, Says Dream 'Wasn't a Mistake'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/amber-rose-defends-blac-chyna-rob-kardashian-relationship/", "description": "Three weeks after Rob Kardashian‘s&nbsp;explosive social media rampage against his ex-fiancée&nbsp;Blac Chyna, Amber Rose has weighed in on the controversy. On Tuesday’s episode of Complex’s&nbsp;Everyday&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Famber-rose2.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/celebrity/amber-rose-defends-blac-chyna-rob-kardashian-relationship/", "description": "According to Blac Chyna's best friend Amber Rose, \"I remember when her and Rob met, how they fell in love and how happy they were — they're just not happy anymore\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Famber-rose2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/amber-rose-defends-blac-chyna-rob-kardashian-relationship/", "title": "Amber Rose Defends Blac Chyna & Rob Kardashian's Relationship Despite Twitter Spree, Says Dream 'Wasn't a Mistake'", "description": "According to Blac Chyna's best friend Amber Rose, \"I remember when her and Rob met, how they fell in love and how happy they were — they're just not happy anymore\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Famber-rose2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/se7VOCYxuS0"], "publish_date": null, "source": "https://people.com", "summary": ""}