{"url": "https://variety.com/2018/tv/news/hoda-kotb-salary-matt-lauer-today-nbc-1202652287/", "text": "In the world of TV news, there’s an inordinate amount of time and effort spent scrutinizing what the nation’s most popular anchors make. The figures can be eyebrow raising: Katie Couric was reportedly making $15 million a year when anchoring “CBS Evening News” and Matt Lauer, depending on which unverified report one chooses to believe as if it were passed along in a personal memo from NBC News Chairman Andy Lack, could have been pulling down anywhere from $20 million to $25 million during his last year hosting NBC’s “Today.”\n\nLittle wonder, then, that a report in The New York Post’s Page Six all about newsroom salaries has stirred up online opprobrium. In this case, people are shocked by what NBCUniversal may or may not be paying Hoda Kotb, the newly-christened co-anchor of “Today” (and, coincidentally, Lauer’s replacement). It’s not how much the network is paying Kotb that has triggered thousands of impulses to let loose on Twitter, but rather a question as to whether NBC is paying Kotb enough.\n\nAccording to Page Six, NBC is paying Kotb the meager sum of just $7 million a year — a number, the outlet says, that could be equivalent to what her co-anchor Savannah Guthrie might earn, but far less than Lauer’s mammoth paycheck. An NBC spokesperson said the network doesn’t comment on compensation and a spokesperson for CAA, the agency that represents Kotb, said executives there declined to comment. “I’m not making Matt Lauer money. Not even close,” Kotb told People according to a story posted Wednesday.\n\nWhile the optics of the financial arrangement have spurred a very worthwhile and necessary discussion about compensation parity among men and women in the media business, the simple fact is that Kotb is being treated much like almost any other anchor or host who takes over a coveted and long-held post on a venerable TV program. TV networks often see opportunity in such transitions, because it typically means a cutback in salary outlay. It’s a fair gamble, for example, that Stephen Colbert wasn’t given David Letterman’s salary upon taking over CBS’ “Late Show,” or that Trevor Noah was not immediately handed Jon Stewart’s financial arrangement upon being given the reins to Comedy Central’s “Daily Show.” Lauer, no doubt, wasn’t immediately festooned with Bryant Gumbel’s paycheck when he graduated to a “Today” co-anchor slot in 1997.\n\nFew TV anchors start off making massive salaries, and there’s been a growing consensus in the industry in recent weeks that fewer are going to snare those figures in the future. The economics of the business no longer support it. Viewers are getting their news from dozens of new outlets, and many broadcast-news mainstays have experienced viewer erosion of the last several years. In the U.S., about 93% of adults get news via mobile or desktop, according to data from Pew Research Center, while the overall audiences for broadcast network evening newscasts and morning programs each dropped 1% in 2016. The fact that “Today” has started to trump ABC rival “Good Morning America” in the ratings since Lauer’s departure and that “CBS This Morning” has not seen massive viewer defections since Charlie Rose was ousted lend credence to the notion that TV-news junkies are increasingly tuning in first for the news and second for the familiar person delivering it.\n\nTo be sure, there have been and always will be exceptions. Megyn Kelly is believed to have negotiated a salary of at least $17 million from NBC News, which snared her when her contract at Fox News Channel ended last year. Fox News is known to pay its top stars salaries well above some industry standards, however, and NBC had to cough up attractive terms at a time when Kelly was holding exploratory talks with several news organizations.\n\nSalaries grow the longer a person stays in a particular position. In the recent past, Lauer signed new deals every two or three years, and it’s easy to see how compensation might grow substantially at that rate, particularly when he held the same role for at least two decades.\n\nBut it’s the rare case when someone gets the same salary as their predecessor. Anchors and hosts need to prove staying power and show they are a ratings draw. Over time, that makes them more valuable and more difficult to let go. No doubt, if “Today” continues to outdraw “GMA” as it has in recent weeks — whether it can remains an unknown — or if the broadcast gains new viewers or widens its overall audience, Kotb will no doubt see her compensation rise with each contract renewal.\n\nThe question people should be asking isn’t whether Hoda Kotb is making Matt Lauer’s former salary. She’s not. But is she making a fair wage given that she’s the co-host of two of NBC’s most valuable hours while continuing to co-host a third with Kathie Lee Gifford? Only her agents and top NBCUniversal executives know for sure.", "images": ["https://pmcvariety.files.wordpress.com/2017/04/hoda-kotb.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fhoda-kotb-salary-matt-lauer-today-nbc-1202652287%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202652287&comment_count=43"], "top_img": "https://pmcvariety.files.wordpress.com/2017/04/hoda-kotb.jpg?w=1000", "keywords": [], "authors": ["Brian Steinberg"], "canonical_link": "https://variety.com/2018/tv/news/hoda-kotb-salary-matt-lauer-today-nbc-1202652287/", "title": "Why Hoda Kotb Isn’t Making Matt Lauer’s Salary (at Least Not Yet)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "It's easy to compare Hoda Kotb's salary to predecessor Matt Lauer's and cite gender inequity. But TV thrives on paying new hosts less.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202652287, "author": "Brian Steinberg", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-03T11:59:40"}, "pmc-tag": "Hoda Kotb,Megyn Kelly,Nbc News,Savannah Guthrie,The Today Show", "title": "Why Hoda Kotb Isn’t Making Matt Lauer’s Salary (at Least Not Yet)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Why Hoda Kotb Isn’t Making Matt Lauer’s Salary (at Least Not Yet)", "url": "https://variety.com/2018/tv/news/hoda-kotb-salary-matt-lauer-today-nbc-1202652287/", "description": "In the world of TV news, there’s an inordinate amount of time and effort spent scrutinizing what the nation’s most popular anchors make. The figures can be eyebrow raising: Katie Couric…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/hoda-kotb.jpg?w=1000", "width": 1000, "height": 562, "alt": "Hoda Kotb"}, "locale": "en_US"}, "article": {"published_time": "2018-01-03T19:59:40+00:00", "modified_time": "2018-01-04T00:26:54+00:00"}, "twitter": {"creator": "@https://twitter.com/bristei", "site": "@variety", "text": {"title": "Why Hoda Kotb Isn’t Making Matt Lauer’s Salary (at Least Not Yet)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/hoda-kotb.jpg?w=1000", "alt": "Hoda Kotb"}, "card": "summary_large_image", "title": "Why Hoda Kotb Isn’t Making Matt Lauer’s Salary (at Least Not Yet)", "description": "It's easy to compare Hoda Kotb's salary to predecessor Matt Lauer's and cite gender inequity. But TV thrives on paying new hosts less."}, "author": "Brian Steinberg", "content_type": "Article", "post_id": 1202652287, "title": "Why Hoda Kotb Isn't Making Matt Lauer's Salary (at Least Not Yet)", "published_at": "2018-01-03 11:59:40", "image": "https://pmcvariety.files.wordpress.com/2017/04/hoda-kotb.jpg?w=1000", "comment_count": 43, "tags": "The Today Show", "topics": "News", "appeared_in_print": "No", "body": "In the world of TV news, there's an inordinate amount of time and effort spent scrutinizing what the nation's most popular anchors make. The figures can be eyebrow raising: Katie Couric was reportedly making $15 million a year when anchoring \"CBS Evening News\" and Matt Lauer, depending on which unverified report one chooses to believe as if it were passed along in a personal memo from NBC News Chairman Andy Lack, could have been pulling down anywhere from $20 million to $25 million during his last year hosting NBC's \"Today.\"\r\n\r\nLittle wonder, then, that a report in The New York Post's Page Six all about newsroom salaries has stirred up online opprobrium. In this case, people are shocked by what NBCUniversal may or may not be paying Hoda Kotb, the newly-christened co-anchor of \"Today\" (and, coincidentally, Lauer's replacement). It's not how much the network is paying Kotb that has triggered thousands of impulses to let loose on Twitter, but rather a question as to whether NBC is paying Kotb enough.\r\n\r\nAccording to Page Six, NBC is paying Kotb the meager sum of just $7 million a year -- a number, the outlet says, that could be equivalent to what her co-anchor Savannah Guthrie might earn, but far less than Lauer's mammoth paycheck. An NBC spokesperson said the network doesn't comment on compensation and a spokesperson for CAA, the agency that represents Kotb, said executives there declined to comment. \"I’m not making Matt Lauer money. Not even close,\" Kotb told People according to a story posted Wednesday.\r\n\r\nWhile the optics of the financial arrangement have spurred a very worthwhile and necessary discussion about compensation parity among men and women in the media business, the simple fact is that Kotb is being treated much like almost any other anchor or host who takes over a coveted and long-held post on a venerable TV program. TV networks often see opportunity in such transitions, because it typically means a cutback in salary outlay. It's a fair gamble, for example, that Stephen Colbert wasn't given David Letterman's salary upon taking over CBS' \"Late Show,\" or that Trevor Noah was not immediately handed Jon Stewart's financial arrangement upon being given the reins to Comedy Central's \"Daily Show.\" Lauer, no doubt, wasn't immediately festooned with Bryant Gumbel's paycheck when he graduated to a \"Today\" co-anchor slot in 1997.\r\n\r\nFew TV anchors start off making massive salaries, and there's been a growing consensus in the industry in recent weeks that fewer are going to snare those figures in the future. The economics of the business no longer support it. Viewers are getting their news from dozens of new outlets, and many broadcast-news mainstays have experienced viewer erosion of the last several years. In the U.S., about 93% of adults get news via mobile or desktop, according to data from Pew Research Center, while the overall audiences for broadcast network evening newscasts and morning programs each dropped 1% in 2016.  The fact that \"Today\" has started to trump ABC rival \"Good Morning America\" in the ratings since Lauer's departure and that \"CBS This Morning\" has not seen massive viewer defections since Charlie Rose was ousted lend credence to the notion that TV-news junkies are increasingly tuning in first for the news and second for the familiar person delivering it.\r\n\r\nTo be sure, there have been and always will be exceptions. Megyn Kelly is believed to have negotiated a salary of at least $17 million from NBC News, which snared her when her contract at Fox News Channel ended last year. Fox News is known to pay its top stars salaries well above some industry standards, however, and NBC had to cough up attractive terms at a time when Kelly was holding exploratory talks with several news organizations.\r\n\r\nSalaries grow the longer a person stays in a particular position. In the recent past, Lauer signed new deals every two or three years, and it's easy to see how compensation might grow substantially at that rate, particularly when he held the same role for at least two decades.\r\n\r\nBut it's the rare case when someone gets the same salary as their predecessor. Anchors and hosts need to prove staying power and show they are a ratings draw. Over time, that makes them more valuable and more difficult to let go. No doubt, if \"Today\" continues to outdraw \"GMA\" as it has in recent weeks -- whether it can remains an unknown -- or if the broadcast gains new viewers or widens its overall audience, Kotb will no doubt see her compensation rise with each contract renewal.\r\n\r\nThe question people should be asking isn't whether Hoda Kotb is making Matt Lauer's former salary. She's not. But is she making a fair wage given that she's the co-host of two of NBC's most valuable hours while continuing to co-host a third with Kathie Lee Gifford? Only her agents and top NBCUniversal executives know for sure.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1515009580.0, "source": "https://variety.com", "summary": ""}