{"url": "https://www.elle.com/culture/celebrities/a22822385/alexandra-daddario-zac-efron-dog-maca-adoption/", "text": "Earlier this year, Baywatch co-stars Alexandra Daddario and Zac Efron were spotted shopping for pet toys together which sparked intense speculation that the two were dating.\n\nThe pair has denied it—insisting they’re just “very good friends.” But when it came to the very important decision of adopting a dog, Efron turned to none other than his friend Daddario.\n\n\"He was in the market for [a dog], and it’s a big life decision,\" Daddario tells ELLE.com. \"He just wanted to make it as easy as possible.\"\n\nDaddario and Efron found Maca, an adorable brown and black pit bull, at the LA-based rescue shelter called Bark n’ Bitches. The dog, who was named Tilly before Efron adopted her, was about to be euthanized before the shelter took her in.\n\nW Blanco/Backgrid\n\n\"Maca was being led to the kill room when we stepped in and said we would take her. She was turned around and brought to us!,\" Bark n' Bitches wrote on Instagram in April. \"This guy named Zac Efron came in (we hear he is an actor, but we think he actually waits tables) came in and fell in love.\"\n\nDaddario has her own rescue pup: a sweet terrier mix named Levon.\n\n\"I have an adopted dog and he's my best friend. I found out what rescue shelter he was at, and it was love at first sight,” says Daddario, who first spotted Levon on Adopt-a-Pet.com. Now, the actress is partnering with Dogtrader.com—Autotrader’s new dog adoption website created with Adopt-a-Pet.com—to encourage more people to adopt rescues. “He had been neglected and it was such a great feeling to bring him into my home, and to see him get happier and happier, and to feel safer and safer, and see his personality come out more.”\n\nIt was Efron’s offer for a doggie date with Levon (and Daddario) that sparked romance rumors from fans. When Efron adopted MACA, he introduced her to the world with a sweet Instagram photo — and in the comments he tagged Daddario and said “doggie date?”\n\nBut the actress says she hasn’t taken him up on the offer.\n\n\"I’ve been working a lot, so not recently,\" says Daddario, who starred in When We First Met earlier this year. \"Our lives get so crazy, and sometimes it’s hard to keep in touch with people. But you have to take the dog out on a hike every now and then, so sometimes with friends we’ll meet up.\"\n\n\"When your friends’ dogs start to get to know each other and they either like each other or they don't, it’s really cute to see,\" she adds. \"It’s like the precursor of children.\"\n\nIf Efron wants to take things out of the friendzone, we hope for his sake that Levon likes him.\n\n\"I have this long-running joke that my dog has to like the guy I’m dating or else I can’t date him,\" Daddario says with a laugh. \"It’s only happened once that my dog really hated the guy I brought home. It was someone I dated for a while, and he just didn’t like him.\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.334xh;0,0.115xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.334xh;0,0.115xh&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.elle.com/culture/celebrities/a22822385/alexandra-daddario-zac-efron-dog-maca-adoption/", "title": "Alexandra Daddario and Zac Efron's Dogs Might be Dating But They Are Not", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Alexandra Daddario and Zac Efron's Dogs Might be Dating But They Are Not", "description": "Everyone thinks their flirty Instas about their dogs means they’re dating. Daddario explains.", "url": "https://www.elle.com/culture/celebrities/a22822385/alexandra-daddario-zac-efron-dog-maca-adoption/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.334xh;0,0.115xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-08-27 04:18:30", "published_time": "2018-08-27 04:16:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.334xh;0,0.115xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Alexandra Daddario and Zac Efron's Dogs Might be Dating But They Are Not", "description": "In an interview with Elle.com, Alexandra Daddario shares how she's helped her friends, including Zac Efron, find a dog to adopt and what her doggie play dates look like.", "keywords": "alexandra daddario, zac efron, levon daddario, alex daddario, baywatch, autotrader, dogtrader, maca", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.668xh;0,0.0951xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities", "sailthru.date": "2018-08-27T16:16:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.334xh;0,0.115xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bgus-1188656-001-1-1535122487.jpg?crop=1.00xw:0.668xh;0,0.0951xh", "sailthru.socialtitle": "Alexandra Daddario and Zac Efron's Dogs Might be Dating But They Are Not", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1535314560.0, "source": "https://www.elle.com", "summary": ""}