{"url": "https://www.bbc.co.uk/newsround/39802253", "text": "Getty Images Prince Philip has completed 22,219 solo events or public meetings since 1952\n\nThe Queen's husband Prince Philip will take part in his final public meeting before he officially retires from royal duties.\n\nThe 96-year-old announced his retirement in May, after decades of supporting the Queen, as well as attending events for his own charities and organisations.\n\nPrince Philip is also known as the Duke of Edinburgh, but who is he and why is he so important?\n\nWho is The Duke of Edinburgh?\n\nAFP/Getty Images\n\nThe Duke of Edinburgh is the Queen's husband - they've been married for nearly 70 years.\n\nThey met while Prince Philip was an officer in the Navy during World War Two.\n\nPA Prince Philip and the then Princess Elizabeth pose for their official wedding photo at Buckingham Palace in 1947\n\nHe and the Queen have four children: Prince Charles, Prince Andrew, Prince Edward and Princess Anne.\n\nPrince Philip is also the grandfather of Princes William and Harry, and the great-grandfather of Prince George and Princess Charlotte.\n\nGetty Images Royal British couple, Queen Elizabeth II, and her husband Phillip, Duke of Edinburgh, with two of their children, Prince Charles (left) and Princess Anne in 1951\n\nAlthough he isn't the king, his job title is pretty special. He's the Queen's 'consort' - and his role is to support Queen Elizabeth II.\n\nHe now holds the record for the longest-serving consort in British history!\n\nThe Prince's early life\n\nGetty Images Prince Phillip in the Navy before he met his wife, who went on to become Queen Elizabeth II\n\nPrince Philip was born in 1921 on the Greek island of Corfu.\n\nHis family left Greece when Philip was just a one-year-old baby.\n\nHe spent his childhood in France, Germany and then here in Britain.\n\nHe celebrated his 96th birthday in June 2017.\n\nHobbies and interest?\n\nGetty Images Queen Elizabeth II and Prince Philip, feed Donna the elephant as they visit a zoo in Dunstable, UK\n\nPhilip gave up his job in the Navy after Queen Elizabeth II's father died and she became Queen.\n\nHe has always thrown himself into his role of supporting her and has found a real passion in doing charity work.\n\nOne issue he cares about a lot is wildlife conservation - something he spoke to Newsround about back in 1986.\n\nTo enjoy the CBBC Newsround website at its best you will need to have JavaScript turned on. Prince Philip spoke to Newsround about his passion for saving wildlife\n\nYou may also have heard of one of his most important and famous charities: The Duke of Edinburgh Award scheme.\n\nIt offers challenges and adventure to thousands of young people in the UK.\n\nSince the Duke of Edinburgh's Award was launched in 1956, millions of young people have taken part in the scheme.\n\nPA Prince Philip speaking to two teenagers taking part in the Duke of Edinburgh Award scheme\n\nPhilip also has a reputation for speaking his mind, and sometimes his comments have caused some people embarrassment.\n\nHowever, he is also praised by many for his dedication and his unique way of doing things.\n\nWhat are royal duties?\n\nGetty Images The Queen and Prince Philip have stood side by side together during thousands of royal events and visits\n\nThe Queen is not only the head of state of the UK but she's also Head of the Commonwealth - an association of 52 countries, many of which used to be part of the British Empire.\n\nAs well as visiting parts of the UK, part of the Queen's job involves visiting these other countries, meeting people and doing lots of charity work, which Prince Philip often helps her with.\n\nGetty Images 1966 saw Prince Philip and the Queen in the Bahamas as part of a tour of the Caribbean\n\nSince 1952, Prince Philip has completed 22,219 royal engagements on his own.\n\nEvery year the Royal Family carry out over 2,000 official visits throughout the UK and worldwide.\n\nAs the Queen and the Duke have become older more of these royal duties have been passed to the younger members of the family.\n\nGetty Images Prince Philip clung on for a ride on an elephant during a visit to to India in 1983\n\nWhile Prince Philip's diary of events will come to an end in August, Buckingham Palace has said he may still decide to attend certain events alongside the Queen in the future.\n\nThe Queen's public schedule will continue as normal.", "images": ["https://ichef.bbci.co.uk/news/320/cpsprodpb/FDF8/production/_97161056_654af90f-4875-4ef7-9e93-12ed4b89034d.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/5461/production/_100910612_queen.jpg", "http://c.files.bbci.co.uk/12570/production/_95902157_gettyimages-479434146.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/115AE/production/_93968017_hi037705540.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/AEB3/production/_111832744_bignightin.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/7DFF/production/_95855223_hi039258329.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/14C18/production/_97161058_3cb934c4-6b25-47f2-9634-9a7744b7fef6.jpg", "https://ichef.bbci.co.uk/news/240/mcs/media/images/68030000/jpg/_68030644_philip_nogame.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/219F/production/_97170680_p05bcmzd.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/1151C/production/_95904907_gettyimages-96519821.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/12DF4/production/_95900377_gettyimages-568962713.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/959C/production/_95900383_gettyimages-478375624.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/12570/production/_95902157_gettyimages-479434146.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=news::newsround.news.story.39802253.page&x1=[urn:bbc:cps:56581412-b0e9-e241-b06b-903753a7a967]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWSROUND]&x12=[NEWSROUND]", "https://ichef.bbci.co.uk/news/240/cpsprodpb/3128/production/_111448521_gettyimages-613678930.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/28E4/production/_91886401_hi035403113.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/11746/production/_111849417_trentloss.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/477C/production/_95900381_gettyimages-103032628.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/240/cpsprodpb/1424E/production/_95901528_p051xtyq.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/E903/production/_96115695_de28.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/767A/production/_95903303_048a6417-addc-478d-be74-2600de0384ee.jpg", "https://ichef.bbci.co.uk/news/240/cpsprodpb/178AC/production/_90482469_mediaitem90482465.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/17C14/production/_95900379_gettyimages-667177706.jpg"], "top_img": "http://c.files.bbci.co.uk/12570/production/_95902157_gettyimages-479434146.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.co.uk/newsround/39802253", "title": "Prince Philip is retiring from royal duties", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"admins": 100004154058350}, "og": {"title": "Prince Philip is retiring from royal duties - CBBC Newsround", "description": "The Queen's husband Prince Philip, the Duke of Edinburgh, will take part in his final public meeting today before he retires from royal duties. Find out more about him here.", "url": "https://www.bbc.co.uk/newsround/39802253", "image": "http://c.files.bbci.co.uk/12570/production/_95902157_gettyimages-479434146.jpg"}, "description": "The Queen's husband Prince Philip, the Duke of Edinburgh, will take part in his final public meeting today before he retires from royal duties. Find out more about him here."}, "movies": [], "publish_date": null, "source": "https://www.bbc.co.uk", "summary": ""}