{"url": "http://www.whitehouse.gov/the-press-office/2012/03/29/remarks-president-oil-and-gas-subsidies", "text": "Rose Garden\n\n11:00 A.M. EDT\n\nTHE PRESIDENT: Thank you very much. (Applause.) Everybody, please have a seat. Sorry we’re running just a little bit behind, but I figured it’s a great day to enjoy the Rose Garden.\n\nToday, members of Congress have a simple choice to make: They can stand with the big oil companies, or they can stand with the American people.\n\nRight now, the biggest oil companies are raking in record profits –- profits that go up every time folks pull up into a gas station. But on top of these record profits, oil companies are also getting billions a year -- billions a year in taxpayer subsidies -– a subsidy that they’ve enjoyed year after year for the last century.\n\nThink about that. It’s like hitting the American people twice. You’re already paying a premium at the pump right now. And on top of that, Congress, up until this point, has thought it was a good idea to send billions of dollars more in tax dollars to the oil industry.\n\nIt’s not as if these companies can’t stand on their own. Last year, the three biggest U.S. oil companies took home more than $80 billion in profits. Exxon pocketed nearly $4.7 million every hour. And when the price of oil goes up, prices at the pump go up, and so do these companies’ profits. In fact, one analysis shows that every time gas goes up by a penny, these companies usually pocket another $200 million in quarterly profits. Meanwhile, these companies pay a lower tax rate than most other companies on their investments, partly because we’re giving them billions in tax giveaways every year.\n\nNow, I want to make clear, we all know that drilling for oil has to be a key part of our overall energy strategy. We want U.S. oil companies to be doing well. We want them to succeed. That’s why under my administration, we’ve opened up millions of acres of federal lands and waters to oil and gas production. We’ve quadrupled the number of operating oil rigs to a record high. We’ve added enough oil and gas pipeline to circle the Earth and then some. And just yesterday, we announced the next step for potential new oil and gas exploration in the Atlantic.\n\nSo the fact is, we’re producing more oil right now than we have in eight years, and we’re importing less of it as well. For two years in a row, America has bought less oil from other countries than we produce here at home -– for the first time in over a decade.\n\nSo American oil is booming. The oil industry is doing just fine. With record profits and rising production, I’m not worried about the big oil companies. With high oil prices around the world, they’ve got more than enough incentive to produce even more oil. That’s why I think it’s time they got by without more help from taxpayers who are already having a tough enough time paying the bills and filling up their gas tank. And I think it’s curious that some folks in Congress, who are the first to belittle investments in new sources of energy, are the ones that are fighting the hardest to maintain these giveaways for the oil companies.\n\nInstead of taxpayer giveaways to an industry that’s never been more profitable, we should be using that money to double-down on investments in clean energy technologies that have never been more promising -- investments in wind power and solar power and biofuels; investments in fuel-efficient cars and trucks, and energy-efficient homes and buildings. That’s the future. That’s the only way we're going to break this cycle of high gas prices that happen year after year after year. As the economy is growing, the only time you start seeing lower gas prices is when the economy is doing badly. That’s not the kind of pattern that we want to be in. We want the economy doing well, and people to be able to afford their energy costs.\n\nAnd keep in mind, we can’t just drill our way out of this problem. As I said, oil production here in the United States is doing very well, and it's been doing well even as gas prices are going up. Well, the reason is because we use more than 20 percent of the world’s oil but we only have 2 percent of the world’s known oil reserves. And that means we could drill every drop of American oil tomorrow but we’d still have to buy oil from other countries to make up the difference. We’d still have to depend on other countries to meet our energy needs. And because it’s a world market, the fact that we’re doing more here in the United States doesn’t necessarily help us because even U.S. oil companies they’re selling that oil on a worldwide market. They’re not keeping it just for us. And that means that if there’s rising demand around the world then the prices are going to up.\n\nThat’s not the future that I want for America. I don’t want folks like these back here and the folks in front of me to have to pay more at the pump every time that there’s some unrest in the Middle East and oil speculators get nervous about whether there’s going to be enough supply. I don’t want our kids to be held hostage to events on the other side of the world.\n\nI want us to control our own destiny. I want us to forge our own future. And that’s why, as long as I’m President, America is going to pursue an all-of-the-above energy strategy, which means we will continue developing our oil and gas resources in a robust and responsible way. But it also means that we’re going to keep developing more advanced homegrown biofuels, the kinds that are already powering truck fleets across America.\n\nWe’re going to keep investing in clean energy like the wind power and solar power that’s already lighting thousands of homes and creating thousands of jobs. We’re going to keep manufacturing more cars and trucks to get more miles to the gallon so that you can fill up once every two weeks instead of every week. We’re going to keep building more homes and businesses that waste less energy so that you’re in charge of your own energy bills.\n\nWe’re going to do all of this by harnessing our most inexhaustible resource: American ingenuity and American imagination. That’s what we need to keep going. That’s what’s at stake right now. That’s the choice that we face. And that’s the choice that’s facing Congress today. They can either vote to spend billions of dollars more in oil subsidies that keep us trapped in the past, or they can vote to end these taxpayer subsidies that aren’t needed to boost oil production so that we can invest in the future. It’s that simple.\n\nAnd as long as I’m President, I’m betting on the future. And as the people I’ve talked to around the country, including the people who are behind me here today, they put their faith in the future as well. That’s what we do as Americans. That’s who we are. We innovate. We discover. We seek new solutions to some of our biggest challenges. And, ultimately, because we stick with it, we succeed. And I believe that we’re going to do that again. Today, the American people are going to be watching Congress to see if they have that same faith.\n\nThank you very much, everybody. (Applause.)\n\nEND\n\n11:08 A.M. EDT", "images": ["https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "https://obamawhitehouse.archives.gov/profiles/forall/modules/custom/gov_whitehouse_www/images/icons/wh_logo_seal.png"], "top_img": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "keywords": [], "authors": [], "canonical_link": "https://obamawhitehouse.archives.gov/the-press-office/2012/03/29/remarks-president-oil-and-gas-subsidies", "title": "Remarks by the President on Oil and Gas Subsidies", "meta_data": {"msapplication-square70x70logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-TileImage": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-square150x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x150.png", "msapplication-square310x310logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x310.png", "msapplication-TileColor": "#003C80", "application-name": "Whitehouse", "msapplication-config": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/browserconfig.xml", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "whitehouse.gov", "type": "article", "title": "Remarks by the President on Oil and Gas Subsidies", "url": "https://obamawhitehouse.archives.gov/the-press-office/2012/03/29/remarks-president-oil-and-gas-subsidies", "description": "Rose Garden 11:00 A.M. EDT", "updated_time": "2012-03-29T11:45:59-04:00", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "secure_url": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "type": "image/jpeg", "width": 240, "height": 240}}, "twitter": {"card": "summary", "site": "@WhiteHouse", "creator": "@WhiteHouse", "title": "Remarks by the President on Oil and Gas Subsidies", "url": "https://obamawhitehouse.archives.gov/the-press-office/2012/03/29/remarks-president-oil-and-gas-subsidies", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "width": 240, "height": 240}}, "article": {"published_time": "2012-03-29T11:44:00-04:00", "modified_time": "2012-03-29T11:45:59-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width"}, "movies": [], "publish_date": 1332950400.0, "source": "http://www.whitehouse.gov", "summary": ""}