{"url": "https://en.wikipedia.org/wiki/Alexa_Vega", "text": "American actress and singer\n\nAlexa PenaVega[1] (née Vega; born August 27, 1988)[2] is an American actress and singer. She is known for her role as Carmen Cortez in the Spy Kids film series and Shilo Wallace in the film Repo! The Genetic Opera (2008). In 2009, she starred as the title character Ruby Gallagher in the ABC Family series Ruby & the Rockits.\n\nEarly life [ edit ]\n\nVega was born in Miami, Florida.[2] She spent the first four years of her life on a ranch in Ocala, Florida. Her father, Baruch Vega, is a Colombian fashion photographer who was an informant for the Drug Enforcement Administration, and her mother, Gina Rue, is an American former model.[3][4][5][6] Vega has six siblings, including actress Makenzie Vega. She moved with her family to California when she was four years old.[7] As a teenager, she was homeschooled.[8]\n\nCareer [ edit ]\n\nActing [ edit ]\n\nIn 1996, Vega starred as young Jo Harding in Twister. She guest-starred in numerous television shows and films, including ER, Follow the Stars Home, Ghost Whisperer, and The Bernie Mac Show. She became known worldwide in 2001 for her role as \"Carmen Cortez\" in Spy Kids. The first Spy Kids film was a huge success, and subsequently two sequels, Spy Kids 2: The Island of Lost Dreams and Spy Kids 3-D: Game Over were filmed. During the shooting of the three films, she performed most of her own stunts. In 2011, Vega appeared in the sequel, Spy Kids: All the Time in the World as a grown Carmen Cortez.\n\nIn 2003, she was named one of that year's hottest teen celebrities in the July 2003 issue Vanity Fair. In 2004, Vega finished filming two films: Sleepover and State's Evidence. Then the following year she starred in the Lifetime television film entitled Odd Girl Out as a victim of cyber-bullying. She also filmed for another made-for-TV movie, Walkout. In June 2006, she finished filming Remember the Daze, which was released in limited theaters on April 2007. She also finished filming Repo! The Genetic Opera, which was released in 2008.[9] Vega was confirmed as the lead role in Helix, written and directed by Aram Rappaport, which began filming in Chicago in March 2008. Vega was originally cast in the 2009 Robert Rodriguez film Shorts, however, due to her being in Australia for the filming of Broken Hill, she had to be recast. She was replaced by Kat Dennings. She appeared on Broadway in Hairspray, as Penny.[10] In 2009, she played Ruby Gallagher on the ABC Family television sitcom Ruby & the Rockits, which also starred Patrick and David Cassidy.\n\nVega played Wick in the 2012 film The Devil's Carnival, a film from director Darren Lynn Bousman and screenwriter Terrance Zdunich, who previously worked with Vega in Repo! The Genetic Opera.[11] Throughout 2012, Vega starred in the independent thriller, 2br/1ba, directed by Rob Margolies and co-stars with Spencer Grammer and Kathryn Morris. Vega also starred in the Lifetime Channel movie The Pregnancy Project and her animated film The Clockwork Girl was completed. Vega's film The Mine which was filmed in 2010 got a limited release/screening. Vega also voiced Christina in the animated series Unsupervised and had a guest role on Royal Pains. Vega played the young heroine in Aerosmith's music video \"Legendary Child\".[12]\n\nThroughout 2013 and 2014, Vega appeared in the films 23 Blast, Machete Kills, Bounty Killer, Wicked Blood, The Remaining, and The Hunters. She also guest starred on the Big Time Rush series finale \"Big Time Dreams\", playing herself. In 2015, Alexa appeared in Do You Believe? as Lacey.[13]\n\nIn fall 2015, Vega competed on the 21st season of Dancing with the Stars. Her husband, Carlos PenaVega was also competing that season.[14] She was paired with professional dancer Mark Ballas.[15] On November 9, PenaVega and Ballas were eliminated and finished the competition in 6th place.\n\nMusic [ edit ]\n\nShe recorded three songs for the soundtracks while playing Carmen Cortez in the Spy Kids films alongside Tameez Orrie . She then released her debut single, \"Isle of Dreams\", to coincide with the release of the second film. She also released \"Game Over\" and \"Heart Drive\" featuring Bobby Edner for the third film. She also recorded songs for the movie Repo! The Genetic Opera, released in 2008.\n\nVega sang the song \"Christmas is the Time to Say 'I Love You'\" in the ABC Family film Santa Baby 2: Christmas Maybe. The track appears on the compilation album Songs to Celebrate 25 Days of Christmas, which was released on November 3, 2009 by Walt Disney Records. The music video for the song premiered during ABC Family's 25 Days of Christmas.\n\nPersonal life [ edit ]\n\nVega married film producer Sean Covel on October 10, 2010, in a ceremony held in his hometown of Lead, South Dakota.[16] She was walked down the aisle by Robert Rodriguez. In July 2012, Vega announced on Twitter that she had divorced Covel.[17][18]\n\nPenaVega is a Christian. She has said that her faith is the most important thing in her life.[19] Vega was the maid of honor at Nikki Reed's wedding to Paul McDonald.[20]\n\nIn August 2013, Vega became engaged to actor and singer Carlos Pena Jr.[21][22] The couple married on January 4, 2014 in Puerto Vallarta, Mexico, both taking PenaVega as their married name.[23] The couple shares a YouTube channel, LexLovesLos.[24] They have two sons, born in December 2016[25] and June 2019.[26][27]\n\nPenaVega revealed on Dancing with the Stars that she was bulimic and has since recovered.[28]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nDiscography [ edit ]\n\nSoundtrack performances [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Alexa_Vega_during_Repo_Tour_cropped.jpg/220px-Alexa_Vega_during_Repo_Tour_cropped.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Alexa_Vega_2013_%28cropped%29.jpg/1200px-Alexa_Vega_2013_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Alexa_Vega_2013_%28cropped%29.jpg/220px-Alexa_Vega_2013_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Alexa_Vega_2013_%28cropped%29.jpg/1200px-Alexa_Vega_2013_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Alexa_PenaVega", "title": "Alexa PenaVega", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Alexa_Vega_2013_%28cropped%29.jpg/1200px-Alexa_Vega_2013_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}