{"url": "https://web.archive.org/web/20170716210327/http://www.cbc.ca/passionateeye/episodes/diana-seven-days-that-shook-the-world", "text": "It’s been twenty years since the shocking death of Princess Diana in a tragic and controversial car crash in Paris on August 31, 1997. The public grief was instantaneous and unprecedented. Thousands flocked to London to pay their respects and a 50-foot carpet of flowers sprung up outside Kensington Palace. Amid this outpouring of grief, the Royal Family elected to remain out of the public eye, sparking the biggest royal crisis in half a century. Diana: Seven Days That Shook the World takes us through the dramatic moments that played out in the week leading up to Princess Diana’s funeral, at a time when the future of the monarchy was in serious doubt. The documentary provides first-time access to many of the key players, revealing intimate details about how the Royal Family and Diana’s closest confidants coped with the tragedy in the days after her death.\n\nDiana, Princess of Wales, was an icon who transcended celebrity and transformed the monarchy. After her death, tens of thousands of people gathered at the royal palaces to express their shock and sadness in a tidal wave of grief. But for three days, the Royal Family remained out of sight and silent, even refusing to fly the flag atop Buckingham Palace at half-mast.\n\nPrincess Diana's funeral Princess Diana's funeral\n\nAt their Scottish estate, the Royal Family was reeling from the news. Diana: Seven Days That Shook the World reveals that Prince Charles and the Queen had different views on how to deal with Diana’s death. Richard Kay, a journalist and friend of Diana’s says, “Charles took the decision that he was going to Paris to bring back Diana’s body.” He was met with opposition from the Queen who wouldn’t allow him to take the Royal flight to Paris, but eventually, Charles won the argument. “The irony is Charles fought for Diana, more than he’d ever fought for her in her lifetime,” says Tina Brown, author of The Diana Chronicles.\n\nTwo of Diana’s closest staffers also travelled to Paris to make arrangements to bring her home. Diana’s butler Paul Burrell, and Colin Tebbutt, Diana’s chauffeur and security consultant watched over her body in the hospital where she had died. Tebbutt says that he hung blankets from the windows to keep people from taking photos.\n\nAs the week went on, the public blamed the press for Diana’s death. And then as their anger grew, they found a new target - The Royal Family.\n\nDiana: Seven Days That Shook the World offers insider details about the tense planning of the high-profile funeral at Westminster Abbey. Royal advisors wanted both princes to walk behind Diana’s coffin in the funeral procession, but initially, Prince William refused. Richard Kay says, “He just didn’t want to be seen grieving in public.” William had to be convinced and only agreed at the eleventh hour.\n\nTensions grew and the relationship between the British monarchy and the public hit an all-time low. Under extreme pressure from the public, the Queen made an announcement and broke with protocol in a series of astonishing steps. For the first time in history, the Union Jack would fly at half-mast over the palace. And the Queen would address the nation on television, in what would be her first live broadcast in 50 years.\n\nTwenty years on, those close to Diana still remember that intense and unbelievable week. For some, the emotion of that day is as fresh as ever. Patrick Jephson, Diana’s private secretary, says in the documentary, “I experienced a whole extraordinary cocktail of emotions, and 20 years later I still feel them.” Diana’s butler, Paul Burrell, shares his very private experience of keeping a solitary vigil over her coffin the night before the funeral. “I decorated the room and lit all the candles...I wanted to have a last conversation and tell her about all the people that...had expressed their love for her.”\n\nLed by this unique personal testimony, the documentary explores the practical and emotional implications of the week and examines how Diana’s death ultimately helped preserve the future of the British monarchy.\n\n", "images": ["https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/FB-f-Logo__blue_512.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/episodes/diana-seven-days-that-shook-the-world", "https://web.archive.org/web/20170716210327im_/http://pubads.g.doubleclick.net/gampad/ad?iu=5876/misc&sz=728x90&c=123456789", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/twitter-bird-white-on-blue.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/Diana_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/i/o/globalnav/v14/images/cbc-gem.svg", "https://web.archive.org/web/20170716210327im_/http://pubads.g.doubleclick.net/gampad/ad?iu=5876/misc&sz=300x250&c=123456789", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/logo-passeye.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/logo_cbc_docs.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/meetthetrumps_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/icon_email.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/Diana_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/truthaboutalcohol_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/whitehouse_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/royalgoodguys_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/Instagramlogo_512.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/i/img/icon_faqComment_current.png", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/_thumbnail/cleaneating_1920.jpg", "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/__common/diana.jpg"], "top_img": "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/Diana_1920.jpg", "keywords": [], "authors": [], "canonical_link": "//web.archive.org/web/20170716210327/http://www.cbc.ca/passionateeye/index.php/episodes/diana-seven-days-that-shook-the-world", "title": "Diana: Seven Days That Shook the World", "meta_data": {"viewport": "width=986px", "application-name": "www.cbc.ca", "msApplication-ID": "App", "msApplication-PackageFamilyName": "CanadianBroadcastingCorpo.CBC_pw8q9bvavk68p", "date": "2017/03/09", "vf": {"section": "docs", "unique_id": "the_passionate_eye_699"}, "og": {"image": "https://web.archive.org/web/20170716210327im_/http://www.cbc.ca/passionateeye/content/images/episodes/Diana_1920.jpg", "title": "Diana: Seven Days That Shook the World", "url": "/web/20170716210327/http://www.cbc.ca/passionateeye/episodes/diana-seven-days-that-shook-the-world", "type": "article", "description": "A rare insight into the days following Princess Diana’s tragic death, including the fraught negotiations as the Royal Family struggled to protect Princes William and Harry, appease the public and plan a high-profile funeral at Westminster Abbey."}, "description": "A rare insight into the days following Princess Diana’s tragic death, including the fraught negotiations as the Royal Family struggled to protect Princes William and Harry, appease the public and plan a high-profile funeral at Westminster Abbey.", "google-site-verification": "l3dhanJuLyXJlWNFqiKGZX9zCIOkg-Nf84mlK3CjLTM"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}