{"url": "https://www.etonline.com/chris-pratt-offers-9-hilarious-inspiring-life-rules-while-accepting-mtv-generation-award-104428", "text": "Chris Pratt has some brilliant, devout and hilarious words of wisdom for all his young fans.\n\nThe handsome star was honored with the Generation Award at the 2018 MTV Movie & TV Awards, which aired on Monday, which was presented to him by his Jurassic World: Fallen Kingdomco-star, Bryce Dallas Howard, and his onscreen Parks and Recreation wife, Aubrey Plaza.\n\nDuring his acceptance speech, he expressed his love for both presenters and shared special thanks to friends, family, colleagues and especially his 5-year-old son, Jack.\n\nFrom there, he outlined what he called his \"Nine Rules From Chris Pratt, Generation Award Winner,\" giving his young fans, and all of those who make up the next generation, some brilliant, hilarious guidelines to live their lives by.\n\n\"Being the Generation Award I'm going to cut to the chase and I'm going to speak to you, the next generation, OK? I accept the responsibility as your elder,\" Pratt said, before breaking down his simple rules.\n\n\"No. 1, breathe. If you don't, you'll suffocate,\" Pratt quipped. \"No. 2, you have a soul, be careful with it. No. 3, don't be a turd. In this real world it is illegal to slap people, [but] don't take advantage of that fact. If you're strong, be a protector, and if you're smart, be a humble influencer. Strength and intelligence can be weapons, and do not wield them against the weak -- that makes you a bully.\"\n\nChris Pratt and Bryce Dallas Howard Dish on Having Kids on 'Jurassic World: Fallen Kingdom' Set (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Chris Pratt and Bryce Dallas Howard Dish on Having Kids on 'Jurassic World: Fallen Kingdom' Set (Exclusive)\n\n\"No. 4, when giving a dog medicine, put the medicine in a little piece of hamburger. They won't even know they're eating the medicine,\" he continued, deftly mixing humor with emotion and wisdom. \"No. 5, it doesn't matter what it is, earn it. It feels good. Five bucks earned is better than 10 bucks given to you, every time. If you feel like crap, look at your life, what you have that you didn't earn. Do something to earn it. A good deed, reach out to someone in pain, be of service. It feels good and it's good for your soul.\"\n\nPratt also shared a bit of his deeply held faith with his life rules, especially with rule No. 6: \"God is real, God loves you, God wants the best for you. Believe that. I do.\"\n\n\"No. 7, if you have to poop at a party but you're embarrassed because you're gonna stink up the bathroom, just do what I do and lock the door, sit down, get all the pee out first, OK? And then, once all the pee is done, poop, flush, boom! You minimize the amount of time that the poop is touching the air, because if you poop first, it takes you longer to pee and then you're peeing on top, then it's stirring up,\" Pratt added, to gales of laughter from the audience. \"Just trust me, it's science.\"\n\nChris Pratt and the 'Jurassic World' Cast Share Favorite Lines from the Original This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Chris Pratt and the 'Jurassic World' Cast Share Favorite Lines from the Original\n\n\"No. 8, learn to pray. It's easy and it's so good for your soul. You just close your eyes, you list off people for which you are grateful, ask for protection for the people you love,\" Pratt shared. \"Don't be embarrassed by it, you let people see you do it, it's good for their soul, too.\"\n\n\"And finally, No. 9, nobody is perfect. Nobody. None of us, not you. People are gonna tell you you're perfect just the way you are, you're not! You are imperfect, you always will be, but there is a powerful force that designed you that way. And it loves you, it accepts you for exactly who you are,\" Pratt said. \"It forgives you for your flaws, no matter what they are, and if you're willing to accept that, you will have grace. And grace is a gift.\"\n\n\"And like the freedom that we enjoy in this country, that grace was paid for with somebody else's blood,\" Pratt continued. \"Do not forget it. Don't take it for granted. It's a gift for which none of us are worthy. So do your best to earn it. Just be kind, don't be a bully, be of service. Do not be a turd. God bless you.\"\n\nPratt, who previously won the MTV Movie & TV Award for Best Action Performance in 2016 for his role in Jurassic World, has been very outspoken about his religious faith throughout the last few years.\n\nChris Pratt 'Moved to Tears' Over Star on the Hollywood Walk of Fame This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Chris Pratt 'Moved to Tears' Over Star on the Hollywood Walk of Fame\n\nWhile Pratt has always spoken of inclusiveness and acceptance when discussing his religious beliefs, the actor has received some criticism in the past -- like when he tweeted that he would be \"praying his a** off\" for Kevin Smith following the director's heart attack in May.\n\nDespite getting heat online for encouraging fans to pray for Smith, both the Clerks director and James Gunn, who helmed the Guardians of the Galaxy films, came out in support of the well-meaning star.\n\nET caught up with Pratt on Saturday, when the MTV Movie & TV Awards actually went down at the Barker Hangar in Santa Monica, California, where he opened up about spending time with his young son.\n\n\"I think my love language is quality time, so when we can sit down and just be together and spend time together, just me and him,\" Pratt said of Jack, whom he shares with his ex-wife, Anna Faris. \"That’s probably when I’m the happiest and when he looks up to me the most.\"\n\nCheck out the video below for more heart-melting adorableness from the proud dad and Generation Award winner.\n\nChris Pratt Touchingly Reveals When His Son Jack Looks Up to Him the Most (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nChris Pratt Continuously Fools Jimmy Fallon While Playing 'Box of Lies': Watch\n\nChris Pratt Geeks Out Over Laura Dern's Possible 'Jurassic' Franchise Return (Exclusive)\n\nChris Pratt & Bryce Dallas Howard Recall Kids' 'Mind-Blowing' 'Jurassic World 2' Set Visit (Exclusive)\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/gettyimages-1211224543.jpg?h=c673cd1c&itok=egPO3YyL", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/chris_pratt_gettyimages-976693844_1280.jpg?h=c673cd1c&itok=9_TnjezQ", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-961235858.jpg?h=fbc58516&itok=5b3I9AKf", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/kobevanslovestoryvp.jpg?h=c673cd1c&itok=BhLYWr25"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/chris_pratt_gettyimages-976693844_1280.jpg?h=c673cd1c&itok=9_TnjezQ", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/chris-pratt-offers-9-hilarious-inspiring-life-rules-while-accepting-mtv-generation-award-104428", "title": "Chris Pratt Offers 9 Hilarious, Inspiring Life Rules While Accepting MTV Generation Award", "meta_data": {"article": {"opinion": "false"}, "title": "Chris Pratt Offers 9 Hilarious, Inspiring Life Rules While Accepting MTV Generation Award | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/chris-pratt-offers-9-hilarious-inspiring-life-rules-while-accepting-mtv-generation-award-104428", "title": "Chris Pratt Offers 9 Hilarious, Inspiring Life Rules While Accepting MTV Generation Award", "description": "The 'Jurassic World: Fallen Kingdom' star shared his guiding principles for the \"next generation\" of kids who look up to him at the 2018 MTV Movie & TV Awards.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/chris_pratt_gettyimages-976693844_1280.jpg?h=c673cd1c&itok=9_TnjezQ", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 'Jurassic World: Fallen Kingdom' star shared his guiding principles for the \"next generation\" of kids who look up to him at the 2018 MTV Movie & TV Awards.", "title": "Chris Pratt Offers 9 Hilarious, Inspiring Life Rules While Accepting MTV Generation Award", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/chris-pratt-offers-9-hilarious-inspiring-life-rules-while-accepting-mtv-generation-award-104428", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/chris_pratt_gettyimages-976693844_1280.jpg?h=c673cd1c&itok=9_TnjezQ"}, "description": "The 'Jurassic World: Fallen Kingdom' star shared his guiding principles for the \"next generation\" of kids who look up to him at the 2018 MTV Movie & TV Awards.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Awards, Movies, News, TV, Chris Pratt, MTV Movie TV Awards", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}