{"url": "https://www.blockislandorganics.com/Blog/post/2017/09/27/Despite-What-Tom-Brady-Says-Drinking-Water-Does-Not-Prevent-Sunburn.aspx", "text": "© Keith Allison\n\nTom Brady - yes, the famous Patriots quarterback - has a new book out. In it, he covers a lot including a suggestion that drinking water is a good way to protect your skin from sunburn. Um…can we just say no? Tom is a great quarterback but he is not a healthcare expert.\n\nExactly What Tom Brady Says\n\nHere’s the quote from his book. It’s pretty direct:\n\nWhen I was growing up, and playing outside in the sun, I got sunburned a lot. I was a fair-skinned Irish boy, after all. These days, even if I get an adequate amount of sun, I won’t get a sunburn, which I credit to the amount of water I drink.\n\nI must admit, I laughed a little when I read this. Not in a mean way, but in a “oh man, who’s saying what now” kind of way. In our culture today we seem to have a lot of celebrity experts. Sometimes they are right but many times they are wrong. It can lead to more than a few amusing eye-rolls.\n\nIs There Any Truth to Water Preventing Sunburn?\n\nWhile we agree that drinking plenty of water is a great part of a healthy diet, we haven’t seen any evidence that this works to prevent sunburn. Additionally, if you look at the sun protection recommendations from many medical authorities, none of them recommend drinking water as a way to prevent sunburn.\n\nNot convinced? Check out what the American Academy of Dermatology, the Center for Disease Control, the Mayo Clinic, the Cleveland Clinic, and the Skin Cancer Foundation all say about sun protection.\n\nPersonally, I can’t imagine going to the beach for a few hours with a jug of water instead of a bottle of sunblock. I can however imagine hitting the beach with both!\n\nSunscreen, Shade, Clothing and Time of Day Are the Real Factors\n\nSo what do you do to protect yourself from the sun? Well, there are a few things experts agree on.\n\nUse sunblock everyday. No matter the time of year or the type of weather, everyone gets UV exposure every day. Making sunscreen part of your daily routine is a great way to protect your skin. Seek shade. While we don’t advocate avoiding the sun, we do think commonsense approaches are wise. So if you are outside and able to play in the shade, it makes sense to do so. Cover up. Clothing and hats are your best friend. When you are out in the sun, use them to protect your skin. Some clothing even has a UPF rating which indicates how much protection you’ll get. Higher UPFs give higher protection. Avoid middle of the day sun – if you can. The sun’s rays are strongest between 10 am and 4 pm. If you have the choice, it’s best to do your outside work before or after this. Of course, we know that isn’t always practical so beware as best you can. Wear sunglasses. Not only does your skin need protection, but your eyes do too. Look for ones that are rated to block 99% - 100% of UVA and UVB rays. Don't use tanning beds. Ok, this one doesn’t relate directly to spending time outside but it’s definitely sage advice. There is no such thing as a safe tan. The US Food and Drug Administration (FDA), the Centers of Disease Control and Prevention (CDC), the Skin Cancer Foundation, the Melanoma Research Foundation, and the American Academy of Dermatology (AAD) all agree.\n\nMore Sun and Skin Care Info\n\nFor more on how to stay safe in the sun check out our Suncare Smarts articles and if you want to know more about skin care in general, check out our Skin Care posts.", "images": ["https://bat.bing.com/action/0?ti=4047826&Ver=2", "https://analytics.twitter.com/i/adsct?txn_id=nu4ef&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://www.facebook.com/tr?id=894958187269846&ev=PageView&noscript=1", "https://t.co/i/adsct?txn_id=nu4ef&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://www.blockislandorganics.com/Blog/Themes/BlockIslandOrganic/Images/Popup_Save15_Throbber.gif", "https://www.blockislandorganics.com/Blog/image.axd?picture=%2f2017%2f09%2ftom-brady.jpg", "https://www.blockislandorganics.com/BVModules/Themes/BIO/Images/Footer_CylosoftTopLogo.png"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Despite What Tom Brady Says, Drinking Water Does Not Prevent Sunburn", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "keywords": "education,skin care,sunburn,suncare smarts,sunscreen and sunblock,tanning", "description": "Tom Brady - yes, the famous Patriots quarterback - has a new book out. In it, he covers a lot including a suggestion that drinking water is a good way to protect your skin from sunburn. Um…can we just say no? Tom is a great quarterback but he is not a healthcare expert.", "author": "Will"}, "movies": [], "publish_date": 1506441600.0, "source": "https://www.blockislandorganics.com", "summary": ""}