{"url": "https://people.com/parents/lauren-conrad-baby-son-liam-exclusive-photos/", "text": "Former Hills star Lauren Conrad gets candid about marriage, motherhood and how she’s happier than ever. Subscribe now for an inside look at her journey, plus EXCLUSIVE first baby photos — only in PEOPLE!\n\nWorld, meet baby William “Liam” James.\n\nGet push notifications with news, features and more.\n\nLauren Conrad and her husband, lawyer William Tell, welcomed their first child on July 5 — and now, the Hills alum is sharing the story of her little bundle of joy — and his first photos! — exclusively with PEOPLE.\n\n“Before the delivery, I felt like I was getting ready for a blind date,” recalls Conrad, 31. “We considered doing the 4D ultrasound but then decided to wait. I just remember thinking he was so cute — and I was surprised by how tiny he was.”\n\n“I was convinced I was having a giant baby, to the point where I didn’t even buy newborn clothes — in my head he was 9 lbs.,” she says of baby Liam, who was born weighing 6 lbs., 14 oz.\n\nImage zoom Elizabeth Messina\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nConrad and Tell, 37, who tied the knot in a September 2014 sunset ceremony at a boutique winery in Santa Ynez, California, opted to find out the sex of their baby before he was born.\n\n“I don’t really love surprises,” explains Conrad. “I like to have all the information. And I was sharing my body with someone — so I wanted to know as much as possible about him.”\n\n“I always hoped I would have a boy,” she adds. “Boys are so fun. I was a tomboy, and I always play best with boys. When we found out, I was so excited.”\n\nAs for who Liam takes after in the looks department, Conrad says he’s “sort of a combo of both of us.”\n\n“He definitely looks like William,” she says. “But he’s still so tiny it’s hard to tell!”\n\nFor more on Lauren Conrad’s life as a new mom with husband William and son Liam, pick up this week’s issue of PEOPLE, on newsstands Friday\n\nImage zoom\n\nSo did she always know she was going to be a mom? Not exactly, she says.\n\n“In my early 20s I was open to having them or not having them. But after meeting William, I changed my mind,” she says. “I knew I wanted to have a family with him. But I didn’t want to do it right away.”\n\n“I’m crazy about Liam, but I never really got baby fever,” she adds. “We wanted to enjoy being married and to really be in the right space. We took our time, so it was something to look forward to.”\n\nRELATED GALLERY: Baby Boy Is on His Way! All of Lauren Conrad’s Cutest Bump Pics\n\nAnd so far, so good! The designer, author and lifestyle expert is savoring every moment as a first-time mom — and she’s not feeling “any pressure” to lose the baby weight. (“Spanx exist for a reason,” she notes.)\n\n“I feel so spoiled,” she says. “Liam is such a good baby. I’m sleeping three to four hours at a time. This morning I was up at 4 a.m. and I wasn’t even tired, so I cleaned the kitchen and did some cooking. William was like, ‘You’re crazy!’ “\n\nFROM PEN: Emily Maynard Johnson Admits She Was Ashamed to Stop Breastfeeding Her Third Son Early\n\nAnd the new mom has already established a special routine with her son.\n\n“His last nighttime feeding is right around when the sun comes up, so I sit and feed him and watch the sun rise,” she says. “He’s funny to watch — he makes really funny little expressions. I’m already stressing out because I want him to stay this tiny and I know he won’t. So I’m just trying to enjoy how itty-bitty he is.”\n\n“I was looking at him the other day, and I was like, ‘I understand now why people keep having babies!’ ” she adds. “We’ll probably have two. I think it’s best not to be outnumbered.”\n\nAt the end of the day, Conrad knows exactly what kind of mom she wants to be.\n\n“I want to be strong and teach him to respect women. The mother-son relationship is so important,” she says. “And I’m just excited to play again! I can’t wait to break out the finger paints. And I’m such a Disney nerd, so I get to watch those movies with someone who is seeing them for the first time.”\n\n\n\n“I worked hard to get here,” she adds. “It took a lot. And it makes me appreciate my life now and value the peacefulness. I’m really lucky. And I know that.”\n\n—With AURELIE CORINTHIOS\n\nPut your celeb and pop culture knowledge to the test and download PEOPLE and Zynga’s Crosswords with Friends!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Flauren-conrad-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg", "keywords": [], "authors": ["Aili Nahas"], "canonical_link": "https://people.com/parents/lauren-conrad-baby-son-liam-exclusive-photos/", "title": "Meet Lauren Conrad's Baby Son Liam: 'I'd Always Hoped I Would Have a Boy!'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,Lauren Conrad,News,Rollout,TV,William Tell", "news_keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,Lauren Conrad,News,Rollout,TV,William Tell", "description": "The Hills alum is sharing the story of her little bundle of joy — and his first photos! — exclusively with PEOPLE", "og": {"title": "Meet Lauren Conrad's Baby Son Liam: 'I'd Always Hoped I Would Have a Boy!'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/lauren-conrad-baby-son-liam-exclusive-photos/", "description": "Former Hills star Lauren Conrad gets candid about marriage, motherhood and how she’s happier than ever. Subscribe now for an inside look at her journey,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/parents/lauren-conrad-baby-son-liam-exclusive-photos/", "description": "The Hills alum is sharing the story of her little bundle of joy — and his first photos! — exclusively with PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/lauren-conrad-baby-son-liam-exclusive-photos/", "title": "Meet Lauren Conrad's Baby Son Liam: 'I'd Always Hoped I Would Have a Boy!'", "description": "The Hills alum is sharing the story of her little bundle of joy — and his first photos! — exclusively with PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fcover-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}