{"url": "www.inquisitr.com/4610219/brad-pitt-jennifer-aniston-reportedly-taking-second-chance-at-love/", "text": "Brad Pitt and Angelina Jolie’s mutual separation happened a year ago but the reports about their personal lives never stopped surfacing online. As all of Brad’s fans and followers know, before starting his high-profile affair with Angelina after working with her on Mr. & Mrs. Smith, the War Machine actor was happily married to Friends TV star Jennifer Aniston. There are now alleged reports that as Angelina is no more in Brad’s life, he is trying to give romance with former wife Jennifer Aniston a second chance.\n\nIt was earlier reported by the Inquisitr that it’s been more than 500 days since Brad Pitt was seen out in the public with his six children he has with Angelina Jolie. However, these alleged reports were later debunked by Gossip Cop.\n\nMost recently, In Touch magazine’s cover story allegedly claims that after parting ways with Angelina Jolie for good, Brad Pitt and Jennifer Aniston are taking a “second chance at love.” The tabloid’s issue teases how Jennifer is helping her ex-husband Brad in moving on from his ugly divorce from Angelina.\n\n“Brad’s conversations with Jen have helped him negotiate his new life as he’s getting divorced. He feels a deep connection with her. Brad would take a second chance at love in a heartbeat.”\n\nImage by Jason Merritt/Getty Images]\n\nJennifer Aniston met Brad Pitt in 1998 and the couple got married after two years of dating on July 29, 2000, in Malibu. The couple announced their divorce in 2005, and during their divorce proceedings, there were several speculations that Pitt got intimate with actress Angelina Jolie on the movie sets of Mr. & Mrs. Smith. However, the recent report further alleges that the former spouses have now reestablished their friendship and have even grown closer to each other.\n\nThe alleged insider revealed that after divorcing Jolie, Pitt’s conversation with his ex-wife Aniston has really helped him in moving on and finding a deeper perspective. The outlet’s source also stated that Pitt would never dream of ending Aniston’s happily married life with writer and director Justin Theroux.\n\nBrad Pitt has also come to the alleged realization that ending his marriage with Jennifer Aniston for Angelina Jolie was one of the biggest mistakes he did in his personal life, the report further claims.\n\n“Even if they can’t be together romantically, [Pitt] wants to work with his ex.”\n\n????...❤️✌️ A post shared by @justintheroux on Aug 5, 2017 at 4:23pm PDT\n\nAs of this writing, Brad Pitt and Angelina Jolie are trying to move on in their personal and professional lives. At the same time, Jennifer Aniston and her husband Justin Theroux are happily married, and as reported, she is not planning to go back to Brad Pitt. Furthermore, Gossip Cop debunked the recent claims and revealed that the entire report is nothing but a rumor about Brad, Angelina, and Jennifer’s personal lives.\n\n[Featured Image by Evan Agostini/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/11/brad-pitt-jennifer-aniston-marriage-pictures.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/brad-pitt-angelina-jolie-movie-together-mr-mrs-smith.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/4610219/brad-pitt-jennifer-aniston-reportedly-taking-second-chance-at-love/", "title": "Brad Pitt, Jennifer Aniston Reportedly Taking ‘Second Chance At Love’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}