{"url": "www.thesun.co.uk/tvandshowbiz/3452747/bella-hadid-cara-delevingne-kendall-jenner-kylie-jenner-new-york/", "text": "BELLA Hadid flashed some serious underboob in a tight crop top as she partied with model pals Cara Delevingne and Kendall Jenner in New York.\n\nThe famous models were joined by Kylie Jenner as they attended her rumoured boyfriend' Travis Scott's birthday bash at Cipriani in Soho.\n\n9 Bella Hadid flashed her underboob as she partied with Kendall Jenner and Cara Delevingne in New York Credit: Getty Images\n\n9 The trio of models were partying at rapper Travis Scott's 25th birthday in New York Credit: Getty Images\n\n9 Bella left little to the imagination in the sexy crop top from the Diesel Black Gold SS17 collection Credit: Splash News\n\nBella, 20, showed off her killer abs and gave onlookers an eyeful of her bust in the corset-style crop top from the Diesel Black Gold SS17 collection.\n\nShe paired the sexy top with matching high-waisted trousers in a tracksuit style material.\n\nMost Read in Tv & Showbiz TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs CENSORED! Myleene Klass shares X-rated message her boyfriend hid in her lunch beck home The Beckhams have not moved home during lockdown after accusations from fans PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre Exclusive KNEAD YOU HERE Paul Hollywood asks girlfriend of five months to move in & self-isolate\n\nThe supermodel, who is Gigi Hadid's younger sister, accessorised with nude suede boots, plenty of diamond rings and 90s style sunglasses.\n\nHer night out comes after she released a statement distancing herself from the disastrous Fyre Festival, which she was paid to promote back in December.\n\n9 The party marked Bella's first public appearance since releasing a statement distancing herself from the disastrous Fyre Festival which she had been paid to promote last year Credit: Splash News\n\n9 Kendall had also been paid to promote the festival has yet to comment on the controversy Credit: Getty Images\n\nShe shared a note on Twitter which read: \"Hey guys, I just wanted to address Fyre Festival...Even though this was not my project what so ever, nor was I informed about the production or process of the festival in any shape or form, I do know that it has always been out of great intent and they truly wanted all of us to have the time of our lives.\n\n\"I initially trusted this would be an amazing & memorable experience for all of us, which is why I agreed to do one promotion...\n\n9 Kendall and Kylie were seen holding hands as they left the swish bash Credit: Rex Features\n\n\"...not knowing about the disaster that was to come...I feel so sorry and badly because this is something I couldn't stand by, although of course if I would have known about the outcome, you would have all known too.\n\n\"I hope everyone is safe and back with their families and loved ones...xo.\"\n\n9 Kylie Jenner was also at the bash as she has been inseparable from Travis for the past few weeks Credit: MEGA\n\nHer pal Kendall deleted her promotional snap on Instagram but has not addressed the controversy.\n\nThe Victoria's Secret Angel also dressed to impress on Sunday night wearing tight leather trousers, a cheeky white tshirt that had the outline of breasts on the front and a sheer black cardigan.\n\nShe wore her hair in a loose bun and accessorised with bright lime heels.\n\n9 Kylie was seen leaving the party with Travis Credit: MEGA\n\n9 Travis celebrated turning 25 with his supermodel pals Credit: Getty Images\n\nKendall and Cara were pictured holding hands as they left the party with the British model going for a more casual look in jeans, a white tshirt, a beanie, blue shades and a shimmering coat.\n\nKeeping Up With The Kardashians star Kylie Jenner, 19, was also at the bash as she and Travis, 25, have been spending a lot of time together since she split from Tyga, 27.\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2017/05/dd-composite-bella.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.4 1\"%3E%3C/svg%3E"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/05/dd-composite-bella.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Elaine Mccahill"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/3452747/bella-hadid-cara-delevingne-kendall-jenner-kylie-jenner-new-york/", "title": "Bella Hadid flashes her underboob as she parties with Cara Delevingne and Kendall Jenner at Travis Scott’s birthday bash", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Bella Hadid flashes some serious underboob as she parties with Cara Delevingne and Kendall Jenner", "url": "https://www.thesun.co.uk/tvandshowbiz/3452747/bella-hadid-cara-delevingne-kendall-jenner-kylie-jenner-new-york/", "description": "BELLA Hadid flashed some serious underboob in a tight crop top as she partied with model pals Cara Delevingne and Kendall Jenner in New York. The famous models were joined by Kylie Jenner as they a…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/05/dd-composite-bella.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Kylie was seen leaving the party with Travis"}, "locale": "en_GB"}, "article": {"published_time": "2017-05-01T08:12:12+00:00", "modified_time": "2017-05-02T09:46:17+00:00", "publisher": 161385360554578, "tag": "Bella Hadid, Cara Delevingne, Kendall Jenner, Kylie Jenner", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Kylie Jenner was also seen at Travis Scott's birthday bash in Soho, New York", "keywords": "Bella Hadid, Cara Delevingne, Kendall Jenner, New York", "news_keywords": "Bella Hadid, Cara Delevingne, Kendall Jenner, New York", "twitter": {"text": {"title": "Bella Hadid flashes her underboob as she parties with Cara Delevingne and Kendall Jenner at Travis Scott’s birthday bash"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "PARTY PEOPLE", "headline": "Bella Hadid flashes underboob as she parties with Cara and Kendall at Travis Scott's birthday bash", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/05/dd-composite-bella.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/05/dd-composite-bella.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 3452747, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1493626332.0, "source": "http://www.thesun.co.uk", "summary": ""}