{"url": "https://www.cosmopolitan.com/style-beauty/fashion/a23724325/kate-middleton-meghan-markle-style-fashion/", "text": "We all know a hugely important aspect of Kate Middleton and Meghan Markle's royal roles is to look effing amazing while representing The Crown out and about in the modern world. But if you think they throw on any old outfit that looks good, then wow, are you wrong.\n\nNot only do they have to consider whether the colors, textures, and patterns they wear could honor or—eek!—offend whoever they're meeting on official royal business, they also have to think about whether those choices are on par with their Personal Brands.\n\nSo what do Kate's and Meghan's outfits actually say about who they are? Turns out, quite a lot. With the help of Dr. Anna Akbari, author and former professor at NYU and Parsons, who specializes in the sociology of style and self-presentation, Cosmopolitan.com decoded the secret messages the fashionable royals may be sending with their ensembles. Scroll on to get to know the Duchesses of Cambridge and Sussex—or, as I like to call 'em, Kate and Meg—on a whole new level.\n\nSome of Meghan's more conservative choices may mean that she still feels like an outsider.\n\nMeghan wears a matching skirt-set at Buckingham Palace during the Trooping the Colour ceremony in June 2018. Max Mumby/Indigo Getty Images\n\n\"Meghan's every style choice is under the microscope right now, and I think she knows that by making more conformist choices that are in line with traditional royal protocol, it will earn her greater internal clout,\" Dr. Akbari says. \"The research I've done on how individuals self-present in somewhat homogenous situations, be it corporate environments or whatever, is that if you already stand out—which certainly Meghan does as an American coming from Hollywood—you aren't looking to accentuate your differences as you try to be effective in your setting.\"\n\nDr. Akbari adds that those in this situation are typically the best-dressed people in the room (ahem, Meg's got that on lock), because they feel like they don't have leeway, and they're not looking to draw more attention to themselves. \"That seems to be Meghan's approach as she assimilates into the royal family. Wearing more dresses and skirt-sets, putting on the pantyhose—we really see her embracing a lot of these traditional markers of royal style.\"\n\nMeghan wearing pantyhose for Prince Charles’s 70th birthday party in London in May 2018. Chris Jackson Getty Images\n\nKate's early style established that she was totally comfortable in her new gig.\n\nKate Middleton and Prince William’s engagement announcement photo from November 2010. Getty Images\n\nAccording to Dr. Akbari, Kate Middleton's post-proposal and early marriage style indicated that she felt comfortable in her new surroundings. The navy dress by Issa that she wore for her November 2010 engagement announcement, for example, signaled that—blue is a traditional regal color, and the design itself was pretty sexy, with its fitted top and lower neckline.\n\nKate Middleton and Prince William on their wedding day in April 2011. Getty Images\n\nThe same could be said for her wedding dress. Though it could be called old-fashioned—her dress was a near-replica of Grace Kelly's 1956 gown—Kate's Alexander McQueen piece came off as young and sexy. Its fitted bodice, see-through elements, and plunging neckline help. Dr. Akbari thinks this choice represented her totally chill attitude going into her new job.\n\n\n\nMeghan's early looks sent a message that she wants to prove herself.\n\nMeghan Markle and Prince Harry’s engagement announcement photo from November 2017. Getty Images\n\nMeghan's November 2017 engagement announcement ensemble, while super sleek and fashionable, was a bit covered up and conservative. In case you forgot, she wore a white Line the Label coat closed over a green Parosh dress and neutral Aquazurra pumps. \"Prior to her engagement, we saw more of a Hollywood-chic aesthetic—artfully distressed with an eye on trends. This is a moment where we see a shift into royal formality. She knows there will be different expectations now that she's entered the family, and that transition is reflected in her style choices.\"\n\n\n\nMeghan Markle wears ripped jeans to the Invictus Games in Canada ahead of her engagement to Prince Harry in September 2017. Karwai Tang Getty Images\n\nHer wedding dress had the same vibe. Meghan's more understated, conservative Givenchy gown, with its higher '50s-era bateau-neckline and opaque fabric, could have been trying to \"demonstrate that she can take this new role seriously,\" according to Dr. Akbari.\n\nMeghan Markle and Prince Harry on their wedding day in May 2018. Getty Images\n\nKate's going for an ultra classic, super-approachable aesthetic.\n\nKate attends a global mental health summit in a lavender dress she’s worn out before in London in October 2018. Getty Images\n\nKate is probably always going to appear as the preppy, super colorful royal, wearing full skirts, cheery patterns, and coat dresses to formal engagements, and looking like she stepped out of a Ralph Lauren ad at casual appearances.\n\nKate wears casual pieces during a wilderness walk appearance in London in October 2018. Getty Images\n\nShe opted for this kind of aesthetic early on, as it is pretty timeless and hard to critique, says Dr. Akbari. \"She's mastered that look, and it suits her. Imagining Meghan Markle in the same style would feel forced—she's never been preppy, so it would be weird to see her fully embracing that.\"\n\nAdditionally, Dr. Akbari says her tendency to recycle outfits \"sends a message that she's real\" and relateable.\n\nMeghan's thing is sleek, sophisticated elegance.\n\nMeghan visits Sussex in a green monochrome look with a leather skirt in October 2018. Getty Images\n\nMeghan had to go in a different direction for her royal style, coming into the family with an already-established and well-documented trendy vibe. The look she goes for nowadays—a tendency to wear elevated, monochromatic separates, more pantsuits, and sleeker silhouettes, even when she's casual—is, for the most part, one we'd never see Kate undertake.\n\nMeghan wears one of her least-formal ensembles during a visit to Birmingham in March 2018. Getty Images\n\n\"[The public doesn't] associate those trends with Kate, but they're still timeless,\" Dr. Akbari says. \"With these choices, she seems to be saying, 'Maybe I can't bring my Hollywood hip style to Buckingham Palace, but that doesn't mean that I need to conform completely to my counterpart Kate.'\"\n\nWe'll see Meghan's style get even more fashion-forward as time goes on.\n\nKate has already established who she is on the world stage with her style, according to Dr. Akbari. While we may see subtle changes in the coming years, we know, for the most part, what to expect from her, and it's predictable. \"That's not a critique, by the way, and she shouldn't change that—it really works for her,\" says Dr. Akbari.\n\nKate and Meghan in coordinating white and blue looks at Wimbledon in July 2018. Karwai Tang Getty Images\n\nConversely, Meghan's aesthetic is expected to change over time—because she likes to play with fashion. \"We don't know yet where the arc of Meghan's style trajectory will go,\" says Dr. Akbari. \"My hunch is that eventually—I don't know if it will be this year or in the next few years—she'll find a way to continue to adhere to royal protocol while also infusing it even more with her own personal look and preference.\"\n\nApparently, this is called \"distinguished compliance,\" which is basically just a fancy term that means she has to, and wants to, demonstrate both to the royal family and the world that she \"gets it\" before she can truly experiment more with super edgy or trendy garments.\n\nMeghan Markle wears a black pantsuit with a silky blouse at the WellChild awards in London in September 2018. Jeff Spicer Getty Images\n\nWe've already seen her do that a little bit (when she's worn textures like leather and more bold silhouettes, like her pantsuits), and we'll most likely see more of it as she starts to feel less like an outsider and more like herself—albeit in princess form.\n\n\n\nFollow Rachel on Twitter and Instagram.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-meghan-markle-hiding-pregnancy-1539624296.gif?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=1.00xw:1.00xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Rachel Torgerson", "I'M Cosmopolitan'S Fashion Editor You", "Can Follow Me On Instagram At"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/fashion/a23724325/kate-middleton-meghan-markle-style-fashion/", "title": "What Meghan Markle and Kate Middleton's Style Choices Secretly Mean", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Fashion Sociologist Explains the Meaning Behind Kate and Meghan's Royal Style", "description": "Whoa: There's much more to their clothing choices than meets the eye.", "url": "https://www.cosmopolitan.com/style-beauty/fashion/a23724325/kate-middleton-meghan-markle-style-fashion/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-10-23 04:46:49", "published_time": "2018-10-18 04:27:00", "section": "Style", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "What Meghan Markle and Kate Middleton's Style Choices Secretly Mean - Kate and Meghan's Fashion Decoded", "description": "Fashion sociologist Anna Akbari dissects the differences between Meghan Markle's and Kate Middleton's different takes on royal style and her conclusion might shock you.", "keywords": "kate middleton, meghan markle, royal style, royals, celebrity style, kate middleton style, meghan markle style", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=0.502xw:1.00xh;0.498xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,fashion", "sailthru.date": "2018-10-18T16:27:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kate-meghan-style-compare-1539716919.gif?crop=0.502xw:1.00xh;0.498xw,0", "sailthru.socialtitle": "A Fashion Sociologist Explains the Meaning Behind Kate and Meghan's Royal Style", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1539808020.0, "source": "https://www.cosmopolitan.com", "summary": ""}