{"url": "https://www.etonline.com/royal-wedding-countdown-new-details-emerge-on-meghan-markle-and-prince-harrys-bridal-party-100970", "text": "Meghan Markle and Prince Harry will be tying the knot at St. George's Chapel this spring, and each and every week, ET will be breaking down all the latest updates as they gear up for their May 19 nuptials.\n\nBIGGEST NEWS OF THE WEEK\n\nFans have eagerly been waiting to hear which celebrities scored an invite to what's sure to be the biggest event of the year, and this week, we learned that one of Meghan's closest pals, Priyanka Chopra, will for sure be in attendance. \"Yes I'm going,\" the Quantico star confirmed during her guest appearance on Live With Kelly and Ryan on Thursday. \"But that's all.\"\n\nChopra told People, however, that she is \"not a bridesmaid,\" despite all the speculation in recent months that she would be in the bridal party.\n\nPriyanka Chopra Jokes She Was 'Scammed' Into Talking About Meghan Markle & Prince Harry's Wedding This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Priyanka Chopra Jokes She Was 'Scammed' Into Talking About Meghan Markle & Prince Harry's Wedding\n\nAs for the groom, Prince Harry has finally picked his Best Man, and, unsurprisingly, it's Prince William! The Duke of Cambridge joked earlier this year that he was expecting to fulfill the role, but his brother had yet to ask him. We're happy to report that Harry made it official on Thursday.\n\n\"The Duke of Cambridge is honored to have been asked, and is very much looking forward to supporting his brother at St. George’s Chapel,\" Kensington Palace shared in a statement.\n\nMeanwhile, Meghan has been busy wrapping up all the last minute details ahead of her and Harry's nuptials. A source told ET on Tuesday that Amal Clooney's go-to hairdresser in London, Miguel Perez, is expected to style Meghan's tresses on her big day. He's currently a stylist at Salon Sloane, whose world-leading hairstylists have worked on everyone from Lindsay Lohan to the Victoria's Secret Angels.\n\n\"Yes, I do Meghan's hair,\" Miguel reportedly told The Mail this week. \"I do Amal's, and Meghan is friends with her. I also do George [Clooney]'s, I do the whole family. Amal put Meghan and me together when she moved here [to London]. I do her color, her cut and her styling.\"\n\n\"We have talked about it [the wedding] and we have a plan,\" he continued. \"I can't say any more, but we know what we're doing.\"\n\nMeghan and Harry also chose the music for their wedding service this week, and it will include a full orchestra. St. George's Chapel's Director of Music, James Vivian, will direct the music, which features a selection of choral groups, soloists and musicians, Kensington Palace revealed on Tuesday.\n\nWEDDING COUNTDOWN\n\nSo, how many days until the royal wedding? Meghan and Harry will officially be saying \"I do\" in:\n\nGetty Images\n\nOUT AND ABOUT\n\nThe lovebirds took a brief break from wedding planning early Wednesday morning to represent the royal family at the Anzac Day Service in London, England.\n\nAnzac Day is a day of remembrance for soldiers from Australia and New Zealand who've served and died in wars, conflicts and peacekeeping operations. Both countries are a part of the Commonwealth, of which Queen Elizabeth II serves as leader.\n\nGetty Images\n\nROYAL RUMOR ROUNDUP\n\nAs we anxiously wait to see what Meghan's wedding dresses will look like, there's also talks about what tiara she will be gifted with. There's a good chance that the bride-to-be will debut a brand-new tiara as she walks down the aisle, royal jewelry expert Ella Kay of the blog The Court Jeweler told Good Housekeeping earlier this week.\n\n\"The younger son's wife getting a new tiara would be the precedent,\" she explained. \"Prince Charles might buy her a tiara.\"\n\nPrevious royal brides like Sarah, Duchess of York, and Sophie, Countess of Wessex, received major bling on their wedding day. But, the circumstances are different for Kate Middleton, who wore the Cartier Halo tiara for her wedding, since she will eventually become queen, and will \"borrow\" tiaras in the meantime.\n\n\"Usually what happens is you get allotted your tiaras,\" Kay explained. \"Like Camilla [Duchess of Cornwall] has three, but they're all technically loaners that not anyone else wears.\"\n\nRATHER REGAL LOOKS\n\nGetty Images\n\nMeghan outdid herself with not one, but two regal looks in one day.\n\nWhile stepping out to the Anzac Day service, the 36-year-old brunette beauty donned an elegant gray Smythe coat with a black dress underneath, Sarah Flint Jay heels, a Gucci Dionysus bag, a red poppy pin and a statement wide-brimmed, floppy hat. This type of hat is much simpler than the fancy fascinators and pillbox hats we typically see on royals like Queen Elizabeth II and the Duchess of Cambridge, but we love that Meghan put her own unique spin on the trend.\n\nFor her second look of the day, Meghan opted for a more formal ensemble. The bride-to-be arrived to Westminster Abbey in a black beret embellished with a dragonfly from milliner Philip Treacy, which she pulled off perfectly by pairing it with a midi-length Emilia Wickstead dress suit and a Jimmy Choo box clutch.\n\nSERVIN' UP SUITS\n\nUSA Network\n\nSadly, this section of our weekly royals countdown ends this week, as Meghan appeared in her very last episode of Suits on Wednesday.\n\nIn case you missed it, we recapped the full finale (HERE).\n\nYou had a good run, Rachel Zane.\n\nSPARKLE LIKE MARKLE\n\nHow Meghan Markle's Makeup Look Has Changed Since Her Engagement to Prince Harry This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart How Meghan Markle's Makeup Look Has Changed Since Her Engagement to Prince Harry\n\nEarlier this week, ET caught up with one of Meghan's former makeup artists, Spencer Barnes, who opened up about her evolving beauty looks and how when he was still doing her makeup, Meghan always requested a natural look.\n\n\"She loves beautiful skin, to start with, and she has the most gorgeous complexion,\" Barnes mused. \"It's that soft, caramel. Her mixed heritage makes her an exotic beauty of beauties. Her chocolate eyes, the way her eyes light up when she smiles, I love her smile, her teeth and her lips. And then her perfect brows.\"\n\n\"Whenever I'd work with her, she'd like to highlight her fresh, radiant skin,\" he continued. \"We'd do a very glowing, fresh-faced skin. We'd use earthy tones, colors that enhanced her natural beauty, rather than a lot of obvious color choices, like purple, green or blue. We'd stick with earthy tones -- peaches, golds, browns -- a lot of rich, warm tones and that really flattered her. It helped her just look radiant and fresh.\"\n\nSee more in the video and in our exclusive article (HERE).\n\nLOL OF THE WEEK\n\nPrince George and Princess Charlotte arrive at St Mary’s to meet their little brother. pic.twitter.com/rfX9rsdJhU — Kensington Palace (@KensingtonRoyal) April 23, 2018\n\nSpectators couldn't get enough of Princess Charlotte this week. While on her way to meet her new baby brother, the adorable 2-year-old stole the show when she smiled and waved to photographers on her way into the hospital, proving she's already an expert at royalty.\n\nNEXT IN LINE\n\nJack Taylor/Getty Images\n\nWelcome to the royal family, Prince Louis of Cambridge!\n\nKate Middleton and Prince William welcomed their third child, Louis Arthur Charles, on Monday, and just hours after giving birth, the Duchess of Cambridge and her husband stepped out to pose for pictures outside St. Mary's Hospital before making their way back to Kensington Palace. Kate channeled Princess Diana in a stunning red Jenny Packham dress, cradling her precious baby boy with William by her side.\n\nToby Melville - WPA Pool/Getty Images\n\nBut there was no down time for the new dad. William joined Harry and Meghan at the Anzac Day Service on Wednesday, and also attended the opening of the Greenhouse Sports Centre in London one day later with his brother. Hopefully William can catch up on some rest and family time this weekend!\n\nFor now, that's a wrap on this week's royals update. Let us know on Twitter (@desireemurphy_ and @lizcalvario) what other regal news you'd like us to cover in the future, and be sure to join us next week for another roundup!\n\nIn the meantime, keep up with all of ET's coverage of the royal wedding as we count down to May 19.\n\nRELATED CONTENT:\n\nSerena Williams 'Couldn't Be Happier' For Meghan Markle Ahead of the Royal Wedding (Exclusive)\n\nMeghan Markle Expected to Use Amal Clooney's Hairstylist for Royal Wedding\n\nRoyal Wedding Countdown: Meghan Markle and Prince Harry Say 'I Do' in One Month\n\nHow Meghan Markle Might Channel Amal Clooney at the Royal Wedding This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-04/prince_william_prince_harry_gettyimages-951562040.jpg?itok=jbTRDxB6", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-11/1280_suits_s7_meghan_markle_patrick_j_adams.jpg?itok=PrbRwl6T", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-04/meghan_markle_getty.jpg?itok=lynZ2LRB", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-04/prince-william-meghan-markle-prince-harry-gettyimages-951075998.jpg?itok=st3R8FJm", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-04/z_markle_22.jpg?itok=H3qV1x0j", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-04/gettyimages-950359102.jpg?itok=UZnWOHfP", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=hRz_zhpQ", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/meghanharry.jpg?h=827f73f4&itok=QSE_OjgD"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "keywords": [], "authors": ["Desiree Murphy", "Liz Calvario"], "canonical_link": "https://www.etonline.com/royal-wedding-countdown-new-details-emerge-on-meghan-markle-and-prince-harrys-bridal-party-100970", "title": "Royal Wedding Countdown: New Details Emerge on Meghan Markle and Prince Harry's Bridal Party", "meta_data": {"article": {"opinion": "false"}, "title": "Royal Wedding Countdown: New Details Emerge on Meghan Markle and Prince Harry's Bridal Party | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/royal-wedding-countdown-new-details-emerge-on-meghan-markle-and-prince-harrys-bridal-party-100970", "title": "Royal Wedding Countdown: New Details Emerge on Meghan Markle and Prince Harry's Bridal Party", "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "title": "Royal Wedding Countdown: New Details Emerge on Meghan Markle and Prince Harry's Bridal Party", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍  and Liz Calvario‍", "url": "https://www.etonline.com/royal-wedding-countdown-new-details-emerge-on-meghan-markle-and-prince-harrys-bridal-party-100970", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW"}, "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, News, Meghan Markle, Prince Harry, Royal Wedding", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}