{"url": "https://hauteliving.com/2016/11/sean-penn-talks-haiti-humanitarianism-and-hollywood-2/623784/", "text": "If Sean Penn could offer up one piece of universal advice, it would probably be ‘Don’t believe everything you read.’\n\nIf you assumed this was in reference to how he’s portrayed in the press, you’d be partially correct. It’s more than that though: the award-winning humanitarian and two-time Oscar-winning actor would also be alluding to the public perception of Haiti, a place he has personally invested his time and finances in, and his attention to, for the past six years. After an earthquake ravaged the Caribbean country in 2010, he founded J/P Haitian Relief Organization (HRO), which began as an emergency relief organization of 32 Americans. It has since expanded to a rank of nearly 200—most of whom are Haitian—with a goal of turning over the previously-built medical, educational and community development centers entirely to the Haitian people. Despite all the progress he’s made, the country is far from escaping its reputation as the poorest country in the western hemisphere, but Penn won’t bow out until the job is done. “There was a commitment that we made to the country, and it’s just unfinished business, I suppose. That’s why we’re still here.”\n\nThere’s no doubt that the 56-year-old icon has done—and continues to do—more than his part to help Haiti escape its vicious cycle of poverty and insecurity. However, the country’s ‘Open for Business’ slogan isn’t even close to being true right now, especially in the wake of the damage Hurricane Matthew inflicted upon the country’s southern region, destroying several villages and killing more than 800 people. Penn, however, places blame on more than Mother Nature. “[Haiti] has been very close to staying open for business, and then it gets thrown back for two main reasons.” He notes that one is because the country’s leaders and its wealthy residents seem to be overinvested in the comfort zone of a system that doesn’t allow for export, and demands that the country “be a slave to the poor.” The other, more pressing problem in his eyes is the media: “[Members of the press have] been so incredibly irresponsible and uninformed in their reporting on Haiti, politically,” he says, adding, “I think that a four-day visit is a lot more damaging than no visit at all. There’s kind of an impatience with understanding culturally [and politically] what goes on.”\n\nThough he isn’t a fan of media in general, he’s quick to praise Anthony Bourdain’s early coverage of the nation on his food and travel reality show, No Reservations. The celebrity chef and TV personality turned what could have been a frothy segment on Haiti’s cuisine and culture into an insightful look at its 2011 climate. Penn filmed a small segment for the series and, after it aired, took himself out for a meal in the nation’s capital, Port-au-Prince. “I remember going into a restaurant that night and people had seen [the piece]. Everyone was saying, ‘Finally, somebody got Haiti,’” he recalls.\n\nSomebody besides him, that is to say. Because what started off for Penn as a two-week trip to “lend a hand” distributing pain medications like morphine and ketamine to trauma centers turned into a nine-month pilgrimage. Bottom line: he wanted to do some good, and he wanted to be close enough to his daughter Dylan and son Hopper that, if something serious happened back home in Los Angeles, he’d be a quick plane ride away from the US. “Now, some might say, ‘Well, why not stick to the United States [if you want to do some good]?’” he notes. “It really just happened this way: once I got to Haiti, like so many other people, I fell in love with it—the people there, the possibilities that is has.”\n\nHe also believes that the United States has a “sacred debt” to the Haitians in order to correct some of the mistakes it made in the past—a debt owed, if you will—and that it really pays to get the country out of trouble for the first time and help provide secure footing. “It’s not going to be an overnight process—nobody ever said it would be—but I think that the people are ready to take care of themselves, and that’s when things change.”\n\nAnd change it will be a-coming in a very, very big way. In August, Penn and J/P HRO announced their participation in Haiti Takes Root, an ambitious, long-term commitment from both the Haitian and French governments, as well as billionaire Sean Parker via The Parker Foundation. The ten-year, $300 million initiative seeks to repair the country from within by increasing technical expertise and strengthening environmental governance. The goal is to improve government relations and both ecotourism and environmental legislation. Needless to say, it’s a pretty ambitious undertaking, but Penn and his pals are up to the challenge.\n\n“A powerful consortium of commitments have been made from the French government, to the Haitian government, to many international NGOs, and of course the Parker Foundation,” he says of the collaboration. “[Sean Parker] signed on as the piper. He’s an extremely generous philanthropist and I knock wood that things are going well for him [in his other philanthropic ventures, including The Parker Institute for Cancer Immunotherapy] because he’s really bold. He is a disrupter and I love him.”\n\nOne might say that Penn is somewhat of a disrupter himself—though, quite humbly, he dismisses the praise. “[The initiative] hasn’t seemed to be disruptive yet, but I think we’ve gotten people coming on board who have mutual concerns and a lot of support [for the cause].” He pauses a beat, and seems to be almost speaking to himself when he says, “The only thing is that we’ve got to get it right.”\n\nEconomically, the country is in severe need of agro-reforestation but, luckily, Penn is up for the challenge. He’s got big plans for Haiti—including a complete restructure of the country’s landscape to enhance its value as an ecotourism destination. That said, he realizes that they need to keep it simple to start with. “You can’t forget to have exportable produce, but you have to have good roads first because, if you don’t, the produce is going to get bruised all the way to the market. There are a lot of pieces to this puzzle and it’s going to take a lot of investment.” He adds, “If I’m talking to the people of the United States of America, [I’d say that] we have made a tremendous investment and we have to finish it. It’s a call to humanity, it’s a call on behalf of our neighbor, to pick a country up out of poverty and put it [in a position to feel] pride. That’s the call to action.”\n\nREBELING AGAINST ADVICE + PARTY PLANNING FOR A CAUSE\n\nThe best advice Sean Penn could offer, for the record, isn’t the same thing as the best advice he’s ever been given—advice which, in his true contrary fashion, also happens to be the best advice he didn’t take.\n\n“[Someone told me,] ‘Don’t stay more than three months in a disaster zone without taking a couple of weeks off.” But, no, Penn didn’t take a few weeks off, or even just stay for a few months—he stayed for nine… months… straight. “I made the mistake of not taking that advice,” he admits with a rueful smile. “I think I went a little kooky.”\n\nJust chalk it up to part of his charm. However, by living in Haiti for so long, he got to know the people—the rich and the poor, the women and men, the rural and urban dwellers. He educated himself, he listened, and he learned. “[Once you] start to get a feel for the place, [you] know you’ll never really know the place,” he shares. “[You] know that you’re going to have to use your best instinct[s] about who to trust, who to learn from, who to question, and who to challenge and be challenged by. It’s a long process, but we’ve had a lot of success.”\n\nPart of the reason for that success is that he was able to let go, to delegate, to cede control. “At a certain point, I stopped calling the shots,” he explains. “I had shot-callers that were living the life, that were Haitian. Like anything else, I had to develop good relationships and trust them.”\n\nTrust isn’t something Penn gives easily or quickly, but something he chooses pragmatically, at least in his business dealings. As the evidence of Haiti Takes Root should convey, he’s a ‘big picture’ kind of guy. He doesn’t have time to sweat the small stuff; he needed to build a team on the ground who cared.\n\n“I always joke around because here I have a lot of young volunteers who are definitely what you’d call humanitarians. The daily compassion, weeping at deaths of everybody who had died; I just had no time to do that.”\n\nThis doesn’t mean Penn is unfeeling, or cold, or whatever else you would want to call him: his passion for Haiti and its people is genuine. In fact, he cares so much that he almost seems to go into another zone when talking about his work there. The intensity you often see him portray onscreen is 100 percent real. “I’m a facilitator, so I’m not inclined to get to know everybody intimately,” he admits, adding, “I wanted to have a T-shirt that said, ‘Tell it to the humanitarian.’\n\nThe smirk with which he delivers this piece of bluster is pure Penn. True, he might not always be warm and fuzzy, but there’s no disputing the fact that this guy is the very embodiment of a philanthropist. In fact, the Oxford English Dictionary describes a humanitarian as “a person who seeks to promote human welfare.” Sorry, Seany, but you fit the bill.\n\nSeriously though, one of his best ‘big picture’ ideas is to bring people together with music. Each year, guests know they’re in for some world-class entertainment at J/P HRO’s annual charity gala, Help Haiti Home. This is in addition to the ethereally-decorated room, a gourmet dinner, star-studded crowd with wall-to-wall celebrities such as Johnny Depp, Chris Hemsworth and Gwyneth Paltrow and big-name philanthropists like Marc Benioff and Sean Parker, as well as the be-all, end-all of auctions with items up for grabs from masters like Banksy and Jeff Koons.\n\nSome might say that Penn has the cushiest gig while putting together the gala: his sole involvement is being the guy who picks the band. And, when you’re friends with some of the biggest icons in entertainment, that’s not hard—which is why everyone from Coldplay’s Chris Martin and the Red Hot Chili Peppers to U2 and even ex-wife Madonna has performed. Never mind that his event competes with all the hoopla of Golden Globes week—he has built it, and Penn’s disciples do come.\n\nWhile he can’t reveal who this year’s entertainment will be, he informs us that the gala—which will take place on January 7—has been renamed Haiti Rising, mostly because Haiti is figuratively in a different place now. Since its relocations mandate has been achieved and the country is looking towards its next chapter, the gala’s name is meant to convey its progress.\n\nStrategically, its moniker will also reflect the still-pressing need for financial contributions. Its word tense is telling, after all: it is a country on the rise, but it has not yet peaked.\n\n“The needs are different, the resources—or lack of thereof—are different,” Penn says. “People have to understand that, [although Haiti faded from] the headlines, there’s not big government grants going out there. You might have gotten a lot of your sectors financed on a multi-million dollar grant in the first couple of years after the earthquake, but it’s almost entirely dried up. Everything we do is from private donations at this stage.”\n\nThose donations are in dire need this year, and the reason isn’t one that Penn is pleased about. “There’s been a change and it isn’t good news,” he notes grimly. “I’ve said every year at the event, ‘Come. Come see Haiti.’ I knew that I could say that and people would be safe… but I can’t say that this year.\n\n“We’ve had many foreigners killed, shot and kidnapped,” he continues quietly. “There’s a lot of political instability. Now, that doesn’t mean you can’t be safe again in Haiti. Of course I feel safe there. But, at large, I would not be someone to recommend it right now, and that’s a terrible thing.”\n\nHe’s confident that things will improve but, again, it will take time… and finances. “It’s going to change, it’s going to be OK, but it’s not off the hook,” he notes, adding that he and his team are hell-bent on raising funds for Haiti.\n\n“We’re saying, ‘Look. Here’s the value of what we’ve been doing, and here’s the color of change in that now. Here’s what we need now that’s different [from our former needs]. Here’s what we want to celebrate that’s different. I just told you a piece of bad news, but it’s not all bad.’”\n\nHis goal is to make everyone see the good in his cause, and his star-studded, sold-out event attended by some of the richest and most famous people in the world is the perfect platform. “I know how much we need to raise every year and [if we don’t raise it], people are going to pay a huge price in Haiti. I feel a lot of pressure, but, knock wood, we’ll continue to have great support.”\n\nIf he had one gripe it’s that, in his opinion, the same ten people are the ones giving over and over again. Sure, in 2015 and 2016, Help Haiti Home raised $6 million and $7 million, respectively, but it baffles Penn that, among a crowd that has so much, most seem to give so little.\n\n“There are a few extraordinary people that come, but then you have a room that is full mostly of people that are not giving anything. They eat, stargaze and watch the band but, honestly, I don’t think there’s a person in that room that can’t afford $25. I always wonder about that.”\n\nHAITI IS THE FOCUS, BUT HOLLYWOOD IS STILL THERE\n\nThroughout his career, Penn has been called many things—not all of which were positive. But, then, this is Hollywood in the digital age. Everyone’s a critic.\n\nIf we’re talking about the good stuff—and we are—there’s a lot. His humanitarianism is the most obvious. In addition to his work with Haiti, he was fully hands-on in the relief effort post-Hurricane Katrina. He’s received several substantial honors, including being named Ambassador at Large for Haiti in 2012 and being presented with the 2012 Peace Summit Award at the 12th World Summit of Nobel Peace Laureates.\n\nBut Penn, a longtime activist and promoter of civil rights, has always been one to stand up for his beliefs. In 2002, he penned a prescient open letter, published in The Washington Post and The New York Times, to President George W. Bush against the planned invasion of Iraq. Furthermore, he traveled to Baghdad and Tehran in 2002 and 2003 to report for the San Francisco Chronicle. He has interviewed Venezuelan President Hugo Chavez and Cuba’s President Raul Castro for The Nation, the latter of which was Castro’s first-ever interview with a foreign journalist. In 2013, Penn also played a vital role in getting wrongfully imprisoned American entrepreneur Jacob Ostreicher released from a Bolivian prison, for which he was honored by the Aleph Institute in 2015. Plus, no one can forget his most recent effort, a secret interview for Rolling Stone with Mexican drug lord Joaquin ‘El Chapo’ Guzman.\n\nThis is a guy you can peel like an onion, layer after layer after layer. And, yes, he’s still the Hollywood icon—a five-time Academy Award-nominated actor, taking home the coveted Best Actor trophies for Clint Eastwood’s Mystic River in 2004 and Gus Van Sant’s Milk in 2009, who has also directed five feature films, including the critically-acclaimed Into the Wild, Indian Runner and The Pledge. (And those are just the highlights; it would actually take pages to cover all that Penn has done since he began his career with the 1981 film, Taps.) This fall, he begins shooting The Professor and the Madman, directed by Farhad Safinia—another unprecedented first, given that this film allows him to star alongside Mel Gibson. The two have been talking about doing the film, which is based on Simon Winchester’s 1998 book of the same name, for 12 years. Penn will play ‘Madman’ Dr. W.C. Minor in this true story of the creation of the Oxford English Dictionary, a man who submitted more than 10,000 entries to the project as an inmate at an asylum for the criminally insane to Gibson’s OED founder, Professor James Murray.\n\nThough there’s been a lot of hype and discussion about the project, Penn is keeping mum. “We just didn’t [work together before],” he says. “I don’t know why. [But I took the role because] it’s a great project, I get to work with Mel and it’s a beautifully written script.”\n\nHe’s far more vocal on his thoughts regarding the upcoming presidential election, expressing his preference to Stephen Colbert on The Late Show: “Either you can […] go out and vote in a very big way for someone like Hillary Clinton—who you can then challenge and support, which is the only way that a president can have any success—and you stick it out for four years,” he says, “Or we can just masturbate our way into hell with a guy who looks like the only blonde magician.”\n\nWhile his opinionated vote isn’t surprising, Penn is a man whose overall actions still are. He uncharacteristically showed up to present at the pop-centric iHeartRadio Music Festival in Las Vegas this September, then popped up on several talk shows out of the blue to tout a free audiobook, Bob Honey Who Just Do Stuff, by a mysterious author named Pappy Pariah—who may or may not be Penn himself in disguise. The point is, he might be a humanitarian and award-winning actor, but he’s still a rebel and all-around badass who does exactly what he wants for reasons that, though they might not make sense to others, always, always have a purpose for Penn.\n\nBut has one facet of his personality hurt another? Has his ‘rebel without a cause’ persona of the past harmed the actual present-day rebel with one? Penn doesn’t know and, quite frankly, he doesn’t care. “I don’t read anything about myself in current tense, but I’m aware of stuff,” he admits. “I’m aware of extremes. I’m always surprised by anything very positive or anything very negative.\n\n“I can imagine, based on things I’ve heard about myself, that nobody would show up at [my] damn event because of my involvement, you know?” he continues. “I can imagine that and, yet, people come out. I put one foot in front of the other, and it is what it is.”\n\nWhile the jury’s still out on whether public perception has helped or hurt him, his celebrity status has only benefitted his cause. What’s more, he feels it’s a civic duty to affect change if you have the platform to stand on. “If you’re in the acting or film business, where your major job is to share things, then you ought not to be [in the business] if you don’t,” he says.\n\nStill, truth be told, he doesn’t really dig the ‘philanthropist’ label—or any label, for that matter. “It’s all just one thing,” he says. “It’s every day, putting your feet in your pants. It’s acting and working in Haiti. It all feels like, for me, the same job. It’s a really lucky life and a really fortunate one, but it’s all just life to me.”", "images": ["https://hauteliving.com/wp-content/uploads/2016/11/Pitbull77-357x238.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/CR-32-450x270.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/KULCBD-ANTIAGING-MOISTURIZER2-08-357x238.jpg", "https://cdn1.hauteliving.com/wp-content/themes/rtpanel/img/icon-twitter.jpg", "http://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.06.58-AM-628x800.jpg", "https://hauteliving.com/wp-content/uploads/2020/01/1-112-450x270.jpg", "https://hauteliving.com/wp-content/uploads/2020/02/CVR1_MORIMOTO_MIA-245x294.jpg", "https://hauteliving.com/wp-content/uploads/2020/03/CVR1_ROBINSON-CANO_NY-245x294.jpg", "https://cdn1.hauteliving.com/wp-content/themes/haute-living-2014/img/2014/haute-living-logo-2014.png", "https://hauteliving.com/wp-content/uploads/2020/02/MG_7658-copy-450x270.jpg", "https://cdn1.hauteliving.com/wp-content/themes/haute-living-2014/img/2014/cities-dropdown-arrow.png", "https://cdn1.hauteliving.com/wp-content/themes/haute-living-2014/img/mail-envelope.png", "https://hauteliving.com/wp-content/uploads/2020/04/1-37-357x238.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/1-37-450x270.jpg", "https://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM-840x512.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/1-33-450x270.jpg", "https://cdn1.hauteliving.com/wp-content/themes/haute-living-2014/img/2014/haute-living-logo-mobile.jpg", "https://hauteliving.com/wp-content/uploads/2019/12/1-2102-450x270.jpg", "https://cdn1.hauteliving.com/wp-content/themes/rtpanel/img/icon-mail.png", "https://hauteliving.com/wp-content/uploads/2019/08/Eva_Jun2019_0215B_flat-400x280.jpg", "https://hauteliving.com/wp-content/uploads/2020/03/Aaron_Paul_Couch-400x280.jpeg", "https://hauteliving.com/wp-content/uploads/2020/04/JIllian-MIchaels_16_Lifestyle_Wall_1026-r-Photo-Credit-Don-Flood-400x280.jpg", "https://hauteliving.com/wp-content/uploads/2016/11/14138745_1385709901443326_5704909361823215445_o-357x238.jpg", "https://hauteliving.com/wp-content/uploads/2020/02/85B8074_25m_RGB-400x280.jpg", "http://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM-787x800.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/1-33-357x238.jpg", "https://cdn1.hauteliving.com/wp-content/themes/rtpanel/img/icon-facebook.jpg", "https://hauteliving.com/wp-content/uploads/2020/03/CVR1_AARON-PAUL_LA-1-245x294.jpg", "https://hauteliving.com/wp-content/uploads/2019/09/0O9A7840-450x270.jpg", "https://www.facebook.com/tr?id=573771463351996&ev=PageView\r\n&noscript=1", "https://cdn1.hauteliving.com/wp-content/themes/haute-living-2014/img/loader.gif", "https://hauteliving.com/wp-content/uploads/2020/04/CR-32-400x280.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/89744559_574216889842591_5937080303966490666_n-1-357x238.jpg", "http://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.06.28-AM-732x800.jpg", "https://hauteliving.com/wp-content/uploads/2020/04/1-27-450x270.jpg"], "top_img": "https://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM-840x512.jpg", "keywords": [], "authors": [], "canonical_link": "https://hauteliving.com/2016/11/sean-penn-talks-haiti-humanitarianism-and-hollywood-2/623784/", "title": "Sean Penn Talks Haiti, Humanitarianism and Hollywood", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0", "bitly-verification": "3755604ec434", "description": "Sean Penn is a rebel with a cause, and that cause is devoted to Haiti. Here, Haute Living sits down with the star to discuss Haiti and Hollywood.", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Sean Penn Talks Haiti, Humanitarianism and Hollywood", "description": "Sean Penn is a rebel with a cause, and that cause is devoted to Haiti. Here, Haute Living sits down with the star to discuss Haiti and Hollywood.", "site_name": "Haute Living", "updated_time": "2016-11-03T20:16:58-04:00", "image": {"identifier": "https://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM-840x512.jpg", "width": 1366, "height": 729}}, "article": {"publisher": "https://www.facebook.com/hauteliving/", "tag": "Sean Penn", "section": "Cover Story", "published_time": "2016-11-03T20:16:19-04:00", "modified_time": "2016-11-03T20:16:58-04:00", "market": "Los Angeles, National"}, "twitter": {"card": "summary_large_image", "description": "Sean Penn is a rebel with a cause, and that cause is devoted to Haiti. Here, Haute Living sits down with the star to discuss Haiti and Hollywood.", "title": "Sean Penn Talks Haiti, Humanitarianism and Hollywood", "site": "@hautelivingmag", "image": "https://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM.jpg", "creator": "@hautelivingmag"}, "thumbnail": "https://hauteliving.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-01-at-11.07.18-AM.jpg"}, "movies": [], "publish_date": 1478218579.0, "source": "https://hauteliving.com", "summary": ""}