{"url": "https://www.vulture.com/2018/06/dietland-julianna-margulies-wig.html", "text": "Julianna Margulies. Photo: Patrick Harbron/AMC/AMC Film Holdings LLC. All Rights Reserved.\n\nIf you are a reasonable human person, your first reaction upon seeing Julianna Margulies in Dietland was to shout “wig!” and so, after doing just that, we decided to investigate just what was going on with her hair. On the AMC series, based on Sarai Walker’s book, the naturally curly- and raven-haired Margulies plays Kitty Montgomery, a fearsome magazine editor with a distinctive flame-red do. The hair makes Margulies even more intimidating than usual, especially when playing against Joy Nash’s Plum Kettle. Ahead of the show’s Monday premiere, Vulture got on the phone with Dietland’s head of hair Sarah Hindsgaul to learn everything we could about Margulies’s new look.\n\nIt (almost) matches Kitty’s hair in the book\n\nKitty was always going to be a redhead. At a Vulture Festival panel, Margulies said that Walker chose the hair color because the character was based on a woman who did not have red hair and she wanted to hide her identity. The show followed the description in the book, with one exception. “In the book though, it’s big and curly,” Hindsgaul said. “We took that away and laid it down because otherwise it was just crazy.”\n\nMargulies was willing to experiment\n\nHindsgaul said that Margulies, who wore a wig on The Good Wife, was happy to experiment with a variety of shades of red until they found one that worked best for her skin color. “We just wanted to make sure that it’s the right shade of red, that she could carry it,” she said. “We had to darken it so it was a deeper red. We ended up going with it very, very bright and silky and shiny. I think it really brings out the fire in her character. We paled her out a little bit, so she gets a very ‘plastic-y’ look.”\n\nKitty definitely dyes her hair\n\n“A woman that’s in charge of a fashion magazine, I feel like they have a look and they stick to it,” Hindsgaul said, “She probably looked like that the last 25 years.” Hindsgaul imagines Kitty as having a very particular beauty routine, which meant that her wig is precisely layered and arranged into the stiff-yet-flowing look she’d prefer. “I think a woman like that has a hair-and-makeup artist show up every single morning in their apartment and it gets done for the day,” she said. “[She’s] definitely dying her hair. I mean, this is a choice that she made.” The wig, as you might guess, is also dyed red.\n\nJoy Nash is also wearing a wig\n\nDietland needed to hide Nash’s natural confidence — and her own fiery red hair — so they chose a messy bob-like cut that would flatten her face and hide her distinctive eyebrows. “The color of the Plum wig is like completely natural, undyed hair to get it as flat and as plain as possible,” Hindsgaul said. “People who don’t have a lot of self-esteem always tries to cover their face as much as possible, so it’s just this really sad, droopy thing.”\n\nThe show has tons of other wigs\n\nAs the story line progresses, Plum tries out various makeovers and even imagines her looks differently in a few dream sequences. Those required a series of fantastical wigs — many of them synthetic and in bright colors. “I have never done this many wigs on a non-period show,” Hindsgaul, who also works on Stranger Things, said. “Sometimes we shot four different wigs for her in one day. We just kept on changing her up.”", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/05/31/31-dietland.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/05/31/31-dietland.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/31/31-dietland.w1200.h630.jpg", "keywords": [], "authors": ["Jackson Mchenry"], "canonical_link": "https://www.vulture.com/2018/06/dietland-julianna-margulies-wig.html", "title": "Everything to Know About Julianna Margulies’s Dietland Wig", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything to Know About Julianna Margulies’s Dietland Wig", "url": "https://www.vulture.com/2018/06/dietland-julianna-margulies-wig.html", "description": "The story behind Kitty Montgomery’s flame-red look.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/31/31-dietland.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Everything to Know About Julianna Margulies’s Dietland Wig", "description": "The story behind Kitty Montgomery’s flame-red look.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/31/31-dietland.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@McHenryJD", "site": "@vulture"}, "article": {"published_time": "2018-06-04T14:32:54.696Z", "tag": "dietland, wigs, tv, julianna margulies, amc", "publisher": "https://www.facebook.com/Vulture"}, "description": "Obsessed with Julianna Margulies’s wig in AMC’s ‘Dietland’? Us too. Here’s everything to know about her flame-red look as fearsome magazine editor Kitty Montgomery.", "sailthru.tags": "dietland, wigs, tv, julianna margulies, amc", "author": "Jackson McHenry", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1528122774.696, "source": "https://www.vulture.com", "summary": ""}