{"url": "www.ibtimes.co.in/triple-kardashian-pregnancy-ploy-25-million-744402", "text": "The Kardashian-Jenner baby boom has been taking the world over by storm. From fans and followers popping up with theories and speculations on three sisters of the clan being pregnant at the same time, more spice has been added with this latest input from an insider.\n\nAccording to sources, a new report claims that all these pregnancies were planned and coordinated by Kris Jenner as a ploy to secure better Keeping Up with the Kardashians ratings. All for a prospective $25 million that's supposed to come their way from this news!\n\nAlso read: Did Kris Jenner's bff just confirm Kylie's pregnancy?\n\nThe 61-year-old Kris Jenner's 'momager' skills have always been top notch and it's no secret. She claimed it herself when the shocking videos of Kim K's sex tape's had been revealed. But this news – if true – clearly takes away the crown as the biggest planned ploy ever.\n\nNot to mention, the most bizarre, wildest one too! Both Khloe Kardashian, 34 and Kylie Jenner, 20 are expecting their first babies with their beaus, Tristan Thompson, 26 and Travis Scott, 25 respectively.\n\nKim, on the other hand, is expecting her third baby via surrogate. And get this – they all are due around the same time next year! Could this really be just a really smart, orchestrated move? Or are the claims just baseless rumours?\n\n\"Kris knew having three daughters simultaneously expecting would bring drama, tears, attention, competition — everything she's trying to sustain for the sake of bigger paydays,\" an insider reported Star magazine. As reported by Star, the ratings of KUWTK were down last season. Is this Kris Jenner's extremely well-crafted revival strategy?\n\n\"All three sisters have been promised endorsement deals, TV specials and even books. They're looking forward to majorly cashing in and breathing new life into their careers,\" the source said. Clearly, as Kris seemed to have been convinced, the triple baby boom news is doing its bit, if the source's claims are authentic.\n\n\"She can't wait for all the attention,\" the source continues to explain. \"But, more importantly, for the cash to start rolling in.\" This clearly refers to the alleged $25 million that the Kardashian-Jenner women are reportedly making off the baby news announcement and deals that have been offered to them.\n\nGuess it's safe to conclude that this tweet stands proven right!\n\nLike they say...the devil works hard but Kris Jenner works harder. https://t.co/CsSApFoErx pic.twitter.com/aNYyH3qny9 — Yashar Ali ? (@yashar) September 30, 2017\n\n\"These sisters have everything to lose, so it's worth doing anything they can to keep ratings up and storylines fresh,\" revealed the insider. \"And that includes triple pregnancies.\" Well, while neither of them confirmed their pregnancy rumours except for Kim, the sisters were spotted in baggy attire recently.\n\nAnd they might have dropped some passive hints on their social media accounts too! While sources have confirmed to multiple entertainment magazines that the rumours are true and the pregnant couples are absolutely thrilled, could this be just another stunt they pulled for money? Will they actually do that?\n\nWe all know that Kim's first choice for her surrogate was Khloe, and it was then revealed that the latter has fertility issues. Kylie, on the other hand, is the youngest and at the peak of her make-up mogul career. Would they consciously, strategically \"plan\" and make it happen?\n\nKnowing Kris Jenner, anything is possible, but given Khloe's history and Kylie's relationship term with Travis Scott, it sounds a little strange that all of them would just agree on a whim and control the entire process.\n\nLike, this has to be considered..\n\nTheir mama is not the fertile queen regardless all three can take care of them babies financially A baby is a blessing all day — Sollatina (@sollatina) September 27, 2017\n\nAnd no matter how much the younger sisters seem to have \"timed their pregnancies to coincide with Kim's,\" this just seems way too biologically advanced. Even for the Kardashians!", "images": ["https://data1.ibtimes.co.in/en/full/663296/kim-kylie-khloe.jpg", "https://graphic1.ibtimes.co.in/www/img/logo-stack.png", "https://graphic1.ibtimes.co.in/www/responsive/latest/home.png"], "top_img": "https://data1.ibtimes.co.in/en/full/663296/kim-kylie-khloe.jpg", "keywords": [], "authors": ["Alakananda"], "canonical_link": "https://www.ibtimes.co.in/triple-kardashian-pregnancy-ploy-25-million-744402", "title": "Is the triple Kardashian pregnancy a ploy for $25 million?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "language": "english", "author": "Alakananda  Bandyopadhyay", "copyright": "2020 IBTimes", "subject": "Is the triple Kardashian pregnancy a ploy for $25 million?", "description": "With fans and followers speculating theories about the triple pregnancy in the Kardashian clan, reports have just arrived that it's all a ploy to improve KUWTK ratings this season. But how plausible is that?", "keywords": "kardashians,kardashian pregnancy,Keeping Up with the Kardashians,Kris jenner,Kylie Jenner,Khloe Kardashian,Kim Kardashian,kylie jenner pregnancy,Khloe Kardashian pregnancy,kim kardashian surrogate,travis scott,tristan thompson", "article": {"published_time": "2017-10-05T11:38:10+05:30", "modified_time": "2017-10-05T11:38:10+05:30", "section": "Celebrity", "tag": "Tristan thompson", "publisher": "https://www.facebook.com/ibtimes.india"}, "og": {"title": "Is the triple Kardashian pregnancy a ploy for $25 million?", "url": "https://www.ibtimes.co.in/triple-kardashian-pregnancy-ploy-25-million-744402", "image": "https://data1.ibtimes.co.in/en/full/663296/kim-kylie-khloe.jpg", "description": "With fans and followers speculating theories about the triple pregnancy in the Kardashian clan, reports have just arrived that it's all a ploy to improve KUWTK ratings this season. But how plausible is that?", "type": "article", "site_name": "International Business Times, India Edition"}, "DC.title": "Is the triple Kardashian pregnancy a ploy for $25 million?", "DC.description": "With fans and followers speculating theories about the triple pregnancy in the Kardashian clan, reports have just arrived that it's all a ploy to improve KUWTK ratings this season. But how plausible is that?", "DC.subject": "kardashians,kardashian pregnancy,Keeping Up with the Kardashians,Kris jenner,Kylie Jenner,Khloe Kardashian,Kim Kardashian,kylie jenner pregnancy,Khloe Kardashian pregnancy,kim kardashian surrogate,travis scott,tristan thompson", "news_keywords": "Celebrity,Kardashians,Kardashian pregnancy,Keeping Up with the Kardashians,Kris jenner,Kylie Jenner,Khloe Kardashian,Kim Kardashian,Kylie jenner pregnancy,Khloe Kardashian pregnancy,Kim kardashian surrogate,Travis scott,Tristan thompson", "syndication-source": "https://www.ibtimes.co.in/triple-kardashian-pregnancy-ploy-25-million-744402", "Googlebot-news": "index, follow", "robots": "index, follow", "twitter": {"title": "Is the triple Kardashian pregnancy a ploy for $25 million?", "description": "With fans and followers speculating theories about the triple pregnancy in the Kardashian clan, reports have just arrived that it's all a ploy to improve KUWTK ratings this season. But how plausible is that?", "image": "https://data1.ibtimes.co.in/en/full/663296/kim-kylie-khloe.jpg", "card": "summary_large_image", "site": "@ibtimes_india", "domain": "www.ibtimes.co.in", "url": "https://www.ibtimes.co.in/triple-kardashian-pregnancy-ploy-25-million-744402"}, "fb": {"pages": 134755750024728, "app_id": 1386147698272496}}, "movies": [], "publish_date": 1507183690.0, "source": "http://www.ibtimes.co.in", "summary": ""}