{"url": "https://en.wikipedia.org/wiki/John_Boyega", "text": "English actor\n\nJohn Adedayo B. Adegboyega (born 17 March 1992), known professionally as John Boyega, is an English actor known for playing Finn in the Star Wars sequel trilogy films, The Force Awakens (2015), The Last Jedi (2017), and The Rise of Skywalker (2019). Boyega rose to prominence in his native United Kingdom for his role as Moses in the 2011 sci-fi comedy film Attack the Block.\n\nBoyega's other credits include historical drama film Detroit (2017), the science fiction film Pacific Rim: Uprising (2018), four episodes of the television series 24: Live Another Day and the drama Imperial Dreams (2014). Boyega received the BAFTA Rising Star Award in 2016.\n\nEarly life\n\nBoyega was born on 17 March 1992 in Peckham, London, England, to British Nigerian parents, Abigail (née Aboderin), who works with the disabled, and Samson Adegboyega, a Pentecostal minister.[1][2] His first role was a leopard in a play at his primary school.[3][4]\n\nBoyega was a pupil at Oliver Goldsmith Primary School. While acting in a play there at the age of nine, he was noticed by Teresa Early, the artistic director of Theatre Peckham, a learning theatre for young people who live in south London. After he joined the theatre, he spent his time there outside school hours between the ages of nine and 14. Boyega's father, a preacher, had wanted Boyega to become a preacher too, but was supportive of his son's theatrical interests.[5][6][7][8]\n\nIn 2003, Boyega started his secondary education at Westminster City School, where he took part in various school productions.[9] Between 2008 and 2010, he attended South Thames College at the college's Wandsworth campus to study for a National Diploma in Performing Arts.[10] His activities at the college included playing the title role in the college's production of Othello.[11] He enrolled at the University of Greenwich to study BA Film Studies & Media Writing,[12] but dropped out to focus on acting.[6]\n\nCareer\n\nBoyega trained at the Identity School of Acting in Hackney,[13] and appeared in Six Parties at the National Theatre and Category B at the Tricycle Theatre prior to being offered a role in the 2011 film Attack the Block.[14][15] In September 2011, HBO announced that Boyega had been cast in the boxing drama pilot Da Brick, loosely based on Mike Tyson's life. Boyega was expected to play Donnie, who is released from a juvenile detention centre on his 18th birthday and begins to examine what it means to be a man. The pilot was written by John Ridley,[16] but was not picked up by HBO.[17] Also in 2011, he acted in the film Junkhearts in which he portrayed Jamal, a drug dealer who finds some guns and tries to sell them.\n\nBoyega was chosen by Fionnuala Halligan of Screen International as one of the \"UK Stars of Tomorrow 2011\" and appeared alongside two other actors on the front cover of that magazine in its July 2011 edition.[18] In March 2012, Boyega was cast in the film adaptation of Chimamanda Ngozi Adichie's book Half of a Yellow Sun.[19] On 29 April 2014, it was confirmed that Boyega had been cast as a lead character in Star Wars: The Force Awakens.[20] It was later revealed Boyega would play Finn, a stormtrooper for the First Order, who leaves the military power after witnessing their cruelty in his first combat mission before joining the fight against them. The film was released on 18 December 2015. Both the film and Boyega's performance received acclaim from both audiences and critics.[21][22]\n\nIn 2017, Boyega starred in Detroit, Kathryn Bigelow's film about the 1967 Detroit riots.[23] The same year, he reprised his role as Finn in Star Wars: The Last Jedi.[24]\n\nIn January 2016, Boyega formed his own production company, Upperroom Entertainment Limited. His company co-produced Pacific Rim: Uprising (2018), the sequel to the 2013 movie Pacific Rim, alongside Legendary Entertainment.[25] Boyega also starred in the lead role of the film, Jake Pentecost.[26]\n\nIn November 2018 it was announced that Boyega would be starring alongside Letitia Wright in a novel adaption of Hold Back the Stars.[27] Boyega has also been cast in Steve McQueen's upcoming mini-series Small Axe.[28]\n\nIn 2018, Boyega subsequently reprised his role as Finn in Star Wars: The Rise of Skywalker, released in 2019. During an interview with Good Morning America, Boyega acknowledged that he had accidentally left his script in a hotel room during filming. The script subsequently surfaced on eBay but was bought by a Lucasfilm employee to prevent it from being leaked.[29]\n\nFilmography\n\nFilm\n\nTelevision\n\nStage\n\nYear Title Role Notes 2010 Othello Othello South Thames College 2017 Woyzeck Woyzeck Old Vic Theatre[42]\n\nVideo games\n\nTheme park attractions", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Josh_Wiggins_%28Hellion%29%2C_John_Boyega_%28Imperial_Dreams%29%2C_Kodi_Smit-McPhee_%28Young_Ones%29_and_Sharon_Swart_%2812026188424%29.jpg/220px-Josh_Wiggins_%28Hellion%29%2C_John_Boyega_%28Imperial_Dreams%29%2C_Kodi_Smit-McPhee_%28Young_Ones%29_and_Sharon_Swart_%2812026188424%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/1200px-John_Boyega_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/220px-John_Boyega_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/1200px-John_Boyega_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/John_Boyega", "title": "John Boyega", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/1200px-John_Boyega_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}