{"url": "https://www.cosmopolitan.com/uk/entertainment/a9608973/13-reasons-why-season-2-trailers-photos-cast-everything-you-need-to-know/", "text": "Let's take a look at everything we know about season 2 of 13 Reasons Why...\n\n\n\nWhat will happen in season 2 of 13 Reasons Why?\n\nWe don't know for certain, but NVice-President of Original Series at Netflix Brian Wright has teased the storyline (via Elle), commenting, \"[season 2] continues the characters' journeys. It continues this dialogue and these conversations and the exploration of some of these super tough topics, but in a way that's always wrapped in a very entertaining and propulsive thread and story.\"\n\n\"In a way it felt that to leave them there would be unfair to the characters and also to the viewers who really had come to care about them\", Showrunner Brian Yorkey added. \"Jessica in particular, her experience continues to be a central part of season two. We wanted very much to look at her recovery. To look at what it is to go from being a victim of sexual assault to being a survivor of sexual assault.\"\n\n13 Reasons Why season 2 release date\n\nHooray! The second season of 13RW will air on Netflix on 18th May 2018.\n\nAnd we know what because of the trailers...\n\n13 Reasons Why season 2 trailer\n\nNetflix has released two trailers for 13RW season 2. Here's the latest, which dropped on May 9 -\n\nAnd here's the first one, which dropped in April -\n\nFirst look at 13 Reasons Why season 2\n\nNetflix released these photos at the beginning of May. Now we're REALLY excited\n\nNetflix\n\nNetflix\n\nNetflix\n\nNetflix\n\nNetflix\n\n13 Reasons Why season 2 soundtrack\n\nSelena Gomez revealed at the beginning of May that she's releasing music for the second series of 13RW.\n\nAlong with a polaroid picture, she wrote on Instagram: #BackToYou. Out May 10th, part of the @13ReasonsWhy S2 soundtrack. I’m so excited for you guys to hear it.\"\n\nAnd here's a snippet of 'Back To You' for your listening pleasure!\n\n13 Reasons Why season 2 cast\n\nNetflix\n\nWell, we have a feeling Hannah Baker might be back...\n\n\"Hannah's story is still very much not finished,\" showrunner Brian Yorkey told The Hollywood Reporter. \"She's an integral part of whatever the next chapter of the story is, and she's very much still at the center of it.\" Brian went on to point out that a key element of the show is the interweaving of past and present, so we'll likely see Hannah crop up in flashbacks in season two.\n\n\n\nDylan Minnette, who plays Clay, has also spoken about Hannah's involvement in season 2, saying that many of Hannah's never-seen-before flashbacks will cover new ground by featuring other characters rather than himself. He also said that season 2 will incorporate flashbacks that feature neither him nor her.\n\n\"I think that you'll see more interactions between Hannah and some other characters we haven't seen before,\" Dylan told Seventeen.\n\n\"I think that's interesting because in season one, whenever there was a flashback, it was either Hannah or Clay's flashback and either Clay or Hannah or both were always in it.\n\n\"Now, maybe there will be a flashback they're not in and you can learn more about something else. I thought that was pretty cool.\n\n\"There's a whole life that Hannah had, and there's more we can learn about her. Overall, learning more about her is more important to the entire narrative.\"\n\nAs well as Hannah and Clay returning, it's also looking good that Ross Butler aka Zach has decided not to return to Riverdale for a second series, because that means he probably needs to be free for season 2 of 13 Reasons Why.\n\nBut we do have confirmation that these guys have joined the show for season 2:\n\nBen Lawson as Rick: Liberty High’s beloved baseball coach. Ben appeared in the rom-com No Strings Attached, and shows including Modern Family and 2 Broke Girls.\n\n\n\nSamantha Logan as Nina: A respected track star with a secret. Sam§ntha has appeared on MTV’s Teen Wolf and Freeform’s The Fosters among others.\n\nAllison Miller as Sonya: A smart and ambitious young litigator. Allison starred in Syfy’s Incorporated and Fox’s Terra Nova.\n\nBryce Cass as Cyrus: An edgy, cynical mischief-maker who champions the downtrodden. This is Bryce's first major role.\n\nChelsea Alden as Mackenzie: Cyrus’ sister, an artsy, witty type unafraid to speak her mind. Chelsea appeared on American Horror Story: Roanoke last year.\n\n\n\nKelli O’Hara as Jackie: A warm, intelligent, passionate advocate for victims of bullying. Kelli is a Broadway star who won a Tony for The King And I in 2015, and has also appeared in CBS All Access’ The Good Fight.\n\nWhat will 13 Reasons Why season 2 be about?\n\nNetflix\n\nWell, there are soooooooo many options. But here are a few that we've decided could work:\n\n1. A school shooting\n\n2. The aftermath of Alex's suicide attempt\n\n3. The lawsuit\n\n\n\n4. Bryce's rape trial\n\n\n\nHere are some details on each of those.\n\nWhat we do know is that season 2 of 13RW will NOT feature another suicide.\n\nIn an interview with The Hollywood Reporter, producer and Paramount President Amy Powell revealed the series would differ in that respect from its controversial predecessor, although it will still be \"provocative\".\n\n\"We won't show another suicide,\" she said. \"There's new storytelling that is as provocative and unexpected.\"\n\nNetflix\n\nTommy Dorfman, who plays Ryan, recently told us what we can expect from season 2. He said: \"I feel like you can expect growth from all of the characters in the show. We start off five months on from Hannah’s death, and I think everyone’s grown from that experience.\n\n\"New friendships are formed. As well as in season 1, you get to see flashbacks featuring more of a backstory on all of the supporting characters from season 1. They have a bigger part to play in season 2. You see how relationships are formed and how they ended.\"\n\nNetflix\n\nIt also looks like the storyline will focus on Bryce finally getting his comeuppance. Kate Walsh, who plays Hannah's mum, recently said:\"It's a very exciting season for a lot of reasons,\" she told E! News. \"You see us sort of following the trail of Bryce Walker, so this season deals with sexual assault, it deals with truth, it deals with responsibility, it deals with the aftermath of Hannah's death… And really trying to, again, look for responsibility and accountability. It's very intense and very, I think, still totally addictive.\"\n\nNetflix\n\nShe added: \"You see my character having different relationships with different kids. That part was really exciting to me, being able to play with different actors. All of them are so good.\"\n\nNetflix\n\nWhen will 13 Reasons Why season 2 filming start?\n\nChristian, who plays Tony, tweeted that they had started filming in June.\n\nSadly, the cast recently had to stop filming the new series in Vallejo after Californian wildfires made it too dangerous to continue.\n\nAccording to Deadline, filming has been put on hiatus with the hope the normal schedule will resume on Sunday 15th October once the fires are contained.\n\nDylan Minnette, who plays Clay Jensen Tweeted about the fires.\n\n\n\nWe film 13 Reasons Why in many of the areas in NorCal affected by these devastating fires. Sending love and thoughts to everyone involved. — Dylan Minnette (@dylanminnette) October 10, 2017\n\nWill Selena Gomez produce 13 Reasons Why season 2?\n\nNo confirmation from Selena that she'll be involved, but she definitely think there could be a second series.\n\nShe recently said: \"We don't know what is going to go beyond it, but we know there are so many stories that lie beneath each character. That's why it became a series in the first place. So we'll see.\"\n\n13 Reasons Why season 2 spoilers\n\nNetflix has confirmed that the following things will happen in 13 Reasons Why season 2:\n\n1. We'll see other characters' perspectives on Hannah's story.\n\n\n\n2. Jessica's story will continue.\n\n\n\n3. There will be a narrator. It won't be Hannah.\n\n\n\n4. There will be no more tapes.\n\n\n\n5. The season will explore toxic masculinity.\n\n\n\n6. Bryce brought to justice.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.938xw:1.00xh;0.0321xw,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.938xw:1.00xh;0.0321xw,0&resize=1200:*", "keywords": [], "authors": ["Anna Lewis", "News Editor", "Anna Lewis Is The News Editor At Delish Uk", "Which Means She S Always Either Writing About Food", "Cooking Food Or Eating Food."], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a9608973/13-reasons-why-season-2-trailers-photos-cast-everything-you-need-to-know/", "title": "13 Reasons Why season 2: everything we know so far", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Listen to Selena Gomez's 13 Reasons Why song 'Back To You'", "description": "Plus, everything else you need to know about the second season", "url": "https://www.cosmopolitan.com/uk/entertainment/a9608973/13-reasons-why-season-2-trailers-photos-cast-everything-you-need-to-know/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.938xw:1.00xh;0.0321xw,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2018-05-11 11:01:07", "published_time": "2018-05-11 10:55:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.938xw:1.00xh;0.0321xw,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "13 Reasons Why season 2: everything we know so far", "description": "Let's take a look at everything we know about season 2 of 13 Reasons Why", "keywords": "13 reasons why, 13 reasons why season 2, 13 reasons why season 2 trailer, 13 reasons why season 2 release date, 13 reasons why season 2 cast, 13 reasons why season 2 storyline, 13 reasons why season 2 hannah baker, 13 reasons why season 2 bryce, 13 reasons why season 2 clay, 13 reasons why season 2 filming, 13 reasons why season 2 filming wildfires, 13 reasons why release date pushed back, bryce 13 reasons why, selena gomez 13 reasons why, 13 reasons why soundtrack, 13 reasons why season 2 soundtrack, first look 13 reasons why, 13 reasons why photos", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.470xw:1.00xh;0.223xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment", "sailthru.date": "2018-05-11T10:55:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.938xw:1.00xh;0.0321xw,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-gomez-1525256908.jpg?crop=0.470xw:1.00xh;0.223xw,0", "sailthru.socialtitle": "Listen to Selena Gomez's 13 Reasons Why song 'Back To You'", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526007300.0, "source": "https://www.cosmopolitan.com", "summary": ""}