{"url": "https://en.wikipedia.org/wiki/Lyla_Garrity", "text": "Lyla Garrity First appearance \"Pilot\"\n\n(episode 1.01) Last appearance \"Stay\"\n\n(episode 4.06) Portrayed by Minka Kelly Information Occupation College student at Vanderbilt University Family Buddy Garrity (father)\n\nPam Garrity (mother)\n\nTabitha \"Tabby\" Garrity (sister)\n\nBuddy Jr. (brother)\n\nKevin (step-father)\n\nLyla Garrity is a fictional character, portrayed by Minka Kelly, in the Friday Night Lights TV series. She is the daughter of Buddy Garrity and Pam Garrity. She is the former girlfriend of Jason Street and Tim Riggins.\n\nCharacterization and background [ edit ]\n\nLyla is portrayed as an \"All-American\" golden girl with a seemingly perfect family. The oldest of three children, she has a younger sister, Tabby, and younger brother, Buddy, Jr. She is good-natured, compassionate, popular and is the girlfriend of the star quarterback Jason Street. However, her life quickly unravels when she has a one-night stand with Tim Riggins, which leads to her breaking up with Jason. Her parents divorce, causing her to fall down the social hierarchy and become a target of ridicule amongst her schoolmates and fellow cheerleaders.\n\nDuring much of the show, she is frequently seen around Tim and Jason, the three having known each other since childhood. After her affair with Tim, things between her and Jason are tense, but by season three, they are on speaking terms, as she is the first person he confides in about moving to New York City.[1]\n\nStorylines [ edit ]\n\nSeason 1 [ edit ]\n\nIn the pilot episode, Lyla is introduced as the girlfriend of star quarterback, Jason Street. After Jason's accident, she has an affair with Tim Riggins, his best friend, while Jason is in the hospital. Jason catches them in an intimate moment and asks Lyla if she has been spending a lot of time with Tim, which she quickly denies.[2] For some time, the relationship between her and Jason is strained, but they get back together as he admits that he still loves her despite everything that has happened[3] and he proposes to her. Her parents' messy divorce and her father's affair being made public takes a toll on her and, during the father-daughter dance, she takes out her anger at her father's infidelity by vandalizing her father's car dealership and the cars on sale. Her troubles are exacerbated when she catches Jason with a woman he has met while training for the Olympic trials in Austin and breaks off the engagement.[4] She eventually quits the cheerleading squad after being incessantly ridiculed by her peers at school and does some soul-searching.\n\nSeason 2 [ edit ]\n\nIn the season premiere, Lyla becomes a devout Christian. She is baptized in the first episode of the season and becomes involved in various ministries such as a Christian radio show and prison ministry. At the radio station, she meets Chris (Matt Czuchry), and they begin dating. While on a visit to juvenile detention, she meets the gruff but polite, Santiago. She learns that he was born on American soil but his parents, being illegal immigrants, were deported back to Mexico several years ago and that he lives with his relatives. She convinces her father to offer Santiago a job at the car dealership. Buddy later recommends him to Coach Taylor and Santiago tries out for the Panthers football team with some help from Tim, Matt Saracen, and Brian \"Smash\" Williams.\n\nMeanwhile, Jason and Tim have gone to Mexico because Jason wants to try an experimental procedure in hopes of regaining use of his legs. Once Tim learns that Jason may die on the operating table, he convinces her to come down to Mexico to talk Jason out of it.[5]\n\nSeason 3 [ edit ]\n\nLyla is now a senior and starting to plan for her future. Having made peace with Jason, she and Tim become an item and the three are friends again. She fights with Buddy after he loses her college fund money in a bad business deal, even living with Tim for a while, but they eventually reconcile. At the end of the season, she leaves Dillon for Nashville to attend Vanderbilt University. The character was written out of the show as actress Minka Kelly departed from the main cast for other acting opportunities.\n\nSeason 4 [ edit ]\n\nLyla returns to Dillon and attends the funeral of Matt's father. She reunites briefly with Tim, who admits that he is still in love with her, but realizes that asking her to stay will mean holding her back. They part ways amicably, and say their goodbyes as Lyla boards a bus back to Vanderbilt.[6] This is Minka Kelly's final appearance in the show.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Minka_Kelly.jpg/120px-Minka_Kelly.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lyla_Garrity", "title": "Lyla Garrity", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}