{"url": "https://www.teenvogue.com/story/princess-eugenie-royal-wedding-everything-we-know", "text": "Just when we tucked away our decorated teapots, fine china, English fascinators, and tea-party-approved shoes, it's time to get them back out once again. Yes, another Royal Wedding is happening—soon! On Friday, October 12th, Princess Eugenie, 28, and her fiancé, Jack Brooksbank, 31, will become the next new royal newlyweds.\n\nOn the polished heels of Prince Harry and Meghan Markle’s wedding, another regal celebration is a welcomed jubilee. Here’s what we know about Princess Eugenie and Jack Brooksbank’s planned nuptials.\n\nPrincess Eugenie, the youngest daughter of Prince Andrew and Sarah, Duchess of York is ninth in line for the coveted throne—just behind her elder sister, Princess Beatrice. As reported by BBC News, Eugenie is a real working royal as a director at a gallery in Hauser and Wirth in London. Jack is a brand manager for Casamigos Tequila (co-founded by George Clooney who might be making his second royal wedding appearance of the year).\n\nRoyal watchers will recall that the couple officially announced their engagement via the Royal Family’s Twitter account this past January. As we previously reported, the couple met back in 2011 skiing in the Swiss Alps. From one epic location to meet (and fall in love) the location of their engagement was just as epic—near a lakeside Nicaraguan volcano —ah, young royal love.\n\nAfter Jack bestowed Princess Eugenie with a stunning pink diamond sapphire engagement ring (so extra) it was announced that their marriage will take place at St. George’s Chapel in Windsor (the same place Harry and Meghan tied the knot).\n\nAs reported by Harper’s Bazaar, royal romantics at heart will be able to watch the next set of royals walk down the aisle as TLC will be the only network to broadcast the wedding in the United States. The viewing starts early—4:25 a.m. EST Friday, October 12th. So have your teapot hot and your scones pre-jammed for another English wedding spectacle.\n\nWhile the past regal weddings have been very pomp-and-circumstance, this one is expected to be the same with an environmental-friendly no-plastic stance.\n\nThis past August, British Vogue shared the news that both Princess Eugenie and Jack are planning to have an eco-conscious planned wedding as she and her sister, Beatrice grew up in an “anti-plastic” home. She told British Vogue, “My whole house is anti-plastic now – and Jack and I want our wedding to be like that as well.”\n\nPrincess Eugenie, one of the few royals on Instagram, recently posted a regal black and white profile portrait captioning, “#tbt to some serious wedding daydreaming going on here. Pre-wedding vibes.”\n\nWhile all anticipated wedding-watchers will have to tune in to see the final look of Eugenie’s wedding attire; it's safe to speculate that she'll wear a tiara. July 23, 1986, the wedding day of Eugenie’s mum, The Duchess of York wore a gifted diamond crown from the Queen and the Duke of Edinburgh. Okay, now that’s extra.\n\nThe wedding sounds dreamy and all, but still you want to hit the ‘snooze’ button come Friday? No worries, the whole broadcast can be re-played on the TLC Go app—just reheat your tea (and crumpets) and you are good to go watch post-class!\n\nRelated: People Are Newly Convinced Meghan Markle Is Using a British Accent", "images": ["https://assets.teenvogue.com/photos/5a660b6e11a3834527c5f4f9/16:9/w_2560%2Cc_limit/GettyImages-908740486.jpg", "https://assets.teenvogue.com/photos/5a660b97416e79028178ab5e/16:9/w_1280,c_limit/eugenie-fb.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg"], "top_img": "https://assets.teenvogue.com/photos/5a660b97416e79028178ab5e/16:9/w_1280,c_limit/eugenie-fb.jpg", "keywords": [], "authors": ["Katelyn Chef", "Katelyn Che"], "canonical_link": "https://www.teenvogue.com/story/princess-eugenie-royal-wedding-everything-we-know", "title": "Princess Eugenie’s Royal Wedding: Everything We Know So Far", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Katelyn Chef", "copyright": "Copyright (c) Condé Nast 2020", "description": "Everything we know about Princess Eugenie’s royal wedding to Jack Brooksbank, taking place October 12, 2018.", "id": "5bb7a6e4ed6266479c1a931c", "keywords": "lifestyle,princess eugenie,royal wedding", "news_keywords": "lifestyle,princess eugenie,royal wedding", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5bb7a6e4ed6266479c1a931c", "parsely-metadata": "{\"description\":\"Everything we know about Princess Eugenie’s royal wedding to Jack Brooksbank, taking place October 12, 2018.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5a660b6e11a3834527c5f4f9/16:9/w_1000,c_limit/GettyImages-908740486.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5a660b6e11a3834527c5f4f9/1:1/w_1000,c_limit/GettyImages-908740486.jpg\"}", "og": {"description": "Here’s everything you need to know, including how to watch.", "image": "https://assets.teenvogue.com/photos/5a660b97416e79028178ab5e/16:9/w_1280,c_limit/eugenie-fb.jpg", "site_name": "Teen Vogue", "title": "Princess Eugenie’s Royal Wedding Is Only a Week Away", "type": "article", "url": "https://www.teenvogue.com/story/princess-eugenie-royal-wedding-everything-we-know"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "Here’s everything you need to know, including how to watch.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5a660b97416e79028178ab5e/16:9/w_1280,c_limit/eugenie-fb.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Princess Eugenie’s Royal Wedding Is Only a Week Away"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}