{"url": "https://web.archive.org/web/20180510162326/https://www.forbes.com/sites/scottmendelson/2018/05/10/bryce-dallas-howard-getting-8m-for-jurassic-world-2-is-not-a-scandal/", "text": "Universal\n\nAs noted in Variety, Chris Pratt will be receiving $10 million for his work in Universal/Comcast Corp.'s Jurassic World: Fallen Kingdom, while Bryce Dallas Howard will be getting $8 million. As I wrote on Tuesday, it was a surprisingly solid example of relative parity. Yes, ten is more than eight, and both actors co-starred in the last Jurassic World movie, but this was a case of franchise-specific value versus proven star power and then coming out mostly even. I was pleasantly surprised and chalked it up as a win.\n\nThose considering it a moral outrage or an example of gender-based pay disparity are treating a victory as a defeat. That she got anywhere near Pratt's salary for the second Jurassic World movie counts as a sign that this conversation is having a positive effect. If we were basing salary on proven star power and \"butts-in-the-seats\" value, Pratt would be making a lot more than Howard regardless of whose story it was or who was the better actor. That it's even a close call is a relative victory for those wanting more money and better roles for actresses.\n\nIf you recall, Jurassic World was technically Claire's story. She is our introductory character and she is the one who has a (somewhat wobbly) character arc whereby she realizes that the animals that she merely treated as commodities were flesh-and-blood creatures and thus were capable of unpredictable and uncontrollable actions. Pratt's Owen was the co-star, with similar screentime and most of the action beats, but it wasn't necessarily his journey. That she came back at all for the sequel means the filmmakers realized that.\n\nI was actually relieved that Howard was asked to return considering the long history of big franchises (Mission: Impossible, The Hangover, Indiana Jones, the 1990s Batman sequels, etc.) treating their female leads like disposable items. This has gotten better in our current serialization era, but it's still an issue, especially for stand-alone pictures and comedies. That she and Pratt both returned meant the filmmakers were aware that while Pratt's post-LEGO Movie/Guardians of the Galaxy popularity was a big part of the film's initial success, it was not his movie.\n\nThere was little chance that Pratt and Howard were going to end up with the same relative paycheck for the second film. Chris Pratt is a proven box office draw not just in the MCU but (relatively speaking) the likes of Sony's Passengers (where he correctly got 60% of Jennifer Lawrence's $20 million payday) and The Magnificent Seven. Howard is a fine actress with terrific turns in The Village, The Help and Pete's Dragon among others, but Jurassic World was her first leading role in a major franchise. You'll remember that part of the prerelease campaign for Jurassic World was a comedic video where Howard sings about being mistaken for Jessica Chastain.\n\nYou could argue that it's an example of gender disparity that actors like Pratt get thrust from near-obscurity into a bunch of big franchise flicks and are then anointed movie stars when those films perform well (or rehabilitate their image as an indie darling if those tentpoles bomb). You'd be 104% correct. That's a big factor in gender-based pay disparity. You command a bigger salary from well-received and successful star vehicles, which you can't accumulate if you're always playing the girlfriend/hostage to less famous male actors or the one woman in a sausage-fest.\n\nHence Michelle Williams being willing to reshoot Sony's All the Money in the World essentially for scale while Wahlberg (a major movie star with the ability to walk away to his next starring vehicle) held out for $1.5 million after Ridley Scott replaced Kevin Spacey with Christopher Plummer. For Wahlberg, it was just another studio job, a rare supporting role for a regular leading man, But for Williams, it was the opposite, a rare starring role in a major studio film for an actress used to headlining indies or playing the wife/love interest in studio pictures.\n\nAny number of white male actors are given the opportunity to build a healthy resume of acclaimed or financially successful starring vehicles and thus gain a reputation for solid leading man turns, even if most of those film are either indies or failed studio flicks. Even if Josh Brolin, Ryan Gosling or Tom Hardy can't open an envelope outside of IP-driven franchises, they are respected thespians and they get paid partially for the prestige and respectability that they bring to a project. It's why Gosling got $6.5 million for First Man and why Hardy got $7m for Venom.\n\nIt's harder for women to build up a resume that generates big paydays. With the near-death of the romantic comedy, legal thriller and adult drama, even many \"female-centric\" releases (The Force Awakens, Frozen, Jurassic World), contain one or two major female characters. Add a cultural disposition to view actresses as being inferior actors (How many strong performances is Blake Lively going to give before we count her as a decent actress?). Oh, and add the advantage for white male actors being able to prove and re-prove their worth in indie flicks or prestige TV (see: McConaughey, Matthew).\n\nI would argue that bringing back Bryce Dallas Howard for Fallen Kingdom was vital in establishing this fifth film as more than just \"random dino movie with the word Jurassic in the title.\" Movie-to-movie continuity counts, which is why Shia LaBeouf made three Transformers movies. That, along with the optics at play, is part of why Howard, who hadn't headlined a major studio hit since The Village in 2004 (which was mostly sold - falsely - as a Joaquin Phoenix vehicle) before 2015, got $8 million while her more famous and more bankable co-star got $10m.\n\nThere are absurd cases where well-known actresses (or sportscasters) are paid less for relative equal work compared to their less-famous male co-stars (think Jennifer Lawrence making less than Jeremy Renner for American Hustle), just as I still find it outrageous how often we see a scenario where Amy Adams plays Garrett Hedland's girlfriend. And a major part of the problem is an industry where there are far more opportunities for Ashton Kutcher to prove that he's a reliable box office draw than Natalie Portman, thus financially justifying him getting three times what she made for No Strings Attached.\n\nBut, as frustrating as it must be, not every example of a woman being paid less for movie or TV work is an example gender-based discrimination. I was shocked, in a good way, that Bryce Dallas Howard A) made $8 million for Jurassic World: Fallen Kingdom and B) made just 20% less than her much more \"box office draw\" co-star. It's a relative victory and a sign that the conversation is having a positive effect. Ms. Howard doesn't need you to make her out into a victim. You already forced her to ditch her snazzy high heels.", "images": ["https://web.archive.org/web/20180510162326im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F05%2FMV5BMjE2MDQ5MDEzN15BMl5BanBnXkFtZTgwMzkwMjM5NTE%40._V1_SX1500_CR001500999_AL_-1200x676.jpg", "https://web.archive.org/web/20180510162326im_/https://secure.gravatar.com/avatar/5e0887272964be6b258946209a00ffa2?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20180510162326im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F05%2FMV5BMjE2MDQ5MDEzN15BMl5BanBnXkFtZTgwMzkwMjM5NTE%40._V1_SX1500_CR001500999_AL_-1200x676.jpg", "keywords": [], "authors": ["Scott Mendelson"], "canonical_link": "https://web.archive.org/web/20180510162326/https://www.forbes.com/sites/scottmendelson/2018/05/10/bryce-dallas-howard-getting-8m-for-jurassic-world-2-is-not-a-scandal/", "title": "Bryce Dallas Howard Earning $2M Less Than Chris Pratt For 'Jurassic World' Is No Scandal", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Bryce Dallas Howard Earning $2M Less Than Chris Pratt For 'Jurassic World' Is No Scandal", "image": "https://web.archive.org/web/20180510162326im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F05%2FMV5BMjE2MDQ5MDEzN15BMl5BanBnXkFtZTgwMzkwMjM5NTE%40._V1_SX1500_CR001500999_AL_-1200x676.jpg", "updated_time": "2018-05-10T11:57:50-04:00", "url": "https://web.archive.org/web/20180510162326/https://www.forbes.com/sites/scottmendelson/2018/05/10/bryce-dallas-howard-getting-8m-for-jurassic-world-2-is-not-a-scandal/", "description": "That Bryce Dallas Howard earned about as much as Chris Pratt for 'Jurassic World: Fallen Kingdom' is a win in the fight for pay equity, not a setback.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Bryce Dallas Howard Earning $2M Less Than Chris Pratt For 'Jurassic World' Is No Scandal", "description": "That Bryce Dallas Howard earned about as much as Chris Pratt for 'Jurassic World: Fallen Kingdom' is a win in the fight for pay equity, not a setback.", "image": "https://web.archive.org/web/20180510162326im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2018%2F05%2FMV5BMjE2MDQ5MDEzN15BMl5BanBnXkFtZTgwMzkwMjM5NTE%40._V1_SX1500_CR001500999_AL_-1200x676.jpg", "creator": "@scottmendelson"}, "description": "That Bryce Dallas Howard earned about as much as Chris Pratt for 'Jurassic World: Fallen Kingdom' is a win in the fight for pay equity, not a setback.", "author": "Scott Mendelson", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Scott Mendelson", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/2595-49974", "published": "2018-05-10", "modified": "2018-05-10"}}, "movies": [], "publish_date": 1525881600.0, "source": "https://web.archive.org", "summary": ""}