{"url": "https://welcometotwinpeaks.com/theories/the-four-seasons-of-twin-peaks/", "text": "What if I told you we’ve been watching Twin Peaks the wrong way all these years? What if I told you that David Lynch and Mark Frost’s seminal early-90s TV series didn’t have two seasons—but four? Let me explain:\n\nFor all these years, we’ve been engaging with Lynch and Frost’s series as two wildly uneven seasons—the first a perfect nine hours of suspense, surrealism, and shocking reveals, followed by a front-loaded and sprawling second season where the wheels come off. By contrast, the show can be organized into four shorter seasons,each around eight hours, each with a beginning, middle, and end, and each with their own thematic fixations and arcs.\n\nA quote from Mark Frost spurred me to contemplate this new arrangement. In October 2014, BuzzFeed asked Frost why Showtime only ordered nine episodes. (If you recall, the new season was originally slated for nine installments. It’s since expanded to eighteen, a disparity I’ll discuss later.)\n\nAbout the nine-episode length, Frost said:\n\n“Well, if you think back about the first season, if you put the pilot together with the seven that we did, you get nine hours. It just felt like the right number. I’ve always felt the story should take as long as the story takes to tell. That’s what felt right to us.”\n\nAfter reading Frost’s quote, I fixated on that nine-hour length, pondering the various ways different networks approach the concept of a “season” of television. The classic American network season runs more than twenty episodes and unspools over the course of several months, usually from September until the start of summer.\n\nBut as all of us TV nerds have learned in this, the Golden Era of Television, that’s not the only game in town. (Note: Spoilers for Mad Men and Breaking Bad appear in this graf.) Basic cable introduced us to shorter seasons—the first five seasons of HBO’s The Sopranos each ran for thirteen episodes, while its supersized sixth season ran for a more network-style twenty-one. (Though if you ask me, The Sopranos really ran for seven seasons, twelve episodes for season “six” and nine for season “seven.” As you can tell, I like reorganizing classic shows.) Other great basic-cable shows followed the “baker’s dozen” format. Mad Men’s first six seasons each ran for thirteen episodes, while its final season ran for fourteen. (I also prefer to think of Mad Men’s final season as two smaller seasons.) Breaking Bad’s first season ran a very Twin Peaks-y seven episodes, while its following four installments each ran thirteen. It’s fifth and final season ran sixteen episodes, split into two eight-episode legs across two years.\n\n(Side note: There’s a related conversation to be had about the “BBC” model, where shows run for precisely as long as they need—The Office’s fourteen episodes and Sherlock’s twelve (so far). Both models have their virtues, but for now, I’m going to focus on the AMC model as it relates to Twin Peaks.)\n\nLooking across these shows, we see the rise of a new phenomenon—the “midseason finale.” The midseason finale bears all the hallmarks of a standard finale—the protagonists usually find themselves in a bind or the narrative otherwise comes to a head. Mad Men and Breaking Bad both had their share of memorable midseason finales. “Waterloo” ended the first leg of Mad Men’s seventh season with such shocking twists as Bert Cooper’s death and the sale of SCD&P to McCann-Erickson. And of course, Breaking Bad’s now-legendary fifth midseason finale saw Hank Schraeder finally figure out the identity of Heisenberg.\n\nWhy am I talking about this? To soften you up to accept my thesis: that like all of the classic shows it sired, Twin Peaks followed a similar format over its twenty-nine-episode run, delivering about eight hours of television at a time, each with their own premieres and finales.\n\nColoquially, I refer to 12-13 episodes as the “AMC” model for season length. (And by “coloquially,” I mean “I’m the only person who uses that term because it’s a made-up thing.”) But for the sake of this essay, let me introduce a new made-up thing: the “Frost and Lynch”—or F&L—model for season length. The F&L model runs for seven to nine hours. Shorter and leaner than the AMC model, the F&L model skews more toward the BBC format, which favors the unity and symmetry of films and only calls on its TV seasons to run for precisely as long as they need to tell their stories.\n\nSo finally, let’s talk about The Four Seasons of Twin Peaks. I’ll specify how and where each season begins and ends, why I made the choices I did, all while discussing the strengths and weakness of each season—because believe me, some seasons are better than others.\n\nNeedless to say, MAJOR SPOILERS LIE AHEAD!\n\nSeason One: “Murder In A Small Town”\n\nPilot and episodes 1.1 through 1.7\n\nThe one unit of F&L-style seasonal storytelling you can spot with the naked eye is the first season of Twin Peaks, which also happens to be the actual, literal first season of the show. Starting with the now legendary pilot, the first season introduces us to the bizarre and byzantine world of Twin Peaks, with its interlocking network of rivalries, grudges, financial dealings, secret loves, and old hatreds—to say nothing of all the Norwegians, Brie sandwiches, black coffee, and delicious cherry pie.\n\nTwin Peaks is many things—it’s a meditation on how evil can infest even the most good-hearted people; it’s a TV version of Blue Velvet; it’s a portrait of a small town in mourning. It’s also a cannily self-aware goof on TV itself, using the tropes and traditions of classic TV—including and especially barn-burning night-time soaps and the cornpone sitcoms of the 60s and 70s. Frost, an alum of such meat ’n’ potatoes dramas as Hill Street Blues, helped Lynch build a reliably engrossing cast of regulars, some of whom could’ve been lifted out of Dynasty or Dallas (Josie Packard, Catherine Martell, the Hornes); while others hailed more from Mayberry or Green Acres (Sheriff Truman, Andy, Lucy, Hawk). That unusual division makes for a pleasing “court and mechanicals” rift among the series regulars—a rift spanned by the show’s lead, the boundlessly kind and intuitive Agent Dale Cooper. Cooper (a stand-in of sorts for Lynch) serves many functions in the narrative—he drives the investigation into Laura Palmer’s murder, he provides key exposition—but more than anything else, he’s good. He’s decent and kind and empathetic, and in a show that’s largely about a battle between kindness and cruelty, he’s our greatest, clearest, most shining avatar for the former.\n\nBut anyway, let’s get back to season one, which unfolds over the course of nine of the most perfect hours ever seen on television. I get goosebumps when I recall some of its best moments—when the gang discovers the mysterious cabin where Laura and Ronette spent some of their harrowing final moments; when Coop asks Hawk if he believes in souls (“Several,” comes Hawk’s prescient answer).\n\nThe first season also includes some of the finest examples of what makes Twin Peaks so influential: its willingness to smuggle arthouse imagery onto mainstream television. Sometimes that imagery is a simple combination of the daft and the terrifying, such as when Waldo the parrot gets it: Perched above an exquisite arrangement of doughnuts, Waldo chillingly recites Laura’s sorry pleas before an unseen gunman silences him, spattering the bird’s blood across the table.\n\nOther times that imagery is… well, this:\n\nAmong its many virtues, Twin Peaks acted as a Trojan horse for arthouse imagery, techniques, impulses, and methods. It gave David Lynch a nationwide showcase for his mastery of dream-logic—and that daring has echoed across the following decades. I’d argue with confidence that not only did Twin Peaks sire the current golden age of television, but also that it specifically paved the way for shows like The Sopranos and Mad Men, both of which traffic in dream-logic storytelling.\n\nSeason One at a Glance\n\nStrengths: Narrative tightness, dreamy imagery, perfect introductions—and every episode is a classic.\n\nWeaknesses: I’ve never liked how Major Briggs strikes Bobby in the pilot. It’s always felt like an early-development misstep—a flashy choice they made before they really got to know the character.\n\nBest episode: This was a tough choice between the pilot and episode three, “Zen, or the Skill to Catch a Killer,” but episode three scores a narrow victory. From beginning to end, it’s a perfect episode, packed with unforgettable scenes—from the opening introduction of a baguette-bearing Jerry Horne to Coop’s rock-toss to the now-immortal first visit to the Black Lodge, it introduced the imagery and perfected the particular off-kilter tone and humor that made Twin Peaks a hit.\n\nSecond-best episode: I’m a huge fan of the season-one finale. It’s the only episode written and directed entirely by Mark Frost, and it shows. One of Twin Peaks’ myriad delights is the ongoing storytelling tension between its two eminent showrunners—Lynch is withholding and abstract, Frost generous and straightforward. Well, that straightforwardness makes for a rousing, headlong finale. I mean, it’s simply packed with stuff happening: the mill gets blown up, Andy shoots Jacques Renault, and of course, Coop gets shot.\n\nSeason Two: “The Investigation”\n\nEpisodes 2.1 through 2.7\n\nMy toughest choice for this essay was where to place the “second” season finale. Given that the first 15-16 episodes all bear on the revelation (and death) of Laura’s murderer, I had a few options. Does the “season” end right after her killer is revealed, in episode seven, “Lonely Souls”? Or does it end when her killer dies in episode nine, “Arbitrary Law”?\n\nI eventually decided to make episode seven, “Lonely Souls,” the finale. Here’s why: If you were to plot the episodes of Twin Peaks on a graph where the Y-axis represented an amalgam of quality and thematic payload, you’d see several spikes, usually when Lynch and Frost dropped in to write and direct an episode. They dropped in less and less often as the series went on, turning over the major writing duties to a team that came to be dominated by Harley Peyton and Robert Engels (who was a major contributor to both the series finale and the movie, Fire Walk With Me), and an eclectic crew of directors that included television journeymen (or journeywomen) like Lesli Linka Glatter, Todd Holland, and Tim Hunter, as well as some oddballs like Diane Keaton (whose episode ain’t bad) and Uli Edel.\n\nBut the Lynch episodes carry an especial level of importance, and if we also factor the series finale into this equation, we further find that the series’ major events revolve around the activity of the BOB entity.\n\nAnd on that note, let commence an aria about the Twin Peaks that could’ve been:\n\nBy now, it’s conventional wisdom that ABC screwed up the show by forcing Lynch and Frost to reveal the identity of Laura’s killer. It robbed the narrative of its momentum and revealed the execs’ fundamental misunderstanding of what Twin Peaks was—it was never a murder mystery. It was a demented and dreamy portrait of a small town. Laura Palmer’s murder was simply an initial, delicious hook to reel in the audience. In a better world, the showrunners would’ve been able to delay the revelation of Laura’s murderer until the series had run its course, saving its most dramatically satisfying reveal for the series’ final movements, much in the same manner as The Fugitive, which saved the capture of the one-armed murderer (himself referenced in Twin Peaks’ own one-armed man) for its series finale.\n\nBut here’s the thing: not even ABC could completely screw up a show this good. Happily, the revelation of Laura’s killer only raised a larger, more inscrutable question: What exactly is happening in Twin Peaks? That structure—answering one question while raising others—was forced upon Lynch and Frost, but they handled it gamely, establishing a modus operandi later imitated by shows like LOST. (Side note—LOST ain’t perfect, but damn if it isn’t the closest thing we’ve had over the years to the kind of week-to-week weirdness that Twin Peaks delivered. I rewatched it recently, and it remains one of the all-time great shows.) In any event, here’s the point of my aria: Lynch and Frost are master showrunners. When forced to solve their story’s central mystery, they deftly redirected the show’s energies into a new and larger mystery: what is BOB?\n\nSo endeth my aria. Let’s try to focus on taking about what actually happens in my proposed season two: we meet some intriguing new characters (Lenny von Dohlen’s Harold Smith, among others) and delve deeper into to the investigation of Laura’s murder. We also learn that while Laura’s murderer was technically her father, Leland (the incomparable Ray Wise), we also learn that he was under the possession of the malevolent entity BOB.\n\nThis season also sets up the following two seasons in my arrangement: Coop gets word that his old nemesis, Windom Earle, may be at large again, while Major Briggs hints that something paranormal may be afoot in the woods surrounding Twin Peaks.\n\nSeason Two at a Glance\n\nStrengths: Momentum established in season one carries through the end of this season. We find out who killed Laura. We learn more about the entity BOB. Premiere and finale are both top-notch episodes.\n\nWeaknesses: That “season one” magic starts to fade, but otherwise, I’d argue this season is as strong as season one.\n\nBest episode: “Lonely Souls.”\n\nSeason Three: “Aftermath”\n\nEpisodes 2.8 through 2.14\n\nWell, it was nice while it lasted.\n\nMy “third” season of Twin Peaks compartmentalizes all of the series’ weakest elements. Its worst storylines and worst episodes can all be found in this seven-episode stretch, which sees James ditch town for a pointless fling, Nadine succumb to retrograde amnesia, and Ben Horne become a Confederate war general. Hoo boy.\n\nOn the plus side, there are some great episodes in here. The Tim Hunter-directed ninth episode, “Arbitrary Law”—which unmasks Laura’s killer—features one of the series’ most powerful scenes—Coop cradling a dying Leland after he confesses to the crime. As the jail’s malfunctioning sprinklers rain upon them, Coop recites from the Tibetan Book of the Dead, providing Leland absolution before he dies. On the writing side, Harley Peyton and Robert Engels start to take the reigns. I have no idea if either of them emerged as defacto showrunner, but I generally dig their episodes.\n\nAs for the “third” season finale, I decided on “Double Play.” Windom Earle’s first appearance onscreen remains a strong moment, and it kicks off the action for my proposed “fourth” season.\n\nStrengths: Although the show jumps the proverbial shark in its “third” season, it’s still got that Twin Peaks magic, which lends it incredible charm even through its weakest stretch. Gary Hershberger’s Mike, basically unseen since the pilot, gets to shine. Windom Earle’s impending entry to the fray is legitimately menacing.\n\nWeaknesses: Too many to count.\n\nBest episode: “Arbitrary Law.”\n\nSeason Four: “Project Blue Book”\n\nEpisodes 2.15 through 2.22\n\nTwin Peaks was the first show I binged.\n\nThis was years before Netflix streaming, years even before Netflix’s DVD-by-mail service. I was just out of college, and although I’d seen the show’s first season (as well as the movie—don’t judge me), I’d never watched the show in its entirety. Luckily, my mom’d given me the complete series on VHS (!) for my birthday. Over the course of a week, I watched the whole series in grainy, pan-and-scan, LP glory.\n\nEver since that first viewing, the awesomeness of the final eight episodes has lingered with me. When I first encountered the Black Lodge, I felt sure that it’d be impossible for the showrunners to explain what it was without robbing it of its power.\n\nBoy, was I wrong.\n\nOver the course of eight episodes, Twin Peaks imports themes and devices from shows like The Night-Stalker and The X-Files, pitching the Black Lodge as a sort of interdimensional nexus. You can only access it from certain places, and while it’s well-nigh impossible to escape, if you do, you’re liable to pop out at any place—or any time—in the world.\n\nShows like Twin Peaks often straddle the line between science-fiction and fantasy until they’re forced to commit to one. LOST began as a crunchy sci-fi epic in the mode of MYST but eventually committed to contemporary fantasy in its final seasons, much to its detriment, I’d argue. But Twin Peaks gets to have its cake and eat it by treating the Black Lodge as neither magic or science, but paranormal and preternatural. Twin Peaks draws on a great many American folk myths, including an old favorite of mine, the Mothman. As the story goes, the Mothman is an extradimensional entity that supposedly menaced the town of Point Pleasnt, W.Va., in the late sixties, wreaking all manner of mind-bending havoc—delivering confusing reports about the future, teleporting people great distances, and inducing selective amnesia (or time-loss) among its victims. If you ask me, encountering the Mothman sounds a lot like a visit to the Black Lodge. (Side note, Mark Pellington’s 2002 movie The Mothman Prophecies is worth a look. It’s based on John Keel’s (supposedly) nonfiction book of the same name.)\n\nAnyway, in its “fourth” season, Twin Peaks deepens its mythology, placing the eccentric hamlet at the center of an interdimensional superhighway. Incidentally, more of this deeper mythmaking bubbles up in the prequel movie, Fire Walk With Me, as well as its companion work, The Missing Pieces—basically ninety minutes of deleted scenes from the movie. In FWWM and The Missing Pieces, we glimpse new realms (and new citizens) of the Black Lodge, while also bearing witness to some of its temperospatial aftereffects—David Bowie’s Phillip Jeffries teleports across the world in the manner of the X-Men’s Nightcrawler, while Heather Graham’s Annie Blackburn appears to Laura Palmer to warn her of future calamity.\n\nStrengths: An alluringly creepy, paranormal tone. The finale is one of the greatest episodes in TV history.\n\nWeaknesses: The sharp turn into X-Files territory may not be to everyone’s liking, but it’s certainly to mine.\n\nBest episode: “Beyond Life and Death.”\n\nSo those are my proposed four seasons of Twin Peaks. What do you think? How might you rearrange the episodes, if at all? Should someone assemble a new prequel miniseries built from FWWM and The Missing Pieces?\n\nAlso, what does the eighteen-episode revival herald in terms of storytelling? Will Lynch and Frost adhere to the F&L model, delivering two nine-episode “seasons” to us? Or have they essentially written an eighteen-hour movie that’ll unspool in a way none of us can predict?\n\nI don’t know the answer. All I do know is I can’t wait.", "images": ["https://welcometotwinpeaks.com/wp-content/plugins/wordpress-social-login/assets/img/32x32/wpzoom/instagram.png", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/92457410_1292692210941595_2918283119092514040_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=vtJmhJOI5n8AX9Kqesb&oh=7bef877da6fd93464260cb7641a95a73&oe=5EC638C1", "https://welcometotwinpeaks.com/wp-content/plugins/wordpress-social-login/assets/img/32x32/wpzoom/facebook.png", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/c157.0.405.405a/92460890_532536100974936_4721354544182420186_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=bc4InDNsV4AAX9UkFAy&oh=32c10d35c11253da4718f808fe2de2d0&oe=5E9DD58A", "https://secure.gravatar.com/avatar/895e344bc582aa0adc7dae656e4e05fa?s=40&d=mm&r=g", "https://secure.gravatar.com/avatar/bee478837c8f6fc393d7f9b59293ea7e?s=40&d=mm&r=g", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/91702917_147999523420165_942404957732852671_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=zgRxxYWtr3MAX9IlWqE&oh=79984e664b378a7ca87eb427534f3f03&oe=5EC4BA65", "https://secure.gravatar.com/avatar/cdc563bd4bddfca77f9aeac934c38cff?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/plugins/wordpress-social-login/assets/img/32x32/wpzoom/twitter.png", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/c186.0.908.908a/s150x150/92217575_698122150937407_8843041059554169574_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=pbooGhphgh8AX9S1mEv&oh=287c1e00c13aa684eec9bcfa7c593bf7&oe=5EC40A65", "https://secure.gravatar.com/avatar/e46eb9256a645d9d28f24e11c0e4160c?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/uploads/Robert-J.-Peterson_avatar_1485193297-30x30.jpeg", "https://secure.gravatar.com/avatar/2f5b026f50e17b5a1886c173baabd67a?s=30&d=mm&r=g", "https://secure.gravatar.com/avatar/2ae92706d0574928e45cc4cbbba575d1?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/uploads/Robert-J.-Peterson_avatar_1485193297-80x80.jpeg", "https://welcometotwinpeaks.com/wp-content/uploads/white-sands-poster-970x250v2.jpg", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/s150x150/92457029_677315936365153_6089173411196124613_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=fLCEVwfYlXwAX9uX5gG&oh=2832633b67eeec9ef60e8111932c3dcb&oe=5E9E2E75", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/92457029_677315936365153_6089173411196124613_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=fLCEVwfYlXwAX9uX5gG&oh=422f5f254a8e2853f50bec1db1b526cb&oe=5E9E1237", "https://welcometotwinpeaks.com/wp-content/uploads/judy.png", "https://secure.gravatar.com/avatar/02d0368f75b0df31ee4730248489e58b?s=40&d=mm&r=g", "https://secure.gravatar.com/avatar/ed2b70d17cb490c46fed1e49f2deef45?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/plugins/wordpress-social-login/assets/img/32x32/wpzoom/google.png", "https://secure.gravatar.com/avatar/d58a073229ebe6bbcd3b958c4bc01994?s=30&d=mm&r=g", "https://secure.gravatar.com/avatar/10cf0befbb1e825729e546bf1a3a8296?s=30&d=mm&r=g", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/c186.0.908.908a/s640x640/92217575_698122150937407_8843041059554169574_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=pbooGhphgh8AX9S1mEv&oh=fdd7b625636886dc013bf1d92cb7f661&oe=5EC5718D", "https://secure.gravatar.com/avatar/2f5b026f50e17b5a1886c173baabd67a?s=40&d=mm&r=g", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/c262.0.675.675a/s150x150/91571257_151990979439725_6964370878158230588_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=rYvU_ZjHmAAAX9E7UfM&oh=1ff32e04105db945c3a59515a9f7c2d7&oe=5EC6607C", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/s150x150/91702917_147999523420165_942404957732852671_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=zgRxxYWtr3MAX9IlWqE&oh=ac085d3fd4ef8182efb878f3f911d227&oe=5EC67E06", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/c157.0.405.405a/s150x150/92460890_532536100974936_4721354544182420186_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=bc4InDNsV4AAX9UkFAy&oh=3d747c0f3a336fbb774abfb0666e3ac4&oe=5E9E0EB4", "https://welcometotwinpeaks.com/wp-content/uploads/welcome-to-twin-peaks-rectangle-logo-red-dot.png", "https://secure.gravatar.com/avatar/10cf0befbb1e825729e546bf1a3a8296?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/plugins/wordpress-social-login/assets/img/32x32/wpzoom/tumblr.png", "https://welcometotwinpeaks.com/wp-content/plugins/convertplug/modules/info_bar/functions/config/img/cross.png", "https://secure.gravatar.com/avatar/2677b9e28acf2a91e8b7323846e22a6c?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/uploads/Robert-J.-Peterson_avatar_1485193297-40x40.jpeg", "https://secure.gravatar.com/avatar/60447c6bed6562200bca4d9c4b5f2540?s=40&d=mm&r=g", "https://secure.gravatar.com/avatar/f7664819eb854fdc5f809e7c00bdfa14?s=40&d=mm&r=g", "https://secure.gravatar.com/avatar/450e5728c2226e6f090e64d93eafd412?s=40&d=mm&r=g", "https://welcometotwinpeaks.com/wp-content/uploads/the-four-seasons-of-twin-peaks.jpg", "https://welcometotwinpeaks.com/wp-content/uploads/from-z-to-a-square-1.jpg", "https://www.facebook.com/tr?id=541414089570067&ev=PageView&noscript=1", "https://secure.gravatar.com/avatar/53071fe5f589f4d02138f2ee9d735dd2?s=40&d=mm&r=g", "https://secure.gravatar.com/avatar/8b2f23fe7e274bf2edfda7ffff4efc93?s=40&d=mm&r=g", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/c262.0.675.675a/s640x640/91571257_151990979439725_6964370878158230588_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=rYvU_ZjHmAAAX9E7UfM&oh=f4169e722e266a67cf7892b916073932&oe=5EC54294", "https://welcometotwinpeaks.com/wp-content/uploads/wttp-2019-logo-invert.png", "https://www.facebook.com/tr?id=510919386527330&ev=PageView&noscript=1", "https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/e35/s150x150/92457410_1292692210941595_2918283119092514040_n.jpg?_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=vtJmhJOI5n8AX9Kqesb&oh=c7f8b9b0fae15451ce1d5e0914163e58&oe=5EC49846", "https://welcometotwinpeaks.com/wp-content/plugins/media-ace/includes/lazy-load/images/blank.png", "http://media.fastclick.net/w/get.media?sid=110276&m=1&tp=5&d=s&c=1&vcm_acv=1.4"], "top_img": "https://welcometotwinpeaks.com/wp-content/uploads/the-four-seasons-of-twin-peaks.jpg", "keywords": [], "authors": [], "canonical_link": "https://welcometotwinpeaks.com/theories/the-four-seasons-of-twin-peaks/", "title": "The Four Seasons of Twin Peaks", "meta_data": {"viewport": "initial-scale=1.0, minimum-scale=1.0, height=device-height, width=device-width", "description": "In his first guest post, Robert J. Peterson argues that David Lynch and Mark Frost’s seminal early-90s TV series didn't have two seasons—but four.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "The Four Seasons of Twin Peaks", "description": "In his first guest post, Robert J. Peterson argues that David Lynch and Mark Frost’s seminal early-90s TV series didn't have two seasons—but four.", "url": "https://welcometotwinpeaks.com/theories/the-four-seasons-of-twin-peaks/", "site_name": "Welcome to Twin Peaks", "updated_time": "2017-02-06T16:06:19+00:00", "image": {"identifier": "https://welcometotwinpeaks.com/wp-content/uploads/the-four-seasons-of-twin-peaks.jpg", "secure_url": "https://welcometotwinpeaks.com/wp-content/uploads/the-four-seasons-of-twin-peaks.jpg", "width": 1200, "height": 628}}, "article": {"publisher": "https://facebook.com/welcometotwinpeaks", "tag": "marathon", "section": "Theories", "published_time": "2017-02-02T18:42:53+00:00", "modified_time": "2017-02-06T16:06:19+00:00"}, "fb": {"app_id": 396952867705202}, "twitter": {"card": "summary_large_image", "description": "In his first guest post, Robert J. Peterson argues that David Lynch and Mark Frost’s seminal early-90s TV series didn't have two seasons—but four.", "title": "The Four Seasons of Twin Peaks", "site": "@ThatsOurWaldo", "image": "https://welcometotwinpeaks.com/wp-content/uploads/the-four-seasons-of-twin-peaks.jpg", "creator": "@robertjpeterson", "account_id": 237944041}, "keywords": "twin peaks,david lynch,dale cooper,laura palmer,log lady,killer bob,audrey horne,black lodge,fire walk with me,mark frost,tv", "ir-site-verification-token": "-762329165", "generator": "Improved Badges for WooCommerce", "msapplication-TileImage": "https://welcometotwinpeaks.com/wp-content/uploads/cropped-judy-favicon-270x270.png", "g1": {"switch-skin-css": "https://welcometotwinpeaks.com/wp-content/themes/bimber/css/7.1.1/styles/mode-dark.min.css"}}, "movies": [], "publish_date": 1486060973.0, "source": "https://welcometotwinpeaks.com", "summary": ""}