{"url": "https://web.archive.org/web/20180422235223/http://nrtonline.info/breaking-british-intelligence-seizes-clinton-foundation-warehouse-400-million-in-cash/", "text": "Tweet\n\nThe Clinton Foundation is once again trying to distance itself from a scandal surrounding something they’re involved in. This time, the warehouse they use in the UK to store food and toiletries to make ready for shipping to Africa and Indonesia was raided by MI6.\n\nThe warehouse, which is leased by the Foundation and one other tenant, is owned by a man known for shady arms deals and exploiting cheap Asian labor for counterfeit goods. The Brits took down his office and storage space, finding 400 Million in US Dollars. Maleek Bin Shalakta has been on the UK terrorist watch list for some time.\n\nThe Foundation claims to only be renting the space. Chelsea Clinton’s assistant told LLOD correspondent Cynthia Luwhoe:\n\nYou Might Also Like\n\n“Who owns the building is irrelevant. We rented through an agency.”\n\nThe agency in question is also owned by Bin Shalakta, as is the trucking company the Foundation uses in France, Germany and Latkavia. Commander Ian Humes says the coincidences are far too many to ignore:\n\n“What interests us is that the cash is the same amount as the US payments to Iran for hostages. It was palletted and wrapped in US State Department palstic sheeting. We believe we may be looking at more than money laundering here. This may be a massive fraud perpetrated against Americans and the world.”\n\nWhat we’re looking at here is yet another crime against America. Once MI6 is finished processing the scene they’ve vowed to work with the FBI to figure out if there’s a connection. We’ll keep you updated.", "images": ["https://web.archive.org/web/20180422235223im_/http://0.gravatar.com/avatar/3a3c9f5db53c27e9b462e991aedf22dc?s=70&d=mm&r=g", "https://web.archive.org/web/20180422235223im_/http://nrtonline.info/wp-content/uploads/2018/04/181-678x381.jpg"], "top_img": "", "keywords": [], "authors": ["George Swenson"], "canonical_link": "https://web.archive.org/web/20180422235223/http://nrtonline.info/breaking-british-intelligence-seizes-clinton-foundation-warehouse-400-million-in-cash/", "title": "BREAKING: British Intelligence Seizes Clinton Foundation Warehouse, $400 Million In Cash – NRTOnline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.5", "fb": {"pages": 589219961239603}, "ia": {"markup_url": "http://nrtonline.info/breaking-british-intelligence-seizes-clinton-foundation-warehouse-400-million-in-cash/?ia_markup=1"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}