{"url": "https://www.etonline.com/caitlyn-jenner-opens-up-about-tough-relationship-with-her-kids-102833", "text": "Caitlyn Jenner is opening up about the difficulty of maintaining a relationship with her kids following her gender transition, the mistakes she’s made in her journey and how she once thought the only time she would get to publicly wear woman’s clothing would be in her coffin.\n\n\n\nThe 68-year-old reality television star pours her heart out during a new profile for Broadly, in which she discusses her strained family relationships.\n\n“I spend a lot of time by myself here in the house,” she tells transgender journalist Diana Tourjee. “I have a lot of children, but sometimes just because of circumstances, maintaining a close relationship with your kids is very tough. They all have lives. They’ve all moved on.”\n\n“We’re just human beings; we’re going to be here for a very short time,” Caitlyn adds. “We come and we go and at the end, when it’s all said and done, hopefully your family is going to be there.”\n\nCaitlyn also goes into detail about her initial plans to complete a gender transition by the time she turned 40, in 1989, only to get started, then backtrack, after she and then-wife, Kris Jenner, welcomed their daughter, Kendall, in 1995.\n\nAccording to the article, Caitlyn underwent more than four years of hormone therapy and had developed “a little B-cup” by the time she met Kris (who denied knowing that Caitlyn -- who went by Bruce at the time -- was transgender when they met, during an episode of Keeping Up With the Kardashians).\n\n\"When Kendall was born, I had liposuction and got rid of [my breasts],” explains Caitlyn, who welcomed a second daughter, Kylie, with Kris in 1997, and has four other children from previous relationships. “Because I thought, ‘I can’t even go swimming with my kid.’”\n\nKim Kardashian Shares Throwback of Mom Kris With Caitlyn Jenner Before Her Transition This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Kim Kardashian Shares Throwback of Mom Kris With Caitlyn Jenner Before Her Transition\n\nWhile she completed the transformation in 2017, she says there was a time when she imagined Caitlyn might only ever materialize upon the death of Bruce -- sharing how years ago she wanted to state in her will that she wished to be buried in female clothing.\n\n“I thought about that a lot over the years,” she says. “And, it would shock everybody. Screw ‘em.”\n\nAt her lowest point as Bruce, she kept a wig and women’s clothing on board her plane and would allow Caitlyn to come to life while up in the sky, far away from the real world and feeling “free as can be.”\n\nCaitlyn also addresses the controversy ignited by her political views and comments made during media interviews, which have upset the LBGTQ community.\n\n“Along the way, did I make mistakes? Absolutely,” she says. “But I never did it maliciously. I just didn’t know, you know? And I really didn’t realize how critical the community was going to be.”\n\nRegardless of the controversy, she stands by her political standing.\n\n“I think it’s good that I’m on the Republican side because the Republicans know that, and I have an immediate in with them to change their minds,” she says. “The Republicans need the most work when it comes to our issues, I get that. I would rather work from the inside. I’m not the type of person who is going to stand on a street corner with a sign and jump up and down. No, I’m going to go have dinner with these people.”\n\nThe transgender community aren’t the only ones whom she has felt “bashing” her. The Kardashians reportedly felt \"betrayed\" when Caitlyn published her 2017 memoir, The Secrets of My Life.\n\n“I got the trans community out there bashing on me, I got the Kardashians out there bashing on me,” she reflects. “All I do is sit here in the house and try to stay out of trouble.”\n\nSee more on the I Am Cait star below.\n\nRELATED CONTENT:\n\nNEWS: Kim Kardashian Posts Throwback Photo of Caitlyn Jenner Before Her Transition\n\nEXCLUSIVE: Caitlyn Jenner 'Wasn't Happy at First' About Kylie Jenner Becoming a Young Mom, Source Says\n\nNEWS: Caitlyn Jenner Didn’t Trust the Kardashians Not to Leak Her Gender Reassignment Surgery\n\nKhloe Kardashian Says Having a Baby Won't Bring Her and Caitlyn Jenner Back Together This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/caitlyn_jenner_itv_0.jpg?h=d05eaef0&itok=dYhABmrz", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-01/caitlyn_jenner_itv_0.jpg?h=d05eaef0&itok=mgGGM7md", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2015-04/640_chaz_bono_484710715.jpg?itok=gk2RV6GB", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/caitlyn_jenner_itv_0.jpg?h=d05eaef0&itok=dYhABmrz", "keywords": [], "authors": ["Leena Tailor"], "canonical_link": "https://www.etonline.com/caitlyn-jenner-opens-up-about-tough-relationship-with-her-kids-102833", "title": "Caitlyn Jenner Opens Up About ‘Tough’ Relationship With Her Kids", "meta_data": {"article": {"opinion": "false"}, "title": "Caitlyn Jenner Opens Up About ‘Tough’ Relationship With Her Kids | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/caitlyn-jenner-opens-up-about-tough-relationship-with-her-kids-102833", "title": "Caitlyn Jenner Opens Up About ‘Tough’ Relationship With Her Kids", "description": "The reality star also explained how she hopes to help the LGBTQ community by being a Republican.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/caitlyn_jenner_itv_0.jpg?h=d05eaef0&itok=dYhABmrz", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The reality star also explained how she hopes to help the LGBTQ community by being a Republican.", "title": "Caitlyn Jenner Opens Up About ‘Tough’ Relationship With Her Kids", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Leena Tailor‍", "url": "https://www.etonline.com/caitlyn-jenner-opens-up-about-tough-relationship-with-her-kids-102833", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/caitlyn_jenner_itv_0.jpg?h=d05eaef0&itok=dYhABmrz"}, "description": "The reality star also explained how she hopes to help the LGBTQ community by being a Republican.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, TV, Caitlyn Jenner, Bruce Jenner, Keeping Up With The Kardashians, Kylie Jenner, Kendall Jenner, Kris Jenner", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}