{"url": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success", "text": "A loyal Patriots fan, Timothy Caulfield recently confessed in Policy Options Magazine that, should the seriously “dreamy” Tom Brady ever need a kidney, “I’m there for him.”\n\nBut not even Brady’s epic Super Bowl win is enough to make Caulfield question whether he’s been wrong all along about the quarterback’s freakishly restricted diet, certain elements of which, writes Caulfield, holder of the University of Alberta’s Canada research chair in health law and policy, “register as full out kook.”\n\nBrady and his supermodel wife Gisele Bündchen reportedly follow an 80-per-cent alkaline, 20-per-cent acidic diet — a meal plan the NFL quarterback famously told Sports Illustrated in 2014 provides “balance and harmony through my metabolic system.”\n\nBrady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits (“I’ve never eaten a strawberry in my life,” he told New York magazine last year), caffeine, MSG, iodized salt (pink Himalayan only) and dairy.\n\nHe does enjoy avocado-based ice cream.\n\nThe “ageless wonder” quarterback credits his insanely disciplined diet for his success and, at 39, says he has no plans for retiring (“Too bad babe,” he reportedly told Bündchen when she asked him to hang up his jersey after the Patriot’s stunning comeback Sunday, “I’m having too much fun.”)\n\nBut is there any science to support his austere eating plan?\n\n“He’s such a good example of an anecdote overwhelming the data,” Caulfield says. “And the media usually give him the ‘you-can’t-argue-with success’ treatment.”\n\nParts of Brady’s diet are undoubtedly healthy, Caulfield allows. He’s eating more “real” food. He avoids junk food. All good, he says.\n\n“But what often happens with these fad diets is, a little bit of good is wrapped in a blanket of pseudoscience, and the whole package is sold even though there’s no data to support it.”\n\nBrady appears to subscribe to an alkaline diet popularized by Robert O. Young, author of “The pH Miracle” book series. Young is an American naturopath now facing three years and eight months in a California jail for practising medicine without a licence. According to the BBC, he bought his PhD from a diploma mill.\n\nThe alkaline view is based on the (scientifically discredited) theory people need to consume a diet high in alkaline foods in order to maintain the pH of the blood. If blood becomes too acidic, the hypothesis holds, the body starts leaching calcium and other minerals from the bones, muscles and major organs, and bad things start to happen.\n\nDr. Rena Mendelson begs to differ. Our bodies naturally control our pH levels, says Mendelson, a professor in the school of nutrition at Ryerson University in Toronto.\n\n“It’s not something we even need to be conscious of, because our normal homeostatic mechanisms allow us to adapt to a range of different foods or fluids or whatever it is we consume,” she says.\n\n“How would the rest of us be walking around and performing well in our day-to-day life if we had to pay attention to the acidity or alkalinity of the foods we consume?”\n\nIf I had Tom Brady’s personal chef I would eat healthy, too\n\nThere’s nothing wrong with a diet that’s high in vegetables and whole grain. Eliminating any one food also isn’t a problem, Mendelson says. Strawberries aren’t essential to the diet. Neither are tomatoes.\n\nBut tossing out an entire food group — nightshades, for example — can be problematic. Nightshades are high in nutrients, high in the proven Mediterranean diet and are actually anti-inflammatory, says Calgary University registered dietician and epidemiologist Tanis Fenton.\n\nWe don’t need pure sugar. But neither do we need to cut out fruit because it has sugar, she says.\n\nLast year, Fenton published a systematic review of the association between diet acidic load, and cancer. Her conclusion: “Almost no actual research” exists to prove or disprove these diets for cancer prevention or treatment.\n\nBrady is a phenomenal athlete, Fenton says. “And he very modestly is suggesting his diet is the reason, but, no. That’s not good evidence, because it’s a case study – it’s one individual, and an individual endowed with a wonderful genetic predisposition to be an athlete, obviously. Because diet alone doesn’t make us phenomenal athletes like him.”\n\nStill, Caulfield’s research has shown people subscribe to celebrities over any other source of authority. Celebrity trumps everything.\n\nBrady isn’t alone: Think of swimmer Michael Phelps’ embrace of “cupping” at the Rio games, and super-cold cryotherapy devotee LeBron James. There’s a sociological phenomenon that suggests we can’t help, consciously or not, be influenced by celebrities, Caulfield says. “We’re all comparison machines — we can’t help but compare ourselves to others. For most of human history that was a pretty small cohort. Now it’s people like Tom Brady.”\n\n“They have such huge cultural footprint — they own social media, they own popular culture. We can’t help but hear the things they talk about.”\n\nBut he worries the pseudoscience noise complicates the story about how to live a healthy lifestyle.\n\n“It makes it sound like eating healthy is hard and expensive. People will go, “if I had Tom Brady’s personal chef I would eat healthy, too.’ And that’s a terrible message,” he says.\n\n“Eating healthy doesn’t have to be complicated.”", "images": ["https://googleads.g.doubleclick.net/pagead/viewthroughconversion/990309138/?value=0&guid=ON&script=0", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-twitter.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-share.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-email.svg", "https://nationalpostcom.files.wordpress.com/2017/02/afp_lg1yi1.jpg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-tumblr.svg", "https://s1.wp.com/wp-content/themes/vip/postmedia-plugins/postmedia-geolocation/images/weather/hp_w_ibn_l.svg", "https://nationalpostcom.files.wordpress.com/2017/02/patriots-falcons-super-bowl-football8.jpg?w=620&quality=60&strip=all", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/logo-header-np.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-reddit.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/logo-footer-np.png", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-instagram.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-youtube.svg", "https://nationalpostcom.files.wordpress.com/2017/02/afp_le1rv.jpg?w=620&quality=60&strip=all", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-linkedin.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-rss.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/logo-postmedia.png", "https://nationalpostcom.files.wordpress.com/2017/02/633958880.jpg?w=620&quality=60&strip=all", "https://nationalpostcom.files.wordpress.com/2017/02/632870780.jpg?w=620&quality=60&strip=all", "http://2.gravatar.com/avatar/24c168fa88e2f44064d08cfdc0af269e?s=96&d=mm&r=g", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAQAAAADCAQAAAAe/WZNAAAADklEQVR42mNkgAJGDAYAAFEABCaLYqoAAAAASUVORK5CYII=", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/button_close_black.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-googleplus.svg", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-facebook.svg", "https://nationalpostcom.files.wordpress.com/2017/02/afp_lg1yi1.jpg?quality=80&strip=all&w=780", "https://pixel.wp.com/b.gif?v=noscript", "https://s2.wp.com/wp-content/themes/vip/postmedia-theme-npfp/images/icon-pinterest.svg"], "top_img": "https://nationalpostcom.files.wordpress.com/2017/02/afp_lg1yi1.jpg", "keywords": [], "authors": [], "canonical_link": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success", "title": "Is Tom Brady's diet — no nightshades or fruit — the secret behind his success?", "meta_data": {"robots": "noarchive", "description": "Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits, caffeine, MSG, iodized salt (pink Himalayan only) and dairy", "news_keywords": "diet and nutrition, healthy eating, rena mendelson, robert young, tanis fenton, timothy caulfield, tom brady", "google-site-verification": "ryJYjEHNyNzMUhMyJ8vBr_Ii7-S6pUIXdKWA6I7HH1g", "generator": "WordPress.com", "og": {"type": "article", "title": "Is Tom Brady’s diet — no nightshades or fruit — the secret behind his success?", "url": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success", "description": "Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits, caffeine, MSG, iodized salt (pink Himalayan only) and dairy", "site_name": "National Post", "image": {"identifier": "https://nationalpostcom.files.wordpress.com/2017/02/afp_lg1yi1.jpg", "width": 620, "height": 465}, "locale": "en_US"}, "article": {"published_time": "2017-02-07T19:50:40+00:00", "modified_time": "2017-02-07T19:50:40+00:00", "publisher": "https://facebook.com/nationalpost"}, "twitter": {"creator": "@acoyne", "site": "@nationalpost", "text": {"title": "Is Tom Brady’s diet — no nightshades or fruit — the secret behind his success?"}, "card": "summary_large_image", "image": "https://nationalpostcom.files.wordpress.com/2017/02/afp_lg1yi1.jpg", "title": "Is Tom Brady's diet — no nightshades or fruit — the secret behind his success?", "description": "Brady shuns white sugar, white flour, nightshade vegetables (tomatoes, eggplant, mushrooms), most fruits, caffeine, MSG, iodized salt (pink Himalayan only) and dairy"}, "stats-full-init": "0.018", "stats-postmedia_theme_pre_initialize": "0.001", "stats-initialize": "0.016", "stats-postmedia_theme_post_initialize": "0.001", "stats-vip_load_plugins": "0.002", "stats-load_plugins": "0.011", "stats-register_widgets": "0.001", "fb": {"pages": 48139565306, "app_id": 114466555268868, "page_id": 110225254594, "admins": 100002625504753}, "ia": {"markup_url": "https://nationalpost.com/news/canada/is-tom-bradys-diet-no-nightshades-or-fruit-backed-by-science-to-be-behind-his-success?ia_markup=1"}, "ROBOTS": "NOARCHIVE", "vf": {"unique_id": "30a40717-53af-4051-aa1b-37e0c7de71c7"}, "application-name": "National Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Canadian News, World News and Breaking Headlines", "msapplication-task": "name=Subscribe;action-uri=https://nationalpost.com/feed;icon-uri=https://secure.gravatar.com/blavatar/bf69214e83fdd5520e4b5d91ba3b7d64?s=16"}, "movies": [], "publish_date": 1486497040.0, "source": "https://nationalpost.com", "summary": ""}