{"url": "www.thesun.co.uk/tvandshowbiz/1884948/angelina-jolie-asks-to-keep-all-her-jewellery-in-divorce-from-brad-pitt-including-that-194k-engagement-ring/", "text": "BRAD Pitt and Angelina Jolie could be set to do battle over their bling, divorce papers have revealed.\n\nIn the documents, filed on September 19 in LA, Angelina has asked for \"miscellaneous jewellery and other personal effects\" as part of the split.\n\n8 Angelina has requested to keep the jewellery she has accumulated during her marriage to Brad Credit: Getty Images - WireImage\n\n8 She also wants to keep her white diamond engagement ring that was designed to suit her fingers Credit: The Communications Group\n\nThe Hollywood stars shocked the world when they announced their divorce after 12 years together and two years of marriage.\n\nAccording to The Hollywood Reporter, the battle of the bling will include many expensive jewels that Brad, 52, gave Angelina, including her impressive £194,000 ($250,000) engagement ring designed by Robert Procop.\n\nThe World War Z actor worked with Robert for more than a year to create the perfect engagement ring for Angelina.\n\nThe design featured a graduated white-diamond which Procop said would flatter Angelina's fingers.\n\n8 Angelina's Lorraine Schwartz earrings cost almost £2million Credit: Getty Images - WireImage\n\nBrad and Angelina had a long-running partnership with Procop and even collaborated with him on the Style of Jolie collection in 2010.\n\nThe proceeds of her collection were donated to the Education Partnership for Children of Conflict, which she founded in 2006.\n\nHer collection started at £3,100 ($4,000) and were estimated to reach seven figures for a 103.48-carat necklace of Colombian emeralds.\n\nRELATED STORIES ‘Brad is very, very handsome’ Kate Hudson admits crush on Brad Pitt following his split 'It's not about Jennifer' Courteney Cox reveals frustration at best friend being dragged into Brangelina divorce 'TERRIBLE NEWS FOR THOSE CHILDREN' Jennifer Aniston's husband Justin Theroux responds to Brangelina divorce TROLLS HIT PITT Sick hackers are claiming Brad Pitt has died in twisted attempt to access people's private information brad pulls out Brad Pitt pulls out of promoting film to focus on 'family situation' KIM KAR-GNASH-IAN The reality queen flashes new gold grill in ANOTHER extremely busty selfie THE LOOK OF LOVE Kim Kardashian and Kanye West look as loved up as ever in tender moment as Paris Fashion Week Hole-y smokes! Kim Kardashian steals the show in daring mesh dress as she watches Gigi Hadid at Balmain THE ULTIMATE GIRLBAND Kim and Kourtney Kardashian stun in co-ordinated skimpy metallic outfits at Balmain afterparty GOING DOWN UNDER Robbie Williams makes crude joke about Kylie Minogue... while addressing Spice Girls sex rumours\n\nHowever, her jewellery box has accumulated many more pricey baubles during her romance with Brad.\n\nBack in 2009, at the height of their red carpet fame, Angelina sported large drop earrings by celebrity jeweller Lorraine Schwartz, kick-starting a trend for the green stone.\n\n8 The matching emerald ring was an impressive 65 carats Credit: Getty Images\n\nThe impressive earrings are worth £1.9million ($2.5million) and the Colombian emeralds weighed in a 115 carats.\n\nThe large matching ring was 65 carats and is worth more than £770,000 ($1million) but it is not known if she kept the impressive jewels.\n\n8 Angelina wore these diamond earrings by Procop to the Oscars in 2014 Credit: Getty Images - WireImage\n\n8 She wore her pearl earrings to mee the Queen in 2014 Credit: Getty Images\n\nAngelina sported Procop 42 carat diamond earrings set in 18-karat gold for the 2014 Academy Awards when she received the Jean Hersholt Humanitarian Award.\n\nPitt wore a sapphire ring from the Style of Jolie collection and a set of tuxedo buttons and cuff links in 18-karat yellow gold and tablet-cut white diamonds proving Angie isn't the only one who is a fan of some hefty bling.\n\n8 Procop designed this impressive diamond choker for her to wear in The Tourist opposite Johnny Depp Credit: Film Company\n\nProcop also designed the impressive choker of round diamonds set in platinum she wore in The Tourist opposite Johnny Depp in 2010.\n\nThe Tomb Raider star also has pearl earrings and a pearl necklace in her personal collection.\n\nShe wore the pearl earrings when she met the queen in 2014.\n\nMeanwhile, People magazine reported this week that the pair are working on the divorce \"behind closed doors\" and will only go to court when they have finalised an agreement.\n\n8 Brad, Angelina and their son Maddox at the Oscars Credit: Getty Images\n\nAngelina is seeking sole physical custody but joint legal custody of their six children, Maddox, 15, Pax, 12 Zahara, 11, Shiloh, ten, and eight-year-old twins, Knox and Vivienne.\n\nMaddox, Zahara and Pax were adopted from orphanages in Cambodia, Ethiopia and Vietnam, respectively.\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/uploads/2016/09/ring-landscape-3-x-2.jpg?strip=all&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2016/09/ring-landscape-3-x-2.jpg?strip=all&w=750&h=500&crop=1", "keywords": [], "authors": ["Elaine Mccahill"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/1884948/angelina-jolie-asks-to-keep-all-her-jewellery-in-divorce-from-brad-pitt-including-that-194k-engagement-ring/", "title": "Angelina Jolie asks to keep all her jewellery in divorce from Brad Pitt- including THAT £194K engagement ring", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Angelina wants to keep all her jewellery in Brad divorce - including THAT £194K engagement ring", "url": "https://www.thesun.co.uk/tvandshowbiz/1884948/angelina-jolie-asks-to-keep-all-her-jewellery-in-divorce-from-brad-pitt-including-that-194k-engagement-ring/", "description": "BRAD Pitt and Angelina Jolie could be set to do battle over their bling, divorce papers have revealed. In the documents, filed on September 19 in LA, Angelina has asked for “miscellaneous jew…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2016/09/ring-landscape-3-x-2.jpg?strip=all&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Angelina Jolie"}, "locale": "en_GB"}, "article": {"published_time": "2016-09-30T10:23:58+00:00", "modified_time": "2016-10-01T02:25:36+00:00", "publisher": 161385360554578, "tag": "Angelina Jolie, Brad Pitt, Angelina Jolie and Brad Pitt split", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The Hollywood stars shocked the world with their divorce news earlier this month", "keywords": "Brad and Angelina split, engagement ring, jewellery", "news_keywords": "Brad and Angelina split, engagement ring, jewellery", "twitter": {"text": {"title": "Angelina Jolie asks to keep all her jewellery in divorce from Brad Pitt – including THAT £194K engagement ring"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "HEIRLOOM RAIDER", "headline": "Angelina wants to keep all her jewellery in Brad divorce - including THAT £194K engagement ring", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2016/09/ring-landscape-3-x-2.jpg?strip=all&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2016/09/ring-landscape-3-x-2.jpg?strip=all&w=620&h=413&crop=1"}}, "parsely-post-id": 1884948, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1475231038.0, "source": "http://www.thesun.co.uk", "summary": ""}