{"url": "https://variety.com/2017/tv/news/daphne-oz-leaving-the-chew-abc-exit-1202524344/", "text": "Daphne Oz is leaving ABC’s daytime foodie talk show “The Chew,” Variety has confirmed.\n\nOz has been on “The Chew” since its start in 2011, along with co-hosts Carla Hall, Mario Batali, Michael Symon and Clinton Kelly. Oz will not be replaced for the seventh season, which kicks off on Sept. 5.\n\n“It has been so much fun having lunch with you on TV’s most delicious daytime show for the past six seasons, and I am immensely grateful to have found dear friends in my co-hosts and our team,” Oz said in a statement. “I have had the great privilege of growing up at our family table, and have shared some huge milestones along the way — including the birth of my first two children, and recent announcement of a third on the way! — and am lucky to have had ‘The Chew’ as a bright beginning to my career.”\n\nOz — the daughter of TV personality Dr. Oz — is a nutritional author, who first broke out on the scene with her best-selling book “The Dorm Room Diet,” which she wrote in 2006 when she was a college student. Aside from “The Chew,” she is also known for her regular appearances on various shows, including Food Network’s “Cooks vs. Cons.”\n\n“The Chew” creator and executive producer Gordon Elliott said, “She is one of the greatest natural broadcasters I have ever worked with. The moment she sat at the table with Mario, Clinton, Michael and Carla, I knew we had a great television show. Her chemistry, honesty and intelligence are her trademarks, and they will stand with her wherever she goes.”\n\nRebecca Campbell, president, ABC-owned stations and daytime, added, “When Daphne started with us, she had recently graduated college, was a new bride and ready to take on the world. She is now a mother, broadcaster, writer and inspiration to millions of viewers whom she has shown how to create healthier eating options for themselves and their families. She really has created a unique brand for herself and the network.”\n\n“The Chew” has been nominated for seven Emmy awards and has won two awards for outstanding informative talk show and outstanding informative talk show host for the group, including Oz, whose departure was first reported by TV Line.", "images": ["https://pmcvariety.files.wordpress.com/2017/08/daphne-oz.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fdaphne-oz-leaving-the-chew-abc-exit-1202524344%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202524344&comment_count=86", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/08/daphne-oz.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2017/tv/news/daphne-oz-leaving-the-chew-abc-exit-1202524344/", "title": "Daphne Oz Leaving ABC’s ‘The Chew’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Daphne Oz is leaving ABC's \"The Chew\" ahead of Season 7. She will not be replaced.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202524344, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-11T14:28:25"}, "pmc-tag": "The Chew", "title": "Daphne Oz Leaving ABC’s ‘The Chew’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Daphne Oz Leaving ABC’s ‘The Chew’", "url": "https://variety.com/2017/tv/news/daphne-oz-leaving-the-chew-abc-exit-1202524344/", "description": "Daphne Oz is leaving ABC’s daytime foodie talk show “The Chew,” Variety has confirmed. Oz has been on “The Chew” since its start in 2011, along with co-hosts Carla Hal…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/daphne-oz.jpg?w=1000", "width": 1000, "height": 563, "alt": "Daphne Oz leaving the chew"}, "locale": "en_US"}, "article": {"published_time": "2017-08-11T21:28:25+00:00", "modified_time": "2017-08-11T21:28:25+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "Daphne Oz Leaving ABC’s ‘The Chew’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/daphne-oz.jpg?w=1000", "alt": "Daphne Oz leaving the chew"}, "card": "summary_large_image", "title": "Daphne Oz Leaving ABC’s ‘The Chew’", "description": "Daphne Oz is leaving ABC's \"The Chew\" ahead of Season 7. She will not be replaced."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202524344, "title": "Daphne Oz Leaving ABC's 'The Chew'", "published_at": "2017-08-11 14:28:25", "image": "https://pmcvariety.files.wordpress.com/2017/08/daphne-oz.jpg?w=1000", "comment_count": 86, "tags": "The Chew", "topics": "News", "appeared_in_print": "No", "body": "Daphne Oz is leaving ABC's daytime foodie talk show \"The Chew,\" Variety has confirmed.\r\n\r\nOz has been on \"The Chew\" since its start in 2011, along with co-hosts Carla Hall, Mario Batali, Michael Symon and Clinton Kelly. Oz will not be replaced for the seventh season, which kicks off on Sept. 5.\r\n\r\n“It has been so much fun having lunch with you on TV’s most delicious daytime show for the past six seasons, and I am immensely grateful to have found dear friends in my co-hosts and our team,\" Oz said in a statement. \"I have had the great privilege of growing up at our family table, and have shared some huge milestones along the way — including the birth of my first two children, and recent announcement of a third on the way! — and am lucky to have had 'The Chew' as a bright beginning to my career.\"\r\n\r\nOz -- the daughter of TV personality Dr. Oz -- is a nutritional author, who first broke out on the scene with her best-selling book \"The Dorm Room Diet,\" which she wrote in 2006 when she was a college student. Aside from \"The Chew,\" she is also known for her regular appearances on various shows, including Food Network's \"Cooks vs. Cons.\"\r\n\r\n\"The Chew\" creator and executive producer Gordon Elliott said, “She is one of the greatest natural broadcasters I have ever worked with. The moment she sat at the table with Mario, Clinton, Michael and Carla, I knew we had a great television show. Her chemistry, honesty and intelligence are her trademarks, and they will stand with her wherever she goes.”\r\n\r\nRebecca Campbell, president, ABC-owned stations and daytime, added, \"When Daphne started with us, she had recently graduated college, was a new bride and ready to take on the world. She is now a mother, broadcaster, writer and inspiration to millions of viewers whom she has shown how to create healthier eating options for themselves and their families. She really has created a unique brand for herself and the network.”\r\n\r\n\"The Chew\" has been nominated for seven Emmy awards and has won two awards for outstanding informative talk show and outstanding informative talk show host for the group, including Oz, whose departure was first reported by TV Line.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1502486905.0, "source": "https://variety.com", "summary": ""}