{"url": "https://www.bustle.com/articles/53673-15-things-you-should-never-say-to-a-hardcore-katy-perry-fan", "text": "Though I completely missed out on her early Christian music career, I've been a major Katy Perry fan for a long time. Way back in 2007, before \"I Kissed a Girl\" topped the charts, I was forcing my friends to listen to songs like \"Waking Up In Vegas\" and \"I'm Still Breathing\" on Perry's MySpace page (songs that would eventually appear on her mainstream debut, One of the Boys). Something told me Perry was on the verge of making it big. Shockingly, I was right! Seven years, three albums, and nine No. 1 singles later, Perry is one of the biggest names in pop music. She's a superstar, and she has millions upon millions of devoted fans worldwide.\n\nOf course, she also has a lot of haters. Make no mistake, there are definitely legitimate reasons to criticize Perry. For example, \"I Kissed a Girl\" is eye roll–inducing, \"Ur So Gay's\" lyrics are homophobic, and her recent instances of offensive cultural appropriation are beyond infuriating. I've taken the now 30-year-old hit-maker to task for all of these issues in the past (and will continue to do so in the future) — but darn it, I still love a lot of her music. If you ask me, Perry catches her fair share of unwarranted flack, too.\n\nHere are 15 things you should never say to a hardcore Katy Perry fan:\n\n\"She can't sing.\"\n\nDo you realize how ridiculous you sound right now? Could a woman who \"can't sing\" sell 11 million albums and 81 million singles worldwide? Think before you speak. Perry may not possess the vocal power of Mariah Carey in her prime, but SHE CAN SING. More than that, her voice is beautiful, unique, and instantly recognizable.\n\n\"She's so manufactured. She doesn't even write her own music.\"\n\nPerry either wrote or co-wrote every song that appears on each of her four solo albums (even 2001's Katy Hudson). Please, have several seats. Additionally, did you know that Perry has co-penned hit tracks for artists like Kelly Clarkson and Iggy Azalea? So, not only does she write her own music, she writes music for other artists, as well. She's pretty good at it, too! The more you know.\n\n\"She can't win a Grammy to save her life.\"\n\nHow many Grammys have you won, stinky? That's what I thought. Besides, she'll win one eventually.\n\n\"Teenage Dream didn't deserve to be nominated for Album of the Year.\"\n\nYeah, you're right. An album full of fun, emotional, expertly crafted, and commercially successful (not to mention trend-setting) pop songs definitely didn't deserve to be nominated for Album of the Year at the Grammys. How silly of me!\n\n\"She'll never top Teenage Dream.\"\n\nPerry made history with Teenage Dream: she's the first and only female artist to have launched five consecutive No. 1 singles from the same album. I've learned to never underestimate her — I'd suggest you do the same.\n\n\"She can't dance.\"\n\nAdmittedly, Perry isn't the best dancer in the world, but who cares? You don't have to be a good dancer in order to be a good pop star. Expand your mind!\n\n\"All of her songs sound the same.\"\n\nClean your ears.\n\n\"She'd be nothing without Dr. Luke and Max Martin.\"\n\nWhy is it so hard for some people to accept that Perry, a young woman, is also responsible for the success of her music? We've already established that she writes her own songs. Why is it so easy for some people to believe that two men are running the show from behind the scenes? Food for thought.\n\n\"She copied Sara Bareilles' 'Brave' with 'Roar.'\"\n\n\"Roar\" was reportedly written before the release of \"Brave.\" Not even Sara Bareilles thinks Perry copied the song. Try again.\n\n\"She's not talented.\"\n\nI honestly don't even have the energy for this right now.\n\n\"'Birthday' flopped.\"\n\nAnd I'll never forgive the world for it.\n\n\"Her hair looks stupid.\"\n\nBe nice.\n\n\"Anyone could've written a song like 'Firework.' It's so easy.\"\n\nCool! I can't wait for your lucrative career as a hit songwriter to begin.\n\n\"She looks like Zooey Deschanel.\"\n\n...OK, you kind of have a point.\n\n\"She's fading.\"\n\nShe just booked the Super Bowl...\n\nBye!\n\nImages: Giphy (17)", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/4dd526cb-d34a-498f-a28a-5978345e8f75.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/13/4dd526cb-d34a-498f-a28a-5978345e8f75.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/4dd526cb-d34a-498f-a28a-5978345e8f75.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/53673-15-things-you-should-never-say-to-a-hardcore-katy-perry-fan", "title": "15 Things You Should Never Say to a Hardcore Katy Perry Fan", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/53673-15-things-you-should-never-say-to-a-hardcore-katy-perry-fan", "type": "article", "title": "Don't Say These Things to a Katy Perry Fan", "description": "Though I completely missed out on her early Christian music career, I've been a major Katy Perry fan for a long time. Way back in 2007, before \"I Kissed a Girl\" topped the charts, I was forcing my friends to listen to songs like \"Waking Up In Vegas\"…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/4dd526cb-d34a-498f-a28a-5978345e8f75.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Though I completely missed out on her early Christian music career, I've been a major Katy Perry fan for a long time. Way back in 2007, before \"I Kissed a Girl\" topped the charts, I was forcing my friends to listen to songs like \"Waking Up In Vegas\"…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}