{"url": "https://variety.com/2018/tv/news/the-magicians-musical-all-that-josh-trevor-einhorn-sera-gamble-john-mcnamara-interview-1202720783/", "text": "In its third season, “The Magicians” has no intention of resting on its laurels. In addition to a quest to restore magic, exploring a character’s posthumous escapades, and depicting silent scenes as characters communicate exclusively in American Sign Language, the Syfy series is embarking upon a musical episode.\n\nThe idea came from executive producer John McNamara. After seeing the one-time performance of “One Day More” take off with audiences in the second season, he wanted to go all in.\n\n“Right around the time we realized the ‘Les Miserables’ number last year was going to work, John was like, ‘So next season I have this idea for how to do an episode where all of the talking is singing,'” executive producer Sera Gamble tells Variety.\n\nAlthough slightly less enthusiastic about the idea at first, Gamble came around. “This episode really represents me talking him just a step or two back from that ledge,” she continues.\n\nAsking their cast to break into song has been part of Gamble and McNamara’s “The Magicians” tasks since the beginning. The first season featured a scene where Quentin (Jason Ralph) performed a quick rendition of Taylor Swift’s “Shake It Off.” The second season’s attempt got a little more ambitious with the “Les Mis” moment. But season 3’s “All That Josh,” which airs Mar. 7, is the show’s biggest undertaking yet —featuring multiple songs in the 42-minute episode.\n\n“We don’t really want this to be easy,” Gamble says. “We want to challenge ourselves and never, ever, take for granted that people are going to be interested in the show. We want to continue to woo you and promise you weird, ambitious, crazy things. This represented our philosophy about creating the show.”\n\nGamble and McNamara say they were confident about going bigger with the production value of the musical numbers in “All That Josh.”\n\n“The orchestrations were much more complicated, the staging was much more complicated, and [it] required a lot of rehearsal,” McNamara says.\n\nThey also asked actors who had never sung on the show before to be a part of those numbers. “Thank god the actors were game!” McNamara says. “They were nervous, and wanted to be good, but no one balked.”\n\nOne of those actors was Trevor Einhorn, who plays Josh. In the episode, Quentin, Kady (Jade Tailor), and Alice (Olivia Taylor Dudley) find Josh in a dimension stuck in a party loop. As long as the good times roll, everything is great, but the second anyone starts to question the party, things turn ugly. Einhorn was asked a lot from the episode — not just because he was central to the plot, but also because he was one of the few cast members with previous musical experience.\n\n“I took it one step at a time,” Einhorn says. “I read it and thought, ‘Cool we’re doing multiple songs. And then it was, ‘Cool, I’m singing three out of the four songs. That’s a big undertaking.’ So, I was a little nervous but mostly just excited. When you see your name in the title as an actor you’re just happy it didn’t say ‘Josh Dies – Part 1.'”\n\nIn Lev Grossman’s book series from which the show is inspired, Josh is one of the central and fan favorite characters. As happens when books are adapted for TV and movies, things tend to be tweaked and moved around. However, Einhorn hopes the audience will be “pleasantly surprised to know that he’s not just back, but that he’s back in a big way” after this pivotal episode.\n\nWhether the show will continue its trend of upping the musical stakes every year is too early for producers to say, but despite being skeptical about musicals at first, Gamble now shares that having them pop up in the show represents something key for “The Magicians.”\n\n“One of the themes of our show is that, ultimately you’ll do just a little bit better in your life if you admit to yourself what you love and you embrace it no matter how deeply nerdy, or embarrassing, or niche, or weird,” she says.", "images": ["https://pmcvariety.files.wordpress.com/2018/03/nup_180356_1166.jpg?w=1024", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fthe-magicians-musical-all-that-josh-trevor-einhorn-sera-gamble-john-mcnamara-interview-1202720783%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202720783&comment_count=6", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/03/nup_180356_1166.jpg?w=1024", "keywords": [], "authors": ["Jacob Bryant"], "canonical_link": "https://variety.com/2018/tv/news/the-magicians-musical-all-that-josh-trevor-einhorn-sera-gamble-john-mcnamara-interview-1202720783/", "title": "How ‘The Magicians’ Musical Episode Came to Be", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "The team behind \"The Magicians\" break down how they put together a musical episode for the third season of the Syfy series.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202720783, "author": "Jacob Bryant", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-03-07T12:03:56"}, "pmc-tag": "John McNamara,Sera Gamble,The Magicians,Trevor Einhorn", "title": "How ‘The Magicians’ Musical Episode Came to Be", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "How ‘The Magicians’ Musical Episode Came to Be", "url": "https://variety.com/2018/tv/news/the-magicians-musical-all-that-josh-trevor-einhorn-sera-gamble-john-mcnamara-interview-1202720783/", "description": "In its third season, “The Magicians” has no intention of resting on its laurels. In addition to a quest to restore magic, exploring a character’s posthumous escapades, and depicti…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/03/nup_180356_1166.jpg?w=1024", "width": 1200, "height": 800, "alt": "THE MAGICIANS -- \"All That Josh\" Episode 309 -- Pictured: (l-r) -- (Photo by: Eric Milner/Syfy)"}, "locale": "en_US"}, "article": {"published_time": "2018-03-07T20:03:56+00:00", "modified_time": "2018-03-07T20:05:03+00:00"}, "twitter": {"creator": "@Jacobb41", "site": "@variety", "text": {"title": "How ‘The Magicians’ Musical Episode Came to Be"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/03/nup_180356_1166.jpg?w=1024", "alt": "THE MAGICIANS -- \"All That Josh\" Episode 309 -- Pictured: (l-r) -- (Photo by: Eric Milner/Syfy)"}, "card": "summary_large_image", "title": "How ‘The Magicians’ Musical Episode Came to Be", "description": "The team behind \"The Magicians\" break down how they put together a musical episode for the third season of the Syfy series."}, "author": "Jacob Bryant", "content_type": "Article", "post_id": 1202720783, "title": "How 'The Magicians' Musical Episode Came to Be", "published_at": "2018-03-07 12:03:56", "image": "https://pmcvariety.files.wordpress.com/2018/03/nup_180356_1166.jpg?w=1024", "comment_count": 6, "tags": "Trevor Einhorn", "topics": "News", "appeared_in_print": "No", "body": "In its third season, \"The Magicians\" has no intention of resting on its laurels. In addition to a quest to restore magic, exploring a character's posthumous escapades, and depicting silent scenes as characters communicate exclusively in American Sign Language, the Syfy series is embarking upon a musical episode.\r\n\r\nThe idea came from executive producer John McNamara. After seeing the one-time performance of \"One Day More\" take off with audiences in the second season, he wanted to go all in.\r\n\r\n\"Right around the time we realized the 'Les Miserables' number last year was going to work, John was like, 'So next season I have this idea for how to do an episode where all of the talking is singing,'\" executive producer Sera Gamble tells Variety. \r\n\r\nAlthough slightly less enthusiastic about the idea at first, Gamble came around. \"This episode really represents me talking him just a step or two back from that ledge,\" she continues.\r\n\r\nAsking their cast to break into song has been part of Gamble and McNamara's \"The Magicians\" tasks since the beginning. The first season featured a scene where Quentin (Jason Ralph) performed a quick rendition of Taylor Swift's \"Shake It Off.\" The second season's attempt got a little more ambitious with the \"Les Mis\" moment. But season 3's \"All That Josh,\" which airs Mar. 7, is the show's biggest undertaking yet —featuring multiple songs in the 42-minute episode.\r\n\r\n\"We don't really want this to be easy,\" Gamble says. \"We want to challenge ourselves and never, ever, take for granted that people are going to be interested in the show. We want to continue to woo you and promise you weird, ambitious, crazy things. This represented our philosophy about creating the show.\"\r\n\r\nGamble and McNamara say they were confident about going bigger with the production value of the musical numbers in \"All That Josh.\"\r\n\r\n\"The orchestrations were much more complicated, the staging was much more complicated, and [it] required a lot of rehearsal,\" McNamara says.\r\n\r\nThey also asked actors who had never sung on the show before to be a part of those numbers. \"Thank god the actors were game!\" McNamara says.  \"They were nervous, and wanted to be good, but no one balked.\"\r\n\r\nOne of those actors was Trevor Einhorn, who plays Josh. In the episode, Quentin, Kady (Jade Tailor), and Alice (Olivia Taylor Dudley) find Josh in a dimension stuck in a party loop. As long as the good times roll, everything is great, but the second anyone starts to question the party, things turn ugly. Einhorn was asked a lot from the episode — not just because he was central to the plot, but also because he was one of the few cast members with previous musical experience.\r\n\r\n\"I took it one step at a time,\" Einhorn says. \"I read it and thought, 'Cool we're doing multiple songs. And then it was, 'Cool, I'm singing three out of the four songs. That's a big undertaking.' So, I was a little nervous but mostly just excited. When you see your name in the title as an actor you're just happy it didn't say 'Josh Dies - Part 1.'\"\r\n\r\nIn Lev Grossman's book series from which the show is inspired, Josh is one of the central and fan favorite characters. As happens when books are adapted for TV and movies, things tend to be tweaked and moved around. However, Einhorn hopes the audience will be \"pleasantly surprised to know that he's not just back, but that he's back in a big way\" after this pivotal episode.\r\n\r\nWhether the show will continue its trend of upping the musical stakes every year is too early for producers to say, but despite being skeptical about musicals at first, Gamble now shares that having them pop up in the show represents something key for \"The Magicians.\"\r\n\r\n\"One of the themes of our show is that, ultimately you'll do just a little bit better in your life if you admit to yourself what you love and you embrace it no matter how deeply nerdy, or embarrassing, or niche, or weird,\" she says.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1520453036.0, "source": "https://variety.com", "summary": ""}