{"url": "https://en.wikipedia.org/wiki/Tessa_Gr%C3%A4fin_von_Walderdorff", "text": "21st-century American socialite\n\nCountess Tessa June von Walderdorff (German: Tessa June Gräfin von Walderdorff; born 20 February 1994), also known by her married name Tessa Hilton, is an American socialite, model, and real estate broker. She previously worked as an actress in short films, a free-lance disc jockey, and was a writer for the German fashion and lifestyle magazine I Love You.\n\nShe is a member of the Walderdorff family, a German noble family of comital rank, and a morganatic descendant of the Löwenstein-Wertheim branch of the House of Wittelsbach. She is a member of the Hilton family through her marriage to Barron Nicholas Hilton II.\n\nEarly life and family [ edit ]\n\nCountess Tessa von Walderdorff was born on 20 February 1994 in New York City.[1] Her father is photographer and artist Count Franz von Walderdorff[2] and her mother is artist Anna-Sabrina Brühwiler.[3][4] She is of German heritage on her father's side and German, Swiss, French, and Danish heritage on her mother's side.[5][6] Walderdorff spoke French as her first language, and later became fluent in German and in English.[7]\n\nShe is a member of the German noble Walderdorff family and is a morganatic descendant of the German House of Wittelsbach, which ruled over the Kingdom of Bavaria. As a child, Walderdorff spent a lot of time at Schloss Höfling, her family's 18th century castle near Regensburg in Bavaria.[7]\n\nWalderdorff's paternal grandfather, Count Hugo von Walderoff, left Germany during World War II to escape forced recruitment into the Hitler Youth.[8] Her paternal grandmother is Countess Marie Josepha von Ballestrem, a daughter of Princess Therese zu Löwenstein-Wertheim-Rosenberg.[8]\n\nShe has a younger sister, Countess Mia Rose von Walderdorff.[9]\n\nCareer [ edit ]\n\nWalderdorff worked as a production assistant for Holly Li Productions during New York Fashion Week and Paris Fashion Week in 2012 and 2013.[7] In 2013 she also interned for Donna Karan.[5] Since 2014 Walderdorff has been working as an intern at Laird + Partners, a subsidiary of MDC Partners.[10][11]\n\nWalderdorff made her film debut in the 2017 film Rosewood: The Best Version of Yourself. She played Jessica Cabot in the upcoming film Spring to Winter.[12] Inspired by music she discovered while living in Berlin, and with her classical piano training, Walderdorff has done free-lance work as a disc jockey and has begun producing her own music.[7]\n\nWalderdorff is a licensed real estate agent and works as a salesperson for Hilton and Hyland, a real estate firm owned by Jeffrey Hyland and her father-in-law Richard Hilton.[7]\n\nWalderdorff has written two compilations of short stories and is publishing a series of children's books with Full Cycle Publications.[7] She also writes for the Berlin-based I Love You magazine.[13]\n\nIn September 2018 Walderdorff modeled for Marcel Ostertag's Spring 2019 collection at his show during New York Fashion Week.[14][15]\n\nPersonal life [ edit ]\n\nWalderdorff attended the Ross School in East Hampton, New York.[16] She graduated from Bard College in 2016, where she double majored in Written Arts and French and was a member of the tennis team.[5][17]\n\nWalderdorff met Barron Nicholas Hilton II, younger brother of Paris Hilton and Nicky Hilton Rothschild, at a restaurant in Saint Barthélemy in 2016, and began dating shortly after.[7] Hilton proposed to Walderdorff on 17 September 2017 in Central Park.[18][19] They announced their engagement via Instagram later that month.[20][21] Walderdorff and Hilton were married in Gustavia; first in a civil ceremony at the town hall on 1 June 2018 and then in a religious ceremony at St. Bartholomew's Anglican Church on 3 June 2018.[22][23][24] After the ceremony they had a reception at the Villa La Plage.[25]\n\nIn September 2019 von Walderdorff announced that she was pregnant.[26][27] On 11 March 2020 she gave birth to a daughter, Milou Alizée Hilton.[28]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tessa_Gr%C3%A4fin_von_Walderdorff", "title": "Tessa Gräfin von Walderdorff", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}