{"url": "people.com/tv/everything-we-know-kendall-jenner-ben-simmons/", "text": "Looks like Kendall Jenner is moving on with NBA star Ben Simmons!\n\nAfter dating basketball player Blake Griffin, the 22-year-old made headlines after she was seen stepping out with Simmons, 21, multiple times this week.\n\nGet push notifications with news, features and more.\n\nNews of their rumored relationship first broke Tuesday night, when Page Six reported the pair were spotted on a lunch date at the Beverly Hills Hotel after being seen with a group of friends at New York City hotspot Vandal last week. TMZ also reported that the duo grabbed dinner at the Waldorf Astoria Beverly Hills on Monday.\n\nAdding fuel to the fire, Jenner and Simmons were spotted hitting up the Nice Guy in West Hollywood on Wednesday night. Though they arrived separately and exited through different doors, they left in the same SUV at the end of the night, according to video obtained by TMZ.\n\nThe Blast published a video of the couple entering the Waldorf Astoria Hotel in Beverly Hills together around 2 a.m.\n\nHere’s everything you need to know about Jenner’s rumored beau.\n\nImage zoom Kendall Jenner and Ben Simmons Getty (2)\n\nRELATED: Kendall Jenner Steps Out with NBA Player Ben Simmons After Romance Rumors & Cheating Allegations\n\nHe’s Up for the NBA’s Top Rookie Prize\n\nFollowing a successful stint playing college basketball for Louisiana State University, Simmons became the NBA’s number one draft pick in 2016, signing a contract to play with the Philadelphia 76ers.\n\nAlthough Simmons ended up sitting out the 2016-2017 season after injuring his ankle during training, he made his NBA debut in October 2017. This year, the 76ers made it to the second round of the NBA finals before being knocked out by the Boston Celtics.\n\nFollowing his successful debut season, Simmons was named as one of the three finalists of the NBA’s Rookie of the Year award. The winner will be announced later this month.\n\nSimmons is also signed to LeBron James‘ management company, Klutch Sports Group, alongside Tristan Thompson, who is currently dating and shares a child with Jenner’s sister Khloé Kardashian.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nHe’s Australian\n\nSimmons is actually from the land down under!\n\n“I was born in Australia,” the sports star said during an episode of The Tonight Show Starring Jimmy Fallon.\n\n\n\nHe went on to explain that his father, who’s from New York, was a professional basketball player in Australia, where he ended up meeting Simmons’ mother.\n\nAsked why he chose to move to the United States, Simmons explained, “The level of competition out here is much higher. I wanted to play against the best and be the best.”\n\nHe Dated Tinashe\n\nShortly after Simmons posted a since-deleted photograph of himself with Tinashe, the “All Hands on Deck” signer told Billboard in late March, “he’s like my full boyfriend, I guess.”\n\nHer last photo with Simmons was posted on April 20. “Thankful for you,” she wrote alongside a series of the pair cuddling up together.\n\nhttps://www.instagram.com/p/Bh0N_uVjH2x/?taken-by=tinashenow\n\nShe previously shared photos of herself wearing his jersey and of the pair taking a ride in his Ferrari.\n\nhttps://www.instagram.com/p/BhkOB8FjeRS/?taken-by=tinashenow\n\nFollowing news of Jenner’s romance with Simmons, Tinashe‘s younger brother Kudzai accused the athlete of cheating on his sister with the Keeping Up With the Kardashians star. Kudzai also claimed that Simmons — who has deleted all photos of him and Tinashe from Instagram — and the singer only split on Sunday.\n\n“Sorry for blowing up y’all twitter everyone,” Kudzai tweeted. “It was actually the only way to defend my sister against all this bulls—.”\n\nThough Tinashe has not commented on the cheating rumors, her other brother Thulani also retweeted Kudzai’s tweet.\n\nHe Loves His Car\n\nMuch like Jenner, the 21-year-old basketball star shows off his stylist wheels.\n\nPosing alongside his sleek black Ferrari in January, Simmons simply captioned the photo, “Blessed.”\n\nA love of cars is something Simmons has in common with Jenner, who told CNN in 2016 that while “some people get addicted to tattoos, I’m addicted to cars.”\n\n“If I love it, I love it. If I walk in and it really gets to me, I’m like okay, I need that car,” she added.\n\nThe 22-year-old-model is frequently seen out and about in her vintage 1975 Chevrolet Corvette, which she calls “my baby.”\n\nRELATED: The Story Behind Kendall and Kylie Jenner’s Matching Ferraris\n\nHe’s a Big Spender — on Cats\n\nOn an episode of Maverick Carter’s “Kneading Dough” series, in which professional athletes discuss their strategies for money management, Simmons revealed that he regretted spending $10,000 on two Savannah cats — a very large domesticated breed.\n\n“I had two Savannah cats…It was a bad purchase,” he said on the episode, according to CNBC.\n\n“They were crazy,” he added.\n\nImage zoom Ben Simmons/Instagram\n\nDetailing the experience, Simmons’ half-brother Sean Tribe told The Undefeated the pair ended up saying goodbye to the felines after “four or five months.”\n\n“I told Ben, ‘We can’t have these cats anymore. This is crazy.’” Tribe remarked, after explaining how the two cats frequently scratched and clawed at the two boys. “He was going on a road trip while he was injured, and I told Ben, ‘I am going to call the breeder and tell them we can’t quite look out for the cats anymore and they can find them a better home.’ He said, ‘Cool.’ ”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F01%2Fben-simmons.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg", "keywords": [], "authors": ["Maria Pasquini"], "canonical_link": "https://people.com/tv/everything-we-know-kendall-jenner-ben-simmons/", "title": "Everything We Know about Kendall Jenner’s Rumored New Beau Ben Simmons", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ben Simmons,Couples,Kardashians,Keeping Up with the Kardashians,Kendall Jenner,Sports,TV", "news_keywords": "Ben Simmons,Couples,Kardashians,Keeping Up with the Kardashians,Kendall Jenner,Sports,TV", "description": "Looks like Kendall Jenner has a new man in her life — here's what you need to know", "og": {"title": "Everything We Know about Kendall Jenner’s Rumored New Beau Ben Simmons", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/everything-we-know-kendall-jenner-ben-simmons/", "description": "Looks like Kendall Jenner is moving on with NBA star&nbsp;Ben Simmons! After dating basketball player&nbsp;Blake Griffin, the 22-year-old made headlines after she was seen stepping&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/tv/everything-we-know-kendall-jenner-ben-simmons/", "description": "Looks like Kendall Jenner has a new man in her life — here's what you need to know", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/everything-we-know-kendall-jenner-ben-simmons/", "title": "Everything We Know about Kendall Jenner’s Rumored New Beau Ben Simmons", "description": "Looks like Kendall Jenner has a new man in her life — here's what you need to know", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkendall-21-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/6UQm1Fue--Y"], "publish_date": null, "source": "http://people.com", "summary": ""}