{"url": "https://www.usatoday.com/story/sports/nfl/2017/04/19/aaron-hernandez-troubled-life-death-new-england-patriots/100672240/", "text": "Erik Brady\n\nUSA TODAY Sports\n\nAaron Hernandez grew up in Bristol, Conn., home of ESPN, and he had the sort of athletic gifts that would lead one day to SportsCenter highlights and multi-million-dollar contracts to play for the darlings of his region, the New England Patriots.\n\nBut the boy from Bristol also harbored demons of the sort that would one day lead him to drugs, accusations of cold-blooded murder and, finally, his own death. Authorities said he hanged himself with a bed sheet early Wednesday in the prison cell where he was serving a life sentence without possibility of parole. He was 27 and had lived an operatic hybrid of American dream and ghastly nightmare. His death came the same day his former team visited the White House to celebrate their Super Bowl victory two months ago.\n\nHernandez caught a touchdown pass in the Super Bowl in early 2012 – and the next year found himself accused of killing a semipro football player, Odin Lloyd, who was dating the sister of Hernandez’s fiancée. Motive remains unclear, though it may have been that Lloyd had some knowledge of Hernandez’s link to a double homicide in the summer of 2012.\n\nLast week, Hernandez was acquitted of the most serious charges in that case, which would have only added to his life sentence because Massachusetts does not have the death penalty. Though, in the end, Hernandez apparently imposed his own.\n\nMORE COVERAGE:\n\nMass. Appeals Court likely to vacate Aaron Hernandez's murder conviction\n\nAaron Hernandez lawyer: 'Determined to find truth ... about untimely death'\n\nArmchair psychologists will long speculate what took Hernandez from a top target for Tim Tebow in college football to a top target for Tom Brady in the NFL and from there to a dark side of malevolent violence and unfathomable anger. Answers are ultimately unknowable but clues abound, beginning with the unexpected death of his father in 2006 when Hernandez was 16.\n\nDennis Hernandez was a high school custodian who died of complications arising from routine hernia surgery. The aftermath “was a mess with a lot of family issues, fighting and disagreements,” Hernandez told USA TODAY Sports in 2009, when he was playing at Florida.\n\n“I didn’t know what to do for him,” his mother Terri said in the same story. “He would rebel. It was very, very hard, and he was very, very angry. He wasn’t the same kid, the way he spoke to me. The shock of losing his dad, there was so much anger.”\n\nTrouble 'finds this guy'\n\nHernandez was an honor student at Bristol Central High School, though Doug Pina, his high school coach, told the Hartford Courant in 2010 that he’d personally “always had concerns” about him.\n\nHernandez had originally planned to play college football for Connecticut, where his father and older brother played, but changed his mind and chose Florida. Before his first college game, Hernandez, then 17, punched a restaurant manager in the side of the head, busting his eardrum in a dispute over the bill. The case apparently settled out of court.\n\nHernandez also was among several Gators players interviewed by police after a shooting at a nightclub that left two men wounded. No one was ever charged.\n\nHernandez won a national championship and the John Mackey Award for the nation’s best tight end during his time at Florida. He declared for the 2010 NFL draft where the Patriots took him in the fourth round, lower than his talent suggested he’d go, apparently because of multiple failed drug tests and unsavory friends. CBSSports.com quoted an unnamed NFL scout: “We stayed away because we hated the people he hung out with and how trouble always finds this guy.”\n\nMORE COVERAGE:\n\nAaron Hernandez: How he spent his four years in prison since murder conviction\n\nAaron Hernandez's death brings chilling end to tragic story\n\nAaron Hernandez: What we know on day of his death\n\nPublished reports at the time said Hernandez had told teams at the NFL scouting combine that he’d begun using marijuana to cope with the death of his father.\n\n“Who do I talk to?” Hernandez said of the uncertainty after his father’s death in that 2009 USA TODAY Sports story. “Who do I hang with?”\n\nHe often hung with a bad crowd in years to come, including Ernest Wallace and Carlos Ortiz. Rolling Stone styled them as “two stumble-bum crooks with long sheets of priors.” Wallace and Ortiz were with Hernandez when Lloyd was killed near Hernandez’s Massachusetts home in 2013.\n\nFamily relationships were often complicated. Hernandez’s cousin Tanya married Jeffrey Cummings in 2005; they had a son together and got divorced. Then, in 2009, Cummings married Hernandez’s mother on a trip to Las Vegas. A year later, about a month before Hernandez reported to his first Patriots’ training camp, Cummings slashed Hernandez’s mother with a knife and she had lacerations to her face, shoulder and wrist. Cummings would wind up in jail and they would divorce.\n\nHernandez married Shayanna Jenkins in 2012 in the same month their daughter was born. That came only months after two Cape Verdean immigrants were gunned down in their car drive-by style after one of them bumped into Hernandez at a nightclub and spilled his drink.\n\nAlexander Bradley would say at trial that it was Hernandez who shot Daniel de Abreu and Safiro Furtado – and Hernandez’s lawyers would say it was Bradley who shot them. Bradley, not incidentally, had filed a civil suit in 2013 alleging that Hernandez shot him point-blank in the face months earlier, costing him his right eye. They were best friends before they were mortal enemies.\n\nTattoos tell story\n\nLast week, Hernandez wept after he was acquitted. It seemed out of character for a man who so often seemed devoid of any emotion. Reports at the time of his father’s funeral said that Hernandez didn’t cry, even as his brother and so many others did.\n\n“There was such hunger in that kid for a father’s hand, and such greatness itching to get out,” Rolling Stone’s story said after Hernandez’s arrest in 2013, “that coach after coach had covered for him whenever the bad Aaron showed — the violent, furious kid who was dangerous to all, most particularly, it seems, to his friends.”\n\nKelly Whiteside wrote in her 2009 story in USA TODAY Sports that a guided tour of the tattoos on Hernandez’s body reads like his autobiography.\n\nStarting from his right shoulder, she wrote, “there was a tattoo representing God’s hands, a nod to his big brother and to his father and the day he died. There’s the sun representing all the good days he had with his dad. Beneath those rays are clouds and rain.”\n\nHernandez then pointed to the angels near his wrist. “It all ends in heaven,” he said.\n\nHe’d add more tattoos in the years ahead. One was of a smoking semi-automatic pistol. Another was of a six-shot revolver. That one accompanies two words, written in reverse: “God Forgives.”\n\nPHOTOS: Aaron Hernandez's life", "images": ["https://www.gannett-cdn.com/-mm-/ad526d23315f0f39ac49deca762df11d321329fb/c=0-221-2056-1382/local/-/media/2017/04/19/USATODAY/USATODAY/636282256088222273-C10-NFL-21-56630123.JPG?width=2056&height=1161&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/ad526d23315f0f39ac49deca762df11d321329fb/c=0-221-2056-1382/local/-/media/2017/04/19/USATODAY/USATODAY/636282256088222273-C10-NFL-21-56630123.JPG?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/13/USAT/5264d378-5e51-47aa-bded-04a206e44d0f-2020-04-13_Christian_McCaffrey1.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/ad526d23315f0f39ac49deca762df11d321329fb/c=0-221-2056-1382/local/-/media/2017/04/19/USATODAY/USATODAY/636282256088222273-C10-NFL-21-56630123.JPG?width=2056&height=1161&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/sports/nfl/2017/04/19/aaron-hernandez-troubled-life-death-new-england-patriots/100672240/", "title": "Life and death of Aaron Hernandez: 'There was so much anger'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Life and death of Aaron Hernandez: 'There was so much anger'", "description": "Aaron Hernandez harbored demons that led him to drugs, a murder and his own death", "url": "https://www.usatoday.com/story/sports/nfl/2017/04/19/aaron-hernandez-troubled-life-death-new-england-patriots/100672240/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/ad526d23315f0f39ac49deca762df11d321329fb/c=0-221-2056-1382/local/-/media/2017/04/19/USATODAY/USATODAY/636282256088222273-C10-NFL-21-56630123.JPG?width=2056&height=1161&fit=crop&format=pjpg&auto=webp", "width": 2056, "height": 1161}, "type": "article"}, "article": {"author": "Erik Brady", "content_tier": "free", "opinion": "false"}, "description": "Aaron Hernandez harbored demons that led him to drugs, a murder and his own death", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/ad526d23315f0f39ac49deca762df11d321329fb/c=0-221-2056-1382/local/-/media/2017/04/19/USATODAY/USATODAY/636282256088222273-C10-NFL-21-56630123.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Life and death of Aaron Hernandez: 'There was so much anger'", "description": "Aaron Hernandez harbored demons that led him to drugs, a murder and his own death"}}, "movies": [], "publish_date": 1492531200.0, "source": "https://www.usatoday.com", "summary": ""}