{"url": "https://www.cheatsheet.com/entertainment/jersey-shore-family-vacation-pauly-d-and-aubrey-o-day-romantic-past.html/", "text": "Aubrey O’Day and Pauly D | Getty Images/Lily Lawrence Aubrey O’Day and Pauly D | Getty Images/Lily Lawrence\n\nFans of Jersey Shore: Family Vacation probably only recognize Paul “DJ Pauly D” DelVecchio as a single DJ, but he did have a relationship with a celebrity before the cast reunited. That celebrity is Aubrey O’Day who used to be in the singing group, Danity Kane. She has since made headlines for reportedly having an affair with Donald Trump Jr. while he was married after meeting him on Celebrity Apprentice. So what was her relationship like with Paul DelVecchio and did their relationship end on bad terms? Here is everything you need to know.\n\nPauly D and Aubrey O’Day met on Famously Single\n\nIt only makes sense that the two reality stars met on a dating reality show. The two met in the show’s first season and got pretty serious. There were rumors that they were engaged by the end of the show because O’Day was seen wearing an engagement ring, but it was just a prank. The two still had a good time falling in love on the show.\n\n“The show is about all of us coming together,” explained O’Day according to E! News “dating, learning through a dating coach how to go out there and approach people that are better suited for us and kind of get over the issues that we were having. And it ended up just like becoming like this chemistry happened within the house with a few of the cast-mates and Pauly and I were one of them.”\n\nHe admitted this was his first relationship\n\nThe DJ opened up about learning from dating the singer. “I’ve learned so much,” he told E! News. “It’s pretty crazy because it was my first real relationship. I’ve learned so much being in it — I’ve learned don’t assume anything. If you have a problem with your partner, don’t assume. Just ask them and tell them how you feel, because most of the time it’s not really what you think.”\n\nThe two reportedly broke up in 2016\n\nThe first round of their relationship lasted less than a year. According to ET, the two broke up in the summer of 2016. But they then reunited and tried to make it work on reality tv.\n\nO’Day said she tried Marriage Boot Camp a second time because she wanted a fresh perspective\n\nO’Day previously was on Marriage Boot Camp with ex-boyfriend Travis Garland in Season 5. The reality show didn’t work for them the first time so why did she go back to work on things with DelVecchio?\n\nThe singer told HollywoodLife, “I was feeling suffocated, and losing my identity, and I was really hoping for a new environment, to get some fresh perspective.”\n\nHe didn’t know about her reported affair with Donald Trump Jr.\n\nThe Jersey Shore star was asked if her alleged previous affair with Donald Trump Jr. would be mentioned on Marriage Boot Camp. “We didn’t address that at all. Yeah, I didn’t know anything about that,” he told Us Weekly. “I guess [the news broke] after or something like that.”\n\nThe two officially split in July 2017 reportedly because the DJ didn’t want to get married\n\nThe couple officially called it quits and it was reportedly DelVecchio who ended things. “Aubrey was pressing Pauly for an engagement ring,” a source told ET. “Pauly did not see marriage with Aubrey in his future.”\n\nThe couple did previously talk about marriage. She told E! News, “I want a ring like ASAP!” He also said, “She’s the one for me, so I’m looking forward to the next steps and waiting for the right moment to make all that happen.”\n\nO’Day said ‘it’s disappointing’ that the DJ has said unkind things about her\n\nNow that their relationship is over the two have talked about each other. But the singer hasn’t been happy about everything her ex-boyfriend has said. “Lately, I’ve seen some Google alerts pop up about some unkind things that he said about me, which is disappointing ’cause I thought he was a bigger person than that,” she told Page Six. “My mistake!”\n\nShe claimed there were rules in their relationship\n\nThe singer also described their relationship as being unhealthy. “There was no healthy dialogue,” she told Us Weekly. “There was no progressive communication. There were rules and the rules needed to be followed and when they weren’t, you were punished.”\n\nRead more: Jen Harley Accuses ‘Jersey Shore Family Vacation Part 2’ of Editing Fight with Ronnie Ortiz-Magro\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/jersey-shore-family-vacation-pauly-d-and-aubrey-o-day-romantic-past.html/", "title": "'Jersey Shore Family Vacation': Pauly D and Aubrey O'Day's Romantic Past", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/jersey-shore-family-vacation-pauly-d-and-aubrey-o-day-romantic-past.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Did you know Pauly D of 'Jersey Shore Family Vacation' used to date, Aubrey O'Day? Here is everything you need to know about their past.", "og": {"locale": "en_US", "type": "article", "title": "'Jersey Shore Family Vacation': Pauly D and Aubrey O'Day's Romantic Past", "description": "Did you know Pauly D of 'Jersey Shore Family Vacation' used to date, Aubrey O'Day? Here is everything you need to know about their past.", "url": "https://www.cheatsheet.com/entertainment/jersey-shore-family-vacation-pauly-d-and-aubrey-o-day-romantic-past.html/", "site_name": "Showbiz Cheat Sheet", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Jersey Shore", "section": "Entertainment", "published_time": "2018-09-10T14:36:59-04:00"}, "twitter": {"card": "summary_large_image", "description": "Did you know Pauly D of 'Jersey Shore Family Vacation' used to date, Aubrey O'Day? Here is everything you need to know about their past.", "title": "'Jersey Shore Family Vacation': Pauly D and Aubrey O'Day's Romantic Past", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/09/paulydaubreyoday.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1536604619.0, "source": "https://www.cheatsheet.com", "summary": ""}