{"url": "https://gulfnews.com/entertainment/lea-michele-the-ugly-gleekling-1.763226", "text": "Has it sunk in yet that you are on the hottest show on TV, or on the list of Time magazine’s 100 most influential people in the world?\n\n\n\nLea Michele: We’ve been doing this for a really long time and we’re constantly in work mode. Every now and then, I have blissful moments of thanking God for all the amazing things that are happening. When I left the White House after just meeting Obama or when I meet someone who tells me that their daughter is inspired by me, those are moments that are incredibly joyful.\n\nDo you see any of yourself in your character Rachel?\n\nRachel is very much like me when I was about ten to 12, working in theatre, very driven. When I was in high school, although I wasn’t like Rachel, I was similar in the sense that I didn’t conform to what people thought was cool. It was important to do what I believed in.\n\nRachel’s status is quite often seen as very geeky, you can relate to that?\n\nI am an unconventional beauty. I grew up in a high school where if you didn’t have a nose job, money and if you weren’t thin, you weren’t cool, popular, and beautiful. I was always told that I wasn’t pretty enough to be on television. I was never pretty enough to be the pretty girl and I was never quirky enough to be the quirky girl. Boys didn’t look at me in high school and think I was the pretty girl. So I get Rachel. Of course, she’s gorgeous.\n\nTell us more about your school experiences?\n\n\n\nMy school was bit like Gossip Girl in that there was a lot of money and we didn’t have as much. I was different to those people and I didn’t like the things that they liked. I would go to parties and the best part of going would be the leaving. I would go to a party because I felt that’s what I should be doing. I’m such a loser!\n\nHad you always dreamed of becoming an actress?\n\nWhen I was a little kid, my mother and I used to watch the Golden Globes and I would dress up and she would get sparkling apple cider and we would make a tray of hors d’oeuvres and watch it together. And I would get up and make a pretend speech.\n\nHow do you stay fit?\n\n\n\nI love being healthy. I get a lot of sleep. I’m a girl who eats. And I feel beautiful no matter how I look. I have my family to thank for that.\n\nHow do you relax after a tough day?\n\nI’ll go and get the most delicious vegan food I can find. I get kale, black beans, brown rice and tofu, with lime cilantro dressing and hot sauce. I’ll rubbish reality television, take a bath or a shower, give myself a nice little face mask and go to bed.\n\nDon’t miss Glee every Saturday at 20:00 UAE on America Plus and OSN SERIES HD – the same week as it airs in the US", "images": ["https://imagevars.gulfnews.com/2010/8/9/1_16a07fb6a4c.666026_1929152101_16a07fb6a4c_medium.jpg", "https://imagevars.gulfnews.com/2011/2/16/1_16a08001592.763229_3562349069_16a08001592_large.jpg", "https://assets.gulfnews.com/images/gn_round_logo.png", "https://assets.gulfnews.com/images/spacer.gif"], "top_img": "https://imagevars.gulfnews.com/2010/8/9/1_16a07fb6a4c.666026_1929152101_16a07fb6a4c_medium.jpg", "keywords": [], "authors": [], "canonical_link": "https://gulfnews.com/entertainment/lea-michele-the-ugly-gleekling-1.763226", "title": "Lea Michele: The Ugly Gleekling", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "fb": {"app_id": 1718868628348238, "pages": 143017562431177}, "twitter": {"site": "@gulf_news", "card": "summary_large_image", "title": "Lea Michele: The Ugly Gleekling", "description": "Once told she wasn't pretty enough, Lea Michele's rising star on Glee has made her the girl to watch", "image": {"src": "https://imagevars.gulfnews.com/2010/8/9/1_16a07fb6a4c.666026_1929152101_16a07fb6a4c_medium.jpg"}}, "description": "Once told she wasn't pretty enough, Lea Michele's rising star on Glee has made her the girl to watch", "og": {"type": "article", "url": "https://gulfnews.com/entertainment/lea-michele-the-ugly-gleekling-1.763226", "title": "Lea Michele: The Ugly Gleekling", "description": "Once told she wasn't pretty enough, Lea Michele's rising star on Glee has made her the girl to watch", "image": {"identifier": "https://imagevars.gulfnews.com/2010/8/9/1_16a07fb6a4c.666026_1929152101_16a07fb6a4c_medium.jpg", "width": 540, "height": 405}}}, "movies": [], "publish_date": 1297865640.063, "source": "https://gulfnews.com", "summary": ""}