{"url": "www.vulture.com/2018/05/summer-music-preview-drake-nicki-minaj-and-so-much-kanye.html", "text": "Photo: Maya Robinson/Vulture\n\nEvery summer, rumors of Big Deal releases from marquee artists run rampant. This summer, the same thing is happening, but there’s one crucial difference: Artists are throwing everything they have into projects with actual concrete release dates. By the end of June alone, we’re all but guaranteed to have new albums from Kanye West, Drake, Pusha-T, Christina Aguilera, and much more. By the end of summer, there’s a very real chance that a Beyoncé and Jay-Z album could exist … or maybe not? Check out the list of just some of the (major, major) highlights of this summer’s stacked crop of album releases. If all of these actually come out in the next three months, maybe everyone can take the rest of the year off from making music so we can catch up.\n\nChvrches, Love Is Dead (May 25)\n\nChvrches never gets enough credit for arriving early to modern pop music’s booming trap/EDM party, but one hopes the new Love Is Dead will win the Glasgow trio the respect it deserves for its solid track record of windswept hooks and disarming lyrics. The sticky melodies and explosive drums of the new single “Miracle” seem to suggest that lead singer Lauren Mayberry and her bandmates Martin Doherty and Iain Cook are playing for keeps the third time around. —Craig Jenkins\n\nPusha-T, Daytona (May 25)\n\nAs far as excuses for not releasing an album go, being president of Kanye West’s record label isn’t bad at all. The sequel to Pusha-T’s 2013 solo debut, My Name Is My Name, has been awaited for so long that many a fan might have forgotten to await it any longer; even the brief prelude album, Darkest Before Dawn, that Push released to tide listeners over is three years old at this point. To be sure, the ex-Clipse rapper has had his hands full since being named head of GOOD Music (just imagine having to field responses to Kanye’s recent antics), but he’s long overdue for a collection of his own quality sound. Here’s hoping that Daytona’s Ye-curated beats and Push’s hallmark coke-rap lyrics are enough to stem the drought. —Frank Guan\n\nFather John Misty, God’s Favorite Customer (June 1)\n\nIf Father John Misty could cut back on his antics long enough to let his music speak for itself, he might enjoy a reputation as one of the sharper singer-songwriters working today. He can be a ham off record, but in song, he is a humorist whose preening nihilism is a mirror on the principal absurdity of being alive right now, and whose earnest moments deal in heartbreaking sentimentality. The forthcoming God’s Favorite Customer is a batch of clever, silly love songs like “Disappointing Diamonds Are the Rarest of Them All” and gutting confessionals like “Please Don’t Die.” —CJ\n\nNatalie Prass, The Future and the Past (June 1)\n\nNatalie Prass is a singer-songwriter as true to the form as they come. She makes quietly devastating songs that are committed to that genre’s fundamentals, but her new album is something different. It’s what singer-songwriters sound like when they experiment with jazz and give their sound an old-school R&B sheen. Her new music is polished and upbeat (“Sisters, “Short Court Style”), reminiscent of Feist at her best. Every ounce of fun that it sounds like Natalie had making the record comes through, from front to back. —Dee Lockett\n\nOneohtrix Point Never, Age Of (June 1)\n\nAfter a productive few years that included scoring the Safdie Brothers’ film Good Time, collaborating with FKA Twigs, Anohni, and David Byrne, opening for Nine Inch Nails, and releasing his seventh album as Oneohtrix Point Never, Garden of Delete, Dan Lopatin is back with the follow up to GoD. It’s a more subdued affair, and it’s often paranoid and beautiful — filled with dread, anxiety, and a fractured take on rock mythology as filtered through prog, smooth jazz, and noise music. —Sam Hockley-Smith\n\nKanye West, TBA (June 1)\n\nKanye West’s cockiness has always been a gift and a curse, but the rapper’s last month of questionable political and ideological choices still feels impossible to process. It’s tough to take your eyes off modern pop music’s most controversial and compelling figure, even when he looks to be hurtling into a bad space and carrying you with him. New music is imminent; one hopes it breaks the trollish tone of the scat rhyme “Lift Yourself” and the dry Inherit the Wind vibes of the combination rap battle and political debate “Ye vs. the People.” If it doesn’t … it was a good run. —CJ\n\nJorja Smith, Lost & Found (June 8)\n\nThere are a lot of singers born from the SoundCloud R&B generation that, like their rap counterparts, all kind of blend together. But Jorja Smith stands out because she’s vocally a touch above the rest: She sings at whisper volume like all her peers have apparently been trained to do, but there’s so much quality, clarity, and texture to her voice that you forgive her for playing to the trend. Jorja’s a bit Gabrielle, a bit Sade, and a whole lot of pure talent. Her debut album is not to be missed. —DL\n\nLily Allen, No Shame (June 8)\n\nYou either like Lily Allen, really fuck with her, or think she’s a hack. There’s really no in-between. Lily Allen has been polarizing from out of the gate. Her new music, though, wrestles with getting older, motherhood, and the tremendous personal loss she’s experienced in her life. How do you exist as an adult when you’re still emotionally an adolescent? Lily Allen’s still figuring it out, and she sounds better for it. Skeptical? Give “Higher” a spin. —DL\n\nSerpentwithfeet, toil (June 8)\n\nJosiah Wise, who records as serpentwithfeet, has a voice that sounds sacred. It’s too big to be intimate, but too fragile to be for everyone. In other words, this isn’t music you’re going to throw on at your next summer barbecue. If you can, unplug all the electronics in your house, close all the windows, and sweat through the whole album in one go. You’ll come out the other side feeling like you went through something spiritual. —SHS\n\nSnail Mail, Lush (June 8)\n\nSnail Mail’s Lindsey Jordan is only 18 years old, but she’s already got the genre buzzing about her. And for good reason: Her songs are honest and shockingly self-aware for her age, and she knows how to write a memorable hook (“Don’t you like me for me?” on “Pristine” gets me every time). —DL\n\nLykke Li, so sad so sexy (June 8)\n\nWe could tell you that Lykke Li’s new album sounds part trap, part lush pop, and part completely indescribable — kind of like all the music of her past but with a Charli XCX filter (see: “hard rain”). Or we could just tell you that the Meryl Streep is apparently a big, big fan. What more do you need to know? —DL\n\nKids See Ghost, Kids See Ghost (June 8)\n\nIt’s not rude, at this point, to suggest that the partnership between Kanye and Kid Cudi has seen better days. Though highly influential on a younger generation, Cudi’s left-field, art-damaged hip-hop has suffered from bloat and aimlessness in recent years; Ye’s reputation for keen trendspotting and canny trendsetting has hardly fared better. Uniting under the banner of Kids See Ghost, the duo’s first album together will show how much they have left to bring out in each other. —FG\n\nKanye and Nas, TBA (June 15)\n\nRap summits like “Still Dreaming,” “We Major,” and “Figure It Out” are proof Nas and Kanye West have great chemistry, so a full-length Nas album produced by West sounds like a hip-hop head’s pipe dream. It exists now … but true to the crucible of improbability and disappointment that is 2018, both men have come under fire in the weeks since the project was announced, Ye for attempting to establish a brotherly rapport with Donald Trump, and Nas for an interview in which his ex-wife Kelis said that he got physical with her during disputes. Does it come up on the record? Do they carry on business as usual? Can they? —CJ\n\nChristina Aguilera, Liberation (June 15)\n\nWhat does an Xtina album sound like in 2018? That’s the million-dollar question, given her six-year absence from making music. Christina has struggled to adapt to the evolving pop sphere — usually because she’s ahead of the curve. Lately, she’s been continuing her tradition of weird collaborative choices by having Kanye West co-produce Liberation’s first single, “Accelerate” (and he has another on the album), but her second single with Demi Lovato, “Fall in Line,” is more traditional Big Pop vocal gymnastics. Which means this album could go either way. —DL\n\nJay Rock, Redemption (June 15)\n\nJay Rock is an extremely charismatic rapper, which is why it feels odd to say that he’s also TDE’s secret weapon. He’s forceful, with a cocky sense of humor. He’s got a great ear for beats, and, in the form of “King’s Dead,” he’s already in possession of one of the year’s best singles (“Win” isn’t too shabby either). For whatever reason, though, he hasn’t carved out the same distinct lane for himself as Kendrick, Schoolboy Q, and Ab-Soul have. Whatever happens, Redemption has a strong chance at being a standout of 2018. —SHS\n\nOnyx Collective, Lower East Side Suite Part Three (June 15)\n\nThat this is not the only jazz album on this list says a lot about the extended, multiyear moment jazz is having in pop culture right now. Onyx Collective, the crew of downtown New York jazz kids, are making music that recalls the genre’s greats, without being beholden to years and years of jazz rules and stuffiness. This is vital music made by a bunch of people who are young enough that they’ll soon make something transcendent. —SHS\n\nGang Gang Dance, Kazuashita (June 22)\n\nGang Gang Dance, 21st-century art-music heroes of downtown New York, are back with their first album since 2011’s Eye Contact. The musical landscape has shifted since then, but the band’s qualities are still intact. They still sound like a band entirely without musical boundaries, and they still have a knack for pulling together disparate elements — think traces of Japanese New Age, poolside house, and modern classical composition — into a whole that somehow actually all fits together. —SHS\n\nKamasi Washington, Heaven and Earth (June 22)\n\nKamasi Washington is not known for his brevity. His albums regularly run over two hours, and only become truly rewarding after repeat listens. But still, anything Washington does is worth paying attention to. His sax playing was a crucial part of Kendrick Lamar’s To Pimp a Butterfly, and his previous looooong player, 2015’s The Epic, catapulted him into a strange world where jazz that leaned toward the spiritual was suddenly right at home on major festival stages all over the globe. Will his new album go further down that path? Will it be the album where Washington decides to get truly weird? Whatever happens, Heaven and Earth is another entry in the catalogue of an artist who is carving out an important space for himself at the intersection of popular music and new jazz. —SHS\n\nNine Inch Nails, Bad Witch (June 22)\n\nIt’s been five years since the last album from Trent Reznor’s band, but the profile of the industrial auteur and his crew has remained high. With a pair of EPs, much touring, and a beyond-electrifying performance on the new season of Twin Peaks under their belt, Nine Inch Nails remain one of the more polished monoliths left standing in rock’s world of rusty titans. Will their punishing aesthetic yield new revelations? In either case, much grimness awaits. —FG\n\nTeyana Taylor, TBA (June 22)\n\nA lifetime seems to have passed between now and the release of Teyana Taylor’s debut album, VII, in 2014. Then and now, Kanye West’s GOOD Music is Taylor’s label, but GOOD Music no longer carries the same meaning or cachet that it used to: With Kanye drifting into fields other than music, the label has been effectively rudderless. It’s hardly the situation a gifted R&B singer still searching for her breakout collection would want, but it’s the one Taylor’s stuck with; no doubt she’ll be doing her best to make her own voice heard over the unruly cant of her executive producer. —FG\n\nFlorence + The Machine, High As Hope (June 29)\n\nA voice as huge as Florence Welch’s was bound to tip fully into the mainstream at some point, and if the credits for her upcoming fourth album are any indication, that point is now. It’s a tasteful turn, of course: Executive producer Emile Haynie (Bruno Mars, Lana Del Rey) governs the transition, with Jamie xx and Sampha pitching in on a track each. “Sky Full of Song” and “Hunger,” the two lead singles, suggest a collection whose beauty lies in its boldness; even before its release, High As Hope is living up to its name. —FG\n\nLet’s Eat Grandma, I’m All Ears (June 29)\n\nIt’s hard not to mention the British indie-pop duo Let’s Eat Grandma without mentioning their extreme precocity. With both members still in their teens, the fact can’t easily be overlooked. Perhaps aided by the fact that they’ve been friends since childhood, Rosa Walton and Jenny Hollingworth have already succeeded in carving out a strange lane of their own. Their sound borrows widely without ever sounding derivative; as the three singles for their sophomore effort I’m All Ears show, they come in at smart, weird, synthetic angles with a lot of verve. —FG\n\nDirty Projectors, Lamp Lit Prose (July 13)\n\nDave Longstreth is full of ideas and in a rush to transmit them. Dirty Projectors, his band, released its first four albums in the space of three years; the pace slackened somewhat once Amber Coffman joined the band on vocals and guitar, but now that Coffman and Longstreth have broken up, he seems eager to make up for lost time. From the looks of the single “Break-Thru,” the successor to last year’s breakup album, Dirty Projectors, is shaping up to be bizarre. —FG\n\nNicki Minaj, Queen (August 10)\n\nThe title of Nicki’s new album, her fourth, takes two meanings at once: Along with its usual regal meaning, it’s a reference to her home borough of Queens. In both cases, there’s a sense of reiteration that suggests either renewal or exhaustion. Little that has passed since the 2014 release of The Pinkprint has dented Nicki’s commercial appeal or her superstar status, but all the same, her lyrics have showed signs of staleness and her public image has lost some of its candy-colored luster. Not to mention how, in the distant Bronx, a new monarch has been crowned. You don’t have to compare Nicki to Cardi or Queen to Invasion of Privacy, but if you do, the comparison is only going to flatter one side. Can Nicki’s punch lines and posturing outmatch Cardi’s realism and novelty? There’s only one way to find out. —FG\n\nMitski, Be the Cowboy (August 17)\n\nMitski’s music works through concentration: By giving up range, it gains in intensity. The solo artist’s indie rock locks onto her relationship status and seizes it for dear life. It’s an aesthetic that doesn’t expand or expound, but also doesn’t need to. The fundamentals are always complicated enough if you really zoom in. The title of the lead single, “Geyser,” is a helpful metaphor — an abrupt blast of feeling that ends no less abruptly. After Be the Cowboy comes out, expect Mitski’s small but fanatical audience to grow somewhat less small and even more fanatical than ever. —FG\n\nAnderson .Paak, TBA (TBA)\n\nLike the brilliant rapper and producer Madlib, Anderson .Paak is from Oxnard, California. Also like Madlib, .Paak’s whole style to date skews more toward smoking weed at sunrise and spending days buried in mounds of rare records as a way of avoiding the harsh realities of the world. Up to this point, .Paak’s music has existed largely in the realm of stoned soul and introspective rap that took its time to get to where it wanted to go. Then he released “Bubblin,” a track that manages to evoke Busta Rhymes’s hoarse growl without being annoying about it. Songs this good don’t really tend to come out in a vacuum, which (hopefully) means we’ll be getting a full album from .Paak this summer. —SHS\n\nWild Nothing, TBA (TBA)\n\nGemini, the 2010 debut LP from Jack Tatum, a.k.a. Wild Nothing, was a gorgeous slice of bedroom pop that — stay with me here — sounded like a warm summer evening. That’s a major cliché, but I’m using it because it’s really the best way to capture the combination of hope and calm that radiated from every track on that album. Ensuing releases were more robust and fleshed out with a full band. While they didn’t retain the same magic as the first LP, they made up for it through instrumental intricacy and strong hooks. We’re due for another Wild Nothing album this summer, and while it’d be a long shot to assume that it would have the same low-budget (in a good way), gauzy feel of Gemini, that doesn’t mean it won’t be another excellent entry in the catalogue of a project that has virtually perfected the art of writing about romance. —SHS\n\nPopcaan, Forever (TBA)\n\nThere are few better songs than Popcaan’s “Everything Nice.” I’m not saying it’s the best song of all time, but it belongs in a category that bears the hallmarks of perfection: It’s catchy, wistful, warm, and though it sounds very much like the era we live in, it’s not going to sound dated in a couple decades either. With the bar set that high, it’s not surprising that Popcaan’s “Body So Good,” the first single from his upcoming album Forever, is not as good as “Everything Nice,” but what is? It’s just another sign that Forever is going to be full of jams to soundtrack pretty much anything you’d ever want to do outside. —SHS\n\nMozzy, TBA (TBA)\n\nSacramento’s Mozzy, already hugely popular in some rap circles, got offered a prime spot on the Kendrick Lamar–helmed Black Panther soundtrack, and in a perfect world, it would open the door to a whole new swath of fans who didn’t even realize that they needed Mozzy in their lives. The main question for me: Will this album reach the heights of 2017’s excellent 1 Up Top Ahk, which was an often brutal, touching meditation on violence, death, and the struggles that come from both? —SHS\n\nSOB X RBE, TBA (TBA)\n\nThe Bay Area teen rappers of SOB x RBE are spiky, enthusiastic rhymers whose syllables sometimes tumble out so quickly it feels like they’re racing against time. The quartet’s first two mixtapes, SOB x RBE and GANGIN, were cluster bombs bursting with youthful energy, banging West Coast beats, clever sample choices, and frightening, precocious street wisdom. A studio album is a chance to build on what has been a great start. It’ll be exciting to watch this group grow. —CJ\n\nBrockhampton, Puppy (June TBA)\n\nMusic fans are impatient. Pretty much the second after an album comes out, we’re speculating about a follow-up. It’s definitely unhealthy, but I get it: It’s exciting to think that an artist you love may have the best song you’ve ever heard in their back pocket, and they just need to get it together to release it. Brockhampton — the rap group/boy band (they’re really just a rap group but they call themselves a boy band, so let’s just go with it) — released three albums in 2017, each one better than the previous, which implies that Puppy, which is probably an album and not an actual baby dog, and is potentially due to come out next month, could be their most fully realized work yet. —SHS\n\nDrake, Scorpion (June TBA)\n\nIf you read much astrology, you know that Scorpios are said to be passionate, guarded, occasionally vengeful people. If you listen to much Drake, you’ve often heard “October’s Very Own” live up to the characteristics of his sign. Drake naming the next album Scorpion and leading with a song like “God’s Plan” — where the rapper-singer celebrates his friends and successes while obsessing over the many people he knows can’t stand him — most likely means this summer we’ll be awash in joyous, passive-aggressive jams like “Energy” and “Fake Love.” —CJ\n\nAriana Grande, Sweetener (July TBA)\n\nHere’s what we know about Ariana Grande’s fourth album so far: It’s led by the outstanding U.K. garage-indebted first single, “No Tears Left to Cry”; was half produced by Pharrell, and the other half by Max Martin; will reportedly sound like 1,000 Arianas multiplied and layered over each other; song titles include “God Is a Woman” (!!!) and “Get Well Soon”; and she took the lead on writing all of its songs for the first time in her career. Oh, and if it’s about love, then that lover will no longer be Mac Miller, but SNL’s Pete Davidson. She said just this week that she’s been adding more songs, so it’s possible! —DL\n\nTroye Sivan, Bloom (August 31)\n\nBy now it should be clear what our sweet prince Troye Sivan intends to serve with his sophomore album, Bloom: bops on bops on more bops. “My My My!” and “Bloom” are a breath of fresh air in the straight-and-narrow pop landscape, and it appears his new album will lean even heavier on the ’80s pop palette he clearly loves. If Hayley Kiyoko is our Lesbian Jesus, Troye Sivan is the Gay Holy Spirit. #20GayTeen is still going strong! —DL\n\nCarrie Underwood, Cry Pretty (September 14)\n\nCarrie Underwood is one of the great singers of our time; her rise to country industry dominance is one of American Idol’s most resounding success stories. Across records like “Before He Cheats,” “Blown Away,” and “Church Bells,” Underwood offers note-perfect vocal performances and intimate glimpses into the struggles of complicated American women. If the boiling intensity of the title track is any indication, this year’s Cry Pretty will serve up more of the same. —CJ\n\nBeyoncé and Jay-Z, ???? (TBA)\n\nWhat are Beyoncé and Jay-Z up to? It’s the perennial question of our time. But for the purposes of this list, let’s take a stab at answering it: On June 6, Bey and Hov will hit the road for the sequel to their On the Run tour, which can mean two things. (1) They’ll use this as another opportunity to promote their old solo work in a two-for-one deal, or (2) they have that long-rumored joint album (which was recently confirmed by Jay-Z to exist) dropping imminently. The two were spotted in Jamaica pre-Beychella filming visuals for something, so stay tuned. —DL\n\nA$AP Rocky, Testing (TBA)\n\nIt’s hard to fault Rocky for being late with his third album, the dude has had a lot on his plate. Since A$AP Yams’s untimely death, he’s had to take over direction of the entire A$AP crew; between building bridges with the fashion world and bringing projects from his affiliates into fruition, the question wasn’t whether Testing would be delayed, but for how long. Specific details are lacking, but heralded by the tripped-out video for the Moby-sampling “A$AP Forever,” Rocky’s Testing album is sure to show off an artist carefully negotiating between disparate realms: Harlem streets and Paris runways, the sounds of the South and the East. —FG\n\nChildish Gambino, TBA (TBA)\n\nIf the fifth element of hip-hop is arguing, then the sixth is wild speculation — so let’s do some speculating. In between beefing up the Star Wars franchise and making the best television show, Donald Glover has been working on new music. If you had a hit like “This Is America” on your hands, wouldn’t you want to get an album out into the world while people were still dissecting every second? —SHS", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-summer-preview-albums.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-summer-preview-albums.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-summer-preview-albums.w1200.h630.jpg", "keywords": [], "authors": ["Frank Guan", "Sam Hockley-Smith", "Craig Jenkins", "Dee Lockett"], "canonical_link": "https://www.vulture.com/2018/05/summer-music-preview-drake-nicki-minaj-and-so-much-kanye.html", "title": "Summer Music Preview: Drake, Nicki Minaj, Ariana Grande, and So Much Kanye", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Summer Music Preview: Drake, Nicki Minaj, Ariana Grande, and So Much Kanye", "url": "https://www.vulture.com/2018/05/summer-music-preview-drake-nicki-minaj-and-so-much-kanye.html", "description": "Plus: Wild speculation about Beyoncé, Jay-Z, and Childish Gambino.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-summer-preview-albums.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Summer Music Preview: Drake, Nicki Minaj, and So Much Kanye", "description": "Plus: Wild speculation about Beyoncé, Jay-Z, and Childish Gambino.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-summer-preview-albums.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-05-24T16:56:29.592-04:00", "tag": "asap rocky, drake, music, kanye west, nicki minaj, ariana grande, pusha t, kid cudi, nas, christina aguilera, gang gang dance, oneohtrix point never, father john misty, natalie prass, chrvches, jorja smith, wild nothing, onyx collective, teyana taylor, kids see ghost, anderson .paak, lily allen, snail mail, serpentwithfeet, lykke li, kamasi washington, nine inch nails, florence and the machine, dirty projectors, let's eat grandma, mitski, popcaan, mozzy, sob x rbe, brockhampton, troye sivan, carrie underwood, jay rock, beyonce, jay-z, childish gambino, summer preview 2018, summer music preview, vulture lists, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "It’s summer, which means we’ve got a list of album highlights released in the ensuing months: from Kanye West to Drake to Nicki Minaj, to — maybe — Beyoncé and Jay-Z?", "sailthru.tags": "asap rocky, drake, music, kanye west, nicki minaj, ariana grande, pusha t, kid cudi, nas, christina aguilera, gang gang dance, oneohtrix point never, father john misty, natalie prass, chrvches, jorja smith, wild nothing, onyx collective, teyana taylor, kids see ghost, anderson .paak, lily allen, snail mail, serpentwithfeet, lykke li, kamasi washington, nine inch nails, florence and the machine, dirty projectors, let's eat grandma, mitski, popcaan, mozzy, sob x rbe, brockhampton, troye sivan, carrie underwood, jay rock, beyonce, jay-z, childish gambino, summer preview 2018, summer music preview, vulture lists, vulture homepage lede", "author": "Frank Guan, Sam Hockley-Smith, Craig Jenkins, Dee Lockett", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1527195389.592, "source": "http://www.vulture.com", "summary": ""}