{"url": "www.elitedaily.com/p/are-selena-gomez-justin-bieber-friends-new-reports-say-theyre-hanging-out-2990086", "text": "Hold onto your sanity, Jelena shippers, because your two favorite people might be friends again. According to reports, Selena Gomez and Justin Bieber have been hanging out as friends over the last couple weeks. They've been hanging out with groups of mutual friends, TMZ reports, and The Weeknd is apparently totally cool with it/knows all about it. So are Selena Gomez and Justin Bieber friends for real this time? Did Bieber perform his song \"Friends\" for her and was like, \"Selena, girl, can we be friends plz?\" Maybe!\n\nThe exes were reportedly seen platonically hanging out at Gomez's house in Studio City with a group of friends this past Sunday, Oct. 22. TMZ released photos that reportedly show Gomez pulling into her house on Sunday night and Bieber's car following just 10 minutes after. There's also a photo of what appears to be Gomez and Bieber walking out of her house, but only the tattooed arm of a guy can be seen in the photo, so it's hard to confirm that it's actually the Biebs. Still, fans are completely losing their minds, seeing as if their beloved Jelena won't get back together in a romantic way, friendship is a good second.\n\nTry not to faint, Jelena fans, but these are the reported photos of Gomez and Bieber hanging out this past weekend.\n\nSome fans are like, \"OMG YASSSSSS,\" while others are like, \"Meh.\"\n\nGomez and Bieber reportedly got back in touch around the time she revealed she had a kidney transplant earlier this summer.\n\nGomez revealed the news in a moving Instagram post on Sept. 14 that read,\n\nI'm very aware some of my fans had noticed I was laying low for part of the summer and questioning why I wasn't promoting my new music, which I was extremely proud of. So I found out I needed to get a kidney transplant due to my Lupus and was recovering. It was what I needed to do for my overall health. I honestly look forward to sharing with you, soon my journey through these past several months as I have always wanted to do with you. Until then I want to publicly thank my family and incredible team of doctors for everything they have done for me prior to and post-surgery. And finally, there aren't words to describe how I can possibly thank my beautiful friend Francia Raisa. She gave me the ultimate gift and sacrifice by donating her kidney to me. I am incredibly blessed. I love you so much sis. Lupus continues to be very misunderstood but progress is being made. For more information regarding Lupus please go to the Lupus Research Alliance website: www.lupusresearch.org/ -by grace through faith\n\nOne of Gomez's best friends, actress Francia Raisa, was her kidney donor, and Gomez penned a beautiful thank you to her in her Instagram post. Raisa posted about the experience on her own Instagram shortly after Gomez. She said,\n\nI am beyond grateful that God would trust me with something that not only saved a life, but changed mine in the process. This was part of our story, and we will share it soon, but what is important now is that this is not the only story.For more information regarding Lupus, please go to the Lupus Research Alliance website: www.lupusresearch.org -- Love you sis, so glad we’re on this journey together. ❤️ xx\n\nIn August, Bieber released the single \"Friends\" with BloodPop. It's about wanting to be friends with an ex, and fans immediately thought \"Friends\" was about Selena Gomez.\n\nBloodPop® on YouTube\n\nThe \"Friends\" lyrics go:\n\nDo you wonder why I've been callin'? Like I've got ulterior motives\n\nNo, we didn't end this so good\n\nBut you know we had something so good\n\nSo I'm wonderin'\n\nCan we still be friends? (oh) Can we still be friends? (oh)\n\nDoesn't have to end\n\nAnd if it ends, can we be friends?\n\nCan we be friends? Can we be friends?\n\nSounds to me like someone is trying to platonically reconcile with an ex! But honestly, these two probably don't write all of their songs about each other... I'm just sayin'. Gomez has a new single coming out on Oct. 25. called \"Wolves.\" She released the \"Wolves\" lyrics on Oct. 24 and they're super romantic. Fans are assuming it's about her current boyfriend, The Weeknd, and they're pumped. But, it's safe to say Jelena shippers are having a good day today.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/6d23e08e-5142-4d6e-8ab4-bf0ef00942f5-getty-82305502.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/6/fdc08a49-2594-48d5-a7cf-874f76fb7227-getty-902443010.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/10/25/c41a2916-406d-463e-b6f4-8a559a7cfaaa-getty-120069903.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2017/10/25/c41a2916-406d-463e-b6f4-8a559a7cfaaa-getty-120069903.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/069fdfe3-d829-477e-9562-dcba704bddcb-getty-530047400.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/10/25/c41a2916-406d-463e-b6f4-8a559a7cfaaa-getty-120069903.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/are-selena-gomez-justin-bieber-friends-new-reports-say-theyre-hanging-out-2990086", "title": "Are Selena Gomez & Justin Bieber Friends? New Reports Say They’re Hanging Out", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/are-selena-gomez-justin-bieber-friends-new-reports-say-theyre-hanging-out-2990086", "type": "article", "title": "Selena Gomez & Justin Bieber Might Be Friends Again & Jelena Fans Are Freaking Out", "description": "Hold onto your sanity, Jelena shippers, because your two favorite people might be friends again. According to reports, Selena Gomez and Justin Bieber have been hanging out as friends over the last couple weeks. They've been hanging out with groups…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/10/25/c41a2916-406d-463e-b6f4-8a559a7cfaaa-getty-120069903.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Hold onto your sanity, Jelena shippers, because your two favorite people might be friends again. According to reports, Selena Gomez and Justin Bieber have been hanging out as friends over the last couple weeks. They've been hanging out with groups…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}