{"url": "www.brides.com/story/celebrity-wedding-guest-dresses", "text": "Red carpet events and movie premieres aren't the only parties celebrities score invites to. Save-the-dates and wedding invitations are also delivered to the Hollywood mailboxes of celebs. And just like us normie wedding guests, these A-listers have to figure out what the hell to wear! But choosing an outfit that's fabulous enough to wear to watch their besties say I do seems to come easy to these style stars. Need proof? Check out what these 25 celebrities wore as wedding guests.\n\nWe already look to celebrity brides for wedding dress inspiration (ahem, Kate Middleton's long lace sleeves), so why shouldn't we do the same with wedding guest looks? After all, whether it's Selena Gomez at the wedding of her TV brother David Henrie, Emily Blunt at the high-profile nuptials of George and Amal Clooney, or Kim Kardashian at the I dos of a swanky club owner, these famous wedding guests always serve up serious style inspo. The Duchess of Cambridge herself even proved that she can look wedding-ready when she's not the one walking down the aisle. Remember when she was wedding guest goals at the nuptials of her sis Pippa Middleton?\n\nTake a look below to see the fiercely fashion-forward outfits your favorite celebrities wore to the weddings of their famous friends.\n\nEmily Blunt\n\nRobino Salvatore/GC Images/Getty Images\n\nAt Amal and George Clooney's gorgeous Italian wedding, the guest list was obviously star-studded. Celebs like Matt Damon, Bono, Anna Wintour, and Bill Murray all jetted off to Venice for the nuptials. But it was Emily Blunt on the arm of her hubby, John Krasinski, who scored a gold style star with her embellished blue dress.\n\nSelena Gomez\n\nIt was a Wizards of Waverly Place reunion at the wedding of actor David Henrie. Selena Gomez arrived in a floor-length burgundy gown with a high neckline.\n\nJennifer Lawrence\n\nJennifer Lawrence was summer wedding perfection in the shimmering lilac slip dress she wore to her BFF's wedding in Tuscany.\n\nKate Middleton\n\nGetty Images\n\nWhen Pippa Middleton tied the knot, the guest list was pure royalty. Princess Charlotte served as flower girl, Prince George took on pageboy duties, and their mom, the Duchess of Cambridge, was the ultimate wedding guest in her peach frock and matching hat.\n\nKim Kardashian West and Kanye West\n\nGetty Images\n\nAt the Miami nuptials of club owner Dave Grutman and his love, Isabela Rangel, the guest list gleaned an extra dose of glam when the Kardashian-West duo rolled up to the scene. West kept things classic in a dapper black suit, while Kardashian dressed in a sultry black dress that certainly wasn't short on the cleavage or curve-hugging sex appeal. Well, at least she didn't wear white, right?\n\nSofia Vergara and Jesse Tyler Ferguson\n\nKris Jenner may have officiated the nuptials of Colton Haynes and Jeff Leatham, but the officiant wasn't the only celeb in the room. Modern Family stars Sofia Vergara and Jesse Tyler Ferguson partied it up at the couple's reception, with Vergara looking super chic in her all-black ensemble that featured a shiny cropped corset and a skirt made for dancing.\n\nMary-Kate and Ashley Olsen\n\nMary-Kate and Ashley Olsen glammed it up as guests at the posh wedding of fashion blogger Colby Johnson and art collector Alberto Mugrabi in the South of France. The fashion-designer twins rocked an off-the-shoulder midi dress with a large white lapel and an intricately-embellished dark green gown for the occasion.\n\nKarlie Kloss\n\nAt the same extravagant event, model Karlie Kloss stunned in a beige lace number.\n\nIris Van Berne, Melissa Tammerijn and Madison Headrick\n\nVictoria's Secret Angel Vita Sidorkina had a positively heavenly guest list when she wed Italian millionaire Valerio Morabito this summer, and her fashion girl guests looked just too cool. Dutch models Iris Van Berne and Melissa Tammerijn and U.S. model Madison Headrick wore sexy slip gowns and flower crowns.\n\nLea Michele\n\nPhoto by Carrie Patterson\n\nThe cast of Glee headed to Jackson Hole, Wyoming, to reunite for their costar Becca Tobin's wedding, and one of these gleeful guests earned the MVP when it came to wedding guest style. Lea Michele schooled everyone in winter wedding style in her ruby red gown and oversized blazer.\n\nReese Witherspoon\n\nReese Witherspoon donned a fabulous floral frock for the wedding of Modern Family star Sofia Vergara. Pairing her black dress with a red lip, Witherspoon looked perfectly polished.\n\nVictoria Beckham\n\nVictoria Beckham pulled double wedding duty at the nuptials of her bestie Eva Longoria. Beckham not only designed the bride's flawlessly fitted wedding dress, but she also took over the dance floor with her hubby at the reception. And of course, Beckham did it all while looking effortlessly elegant in her navy blue strapless gown.\n\nChrissy Teigen\n\nHoly shoulders! The heavily embellished bodice of the frock Chrissy Teigen rocked to Kim Kardashian and Kanye West's elaborate wedding weekend had glam gladiator vibes.\n\nRihanna\n\nAt the wedding of her friend and stylist, Rihanna needed an outfit fly enough to impress this fashion-pro bride. No sweat. Rhianna chose a lilac silk kimono wrap dress with orange lotus flowers.\n\nBeyoncé\n\nOnly Beyoncé can get away with wearing white to a wedding! Queen Bey, in a cream and gold-trimmed wrap dress, and her dancing partner (Blue Ivy, of course) twirled around the reception dance floor at the celebration.\n\nRebel Wilson\n\nAca-awesome! Rebel Wilson was beautiful in blush at the wedding of her Pitch Perfect costars Anna Camp and Skylar Astin.\n\nJennifer Lopez and Alex Rodriguez\n\nBefore they were engaged, Jennifer Lopez and Alex Rodriguez attended a wedding together in New York City. J.Lo slayed in a form-fitting teal gown that featured a plunging neckline and high collar, and completed the look with her signature hoops.\n\nLauren Conrad\n\nCue Hilary Duff's \"Coming Clean!\" Lauren Conrad attended the wedding of her former Laguna Beach costar Dieter Schmitz wearing a simple pale pink slip dress.\n\nBrooke Shields\n\nGetty Images\n\nWell, the marriage didn't last and neither did this friendship, but the deep red velvet gown Brooke Shields wore to the wedding of Tom Cruise and Katie Holmes will live on in infamy.\n\nAmal and George Clooney\n\nGetty Images\n\nFor Meghan Markle and Prince Harry's royal wedding in 2018, George and Amal Clooney stepped out in coordinating spring numbers. Her vibrant Stella McCartney look was unforgettable and even landed her a spot on our best dressed royal wedding guest list.\n\nSerena Williams\n\nShutterstock\n\nFor the same royal wedding, Serena Williams went with an all pink number. Her whimsical fascinator was perfect for the British \"I do's.\"\n\nPriyanka Chopra\n\nCHRIS JACKSON\n\nAnother royal wedding guest, actress Priyanka Chopra wore a lavender made-to-measure suit by Viviene Westwood. As a close friend of the duchess, it's no surprise she flew across the pond for the big day!\n\nSophie Turner and Maisie Williams\n\nJane Barlow - PA Images\n\nFor their onscreen brother Kit Harington's wedding, Game of Thrones co-stars Sophie Turner and Maisie Williams arrived at the venue together wearing coordinating looks.\n\nEmilia Clarke\n\nMark Milan\n\nWhen Khaleesi herself attended the Scottish nuptials of her Game of Throne's co-stars Kit Harington and Rose Leslie, she arrived solo in a blush eyelet dress, pink coat and nude heels.\n\nCara Delevingne\n\nSamir Hussein/WireImage/Getty Images\n\nAs a guest at Princess Eugenie and Jack Brooksbank's royal nuptials, model Cara Delevingne opted for a chic menswear look—pairing a fitted suit jacket and tailored pants with stilettos and a top hat.\n\nGigi and Bella Hadid\n\nJames Devaney\n\nModel sisters Gigi and Bella Hadid also pulled off glamorous menswear-inspired outfits for designer Marc Jacob's wedding to Char Defrancesco.\n\nKaty Perry\n\nGetty Images\n\nKaty Perry opted for a watercolor dress, pink headband and pastel blue coat when singer Ellie Goulding wed Caspar Jopling. The best accessory? Her fiancé Orlando Bloom on her arm!\n\nMeghan Markle\n\nWhen Meghan Markle attended the wedding of her fashion designer BFF and matchmaker Misha Nonoo, she arrived wearing a sheer black Valentino gown. Like anything the Duchess wears, the stunning dress was quickly sold out online.\n\nKylie Jenner\n\nTypically, all eyes are on the bride when it comes to weddings, but that's clearly not the case when Kylie Jenner is on the guest list! The makeup mogul wore an elaborate gold gown to the Bieber's South Carolina nuptials that most definitely turned heads.\n\nEmma Stone\n\nWhile we don't know much about Jennifer Lawrence's Rhode Island wedding, we do know what Emma Stone wore to the occasion! The actress defined fall wedding guest attire in her gray velvet dress and matching duster.\n\nKaia Gerber and Pete Davidson", "images": ["data:image/svg+xml,%3Csvg width=%271414%27 height=%271895%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27500%27 height=%27700%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271925%27 height=%273000%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272136%27 height=%272670%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%273456%27 height=%275184%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271773%27 height=%273000%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275289%27 height=%277590%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.brides.com/thmb/nnMpyjg_EmkmqGZz27Ze9Cxvi3Y=/1024x576/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__58da8130205b3866c504b43f__169-5295b387c4da40eb802668c47cbe7213.jpeg", "data:image/svg+xml,%3Csvg width=%272213%27 height=%273320%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272532%27 height=%273500%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272000%27 height=%273000%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%271050%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.brides.com/thmb/2GJwTwOJ7cv68pOrDuyIfYP68to=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__58da8130205b3866c504b43f__11-76dea50a17154cfbb0350874a8ff5af0.jpeg", "data:image/svg+xml,%3Csvg width=%271024%27 height=%271536%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "http://:0"], "top_img": "https://www.brides.com/thmb/nnMpyjg_EmkmqGZz27Ze9Cxvi3Y=/1024x576/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__58da8130205b3866c504b43f__169-5295b387c4da40eb802668c47cbe7213.jpeg", "keywords": [], "authors": ["Jamie Cuccinelli", "Maggie Kreienberg"], "canonical_link": "https://www.brides.com/story/celebrity-wedding-guest-dresses", "title": "From Beyoncé to Selena Gomez, Here's What 30 Celebrities Wore to Their Friends' Weddings", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "See the fiercely fashion-forward outfits your favorite celebrities wore to the weddings of their famous friends", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Jamie Cuccinelli and Maggie Kreienberg", "sailthru.tags": "news,weddings-and-celebs", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/story/celebrity-wedding-guest-dresses", "title": "From Beyoncé to Selena Gomez, Here's What 30 Celebrities Wore to Their Friends' Weddings", "description": "See the fiercely fashion-forward outfits your favorite celebrities wore to the weddings of their famous friends", "image": "https://www.brides.com/thmb/nnMpyjg_EmkmqGZz27Ze9Cxvi3Y=/1024x576/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__58da8130205b3866c504b43f__169-5295b387c4da40eb802668c47cbe7213.jpeg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "From Beyoncé to Selena Gomez, Here's What 30 Celebrities Wore to Their Friends' Weddings", "description": "See the fiercely fashion-forward outfits your favorite celebrities wore to the weddings of their famous friends", "image": "https://www.brides.com/thmb/1ZRTxbl29v3sZCbP5s2hZkoWfGk=/1024x1024/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__58da8130205b3866c504b43f__11-76dea50a17154cfbb0350874a8ff5af0.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://www.brides.com", "summary": ""}