{"url": "https://variety.com/2017/tv/news/pretty-little-liars-finale-recap-interview-spencer-twin-alex-drake-1202481209/", "text": "SPOILER ALERT: Do not read ahead if you have not watched the “Pretty Little Liars” series finale, which aired June 27 on Freeform.\n\nAfter seven seasons of whodunnit mystery, cliffhangers, and torment by “A,” the Liars finally found out the true identity of Rosewood’s villain … Spencer (Troian Bellisario) has a twin!\n\nThe identical twin with a British accent is named Alex Drake — A.D., get it? — and is Mary Drake’s (Andrea Parker) other daughter, who was sold as an infant upon birth so that Mary Drake could pay her way out of the Radley Sanitarium mental institution. Mary Drake sent her to a wealthy family in London, thinking she would have a great life, but instead, Alex ended up at an orphanage and never had a real family. Her lack of family, in comparison to Spencer’s seemingly “perfect” life, is what prompted her to take down the Liars.\n\nAlex showed up in Tuesday night’s finale and locked up Spencer with a plan to pose as her sister for the rest of her life. Of course, that didn’t happen because the Liars and the men of Rosewood came together to crack the case at the last minute, and all lived happily ever after.\n\nHere, “Pretty Little Liars” creator Marlene King speaks to Variety about the series finale…\n\nHow long was this the plan for Spencer to have a twin and for the twin to be A.D.?\n\nWe started talking about it before Charlotte’s death so between 5B and 6A, and I knew we couldn’t continue the story until we knew what that ultimate ending was going to be — if we’re going to bring in a new “A,” we’re going to have to know who it is and why it’s happening before starting the story.\n\nAside from Alex Drake, can you confirm once and for all, who was the full A-team?\n\nFor the first two seasons, it was Mona. She’s original “A.” And then Charlotte stole it from her and she’s “Big A.” And then the death of Charlotte was the genesis for “A.D.”\n\nHave you been keeping up with all of the fan reaction to the finale on social media?\n\nI haven’t been online, to be honest with you. I’m intentionally staying off of social media for a couple of days to give myself a breather.\n\nHow many times did we see Alex as Spencer through the course of the series?\n\nI think her first time on-screen was when Hanna was being tortured in the shed and she dreamt that Spencer came to her to reassure her and give her a clue to get out, that was Alex. After Yvonne died and Toby was leaving town and Spencer came to say goodbye to Toby and asked for a kiss, that was Alex. We saw Alex wearing an argyle sweater in the Hastings home looking at family photographs. Two episodes ago, when Spencer went to go visit Toby in the cabin and they had that crazy wild sex, that was Alex.\n\nThat’s so twisted, Marlene!\n\nI know. [Laughing] Sorry! Spoby fans were not happy.\n\nWhen you told Troian that she would be playing “Uber A,” what was her reaction and what went into the prep work to master two characters?\n\nShe was amazing. She knew for two years and then we started honing in about a year ago on the real backstory of the character, so she’s been working on that dialect for a long time and she really did her homework.\n\nHow did the other girls react when they found out it would be Troian playing “A.D.” ultimately?\n\nWe didn’t tell anyone. Troian wanted to keep it a secret because she didn’t want people to know it was “A.D.” when they were acting in those scenes. Little by little, some people started to figure it out. By the time it was Alex Drake and Toby having sex in episode 18, some people started to put it together, but we didn’t confirm or deny anything.\n\nWhat was that first table read like when Troian finally came out as “A.D?”\n\nPeople loved it. At that table read, I didn’t really know what to expect because Troian had to play Alex Drake and Spencer, and so she was playing these scenes with herself at the table read. People were on the edge of their seats and I knew it was going to work. Even the table read wasn’t easy to pull off.\n\nSpencer’s parents didn’t know she had a twin, correct?\n\nThat is correct. Veronica and Peter did not know.\n\nMona is always so hard to read, but should we believe that she was actually always on the Liars’ side for this season?\n\nDefinitely for the first two seasons, she was “A.” But then I think she wanted to be Hanna’s friend in these final seasons.\n\nCan you speak to Mona’s final scene when she had Alex and Mary Drake in the dollhouse in France? What should viewers take away from that?\n\nWe really just wanted to give the story a twist on a twist, and I really wanted to give Mona a happy ending and something that honestly was just really fun. She always loved France, she was always playing those records, so it makes sense that she would go to France with her hottie and play grown-up dollies with these two characters.\n\nSpencer’s sister, Melissa, was always a fan-favorite theory to be “Uber A.” Can you explain what her involvement was in all of this, if at all?\n\nShe killed Bethany Young. Melissa was responsible for that murder, but she did it to protect her sister. But other than being a greedy older sister, that’s really her only thing — she really wasn’t that evil.\n\nAll of the couples end up together in the end — was that always the plan?\n\nIt really was. I’m a total romantic at heart. The path was bumpy and curvy, but I always knew these couples would end up together. The relationships are so important to our fans and they were so patient, so I thought it was really important to give them that.\n\nThe finale alludes to Spencer and Toby being together, but in your mind, what are they doing right now?\n\nThey’re living in the city and he’s building houses for homeless vets, and she’s commuting to Rosewood because she’s an attorney now working at Hastings & Hastings with her mom. And they’re engaged.", "images": ["https://pmcvariety.files.wordpress.com/2017/06/145069_0649-900x0.jpg?w=900", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fpretty-little-liars-finale-recap-interview-spencer-twin-alex-drake-1202481209%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202481209&comment_count=4", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/06/145069_0649-900x0.jpg?w=900", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2017/tv/news/pretty-little-liars-finale-recap-interview-spencer-twin-alex-drake-1202481209/", "title": "‘Pretty Little Liars’ Creator Breaks Down Major ‘A’ Reveal in Series Finale (SPOILERS)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Marlene King talks to Variety about the big reveal in the series finale with Troian Bellisario.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202481209, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-06-28T11:39:54"}, "pmc-tag": "Freeform,Marlene King,Pretty Little Liars", "title": "‘Pretty Little Liars’ Creator Breaks Down Major ‘A’ Reveal in Series Finale (SPOILERS)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Pretty Little Liars’ Creator Breaks Down Major ‘A’ Reveal in Series Finale (SPOILERS)", "url": "https://variety.com/2017/tv/news/pretty-little-liars-finale-recap-interview-spencer-twin-alex-drake-1202481209/", "description": "SPOILER ALERT: Do not read ahead if you have not watched the “Pretty Little Liars” series finale, which aired June 27 on Freeform. After seven seasons of whodunnit mystery, cliffhangers…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/145069_0649-900x0.jpg?w=900", "width": 900, "height": 600, "alt": "Pretty Little Liars finale"}, "locale": "en_US"}, "article": {"published_time": "2017-06-28T18:39:54+00:00", "modified_time": "2017-06-28T19:09:25+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "‘Pretty Little Liars’ Creator Breaks Down Major ‘A’ Reveal in Series Finale (SPOILERS)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/145069_0649-900x0.jpg?w=900", "alt": "Pretty Little Liars finale"}, "card": "summary_large_image", "title": "‘Pretty Little Liars’ Creator Breaks Down Major ‘A’ Reveal in Series Finale (SPOILERS)", "description": "Marlene King talks to Variety about the big reveal in the series finale with Troian Bellisario."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202481209, "title": "'Pretty Little Liars' Creator Breaks Down Major 'A' Reveal in Series Finale (SPOILERS)", "published_at": "2017-06-28 11:39:54", "image": "https://pmcvariety.files.wordpress.com/2017/06/145069_0649-900x0.jpg?w=900", "comment_count": 4, "tags": "Pretty Little Liars", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read ahead if you have not watched the \"Pretty Little Liars\" series finale, which aired June 27 on Freeform.\r\n\r\nAfter seven seasons of whodunnit mystery, cliffhangers, and torment by \"A,\" the Liars finally found out the true identity of Rosewood's villain ... Spencer (Troian Bellisario) has a twin!\r\n\r\nThe identical twin with a British accent is named Alex Drake -- A.D., get it? -- and is Mary Drake's (Andrea Parker) other daughter, who was sold as an infant upon birth so that Mary Drake could pay her way out of the Radley Sanitarium mental institution. Mary Drake sent her to a wealthy family in London, thinking she would have a great life, but instead, Alex ended up at an orphanage and never had a real family. Her lack of family, in comparison to Spencer's seemingly \"perfect\" life, is what prompted her to take down the Liars.\r\n\r\nAlex showed up in Tuesday night's finale and locked up Spencer with a plan to pose as her sister for the rest of her life. Of course, that didn't happen because the Liars and the men of Rosewood came together to crack the case at the last minute, and all lived happily ever after.\r\n\r\nHere, \"Pretty Little Liars\" creator Marlene King speaks to Variety about the series finale...\r\n\r\nHow long was this the plan for Spencer to have a twin and for the twin to be A.D.?\r\n\r\nWe started talking about it before Charlotte's death so between 5B and 6A, and I knew we couldn't continue the story until we knew what that ultimate ending was going to be -- if we're going to bring in a new \"A,\" we're going to have to know who it is and why it's happening before starting the story.\r\n\r\nAside from Alex Drake, can you confirm once and for all, who was the full A-team?\r\n\r\nFor the first two seasons, it was Mona. She's original \"A.\" And then Charlotte stole it from her and she's \"Big A.\" And then the death of Charlotte was the genesis for \"A.D.\"\r\n\r\n\r\n\r\nHave you been keeping up with all of the fan reaction to the finale on social media?\r\n\r\nI haven't been online, to be honest with you. I'm intentionally staying off of social media for a couple of days to give myself a breather.\r\n\r\nHow many times did we see Alex as Spencer through the course of the series?\r\n\r\nI think her first time on-screen was when Hanna was being tortured in the shed and she dreamt that Spencer came to her to reassure her and give her a clue to get out, that was Alex. After Yvonne died and Toby was leaving town and Spencer came to say goodbye to Toby and asked for a kiss, that was Alex. We saw Alex wearing an argyle sweater in the Hastings home looking at family photographs. Two episodes ago, when Spencer went to go visit Toby in the cabin and they had that crazy wild sex, that was Alex.\r\n\r\nThat's so twisted, Marlene!\r\n\r\nI know. [Laughing] Sorry! Spoby fans were not happy.\r\n\r\nWhen you told Troian that she would be playing \"Uber A,\" what was her reaction and what went into the prep work to master two characters?\r\n\r\nShe was amazing. She knew for two years and then we started honing in about a year ago on the real backstory of the character, so she's been working on that dialect for a long time and she really did her homework.\r\n\r\nHow did the other girls react when they found out it would be Troian playing \"A.D.\" ultimately?\r\n\r\nWe didn't tell anyone. Troian wanted to keep it a secret because she didn't want people to know it was \"A.D.\" when they were acting in those scenes. Little by little, some people started to figure it out. By the time it was Alex Drake and Toby having sex in episode 18, some people started to put it together, but we didn't confirm or deny anything.\r\n\r\n\r\n\r\nWhat was that first table read like when Troian finally came out as \"A.D?\"\r\n\r\nPeople loved it. At that table read, I didn't really know what to expect because Troian had to play Alex Drake and Spencer, and so she was playing these scenes with herself at the table read. People were on the edge of their seats and I knew it was going to work. Even the table read wasn't easy to pull off.\r\n\r\nSpencer's parents didn't know she had a twin, correct?\r\n\r\nThat is correct. Veronica and Peter did not know.\r\n\r\nMona is always so hard to read, but should we believe that she was actually always on the Liars' side for this season?\r\n\r\nDefinitely for the first two seasons, she was \"A.\" But then I think she wanted to be Hanna's friend in these final seasons.\r\n\r\nCan you speak to Mona's final scene when she had Alex and Mary Drake in the dollhouse in France? What should viewers take away from that?\r\n\r\nWe really just wanted to give the story a twist on a twist, and I really wanted to give Mona a happy ending and something that honestly was just really fun. She always loved France, she was always playing those records, so it makes sense that she would go to France with her hottie and play grown-up dollies with these two characters.\r\n\r\nSpencer's sister, Melissa, was always a fan-favorite theory to be \"Uber A.\" Can you explain what her involvement was in all of this, if at all?\r\n\r\nShe killed Bethany Young. Melissa was responsible for that murder, but she did it to protect her sister. But other than being a greedy older sister, that's really her only thing -- she really wasn't that evil.\r\n\r\nAll of the couples end up together in the end -- was that always the plan?\r\n\r\nIt really was. I'm a total romantic at heart. The path was bumpy and curvy, but I always knew these couples would end up together. The relationships are so important to our fans and they were so patient, so I thought it was really important to give them that.\r\n\r\nThe finale alludes to Spencer and Toby being together, but in your mind, what are they doing right now?\r\n\r\nThey're living in the city and he's building houses for homeless vets, and she's commuting to Rosewood because she's an attorney now working at Hastings & Hastings with her mom. And they're engaged.\r\n\r\nhttps://youtu.be/e1-04RRjt8s", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/e1-04RRjt8s?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1498675194.0, "source": "https://variety.com", "summary": ""}