{"url": "https://en.wikipedia.org/wiki/Ryan_Reynolds", "text": "This article is about the actor. For the football player, see Ryan Reynolds (American football)\n\nCanadian-American actor\n\nRyan Rodney Reynolds (born October 23, 1976) is a Canadian actor, comedian, film producer and entrepreneur. He began his career starring in the Canadian teen soap opera Hillside (1991–1993) and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), and starred in action films such as Blade: Trinity (2004), Deadpool (2016), and 6 Underground (2019).\n\nReynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards.\n\nReynolds was awarded a star on the Hollywood Walk of Fame in 2017. He was married to actress Scarlett Johansson from 2008 to 2011 and since 2012, has been married to actress Blake Lively, with whom he has three children.\n\nEarly life\n\nRyan Rodney Reynolds was born on October 23, 1976, in Vancouver, British Columbia,[1] the youngest of four sons[2] of food wholesaler James Chester Reynolds[3][4] and retail saleswoman Tamara Lee (née Stewart).[5][6][7] His paternal grandfather, Chester Reynolds, was a farmer and politician who represented Stettler in the Legislative Assembly of Alberta from 1940 to 1944.[8] He is of Irish descent and was raised as a Catholic in Vancouver's Kitsilano neighbourhood.[9][10] He graduated from Kitsilano Secondary School in 1994 and attended Kwantlen Polytechnic University, but dropped out.[11] Two of his brothers work in law enforcement in British Columbia,[12] with one being a Mountie.[13]\n\nCareer\n\n1991–2003\n\nReynolds' career began in 1991, when he starred as Billy Simpson in the Canadian-produced teen soap opera Hillside, distributed in the United States by Nickelodeon as Fifteen. Between 1993 and 1994, he had a recurring role in The Odyssey as Macro.[14] In 1996, he had a supporting role as Jay \"Boom\" DeBoom in \"Syzygy\", the thirteenth episode of the third season of The X-Files, and co-starred with Melissa Joan Hart in the TV movie Sabrina the Teenage Witch.[15] In 1996 Reynolds played Bobby Rupp, boyfriend of murdered teen Nancy Clutter, in a two-part miniseries In Cold Blood, an adaptation of Truman Capote's nonfiction novel of the same name. He also appeared in the anthology The Outer Limits episode \"Origin of the Species\" which originally aired on November 14, 1998. Beginning in 1998, Reynolds starred in Two Guys, A Girl and a Pizza Place, playing medical student Michael \"Berg\" Bergen, throughout the show's four season run. He starred in the National Lampoon movie Van Wilder in 2002 and appeared in The In-Laws, with Michael Douglas and Albert Brooks, and in the Canadian production Foolproof in 2003.[16]\n\n2004–2015\n\nAlthough he had performed primarily in comedies, Reynolds underwent intense physical training to play an action role as the character of Hannibal King in the 2004 film Blade: Trinity.[17] The same year, he made a cameo appearance in Harold & Kumar Go to White Castle as a nurse. Reynolds played George Lutz in the 2005 remake of the 1979 horror film The Amityville Horror.[18] Also, in 2005, he played a waiter named Monty in Waiting..., and appeared as music executive Chris Brander in the romantic comedy Just Friends alongside Amy Smart and Anna Faris. Additionally, he played an FBI agent alongside Ray Liotta in the 2006 crime action film Smokin' Aces.[19] Reynolds played the protagonist in the 2008 film Definitely, Maybe.[20] He also appeared in the second-season finale of the television series Scrubs. In 2007, Reynolds guest-starred as Brendan's friend Hams in the episode \"Douchebag in the City\" of the TBS sitcom My Boys.\n\nReynolds in April 2007\n\nReynolds portrayed Wade Wilson / Weapon XI in a supporting role in the prequel X-Men film, X-Men Origins: Wolverine, which was released in 2009.[21] He had previously spoken of his interest and involvement in a possible film adaptation of Deadpool with screenwriter David S. Goyer as far back as 2005.[22] 2009 also saw Reynolds portray Andrew Paxton, opposite Sandra Bullock, in The Proposal,[23] and Mike Connell in Adventureland.[24]\n\nIn 2010, Reynolds starred in the Spanish and American thriller Buried, which screened at the Sundance Film Festival.[25] In June 2010, Reynolds was invited to join the Academy of Motion Picture Arts and Sciences.[26] Reynolds portrayed the Hal Jordan version of superhero Green Lantern in Warner Bros.' film Green Lantern, which was released on June 17, 2011. The film did not fare well either financially or critically, but his role made him one of the few actors to headline films based on both Marvel and DC characters.[27] In 2011, he co-starred in the comedy The Change-Up, as well as narrating the documentary film The Whale. In 2012, he portrayed an agent in Safe House, alongside Denzel Washington.[28] He then had starring roles in two Dreamworks Animation feature films, The Croods and Turbo, both released in 2013. His next role was portraying Nick Walker in the Universal Pictures film adaptation of Dark Horse Comics' R.I.P.D. (Rest in Peace Department), which was released in 2013.[29] Reynolds went on to star in low-budget films, The Voices and The Captive in 2014, as well as Mississippi Grind the following year. This was followed by a supporting role in the financially successful biographical film, Woman in Gold, before he returned to the thriller genre with Self/Less, also in 2015.\n\n2016–present\n\nIn 2016, Reynolds found critical and commercial success with Deadpool, a film that had been in development as early as 2000. After portraying Wade Wilson / Weapon XI, without the name Deadpool, in X-Men Origins: Wolverine, he became heavily involved in the development of a Deadpool film. Deadpool featured a reboot of the character, ignoring the events of X-Men Origins: Wolverine, and establishing a new backstory for the character that was closer to the Marvel Comics source material. The film takes place within the larger X-Men film universe, being made possible by the reset timeline in X-Men: Days of Future Past.[30] Deadpool made several box-office records, including: a worldwide opening of $264.9 million from 62 markets, which is the biggest of 2016, the biggest for an R-rated film, and the second biggest for Fox, only behind Star Wars: Episode III – Revenge of the Sith ($303.9 million).[31][32] It also recorded the biggest IMAX 2D worldwide opening of all time with $27.4 million from 606 IMAX theatres, eclipsing The Dark Knight Rises ($23.8 million).[33][34] The film's financial and critical success led the studio to move forward with a sequel.\n\nAlso in 2016, Reynolds had a supporting role in the Ariel Vromen-directed thriller Criminal. On December 15, 2016, Reynolds received a star on the Hollywood Walk of Fame, at 6801 Hollywood Boulevard.[35][36] Reynolds co-starred with Jake Gyllenhaal and Rebecca Ferguson in the science fiction thriller Life in 2017, which reunited him with Safe House director Daniel Espinosa.[37]\n\nReynolds began filming Deadpool 2 in June 2017. The film opened on May 18, 2018.[38][39] In May 2019, he starred as the titular character in Pokémon Detective Pikachu, a live action film adaptation of the Detective Pikachu video game. Reynolds voiced, and was the facial motion capture actor for, the CGI detective Pikachu.[40]\n\nIn January 2018, Reynolds signed a three-year first-look deal with Fox, starting development on a live-action adaptation of the board game Clue, to be penned by Deadpool writers Rhett Reese and Paul Wernick.[41] Additionally, in April 2019, Reynolds will shoot Free Guy, an action comedy directed by Shawn Levy in which Reynolds will star as “a background character who realizes he's living in a video game. With the help of an avatar, he tries to prevent the makers of the game from shutting down his world.”[42][43] In 2020, he will return as the voice of Guy in the sequel to The Croods.[44]\n\nIn January 2019, Reynolds was named the face of Armani Code leading with a campaign for their Absolu scent.[45] On April 8, 2019, it was announced that Reynolds will be the host of ABC's game show, Don't which was expected to premiere soon thereafter.[46]\n\nIn 2018, it was announced that Reynolds was cast in the Netflix action thriller film 6 Underground, directed by Michael Bay.[47] The film was released on December 13, 2019.[48]\n\nReynolds will star alongside Dwayne Johnson and Gal Gadot in Netflix's upcoming thriller Red Notice, written and directed by Rawson Marshall Thurber.[49]\n\nIn the media\n\nIn October 2008, Reynolds wrote for The Huffington Post regarding his plan to run the New York City Marathon for his father who, at the time, suffered from Parkinson's disease.[50] Reynolds appeared in People's Sexiest Man Alive lists in 2007[51] and 2009,[52] and was awarded the top honour in 2010.[53]\n\nOn February 12, 2012, Reynolds appeared on the BBC's Top Gear as the Star in a Reasonably-Priced Car. He posted a time of 1:43.7.[54]\n\nOn May 13, 2018 broadcast of the South Korean reality television show King of Mask Singer, Reynolds had a special performance in the opening act, singing \"Tomorrow\".[55][56][57]\n\nBusiness ventures\n\nReynolds acquired a stake in Aviation American Gin in February 2018.[58] He stated that his interest went beyond that of an owner, and that he planned to oversee the product's creative direction as well as taking an active role in the business.[59] In November 2019, he purchased an ownership stake in Mint Mobile.[60]\n\nPersonal life\n\nReynolds began dating Canadian singer Alanis Morissette in 2002, and they announced their engagement in June 2004.[61] In February 2007, representatives for the couple announced they had mutually decided to end their engagement.[62] Morissette said her album Flavors of Entanglement was created out of her grief after the split, and the song \"Torch\" was written about Reynolds.[63]\n\nSoon after the end of his relationship with Morissette in 2007, Reynolds began dating American actress Scarlett Johansson.[64] The couple announced their engagement in May 2008,[65] and married on September 27, 2008, in a private ceremony near Tofino, British Columbia.[66] On December 14, 2010, they announced that they had separated.[67] Reynolds filed for divorce in Los Angeles on December 23, 2010,[68] and Johansson filed her response simultaneously.[69] The divorce was finalized on July 1, 2011.[70]\n\nReynolds first met Blake Lively in early 2010 while filming Green Lantern, in which they co-starred.[71] In October 2011, they began dating.[72] The couple married on September 9, 2012, at Boone Hall Plantation in Mount Pleasant, South Carolina.[73] They have three daughters together: James (December 2014),[74][75] Inez (September 2016),[76][77] and a third (2019).[78] The family lives in Pound Ridge, New York.[79]\n\nReynolds has openly spoken about his lifelong struggle with anxiety, noting in 2018 that he carried out many interviews in the character of Deadpool to alleviate his fears. He became an American citizen circa 2018.[80]\n\nFilmography and awards", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ryan_Reynolds_by_Gage_Skidmore.jpg/170px-Ryan_Reynolds_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Ryan_reynolds.jpg/170px-Ryan_reynolds.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg/220px-Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Green_Lantern_Comic-Con_%28cropped%29.jpg/220px-Green_Lantern_Comic-Con_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg/1200px-Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/24px-Flag_of_Canada.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg/1200px-Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ryan_Reynolds", "title": "Ryan Reynolds", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg/1200px-Deadpool_2_Japan_Premiere_Red_Carpet_Ryan_Reynolds_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}