{"url": "https://www.thedailybeast.com/spilling-tea-with-the-real-housewives-of-new-york-city-im-still-behaving-badly", "text": "On Sunday, The Real Housewives of New York City took Tribeca, celebrating ten years of laughter, drama and flying prosthetics at a Tribeca TV Festival panel. Before Andy Cohen took the reins, questioning various members of the cast, the packed room was treated to a montage of classic clips. Obviously, Aviva Drescher’s airborne leg elicited the loudest reaction. “Sonja, have you been able to get back into Le Cirque since Aviva threw the leg?” Cohen asked. “Luckily I’m very good friends with the owner,” Morgan replied, straight-faced, with Dorinda Medley joking, “I think it’s closed because of the leg-throwing.”\n\nThe lively conversation between EP’s Andy Cohen and Lisa Shannon and cast members Sonja Morgan, Dorinda Medley and Tinsley Mortimer charted the series’ evolution from a would-be show about moms trying to raise children in the big city. These days, the experts concluded, The Real Housewives of New York City is a comedy through and through—a “modern-day soap opera” with a decades’ worth of iconic quotes and GIF-able moments.\n\nWhen Medley first heard about the potential series from her friend Ramona Singer, she laughed, “I was like, that sounds so stupid! That sounds ridiculous, who’d watch it!…I was in such a mode of being Mrs. Medley that I kind of looked at my friends and thought, oh look at them doing that show there, I could never do that.”\n\nReflecting back on a decade of RHONY, Medley touched on a recurring panel theme—unexpected gratitude for reality TV infamy. “I was so used to people recognizing my husband and not me, and then all of a sudden…” Medley recalled, noting her transformation from political wife to TV star. “You realize that you have this platform, and this ability to affect people, and they really think they know you.” Also: “No more walking around in pajamas.”\n\nAsked how she’s changed over the seasons, Morgan quipped, “That’s the problem, I really haven’t changed, so I’m still behaving badly. I do walk my dog in my pajamas, I do make out with people on the street.”\n\n“The good thing, as Dorinda pointed out, we do get to support our charities in a big way now. It gave me back my independence after my divorce,” she continued, saying her Bravo gig has allowed her to provide “financial and emotional stability” for her daughter.\n\nMortimer has had her own unique arc, joining the cast in 2017 following a trespassing arrest in Palm Beach. “Honestly I had hit such a low point in my life, with a mug shot in Palm Beach,” Mortimer confessed. “I literally thought, I’m already so low that why not join a reality TV show?” Still, she remembered being initially taken aback when two of the cast members started fighting during a dinner scene. “I’m like, who screams at a dinner table? Flash forward to next season, I’m screaming at Sonja at the same dinner table!”\n\nLater on she revisited her pre-RHONY personal nadir, saying: “Look, the Palm Beach mugshot can do a lot for you. Look at the comeback with me and with Luann…A spokesman for the Palm Beach police department should be like, wanna turn your life around? Come chat with us.”\n\nThe cast also shared some of their favorite scenes and tag lines, with Sonja Morgan seamlessly transitioning into a “shameless plug” for her eponymous clothing and accessories line: “I do have a taste for luxury and luxury has a taste for me,” she insisted. “That was my first [tag line] and I think it’s come full circle with my collection.”\n\nOf course, even professional Housewives have moments they regret committing to camera. “I shouldn’t bring this up again,” Mortimer began, “But yes, when we were playing truth or dare and I talked about my ex-husband and something that we did…That was pretty embarrassing, I got a lot of heat from that.” Pressed by Cohen, Mortimer admitted that the heat definitely came from her ex—“And his new wife!” Meanwhile, Morgan rejoined, “The only regret I have is not being filmed.”\n\nTransitioning from real New Yorkers to reality TV New Yorkers has occasionally been surreal. While standing on the street the other day, Mortimer shared, she was recognized by a Real Housewives of New York tour bus. “So I got on the bus.” she casually announced. “It was so sweet!”\n\n“ New Yorkers love the show so much, they’re like fuck my brunch, this is amazing. ”\n\n“I think we ruined someone’s brunch in the Hamptons” Medley recalled, when asked if New Yorkers are ever less than pleased with the omnipresent production. “I feel like it’s a love-hate thing—they kind of love it too,” Morgan countered. “New Yorkers love the show so much, they’re like fuck my brunch, this is amazing.”\n\n“We’re on hot-dog stands!” She shouted. “We sell hot dogs!”\n\nCohen pointed out that, particularly in the New York iteration of the Real Housewives franchise, “There’s a unique fourth-wall element.” He continued, “Page Six and the New York Post has been a character…Season two opened with the women all, I think they were in the Hamptons, and I think Simon van Kampen had blabbed to Cindy Adams about something, or Jill Zarin had blabbed about Simon, it was something, and they were all opening the paper and reacting to it. And that was the first time as the Housewives franchise that we’ve had to deal with the outside press coming in. And of course, they’re partially getting press because they’re on this show.”\n\nIn addition to New Yorkers and tabloid reporters, the show’s fandom also boasts a number of A-listers. Cohen revealed that they’d connected Medley with multiple celebrity admirers. “I’m still in contact with Sarah Paulson!” Medley offered. She has also bonded with Lady Gaga, saying, “I actually just was in contact with her and her mother about two weeks ago, she was here. I’m trying to get Cynthia [Lady Gaga’s mother] on the show.”\n\nWhen asked to comment, Morgan was initially coy, refusing to name any stars she’d spoken with. But when another panelist mentioned the 30 Rock Sonja Morgan shout-out, she acquiesced: “Ok, I’ll out Tina Fey—I don’t sleep with her, but I was her favorite.”\n\nEMBED PIC\n\nWhile Morgan repeatedly plugged her collection during the panel, Cohen was uncharacteristically coy when asked by an audience member if Bravo benefits financially from the many RHONY side hustles. “Um, I actually don’t know that I can speak about that, they don’t love me speaking about contractual issues,” the Watch What Happens Live! host demurred. “I will say we all benefit richly from the show just through our hearts.”\n\nLisa Shannon attributed the show’s winning formula to the authenticity of its cast and their organic chemistry, remarking, “They do a really good job of being real. Off-camera, these women are these women.” Throughout the panel, these dynamics were front and center, with cast mates bickering, cutting each other off, and throwing out backhanded compliments—all from a place of seemingly genuine affection. At one point, Morgan mocked Mortimer for tacking herself on to a plan, laughing, “You know those Australian koala bears that clip on?” She continued, “That’s how Luann is too by the way, and I love it. I love to be needed.”\n\nOr as Cohen remarked, “People are always saying, is it real, is it real—we couldn’t make this stuff up.”\n\nAnd while audience members were warned that the panel couldn’t discuss upcoming plot points, the stars did answer a question about if they intended to settle down again any time soon. “I’m ready now,” Morgan insisted. “As soon as my daughter gets her early acceptance in December, the single men who are available should watch out. I’m coming for them.” Meanwhile, Medley responded, “I think I’m good right now. But I never say never.”\n\nAsked how they would feel about Jill Zarin potentially returning to the franchise, Cohen replied, “I always say The Housewives is like the mob, you can never get out of the family.”", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_646,w_1149,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1537751088/Screen_Shot_2018-09-23_at_8.14.21_PM_yje0xo", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_646,w_1149,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1537751088/Screen_Shot_2018-09-23_at_8.14.21_PM_yje0xo"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_646,w_1149,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1537751088/Screen_Shot_2018-09-23_at_8.14.21_PM_yje0xo", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/spilling-tea-with-the-real-housewives-of-new-york-city-im-still-behaving-badly", "title": "Spilling Tea With ‘The Real Housewives of New York City’: ‘I’m Still Behaving Badly’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Spilling Tea With ‘The Real Housewives of New York City’: ‘I’m Still Behaving Badly’", "keywords": "New York City, The Real Housewives of New York City, Reality television, Bethenny Frankel, Andy Cohen", "og": {"title": "Spilling Tea With ‘The Real Housewives of New York City’: ‘I’m Still Behaving Badly’", "description": "Several of the RHONY gathered with producers Andy Cohen and Lisa Shannon to discuss 10 years of reality-TV madness, regrets, secret celebrity admirers, and more.", "url": "https://www.thedailybeast.com/spilling-tea-with-the-real-housewives-of-new-york-city-im-still-behaving-badly", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_646,w_1149,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1537751088/Screen_Shot_2018-09-23_at_8.14.21_PM_yje0xo"}, "description": "Several of the RHONY gathered with producers Andy Cohen and Lisa Shannon to discuss 10 years of reality-TV madness, regrets, secret celebrity admirers, and more.", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2018-09-24T01:06:23.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_646,w_1149,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1537751088/Screen_Shot_2018-09-23_at_8.14.21_PM_yje0xo"}, "sailthru.date": "2018-09-24T01:06:23.000Z", "sailthru.expire_date": "2018-10-08T01:06:23.000Z", "publicationDate": 201809240106, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/spilling-tea-with-the-real-housewives-of-new-york-city-im-still-behaving-badly\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"BEHIND THE SCENES\"},\"post_id\":\"spilling-tea-with-the-real-housewives-of-new-york-city-im-still-behaving-badly\",\"pub_date\":\"2018-09-24T01:06:23+00:00\",\"section\":\"Entertainment\",\"tags\":[\"New York City\",\"The Real Housewives of New York City\",\"Reality television\",\"Bethenny Frankel\",\"Andy Cohen\",\"typeArticle\"],\"title\":\"Spilling Tea With ‘The Real Housewives of New York City’: ‘I’m Still Behaving Badly’\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/gxfQ6UjRzi4?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1537751183.0, "source": "https://www.thedailybeast.com", "summary": ""}