{"url": "https://web.archive.org/web/20110215051933/http://politics.blogs.foxnews.com:80/2011/02/11/romney-cpac-excerpts-its-all-about-jobs", "text": "by Jake Gibson | February 11, 2011\n\nFox News has obtained the prepared text of Mitt Romney's upcoming speech at the Conservative Political Action Conference.\n\nFrom what we see here, Romney's speech is all about the jobs, even referring to \"Obama's Misery Index.\"\n\nAlso of note is the \"Believe in America\" theme that Romney first sounded out in the introduction to the paperback version of his book \"No Apology: The Case For American Greatness.\"\n\nIn a bit of straw poll campaigning the \"Believe in America\" slogan is also on bumper stickers, lapel stickers and signs seen throughout the conference.\n\nRomney's wife Ann will introduce the former Massaschusetts governor.\n\nHere is the text of the speech:\n\nI've been in Ann's shadow ever since our first date in high school. Over our years together, she's waged some pretty impressive battles. Among her many accomplishments, none is more important or rewarding-to us and to our country-than her accomplishment as a successful mother of 5 and grandmother of 16.\n\nThank you, Ann.\n\nThe other night, from opposite coasts of the country, Ann and I watched President Obama's State of the Union address. Ann figured out pretty fast what was going on. She sent me an email saying that it sounded like he was reading my CPAC speech from last year.\n\nWhat we were hearing was not just a new and improved Barack Obama; it was an entirely different Barack Obama.\n\nSaul Alinsky was out; Jeffrey Immelt was in.\n\nThe President went from \"Change you can believe in\" to \"Can you believe this change?\"\n\nHe sounded like he was going to dig up the First Lady's organic garden to put in a Bob's Big Boy.\n\nBut as the speech went on, it was clear that this was just the appearance of change: His answer for Americans out of work was more government spending and $50 billion for high speed rail.\n\nHe replaced his Chicago politician chief of staff with a fresh face from Chicago, named Daley.\n\nMake no mistake: What we are watching is not Brave New World; what we're watching is Groundhog Day!\n\nTwo years ago, this new President faced an economic crisis and an increasingly uncertain world.\n\nAn uncertain world has been made more dangerous by the lack of clear direction from a weak President. The President who touted his personal experience as giving him special insight into foreign affairs was caught unprepared when Iranian citizens rose up against oppression. His proposed policy of engagement with Iran and North Korea won him the Nobel Peace Prize. How's that worked out? Iran armed Hezbollah and Hamas and is rushing toward nuclear weapons. North Korea fired missiles, tested nukes, sunk a South Korean ship and shelled a South Korean island. And his \"reset program\" with Russia? That consisted of our President abandoning our missile defense in Poland and signing a one-sided nuclear treaty. The cause of liberty cannot endure much more of his \"they get, we give\" diplomacy!\n\nThe world - and our valiant troops - watched in confusion as the President announced that he intended to win the war in Afghanistan....as long as it didn't go much beyond August of 2011. And while the Taliban may not have an air force or sophisticated drones, it's safe to say... they do have calendars.\n\nI surely hope that at some point in the near future, the President will finally be able to construct a foreign policy, any foreign policy.\n\nHere at home, the President's response to the economic crisis was the most expensive failed social experiment in modern history.\n\nHe guaranteed that unemployment wouldn't go beyond 8%. As he watched millions and millions of Americans lose their jobs, lose their homes and lose their hope, his response was this: It could be worse.\n\nIt could be worse? This is the leader of the Free World's answer to the greatest job loss since the Great Depression? What's next? Let them eat cake?\n\nOh, excuse me. Organic cake.\n\nIt's often said that the Presidency of the United States is the toughest job in the world. Fair enough. Undoubtedly true.\n\nBut how difficult is it to take office in the middle of a raging economic crisis and understand that the economy should be your number one priority?\n\nThe President who took office on January 20th, 2009 should have had one central mission - put Americans back to work! Fight for every job! Because every job is a paycheck and paychecks fuel Americans dreams.\n\nWithout a paycheck, you can't take care of your family. Without a paycheck you can't buy school books for your kids, keep a car on the road or help an aging parent make ends meet.\n\nPresident Barack Obama has stood watch over the greatest job loss in modern American history. And that, my friends, is one inconvenient truth that will haunt this President throughout history.\n\nToday there are more men and women out of work in America than there are people working in Canada. And in the month of January, Canada created more new jobs than we did.\n\nWhen Ronald Reagan ran for President, he hung the Misery Index around Jimmy Carter's neck. Today's misery is real unemployment, home foreclosures and bankruptcies. This is the Obama Misery Index-and it's at a record high. It's going to take more than new rhetoric to put Americans back to work-it's going to take a new president.\n\nLet me make this very clear. If I decide to run for President, it won't take me two years to wake up to the job crisis threatening America. And I won't be asking Tim Geithner how the economy works-or Larry Summers how to start a business.\n\nFifteen million Americans are out of work. And millions and millions more can't find the good paying jobs they long for and deserve. You've seen the heartbreaking photos and videos of the jobs fairs around the country, where thousands show up to stand in line all day just to have a chance to compete for a few job openings that probably aren't as good as the job they held two years ago. These job fairs and unemployment lines are President Obama's Hoovervilles.\n\nMake no mistake. This is a moral tragedy-a moral tragedy of epic proportion. Unemployment is not just a statistic. Fifteen million unemployed is not just a number. Unemployment means kids can't go to college; that marriages break up under the financial strain; that young people can't find work and start their lives; and men and women in their 50s, in the prime of their lives, fear they will never find a job again. Liberals should be ashamed that they and their policies have failed these good and decent Americans!\n\nThe President is trying to show that he finally gets it-that he really isn't a liberal after all. But his idea of conservative economic policy is to invite some corporate CEO's to the White House for an evening of table-talk.\n\nI'm sorry Mr. President, but that's not a policy, it's a dinner party.\n\nWe've seen the failure of liberal answers before. Liberal welfare policies condemned generations to dependency and poverty. Liberal education policies fail our children today, because they put pensions and privilege for union bosses above the reading scores of our kids. Liberal social policies have failed to protect the unborn. And now, the hollow promises of liberal economic policies have failed to provide millions of Americans with the dignity of work.\n\nUnder the pressure of a crisis, people turn to what they really believe. With our economy in crisis, the President and his fellow liberals turned to Europe for their answers. Like the Europeans, they grew the government, they racked up bigger deficits, they took over healthcare, they pushed cap and trade, they stalled production of our oil and gas and coal, they fought to impose unions on America's workers, and they created over a hundred new agencies and commissions and hundreds of thousands of pages of new regulations. Theirs is a European-style solution to an American problem. It does not work there and it will never work here!\n\nThe right answer is not to believe in European solutions. The right answer is to believe in America-to believe in free enterprise, capitalism, limited government, federalism-and to believe in the constitution, as it was written and intended by the founders.\n\nMy father never graduated from college. He apprenticed as a lath and plaster carpenter, and he was darn good at it. He learned how to put a handful of nails in his mouth and spit them out, point forward. On his honeymoon, he and Mom drove across the country. Dad sold aluminum paint along the way, to pay for gas and hotels.\n\nDad always believed in America; and in that America, a lath and plaster man could work his way up to running a little car company called American Motors and end up Governor of a state where he had once sold aluminum paint.\n\nFor my Dad, America was the land of opportunity, where free enterprise, small business and entrepreneurs were encouraged and respected. The spirit of enterprise propelled America's economy and our standard of living past every other nation on earth.\n\nI refuse to believe that America is just another place on the map with a flag. I believe that America is an exceptional nation, of freedom and opportunity and hope. The America I believe in has goodness and a greatness that creates a unique American genius. That genius has blessed the world, led the world and yes, even saved the world from unimaginable darkness.\n\nWe didn't originate the concept of liberty but our Founding Fathers redefined it and shared it with the world. From the brilliant sands of Omaha beach to the dark valleys of the Hindu Kush, we have fought with an unmatched courage and determination, not to conquer territory, but to give others the chance to experience the liberty that is humanity's destiny.\n\nGiven all that America has done to lift others from poverty, given the millions of afflicted we have helped to heal and comfort, and given the hundreds of thousands of lives of America's sons and daughters that have been, and are today, sacrificed to defend freedom, I will not apologize for America!\n\nI don't apologize for America because I believe in America!\n\nWe believe in freedom, in opportunity. We believe in free enterprise and capitalism. We believe in the American dream. And we believe that the principles that made America the leader of the world today are the very principles that will keep America the leader of the world tomorrow.\n\nThese last two years have not been the best of times. But while we've lost a couple of years, we have not lost our way.\n\nThis is fundamentally what conservatism is all about. We sing for God to bless America. He already has, he does now and thanks to the greatness of the American people and the principles that guide us, he will do so for generations to come.\n\nBelieve in America. Freedom depends on it.\n\nThank you.", "images": ["https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/img/icon-envelope.gif", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/foxnews-sunday-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/red-eye-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/hannity-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/oreilly-factor-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/americas-newsroom-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/geraldo-at-large-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/the-journal-editorial-report-slide.png", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_edge_patriotact_FNC_021411_22-02.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_han_panel_FNC_021411_21-53.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/happening-now-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/foxnews-watch-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/logo-foxnews.png", "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/img/icon-comment.png", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_al_trump_FNC_021411_15-04.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/glenn-beck-slide.png", "https://web.archive.org/web/20110215051933im_/http://a57.foxnews.com/politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/files/pictures/60/60/picture-14.1296586622.jpg", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/fox-and-friends-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/studio-b-slide.png", "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/img/icon-facebook.gif", "https://web.archive.org/web/20110215051933im_/http://a57.foxnews.com/politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/files/pictures/60/60/picture-13.1294232814.jpg", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_edge_defensecuts_FNC_021411_18-36.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/cost-of-freedom-slide.png", "https://web.archive.org/web/20110215051933im_/http://a57.foxnews.com/60/60/politics.blogs.foxnews.com", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/on-the-record.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/huckabee-slide.png", "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/files/blog-header.gif", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/global/logo-foxnews-1.gif", "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/favicon.ico", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/america-live-slide.png", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_cav_kucinich_FNC_021411_17-16.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/profile.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/fox-report-slide.png", "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/img/icon-twitter.gif", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_dotcom_congressbudget_FNC_021411_18-50.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_cav_simpson_FNC_021411_17-17.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/your-world-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/war-stories-slide.png", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/dotcom_bream_FNC_021411_13-42.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_al_immigrants_FNC_021411_15-07.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://video.foxnews.com/thumbnails/021411/640/360/021411_cav_walker_FNC_021411_17-16.jpg\n            ", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/special-report-slide.png", "https://web.archive.org/web/20110215051933im_/http://www.foxnews.com/static/all/img/head/americas-news-hq-slide.png"], "top_img": "https://web.archive.org/web/20110215051933im_/http://politics.blogs.foxnews.com/sites/politics.blogs.foxnews.com/themes/blogs_foxnews_com/favicon.ico", "keywords": [], "authors": ["Jake Gibson"], "canonical_link": "https://web.archive.org/web/20110215051933/http://politics.blogs.foxnews.com/2011/02/11/romney-cpac-excerpts-its-all-about-jobs", "title": "Romney CPAC Speech: It's All About the Jobs", "meta_data": {"dc.title": "Romney CPAC Speech: It's All About the Jobs", "description": "Fox News has obtained the prepared text of Mitt Romney's upcoming speech at the Conservative Political Action Conference.", "dc.description": "Fox News has obtained the prepared text of Mitt Romney's upcoming speech at the Conservative Political Action Conference.", "dcterms.abstract": "Fox News has obtained the prepared text of Mitt Romney's upcoming speech at the Conservative Political Action Conference.", "dc.language": "en-US", "dc.creator": "Jake Gibson", "dc.source": "Fox News", "dc.publisher": "Fox News", "dc.date": "2011-02-11", "dcterms.created": "2011-02-11T08:50:35-05:00", "dcterms.modified": "2011-02-11T14:45:02-05:00", "dc.format": "text/html", "dc.type": "Text.Article", "prism.genre": "blogEntry", "dc.identifier": "urn:uri:base64:YmxvZzU2MTc=", "keywords": "FOX News politics, FOX News politics blog, FOX News politics news, White House blog, Row 2 Seat 4 blog, The Speaker's Lobby blog, politics blog, White House, Washington DC, Days to Decide", "prism.aggregationType": "blog", "prism.channel": "fnc", "prism.section": "politics", "prism.subsection1": "blogs", "prism.subsection2": "politics"}, "movies": [], "publish_date": 1297353600.0, "source": "https://web.archive.org", "summary": ""}