{"url": "https://people.com/music/hailey-baldwin-old-tweets-justin-bieber-supported-selena-gomez/", "text": "Before Hailey Baldwin called herself Justin Bieber‘s fiancée, she was just another fan singing his praises on Twitter — and shipping his relationship with Selena Gomez.\n\nDigging into the 21-year-old model’s social media past, fans found that she used to tweet to and about Bieber, 24, often. She would congratulate the singer on his singles reaching the top of the charts, excitedly talk about going to his shows and retweet his musings on naps or cereal.\n\nGet push notifications with news, features and more.\n\nHowever, it was a post supporting “Jelena” that really caught the attention of fans. In a reply to a now-deleted tweet sent out in 2012, Baldwin appears to defend the pop star’s then-relationship with Gomez.\n\n“She is beyond flawless and he’s ya know he’s Bieber,” Baldwin wrote. “They are the perfect relationship.. -___- forever alone.”\n\nShe also reportedly wrote in a since-deleted tweet screengrabbed by Elle and other outlets, “I don’t care what anyone says but Justin Bieber and Selena Gomez together is the definition of a teenage dream.”\n\nBaldwin’s tweets also hint to the couple’s shared religious beliefs. She retweeted a Bible verse that Bieber shared in Dec. 2012 and also said it was “really cool of u to [publicly] thank God and Jesus in ur speech!” back in Aug. 2011.\n\nThere was also some room for flirting.\n\n“Can we just talk about your dark hair for a second…” Baldwin tweeted in Jan. 2012, adding the hashtag “#itlooksreallygood.”\n\nBaldwin most recently shared a tweet of Bieber’s in Sept. 2015, when the “Sorry” singer wrote, “Live love and laugh. Thanks.” Stephen Baldwin’s daughter shared the post with her own comment: “genuinely this is cheesy.”\n\nRELATED: Justin Bieber and Hailey Baldwin Are Engaged! He’s ‘Extremely Happy,’ Says Source\n\nThe “Love Yourself” singer officially announced that he plans to marry model Baldwin with a loving tribute to her on his Instagram Monday.\n\n“Was gonna wait a while to say anything but word travels fast, listen plain and simple Hailey I am soooo in love with everything about you!” Bieber wrote in the caption.\n\n“So committed to spending my life getting to know every single part of you loving you patiently and kindLY,” he continued. “I promise to lead our family with honor and integrity letting Jesus through his Holy Spirit guide us in everything we do and every decision we make.”\n\nThe model tweeted minutes after her fiancé’s post, writing, “Not sure what I did in life to deserve such happiness but I am so utterly grateful to God for giving me such an incredible person to share my life with! No words could ever express my gratitude.”\n\nImage zoom Hailey Baldwin and Justin Bieber Splash News\n\nRELATED: Inside Justin Bieber and Hailey Baldwin’s Engagement — ‘They Know Each Other Very Well’: Source\n\nIn the past few weeks since reigniting their romance, Bieber and Baldwin have been showing PDA all over the Big Apple. In early July, they were seen locking lips during a stroll through a local Brooklyn garden after grabbing lunch at DUMBO House, according to an onlooker. Bieber was also pictured giving Baldwin a sweet smooch on the forehead.\n\n“Right now, Justin is very happy with Hailey,” a source recently told PEOPLE. “He always had a lot of love for her.”\n\nRELATED: Is This Hailey Baldwin’s Engagement Ring? Model Shows Off Diamond Sparkler During Outing with Justin Bieber\n\nRELATED VIDEO: Justin Bieber and Hailey Baldwin Hit Washington State for Church and a Hot Tub Session\n\nBieber and Baldwin previously dated before, splitting in 2016.\n\nAfter calling it quits, “we went through a long period of time when we weren’t friends,” Baldwin recently told U.K. newspaper The Times.\n\nThat same year, Bieber told GQ that he didn’t want to “rush into anything” in case the pair ended up getting married someday.\n\n“What if Hailey ends up being the girl I’m gonna marry, right? If I rush into anything, if I damage her, then it’s always gonna be damaged. It’s really hard to fix wounds like that. It’s so hard … I just don’t want to hurt her,” he told the magazine.\n\nA source told PEOPLE that Bieber “knew a couple of weeks ago that he wanted to propose” to Baldwin. The source added, “He sees marriage as something very special. He would never propose if he wasn’t crazy about Hailey.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhailey-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fjustin-bieber2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhailey-2000.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/music/hailey-baldwin-old-tweets-justin-bieber-supported-selena-gomez/", "title": "Hailey Baldwin Has Been Tweeting at Justin Bieber for Years — and Was a Big 'Jelena' Supporter", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Couples,Hailey Baldwin,Justin Bieber,Music News,News,Selena Gomez", "news_keywords": "Couples,Hailey Baldwin,Justin Bieber,Music News,News,Selena Gomez", "description": "Before Hailey Baldwin called herself Justin Bieber's fiancée, she was just another fan singing his praises on Twitter — and shipping his relationship with Selena Gomez", "og": {"title": "Hailey Baldwin Has Been Tweeting at Justin Bieber for Years — and Was a Big 'Jelena' Supporter", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/hailey-baldwin-old-tweets-justin-bieber-supported-selena-gomez/", "description": "Before&nbsp;Hailey Baldwin&nbsp;called herself&nbsp;Justin Bieber‘s&nbsp;fiancée, she was just another fan singing his praises on Twitter&nbsp;— and shipping his relationship with Selena Gomez. Digging into the 21-year-old&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhailey-2000.jpg", "width": 1231, "height": 645}}, "pinterest": {"url": "https://people.com/music/hailey-baldwin-old-tweets-justin-bieber-supported-selena-gomez/", "description": "Before Hailey Baldwin called herself Justin Bieber's fiancée, she was just another fan singing his praises on Twitter — and shipping his relationship with Selena Gomez", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhailey-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/hailey-baldwin-old-tweets-justin-bieber-supported-selena-gomez/", "title": "Hailey Baldwin Has Been Tweeting at Justin Bieber for Years — and Was a Big 'Jelena' Supporter", "description": "Before Hailey Baldwin called herself Justin Bieber's fiancée, she was just another fan singing his praises on Twitter — and shipping his relationship with Selena Gomez", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhailey-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}