{"url": "www.thehollywoodgossip.com/2018/02/gwen-stefani-and-blake-shelton-pregnant-with-miracle-baby-after/", "text": "Reports claim that Blake Shelton is high on fame and might quit The Voice. But he's not showing any signs of quitting Gwen Stefani.\n\nAnd it seems that the feeling is mutual.\n\nIn fact, some fans can't help but wonder if Gwen will have Blake's child. And some believe that there's one already on its way.\n\nIt's reported that Stefani, now 48 years young, recently got pregnant with a \"miracle baby\" thanks to IVF treatments.\n\nGwen and Blake's whirlwind romance began on The Voice, as fans of the show and celebrity gossip are well aware.\n\nAfter Gwen split with now-ex-husband Gavin Rossdale, she confided in her fellow judges what was happening in her life.\n\nIn some ways, she wanted to give her NBC co-stars a heads up before reporters started asking them questions.\n\nIn others, she probably just needed to talk to some people, which is understandable considering what she was living through\n\nAllegedly, Gavin was cheating on Gwen with the nanny.\n\nStefani is believed to have accidentally this discovered thanks to a tablet device that was linked to other devices.\n\nThat must have been a very rude awakening.\n\nAccording to Gwen, it was after she shared her personal pain with her fellow judges that Blake Shelton confided in her as well.\n\nHe had just been through a similar ordeal in his personal life, having gone through a painful split from Miranda Lambert.\n\nAfter that, one thing led to another, and Gwen and Blake became inseparable - and have stayed that way for several years now.\n\nSeriously, who could've seen that coming?\n\nSince the inception of their relationship, given how intensely devoted they seem to be to each other, a lot of fans have been wondering:\n\nWill these two have a baby together?!\n\nWell, according to an article in OK, Gwen Stefani and Blake Shelton secretly got married \"a few days\" before Christmas in 2017.\n\nIn that same report is a claim that the mother of three has, after months of IVF treatments, conceived Blake Shelton's child.\n\nPer the article, those few in whom they've confided this news are thrilled for them and are over the moon that they're expecting.\n\nSome fans point to Gwen's recent look while (deliberately, above) sliding on a frozen pond as proof, since her outfit is decidedly puffy.\n\nLike, say, the sort of outfit that might hide a baby bump?\n\nCertainly, it's appeared for a while that Gwen and Blake are \"focused\" on getting pregnant, as there's not a moment to lose.\n\nAt their ages - Gwen, as we said earlier, is 48 and Blake is 41 - time is not necessarily on their side at this stage of their lives.\n\nAt one point, it seemed that Blake was trying to get Gwen pregnant, but it's not always clear when he's joking and when he's serious.\n\nSo ... is the pop superstar really, after months or even years of speculation, finally pregnant with the country crooner's baby?\n\nWell, for one thing, Gossip Cop says it's false. We don't know for sure, of course, but here are some reasons to doubt it.\n\nFor starters, nobody seems to be able to find any record of the two of them having tied the knot, before Christmas or at any other time.\n\nWhich casts doubt on the rest of the report.\n\nEven the image to which some fans point as confirmation of the report - the sight of Gwen wearing a puffy jacket - is hardly evidence.\n\nShe's a tiny little 5-foot-6 woman from California, and it's cold enough outside that even Blake Shelton can walk on the ice.\n\nOf course she's wearing a huge, puffy jacket. If she didn't, she'd freeze. This is winter. It's not a conspicuous fashion choice.\n\nNow, on the flip side, that does not by any means indicate that Blake and Gwen aren't trying to have a baby these days.\n\nSure, Blake might have been joking about hoping to knock up Gwen - or he might have been serious all along. Or both.\n\nAnd yes, Gwen is 48, but some women get pregnant and give birth at 50. It happens sometimes, more often than ever.\n\nEven though it's not necessarily something that doctors would recommend, she could very well be preganant again.\n\nBut let's not read too much into puffy outfits is all. Surely, Blake and Gwen will tell the world when they're ready.\n\nIf they're ever ready.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XL0lnSsL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1517923987/attachment/gwen-stefani-blake-shelton-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XL0lnSsL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1517923987/attachment/gwen-stefani-blake-shelton-split.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/02/gwen-stefani-and-blake-shelton-pregnant-with-miracle-baby-after/", "title": "Gwen Stefani & Blake Shelton: Pregnant with \"Miracle Baby\" After IVF Treatments?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/02/gwen-stefani-and-blake-shelton-pregnant-with-miracle-baby-after/", "title": "Gwen Stefani & Blake Shelton: Pregnant with \"Miracle Baby\" After IVF Treatments?", "description": "Gwen Stefani and Blake Shelton reportedly got married and are expecting a miracle baby following months of IVF treatments.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--D8J6md87--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1463161922/blake-shelton-and-gwen-stefani-get-ready-to-perform-on-the-voice.jpg", "type": "image/jpeg", "width": 568, "height": 1024}}, "article": {"published_time": "2018-02-06T09:20:45-05:00", "modified_time": "2018-02-08T11:53:20-05:00", "tag": "The Voice", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Gwen Stefani & Blake Shelton: Pregnant with \"Miracle Baby\" After IVF Treatments?", "description": "Gwen Stefani and Blake Shelton reportedly got married and are expecting a miracle baby following months of IVF treatments.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XL0lnSsL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1517923987/attachment/gwen-stefani-blake-shelton-split.png"}}, "description": "Gwen Stefani and Blake Shelton reportedly got married and are expecting a miracle baby following months of IVF treatments."}, "movies": [], "publish_date": 1517926845.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}