{"url": "https://www.washingtonpost.com/news/soloish/wp/2018/09/04/colton-underwood-is-the-new-bachelor-heres-why-some-viewers-arent-happy/", "text": "“It was his good looks, love for dogs and vulnerability that charmed not only Bachelorette Becca Kufrin, but all of Bachelor Nation,” ABC said in a news release. “After a summer of growth and a new perspective on what he is looking for, Colton is more than ready for this next chapter.”\n\nAD\n\nAlso, as Colton has discussed on the show multiple times, he is a virgin. For ABC, this is a big win. In 2013, Sean Lowe was nicknamed the “Virgin Bachelor” after the tabloids reported he was a “born again virgin,” although the show itself avoided the topic. So can you imagine how excited the producers are for a “Bachelor” star who will actually talk about it? (“That’s one thing that I took pride in on both seasons, is just being true to where I am,” Colton told Michael Strahan on “Good Morning America” Tuesday.) The potential story lines are endless.\n\nAD\n\nABC executive Robert Mills made the Sean comparison in a recent E! interview, saying that Colton “certainly has a lot of the attributes that you love in a Bachelor. There’s a little bit of that Sean Lowe . . . he’s also a guy who is surprisingly funny and charismatic. Colton could be a very interesting Bachelor.”\n\nUnfortunately, plenty of viewers feel otherwise. Last week, blogger Reality Steve leaked the news early. “I’m hearing that they will be announcing the next ‘Bachelor’ soon and it will be Colton,” he tweeted. “My thoughts are Sean Lowe has been their only successful Bachelor. They must feel Colton is the closest thing they’ll get to Sean. Character, morals, no shady past, etc. Sean 2.0. Here we go. Let the freaking out begin.”\n\nAD\n\nSure enough, the responses poured in, and they were almost uniformly negative. The most common reaction was that while Colton may be a nice guy, he’s extremely boring — a deadly ingredient in any reality show. Many clamored for a more charming, interesting and mature choice, such as his fellow runners-up Blake Horstmann, Jason Tartick or Wills Reid. Or even fan favorite Joe Amabile, known as Grocery Store Joe.\n\nOthers scoffed about how Colton bounced from “The Bachelorette” (where he appeared heartbroken when Becca broke up with him) to “Bachelor in Paradise” (where he had an emotional on-and-off relationship with Tia) to “The Bachelor” with remarkable speed. Raven Gates, Tia’s best friend and former “Bachelor” contestant, appeared on “Paradise” to warn her pal that Colton may not be there for the right reasons — and that perhaps he was only interested in dating “It Girls.” (Before “The Bachelor” franchise, Colton dated Olympic gymnast Aly Raisman.)\n\nSome felt that his casting cheapens the already questionable premise of the show. “Even if we’re being generous and calling Colton’s brief time with Becca and Tia ‘relationships,’ we’re still dealing with an anxious, 26-year-old virgin whose dating history does not indicate he’s ready to put a ring on it,” wrote Entertainment Weekly TV critic Kristen Baldwin, a longtime “Bachelor” recapper. “What about that says ‘perfect Bachelor material’ to anyone?”\n\nAD\n\nAD\n\nAmid the outrage, creator Mike Fleiss issued a vague tweet over the weekend: “You all know what the Bible says about passing judgment on others… It’s against it. #TheBachelor.”\n\n“1) the Bible has nothing to do with The Bachelor. 2) simply not wanting bachelor Colton isn’t a sin,” one fan tweeted in reply. “3) maybe you should actually listen to who the fans want for once, we’re the reason the show’s still running & without us you’re done.”\n\nOf course, the producers care about only one thing: drama. Colton has already had plenty of it. During “The Bachelorette” this summer, he told Becca that he and Tia had briefly dated a few months earlier. (He contacted her after seeing her on “The Bachelor.”) This was awkward for Becca, given that Tia was one of her closest friends when they competed on Arie Luyendyk Jr.’s season of “The Bachelor.” Later, Tia made a guest appearance to confess to Becca that she still had feelings for Colton.\n\nAD\n\nAD\n\nThat, combined with Colton’s virgin revelation (although Becca was more concerned with the fact that he had only been in one serious relationship), basically sealed his fate. Even though Colton told Becca he was falling in love with her, she sent him home after he made the final four. A couple of weeks later, Colton had a heated confrontation on the “Men Tell All” episode when another contestant mocked his virginity.\n\nThen, on “Bachelor in Paradise” last month, Colton and Tia both joined as cast members and hooked up again; their coupling was a big story line. Alas, on Monday, Colton took Tia aside and confessed that he really wanted things to work, but his feelings just weren’t there.\n\n“You deserve somebody who’s going to be crazy about you every single day,” Colton said.\n\nAD\n\n“But can you honestly say that you, like, tried?” Tia asked tearfully.\n\nAD\n\n“I could look at you with 100 percent certainty and say that I tried here. I gave it my all,” Colton responded gravely. Tia broke down in sobs.\n\nImmediately, viewers started speculating about the authenticity of Colton and Tia’s breakup, as it was conveniently timed to be just before the “Bachelor” announcement the next morning.\n\nThey came to Colton and said: Your puppy-loving charity-running, Twitter-posting self has met the minimum qualifications to be the Bachelor. Dramatically break things off with Tia, but cry REALLY hard so we can use it as the intro to the next season. #BachelorInParadise pic.twitter.com/HAWwd8PTzh — Emily Ann⚘ (@IamEmily_Ann) September 4, 2018\n\n“I know Colton is a great guy.\" The #BachelorInParadise editors are even making brokenhearted Tia endorse Colton for Bachelor. — Emma Gray (@emmaladyrose) September 4, 2018\n\nColton last week when he didn't know if he booked the bachelor gig: I'm ready to date tia.\n\nColton this week when he found out he booked the bachelor gig: nvm #BachelorInParadise — Bachelor Fanatic (@bachfanatic93) September 4, 2018\n\nThe Tia/Colton storyline — the early Bachelorette group date awkwardness, Tia's post-hometowns revelation, the silly #BachelorInParadise back-and-forth, tonight's breakup and apparently beyond — may go down as the most embarrassing, contrived, and misguided in the show's history. — Rosecast Pod (@RosecastES) September 4, 2018\n\nHowever, with his new “Bachelor” gig official, Colton insisted that his former “Bachelor” relationships are in the past.\n\n“Obviously you can tell how it was all so emotional for me,” Colton told People magazine. “But it was also good for me. I can’t say enough good things about Becca and enough good things about Tia. They’ve helped me grow and discover who I am and what I’m looking for in a wife.”\n\nAD\n\nRead more:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/VUwZk8VtHP9aE2d_HONLNvK6kIs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MTGI3X4LQU3O7J2KH4EV4HVZBY.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MTGI3X4LQU3O7J2KH4EV4HVZBY.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/VUwZk8VtHP9aE2d_HONLNvK6kIs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MTGI3X4LQU3O7J2KH4EV4HVZBY.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/soloish/wp/2018/09/04/colton-underwood-is-the-new-bachelor-heres-why-some-viewers-arent-happy/", "title": "Colton Underwood is the new ‘Bachelor.’ Here’s why some viewers aren’t happy.", "meta_data": {"description": "Colton, the former football player whose main story line is that he’s a 26-year-old virgin, wasn’t the first choice for many fans.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/soloish/wp/2018/09/04/colton-underwood-is-the-new-bachelor-heres-why-some-viewers-arent-happy/", "image": "https://www.washingtonpost.com/resizer/VUwZk8VtHP9aE2d_HONLNvK6kIs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MTGI3X4LQU3O7J2KH4EV4HVZBY.jpg", "title": "Colton Underwood is the new ‘Bachelor.’ Here’s why some viewers aren’t happy.", "description": "Colton, the former football player whose main story line is that he’s a 26-year-old virgin, wasn’t the first choice for many fans."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Colton Underwood is the new ‘Bachelor.’ Here’s why some viewers aren’t happy.", "description": "Colton, the former football player whose main story line is that he’s a 26-year-old virgin, wasn’t the first choice for many fans."}, "last_updated_date": "2019-03-31T17:12:57.667Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1535990400.0, "source": "https://www.washingtonpost.com", "summary": ""}