{"url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "text": "When Douglas met with Moonves at his office, she began to raise concerns about the “Queens” script, but Moonves, she recalled, cut her off. “He interrupts me to ask me am I single,” she said. Douglas, whose nearly decade-long relationship with Scorsese was coming to an end, was caught off guard. “I didn’t know what to say at that point,” she told me. “I was, like, ‘I’m single, yes, no, maybe.’ ” She began talking about the script, but Moonves interjected, asking to kiss her. According to Douglas, he said that they didn’t have to tell her manager: “It’ll just be between you and me. Come on, you’re not some nubile virgin.”\n\nAs Douglas attempted to turn the focus back to work, Moonves, she said, grabbed her. “In a millisecond, he’s got one arm over me, pinning me,” she said. Moonves was “violently kissing” her, holding her down on the couch with her arms above her head. “What it feels like to have someone hold you down—you can’t breathe, you can’t move,” she said. “The physicality of it was horrendous.” She recalled lying limp and unresponsive beneath him. “You sort of black out,” she told me. “You think, How long is this going to go on? I was just looking at this nice picture of his family and his kids. I couldn’t get him off me.” She said it was only when Moonves, aroused, pulled up her skirt and began to thrust against her that her fear overcame her paralysis. She told herself that she had to do something to stop him. “At that point, you’re a trapped animal,” she told me. “Your life is flashing before your eyes.” Moonves, in what Douglas assumed was an effort to be seductive, paused and asked, “So, what do you think?” Douglas told me, “My decision was to get out of it by joking my way out, so he feels flattered.” Thinking that reminding Moonves that he was her boss might discourage him, she told him, “Yes, for the head of a network you’re some good kisser.” Moonves frowned and got up. She scrambled to find her briefcase. “Well, this has been great. Thanks,” she recalled saying, moving toward the door. “I’ve got to go now.”\n\nMoonves, she said, followed her to the door and blocked her path. He backed her up to the wall, pressing against her, with his face close to hers. “It was physically scary,” Douglas told me. “He says, ‘We’re going to keep this between you and me, right?’ ” Attempting to put him off with a joke, she replied, “No, sir, we won’t tell anyone that you’re a good kisser.” Moonves released her and, without looking at her, walked away. “It was so invasive,” she said of the threatening encounter. “It has stayed with me the rest of my life, that terror.”\n\nOutside Moonves’s office, she began to cry. “My skirt is all twisted,” she recalled. “I’m standing in the hall and I thought of his family.” Moonves’s assistant, sitting nearby, asked whether her parking needed to be validated. Douglas told me, “I remember thinking, Does she know? Does this happen all the time?”\n\nIn her car, Douglas said, “I lost it. I felt sick.” Prophet, her manager, called and, as Douglas worked up the nerve to tell her what had happened, Prophet said that she had just got off the phone with Moonves. He’d said that he and Douglas had a great meeting and “had a lot of fun.” Douglas told me, “I thought, Oh, my God, he’s covered his tracks.” In that moment, she said, “I decided, just bury it.” Later that day, Douglas returned to the house she was renting and told a friend who was staying with her, the actor Craig Chester, about the incident. “She was trying not to cry, but her voice was shaking. I’ve never seen her that emotional before,” Chester recalled. “She said that he got on top of her and held her down and she couldn’t get away. If it was any other situation outside business, I would have said, ‘Let’s go to the cops.’ ” But, Chester said, “there was no talk about going to the police or anything like that, because it was obvious that it would be career suicide.”\n\nThe following week, Moonves showed up at the first day of rehearsals for “Queens.” “As soon as I saw him, I thought I was going to collapse. Everything came back to me. I was shaking,” Douglas told me. She felt that Moonves’s demeanor was intended to intimidate her. “He was eying me warily,” she said. Her distress was evident to her co-stars. “There was obviously something going on with her emotionally,” Penelope Ann Miller told me. “When she came in to test, everything was on. And then, after, on set, it was like she wasn’t there.” Last year, before the rise of #MeToo, Douglas told Miller what had happened. “Hearing her story, it all made sense,” Miller recalled.\n\nAfter the second rehearsal, Moonves took Douglas aside. “ ‘What the fuck do you think you’re doing out there? You’re not even trying,’ ” Douglas recalled Moonves saying. She took it as a reference to her failure to comply with his advances and to maintain her composure afterward. Douglas told me that she had “played by all the rules, I didn’t say anything, and now he was berating me.” On set, she struggled to keep her comedic timing, and cried in front of other cast members.\n\nSeveral days into rehearsals, Moonves called Douglas at home. “It was, you know, ‘You make me fucking sick. You are not funny,’ ” she recalled. Moonves told her that she wouldn’t “get a fucking dime” of the money she was owed, and that she would “never work at this network again.” (In a statement, CBS said that Moonves acknowledges trying to kiss Douglas, but that “he denies any characterization of ‘sexual assault,’ intimidation, or retaliatory action,” including berating her on set and personally firing her from “Queens.”)\n\nProphet told me that Moonves and CBS Business Affairs called her to say that Douglas would be replaced on the show and that her deal would be cancelled. According to Douglas, Prophet called her and “said I’d burned all my bridges at CBS, that she was firing me.” (Prophet recalled firing Douglas and said that the two had a heated exchange. She said that she didn’t know about Douglas’s allegation, and denied the comment about burning bridges. “There are no bridges at CBS,” she said. “There is just Les Moonves.”) Douglas said that her agent, Patrick Whitesell, who was then at Creative Artists Agency, later called to say that the agency wished her well in future endeavors of her own. “I love the way C.A.A. fired me,” Douglas said. “They never told me I was fired. They just kept wishing me the best of luck.” (Whitesell told me that he had not been aware of Douglas’s allegation and did not recall that her departure from C.A.A. was related to the dissolution of her CBS deal.)\n\nDistraught, Douglas called Scorsese and told him the story, saying that she wanted to hire a lawyer and sue Moonves. Scorsese said that he remembers Douglas calling him about the allegation and being shocked by it. Scorsese urged her to be cautious about taking legal action against such a powerful person, but agreed to refer her to his law firm; there, Douglas began working with an attorney named Bill Sobel. Sobel confirmed that Douglas had described the encounter with Moonves at the time, and his contemporaneous notes back up her account. “I believed Illeana,” he told me. “What happened to her was reprehensible.”", "images": ["https://media.newyorker.com/cartoons/5b5b7c3487b14c6938366779/master/w_1600%2Cc_limit/180806_a20641.jpg", "https://media.newyorker.com/photos/5ad6062051fedf7258aa438c/1:1/w_270%2Cc_limit/ronan_farrow-RD-2.png", "https://media.newyorker.com/photos/590979628b51cf59fc423803/4:3/w_480%2Cc_limit/%2525E2%252580%25258BTalbot-FoxNewsAndTheRepercussionsOfSexualHarassment.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-inverted.d6d734ff8f8bfb8aabb99b8ff088aca25375f9b7.svg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/cartoons/5b5b7c3492497e4fd0017bb4/master/w_1600%2Cc_limit/180806_a21101_rd.jpg", "https://media.newyorker.com/cartoons/5b5b7c343e47e60bb379a34d/master/w_1600%2Cc_limit/180806_a22032.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header-reverse.a63f1dbd399c4862508510ca28192280db6e8a46.svg", "https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_thescene.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1532962438/thenewyorker_how-a-notorious-d-e-a-informant-busted-criminals.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/4:3/w_480%2Cc_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c693836677a/master/w_1600%2Cc_limit/180806_a21846.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/master/w_2560%2Cc_limit/180806_r32520_rd.jpg"], "top_img": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "keywords": [], "authors": ["Ronan Farrow", "Ronan Farro", "Doreen St. Féli", "Margaret Talbo"], "canonical_link": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Ronan Farrow", "copyright": "Copyright (c) Condé Nast 2020", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "id": "5b58962892497e4fd001741c", "keywords": "a reporter at large,cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "news_keywords": "a reporter at large,cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b58962892497e4fd001741c", "parsely-metadata": "{\"description\":\"Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.\",\"image-16-9\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1000,c_limit/180806_r32520_rd.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/1:1/w_1000,c_limit/180806_r32520_rd.jpg\"}", "og": {"description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "site_name": "The New Yorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "type": "article", "url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "domain": "https://www.newyorker.com", "image": {"src": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg?mbid=social_retweet"}, "site": "@NewYorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": 1533484800.0, "source": "https://www.newyorker.com", "summary": ""}