{"url": "https://www.inquisitr.com/5204583/kelly-ripa-teen-daughter-lola-consuelos-kill-it-on-the-red-carpet-in-rare-joint-appearance/", "text": "Kelly Ripa and her daughter, Lola Consuelos, killed it on the red carpet during a rare joint appearance at a high-profile event in the Big Apple. The mom-and-daughter duo attended the 12th Annual CNN “Heroes: All-Star Tribute” event on Sunday night in New York City — and they stunned as they posed on the red carpet with family friend Anderson Cooper.\n\nRipa was photographed wearing a sparkling tea-length black dress, while her 17-year-old daughter rocked a long-sleeved green velvet minidress as she posed alongside her famous mom. The appearance marked a rare red carpet outing for the Live with Kelly and Ryan star and her teen daughter. Kelly Ripa’s husband, Mark Consuelos, was also in attendance at the gala, AOL Entertainment reports.\n\nLola Grace Consuelos is the only daughter to Kelly and Mark. The TV stars also share sons Joaquin, 15, and Michael, 21.\n\nThe 2018 CNN “Heroes” event was the first joint red carpet appearance for Kelly Ripa and her daughter Lola this year. In 2017, Lola accompanied her mom to CNN’s “Heroes: All-Star Tribute” event wearing a bubblegum pink sweater dress. Lola also attended the Hollywood premiere of Nine Lives with her dad last year, according to People.\n\nWhile she looked stunning in the new pics with her mom, at age 17, Lola Consuelos is reportedly very picky about the photos her parents share on social media. Kelly Ripa has revealed that her daughter will melt down if Ripa posts a photo without running it by Lola first.\n\nDuring an appearance on The Tonight Show last fall, Kelly Ripa told host Jimmy Fallon that Lola was upset over a throwback Halloween photo her mom had posted.\n\n“It’s so bizarre,” Ripa said, per E! News. “I’m never allowed to post a photo of her—ever.”\n\nRipa revealed that she never dreamed the sweet #TBT photo she posted would cause such a commotion with her daughter.\n\n“I was like, ‘You know what? She can’t get mad at an eight-year-old photo. It’s a Halloween throwback Thursday.’ I’m in the elevator coming up here and the phone rings and it says ‘Lola.’ I was debating [answering]. …She’s like, ‘You take it down right now! My friends follow you for some reason and they will see this!'”\n\nLola Consuelos has literally grown up in front of the Live audience’s eyes. In 2000, Kelly Ripa revealed she was pregnant with Lola while auditioning to be Regis Philbin’s co-host on the long-running morning show. Psychic Char Margolis correctly predicted that Ripa was pregnant, prompting the stunned TV star to say, “I haven’t even told my boss yet!” Lola Grace Consuelos was born in June of 2001.\n\nLola Consuelos has made several cameos on Kelly Ripa’s daytime chatfest, but it is rare that fans of the famous family get to see her dressed up alongside her mom for the red carpet.", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/8881934fec783f32aef96d94ac2f65be?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/12/Kelly-Ripa-Lola-Consuelos.jpg"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Victoria Miller"], "canonical_link": "https://www.inquisitr.com/5204583/kelly-ripa-teen-daughter-lola-consuelos-kill-it-on-the-red-carpet-in-rare-joint-appearance/", "title": "Kelly Ripa & Teen Daughter Lola Consuelos Kill It On The Red Carpet In Rare Joint Appearance", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}