{"url": "https://www.thesun.co.uk/tvandshowbiz/5062628/kendall-jenner-love-advent-calendar-rocky/", "text": "KENDALL Jenner proved just why boxing is the exercise of choice for models as she showed off her sensational body while packing a mean punch.\n\nThe catwalk star, who has been named the world's highest earning model, stripped to matching sweatpants and a crop top as she took on the role of iconic fighter Rocky Balboa in the latest LOVE Magazine advent calendar.\n\n6 Kendall Jenner worked up a sweat in the latest set of images for LOVE Magazine's Advent Calendar Credit: Phil Poynter / LOVE ADVENT\n\nKeeping Up With The Kardashians favourite Kendall threw her all into the action-packed shoot which saw her skip on the spot and shadow box in a studio.\n\nWearing bright white wraps on her hands and her hair scraped back into a ponytail, she sweats it out in a series of routines before leaping into the air as she gave her best left hook.\n\nLater on, the beauty looked beaten as she crashed onto the ring face-first, before rolling over and giggling about her antics to a mate.\n\nHer final shot saw her strike a sultry pose while holding a jump rope.\n\nInside the The Kardashians' property empire and who owns what\n\n6 Kendall, 22, gave her best left hook Credit: Phil Poynter / LOVE ADVENT\n\n6 She crashed face-first into the ring Credit: Phil Poynter / LOVE ADVENT\n\n6 The catwalk star channelled both Rocky Balboa and his wife Adrian in their action-packed shoot Credit: Phil Poynter / LOVE ADVENT\n\n6 Ever the fashionista, Kendall accessorised with a matching sports headband Credit: Phil Poynter / LOVE ADVENT\n\nMeanwhile the stylish model made sure to look her best.\n\nShe accessorised with a grey Adidas sweatband while her waist-skimming top gave an eyeful of her honed abs.\n\nProving a perfect colour match, the brunette's capri-cut joggers clung to her muscular thighs.\n\nThe fourth shoot of LOVE's seasonal offering was inspired by the 2016 Basic Instinct LOVE Advent 2016 and saw Kendall play both Rocky and his girlfriend, Adrian.\n\nmost read in TV & SHOWBIZ GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent 'SICKENING' This Morning calls police as domestic abuse victim phones in and begs for help\n\nKendall was said to have collaborated with producer Katie Grand on-set as well as her personal boxing trainer Rob Piela, from Gotham Gym.\n\nShe downed raw eggs before her gritty images to get a quick protein fix and said of her poses: \"When you get asked to shoot the advent calendar, it’s highly flattering.\n\n\"It’s a chance to have fun and embrace a strong self and always a good time.\"\n\nKendall was picked by Love Magazine for this year’s calendar which also features Gigi and Bella Hadid, Jourdan Dunn, Karlie Kloss and many other famous names.\n\n6 Meanwhile her model pal Emily Ratajkowski writhed around in spaghetti for the annual photo showcase Credit: Love Magazine\n\nKendall Jenner becomes Rocky Balboa AND his wife Adrian for Day 4 of the Love Advent 2017\n\nLove Magazine are using #StayStrong to plug the advent calendar this year and its editor Katie Grand said of the shoot: “It’s festive, it’s fun and it’s everything we love about women enjoying being women, on their own terms.”\n\nYet the American's workout shoot was a stark contrast to fellow model Emily Ratajkowski, who sexed up an earlier photoshoot with scenes which saw her roll around in spaghetti in her lingerie.\n\nMeanwhile, Kendall's BFF Bella Hadid, 21, stripped to racy red lingerie to launch the sizzling set of images on December 1.\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220.\n\nWe pay for videos too. Click here to upload yours.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.8 1\"%3E%3C/svg%3E", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2017/12/rb-composite-kendall-love.jpg?strip=all&quality=100&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/12/rb-composite-kendall-love.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Beth Allcock"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5062628/kendall-jenner-love-advent-calendar-rocky/", "title": "Kendall Jenner sweats in a crop top as she recreates Rocky for the Love Advent Calendar", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Kendall Jenner sweats in a crop top as she recreates Rocky for the Love Advent Calendar", "url": "https://www.thesun.co.uk/tvandshowbiz/5062628/kendall-jenner-love-advent-calendar-rocky/", "description": "KENDALL Jenner proved just why boxing is the exercise of choice for models as she showed off her sensational body while packing a mean punch. The catwalk star, who has been named the world’s …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/12/rb-composite-kendall-love.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-12-04T12:37:46+00:00", "modified_time": "2017-12-06T11:20:58+00:00", "publisher": 161385360554578, "tag": "Kendall Jenner, Keeping Up with the Kardashians, Victoria's Secret", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "KENDALL Jenner proved just why boxing is the fitness form of choice for models as she showed off her sensational body while packing a mean punch.", "keywords": "kendall jenner, keeping up with the kardashians, love advent", "news_keywords": "kendall jenner, keeping up with the kardashians, love advent", "twitter": {"text": {"title": "Kendall Jenner sweats in a crop top as she recreates Rocky for the Love Advent Calendar"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "boxing babe", "headline": "Kendall Jenner sweats in a crop top recreating Rocky for Love Advent Calendar", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/12/rb-composite-kendall-love.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/12/rb-composite-kendall-love.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5062628, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1512391066.0, "source": "https://www.thesun.co.uk", "summary": ""}