{"url": "www.inquisitr.com/4826781/jennifer-aniston-and-katy-perry-not-fighting-over-orlando-bloom-according-to-gossip-cop/", "text": "Since news broke that Jennifer Aniston and Justin Theroux had separated back in February, there have been new rumors circulating nearly every day regarding the actress’ love life. Many media outlets have speculated that the former Friends star might be getting back together with her ex, Brad Pitt, since he too is single after splitting from Angelina Jolie. In fact, there have been so many rumors about Aniston’s love life that it should come as no surprise that a new rumor has begun circulating which has the actress in a “fight” over Katy Perry’s on-again/off-again beau, Orlando Bloom.\n\nIn what is said to be an exclusive from RadarOnline, the media outlet shared that a source who is apparently friends with Jennifer Aniston has revealed that at the top of the actress’ list of apparent crushes is Bloom, and she is also “very open about wanting to hit the dating scene.” The site also claims that even though it seems as if Katy Perry and Orlando Bloom are back together again, that is not necessarily going to stop Aniston, after the apparent connection they established with each other “years ago.”\n\nHowever, while RadarOnline might be reporting that if Jennifer Aniston were to go after Bloom, she may have a fight on her hands from Perry, according to Gossip Cop, this is actually false. Instead, the outlet which is known for debunking many Hollywood rumors indicated that Aniston has no intention of going after Orlando Bloom.\n\nJennifer Aniston, Katy Perry NOT In “Fight” Over Orlando Bloom, Despite Claim,https://t.co/XbuaHo1KXm — Jose Reyes (@NYY001) March 15, 2018\n\nGossip Cop shared that a rep for the actress told them that the claims being put forth by RadarOnline are nothing more than “nonsense.” This is not the first time that the latter site has linked Jennifer Aniston romantically to someone, only for that apparent connection to be proven false.\n\nOn top of the fact that the alleged fight over Orlando Bloom between Aniston and Katy Perry is false, the other claim that the outlet made was that the Friends actress was looking to get back into the dating scene. However, recent reports from People Magazine refute that bit of information as well. According to the magazine, not only is Jennifer Aniston not a big fan of dating, she is actually not “looking forward” to being back in the dating scene as a single woman.\n\nAlso, where can we get one? https://t.co/tBORl39Yv2 — Glamour (@glamourmag) March 10, 2018\n\nWhile it is likely that Aniston will eventually be linked to someone new for real in the future, at least this time around it seems that the reports are false and there is no brewing fight over Orlando Bloom. For now, fans of Jennifer Aniston will have to wait and watch to see who she may end up with next, as she instead focuses her time on her friends and work.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/03/Jennifer-Aniston-not-fighting-over-Orlando-Bloom-with-Katy-Perry.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/4a918df6a9bd9504e87608b20d87cb49?s=250&d=mm&r=g"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Kimberley Spinney"], "canonical_link": "https://www.inquisitr.com/4826781/jennifer-aniston-and-katy-perry-not-fighting-over-orlando-bloom-according-to-gossip-cop/", "title": "Jennifer Aniston And Katy Perry Not Fighting Over Orlando Bloom, According To ‘Gossip Cop’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}