{"url": "https://en.wikipedia.org/wiki/The_Voice_(U.S._season_12)", "text": "The twelfth season of the American reality talent show The Voice premiered on February 27, 2017 on NBC with Gwen Stefani returning as coach after two-season absence alongside Alicia Keys, Adam Levine and Blake Shelton.[1]\n\nChris Blue was announced the winner on May 23, 2017, marking Alicia Keys' first win as a coach and the second female coach to win in the show's history, following Christina Aguilera.[2]\n\nCoaches and hosts [ edit ]\n\nThere was a change in the coaching panel for the twelfth season. Gwen Stefani returned to the panel after a two-season hiatus, replacing Miley Cyrus along with returning coaches Adam Levine, Blake Shelton, and Alicia Keys while Carson Daly returned for his 12th season as host.[3]\n\nThis season's Battle advisors were: John Legend for Team Adam; Celine Dion for Team Gwen; DJ Khaled for Team Alicia; Luke Bryan for Team Blake.[4]\n\nTeams [ edit ]\n\nColor key\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth place\n\nFourth place Eliminated in the Live Shows Eliminated in Live Playoffs\n\nEliminated in Live Playoffs Stolen in the Knockout rounds\n\nStolen in the Knockout rounds Eliminated in the Knockout rounds\n\nEliminated in the Knockout rounds Stolen in the Battle rounds\n\nStolen in the Battle rounds Eliminated in the Battle rounds\n\nCoaches Top 48 artists Adam Levine Jesse Larson Mark Isaiah Lilli Passero Hanna Eyre Johnny Hayes Josh West Malik Davage Davina Leone Autumn Turner Taylor Alexander Sheena Brook Kawan DeBose Julien Martinez Nala Price Gaby Borromeo Gwen Stefani Brennley Brown Hunter Plake Troy Ramey Johnny Gates JChosen Quizz Swanigan Stephanie Rice Aaliyah Rose Brandon Royal Davina Leone Caroline Sky Jozy Bernadette Savannah Leighton Sammie Zonana Kenny P. Alicia Keys Chris Blue Vanessa Ferguson Stephanie Rice Jack Cassidy Ashley Levin Anatalia Villaranda Lilli Passero Quizz Swanigan Dawson Coyle Hunter Plake Autumn Turner Felicia Temple Lauryn Judd RJ Collins Missy Robertson Blake Shelton Lauren Duski Aliyah Moulden TSoul Casi Joy Aaliyah Rose Felicia Temple Caroline Sky Andrea Thomas Enid Ortiz Dawson Coyle Ashley Levin Brennley Brown Valerie Ponzio Josh Hoyer Micah Tryba Note: Italicized names are stolen artists (names struck through within former teams). Bolded names are artists who received the Coach Comeback and advanced to the Live Playoffs.\n\nBlind auditions [ edit ]\n\nColor key\n\n✔ Coach pressed \"I WANT YOU\" button Artist defaulted to this coach's team Artist elected to join this coach's team Artist eliminated with no coach pressing \"I WANT YOU\" button\n\nEpisode 1 (Feb. 27) [ edit ]\n\nThe coaches performed \"Waterfalls\" at the start of the show.[5]\n\nEpisode 2 (Feb. 28) [ edit ]\n\nEpisode 3 (March 2) [ edit ]\n\nEpisode 4 (March 6) [ edit ]\n\nEpisode 5 (March 7) [ edit ]\n\nEpisode 6 (March 13) [ edit ]\n\nEpisode 7 (March 14) [ edit ]\n\nEpisode 8 (March 15) [ edit ]\n\nThis episode covered \"The Best of the Blind Auditions\", which included a recap and a sneak peek for the battles.\n\nThe Battles [ edit ]\n\nThe Battles round started with episode 9 and ended with episode 12 (broadcast on March 20, 21, 27, 28, 2017). Season twelve's advisors include: John Legend for Team Adam, Celine Dion for Team Gwen, DJ Khaled for Team Alicia and Luke Bryan for Team Blake. The coaches can steal two losing artists from another coach. Contestants who win their battle or are stolen by another coach will advance to the Knockout rounds.\n\nColor key:\n\nArtist won the Battle and advanced to the Knockouts Artist lost the Battle but was stolen by another coach and advanced to the Knockouts Artist lost the Battle and was eliminated\n\nThe Knockouts [ edit ]\n\nThe Knockouts round started with episode 13 and ended with episode 15 (broadcast on April 3, 4, 10, 2017). The coaches can each steal one losing artist. The top 20 contestants will then move on to the \"Live Shows.\" There are no key advisors in this round.\n\nColor key:\n\nArtist won the Knockout and advanced to the live shows Artist lost the Knockout but was stolen by another coach and advanced to the live shows Artist lost the Knockout and was originally eliminated but received the Coach Comeback and advanced to the Live Playoffs Artist lost the Knockout and was eliminated\n\nLive shows [ edit ]\n\nColor key:\n\nArtist was saved by the Public's votes Artist was saved by his/her coach or was placed in the bottom two, bottom three, or middle three Artist was saved by the Instant Save Artist's iTunes vote multiplied by 5 (except The Finals) after his/her studio version of the song reached iTunes top 10 Artist was eliminated\n\nWeek 1: Live Playoffs (April 17 & 18) [ edit ]\n\nPlayoff results was voted on in real time, exclusively through Twitter and The Voice app. Twelve artists sang live and six were eliminated by the end of each night. As with Seasons 9 & 10, each coach brought back one eliminated artist of their choice to join the top 20 and compete in the Live Playoffs.\n\nWeek 2: Top 12 (April 24 & 25) [ edit ]\n\nThe Top 12 performed on Monday, April 24, 2017, with the results following on Tuesday, April 25, 2017. Each artist attempted to reach the top 10 on iTunes in order to receive a vote multiplier. The two contestants with the fewest votes got a second chance to perform again for the Instant Save, with the loser leaving the competition. For the first time on The Voice, Shania Twain - who advised all the members of the Top 12 - sat in with the other coaches on a fifth chair. Brennley Brown (#7) received the iTunes bonus for this week.[6]\n\nWeek 3: Top 11 (May 1 & 2) [ edit ]\n\nThe Top 11 performed on Monday, May 1, 2017, with the results following on Tuesday, May 2, 2017. Each artist attempted to reach the top 10 on iTunes in order to receive a vote multiplier. The two contestants with the fewest votes got a second chance to perform again for the Instant Save, with the loser leaving the competition. Lauren Duski (#3) and Hunter Plake (#10) received the iTunes bonus for this week.[7]\n\nWeek 4: Top 10 (May 8 & 9) [ edit ]\n\nThe Top 10 performed Monday, May 8, 2017, with the results following on Tuesday, May 9, 2017. Each artist attempted to reach the top 10 on iTunes in order to receive a vote multiplier. The three contestants with the fewest votes got a second chance to perform again for the Instant Save, with the two with the fewest Instant Save votes leaving the competition. Hunter Plake (#9) and Lauren Duski (#10) received the iTunes bonus for this week.[8]\n\nWeek 5: Semifinals (May 15 & 16) [ edit ]\n\nThe Top 8 performed on Monday, May 15, 2017, with the results following on Tuesday, May 16, 2017. For the first time, the duets between contestants were part of the competition and public voting. In the semifinals, three artists would automatically move to next week's finale, the two artists with the fewest votes would be immediately eliminated and the middle three would contend for the remaining spot in the next week's finals via the Instant Save. iTunes bonuses this week went to Lauren Duski (#1), Chris Blue (#2), Vanessa Ferguson and Chris Blue (Duet) (#6), Aliyah Moulden (#7) and Hunter Plake (#10).[9]\n\nWith the eliminations of Brennley Brown and Hunter Plake, Gwen Stefani no longer has artists on her team.\n\nNon-competition performances Order Performer Song 26.1 Big Boi featuring Adam Levine \"Mic Jack\" 26.2 DNCE \"Kissing Strangers\"\n\nWeek 6: Finale (May 22 & 23) [ edit ]\n\nThe Top 4 performed on Monday, May 22, 2017, with the final results following on Tuesday, May 23, 2017. This week, the four finalists performed a solo cover song, a duet with their coach, and an original song. iTunes bonus multipliers were awarded to Lauren Duski (#1 and #2), Chris Blue (#3 and #9), Jesse Larson (#5) and Aliyah Moulden (#7). All iTunes votes received for the five weeks leading up to the finale were cumulatively added to online and app finale votes for each finalist.[10]\n\nElimination chart [ edit ]\n\nOverall [ edit ]\n\nColor key Artist's info\n\nTeam Adam\n\nTeam Adam Team Gwen Team Alicia\n\nTeam Alicia Team Blake\n\nResult details\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth place Saved by Instant Save (via Twitter)\n\nSaved by Instant Save (via Twitter) Saved by the public\n\nSaved by the public Saved by his/her coach\n\nSaved by his/her coach Eliminated\n\nLive show results per week Artists Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Finale Chris Blue Safe Safe Safe Safe Safe Winner Lauren Duski Safe Safe Safe Safe Safe Runner-up Aliyah Moulden Safe Safe Safe Safe Safe 3rd place Jesse Larson Safe Safe Safe Safe Safe 4th place Brennley Brown Safe Safe Safe Safe Eliminated Eliminated (Week 5) Hunter Plake Safe Safe Safe Safe Eliminated Vanessa Ferguson Safe Safe Safe Safe Eliminated TSoul Safe Safe Safe Safe Eliminated Mark Isaiah Safe Safe Safe Eliminated Eliminated (Week 4) Lilli Passero Safe Safe Safe Eliminated Stephanie Rice Safe Safe Eliminated Eliminated (Week 3) Troy Ramey Safe Eliminated Eliminated (Week 2) Jack Cassidy Eliminated Eliminated (Week 1) Hanna Eyre Eliminated Johnny Gates Eliminated Johnny Hayes Eliminated JChosen Eliminated Casi Joy Eliminated Ashley Levin Eliminated Aaliyah Rose Eliminated Quizz Swanigan Eliminated Felicia Temple Eliminated Anatalia Villaranda Eliminated Josh West Eliminated\n\nTeam [ edit ]\n\nColor key Artist's info\n\nTeam Adam\n\nTeam Adam Team Gwen Team Alicia\n\nTeam Alicia Team Blake\n\nResult details\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth Place Eliminated\n\nEliminated Artist Saved by Instant Save (via Twitter)\n\nArtist Saved by Instant Save (via Twitter) Artist received one or more iTunes bonus that week\n\nArtist received one or more iTunes bonus that week Number of iTunes bonuses received\n\nArtist Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Finale Jesse Larson Public's choice Advanced Advanced Advanced Advanced Fourth place Mark Isaiah Coach's choice Advanced Advanced Eliminated Lilli Passero Public's choice Advanced Advanced Eliminated Hanna Eyre Eliminated Johnny Hayes Eliminated Josh West Eliminated Brennley Brown Public's choice Advanced Advanced Advanced Eliminated Hunter Plake Public's choice Advanced Advanced Advanced Eliminated Troy Ramey Coach's Choice Eliminated Johnny Gates Eliminated JChosen Eliminated Quizz Swanigan Eliminated Chris Blue Public's choice Advanced Advanced Advanced Advanced Winner Vanessa Ferguson Public's choice Advanced Advanced Advanced Eliminated Stephanie Rice Coach's Choice Advanced Eliminated Jack Cassidy Eliminated Ashley Levin Eliminated Anatalia Villaranda Eliminated Lauren Duski Public's choice Advanced Advanced Advanced Advanced Runner-up Aliyah Moulden Public's choice Advanced Advanced Advanced Advanced Third place TSoul Coach's Choice Advanced Advanced Advanced Eliminated Casi Joy Eliminated Aaliyah Rose Eliminated Felicia Temple Eliminated\n\nContestants who appeared on previous shows or seasons [ edit ]\n\nRatings [ edit ]\n\nEpisode Original airdate Production Time slot (ET) Viewers\n\n(in millions) Adults (18–49) Source Rating Share 1 \"The Blind Auditions Premiere, Night 1\" February 27, 2017 ( ) 1201 Monday 8:00 p.m. 13.03 3.1 11 [15] 2 \"The Blind Auditions Premiere, Night 2\" February 28, 2017 ( ) 1202 Tuesday 8:00 p.m. 11.42 2.6 9 [16] 3 \"The Blind Auditions Premiere, Night 3\" March 2, 2017 ( ) 1203 Thursday 8:00 p.m. 10.69 2.3 8 [17] 4 \"The Blind Auditions, Part 4\" March 6, 2017 ( ) 1204 Monday 8:00 p.m. 12.13 2.7 9 [18] 5 \"The Blind Auditions, Part 5\" March 7, 2017 ( ) 1205 Tuesday 8:00 p.m. 11.62 2.6 9 [19] 6 \"The Blind Auditions, Part 6\" March 13, 2017 ( ) 1206 Monday 8:00 p.m. 12.18 2.6 9 [20] 7 \"The Blind Auditions, Part 7\" March 14, 2017 ( ) 1207 Tuesday 8:00 p.m. 11.71 2.5 9 [21] 8 \"The Best of the Blind Auditions\" March 15, 2017 ( ) 1208 Wednesday 8:00 p.m. 7.63 1.6 6 [22] 9 \"The Battles Premiere, Part 1\" March 20, 2017 ( ) 1209 Monday 8:00 p.m. 10.74 2.4 8 [23] 10 \"The Battles Premiere, Part 2\" March 21, 2017 ( ) 1210 Tuesday 8:00 p.m. 10.84 2.3 9 [24] 11 \"The Battles, Part 3\" March 27, 2017 ( ) 1211 Monday 8:00 p.m. 10.56 2.4 9 [25] 12 \"The Battles, Part 4\" March 28, 2017 ( ) 1212 Tuesday 8:00 p.m. 10.22 2.1 8 [26] 13 \"The Knockouts Premiere, Part 1\" April 3, 2017 ( ) 1213 Monday 8:00 p.m. 10.04 2.2 7 [27] 14 \"The Knockouts Premiere, Part 2\" April 4, 2017 ( ) 1214 Tuesday 8:00 p.m. 9.53 1.9 7 [28] 15 \"The Knockouts, Part 3\" April 10, 2017 ( ) 1215 Monday 8:00 p.m. 9.88 2.1 8 [29] 16 \"Road to the Live Shows\" April 11, 2017 ( ) 1216 Tuesday 8:00 p.m. 7.76 1.6 7 [30] 17 \"The Live Playoffs, Night 1\" April 17, 2017 ( ) 1217 Monday 8:00 p.m. 9.57 2.0 7 [31] 18 \"The Live Playoffs, Night 2\" April 18, 2017 ( ) 1218 Tuesday 8:00 p.m. 8.85 1.8 7 [32] 19 \"Live Top 12, Performance\" April 24, 2017 ( ) 1219 Monday 8:00 p.m. 9.27 1.9 7 [33] 20 \"Live Top 12, Results\" April 25, 2017 ( ) 1220 Tuesday 8:00 p.m. 9.63 1.8 7 [34] 21 \"Live Top 11, Performance\" May 1, 2017 ( ) 1221 Monday 8:00 p.m. 9.08 1.8 7 [35] 22 \"Live Top 11, Results\" May 2, 2017 ( ) 1222 Tuesday 8:00 p.m. 8.82 1.6 7 [36] 23 \"Live Top 10, Performance\" May 8, 2017 ( ) 1223 Monday 8:00 p.m. 9.34 1.9 7 [37] 24 \"Live Top 10, Results\" May 9, 2017 ( ) 1224 Tuesday 8:00 p.m. 8.69 1.7 7 [38] 25 \"Live Top 8 Semi-Finals, Performance\" May 15, 2017 ( ) 1225 Monday 8:00 p.m. 9.11 1.8 7 [39] 26 \"Live Top 8 Semi-Finals, Results\" May 16, 2017 ( ) 1226 Tuesday 8:00 p.m. 8.65 1.5 7 [40] 27 \"Live Finale, Performance\" May 22, 2017 ( ) 1227 Monday 8:00 p.m. 9.65 2.0 7 [41] 28 \"Live Finale Results\" May 23, 2017 ( ) 1228 Tuesday 9:00 p.m. 9.35 1.9 7 [42]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Check_mark.svg/18px-Check_mark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Gwen_Stefani%2C_Bloomingdales.jpg/102px-Gwen_Stefani%2C_Bloomingdales.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/BlakeSheltonApr10.jpg/88px-BlakeSheltonApr10.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Alicia_Keys%2C_Lisboa_08_c.jpg/102px-Alicia_Keys%2C_Lisboa_08_c.jpg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Adam_Levine_performing_live_onstage_in_2014.jpg/115px-Adam_Levine_performing_live_onstage_in_2014.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Voice_(American_season_12)", "title": "The Voice (American season 12)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}