{"url": "https://www.countryliving.com/life/entertainment/a23119127/justin-hartley-wife-chrishell-stause/", "text": "When This Is Us heartthrob Justin Hartley married actress Chrishell Stause on October 28, 2017, the ceremony was held at Malibu's Calamigos Ranch on the fourth anniversary of their first date.\n\nThe two attended a concert together at the urging of a mutual friend. Chrishell, who has since changed her last name to Hartley, said it was love at first sight. \"The next day I texted my friend: 'I found him,'\" she told People.\n\nJustin Hartley and wife Chrishell. Axelle/Bauer-Griffin Getty Images\n\nJustin agreed. \"I drove her home and called the next day. We haven't been apart since,\" he added. \"I knew right away [and] was like, 'Oh boy, here we go.'\"\n\n\n\nJustin's This Is Us castmates, including Milo Ventimiglia, Mandy Moore, and Chrissy Metz, were on hand to help the couple celebrate their big day.\n\nJustin, 41, stars on the critically acclaimed NBC series as the troubled Kevin Pearson, one of the Big Three at the heart of the show. This Is Us, which debuted in 2016, has become a cultural phenomenon, breaking ratings records and kicking Justin's career into high gear (and it returns for a third season in September).\n\nJustin Hartley with first wife, Lindsay Hartley, in 2007. Jeffrey Mayer Getty Images\n\nLongtime fans know he started out on a soap opera, logging four years on Passions before taking the role of Oliver Queen, aka the Green Arrow, on the CW series Smallville. In later years, Justin returned to soaps on The Young and the Restless and appeared on ABC's Revenge and Mistresses. He's also graced the big screen, most recently in 2017's A Bad Moms Christmas.\n\n\n\nJustin married fellow Passions alumni Lindsay Hartley (née Korman) in 2004, but the couple divorced in 2012. They share a daughter, Isabella Justice (Bella for short), born in 2004 and now age 14.\n\n\n\nChrishell, 37, is also an actress known for roles on soap operas All My Children and Days of Our Lives, and most recently played Bethany Bryant on The Young and the Restless. She's also appeared on the web series Youthful Daze.\n\nJustin Hartley and daughter Isabella. Rodin Eckenroth Getty Images\n\nAlthough they're only coming up on their first wedding anniversary, the two have settled into a comfortable, married life and enjoy spending time together at home when they aren't working. \"We really are all about staying in recently, cooking together, watching movies, and that sort of thing,\" Justin told US Weekly.\n\n\n\nHe also knows the secret to starting his wife's day off right. \"I'm an early riser, so when I hear her coming down the stairs in the morning, I turn on the coffee maker for her and get espresso going,\" he explained to the publication.\n\n\n\nFor her part, Chrishell helps her husband to stay on track with his fitness routine, he noted to People.\n\n\n\n\"She makes it easier. She's a big motivational factor for me because she's in such great shape,\" Justin said. \"I try to keep up with her. To have somebody in your life that can motivate you is really, really good.\"\n\nBuilding a life together is a top priority for the couple. As Justin told the publication after their wedding, \"At the risk of sounding cheesy, I look forward to sharing life experiences and growing old together. Someday, we can talk about all the things we did together 30 years ago!\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=1.00xw:0.695xh;0,0.104xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=1.00xw:0.695xh;0,0.104xh&resize=1200:*", "keywords": [], "authors": ["Samantha Drake", "Samantha Drake Is A Freelance Writer In The Philadelphia Area."], "canonical_link": "https://www.countryliving.com/life/entertainment/a23119127/justin-hartley-wife-chrishell-stause/", "title": "Justin Hartley's Wife Chrishell Stause", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Country Living", "title": "How 'This is Us' Star Justin Hartley Found Love With Chrishell Stause After His Divorce", "description": "His character may have relationship issues, but off-camera, Justin is happily married.", "url": "https://www.countryliving.com/life/entertainment/a23119127/justin-hartley-wife-chrishell-stause/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=1.00xw:0.695xh;0,0.104xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 165119423553230, "pages": 12013348247}, "article": {"publisher": "https://www.facebook.com/CountryLiving", "modified_time": "2018-09-18 01:34:15", "published_time": "2018-09-16 03:00:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CountryLiving", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=1.00xw:0.695xh;0,0.104xh&resize=640:*"}, "google-site-verification": "y2umrM2fg1eXvnoHVUyHzeVTDYfhwLzq_rWVXkg0Yhw", "title": "Justin Hartley's Wife Chrishell Stause - Justin Hartley Marriage and Daughter", "description": "His character Kevin Pearson may have relationship issues, but off-camera, This Is Us actor Justin Hartley is happily married to wife Chrishell Stause Hartley. Still, the heartthrob has seen some heartbreak, including a divorce from first wife Lindsay Hartley, with whom he shares a daughter, Bella. Here's what you need to know about Justin Hartley's family in real life.", "keywords": "justin hartley wife, justin hartley fiance, justin hartley daughter, justin hartley age, is justin hartley married, justin hartley married, justin hartley divorce, chrishell stause, chrishell stause and justin hartley, lindsay hartley", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=0.657xw:0.907xh;0.197xw,0.0929xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Country Life,life,entertainment", "sailthru.date": "2018-09-16T15:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=1.00xw:0.695xh;0,0.104xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/75th-annual-golden-globe-awards-pictured-actors-chrishell-news-photo-902331338-1536864042.jpg?crop=0.657xw:0.907xh;0.197xw,0.0929xh", "sailthru.socialtitle": "How 'This is Us' Star Justin Hartley Found Love With Chrishell Stause After His Divorce", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1537038000.0, "source": "https://www.countryliving.com", "summary": ""}