{"url": "https://web.archive.org/web/20170313220530/https://www.whitehouse.gov/the-press-office/2017/03/13/remarks-president-trump-listening-session-healthcare", "text": "Roosevelt Room\n\n11:27 A.M. EDT\n\nTHE PRESIDENT: Thank you all for being here today. It’s a great honor for you to share your personal stories of struggle under the enormous strain imposed on you by the very, very failed and failing Obamacare law. Secretary Price and I, along with my entire administration, and a lot of people in the Senate and a lot of people in the House are committed to repealing and replacing this disastrous law with a healthcare plan that lowers cost, expands choice, and ensures access for everyone.\n\nYou represent the millions of Americans who have seen their Obamacare premiums increase by double digits and even triple digits. In Arizona, the rates were over 116 percent last year -- 116 percent increase. And the deductibles are so high you don’t even get to use it.\n\nMany Americans lost their plans and doctors altogether, and one-third of the counties -- think of it, one-third only have one insurer left. The insurance companies are fleeing. They’re gone; so many gone. The House bill to repeal and replace Obamacare will provide you and your fellow citizens with more choices -- far more choices at lower cost. Americans should pick the plan they want. Now they’ll be able to pick the plan they want, they’ll be able to pick the doctor they want. They’ll be able to do a lot of things that the other plan was supposed to give and it never gave. You don’t pick your doctor, you don’t pick your plan -- you remember that one.\n\nWe’re not going to have one-size-fits-all. Instead, we’re going to be working to unleash the power of the private marketplace to let insurers come in and compete for your business. And you’ll see rates go down, down, down, and you’ll see plans go up, up, up. You’ll have a lot of choices.\n\nYou’ll have plans that nobody is even thinking of today. They will have plans that today nobody has even thought about, because the market is going to enforce that, with millions and millions of people wanting healthcare. More competition and less regulation will finally bring down the cost of care, and I think it will bring it down very significantly. Unfortunately, it takes a while to get there, because you have to let that marketplace kick in, and it’s going to take a little while to get there. Once it does, it’s going to be a thing of beauty. I wish it didn’t take a year or two years, but that’s what’s going to happen, and that’s the way it works. But we’re willing to go through that process.\n\nWorking together, we’ll get the job done. And I have to say this just in closing, and then I want to hear some of your stories, and we’ll let the press stay for your stories if you like. But the press is making Obamacare look so good all of a sudden. I’m watching the news -- looks so good. They’re showing these reports about \"this one gets so much and this one gets so much.\"\n\nFirst of all, it covers very few people. And it’s imploding. And ’17 will be the worst year. And I said it once, I’ll say it again -- because Obama is gone -- things are going to be very bad this year for the people with Obamacare. They’re going to have tremendous increases.\n\nAnd the Republicans, frankly, are putting themselves in a very bad position -- and I tell this to Tom Price all the time -- by repealing Obamacare -- because people aren’t going to see the truly devastating effects of Obamacare. They’re not going to see the devastation in ’17 and ’18 and ’19. It'll be gone by then, whether we do it or not. It’ll be imploded off the map.\n\nSo the press is making it look so wonderful so that if we end it, everyone is going to say, \"Oh, remember how great Obamacare used to be, remember how wonderful it used to be, it was so great.\" It’s a little bit like President Obama. When he left, people liked him. When he was here, people didn’t like him so much. That’s the way life goes. That’s human nature.\n\nThe fact is, Obamacare is a disaster. And I say this to the Republicans all the time: By repealing it, by getting rid of it, by ending it, everyone is going to say, \"Oh, it used to be so great.\" But it wasn’t great. And I tell Tom Price and I tell Paul Ryan, I tell everyone of them -- I say, the best thing you can do politically is wait a year, because it’s going to blow itself off the map. But that’s the wrong thing to do for the country, it’s the wrong thing to do for our citizens.\n\nSo with that, I’d like to introduce some of the folks and you could say a few words about your experience with Obamacare. And perhaps the press will even report it. (Laughter.)\n\nWould you like to start?\n\nMS. COUEY: Yeah, thank you for this opportunity, Mr. President.\n\nTHE PRESIDENT: Thank you. Thank you.\n\nMS. COUEY: Our rates are three times what they were before Obamacare started. We have one provider in our county. We have very little options for what we can and cannot do. We’re a small-business owner; we’re actually not a brick-and-mortar, we are cattle ranchers. We can’t afford our equipment if we’re paying these rates year after year after year.\n\nOur food source is in jeopardy because of this healthcare law. It’s my basic --\n\nTHE PRESIDENT: I know. Sorry. Don't worry. Don't worry. This is what’s happening. It’s gone up three times, and then you have to pay -- if you don’t want to use it, you have to pay. That’s the all-time beauty. If you don’t want to use it, you have to pay. And, Tom, you have to pay big league, right? Some people say, well, if I use it, I use it, I’m paying too much. If I don’t use it, I have to pay a penalty. And do you have to pay penalties? Do you ever do that, or you have to --\n\nMS. COUEY: We haven’t as of yet, but we were uninsured in December. They dropped us for the fourth time, after we paid over $50,000 last year for healthcare expenses.\n\nTHE PRESIDENT: And it’s gone up triple.\n\nMS. COUEY: Yes.\n\nTHE PRESIDENT: And before Obamacare, you actually had good healthcare.\n\nMS. COUEY: We did. We had a fantastic plan.\n\nTHE PRESIDENT: A lot of people -- nobody ever takes that into account. I’m not saying the system before was good, because it wasn’t, but millions of people had great healthcare that they loved.\n\nNow, when you start deducting those millions of people from the so-called people that are happy, you have a very small number of people that are happy. That, I can tell you.\n\nHow about you?\n\nPARTICIPANT: Well, we’re kind of the same story as Carrie. In 2009, I left a full-time job to be a stay-at-home mom to two kids. For our family, it was never an option to get government assistance; we just don’t believe our neighbors should work harder so that we don’t have to. So my husband said, if you can pay for our insurance -- which at the time was $650 a month for private health insurance for a family of four -- then that was fine.\n\nFrom 2009 to 2015, that private insurance went up by 102 percent. Finally, his employer told us in 2015, when it went up the final time an additional 34 percent, that they couldn’t carry our family anymore, so I had to enter back into the workforce but I couldn’t find a job that offered health insurance. So we entered under Obamacare, and we believed the sales pitch that, \"If you like your doctor you can keep your doctor.\"\n\nSo even though we were going to have to pay $1,300 a month for Obamacare, we thought we’d still be okay with our doctors. We were on it for five months. Our pediatrician for our children wouldn’t take it, my doctor wouldn’t take it, so we paid them $8,000 in five months and were never able to use it.\n\nAnd I think what makes our family story unique is, we’re by no means wealthy. In 2014, when we entered the exchange, we made $53,000 as a family, my husband and I together -- that was our gross income. And then in 2015, we made together -- since I had gone back to work -- $74,000. But when you look at paying $10,000 in health premiums and insurance -- and health costs --\n\nTHE PRESIDENT: So it’s been a rough go.\n\nPARTICIPANT: It has, it’s been hard.\n\nTHE PRESIDENT: How have you found Obamacare?\n\nPARTICIPANT: We’ll be so happy to see it gone. I mean, it’s almost put our family in financial ruin, and I think that’s the story for a lot of people.\n\nTHE PRESIDENT: It’s put businesses in financial ruin.\n\nPARTICIPANT: That’s right.\n\nTHE PRESIDENT: It’s one of the biggest costs -- it has been disastrous for businesses.\n\nGo ahead, sir.\n\nMR. SEIFE: Yes, first of all, Mr. President, thank you for having us here.\n\nTHE PRESIDENT: Thank you.\n\nMR. SEIFE: I think it’s a great opportunity to talk to the American people, people like ourselves that have struggled with the healthcare law.\n\nI myself am from Miami. I haven’t had very much time to prepare, but the President of the United States calls and I’m here. (Laughter.) So it just so happened I had -- every single year for the past couple of years I’ve had a different insurance every single year. Before, I had an individual plan, my wife and I -- my wife is an attorney, I’m a computer programmer; I’m a small business, my wife is a small business. And I just don’t understand what happened. I have a daughter with a disability. We’ve changed our plan every year.\n\nTHE PRESIDENT: So your insurance was good before Obamacare.\n\nMR. SEIFE: Oh, absolutely. I never had --\n\nTHE PRESIDENT: Many people are like that. Many, many plans were great before Obamacare. They were so happy. And that doesn’t justify the system before Obamacare, but people are miserable now, and it’s putting people out of business and it’s putting them in the poorhouse.\n\nGo ahead.\n\nMR. SEIFE: It’s just that we had to -- they cancelled our plans, and I couldn’t understand why they cancelled our plans. So we had no other choice. I remember the President of the United States say that individual plans will not be covered, you need to have an employer-based plan. I do not work for the government, I do not work for a large employer.\n\nTHE PRESIDENT: Very unfair.\n\nMR. SEIFE: We are ground zero. My case is ground zero for the healthcare law.\n\nTHE PRESIDENT: And you represent a lot of people in the same situation.\n\nMR. SEIFE: Absolutely.\n\nTHE PRESIDENT: It’s very unfair.\n\nMR. SEIFE: Like my friend here, she’s in the same situation. And I think it’s very, very unfair. And I think that the real scenario was that this law was supposed to implode, like you were saying. And my parents are from -- came from communist Cuba, they know what socialism is all about. So I know what socialism is, and that’s pretty much what -- this whole system was meant to have one single provider.\n\nTHE PRESIDENT: Well, it turns out it's so expensive it’s almost not socialism when you think about it. (Laughter.) You have to pay so much.\n\nWhat do you think? Go ahead.\n\nMS. SERTICH: I’m from Arizona, and I can tell you that the 116-percent increase is real, it’s not a myth. I lost my plan three times during the Obamacare era. After losing it this year I decided to opt out. So right now I do not have traditional healthcare.\n\nAnd I went from a $365-a-month premium last year to a $809-premium this year.\n\nTHE PRESIDENT: And a higher deductible.\n\nMS. SERTICH: The deductible was going to be $6,800, no copays. So if I went to the doctor, I would be paying out of my pocket, and it just didn’t seem like a good use of my money. I thought I would be a better steward of that $17,000 at the end of the year should I have reached my deductible, and just decided to opt out. I went into a faith-based share program, and I’m doing that.\n\nOne of the reasons I felt like I can do this -- totally taking a leap of faith -- is because I think -- I know you’re going to get this taken care of. So I thought it’s only going to be for a year. I will be on this program, I will opt out of traditional healthcare, or health insurance. And I think you’re going to get it done.\n\nTHE PRESIDENT: You have a lot of people in Arizona paying a big penalty?\n\nMS. SERTICH: Yes.\n\nTHE PRESIDENT: You’re paying the penalty?\n\nMS. SERTICH: Well, and my husband also owns his own business and can’t afford to offer insurance to employees. And his employees who are also in the independent market, it’s just getting too much. And I’ve had individual insurance for 25 years, since I started my business. So I’ve always been in that individual market, I’ve always done what was right. I took responsibility for myself, made sure I was covered for healthcare because I’m a businessperson, I don’t want any huge healthcare expenses to affect the money that could be going to my business now having to go to a health expense.\n\nSo I was in my mid-20s when I said, you know what, I’ve got to get -- we’ve got to get square with this, I have to have independent insurance. So, I have.\n\nTHE PRESIDENT: Well, thank you very much. The people of Arizona have been hit very, very hard. At least 116 percent. Here’s the bad news: It’s going to go up more this year. Now, if we repeal it, nobody is going to know that, and the press is going to say how wonderful it was, and, gee, we miss Obamacare. That’s the problem. It’s the biggest problem I have, Tom. We’re going to do them a big favor, but it’s not the right way.\n\nGo ahead.\n\nMR. BROWN: Mr. President, thank you.\n\nTHE PRESIDENT: Thank you very much, Louis.\n\nMR. BROWN: My name is Louis Brown. I work for the Christ Medicus Foundation. I'm an attorney by trade. In 2009, when the Affordable Care Act was going through Congress -- what became the Affordable Care Act -- I was working for the Democratic National Committee at the time. I resigned my position because I could tell that the Democratic bill that was going through Congress wanted to publicly fund abortion, and that’s not something that I could go along with. So I resigned my position, later worked for Congressman Dan Lungren in Congress, and went on to eventually work for the Christ Medicus Foundation. And we’re focused on building a culture of life, protecting religious liberty in healthcare, protecting the right of conscience, prohibiting the public funding of abortion, and also prohibiting non-discrimination against pro-life medical providers.\n\nEspecially as an African American, I'm a graduate of Howard University School of Law.\n\nTHE PRESIDENT: Good school.\n\nMR. BROWN: Yeah. Thank you, Mr. President. And I know from Saint John Paul II -- he said that all of our human and civil rights that we believe in as Americans, that we share as Americans -- the right to healthcare, the right to medical care, to housing, to all of these different things -- are illusory if the right to life isn’t defended with maximum determination.\n\nSeventeen million African Americans, it’s shown, that probably have been aborted since Roe v. Wade. And I supported you in the presidential election, gave several speeches in Michigan telling folks to vote pro-life in the general election, and I’m really happy that you’re here to continue the bipartisan belief that there should be no taxpayer-funding of abortion, and also really to support your effort to show that the patient, the human person, should be at the center of our American healthcare system, not the government. The government has its place, but the patient should be the center. So I’m happy to support you, Mr. President.\n\nTHE PRESIDENT: Thank you. That’s so nice. Thank you, I appreciate it. Great job.\n\nYes, go ahead.\n\nDR. SETHI: Mr. President, thank you so much for inviting me. My name is Dr. Manny, and I run a nonprofit called Healthy Tennessee, and across Tennessee I’m a trauma surgeon. But what we do is --\n\nTHE PRESIDENT: I’ll be in Tennessee on Wednesday.\n\nDR. MANNY: We look forward to hosting you, sir.\n\nTHE PRESIDENT: I’ll see you there.\n\nDR. MANNY: Yes, sir. We do these large community events in rural Appalachia, across Tennessee, where we host these health fairs taking care of patients. So it’s really a grassroots effort -- something that you understand better than anybody -- where people come out just to help people. Doctors, nurses on the ground, helping folks with preventative medicine, educating folks. That’s what we do.\n\nBut the one thing I’ve been seeing across Tennessee is that folks really can’t afford these rising premiums. So what they’re doing is, effectively, they’re paying the tax penalty because it’s cheaper and it works out better than paying for the insurance. And so that’s been a big problem that we’re seeing across the state. So thank you so much for what you’re doing to tackle this problem.\n\nTHE PRESIDENT: So you’ve seen a big problem, and the way out of the problem is to do a plan much more like the plan we’re going to get done.\n\nDR. MANNY: Yes, sir.\n\nTHE PRESIDENT: We’ll get that out -- without penalties too, by the way. People don’t mention all of the facts.\n\nYou know, the other thing about what we’re talking about -- we really have a three-phase plan. They only want to talk about the first phase. The first phase is just the most basic of phases, and then you have phase two, which is largely done by our Secretary, and then you have phase three, which is a lot of the bells and whistles. But they don’t want to talk about the bells and whistles. So they’re really comparing things to something that won’t be there for long.\n\nAnd the reason we have to do it that way is because of Congress. I’d love to do it all in one package, but if you did it that way, it can’t get done. So we’re going to get something done that’s going to be terrific.\n\nI appreciate it. Thank you, doctor, very much.\n\nYes, sir. Go ahead.\n\nMR. BROWN: Thank you, Mr. President. I’d like to thank you for the opportunity to be here today. I, too, am from Tennessee, and I, too, am in the farming industry.\n\nTHE PRESIDENT: Good.\n\nMR. BROWN: And the effect that I’ve had through Obamacare is my wife's and my daughter's insurance is supplied through her work, I buy my own. And I’ve seen the increases, since Obamacare, to the tune of about $5,000 a year, just for me. And I have considered taking the option of the penalty because -- my problem with the penalty is, though, if I opt out of the program, and buy a private plan -- just a catastrophic plan because I’m a very healthy man -- if I take that option, not only is my income penalized, but my wife’s income as well, because she makes a considerable more amount of money than I do, but she has insurance. So I don’t think that’s fair.\n\nAnd I don’t think -- the rate increase is just astronomical, and I’m in the county that only has one option -- BlueCross BlueShield of Tennessee --and I’ve got about $540-a-month premium for the $7,000 out-of-pocket deductible before I see any help at all. And I even got to pay a high premium for a plan that I don’t need or don’t want --\n\nTHE PRESIDENT: Will you be able to continue, in the years to come, if you have to keep going like this?\n\nMR. BROWN: They’re dropping out every day -- the suppliers in other counties. There’s 35 counties in Tennessee that has no options at all right now. I don’t know what those folks do.\n\nTHE PRESIDENT: You know what that means? That means somebody is going to make a lot of money. You know that. They’re going to make a lot of money. (Laughter.) Somebody is going to -- well, a few. You’re not going to make it. They’re going to make it. There are people very happy about this situation.\n\nMR. BROWN: Thank you for the opportunity to be here.\n\nTHE PRESIDENT: Well, I appreciate. Thank you, Joel.\n\nDoctor?\n\nDR. ARMSTRONG: Yes, sir. Well, I’m a physician in Texas, and thank you for allowing me to be here today. And I’ll tell you, what I’ve seen is that a lot of patients really are not adequately covered by Obamacare. It was supposed to cover people who had -- like everyone has said here -- with the rising premiums and the rising deductibles. I take care of patients in the hospital, and the patients are shocked to get a $20,000 bill, and to find that they’re responsible for $6,000 of that because their deductible is so high. And that’s just the situation that cannot continue.\n\nMedicaid expansion under Obamacare really doesn’t cover folks either, because many physicians are not even taking Medicare. They’re not accepting it any longer in the outpatient setting. And so folks who have chronic medical illnesses, like cancer -- I mean, my wife is a breast cancer survivor, and most of her treatment was actually as an outpatient. It was very expensive outpatient care. Most physicians don’t even accept Medicaid, so those patients are still uncovered.\n\nAnd so the Medicaid expansion really hasn’t covered them. The folks who have Obamacare insurance really are inadequately covered as well because they’re still paying extremely high premiums and then having to pay extremely high deductibles. And so it’s really --\n\nTHE PRESIDENT: And do they even reach it with the high deductibles? They don’t even reach it for the most part.\n\nDR. ARMSTRONG: You know, oftentimes they do not, unless they have some sort of serious medical problem, and they’re in the hospital, and it’s very expensive -- they don’t even reach their deductible oftentimes. And so it’s unfortunate. So I really appreciate it.\n\nI actually read the bill that’s been produced that’s coming out of the House now, and I really like a lot of the changes in it. I think that this is going to correct a lot of the issues that Obamacare has had. So I really appreciate what you all are doing.\n\nTHE PRESIDENT: Well, I appreciate it, doctor. Thank you. Say hello to your wife.\n\nDR. ARMSTRONG: Yes, sir. I will. Thank you.\n\nTHE PRESIDENT: Very nice. Thank you.\n\nGina.\n\nMS. SELL: Hi, Mr. President, I’m Gina. I’m from Wisconsin. I’m a nurse, I’m a mom, and I am part of that huge group of middle-class families that were impacted by the ACA.\n\nBefore ACA, we had insurance that was eventually cancelled, and I had written a letter to our senator just asking him, what do I do? Do I quit my job completely so that we can obtain a subsidy -- a job that I love, as a nurse in a hospital that I love? Or do I uproot my family and try to find a job with benefits that doesn’t even cover the medical --\n\nTHE PRESIDENT: So the healthcare is -- the Obamacare forced you to actually -- in a sense, forces you, economically and almost potentially, to get another job.\n\nMS. SELL: Right.\n\nTHE PRESIDENT: Even though you like your job.\n\nMS. SELL: Right. So I did end up getting a full-time position at the hospital that I worked at. But that came with a price because I was working three days a week, and spending time with my small children, who are my number-one priority. And after the ACA, I was forced -- because we could not afford a premium of $1,200 per month and a deductible that didn’t cover anything -- to find a job with benefits.\n\nTHE PRESIDENT: Meaning the deductible was so high that, essentially, unless you had a really big problem, you wouldn’t even be able to use it.\n\nThe deductible was so high that essentially unless you had a really big problem, you wouldn’t even be able to use it.\n\nMS. SELL: Correct, yes. And we're still in that boat. I mean, right now our deductible is $6,500. And so if I have a child who's extremely sick, it's going to cost me hundreds of dollars. Just last week, my daughter had a fever, and I sent her to school for three days straight because I had to work to afford our assurance, and I couldn’t afford to bring her to the doctor. So it has been devastating for our family.\n\nTHE PRESIDENT: It's really not having insurance at all. A lot of Obamacare, you don’t really have insurance because the deductibles are so high that you really don’t have insurance, if you think about it.\n\nAll right. Thank you very much. Good luck.\n\nMS. SELL: Thank you.\n\nTHE PRESIDENT: Yes, sir.\n\nMR. KNOX: Mr. President, thank you very much for hosting us. This is great. I have to start with something. As I was leaving the house, my 11-year-old ran up to me and said, \"Dad, I'd like to have you give this to Mr. President for me.\" (Laughter.)\n\nTHE PRESIDENT: What do you have there? I wished I looked that good. (Laughter.)\n\nMR. KNOX: \"Dear President Trump, it is a great honor to be able to write to the President of the USA. I think you are a great President and a great man. Also, don't worry, the picture of you on the front of this looks nothing like you.\" (Laughter.)\n\nTHE PRESIDENT: (Laughter.) That's very nice. Thank you. Thank you. I wish I looked that good.\n\nMR. KNOX: So I had the privilege of meeting with Secretary Price and Vice President Pence in Cincinnati about a week and a half ago at a roundtable, and I'll share with you what I shared with them. I started with a quote from the great President, Ronald Reagan, who said, \"The most terrifying words in the English language are we're from the government and we're here to help.'\" (Laughter.) Kind of my feeling on healthcare.\n\nFrankly, I think that the system was broken before the last administration got their hands on it. I started my company 21 years ago, and I had a vision of wanting to provide 100 percent full family healthcare for as long as I had a company, because I really felt in my heart that it was the right thing to do. I was one of the last holdouts. But, sadly, after about 15 years, I really had a choice of either having a company or being able to provide my employees that level of healthcare. And that's sad. I tell my wife all the time -- you can have anything you want, we just can't everything we want. We have the best healthcare system in the world -- we do -- but it needs to be fixed -- whether it's small business owners, like myself -- I'm a manufacturer, I'm on several boards in the Midwest in manufacturing.\n\nWhat we'd like to see is not a government-operated market, but a free market. I sell (inaudible) equipment for a living. We have a trade show every year, and there's hundreds and hundreds of people selling competitive products. If we had a healthcare show in my town, there would be three or four people under that roof. And as a businessman yourself, you know what that does to driving down costs or the lack thereof. So we would like to see more of a free-market solution, going back to what made this country great -- entrepreneurialism instead of empowerments; work ethics instead of welfare. And that's what we'd like to ask you for. And I'd like to say thank you very much.\n\nTHE PRESIDENT: As you know, that's what we're doing largely, but we also have to take care of people that can't afford to be in a position like you are. So we're going to do that. Largely, I think beyond everything, if you look at what's going to happen -- the competitive bidding -- every element of what we're doing is competitive bidding, but we have to take care of people who need the help. And there are a lot of people like that.\n\nMR. KNOX: There's always been a safety net in the United States, and there should be. And, unfortunately, when I see 50,000 -- or 50 million Americans taking assistance in -- you know, they're market food stamps. That's like -- for the people who really can't provide for themselves, you know, we're all charitable people who are Americans, we're the most generous nation on the face of the Earth. So I totally believe in safety nets for those who need them, not free handouts for (inaudible).\n\nTHE PRESIDENT: We’re going to help a lot of people, but we are going to be very much free market people. They can afford -- and they'll be off the cost.\n\nGo ahead, Stan.\n\nMR. SUMMERS: I'm Mr. Stan Summers from Box Elder County, northern Utah. I think I'm probably the only other elected official here besides you guys. It's been an interesting ride to watch the healthcare system in the last 26 years. When my son was born, he was three and a half months premature, 26 years ago. And we had really good insurance. We basically didn’t have to pay anything out of pocket besides what we were doing from where I worked. As time went on, you could kind of tell the healthcare system has been a little bit broke, and then all of a sudden the ACA -- and I'm not going to call it the other word -- I call it the last President's healthcare program. I don’t want to say that name.\n\nSo anyway --\n\nTHE PRESIDENT: Other than that, you like him a lot, right? (Laughter.)\n\nMR. SUMMERS: Yeah, exactly. (Laughter.) It's gotten to the point where I own a couple of businesses too and do the things that I have to do. I actually ran for government so I could have insurance -- and won. But now I'm looking at these people, saying, how can I provide insurance for them without raising taxes and doing these things that are happening -- because everything has gone up. Utah didn’t expand Medicaid -- we weren’t a part of that -- and we can see why now, because of the things that are happening throughout the nation with states and companies and everybody else going bankrupt.\n\nSo it got to the point where I ended up -- not only with my businesses -- I have to drive a school bus to keep my wife at home with my kid that was ill. So now I own three businesses, I drive a school bus, and I'm an elected official, to be able to continue to do the things that I need to do with healthcare. The last three -- well, the last three years --\n\nTHE PRESIDENT: So it's gone through the roof.\n\nMR. SUMMERS: Oh, I got a $6,000 deductible -- HSA -- but I will meet that again in three months. So I'm at -- I think my wife said morning, at 4,800 or 4,900 bucks already this year in March to be able to meet my out-of-pocket. And so by the time April comes, I would have met that to be able to continue to do. And if there was one thing I probably could ask you about -- and my boy has got a rare disease, and I appreciate you talking about the rare [disease] community in your speeches -- is that if somebody has cancer or somebody has a rare disease or continues to have problems, why do we have to do a deductible every year?\n\nSo I’m sitting there at Christmas going, okay, my deductible has been met for six or eight months, and I’m going to turn around and have to do it again for the same disease, for the same symptoms, for the same everything.\n\nTHE PRESIDENT: That's interesting. Tom, could you answer that? That would be interesting.\n\nSECRETARY PRICE: It’s all about the risk and spreading the risk with insurance over a period of time. But it is a challenge for individuals with chronic disease, there’s no doubt about it.\n\nMR. SUMMERS: And I appreciate you even thinking about it and talking about grassroots, and when you're talking about all the people that we support with the farmers and ranchers, and the small-business people, and the people that are in manufacturing, our county is one of the largest manufacturing counties in the nation per capita. And Nucor would love to tell you thanks -- Nucor Steel would love to tell you thanks for everything you've been doing.\n\nTHE PRESIDENT: Nucor has been very good. It’s going to get better, too.\n\nMR. SUMMERS: And we've got a ton of those. The space program -- we used to make the shuttle boosters out of ATK Thiokal. And we’d love to have the space program. I got a really good friend.\n\nTHE PRESIDENT: Those days are gone, but they're coming back.\n\nMR. SUMMERS: I’ve got a friend that's going to go up in the next little bit, Lieutenant Commander Scott Maker Tingle, who is headed up on a spaceship from Russia. But he would love to come back to the United States and be able to go up through the United States. So all those jobs I know will come back with you.\n\nTHE PRESIDENT: Well, Gary Cohn, who is sitting right next to you, he’s a big believer in what you're saying -- right, Gary?\n\nMR. SUMMERS: If there’s anything we can do to help you, the counties are behind you. We can find you low-hanging fruit to be able to pick off that tree to help with jobs. Just let us know where we can help.\n\nTHE PRESIDENT: Good. Thank you, Stan.\n\nMR. SUMMERS: Thank you for your time.\n\nTHE PRESIDENT: Would you have anything to say, Tom, generally speaking?\n\nSECRETARY PRICE: Well, let me start, Mr. President -- really powerful about the consequences of the current law, and you hear people’s lives that have been affected in remarkably adverse ways that sometimes you don't think about as it relates to healthcare -- whether it’s businesses that haven’t been able to survive, or individuals who need to take three, four, five jobs; moms that can't be with their kids when they want. This is about real people. It’s about real patients.\n\nAnd so working with you and your leadership, we are really excited about the opportunity to put in place a patient-centered system where patients and families and doctors are making decisions, and not Washington, D.C.\n\nTHE PRESIDENT: What about the concept that -- and everybody knows it’s happening -- that Obamacare is imploding, that if we don't do anything, it’s not even going to be around in another year? The insurance companies are fleeing. But now it seems to be getting this wonderful press like it’s a wonderful thing, and it’s a horrible thing actually, and getting worse. And ’17 will be, by far, the worst year so far.\n\nSECRETARY PRICE: Yes.\n\nTHE PRESIDENT: Because a lot of things were put into ’17. But ’17 is going to be worse, and I assume ’18 will be worse even than ’17. So it’s essentially gone. How do you respond to that? Because I’ve been telling you, \"Why don't we wait? Just let it implode, and let’s not take the blame.\" I’ve been telling you that as an option. It’s not an option I like, frankly, but it’s certainly an option. How do you respond to that?\n\nSECRETARY PRICE: I think ’18 can be better if we implement the law and we utilize the regulatory process to make some --\n\nTHE PRESIDENT: Well, I’m not saying that. I’m saying, if we don't implement the law, what happens with Obamacare? What’s going on with Obamacare?\n\nSECRETARY PRICE: What you’ll see is a magnification of all these stories around this table: more businesses being harmed, more individuals not having the kind of income that they -- disposable income that they would use, more moms and dads not able to care for their kids in the way that they believe to be most appropriate, more people getting insurance but no care. This is about real people’s lives, and that's why it’s so important.\n\nTHE PRESIDENT: Getting insurance but not being able to use it because the deductibles are so high.\n\nSECRETARY PRICE: That's exactly right.\n\nTHE PRESIDENT: And you hear these stories where they're paying a fortune for insurance, and then you hear how high their deductible is. And unless they have a tragedy in their family, they're never going to be able to use it.\n\nSECRETARY PRICE: Yes, this fellow has to -- $13,000 before the insurance kicks in. That's what he has to pay -- $13,000.\n\nMR. SEIFE: That's like not having insurance.\n\nSECRETARY PRICE: That's like not having insurance.\n\nTHE PRESIDENT: Well, keep working it.\n\nMS. SERTICH: They're catastrophic plans now.\n\nSECRETARY PRICE: Exactly.\n\nTHE PRESIDENT: He’s been working very hard, and he’s doing a great job.\n\nMr. Vice President, do you have anything to say?\n\nTHE VICE PRESIDENT: Mr. President, I think what unequivocally these great Americans see in high relief is you're someone who puts people over politics. And I just want to thank all of them for coming, and in front of the national media, talking about the real world and impacts of Obamacare. You've said it consistently over the last two years that Obamacare has failed. But these people are emblematic of the Americans that Obamacare has failed. And I just am so grateful for their time, but so grateful for your compassionate leadership in driving the Congress and driving our nation toward better healthcare outcomes for them and better solutions built on those American principles of more consumer choices, more free market, but also, as you said, the caring for the most vulnerable by allowing our states to innovate and medicate in ways that will create even better healthcare coverage than they have today.\n\nTHE PRESIDENT: Thank you, Mike. Thank you, everybody. Thank you very much.\n\nQ Mr. President, do you have any message for those who are concerned about losing their insurance, whether it be Medicaid or higher costs (inaudible)?\n\nTHE PRESIDENT: It will get better. If we're allowed to do what we want to do, it will get better -- much better. Hopefully it will get very good.\n\nQ So will it take long?\n\nTHE PRESIDENT: It takes a period of time. Thank you, press.\n\nEND\n\n12:00 P.M. EDT", "images": ["https://web.archive.org/web/20170313220530im_/https://www.whitehouse.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "https://web.archive.org/web/20170313220530im_/https://www.whitehouse.gov/profiles/forall/modules/custom/gov_whitehouse_www/images/icons/wh_logo_seal.png"], "top_img": "https://web.archive.org/web/20170313220530im_/https://www.whitehouse.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170313220530/https://www.whitehouse.gov/the-press-office/2017/03/13/remarks-president-trump-listening-session-healthcare", "title": "Remarks by President Trump in a Listening Session on Healthcare", "meta_data": {"msapplication-square150x150logo": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-150x150.png", "msapplication-square70x70logo": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-wide310x150logo": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x150.png", "msapplication-square310x310logo": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x310.png", "msapplication-TileImage": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-TileColor": "#003C80", "msapplication-config": "https://www.whitehouse.gov/profiles/forall/themes/custom/fortyfour/browserconfig.xml", "application-name": "Whitehouse", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "whitehouse.gov", "type": "article", "title": "Remarks by President Trump in a Listening Session on Healthcare", "url": "https://web.archive.org/web/20170313220530/https://www.whitehouse.gov/the-press-office/2017/03/13/remarks-president-trump-listening-session-healthcare", "description": "Roosevelt Room 11:27 A.M. EDT", "updated_time": "2017-03-13T14:41:01-04:00", "image": {"identifier": "https://web.archive.org/web/20170313220530im_/https://www.whitehouse.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "secure_url": "https://www.whitehouse.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "type": "image/jpeg", "width": 240, "height": 240}}, "twitter": {"card": "summary", "site": "@WhiteHouse", "creator": "@WhiteHouse", "url": "https://web.archive.org/web/20170313220530im_/https://www.whitehouse.gov/the-press-office/2017/03/13/remarks-president-trump-listening-session-healthcare", "title": "Remarks by President Trump in a Listening Session on Healthcare", "image": {"width": 240, "src": "https://www.whitehouse.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "height": 240}}, "article": {"published_time": "2017-03-13T14:09:00-04:00", "modified_time": "2017-03-13T14:41:01-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width"}, "movies": [], "publish_date": 1489334400.0, "source": "https://web.archive.org", "summary": ""}