{"url": "https://www.usatoday.com/story/money/business/2017/10/24/bill-oreilly-mad-god-sexual-harassment-report/795331001/", "text": "Former Fox News host Bill O'Reilly is angrily denying a report that he paid one woman $32 million to settle sexual harassment allegations, blaming a conspiracy to drive him from \"the marketplace\" and even raging against the Almighty.\n\n\"You know, am I mad at God? Yeah, I'm mad at him,\" O'Reilly said Monday in a post on his website. \"I wish I had more protection. I wish this stuff didn't happen. I can't explain it to you. If I die tomorrow and I get an opportunity, I'll say 'why'd you guys work me over like that? Didn't know my children were going to be punished? And they're innocent.'\"\n\nThe New York Times reported Saturday that O'Reilly paid $32 million to Lis Wiehl, a Fox News legal analyst who made regular appearances on O'Reilly's show for 15 years, in a settlement related to sexual harassment allegations. Wiehl accused O'Reilly of \"repeated harassment, a nonconsensual sexual relationship and the sending of gay pornography and other sexually explicit material to her,\" the Times reported, citing two people briefed on the matter.\n\nOn his website, O'Reilly denounced the report as a \"smear piece\" and said \"these people at the New York Times are out to hurt people with whom they disagree. They don't want me in the marketplace. That's what this is all about.\"\n\nMore:Bill O'Reilly dismisses NYT report as 'lies and smears'\n\nMore:Megyn Kelly complained to Fox execs about Bill O'Reilly's sexual harassment stand\n\nIn April, the Times reported on five other settlements involving O'Reilly and women accusing him of sexual harassment. The revelation led to Fox News' decision to part ways with its star commentator.\n\nOn Monday, O'Reilly said that in more than 20 years he only \"resolved three situations\" and that he did it \"to protect my children from harm.\"\n\nO'Reilly has repeatedly said the potential impact on his children is a major reason for his outrage over the Times report.\n\n\"The pain it brings to my children is indescribable,\" O'Reilly told the Times when it interviewed him about the reported $32 million settlement. \"I would give up my life to protect my children, but I find myself unable to protect them because of things that are being said about me, their father.\"\n\n\"This is horrible what I went through, horrible what my family went through,\" he continued. O'Reilly said the report was \"politically and financially motivated\" and that he could \"prove it with shocking information but I'm not going to sit here in a courtroom for a year and a half and let my kids get beaten up every single day of their lives by a tabloid press.\"\n\nO'Reilly invoked the memory of his former Fox News colleague Eric Bolling's son, 19-year-old Eric Chase Bolling, who was found dead in an apartment while away at college. Fox News had just parted ways with Bolling amid sexual harassment allegations when his son died and O'Reilly seemed to say that was behind the teen's death.\n\n\"I urge you to think about what you put in your newspaper,\" O'Reilly told the Times reporters. \"Eric Bolling's son is dead. Is dead, because of allegations made, in my opinion — and I know this to be true — against Mr. Bolling.\"\n\nSeparately, Bolling said in a statement that O'Reilly's comment was \"beyond inappropriate\" and that his \"parting from Fox News was in no way connected to the tragic news of my son's passing.\"\n\nO'Reilly apologized to Bolling in a tweet. \"The message I tried to send was that allegations harm kids. Nothing more,\" O'Reilly tweeted.\n\n\"Thank Bill, apology accepted,\" Bolling tweeted back.\n\nO'Reilly, on his website, said the Times doesn't care about children and is willing to run a story based on anonymous sources even though \"families are devastated.\"\n\n\"So and so said, so and so told me,\" O'Reilly said of the use of unnamed sources. \"That's what they do to Trump every day and that's why Trump is furious. That's why the President of the United States calls out The New York Times by name. But the culture war is that intense.\"\n\n\"Bottom line on this is that my enemies who want to silence me have made my life extremely difficult,\" he said.\n\nMore:Bill O'Reilly ousted at Fox after sexual harassment investigation\n\nMore:Famous and infamous moments from Bill O'Reilly's career", "images": ["https://www.gannett-cdn.com/-mm-/3259204495e36bf2dfcf1f2f0401b53b675e72c0/c=0-159-2690-1679/local/-/media/2017/10/24/USATODAY/USATODAY/636444563326077111-XXX-IMG-AP-TV-FOX-O-REILLY-A-1-1-PBJ942JS-92987351.JPG?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/3259204495e36bf2dfcf1f2f0401b53b675e72c0/c=0-159-2690-1679/local/-/media/2017/10/24/USATODAY/USATODAY/636444563326077111-XXX-IMG-AP-TV-FOX-O-REILLY-A-1-1-PBJ942JS-92987351.JPG?width=2690&height=1520&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5623455283001_5623454390001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/3259204495e36bf2dfcf1f2f0401b53b675e72c0/c=0-159-2690-1679/local/-/media/2017/10/24/USATODAY/USATODAY/636444563326077111-XXX-IMG-AP-TV-FOX-O-REILLY-A-1-1-PBJ942JS-92987351.JPG?width=2690&height=1520&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/money/business/2017/10/24/bill-oreilly-mad-god-sexual-harassment-report/795331001/", "title": "Bill O'Reilly is 'mad at God' for sexual harassment scandal", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Bill O'Reilly is 'mad at God' for sexual harassment scandal", "description": "The former Fox News host is feeling forsaken.", "url": "https://www.usatoday.com/story/money/business/2017/10/24/bill-oreilly-mad-god-sexual-harassment-report/795331001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/3259204495e36bf2dfcf1f2f0401b53b675e72c0/c=0-159-2690-1679/local/-/media/2017/10/24/USATODAY/USATODAY/636444563326077111-XXX-IMG-AP-TV-FOX-O-REILLY-A-1-1-PBJ942JS-92987351.JPG?width=2690&height=1520&fit=crop&format=pjpg&auto=webp", "width": 2690, "height": 1520}, "type": "article"}, "article": {"author": "William Cummings", "content_tier": "free", "opinion": "false"}, "description": "The former Fox News host is feeling forsaken.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/3259204495e36bf2dfcf1f2f0401b53b675e72c0/c=0-159-2690-1679/local/-/media/2017/10/24/USATODAY/USATODAY/636444563326077111-XXX-IMG-AP-TV-FOX-O-REILLY-A-1-1-PBJ942JS-92987351.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Bill O'Reilly is 'mad at God' for sexual harassment scandal", "description": "The former Fox News host is feeling forsaken."}}, "movies": [], "publish_date": 1508774400.0, "source": "https://www.usatoday.com", "summary": ""}