{"url": "https://en.wikipedia.org/wiki/Dear_White_People_(TV_series)", "text": "American satirical comedy-drama television series\n\nDear White People is an American comedy-drama television series on Netflix that follows several black college students at an Ivy League institution, touching on issues surrounding modern American race relations. It is based on the 2014 film of the same name.[1] The film's writer and director, Justin Simien, returned to write and direct episodes of the series.[2] This series stars Logan Browning, Brandon P. Bell, DeRon Horton and Antoinette Robertson. Each episode focuses on a particular character, except for the finale. Netflix ordered ten 30-minute episodes and the first season was released on April 28, 2017.[3][4] On June 30, 2017, Netflix renewed the series for a second season which premiered on May 4, 2018.[5][6] On June 21, 2018, the series was renewed for a third season which was released on August 2, 2019.[7][8] On October 2, 2019, the series was renewed for its fourth and final season, set to premiere in 2020.[9]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nTessa Thompson (two episodes) as Rikki Carter.\n\nTyler James Williams (two episodes) as Carson Rhodes.\n\nBrandon Alter (one episode) as George. Alter reprises his role from the film.\n\nWendy Raquel Robinson (two episodes) as Tina White.\n\nEpisodes [ edit ]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally released Volume 1 10 April 28, 2017 ( ) Volume 2 10 May 4, 2018 ( ) Volume 3 10 August 2, 2019 ( )\n\nVolume 1 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Featured character(s) Original release date 1 1 \"Chapter I\" Justin Simien Justin Simien Samantha April 28, 2017 ( ) Samantha White films a \"Dear Black People\" party hosted by Pastiche, a student magazine group hosted by white students. Holding a black student caucus to discuss the matter, when her friends learn she is dating Gabe, a white student and the teaching assistant from her class. The fellow black students start losing faith in her awareness and she is torn about what to do. Lionel talks to her, and tells her he has the truth of who really invited the DBP partygoers. After her radio show was replaced, Samantha barges into the studio and rants on-air about the racism on campus, confessing to hacking into the Pastiche account to send invites to prove something; she also apologizes to Gabe. 2 2 \"Chapter II\" Justin Simien Justin Simien Lionel April 28, 2017 ( ) A timid Lionel learned of Pastiche's Dear Black People party from a randomized invitation, and informed the other Black Student Groups, who shut it down. After writing the article about the party, his Editor points out the flaws of his piece but had it front page because it would sell; encouraging Lionel to find more to the story and improve upon what he already found out. This leads Lionel to following breadcrumbs, which proves Samantha hacked Pastiche's account to send invites; Lionel secretly forewarns Sam, who then confesses on the school radio. Getting a haircut from roommate Troy, Lionel opens up that he's gay. 3 3 \"Chapter III\" Tina Mabry Chuck Hayward Troy April 28, 2017 ( ) Troy Fairbanks, son of the Dean, is running for student body president. While Troy is at a donors party, Lionel texts him about the Dear Black People party. Seeing this, Troy has the campus police peacefully shut it down. Troy brings Lionel along to see his campaign trail, and Kurt (Pastiche's Editor) asks Troy for help to get people to stop hating him, but is brushed off. After Troy spends the night with Professor Neika Hobba, come morning he won the election. At his dorm, Troy receives blackmail from Kurt, forcing his hand. Meanwhile, star running back Thane Lockwood dies at a party. 4 4 \"Chapter IV\" Tina Mabry Njeri Brown Coco April 28, 2017 ( ) In flashbacks, Coco and Samantha had a starting friendship which broke apart from differing ideas on their social groups; Samantha joined BSU while Coco joined and left a sorority. When trying to get with Troy, Coco finds he was dating Samantha at the time. Today, Colandrea \"Coco\" Conners identifies the least with black identity compared to Samantha, and even defends the Dear Black People party. Confronting Samantha at her radio booth, Coco points out her academic leniency is because she looks more white than herself, whereas she would have been more punished. At the Pegasus Party, Coco gleefully locks out the Sorority leaders she once tried to impress. 5 5 \"Chapter V\" Barry Jenkins Chuck Hayward & Jack Moore Reggie April 28, 2017 ( ) Reggie creates an app to measure how woke someone is, secretly to impress Samantha, now needing an investor. At Thane's memorial with Al, Rashid and Joelle, they make a new friend in an Asian girl called Ikumi. After seeing a low-quality movie with Lionel, the group point out the racial stereotypes in cinema. Having a late dinner, Joelle and Reggie argue over Reggie's cyberstalking Samantha, but resolve it by going to a party at Addison's house. When Addison repeats the N word from a rap song, a drunk Reggie calls him out on it and begins an argument; with Kurt fueling matters. When someone bumps Reggie into Addison, cops arrive just then and demand to see ID. As Reggie refuses, the cops draw arms on him, forcing compliance. After seeing Reggie's ID, everyone is told to leave, leaving Reggie traumatized. 6 6 \"Chapter VI\" Steven Tsuchida Leann Bowen Samantha April 28, 2017 ( ) Samantha berates campus police for drawing a gun on Reggie at the party, while the BSU have a heated debate over campus police and how to make a change. Al calls for the snitch who called the cops found, while Coco calls for managing 'blackness' having grown up in Chicago. Kurt approaches Samantha for something to stop the racial tension, but is shot down. Reggie misses his appointment with the Dean about the matter, so Samantha organizes a blockade of the Student Pep Rally. By meeting Gabe's friends for coffee, Samantha is reminded that the reason Reggie missed his meeting is because he has been made a public victim. After tracking Reggie down, they go to an open mic cafe where Reggie reads his poetry about that experience. Heading home, Reggie opens up about how he sees greatness in Samantha. 7 7 \"Chapter VII\" Nisha Ganatra Jack Moore Gabe April 28, 2017 ( ) Gabe goes to Samantha's room to check on her after the Pep Rally blockade fails. Samantha tells him she was taking care or Reggie, and that causes Gabe to suspect something happened between the two. At the next black student caucus Troy announces that a town hall will be held on the issue, which the BSU is quick to call for it to be protested not only by black students, but by all marginalised groups on campus. Joelle and Gabe are tasked with gathering support from these groups and along the way he asks her for advice regarding his doubts with Samantha. Gabe then admits to calling the cops at the Addison party to Joelle. The next morning the Independent releases the audio of Gabe's 911 call which Samantha, as well as the rest of the black students take badly and Gabe no longer welcome with them. 8 8 \"Chapter VIII\" Charlie McDowell Nastaran Dibai Lionel April 28, 2017 ( ) 9 9 \"Chapter IX\" Nisha Ganatra Chuck Hayward & Jack Moore Coco April 28, 2017 ( ) 10 10 \"Chapter X\" Justin Simien Justin Simien none April 28, 2017 ( )\n\nVolume 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Featured character(s) Original release date 11 1 \"Chapter I\" Justin Simien Justin Simien Samantha May 4, 2018 ( ) 12 2 \"Chapter II\" Kevin Bray Chuck Hayward Reggie May 4, 2018 ( ) Reggie suffers flashbacks from being held at gunpoint by campus police (who assumed he \"didn't belong\" at university until a white student intervened to \"vouch\" for him). Support comes from an unexpected figure. 13 3 \"Chapter III\" Charlie McDowell Justin Simien Lionel May 4, 2018 ( ) Lionel party-hops with Silvio and discovers a new friend, Wesley. 14 4 \"Chapter IV\" Kimberly Peirce Njeri Brown Coco May 4, 2018 ( ) CoCo makes a life-changing decision, with the support of an unexpected friend. 15 5 \"Chapter V\" Salli Richardson-Whitfield Leann Bowen Joelle May 4, 2018 ( ) Joelle meets her competitor for top-grade in anatomy and they're not at all what she expected. 16 6 \"Chapter VI\" Justin Simien Jack Moore & Chuck Hayward Lionel May 4, 2018 ( ) Lionel must juggle his personal life and faux-professional obligations while helping Brooke hunt down the mysterious alt-right internet troll. All they find is the shocking fate of Sorbet, Kelsey's stolen medically prescribed comfort dog, but the evening holds a few more surprises for Lionel. 17 7 \"Chapter VII\" Steven Tsuchida Yvette Lee Bowser & Nastaran Dibai Troy May 4, 2018 ( ) Troy finds his voice, comedic and otherwise, by partially confronting the pain he's caused others – Reggie, Sam and Coco. 18 8 \"Chapter VIII\" Justin Simien Jack Moore Gabe May 4, 2018 ( ) Gabe interviews Sam for his documentary film, \"Am I racist?\" Feelings simmer as the former lovers engage in personal and heated discussion about the fine line between using white privilege to dismantle white supremacy and the self-aggrandizement of the white savior complex. What does their passionate exchange and bad news for Sam entail for their relationship? 19 9 \"Chapter IX\" Janicza Bravo Nastaran Dibai & Yvette Lee Bowser Samantha May 4, 2018 ( ) Sam, Joelle and Coco drive to Sam's childhood home in the suburbs for an event that brings the whole family together. Sam confronts her mother, Tina, about withholding information. Mother and daughter reconcile over a letter, while Joelle and Coco reconcile over cosmetics. 20 10 \"Chapter X\" Justin Simien Njeri Brown & Justin Simien none May 4, 2018 ( ) As Rikki Carter arrives on campus, Reggie and Joelle finally come to an agreement over their relationship, prompting Sam and Gabe to reach an accord as well. Sam's confrontation with Rikki doesn't go as planned, but thanks to Coco and her most unexpected of allies, neither does Rikki's speech. Lionel and Sam try and join the mysterious Order of X.\n\nVolume 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Featured character(s) Original release date 21 1 \"Chapter I\" Justin Simien Jack Moore Al August 2, 2019 ( ) 22 2 \"Chapter II\" Marta Cunningham Leann Bowen Joelle August 2, 2019 ( ) 23 3 \"Chapter III\" Kimberly Peirce Justin Simien Samantha August 2, 2019 ( ) 24 4 \"Chapter IV\" Justin Tipping Chuck Hayward Troy August 2, 2019 ( ) 25 5 \"Chapter V\" Cheryl Dunye Nastaran Dibai Coco August 2, 2019 ( ) 26 6 \"Chapter VI\" Steven Tsuchida Chuck Hayward & Jack Moore Gabe August 2, 2019 ( ) 27 7 \"Chapter VII\" Tiffany Johnson Leann Bowen & Steven J. Kung Lionel August 2, 2019 ( ) 28 8 \"Chapter VIII\" Sam Bailey Njeri Brown Brooke August 2, 2019 ( ) 29 9 \"Chapter IX\" Salli Richardson-Whitfield Njeri Brown & Nastaran Dibai none August 2, 2019 ( ) 30 10 \"Chapter X\" Justin Simien Justin Simien Reggie August 2, 2019 ( )\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe first two seasons of the series have been released to critical acclaim. On Rotten Tomatoes, season one has a \"Certified Fresh\" 98% approval rating based on 55 reviews from critics, with an average rating of 8.69/10. The site's critical consensus reads, \"Timely, provocative, and sharply written, Dear White People is an entertaining blend of social commentary and incisive humor.\"[16] On Metacritic, the season has a weighted average score of 85 out of 100, based on 21 reviews, indicating \"universal acclaim\".[17]\n\nOn Rotten Tomatoes, season two holds an approval rating of 100% based on 32 reviews from critics, with an average rating of 9.35/10. The site's critical consensus reads, \"Dear White People's endearing excellence returns, but with an added layer of emotional maturity that enhances the show's powerful, relevant meditations on race relations in America.\"[18] On Metacritic, the second season has a score of 89 out of 100, based on 7 reviews, indicating \"universal acclaim\".[19]\n\nThe third season has a 90% approval rating on Rotten Tomatoes, based on 20 reviews, with an average rating of 7.25/10.[20] On Metacritic, the third season has a score of 78 out of 100, based on 8 critics, indicating \"generally favorable reviews\".[21]\n\nPeter Debruge, writing for Variety, praised the show's writing, directing, social commentary, and cast.[22] The New York Times praised the show's examination of concerns such as appropriation, assimilation, and conflict.[23]\n\nControversy [ edit ]\n\nThe initial trailer for the TV show attracted some angry responses, with the series being accused by some Twitter users of being racist towards white people; they called for a boycott of Netflix.[24][25][26] The YouTube trailer for the series received more dislikes than likes,[27][28] with RT observing a 10:1 ratio of dislikes-to-likes as of February 11, 2017.[29] Series creator Justin Simien responded positively to the backlash, saying it reiterated the point of the series, and brought more attention to it as well.[30] Lead actress Logan Browning noted that many of the critics who have given the show rave reviews are white.[25]\n\nAccolades [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6c/Wiki_letter_w.svg/20px-Wiki_letter_w.svg.png", "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Dear_White_People_Netflix.png/250px-Dear_White_People_Netflix.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dear_White_People_(TV_series)", "title": "Dear White People (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}