{"url": "www.inquisitr.com/4763486/hassan-jameel-is-reportedly-worried-that-chris-brown-might-win-rihanna-back/", "text": "Rihanna and Hassan Jameel made headlines in June 2017 when they were photographed making out in a pool at a private villa in Spain. Fans believed at first that the guy was a Spanish footballer, but he turned out to be a Saudi billionaire. He is the deputy president and vice chairman of Abdul Latif Jameel, one of the largest companies in the world. The Barbadian singer was in an on-and-off relationship with Chris Brown, 28, and it looks like her new beau fears that the “With You” singer might win her back.\n\nA source close to Rihanna, 29, recently told Hollywood Life that Jameel is worried that Brown keeps “lurking in her past” and is being unpredictable. Although RiRi has opened up to her new beau about her past, the Toyota heir is still concerned that Breezy can still win her back. He feels uncomfortable with the idea that the “Kiss Kiss” singer still loves her and might be able to take her back from him anytime.\n\nHowever, a separate source previously told the same news outlet that Rihanna hopes that the well-heeled Saudi Arabian can help her forget her dark past with Chris Brown. Now, fans are convinced that she has moved on gracefully from Breezy. The “Umbrella” singer recently stepped out with her new flame Hassan Jameel at the Grammys despite keeping their relationship under wraps.\n\n“He feels like Chris is capable of trying anything to win her back and that has him feeling uneasy. Hassan tries not to worry about Chris, but knowing he may still love Rihanna makes him feel a bit tense.”\n\nstay pressed. A post shared by badgalriri (@badgalriri) on Jan 28, 2018 at 2:10pm PST\n\nAlthough they also attended the Grammys after-party in New York City, the couple still tried to keep it low-key. They were spotted leaving the club separately, with Rihanna exiting the club right after Jameel had left.\n\nFollowing her performance at the Grammys, some fans suggested that Rihanna is pregnant with Jameel’s baby as her tight outfit appears to have shown a tiny baby bump. However, another insider also told Hollywood Life that the Barbadian singer is not pregnant, and is not trying to get pregnant either. The source went on to say that RiRi believes her new boyfriend. who is worth $1.5 billion, would make a good father.\n\nHowever, Rihanna is still focused on her career at this time and has not even met the Toyota heir’s family just yet.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/01/Rihanna.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/debbc688a76131112f08c65ac894f55f?s=250&d=mm&r=g"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Coco Dollanganger"], "canonical_link": "https://www.inquisitr.com/4763486/hassan-jameel-is-reportedly-worried-that-chris-brown-might-win-rihanna-back/", "title": "Hassan Jameel Is Reportedly Worried That Chris Brown Might Win Rihanna Back", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}