{"url": "https://abc7news.com/society/covfefe-beyonces-twins-and-more-moments-that-broke-the-internet-/4649453/", "text": "In 2014, the internet fell for 'hot felon' Jeremy Meek's mugshot. Meeks later signed to a modeling agency and has since worked around the world. Stockton County Sheriff's Department; Jacopo Raule/Getty Images\n\nA screenshot of a now-deleted tweet shows President Donald Trump's use of 'covfefe' in an apparent typo. @RealDonaldTrump/Twitter via Storyful\n\nWho can figure out the true meaning of \"covfefe\" ??? Enjoy! — Donald J. Trump (@realDonaldTrump) May 31, 2017\n\nRemember yanny and laurel? Beyonce's pregnancy? Covfefe? They were all moments that broke the internet, uniting the world in awe, happiness or confusion.Though some of those stories break literal records, others break the internet in a broader, metaphorical sense, dominating news feeds and the cultural conversation for days if not weeks. Here's a look at eight such moments that made their way to the stratosphere.Everybody stopped what they were doing on Feb. 26, 2015, to weigh in on a dress shared in a viral tweet that looked gold and white to some and blue and black to others. The dress pictured in the close-up photo was actually a blue and black bandage dress with lace and mesh detailing from British retailer Roman Originals.It's still not entirely clear why people saw the dress differently; Roman Originals said scientists are still investigating the phenomenon and have published multiple peer-reviewed journal articles about the garment.On social media, the debate spawned 7.6 million tweets and a surge in traffic to Roman Originals' site. The retailer sold out of the original black and gold dress in 34 minutes and eventually sold a white and gold version in support of British charity Comic Relief.For several weeks in the spring of 2017, all eyes were on April, a very pregnant giraffe. Animal Adventure Park in Harpursville, New York, set up a live-streaming camera in April's habitat and encouraged viewers at home to watch as she inched closer and closer to giving birth.After what felt like a very prolonged pregnancy, April gave birth to calf Tajiri on April 15, 2017. The world was fascinated, and the live stream garnered more than 232 million live views on YouTube over a seven-week period.The world wide web came to a grinding halt in May 2018 when a bizarre recording of the word \"laurel\" split the internet into two. While some heard the word \"laurel,\" others clearly heard \"yanny,\" and nobody could agree on who was right.As it turns out, the audio clip was from an online dictionary entry, and the differing interpretations of the clip all had to do with how the brain interprets sound frequencies.What the Stockton Police Department probably thought was a routine news release about a recent arrest took on a life of its own in June 2014 when the internet fell for one inmate's chiseled jaw and piercing eyes. Jeremy Meeks, 30, was arrested on a weapons charge as part of a larger sting operation, and he quickly became known as the \"hot felon\" as his mugshot was circulated widely around the internet.While a brush with the law is never a good thing, the attention eventually paid off for Meeks, who signed to a modeling agency and has been spotted on catwalks around the world since his release.When Beyonce makes an announcement, the world stops to listen, and her early morning pregnancy announcement was no different. Pregnant with twins, Queen Bey posted a photo to Instagram in the wee hours of February 1, 2017, announcing that the Carter-Knowles family was \"blessed two times over\" and would be growing their family by two.The announcement post earned more than 11 million likes, making it one of the most-liked Instagram posts of all time.President Donald Trump's tweets are often controversial, but the internet was united in confusion by the president's May 31, 2017, tweet: \"Despite the constant negative press covfefe\"Though some guessed that Trump, who is no stranger to a Twitter typo, was trying to make a point about \"negative press coverage,\" he never directly clarified his comment and eventually deleted the tweet. The word, though, became a catchphrase of sorts that spawned T-shirts, hashtags and even a license plate.The baffling term even lent its name to a legislative proposal from U.S. Rep Mike Quigley, D-Ill. If enacted, the COVFEFE Act (Communications Over Various Feeds Electronically for Engagement Act) would have required the National Archives to keep records of the president's tweets.\"Who can figure out the true meaning of 'covfefe' ??? Enjoy!\" Trump later teased on Twitter.It might not have been the first moment that broke the internet, but Kim Kardashian bearing all on the cover of Paper magazine was the one that really brought it home and brought the phrase \"break the internet\" into the public lexicon. The magazine unveiled two covers shot by Jean-Paul Goude that feature the reality star, including one where Kardashian bared all.In the second photo, a recreation Goude's \"Champagne Incident\" photograph from the 1960s, Kardashian is popping open a bottle of champagne that has fountained over her head and into a glass balanced on her derriere.Over the summer of 2014, it was nearly impossible to scroll through your Facebook or Twitter feeds without seeing videos of your friends dumping ice water on their heads for a good cause. It was all part of the ALS Ice Bucket Challenge, which dared users to film themselves dumping ice water over their heads or make a donation to support ALS research. After dumping or donating, users had to nominate three friends to participate, and the challenge spread widely across social media in a matter of weeks. Four years later , the ALS Association said the challenge had racked up 17 million participants and raised $115 million to fund research efforts.", "images": ["https://cdn.abcotvs.com/dip/images/4709243_111718-cc-internet-breaking-moments-img.jpg?w=1600", "https://cdn.abcotvs.com/dip/images/4650206_110818-cc-storyful-covfefe-tweet-img", "https://www.facebook.com/tr?id=443456229787972&ev=PageView&noscript=1", "https://cdn.abcotvs.com/dip/images/4650197_110818-cc-hot-felon-jeremy-meeks-img.jpg", "https://cdn.abcotvs.com/dip/images/6082845_040620-kgo-chalkwalk-redo-2-img_Image_00-00-29,04.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/6103915_041420-kgo-ov-coronavirus-lacrosse-cj-vid.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/6091434_040920-kgo-ov-LVRESTAURANT-cj--21-img0.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.net/abcotv/static/kgo/logos/kgo_logo_2x.png", "https://cdn.abcotvs.com/dip/images/6112138_041720-kgo-ov-shutdownart-cj-21-img0.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/6112478_041720-kgo-robert-jacqueline-lentz-img_Image_00-00-11,14.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/6076538_040420-cc-ap-facemask-public-img.jpg?w=630&r=16%3A9", "https://cdn.abcotvs.com/dip/images/6111844_041720-cc-covid-help-main-img.jpg?w=630&r=16%3A9"], "top_img": "https://cdn.abcotvs.com/dip/images/4709243_111718-cc-internet-breaking-moments-img.jpg?w=1600", "keywords": [], "authors": [], "canonical_link": "https://abc7news.com/break-the-internet-ralph-breaks-kim-kardashian-paper-magazine/4649453/", "title": "Yanny vs. Laurel, 'covfefe', Beyonce's twins and more moments that broke the internet", "meta_data": {"description": "Remember yanny and laurel? Beyonce's pregnancy? Covfefe? They were all moments that broke the internet, uniting the world in awe, happiness or confusion.", "keywords": "break the internet, ralph breaks the internet, kim kardashian, paper magazine, kim k cover, the dress, what color is the dress, roman originals, jeremy meeks, hot felon, yanny vs laurel, yanny, laurel, beyonce, beyonce pregnant, covfefe, trump, april the giraffe, ALS ice bucket challenge", "tags": "whats-trending,als,social-media,kim-kardashian,president-barack-obama,internet,entertainment,viral-video,buzzworthy,beyonce,facebook,us-world,big-talkers,twitter,instagram,president-donald-trump,ice-bucket-challenge,ralph-breaks-the-internet", "apple-itunes-app": "app-id=407314068, affiliate-data=ct=kgo-smart-banner&pt=302756, app-argument=https://abc7news.com/story/4649453", "fb": {"app_id": 479764485457445, "pages": 57427307078}, "og": {"site_name": "ABC7 San Francisco", "url": "https://abc7news.com/4649453/", "title": "Yanny vs. Laurel, 'covfefe', Beyonce's twins and more moments that broke the internet", "description": "Remember yanny and laurel? Beyonce's pregnancy? Covfefe? They were all moments that broke the internet, uniting the world in awe, happiness or confusion.", "image": "https://cdn.abcotvs.com/dip/images/4709243_111718-cc-internet-breaking-moments-img.jpg?w=1600", "type": "article", "locale": "en_US"}, "twitter": {"site": "@abc7newsbayarea", "creator": "@abc7newsbayarea", "url": "https://abc7news.com/4649453/", "title": "Yanny vs. Laurel, 'covfefe', Beyonce's twins and more moments that broke the internet", "description": "Remember yanny and laurel? Beyonce's pregnancy? Covfefe? They were all moments that broke the internet, uniting the world in awe, happiness or confusion.", "card": "summary_large_image", "image": "https://cdn.abcotvs.com/dip/images/4709243_111718-cc-internet-breaking-moments-img.jpg?w=1600", "app": {"name": {"iphone": "kgo", "googleplay": "kgo"}, "id": {"iphone": 407314068, "googleplay": "com.abclocal.kgo.news"}}}, "article": {"published_time": "2018-11-21T18:14:07.000Z", "modified_time": "2018-11-21T18:14:07.000Z", "section": "society"}, "title": "Yanny vs. Laurel, 'covfefe', Beyonce's twins and more moments that broke the internet", "medium": "website", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "robots": "NOODP,NOYDIR"}, "movies": [], "publish_date": 1542824047.0, "source": "https://abc7news.com", "summary": ""}