{"url": "https://stayglam.com/life/couples-halloween-costumes/", "text": "Attending Halloween celebrations with your other half? Then consider a couples Halloween costume. There are so many amazing costumes that can involve the both of you. Some match and some aren’t complete without each other. We love these costumes and think you will too, so we have found 45 of the most genius couples Halloween costumes. There is something for everyone, from costumes inspired by TV shows to classics like clowns. Take a look and get inspired!\n\n1. Scary Couples Halloween Costume\n\nThe first costume idea we have for you is this scary clown couple. This pair have created scary circus clown inspired makeup, complete with outfits. Costumes like these will be a hit at any party and you will look spooky together and apart. Recreate this look or create your own terrifying or nice clown costumes.\n\n2. Barbie and Ken Couples Halloween Costume\n\nAre you a Barbie girl, in a Barbie world? Then this next costume idea is for you. These two have dressed up as one of the most iconic couples – Barbie and Ken. This is such a fun idea since they have given the costumes a Halloween twist by adding fake blood. Create outfits similar to these, or try your own stylish and spooky ideas.\n\n3. Medusa and Stone Statue\n\nOur next costume idea was inspired by Greek mythology. Here we have Medusa and a stone statue. Medusa was a mythical monster who had the power to turn people to stone when they looked at her. This couple features Medusa and the unfortunate person who looked at her face. This is a fun and unique costume idea that would be amazing for a Halloween party.\n\n4. Little Red Riding Hood and the Wolf\n\nNext, we have a costume idea inspired by the fairy tale Little Red Riding Hood. One has dressed up as Red Riding Hood and the other is the wolf. The couple have given the costume a Halloween twist by adding claw marks. You can recreate it with or without the fake blood. Either way, this couples Halloween costume will be a hit!\n\n5. Zombie Trash Family\n\nLooking for a fun and unique couple’s costume? Then this is the idea for you. These two have dressed up as family called zombie trash. A costume like this is perfect for the couple who like to have a laugh and a joke. It is a costume that allows you both to join in with Halloween, but not take the costume too seriously.\n\n6. Ventriloquist and Dummy\n\nVentriloquist dummies are known to be super creepy so it is no surprise that they have inspired many Halloween costumes. This next couple have created an awesome costume where one is the dummy and the other is the ventriloquist. You can recreate doll makeup like featured or go for even a more a scarier look with fake blood and colored contact lenses.\n\n7. Bonnie and Clyde\n\nNext, we have Halloween costume idea inspired by Bonnie and Clyde. Bonnie and Clyde were a gangster couple in the 1930’s and their story has since been turned into movies and musicals. These two have created a couples Halloween costume based on their look. It is a cool idea that has some history to it too. Also, the costume is super easy to put together.\n\n8. Stranger Things Couples Halloween Costume\n\nStranger Things is a super popular TV show and many have chosen this show as inspiration for their Halloween costumes. These two have dressed up as two different versions of the character Eleven. You can recreate something similar to this or choose two other characters. This costume is unique and creative – we love it!\n\n9. The Sims\n\nAnyone who is a fan of the game The Sims will love this next idea. These two have created a Sims couple’s costume. Their costumes are complete with a plumbob (green diamond above the head) and mouse cursor. You can wear any outfit for this costume, but The Sims do have expansion packs like Vampires, so this would be perfect for Halloween.\n\n10. Skeleton Couple Costume\n\nSkeletons are very popular costumes for Halloween. If you have already done the spooky and scary costumes, why not go for something unique and sparkly like these two?! They have cool skull makeup complete with gems and stylish outfits. A costume idea like this is perfect for the trendy couples that want to fit in with Halloween, but also look fashionable.", "images": ["https://stayglam.com/wp-content/uploads/2018/08/Stylish-Skeletons.jpg", "https://stayglam.com/wp-content/themes/braxton/images/search-icon.png", "https://stayglam.com/wp-content/uploads/2016/02/STAYGLAM-BOLD3bproba.png", "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes-1.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Stranger-Things.jpg", "https://www.facebook.com/tr?id=105966443082349&ev=PageView&noscript=1", "https://stayglam.com/wp-content/uploads/2018/08/Little-Red-Riding-Hood-and-the-Wolf.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Barbie-and-Ken.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Ventriloquist-and-Dummy.jpg", "https://stayglam.com/wp-content/uploads/2018/08/The-Sims.jpg", "https://stayglam.com/wp-content/uploads/2014/05/logofooter.png", "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes-400x242.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Medusa-and-Stone-Statue.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Bonnie-and-Clyde.jpg", "https://www.facebook.com/tr?ev=6028025184758&cd[value]=0.00&cd[currency]=USD&noscript=1", "https://stayglam.com/wp-content/uploads/2018/08/Scary-Clowns.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Zombie-Trash-Family.jpg"], "top_img": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes-400x242.jpg", "keywords": [], "authors": ["Rebecca Puttock"], "canonical_link": "https://stayglam.com/life/couples-halloween-costumes/", "title": "45 Genius Couples Halloween Costumes", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0", "og": {"image": {"identifier": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "secure_url": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "width": 660, "height": 400}, "locale": "en_US", "type": "article", "title": "45 Genius Couples Halloween Costumes | StayGlam", "description": "Attending Halloween celebrations with your other half? You're in the right place! Here are our favorite couples Halloween costumes for you and your partner.", "url": "https://stayglam.com/life/couples-halloween-costumes/", "site_name": "StayGlam", "updated_time": "2019-08-20T11:32:49+00:00"}, "p": {"domain_verify": "6ba5e5b4f04ab41ed422be1d1128aaa9"}, "description": "Attending Halloween celebrations with your other half? You're in the right place! Here are our favorite couples Halloween costumes for you and your partner.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "article": {"publisher": "https://www.facebook.com/stayglamcom", "section": "Lifestyle", "published_time": "2018-08-25T12:00:35+00:00", "modified_time": "2019-08-20T11:32:49+00:00"}, "fb": {"app_id": 1592630844329512}, "google-site-verification": "b_fJUocqEEVH_T9GVeTH00GjqIF6hv-Qy0oRxEwqHjk"}, "movies": [], "publish_date": 1535198435.0, "source": "https://stayglam.com", "summary": ""}