{"url": "variety.com/2018/politics/features/caitlyn-jenner-trans-rights-advocate-1202896320/", "text": "Caitlyn Jenner lives on the outer edges of Malibu, up a winding, tree-lined road leading to a modern mountaintop home. Her yellow Labrador, Bertha, happily skips across the white tile floors of her living room. The kitchen is pristine, with a refrigerator stocked with bottles of water and a counter holding a platter of chocolate-chip cookies and a bowl of M&Ms.\n\nThe world’s most famous transgender woman has retreated from the public spotlight that once engulfed her and the hounding paparazzi who once tracked her every move. In her first lengthy sit-down magazine interview in more than a year, Jenner speaks with Variety about her conscious choice to focus, unheralded, on being a behind-the-scenes advocate for transgender rights on Capitol Hill.\n\n“I don’t do a lot of media. I don’t want to be seen everywhere,” the 68-year-old Jenner says on a recent afternoon, her bare feet up on a lounge chair. “Today, I’m very politically involved. Nobody really knows it. I do it very quietly because I have been so criticized by the liberal side of the media. I can get more things done if I don’t stick my nose into everything publicly.”\n\nJenner’s low-key lifestyle and muted public profile stand in sharp contrast to the days when her much-talked-about 2015 interview with Diane Sawyer, in which she revealed plans to transition from a man to a woman, attracted a staggering 17 million viewers. Next came the cover of Vanity Fair and her own reality TV show, “I Am Cait.”\n\nHer newfound fame put enormous pressure on Jenner — who had lived the first 65 years of her life as Olympic gold medal-winning decathlete Bruce Jenner — to be the perfect transgender role model. She had difficulty living up to those expectations, especially after coming out as something more controversial than being transgender: a Republican in Hollywood. On her reality show, Jenner expressed support for Ted Cruz and sparred with activists, who were as experienced in trans-politics as she was unversed. She voted for Trump in the 2016 election (but is no longer a fan).\n\nHer conservatism made her a pariah in the left-leaning entertainment industry, where she’s been criticized for not doing enough to help the transgender community. Jenner spoke candidly with Variety about the pain of that rejection.\n\n“No matter what you say or do, they think you don’t get it because you’re this kind of white, privileged person,” says Jenner. She disputes the notion that she hasn’t worked hard, or that her wealth disqualifies her from being an advocate. “I haven’t turned my back on anybody,” she says. But Jenner has received a cold shoulder from some of her peers: “I’ve felt it big time, and it hurts. Sometimes this community can be really tough.”\n\nJenner, who briefly considered running for senator, decided she could be more useful fighting for trans rights as a Republican liaison on Capitol Hill. She likens the civil rights battle to what the gay community faced 40 years ago on the road to marriage equality.\n\nEvery few weeks, Jenner travels to Washington to tell her story. She’s held long meetings with members of Trump’s White House and roughly 50 members of the House and Senate — to personally make the case for equality.\n\nShe’s patiently endured invasive questions about her body and genitalia, all in an effort to change people’s minds.\n\nShe says that these meetings are conducted away from the cameras. “I met with Paul Ryan,” she says. “I’ve met with just about everybody. Publicly, they aren’t supportive of transgender rights.” What do they say to her? “I’ve never had anybody not be nice to my face,” says Jenner, who did not want to elaborate on conversations that were confidential.\n\nMargaret Hoover, the president of the American Unity Fund, a Republican-funded group that advocates for LGBTQ rights, says that Jenner is uniquely positioned to educate. “Think of your average Republican in Washington,” Hoover says, noting that the party is getting older and less diverse. “It’s basically like every white friend of your 70-year-old dad. At the 1976 Olympic Games, they were all in the prime of their life, and Bruce Jenner was their hero. They idolized Bruce.” As a result, Jenner has been an effective ambassador. When they hear the word “transgender,” they might imagine a man in a dress. But when they see Caitlyn, they agree that she should use the women’s bathroom.\n\nJenner was originally hopeful about Trump, given that he promised to make LGBTQ rights part of his platform. But since taking office, he’s stoked fears by rolling back protections in schools and vowing to ban transgender people from the military. Jenner says her message to Trump, whom she met during the campaign but hasn’t spoken with as president, is simple. “Get over it! I honestly don’t know what happened when he got in there. It was extraordinarily disappointing,” she says.\n\nIn February 2017, Jenner lashed out against Trump on Twitter for withdrawing federal guidelines that allowed transgender youths to use the bathroom that matched their gender identity. “From one Republican to another, this is a disaster,” she tweeted. “You made a promise to protect the LGBTQ community. Call me.”\n\nJenner says Trump never reached out. (A source with knowledge of her thinking says Jenner would like to meet with the president after the midterm elections, but not in front of the press.) “He’s not been doing a very good job, but it’s not over yet,” she says.\n\nJenner believes that the United States should pass a law that allows transgender citizens to enlist in the armed forces. “We need hard-core legislation, laws on the book of equality,” she says, pointing to measures passed by other countries, from Israel to England. “It’s going to take some time, but we’re working on it.”\n\nJenner wants everyone to know that she’s found happiness. “My life is so simple,” she says. “It’s just to be myself all day. I think people think when you transition, it is this tremendous thing, and now you’re a totally different person. I’m still the same person. Caitlyn lived inside me all my life.”\n\nAs a member of America’s most notorious reality TV family (“Keeping Up With the Kardashians,” for those of you living under a rock), Jenner gets asked to be photographed a lot in public. “If I’m out, I take a minimum of 30 selfies with people,” she says. “It drives everyone around me crazy.” This isn’t done out of vanity. She’s trying to prove a point. “That may be the first time they’ve met anybody who’s trans,” Jenner says about her interactions with her fans. “I want that to be a pleasurable experience. I want to be nice to people. I want to have a smile on my face. And they walk away and say, ‘Oh, my God! Caitlyn was so nice.’ That’s the way I want them to think of trans people. That we’re nice.”\n\nvictoria stevens for Variety\n\nShe’s disappointed that “I Am Cait” got canceled in 2016. “I wish we could’ve done more,” she says. She regrets talking about politics on the show. “Reality TV loves drama.” She’s certainly dealt with her share of that. The tabloids are reporting that she’s dating a 22-year-old transgender woman named Sophia Hutchins, whom she took to the ESPYs a few weeks ago. Hutchins is at her house on the day of our interview, and she follows us into Jenner’s office to listen to our conversation. Although they sound like a couple — Jenner asks Hutchins for the name of the last great movie they saw together (Hutchins suggests “I, Tonya”) — they deny that they are. “We are not going to get into that,” Jenner says. “But we are very close. We do a lot of things together. We’re kind of inseparable. We’re the best of friends.”\n\nRegardless of the nature of their personal relationship, Hutchins is the executive director of the Caitlyn Jenner Foundation, which was formed last year to advance transgender rights. Jenner auctioned off a Porsche that she owned to raise funds. But her efforts there, too, have been kept under the radar. “Coming from a reality show, where every detail of your life is documented, to not seeking any press is kind of a big change,” Hutchins says. “Caitlyn is not working on these issues for press attention. She’s doing it because she genuinely wants to help the community.”\n\nJenner hasn’t found it easy to parse the PC rules of transgender politics. For example, she talks about how much she loved “The Danish Girl,” the 2015 biopic starring cisgender actor Eddie Redmayne as the artist Lili Elbe. “I thought it was good to have it out there,” Jenner says. “GLAAD talked to me and said, ‘Don’t mention you even saw the movie!’ And then all the flak came down about Eddie Redmayne doing it. I went to the Vanity Fair Oscar party, and I’m thinking, ‘What if he’s there? I can’t even be seen with him.’ That’s horrible!”\n\n(“GLAAD shared concerns that transgender community members voiced about the film as a courtesy so that Caitlyn would be aware of them,” said a GLAAD rep.)\n\nBefore transitioning, she once auditioned for “Superman” and co-starred on TV’s “CHiPs.” She’s open to acting again. She says she’s working on something that would employ an all-transgender cast and crew. “You have to wait and see,” says Jenner, declining to give specifics. She reveals that her fantasy role would be as a comic-book villainess. “In a Marvel movie, I want to play the baddest-ass lady you’ve ever seen in your life. They got the wicked queen or the wicked lady. Just do the makeup and the outfit. And I got the deep voice.”\n\nJenner, whose autobiography, “The Secrets of My Life,” was published in 2017, sees her 10 kids as often as she can. She concedes that some of them are closer to her than others. She beams at Kylie being on the cover of Forbes as the youngest “self-made” almost billionaire. Although she didn’t attend her son Brody’s June wedding in Indonesia, she’ll see him soon. She’s supportive of her stepdaughter Kim’s recent visit with Trump, in which she convinced him to commute the sentence of a woman serving life in prison for a nonviolent drug offense. “I thought they did the right thing,” Jenner says. “I was very proud of her.” As for her ex-wife Kris, they aren’t as friendly. “We haven’t talked in a long time.”\n\nJenner could see herself doing another reality TV show — maybe one where she parachutes into parts of the world as a transgender rights explorer. She doesn’t think she’ll appear in future episodes of “Keeping Up With the Kardashians.” “At this point, no,” she says. “But you never know.”\n\nWatch more from Variety‘s interview with Caitlyn Jenner below.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Fpolitics%2Ffeatures%2Fcaitlyn-jenner-trans-rights-advocate-1202896320%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202896320&comment_count=76", "http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/08/caitlin-jenner-variety-trans-hollywood.jpg?w=1000", "https://pmcvariety.files.wordpress.com/2018/08/trans-hollywood-refer.png?"], "top_img": "https://pmcvariety.files.wordpress.com/2018/08/caitlin-jenner-variety-trans-hollywood.jpg?w=1000", "keywords": [], "authors": ["Ramin Setoodeh"], "canonical_link": "https://variety.com/2018/politics/features/caitlyn-jenner-trans-rights-advocate-1202896320/", "title": "How Caitlyn Jenner Is Secretly Fighting Trump’s White House on Transgender Rights", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "The most famous transgender woman in America has transformed herself into a political advocate for her community on Capitol Hill.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202896320, "author": "Ramin Setoodeh", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-08-07T06:30:32"}, "pmc-tag": "caitlyn jenner,Transgender Hollywood", "title": "How Caitlyn Jenner Is Secretly Fighting Trump’s White House on Transgender Rights", "pageclass": "article", "pmc-vertical": "politics", "pmc-primary-category": "Features", "pmc-primary-vertical": "politics", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "How Caitlyn Jenner Is Secretly Fighting Trump’s White House on Transgender Rights", "url": "https://variety.com/2018/politics/features/caitlyn-jenner-trans-rights-advocate-1202896320/", "description": "Caitlyn Jenner lives on the outer edges of Malibu, up a winding, tree-lined road leading to a modern mountaintop home. Her yellow Labrador, Bertha, happily skips across the white tile floors of her…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/08/caitlin-jenner-variety-trans-hollywood.jpg?w=1000", "width": 1000, "height": 563, "alt": "Caitlyn Jenner Variety Trans Hollywood"}, "locale": "en_US"}, "article": {"published_time": "2018-08-07T13:30:32+00:00", "modified_time": "2018-08-07T17:51:49+00:00"}, "twitter": {"creator": "@https://twitter.com/RaminSetoodeh", "site": "@variety", "text": {"title": "How Caitlyn Jenner Is Secretly Fighting Trump’s White House on Transgender Rights"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/08/caitlin-jenner-variety-trans-hollywood.jpg?w=1000", "alt": "Caitlyn Jenner Variety Trans Hollywood"}, "card": "summary_large_image", "title": "How Caitlyn Jenner Is Secretly Fighting Trump’s White House on Transgender Rights", "description": "The most famous transgender woman in America has transformed herself into a political advocate for her community on Capitol Hill."}, "author": "Ramin Setoodeh", "content_type": "Article", "post_id": 1202896320, "title": "How Caitlyn Jenner Is Secretly Fighting Trump's White House on Transgender Rights", "published_at": "2018-08-07 06:30:32", "image": "https://pmcvariety.files.wordpress.com/2018/08/caitlin-jenner-variety-trans-hollywood.jpg?w=1000", "comment_count": 76, "tags": "Transgender Hollywood", "topics": "News", "appeared_in_print": "Yes", "body": "Caitlyn Jenner lives on the outer edges of Malibu, up a winding, tree-lined road leading to a modern mountaintop home. Her yellow Labrador, Bertha, happily skips across the white tile floors of her living room. The kitchen is pristine, with a refrigerator stocked with bottles of water and a counter holding a platter of chocolate-chip cookies and a bowl of M&Ms.\r\n\r\nThe world’s most famous transgender woman has retreated from the public spotlight that once engulfed her and the hounding paparazzi who once tracked her every move. In her first lengthy sit-down magazine interview in more than a year, Jenner speaks with Variety about her conscious choice to focus, unheralded, on being a behind-the-scenes advocate for transgender rights on Capitol Hill.\r\n\r\n“I don’t do a lot of media. I don’t want to be seen everywhere,” the 68-year-old Jenner says on a recent afternoon, her bare feet up on a lounge chair. “Today, I’m very politically involved. Nobody really knows it. I do it very quietly because I have been so criticized by the liberal side of the media. I can get more things done if I don’t stick my nose into everything publicly.”\r\n\r\nJenner’s low-key lifestyle and muted public profile stand in sharp contrast to the days when her much-talked-about 2015 interview with Diane Sawyer, in which she revealed plans to transition from a man to a woman, attracted a staggering 17 million viewers. Next came the cover of Vanity Fair and her own reality TV show, “I Am Cait.”\r\n\r\nHer newfound fame put enormous pressure on Jenner — who had lived the first 65 years of her life as Olympic gold medal-winning decathlete Bruce Jenner — to be the perfect transgender role model. She had difficulty living up to those expectations, especially after coming out as something more controversial than being transgender: a Republican in Hollywood. On her reality show, Jenner expressed support for Ted Cruz and sparred with activists, who were as experienced in trans-politics as she was unversed. She voted for Trump in the 2016 election (but is no longer a fan).\r\n\r\n\r\n\r\nHer conservatism made her a pariah in the left-leaning entertainment industry, where she’s been criticized for not doing enough to help the transgender community. Jenner spoke candidly with Variety about the pain of that rejection.\r\n\r\n“No matter what you say or do, they think you don’t get it because you’re this kind of white, privileged person,” says Jenner. She disputes the notion that she hasn’t worked hard, or that her wealth disqualifies her from being an advocate. “I haven’t turned my back on anybody,” she says. But Jenner has received a cold shoulder from some of her peers: “I’ve felt it big time, and it hurts. Sometimes this community can be really tough.”\r\n\r\nJenner, who briefly considered running for senator, decided she could be more useful fighting for trans rights as a Republican liaison on Capitol Hill. She likens the civil rights battle to what the gay community faced 40 years ago on the road to marriage equality.\r\n\r\nEvery few weeks, Jenner travels to Washington to tell her story. She’s held long meetings with members of Trump’s White House and roughly 50 members of the House and Senate — to personally make the case for equality.\r\n\r\nShe’s patiently endured invasive questions about her body and genitalia, all in an effort to change people’s minds.\r\n\r\nShe says that these meetings are conducted away from the cameras. “I met with Paul Ryan,” she says. “I’ve met with just about everybody. Publicly, they aren’t supportive of transgender rights.” What do they say to her? “I’ve never had anybody not be nice to my face,” says Jenner, who did not want to elaborate on conversations that were confidential.\r\n\r\nMargaret Hoover, the president of the American Unity Fund, a Republican-funded group that advocates for LGBTQ rights, says that Jenner is uniquely positioned to educate. “Think of your average Republican in Washington,” Hoover says, noting that the party is getting older and less diverse. “It’s basically like every white friend of your 70-year-old dad. At the 1976 Olympic Games, they were all in the prime of their life, and Bruce Jenner was their hero. They idolized Bruce.” As a result, Jenner has been an effective ambassador. When they hear the word “transgender,” they might imagine a man in a dress. But when they see Caitlyn, they agree that she should use the women’s bathroom.\r\n\r\nJenner was originally hopeful about Trump, given that he promised to make LGBTQ rights part of his platform. But since taking office, he’s stoked fears by rolling back protections in schools and vowing to ban transgender people from the military. Jenner says her message to Trump, whom she met during the campaign but hasn’t spoken with as president, is simple. “Get over it! I honestly don’t know what happened when he got in there. It was extraordinarily disappointing,” she says.\r\n\r\nIn February 2017, Jenner lashed out against Trump on Twitter for withdrawing federal guidelines that allowed transgender youths to use the bathroom that matched their gender identity. “From one Republican to another, this is a disaster,” she tweeted. “You made a promise to protect the LGBTQ community. Call me.”\r\n\r\nJenner says Trump never reached out. (A source with knowledge of her thinking says Jenner would like to meet with the president after the midterm elections, but not in front of the press.) “He’s not been doing a very good job, but it’s not over yet,” she says.\r\n\r\nJenner believes that the United States should pass a law that allows transgender citizens to enlist in the armed forces. “We need hard-core legislation, laws on the book of equality,” she says, pointing to measures passed by other countries, from Israel to England. “It’s going to take some time, but we’re working on it.”\r\n\r\nJenner wants everyone to know that she’s found happiness. “My life is so simple,” she says. “It’s just to be myself all day. I think people think when you transition, it is this tremendous thing, and now you’re a totally different person. I’m still the same person. Caitlyn lived inside me all my life.”\r\n\r\nAs a member of America’s most notorious reality TV family (“Keeping Up With the Kardashians,” for those of you living under a rock), Jenner gets asked to be photographed a lot in public. “If I’m out, I take a minimum of 30 selfies with people,” she says. “It drives everyone around me crazy.” This isn’t done out of vanity. She’s trying to prove a point. “That may be the first time they’ve met anybody who’s trans,” Jenner says about her interactions with her fans. “I want that to be a pleasurable experience. I want to be nice to people. I want to have a smile on my face. And they walk away and say,  ‘Oh, my God! Caitlyn was so nice.’ That’s the way I want them to think of trans people. That we’re nice.”\r\n\r\n\r\n\r\nShe’s disappointed that “I Am Cait” got canceled in 2016. “I wish we could’ve done more,” she says. She regrets talking about politics on the show. “Reality TV loves drama.” She’s certainly dealt with her share of that. The tabloids are reporting that she’s dating a 22-year-old transgender woman named Sophia Hutchins, whom she took to the ESPYs a few weeks ago. Hutchins is at her house on the day of our interview, and she follows us into Jenner’s office to listen to our conversation. Although they sound like a couple — Jenner asks Hutchins for the name of the last great movie they saw together (Hutchins suggests “I, Tonya”) — they deny that they are. “We are not going to get into that,” Jenner says. “But we are very close. We do a lot of things together. We’re kind of inseparable. We’re the best of friends.”\r\n\r\nRegardless of the nature of their personal relationship, Hutchins is the executive director of the Caitlyn Jenner Foundation, which was formed last year to advance transgender rights. Jenner auctioned off a Porsche that she owned to raise funds. But her efforts there, too, have been kept under the radar. “Coming from a reality show, where every detail of your life is documented, to not seeking any press is kind of a big change,” Hutchins says. “Caitlyn is not working on these issues for press attention. She’s doing it because she genuinely wants to help the community.”\r\n\r\nJenner hasn’t found it easy to parse the PC rules of transgender politics. For example, she talks about how much she loved “The Danish Girl,” the 2015 biopic starring cisgender actor Eddie Redmayne as the artist Lili Elbe. “I thought it was good to have it out there,” Jenner says. “GLAAD talked to me and said, ‘Don’t mention you even saw the movie!’ And then all the flak came down about Eddie Redmayne doing it. I went to the Vanity Fair Oscar party, and I’m thinking, ‘What if he’s there? I can’t even be seen with him.’ That’s horrible!”\r\n\r\n(“GLAAD shared concerns that transgender community members voiced about the film as a courtesy so that Caitlyn would be aware of them,” said a GLAAD rep.)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBefore transitioning, she once auditioned for “Superman” and co-starred on TV’s “CHiPs.” She’s open to acting again. She says she’s working on something that would employ an all-transgender cast and crew. “You have to wait and see,” says Jenner, declining to give specifics. She reveals that her fantasy role would be as a comic-book villainess. “In a Marvel movie, I want to play the baddest-ass lady you’ve ever seen in your life. They got the wicked queen or the wicked lady. Just do the makeup and the outfit. And I got the deep voice.”\r\n\r\nJenner, whose autobiography, “The Secrets of My Life,” was published in 2017, sees her 10 kids as often as she can. She concedes that some of them are closer to her than others. She beams at Kylie being on the cover of Forbes as the youngest “self-made” almost billionaire. Although she didn’t attend her son Brody’s June wedding in Indonesia, she’ll see him soon. She’s supportive of her stepdaughter Kim’s recent visit with Trump, in which she convinced him to commute the sentence of a woman serving life in prison for a nonviolent drug offense. “I thought they did the right thing,” Jenner says. “I was very proud of her.” As for her ex-wife Kris, they aren’t as friendly. “We haven’t talked in a long time.”\r\n\r\nJenner could see herself doing another reality TV show — maybe one where she parachutes into parts of the world as a transgender rights explorer. She doesn’t think she’ll appear in future episodes of “Keeping Up With the Kardashians.” “At this point, no,” she says. “But you never know.”\r\n\r\nWatch more from Variety's interview with Caitlyn Jenner below.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1533648632.0, "source": "http://variety.com", "summary": ""}