{"url": "https://www.cheatsheet.com/entertainment/kylie-jenner-keeping-fans-guessing-pregnancy.html/", "text": "Reports surfaced on Sept. 22, 2017, that Kylie Jenner was pregnant with her and boyfriend Travis Scott’s first child together. However, the reality star didn’t confirm the news until after giving birth to her baby girl. Instead, she kept her fans guessing about whether or not the rumors are true.\n\nThis prompted Jenner’s followers to look for clues that she or her famous family dropped via social media or in interviews, but they didn’t make it easy. Here’s how Jenner kept fans guessing over her pregnancy.\n\nJenner posted this cryptic Instagram photo\n\n@vladyart A post shared by Kylie (@kyliejenner) on Sep 21, 2017 at 10:45am PDT\n\nThe day before the possible pregnancy news broke, Jenner posted an image to Instagram that her followers didn’t think much of at the time. However, after the internet blew up with reports that she was having a girl, this photo really got everyone’s attention, speculating if this was Jenner’s way of letting her fans know she was pregnant.\n\nNext: Here’s what Kim Kardashian had to say about it.\n\nKim Kardashian tweeted it’s fake news\n\nThis sounds like a very fake story… https://t.co/ZIxCltgK6d — Kim Kardashian West (@KimKardashian) September 26, 2017\n\nJust when we thought the pregnancy rumors could actually be true, Jenner’s older sister, Kim Kardashian, threw us a curve ball.\n\nKardashian took to Twitter with a link to a Harper’s Bazaar article which again claimed that Jenner was pregnant and detailed how her big sis reacted to the news. Mrs. West tweeted a pretty feisty response to the publication that the story sounded “very fake.”\n\nNext: Making appearances on these shows haven’t revealed much either.\n\nMama Kris refused to confirm news\n\nKris Jenner hasn’t been forthcoming at all about if her youngest daughter is expecting either. During an episode of Live with Kelly and Ryan, the Kardashian-Jenner family matriarch texted Ryan Seacrest to say that “Kylie is not confirming anything.”\n\nIn November, the momager appeared on Ellen DeGeneres’ talk show and avoided any questions pertaining to whether the Life of Kylie star is preggers.\n\nNext: Is Kylie just trolling her own fans?\n\n‘Nothing’s Gonna Hurt You Baby’ Snap\n\nJenner, meanwhile, continued to confuse her many social media followers by posting a video to Snapchat with the song “Nothing’s Gonna Hurt You Baby” by Cigarettes After Sex playing in the background. Moreover, she captioned it “BABY” with a winking face emoji.\n\nSo, is she trolling us or trying to tell us something?\n\nNext: This is Kylie’s excuse for those prego-looking photos.\n\nKylie claims tabloid pics were Photoshopped\n\nKylie tweeted that these photos were altered. | Kylie tweeted that these photos were altered. | Kylie Jenner via Twitter\n\nOn Nov. 5, some pictures were published by the Daily Mail showing what is supposedly Jenner’s baby bump, but the makeup mogul fired back claiming that the images were “Photoshopped.”\n\nThe X17Online, whose photographer took the pics, then responded to Jenner’s with a statement that the photos were in no way altered. “100% REAL! No Photoshop, #nofilter, no additives, no preservatives—all organic and all REAL!”\n\nNext: But her style hasn’t changed much, leaving fans to wonder.\n\nShe only wears baggy clothes\n\nAlthough Jenner claimed that the baby bump pics aren’t real, there hasn’t been an explanation for why she’s only been seen in baggy clothes lately. One look at her social media accounts show the reality star in a way we’re not used to seeing her: all covered up in oversized sweats.\n\nNext: Is this the biggest clue she isn’t really pregnant?\n\nJenner bought tampons\n\ngirls trip 11/5/17 A post shared by Kylie Jenner (@kyliesnapchat) on Nov 5, 2017 at 12:03pm PST\n\nProbably the most confusing thing of all, and what really threw everyone off, is when Jenner posted on Snapchat her purchases at a convenience store. Some eagle-eyed followers noticed that underneath a pile of junk food was a box of tampons!\n\nSo, there could be a few different explanations for this. She could be using them to put on foundation, buying them for someone else, or just keeping us guessing. There’s also always the possibility she really isn’t pregnant. You decide.\n\nNext: Kylie is missing from this popular photo.\n\nShe didn’t appear in the Kardashian-Jenner family Christmas card\n\nThe Kardashian-Jenner women and their kids, sans Kylie | The Kardashian-Jenner women and their kids, sans Kylie | Kim Kardashian West via Twitter\n\nThe Kardashians and the Jenners aren’t ones to miss a photo opportunity. But Kylie has certainly been laying low — and she kept that going through the holiday season.\n\nLeading up to Christmas Day, Kim and co. shared images from a denim-themed photoshoot on social media featuring many members of the Kardashian-Jenner clan. Notably missing was Kylie herself, which sparked even more conversation about her alleged pregnancy.\n\nNext: She conveniently covered up in this family photo.\n\nShe covered up in the Calvin Klein promotional shoot\n\nKylie (left) is conveniently covered up by a blanket in this photo. | Kylie (left) is conveniently covered up by a blanket in this photo. | Kim Kardashian West via Instagram\n\nIn January 2018, the first images of the Kardashian and Jenner girls for their new partnership with Calvin Klein appeared. And once again, the jury is out on whether or not Kylie is pregnant.\n\nIn every photo in which she appears, Kylie’s abdomen is somehow blocked from view. It’s worth noting that Khloé, whose pregnancy has been confirmed, isn’t showing in the photos either, though Kylie is rumored to be further along than her big sis.\n\nShe finally confirmed her pregnancy\n\nKylie Jenner explained everything on social media. | Kylie Jenner explained everything on social media. | Kylie Jenner via Instagram\n\nAfter months of speculation, Jenner finally confirmed her pregnancy — after giving birth, that is! The star announced on Feb. 3, 2018, that she had just given birth two days prior on Feb. 1. She took to social media to announce her “beautiful and healthy” baby girl, who at 4:43 p.m. local time and weighed in at 8 pounds, 9 ounces.\n\nShe shared the baby’s first name and an image\n\nThe first image of Kylie Jenner’s daughter | The first image of Kylie Jenner’s daughter | Kylie Jenner via Instagram\n\nWhile many suspected Jenner would wait until an episode of a Keeping Up with the Kardashians or another media moment in the future to spill more details, she surprised us. The 20-year-old mom took to her Instagram account just two days after confirming her daughter’s birth to share this image.\n\nAccompanied by the simple caption, “stormi webster” and an angel emoji, Jenner appeared to reveal the infant’s name alongside a pic showing part of her face and her tiny hand holding on to her mother’s (perfectly manicured) thumb. It’s simply adorable, but of course, leads to more questions, like “Is ‘Stormi’ short for something?”\n\nWebster is the legal last name of the child’s father, Travis Scott (birth name Jacques Webster).\n\nAdditional reporting by Becca Bleznak.\n\nFollow Michelle Kapusta on Twitter @philamichelle.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/01/kardashian-calvin-klein.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/kylie-jenner-baby.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-05-at-11.10.49-AM-e1517847285146.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/12/kim-kardashian-west-twitter.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/kylie-jenner-keeping-fans-guessing-pregnancy.html/", "title": "How Kylie Jenner Kept Fans Guessing Over Pregnancy", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/kylie-jenner-keeping-fans-guessing-pregnancy.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Kylie Jenner didn't address those pregnancy rumors until after her baby was born, but fans kept looking for hints in her social media.", "og": {"locale": "en_US", "type": "article", "title": "How Kylie Jenner Kept Fans Guessing Over Pregnancy", "description": "Kylie Jenner didn't address those pregnancy rumors until after her baby was born, but fans kept looking for hints in her social media.", "url": "https://www.cheatsheet.com/entertainment/kylie-jenner-keeping-fans-guessing-pregnancy.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-04-25T14:25:06-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "social media", "section": "Entertainment", "published_time": "2018-04-24T14:24:00-04:00", "modified_time": "2018-04-25T14:25:06-04:00"}, "twitter": {"card": "summary_large_image", "description": "Kylie Jenner didn't address those pregnancy rumors until after her baby was born, but fans kept looking for hints in her social media.", "title": "How Kylie Jenner Kept Fans Guessing Over Pregnancy", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/01/kylie-jenner-photoshop-tweet.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": ["https://www.youtube.com/embed/hQkF80DgQQQ?feature=oembed", "https://www.youtube.com/embed/qKzu9cq-xik?feature=oembed"], "publish_date": 1524594240.0, "source": "https://www.cheatsheet.com", "summary": ""}