{"url": "https://www.latimes.com/business/hollywood/la-fi-ct-brett-ratner-allegations-20171101-htmlstory.html", "text": "Natasha Henstridge was watching a movie on Brett Ratner’s couch when she fell asleep. She was a 19-year-old fashion model; he was an up-and-coming music video director in his early 20s. They had been hanging out in front of the TV with friends at his New York apartment.\n\nBut when Henstridge woke up, the others had left. She was alone with Ratner. She got up to leave, Henstridge said, but he blocked the doorway with his body and wouldn’t budge. He began touching himself, she said, then forced her to perform oral sex.\n\n\n\n“He strong-armed me in a real way. He physically forced himself on me,” she said. “At some point, I gave in and he did his thing.”\n\nRatner, through his attorney Martin Singer, disputed her account.\n\nSince that incident in the early 1990s, Henstridge has found success as an actress — starring in the films “Species” and “The Whole Nine Yards.” But she said she has carried the memory of the run-in with her, and watched from afar as Ratner became one of Hollywood’s most powerful players — directing, producing or financing dozens of today’s biggest box-office hits, including “Rush Hour,” “X-Men: The Last Stand,” “The Revenant” and “Horrible Bosses.”\n\nALSO: Warner Bros. cuts ties with Brett Ratner’s company »\n\nAs hundreds of women have come forward in recent weeks with allegations of sexual misconduct at the hands of producer Harvey Weinstein, director James Toback and numerous other powerful men, Henstridge decided she would no longer remain silent.\n\nIn interviews with the Los Angeles Times, Henstridge and five other women accused Ratner of a range of sexual harassment and misconduct that allegedly took place in private homes, on movie sets or at industry events.\n\nAs is often the case, none of the women reported the allegations to the police.\n\nOn Ratner’s behalf, Singer “categorically” disputed their accounts.\n\n“I have represented Mr. Ratner for two decades, and no woman has ever made a claim against him for sexual misconduct or sexual harassment,” Singer said in a 10-page letter to The Times. “Furthermore, no woman has ever requested or received any financial settlement from my client.”\n\nIt feels as if I keep going up against the same bully at school who just won’t quit. Actress Olivia Munn\n\nOlivia Munn said that while visiting the set of the 2004 Ratner-directed “After the Sunset” when she was still an aspiring actress, he masturbated in front of her in his trailer when she went to deliver a meal. Munn wrote about the incident in her 2010 collection of essays without naming Ratner. On a television show a year later, Ratner identified himself as the director, and claimed that he had “banged” her, something he later said was not true. The same year her book was published, Munn ran into Ratner at a party thrown by Creative Artists Agency and he boasted of ejaculating on magazine covers featuring her image, she told The Times.\n\nShe said that persistent false rumors that they had been intimate have infuriated her, prompting her to talk to The Times in support of other women who are “brave enough to speak up.”\n\n“I’ve made specific, conscientious choices not to work with Brett Ratner,” Munn said.\n\n“It feels as if I keep going up against the same bully at school who just won’t quit,” she said. “You just hope that enough people believe the truth and for enough time to pass so that you can’t be connected to him anymore.”\n\nRatner “vehemently disputes” Munn’s allegations, Singer said.\n\nDirector Brett Ratner and producer Robert Evans stand for a photo at a Beverly Hills Oscars party in 2005. Stephen Shugerman / Getty Images\n\nA playboy persona\n\nRatner, 48, has long flaunted his playboy persona, bragging publicly about his sexual prowess. He has been romantically linked to the likes of Paris Hilton, Lindsay Lohan and Mariah Carey. In December, Tina Fey, speaking at the Hollywood Reporter’s annual Women in Entertainment breakfast, cracked: “Brett Ratner is here. In his defense, he thought this was a thing where you could eat breakfast off of 100 women.”\n\nFor years, he palled around with Robert Evans, the slick-haired former production chief at Paramount Pictures who was later convicted of trafficking cocaine, and Toback, who, as The Times reported last month, has been accused of sexual misconduct by more than 300 women. In a January interview with Variety, Ratner said Evans, Toback and Roman Polanski, who was convicted of having unlawful sex with a minor in 1977, were among his “closest friends.”\n\nAfter Ratner quipped that “rehearsal is for fags” while appearing at a 2011 screening of his film “Tower Heist,” he was widely criticized. The misstep cost him a plum gig: He quickly resigned from producing the 2012 Academy Awards telecast and issued an apology, calling it a “dumb way of expressing myself.”\n\nIn interviews, Ratner has tried to smooth out the rough edges of his bad-boy image, especially more recently, as he has expanded his business ventures. In 2012, Ratner co-founded production company RatPac Entertainment. A year later, RatPac partnered with now-Treasury Secretary Steven Mnuchin’s Dune Entertainment to create the investment vehicle RatPac-Dune Entertainment, which inked a co-financing deal with Warner Bros. worth about $450 million. Among Ratner’s executive producing credits via those companies are “Jersey Boys” and “Black Mass.”\n\nThe filmmaker often has told reporters that he doesn’t use drugs or drink alcohol. Sometimes, in enumerating his lack of vices, Ratner also points out his love of beautiful women, saying, for example, in a 2008 Jewish Journal story: “I’m not into dark stuff. I’m just a nice Jewish kid ... who loves movies and pretty girls.”\n\nJaime Ray Newman in 2014. Andrew Goodman / Getty Images for the Maui Film Festival at Wailea\n\nActress Jaime Ray Newman said Ratner put it more bluntly to her, explaining in vulgar terms that he needed sex — not alcohol or drugs.\n\nNewman said she encountered Ratner in 2005 when they were both in first class on an Air Canada flight. The filmmaker swapped seats with his assistant before departure so he could be next to her, she said. Newman, who was on her way to shoot her first major acting role on the TV show “Supernatural,” was excited to talk with a “famous director” about to helm “X-Men: The Last Stand,” she said.\n\nWithin five minutes of the plane taking off, she said, Ratner began loudly describing sex acts he wanted to perform on her in explicit detail. He also showed her nude photos of his then-girlfriend, said Newman, 39, who stars on Netflix’s forthcoming “The Punisher.”\n\n“He was graphically describing giving me oral sex and how he was addicted to it,” she said.\n\nNewman said she was so shaken by the encounter that she immediately told a handful of people about it. Both her mother and a friend confirmed to The Times that the actress shared details shortly after the flight.\n\nRatner, through his attorney, denied that the incident occurred, referring to it as a “ridiculous claim.”\n\nActress Katharine Towne in February 2008. Charley Gallay / Getty Images for MediaPlacement\n\nActress Katharine Towne also described an aggressive come-on by Ratner that left her so uncomfortable that she said she still vividly remembers the incident years later. She said she met the director in L.A. around 2005 at a party in a movie star’s home, where he made unwanted advances. Ratner, she said, was persistent, “making it evident that he had one motive” — to sleep with her.\n\n“He started to come on to me in a way that was so extreme,” said Towne, 39, whose credits include the film “What Lies Beneath.” The actress, who is the daughter of “Chinatown” screenwriter Robert Towne, excused herself. Ratner followed her into a bathroom.\n\n“I think it’s pretty aggressive to go in the bathroom with someone you don’t know and close the door,” Towne said.\n\nShe said she was nervous, and tried to make a joke about her weight: “I don’t even know what you want with me. I’m kind of chubby right now.” He was undeterred. “I like ’em chubby sometimes,” she said Ratner replied. Towne gave Ratner her number, hoping to placate him. Ratner’s assistant called her for the next six months, unsuccessfully trying to arrange a dinner for her and the filmmaker, she said.\n\nRatner’s attorney Singer called Towne’s account “absurd.” “Even if hypothetically this incident occurred exactly as claimed, how is flirting at a party, complimenting a woman on her appearance, and calling her to ask her for a date wrongful conduct?” Singer said.\n\nAlthough some have questioned his conduct, Ratner has defenders in the industry including five former assistants who have worked closely with him throughout the years. David Steiman, Hopi Dobuler, Drew Sherman, Brett Gursky and Izak Rappaport all said that they did not witness him misbehave and praised him as a boss and mentor.\n\nSteiman, who was Ratner’s assistant from 1999 to 2004, said he never saw him mistreat women, and would be “shocked” if such conduct occurred. Steiman noted that Ratner dated actress Rebecca Gayheart and tennis star Serena Williams during his time working for the filmmaker.\n\nSaid Dobuler, a longtime former assistant to Ratner: “I think he’s great. ... He’s a family guy.”\n\nOver the years, Ratner has received several honors for his philanthropic and humanitarian endeavors. On Sunday, the Jewish National Fund presented Ratner with its annual Tree of Life Award at a gala in Hollywood where the guests included film producer Avi Lerner, United Talent Agency co-founder Jim Berkus and Singer.\n\nGal Gadot, the Israeli star of “Wonder Woman,” had been slated to give the award to Ratner, but as The Times was reporting on his alleged sexual misbehavior last week, the actress’ publicist announced she would not appear at the event because of a scheduling conflict.\n\nInstead, “Wonder Woman” director Patty Jenkins, who has known Ratner for years, presented him the award, saying: “He’s gone on to be this real power in this town. He’s a big character. He’s a big personality. But you know what I love about Brett, he wants that for everybody else too.”\n\nActress Olivia Munn arrives at the 2017 Vanity Fair Oscar Party in February. Axelle/Bauer-Griffin / FilmMagic\n\nMunn’s Ratner run-ins\n\nNew to Los Angeles and pursuing an acting career, Munn said she was thrilled when a friend invited her to the set of “After the Sunset.” “I was so excited, because I mean, that’s why you come out to California and Hollywood,” recalled the actress, 37, whose credits now include HBO’s “The Newsroom” and the movies “Magic Mike” and “X-Men: Apocalypse.”\n\nNot long after Munn arrived on the Santa Monica set in 2004, she said, she was asked to drop some food off in Ratner’s trailer as a favor. She said she was assured that the director would not be there.\n\nMunn entered Ratner’s trailer and quickly placed the food on a table. She said she was startled to find him inside. She tried to make a quick exit, but Ratner implored her not to leave.\n\n“He walked out ... with his belly sticking out, no pants on, shrimp cocktail in one hand and he was furiously masturbating in the other,” Munn said. “And before I literally could even figure out where to escape or where to look, he ejaculated.”\n\nMunn said she let out a “startled scream” and raced out of the trailer. She said she immediately told the man who had asked her to deliver the food. His reaction? “It wasn’t a shock. It wasn’t surprise,” Munn recalled. “It was just, ‘Ugh, sorry about that.’”\n\nMunn said she left the set and called her sister, Sara Potts, who urged her to speak with a lawyer. Potts confirmed Munn’s account.\n\nThe attorney dissuaded her from going up against a powerful director as a fledgling actress, so she did nothing.\n\n“That did leave an impact on me,” Munn said, reflecting on the conversation. “How broken do women have to be before people listen?”\n\nShe wrote about the incident in her book, “Suck It, Wonder Woman! The Misadventures of a Hollywood Geek” — but stripped out names and details. During a 2011 appearance on “Attack of the Show,” a television program Munn previously co-hosted, Ratner identified himself as the unnamed director, but denied masturbating in front of her. “I used to date Olivia Munn, I will be honest with everybody here,” he said. “When she was ‘Lisa.’ That was the problem. She wasn’t Asian back then.”\n\n“I banged her a few times ... but I forgot her,” he said.\n\nDays later, he went on the Howard Stern show and admitted he never slept with Munn and expressed contrition for making her look like “a whore.”\n\n“I felt horrible,” he told the Sirius XM Radio host. “I said I banged her three times, which wasn’t true.”\n\nIn response to questions from The Times, Singer said that Munn and Ratner had indeed had “an intimate relationship.” Munn described that as “a complete lie.”\n\n“I shouldn’t have to be completely broken, battered, and devalued in order to prove that he crossed a line,” she said.\n\nI shouldn’t have to be completely broken, battered, and devalued in order to prove that he crossed a line. Olivia Munn\n\nMunn said she continued to run into Ratner at a handful of Hollywood events.\n\nIn 2010, after recently appearing on the cover of a magazine, she attended a CAA-hosted party where, she said, Ratner asked her, “Why do you hate me?” She said she told him: “It’s more of a dislike.”\n\nRatner grew angry, she said, and responded: “Why? I bought 10 of your magazines and came over all of them.”\n\nSinger said Ratner “has no recollection of making such a statement.”\n\nImmediately after the run-in, Munn told her friend Cara McConnell, whom she had brought to the party, about what transpired.\n\n“She came up to me right afterwards,” McConnell said. “She [said] ‘I can’t believe this happened to me. I can’t believe he did that.’”\n\nAn actor who overheard the conversation confirmed Munn’s account. A third partygoer confirmed being told immediately about the “vulgar” encounter from someone who overheard it directly.\n\nDirector Brett Ratner on the set of “Rush Hour 2\" circa 2001. Michael Ochs Archives / Getty Images\n\nOn the set of ‘Rush Hour 2’\n\nThe claimed incident with Munn is not the only one to allegedly occur on set of a Ratner-helmed film.\n\nFour people who were involved in the production of Ratner’s “Rush Hour 2” in Las Vegas in 2001 described a sexually charged atmosphere — one in which the director was pursuing women. The PG-13 film includes several scenes featuring women in bikinis and lingerie, and the set, according to these people, was teeming with beautiful young women.\n\nEri Sasaki, then a 21-year-old part-time model and aspiring singer, said her role as an extra required her to wear a skimpy outfit that exposed her midriff. While waiting for filming to begin one day, Ratner approached her, ran his index finger down her bare stomach and asked if she wanted to go into a bathroom with him. When she said no, she recalled Ratner saying, “Don’t you want to be famous?”\n\nA day or two later, Ratner again asked her to go into the bathroom with him, and again asked if she wanted to be a movie star. He offered to give her a line of dialogue in the film. Sasaki said no.\n\nSinger said Ratner has no recollection of the alleged incident.\n\nJorina King also worked as a background actress on the film.\n\nOn the first day of shooting, King said, Ratner plucked her from a crowd of female extras and said he later wanted to discuss giving her a speaking part.\n\nThe next day, he asked her to come to his trailer and told her he needed to see her breasts, she said. King said she rejected his request and hid in a restroom. “I figured if I could stay out of his eyesight, if I could stay away from him, he will forget about me and he will choose someone else, and that is exactly what happened,” King said, adding that she feared him — and losing the work.\n\nKent Richards, who was a production assistant on the set of “Rush Hour 2,” said that Sasaki told him, during the production, about her experience with Ratner. He also said he recalled a conversation in which King expressed being uncomfortable on set, and referenced Ratner. Richards also said two or three other background actresses complained to him, alleging that Ratner asked them to show him their breasts or to touch his penis. Singer disputed Richards’ account, calling it a “secondhand story about unnamed individuals.”\n\nDavid Anthony, whose company at the time, Background Players, handled extras casting for the film’s shoot in L.A. and Las Vegas, said that three background actresses who worked on the project told him that Ratner had asked them out on “dates.”\n\n“In Brett’s defense, I am sure he is not the only heterosexual man hitting on women on that set,” he said.\n\nKing, who later founded the background casting agency Wild Streak Talent, said that she’d dealt with brusque men on movie sets, but nothing like Ratner.\n\n“He feels entitled, that this is what he wants, this is how it is going to be, and this feels like normal business to him,” she said.\n\nSinger called King’s claims “absurd” and “nonsensical.” “The movie was obviously already cast and shooting, so the notion that there would be a discussion of getting her a speaking role in the middle of a movie shoot is ridiculous,” Singer said.\n\nHe provided a statement by James M. Freitag, an assistant director on the set, who said that he received no such complaints during “Rush Hour 2” filming.\n\n“Any complaints of any kind including sexual harassment would be immediately directed to my attention,” Freitag said. “There were no complaints reported to me whatsoever.”\n\nNatasha Henstridge in August 2015. Michael Tran / FilmMagic\n\nSeeing Ratner again\n\nSince their encounter in New York in the 1990s, Henstridge, 43, has crossed paths with Ratner numerous times in Hollywood, including once during the last ten years at a party with her friend Amy Del Rio.\n\n“She saw someone in the crowd and her body language changed,” said Del Rio, an entertainment lawyer. “I asked her if she was OK and she said ‘no.’ Then I saw she was looking at Brett Ratner. I asked if she knew him. She said, ‘He’s not a good guy. I knew him back in the day in New York.’ She was really weird, like, ‘I wanna get out of here.’”\n\nHenstridge detailed the alleged encounter with Ratner to Del Rio only within the last month. But three other people — a former boyfriend, a neighbor and a close friend — confirmed to The Times that Henstridge told them about the incident over a roughly 10-year period beginning in the mid-1990s.\n\nAlthough he acknowledged spending time with her, Ratner disputed Henstridge’s claims. Singer accused the actress of being “upset after learning my client had a girlfriend who he would not leave” for her.\n\nHenstridge told The Times that she was not interested in dating Ratner and, before that night, had never been alone with him.\n\nHenstridge’s neighbor Lilith Berdischewsky said that the actress told her about the incident with Ratner in the mid-2000s. “I remember when she was going to some audition and she says, ‘I don’t know whether I should go or not, but [Ratner] probably is not going to be there.’ And she came back and she was shaking,” Berdischewsky recalled.\n\nIndeed, Henstridge, who recently appeared on the television shows “Medinah” and “Beauty & the Beast,” went to an audition for the TV drama “Prison Break,” which Ratner executive produced, knowing he might be in the room.\n\n“And he was,” said the actress, who has two sons, ages 16 and 19. “I had two young kids and had to go to work and make a living. And he just acted like we were old friends from back in the day in New York, saying, ‘I haven’t seen you in years.’ Auditioning is already bad enough. But trying to focus on the work, I just felt sick.”\n\nShe didn’t get the part.\n\namy.kaufman@latimes.com\n\n@AmyKinLA\n\ndaniel.miller@latimes.com\n\n@danielnmiller\n\nTimes staff writers Victoria Kim, Andrew Khouri and Glenn Whipp contributed to this report.\n\nALSO\n\nBeverly Hills police launch sexual assault investigations involving Harvey Weinstein and James Toback\n\nNPR chief editor is placed on leave after sexual harassment accusations\n\nAfter NBC ousts Mark Halperin over sexual harassment claims, TV news executives wonder who is next", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/4c03180/2147483647/strip/true/crop/1152x1152+448+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2f%2Fb2%2F31d4f07d4f2a9e19b5dedeeeab73%2Fimg-535dd87e-turbine-la-bio-daniel-miller", "https://www.trbimg.com/img-59f8f486/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-007/2000", "https://www.trbimg.com/img-59f8f916/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-008/2000", "https://www.trbimg.com/img-59f8ef9b/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-006/2000", "https://www.trbimg.com/img-59f8ef9a/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-005/2000", "https://ca-times.brightspotcdn.com/dims4/default/764fee7/2147483647/strip/true/crop/2048x1075+0+149/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/8c0c525/2147483647/strip/true/crop/2048x1373+0+0/resize/840x563!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "https://www.trbimg.com/img-59f8ef9a/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-002/2000", "https://ca-times.brightspotcdn.com/dims4/default/c623a81/2147483647/strip/true/crop/1152x1152+448+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1a%2F31%2F28f0d171a9c1a821bbd43fae6356%2Fimg-535db9e3-turbine-la-bio-amy-kaufman", "https://www.trbimg.com/img-59f8ef9c/turbine/la-fi-ct-brett-ratner-allegations-pictures-201-004/2000", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/764fee7/2147483647/strip/true/crop/2048x1075+0+149/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "keywords": [], "authors": ["Amy Kaufman Covers Film", "Celebrity", "Pop Culture At The Los Angeles Times. She Is The Author Of The New York Times Bestseller", "Bachelor Nation", "Inside The World Of America S Favorite Guilty Pleasure.", "Daniel Miller Is An Enterprise Business Reporter For The Los Angeles Times", "Working On Investigations", "Features", "Projects. An L.A. Native", "Ucla Graduate"], "canonical_link": "https://www.latimes.com/business/hollywood/la-fi-ct-brett-ratner-allegations-20171101-htmlstory.html", "title": "Six women accuse filmmaker Brett Ratner of sexual harassment or misconduct", "meta_data": {"og": {"title": "Six women accuse filmmaker Brett Ratner of sexual harassment or misconduct", "url": "https://www.latimes.com/business/hollywood/la-fi-ct-brett-ratner-allegations-20171101-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/764fee7/2147483647/strip/true/crop/2048x1075+0+149/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/764fee7/2147483647/strip/true/crop/2048x1075+0+149/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "la\u0096ca\u0096sneaks\u0096tower"}, "description": "Natasha Henstridge was watching a movie on Brett Ratner’s couch when she fell asleep.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/daniel-miller", "content_tier": "metered", "published_time": "2017-11-01T12:00:00", "opinion": "false", "section": "Company Town"}, "twitter": {"card": "summary_large_image", "creator": "@AmyKinLA", "description": "Natasha Henstridge was watching a movie on Brett Ratner’s couch when she fell asleep.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/6e70793/2147483647/strip/true/crop/2048x1152+0+111/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F45%2F5602ee2862bd43f1f67bb7058047%2Fla-1509485526-kb96ifkzmz-snap-image", "alt": "la\u0096ca\u0096sneaks\u0096tower"}, "site": "@latimes", "title": "Six women accuse filmmaker Brett Ratner of sexual harassment or misconduct"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimesent"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "In interviews with the Los Angeles Times, six women – including actresses Olivia Munn and Natasha Henstridge — accused filmmaker Brett Ratner of sexual harassment or misconduct.", "brightspot.contentId": "00000169-7ae4-d52e-ab7b-7eed6b7c0000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1509465600.0, "source": "https://www.latimes.com", "summary": ""}