{"url": "https://www.thehollywoodgossip.com/2018/03/kim-zolciak-and-nene-leakes-feud-explodes-on-twitter/", "text": "So, remember how that whole feud of Brielle Biermann and Kim Zolciak versus Kenya Moore started when Brielle pointed out on social media that she'd found roaches in NeNe Leakes' home?\n\nWell, that's not over.\n\nAnd now that #RoachGate was brought up again, NeNe and Kim are going at it on Twitter.\n\nBecause #RoachGate came up again, thanks to The Real Housewives of Atlanta's recent episodes featuring the Barcelona trip, the old resentments are boiling over and onto social media.\n\n\"Wigfield & cigarette breath tried 2 discredit me all season long!\"\n\nBy \"Wigfield,\" she means Brielle Biermann. By \"cigarette breath,\" she means Brielle's mother, Kim Zolciak.\n\n\"They came [into] my house wit ROACH gate, I’m on drugs etc.\"\n\nNeNe has accused Kim of racism, for which Kim has said that she received death threats. That's scary and serious.\n\nNeNe's rant continues:\n\n\"I tried my best 2 befriend them but This is why U can never WIN when U play DIRTY.\"\n\nKim Zolciak hit back at NeNe with a series of tweets, writing:\n\n\"This is exactly why I said this b--ch has to be on something.\"\n\nAllegations of drug use aren't really funny, but it seems that Kim believes that NeNe may be genuinely unstable.\n\n\"She's insane! Nobody wanted to be befriended by a b--ch who consistently shows their ass.\"\n\nRemember, folks, that very few people become Real Housewives if they're open to easily and quietly resolving interpersonal conflicts. They're supposed to be entertaining, not nice.\n\nKim insists taht she knows who NeNe is and what she's really like.\n\n\"WE know who you are. The REAL you! Nobody values your friendship. Haven't for years! You have victims not friends.\"\n\nKim goes on to shoot down NeNe's accusations.\n\n\"'Cigarette breathe?' I haven't smoked a cigarette in years.\"\n\nSmoking is gross, but it's a powerfully addictive habit and, until very recently, there were widespread social pressures for people to pick up the habit when they were very young.\n\nEven now, there are still pressures to smoke within certain pockets of society, such as in intensely rural areas and in industries such as modeling.\n\nGood for Kim Zolciak for ridding herself of that addiction.\n\nKim goes on to double down on the presence, which was recorded on video, of roaches in NeNe's house.\n\n\"The bug was in your house just a few months ago. FACT What else?\"\n\nAs you may recall, when NeNe slammed Brielle Biermann as a Kylie Jenner wannabe, she also accused her of planting the bugs.\n\nSpecifically, she said that they must have emerged from Brielle's genitals, though she did not phrase it that way.\n\nKim continued her retort to NeNe's angry post.\n\n\"I pray to god I'm not this miserable and bored at 50 Imagine being so sad and stupid that the only time anyone's mentioning you is if you're mentioning someone you 'have no time for.'\"\n\nNotice Kim's dig about NeNe Leakes being older. That's come up already during this feud.\n\nKim Zolciak, though a mother of six children, is only 39 years old.\n\n\"Off to film my OWN show!\" Kim concludes.\n\nShe then sends her best wishes to her fans.\n\n\"Have a great day you guys! Stay blessed not stressed/pressed.\"\n\nAt the beginning, Kenya Moore was involved in the feud, but fans assume that she was only so outspoken because she was trying to save her job at the time.\n\nNow that Marc Daly has made his RHOA debut, she doesn't need to fight with everyone in sight in order to have a storyline.\n\nBut NeNe Leakes ... is still who she's always been. And the same goes for Kim Zolciak.\n\nTheir explosive feud doesn't show any sign of dying down in the near future.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--uQEwq5kz--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1507748050/attachment/nene-leakes-kim-zolciak-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--uQEwq5kz--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1507748050/attachment/nene-leakes-kim-zolciak-split.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/03/kim-zolciak-and-nene-leakes-feud-explodes-on-twitter/", "title": "Kim Zolciak vs. NeNe Leakes: #RoachGate Feud EXPLODES on Twitter", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/03/kim-zolciak-and-nene-leakes-feud-explodes-on-twitter/", "title": "Kim Zolciak vs. NeNe Leakes: #RoachGate Feud EXPLODES on Twitter", "description": "The Real Housewives of Atlanta star NeNe Leakes took aim at Kim Zolciak after #RoachGate came up, and Kim fired back at her costar.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--7NX6udZR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1392413228/nene-leakes-red-carpet-imag.jpg", "type": "image/jpeg", "width": 630, "height": 632}}, "article": {"published_time": "2018-03-28T14:34:05-04:00", "modified_time": "2018-03-28T14:44:27-04:00", "tag": "Twitter", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kim Zolciak vs. NeNe Leakes: #RoachGate Feud EXPLODES on Twitter", "description": "The Real Housewives of Atlanta star NeNe Leakes took aim at Kim Zolciak after #RoachGate came up, and Kim fired back at her costar.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--uQEwq5kz--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1507748050/attachment/nene-leakes-kim-zolciak-split.png"}}, "description": "The Real Housewives of Atlanta star NeNe Leakes took aim at Kim Zolciak after #RoachGate came up, and Kim fired back at her costar."}, "movies": [], "publish_date": 1522262045.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}