{"url": "collider.com/ashley-judd-interview-berlin-station-twin-peaks/", "text": "The Epix drama series Berlin Station is back for Season 2, as the Far Right tide is sweeping across Europe while Germany is in the midst of a pivotal election. And with Alt-Right party leader Katerina Gerhardt captivating disillusioned voters fed up with the status quo, the team at Berlin Station must determine the nature and level of the threat that she poses and what they should do about it.\n\nDuring this 1-on-1 interview with Collider, actress Ashley Judd (who plays the new Chief of Station, BB Yates) talked about what drew her to Berlin Station and this character, how her TED Talk led them to want to cast her, crashing the boy’s club, finding a balance between acting and her humanitarian work, and loving action. She also talked about what a pleasure it was to be a part of Twin Peaks: The Return, and to work with David Lynch and Richard Beymer.\n\nCollider: How did you come to Season 2 of Berlin Station? What was it that drew you to the show?\n\nASHLEY JUDD: My manager reached out to me and said that the good folks at Epix had a very special show with an incredibly strong ensemble cast, and that the show was very smart. She said that they had watched my TED Talk and they wanted me to play BB Yates, who would be the boss of the CIA in Germany. I loved the idea, instantly, particularly when I watched Season 1 and saw what a strong actor and character Valerie Edwards is and the fact that, in the second season, Esther Krug would be the head of German intelligence. I think that the show looks like what the 21st century should be, in terms of gender parity in the workplace. So, when you have all of us together, augmented with Keke [Palmer], it’s phenomenal. I’m 49 and Michelle [Forbes] is 52, and that’s fantastic. I think that audiences are going to love it.\n\nHow is BB Yates received by the boy’s club of being in a profession like this?\n\nJUDD: Another thing that appealed to me was learning that, as the season evolved, I would continue to be crashing the boy’s club. My nemesis is the U.S. Ambassador, who’s a political appointee. He’s not someone with a background in diplomacy from the state department. He’s someone who’s violating the traditional boundary between the White House and the CIA. With BB leaving, the CIA becomes a place of resistance, so it adds to the intrigue.\n\nHave you ever had someone want to cast you because of your TED Talk before this?\n\nJUDD: It affirmed to me that they want me for exactly who and what I am. I’ve been acting now for a little over 20 years and I have a body of work that accurately expresses what I’m capable of doing, Paramount has been a studio home for me since Kiss the Girls, so there are many reasons why I could be an obvious choice, but I have all of my international travel with my humanitarian work and I’m a PhD student at University of California Berkeley. For them to say, “Oh, we love Ashley! Let’s look at her TED Talk and see how that energy fits with BB,” was just absolutely delightful. It’s an example of, how I do something is how I do everything. There doesn’t have to be a false separation between my advocacy voice and how I show up in my acting.\n\nBecause you do so much outside of acting, is it hard to find acting roles that get you excited enough to want to take time away from the other work that you do, or do you like to have a balance?\n\nJUDD: I like the balance. I loved working on Twin Peaks. Mr. Lynch called and said that he’d written something for me, which was a wonderful compliment and seemed like it would be really fun. And then, I did a movie about human trafficking (called Trafficked), that came out in October. I was in India for the month of March. I was in Jordan, working with Syrian refugees, before India. I’ve also been to the war zone in eastern Ukraine. So, I have a very balanced and full life, and acting will always, God willing, be a part of that life ‘cause I love it.\n\nDo the worlds that you work in – acting and humanitarian – feel very different?\n\nJUDD: Berlin Station has wet my appetite for acting again. I’m more open-minded now about scripts than I was, over the past couple of years, when I was really hunkered down pretty exclusively in the humanitarian work. Acting is very joyful for me. The process is draining and time consuming, but the acting itself is really joyful.\n\nHave you had fun doing some of the more physical roles that you’ve done?\n\nJUDD: I love that! I made sure that I told them right away, on Berlin Station as I did on Missing, that I would love to be able to fight. I love to fight.\n\nAre you able to get out in the field and do that, this season?\n\nJUDD: There’s a little bit, but I’m running the station, making it all happen. So far, I haven’t had a chance to do a big fight scene.\n\nAs the person who has to come in to run things, how does everybody else react to her?\n\nJUDD: Well, there’s always workplace relationships, and some are more straightforward than others. Part of what’s so nice about the work with Keke is that I mentor her and it’s a strong female-to-female alliance.\n\nHow was it to work on Twin Peaks with Richard Beymer, who was there from the beginning?\n\nJUDD: It was super cool. He’s such a lovely man. Of course, I asked Mr. Lynch what the humming sound was, and he said, “Oh, I can’t tell you that!”\n\nBerlin Station airs on Sunday nights on Epix.", "images": ["https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd.jpg", "https://cdn.collider.com/wp-content/uploads/2020/04/too-hot-to-handle-harry-francesca-thumbnail-171x160.jpg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Dark.png", "https://cdn.collider.com/wp-content/uploads/2020/04/clone-wars-season-7-episode-9-thumbnail-171x160.jpeg", "https://cdn.collider.com/wp-content/uploads/2017/10/berlin-station-ashley-judd-slice-600x200.jpg", "https://cdn.collider.com/wp-content/uploads/2020/04/the-last-kids-on-earth-netflix-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2017/10/berlin-station-ashley-judd-04-600x442.jpg", "https://collider.com/wp-content/themes/collider-v3/images/close-circle-512.png", "https://cdn.collider.com/wp-content/uploads/2020/04/nick-wolfhard-thumbnail-171x160.jpeg", "https://www.facebook.com/tr?id=1628636477376373&ev=PageView&noscript=1", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Light.png", "https://cdn.collider.com/wp-content/uploads/2020/02/bosch-titus-welliver-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd-600x421.jpg"], "top_img": "https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd.jpg", "keywords": [], "authors": ["Christina Radish"], "canonical_link": "https://collider.com/ashley-judd-interview-berlin-station-twin-peaks/", "title": "Ashley Judd on ‘Berlin Station’ Season 2 & Working with David Lynch on ‘Twin Peaks’", "meta_data": {"msapplication-square70x70logo": "/smalltile.png", "msapplication-square150x150logo": "/mediumtile.png", "msapplication-wide310x150logo": "/widetile.png", "msapplication-square310x310logo": "/largetile.png", "description": "Christina Radish speaks with Ashley Judd on her key role in 'Berlin Station' Season 2 and working with director David Lynch on 'Twin Peaks: The Return'.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Ashley Judd on 'Berlin Station' Season 2 & Working with David Lynch on 'Twin Peaks'", "description": "Christina Radish speaks with Ashley Judd on her key role in 'Berlin Station' Season 2 and working with director David Lynch on 'Twin Peaks: The Return'.", "url": "https://collider.com/ashley-judd-interview-berlin-station-twin-peaks/", "site_name": "Collider", "updated_time": "2019-09-24T22:10:08+00:00", "image": {"identifier": "https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd.jpg", "secure_url": "https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd.jpg", "width": 900, "height": 631}}, "article": {"publisher": "https://www.facebook.com/colliderdotcom", "author": "https://www.facebook.com/christinaradish", "tag": "Twin Peaks The Return", "section": "Interviews", "published_time": "2017-10-16T14:59:58+00:00", "modified_time": "2019-09-24T22:10:08+00:00"}, "fb": {"app_id": 190932086012, "pages": 160246414365}, "twitter": {"card": "summary_large_image", "description": "Christina Radish speaks with Ashley Judd on her key role in 'Berlin Station' Season 2 and working with director David Lynch on 'Twin Peaks: The Return'.", "title": "Ashley Judd on Berlin Station Season 2 & Twin Peaks", "site": "@collidernews", "image": "https://cdn.collider.com/wp-content/uploads/2017/10/twin-peaks-ashley-judd.jpg", "creator": "@christinaradish"}, "generator": "WordPress 5.3.2", "ia": {"markup_url": "https://collider.com/ashley-judd-interview-berlin-station-twin-peaks/?ia_markup=1"}, "msvalidate.01": "F97A06145E9767C313B356E7E5B833F3", "viewport": "width=device-width", "google-site-verification": "rtgRWlKYqmg2IwU4e9PBjtt31jXoTjotyW6iJbyqdyc", "verify-v1": "ag44RccQF3Xr4VqGQnxB+TOx8+rCP4SHaCwwGAtuWzc="}, "movies": [], "publish_date": 1508165998.0, "source": "http://collider.com", "summary": ""}