{"url": "https://en.wikipedia.org/wiki/Orlando_Bloom", "text": "English actor\n\nOrlando Jonathan Blanchard Copeland Bloom[1] (born 13 January 1977)[2] is an English actor. He made his breakthrough as the character Legolas in The Lord of the Rings film series, a role he reprised in The Hobbit film series. He gained further acclaim by appearing in epic fantasy, historical, and adventure films, most notably as Will Turner in the Pirates of the Caribbean film series.\n\nBloom subsequently established himself as a leading man in Hollywood films, with roles such as Paris in Troy (2004) and Balian de Ibelin in Kingdom of Heaven (2005). He currently stars in the Amazon Prime Video series Carnival Row (2019–present).\n\nHe made his professional stage debut in West End's In Celebration at the Duke of York's Theatre in London in 2007 and starred in a Broadway adaption of Romeo and Juliet in 2013. In 2009, Bloom was named a UNICEF Goodwill Ambassador. In 2015 he received the BAFTA Britannia Humanitarian Award.[3]\n\nEarly life [ edit ]\n\nBloom was born on 13 January 1977 in Canterbury, Kent, and was named after the 16th-century English composer Orlando Gibbons.[4][5] He has an older sister, Samantha Bloom.[6]\n\nOrlando initially believed that his biological father was his mother's husband (his stepfather), the Jewish South African-born anti-Apartheid novelist Harry Saul Bloom (1913–1981), who died when Bloom was four years old. However, when he was thirteen, Bloom's mother revealed to him that his biological father was actually Colin Stone, his mother's partner and family friend.[7][8][9] Stone, the principal of the Concorde International language school,[10] became Orlando Bloom's legal guardian after Harry Bloom's death.[9]\n\nBloom's mother, Sonia Constance Josephine (née Copeland), was born in Kolkata, India, the daughter of Francis John Copeland, a physician and surgeon, and Betty Constance Josephine (née Walker). Through her, Bloom is a cousin of photographer Sebastian Copeland.[11][12] Bloom's mother's family lived in Tasmania (Australia), Japan, and India, and were of English descent, some of them having originally come from Kent.[7]\n\nBloom was brought up in the Church of England.[13] He attended St Peter's Methodist Primary School,[14] then the junior school of the King's School before proceeding to St Edmund's School in Canterbury. Bloom was discovered to be dyslexic,[9][15] and was encouraged by his mother to take art and drama classes.[9] After being spurred into action following his school prize submission to panto actor Richard Sieben in 1992, in 1993, he moved to London to follow a two-year A Level course in Drama, Photography and Sculpture at Fine Arts College, Hampstead. He then joined the National Youth Theatre, spending two seasons there and earning a scholarship to train at the British American Drama Academy.[16] Bloom began acting professionally with television roles in episodes of Casualty and Midsomer Murders,[9] and subsequently made his film debut in Wilde (1997), opposite Stephen Fry, before entering the Guildhall School of Music and Drama in London, where he studied acting.[17]\n\nCareer [ edit ]\n\nBloom's first appearance on the screen was in a small role, as a rent boy, in the 1997 film Wilde. Two days after graduating from Guildhall in 1999,[18] he was cast in his first major role, playing Legolas in The Lord of the Rings film trilogy (2001–2003).[16] He had originally auditioned for the part of Faramir, who does not appear until the second movie, but the director, Peter Jackson, cast him as Legolas instead. While shooting a scene, he broke a rib after falling off a horse, but eventually recovered and continued shooting.[19] At the same time, Bloom also played a brief role in Ridley Scott's war film Black Hawk Down as PFC Todd Blackburn. In 2002, he was chosen as one of the Teen People \"25 Hottest Stars Under 25\" and was named People's hottest Hollywood bachelor in the magazine's 2004 list.[16] All members of the cast of the Rings films were nominated for Best Ensemble Acting at the Screen Actors Guild Awards for three years in a row, finally winning in 2003 for the third film, The Lord of the Rings: The Return of the King. Bloom has also won other awards, including European Film Awards, Hollywood Festival Award, Empire Awards and Teen Choice Awards, and has been nominated for many others. Most of Bloom's box office successes have been as part of an ensemble cast.[20]\n\nBloom next starred opposite Keira Knightley and Johnny Depp in Pirates of the Caribbean: The Curse of the Black Pearl, which was a blockbuster hit during the summer of 2003. After the success of Pirates, Bloom next took to the screen as Paris, the man who effectively started the Trojan War, in the 2004 Spring blockbuster, Troy opposite Brad Pitt, Eric Bana and Peter O'Toole. He subsequently played the lead roles in Ridley Scott's Kingdom of Heaven and Cameron Crowe's Elizabethtown (both 2005). In 2006, Bloom starred in sequel Pirates of the Caribbean: Dead Man's Chest and in the independently made Haven, of which he was also executive producer. In the same year he was one of the guest stars in the sitcom Extras, in which he portrayed an exaggeratedly arrogant, narcissistic version of himself who had a great loathing for Johnny Depp (his co-star in Pirates of the Caribbean); Bloom pushed for Extras to go further by making his part unlikable, and contributed to the gag about him admiring Depp out of sheer jealousy, that Depp was far more talented than he was, not to mention rated higher than him on the 'top hottest' charts.[21] Also in 2006, Bloom was the most searched male on Google News.[9] As of May 2007, Bloom has appeared in four of the top 15 highest-grossing films of all time.[18]\n\nBloom then again portrayed Will Turner, in Pirates of the Caribbean: At World's End, released on 24 May 2007. Bloom, who had intended to become a stage actor after graduating from the Guildhall School of Music and Drama, had stated that he would like to leave films for a time and instead appear in stage roles,[16] and is \"avidly looking for the right sort of material that [he] can do something with\"[22] and go \"back to basics.\"[23] During the summer of 2007 he appeared in a London revival of In Celebration, a play by David Storey.[23] His character was one of three brothers returning home for their parents' 40th wedding anniversary.[25] On 24 August 2007 he made his first ever TV commercial appearance on late-night Japanese TV, promoting the Uno brand of cosmetics maker Shiseido. A \"one night only\", 2-minute version of the Sci-Fi themed commercial kicked off the product's marketing campaign.[26] In 2008 he signed on to play a small role in the British film An Education[27] but dropped out to take the lead in Johnnie To's film Red Circle. Also in 2009, he was one of many stars to appear in New York, I Love You, which contained 12 short films in one. He then appeared in The Three Musketeers opposite Milla Jovovich, Logan Lerman, Matthew Macfadyen, Ray Stevenson, Luke Evans, Juno Temple and Christoph Waltz, released in 2011.\n\nBloom reprised his role as Legolas in parts two and three of The Hobbit, Peter Jackson's three-part prequel to The Lord of the Rings trilogy.[28]\n\nBloom made his Broadway stage debut as Romeo in Romeo and Juliet in August 2013 at the Richard Rodgers Theatre.[29] The New York Times theatre critic Ben Brantley described Bloom's performance as \"a first-rate Broadway debut\"[30] in the title role: \"For once, we have a Romeo who evolves substantively, from a posturing youth in love with love, to a man who discovers the startling revelation of real love, with a last-act descent into bilious, bitter anger that verges on madness.\"\n\nIn October 2011, Bloom stated that he would like to return for a fifth Pirates of the Caribbean film. Bloom did reprise his character, Will Turner, in a supporting role in the fifth film, Pirates of the Caribbean: Dead Men Tell No Tales, which was released in May 2017.[31]\n\nBloom is currently starring in the Trafalgar Studios production of Killer Joe, and in the Amazon Prime TV show Carnival Row.\n\nPersonal life [ edit ]\n\nBloom has said that he tries \"not to exclude himself from real life as much as possible.\"[9] During filming in Morocco for Kingdom of Heaven, Bloom rescued and adopted a dog, Sidi (a black Saluki mix with a white mark on his chest).[32][33]\n\nIn 2004, he became a full member of SGI-UK (the UK branch of Soka Gakkai International), a lay Buddhist association affiliated with the teachings of Nichiren.[34][35]\n\nBloom has also been a part of Global Green, an environmental company, since the early 2000s.[20] As part of his environmental involvement, he has renovated his London home to use solar panels, incorporate recycled materials, and use energy efficient lightbulbs.[9][20] Bloom has been approached by UNICEF to act as an international ambassador.[20]\n\nBloom has a tattoo of the Elvish word \"nine\" on his right wrist, written in fictional Tengwar Elvish script, a reference to his involvement in The Lord of the Rings as one of the nine members of the Fellowship of the Ring. The other actors of \"The Fellowship\" (Sean Astin, Sean Bean, Billy Boyd, Ian McKellen, Dominic Monaghan, Viggo Mortensen, and Elijah Wood) got the same tattoo with the exception of John Rhys-Davies whose stunt double got the tattoo instead.[36][37][38] Bloom also has a tattoo of a sun on his lower left abdomen, which he got at age 15 just before moving to London.\n\nOn 12 February 2009, Bloom actively participated in the 'Australia Unites' fundraiser to raise support for the victims of the Australian bushfires on 7 February 2009.[39]\n\nOn 12 October 2009, Bloom was named a UNICEF Goodwill Ambassador. He has been involved in the organisation since 2007 and has visited schools and villages in Nepal in support of sanitation and education programmes.[40] Bloom also visited the city of Slovyansk in eastern Ukraine in April 2016 to raise awareness of the education crisis facing children during the military conflict with Russia.[41]\n\nBloom has sustained several injuries: he broke his left arm and cracked his skull three times, broke his nose while playing rugby union, broke his right leg skiing in Switzerland, broke his left leg in a motorbike crash, and broke his right wrist while snowboarding.[18] He also broke his back when he slipped trying to reach a roof terrace of a friend's house and fell three floors.[42] He also broke some ribs while shooting The Lord of the Rings.[43]\n\nOn 13 July 2009, four hooded teenagers broke into the Hollywood Hills home of Orlando Bloom and stole nearly half a million dollars' worth of possessions. The burglars, dubbed the \"Bling Ring,\" targeted the homes of young celebrities. Most of Bloom's stolen items were retrieved.[44]\n\nRelationships [ edit ]\n\nBloom had an \"on-and-off relationship\"[45] with American actress Kate Bosworth, from 2003 until ending the relationship in September 2006.[46][47]\n\nIn late 2007, Bloom began dating Australian supermodel Miranda Kerr.[48] They announced their engagement in June 2010,[49] and were married the following month.[50] Kerr gave birth to their son on 6 January 2011 in Los Angeles.[51][52] On 25 October 2013, Bloom and Kerr announced that they had separated several months earlier, and intended to end their marriage. They were divorced by the end of 2013.[53][54]\n\nBloom began dating American singer Katy Perry shortly after the 73rd Golden Globe Awards in January 2016;[55] however, the couple confirmed in February 2017 that they had split. They resumed their relationship in April 2018,[56][57][58] and they became engaged on 14 February 2019.[59][60] On 5 March 2020, it was revealed through the music video for Perry's single \"Never Worn White\" that the couple are expecting their first child together, a girl.[61]\n\nAccolades [ edit ]\n\nBloom was named the twelfth most influential person in British culture in a 2004 poll of cultural experts conducted for the BBC.[62] Bloom appeared in his home town of Canterbury on 13 July 2010, where he was presented with an honorary degree from the University of Kent at Canterbury Cathedral.[63] For contributions to the film industry, Bloom was inducted into the Hollywood Walk of Fame on 2 April 2014.[64][65] His motion pictures walk of fame star is located at 6927 Hollywood Boulevard.[66]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Orlando_Bloom_at_Venice_Festival.jpg/220px-Orlando_Bloom_at_Venice_Festival.jpg", "https://upload.wikimedia.org/wikipedia/commons/8/81/Orlando_Bloom_Cannes_2013.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Orlando_Bloom_Cannes_2013.jpg/220px-Orlando_Bloom_Cannes_2013.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Orlando_Bloom_2010.jpg/170px-Orlando_Bloom_2010.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Orlando_Bloom_3.jpg/180px-Orlando_Bloom_3.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/81/Orlando_Bloom_Cannes_2013.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Orlando_Bloom", "title": "Orlando Bloom", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/81/Orlando_Bloom_Cannes_2013.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}