{"url": "https://www.cosmopolitan.com/uk/entertainment/a20979533/ariana-grande-and-pete-davidson-a-timeline-of-their-relationship/", "text": "March 2016: Ariana Grande meets Pete Davidson when she guest presents on Saturday Night Live - although Ariana is with Mac Miller and Pete is dating Cazzie David.\n\n\n\nNBC\n\n10th May 2018: Pop star Ariana shocks fans when she releases an emotional statement confirming she's ended her two year relationship with Mac Miller.\n\nTaking to Instagram, she writes: \"Hi! This is one of my best friends in the whole world and favourite people on the planet Malcolm McCormick. I respect and adore him endlessly and am grateful to have him in my life in any form, at all times regardless of how our relationship changes or what the universe holds for each of us!\"\n\nShe adds: \"I can't wait to know and support you forever and I'm so proud of you!!\"\n\nInstagram\n\nBut after all that, the couple have now unfollowed each other on social media. Hmm...\n\n12th May 2018: Ariana and Pete are spotted hanging out at the Saturday Night Live after-party - where else?! According to Us Weekly Ariana spends the whole night chillin' with Pete's mum.\n\n16th May 2018: Another break up announcement comes as Pete reveals that he and Larry David's daughter Cazzie David are over. He too shares a sweet message calling his ex a \"very talented girl.\"\n\nGetty Images\n\n20th May 2018: As the dust settles on their former relationships, Ariana and Pete are seen getting close at the Billboard Music Awards. “After Ariana’s performance, they were backstage and he had his arm around her,” a source tells People. “They seemed very lovey-dovey. He was hanging out with her and her friends with his arm around her. She seemed quite smitten.”\n\n21st May: News breaks that these two are definitely an item - but according to People magazine, the couple have only “just started” dating, and it’s still “very casual”.\n\n23rd May: Fans notice that this 'casually dating couple' have matching tattoos already! The evidence comes thanks to one eagle-eyed Twitter user who notices that they both have a tiny cloud inked on their finger:\n\n23rd May 2018: Ariana Grande hits back at a fan who tells her she should have stayed with Mac Miller. After one follower tweets the 24-year-0ld a pretty harsh message along the lines of: \"Mac Miller totalling his G wagon and getting a DUI after Ariana Grande dumped him for another dude after he poured his heart out on a ten song album to her called the divine feminine is just the most heartbreaking thing happening in Hollywood\".\n\nAriana simply isn't here for his opinion about her relationship, and replies with this note:\n\n25th May 2018: Following Ariana's sassy clap back, Pete has his own response to people who are saying the singer shouldn't date him because he has BPD (Borderline Personality Disorder).\n\n28th May 2018: The pair end Memorial Weekend in the US on a sweet note as they share roasted marshmallows over a fire pit. In a video posted on Ariana's Instagram Stories they sit side by side while tucking into homemade s’mores. They're faces might not be showing, but fans notice the SNL star’s arm tattoos.\n\n29th May 2018: The celebs have a public date night as Ariana attends Pete's stand-up set at The Comedy Store in Los Angeles. Sharing a snap on her Instagram Stories, Ariana captions a photo of her new man with a few emojis, including the heart-eyed smiley face.\n\n30th May 2018: Ariana and Pete finally go Instagram official in the form of a Harry Potter homage - as if they weren't our favourite new couple already. While Ariana is rocking Slytherin, Peter dresses up in a Gryffindor cloak. And FYI his hat literally says \"I love you\" - so our hearts are officially melted.\n\nOh yeah, and then Ariana comments: \"u tryna slytherin (i'm deleting my account now)\".\n\nWe're done.\n\n2nd June 2018: Ariana and Pete are clearly pretty into each other at this point, and what better way to prove it than by getting inked? Pete decides to get not one but two tattoos dedicated to his new love. LA tattoo artist London Reese shared pictures of Pete's new inky additions - the initials 'AG' on his hand and Ariana's famous 'Dangerous Woman' bunny ears behind his ear - on Instagram. He posted them with the caption: \"We had a good night somewhere in the hills of Los Angeles. Pete loves him some Ariana.\"\n\nInstagram\n\n4th June 2018: Pete posts the thirstiest Instagram Story about Ariana.\n\nSo romantic. Right?\n\n12th June 2018: The couple is reportedly engaged! Immediately after reports starting circulating about the engagement, Ariana liked tweets seemingly confirming the news. Congrats!\n\n15th June 2018: Pete confirms the couple's engagement with a post on Instagram featuring Ariana's massive ring. \"u know what you’d dream it be like ? it’s better than that\", he captions it.\n\nLooks like it's game on.\n\n19th June 2018: Ariana releases details of her new album Sweetener. While much of it was written during her relationship with Mac Miller, she made a last minute addition in the form of a song named Pete.\n\n‘pete’ ! — Ariana Grande (@ArianaGrande) June 18, 2018\n\nWhen some fans reacted badly to the news of Pete already getting his own song, she clapped back in true Ariana style.\n\n“I been the f--k thru it and life’s too short to be cryptic n shit about something as beautiful as this love I’m in,” she wrote. “So ǝʇǝԀ it is.”\n\nforreal. the truth is ☕️ i been the fuck thru it and life’s too short to be cryptic n shit about something as beautiful as this love I’m in. so ǝʇǝԀ it is. — Ariana Grande (@ArianaGrande) June 18, 2018\n\nFair enough.\n\n20th June 2018: Pete and Ariana get *more* matching tattoos along with some other friends, and take to social media to show them off. Ariana posts a video alongside pal Courtney Chipolone of their 'H2GKMO' inks, which means 'honest to God knock me out' - something Ariana once tweeted, which became a 'thing' amongst her fans.\n\n21st June 2018: Pete confirms the couple's engagement while talking to Jimmy Fallon. He said: \"It's f**king lit\". He added, \"I feel like I won a contest.\" How sweet is that?!\n\nPete Davidson talks about his engagement to Ariana Grande (Full Interview) #FallonTonight https://t.co/x2TUBF1VtP — The Tonight Show (@FallonTonight) June 21, 2018\n\n25th June 2018: The Instagram gush-off (ew) between Ariana and Pete is showing no signs of stopping, after Ariana commented on a picture of Pete with \"the most handsome ever yikes\", before regramming it with \"how\" - presumably meaning \"HOW IS HE SO FIT\". These two.\n\nInstagram\n\n26th June 2018: HAPPY BIRTHDAY, ARIANA! If there's one person who's got you a sweet message, it's Pete:\n\n\"Happy birthday to the most precious angel on earth! you’re my favorite person that ever existed :) i love you sm ☁️⚡️😍 one more for the queen. words can’t express what a real fucking treasure this one is 👑 [sic]\"\n\n27th June 2018: Ariana jumps into a fans' Instagram comments when they accuse Pete of giving them the middle finger, instead reassuring them he was doing it to the paparazzi.\n\nThe fan wrote, \"BRUH HE FLIPPING US OFF I'M DEAD,\" and instead of ignoring this musing, Ariana wrote back \"R u nuTS?????? The PAPS..not YOU……???? ever…??? stop w this shit. please. forreal. i love y’all too much for this. enough w the ig / twitter war thing. it ends now.\n\n\"Yall r so loved,\" she added. \"Stop trying to start shit everything is so beautiful right now. i'm over it. [sic]\"\n\nPeople grabbed a screenshot of the interaction here:\n\n\n\n27th June 2018: The same day, footage of Ariana and Pete singing karaoke from her birthday ends up on Twitter, and it's INCREDIBLE!\n\nariana grande and pete davidson doing evanescence karaoke is how we all know that this is true love pic.twitter.com/RZedDblUuO — xx (@xxheathheathxx) June 27, 2018\n\nI think you can agree, they totally nailed Evanescence's 'Bring Me To Life'.\n\n29th June 2018: Ariana has been wearing a jumper with Pete's face on it.\n\nAriana posted an Instagram Story of her dancing to her song 'You’ll Never Know', and eagled-eyed fans spotted that her jumper has his face on it. Erm, ADORABLE!\n\n\n\n15th July 2018: Ariana shared a video of Pete looking \"mesmerized\" as he watches her new God Is A Woman video.\n\n\"omg now that the songs out i can show u this whole clip sjsksksjsjs 🌑 that face,\" she wrote in the caption, while Pete commented: \"Mesmerized. Couldn't even like believe what I was seeing.\"\n\nMeanwhile, Ariana's manicurist shared a picture which showed that the singer has a new tattoo on her ring finger - a simple lowercase 'pete'. Cute!\n\n2nd August 2018: But wait! Why was Pete spotted with the tattoo covered up recently? Why is it not visible in these fan photos? WHY are we panicking?\n\nWe shouldn't be, tbh, because TMZ reports that Pete's simply covering up his tattoo for a movie role.\n\n16th August 2018: Pete revealed that he and Ariana decided to get married the day they met. THE DAY THEY MET!\n\n\"The day I met her, I was like, 'Hey, I'll marry you tomorrow,' \" he told GQ. \"She was calling my bluff. I sent her a picture [of engagement rings]. I was like, 'Do you like any of these?' She was like, 'Those are my favourite ones,' and I was like, 'Sick.'\"\n\nBlimey.\n\n20th August 2018: Ariana reveals that she'll add Pete's surname to hers when they get married, so she'll go by Ariana Grande-Davidson.\n\nBut she added to Ebro Darden of Apple Music's Beats 1 that she hopes to follow in the footsteps of other singers eventually and drop her surname altogether.\n\n\"I feel like I'd eventually just be Ariana: Isn't that sick? I feel like it's got a ring to it.\"\n\n21st August 2018: Ariana and Grande make their very first red carpet appearance together! They arrive at the MTV VMAs and are all over each other from the offset.\n\nGetty Images\n\nGetty Images\n\nAnd then - the best bit: she thanked him in her speech when she won the Best Pop gong for 'No Tears Left To Cry'. She simply said: “Pete Davidson. Thanks for existing. Love you.”\n\nGetty Images\n\n23rd August 2018: Ariana reveals that she and Pete are getting married pretty soon! She told Good Morning America that they're getting married next year. That way they have time to plan it.\n\nShe said: \"My friends and I, and my mom and everybody have been brainstorming and sharing ideas. It's really fun. I work so much, I've never spent so much time planning something that's personal, that feeds my soul so much and my heart. I'm gonna cry. I'm just so excited.\"\n\n\n\nFULL INTERVIEW: @ArianaGrande one-on-one with @michaelstrahan! She confirms a #Sweetener tour, talks fiancé Pete Davidson and dishes on living her best life: https://t.co/zYJ7C1h65Z pic.twitter.com/ITN9o08iWZ — Good Morning America (@GMA) August 22, 2018\n\n24th August 2018: Pete is a very naughty boy and talks about the effect Ariana has on his penis...\n\nDuring a Q&A with students at Auburn University's Welcome Week, the SNL star may opened up, saying: \"What’s it liked being engaged to Ariana Grande? It’s like what you would think it would be like but like a 100 times sicker.\n\n\"I’m a very, very happy boy who is very, very loved and I’m very lucky. And my dick's forever hard.\"\n\nOh.\n\n28th August 2018: Pete reveals the super-chill way he proposed to Ariana. So don't be expecting any candles or orchestras...\n\nPete told Variety: \"I didn’t want to do something corny. We were in bed hanging, after watching a movie. I was like, ‘Will you marry me?’ It was really dope.”\n\nHe told the magazine he was nervous she wouldn't even say yes. “I’m still convinced she’s blind or hit her head really hard. Something is going to happen, and she’s going to be like, ‘What the fuck is this thing doing around?’ For right now, it’s rocking.”\n\n31st August 2018: Ariana opens up about the very first time she and Pete kissed, and it's super-cute.\n\nWhile appearing on Nicki Minaj's Queen Radio show, Ariana said: \"It was so cute, he asked my permission to kiss me,\" she mused. \"It wasn’t like too naughty of a kiss, but definitely there was so much… you know… in there, you know? It was really sweet, but it was also really sexy.\"\n\n17th September 2018: OHMYGODOHMYGODOHMYGOD. Ariana Grande and Pete Davidson got a baby pig as a pet!\n\nAriana posted a bunch of Instagram Stories featuring the cute lil guy.\n\nInstagram\n\nInstagram\n\nInstagram\n\nSqueeeeeeeeee.\n\n24th September 2018: Pete reveals that he receives death threats because of his relationship with Ariana.\n\nIn an interview with Howard Stern, Pete said: \"I got a death threat. Someone wanted to shoot me in the face because she’s so hot. Do you know how insane that is? I was like, 'Am I that ugly that people want to shoot me in the face?' They’re like, 'No, fuck this guy,' I’m like, 'What did I do?'\"\n\n2nd October 2018: Pete and Ariana Grande are back to trolling each other, after taking a break from social media. On a solo polaroid picture of him, she wrote, \"where the mixtape\" and \"this is sick and ur page looks cool never post again\".\n\nAs for a cute selfie of Ariana, Pete acknowledged their social media hiatus - which came following backlash to their relationship - and wrote, \"hot. all the ones you posted with me not online are hot. love ya. bye for another three months\".\n\nInstagram\n\n15th October 2018: Ariana and Pete reportedly split up. WHYGODWHY?!\n\nAccording to TMZ, the engaged couple have called time on their five month relationship.\n\nA source said that 25-year-old Arian and Pete, 24, split over the weekend, “with both parties acknowledging that it simply was not the right time for their relationship to take off.” The source added that the couple still loves each other, but TMZ claims that “things are over romantically.”\n\n\n\n17th October 2018: Ariana breaks her silence on their split.\n\nShe posted an Instagram Story after she spent the day filming NBC's A Very Wicked Halloween that said: \"Ok today was v special and I'm so grateful I was able to be there. Time to say bye bye to the internet for just a lil bit. It's hard not to bump news n stuff that I'm not tryna to see rn. It's very sad and we're all tryin very hard to keep goin. Love u. And thank u for bein here always.\"\n\nInstagram / @ArianaGrande\n\n22nd October 2018: It's now Pete's turn to have his say.\n\nDuring a comedy show in Los Angeles, he made a lot of jokes about his and Ari's relationship.\n\nAccording to E!, Pete told the audience, \"Well, as you could tell, I don't want to be here. There's a lot going on\" in reference to his very public split, before poking fun at the fact he'd moved out of Ariana's apartment. \"Does anyone have any open rooms?\", he continued. \"Looking for a roommate?\"\n\n5th November 2018: Ariana releases the highly-anticipated single 'thank u, next', which features a load of references to her ex-boyfriends, including Pete. About the SNL star, she sings: \"Even almost got married. And for Pete, I'm so thankful.\"\n\n1st December 2018: In the video for 'thank u, next', Ariana apologises to Pete for \"dipping\".", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ariana-grande-mac-miller-1527702245.jpg?crop=1xw:0.7214428857715431xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.367xh;0.00160xw,0.0703xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.367xh;0.00160xw,0.0703xh&resize=1200:*", "keywords": [], "authors": ["Naomi Bartram"], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a20979533/ariana-grande-and-pete-davidson-a-timeline-of-their-relationship/", "title": "Ariana Grande and Pete Davidson: a timeline of their relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Ariana Grande and Pete Davidson: a timeline of their relationship", "description": "From meeting in March 2016, to their recent split", "url": "https://www.cosmopolitan.com/uk/entertainment/a20979533/ariana-grande-and-pete-davidson-a-timeline-of-their-relationship/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.367xh;0.00160xw,0.0703xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2019-01-11 03:02:39", "published_time": "2018-12-01 08:38:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.367xh;0.00160xw,0.0703xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Ariana Grande and Pete Davidson's relationship timeline", "description": "Ariana Grande and Pete Davidson recently got engaged, so let's take a look at where it all began.", "keywords": "ariana grande and pete davidson, ariana grande split mac miller, ariana grande new boyfriend, who is ariana grande's boyfriend, pete davidson and cazzie david, saturday night live, are ariana grande and pete davidson together, ariana grande and pete davidson relationship, pete davidson penis, pete davidson ariana grande first kiss, ariana grande pete davidson pet baby pig", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.733xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment", "sailthru.date": "2018-12-01T08:38:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.367xh;0.00160xw,0.0703xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1020273706.jpg?crop=1.00xw:0.733xh;0,0", "sailthru.socialtitle": "Ariana Grande and Pete Davidson: a timeline of their relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1543624680.0, "source": "https://www.cosmopolitan.com", "summary": ""}