{"url": "https://people.com/music/eminem-revival-songs-daughter-hailie-jade-scott/", "text": "Eminem‘s latest album Revival was released on Friday, and in it the iconic rapper tackles a variety of tough subjects including politics, heartbreak and his struggle with fame.\n\nThey’re topics he’s explored since he first exploded onto the music scene in the late ’90s — the unsettled, manic lyrics mirroring his tumultuous personal life with his on-again-off-again wife, Kim, drug abuse that brought him to the brink of death, and challenges balancing his public persona with his private life as a father.\n\nGet push notifications with news, features and more.\n\nBut the rapper produces perhaps his most emotional work yet when singing about his family.Giving listeners an honest, inside look at Eminem’s complicated struggle with parenthood, his daughter Hailie Jade — now a 21-year-old at Michigan State — takes the spotlight in three songs off the new album.\n\nHere are all the times Eminem references his daughter in Revival:\n\n“Castle”\n\nIn perhaps one the most heartrending songs on the album, Eminem dedicates “Castle” entirely to Hailie Jade. Written in the form of annual letters to his daughter, the rapper takes listeners inside his mind as a father.\n\nStarting with her birth, Eminem welcomes her to “mom and dad’s crazy world” before rapping of the pressure he feels to provide Hailie with the life he was never given—the castles of sand.\n\nImage zoom WENN\n\nAs Hallie gets older Eminem begins to feel guilty for making her the subject of many of his songs — even though they are a large part of the reason he’s been able to provide for his family. He struggles with the idea that he might have exploited his own child for the sake of his career.\n\n“I said your name but always tried to hide your face,” he raps. “This game is crazy, I wanted to claim my love for you but damn. I never knew it’d be like this. If I did, I wouldn’t have done it. You ain’t asked for none of this s—. Now you’re being punished? Things that should’ve been private with me and your mother is public.”\n\nLike in many of the songs on Revival, Eminem alludes to this being his final album.\n\n“They can take this fame back, I don’t want it,” he says. “I’ll put out this last album then be done with it.”\n\nRELATED VIDEO: Eminem’s Daughter Hailie Is All Grown Up – and Stunning!\n\n“Arose”\n\nIn this song, a drug-addicted Eminem issues his final apologies from his deathbed. The song starts with him wishing he could “rewind time like tape” for every drug he’s taken and the realization that he might not make it out of the hospital. From here, he starts his apology to his children.\n\n“Just heard they’re unplugging me,” he raps. “And it’s your birthday. Jade I’m missing your birthday. Baby girl, I’m sorry,” he raps to Hailie Jade.\n\nImage zoom Source: Hailee Scott/Instagram\n\nHe raps his regrets about major milestones he will miss in his children’s lives, including holidays, graduations and even weddings.\n\n“Smile pretty for pictures. Always cherish each other. I’ll always love ya. And I’ll be in the back of your memory. And I know you’ll never forget me. Just don’t get sad when remembering.”\n\nIn the end, it’s his family that helped Eminem pull through his addiction. “Consider the last four minutes as the song I’d have sent to my daughters if I’d have made it to the hospital less than two hours later,” he says. “But I fought it.”\n\n“In Your Head”\n\nWhile “In Your Head” isn’t entirely dedicated to his children, he once again apologizes to Hailie for making her “80 percent of what I rapped about.”\n\nEminem admits that at times he’s struggled with how to deal with fame and his booming career.\n\n“Maybe I shoulda, did a better job at separating Shady,” he says.\n\nRevival is out now.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fhailee-scott-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1311&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1311&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg", "keywords": [], "authors": ["Jodi Guglielmi"], "canonical_link": "https://people.com/music/eminem-revival-songs-daughter-hailie-jade-scott/", "title": "Eminem's Raps Letter to Daughter Hailie in New Song", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Eminem,Hailie Scott,Music News,News", "news_keywords": "Eminem,Hailie Scott,Music News,News", "description": "The rapper produces perhaps his most emotional work yet when singing about his family on his new album, Revival", "og": {"title": "Eminem's New Song Written As Letter to Daughter Hallie Jade -- Reflects on Methadone OD", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/eminem-revival-songs-daughter-hailie-jade-scott/", "description": "Eminem‘s latest album Revival&nbsp;was released on Friday, and in it the iconic rapper tackles a variety of tough subjects including politics, heartbreak and his struggle&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1311&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg", "width": 1311, "height": 686}}, "pinterest": {"url": "https://people.com/music/eminem-revival-songs-daughter-hailie-jade-scott/", "description": "The rapper produces perhaps his most emotional work yet when singing about his family on his new album, Revival", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/eminem-revival-songs-daughter-hailie-jade-scott/", "title": "Eminem's New Song Written As Letter to Daughter Hallie Jade -- Reflects on Methadone OD", "description": "The rapper produces perhaps his most emotional work yet when singing about his family on his new album, Revival", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1311&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F10%2Fhaillie-jade.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}