{"url": "http://theboombox.com/9-reasons-why-will-smiths-instagram-is-so-poppin/", "text": "Kim Kardashian broke the Internet. Beyoncé shut it down. But Will Smith brought it back to life the day he joined Instagram.\n\nWhile the social media platform launched back in 2018, it wasn't until one fateful day in December 2017 that the Fresh Prince decided to post his first IG picture. It's been on ever since.\n\nThe charismatic super star let fans into his childhood when he shared a baby photo that required no filters. Approximately seven IG posts later, he had everyone hooked, especially when he showed just how proud he is to be a father by uploading a split image of Jaden and himself in similar poses at two different events.\n\nWill then reminded his fans and binge watchers everywhere to keep watching Netflix (before the whole Mo’Nique boycott went down).\n\nBut it isn't just his wit and family pics that has everyone following Smith—it's his life advice. From inspirational posts laced with comedic timing, to his musings on what it takes to make a marriage last, Smith's insight never comes off as preachy, which people obviously relate to. Since joining in December, his followers have swelled to 8.9 million.\n\nBottom line? There are many reasons to love Will Smith's Instagram— nine major keys to be exact.\n\nHe's Motivational\n\nNo matter the subject, Will always finds new ways of encouraging people to cut the dead weight out of their lives, so that they can shine brighter.\n\nHe Inspires New Perspectives\n\nSmith's response to this young artist's animation proves he’s not afraid to look at himself through someone else’s eyes.\n\nHis Co-Signs Are Everything\n\nHe waited approximately 2,700 days to launch his IG account but he used Ellen Degeneres' talk show as the plug when he did. Enough said.\n\nHe Defines Cultural Ideas\n\nThe now 49-year-old actor started off as a big-eared kid from Philly looking to make it. Somewhere along the way he transformed into an inebriated super hero, but not before experiencing life as one of the world's soul survivors. Now he's a full blown family man who's still doing backflips on a big screen while banking millions. He personifies the phrase, \"Black don't crack!\"\n\nHe Always Remembers His Roots\n\nSmith may be worth around $260 million, but he never forgets where he came from.\n\nHe Has the Best Friends\n\nUnderstandably, Will Smith has a lot of high-ranking friends in a lot of high-ranking places. But sometimes, it’s not about the money or the fame. Sometimes it’s just having a lot of (high-ranking) celebrity friends who care just as much about the culture as you do.\n\nHe Shows His Family A Lot Of Love\n\nThrough all his stardom, Will has always seems to put family first. With his family by his side, he shows the new generation it’s still cool to be a family man.\n\nHe's All About Self-Empowerment\n\nHe announced he was starting a vlog to show people the things they can do when they’re not sleeping— and what he’s doing when we are.\n\nHe's A Genius\n\nWill showed us he can rap and act, but when he jumped on camera and conquered a Rubik’s Cube, we realized he can do anything – even master the philosophies of a colorful square puzzle.", "images": ["http://townsquare.media/site/625/files/2018/04/theboombox-high-rez.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1", "https://townsquare.media/site/625/files/2018/02/Will-Smith.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"], "top_img": "https://townsquare.media/site/625/files/2018/02/Will-Smith.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Amber Mckynzie"], "canonical_link": "https://theboombox.com/9-reasons-why-will-smiths-instagram-is-so-poppin/", "title": "Here's Why Will Smith's Instagram Is Poppin", "meta_data": {"instagram_profile": "theboomboxgram", "description": "Will Smith's Instagram just brought the internet back to life.", "keywords": "will smith, instagram, ig, vlog, fresh prince, will smith's inspirational instagram", "fb": {"app_id": 541533845882285, "admins": 100002025987268, "pages": 160987500588644}, "og": {"title": "Here's Why Will Smith's Instagram Is Poppin", "description": "Will Smith's Instagram just brought the internet back to life.", "url": "https://theboombox.com/9-reasons-why-will-smiths-instagram-is-so-poppin/", "site_name": "The Boombox", "type": "article", "image": "https://townsquare.media/site/625/files/2018/02/Will-Smith.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@theboombox"}, "sailthru.description": "Will Smith's Instagram just brought the internet back to life.", "sailthru.date": "2018-02-13 02:00:27", "sailthru.title": "9 Reasons Why Will Smith’s Instagram Is So Poppin", "sailthru.tags": "tsmsite-theboombox, tsmmarket-national, tsmtype-national, will-smith, hip-hop-news, the-rundown, movies, tech, television", "sailthru.author": "amckynzie", "sailthru.image.full": "https://townsquare.media/site/625/files/2018/02/Will-Smith.jpg", "sailthru.image.thumb": "https://townsquare.media/site/625/files/2018/02/Will-Smith.jpg", "google-site-verification": "LSh9EcI3Pz6cijDDZm0XcZ7b1eQqAtzC8ZIy1YuZKe4", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1518458427.0, "source": "http://theboombox.com", "summary": ""}