{"url": "https://variety.com/2018/tv/news/prince-harry-meghan-markle-royal-wedding-windsor-1202813625/", "text": "UPDATED: The eyes of the world turned to Windsor in the British county of Berkshire on Saturday for the wedding of Prince Harry and U.S. actress Meghan Markle, with millions of people across the globe expected to tune in to the pomp and ceremony of the much-anticipated royal occasion. The BBC said an estimated 1.9 billion people were expected to watch around the world.\n\nThe couple will become the Duke and Duchess of Sussex after Prince Harry’s new official title, conferred on him by Queen Elizabeth II, was announced Saturday morning. Prince Harry will become His Royal Highness The Duke of Sussex, Earl of Dumbarton and Baron Kilkeel. Markle will be known as HRH The Duchess of Sussex.\n\nIt was a beautiful morning in Windsor as guests started to arrive at 9:30 a.m. local time (1:30 a.m. PT). Amongst the earliest arrivals at St. George’s Chapel were American talk show legend and actress Oprah Winfrey; British actor Idris Elba; and British singer James Blunt. Ahead of the start of the service arriving guests are being treated to the music of classical composers including Johann Sebastian Bach, Ralph Vaughn Williams, Gustav Holst and Edward Elgar.\n\nArriving with minutes of each other around 10:25 a.m. were George and Amal Clooney; David and Victoria Beckham; and actress Carey Mulligan with her husband singer Marcus Mumford. Indian actress Priyanka Chopra arrived alongside Markle’s “Suits” co-stars Gina Torres and Abigail Spencer shortly before 11 a.m. Other “Suits” actors Sarah Rafferty, Rick Hoffman and Gabriel Macht were close on their heels. Other celebrity guests include Elton John; James Corden; Tom Hardy; Serena Williams and her husband, Reddit co-founder Alexis Ohanian; and British singer Joss Stone.\n\nGlobal viewers got their first brief glimpse of the bride in her car as she left the nearby Cliveden House Hotel, where Markle and her mother, Doria Ragland, stayed overnight. The bride left the hotel just before 11:20 a.m. local time.\n\nPrince Harry, and his older brother and best man Prince William, arrived at the venue at 11:35 a.m dressed in the frock-coat uniform of the Blues and Royals Household Cavalry. The Queen gave her permission for her grandson to get married in his uniform.\n\nMarkle arrived at Windsor Castle through the Cambridge Gate in a Rolls Royce Phantom IV at 11:48 a.m. She entered the chapel at one minute past noon to a special fanfare composed especially for the bride by the state trumpeters. The wedding dress was designed by British designer Clare Waight Keller from French fashion house Givenchy.\n\nThe Queen arrived at the chapel with her husband Prince Philip at 11:55 a.m., shortly after Prince Charles and his wife the Duchess of Cornwell.\n\nDozens of international media outlets have flocked to Windsor, including broadcasters from Canada, Australia and New Zealand, which recognize the British monarch as their head of state, and from other countries such as Germany, France, Spain and Japan. In total, more than 5,000 members of the media and their support staff have been accredited to be in Windsor for the wedding. In the U.S., NBC, CBS, ABC, CNN, BBC America, TLC, HBO, Hallmark, and E! are all offering a live stream with commentary.\n\nThe wedding fever reflects the global appeal of the British monarchy, which has been a staple of the news and entertainment industries for decades, if not centuries, from Shakespeare’s history plays through to “The Lion in Winter,” “The Queen,” “The King’s Speech” and “The Crown.”\n\nNBC has five different vantage points set up along the procession route leading to Windsor Castle, the venue for the wedding, with “Today” show anchors Savannah Guthrie and Hoda Kotb fronting coverage from an exclusive vantage point overlooking the castle and with Megyn Kelly, Al Roker, Kathie Lee Gifford and Sheinelle Jones at other prime locations around Windsor.\n\nCBS sent “This Morning” co-host Gayle King and “Entertainment Tonight” co-host Kevin Frazier to England, while ABC has a special five-hour extended edition of “Good Morning America” planned with Robin Roberts and “World News Tonight” anchor David Muir leading the coverage.\n\n“It’s a fairy tale. Who doesn’t love fairy tales?” Libby Leist, “Today” executive producer, told Variety earlier this week. “It’s all about history, it’s about tradition, it’s about fashion. It’s got a little something for everybody, which is why we are going so big on it.”\n\nIn Britain, the BBC is dedicating five hours of coverage to the royal nuptials on its flagship channel, BBC One. This is to be followed by a four-hour special, presented live from Windsor Castle and featuring reports from around the U.K. and elsewhere, on the BBC News channel. Britain’s biggest commercial broadcaster, ITV, has scheduled more than five and a half hours of coverage, while pay-TV service Sky is devoting airtime to the wedding on both its Sky 1 and Sky News channels.\n\nInternational media on the ground in Windsor hail from 79 international networks and 46 U.S. broadcast affiliates. There are 160 photographers stationed in 14 officially designated locations. As well as via their local newscasters, viewers around the world can also tune in online via the royal family’s official YouTube channel.\n\nThe 2011 royal wedding of Harry’s older brother, Prince William, and Kate Middleton was watched by an estimated 27 million people in the U.K., 23 million in the U.S. and as many as 2 billion globally.\n\nToday’s service, which begins at 12 p.m. local time (4 a.m. PT), is set to be followed by a 25-minute carriage procession offering thousands of onlookers, who have descended on Windsor, a first look at the newlyweds. Only 600 people were invited to the wedding of Harry, 33, and Markle, 36, but as many as 100,000 people from all over the world were expected to converge on Windsor. The historic market town, which is west of London, has a population of slightly more than 32,000.\n\nSecurity forces carried out a full run-through Thursday morning, traveling the same route the royal procession is to make on Saturday afternoon. All roads around Windsor Castle were blocked off, police snipers were stationed on rooftops, special commandos were posted in the crowds, and anti-vehicle barriers were erected in the town center.\n\nFollowing the wedding and procession, an official lunch reception hosted by Queen Elizabeth II is scheduled to take place in St. George’s Hall for all invited guests. A second, more intimate evening reception for 200 guests, hosted by Prince Charles, will take place at 7 p.m. (11 a.m. PT) at Frogmore House, half a mile south of Windsor Castle.\n\nWhile the 2011 wedding of William and Kate at Westminster Abbey was attended by foreign dignitaries, royalty and politicians, the more intimate venue for Saturday’s wedding meant only those with a personal relationship with the couple were invited. World leaders including British Prime Minister Theresa May and U.S. President Donald Trump were excluded. St. George’s Chapel has a maximum capacity of 800. By contrast, 1,900 guests were invited to Prince William’s wedding.\n\nIn March, Kensington Palace announced that 2,640 members of the public would be invited into the grounds of Windsor Castle to watch the arrivals and the carriage procession as it departed the castle afterwards. The announcement said the couple had asked that 1,200 people from across Britain, including “young people who have shown strong leadership and those who have served their communities,” be among the invitees.\n\nMarkle, whose first name is Rachel (Meghan is her middle name), is best known for her role as Rachel Zane on legal drama “Suits.” She has now retired from acting and will become a U.K. citizen following the wedding. In a BBC interview alongside Harry last November, she said: “I don’t see it as giving anything up. I just see it as a change. It’s another chapter.”\n\nThe couple first met on a blind date, arranged by a mutual friend, in July 2016, and managed to keep their relationship secret until late October of that year. The pair announced their engagement last November. Markle was previously married to producer Trevor Engelson; the marriage ended in divorce in 2013 after two years.\n\nFascination with the relationship has already seen six documentaries as well as TV movie “Harry and Meghan: A Royal Romance” produced about the couple and broadcast in the run-up to the wedding.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fprince-harry-meghan-markle-royal-wedding-windsor-1202813625%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202813625", "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=681&h=383&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=1000", "keywords": [], "authors": ["Robert Mitchell"], "canonical_link": "https://variety.com/2018/tv/news/prince-harry-meghan-markle-royal-wedding-windsor-1202813625/", "title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "The eyes of the world turned to Windsor Saturday as the royal wedding of Prince Harry and Meghan Markle became a global media event.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202813625, "author": "Robert Mitchell", "pmc-category": "Global,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-05-19T00:01:27"}, "pmc-tag": "George Clooney,Idris Elba,Meghan Markle,Oprah Winfrey,Prince Harry,Royal Wedding", "title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle", "pageclass": "article", "pmc-vertical": "biz,tv", "pmc-primary-category": "Global", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle", "url": "https://variety.com/2018/tv/news/prince-harry-meghan-markle-royal-wedding-windsor-1202813625/", "description": "UPDATED: The eyes of the world turned to Windsor in the British county of Berkshire on Saturday for the wedding of Prince Harry and U.S. actress Meghan Markle, with millions of people across the gl…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=1000", "width": 1000, "height": 563, "alt": "Prince Harry and Meghan MarkleThe wedding of Prince Harry and Meghan Markle, Ceremony, St George's Chapel, Windsor Castle, Berkshire, UK - 19 May 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-05-19T07:01:27+00:00", "modified_time": "2018-05-20T11:09:34+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=1000", "alt": "Prince Harry and Meghan MarkleThe wedding of Prince Harry and Meghan Markle, Ceremony, St George's Chapel, Windsor Castle, Berkshire, UK - 19 May 2018"}, "card": "summary_large_image", "title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle", "description": "The eyes of the world turned to Windsor Saturday as the royal wedding of Prince Harry and Meghan Markle became a global media event."}, "author": "Robert Mitchell", "content_type": "Article", "post_id": 1202813625, "title": "Thousands Descend on Windsor for Wedding of Prince Harry and Meghan Markle", "published_at": "2018-05-19 00:01:27", "image": "https://pmcvariety.files.wordpress.com/2018/05/9685436ay.jpg?w=1000", "comment_count": 0, "tags": "Royal Wedding", "topics": "News", "appeared_in_print": "No", "body": "UPDATED: The eyes of the world turned to Windsor in the British county of Berkshire on Saturday for the wedding of Prince Harry and U.S. actress Meghan Markle, with millions of people across the globe expected to tune in to the pomp and ceremony of the much-anticipated royal occasion. The BBC said an estimated 1.9 billion people were expected to watch around the world.\r\n\r\nThe couple will become the Duke and Duchess of Sussex after Prince Harry's new official title, conferred on him by Queen Elizabeth II, was announced Saturday morning. Prince Harry will become His Royal Highness The Duke of Sussex, Earl of Dumbarton and Baron Kilkeel. Markle will be known as HRH The Duchess of Sussex.\r\n\r\nIt was a beautiful morning in Windsor as guests started to arrive at 9:30 a.m. local time (1:30 a.m. PT). Amongst the earliest arrivals at St. George's Chapel were American talk show legend and actress Oprah Winfrey; British actor Idris Elba; and British singer James Blunt. Ahead of the start of the service arriving guests are being treated to the music of classical composers including Johann Sebastian Bach, Ralph Vaughn Williams, Gustav Holst and Edward Elgar.\r\n\r\nArriving with minutes of each other around 10:25 a.m. were George and Amal Clooney; David and Victoria Beckham; and actress Carey Mulligan with her husband singer Marcus Mumford. Indian actress Priyanka Chopra arrived alongside Markle's \"Suits\" co-stars Gina Torres and Abigail Spencer shortly before 11 a.m. Other \"Suits\" actors Sarah Rafferty, Rick Hoffman and Gabriel Macht were close on their heels. Other celebrity guests include Elton John; James Corden; Tom Hardy; Serena Williams and her husband, Reddit co-founder Alexis Ohanian; and British singer Joss Stone.\r\n\r\nGlobal viewers got their first brief glimpse of the bride in her car as she left the nearby Cliveden House Hotel, where Markle and her mother, Doria Ragland, stayed overnight. The bride left the hotel just before 11:20 a.m. local time.\r\n\r\nPrince Harry, and his older brother and best man Prince William, arrived at the venue at 11:35 a.m dressed in the frock-coat uniform of the Blues and Royals Household Cavalry. The Queen gave her permission for her grandson to get married in his uniform.\r\n\r\nMarkle arrived at Windsor Castle through the Cambridge Gate in a Rolls Royce Phantom IV at 11:48 a.m. She entered the chapel at one minute past noon to a special fanfare composed especially for the bride by the state trumpeters. The wedding dress was designed by British designer Clare Waight Keller from French fashion house Givenchy.\r\n\r\nThe Queen arrived at the chapel with her husband Prince Philip at 11:55 a.m., shortly after Prince Charles and his wife the Duchess of Cornwell.\r\n\r\nDozens of international media outlets have flocked to Windsor, including broadcasters from Canada, Australia and New Zealand, which recognize the British monarch as their head of state, and from other countries such as Germany, France, Spain and Japan. In total, more than 5,000 members of the media and their support staff have been accredited to be in Windsor for the wedding. In the U.S., NBC, CBS, ABC, CNN, BBC America, TLC, HBO, Hallmark, and E! are all offering a live stream with commentary.\r\n\r\nThe wedding fever reflects the global appeal of the British monarchy, which has been a staple of the news and entertainment industries for decades, if not centuries, from Shakespeare's history plays through to \"The Lion in Winter,\" \"The Queen,\" \"The King's Speech\" and \"The Crown.\"\r\n\r\nNBC has five different vantage points set up along the procession route leading to Windsor Castle, the venue for the wedding, with \"Today\" show anchors Savannah Guthrie and Hoda Kotb fronting coverage from an exclusive vantage point overlooking the castle and with Megyn Kelly, Al Roker, Kathie Lee Gifford and Sheinelle Jones at other prime locations around Windsor.\r\n\r\nCBS sent \"This Morning\" co-host Gayle King and \"Entertainment Tonight\" co-host Kevin Frazier to England, while ABC has a special five-hour extended edition of \"Good Morning America\" planned with Robin Roberts and \"World News Tonight\" anchor David Muir leading the coverage.\r\n\r\n\"It’s a fairy tale. Who doesn’t love fairy tales?\" Libby Leist, \"Today\" executive producer, told Variety earlier this week. \"It’s all about history, it’s about tradition, it’s about fashion. It’s got a little something for everybody, which is why we are going so big on it.\" \r\n\r\nIn Britain, the BBC is dedicating five hours of coverage to the royal nuptials on its flagship channel, BBC One. This is to be followed by a four-hour special, presented live from Windsor Castle and featuring reports from around the U.K. and elsewhere, on the BBC News channel. Britain's biggest commercial broadcaster, ITV, has scheduled more than five and a half hours of coverage, while pay-TV service Sky is devoting airtime to the wedding on both its Sky 1 and Sky News channels.\r\n\r\nInternational media on the ground in Windsor hail from 79 international networks and 46 U.S. broadcast affiliates. There are 160 photographers stationed in 14 officially designated locations. As well as via their local newscasters, viewers around the world can also tune in online via the royal family's official YouTube channel.\r\n\r\nThe 2011 royal wedding of Harry’s older brother, Prince William, and Kate Middleton was watched by an estimated 27 million people in the U.K., 23 million in the U.S. and as many as 2 billion globally.\r\n\r\nToday's service, which begins at 12 p.m. local time (4 a.m. PT), is set to be followed by a 25-minute carriage procession offering thousands of onlookers, who have descended on Windsor, a first look at the newlyweds. Only 600 people were invited to the wedding of Harry, 33, and Markle, 36, but as many as 100,000 people from all over the world were expected to converge on Windsor. The historic market town, which is west of London, has a population of slightly more than 32,000.\r\n\r\nSecurity forces carried out a full run-through Thursday morning, traveling the same route the royal procession is to make on Saturday afternoon. All roads around Windsor Castle were blocked off, police snipers were stationed on rooftops, special commandos were posted in the crowds, and anti-vehicle barriers were erected in the town center.\r\n\r\nFollowing the wedding and procession, an official lunch reception hosted by Queen Elizabeth II is scheduled to take place in St. George’s Hall for all invited guests. A second, more intimate evening reception for 200 guests, hosted by Prince Charles, will take place at 7 p.m. (11 a.m. PT) at Frogmore House, half a mile south of Windsor Castle.\r\n\r\nWhile the 2011 wedding of William and Kate at Westminster Abbey was attended by foreign dignitaries, royalty and politicians, the more intimate venue for Saturday's wedding meant only those with a personal relationship with the couple were invited. World leaders including British Prime Minister Theresa May and U.S. President Donald Trump were excluded. St. George’s Chapel has a maximum capacity of 800. By contrast, 1,900 guests were invited to Prince William’s wedding.\r\n\r\nIn March, Kensington Palace announced that 2,640 members of the public would be invited into the grounds of Windsor Castle to watch the arrivals and the carriage procession as it departed the castle afterwards. The announcement said the couple had asked that 1,200 people from across Britain, including “young people who have shown strong leadership and those who have served their communities,” be among the invitees.\r\n\r\nMarkle, whose first name is Rachel (Meghan is her middle name), is best known for her role as Rachel Zane on legal drama “Suits.” She has now retired from acting and will become a U.K. citizen following the wedding. In a BBC interview alongside Harry last November, she said: “I don’t see it as giving anything up. I just see it as a change. It’s another chapter.”\r\n\r\nThe couple first met on a blind date, arranged by a mutual friend, in July 2016, and managed to keep their relationship secret until late October of that year. The pair announced their engagement last November. Markle was previously married to producer Trevor Engelson; the marriage ended in divorce in 2013 after two years.\r\n\r\nFascination with the relationship has already seen six documentaries as well as TV movie \"Harry and Meghan: A Royal Romance\" produced about the couple and broadcast in the run-up to the wedding.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1526713287.0, "source": "https://variety.com", "summary": ""}