{"url": "https://www.bustle.com/articles/195523-how-old-is-rory-in-the-gilmore-girls-revival-lets-do-a-little-math-shall-we", "text": "For many of us, it's been awhile since we visited the quiet, yet quirky streets of Stars Hollow. We may not have a catalogue of characters' birthdays or milestones sitting in our brains just waiting to be used once more, and as such, it might be hard to remember things like how old Rory is in the Gilmore Girls revival. Luckily, but keeping the timeline fairly straightforward, creator Amy Sherman-Palladino and Co. have made the answer quite simple for us.\n\nLet's do a little math, here. Keep in mind that the number 16 is going to be integral to, well, pretty much everything, so stay with me. When Gilmore Girls premiered on October 5, 2000 — 16 years ago — Rory was just shy of 16, as she turned 16 in the Season 1 episode, “Rory’s Birthday Parties.” Considering that Rory turned 16, well, 16 years ago, and that Lorelai was 16 when she had Rory, and Netflix's Gilmore Girls: A Year In The Life picks up in present day, the stars are aligning for something pretty magical to be happening with the Gilmore girls’ ages: in the revival, Rory is the same age Lorelai was when we met her in 2000, age 32.\n\nIt will be fun to see how different the women’s lives are at the same age. At 32, Lorelai was gearing up to become an empty nester. And it seems pretty clear that in the reboot, Rory has not started a family yet. Still, I can't help but wonder if at least a few of Rory’s 30-something woes and experiences might be reminiscent of where we saw Lorelai at the same age.\n\nStill, this feels rather shocking to accept: Rory is 32. And, we haven’t seen her since she was 22 at her college graduation, just after she rejected Logan’s proposal and embarked on her journalism career covering Barack Obama’s 2008 campaign. But, apparently, our girl did not ride off into the sunset.\n\nFrom the trailers and teasers, it's clear that Rory, Lorelai, and Emily are all at a personal crossroads. Emily lost her husband. Lorelai is reevaluating what she wants out of life. And, Rory is living a vagabond lifestyle as a journalist in an media landscape that is continually shifting. In the trailer, Rory is said to be “Jack Kerouac-ing.” She and Jess (yes, Jess!) discuss her rootless life in what appears to be some sort of publishing office, Rory says, “I’m feeling very lost these days. I have no job, I have no credit, I have no underwear.” (From one writer to another: preach, Rory).\n\nIn fact, Sherman-Palladino recently discussed Rory’s life in 2016 with TV Line. She told the site, \"It’s this idea of, you hit [your 30s], you did everything right — you went to college, you had the good grades, you worked really hard — and yet somehow life isn’t turning out the way you wanted it to turn out.\"\n\nRory may be all grown-up, but like Lorelai (and most people) she is still figuring it out at 32. And, it seems that fans are still excited to see our girl back at home in Stars Hollow with her mom, no matter what troubles she's got going on in her life.\n\nImages: Saeed Adyani/Netflix (2)", "images": ["https://imgix.bustle.com/rehost/2016/11/23/6ff9f878-9b0f-47e7-9720-674d9c6b1fe2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/11/23/6ff9f878-9b0f-47e7-9720-674d9c6b1fe2.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/1135/0bc39ff0-8d9f-0134-ce49-0aec1efe63a9.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/11/23/6ff9f878-9b0f-47e7-9720-674d9c6b1fe2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/195523-how-old-is-rory-in-the-gilmore-girls-revival-lets-do-a-little-math-shall-we", "title": "How Old Is Rory In The ‘Gilmore Girls’ Revival? Let's Do A Little Math, Shall We?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/195523-how-old-is-rory-in-the-gilmore-girls-revival-lets-do-a-little-math-shall-we", "type": "article", "title": "How Old Is Rory In The ‘Gilmore Girls’ Reboot?", "description": "For many of us, it's been awhile since we visited the quiet, yet quirky streets of Stars Hollow. We may not have a catalogue of characters' birthdays or milestones sitting in our brains just waiting to be used once more, and as such, it might be…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/11/23/6ff9f878-9b0f-47e7-9720-674d9c6b1fe2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "For many of us, it's been awhile since we visited the quiet, yet quirky streets of Stars Hollow. We may not have a catalogue of characters' birthdays or milestones sitting in our brains just waiting to be used once more, and as such, it might be…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}