{"url": "https://www.rollingstone.com/culture/culture-news/bill-cosby-to-teach-young-people-how-to-avoid-sexual-assault-charges-200248/", "text": "UPDATE: Despite Cosby’s own rep telling Rolling Stone and other media outlets that Bill Cosby’s upcoming town halls would center around sexual assault, a second rep for the comedian has backtracked and said the meetings will focus on “restoration of [Cosby’s] legacy.”\n\n***\n\nLess than one week after a judge declared Bill Cosby’s sexual assault case a mistrial, the embattled actor-comedian is gearing up to “get back to work.”\n\nOn Thursday, Cosby’s rep, Andrew Wyatt, told Good Day Alabama host Janice Rogers that the actor is planning to hold a series of town hall meetings starting “sometime in July” to help educate young men and women about sexual violence – specifically, the threat of being accused of inappropriate behavior.\n\n“This is bigger than Bill Cosby,” Wyatt said on the show. “This issue can affect any young person, especially young athletes, of today, and they need to know what they’re facing when they’re hanging out and partying, when they’re doing certain things they shouldn’t be doing. And it also affects married men.”\n\nWyatt’s reference to married men is a nod to the primary argument made by Cosby’s defense attorney Brian McMonagle, that Cosby was a man who had been unfaithful to his wife, but not a perpetrator of sexual assault, as accuser Andrea Constand had testified. Added Ebonee Benson, a spokeswoman for Camille Cosby, “Laws are changing, the statute of limitations for victims of sexual assault are being extended, so this is why people need to be educated on … a brush against the shoulder. Anything at this point can be considered sexual assault. It’s a good thing to be educated about the laws.”\n\nWhen reached for comment, Wyatt issued a statement to Rolling Stone confirming the town halls – and suggesting that he’s hoping they will expose the larger forces at play in Cosby’s trial.\n\n“My Associate Ebonee Benson and I received hundreds of calls from civic organizations and churches requesting for Mr. Cosby to speak to young men and women about the judicial system,” Wyatt tells Rolling Stone. “They feel that the young men and women need to be aware that Mr. Cosby was given a deal to never be criminally charged by Former DA Bruce Castor and 12 years later DA Kevin Steele runs a Willie Horton style campaign ad saying, ‘If you elect me I will bring Bill Cosby to justice.'”\n\n“These groups would like for Mr. Cosby to share that people in the judicial system can use their powers to annul deals for personal agenda and political ambitions,” he adds. “Speeches will be free.”\n\n“People can educate themselves on the situation that they’re facing today,” Wyatt tells Rolling Stone of the planned events. “Laws are changing. Statute of limitations are being amended. It’s important to educate people that you could be at a baseball game and it could be crowded and a young man could try to squeeze through and accidentally touch a young lady’s butt or breast by mistake and that could be considered sexual assault. It’s imperative that we educate people that want to be educated.”\n\nFollowing the mistrial ruling, Steele announced he would retry Cosby within 120 days. While Wyatt admits that “our legal team will be going through everything he’s going to say,” he claims his team will not vet audience questions ahead of time, ostensibly allowing both supporters and detractors from questioning the comedian. “I don’t think he’s going to say anything to jeopardize the [upcoming] trial or put himself in harm’s way,” Wyatt says. “There are going to be some questions he won’t be able to answer.”\n\nThe genesis of the planned town halls, says Wyatt, came from requests from various church and civic organizations, though he declined to provide any specific groups.\n\nOn Wednesday, an anonymous juror told ABC News that the jury was deadlocked after 52 hours of deliberation because of two jurors who believed Cosby should be acquitted. “There was no budging,” after the first deadlock, the juror said, “and there was none from there on out.”\n\nA second juror spoke to The Associated Press Thursday, saying that the jury was actually more evenly split with a similar number of jurors wanting to convict Cosby as wanted to acquit him.\n\nThe second juror told the AP it was suspicious that the three charges of sexual misconduct were brought about, though “no new evidence from ’05 to now has showed up, no stained clothing, no smoking gun, nothing.” They added that other jurors similarly expressed the view that “politics was involved.”\n\nWith any public event for a figure as polarizing as Cosby, the actor risks facing highly visible protests and scrutiny. “People have a right to protest,” says Wyatt. “We just ask that our supporters be respectful and not engage or incite anything … He has been consistent that people respect each other. He has used his entire career to humanize all age groups, races, genders and religious groups and he’ll continue to do that as he moves on with his life.”\n\nAdditional reporting by Jason Newman\n\nWatch everything we know about the Bill Cosby sexual assault trial.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/rs-bill-cosby-da5510a0-50e3-4ea4-b9cc-424aa57ea15c.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fbill-cosby-to-teach-young-people-how-to-avoid-sexual-assault-charges-200248%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=200248", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-bill-cosby-da5510a0-50e3-4ea4-b9cc-424aa57ea15c.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/bill-cosby-to-teach-young-people-how-to-avoid-sexual-assault-charges-200248/", "title": "Bill Cosby to Teach Young People How to Avoid Sexual Assault Charges", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Actor's rep says Bill Cosby plans to hold free town halls to discuss the judicial system.", "news_keywords": "Bill Cosby, sexual assault", "og": {"type": "article", "title": "Bill Cosby to Teach Young People How to Avoid Sexual Assault Charges", "url": "https://www.rollingstone.com/culture/culture-news/bill-cosby-to-teach-young-people-how-to-avoid-sexual-assault-charges-200248/", "description": "Actor-comedian will hold free town halls to discuss the judicial system", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-bill-cosby-da5510a0-50e3-4ea4-b9cc-424aa57ea15c.jpg", "width": 1024, "height": 677, "alt": "bill cosby, bill cosby sexual assault, bill cosby trial, bill cosby sexual assault trial, bill cosby hearing, bill cosby sexual assault case, bill cosby trial verdict, bill cosby accused, bill cosby wife"}, "locale": "en_US"}, "article": {"published_time": "2017-06-22T21:10:00+00:00", "modified_time": "2018-06-25T14:59:46+00:00"}, "twitter": {"text": {"title": "Bill Cosby to Teach Young People How to Avoid Sexual Assault Charges"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-bill-cosby-da5510a0-50e3-4ea4-b9cc-424aa57ea15c.jpg?w=1024", "alt": "bill cosby, bill cosby sexual assault, bill cosby trial, bill cosby sexual assault trial, bill cosby hearing, bill cosby sexual assault case, bill cosby trial verdict, bill cosby accused, bill cosby wife"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Bill Cosby to Teach Young People How to Avoid Sexual Assault Charges", "description": "Actor's rep says Bill Cosby plans to hold free town halls to discuss the judicial system."}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 200248, "title": "Bill Cosby to Teach Young People How to Avoid Sexual Assault Charges", "published_at": "2017-06-22 21:10:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-bill-cosby-da5510a0-50e3-4ea4-b9cc-424aa57ea15c.jpg?w=1024", "comment_count": 0, "tags": "sexual assault", "topics": "Culture News", "body": "UPDATE: Despite Cosby's own rep telling Rolling Stone and other media outlets that Bill Cosby's upcoming town halls would center around sexual assault, a second rep for the comedian has backtracked and said the meetings will focus on \"restoration of [Cosby's] legacy.\"***Less than one week after a judge declared Bill Cosby's sexual assault case a mistrial, the embattled actor-comedian is gearing up to \"get back to work.\"On Thursday, Cosby's rep, Andrew Wyatt, told Good Day Alabama host Janice Rogers that the actor is planning to hold a series of town hall meetings starting \"sometime in July\" to help educate young men and women about sexual violence – specifically, the threat of being accused of inappropriate behavior.\"This is bigger than Bill Cosby,\" Wyatt said on the show. \"This issue can affect any young person, especially young athletes, of today, and they need to know what they're facing when they're hanging out and partying, when they're doing certain things they shouldn't be doing. And it also affects married men.\"Wyatt's reference to married men is a nod to the primary argument made by Cosby’s defense attorney Brian McMonagle, that Cosby was a man who had been unfaithful to his wife, but not a perpetrator of sexual assault, as accuser Andrea Constand had testified. Added Ebonee Benson, a spokeswoman for Camille Cosby, \"Laws are changing, the statute of limitations for victims of sexual assault are being extended, so this is why people need to be educated on … a brush against the shoulder. Anything at this point can be considered sexual assault. It's a good thing to be educated about the laws.\"When reached for comment, Wyatt issued a statement to Rolling Stone confirming the town halls – and suggesting that he's hoping they will expose the larger forces at play in Cosby's trial.\"My Associate Ebonee Benson and I received hundreds of calls from civic organizations and churches requesting for Mr. Cosby to speak to young men and women about the judicial system,\" Wyatt tells Rolling Stone. \"They feel that the young men and women need to be aware that Mr. Cosby was given a deal to never be criminally charged by Former DA Bruce Castor and 12 years later DA Kevin Steele runs a Willie Horton style campaign ad saying, 'If you elect me I will bring Bill Cosby to justice.'\"\"These groups would like for Mr. Cosby to share that people in the judicial system can use their powers to annul deals for personal agenda and political ambitions,\" he adds. \"Speeches will be free.\" \"People can educate themselves on the situation that they're facing today,\" Wyatt tells Rolling Stone of the planned events. \"Laws are changing. Statute of limitations are being amended. It's important to educate people that you could be at a baseball game and it could be crowded and a young man could try to squeeze through and accidentally touch a young lady's butt or breast by mistake and that could be considered sexual assault. It's imperative that we educate people that want to be educated.\"Following the mistrial ruling, Steele announced he would retry Cosby within 120 days. While Wyatt admits that \"our legal team will be going through everything he's going to say,\" he claims his team will not vet audience questions ahead of time, ostensibly allowing both supporters and detractors from questioning the comedian. \"I don't think he's going to say anything to jeopardize the [upcoming] trial or put himself in harm's way,\" Wyatt says. \"There are going to be some questions he won't be able to answer.\"The genesis of the planned town halls, says Wyatt, came from requests from various church and civic organizations, though he declined to provide any specific groups. On Wednesday, an anonymous juror told ABC News that the jury was deadlocked after 52 hours of deliberation because of two jurors who believed Cosby should be acquitted. \"There was no budging,\" after the first deadlock, the juror said, \"and there was none from there on out.\"A second juror spoke to The Associated Press Thursday, saying that the jury was actually more evenly split with a similar number of jurors wanting to convict Cosby as wanted to acquit him.The second juror told the AP it was suspicious that the three charges of sexual misconduct were brought about, though \"no new evidence from '05 to now has showed up, no stained clothing, no smoking gun, nothing.\" They added that other jurors similarly expressed the view that \"politics was involved.\"With any public event for a figure as polarizing as Cosby, the actor risks facing highly visible protests and scrutiny. \"People have a right to protest,\" says Wyatt. \"We just ask that our supporters be respectful and not engage or incite anything ... He has been consistent that people respect each other. He has used his entire career to humanize all age groups, races, genders and religious groups and he'll continue to do that as he moves on with his life.\"Additional reporting by Jason NewmanWatch everything we know about the Bill Cosby sexual assault trial.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1498165800.0, "source": "https://www.rollingstone.com", "summary": ""}