{"url": "https://variety.com/2018/film/box-office/amy-schumer-box-office-analysis-i-feel-pretty-1202779934/", "text": "Amy Schumer is undeniably funny, so why have her two latest films underperformed?\n\nThe comedian’s third starring vehicle “I Feel Pretty,” written and directed by Marc Silverstein and Abby Kohn, launched to a soft $16 million last weekend. It’s not a disaster, but it does represent Schumer’s lowest opening for a film yet.\n\n“In terms of her career trajectory, it’s been a declining scale,” box office analyst Jeff Bock said. “It’s a matter of her finding her feet. She’s relatively new on the scene.”\n\nThe comedian made her film debut alongside Bill Hader in 2015’s hit “Trainwreck.” The incisive rom-com, written by Schumer and directed by Judd Apatow, bowed with $30 million and went on to earn $110 million. That’s an impressive tally, particularly for a genre that has struggled to live up to the glory years of Meg Ryan and Julia Roberts. Audiences were familiar with Schumer’s prolific stand-up career and her Comedy Central show, and no doubt were eager to see her tackle the big screen.\n\n“Trainwreck” proved to be a tough act to follow. Her next leading role, last year’s “Snatched,” opened with $19 million. The comedy, written by Katie Dippold and directed by Jonathan Levine, earned a disappointing $45 million and some blistering reviews.\n\n“I Feel Pretty” has also struggled critically, earning a 33% rating on Rotten Tomatoes, along with a 31% average audience score. It has inspired a number of hot takes for its somewhat muddled message of body acceptance. Schumer has since addressed criticism, saying the film was unfairly judged based on the trailer and not the movie’s theme of empowerment.\n\nAlthough she dropped out of Sony’s live-action “Barbie” movie due to scheduling conflicts, it may have been for the best given the similar image-centric storyline as “I Feel Pretty.” Aside from a brief detour into drama with 2017’s “Thank You For Your Service,” Schumer’s big-screen roles have largely been in the same vein. The question now remains: just how much is Schumer willing to stretch her material beyond the themes of her appearance?\n\n“If she wants to have a long career, that’s essential,” Bock said. “Audiences do get tired of the same movie over and over.”\n\nThat’s something audiences might get to see soon, as the comedic drama “She Came to Me,” is one of her more promising future projects. Schumer will appear alongside Steve Carell and Nicole Kidman in the film that’s still in pre-production, written and directed by Rebecca Miller.\n\n“I always like it when comedic actors try their hand in dramatic roles. Audiences don’t always follow them across that bridge, but there’s nothing wrong with attempting,” Bock said. “It can’t hurt your career.”\n\nRegardless of performance, there is one thing her last two disappointing films have in common: Schumer didn’t write them. Given her background in stand-up, it’s no surprise she penned her most successful project to date. It’s fair to say her movies could benefit from Schumer having a stronger hand in the screenplay.\n\n“I don’t think she’s less talented [since ‘Trainwreck’], I think it’s a matter of finding the right project,” Bock said. “She’s going to have to go through some bumps to find out why people were so enamored with ‘Trainwreck.'”\n\nHer untitled comedy with Jennifer Lawrence, which has been in development for some time now, will be the next test of Schumer’s impact as a screenwriter.\n\n“She has something people want to see,” Bock said. “She’s a different kind of person in terms of what Hollywood usually throws money at.”\n\nPOPULAR ON VARIETY", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fbox-office%2Famy-schumer-box-office-analysis-i-feel-pretty-1202779934%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202779934&comment_count=143", "https://pmcvariety.files.wordpress.com/2018/04/amy-schumer.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/04/amy-schumer.jpg?w=1000", "keywords": [], "authors": ["Rebecca Rubin"], "canonical_link": "https://variety.com/2018/film/box-office/amy-schumer-box-office-analysis-i-feel-pretty-1202779934/", "title": "After ‘I Feel Pretty’ Disappoints, What Should Amy Schumer Do Next?", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Just how much is Amy Schumer willing to stretch her material beyond the themes of her appearance?", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202779934, "author": "Rebecca Rubin", "pmc-category": "Box Office", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-23T07:21:42"}, "pmc-tag": "Amy Schumer,I Feel Pretty", "title": "After ‘I Feel Pretty’ Disappoints, What Should Amy Schumer Do Next?", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Box Office", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "After ‘I Feel Pretty’ Disappoints, What Should Amy Schumer Do Next?", "url": "https://variety.com/2018/film/box-office/amy-schumer-box-office-analysis-i-feel-pretty-1202779934/", "description": "Amy Schumer is undeniably funny, so why have her two latest films underperformed? The comedian’s third starring vehicle “I Feel Pretty,” written and directed by Marc Silverstein a…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/04/amy-schumer.jpg?w=1000", "width": 1000, "height": 563, "alt": "Amy Schumer'I Feel Pretty' film premiere, Arrivals, Los Angeles, USA - 17 Apr 2018WEARING BRANDON MAXWELL"}, "locale": "en_US"}, "article": {"published_time": "2018-04-23T14:21:42+00:00", "modified_time": "2018-04-29T05:48:42+00:00"}, "twitter": {"creator": "@rebeccaarubin", "site": "@variety", "text": {"title": "After ‘I Feel Pretty’ Disappoints, What Should Amy Schumer Do Next?"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/04/amy-schumer.jpg?w=1000", "alt": "Amy Schumer'I Feel Pretty' film premiere, Arrivals, Los Angeles, USA - 17 Apr 2018WEARING BRANDON MAXWELL"}, "card": "summary_large_image", "title": "After ‘I Feel Pretty’ Disappoints, What Should Amy Schumer Do Next?", "description": "Just how much is Amy Schumer willing to stretch her material beyond the themes of her appearance?"}, "author": "Rebecca Rubin", "content_type": "Article", "post_id": 1202779934, "title": "After 'I Feel Pretty' Disappoints, What Should Amy Schumer Do Next?", "published_at": "2018-04-23 07:21:42", "image": "https://pmcvariety.files.wordpress.com/2018/04/amy-schumer.jpg?w=1000", "comment_count": 143, "tags": "I Feel Pretty", "topics": "Box Office", "appeared_in_print": "No", "body": "Amy Schumer is undeniably funny, so why have her two latest films underperformed?\r\n\r\nThe comedian's third starring vehicle \"I Feel Pretty,\" written and directed by Marc Silverstein and Abby Kohn, launched to a soft $16 million last weekend. It's not a disaster, but it does represent Schumer's lowest opening for a film yet.\r\n\r\n\"In terms of her career trajectory, it's been a declining scale,\" box office analyst Jeff Bock said. \"It's a matter of her finding her feet. She's relatively new on the scene.\"\r\n\r\nThe comedian made her film debut alongside Bill Hader in 2015's hit \"Trainwreck.\" The incisive rom-com, written by Schumer and directed by Judd Apatow, bowed with $30 million and went on to earn $110 million. That's an impressive tally, particularly for a genre that has struggled to live up to the glory years of Meg Ryan and Julia Roberts. Audiences were familiar with Schumer's prolific stand-up career and her Comedy Central show, and no doubt were eager to see her tackle the big screen.\r\n\r\n\"Trainwreck\" proved to be a tough act to follow. Her next leading role, last year's \"Snatched,\" opened with $19 million. The comedy, written by Katie Dippold and directed by Jonathan Levine, earned a disappointing $45 million and some blistering reviews.\r\n\r\n\"I Feel Pretty\" has also struggled critically, earning a 33% rating on Rotten Tomatoes, along with a 31% average audience score. It has inspired a number of hot takes for its somewhat muddled message of body acceptance. Schumer has since addressed criticism, saying the film was unfairly judged based on the trailer and not the movie's theme of empowerment.\r\n\r\nAlthough she dropped out of Sony's live-action \"Barbie\" movie due to scheduling conflicts, it may have been for the best given the similar image-centric storyline as \"I Feel Pretty.\" Aside from a brief detour into drama with 2017's \"Thank You For Your Service,\" Schumer's big-screen roles have largely been in the same vein. The question now remains: just how much is Schumer willing to stretch her material beyond the themes of her appearance?\r\n\r\n\"If she wants to have a long career, that's essential,\" Bock said. \"Audiences do get tired of the same movie over and over.\"\r\n\r\nThat's something audiences might get to see soon, as the comedic drama \"She Came to Me,\" is one of her more promising future projects. Schumer will appear alongside Steve Carell and Nicole Kidman in the film that's still in pre-production, written and directed by Rebecca Miller.\r\n\r\n\"I always like it when comedic actors try their hand in dramatic roles. Audiences don't always follow them across that bridge, but there's nothing wrong with attempting,\" Bock said. \"It can't hurt your career.\"\r\n\r\nRegardless of performance, there is one thing her last two disappointing films have in common: Schumer didn't write them. Given her background in stand-up, it's no surprise she penned her most successful project to date. It's fair to say her movies could benefit from Schumer having a stronger hand in the screenplay.\r\n\r\n\"I don't think she's less talented [since 'Trainwreck'], I think it's a matter of finding the right project,\" Bock said. \"She's going to have to go through some bumps to find out why people were so enamored with 'Trainwreck.'\"\r\n\r\nHer untitled comedy with Jennifer Lawrence, which has been in development for some time now, will be the next test of Schumer's impact as a screenwriter.\r\n\r\n\"She has something people want to see,\" Bock said. \"She's a different kind of person in terms of what Hollywood usually throws money at.\"\r\n\r\nPOPULAR ON VARIETY", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1524493302.0, "source": "https://variety.com", "summary": ""}