{"url": "https://www.indiewire.com/2018/01/tessa-thompson-lena-dunham-times-up-golden-globes-1201915359/", "text": "Dunham's presence in a photo celebrating the initiative raised eyebrows.\n\nUPDATE (1/9/18): Tessa Thompson has clarified her statements regarded Time’s Up and Lena Dunham in a Twitter post.\n\nEARLIER: Tessa Thompson is among the many women taking part in the Time’s Up initiative, which made its presence felt at last night’s Golden Globes ceremony. In an Instagram comment, the star of “Thor: Ragnarok” said planning for the red carpet the day before the event required “6 hours, 60 artists, 8 activists and a lot of coffee.” And one of those people, Thompson said, was not Lena Dunham.\n\nIn the celebratory photo Thompson posted yesterday are Michelle Williams, Billie Jean King, Rashida Jones, Susan Sarandon, Laura Dern — and, on the end of the middle row, far right, is Dunham. The “Girls” creator and star has lain low of late; the last Tweet she wrote was an apology for casting doubt on Aurora Perrineau’s rape accusation. And, according to Thompson, her participation in Time’s Up planning was limited to the photo op: “Lena was not anywhere present in our group during the countless hours of work for the last two months.”\n\nThompson’s statement, which came in response to several commenters questioning why Dunham was in the picture at all, reads in full:\n\n“Lena was not anywhere present in our group during the countless hours of work for the last two months. We hosted an open house for actresses for red carpet messaging and Lena presence was a surprise to us all. This is a time of reckoning. And for many, a re-education. So many women also have real work to do. I’m afraid it’s too nuanced a conversation to have on this platform. But I hear you, and know that your thoughts and words are not lost on me. It’s been discussed”\n\nPopular on IndieWire\n\nWhat’s next for the initiative remains to be seen, but it shows no signs of slowing down. Most attendees wore black last night in recognition of the sexual-harassment problem in Hollywood and beyond, and Time’s Up was brought up several times throughout the ceremony.\n\nWhen asked to comment by IndieWire, Dunham responded, “I was honored to be invited to the meeting by a close friend and to observe the work that these amazing women have been doing the past few months. For highly personal reasons, I’ve been unable to join previous efforts but being asked to be a part of this celebratory moment was truly beautiful. I’ve worked with Tessa and respect her artistry and admire her consistent candor.”\n\nAdditional reporting by Jenna Marotta.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://www.indiewire.com/wp-content/uploads/2018/01/shutterstock_9126770ew.jpg?w=780", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F01%2Ftessa-thompson-lena-dunham-times-up-golden-globes-1201915359%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201915359&comment_count=3", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/uploads/2018/01/shutterstock_9126770ew.jpg", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/01/shutterstock_9126770ew.jpg", "keywords": [], "authors": ["Michael Nordine"], "canonical_link": "https://www.indiewire.com/2018/01/tessa-thompson-lena-dunham-times-up-golden-globes-1201915359/", "title": "Tessa Thompson Calls Out Lena Dunham, Says She ‘Was Not Anywhere Present’ for Time’s Up Planning", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Dunham's presence in a photo celebrating the initiative raised eyebrows.", "news_keywords": "Lena Dunham, Tessa Thompson, Time's Up", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Michael Nordine", "content_type": "Article", "post_id": 1201915359, "title": "Tessa Thompson Calls Out Lena Dunham, Says She 'Was Not Anywhere Present' for Time's Up Planning", "published_at": "2018-01-08 21:17:36", "image": "https://www.indiewire.com/wp-content/uploads/2018/01/shutterstock_9126770ew.jpg?w=300", "comment_count": 3, "tags": "Time's Up", "topics": "Film", "body": "UPDATE (1/9/18): Tessa Thompson has clarified her statements regarded Time's Up and Lena Dunham in a Twitter post.\r\n\r\npic.twitter.com/2cnO22XVMu\r\n— Tessa Thompson (@TessaThompson_x) January 9, 2018\r\n\r\n\r\nEARLIER: Tessa Thompson is among the many women taking part in the Time's Up initiative, which made its presence felt at last night's Golden Globes ceremony. In an Instagram comment, the star of \"Thor: Ragnarok\" said planning for the red carpet the day before the event required \"6 hours, 60 artists, 8 activists and a lot of coffee.\" And one of those people, Thompson said, was not Lena Dunham.\r\n\r\nIn the celebratory photo Thompson posted yesterday are Michelle Williams, Billie Jean King, Rashida Jones, Susan Sarandon, Laura Dern — and, on the end of the middle row, far right, is Dunham. The \"Girls\" creator and star has lain low of late; the last Tweet she wrote was an apology for casting doubt on Aurora Perrineau's rape accusation. And, according to Thompson, her participation in Time's Up planning was limited to the photo op: \"Lena was not anywhere present in our group during the countless hours of work for the last two months.\"\r\n\r\n\r\n\r\nThompson's statement, which came in response to several commenters questioning why Dunham was in the picture at all, reads in full:\r\n\"Lena was not anywhere present in our group during the countless hours of work for the last two months. We hosted an open house for actresses for red carpet messaging and Lena presence was a surprise to us all. This is a time of reckoning. And for many, a re-education. So many women also have real work to do. I’m afraid it’s too nuanced a conversation to have on this platform. But I hear you, and know that your thoughts and words are not lost on me. It’s been discussed\"\r\n\r\n\r\nWhat's next for the initiative remains to be seen, but it shows no signs of slowing down. Most attendees wore black last night in recognition of the sexual-harassment problem in Hollywood and beyond, and Time's Up was brought up several times throughout the ceremony.\r\n\r\nWhen asked to comment by IndieWire, Dunham responded, \"I was honored to be invited to the meeting by a close friend and to observe the work that these amazing women have been doing the past few months. For highly personal reasons, I've been unable to join previous efforts but being asked to be a part of this celebratory moment was truly beautiful. I've worked with Tessa and respect her artistry and admire her consistent candor.\"\r\n\r\nhttps://www.instagram.com/p/BdrXV4Nl5Nk/\r\n\r\nAdditional reporting by Jenna Marotta.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/01/tessa-thompson-lena-dunham-times-up-golden-globes-1201915359/", "title": "Tessa Thompson Calls Out Lena Dunham, Says She ‘Was Not Anywhere Present’ for Time’s Up Planning", "description": "Dunham's presence in a photo celebrating the initiative raised eyebrows.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/01/shutterstock_9126770ew.jpg", "width": 780, "height": 520}}, "article": {"published_time": "2018-01-09T02:17:36+00:00", "modified_time": "2018-01-09T13:35:25+00:00", "author": "https://www.indiewire.com/author/indiewiremnordine/", "section": "Film", "tag": "Time's Up"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1515464256.0, "source": "https://www.indiewire.com", "summary": ""}