{"url": "https://people.com/parents/dream-kardashian-christmas-card-rollout/", "text": "Dream Kardashian has made her KarJenner Christmas card debut!\n\nThe 13-month-old daughter of Rob Kardashian and his ex-fiancé Blac Chyna stole the show in the latest image to be shared from the 2017 card shoot — which Kim Kardashian West, Kourtney Kardashian, and momager Kris Jenner have all been slowly revealing, bit by bit, since the first of the month in a 25-day countdown.\n\nGet push notifications with news, features and more.\n\nWearing a short-sleeve white top, Dream was front-and-center in the day nine picture. She looked adorable too, staring at the camera and sticking her tongue out.\n\nBehind her, Kourtney’s oldest son Mason (who turns 8 this month), could be see seen running while dressed in a head-to-toe white look. A bare green Christmas tree was also in the shot.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nRELATED: See Every Single 2017 Kardashian/Jenner Christmas Card Countdown Photo\n\nThe 2017 KarJenner Christmas card rollout began on Dec. 1 with a panorama shot of Kim and husband Kanye West‘s 2-year-old son Saint, followed by snaps of his 4-year-old sister North on days two, four, six and seven (a few of those featuring her mama, too).\n\nBirthday boy Saint took over in an up-close solo shot on day five. “HAPPY BIRTHDAY to my beautiful boy Saint! I love you so much! You don’t even understand!!!” Kim captioned the shot showing Saint sporting a pair of jeans against a white background and clutching a wrapped gift.\n\nDay three and day six belonged to Kourtney’s kids with ex Scott Disick — Reign Aston, 3 this month, starring solo on day three and then Mason and 5-year-old sister Penelope joining in on the fun for day six.\n\nSisters Klohé Kardashian and Kylie Jenner, who are both pregnant with their first children, as well as Kendall Jenner, have yet to make an appearance.\n\nhttps://www.instagram.com/p/BcTxtFHFP5w/\n\nhttps://www.instagram.com/p/BcU7ZDZFWFh/?hl=en&taken-by=kimkardashian\n\nThe Kardashian-Jenner family Christmas card has become the stuff of legends. They’ve done everything from posing in glamorous gowns on the stairs in 2010 to testing out a 3D version in 2011 and even a chaotic carnival in 2013.\n\nBut in 2015, after a tumultuous year, the Kardashian-Jenners decided to go back to basics and settled on a sweet, simple photo of the youngest family members set against a plain white backdrop. The family opted to not release a card in 2016.\n\nThis year, the KKW Beauty entrepreneur took on the role of organizing the Christmas card shoot — which which was captured by photographer Eli Linnetz.\n\n“This year’s Christmas card is shot really casually. We’re kind of doing jeans and T-shirts vibe. Really cute. All the kids and so hard to put together,” Kardashian — who is expecting a baby no. 3 (via surrogate) early next year — said in November during her appearance on The Late Late Show. “It’s women and children this year.”\n\nRELATED: Kim Kardashian Is Giving Us A Piece Of Their Christmas Photo One Day At A Time\n\nMeanwhile, it’s shaping up to be a very merry Christmas for Dream — who will be celebrating the big day with mom Chyna and her brother King Cairo, 5.\n\n“We’ll be spending it together at my house,” Chyna — who shares King with ex Tyga — tells PEOPLE. “King is really excited about Santa, decorating the Christmas tree and his gifts! So it’s really exciting to get the house holiday ready. And Dream is fascinated with Santa and loves all of the lights. She’s getting into it all.”\n\nThe entrepreneur also revealed that Dream has started “walking and running.”\n\n“It’s so much fun chasing her around!” she says. “And she’s started to say words, so it’s really fun seeing her personality come out.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1720&h=901&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkris-jenner.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1720&h=901&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkris-jenner.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/parents/dream-kardashian-christmas-card-rollout/", "title": "Dream Makes Her Kardashian-Jenner Christmas Card Debut", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Blac Chyna,Dream Kardashian,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Rob Kardashian", "news_keywords": "Babies,Blac Chyna,Dream Kardashian,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,Rob Kardashian", "description": "Dream Kardashian steals the show in the latest image to be shared from the 2017 KarJenner Christmas card", "og": {"title": "Dream Makes Her Kardashian-Jenner Christmas Card Debut", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/dream-kardashian-christmas-card-rollout/", "description": "Dream Kardashian has made her KarJenner Christmas card debut! The 13-month-old daughter of Rob Kardashian&nbsp;and his ex-fiancé Blac Chyna&nbsp;stole the show in the latest image&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1720&h=901&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkris-jenner.jpg", "width": 1720, "height": 901}}, "pinterest": {"url": "https://people.com/parents/dream-kardashian-christmas-card-rollout/", "description": "Dream Kardashian steals the show in the latest image to be shared from the 2017 KarJenner Christmas card", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkris-jenner.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/dream-kardashian-christmas-card-rollout/", "title": "Dream Makes Her Kardashian-Jenner Christmas Card Debut", "description": "Dream Kardashian steals the show in the latest image to be shared from the 2017 KarJenner Christmas card", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1720&h=901&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fkris-jenner.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}