{"url": "www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein", "text": "On the day in late February when I arrive at Georgina Chapman’s town house in the West Village to interview her, it’s unseasonably hot, nearly 80 degrees. I am ushered to the parlor floor, where, even though it feels like August outside, a fire is roaring away. As I wait, it suddenly dawns on me that I am sitting in Harvey Weinstein’s living room. He purchased the six-story house in 2006, the year before he married Chapman, and she has since put her stamp all over it: black floors and white rugs, chinoiserie, lots of gilt and glass, hydrangeas in a vase, a Jo Malone candle burning. On a console table are silver-framed photographs from happier times, mostly of the couple’s children: India and Dashiell, seven and five. All evidence of the original occupant would appear to have been scrubbed away—except for a large piece of art hanging in the hallway. At the bottom, it is signed, “For Harvey Weinstein.” The drawing is dominated by a large empty circle, next to which it reads, “The moon was here.”\n\nI had been introduced to Chapman, dressed in a floor-length dark print dress, a couple of weeks earlier at the West Twenty-sixth Street atelier of the fashion company, Marchesa, that she co-owns with Keren Craig. That day, she struck me as hyperalert: flitting around, wide-eyed and nervous, uncomfortable in her skin—or lack thereof, as it were. She mentioned, almost in passing, that she hadn’t been out in public in five months—not since the news broke in October of so many unbearably similar accusations by so many women of harassment, abuse, and rape perpetrated by her husband. When she appears today, dressed in jeans, a white T-shirt, ballerina flats, and an armful of gold bracelets, she is more relaxed, though there’s a gallows humor—a morbidity—firmly in place. When I mention the disturbingly warm weather, she laughs and says, “Think of all the poor plants that are going to spring out and then die.”\n\nWe head downstairs to the ground floor, where most of the living takes place: a big, casual, open space with lots of color, modern furniture, and surprising art. There’s a huge, elegant kitchen that looks out onto a backyard, and a TV room where Dash, on spring break, is sitting on a sectional, ensorcelled by some kind of electronic device. At 42, Chapman looks younger. Or is it that she seems younger? In photographs, she has often reminded me of Victoria Beckham—chiseled and somewhat brittle-looking. But, today, dressed so California-casual, her hair now long and blonde, with wide-set blue eyes and fine features, she looks more like a younger Michelle Pfeiffer. Though she is English to her core, using whilst and learnt in a thick, posh accent, she is more goofy than I had imagined. As we sit down to lunch—a simple spread of veal Milanese and eggplant parmigiana—she seems a bit flustered, unable to maintain a hostess facade for too long, or even to decide where I should sit.\n\nOur meeting, in her soon-to-be ex–town house that her soon-to-be ex-husband recently sold, was meant to be the moment when Chapman would finally, publicly address for the first time what happened. The night before, she had called me fairly late, and I thought she was going to back out. She sounded worried, apologizing profusely, talking fast. She was not ready to address anything too difficult, did not feel prepared. I reassured her that we could talk about her life before Harvey or about Marchesa—which is exactly what we did at first.", "images": ["https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/master/w_2560%2Cc_limit/gc-vogue-june-2018.jpg", "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/w_1280,c_limit/gc-vogue-june-2018.jpg", "http://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg", "http://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://assets.vogue.com/photos/5af35b1aff742b06767b708d/master/w_1600%2Cc_limit/02-gc-vogue-june-2018.jpg", "http://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg"], "top_img": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/w_1280,c_limit/gc-vogue-june-2018.jpg", "keywords": [], "authors": ["Jonathan Van Meter", "Jonathan Van Mete", "Annie Leibovit"], "canonical_link": "https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein", "title": "Georgina Chapman on Life After Harvey Weinstein", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Jonathan Van Meter", "copyright": "Copyright (c) Condé Nast 2020", "description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.", "id": "5af3524e5606fe3cb0edfca9", "keywords": "magazine,culture", "news_keywords": "magazine,culture", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5af3524e5606fe3cb0edfca9", "parsely-metadata": "{\"description\":\"When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.\",\"image-16-9\":\"https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/w_1000,c_limit/gc-vogue-june-2018.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/1:1/w_1000,c_limit/gc-vogue-june-2018.jpg\"}", "og": {"description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.", "image": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/w_1280,c_limit/gc-vogue-june-2018.jpg", "site_name": "Vogue", "title": "Georgina Chapman on Life After Harvey Weinstein", "type": "article", "url": "https://www.vogue.com/article/georgina-chapman-life-after-harvey-weinstein"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "When numerous women spoke out about Harvey Weinstein, his wife remained silent—until now. Georgina Chapman opens up about her marriage, her divorce & her future.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5af35b2173084b3aba5248e3/16:9/w_1280,c_limit/gc-vogue-june-2018.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Georgina Chapman on Life After Harvey Weinstein"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "http://www.vogue.com", "summary": ""}