{"url": "https://web.archive.org/web/20170427021747/http://www.bravotv.com/blogs/here-are-all-the-things-caitlyn-jenner-says-about-kris-jenner-in-her-book", "text": "In Caitlyn Jenner's new memoir, The Secrets Of My Life, she covers everything from childhood, to college, to the Olympics, to her three marriages and children. There's even a part dedicated to how she feels about Robert Kardashian. (More on that later.)\n\nBut let's be honest — we want the Kris juice. Did she know? What did she know? What is she really like?\n\nHere is a breakdown of all the Kris information we gathered from the book.\n\nA breakdown:\n\nFirst and foremost, Kris was savvy enough to trademark the name \"momager\" early on. She owns it and she makes money off it. Now that's just genius.\n\nWho set them up?\n\nBaseball player Steve Garvey and his first wife Candace thought Candace's newly-divorced friend Kris Kardashian would be \"perfect\" for Bruce.\n\n\"The wheels click in my mind: She has four children. I have four children. That's eight kids. Kris has the same amount of baggage that I do,\" Caitlyn writes.\n\nThe two first meet face-to-face at the Riviera Country Club, a golf course in the Pacific Palisades. When Bruce first spots Kris, she is in a white pantsuit. She is in a white pantsuit. Of course she is. She means business. She's Kris Kardashian. Kris also dragged along her nanny to the golf tournament, a weird move that Caitlyn still hasn't figured out to this day since the kids weren't there.\n\nAnyway, then-Bruce makes small talk about sports at the event with the guys, while Kris floats around air kissing and making future plans with every woman at the event and Bruce eyeballs her in action.\n\n\"Who is this person?\" Caitlyn remembers thinking.\n\nAfterward, the two hit dinner together at Ivy at the Shore in Santa Monica (Kris' choice), where Bruce polishes off a plate of meatloaf and mashed potatoes and Kris doesn't eat but instead expertly applies lipliner to her lips without using a mirror, right there at the table. This is significant at the time to a confused Bruce, who, A. is secretly jealous of her makeup application skills, and B. still finds it a turn-on even though he is feeling like a woman inside. (At this point he has just stopped hormone treatments.)\n\n\"Right before we leave Kris applies pencil outliner on her lips,\" Caitlyn writes. \"She doesn't even use a mirror. She just goes zip zip zip. It's perfect. Now, I actually know something about using pencil outliner, and it's very hard to do without a mirror (although I'm proud to say I have mastered it.) Now I'm hooked.\"\n\nThe two start dating, says Caitlyn, and grow very serious very quickly. In addition to her blind liplining skills, Kris' business acumen soon becomes very clear. Early on the two have dinner with a big Hollywood producer.\n\n\"Every time he mentions someone, Kris says she not only knows her or him but also the entire family, without trying to show off in the least,\" says Caitlyn. \"Finally flumoxed, the producer turns to her in the middle of dinner and says: Who are you?\"\n\nCaitlyn says Kris says something so uncharacteristic of her today that you'd have to be there to believe it, which Bruce was.\n\n\"I'm just a mom in Beverly Hills,\" she writes of Kris' reply. Not for long.\n\nCaitlyn goes on to describe the way Kris naturally deals with people and \"takes charge without them even knowing it.\"\n\nKris \"sends flowers or some other gift after every meeting.\"\n\nShe has \"a combination of charm and professional intelligence.\"\n\nShe's \"attentive and thoughtful,\" \"natural and disarming about it all.\"\n\nCaitlyn says at this point in her life as Bruce, Kris \"saved my life,\" the same way sports had as a child.\n\n\"Love is at the crux of us. But I believe, and this is my opinion and my opinion only, we both want something from each other. I know I do.\"\n\nAfter they marry, Kris restores Bruce's credibility, gets him back on the speech circuit, and creates genius infomercials starring the two of them to sell exercise equipment with the former Olympian's name attached. They become rich together.\n\nThe two have \"good and frequent\" sex in the beginning, then it becomes sporadic, then not at all.\n\nOn being Caitlyn:\n\n\"I tell Kris about my gender issues before I make love to her,\" writes Caitlyn. \"I told her there had been a woman inside me all my life.\"\n\nBruce always cross-dressed in front of Kris, but for fear of the kids catching him, she made him do it only while on the road, which Bruce began to resent. He also started stealing her gowns and purses to wear while away.\n\nAt this time, Kris forms a business friendship with Ryan Seacrest, who is looking to develop new shows. Caitlyn says she pitched the idea of a show about their blended family to Kris as Keeping Up With the Kardashians, and Kris later claimed it as her own.\n\nAs the show takes off, Kris \"takes complete charge,\" refusing to relax \"until everything is right the way she wants it right.\"\n\nBruce marvels at her \"vibrancy and style,\" then Kris fires his management and PR teams. She streamlines their company and the family starts to get famous.\n\nBut as they begin filming, Caityn says, \"the woman inside me has always been clawing and scratching to get out.\"", "images": ["https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/blog-post--mobile/public/field_blog_image/2017/04/personal-space-caitlyn-kris-book.jpg?itok=D5vObcKU&timestamp=1493228401", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/related-posts--computer/public/field_blog_image/2017/04/personal-space-kris-jenner-promote.jpg?itok=vjFfF6Zj&timestamp=1492712258", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/embedded-related-post__1_5x/public/field_blog_image/2017/04/personal-space-caitlin-jenner-promote.jpg?itok=Psg9cbqB", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/microsite-logo--mobile-1_5x/public/2017/04/verticals-white-personalspace.png?itok=Yvysn4kX&timestamp=1492116909", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/all/modules/custom/common_site/images/transp-bg-60-black.png", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/related-posts--computer/public/field_blog_image/2015/06/dish-060115-vanity-fair-bruce-jenner.jpg?itok=IrJLbTCH&timestamp=1433181546", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/blog-post-embedded--computer/public/personal-space-kris-bruce.jpg?itok=N9DxRf4F", "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/04/personal-space-caitlyn-kris-book.jpg"], "top_img": "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/04/personal-space-caitlyn-kris-book.jpg", "keywords": [], "authors": ["Marianne Garvey"], "canonical_link": "https://web.archive.org/web/20170427021747/http://www.bravotv.com/blogs/here-are-all-the-things-caitlyn-jenner-says-about-kris-jenner-in-her-book", "title": "Here Are All The Things Caitlyn Jenner Says About Kris Jenner In Her Book", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "vertical_name": "Personal Space", "fb": {"app_id": 1592250694320227}, "og": {"site_name": "Bravo TV Official Site", "type": "article", "title": "Here Are All The Things Caitlyn Jenner Says About Kris Jenner In Her Book", "url": "https://web.archive.org/web/20170427021747/http://www.bravotv.com/blogs/here-are-all-the-things-caitlyn-jenner-says-about-kris-jenner-in-her-book", "description": "In Caitlyn Jenner's new memoir, The Secrets Of My Life, she covers everything from childhood, to college, to the Olympics, to her three marriages and children. There's even a part dedicated to how she feels about Robert Kardashian. (More on that later.) But let's be honest — we want the Kris juice. Did she know? What did she know? What is she really like? Here is a breakdown of all the Kris information we gathered from the book.", "image": "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/04/personal-space-caitlyn-kris-book.jpg"}, "twitter": {"card": "summary_large_image", "site": "@bravotv", "url": "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/blogs/here-are-all-the-things-caitlyn-jenner-says-about-kris-jenner-in-her-book", "title": "Here Are All The Things Caitlyn Jenner Says About Kris Jenner In Her Book", "description": "In Caitlyn Jenner's new memoir, The Secrets Of My Life, she covers everything from childhood, to college, to the Olympics, to her three marriages and children. There's even a part dedicated to how she feels about Robert Kardashian. (More on that later.) But let's be honest — we want the Kris juice. Did she know? What did she know? What is she really like? Here is a breakdown of all the Kris information we gathered from the book.", "image": "https://web.archive.org/web/20170427021747im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/04/personal-space-caitlyn-kris-book.jpg"}, "article": {"published_time": "2017-04-26T14:24:00-04:00", "modified_time": "2017-04-26T15:56:44-04:00"}}, "movies": [], "publish_date": 1493231040.0, "source": "https://web.archive.org", "summary": ""}