{"url": "https://www.womansday.com/health-fitness/a18535968/bob-harper-heart-attack-lessons/", "text": "Biggest Loser trainer and TODAY show health contributor Bob Harper, 52, suffered a near-fatal heart attack in February 2017.\n\nSince then he's made some major changes to his diet, workouts, and lifestyle.\n\nNow, he says he embraces carbs, mid-intensity workouts, transcendental meditation, and living in the moment.\n\nIt still seems unfathomable that health and fitness expert Bob Harper suffered a near-fatal heart attack last year on February 12, 2017. “It’s been a very challenging year and an eye-opening year,” he told WomansDay.com. “So much has had to change for me personally. Not only have I had to change my diet, I’ve had to change the way that I work out—the way that I live.”\n\n\n\nThe 52-year-old Biggest Loser trainer recounts the dizzy spells he had been experiencing weeks prior to collapsing at a New York City gym on that fateful day. “What I should have done was seen a doctor immediately,” he says. “I’m a workout nut, so I’m used to being uncomfortable, I’m used to being in pain. So I did something that’s so dumb—I learned how to adjust. It was not smart on my part.”\n\nBut what a difference a year makes. Here, the author and television personality shares the five ways he has transformed his health—and his life—from the inside out.\n\nHe is embracing carbs.\n\nHarper, who is currently a health contributor on TODAY and a frequent co-host of the Racheal Ray Show, was consuming a high-protein, high-fat diet prior to his heart attack. “I was healthy, I was fit, I was strong, I watched what I ate. But now I realized that what my diet was lacking—maybe I don’t want to say lacking, but how it was different—was that it didn’t have balance,” he explains.\n\nSt. Martin's Press\n\nThe missing component: Carbohydrates. After all, he was well-aware that cutting out carbs typically results in rapid weight loss. “Yet what I’ve found for longevity, it’s very hard for a lot of people to sustain that type of diet.” Today, his meal plan “leans more on the Mediterranean-style” with a focus on plant-based foods, including more fruits and vegetables, as well as whole-grains. “There are so many great pastas out there, like red lentil, chickpea pasta, and quinoa pasta,” he adds. “I like being able to eat a sandwich and not feel like I’ve committed a cardinal sin!”\n\nAnd yes, it is possible to shed unwanted pounds—and keep them off—on this regime, which is the premise of his latest book, . “I think the biggest thing people are going to learn from my book is I want to press the reset button,” explains Harper. “I think there have been a lot of very lopsided, extreme diets for the last couple of decades. I want to put balance back onto your plate—and get you to lose weight, if that’s what you’re trying to do—with protein, fats, and carbohydrates so you can not only do this diet, but have it be a way of life. Balance in every aspect of my life—especially now—is super important.”\n\nHe has said goodbye to intense workouts.\n\nThis longtime CrossFit enthusiast admits that modifying his fitness routine was not an easy adjustment. “I was the guy who was posting these workouts of myself in the gym doing these really crazy things, but I’m not able to do that anymore,” he says. “And it’s okay. I’ve cut myself slack, which is a new thing for me.”\n\nHe labels his current workouts as mid-intensity with a longer time domain, “meaning I’m working out a little longer to condition more heart, to keep my heart rate up—that’s what I learned in my cardiac rehab,” continues Harper. “They want me to keep my heart rate up for about 30 to 45 minutes, but not too intense.”\n\nPlus, he’s added other forms of exercise to his lifestyle. “I walk a lot with my dogs [Karl and Vivienne] here in the city [New York City], I’m doing a lot of yoga, and I’ve been wanting to incorporate boxing—that’s my challenge for 2018.” And he’s no longer sweating it out every single day (he averages about five days a week). “I used to be very regimented—I knew how I was going to work out on Monday, I knew what I was going to do every day following. But now it’s a little more relaxed.”\n\nHe takes time each day to focus on inner calmness.\n\nA three-time New York Times bestselling author, Harper regularly practices transcendental meditation (TM), which involves silently repeating a mantra in order to place your body in a state of profound rest and allow your mind to achieve a sense of peace, as defined by the Mayo Clinic. “TM, yoga, and my dogs really help me with managing my stress,” he emphasizes. “I tell people you have to find whatever it is in your life that you can do to turn off the white noise, just for a few minutes. If it means sitting with your phone off for five or ten minutes and not having to focus on anyone or anything— those things are so good for you. It helps your brain, it helps your body.”\n\nHe is living in the moment.\n\nAnother similar lesson Harper has learned over the last year is to be present in the present. He recalls suffering from depression and an identity crisis early in his recovery since his only goal was to hit the gym hard once again.\n\nBob Harper on Biggest Loser, season 17. Getty Images\n\n“I felt like beating my fist up again the wall because I wasn’t able to do it,” he confesses. “All I wanted to do in my recovery was get back to work and what I thought was normal again… I was the fitness guy—I went to the gym for social, I went to the gym for fitness, I went for stress, I went for all these things. And when my doctors took that away from me after my heart attack, I didn’t know what to do with myself.”\n\n\n\nYet he discovered that “the universe had a way of self-adjusting” his perspective on life. “I understand now that I’m more than just the fitness guy—I’m more than that,” he continues. “And that was kind of liberating to come to that conclusion.” Today, he relies on a special piece of jewelry that encourages him to be mindful. “I have this bracelet that I wear all the time that says, ‘Be Here Now.’ It’s that touchstone that says, ‘Okay, I can’t stress about the big things or the small things.’”\n\nHe leans on his medical team.\n\nPrior to February 2017, Harper would head to the doctor’s office for a routine physical exam every now and then. “I didn’t see doctors very much and I would kind of get nervous when I’d go to the doctor,” he says. “And now, I’m very comforted by having a doctor. I’m working with a team of doctors that have become a part of my life that are guiding me through this new journey.”\n\nSomething else that is also “completely new” for him is taking medication. “One of the things that was a really big wake-up call for me after I had a heart attack was when my doctors told me I’d be more likely to have another heart attack within the first year,” states Harper. “I said, ‘Okay, you tell me what I need to do.’” He was instructed to leave the hospital with BRILINTA, a prescription drug for heart attack treatment. Today, Harper is working with AstraZeneca, the company that distributes the med. “Teaming up with them has been very personal for me because I am a heart attack survivor. It was such an organic fit.”\n\nAnd he hopes his experience will inspire others to establish a relationship with their physician. ”I remember Savanah Guthrie from the TODAY show reached out to me and said, ‘When I heard this happened to you, I immediately went to my doctor,’” he concludes. “I thought that was so powerful because I want people to be proactive. I don’t want you to just look in the mirror and say, ‘Damn, I look good.’ I want you to be able to see your doctor and make sure that you are good.”", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=1.00xw:0.832xh;0,0.0347xh&resize=1200:*", "https://hips.hearstapps.com/wdy.h-cdn.co/assets/16/20/2560x1280/landscape-1463421965-gettyimages-461491920.jpg?resize=300:*", "https://hips.hearstapps.com/wdy.h-cdn.co/assets/17/51/2560x1280/1513878899-landscape-1513877370-gettyimages-857999162.jpg?resize=300:*", "https://hips.hearstapps.com/wdy.h-cdn.co/assets/17/11/768x384/1489770946-landscape-1489162048-screen-shot-2017-03-10-at-110705-am.png?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=1.00xw:0.832xh;0,0.0347xh&resize=1200:*", "keywords": [], "authors": ["Amy Capetta", "Amy Capetta Has Been Writing Health", "Lifestyle Articles For Over Years."], "canonical_link": "https://www.womansday.com/health-fitness/a18535968/bob-harper-heart-attack-lessons/", "title": "Bob Harper Post-Heart Attack Workout Routine and Diet", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Woman's Day", "title": "One Year After His Near-Fatal Heart Attack, Bob Harper Has Made Some Major Life Changes", "description": "\"Balance in every aspect of my life &mdash; especially now &mdash; is super important.\"", "url": "https://www.womansday.com/health-fitness/a18535968/bob-harper-heart-attack-lessons/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=1.00xw:0.832xh;0,0.0347xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 189409181375, "pages": 23369976782}, "article": {"publisher": "https://www.facebook.com/womansdaymagazine", "modified_time": "2019-10-22 09:27:33", "published_time": "2018-02-25 01:13:00", "section": "Health + Fitness", "opinion": "false"}, "twitter": {"site": "@WomansDay", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=1.00xw:0.832xh;0,0.0347xh&resize=640:*"}, "google-site-verification": "88OheVwz361qAoXqcBWp3eud94wa7HYEcEEydEZZZRk", "title": "Bob Harper Post-Heart Attack Workout Routine and Diet", "description": "One year after experiencing a near-fatal heart attack, Biggest Loser trainer Bob Harper opens up to Woman's Day about the major changes he's made to his diet, workout routine, and more.", "keywords": "bob harper, biggest loser, heart attack, bob harper diet, bob harper workout, what is bob harper doing now, bob harper after heart attack", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=0.604xw:1.00xh;0.199xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Health + Fitness,health-fitness", "sailthru.date": "2018-02-25T01:13:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=1.00xw:0.832xh;0,0.0347xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-02-24-at-7-57-54-pm-1519520423.png?crop=0.604xw:1.00xh;0.199xw,0", "sailthru.socialtitle": "One Year After His Near-Fatal Heart Attack, Bob Harper Has Made Some Major Life Changes", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1519492380.0, "source": "https://www.womansday.com", "summary": ""}