{"url": "https://www.etonline.com/the-bachelorette-9-things-to-expect-from-becca-kufrins-badass-season-103089", "text": "Becca Kufrin is ready to do the damn thing.\n\nThe 28-year-old publicist begins her new journey to find love when The Bachelorettepremieres on Monday, and we couldn't be more ready for this redemption story.\n\nKufrin, of course, was announced as the Bachelorette on The Bachelor: After the Final Rose in March, just one night after audiences watched Arie Luyendyk Jr. propose to her, only to later blindside her with a breakup to pursue a relationship with his runner-up, Lauren Burnham.\n\nThroughout it all, Kufrin has been nothing but a class act, and that's exactly what Bachelor Nation can expect from her season of The Bachelorette -- along with a few goofy moments she promises will make for a great blooper reel.\n\nFind out exactly what to expect, in Kufrin's own words, below:\n\n1. A Lot of Laughs and a Couple Tears\n\nBefore filming started, Kufrin was aiming to keep her season light-hearted. \"I'm not like, the cookie cutter [Bachelorette]. I say awkward things at awkward times, but that's just me. I can laugh at it all and just go with the flow and have fun,\" she told ET's Lauren Zima at her first official Bachelorette photo shoot. \"At the end of the day, I never want to take myself too seriously.\"\n\nAnd at the show's junket last week, she praised her guys for making her laugh. \"I had 28 guys, but they all stuck out in their own way, and they all did something that put a smile on my face, or make me laugh or keep me on my toes,\" she said -- before revealing that things do actually get a little emotional.\n\n\"You'll get every type of emotion. I'll cry a lot. I'll laugh a lot. I'll swear sometimes. I'll make some dirty jokes that my mom will not like,\" she confessed. \"We had so many great musical acts throughout the entire thing, and that will be really fun to watch back.\"\n\n2. Two Strong Love Stories -- and Possible \"I Love Yous\" from Kufrin\n\nChris Harrison told ET \"a lot of guys fell in love with Becca,\" and she told us that she felt the same way -- at least about two of them.\n\n\"I did develop really strong feelings for a couple of them and I did fall for two guys at the end, yes,\" she told ET at the Bachelorette junket, teasing whether fans will actually see her say \"I love you\" to both men. \"You'll have to wait and see.\"\n\n3. A Lasting Engagement\n\nIt's the real deal with Kufrin's final pick -- and fiance! -- and she's determined to make it down the aisle. \"I better [marry him]. He better marry me!\" she shared.\n\n'Bachelorette' Becca Kufrin Is Engaged This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Bachelorette' Becca Kufrin Is Engaged\n\n\"It feels so different because the relationship and the guy is different. And this time, it feels better suited for me,\" she explained of how her mystery man differs from Luyendyk. \"I am willing to do anything it takes to make it work to support my partner.\"\n\n\"I was asking for a teammate, a 50/50 throughout the entire season. I feel like I truly found that,\" she added. \"So we'll have each others backs through the time where we have to stay private. And then we'll continue that and share it with the world.\"\n\n4. Not a Lot of Badmouthing Arie -- at Least from the Bachelorette\n\n\"You know, everyone is entitled to their own opinions,\" Kufrin very diplomatically told ET at her photo shoot, when asked about criticisms of Luyendyk. \"At the end of the day, he's gonna do whats best for him, and so everyone has their own opinions. I do wish him the best though. I'm not gonna talk bad about anyone.\"\n\nKufrin's men, however, are another story. Fans already watched Lincoln call the race car driver a \"wanker\" on After the Final Rose, and it seems there might be more where that comes from.\n\n5. ...Arie Himself?\n\nDuring his appearance with Burnham on The View last week (where they announced their wedding date), Luyendyk hinted that he and his fiancee might make an appearance on Kufrin's season of The Bachelorette.\n\n\"I don't know,\" Kufrin told ET at the junket later that day. \"You'll have to wait to find out.\"\n\n6. Respectful Breakups\n\nWhile Kufrin admitted to being able to sympathize with Luyendyk's tough choices, one thing she was determined to do differently was her season's breakups.\n\n\"When I did say goodbye to the guys, I just wanted to do it as respectfully as possible,\" she said during a conference call with reporters.\n\n7. One \"Ridiculous\" Fight\n\nHarrison told ET at ABC's upfront presentation earlier this month that Kufrin's season of The Bachelorette would include \"maybe the most ridiculous fight you've ever seen in the history of our show\" -- and promos showing ambulances and a few punches being thrown definitely support his statement.\n\n\n\n\"It's just magnificent to watch. It's going to be one of those [seasons where] you're watching through your fingers because you're embarrassed for everybody involved, but you can't stop watching,\" he promised.\n\nKufrin, meanwhile, told ET before her season that she was hoping to \"weed out all of the drama as early as possible.\" \"I don't want drama,\" she insisted. \"I know that it's going to happen, but at the end of the day, I want somebody that gets along with everyone. So if there's a guy that's not meshing well with other guys, that's a huge red flag. I probably won't want to keep him around that long.\"\n\n8. A Badass Becca\n\n\"You're really going to get a better glimpse of the strong, independent woman she is,\" Harrison stressed to ET. \"I think people feel like, 'Oh, she's just this nice pushover.' She is not. She's a badass woman that can handle her own, trust me. And I'm very defensive of my Bachelorettes. She doesn't need it. She took care of herself.\"\n\n\"I was very decisive,\" Kufrin confirmed on a conference call with reporters, laughing at Harrison dubbing her a \"badass.\" \"I'm very in tune with what I was thinking and feeling in the moment, and I wasn't afraid to switch things up.\"\n\nShe'll also be pretty likable, according to former Bachelor and Generous Coffee co-founder Ben Higgins.\n\n\"I have heard nothing but amazing things about Becca. Becca is somebody that people love. The production side of it loves her because she’s flexible. She keeps a joy about her and a love about her,\" Higgins told ET. \"What I’ve heard is that it’s going to be a great season in terms of the love category. But I’ve also heard that it isn’t without it’s lack of drama, which is what we expect from that show.\"\n\n\"We all are going into it rooting for her,\" he added. \"This is going to be something that we’re all excited about.\"\n\n9. No Surprise Exes, But a Man From Her Past Will Show Up\n\n\"No,\" Kufrin replied on the conference call when asked if her ex, Ross Jirgl, will make another appearance after trying to sweep her away from Luyendyk last season. \"I think he got the point in Peru when I told him that we had no future. That was it.\"\n\nThe brunette beauty will get a visit from an acquaintance on night one, however, as Harrison teased during the cast announcement they have different memories of their past together.\n\nWhat do you think Kufrin's reaction will be to seeing this mystery man from her past? And what are you most looking forward to about her season? Let us know at ET's new Facebook page, Group Date: A Bachelor Nation Support Circle.\n\nGroup Date: A Bachelor Nation Support Circle Facebook Group · 32 members Join Group The official Entertainment Tonight Bachelor Group!\n\nKufrin's season of The Bachelorette premieres Monday at 8 p.m. ET/PT on ABC. See more in the video below.\n\nRELATED CONTENT:\n\nBecca Kufrin Reveals Why She Applied for 'The Bachelor'\n\n'Bachelorette' Becca Kufrin Reveals She Fell in Love With 2 Men (Exclusive)\n\n'Bachelorette' Becca Kufrin Reacts to Arie Luyendyk Jr. Announcing His Wedding Date Right Before Her Premiere\n\n'Bachelorette' Becca Kufrin 'Doesn't Care' Arie Luyendyk Jr. Announced His Wedding Date (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://scontent-lax3-1.xx.fbcdn.net/v/t1.0-0/c0.0.566.295/p526x296/33715439_2009042439120243_2537453278178836480_n.jpg?_nc_cat=0&_nc_eui2=AeH8BtNTrR44sivJlekd7eCEt178Lpzd4ovHwt3wiQ5wBXmJaqhfEl5YrqTgoOpyLfphtkBUnXEDGb-X-ldsT2fWOzOZ4HR55RszX33aTHwanw&oh=15fb49f01cdbbb5efb05fb82fbd3bce1&oe=5B8245CB", "https://facebook.com/images/groups/plugin/email/app_fb_32_fig_white.png", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-05/becca_kufrin_148892_1371.jpg?h=c673cd1c&itok=tDy6_BR3", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/peter_madison_gettyimages-1206495953_1280.jpg?h=c673cd1c&itok=KXkKlwfc", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/becca_kufrin_148892_1371.jpg?h=c673cd1c&itok=Vi1Hcqzh"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/becca_kufrin_148892_1371.jpg?h=c673cd1c&itok=Vi1Hcqzh", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/the-bachelorette-9-things-to-expect-from-becca-kufrins-badass-season-103089", "title": "'The Bachelorette': 9 Things to Expect from Becca Kufrin's 'Badass' Season", "meta_data": {"article": {"opinion": "false"}, "title": "'The Bachelorette': 9 Things to Expect from Becca Kufrin's 'Badass' Season  | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/the-bachelorette-9-things-to-expect-from-becca-kufrins-badass-season-103089", "title": "'The Bachelorette': 9 Things to Expect from Becca Kufrin's 'Badass' Season", "description": "Becca Kufrin is ready to do the damn thing.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/becca_kufrin_148892_1371.jpg?h=c673cd1c&itok=Vi1Hcqzh", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Becca Kufrin is ready to do the damn thing.", "title": "'The Bachelorette': 9 Things to Expect from Becca Kufrin's 'Badass' Season", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jennifer Drysdale‍", "url": "https://www.etonline.com/the-bachelorette-9-things-to-expect-from-becca-kufrins-badass-season-103089", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/becca_kufrin_148892_1371.jpg?h=c673cd1c&itok=Vi1Hcqzh"}, "description": "Becca Kufrin is ready to do the damn thing.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Becca Kufrin, The Bachelorette", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/videoseries?list=PLQwITQ__CeH29rS78CEYHRsKBMH7GmHaU"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}