{"url": "https://www.hollywoodreporter.com/news/mary-poppins-returns-everything-know-disney-sequel-1154531", "text": "Emily Blunt plays the magical nanny in the film directed by 'Chicago's' Rob Marshall.\n\nFifty-four years after Disney's Mary Poppins bowed on the big screen, the \"practically perfect\" nanny is gliding back into theaters.\n\nDisney first announced plans for a sequel to the live-action/animated classic in 2015, with Rob Marshall (Chicago, Into the Woods) attached to direct. Emily Blunt and Hamilton creator Lin-Manuel Miranda joined the project in February 2016. Over the next few months, the rest of the sequel's star-studded cast took shape — Meryl Streep, Angela Lansbury, Colin Firth and original Mary Poppins star Dick Van Dyke are all set to appear in the film.\n\nMarshall and Blunt screened the first footage from Mary Poppins Returns for a crowd of Disney fans at last year's D23. And the first teaser trailer aired during this year's Oscars. A full trailer dropped Sept. 17, followed by a \"Special Look\" on Oct. 23.\n\nSet 25 years after the original, Mary Poppins Returns follows the Banks family — Michael; his sister, Jane; and his children, Annabel, John and Georgie — as they deal with the sudden death of Michael's wife. Poppins pays a visit to the grieving family and uses her special brand of whimsy to console them while also helping prevent the greedy Fidelity Fiduciary Bank from taking possession of their house.\n\nWith the film's Dec. 19 release just around the corner, here's everything you need to know about the sequel to Disney's 1964 masterpiece:\n\nWHO\n\nEmily Blunt: Plays Mary Poppins, the elegant English nanny who uses magic to teach life lessons to her employers and their children. The actress, who previously worked with director Rob Marshall on 2014's Into the Woods, was the top choice to play Poppins. During the panel for Mary Poppins Returns at D23, Blunt indicated her take on Poppins will look a bit different than Julie Andrews' iconic portrayal. \"I just had to do my version of her,\" she explained. \"We were loyal to the books. I think she's a little more acerbic and vain and weird in the books and we went that direction a little more.\"\n\nLin-Manuel Miranda: Plays Jack, a lamplighter who joins Poppins and the Banks children on their adventures. Miranda's character has been described as a spiritual successor to Bert (Dick Van Dyke), Mary Poppins' companion in the original movie. To avoid replicating Van Dyke's much maligned cockney accent, Miranda worked extensively with a dialect coach on set.\n\nBen Whishaw: Plays Michael Banks, the adult version of the precocious young child Mary Poppins looked after in the first film. Whishaw is no stranger to heartwarming family films, having previously voiced the eponymous marmalade-loving bear in Paddington and Paddington 2.\n\nEmily Mortimer: Plays Jane Banks, Michael's sister. Following in the footsteps of her activist mother, Jane has become the union organizer for SPRUCE, the Society for the Protection of the Rights of the Underpaid Citizens of England.\n\nPixie Davies: Plays Annabel Banks, Michael's daughter. Not much is currently known about Annabel or the other Banks children, except for the fact that the three of them will be tended to by Poppins. Davies previously starred in Miss Peregrine's Home for Peculiar Children and the British TV series Humans.\n\nNathanael Saleh: Plays John Banks, Michael's older son. Saleh appeared on Game of Thrones in 2016.\n\nJoel Dawson: Plays Georgie Banks, Michael's younger son. Mary Poppins Returns is Dawson's screen debut.\n\nColin Firth: Plays William Weatherall Wilkins, president of Fidelity Fiduciary Bank, where Michael's father used to work. Mary Poppins Returns is Firth's fifth film this year, joining The Happy Prince, The Mercy, Mamma Mia! Here We Go Again and Kursk.\n\nDick Van Dyke: Plays Mr. Dawes Jr., the mean-spirited son of the old banker Van Dyke played in the first film (he also played jack-of-all-trades Bert). Age is just a number for the 92-year-old Van Dyke, who filmed a song-and-dance number for his cameo. In an interview with Good Morning America, Blunt called him \"a magical guy,\" adding, \"He's got a zest for life that is just infectious.\"\n\nMeryl Streep: Plays Topsy Turvy, Mary Poppins' eccentric Eastern European cousin. An amalgamation of two characters from Travers' books, Topsy lives in a repair shop that occasionally turns upside down.\n\nAngela Lansbury: Plays The Balloon Lady, a balloon saleswoman whom Poppins and the Banks children meet on an outing. Just as Miranda's Jack is intended to be a spiritual successor to Bert from the original film, Lansbury's character has been described as the sequel's version of the \"Bird Lady.\" Lansbury has had an impressive acting career spanning eight decades, but Disney fans may know her best as the voice of Mrs. Potts in 1991's Beauty and the Beast.\n\nDavid Warner: Plays Admiral Boom, a former naval officer and neighbor to the Banks who fires his cannon every 8 a.m. and 6 p.m. A noted character actor since the 1960s, Warner won an Emmy for his portrayal of Pomponius Falco in the 1981 miniseries Masada. He is also known for his regular appearances in the Star Trek franchise.\n\nJulie Walters: Plays Ellen, Michael's housekeeper. In the original film, Ellen was employed by Michael's parents. Walters was nominated for an Oscar for her performance in 2000's Billy Elliot. She also played Molly Weasley in the Harry Potter film series.\n\nJulie Andrews: The original Mary Poppins' appearance has not been confirmed, but she has given the new nanny her seal of approval. When questioned about Blunt in an interview with Entertainment Tonight, Andrews responded, \"I think she's terrific. And a perfect pick.\"\n\nWHAT\n\n1964's Mary Poppins starred Julie Andrews as the eponymous, charmingly mysterious nanny. When their babysitter abruptly quits, George and Winifred Banks (David Tomlinson and Glynis Johns) hire Poppins to take care of their two children, Michael (Matthew Garber) and Jane (Karen Dotrice). During her tenure with the Banks, Mary and her friend Bert (Dick Van Dyke) take the children on magical excursions that teach them manners and discipline. They also work their charms on the Banks' stern father, teaching him how to lower his guard and enjoy life with his children. At the end of the movie, Poppins says goodbye to the Banks and ascends into the clouds.\n\nTwenty-five years later in the films' chronology (54 years later in real time), Mary Poppins is coming back to 10 Cherry Lane. In Mary Poppins Returns, Poppins (Blunt) arrives to cheer up the Banks family after the sudden loss of Michael's wife. Joined by Jack (Miranda), a lamplighter who used to be Bert's apprentice, she takes the family on a new series of adventures.\n\nLike in the last film, the eponymous nanny will turn the mundane into the magical. Bath time with the Banks children becomes a deep-sea dive, an encounter with the Balloon Lady becomes a whimsical journey through the skies and a broken china bowl becomes the portal to a cartoon world.\n\nThat last bit of magic (dubbed the \"Royal Doulton China\" bowl sequence by the filmmakers) is an homage to the original film's groundbreaking blend of live action and animation. To mimic the look of the original film's live-action/animated sequence, Mary Poppins Returns director Rob Marshall decided to use traditional animation, a method that hasn't been used extensively by Disney in a feature film since 2011's Winnie the Pooh. “Everyone agreed it felt fresh again,\" Marshall told Yahoo Movies. \"When you see them speaking to these animated characters that are drawn that way and you feel that artistry, you feel a sense of nostalgia.\"\n\nIn addition to mixing live action and animation, the original film features a beloved soundtrack, which includes such memorable songs as \"Supercalifragilisticexpialidocious,\" \"A Spoonful of Sugar,\" \"Chim Chim Cher-ee,\" \"Jolly Holiday\" and \"Step in Time.\" Marc Shaiman and Scott Wittman, the songwriting team behind Hairspray, have been dealt the task of writing new songs that live up to those. So far, fans have heard a snippet of the new song \"Can You Imagine That?\" in the Oct. 23 \"Special Look.\"\n\nWHEN\n\nThe film is set in 1935 London, 25 years after the original. Its events will unfold against the backdrop of the Great Depression.\n\nFilming began in February 2017 and wrapped in early June. Because of the film's complex visual effects, postproduction lasted a year.\n\nIt will be released on Dec. 19, 2018, 54 years and four months after the original. This will mark one of the largest gaps between the release of a film and its sequel in history. Other Disney movies that are in that ball park claim include 1940's Fantasia and 1999's Fantasia 2000 at 59 years and 1953's Peter Pan and 2002's Return to Neverland at 49 years.\n\nWHERE\n\nFilming took place at Surrey's famed Shepperton Studios, which has housed the productions of Lawrence of Arabia, Star Wars, Alien, Blade Runner, The Princess Bride, Harry Potter and the Prisoner of Azkaban and Marshall's own Into the Woods. Select scenes were also filmed on location in London.\n\nWHY\n\nP.L. Travers' eight-book Mary Poppins series spawned a multimedia franchise that includes the 1964 theatrical film; a 1983 Russian TV film; a 2006 Broadway musical; a 2010 BBC radio drama; and 2013's Saving Mr. Banks, a making-of biopic starring Emma Thompson as Travers and Tom Hanks as Walt Disney.\n\nOf all the adaptations of Travers' series, the 1964 film version of Mary Poppins is the best known and, arguably, the most beloved. Considered by some critics to be Walt Disney's magnum opus, the film has grossed more than $102 million at the domestic box office. It was nominated for 13 Oscars at the 37th Academy Awards and won five, including best actress for Andrews.\n\nIn 2006, the American Film Institute ranked Disney's Mary Poppins at No. 6 on its list of the greatest movie musicals. Today, it continues to be considered a classic family film.\n\nMarshall says he was drawn to Mary Poppins Returns because of the film's timely message. “When Disney came to us with this, it was right at a point in the world where [producer] John DeLuca and myself were so desperate to do it ... in order to balance out the world in which we live in now,\" Marshall told Yahoo Movies. \"We have spent three years working on this film. To live in a world that has hope and escape and fantasy and truth and reality and emotion and all those other things, feels so important right now.”\n\nTRAILERS", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/09/mary_poppins_returns__official_trailer-screen_shot-h_2018.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/09/mary_poppins_returns__official_trailer-screen_shot-h_2018.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/09/mary_poppins_returns__official_trailer-screen_shot-h_2018.jpg", "keywords": [], "authors": ["Adam Yuster", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/mary-poppins-returns-everything-know-disney-sequel-1154531", "title": "'Mary Poppins Returns': Everything to Know About the Long-Awaited Sequel to the Disney Classic", "meta_data": {"viewport": "width=device-width", "description": "With the Dec. 19 release of 'Mary Poppins Returns' coming up, here's everything you need to know about the Emily Blunt-starring sequel to the 1964 Oscar winner featuring Julie Andrews.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/mary-poppins-returns-everything-know-disney-sequel-1154531", "domain": "https://www.hollywoodreporter.com/", "title": "'Mary Poppins Returns': Everything to Know About the Long-Awaited Sequel to the Disney Classic", "description": "Emily Blunt plays the magical nanny in the film directed by 'Chicago's' Rob Marshall.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/09/mary_poppins_returns__official_trailer-screen_shot-h_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Mary Poppins Returns': Everything to Know About the Long-Awaited Sequel to the Disney Classic", "description": "Emily Blunt plays the magical nanny in the film directed by 'Chicago's' Rob Marshall.", "url": "https://www.hollywoodreporter.com/news/mary-poppins-returns-everything-know-disney-sequel-1154531", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/09/mary_poppins_returns__official_trailer-screen_shot-h_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Mary Poppins Returns': Everything to Know About the Long-Awaited Sequel to the Disney Classic", "sailthru.description": "Emily Blunt plays the magical nanny in the film directed by 'Chicago's' Rob Marshall.", "sailthru.author": "Adam Yuster", "sailthru.vertical": "Movies", "sailthru.date": "2018-10-31 10:30:42", "sailthru.tags": "Movies,Angela Lansbury,Colin Firth,Dick Van Dyke,Emily Blunt,Lin-Manuel Miranda,Meryl Streep,Rob Marshall,Mary Poppins,Mary Poppins Returns"}, "movies": [], "publish_date": 1540953042.0, "source": "https://www.hollywoodreporter.com", "summary": ""}