{"url": "https://www.elle.com/culture/music/a13146489/taylor-swifts-call-it-what-you-want-lyrics-kim-kardashian-kanye-west-joe-alwyn-references/", "text": "Taylor Swift released \"Call It What You Want\" at midnight tonight, her fourth Reputation single and her latest love song from the album. She also seemed to share footage of herself working on it that her current boyfriend Joe Alwyn possibly could've taken:\n\nAnd, at first glance, the lyrics seem to say quite a bit about her relationship with her current boyfriend Alwyn and her recovery after 2016's Kimye Snapchat and Calvin Harris/Hiddleswift blowouts.\n\nSwift has the sole writer credit on the track, so the single is likely at the very least inspired by her real-life experiences. And every word is packed with meaning. Here, the lyrics, with Joe Alwyn and Kimye references annotated, via Genius:\n\nMy castle crumbled overnight\n\nSwift's 1989 final track, \"New Romantics,\" first referenced this metaphoric castle with the lyric, \"'Cause, baby, I could build a castle/Out of all the bricks they threw at me/And every day is like a battle/But every night with us is like a dream.\"\n\nI brought a knife to a gunfight\n\nThe gunfight is likely a reference to the Snapchat receipts Kim Kardashian posted of Swift and Kanye West discussing the lyric about her in \"Famous\". Swift posted a Note after on her Instagram, where she wrote: \"Where is the video of Kanye telling me he was going to call me 'that bitch' in his song? It doesn't exist because it never happened. You don't get to control someone's emotional response to being called 'that bitch' in front of the entire world. Of course I wanted to like the song. I wanted to believe Kanye when he told me that I would love the song. I wanted us to have a friendly relationship. He promised to play the song for me, but he never did. While I wanted to be supportive of Kanye on the phone call, you cannot 'approve' a song you haven't heard. Being falsely painted as a liar when I was never given the full story or played any part of the song is character assassination. I would very much like to be excluded from this narrative, one that I have never asked to be a part of, since 2009.\" That was not enough to stop criticism of her because of it.\n\n\n\nThey took the crown but it's alright\n\nAll the liars are calling me one\n\nSwift takes a pointed jab at Kimye here (as she wrote in her note after the Snapchats, \"Being falsely painted as a liar when I was never given the full story or played any part of the song is character assassination.\")\n\n\n\nNobody's heard from me for months\n\nSwift stayed out of the spotlight for much of 2017. Outlets ran pieces speculating where Taylor Swift went.\n\n\n\nI'm doing better than I ever was\n\nChorus:\n\nCause my baby's fit like a daydream\n\nWalking with his head down\n\nI'm the one he's walking to\n\nSo call it what you want yeah, call it what you want to\n\nSwift and her current boyfriend Joe Alwyn were first filmed together in October last year. News of their relationship, which they kept secret for months, wouldn't break until May 2017. Swift suggests here that Alwyn was her refuge during the fall, and she spent her time off recovering and falling in love.\n\n\n\nMy baby's fly like a jet stream\n\nHigh above the whole scene\n\nAlwyn is an up and coming British actor, while Swift's other boyfriends have been more famous and in the Hollywood/A-list world (Tom Hiddleston, Joe Jonas, Calvin Harris, and Harry Styles particularly.)\n\n\n\nLoves me like I'm brand new\n\nSo call it what you want yeah, call it what you want to\n\nVerse 2:\n\nAll my flowers grew back as thorns\n\nWindows boarded up after the storm\n\nHe built a fire just to keep me warm\n\nAll the drama queens taking swings\n\nDrama queens here could be a reference to Kim Kardashian and her other rival, Katy Perry, who talked extensively about Swift and their feud during her Witness press tour.\n\n\n\nAll the jokers dressing up as kings\n\nJokers could be a reference to Kanye West but also Calvin Harris, one of the world's highest paid DJs, and her other ex who caused quite a bit of drama for her in 2016.\n\n\n\nThey fade to nothing when I look at him\n\nAnd I know I make the same mistakes every time\n\nBridges burn, I never learn\n\nSwift is referring her to her dating track record and perhaps her most recent failed relationships with Calvin Harris and Tom Hiddleston (and the songs she wrote about them, like her other exes).\n\n\n\nAt least I did one thing right, I did one thing right\n\nI'm laughing with my lover\n\nMaking forts under covers\n\nTrust him like a brother\n\nSwift and her own real brother Austin Swift are very close.\n\n\n\nWith Austin at a 2014 Golden Globes After Party Getty Images\n\nYeah, you know I did one thing right\n\nStarry eyes sparking up my darkest night\n\nChorus:\n\nCause my baby's fit like a daydream\n\nWalking with his head down\n\nI'm the one he's walking to\n\nSo call it what you want yeah, call it what you want to\n\nMy baby's fly like a jet stream\n\nHigh above the whole scene\n\nLoves me like I'm brand new\n\nSo call it what you want yeah, call it what you want to\n\nBridge:\n\nI want to wear his initial on a chain around my neck\n\nChain round my neck\n\nNot because he owns me\n\nBut 'cause he really knows me\n\nFans on Genius point out that Swift has been photographed wearing a silver chain in her Reputation promo photo (and in the personal footage Swift shared with the release of \"Call It What You Want\"), one they think Alwyn gave her.\n\nNote the silver necklace in all these photos. music.directv.com Twitter\n\nSwift previously wore a paper airplane necklace when she was dating Harry Styles that inspired song lyrics before, so there's precedent.\n\nWhich is more than they can say\n\nI recall late November\n\nHolding my breath, slowly I said \"you don't need to save me\n\nBut would you run away with me?\"\n\nYes\n\nLate November is Swift's hint this is when they first seriously got together. \"Would you run away with me?\" could be a reference to their time spent undercover and privately in England when they first started dating.\n\n\n\nChorus:\n\nMy baby's fit like a daydream\n\nWalking with his head down\n\nI'm the one he's walking to\n\nSo call it what you want yeah, call it what you want to\n\nMy baby's fly like a jet stream\n\nHigh above the whole scene\n\nLoves me like I'm brand new\n\nSo call it what you want yeah, call it what you want to\n\nCall it what you want, call it what you want\n\nCall it what you want, call it what you want\n\nCall it what you want, call it what you want\n\nCall it what you want, call it what you want\n\nCall it what you want yeah, call it what you want to", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-joe-1504134628.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-tom-calvin-1509568962.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-social-comp-1509113466.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/music/a13146489/taylor-swifts-call-it-what-you-want-lyrics-kim-kardashian-kanye-west-joe-alwyn-references/", "title": "All the Kimye and Joe Alwyn References in Taylor Swift's \"Call It What You Want\" Lyrics", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "All the Kimye and Joe Alwyn References in Taylor Swift's \"Call It What You Want\" Lyrics", "description": "So this is what happened during her time away from the spotlight...", "url": "https://www.elle.com/culture/music/a13146489/taylor-swifts-call-it-what-you-want-lyrics-kim-kardashian-kanye-west-joe-alwyn-references/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-03-19 05:04:43", "published_time": "2017-11-03 05:15:09", "section": "Music 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Taylor Swift's \"Call It What You Want\" Lyrics - Joe Alwyn and Kim Kardashian and Kanye West References", "description": "​Taylor Swift released \"Call It What You Want\" at midnight tonight, her fourth ​Reputation ​single and her latest love song from the album. And, at first glance, the lyrics seem to say quite a bit about her relationship with one of her exes. Here, the lyrics to analyze.", "keywords": "taylor swift, call it what you want, reputation, call it want you want lyrics, joe alwyn, tom hiddleston, calvin harris, lyrics about exes, kim kardashian, kanye west", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=0.501xw:1.00xh;0.0947xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,music,joe alwyn,tom hiddleston,Calvin Harris,taylor swift", "sailthru.date": "2017-11-03T05:15:09Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-kimye-joe-1509683298.jpg?crop=0.501xw:1.00xh;0.0947xw,0", "sailthru.socialtitle": "All the Kimye and Joe Alwyn References in Taylor Swift's \"Call It What You Want\" Lyrics", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1509657309.0, "source": "https://www.elle.com", "summary": ""}