{"url": "https://www.complex.com/pigeons-and-planes/2018/04/kanye-west-writing-book-philosophy-break-the-simulation", "text": "Kanye West has been very quiet over the last year and a half, since his strange November 2016 on-stage outburst in Sacramento. Today, though, he joined The Hollywood Reporter to interview designer Axel Vervoodt. During the conversation, Kanye revealed that we might be hearing more of his thoughts on the workings of the world soon: He's writing a book about philosophy called Break the Simulation.\n\n\"I've got this new concept that I've been diggin' into,\" he explained. \"I'm writing a philosophy book right now called Break the Simulation. And I've got this philosophy—or let's say it's just a concept because sometimes philosophy sounds too heavy-handed. I've got a concept about photographs, and I'm on the fence about photographs—about human beings being obsessed with photographs—because it takes you out of the now and transports you into the past or transports you into the future. It can be used to document, but a lot of times it overtakes [people]. People dwell too much in the memories. People always wanna hear the history of something, which is important, but I think it there's too much of an importance put on history.\"\n\nEarlier in the interview, Kanye shared his philosophical thoughts on time.\n\n\"I do believe that all time is now,\" he said. \"The future is here now, the past is here now. There's certain people that you meet and you say, 'Oh, you're from the future.; You feel this in their spirit, people who are just staying in a time where the time doesn't celebrate who they are, and there's other people right now who the time does celebrate, and those people end up more famous or notorious. But I'm big on connecting with timeless energy, with people and musicians that I'm around.\"\n\nHe explained that his desire to avoid the confines of time influenced his short film: \"When working on 'Runaway' [video] with [artist] Vanessa Beecroft, it was very important to not define the time, to not give any labels to the environments that we were in.\"\n\nLike most Kanye interviews, this one is full of gems. He also spoke on the current state of the news... and Isle of Dogs.\n\n\"I do think that there's not a balance in the news. Like you said, we don't want to be influenced, just informed. That's a big term that people use right now: influencers. I don't want anyone to influence. … I don't usually watch normal TV. I liked watching the Olympics. (Laughs.) I do try to watch documentaries. And there's a Wes Anderson movie [Isle of Dogs] that's out right now that I'm definitely going to try to catch.\"\n\nTouching on his current goals in life, he added, \"At Adidas, I have Yeezy, but it's a namesake brand. It's my nickname. We do these sneakers that sell out and we get, 'Oh, this is the number one brand on Women's Wear Daily.\" And I don't wish to be number one anymore, I wish to be water. I wish to be closer to UNICEF or something where I can take the information that I have and help as many people as possible, not to just shove it into a brand.\"\n\nYou can read the full interview here.", "images": ["https://images.complex.com/complex/images/c_fill,dpr_auto,f_auto,q_90,w_1400/fl_lossy,pg_1/c4tdtzhohdlvvvlbjyr2/kanye-west-getty-michael-tran", "http://b.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://images.complex.com/complex/image/upload/t_author_pic/eric-skelton-thumb-2_ampbfk.jpg", "https://images.complex.com/complex/images/c_crop,h_563,w_1000,x_0,y_2/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/c4tdtzhohdlvvvlbjyr2/kanye-west-getty-michael-tran"], "top_img": "https://images.complex.com/complex/images/c_crop,h_563,w_1000,x_0,y_2/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/c4tdtzhohdlvvvlbjyr2/kanye-west-getty-michael-tran", "keywords": [], "authors": ["Eric Skelton"], "canonical_link": "https://www.complex.com/pigeons-and-planes/2018/04/kanye-west-writing-book-philosophy-break-the-simulation", "title": "Kanye West Is Writing a Book About Philosophy Called 'Break the Simulation'", "meta_data": {"google-site-verification": "ICK39wBGvCQQMHpEUykVHWF8Ox_0MME-_qxe6ixFUik", "theme-color": "#000000", "description": "\"I've got a concept about photographs.\"", "og": {"type": "website", "title": "Kanye West Is Writing a Book About Philosophy Called 'Break the Simulation'", "description": "\"I've got a concept about photographs.\"", "url": "https://www.complex.com/pigeons-and-planes/2018/04/kanye-west-writing-book-philosophy-break-the-simulation", "image": "https://images.complex.com/complex/images/c_crop,h_563,w_1000,x_0,y_2/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/c4tdtzhohdlvvvlbjyr2/kanye-west-getty-michael-tran", "site_name": "Complex"}, "fb": {"app_id": 310521533114641, "pages": 117696581735620}, "twitter": {"card": "summary_large_image", "title": "Kanye West Is Writing a Book About Philosophy Called 'Break the Simulation'", "description": "\"I've got a concept about photographs.\"", "url": "https://www.complex.com/pigeons-and-planes/2018/04/kanye-west-writing-book-philosophy-break-the-simulation", "image": "https://images.complex.com/complex/images/c_crop,h_563,w_1000,x_0,y_2/c_fill,f_auto,g_center,h_300,q_auto,w_600/fl_lossy,pg_1/c4tdtzhohdlvvvlbjyr2/kanye-west-getty-michael-tran", "site": {"id": 13049362}}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}