{"url": "www.inquisitr.com/3116231/angelina-jolie-fragile-at-79-lbs-battles-brad-pitt-over-career-co-star-fears-same-fate-as-jennifer-aniston/", "text": "Angelina Jolie and Brad Pitt relationship problems have reportedly existed for months, with signs ranging from her rapid weight loss to a fragile 79 pounds to increasing rumors of his flirtations with co-stars on his movie sets. And now, amid a new report that Jolie and Pitt were arguing over whose career should take priority, comes the news that Brad has exited from Top Gear, according to Design & Trend‘s sources.\n\nPitt had initially been viewed as the ideal person for show’s return. But when Brad abruptly changed his mind, Top Gear was left in shambles. As to why the famous actor would leave a show in the lurch?\n\nAre Brad Pitt and Angelina Jolie headed for a divorce? [Photo by Jonathan Leibson/Getty Images for Audi]\n\nBrad, 52, and Angelina, 40, are battling over who should care for their children, with a source explaining that the two had agreed to take turns minding the kids and pursuing career ambitions.\n\n“They’re at war over who’s looking after the kids since that agreement got blown out the window with her desire to turn her directing career into a success after several failures. This is tearing them apart, but Brad’s got no choice.”\n\nPitt is pointing to his efforts to help Angelina in her ambitions to become a director, but he feels that he has gone above and beyond by participating in her “flop,” By the Sea. In addition, Design & Trend cites a friend of Jolie’s who describes the problems she’s had in her life and how they affect her now.\n\n“Angie has some serious dark demons that have never entirely let go and it is still affecting her life and marriage,” revealed one friend. “Her wild lifestyle when she was younger and her intense surgeries to avoid getting breast and ovarian cancer have taken a toll on her as a person and a life partner.”\n\nAngelina Jolie looks frail at a reported 79 pounds. [Photo by Alberto E. Rodriguez/Getty Images]\n\nWith her past issues catching up with her, Angelina tends to isolate herself from both her husband and her children, claims that pal. And although Brad first liked the “dark side” of Jolie, he increasingly feels that she’s pushing him away.\n\n“It can be really hard on him. He feels he has been more than patient with Angie, but his confidence in their happiness is wearing thin,” added the friend.\n\nAdding to the problems in their marriage, Angelina is jealous that Pitt spends so much time with actress Marion Cotillard, according to an insider cited by Hollywood Life, which describes Jolie as “wasting away” over her husband’s affair, weighing only 79 pounds.\n\nAngelina Jolie serves as special envoy of the United Nations High Commissioner for Refugees. [Photo by Milos Bicanski/Getty Images]\n\nAlthough Marion is his co-star and their time together is on the movie set, Angelina is still furious, pushing Brad to consider divorce. Although no romantic affairs have taken place, Pitt has been gushing about Marion, explained the insider.\n\n“The resentment has been eating away at Angelina. She’s prone to think that since she was once Brad’s co-star and seduced him away from his wife, the same will happen to her.”\n\nThat reference to how Jolie “seduced” Pitt away from his spouse refers to Jennifer Aniston. But the problem here is that rather than having Marion seduce Brad away from Angelina, it’s Jolie’s own jealousy and refusal to listen to him that is pushing Pitt to file for divorce, claims the insider.\n\n“He will be the one to file. He’s fed up with her controlling ways, her obstinateness when it comes to listening to him about her health issues and how she needs to slow down and now her outright jealousy when it comes to other women,” added the source.\n\nAs to parallels to Pitt’s marriage and divorce from Jennifer Aniston, that drama began in 2004 when Brad started working on the 2005 movie Mr. and Mrs. Smith and became intimately acquainted with the woman who would become his girlfriend and then his wife, Angelina, as the Inquisitr reported.\n\nPitt and Jolie reportedly began their relationship during that film, with Brad subsequently confessing that he “fell in love” with Angelina on the movie set. He divorced Aniston by fall 2005, and Jolie announced her pregnancy with his child in January 2006.\n\nWill Angelina suffer the same fate as Jennifer? Post your thoughts below.\n\n[Photo by Alberto E. Rodriguez/Getty Images]", "images": ["https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Angelina-Jolie-.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Jolie-Surrounded.jpg", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Brad-Pitt-Angelina-jolie.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/79-Pounds-Angelina.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/3116231/angelina-jolie-fragile-at-79-lbs-battles-brad-pitt-over-career-co-star-fears-same-fate-as-jennifer-aniston/", "title": "Angelina Jolie, Fragile At 79 Lbs, Battles Brad Pitt Over Career & Co-Star: Fears Same Fate As Jennifer Aniston?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}