{"url": "https://www.ign.com/articles/2017/10/18/the-flash", "text": "As frustrating as The Flash's Season 4 premiere was in its unwillingness to follow up on the big Season 3 cliffhanger, there's a lot to be said for the desire to move the series in a different, more lighthearted direction. The Flash needs to recapture the whimsical sense of humor that currently only exists on Legends of Tomorrow. Judging from \"Mixed Signals,\" the writers are well on their way towards establishing a lighter, happier status quo for the series. The question now is whether they've sacrificed too much else in the process.\n\nThe Flash: \"Mixed Signals\" Photos 15 IMAGES\n\nLoading\n\nSeason 3 made a number of storytelling mistakes, but at the end of the day, its biggest problem was its habit of becoming mired in darkness and pathos. Caitlin's downfall, Barry's Flashpoint-related guilt, the fact that Draco Malfoy moved to Central City - all of that contributed to a needlessly grim status quo that failed to capture the lovable team Flash dynamic of the first two seasons.Thankfully, that dynamic is quickly reestablishing itself now. There's plenty of playful team banter to go around. Cisco in particular seems much more like his happy-go-lucky self, while Barry is about as peaceful and unburdened as we've ever seen him on the show. It's a nice change to watch Barry have fun being a superhero again, rather than being miserable because he messed with the timeline and screwed over someone in his life.That sense of fun extended in pretty much every direction. There was a lot of emphasis on exploring the wacky, largely useless functions added to Barry's new suit (complete with Cisco's patented, soothing narration). That, in turn, fed into Barry's disastrous confrontation with Kilg%re (Doctor Who's Dominic Burgess). The writers face some interesting challenges with this shift to more tech-based villains in Season 4. How do you still challenge the Fastest Man Alive on a physical level? Barry's suit becoming his own worst enemy was a fun twist, but obviously that's not going to cut it every week.Speaking of the suit, I'm a bit mixed on this season's redesign. It's definitely sleeker and somewhat more comic-accurate while still retaining the familiar, functional quality of most Arrowverse costumes. However, it doesn't appear as though it moves and flexes as well as the old costume. Grant Gustin seemed visibly uncomfortable in the scene where everyone was gathered around Cisco's workstation.Adding to the general sense of fun this week was the continued emphasis on exploring the practical applications of Barry's turbo-charged powers. Between disassembling a speeding car and catching the shrapnel from an exploding grenade, Barry is clearly the fastest he's ever been. More than being goofy, fun little superhero moments, those scenes also offer some sense of how the Thinker will challenge Barry and Wally this season. There's a certain irony in the Flash going up against an enemy who's all but immobile himself. But if the Thinker can constantly keep Barry off guard by exploiting his need to protect innocent bystanders, then he can still be a very challenging villain.The couples therapy subplot made for a decent backdrop to the action this week. I could have done with a few less stereotypical romantic comedy gender role tropes - the boyfriend who doesn't believe in therapy, the girlfriend who claims she's fine when she's really angry, etc. Still, the Barry/Iris scenes were entertaining, and they allowed Iris to voice some real, understandable frustration about being left to pick up the pieces after Barry's disappearing act in Season 3. Likewise, it's nice to see the Cisco/Gypsy romance moving forward.Here's my big concern about the state of the series right now - it all feels very low stakes and small in scope. Not that the writers necessarily need to rush right into establishing the Flash's next great rivalry, but it would be nice to see something deeper driving the show forward. There's little sense of danger this early into the Thinker conflict. And with the final scene establishing DeVoe's current motives, it appears as though we're in for a number of \"villain of the week\" episodes before that conflict truly begins to heat up. As nice as this lighter, happier Flash is, that only counts for so much without a compelling, serialized narrative. I worry that the writers have taken the Season 3 criticisms too deeply to heart and are now shifting the series too far in the other direction.At the very least, it does seem like the writers could have done more with the couples therapy element this week. One thing this series has rarely focused on is the challenge speedsters like Barry and Wally face in trying to interact with a world that moves in slow motion to them. That could have been utilized to great effect in terms of highlighting Barry's boredom and frustration at being dragged into therapy. That in turn could inspire new type of fiction between Barry and Iris. That's just one idea, but the point is that there's more potential to the couple therapy subplot, should the writers choose to seize on it. The idea that Barry and Iris are magically healed of all dysfunction after two short sessions is ludicrous.The other thing is that this episode did nothing to assuage my concerns about Wally's diminishing importance . What purpose does Wally actually serve right now besides making a few jokes and being the punching bag for the villain of the moment? Wally did nothing but stand around and get knocked out during the showdown with Kilg%re. The character deserves better than this. As others have pointed out, maybe his brief cameo on last week's Legends of Tomorrow is a sign that he's better off migrating to a different DC series. Heck, why not the upcoming Titans series? They could use a Kid Flash.", "images": ["https://cdn.ziffstatic.com/adchoices/adchoices.png", "https://assets1.ignimgs.com/2020/03/10/call-of-duty-warzone-combat-pack-playstation-exclusive-1583873567273.png?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo008-1507565044654.jpg?width=158&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo003-1507565044650.jpg?width=158&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo004-1507565044651.jpg?width=158&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2019/04/05/ssds-1280-1554486033378.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://oyster.ignimgs.com/social/avatars/users2/68/779169-1348098486.jpg?fit=crop&width=39&height=39", "https://assets1.ignimgs.com/2017/10/17/flash-4-1600-1508284042505.jpg?width=375&crop=16%3A9&quality=20&dpr=0.05", "https://oyster.ignimgs.com/social/avatars/users2/68/779169-1348098486.jpg?width=76&fit=crop&height=76&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2017/10/17/flash-4-1280-1508284059491.jpg?width=1280", "https://assets1.ignimgs.com/2020/04/17/turnipstalkmarket-blogroll-1587157676076.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets-prd.ignimgs.com/2020/02/12/acting-medal-final-1581533050374.svg?fit=crop&width=76&height=76", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo001-1507565044646.jpg?width=888&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2020/04/17/best-materia-blog-1587117451359.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets-prd.ignimgs.com/2020/02/12/story-medal-final-1581533052227.svg?fit=crop&width=76&height=76", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo002-1507565044649.jpg?width=158&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2020/04/15/ozark-blogroll-1586976352606.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2020/04/06/9gamesthatmadecomebacks-blogroll-1586191609339.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2020/04/17/stalks2-1587167026345.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05", "https://assets-prd.ignimgs.com/2020/02/13/visuals-medal-final-1-1581629746051.svg?fit=crop&width=76&height=76", "https://assets1.ignimgs.com/2017/10/09/the-flash-mixed-signals-photo005-1507565044651.jpg?width=158&crop=16%3A9&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2016/08/29/the-flashjpg-2c50b8.jpg?width=188&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2017/10/17/flash-4-1600-1508284042505.jpg?width=1200&quality=20&dpr=0.05", "https://assets1.ignimgs.com/2020/04/15/doodle-shgamecube-1586981867028.png", "https://assets1.ignimgs.com/2020/04/16/tifa-1587081220539.jpg?width=300&crop=16%3A9&quality=20&dpr=0.05"], "top_img": "https://assets1.ignimgs.com/2017/10/17/flash-4-1280-1508284059491.jpg?width=1280", "keywords": [], "authors": [], "canonical_link": "https://www.ign.com/articles/2017/10/18/the-flash", "title": "The Flash: \"Mixed Signals\" Review", "meta_data": {"copyright": "IGN Entertainment, Inc.", "referrer": "always", "cpid": "5a8bca0b2d985966302b4671c3a001ee", "og": {"site_name": "IGN", "url": "https://www.ign.com/articles/2017/10/18/the-flash", "title": "The Flash: \"Mixed Signals\" Review - IGN", "type": "video.other", "image": "https://assets1.ignimgs.com/2017/10/17/flash-4-1280-1508284059491.jpg?width=1280", "description": "The Flash continues to shift in a more lighthearted direction as Barry and Iris attend couples therapy."}, "fb": {"app_id": 115982828429116, "pages": 59685491632}, "viewport": "width=device-width", "description": "The Flash continues to shift in a more lighthearted direction as Barry and Iris attend couples therapy.", "robots": "noodp, noydir", "thumbnail": "https://assets1.ignimgs.com/2017/10/17/flash-4-1280-1508284059491.jpg?width=1280", "al": {"ios": {"url": "ign://ign.com/articles/2017/10/18/the-flash", "app_store_id": 284819997, "app_name": "IGN: Video Game News, Reviews, Guides"}, "android": {"url": "ign://www.ign.com/articles/2017/10/18/the-flash", "app_name": "IGN", "package": "com.mobile.ign"}, "web": {"url": "https://www.ign.com/articles/2017/10/18/the-flash"}}, "twitter": {"app": {"name": {"iphone": "IGN: Video Game News, Reviews, Guides", "ipad": "IGN: Video Game News, Reviews, Guides", "googleplay": "IGN"}, "id": {"iphone": 284819997, "ipad": 284819997, "googleplay": "com.mobile.ign"}, "url": {"iphone": "ign://www.ign.com/articles/2017/10/18/the-flash", "ipad": "ign://www.ign.com/articles/2017/10/18/the-flash", "googleplay": "ign://www.ign.com/articles/2017/10/18/the-flash"}}, "card": "summary", "site": "@IGN", "imageUrl": "https://assets1.ignimgs.com/2017/10/17/flash-4-1280-1508284059491.jpg?width=1280"}, "next-head-count": 39}, "movies": [], "publish_date": 1508256000.0, "source": "https://www.ign.com", "summary": ""}