{"url": "www.thedailybeast.com/is-taylor-swift-kicking-kanye-and-kim-while-theyre-down", "text": "Taylor Swift, a woman who once allegedly used a huge suitcase as a form of paparazzi-dodging transportation, is nothing if not cunning. The once saccharine pop star has slowly evolved into the calculated queen of the long game. Her machinations range from admirably extra (buying a house next door to the Kennedy compound in a thinly veiled attempt to marry a Kennedy) to just too much (the “I heart T.S.” tank top). And that’s just her personal life—when it comes to professional supremacy, Taylor Swift outsmarts every one of her competitors. She has more hits, receives more press (good and bad), and will threaten to sue the shit out of any Etsy seller who gets in her way. Most importantly, Taylor Alison Swift has way more UPS trucks with her face on them than any of her peers.\n\nWhile the foundation of Swift’s success is her ability to write good songs that speak to the middle-school loser in all of us, her fame feeds on a regular diet of romantic gossip and celebrity feuds. If Taylor Swift isn’t in the news because a B-lister may or may not be planning to propose to her, she’s making tabloid headlines for her prime beefs. Following a Swift feud all the way from its inception, it becomes abundantly clear that you do not want to get on this woman’s bad side, because she is smarter and shows far more restraint than the average human being. Also, she might run you over with a UPS truck.\n\nAs an example, let’s look at Taylor Swift vs. Katy Perry. When this feud first flared up in 2014, it seemed like a perfect match-up between two major pop stars. In a Rolling Stone interview, Swift revealed the circumstances behind her single “Bad Blood,” referencing an unnamed female peer. “For years, I was never sure if we were friends or not,” Swift said. “She would come up to me at awards shows and say something and walk away and I would think, ‘Are we friends, or did she just give me the harshest insult of my life?’” Eventually, it was confirmed that Perry hired some of Swift’s backup dancers—or as Swift put it, she “basically tried to sabotage an entire arena tour.” In keeping with the PG nature of this beef, which felt more like an argument staged through AIM away messages than a public showdown between two adults, Perry responded with a Mean Girls reference: “Watch out for the Regina George in sheep’s clothing.”\n\nIn a move that basically made Perry’s point for her, Swift assembled her squad of models to star alongside her in the “Bad Blood” music video, literally ganging up on Katy Perry. Since “Bad Blood” is a banger, people seemed to overlook the fact that the mean-spirited video was completely at odds with the girl power feminism that Swift and her girl squad allegedly stood for. Katy Perry tried to counter-attack, but her attempts paled in comparison. “Swish Swish,” a much-hyped Swift diss track featuring Nicki Minaj, was corny and boring. The video, in which Perry attempted humor and basketball and failed at both, was just further disappointment. Somehow, the turban-wearing, therapy session-live-streaming queen of doing too much had produced a thoroughly tepid clap back.\n\nHaving failed to elect Hillary Clinton or dethrone Taylor Swift, Perry has seemingly retreated, emerging every so often to kiss an American Idol contestant without their consent or debut a new set of 6-foot-tall Versace wings. And so it was hardly a surprise when a defeated Perry was revealed to have reached out to Taylor Swift with a literal olive branch on Tuesday, effectively ending their years-long feud.\n\nIt’s worth mentioning that in a 2017 interview, Perry talked about the Swift situation with James Corden, insisting, “I tried to talk to her about it and she wouldn’t speak to me. She started it, and it’s time for her to finish it.” So the fact that Perry ended up initiating the truce is quite a coup for Swift; no wonder she bragged about the ceasefire on her social media.\n\nIn a 2017 meditation on Swift’s single “Look What You Made Me Do,” Vulture’s Mark Harris called it a “tour de force of deflective petulance.” He continued, “It’s essentially a catalogue of every public feud she’s had that, without naming them, manages to extend, mock, and, most important, commodify them.” Swift, who’s just as horny for profit as she is for Kennedys, will suck any feud dry. Whether or not she started it, she will get the most out of it—attention, sympathy, or, preferably, a hit single. Anyone who tries to argue that Swift is simply reacting in real time, without an endgame or artifice, needs to re-examine the particulars of her never-ending, infamous feud with Kanye West. While Swift did not initiate the drama, she did play into it—until she got burned, at which point she hilariously requested to be “excluded from this narrative, one that I have never asked to be a part of, since 2009.”\n\n“ Swift, who got her friends to dress up in pleather and publicly come for Katy Perry, is about as convincing an anti-bullying advocate as Melania Trump. ”\n\nWhile Swift did briefly disengage, trading her boyfriend for a slightly more anonymous boyfriend and hiding out in her apartment and/or luggage for a bit, she eventually re-emerged only to take more shots at Kanye West. Reputation is not the work of someone who wants to be excluded from a narrative, but rather that of someone who’s been told, time and time again, that this victim narrative is unflattering, counter-factual, and potentially dangerous, but just doesn’t give a shit. For Swift, playing the victim is familiar and comforting, like winged eyeliner and red lips or curling up in the fetal position inside of a giant suitcase. In “Look What You Made Me Do,” Swift isn’t subtle about calling Kanye out on his “little games” and “tilted stage.” On “This Is Why We Can’t Have Nice Things,” she adds, “It was so nice being friends again / There I was, giving you a second chance / But then you stabbed my back while shaking my hand / And therein lies the issue / Friends don’t try to trick you/ Get you on the phone and mind-twist you.”\n\nConveniently for Swift, Kanye West’s likability is at an all-time low right now—which makes it a lot easier for her to twist the narrative and cast the rapper as her aggressor/bully. With Kim Kardashian busy dealing with West’s sharp turn into Trump country, it’s unlikely that this manipulation will backfire on Swift like it did last time.\n\nSwift has wasted no time taking advantage of these unique circumstances. During the opening night of her Reputation tour on Tuesday, Taylor was joined onstage by a bunch of enormous snake props—her reclamation of the emoji that Kardashian West fans used to flood her social media. She explained her unusual set to fans, saying, “A couple of years ago, someone called me a snake on social media and it caught on. Then a lot of people were calling me a lot of things on social media and I went through some really low times for a while because of it. I went through some times when I didn’t know if I was going to get to do this anymore.\n\n“I guess this means I wanted to send a message to you guys,” Swift continued, “that if someone uses name calling to bully you on social media, and even if a lot of people jump on board with it, that doesn’t have to defeat you. It can strengthen you instead.”\n\nSwift, who got her friends to dress up in pleather and publicly come for Katy Perry, is about as convincing an anti-bullying advocate as Melania Trump. In a better, more just world, Kanye’s valid points about how he was unfairly punished and demonized in the wake of Swift-gate wouldn’t be drowned out by his Candace Owens-approved soundbites, and no one would buy this social media victim bullshit. And in a more interesting world, Swift would pull out one of her rare unabashedly petty moves, like when she released her entire back catalogue on Spotify to coincide with Katy Perry’s album release. She could even stick it to Kanye by finally announcing who she voted for. Unfortunately, Swift is too smart to be so blatant. This feud won’t end with a bang or a bold outmaneuvering. It will peter out, slowly, unspectacularly, when Taylor Swift decides that she has nothing left to gain.", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1525899436/180509-zimmerman-katy-perry-taylor-swift-hero-1_tyum67", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1525899436/180509-zimmerman-katy-perry-taylor-swift-hero-1_tyum67", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1525899436/180509-zimmerman-katy-perry-taylor-swift-hero-1_tyum67", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/is-taylor-swift-kicking-kanye-and-kim-while-theyre-down", "title": "Is Taylor Swift Kicking Kanye and Kim While They’re Down?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Is Taylor Swift Kicking Kanye and Kim While They’re Down?", "keywords": "Taylor Swift, Kim Kardashian West, Katy Perry, Kanye West", "og": {"title": "Is Taylor Swift Kicking Kanye and Kim While They’re Down?", "description": "While Katy Perry is finally off the hook, Swift doubled down on her feud with Kanye West and Kim Kardashian, just as the rapper’s MAGA mania has soured him in the public eye.", "url": "https://www.thedailybeast.com/is-taylor-swift-kicking-kanye-and-kim-while-theyre-down", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1525899436/180509-zimmerman-katy-perry-taylor-swift-hero-1_tyum67"}, "description": "While Katy Perry is finally off the hook, Swift doubled down on her feud with Kanye West and Kim Kardashian, just as the rapper’s MAGA mania has soured him in the public eye.", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2018-05-09T21:35:58.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1525899436/180509-zimmerman-katy-perry-taylor-swift-hero-1_tyum67"}, "sailthru.date": "2018-05-09T21:35:58.000Z", "sailthru.expire_date": "2018-05-23T21:35:58.000Z", "publicationDate": 201805092135, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/is-taylor-swift-kicking-kanye-and-kim-while-theyre-down\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"VILLAINOUS\"},\"post_id\":\"is-taylor-swift-kicking-kanye-and-kim-while-theyre-down\",\"pub_date\":\"2018-05-09T21:35:58+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Taylor Swift\",\"Kim Kardashian West\",\"Katy Perry\",\"Kanye West\",\"typeArticle\"],\"title\":\"Is Taylor Swift Kicking Kanye and Kim While They’re Down?\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1525901758.0, "source": "http://www.thedailybeast.com", "summary": ""}