{"url": "https://www.theguardian.com/culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america", "text": "Late-night comedy wasn’t always a place that digested the news the way CNN or MSNBC might, but Donald Trump has changed that. Gone are the days when late-night was a place for lite fare, its humor largely detached from the realities of current events. Even in the Nixon era, perhaps the closest analogue to the daily chaos and impropriety of Donald Trump’s presidency, late-night hosts were careful not to push their personal politics. “In the monologue, Johnny will attack malfeasance, illiberal behavior, constitutional abuses,” Kenneth Tynan once wrote of Mr Carson, who hosted The Tonight Show from 1962 to 1992. “But then compassion sets in. He was the first person to stop doing anti-Nixon jokes.”\n\n\n\nJimmy Fallon on his Trump interview: 'I didn't do it to humanize him' Read more\n\nNow, another host in The Tonight Show lineage, Jimmy Fallon, is in a similar position, with the tables turned. As the host sticks to fluff and mostly apolitical humor, his ratings have nosedived in the face of his perceived neutrality. New Yorker critic Emily Nussbaum described Fallon as an enthusiast, “which sounds good, until you see him spray the same gush on everything”. At a time when his peers are earning points for smart rebukes of the Trump administration, Fallon’s self-effacing anecdotes and best-friend schtick often feel like an undercooked hors d’oeuvre preceding Seth Meyers’ acerbic political main course, which airs after him.\n\nThe ratings have proved that viewers are deserting The Tonight Show, too. Where Fallon once towered above his 11.35pm time-slot rivals, Stephen Colbert and Jimmy Kimmel, he’s now in danger of slipping into third place – something that was unthinkable even 12 months ago. Fallon averaged nearly 4 million viewers a night in 2015, and almost 3.5 million the year after. In 2017, he’s pulling in just over 2.5 million a show, a steep drop by Tonight Show standards.\n\nIt all started in September of last year, when Fallon’s schmaltzy interview with the then candidate Trump found the host in hot water. Thirteen months on, the encounter seems even stranger. The interview begins with softball questions: “There’s probably kids watching right now … why should they want to grow up and be president?” He follows those up by asking Trump if he had ever seen himself getting into politics; then he asks what’s changed over the course of the campaign. The most infamous portion of the interview, of course, is when Fallon asks Trump’s permission to mess up his hair. It was a lesson in how to fumble a golden opportunity and normalize a deeply unqualified, proto-fascist candidate.\n\n“If Jimmy Fallon had any credibility left as a thinking comedian with a point of view, he lost the last shred of it last night,” Sonia Saraiya noted in Variety the morning after. Fallon’s genuflection toward Trump coincided with his ratings decline: the week of the Trump interview, he led Colbert and Kimmel both by over 1 million viewers. By the inauguration in January, he and Colbert were neck and neck. And last week, Colbert brought in 500,000 more nightly viewers than Fallon while Kimmel, after several blistering attacks on the Graham-Cassidy healthcare bill, was inching towards second place.\n\nAll of this suggests that viewers don’t seem to have an appetite for Fallon’s happy-medium approach. And while he’ll still nab the occasional viral video – his comments on the white supremacist violence in Charlottesville, for example – the opening monologues of Colbert, Kimmel, Seth Meyers, Trevor Noah and Samantha Bee have consistently out-thought Fallon.\n\nFacebook Twitter Pinterest Killing them softly: Miley Cyrus and Jimmy Fallon take part in one of the host’s trademark song and dance routines. Photograph: NBC/Getty Images\n\nIt’s not just that they make mincemeat of the Trump presidency, as Fallon frequently does, too. It’s that they earnestly attack its corrosive policies, its rampant hypocrisy, and the president’s temperament, while Fallon makes jokes about his tan and imagines rap battles between the president and Eminem. As the numbers suggest, viewers instead want late-night hosts to sound the alarm, to provide a comedic bastion against what amounts, at best, to a flailing, shambolic presidency.\n\nThere are still metrics by which Fallon dominates, but they don’t tell the whole story. Considering many folks catch up on late-night clips on YouTube the day after, viewing statistics on the site suggest that Fallon’s lost ground with his opening monologue. In sheer subscribers, The Tonight Show trounces The Late Show and Jimmy Kimmel Live with over 14 million subscribers to three and 10 million, respectively. But where Fallon’s monologues typically get between 50,000 and 200,000 views, those of Colbert and Kimmel, and even Noah, Bee, and Meyers, are routinely pulling in upwards of 1 million. Fallon’s monologues jump from topic to topic, paying cursory attention to the goings-on in DC while banking on his slapstick talents. The others, in marked contrast, dissect a given topic – healthcare, sexual assault, the North Korean nuclear threat, white supremacy – with patience, precision and potency.\n\nWhy can't rightwing comics break into US late-night TV? Read more\n\nIt’s not that viewers haven’t forgiven Fallon for his rendezvous with Trump, although there are many who were permanently turned off by how harebrained it was. Instead, it’s that Fallon himself doesn’t seem to have learned the lessons from it. While his show’s ethos has always been airy and musical, known for its celebrity karaoke battles and impersonation games, that same identity has cost the show its relevance. And when Fallon does address Trump, the buoyant camaraderie that once defined his program is gone: his energy levels drop, his body stiffens and the jokes lack bite.\n\nPerhaps Fallon thinks there are other comics who do political punditry better than him, and so he steers clear. “I’m a people-pleaser,” Fallon told the New York Times after the Trump fiasco. “I didn’t mean anything by it. I was just trying to have fun.” But we all exist in Trumplandia now, whether we like it or not, and insofar as his show pretends it’s all fun-and-games, Fallon can expect his ratings to drop and his peers to take his place.", "images": ["https://i.guim.co.uk/img/media/45cc89cdac5963940672707abe5e6ec233832dc6/0_59_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a0223f3aaf691f39355f0be71f76c87b", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Jimmy+Fallon%2CTV+comedy%2CJimmy+Kimmel%2CStephen+Colbert%2CSamantha+Bee%2CTrevor+Noah%2CDonald+Trump%2CUS+television%2CTelevision+%26+radio%2CCulture", "https://i.guim.co.uk/img/media/0ba0118258cf274e5dd8d8e84df7b02caffce416/134_267_2773_1664/master/2773.jpg?width=300&quality=85&auto=format&fit=max&s=1c86d61b42ff9d2399f85a81b3e8dc91"], "top_img": "https://i.guim.co.uk/img/media/45cc89cdac5963940672707abe5e6ec233832dc6/0_59_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a0223f3aaf691f39355f0be71f76c87b", "keywords": [], "authors": ["Jake Nevins"], "canonical_link": "https://www.theguardian.com/culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america", "title": "How Fallon fell: why is the late-night host floundering in Trump's America?", "meta_data": {"description": "After Fallon’s fluff interview with Donald Trump, The Tonight Show’s ratings have plummeted and the host’s apolitical stance could be its biggest problem", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Jake Nevins", "thumbnail": "https://i.guim.co.uk/img/media/45cc89cdac5963940672707abe5e6ec233832dc6/0_59_3000_1800/master/3000.jpg?width=620&quality=85&auto=format&fit=max&s=5e600c06cf07cdb03da7fed93edd6fe4", "keywords": "Jimmy Fallon,TV comedy,Jimmy Kimmel,Stephen Colbert,Samantha Bee,Trevor Noah,Donald Trump,US television,Television & radio,Culture", "news_keywords": "Jimmy Fallon,TV comedy,Jimmy Kimmel,Stephen Colbert,Samantha Bee,Trevor Noah,Donald Trump,US television,Television & radio,Culture", "og": {"url": "http://www.theguardian.com/culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america", "image": "https://i.guim.co.uk/img/media/45cc89cdac5963940672707abe5e6ec233832dc6/0_59_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a0223f3aaf691f39355f0be71f76c87b", "description": "After Fallon’s fluff interview with Donald Trump, The Tonight Show’s ratings have plummeted and the host’s apolitical stance could be its biggest problem", "type": "article", "title": "How Fallon fell: why is the late-night host floundering in Trump's America?", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/jake-nevins", "publisher": "https://www.facebook.com/theguardian", "section": "Culture", "published_time": "2017-10-16T11:00:03.000Z", "tag": "Jimmy Fallon,TV comedy,Jimmy Kimmel,Stephen Colbert,Samantha Bee,Trevor Noah,Donald Trump,US television,Television & radio,Culture", "modified_time": "2018-04-23T09:35:55.000Z"}, "al": {"ios": {"url": "gnmguardian://culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america", "iphone": "gnmguardian://culture/2017/oct/16/how-fallon-fell-why-is-the-late-night-host-floundering-in-trumps-america?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/45cc89cdac5963940672707abe5e6ec233832dc6/0_59_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=7825523a30821f8845560e02ea1bbdce", "site": "@guardian", "card": "summary_large_image", "creator": "@jhnevins", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1508083200.0, "source": "https://www.theguardian.com", "summary": ""}