{"url": "https://en.wikipedia.org/wiki/The_X-Files_(season_8)", "text": "The eighth season of the American science fiction television series The X-Files commenced airing in the United States on November 5, 2000, concluded on May 20, 2001, and consisted of twenty-one episodes. Season eight takes place after Fox Mulder's (David Duchovny) alien abduction in the seventh season. The story arc for the search of Mulder continues until the second half of the season, while a new arc about Dana Scully's (Gillian Anderson) pregnancy is formed. This arc would continue, and end, with the next season. The season explores various themes such as life, death, and belief.\n\nFor this season, Duchovny elected to return only as an intermittent main character, appearing in only half of the episodes. Actor Robert Patrick was hired as a replacement for Mulder, playing John Doggett. The season also marked the first appearance of Annabeth Gish as Monica Reyes, who would become a main character in the ninth season. In addition to the cast change, series creator Chris Carter updated the opening credits, which had remained unchanged since the first season.\n\nSeason eight was received well by critics but was less warmly received by fans, many of whom were unhappy that Duchovny reduced his role and that Patrick took over as co-lead alongside Anderson. Ratings for the season were initially strong, but it eventually averaged a total of 13.53 million viewers, down from the seventh season's 14.2 million. Concurrent with the airing of this season, Carter and The X-Files production team created and aired a short-lived spinoff titled The Lone Gunmen.\n\nPlot overview [ edit ]\n\nAt the end of the seventh season finale, \"Requiem\", Fox Mulder (David Duchovny) was abducted by aliens.[1] Dana Scully (Gillian Anderson) meets Special Agent John Doggett (Robert Patrick), the leader of an FBI taskforce organized to conduct a search for Mulder.[2] Although the search ultimately proves unsuccessful, Doggett is assigned to the X-Files and works with Scully to look for explanations to several cases.[3] When Scully learns that several women have reportedly been abducted and impregnated with alien babies, she begins to question her own pregnancy and fears for her unborn child.[4]\n\nDoggett introduces Scully to Special Agent Monica Reyes (Annabeth Gish), an FBI specialist in ritualistic crime, shortly before Mulder's deceased body suddenly appears in a forest at night.[5] Following Mulder's funeral, Assistant Director Walter Skinner (Mitch Pileggi) is threatened by Alex Krycek (Nicholas Lea) that he must kill Scully's baby before it is born. Billy Miles (Zachary Ansley), a multiple abductee who disappeared on the same night as Mulder, is returned deceased but his dead body is resurrected and restored to full health.[6] Mulder also returns from death, with Scully supervising his recovery. Fully rejuvenated, Mulder investigates several X-Files, against orders to do so, but soon gets fired, leaving Doggett in charge of the cases. Mulder continues to provide input in an unofficial capacity.[7]\n\nReluctantly accepting Krycek's assistance, Mulder, Doggett and Skinner learn that an alien virus recently created in secret by members of the United States government has replaced several humans, including Miles and several high-ranking FBI personnel, with so-called alien \"Super Soldiers\". Krycek claims that the soldiers are virtually unstoppable aliens who want to make sure that humans will not survive the colonisation of Earth. They have learned that Scully's baby is a miraculously special child and are afraid that it may be greater than them. They have only recently learned of the baby's importance, which is why Krycek told Skinner to kill the unborn child earlier.[8] When Miles arrives at the FBI Headquarters, Mulder, Doggett, Skinner and Krycek help Scully to escape along with Reyes who drives her to a remote farm. Shortly after Skinner kills Krycek, Scully delivers an apparently normal baby while the alien super soldiers surround her. Without explanation, the aliens leave the area as Mulder arrives. While Doggett and Reyes report to the FBI Headquarters, Mulder takes Scully and their newborn son, William, back to her apartment.[9]\n\nThemes [ edit ]\n\nThe eighth season of The X-Files takes place in a science fiction environment and employs the common science fiction concepts of strongly differentiated characters fighting an unequivocally evil enemy, in this case, the alien Colonists. The first episode of the season, \"Within\" explores \"loss\", \"loneliness\" and \"pain\" after the disappearance of Mulder.[10] \"Per Manum\" included basic themes common in the series, such as \"dark, foreboding terror\", an \"overriding sense of paranoia\", and \"the fear of the unknown\", among others.[11] Later on, death and resurrection emerged as a major sub-theme during the season, starting with \"The Gift\", wherein John Doggett is killed and resurrected, and later in \"Deadalive\" when Mulder is brought back to life after apparently being dead for three months. This sub-theme would continue well into the ninth season.[12] The main story arc of the season dealt with the idea that, at times, humanity is a greater danger to itself. This theme is made manifest by the Syndicate and the human conspiracy with the aliens.[12]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nlower left) and Mulder's disappearance (lower right). The new opening sequence for season eight, featuring Robert Patrick , as well as images alluding to Scully's pregnancy () and Mulder's disappearance ().\n\nThe series' original title sequence, crafted in 1993 during the show's first season had remained unchanged for seven seasons. With the partial loss of Duchovny after the seventh-season finale, the decision was made to update the credits, which were first featured in the premiere episode of season eight, \"Within\". The opening sequence now included new images, updated FBI badge photos for Duchovny and Anderson, and the addition of Patrick to the main cast. Duchovny's badge features in the opening credits only when he appears in an episode. The opening contains images of Scully's pregnancy and, according to Frank Spotnitz, shows an \"abstract\" explanation for Mulder's absence in this season, with him falling into an eye.[13]\n\nAfter the partial departure of Duchovny, Carter decided to focus almost solely on the character of Doggett during the first half of the season. This led to some unhappiness from the cast and critics, most notably Duchovny and Anderson.[14][15] According to Tom Kessenich in his book Examinations, Anderson reportedly \"wasn't thrilled\" with the lack of attention her character was getting; instead, the writers were crafting episodes solely for Doggett because he was the show's new \"voice\".[14][15] Duchovny, on the other hand, was unhappy because Mulder's abduction was never properly examined. Reportedly, Duchovny offered to write and direct an episode based around the concept of Mulder being trapped in the alien spaceship, as seen in the season opener \"Within\" and \"Without\". Carter, however, nixed the idea because \"it was not about Doggett.\"[14]\n\nCasting [ edit ]\n\nThe show's seventh season was a time of closure for The X-Files. Characters within the show were written out—including Cigarette Smoking Man (William B. Davis) and Mulder's mother (Rebecca Toolan)—and several plot threads were resolved, including the fate of Fox Mulder's sister Samantha.[16] Furthermore, after settling his contract dispute, Duchovny quit the show.[17][18] This contributed to uncertainties over the likelihood of an eighth season.[19] Carter and most fans felt the show was at its natural endpoint with Duchovny's departure, and Carter penned \"Requiem\", the finale episode of the seventh season, as a possible series finale.[13] However, at the last minute, a new season was ordered and Duchovny agreed to star part-time, returning for 12 episodes instead of 21.[18] Due to this change, the producers found it difficult to write Duchovny's character out of the script, but also eventually explain Mulder's absence if there were to be an upcoming season. Eventually, it was decided to have the character abducted by aliens.[13]\n\nHoping to continue the series, Carter introduced a new central character to replace Mulder: John Doggett. More than 100 actors auditioned for the role, with only about ten considered by the producers. Lou Diamond Phillips and Hart Bochner were among the auditionees, and Phillips, Bochner and Bruce Campbell (who played Wayne Weinsider in a previous episode of The X-Files) were considered for the role, but the producers eventually choose Robert Patrick.[20] The season also introduced Monica Reyes (portrayed by Annabeth Gish), who would become a main character in the following season.[13][21]\n\nCrew [ edit ]\n\nChris Carter, who also served as executive producer and showrunner during the season, wrote or co-wrote the bulk of the episodes for the season, with nine of the twenty one episodes. Of the nine, four were co-written with executive producer Frank Spotnitz. Carter also wrote five episodes solo, and Spotnitz wrote four episodes solo. The rest of the writing staff contributed one or two episodes. Vince Gilligan was promoted to executive producer and wrote one episode. John Shiban was promoted to co-executive producer and wrote one episode. David Amann was promoted to producer and wrote one episode. Jeffrey Bell was promoted to executive story editor and wrote one episode. Greg Walker was promoted to executive story editor and wrote two episodes. Steven Maeda was promoted to story editor and wrote two episodes. Daniel Arkin, who wrote a freelance episode for the series previously, returned to contribute to the story for one episode.\n\nKim Manners was promoted to co-executive producer and directed the most of episodes of the season with seven. Directors who directed multiple episodes for the season included Tony Wharmby who directed four, Rod Hardy directed three, and Richard Compton directed two. Peter Markle, Terrence O'Hara, and Barry K. Thomas each directed one episode. Carter directed a single episode, while writer Spotnitz made his directorial debut.\n\nCast [ edit ]\n\nMain cast [ edit ]\n\na ^ Although appearing in only 12 episodes, Duchovny is credited as \"starring\" in the opening credits for the episodes in which he appeared.\n\nb ^ Does not appear in \"The Gift\", except in archived footage.\n\nRecurring cast [ edit ]\n\nAlso starring [ edit ]\n\nGuest starring [ edit ]\n\nEpisodes [ edit ]\n\nEpisodes marked with a double dagger ( ) are episodes in the series' Alien Mythology arc.[nb 1]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nReportedly, Patrick was cast due to the hopes that his featured role in Terminator 2: Judgment Day (1991) would attract a great 18- to 35-year-old male demographic to the show. Early on, Fox executives reported a 10 percent overall increase in the demographic, solely due to Patrick's casting.[34] \"Within\", the season's first episode, earned a Nielsen household rating of 9.5, meaning that it was seen by 9.5% of the nation's estimated households.[35] The episode was viewed by 15.87 million viewers,[24] which marked an 11% decrease from the seventh season opener, \"The Sixth Extinction.\"[36] The highest-rated episode of the season was \"This is Not Happening\", which was viewed by 16.9 million viewers, making it the most-watched episode of the series, in terms of viewers, since \"The Sixth Extinction\".[30][37] The season finale, \"Existence\", earned a Nielsen household rating of 8.4, meaning that it was seen by 8.4% of the nation's estimated households.[38] The episode was watched by 14 million viewers, overall.[33] The nine episodes of the season that did not feature Mulder averaged only 13 million viewers, whereas the twelve episodes that did feature Mulder averaged 13.93 million viewers, almost a difference of one million. The season averaged a total of 13.53 million viewers, down from the seventh season's 14.2 million.[39]\n\nDuring 2000, companies were paying Fox $225,000 for every 30-second spot that would air between acts of The X-Files. Many Information technology (IT) companies were buying commercials during the show, largely due to the fact that \"many ['coders IT geeks'] get their weekly fix of science fiction from this prime-time show.\"[31]\n\nReviews [ edit ]\n\nThe show's eighth season received mixed to positive reviews from critics. The A.V. Club noted that the first eight seasons of The X-Files were \"good-to-great\", and that the eighth season of the show was \"revitalized by the new 'search for Mulder' story-arc.\"[40] John C. Snider of SciFiDimensions gave the season a favorable review, calling it \"great\" and describing its episodes as \"pretty strong\".[41] Collin Polonowonski of DVD Times said that the season included \"more hits than misses overall\" but was throughout negative about the mythology episodes claiming them to be the \"weakest\" episodes in the season.[42] Many critics eventually accepted Doggett's character. Anita Gates of The New York Times said that most fans had \"accepted\" the introduction of the character and further stated that he actually looked \"Like a Secret Service Agent.\"[43] Carter commented on the character, saying \"Everybody likes Robert Patrick and the character\", but further stating that the fans \"miss\" Duchovny's character, Mulder.[44] Dave Golder of SFX called Patrick \"superb\" and noted that his entrance in the series \"inject[ed] a sense of pragmatism and good old-fashioned plain-speaking in to the show which we didn't realise was missing until we got it.\"[45] Entertainment Weekly reviewer Ken Tucker said that Patrick's portrayal of Doggett was \"hardboiled alertness\", giving mostly positive reviews about his inclusion.[46] Cynthia Littleton of The Hollywood Reporter described the season as the show's \"swan song\".[47]\n\nNot all reviews were positive. Jesse Hassenger from PopMatters gave a negative review to the season, claiming that Patrick was mis-cast and calling David Duchovny's appearances as Fox Mulder shallow.[48] Golder criticized the season for \"recycling plots with gusto\" and for featuring Mulder falling into Scully's eye in the opening credits, noting that it \"gives Duchovny too much of a lingering presence on the show, reinforcing prejudices against Patrick as some kind of 'imposter'.\"[45]\n\nAccolades [ edit ]\n\n\"This Is Not Happening\" was nominated for an American Society of Cinematographers award for cinematography.[13] Robert Patrick won a Saturn Award in the category \"Best Television Actor\" in 2001 for his role as Doggett,[49] that year Gillian Anderson was nominated in the category \"Best Actress on Television\" and the series itself was nominated in the category \"Best Network Television Series\" in the Saturn Awards, but failed to win.[50] Anderson was nominated for a Screen Actors Guild award the very same year in the category \"Outstanding Performance by a Female Actor in a Drama Series\".[51] The X-Files won its last Emmy Award with \"Deadalive\", and Bill Roe received a nomination for \"Outstanding Cinematography for a Single-Camera Series\".[13][52]\n\nDVD release [ edit ]\n\nThe X-Files – The Complete Eighth Season Set details[23] Special features[23] 21 episodes\n\n6-disc set\n\n1.78:1 aspect ratio\n\nSubtitles: English, Spanish\n\nEnglish (Dolby 2.0 Surround) \"The Truth About Season Eight\" Documentary\n\nDVD-ROM game\n\nAudio Commentaries (Dolby Digital 2.0 Stereo) \"Alone\" – Frank Spotnitz \"Existence\" – Kim Manners\n\nSelected special effects clips\n\nDeleted scenes\n\nCharacter profiles\n\n42 promotional television spots Release dates Region 1 Region 2 Region 4 November 4, 2003 ( ) March 14, 2004 ( ) April 14, 2004 ( )\n\nNotes [ edit ]\n\n^ The X-Files Mythology, Volume 3 – Colonization and The X-Files Mythology, Volume 4 – Super Soldiers, released by Fox, with the exception of \"The Gift\". However, this episode is labelled as a mythology episode in the series' official guide book, The Complete X-Files: Behind the Series the Myths and the Movies, released in 2008.[22] All of these episodes were included on the DVD collectionsand, released by Fox, with the exception of \"The Gift\". However, this episode is labelled as a mythology episode in the series' official guide book,, released in 2008.\n\nReferences [ edit ]\n\nBibliography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Robert_Patrick.jpg/160px-Robert_Patrick.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/2/26/Xfilesseason8.jpg/220px-Xfilesseason8.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/2/26/Xfilesseason8.jpg", "https://upload.wikimedia.org/wikipedia/en/9/9f/Opening_Sequence_TXF.jpg", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/26/Xfilesseason8.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_X-Files_(season_8)", "title": "The X-Files (season 8)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/2/26/Xfilesseason8.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}