{"url": "https://www.usatoday.com/story/life/entertainthis/2017/10/23/why-justin-timberlake-owes-janet-jackson-super-bowl-sized-apology/790290001/", "text": "Maeve McDermott\n\nUSA TODAY\n\nJustin Timberlake needs to apologize to Janet Jackson. He should start apologizing now, with the news that he's confirmed to perform at the 2018 Super Bowl halftime show. He should do so as publicly as possible. And at the very least, he should invite her onstage at the show, to perform a song, or 10.\n\nThose are several demands of the viral #JusticeForJanet hashtag, which emerged following the news of Timberlake's halftime booking. Because, even as Timberlake's career has flourished in the 13 years since \"Nipplegate,\" Jackson's fans haven't forgotten that Timberlake is complicit in the unjust treatment of their icon.\n\nIn a moment that’s still painful to watch more than a decade later, Timberlake exposed Jackson's breast during her Super Bowl halftime show in 2004 in front of an audience of 143.6 million viewers. The night was supposed to belong to Jackson, who was the seasoned pop star to Timberlake’s rookie. Jackson had invited the then-rising boy band *NSYNC to open for her Velvet Rope tour in 1998, then lent her vocals to Timberlake’s debut album, Justified, after he went solo.\n\nConsidering how Timberlake has molded himself in Michael Jackson’s image from the beginning of his solo career, his Super Bowl cameo was meant to be a reunion with his mentor, a chance for him to pay homage to Janet’s pop legacy.\n\nTimberlake needs to apologize because he played a role in hijacking this legacy, starting with the wardrobe malfunction that barely impacted his career while sending Jackson's into free-fall.\n\nIn the weeks after the “wardrobe malfunction,” a phrase that will be forever linked to Jackson’s humiliation, she became a comedy punchline and was blacklisted by Viacom (which kept her music off MTV, VH1, and radio stations around the country).\n\nThere seemed to be no question the incident was Jackson’s fault, down to the media outlets that selectively edited her videotaped apology. “Sometimes they cut out that I said it was an accident,” she later told Ebony.\n\nAnd while Timberlake has maintained that the incident was an accident, he hasn't taken responsibility for the part he played. \"I'm frustrated at the whole situation,\" he told reporters the week after the Super Bowl. \"I'm frustrated that my character is being questioned. And the fact of the matter is, you know, I've had a good year, a really good year, especially with my music.\"\n\nTimberlake has apologized further in the years since, telling MTV in 2006 that he \"probably got 10% of the blame,\" and that America is \"unfairly harsh on ethnic people.\" Yet, he's still unsure how to address the scandal, bungling an exchange last year when a Twitter follower called on him to \"stop appropriating our music and culture\" and \"apologize to Janet too.”\n\n\"Oh, you sweet soul,\" he responded. \"The more you realize that we are the same, the more we can have a conversation. Bye.”\n\nTimberlake is very much not \"the same.\" His privilege hasn't only enabled him to score hit albums and film roles and Oscar nominations and a Super Bowl slot, but also lets him play dumb about his own role in a scandal that, as he previously acknowledged, amounted to America piling on a black woman and shaming her for her sexuality while granting him a free pass.\n\n\n\nAnd Timberlake needs to apologize now, more than ever, considering how the news of his booking comes during a blistering month for women reckoning with sexual humiliation. In the wake of Harvey Weinstein’s downfall, women around the world have continued to share their stories about how men’s inappropriate actions ruined their lives.\n\nSeeing Timberlake invited back to the Super Bowl while Jackson’s career still bears visible scars from the incident is a bitter reminder of which people society punishes more for so-called sexual indiscretions.", "images": ["https://www.gannett-cdn.com/-mm-/a9f495bf43a75e867dd70fce0693113c443e8dc4/c=0-90-1896-1161/local/-/media/2017/10/23/USATODAY/USATODAY/636443557115965619-AXX-LETFEAT-27-2296217.JPG?width=1896&height=1071&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5622508985001_5622507514001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/a9f495bf43a75e867dd70fce0693113c443e8dc4/c=0-90-1896-1161/local/-/media/2017/10/23/USATODAY/USATODAY/636443557115965619-AXX-LETFEAT-27-2296217.JPG?width=1896&height=1071&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/10/23/why-justin-timberlake-owes-janet-jackson-super-bowl-sized-apology/790290001/", "title": "Why Justin Timberlake owes Janet Jackson a Super Bowl-size apology", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Why Justin Timberlake owes Janet Jackson a Super Bowl-size apology", "description": "Timberlake is confirmed to perform at the 2018 Super Bowl halftime show. Here's why he owes Jackson an apology.", "url": "https://www.usatoday.com/story/life/entertainthis/2017/10/23/why-justin-timberlake-owes-janet-jackson-super-bowl-sized-apology/790290001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/a9f495bf43a75e867dd70fce0693113c443e8dc4/c=0-90-1896-1161/local/-/media/2017/10/23/USATODAY/USATODAY/636443557115965619-AXX-LETFEAT-27-2296217.JPG?width=1896&height=1071&fit=crop&format=pjpg&auto=webp", "width": 1896, "height": 1071}, "type": "article"}, "article": {"author": "Maeve McDermott", "content_tier": "free", "opinion": "false"}, "description": "Timberlake is confirmed to perform at the 2018 Super Bowl halftime show. Here's why he owes Jackson an apology.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/a9f495bf43a75e867dd70fce0693113c443e8dc4/c=0-90-1896-1161/local/-/media/2017/10/23/USATODAY/USATODAY/636443557115965619-AXX-LETFEAT-27-2296217.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Why Justin Timberlake owes Janet Jackson a Super Bowl-size apology", "description": "Timberlake is confirmed to perform at the 2018 Super Bowl halftime show. Here's why he owes Jackson an apology."}}, "movies": [], "publish_date": 1508688000.0, "source": "https://www.usatoday.com", "summary": ""}