{"url": "http://time.com/money/5217998/cost-coachella-2018-beyonce/", "text": "Beyoncé fans are getting their raincheck. This year’s annual Coachella Valley Music and Arts Festival, which takes place near Indio, California, spans two weekends, April 13-15 and April 20-22, 2018. And Beyoncé, who had to cancel her planned 2017 performance (pregnancies and festivals seem like a bad mix), is on track to headline the 2018 festival—along with stars like The Weeknd, Cardi B, and Eminem.\n\nSo how much will it cost to go to Coachella? The 2018 ticket prices range from $429 for general admission to almost $1,000 for VIP passes. They’re all sold out, so you’ll have to search Stubhub. (Good luck!)\n\nBut getting the tickets is only half the battle. You’ll also need to arrange Coachella hotels or camping, shuttle passes or other transportation, food, and alcohol. To help you plan your ideal Coachella 2018 experience, MONEY scouted the options and priced out what it really costs to attend this festival.\n\nPorter Robinson & Madeon perform on the Coachella Stage during day 3 of the 2017 Coachella Valley Music & Arts Festival (Weekend 2) at the Empire Polo Club on April 23, 2017 in Indio, California. Christopher Polk—Getty Images for Coachella\n\nWhat Coachella Will Cost\n\nHere’s what Coachella would cost you if you a) are a typical traveler and b) decide to go today. More details on the various pricing items below.\n\n$231: Plane ticket to LAX (This is an average price—if you’re coming from Maine, say, be prepared to drop some cash.)\n\n$575: General admission, via Stubhub. (Next year, grab tickets through the online sale.)\n\n$1,221: Three-night stay at a mid-range hotel (At $407 a night, you may want to consider camping.)\n\n$70: Shuttle from LAX to Coachella (Spend over three hours getting to know your fellow festival goers.)\n\n$75: Any Line, Anytime Shuttle pass (You’ll need to get around, and Ubers will get too expensive.)\n\n$100: Food and water (Splurge a bit on top-notch vendors.)\n\n$75: Alcohol (Plan for a mix of BYOB at your hotel and a few beers from the Heineken House.)\n\nTotal: $2,347\n\nMusic fan Tallulah Willis of San Francisco, attends day 2 of the 2014 Coachella Valley Music & Arts Festival at the Empire Polo Club. Christopher Polk—Getty Images for Coachella\n\nCoachella Tickets\n\nWith this year’s lineup, it shouldn’t come as a surprise that passes are completely sold out. (Hello, it’s Beyoncé.) That even includes the $999 VIP experience passes, which include access to special VIP lounges and seating areas, such as the Rose Garden (which has restrooms), as well as specialty food & beverage vendors.\n\nIf you got general admission tickets in presale or through the online process, congrats! You only spent $429. Otherwise, expect to spend a little more: Tickets on Stubhub are going for around $575 for weekend 1 and $399 for weekend 2.\n\nDemand is up 24% for Coachella’s first weekend, according to StubHub sales data, but you can still get passes for a decent price, relative to face value. That’s particularly true for the festival’s second weekend. “Weekend 2 passes are also generally less expensive and have fewer crowds, so this is a great time to see the same lineup of artists at a reduced cost,” says StubHub spokeswoman Jessica Erskine.\n\nA group of festivalgoers chill out at an onsite campground at the 2011 Coachella Music & Arts Festival in Indio. Luis Sinco—LA Times via Getty Images\n\nCoachella Hotels and Camping\n\nThe cheapest lodging options for Coachella are generally car or tent camping on-site. Passes start at $113 for the weekend, but you should hurry; tent camping passes for the second weekend are already sold out.\n\nPrefer one of Coachella’s hotel options? A 3-star hotel room nearby is going for $407 per night during the festival weekends, according to travel site Hipmunk. Even a 2-star experience will cost you $312, on average, Hipmunk reports. That’s about 116% higher than the average prices in the area. Five-star hotels for Coachella are a painful $1,500 a night, up 147% from the average rate of roughly $600.\n\nFor those looking to splurge (YOLO, right?), Valley Music Travel has glamping options that take it to a whole new level. On-site safari tents are available for the weekend starting at $8,500 for two people (each additional person is $2,000), which also includes the price of two VIP passes to the festival. At this point, it may not be a bad bet.\n\nCoachella offered the option to stay in a teepee at nearby Lake Eldorado for only $2,458. The package includes two general admission tickets, plus lodging for the weekend in a teepee with two cots, two sleeping bags, and two pillows. This may be best as a plan for next year, though: 2018 Lake Eldorado packages are sold out.\n\nAnd sadly the Resort at Coachella experience (around $25,000 for the weekend), complete with a stay in a luxury yurt and passes, is also sold out. You snooze, you lose.\n\nA vivid sunset over Palm Springs International Airport late in the day as a United Airlines jet passes, May 6, 2016. 400tmax—Getty Images\n\nCoachella Shuttle, Flights, and Other Transportation\n\nFlying to Coachella isn’t too pricey—the average airfare into LAX for the weekend is about $230 round-trip, according to travel app Hopper. Flights into the closer Palm Springs airport are just a few bucks more.\n\nBut then you need to consider how you’re going to get around once you’re there—and this is where your budget could really fall apart. A rental car from LAX will set you back about $66 per day, according to Hipmunk. You’re paying a premium—rental car prices for Coachella weekends were up over 60% from the usual $41 rate, the booking site found.\n\nIn the end, it may be more effective to simply go with shuttle bus tickets. The Coachella shuttle from LAX will set you back $70, while a shuttle pass for the weekend—which gets you back and forth from the festival grounds to local hotels and camping areas—is around $75 per person.\n\nUber, of course, will also be operating at the festival—but we don’t recommend it. Not only is the pickup point is much farther than the shuttle pickup, but it’s hella pricey.\n\nCraft beer tent seen during day 1 of the 2016 Coachella Valley Music & Arts Festival Weekend 1 at the Empire Polo Club. Matt Cowan—Getty Images for Coachella\n\nCoachella Food and Alcohol Prices\n\nTo save the most on food and water, you can load up the car with shelf-stable groceries for the weekend and carry around a collapsible water bottle. But let’s be honest: Part of the Coachella experience is about the food vendors and bars.\n\nFor drinks, expect to shell out about $10 a beer if you’re visiting the Craft Beer Barn and $8 for drinks at the Heineken Experience.\n\nCoachella also offers some fine dining options. Outstanding in the Field is a $225, four-course dinner experience prepared by celebrity chefs like Santa Monica-based chef Bruce Kalman and Tyler Anderson, chef and owner of Millwright’s Restaurant and Tavern.\n\nAnd in case you’re wondering: Even though weed is now legal in California, the company producing Coachella, Goldenvoice, doesn’t appear to be taking any chances. After all, as far as the U.S. government is concerned, smoking a joint is still an illegal activity—even on festival grounds. But as one Reddit thread puts it: “As long as you’re not an idiot you should be able to get it in pretty easily.” So perhaps it’s worth budgeting in that expense as well.", "images": ["https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-breakdown.jpg", "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-beyonce-featured.jpg?quality=85", "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-flights.jpg", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-camping.jpg", "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-food-alcohol.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-tickets.jpg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-beyonce-featured.jpg?quality=85", "keywords": [], "authors": ["Megan Leonhardt"], "canonical_link": "https://money.com/cost-coachella-2018-beyonce/", "title": "What It Really Costs to Go to Coachella 2018", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "coachella 2018,coachella festival,Coachella Valley Music and Arts Festival,Festival", "news_keywords": "coachella 2018,coachella festival,Coachella Valley Music and Arts Festival,Festival", "description": "We looked at the price for Coachella tickets, hotels and camping, Coachella shuttle, and more to add up the total cost to attend Coachella.", "og": {"title": "What It Really Costs to Go to Coachella 2018", "type": "article", "site_name": "Money", "url": "https://money.com/cost-coachella-2018-beyonce/", "description": "Spend a weekend with Beyoncé and more.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-beyonce-featured.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/cost-coachella-2018-beyonce/", "description": "We looked at the price for Coachella tickets, hotels and camping, Coachella shuttle, and more to add up the total cost to attend Coachella.", "media": "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-beyonce-featured.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/cost-coachella-2018-beyonce/", "title": "What It Really Costs to Go to Coachella 2018", "description": "Spend a weekend with Beyoncé and more.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/03/180328-coachella-cost-beyonce-featured.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}