{"url": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist", "text": "Let’s be honest: we’ve reached peak nostalgia in the fashion and entertainment industries. Everything both '80s and '90s is stylish again, and almost every beloved film or series from the past four decades has been rebooted and reworked for modern day. So, it wasn’t a complete surprise that the CW wanted to take on one of the shadiest, most stylish dramas of all time: none other than Dynasty.\n\nSince Gossip Girl ended almost five years ago, we haven’t truly had another soap opera-level, style-focused show to indulge in, thus the series’ revamp couldn’t have come at a better time. And it’s absolutely kismet that the 2017 Dynasty has the Upper East Side-centric show’s creators, Josh Schwartz and Stephanie Savage at its design helm, as well as costume designer Eric Daman’s right hand, Meredith Markworth-Pollack working on the wardrobe.\n\nChristopher Fragapane/The CW Network/Everett Collection\n\nDynasty is indeed a series about the upper crust of the one percent, but the revamp has come a long way from some of the sexist and homophobic undertones present in the '80s run. The 2017 version boasts a diverse, inclusive, and gorgeous cast, including Steven Carrington, who is openly gay and environmentally conscious; Cristal and Sammy Jo, both Venezuelan and proud of their heritage; and the Colbys, who are now played by black actors. And though there is a catfight — bringing back one of the most infamous moments from the original show — this time, the squabble is happening because both Fallon Carrington and Cristal are vying for a leadership position at Carrington Atlantic.\n\nThe show is steeped in female empowerment and gives us a taste of how powerful women are dressing in the office in 2017. “We wanted to show her femininity, but also show that she’s COO of a company,” Markworth-Pollack said of Cristal’s wardrobe. “She can still be bold and rock the structured looks, but she doesn’t have to be the woman who comes in wearing the black suit. She doesn’t have to be tough because she can still be feminine and be the boss.”\n\nAnother thing that’s important for Markworth-Pollack and the cast is to celebrate designers of color and emerging brands. “I started out in New York and my BFF and roommate for years was a fashion designer,” the costume designer revealed. “I saw the struggle of it all firsthand and how much it takes, so I love supporting up-and-coming designers. I love the Marc Jacobs and Tom Fords, but I also love newer names. Nathalie also wanted to support Latino designers, as she’s Peruvian and her character Cristal is Venezuelan. Johanna Ortiz and Juan Carlos Obando are in our lineup constantly, as are a couple of Mexican designers whose pieces we’ll be using soon. Nathalie believes that Cristal would be the kind of person who would do that and I agree. She has money now and wants to give back and show that support.”\n\nFallon on the other hand is a reflection of the modern-day woman in Markworth-Pollack’s eyes. “She’s more outrageous,” she stated of the revamped character, played by Elizabeth Gillies. “Her colors have a little bit more of a punch and she’s definitely more structured. But one thing I’ve wanted to do with her is to not define her style to just one thing. She’s really versatile and that’s a total reflection of the modern woman. We can be one thing one day and someone else the next.” Balmain, Saint Laurent, Alexandre Vauthier, and Marc Jacobs are on her style agenda for the season.", "images": ["https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "https://assets.teenvogue.com/photos/59fc8c9070ae4e37c2ec6434/master/w_1600%2Cc_limit/TCDDYNA_EC022.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/59fc85e152e9dc2ff73f6eca/16:9/w_2560%2Cc_limit/TCDDYNA_EC025.jpg"], "top_img": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "keywords": [], "authors": ["Faith Cummings", "Faith Cumming"], "canonical_link": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist", "title": "Dynasty Fashion: An Interview With the Cast and Wardrobe Stylist", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Faith Cummings", "copyright": "Copyright (c) Condé Nast 2020", "description": "In an exclusive interview with the cast and wardrobe stylists, Teen Vogue explores how the new CW show Dynasty is promoting diversity through fashion.", "id": "59f4ab4b2713a8783ea56707", "keywords": "news,dynasty,meredith markworth-pollack,the cw,elizabeth gillies,rafael de la fuente,nathalie kelly,sam adegoke", "news_keywords": "news,dynasty,meredith markworth-pollack,the cw,elizabeth gillies,rafael de la fuente,nathalie kelly,sam adegoke", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59f4ab4b2713a8783ea56707", "parsely-metadata": "{\"description\":\"In an exclusive interview with the cast and wardrobe stylists, Teen Vogue explores how the new CW show Dynasty is promoting diversity through fashion.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/59f4ac662713a8783ea56709/16:9/w_1000,c_limit/DYN101b_0175b.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/59f4ac662713a8783ea56709/1:1/w_1000,c_limit/DYN101b_0175b.jpg\"}", "og": {"description": "'Dynasty' is celebrating diversity through fashion.", "image": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg", "site_name": "Teen Vogue", "title": "The '80s Version of 'Gossip Girl' Is Back, and Making an Effort to Promote Designers of Color", "type": "article", "url": "https://www.teenvogue.com/story/dynasty-cw-fashion-interview-cast-wardrobe-stylist"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "'Dynasty' is celebrating diversity through fashion.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/59fc8d1e545af946d5bbde0d/16:9/w_1280,c_limit/dynasty-fb.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "The '80s Version of 'Gossip Girl' Is Back, and Making an Effort to Promote Designers of Color"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}