{"url": "https://www.thesun.co.uk/tvandshowbiz/2780157/cherry-seaborn-ed-sheeran-fiancee/", "text": "CHERRY Seaborn is Ed Sheeran's longtime childhood friend who later went on to became his wife.\n\nHere is the lowdown on their relationship, and the singer's \"Perfect\" woman...\n\n2 Cherry Seaborn is Ed Sheeran's wife Credit: Splash News\n\nWho is Cherry Seaborn?\n\nBritish born Cherry, 27, met Ed Sheeran, 28, at Thomas Mills High School in Framlingham, Suffolk, where the singer is believed to have had a crush on his classmate.\n\nThe pair finished their secondary education there and Cherry then attended Duke University, which is located in Durham, North Carolina, in America.\n\nIn 2016, after months of dealing with a long-distance relationship with Ed, The Sun exclusively revealed that she had moved back to the UK from the US to be with him.\n\nCherry has regularly been seen accompanying the pop star to showbiz events and he was once seen walking the streets in his socks after giving her his shoes to wear.\n\n2 Ed Sheeran and Cherry Seaborn have only been pictured together a handful of times during their relationship Credit: Splash News\n\nAre Cherry Seaborn and Ed Sheeran married?\n\nCherry and Ed knew each other from school but it wasn't until 2015 that he asked her out and they began dating.\n\nThe singer had previously revealed on Instagram that he proposed to Cherry over the 2017 Christmas holidays.\n\nIn February 2018, The Sun exclusively revealed that the pair had got married in secret with NO celebrities as guests.\n\nEd hosted the ceremony at his country estate in Suffolk just before Christmas 2018, despite having his plans to build a wedding chapel on site rejected.\n\nA source close to the singer revealed: “Ed got married a few days before Christmas. It was very quiet – just Ed’s oldest school pals, limited family and the priest.\n\n“There were only 40 people – so no Taylor Swift, record company executives or any royals or pop star pals.\n\n\"He wanted no fuss and he wanted it to be something entirely for them – just a tiny winter wedding.\n\n“It’s amazing that he’s the biggest pop star in the world but he was just able to quietly slide off and wed.\n\n“Neither of them were that fussed about making a big deal about it. Cherry just wanted to get it out of the way without any problems or intrusions.”\n\nlatest on ed sheeran Exclusive SUM GUY Ed Sheeran has donated more than £1million to charities near his home in Suffolk Exclusive GOOD LIFE Ed Sheeran is coping with lockdown life by keeping chickens and growing veg GUNNING FOR ED Arsenal fans call on Ed Sheeran to fund NHS fight against coronavirus Ed-ache Ed Sheeran tries to block neighbour's extension after angering with own plans She's beautiful Who is James Blunt's wife Sofia Wellesley and when did they marry? Exclusive sheer generosity Ed Sheeran to pay full wages of workers in his restaurant amid coronavirus\n\nWhat does Cherry Seaborn do?\n\nDuring her time in the States, Cherry impressed her peers with her incredible hockey ability.\n\nShe even led her hockey team to back-to-back British University championships in 2012 and 2013.\n\nOn Duke’s official website, Cherry said: \"Ever since I was in high school I've always wanted to study in the United States.\n\n\"I looked into different schools that were good academically and also at hockey, and Duke was one that really jumped out at me.\n\n\"I made my decision purely based on recommendations.\n\n\"Duke has such a good name in England, and there were a lot of people who told me to go there. There were also some English girls [at Duke], so I talked to them too.\"\n\nBefore Cherry returned back to British soil, it was rumoured that she worked as an Advisory Consultant at Deloitte & Touche LLP in New York.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000400547239.jpg?crop=0px%2C678px%2C1634px%2C1090px&resize=1200%2C800&ssl=1", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000400547239.jpg?crop=0px%2C678px%2C1634px%2C1090px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Sophie Roberts"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/2780157/cherry-seaborn-ed-sheeran-wife/", "title": "Who is Cherry Seaborn? Ed Sheeran’s wife and childhood sweetheart of the I Don’t Care singer", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Meet Cherry Seaborn - Ed Sheeran's high school crush and wife", "url": "https://www.thesun.co.uk/tvandshowbiz/2780157/cherry-seaborn-ed-sheeran-wife/", "description": "CHERRY Seaborn is Ed Sheeran’s longtime childhood friend who later went on to became his wife. Here is the lowdown on their relationship, and the singer’s “Perfect” woman\b…", "site_name": "The Sun", "image": {"identifier": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000400547239.jpg?crop=0px%2C678px%2C1634px%2C1090px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800, "alt": "Ed Sheeran and Cherry Seaborn have only been pictured together a handful of times during their relationship"}, "locale": "en_GB"}, "article": {"published_time": "2019-08-29T11:13:56+00:00", "modified_time": "2019-08-29T11:22:48+00:00", "publisher": 161385360554578, "tag": "Ed Sheeran, Explainers", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Ed Sheeran has married his childhood sweetheart and hockey star Cherry Seaborn", "keywords": "ed sheeran, singer, song-writer, cherry seaborn, fiancée, marrying, marriage, wedding, engaged, hockey", "news_keywords": "ed sheeran, singer, song-writer, cherry seaborn, fiancée, marrying, marriage, wedding, engaged, hockey", "twitter": {"text": {"title": "Who is Cherry Seaborn? Ed Sheeran’s wife and childhood sweetheart of the I Don’t Care singer"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "HE LOVES THE SHAPE OF HER", "headline": "All about Cherry Seaborn - Ed Sheeran's high school crush & wife", "image": {"medium": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000400547239.jpg?crop=5px%2C670px%2C1568px%2C1044px&resize=300%2C192&ssl=1", "large": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000400547239.jpg?crop=5px%2C670px%2C1568px%2C1044px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 2780157, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1567077236.0, "source": "https://www.thesun.co.uk", "summary": ""}