{"url": "https://deadline.com/2017/11/flash-supergirl-ep-andrew-kreisberg-fired-sexual-harassment-allegations-1202216549/", "text": "Less than three weeks after Andrew Kreisberg, co-creator/executive producer of the CW’s DC series The Flash, Supergirl, Legends of Tomorrow and Arrow, was suspended from his duties over allegations of sexual harassment, he has been fired by the studio, Warner Bros TV Group, following an investigation into the accusations.\n\n“After a thorough investigation, Warner Bros Television Group has terminated Andrew Kreisberg’s employment, effective immediately,” the company said in a statement. “We remain committed to providing a safe working environment for our employees and everyone involved in our productions.”\n\nWBTV\n\nKreisberg has been one of the top lieutenants of Greg Berlanti, architect of the CW DC universe, whose company Berlanti Prods. produces all series. Kreisberg had been hands-on involved in The Flash and Supergirl, serving as co-showrunner on both. Following his exit, Berlanti, co-creator/exec producer of the two series, will step in for him, assuming additional responsibilities on both The Flash, where he will work closely with executive producer/co-showrunner Todd Helbing, and Supergirl, where he will work closely with executive producers/co-showrunners Robert Rovner and Jessica Queller.\n\nRelated Story Matt Lauer Fired By NBC News Over Allegation Of 'Inappropriate Sexual Behavior'\n\n“Warner Bros Television Group recently concluded its investigation into the allegations against Andrew Kreisberg,” Berlanti Prods.’ Berlanti and Sarah Schechter said in a statement. “We encouraged and supported this investigation, we believe and support the individuals who came forward, and we agree with the studio’s decision. Nothing is more important to us than the safety and well-being of all our colleagues — coworkers, crew and staff alike.”\n\nAs Deadline previously reported, a number of staffers on The Flash and other DC series had complained about Kreisberg’s behavior. On at least one occasion, Kreisberg had interacted with a young female writer on The Flash early in the show’s run in a manner that was described as “inappropriate” and creating “a hostile work environment,” according to a source close to the situation. There had been specific allegations about Kreisberg from at least one other woman. In that case, a director who helmed episodes of Arrow and The Flash, had also complained of similar inappropriate behavior by the executive producer.\n\nFollowing Kreisberg’s suspension, actors from the CW DC series, including Supergirl and The Flash stars Melissa Benoist and Grant Gustin, spoke out against sexual harassment and in support of the victims.\n\nMeanwhile, E! and Lionsgate TV recently suspended The Royals showrunner Mark Schwahn over sexual harassment allegations by cast and crew members of both his previous show, One Tree Hill, and The Royals.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pixel.wp.com/b.gif?v=noscript", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2017/11/andrew-kreisberg-2015.jpg?w=1024", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcdeadline2.files.wordpress.com/2017/08/supergirl-flash-review-pic.jpg?w=374&h=249", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F11%2Fflash-supergirl-ep-andrew-kreisberg-fired-sexual-harassment-allegations-1202216549%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202216549&comment_count=33"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/11/andrew-kreisberg-2015.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2017/11/flash-supergirl-ep-andrew-kreisberg-fired-sexual-harassment-allegations-1202216549/", "title": "‘Flash’ & ‘Supergirl’ EP Andrew Kreisberg Fired Over Sexual Harassment Allegations", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Andrew Kreisberg, co-creator of the CW's The Flash, Supergirl, Legends of Tomorrow and Arrow, was fired after a sexual harassment probe.", "news_keywords": "Andrew Kreisberg, Greg Berlanti, Harassment, Supergirl, the CW, The Flash", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Flash’ & ‘Supergirl’ EP Andrew Kreisberg Fired Over Sexual Harassment Allegations", "url": "https://deadline.com/2017/11/flash-supergirl-ep-andrew-kreisberg-fired-sexual-harassment-allegations-1202216549/", "description": "Less than three weeks after Andrew Kreisberg, co-creator/executive producer of the CW’s DC series The Flash, Supergirl, Legends of Tomorrow and Arrow, was suspended from his duties over alleg…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/11/andrew-kreisberg-2015.jpg?w=1024", "width": 1200, "height": 712, "alt": "Andrew Kreisberg"}, "locale": "en_US"}, "article": {"published_time": "2017-11-29T18:00:42+00:00", "modified_time": "2017-11-29T20:41:39+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘Flash’ & ‘Supergirl’ EP Andrew Kreisberg Fired Over Sexual Harassment Allegations"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/11/andrew-kreisberg-2015.jpg?w=1024", "alt": "Andrew Kreisberg"}, "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘Flash’ & ‘Supergirl’ EP Andrew Kreisberg Fired Over Sexual Harassment Allegations", "description": "Andrew Kreisberg, co-creator of the CW's The Flash, Supergirl, Legends of Tomorrow and Arrow, was fired after a sexual harassment probe."}, "author": "Nellie Andreeva", "content_type": "Article", "post_id": 1202216549, "title": "'Flash' & 'Supergirl' EP Andrew Kreisberg Fired Over Sexual Harassment Allegations", "published_at": "2017-11-29 10:00:42", "image": "https://pmcdeadline2.files.wordpress.com/2017/11/andrew-kreisberg-2015.jpg?w=296&h=166&crop=1", "comment_count": 33, "tags": "The Flash", "topics": "TV", "body": "Less than three weeks after Andrew Kreisberg, co-creator/executive producer of the CW's DC series The Flash, Supergirl, Legends of Tomorrow and Arrow, was suspended from his duties over allegations of sexual harassment, he has been fired by the studio, Warner Bros TV Group, following an investigation into the accusations.\r\n\r\n\"After a thorough investigation, Warner Bros Television Group has terminated Andrew Kreisberg’s employment, effective immediately,\" the company said in a statement. \"We remain committed to providing a safe working environment for our employees and everyone involved in our productions.\"\r\n\r\n\r\n\r\nKreisberg has been one of the top lieutenants of Greg Berlanti, architect of the CW DC universe, whose company Berlanti Prods. produces all series. Kreisberg had been hands-on involved in The Flash and Supergirl, serving as co-showrunner on both. Following his exit, Berlanti, co-creator/exec producer of the two series, will step in for him, assuming additional responsibilities on both The Flash, where he will work closely with executive producer/co-showrunner Todd Helbing, and Supergirl, where he will work closely with executive producers/co-showrunners Robert Rovner and Jessica Queller.\r\n\r\n\"Warner Bros Television Group recently concluded its investigation into the allegations against Andrew Kreisberg,\" Berlanti Prods.' Berlanti and Sarah Schechter said in a statement. \"We encouraged and supported this investigation, we believe and support the individuals who came forward, and we agree with the studio’s decision. Nothing is more important to us than the safety and well-being of all our colleagues — coworkers, crew and staff alike.\"\r\n\r\nAs Deadline previously reported, a number of staffers on The Flash and other DC series had complained about Kreisberg’s behavior. On at least one occasion, Kreisberg had interacted with a young female writer on The Flash early in the show’s run in a manner that was described as “inappropriate” and creating “a hostile work environment,” according to a source close to the situation. There had been specific allegations about Kreisberg from at least one other woman. In that case, a director who helmed episodes of Arrow and The Flash, had also complained of similar inappropriate behavior by the executive producer.\r\n\r\nFollowing Kreisberg's suspension, actors from the CW DC series, including Supergirl and The Flash stars Melissa Benoist and Grant Gustin, spoke out against sexual harassment and in support of the victims.\r\n\r\nMeanwhile, E! and Lionsgate TV recently suspended The Royals showrunner Mark Schwahn over sexual harassment allegations by cast and crew members of both his previous show, One Tree Hill, and The Royals.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1511978442.0, "source": "https://deadline.com", "summary": ""}