{"url": "https://www.cheatsheet.com/entertainment/how-are-tarek-and-christina-el-moussa-sharing-custody-of-their-children-after-divorce.html/", "text": "Tarek and Christina are divorced and working out co-parenting | Tarek and Christina are divorced and working out co-parenting | Christina El Moussa via Instagram\n\nTarek and Christina El Moussa appeared on television screens in 2013. They star in HGTV’s Flip or Flop, a television show that follows the pair as they buy homes that are in desperate need of some TLC. Together they renovate the homes and place them back on the market. While the public first met Tarek and Christina in 2013, they married in 2009. They soon welcomed their first child, Taylor, in 2010. Braden, the couple’s first son, was born in 2015.\n\nWhile Tarek and Christina’s star was on the rise, the couple was quietly having personal problems. They split in 2016 after police were called to the couple’s home after an argument. Tarek officially filed for divorce in January of 2017. The couple’s divorce was finalized in May of 2018, and a custody agreement is currently in place for the couple’s two children.\n\nTarek now resides in a home in Costa Mesa, California, while Christina has since purchased a home in Newport Beach, California. Tarek and Christina quickly sold their marital home in Yorba Linda, California, before the final divorce decree.\n\nWhat is the custody agreement between Christina and Tarek El Moussa ?\n\nWhile Tarek and Christina originally separated in 2016 after 7 years of marriage, their divorce was not finalized until January of 2018. The couple asked that the financials of their settlement be kept private, but the custody agreement the pair hammered out is public record. According to their official divorce documents, Christina and Tarek will share joint physical and legal custody of their two children, Taylor and Braden.\n\nAccording to the agreement, Tarek will care for the children from Wednesday from 3 pm until Saturday at 5 pm. Christina will have custody of the two from Saturday at 5 pm until Wednesday when they go to school. During the summer months, when school is not in session, Tarek will pick up the youngsters at noon on Wednesdays.\n\nThe co-parents have also agreed to work together to accommodate their work schedules. Because of the nature of their business, they’ve decided to swap custody when one parent or the other needs to travel for work. They have also agreed to work together to make up for missed parent time due to work-related commitments.\n\nAn odd addition to the custody agreement hints at problems between the former pair and family members\n\nWhile the majority of the custody agreement between the pair seems pretty standard, an added stipulation hints at a potential problem between the co-parents. According to official documents, both Christina and Tarek have been banned from speaking negatively about each other.\n\nThe decree goes on to state that the co-parents must also remove the children from any person or situation where the other co-parent is being spoken of disparagingly. The decree highlights that the stipulation includes friends, family and current or future significant others.\n\nThis type of stipulation is not standard, but they are not completely unheard of. A “non-disparagement clause” is most commonly seen in bitter divorces were parents plan to share custody of the children. The goal of such a clause is to foster a relationship between the child and both parents, as it prevents the parents from talking disparagingly about each other, leading to the estrangement of the child-parent relationship.\n\nChristina and Tarek’s working relationship\n\nWhile Christina and Tarek have ended their romantic relationship, the pair still has a working relationship. During the split, the pair’s show on HGTV, Flip or Flop, went on hiatus but has since returned. Recently, HGTV announced that the pair would once again reprise their roles for 20 more episodes. Additionally, they share a construction business and still have shared real estate ventures. Christina has also signed on with HGTV for a new show that will feature her design business and her new home.", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png", "keywords": [], "authors": ["Lena Coeman"], "canonical_link": "https://www.cheatsheet.com/entertainment/how-are-tarek-and-christina-el-moussa-sharing-custody-of-their-children-after-divorce.html/", "title": "How Are Tarek and Christina El Moussa Sharing Custody of Their Children After Divorce?", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/how-are-tarek-and-christina-el-moussa-sharing-custody-of-their-children-after-divorce.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Do Tarek and Christina El Moussa have a custody agreement now that their divorce is final?", "og": {"locale": "en_US", "type": "article", "title": "How Are Tarek and Christina El Moussa Sharing Custody of Their Children After Divorce?", "description": "Do Tarek and Christina El Moussa have a custody agreement now that their divorce is final?", "url": "https://www.cheatsheet.com/entertainment/how-are-tarek-and-christina-el-moussa-sharing-custody-of-their-children-after-divorce.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-12-07T19:56:08-05:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Tarek El Moussa", "section": "Entertainment", "published_time": "2018-12-07T20:12:13-05:00", "modified_time": "2018-12-07T19:56:08-05:00"}, "twitter": {"card": "summary_large_image", "description": "Do Tarek and Christina El Moussa have a custody agreement now that their divorce is final?", "title": "How Are Tarek and Christina El Moussa Sharing Custody of Their Children After Divorce?", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/05/Tarek-El-Moussa-and-Christina.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1544231533.0, "source": "https://www.cheatsheet.com", "summary": ""}