{"url": "https://www.vanityfair.com/hollywood/2018/05/greys-anatomy-season-14-finale-recap-april-married-arizona-callie-sarah-drew-jessica-capshaw", "text": "This post contains spoilers for Grey’s Anatomy Season 14, Episode 24, “All of Me.”\n\nLove was clearly in the air in Seattle on Thursday night—at least, it was in the world of Grey’s Anatomy. The show’s typically emotional season finale ended up celebrating three weddings, two of which belonged to characters we’ve known and loved for years. Fans were already aware that Jo and Alex would be tying the knot this week, but in a surprise twist, April also wound up getting hitched to Matthew—and thankfully, this time she didn’t flee the wedding.\n\nIt was a sweet ending for actress Sarah Drew, who is leaving the show after nearly a decade of playing Dr. Kepner. Also on her way out? Jessica Capshaw, who has played Arizona Robbins since Season 5. Arizona got a similarly loving farewell, as she moved to New York to be closer to her daughter, Sofia, and her currently single ex-wife, Callie Torres (Sara Ramirez, who left the show in 2016). Grey’s Anatomy fans know how cruel this writers’ room can be, even to longtime cast members—just ask Patrick Dempsey—so it was a relief to see both April and Arizona make it out unscathed, even if April in particular has had a rough season.\n\nWhen news first broke that both Drew and Capshaw would be saying goodbye to the series—apparently not by choice—one report speculated that their write-offs could have something to do with co-star Ellen Pompeo’s $20 million salary, a notion the actress quickly denied. Either way, the goodbyes were always going to be tough. Both actresses were given boxes filled with letters from the cast and crew on their last day of filming—a well-earned token to two actresses who have been with the show for so many years.\n\nAfter a day of traumatic losses earlier this season, April struggled with a severe loss of faith—a devastating turn for the longtime devout Christian. Toward the season’s latter half, however, things started to turn around. April reconnected with her ex-fiancé, Matthew, whom she left at the altar to be with Jackson in Season 10. (Matthew had since re-married, but lost his wife during the birth of their baby, Ruby, who survived.) Soon enough, things once again took a dark turn, as they are wont to do on this hospital drama: April nearly died in a car accident—an experience that led her to quit her job as a trauma surgeon at Grey Sloan Memorial Hospital to instead, as we learned this week, work with homeless communities.\n\nThankfully, as April’s story wrapped up, the Grey’s writers decided to send Drew off on a high note: after Alex and Jo’s wedding ceremony fell apart, Matthew spontaneously proposed to April. The minister, who had gotten lost on her way to the venue, arrived just in time to marry the happy couple—with Arizona, Jackson, and Sofia serving as witnesses. (Don’t worry: Jo and Alex still had a ceremony of their own, with a newly ordained Meredith officiating on the Seattle ferry, the maritime mascot of this series.) It seems a little implausible that Matthew would want the man April previously left him for standing right there at his wedding, but given that Jackson is the father of April’s own child, Harriet, perhaps there’s no time like the present to practice some blended-family bonding.\n\nAnd speaking of Arizona . . .\n\nIt looks like things might be looking up in the romance department for Capshaw’s character as well—although her reconciliation with her ex-wife will have to take place off-screen. Callie and Arizona broke up years ago, following a heartbreaking struggle to stay together after Arizona cheated on Callie with a visiting doctor. Eventually, Callie moved to New York to be with her new girlfriend, Penny, who got a job at a hospital there—taking her and Arizona’s daughter, Sofia, with her. Now, however, she and Arizona are both single—and as Arizona revealed to April and Richard at the wedding, she smiles every time she and Callie talk. As Arizona and Sofia fly off to New York, fans who never accepted the Arizona-Callie breakup can rest easy, filling in the blanks for themselves and imagining a well-deserved happy ending for both.\n\nGrey’s Anatomy has killed off plenty of deeply loved characters in creative and excruciating ways, including George O’Malley, Lexie Grey, Mark Sloan, and Derek Shepherd. But in its most recent seasons, the series has been more reluctant to kill off members of its cast—as evidenced by the gentle write-off given to Jerrika Hinton’s character, Stephanie Edwards, in the Season 13 finale. Though she almost died, in the end, Edwards found her direction in life and realized she didn’t want to be a doctor anymore. She left Grey Sloan to explore what her life could be like outside a hospital. April and Arizona’s departures also suggest that the series is backing away from gruesome, heartrending deaths in favor of kinder farewells—at least for now. Then again, that will only make the next big death all the more shocking.", "images": ["https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5ab3c7b6afb7596b1f1a01a7/1:1/w_350%2Ch_350%2Cc_limit/Ellen-Pompeo.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5a4474fd577ffb294a2534d9/master/w_1600%2Cc_limit/EOY-Best-TV-Shows-Movies-SS02.jpg", "https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/master/w_2560%2Cc_limit/Greys-Anatomy-Spoilers.jpg", "https://media.vanityfair.com/photos/5a4470e28ae8fd2b3a999df0/master/w_1600%2Cc_limit/EOY-Best-TV-Shows-Movies-SS01.jpg", "https://media.vanityfair.com/photos/5a4474fef3c68c7e92305270/master/w_1600%2Cc_limit/EOY-Best-TV-Shows-Movies-SS03.jpg", "https://media.vanityfair.com/photos/5ac764f650f03623a724a200/1:1/w_350%2Ch_350%2Cc_limit/sandra-oh-interview-justin-bishop.jpg", "https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/16:9/w_1280,c_limit/Greys-Anatomy-Spoilers.jpg", "https://media.vanityfair.com/photos/5aa1ca643d66d376a0f1e848/1:1/w_350%2Ch_350%2Cc_limit/Ellen-Pompeo-Greys-Paycheck.jpg"], "top_img": "https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/16:9/w_1280,c_limit/Greys-Anatomy-Spoilers.jpg", "keywords": [], "authors": ["Laura Bradley", "Laura Bradle", "Yohana Dest", "Julie Mille"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/05/greys-anatomy-season-14-finale-recap-april-married-arizona-callie-sarah-drew-jessica-capshaw", "title": "Grey’s Anatomy Said a Loving Goodbye to Sarah Drew and Jessica Capshaw", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Laura Bradley", "copyright": "Copyright (c) Condé Nast 2020", "description": "Though the series has bid farewell to some of its most beloved characters with brutal deaths in the past, it dreamed up much sweeter endings for April and Arizona.", "id": "5afec22500a4b452371c212b", "keywords": "television,greys anatomy", "news_keywords": "television,greys anatomy", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5afec22500a4b452371c212b", "parsely-metadata": "{\"description\":\"Though the series has bid farewell to some of its most beloved characters with brutal deaths in the past, it dreamed up much sweeter endings for April and Arizona.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/16:9/w_1000,c_limit/Greys-Anatomy-Spoilers.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/1:1/w_1000,c_limit/Greys-Anatomy-Spoilers.jpg\"}", "og": {"description": "Though the series has bid farewell to some of its most beloved characters with brutal deaths in the past, it dreamed up much sweeter endings for April and Arizona.", "image": "https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/16:9/w_1280,c_limit/Greys-Anatomy-Spoilers.jpg", "site_name": "Vanity Fair", "title": "Grey’s Anatomy Said a Loving Goodbye to Sarah Drew and Jessica Capshaw", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/05/greys-anatomy-season-14-finale-recap-april-married-arizona-callie-sarah-drew-jessica-capshaw"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Though the series has bid farewell to some of its most beloved characters with brutal deaths in the past, it dreamed up much sweeter endings for April and Arizona.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5afecec3598a61507cadd84d/16:9/w_1280,c_limit/Greys-Anatomy-Spoilers.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Grey’s Anatomy Said a Loving Goodbye to Sarah Drew and Jessica Capshaw"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}