{"url": "https://web.archive.org/web/20091023061615/http://www.foxnews.com/politics/2009/10/21/raw-data-dick-cheneys-remarks-center-security-policy", "text": "Home / President\n\nFOXNews.com\n\nThe following is a transcript of former Vice President Dick Cheney's remarks at the Center for Security Policy:\n\nThank you all very much. It's a pleasure to be here, and especially to receive the Keeper of the Flame Award in the company of so many good friends.\n\nI'm told that among those you've recognized before me was my friend Don Rumsfeld. I don't mind that a bit. It fits something of a pattern. In a career that includes being chief of staff, congressman, and secretary of defense, I haven't had much that Don didn't get first. But truth be told, any award once conferred on Donald Rumsfeld carries extra luster, and I am very proud to see my name added to such a distinguished list.\n\nTo Frank Gaffney and all the supporters of Center for Security Policy, I thank you for this honor. And I thank you for the great energy and high intelligence you bring to as vital a cause as there is - the advance of freedom and the uncompromising defense of the United States.\n\nMost anyone who is given responsibility in matters of national security quickly comes to appreciate the commitments and structures put in place by others who came before. You deploy a military force that was planned and funded by your predecessors. You inherit relationships with partners and obligations to allies that were first undertaken years and even generations earlier. With the authority you hold for a little while, you have great freedom of action. And whatever course you follow, the essential thing is always to keep commitments, and to leave no doubts about the credibility of your country's word.\n\nSo among my other concerns about the drift of events under the present administration, I consider the abandonment of missile defense in Eastern Europe to be a strategic blunder and a breach of good faith.\n\nIt is certainly not a model of diplomacy when the leaders of Poland and the Czech Republic are informed of such a decision at the last minute in midnight phone calls. It took a long time and lot of political courage in those countries to arrange for our interceptor system in Poland and the radar system in the Czech Republic. Our Polish and Czech friends are entitled to wonder how strategic plans and promises years in the making could be dissolved, just like that - with apparently little, if any, consultation. Seventy years to the day after the Soviets invaded Poland, it was an odd way to mark the occasion.\n\nYou hardly have to go back to 1939 to understand why these countries desire - and thought they had - a close and trusting relationship with the United States. Only last year, the Russian Army moved into Georgia, under the orders of a man who regards the collapse of the Soviet Union as the greatest geopolitical disaster of the 20th century. Anybody who has spent much time in that part of the world knows what Vladimir Putin is up to. And those who try placating him, by conceding ground and accommodating his wishes, will get nothing in return but more trouble.\n\nWhat did the Obama Administration get from Russia for its abandonment of Poland and the Czech Republic, and for its famous \"Reset\" button? Another deeply flawed election and continued Russian opposition to sanctioning Iran for its pursuit of nuclear weapons.\n\nIn the short of it, President Obama's cancellation of America's agreements with the Polish and Czech governments was a serious blow to the hopes and aspirations of millions of Europeans. For twenty years, these peoples have done nothing but strive to move closer to us, and to gain the opportunities and security that America offered. These are faithful friends and NATO allies, and they deserve better. The impact of making two NATO allies walk the plank won't be felt only in Europe. Our friends throughout the world are watching and wondering whether America will abandon them as well.\n\nBig events turn on the credibility of the United States - doing what we said we would do, and always defending our fundamental security interests. In that category belong the ongoing missions in Iraq and Afghanistan, and the need to counter the nuclear ambitions of the current regime in Iran.\n\nCandidate Obama declared last year that he would be willing to sit down with Iran's leader without preconditions. As President, he has\n\ncommitted America to an Iran strategy that seems to treat engagement as an objective rather than a tactic. Time and time again, he has outstretched his hand to the Islamic Republic's authoritarian leaders, and all the while Iran has continued to provide lethal support to extremists and terrorists who are killing American soldiers in Iraq and Afghanistan. The Islamic Republic continues to provide support to extremists in Syria, Lebanon, and the Palestinian territories. Meanwhile, the regime continues to spin centrifuges and test missiles. And these are just the activities we know about.\n\nI have long been skeptical of engagement with the current regime in\n\nTehran, but even Iran experts who previously advocated for engagement have changed their tune since the rigged elections this past June and the brutal suppression of Iran's democratic protestors. The administration clearly missed an opportunity to stand with Iran's\n\ndemocrats, whose popular protests represent the greatest challenge to the Islamic Republic since its founding in 1979. Instead, the\n\nPresident has been largely silent about the violent crackdown on Iran's protestors, and has moved blindly forward to engage Iran's authoritarian regime. Unless the Islamic Republic fears real consequences from the United States and the international community, it is hard to see how diplomacy will work.\n\nNext door in Iraq, it is vitally important that President Obama, in his rush to withdraw troops, not undermine the progress we've made in recent years. Prime Minister Maliki met yesterday with\n\nPresident Obama, who began his press availability with an extended\n\ncomment about Afghanistan. When he finally got around to talking\n\nabout Iraq, he told the media that he reiterated to Maliki his\n\nintention to remove all U.S. troops from Iraq. Former President\n\nBush's bold decision to change strategy in Iraq and surge U.S. forces there set the stage for success in that country. Iraq has the potential to be a strong, democratic ally in the war on terrorism, and an example of economic and democratic reform in the heart of the Middle East. The Obama Administration has an obligation to protect this young democracy and build on the strategic success we have achieved in Iraq.\n\nWe should all be concerned as well with the direction of policy on Afghanistan. For quite a while, the cause of our military in that country went pretty much unquestioned, even on the left. The effort was routinely praised by way of contrast to Iraq, which many wrote off as a failure until the surge proved them wrong. Now suddenly - and despite our success in Iraq - we're hearing a drumbeat of defeatism over Afghanistan. These criticisms carry the same air of hopelessness, they offer the same short-sighted arguments for walking away, and they should be summarily rejected for the same reasons of national security.\n\nHaving announced his Afghanistan strategy last March, President Obama now seems afraid to make a decision, and unable to provide his commander on the ground with the troops he needs to complete his mission.\n\nPresident Obama has said he understands the stakes for America. When he announced his new strategy he couched the need to succeed in the starkest possible terms, saying, quote, \"If the Afghan government falls to the Taliban - or allows al-Qaeda to go unchallenged - that country will again be a base for terrorists who want to kill as many of our people as they possibly can.\" End quote.\n\nFive months later, in August of this year, speaking at the VFW, the President made a promise to America's armed forces. \"I will give you a clear mission,\" he said, \"defined goals, and the equipment and support you need to get the job done. That's my commitment to you.\"\n\nIt's time for President Obama to make good on his promise. The White House must stop dithering while America's armed forces are in danger.\n\nMake no mistake, signals of indecision out of Washington hurt our allies and embolden our adversaries. Waffling, while our troops on the ground face an emboldened enemy, endangers them and hurts our cause.\n\nRecently, President Obama's advisors have decided that it's easier to blame the Bush Administration than support our troops. This weekend they leveled a charge that cannot go unanswered. The President's chief of staff claimed that the Bush Administration hadn't asked any tough questions about Afghanistan, and he complained that the Obama Administration had to start from scratch to put together a strategy.\n\nIn the fall of 2008, fully aware of the need to meet new challenges being posed by the Taliban, we dug into every aspect of Afghanistan policy, assembling a team that traveled to Pakistan and Afghanistan, reviewing options and recommendations, and briefing President-elect Obama's team. They asked us not to announce our findings publicly, and we agreed, giving them the benefit of our work and the benefit of the doubt. The new strategy they embraced in March, with a focus on counterinsurgency and an increase in the numbers of troops, bears a striking resemblance to the strategy we passed to them. They made a decision - a good one, I think - and sent a commander into the field to implement it.\n\nNow they seem to be pulling back and blaming others for their failure to implement the strategy they embraced. It's time for President Obama to do what it takes to win a war he has repeatedly and rightly called a war of necessity.\n\nIt's worth recalling that we were engaged in Afghanistan in the 1980's, supporting the Mujahadeen against the Soviets. That was a successful policy, but then we pretty much put Afghanistan out of our minds. While no one was watching, what followed was a civil war, the takeover by the Taliban, and the rise of bin Laden and al-Qaeda. All of that set in motion the events of 9/11. When we deployed forces eight years ago this month, it was to make sure Afghanistan would never again be a training ground for the killing of Americans. Saving untold thousands of lives is still the business at hand in this fight. And the success of our mission in Afghanistan is not only essential, it is entirely achievable with enough troops and enough political courage.\n\nThen there's the matter of how to handle the terrorists we capture in this ongoing war. Some of them know things that, if shared, can save a good many innocent lives. When we faced that problem in the days and years after 9/11, we made some basic decisions. We understood that organized terrorism is not just a law-enforcement issue, but a strategic threat to the United States.\n\nAt every turn, we understood as well that the safety of the country required collecting information known only to the worst of the terrorists. We had a lot of blind spots - and that's an awful thing, especially in wartime. With many thousands of lives potentially in the balance, we didn't think it made sense to let the terrorists answer questions in their own good time, if they answered them at all.\n\nThe intelligence professionals who got the answers we needed from terrorists had limited time, limited options, and careful legal guidance. They got the baddest actors we picked up to reveal things they really didn't want to share. In the case of Khalid Sheik Muhammed, by the time it was over he was not was not only talking, he was practically conducting a seminar, complete with chalkboards and charts. It turned out he had a professorial side, and our guys didn't mind at all if classes ran long. At some point, the mastermind of 9/11 became an expansive briefer on the operations and plans of al-Qaeda. It happened in the course of enhanced interrogations. All the evidence, and common sense as well, tells us why he started to talk.\n\nThe debate over intelligence gathering in the seven years after 9/11 involves much more than historical accuracy. What we're really debating are the means and resolve to protect this country over the next few years, and long after that. Terrorists and their state sponsors must be held accountable, and America must remain on the offensive against them. We got it right after 9/11. And our government needs to keep getting it right, year after year, president after president, until the danger is finally overcome.\n\nOur administration always faced its share of criticism, and from some quarters it was always intense. That was especially so in the later years of our term, when the dangers were as serious as ever, but the sense of general alarm after 9/11 was a fading memory. Part of our responsibility, as we saw it, was not to forget the terrible harm that had been done to America … and not to let 9/11 become the prelude to something much bigger and far worse.\n\nEight years into the effort, one thing we know is that the enemy has spent most of this time on the defensive - and every attempt to strike inside the United States has failed. So you would think that our successors would be going to the intelligence community saying, \"How did you did you do it? What were the keys to preventing another attack over that period of time?\"\n\nInstead, they've chosen a different path entirely - giving in to the angry left, slandering people who did a hard job well, and demagoguing an issue more serious than any other they'll face in these four years. No one knows just where that path will lead, but I can promise you this: There will always be plenty of us willing to stand up for the policies and the people that have kept this country safe.\n\nOn the political left, it will still be asserted that tough interrogations did no good, because this is an article of faith for them, and actual evidence is unwelcome and disregarded. President Obama himself has ruled these methods out, and when he last addressed the subject he filled the air with vague and useless platitudes. His preferred device is to suggest that we could have gotten the same information by other means. We're invited to think so. But this ignores the hard, inconvenient truth that we did try other means and techniques to elicit information from Khalid Sheikh Muhammed and other al-Qaeda operatives, only turning to enhanced techniques when we failed to produce the actionable intelligence we knew they were withholding. In fact, our intelligence professionals, in urgent circumstances with the highest of stakes, obtained specific information, prevented specific attacks, and saved American lives.\n\nIn short, to call enhanced interrogation a program of torture is not only to disregard the program's legal underpinnings and safeguards. Such accusations are a libel against dedicated professionals who acted honorably and well, in our country's name and in our country's cause. What's more, to completely rule out enhanced interrogation in the future, in favor of half-measures, is unwise in the extreme. In the fight against terrorism, there is no middle ground, and half-measures keep you half exposed.\n\nFor all that we've lost in this conflict, the United States has never lost its moral bearings - and least of all can that be said of our armed forces and intelligence personnel. They have done right, they have made our country safer, and a lot of Americans are alive today because of them.\n\nLast January 20th, our successors in office were given the highest honors that the voters of this country can give any two citizens. Along with that, George W. Bush and I handed the new president and vice president both a record of success in the war on terror, and the policies to continue that record and ultimately prevail. We had been the decision makers, but those seven years, four months, and nine days without another 9/11 or worse, were a combined achievement: a credit to all who serve in the defense of America, including some of the finest people I've ever met.\n\nWhat the present administration does with those policies is their call to make, and will become a measure of their own record. But I will tell you straight that I am not encouraged when intelligence officers who acted in the service of this country find themselves hounded with a zeal that should be reserved for America's enemies. And it certainly is not a good sign when the Justice Department is set on a political mission to discredit, disbar, or otherwise persecute the very people who helped protect our nation in the years after 9/11.\n\nThere are policy differences, and then there are affronts that have to be answered every time without equivocation, and this is one of them. We cannot protect this country by putting politics over security, and turning the guns on our own guys.\n\nWe cannot hope to win a war by talking down our country and those who do its hardest work - the men and women of our military and intelligence services. They are, after all, the true keepers of the flame.\n\nThank you very much.", "images": ["https://web.archive.org/web/20091023084657im_/http://www.foxnews.com/politics/img/favicon.ico", "https://web.archive.org/web/20091023084657im_/http://www.foxnews.com/politics/img/close.gif"], "top_img": "https://web.archive.org/web/20091023084657im_/http://www.foxnews.com/politics/img/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "RAW DATA: Dick Cheney's Remarks to the Center for Security Policy", "meta_data": {"description": "In his remarks, Dick Cheney states that the Bush administration launched a detailed Afghanistan policy review in the final months of the Bush administration but didn't release the details at the request of the Obama team.", "title": "RAW DATA: Dick Cheney's Remarks to the Center for Security Policy - Political News - FOXNews.com"}, "movies": [], "publish_date": 1256054400.0, "source": "https://web.archive.org", "summary": ""}