{"url": "https://web.archive.org/web/20180426092034/http://nrtonline.info/breaking-nancy-pelosi-to-resign-after-new-revelations/", "text": "Insiders in Senate Majority Leader Nancy Pelosi’s office tell the Army Times that there might be an open spot “as early as next week” following the bombshell allegations leveled at Pelosi this past week.\n\nWhile the mainstream media continues to ignore Pelosi’s scandals, Breitbart reported on Thursday that “at least five men and one woman have complained about Pelosi making unwanted advances in the past, but it always got swept under the rug.”\n\nAccording to the publication, two sources have confirmed that they were “incentivized” to transfer out of her office — one with a promotion and one with a lump sum cash payment of $15,000.\n\nAccording to insiders, Pelosi “has determined that she has no choice but to step down, though she wholeheartedly denies the allegations.”\n\nThree of Pelosi’s accusers, all male, are former interns and pages, while the others worked as a clerical aide and a member of the cleaning staff..\n\nPelosi has been attacking Roy Moore lately for his alleged consensual affair with a young woman, but was simply her covering up her own misdeeds with fake outrage.\n\nIt’s time for that old bat to retire anyway, but it’s good to see her go sooner rather than later. Now it’s time for a Republican to take her seat.", "images": ["https://web.archive.org/web/20180426092034im_/http://nrtonline.info/wp-content/uploads/2018/04/Untitled-35-678x381.jpg"], "top_img": "", "keywords": [], "authors": ["George Swenson"], "canonical_link": "https://web.archive.org/web/20180426092034/http://nrtonline.info/breaking-nancy-pelosi-to-resign-after-new-revelations/", "title": "BREAKING: Nancy Pelosi To Resign After New Revelations – NRTOnline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.5", "fb": {"pages": 589219961239603}, "ia": {"markup_url": "http://nrtonline.info/breaking-nancy-pelosi-to-resign-after-new-revelations/?ia_markup=1"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}