{"url": "http://time.com/5106664/mckayla-maroney-no-fine-usa-gymnastics/", "text": "USA Gymnastics will not pursue a monetary penalty from Olympic gymnast McKayla Maroney for speaking out about sexual abuse allegations.\n\nThe decision comes after model Chrissy Teigen and actress Kristen Bell offered to pay the $100,000 fine Maroney would face for discussing her sexual abuse.\n\nIn October, Maroney tweeted that she was sexually abused by Larry Nassar, the national team doctor. In her post, she said the abuse began when she was 13, and continued at national training camps as well as at international events, including at the 2012 Olympics in London, where Maroney earned a gold and silver.\n\nRead more: Who Is Larry Nassar, the Former USA Gymnastics Doctor Aly Raisman Accuses of Sexual Abuse?\n\nIn a lawsuit Maroney filed against USA Gymnastics and Nassar in December 2016, Maroney says that she signed a confidential non- disclosure agreement with USA Gymnastics in which she agreed not to publicly discuss the abuse allegations; doing so would result in a reported $100,000 fine. In return, USA Gymnastics paid Maroney and her family a $1.25 million settlement.\n\nNassar is currently being sentenced in a Michigan court on counts of first degree sexual assault; dozens of his victims are testifying over several days at the sentencing hearing.\n\nRead more: Lawyer for Olympic Gymnasts: NDAs Allow Sexual Abuse to Fester\n\nIn a statement posted Tuesday, USA Gymnastics said: “USA Gymnastics has not sought and will not seek any money from McKayla Maroney for her brave statements made in describing her victimization and abuse by Larry Nassar, nor for any victim impact statements she wants to make to Larry Nassar at this hearing or at any subsequent hearings related to his sentencing. This has been her right and USA Gymnastics encourages McKayla and anyone who has been abused to speak out. USA Gymnastics remains focused on our highest priority — the safety, health and well-being of our athletes and creating a culture that empowers and supports them.”\n\nMaroney’s lawyer, John Manly, said in response that “USA Gymnastics finally acknowledges that the gag order they forced on Ms. Maroney and her attorney was unenforceable.” He also notes that “The only reason this statement was issued is because people were outraged by USAG’s behavior toward Ms. Maroney and her family. So outraged that people were kindly offering to pay the six figure USAG penalty so McKayla could speak. Everyday Americans get that no one should be silenced about child molestation. They have no choice but to relent because the cleansing sunlight of truth is shining upon them and they can no longer hide their misdeeds.”\n\nWhile USA Gymnastics has voiced its support of McKayla and her Olympic and national teammates who have also said they were abused by Nassar, including Simone Biles, Gabby Douglas, Aly Raisman and Maggie Nichols, the organization in December also filed a request to dismiss the lawsuits in which they are named, saying that “while Nassar is liable to the plaintiffs, USAG is not.” The group also said that “Most of the plaintiffs failed to timely assert their claims, and, therefore, their claims are time-barred.”\n\nNassar has already been sentenced to 60 years in federal prison on charges of possession of child pornography. He pleaded guilty to more sexual assault charges in a second Michigan county and will be sentenced for those charges later in January.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/03/AP20083363170829.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2020/04/tokyo-olympic-2021-coronavirus.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Alice Park"], "canonical_link": "https://time.com/5106664/mckayla-maroney-no-fine-usa-gymnastics/", "title": "McKayla Maroney Won't Be Fined for Speaking Out About Sexual Abuse, USA Gymnastics Says", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "gymnastics sexual abuse, gymnastics, gymnastics team doctor sexual abuse, simone biles sexual abuse, aly raisman sexual abuse, mckayla maroney sexual abuse, larry nassar sexual abuse", "news_keywords": "gymnastics sexual abuse, gymnastics, gymnastics team doctor sexual abuse, simone biles sexual abuse, aly raisman sexual abuse, mckayla maroney sexual abuse, larry nassar sexual abuse, usa gymnastics", "description": "USA Gymnastics said it will not fine the gymnast who spoke out about being abused by Dr. Larry Nassar.", "og": {"title": "McKayla Maroney Won't Be Fined for Speaking Out About Sexual Abuse, USA Gymnastics Says", "type": "article", "site_name": "Time", "url": "https://time.com/5106664/mckayla-maroney-no-fine-usa-gymnastics/", "description": "Maroney had signed a non-disclosure agreement", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5106664/mckayla-maroney-no-fine-usa-gymnastics/", "description": "USA Gymnastics said it will not fine the gymnast who spoke out about being abused by Dr. Larry Nassar.", "media": "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5106664/mckayla-maroney-no-fine-usa-gymnastics/", "title": "McKayla Maroney Won't Be Fined for Speaking Out About Sexual Abuse, USA Gymnastics Says", "description": "Maroney had signed a non-disclosure agreement", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/01/gettyimages-182931758.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}