{"url": "https://web.archive.org/web/20031219165126/http://en.wikipedia.org:80/wiki/Tiger_Woods", "text": "Tiger Woods\n\nFrom Wikipedia, the free encyclopedia.\n\nEldrick 'Tiger' Woods (born December 30, 1975), son of Earl and Kultida Woods, is considered one of the greatest golfers of all time. As of July 2002, at only 26 years of age, Woods had already won 8 \"major\" tour events on the PGA Tour. He is one of only five players (along with Gene Sarazen, Ben Hogan, Jack Nicklaus and Gary Player) in the history of golf to win all four professional major championships in a career. With his victory in The Masters in 2001, he became the only man to have held all four professional majors at once, although this did not occur in a calendar year, and is therefore not recognized by some as a true \"Grand Slam\". Before joining the PGA Tour, Woods won three consecutive United States Junior Amateur titles, followed by three consecutive United States Amateur titles. With his first US Amateur win in 1994, he became the youngest man ever to win that event. He also won one NCAA individual championship while studying at Stanford University.\n\nWoods' major tournament victories are as follows:\n\nWoods has an excellent all-around game. He is one of the longer drivers on the tour (12th place in 2003), with a driving distance average of 300.2 so far in 2003. He is also one of the best putters, at 19th place in putts per round so far in 2003. At the 2003 TOUR Championship, he set an all-time record for most consecutive cuts made, with 114. The next player is Ernie Els with 26 consecutive cuts.\n\nWoods, who has African-American, Asian, Native American, and Caucasian ancestors, is credited with prompting a major surge of interest in the game of golf, especially among minorities and younger people in the United States. His father Earl Woods, an African American, is a Vietnam War veteran and a retired U.S. Army lieutenant colonel. His mother Kultida Woods is Asian-American.", "images": ["https://web.archive.org/web/20031219165126im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20031219165126im_/http://en.wikipedia.org/upload/wiki.png"], "top_img": "https://web.archive.org/web/20031219165126im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Tiger Woods", "meta_data": {"robots": "index,follow"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}