{"url": "https://www.cheatsheet.com/entertainment/how-jennifer-lopez-and-alex-rodriguez-first-met-is-a-funny-story.html/", "text": "When it comes to Hollywood power couples, Jennifer Lopez and Alex Rodriguez are just perfection. The sultry singer/actress and the baseball legend have been in and out of the same circles for years but only connected on a romantic level in 2016. Since then, the couple has shared the sweetest photographs and messages of one another, and they even did an incredible interview together for Vanity Fair in the fall of 2017.\n\nStil, there is one thing the stunning duo can’t seem to agree on, and that’s how they met. It turns out it’s a pretty funny story.\n\nAn intriguing first date\n\nRodriguez was apparently very talkative on their first date. | Jean Baptiste Lacroix/Getty Images Rodriguez was apparently very talkative on their first date. | Jean Baptiste Lacroix/Getty Images\n\nThough A-Rod and J.Lo had known each other in passing, their initial first date brought out a different side of the couple, especially Rodriguez. On their first date, the pair found themselves at dinner, though the former Yankee wasn’t actually sure it was a date at the time.\n\nLopez explained to Vanity Fair,\n\nHe was sitting there in his white shirt, very confident and manly, but then he was just so talkative! I think he thought I was going to be this loud person, but I’m not. I just listen. So he’s talking, talking about his plans, about how he had just retired from baseball, about how he saw himself getting married again, all these things you wouldn’t normally talk about on a first date. I don’t know if he thought it was a date. I thought it was a date. Then I knew he was nervous because he asked me if I wanted a drink. I said, “No, I don’t drink,” and he asked if I minded if he had one. He was nervous, and it was really cute.\n\nNext: Lopez’s relationship requirement\n\nThe way to her heart\n\nHe knows answering her phone calls is a top priority. | Jean-Baptiste Lacroix/AFP/Getty Images He knows answering her phone calls is a top priority. | Jean-Baptiste Lacroix/AFP/Getty Images\n\nObviously, with a Las Vegas residency, a couple of TV shows, motherhood, and a ton of other things on her plate, Lopez will only make time for someone who is serious about her. According to Rodriguez, there is one way to the “Jenny from the Block” songstress’ heart, and that is answering her phone calls.\n\nOn The Ellen DeGeneres Show, he explained, “If she calls me and I don’t pick up, forget it. I’ve been in board meetings and (said), “Time out, board. You got to answer her call.”\n\nNext: Taking their time\n\nTaking it one day at a time\n\nThe two see a future together.| Dia Dipasupil/Getty Images The two see a future together.| Dia Dipasupil/Getty Images\n\nRodriguez and Lopez are obviously enjoying one another. They are blending their families, attending events, and ignoring cheating rumors. However, they are not trying to rush things.\n\nIn 2017, a source close to the couple explained to US Weekly, “They’ve been talking about the future and, of course, marriage has come up. They aren’t making wedding plans, but they have been talking about their lives.”\n\nNext: A big step towards forever\n\nSealing the deal\n\nThe two just purchased a luxurious Manhattan condo. | Evans Vestal Ward /Getty Images The two just purchased a luxurious Manhattan condo. | Evans Vestal Ward /Getty Images\n\nThough Lopez and Rodriguez aren’t rushing down the aisle anytime soon, they are moving forward with their relationship. Variety is reporting the New York natives recently purchased a $17.5 million, 3-bedroom, 4.5 bathroom condo in Midtown Manhattan. Their unit takes up half of the 36th floor in the 96-story building.\n\nAccording to Variety, the new residence includes “valet parking, an attended lobby with doorman and concierge services, a games parlor, a state-of-the-art screening room, a health club and spa with a building-wide indoor swimming pool, and a residents’ restaurant where three meals a day are served from an open kitchen under 15-foot-long chandeliers hung from a 30-foot ceiling.”\n\nSounds luxurious to us.\n\nNext: A simple hello\n\nHer version of their meet-cute\n\nJennifer Lopez remembers their first meeting one way. | Ari Perilstein/Getty Images for FIJI Water Jennifer Lopez remembers their first meeting one way. | Ari Perilstein/Getty Images for FIJI Water\n\nIn the spring of 2017, Lopez appeared on The Ellen DeGeneres Show and shared the encounter that sparked their smoldering romance. She recalled, “I was having a Cobb salad and some soup. I saw him walk by, and then afterward I went outside. But for some reason, I felt like tapping him on the shoulder and saying hi. I said, “Hi, Alex” and he said, “Hi, Jennifer.” That’s how we met.”\n\nFor Lopez, it seems like a pretty straightforward story, but according to Rodriguez, he was actually way more frazzled and distracted then he let on.\n\nNext: His side of the story\n\nThe luckiest day of his life\n\nHe recalls the moment a little differently. | Jim McIsaac/Getty Images He recalls the moment a little differently. | Jim McIsaac/Getty Images\n\nThough Rodriguez is an All-Star and a legend, like anyone, he was flustered when Lopez approached him. On an April 2018 episode of The Ellen DeGeneres Show, he shared his own version of events. In fact, Rodriguez recalled being frazzled and annoyed because he’d forgotten where he’d parked his car when Lopez tapped him on the shoulder.\n\nHe explained, “I do not recognize this person, and its Jennifer, but she’s dressed up as Harlee from Shades of Blue. And she’s in her jeans and her big boots, and it took me about four, five seconds and she said, “It’s Jennifer, It’s Jennifer!” “Oh my god, Jennifer. You look beautiful!”\n\nNext: Obsessed\n\nStill in the honeymoon stage\n\nThe couple is still going strong. | Christian Petersen/Getty Images The couple is still going strong. | Christian Petersen/Getty Images\n\nNo matter how they pair actually met, over a year later, they are still hot and heavy with one another, and they don’t seem to be cooling off anytime soon.\n\nAn insider recently told People, “They are definitely getting more serious. A-Rod flew to L.A. before the weekend to be with Jennifer. She was ecstatic to see him. When apart, they speak every day. It’s like they can’t get enough of each other.”\n\nWe’re obsessed.\n\nFollow Aramide on Twitter @midnightrami.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-849853062.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png", "https://www.cheatsheet.com/wp-content/uploads/2017/06/jenniferlopezalexrodriguez.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/One-Voice-Somos-Live-A-Concert-For-Disaster-Relief-Los-Angeles.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Floyd-Mayweather-Jr.-v-Conor-McGregor.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2016/08/GettyImages-587764242.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-461396184.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png", "keywords": [], "authors": ["Aramide Tinubu"], "canonical_link": "https://www.cheatsheet.com/entertainment/how-jennifer-lopez-and-alex-rodriguez-first-met-is-a-funny-story.html/", "title": "How Jennifer Lopez and Alex Rodriguez First Met Is A Funny Story", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/how-jennifer-lopez-and-alex-rodriguez-first-met-is-a-funny-story.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Though they both have super adorable stories, Jennifer Lopez and Alex Rodriguez can't seem to agree on how they first met.", "og": {"locale": "en_US", "type": "article", "title": "How Jennifer Lopez and Alex Rodriguez First Met Is A Funny Story", "description": "Though they both have super adorable stories, Jennifer Lopez and Alex Rodriguez can't seem to agree on how they first met.", "url": "https://www.cheatsheet.com/entertainment/how-jennifer-lopez-and-alex-rodriguez-first-met-is-a-funny-story.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-09T19:26:04-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Jennifer lopez", "section": "Entertainment", "published_time": "2018-06-09T19:26:00-04:00", "modified_time": "2018-06-09T19:26:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "Though they both have super adorable stories, Jennifer Lopez and Alex Rodriguez can't seem to agree on how they first met.", "title": "How Jennifer Lopez and Alex Rodriguez First Met Is A Funny Story", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/01/Jennifer-Lopez-and-Alex-Rodriguez.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528586760.0, "source": "https://www.cheatsheet.com", "summary": ""}