{"url": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/16/meghan-markle-prince-harry-and-the-pressures-of-royal-wedding-traditions/", "text": "When Princess Elizabeth’s engagement to Philip Mountbatten was announced that summer, many Brits welcomed the news. After so much suffering, the prospect of a royal wedding seemed to lift the nation’s spirit. “Oh, it gave us all a boost,” recalled Pat Bannell, a 97-year-old from East London. “We were all for it, especially if we got a day off work,” she said, chuckling.\n\nAD\n\nAD\n\nThe wedding of the future Queen Elizabeth and Prince Philip came just four months after the engagement and was attended by 2,000 guests.\n\nAcross the country and around the world, people listened to the events unfold on the radio. Thousands gathered on the streets of London and outside Buckingham Palace, where they waited patiently for hours to catch a glimpse of the newlyweds after the nuptials. As the couple stepped out onto the balcony and waved, they were met with a roar of whistling, claps and cheers.\n\nDescribing the “vast crowds” and “shining happiness of the bride,” the Daily Telegraph reported the wedding would “live long in the memory.”\n\nOn Saturday, those long-ago newlyweds — the queen is now 92, Prince Philip is 96, and the couple celebrated their 70th wedding anniversary in November — are expected to attend the royal wedding of their grandson Prince Harry to American actress Meghan Markle. (Prince Philip is recovering from a hip operation.)\n\nAD\n\nAD\n\nPlanning any wedding is stressful — and mishaps are inevitable. Just ask Queen Elizabeth. On the morning of her wedding, the jewel-encrusted fringe tiara she was given as her “something borrowed” by her mother snapped as it was placed atop her head. The royal family, of course, had a jeweler on standby who was able to repair it and save the day.\n\nElizabeth’s wedding cake was nine-feet tall, and she received 10,000 telegrams of congratulations. The material for the wedding gown was purchased with ration coupons collected by the bride. Members of the public who wanted to help had sent their own coupons for the princess to use, although these were kindly returned to the senders.\n\nElizabeth’s dress was made from ivory silk and embellished with 10,000 pearls. But royal wedding dresses have not always been white. Before the 19th century, many royal brides opted for color, the bolder and brighter the better. When Queen Victoria wore a white ball gown to marry Prince Albert in 1840, she changed wedding traditions — royal and commoner — forever.\n\nThe demands of history always play a role in royal weddings. Not only do couples need consent from the queen to marry, they must also deal with an additional layer of pressure: to follow or jettison age-old traditions.\n\nAD\n\nAD\n\nWhen the bride and groom exchange vows at Windsor Castle’s St. George’s Chapel this weekend, comparisons with the past will certainly be made. Kensington Palace announced this week that Markle’s father will not walk her down the aisle, as tradition demands. Instead she asked Prince Charles, her father-in-law, to perform the honor.\n\nA statement from Ms. Meghan Markle: pic.twitter.com/TjBNarmuBU — Kensington Palace (@KensingtonRoyal) May 17, 2018\n\nNot having her father escort her isn’t without precedent. Queen Victoria was accompanied to the altar by her uncle. And Victoria walked her own daughter, Princess Beatrice, down the aisle in 1885.\n\nOn Saturday, smaller dramas will revolve around the royal couple’s decorative choices, sentimental touches and ceremonial decisions. All will be scrutinized. While many customs have prevailed throughout royal wedding history, others have been tweaked or replaced entirely.\n\nAD\n\nAD\n\nThe vows\n\nWhen Elizabeth married Prince Philip in 1947, she took a traditional vow, promising to “love, cherish and obey” him.\n\nIt was Diana, Princess of Wales who broke with tradition in 1981 when she married Prince Charles by omitting the word obey. Diana instead promised to “love, comfort, honor and keep” her new husband.\n\nDiana’s decision sparked controversy not just at home but also overseas. “LADY DIANA WON’T VOW TO OBEY CHARLES,” the New York Times wrote.\n\nRoyal brides who came after Diana did not follow suit. When Sarah Ferguson married Prince Andrew in 1986, she vowed to obey, as did Sophie Rhys-Jones during her wedding to Prince Edward. (Bishop of Norwich Peter Nott, who led the wedding service, said use of the word ‘obey’ was about trust and did not mean Sophie was going to be “subservient.”)\n\nAD\n\nAD\n\nIn the run-up to Kate Middleton’s wedding to Prince William in 2011, speculation was rife about the impending vows. Would Kate do a Diana? The answer was yes. Standing in Westminster Abbey, she vowed to “love, comfort, honor and keep” her husband, with no mention of obeying him.\n\nNow it is Meghan Markle’s turn to decide.\n\nFlowers\n\nWhen it comes to flowers and royal weddings, arrangements are traditionally all white — although size and style have varied dramatically over time.\n\nKate’s bouquet was described as simple by some and underwhelming by others. Diana’s bridal arrangement was quite the opposite, weighing in at more than four pounds. The bouquet was ostentatious, and she did not just have one, she had two. This is rumored to be because Elizabeth’s was allegedly misplaced by a footman and went missing at some point during her wedding day — much to the dismay of the official photographer. When it came time to take the family photo, her arrangement was nowhere to be seen.\n\nDespite the differences in size, flower selection and personal preference, the inclusion of myrtle, which symbolizes love, is a tradition that dates back to the wedding of Queen Victoria’s daughter and is expected to continue with Meghan this weekend, although many anticipate she will add her own touch to the creation.\n\nWedding rings\n\nAt the time of her marriage to the future King George VI in 1923, Elizabeth Bowes-Lyon, later known as the Queen Mother, opted for a wedding ring made from rare Welsh gold. From this date on, the Welsh wedding band became somewhat of a statement. Since then, the unique gold has been used to form the rings of the queen, Princess Margaret and Princess Diana. The wedding rings are formed from the same nugget, carefully extracted from the Clogau St. David’s gold mine in Wales. After his engagement, Prince William was given Welsh gold by the queen so Kate could wear a Welsh band.\n\nAD\n\nAD\n\nPrince Harry recently said yellow gold is Meghan’s favorite, but it is not yet known whether her choice of wedding ring will follow royal tradition.\n\nThe date\n\nRoyal weddings often occur during the week, which, in the past has resulted in a day off for most workers. Queen Elizabeth and Philip were married on a Thursday. Prince Charles and Princess Diana on a Wednesday. Prince William and Catherine married on a Friday, and pubs and bars across the country had their opening hours extended to make room for extra drinking time.\n\nNot only are Prince Harry and Meghan Markle tying the knot on a Saturday, but it is also one of the biggest soccer matches of the year, the FA Cup final. For FA President Prince William, who is also Harry’s best man, it is shaping up to be quite the day.\n\nAD\n\nRead more Retropolis:", "images": ["https://www.washingtonpost.com/resizer/pm-YTnuJEnr8jnL6zrof98S00HM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RTMFES3SBYYZ7PWDLD6EU5JUU4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OZXZKFZNTM2QJGZMCO2IP4P45A.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/db5b31a6-553c-4208-8a0d-804e2a2c979a.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/pm-YTnuJEnr8jnL6zrof98S00HM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RTMFES3SBYYZ7PWDLD6EU5JUU4.jpg", "keywords": [], "authors": ["Jennifer Hassan", "Social Media Editor For The Foreign Desk"], "canonical_link": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/16/meghan-markle-prince-harry-and-the-pressures-of-royal-wedding-traditions/", "title": "Prince Charles will walk Meghan Markle down the aisle: When royal wedding traditions fall", "meta_data": {"description": "Markle's father caused a stir by deciding not to attend the wedding. Every detail Saturday will be scrutinized, from the couple's vows to their rings.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/retropolis/wp/2018/05/16/meghan-markle-prince-harry-and-the-pressures-of-royal-wedding-traditions/", "image": "https://www.washingtonpost.com/resizer/pm-YTnuJEnr8jnL6zrof98S00HM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RTMFES3SBYYZ7PWDLD6EU5JUU4.jpg", "title": "Prince Charles will walk Meghan Markle down the aisle: When royal wedding traditions fall", "description": "Markle's father caused a stir by deciding not to attend the wedding. Every detail Saturday will be scrutinized, from the couple's vows to their rings."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Prince Charles will walk Meghan Markle down the aisle: When royal wedding traditions fall", "description": "Markle's father caused a stir by deciding not to attend the wedding. Every detail Saturday will be scrutinized, from the couple's vows to their rings."}, "last_updated_date": "2019-04-01T03:18:51.042Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1526400000.0, "source": "https://www.washingtonpost.com", "summary": ""}