{"url": "https://www.newsday.com/entertainment/celebrities/shocking-celebrity-deaths-1.4938415", "text": "Chester Bennington, Chris Cornell, Prince, Bobbi Kristina Brown and more: Remember celebrities who left us too soon in some of the most shocking deaths of all time.\n\nChester Bennington Chester Bennington (March 20, 1976 -- July 20, 2017): The lead singer of Linkin Park was found dead of an apparent suicide at his residence near Los Angeles.\n\nNelsan Ellis Nelsan Ellis (Nov. 30, 1978 -- July 8, 2017): The actor, Lafayette Reynolds on \"True Blood,\" died of heart failure due to alcohol-withdrawal complications at age 39.\n\nChris Cornell Chris Cornell (July 20, 1964 -- May 17, 2017): The rock musician, best known as the lead singer for Soundgarden and Audioslave, died at 52.\n\nAlan Thicke Alan Thicke (March 1, 1947 -- Dec. 13, 2016): The actor, best known as the patriarch on \"Growing Pains,\" died of type-A aortic dissection at age 69.\n\nPete Burns Pete Burns (Aug. 5, 1959 -- Oct. 23, 2016): The lead singer for British pop band Dead or Alive died following a sudden cardiac arrest at 57.\n\nAnton Yelchin Anton Yelchin (March 11, 1989 -- June 19, 2016): The actor, best known for playing Chekov in the latest \"Star Trek\" films, died in a freak car accident. He was 27.\n\nChristina Grimmie Christina Grimmie (March 12, 1994 -- June 10, 2016): A season 6 contestant on \"The Voice,\" Grimmie was shot to death by a gunman while signing autographs at a Florida concert venue. The gunman then fatally shot himself. Grimmie is seen here on June 29, 2014, performing as part of \"The Voice Tour\" at Cobb Energy Centre in Atlanta.\n\nPrince Prince (June 7, 1958 -- April 21, 2016): The pop music superstar was found dead at his home in suburban Minneapolis.\n\nScott Weiland Scott Weiland (Oct. 27, 1967 -- Dec. 3, 2015): The former Stone Temple Pilots frontman was found dead on his tour bus in the Minneapolis suburb of Bloomington on Dec. 3, while on tour with his band Scott Weiland & the Wildabouts. A medical examiner ruled two weeks later that his cause of death was a toxic mix of drugs, including cocaine. The medical examiner also noted a history of cardiovascular disease, asthma and addiction.\n\nBobbi Kristina Brown Bobbi Kristina Brown (March 4, 1993 -- July 26, 2015): Brown, only child of the late pop star Whitney Houston, pictured here on Feb. 12, 2011, died nearly six months after having been found unresponsive in a bathtub at her town house in suburban Roswell, Ga., on Jan. 31, 2015.\n\nSelena Quintanilla-Pérez Selena Quintanilla-Pérez (April 16, 1971 -- March 31, 1995): A Latin-American crossover phenomenon, the artist known simply as \"Selena,\" left, was fatally shot by the president of her fan club, Yolanda Saldívar, right, at a Days Inn motel in Corpus Christi, Texas, when the singer met Saldívar there to confront her about embezzling funds. Selena was 23.\n\nGreg Plitt Greg Plitt (Nov. 3, 1977 -- Jan. 17, 2015): The fitness model and TV actor was killed by a train in Burbank, Calif., on Jan. 17, 2015.\n\nChristine Cavanaugh Christine Cavanaugh (Aug. 16, 1963 -- Dec. 22, 2014): The actress, known for voicing the pig in the film \"Babe,\" died at her home from unknown causes. She was 51.\n\nBrittany Murphy Brittany Murphy (Nov. 10, 1977 -- Dec. 20, 2009): The actress died after collapsing at her home in the Hollywood Hills from a combination of pneumonia, iron deficiency and (legal) drug intoxication. She was 32.\n\nMisty Upham Misty Upham (July 6, 1982 -- Oct. 5, 2014): The actress is known for roles in \"August: Osage County,\" \"Frozen River\" and \"Django Unchained.\" Upham's family, who said she battled with bipolar disorder and depression, reported her missing to police; her body was found along a river in suburban Seattle by a search party of family and friends on Oct. 16, 2014. She was 32.\n\nSimone Battle Singer and actress Simone Battle (June 17, 1989 -- Sept. 5, 2014): According to the Los Angeles County coroner's office, Battle, was found dead in her West Hollywood home. She was 25.\n\nRobin Williams Robin Williams (July 21, 1951 -- Aug. 11, 2014): The actor was found dead of an apparent suicide at his residence in Tiburon, Calif., according to the Marin County police. He was 63.\n\nL'Wren Scott L'Wren Scott (April 28, 1964 -- March 17, 2014): The designer, and Mick Jagger's longtime girlfriend, was found dead in Manhattan of a possible suicide. Scott's assistant found her hanging from a doorknob, according to a law enforcement official who spoke to The Associated Press.\n\nPhilip Seymour Hoffman Philip Seymour Hoffman (July 23, 1967 -- Feb. 2, 2014): The Oscar-winning actor -- known for \"Capote,\" \"Doubt\" and \"The Master,\" among several other films -- was found dead on the bathroom floor of his West Village apartment at age 46. The New York City medical examiner later determined Hoffman was killed by a poisonous mix of drugs that included heroin, cocaine, amphetamines and sedatives.\n\nPaul Walker Paul Walker (Sept. 12, 1973 -- Nov. 30, 2013): The star of the \"Fast & Furious\" movie franchise was killed when the Porsche he was a passenger in smashed into a light pole and tree, then exploded into flames.\n\nLee Thompson Young Lee Thompson Young (Feb. 1, 1984 -- Aug. 19, 2013): Young, who started his career as a teenager on the TV series \"The Famous Jett Jackson,\" was found dead in his North Hollywood home after he failed to show up for taping of his TV series, \"Rizzoli & Isles.\" He was 29.\n\nGia Allemand Gia Allemand (Dec. 20, 1983 -- Aug. 14, 2013): The onetime Manorville resident who came in third on the Jake Pavelka season of ABC's \"The Bachelor\" in 2010 died when she was taken off life support after a suicide attempt by hanging two days earlier. She was 29.\n\nDavid \"Kidd\" Kraddick David \"Kidd\" Kraddick (Aug. 22, 1959 -- July 27, 2013): The TV and radio host of \"Kidd Kraddick in the Morning\" died of heart disease complications while at his Kidd's Kids charity function in the New Orleans suburb of Gretna. He was 53.\n\nCory Monteith Cory Monteith (May 11, 1982 -- July 13, 2013): The \"Glee\" actor, who struggled with addiction, was found dead in his Vancouver hotel room just two months after he spent time in rehab. A coroner's report later said the cause of death was \"mixed drug toxicity\" from intravenous heroin use and alcohol.\n\nJeff Hanneman Jeff Hanneman (Jan. 31, 1964 -- May 2, 2013): The guitarist and founding member of the metal band Slayer died of liver failure caused by a spider bite he did not immediate seek medical treatment for. He was 49.\n\nShain Gandee Shain Gandee (Nov. 1, 1991 - April 1, 2013): The breakout star of MTV's reality show \"Buckwild\" was found dead of carbon monoxide poisoning, along with his uncle and a family friend, after his Ford Bronco got stuck in mud when the trio went off-roading in Gandee's hometown of Sissonville, W. Va. He was 21.\n\nWhitney Houston Whitney Houston (Aug. 9, 1963 - Feb. 11, 2012): The six-time Grammy winner was found dead in the bathtub of her Beverly Hilton hotel room on the eve of the Grammy Awards, from accidental drowning, cocaine overdose and coronary artery disease. She was 48.\n\nAmy Winehouse Amy Winehouse (Sept. 14, 1983 - July 23, 2011): The \"Rehab\" singer was found dead in her bed at her London home from accidental alcohol poisoning.\n\nMichael Jackson Michael Jackson (Aug. 29, 1958 - June 25, 2009): The king of pop died at age 50 from a fatal combination of prescription drugs that shut down his already weak heart. The doctor who administered the drugs, Conrad Murray, was later convicted of involuntary manslaughter and sentenced to 4 years in prison.\n\nJenni Rivera Jenni Rivera (July 2, 1969 - Dec. 9, 2012): The Mexican singer died when her private jet crashed in Mexico after a concert, also killing several members of her entourage. She was 43.\n\nJohn Lennon John Lennon (Oct. 9, 1940 - Dec. 8, 1980): The founding member of The Beatles was assassinated by a crazed fan in front of his apartment complex in New York. He was 40.\n\nPrincess Diana Diana, Princess of Wales (July 1, 1961 - Aug. 31, 1997): Princess Diana died from injuries sustained during a Paris car crash, in which paparazzi were following her black Mercedes at high speeds. She was 36.\n\nHeath Ledger Heath Ledger (April 4, 1979 - Jan. 22, 2008): Acclaimed for his role in \"Brokeback Mountain,\" and then posthumously for his portrayal of the Joker in 2008's \"The Dark Knight,\" Ledger accidentally overdosed on a prescription drug cocktail at his SoHo apartment in Manhattan. He was 28.\n\nLisa \"Left Eye\" Lopes Lisa \"Left Eye\" Lopes (May 27, 1971 - April 25, 2002): The singer-rapper who made up one-third of the girl group TLC died in a car crash in Honduras. She was 30.\n\nJim Morrison Jim Morrison (Dec. 8, 1943 - July 3, 1971): The Doors lead singer died in the bathtub of his Paris apartment of apparent heart failure. However, an autopsy was never performed because police did not suspect foul play, which has led to endless speculation and a string of conspiracy theories about the cause of his death.\n\nDavid Carradine David Carradine (Dec. 8, 1936 - June 3, 2009): Though the actor from the \"Kung Fu\" 1970s TV series was initially thought to have committed suicide when he was found hanging in a closet in his hotel room in Bangkok, the cause of death was later deemed to be accidental suffocation, possibly from a dangerous form of sex play called autoerotic asphyxiation. He was 72.\n\nAnna Nicole Smith Anna Nicole Smith (Nov. 28, 1967 - Feb. 8, 2007): The former Playboy model was found dead in a Florida hotel room after ingesting a combination of sleeping pills and other medications. She was 39.\n\nAaliyah Aaliyah (Jan. 16, 1979 - Aug. 25, 2001): Successful recording artist Aaliyah's star was on the rise when a small Cessna plane carrying the singer and her video crew crashed and burst into flames shortly after taking off from the Bahamas, where they had just shot a music video. She was 22.\n\nSteve Irwin Steve Irwin (Feb. 22, 1962 - Sept. 4, 2006): The \"Crocodile Hunter\" died when his heart was pierced by the poisonous spine of a stringray while shooting a TV show on the Great Barrier Reef. He was 44.\n\nNatasha Richardson Natasha Richardson (May 11, 1963 - March 18, 2009): After a relatively minor head injury during a ski vacation with one of her sons in Canada, the actress died from internal bleeding in the brain. She was 45.\n\nPhil Hartman Phil Hartman (Sept. 24, 1948 - May 28, 1998): A regular on \"Saturday Night Live,\" the comedian was shot and killed by his wife, who then turned the gun on herself. The couple's two children were in the home at the time of the murder-suicide. He was 49.\n\nKurt Cobain Kurt Cobain (Feb. 20, 1967 - April 5, 1994): Nirvana's lead singer killed himself with a gunshot wound to the head at his Seattle home. He was 27.\n\nCorey Haim Corey Haim (Dec. 23, 1971 - March 10, 2010): A 1980s teen idol, Haim succumbed to a combination of pneumonia and a bad heart. Though eight drugs were found in his system, including marijuana and cold medicine, a coroner ruled they did not play a role in his death. He was 38.\n\nElvis Presley Elvis Presley (Jan. 8, 1935 - Aug. 16, 1977): \"The King\" died of a drug overdose in his bathroom at Graceland, his famed white-columned mansion. He was 42.\n\nMarilyn Monroe Marilyn Monroe (June 1, 1926 - Aug. 5, 1962): Though her death was ruled a suicide by barbiturate poisoning, speculation persists more than 50 years later that the curvy screen siren may not have died by her own hand at her Brentwood, Calif., home. She was 36.\n\nTupac Shakur died six days after being wounded in a drive-by shooting in Las Vegas. He was 25. Though no arrests have been made in the years since his death, it is thought to have been linked to an East Coast-West Coast beef between himself and rival rapper Notorious B.I.G., who was also killed in a shooting six months later.\n\nBob Marley Bob Marley (Feb. 6, 1945 - May 11, 1981): The Jamaican reggae musician died of melanoma that had spread to his lungs and brain. He was 36.\n\nJimi Hendrix Jimi Hendrix (Nov. 27, 1942 - Sept. 18, 1970): The guitarist died of drug-related complications. He was 27.\n\nJohn F. Kennedy Jr. John F. Kennedy Jr. (Nov. 25, 1960 - July 16, 1999): The son of President John F. Kennedy died at sea, along with his wife, Caroline Bessette, and sister-in-law when the plane he was flying mysteriously crashed about 200 yards off Martha's Vineyard. He was 38.\n\nJames Dean James Dean (Feb. 8, 1931 - Sept. 30, 1955): The \"Rebel Without a Cause\" died after crashing his Porsche head-on into another car at high speed in California. He was 24.\n\nReggie Lewis Reggie Lewis (Nov. 21, 1965 - July 27, 1993): The Boston Celtics guard-forward died after collapsing on the court due to a heart condition.\n\nSharon Tate Sharon Tate (Jan. 24, 1943 - Aug. 9, 1969): The pregnant actress and four others were murdered by members of a group known as the Manson Family, followers of convicted murderer Charles Manson. She was 26.\n\nJudy Garland Judy Garland (June 10, 1922 - June 22, 1969): Made famous after playing Dorothy in 1939's \"The Wizard of Oz,\" Garland was found dead in her London home after an accidental overdose. She was 47.\n\nGary Coleman Gary Coleman (Feb. 8, 1968 - May 28, 2010): The \"Diff'rent Strokes\" star died after suffering a brain hemorrhage that put him in a coma before he was removed from life support. He was 42.\n\nJayne Mansfield Jayne Mansfield (April 19, 1933 - June 29, 1967): A '50s and '60s actress with bombshell curves, Mansfield died in a car accident, leaving behind five children including \"Law & Order's\" Mariska Hargitay. She was 34.\n\nJohn Belushi John Belushi (Jan. 24, 1949 - March 5, 1982): The \"Animal House\" comedian died of an accidental drug overdose from a speedball, a combined injection of heroin and cocaine at the Chateau Marmont on Sunset Boulevard in Hollywood. He was 33.\n\nJohn Ritter John Ritter (Sept. 17, 1948 - Sept. 11, 2003): Ritter passed away at a hospital after experiencing nausea and vomiting on the set of his TV show \"8 Simple Rules.\" The cause of death was an undetected aortic dissection, a separation in the walls of the major artery that carries blood from the heart. He was 54.\n\nNatalie Wood Natalie Wood (July 20, 1938 - Nov. 29, 1981): Best known for her roles in \"Miracle on 34th Street\" and \"West Side Story,\" the actress, who couldn't swim, drowned in the waters off California's Santa Catalina Island. Wood, husband Robert Wagner and actor Christopher Walken were drinking heavily in the hours before she disappeared. She was 43.\n\nJohn Candy John Candy (Oct. 31, 1950 - March 4, 1994): The \"Planes, Trains and Automobiles\" funnyman died of a heart attack in his sleep. He was 43.\n\nSid Vicious Sid Vicious (May 10, 1957 - Feb. 2, 1979): The bass guitarist for the Sex Pistols (real name John Simon Ritchie) died of a drug overdose four months after the mysterious fatal stabbing of his girlfriend, Nancy Spungen, in the couple's room at Manhattan's Chelsea Hotel, for which he was charged. He was 21.\n\nBernie Mac Bernie Mac (Oct. 5, 1957 - Aug. 9, 2008): The famous comic died of complications from pneumonia in a Chicago hospital. He was 50.\n\nTim Russert Tim Russert (May 7, 1950 - June 13, 2008): The \"Meet the Press\" host collapsed on the set of his show from sudden cardiac arrest caused by a blood clot and stemming from a known heart condition. He was 58.\n\nBrian Jones Brian Jones (Feb. 28, 1942 - July 3, 1969): A founding member of the Rolling Stones, Jones accidentally drowned in the pool at his home outside London after abusing drugs and alcohol. The coroner's report ruled it a \"death by misadventure.\" He was 27.\n\nAmelia Earhart Amelia Earhart (July 24, 1897 - Jan. 5, 1939): The first female pilot to fly solo across the Atlantic Ocean went missing over the South Pacific along with her navigator, Fred Noonan, during an attempt to become the first woman to circumnavigate the globe. She was 41 when declared dead.\n\nDale Earnhardt Dale Earnhardt (April 29, 1951 - Feb. 18, 2001): Nicknamed \"The Intimidator\" for his aggressive driving, Earnhardt Sr. died in a crash during the Daytona 500. He was 49.\n\nKeith Moon Keith Moon (Aug. 23, 1946 - Sept. 7, 1978): The legendary drummer for The Who overdosed on pills meant to combat his alcoholism. He was 32.\n\nGeorge Reeves George Reeves (Jan. 5, 1914 - June 16, 1959): The original Superman, from the 1950s TV show \"The Adventures of Superman,\" died in his Beverly Hills home at the peak of his career and three days before his wedding. Though his death at 45 was ruled a suicide and the case remains closed, Reeves' cause of death has recently been called into question, most notably in the 2006 film, \"Hollywoodland,\" in which Ben Affleck plays Reeves.\n\n\"Mama\" Cass Elliot \"Mama\" Cass Elliot (Sept. 19, 1941 - July 29, 1974): A member of the folk group The Mamas & the Papas who also had a successful solo career, Cass died at 32 from heart failure due to obesity -- not while choking on a ham sandwich, as an urban legend claims.", "images": ["https://cdn.newsday.com/polopoly_fs/1.4939882.1471817989!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.11938110.1471825344!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4941062.1471811057!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4943633.1471825008!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://www.newsday.com/img/newsday/newsdayLogo.svg", "https://cdn.newsday.com/polopoly_fs/1.4940154.1471813064!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4940090.1471813393!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.7415846.1471837215!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.9519120.1471838374!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.9244690.1471838139!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4939012.1471812972!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/preview_115/image.png", "https://cdn.newsday.com/polopoly_fs/1.43909013.1587069599!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4938843.1471811362!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4939725.1471818058!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.3855058.1497381799!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.11243512.1471834852!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.5190675.1471836136!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4943719.1471825025!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.8631433.1471838277!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4940814.1471824785!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942886.1471824968!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942508.1471824024!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43903156.1587058761!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942309.1471823776!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4939203.1471814861!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43885963.1587080063!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13645762.1499781932!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942809.1471824919!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.6530995.1471836837!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4940383.1505330274!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942678.1471824946!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942054.1471811011!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.6465442.1492444277!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4941486.1471810752!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4943572.1471825259!/httpImage/image._gen/derivatives/display_960/image.", "https://cdn.newsday.com/polopoly_fs/1.4940238.1471812742!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4940702.1471810663!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13819697.1500906349!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4941733.1471824765!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.5685588.1471836241!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.11716846.1471834821!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4939791.1471818135!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4943484.1471823743!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4938932.1471811115!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.12502469.1492443707!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.9820400.1471837531!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4938804.1471815186!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4938671.1471813174!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43908722.1587069202!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4941406.1471824461!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4938719.1471813199!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4938494.1471818263!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43925255.1587144510!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942618.1471824585!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/display_960/image.png", "https://cdn.newsday.com/polopoly_fs/1.5893253.1471836408!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.6531170.1471823604!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4939653.1471824837!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43905888.1587138439!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.11902482.1471825476!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13793858.1499781681!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.12753126.1492443904!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.10678581.1471826263!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4940970.1471824481!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4939122.1471810449!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43908034.1587085834!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4942981.1471824052!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.13819697.1500906349!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.9761046.1471837775!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.5918777.1471836692!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4939054.1471810545!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4940341.1471837442!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.3046647.1497381765!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.4942134.1471824743!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4940536.1471810889!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.22642050.1556723435!/httpImage/image.png_gen/derivatives/landscape_384/image.png", "https://cdn.newsday.com/polopoly_fs/1.43740316.1586625604!/httpImage/image.jpg_gen/derivatives/landscape_375/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.43740316.1586625604!/httpImage/image.jpg_gen/derivatives/preview_115/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.3046759.1497381717!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG", "https://cdn.newsday.com/polopoly_fs/1.6929190.1471827462!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.4941823.1471824610!/httpImage/image.jpg_gen/derivatives/display_960/image.jpg", "https://cdn.newsday.com/polopoly_fs/1.5784143.1471836361!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG"], "top_img": "https://cdn.newsday.com/polopoly_fs/1.13819697.1500906349!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "keywords": [], "authors": ["Newsday.Com Staff"], "canonical_link": "https://www.newsday.com/entertainment/celebrities/shocking-celebrity-deaths-1.4938415", "title": "Shocking celebrity deaths", "meta_data": {"viewport": "width=100%,initial-scale=1.0,maximum-scale=2.0", "description": "Chris Cornell, Prince, Scott Weiland, Bobbi Kristina Brown and more: Remember celebrities who left us too soon in some of the most shocking deaths of all time.", "msvalidate.01": "AC41EB10D1EC6B5358F0ECA0E861CCAA", "theme-color": "#0077c8", "google-site-verification": "WS-IPs_DqbPtrQ9XhKPi_32a-1spE4tjsjhWUqwVVns", "application-name": "Newsday", "msapplication-TileColor": "#1B3664", "msapplication-TileImage": "/img/newsday/nd-win8-icon.png", "p": {"domain_verify": "b22f651177478af415d53d6eb00b8167"}, "fb": {"pages": 19175874448, "app_id": 147686468041}, "ia": {"markup_url": "https://www.newsday.com/facebook/entertainment/celebrities/shocking-celebrity-deaths-1.4938415"}, "article": {"content_tier": "metered", "opinion": "false"}, "paywall_status": "metered", "news_keywords": "newsday,entertainment,celebrities,source", "og": {"title": "Shocking celeb deaths", "url": "https://www.newsday.com/entertainment/celebrities/shocking-celebrity-deaths-1.4938415", "image": "https://cdn.newsday.com/polopoly_fs/1.13819697.1500906349!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "site_name": "Newsday", "description": "Chris Cornell, Prince, Scott Weiland, Bobbi Kristina Brown and more: Remember celebrities who left us too soon in some of the most shocking deaths of all time.", "type": "article"}, "twitter": {"card": "summary_large_image", "site": "@Newsday", "title": "Shocking celeb deaths", "description": "Chris Cornell, Prince, Scott Weiland, Bobbi Kristina Brown and more: Remember celebrities who left us too soon in some of the most shocking deaths of all time.", "image": "https://cdn.newsday.com/polopoly_fs/1.13819697.1500906349!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg", "app": {"id": {"iphone": 358571317, "ipad": 358571317, "googleplay": "com.pagesuite.newsday"}}}, "sailthru.date": "Mon, 24 Jul 2017 10:30:00 -0400", "sailthru.title": "Shocking celeb deaths", "sailthru.tags": "newsday,entertainment,celebrities,source", "sailthru.author": "Newsday.com Staff", "isDesktop": "true"}, "movies": [], "publish_date": 1500910200.0, "source": "https://www.newsday.com", "summary": ""}