{"url": "https://www.cheatsheet.com/entertainment/the-1-surprising-reason-john-oliver-wouldnt-blame-meghan-markle-for-calling-off-the-royal-wedding.html/", "text": "It seems like everyone on Earth was anxiously awaiting the royal wedding of Meghan Markle and Prince Harry. Everyone, that is, except for John Oliver. The late-night host sent a very different message than we’re used to hearing while appearing on The Late Show with Stephen Colbert, which shed a light on some of the reasons why people might not want to get too excited.\n\nOliver claimed he wouldn’t blame Markle if she had changed her mind about marrying the prince — here’s why.\n\nOliver had warned Markle that there was still time to run\n\nOliver isn’t a big fan of England’s royal hierarchy. | Mark Davis/Getty Images Oliver isn’t a big fan of England’s royal hierarchy. | Mark Davis/Getty Images\n\nColbert brought up the topic of the royal wedding during the interview, assuming Oliver might be excited. He argued, “You’re English, you must be really excited about the royal wedding,” to which Oliver responded with a hard “no.”\n\nColbert asked if Oliver had any tips for Harry, considering Oliver’s similarity with the royal couple. “He’s a Brit, he’s marrying an American girl,” Colbert argued. “You’re British, you married an American woman.”\n\nOliver didn’t have any advice for Harry, but he did issue a harsh warning to Markle: Run.\n\nNext: He’s not exactly the royal family’s biggest fan.\n\nThe royal family could cause her ‘emotional complications’\n\nHopefully, Markle won’t experience a heartbreak on her wedding day the way her Suits character did. | USA Hopefully, Markle won’t experience a heartbreak on her wedding day the way her Suits character did. | USA\n\nOliver argued his point about why he “would not blame her if she pulled out of this at the last minute.”\n\nHe explained, “I don’t think you need to have just seen the pilot episode of The Crown to get a basic sense of she might be marrying into a family that could cause her some emotional complications.”\n\nNext: This is where his opinions get pretty harsh.\n\n‘It’s going to be weird for her’\n\nWill it be strange for Markle to try and fit in with the young royals? | Chris Jackson/Getty Images Will it be strange for Markle to try and fit in with the young royals? | Chris Jackson/Getty Images\n\nColbert tried to defend the younger generation of royals by calling them nice, but Oliver wasn’t completely keen on agreeing. “I mean, they are an emotionally stunted group of fundamentally flawed people doing a very silly pseudo job — that’s what she’s marrying into,” he criticized.\n\n“So, I hope she likes it,” he added. “It’s going to be weird for her.”\n\nNext: He made this odd comparison to the royal family.\n\nOliver compared royal weddings to fireworks\n\nRoyal weddings certainly are known for their fanfare. | Leon Neal/AFP/Getty Images Royal weddings certainly are known for their fanfare. | Leon Neal/AFP/Getty Images\n\nOliver voiced his assumption that he probably wouldn’t be welcomed into the royal family. Considering his voiced opinions, he likely wouldn’t end up on the guest list to the wedding, either.\n\nOliver did admit, “I like royal weddings,” but he added, “I also like fireworks. You know, it’s a spectacle. It’s something nice to look at.” Not exactly the most heartfelt compliment to offer, but we’ll take it.\n\nNext: We can see where Oliver may be coming from.\n\nMarkle does have to conform to some crazy rules\n\nThere are plenty of changes on the horizon for the soon-to-be royal. | Tasos Katopodis/Getty Images There are plenty of changes on the horizon for the soon-to-be royal. | Tasos Katopodis/Getty Images\n\nGranted, we can definitely see where Oliver is coming from. The royal family has to conform to some crazy rules, whether or not they’re in the public eye.\n\nFor example, Markle will have to get used to remaining neutral about politics, avoiding shellfish at all costs, and giving any gifts she receives to the queen for approval.\n\nNext: She hasn’t been scared away just yet.\n\nShe seems to be fitting in already\n\nMarkle appears comfortable in the limelight. | Jeremy Selwyn – WPA Pool/Getty Images Markle appears comfortable in the limelight. | Jeremy Selwyn – WPA Pool/Getty Images\n\nBased on what we’ve seen so far, Markle is already settling into her new royal life. She’s reportedly already good friends with Kate Middleton, who similarly had to undergo the transition from commoner to royal.\n\nConsidering Markle’s fame prior to becoming engaged to Harry, she’s had plenty of experience being in the public eye. At as she’s begun to attend more and more royal events, she’s proven to be completely comfortable with being photographed. So comfortable, in fact, that she stares straight into the camera — which even Middleton doesn’t do.\n\nNext: She’s already made these major life changes.\n\nShe knew what she was getting herself into\n\nWe think Markle is prepared. | We think Markle is prepared. | Kensington Royal via Instagram\n\nMarkle had to undergo some serious etiquette training, and she learned some ground rules from her hubby. She quit her career as an actress and moved to England to immerse herself in her new royal life in the months prior to the wedding.\n\nEven if Oliver doesn’t think Markle’s made the right choice, it seems like she knew exactly what she has gotten herself into.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-smiling-as-she-holds-a-bouquet.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Prince-Harry-and-Meghan-Markle-engagement-photo-e1514400474670.png?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Kate-Middleton-and-Meaghan-Markle.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/meghan-markle-suits-rachel-wedding-dress.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-157652210.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/the-1-surprising-reason-john-oliver-wouldnt-blame-meghan-markle-for-calling-off-the-royal-wedding.html/", "title": "The 1 Surprising Reason John Oliver Wouldn’t Blame Meghan Markle for Calling Off the Royal Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/the-1-surprising-reason-john-oliver-wouldnt-blame-meghan-markle-for-calling-off-the-royal-wedding.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "John Oliver may be the only person who wasn't excited for the royal wedding. Here's why the talk show host wouldn't have blamed Meghan Markle for calling it off.", "og": {"locale": "en_US", "type": "article", "title": "The 1 Surprising Reason John Oliver Wouldn’t Blame Meghan Markle for Calling Off the Royal Wedding", "description": "John Oliver may be the only person who wasn't excited for the royal wedding. Here's why the talk show host wouldn't have blamed Meghan Markle for calling it off.", "url": "https://www.cheatsheet.com/entertainment/the-1-surprising-reason-john-oliver-wouldnt-blame-meghan-markle-for-calling-off-the-royal-wedding.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-21T19:36:25-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "royals", "section": "Entertainment", "published_time": "2018-05-18T13:42:00-04:00", "modified_time": "2018-05-21T19:36:25-04:00"}, "twitter": {"card": "summary_large_image", "description": "John Oliver may be the only person who wasn't excited for the royal wedding. Here's why the talk show host wouldn't have blamed Meghan Markle for calling it off.", "title": "The 1 Surprising Reason John Oliver Wouldn’t Blame Meghan Markle for Calling Off the Royal Wedding", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2014/12/John-Oliver.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1526665320.0, "source": "https://www.cheatsheet.com", "summary": ""}