{"url": "https://web.archive.org/web/20080406090504/http://www.citizenlink.org:80/focusaction/updates/A000006979.cfm", "text": "What does it take to be the most liberal member of the United States Senate – farther left than Ted Kennedy, John Kerry or even Hillary Clinton?\n\nDear Friend,\n\nWhat does it take to be the most liberal member of the United States Senate – farther left than Ted Kennedy, John Kerry or even Hillary Clinton? For the answer, take a look at a man who could be the next president of the United States: Barack Obama.\n\nSen. Obama was recently named the most liberal U.S. Senator, based on the annual voting analysis by the non-partisan and highly respected National Journal.1 If he emerges as the Democratic nominee, one of the critical jobs of Focus Action will be to uncover the real Barack Obama—not the feel-good orator who speaks of “change” and “hope,” but the man who would be the most left-wing president in our nation’s history. And we’ll need your continued help to do so.\n\nObama: As extreme as they come on family issues\n\nOn abortion, Obama’s 100 percent lifetime voting record from Planned Parenthood and NARAL only begins to tell the story.2\n\nWhile in the Illinois State Senate six years ago, Obama was the only senator to speak against the Born Alive Infant Protection Act, which protects babies who are born alive after a failed abortion. In other words, it prevents flat-out infanticide. A year later— while the U.S. Senate was passing Born Alive 98-0 – state Sen. Obama quietly killed an identical bill in the state committee he chaired! 3\n\nNot surprisingly, then, he also opposes the ban on partial-birth abortion 4, 5 and supports allowing minor girls to be transported across state lines for abortions without parental notice or consent. 6\n\nand supports allowing minor girls to be transported across state lines for abortions without parental notice or consent. Perhaps most chilling is his avowed support for the Freedom of Choice Act, 7 which, if signed into law, would threaten every pro-life law passed at the state and federal levels over the past 30 years.\n\nwhich, if signed into law, would threaten every pro-life law passed at the state and federal levels over the past 30 years. In addition, while the next president could effectively overturn Roe v. Wade with the right Supreme Court appointments, Obama is proudly committed to appointing judges who will uphold legal abortion.8 In fact, his judicial philosophy is typical of the radical left. He believes that judges can change the meaning of the Constitution at their discretion.9 Not surprisingly, he voted against the nominations of Justices John Roberts and Samuel Alito.\n\nHow about marriage and the homosexual agenda?\n\nFirst, he opposes the federal Defense of Marriage Act (DOMA). 10 If given the chance by the liberal Congress, Obama will overturn DOMA, potentially forcing every state to recognize homosexual “marriages” and guaranteeing that you and I pay federal benefits to support homosexual couples. Please note: Technically, he says he is “opposed” to same-sex “marriage,” but by standing against DOMA, he is standing against the only thing that prevents same-sex marriages from spreading state to state.\n\nIf given the chance by the liberal Congress, Obama will overturn DOMA, potentially forcing every state to recognize homosexual “marriages” and guaranteeing that you and I pay federal benefits to support homosexual couples. Please note: Technically, he says he is “opposed” to same-sex “marriage,” but by standing against DOMA, he is standing against the only thing that prevents same-sex marriages from spreading state to state. Second, he has pledged to homosexual leaders that he will sign the Employment Non-Discrimination Act 11 (forcing businesses to defend themselves against discrimination lawsuits should they not hire a particular candidate who then announces he or she is homosexual or transsexual). He also supports hate-crimes expansion (potentially putting churches at risk if they preach the truth about homosexuality).\n\n(forcing businesses to defend themselves against discrimination lawsuits should they not hire a particular candidate who then announces he or she is homosexual or transsexual). He also supports hate-crimes expansion (potentially putting churches at risk if they preach the truth about homosexuality). Then there’s his support for teaching schoolchildren (in 2nd grade, no less) about homosexual relationships.12 He also wants to require women to register for the draft.13 And, as a state senator, he even refused to support a measure to stop sex businesses from opening near schools or places of worship!14\n\nThe price of “change”: Hold on to your wallet!\n\nSen. Obama talks constantly about the need for “change.” But what he doesn’t tell you is the price tag, so allow me: It will be very expensive change.\n\nHe supports raising taxes to pay for universal health care, his free college program and a host of other government expansions.15 Among his pet projects is a bill he sponsored called the Global Poverty Act, which would commit the U.S. to spending 0.7 percent of gross national product on foreign aid. Over 13 years, that will amount to a whopping $845 billion increase over current foreign-aid spending!16 Get your checkbooks ready!\n\nNational security?\n\nOne area where Sen. Obama seems to have an aversion to spending is the War on Terror. But it’s not just the admittedly controversial war in Iraq where Obama has shown himself to be soft on terror:\n\nHe has repeatedly voted against funding our troops in Iraq—unless the funding included a date certain by which our soldiers must withdraw from their fight against al Qaeda. 17 Even with the troop surge producing superb results, Obama has called both the surge and the war a failure. 18, 19 In fact, he and Hillary seem to be in a rhetorical contest to see who can abandon the battlefield first.\n\nEven with the troop surge producing superb results, Obama has called both the surge and the war a failure. In fact, he and Hillary seem to be in a rhetorical contest to see who can abandon the battlefield first. He, along with Hillary, voted to give captured terrorists and illegal immigrants constitutional rights that are reserved for American citizens. 20 Can you believe that Sen. Obama actually favors granting citizenship to illegal immigrants convicted of crimes against children, aggravated felonies and other serious crimes? 21 It's true.\n\nCan you believe that Sen. Obama actually favors granting citizenship to illegal immigrants convicted of crimes against children, aggravated felonies and other serious crimes? It's true. Perhaps, then, it should come as no surprise that Obama also voted against a resolution proposing a constitutional amendment to protect the American flag from desecration.22\n\nOne has to ask: Did he learn anything from 9/11?\n\nDitto for Hillary?\n\nOn most of the issues I’ve mentioned, Hillary isn’t far behind Obama’s extremism. In fact, she ranked as the 16th most liberal senator in National Journal’s scoring.23 But the reality is that most people know about Hillary. They remember her push for government-run health care.24 They know of her radical pro-abortion stance.25 They may even recall her support for allowing young children to sue their parents.26\n\nObama, though, is the new kid on the block. In fact, a little more than three years ago, he was still an Illinois state senator. Now, the media is fawning over him … and isn’t about to delve into his leftist record.\n\nThat’s why Focus Action—with your help—needs to sound the alarm. Whoever the Democrat nominee is, the truth about their stands needs to be told in clear, bold colors. And, of course, the pros and cons of the Republican candidate need to be laid out as well.\n\nFocus Action is blessed to have some great channels to communicate the truth to the American public. From radio programs to mailings to webcasts to advertisements of all sorts, we have the vehicles to get the word out. But your gifts are needed to provide the fuel to make those vehicles run—so we can inform millions of voters, not just in the presidential race, but in the critical contests for House and Senate as well.\n\nThroughout our history, great Americans have stood up to grave challenges of all sorts. As this latest wave of secular liberalism threatens us, I look forward to standing shoulder to shoulder with you in prayer and action – in defense of the family.\n\nSincerely,\n\nTom Minnery\n\nSenior Vice President\n\nGovernment and Public Policy\n\nP.S. We continue to get strong reviews from many of you about our live “webcasts” on the presidential race. If you haven't yet had a chance to view these webcast, I hope you'll take advantage of our pro-family perspective on the candidates – a perspective you won't find in the mainstream media! Thanks for partnering with us to make it all happen!\n\nFOOTNOTES:\n\n1 http://nj.nationaljournal.com/voteratings/\n\n2 http://www.votesmart.org/issue_rating_category.php?can_id=9490\n\n3 http://www.cnsnews.com/ViewCommentary.asp?Page=/Commentary/\n\narchive/200801/COM20080109b.html\n\n4 http://www.reuters.com/article/politicsNews/idUSN1726757620070718\n\n5 http://www.msnbc.msn.com/id/5654128/\n\n6 http://www.ontheissues.org/2008/Barack_Obama_Abortion.htm\n\n7 http://www.barackobama.com/2008/01/22/obama_statement_on_35th_annive.php\n\n8 http://www.barackobama.com/2008/01/22/obama_statement_on_35th_annive.php\n\n9 http://www.ontheissues.org/Social/Barack_Obama_Abortion.htm\n\n10 http://blogs.abcnews.com/politicalradar/2007/08/would-obama-pos.html\n\n11 http://a4.g.akamai.net/f/4/19675/0/newmill.download.akamai.com/\n\n19677/anon.newmediamill/pdfs/obama.pdf\n\n12 http://www.foxnews.com/story/0,2933,298307,00.html\n\n13 http://www.ontheissues.org/Archive/2007_YouTube_Dems_Homeland_Security.htm\n\n14 http://mediamatters.org/items/200802280007\n\n15 http://www.usatoday.com/news/politics/2007-05-29-obama-health_N.htm (Note: this link was accessed in 2007; link de-activated 2008)\n\n16 http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=56405\n\n17 http://www.dailykos.com/storyonly/2007/9/16/20342/2239\n\n18 http://www.ontheissues.org/International/Barack_Obama_War_+_Peace.htm\n\n19 http://www.nytimes.com/2007/08/22/us/politics/22vets.html\n\n20 http://nj.nationaljournal.com/voteratings/votes.htm\n\nhttp://www.votesmart.org/issue_keyvote_detail.php?cs_id=15833&can_id=9490\n\n21 http://www.votesmart.org/issue_keyvote_detail.php?cs_id=15833&can_id=9490\n\n22 http://www.senate.gov/legislative/LIS/roll_call_lists/roll_call_vote_cfm.cfm\n\n?congress=109&session=2&vote=00189\n\n23 http://nj.nationaljournal.com/voteratings/votes.htm\n\n24 http://www.time.com/time/politics/article/0,8599,1662655,00.html\n\n25 http://www.votesmart.org/issue_rating_category.php?can_id=55463\n\n&type=category&category=2&go.x=9&go.y=11\n\n26 http://query.nytimes.com/gst/fullpage.html?res=9E0CEEDC153DF930A15754C0A964958260\n\n&sec=&spon=&pagewanted=all", "images": ["https://web.archive.org/web/20080406090504im_/http://www.citizenlink.org/images/citizenmag/issues/200804.jpg", "https://web.archive.org/web/20080406090504im_/http://www.citizenlink.org/focusaction/images/mem_update_images/minnery-sig-red.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Focus Action: March 2008 Action Update", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}