{"url": "www.inquisitr.com/3927558/caitlyn-jenner-pushing-kanye-west-for-presidency-campaign-amid-kardashian-backlash-over-trump-support/", "text": "Caitlyn Jenner is reportedly pushing Kanye West to run his own presidential campaign in 2020.\n\nJenner, who has become somewhat distant to the rest of the Kardashian family in recent years, has remained on good terms with West, it’s been claimed, with Radar Online adding that the two have particularly bonded over their views regarding politics.\n\nWhile Kanye made it perfectly clear at one of his concerts back in November that he did not vote during the election, the rapper has certainly been favoring Trump in recent weeks, having even accepted an invitation to meet up with the president in New York, back in December.\n\n[Image by Kevin Winter/Getty Images]\n\nThe father-of-two later revealed that the meeting was rather positive, insinuating that he was actively working with Donald Trump to make America great again, a slogan that has been used throughout the 70-year-old’s campaign for the presidential position.\n\nWith this in mind, Caitlyn Jenner reportedly doesn’t see anyone better to fill Trump’s position than Kanye, a source tells Radar Online.\n\nCaitlyn is brutally honest with Kanye, stressing that he stands a chance to make it into the White House — and when he does, it will be him sitting in the Oval Office, making decisions on behalf of the nation.\n\nIt’s been a conversation that’s really brought the twosome closer, and Jenner certainly seems to be the motivation that Kanye has needed to take it more seriously. Whenever Jenner and West get together, the political talk has only made the troubled rapper more determined about his forthcoming run to win the presidential election in 2020.\n\n“Caitlyn Jenner is just the latest reality TV star with political ambitions. But according to an insider, it’s not Jenner herself who will be campaigning for office. Instead, a source told Radar, she’s got her sights set on helping Kanye West make America great again,” the outlet notes.\n\n“Jenner shocked the world when she attended President Donald Trump’s inauguration in Washington DC last week, with not a single family member by her side. West has spoken out in support of the President and even met with him in DC. Jenner now sees him as her ticket into the world of politics.”\n\nCaitlyn Jenner’s political views are what has reportedly seen her relationship with the Kardashians crumble in recent months. The family had already been distant toward Jenner prior to her publicly admitting to being a Trump supporter, but her decision to be so passionate about wanting the 70-year-old in the White House made the likes of Kim and Khloe Kardashian back away from their stepfather.\n\n[Image by Kevork Djansezian/Getty Images]\n\nNobody in the Kardashian household supported Caitlyn’s move to attend Trump’s inauguration, last week, The Hollywood Gossip alleges.\n\nThings have been very rocky between the Kardashians and Caitlyn, so much that the only person that the reality star still has a close relationship with is Kanye West.\n\nIt’s further stressed that Kim isn’t happy about Jenner’s influence on her husband of two years. The 36-year-old doesn’t like the supposed fact that Caitlyn is so determined into getting Kanye thinking he will become the next president of the United States.\n\nWhile Kim is aware that West has wanted to give his presidential campaign a try, Kanye has refrained himself from talking about it until Caitlyn Jenner started bringing it up again — to the point where the “Stronger” superstar is constantly talking about politics and his plans to win the election in 2020.\n\n“Caitlyn and Kanye have bonded a lot over President Trump… Of course, Kim does not want Kanye to run for President! She does not want the humiliation of him ever running for any office.”\n\nWhat do you make of this? Is Caitlyn Jenner trying too hard to convince Kanye West he stands a chance of winning the election in 2020?\n\n[Featured Image by Kevin Winter/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/01/caitlyn-jenner-glamour-red-carpet.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/2146221c3bb32c670d1053a99949feba?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/caitlyn-jenner-mel-gibson-movie-premiere.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/caitlyn-jenner-kanye-west-president-election.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Maurice Cassidy"], "canonical_link": "https://www.inquisitr.com/3927558/caitlyn-jenner-pushing-kanye-west-for-presidency-campaign-amid-kardashian-backlash-over-trump-support/", "title": "Caitlyn Jenner Pushing Kanye West For Presidency Campaign Amid Kardashian Backlash Over Trump Support", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}