{"url": "www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html", "text": "Jamie McCarthy\n\nAlbum art forThe Life of Pablo\n\n1. “Ultralight Beam”\n\n\n\nRight from the top, “Ultralight Beam” seems to signal to listeners that TLOP will be the anti-Yeezus. It even begins with a literal casting-out of devils: A recording of a young girl (apparently taken from Instagram), saying, “We don’t want no devils in the house! We want the Lord!”\n\n\n\nThe exorcism performed, the track quickly moves into the prophesied gospel: “We on an ultra light beam … This is a God dream … This is everything,” West sings. Though the track, a clear highlight, is packed with guests, the runaway star is Chance the Rapper. Even setting aside the rising star’s overflowing talent, featuring him at the top of the album was a brilliant bit of casting: Not only has Chance started combining hip-hop and gospel himself (the track also features gospel artist and past Chance collaborator Kirk Franklin), but he is a longtime Kanye superfan, for whom finally getting to work for West is itself a sort of religious moment. As Chance says, “I met Kanye West/ I’m never going to fail.”\n\nAdvertisement\n\n\n\n2. “Father Stretch My Hands Pt. 1”\n\nAfter opening with the gospel sounds of Pastor T.L. Barrett’s “Father Stretch My Hands,” this two-parter quickly moves from the sacred to the profane. As Wests raps at the top of the opening verse, over a Metro Boomin beat, “Now if I f--k this model/ And she just bleached her asshole/ And I get bleach on my T-shirt/ I’mma feel like an asshole.”\n\n\n\n3. “Father Stretch My Hands Pt. 2”\n\n\n\nAfter a sample from Street Fighter II (“Perfect!”) brings Part 1 to a close, Part 2 turns confessional, as West reflects on the calamities his family has faced, including his mother’s tragic death, his father’s struggles with money, and his own nearly fatal car crash. The day of the album’s release, West tweeted the lyrics, saying, “I cried writing this. I love my Dad.” But West has always embraced contradictions, and these confessional lyrics play over a repeated sample of “Panda”—a swaggering, a street-tough track from new G.O.O.D. music signee Desiigner—all before a melancholy vocoder coda that sounds like Imogen Heap.\n\n\n\n4. “Famous”\n\nAgain, gospel and cursing, sacred and profane. This one opens with Rihanna singing over church organ, seconds before West delivers what has instantly became the most controversial line on the album: “For all my Southside niggas that know me best/ I feel like me and Taylor might still have sex/ Why? I made that bitch famous.” TMZ cites unnamed sources “directly connected with Swift” to claim that Swift approved the line beforehand, understanding it was just a joke. Swift’s publicist has denied this, saying, “Kanye did not call for approval, but to ask Taylor to release his single ‘Famous’ on her Twitter account.” The publicist continued, “She declined and cautioned him about releasing a song with such a strong misogynistic message,” and added, “Taylor was never made aware of the actual lyric, ‘I made that bitch famous.’ ” For his part, West is more or less sticking by his story:\n\nFirst thing is I’m an artist and as an artist I will express how I feel with no censorship — KANYE WEST (@kanyewest) February 12, 2016\n\n2nd thing I asked my wife for her blessings and she was cool with it — KANYE WEST (@kanyewest) February 12, 2016\n\n3rd thing I called Taylor and had a hour long convo with her about the line and she thought it was funny and gave her blessings — KANYE WEST (@kanyewest) February 12, 2016\n\n4th Bitch is an endearing term in hip hop like the word Nigga — KANYE WEST (@kanyewest) February 12, 2016\n\n5th thing I’m not even gone take credit for the idea… it’s actually something Taylor came up with … — KANYE WEST (@kanyewest) February 12, 2016\n\nShe was having dinner with one of our friends who’s name I will keep out of this and she told him — KANYE WEST (@kanyewest) February 12, 2016\n\nI can’t be mad at Kanye because he made me famous! #FACTS — KANYE WEST (@kanyewest) February 12, 2016\n\nThe rest is, lyrically, fairly straightforward: West raps about being famous and how it makes others jealous. But the sonic collage is all over the place, from the Swizz Beatz beat to the samples of Sister Nancy’s reggae classic “Bam Bam,” to, on the outro, a sample of Nina Simone’s “Do What You Gotta Do.”\n\n\n\n5. “Feedback”\n\nAdvertisement\n\n\n\nThis song finds another way to pun on the idea of the album as gospel: “Y’all heard about the GOOD news?”, referencing the origins of the word gospel in order to make a pun about his own GOOD Music label. West raps over a beat seemingly constructed from audio feedback, one of his best. The subject matter, meanwhile, is wide-ranging, with West telling listeners to “Wake up, nigga, wake up!” Is this a reference to staying woke? It’s hard to say, but, elsewhere on the track, West leaves no room for doubt about his allegiance to Black Lives Matter, rapping, “Hands up, we just doing what the cops taught us/ Hands up, hands up, and the cops shot us.”\n\n\n\n6. “Low Lights”\n\n\n\n“Low Lights” is essentially an extended intro to “Highlights,” with the two tracks returning to the same template set up at the top of the album: “Low Lights” is a jubilant one-minute intro that rejoices in God (albeit over melancholy piano chords, with DJ Mustard-style synth bass slathered on top), before “Highlights” brings things back down to earthly temptations.\n\n\n\n7. “Highlights”\n\n\n\n“Sometimes I’m wishing that my dick had GoPro/ So I could play that shit back in slo-mo/ Just shot an amateur video. I think I should go pro.” That begins to sum up the conceit of the song: for Kanye West, some nights are nothing but highlights.\n\n\n\nFor the most part, this possible first single (West has said that he and Young Thug will perform the song on Saturday Night Live on Saturday) maintains that jocular tone throughout, with memorable lines like “I bet me and Ray J’d be friends,/ if we ain’t love the same bitch./ Yeah, he might have hit it first/ Only problem is: I’m rich.” A reference to Rob Kardashian and Blac Chyna’s sexercise regimen also suggests that this verse was recorded in the last two or three weeks. Of course, West has been making sexercise jokes since the first album, and he ends the song with another new workout plan.\n\n\n\n8. “Freestyle 4”\n\n\n\nRemember when I said that TLOP isn’t all the anti-Yeezus? This “freak dream” would have fit right in on that album and marks the beginning of TLOP’s turn toward more nightmarish material. Like Yeezus’ “I’m in It,” this freaky sex fantasy is a mix of horror sounds (hear those Bernard Herrmann-esque strings?) and explicit lyrics (here they’re mostly about getting it on in public). Surely some fans will, as West later puts it, “miss the old Kanye.”\n\n\n\n9. “I Love Kanye”\n\n\n\nThis charming a-cappella interlude finds West speaking directly to (and for) his fans, as he addresses those who have been disappointed with West’s Yeezus-era sourness and aggression and want the cuddly, soul-sampling Kanye back. He returns to that friendlier mode here, while offering no apologies for his recent work. As he says at the song’s highly quotable closing:\n\nWhat if Kanye made a song about Kanye\n\nCalled “I Miss the Old Kanye”\n\nMan, that would be so Kanye. That’s all it was, Kanye.\n\nWe still love Kanye, and I love you like Kanye loves Kanye.\n\nAdvertisement\n\n\n\n10. “Waves”\n\n\n\nAccording to West, the late addition of this song is the reason the album got delayed an extra day, but the wait was worth it. Another uplifting/vulgar track in the vein of the Chance collaboration that opens the album, “Waves” finds West mixing braggodocious bars (“Step up in this bitch like/ I’m the one your bitch like”) with a more somber message about death, or the legacy of relationships: “Even when somebody go away/ the feelings don't really go away/ That’s just the wave.”\n\nI wrote and arranged and fought for Waves, and I make great decisions. S/o to @chrisbrown I been a fan since day one 💯💯 — Chance The Rapper (@chancetherapper) February 14, 2016\n\n11. “FML”\n\n\n\nThough the title of this one puns on the teen-slang acronym for “F--k my life,” make no mistake: This is a dark song that finds West pondering self-destruction. It’s only appropriate, then, that West also gets an assist from R&B’s leading poet of self-destruction, the Weeknd, who sings the titular phrase on the chorus, “Wish I would go ahead and fuck my life up/ Can’t let them get to me/ And even though I always fuck my life up/ Only I can mention me.” West even makes mention—not for the first time—of the anti-depression and anti-anxiety drug Lexapro, something with which he seems to have personal experience. Before, he complained about the side effects, and this time he talks about what happens when you go off it.\n\n\n\n12. “Real Friends”\n\nThis is the first song from The Life of Pablo that was available in a studio version before, and it doesn’t seem to have undergone any significant changes. As before, it’s a confessional song, with “Blame Game”-esque production (built around another melancholy piano loop). But while “Blame Game” was about a breakup, this one is about the struggle to maintain relationships with friends. Once again, everyone is to blame: West for staying too busy to keep up (“I guess I get what I deserve, don’t I?”), and West’s friends for concealing hidden self-interests.\n\n\n\n13. “Wolves”\n\nThis is another one we’d heard before—both at Yeezy Season 1 and on SNL’s 40th anniversary special—but unlike “Real Friends,” it’s changed a lot. The most notable change is that in place of the old verses from Vic Mensa and Sia, the song now features a new verse from West and an outro from longtime collaborator Frank Ocean. That new verse—delivered over the same blend of heavy, ominous-sounding bass and soaring (howling?) falsetto that anchored the original track—fleshes out the song’s central metaphor. In it, West imagines himself and wife Kim Kardashian as the rap game Joseph and Mary, before worrying about his two children: “Cover Nori in lambs’ wool/ We’re surrounded by wolves … Cover Saint in lambs’ wool/ We’re surrounded by the f--kin’ wolves.”\n\n\n\n14. “Silver Surfer Intermission”\n\n\n\nThis interlude marks the transition from the album West played at MSG to what could almost be considered the deluxe-edition bonus tracks. In itself, it’s not much more than West trying to get the last word on a recent beef: After Wiz Khalifa came at West for naming the album Waves (briefly, before changing it once again), claiming that West was stealing from the so-called “wavy movement” pioneered by Max B., West plays a message from Max B. that gives the album his blessing.\n\n\n\n15. “30 Hours”\n\n\n\nThis late addition, premiered on Friday, opens with a sample of disco producer and composer Arthur Russell’s “Answers Me,” which repeats in various forms throughout. The lyrics start with West’s smoothie-drinking life in the present day before he reflects back on an affair for which he drove 30 hours across the country, and then 30 hours back. An aura of disappointment looms over this flashback (and I’m not just talking about how West’s paramour eats all his Popeye’s), which also finds the rapper referencing Nelly and taking some typically unnecessary shots at an ex. (“My ex says she gave me the best years of her life,” he raps, “I saw a recent picture of her—I guess she was right.”)\n\nAdvertisement\n\n\n\n16. “No More Parties in L.A.”\n\n\n\nIs this back on the album due to popular demand? The long-awaited first collaboration between Kendrick Lamar and Kanye West became a fan favorite after West shared it in mid-January, but it briefly disappeared from West’s ever-evolving tracklists. Thought it’s Lamar who’s known for rapid-fire raps, the Madlib-produced showcase centers around West rattling off rhymes for almost four minutes straight. As he says a few minutes in, “Some fans thought I wouldn’t rap like this again.” I guess this is that “old Kanye”?\n\n17. “Facts” (Charlie Heat Version)\n\nWhile many fans were outraged to see “No More Parties in L.A.” briefly disappear from the tracklist, fewer were sad about the prospect of losing this Nike diss track. In what amounts to a parody of “Jumpman” from Nike pitch man Drake and his collaborator Future (West even borrows the flow), West brags about the success of his Yeezy shoes. That said, as West made extra clear as he debuted the new version of the song (from GOOD music producer Charlie Heat), he has no beef with the original Jumpman himself, Michael Jordan. (Still, he couldn’t help but add: “People come to Madison Square Garden to see me play one-on-no-one.”)\n\n", "images": ["http://www.slate.com/content/dam/slate/blogs/browbeat/2011/09/29/hugo_chavez_caption_contest/the_life_of_pablo.jpg.CROP.promovar-mediumlarge.jpg", "http://www.slate.com/blogs/browbeat/jcr:content/logo.gif", "https://pv.surveywall-api.survata.com/s?eid=2ca7ac88-8963-4abf-acff-c1114097be96", "http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.promo-large.jpg", "http://pixel.quantserve.com/pixel/p-fw53_-Tq3MNK1.gif", "http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.promo-xlarge2.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=18406752&c3=&c4=http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html&c5=&c6=&c15=&cj=1"], "top_img": "http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.promo-large.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html", "title": "Kanye West’s new album The Life of Pablo: A track-by-track breakdown.", "meta_data": {"description": "After three name changes and more than a year of teases, Kanye West premiered his first album since 2013’s Yeezus on Thursday. In an unprecedented even ...", "keywords": "Kanye west, the life of Pablo, Kanye west new album, the life of Pablo review, the life of Pablo leak, the life of Pablo zip, the life of Pablo rar, the live of Pablo rip", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "og": {"title": "Your Guide to Kanye West’s The Life of Pablo—All 18 Tracks of It", "type": "article", "url": "http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html", "image": "http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.promo-large.jpg", "site_name": "Slate Magazine", "description": "After three name changes and more than a year of teases, Kanye West premiered his first album since 2013’s Yeezus on Thursday. In an unprecedented even ..."}, "article": {"publisher": "http://www.facebook.com/Slate", "author": "https://www.facebook.com/forrestwickman"}, "apple-itunes-app": "app-id=357555242, affiliate-data=ct=Smart%20Banner&pt=31813800, app-argument=http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html", "fb": {"app_id": 142011022527753, "pages": "21516776437,711394545628094,56053044701,120640827984,413841452120931,535016903252160,1560656284178338,167180693332391,189846847729626,166438367103268,120285331895306,67474598472,449418205094008,209239152886928,614061598677636"}, "twitter": {"card": "summary_large_image", "site": "@slate", "creator": "@forrestw", "url": "http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html", "title": "Your Guide to Kanye West’s <em>The Life of Pablo</em>—All 18 Tracks of It", "description": "After three name changes and more than a year of teases, Kanye West premiered his first album since 2013’s Yeezus on Thursday. In an unprecedented even ...", "image": "http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.promo-large.jpg"}, "tw-line": "Kanye West’s #TheLifeOfPablo: A complete track-by-track breakdown.", "fb-share": "The “album of the life” is here.", "google-site-verification": "jXqoqqPSmx_PWchRdG-IXu-X616Ee2Ptf_AiElI9LzQ", "parsely-page": "{\n  \"title\": \"Your Guide to Kanye West\\u2019s The Life of Pablo\\u2014All 18 Tracks of It\",\n  \"link\": \"http://www.slate.com/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown.html\",\n  \"image_url\": \"http://www.slate.com/content/dam/slate/blogs/browbeat/2016/02/14/kanye_west_s_new_album_the_life_of_pablo_a_track_by_track_breakdown/509641972-kanye-west-performs-during-kanye-west-yeezy-season-3-on.jpg.CROP.thumbnail-small.jpg\",\n  \"type\": \"post\",\n  \"post_id\": \"205160214002\",\n  \"pub_date\": \"2016-02-14T09:04:00Z\",\n  \"section\": \"Brow Beat\",\n  \"authors\": [\"Forrest Wickman\"],\n  \"tags\": [\n    \"kanye west\",\n    \"music\",\n    \"AdNode:blogs/browbeat\",\n    \"Section:Arts\"\n  ]\n}"}, "movies": [], "publish_date": 1455379200.0, "source": "http://www.slate.com", "summary": ""}