{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "text": "Andrew Lincoln has officially left The Walking Dead – but will return as Rick Grimes in a trilogy of films.\n\nThe actor finally called time on the series’ long-time leader Rick Grimes, having played the hero since the very first episode aired in 2010, in an episode that was just as emotional as fans were expecting.\n\nWhile it may be considered an ensemble piece, there’s no denying that The Walking Dead without Rick is going to be a very different show – and whether he’ll die or walk off into the sunset remains to be seen.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nWhile it’s been known for months now that Grimes is going, the furore surrounding his exit has overshadowed one of the most important questions of all: why exactly is Andrew Lincoln leaving?\n\nNews first surfaced of Lincoln’s departure in May, with Collider reporting that his character - along with Lauren Cohan’s Maggie Rhee - was to be phased out of the show during its current ninth season.\n\nLincoln confirmed the news three months later, showing up to Comic-Con in San Diego to say goodbye to the show’s most dedicated fans. This is what he had to say:\n\n“This will be my last season playing the role of Rick Grimes. It means everything to me. I love the people who make this show. I’m particularly fond of the people who watch this show. My relationship with Mr Rick Grimes is far from over.”\n\nThe British actor explained that his decision stemmed from wanting to spend more time with his family back in the UK, having been forced to continually relocate to Georgia for filming since the show began.\n\nSpeaking to EW Radio, he said: “I have two young children, and I live in a different country, and they become less portable as they get older. It was that simple. It was time for me to come home.”\n\nOther sources, however, have suggested that Lincoln’s decision to leave runs deeper – and may have been a consequence of former showrunner Scott Gimple unexpectedly writing his on-screen son Chandler Riggs out of the show during its eighth season.\n\nTom Payne, who plays Jesus, told Digital Spy: “I think when Carl died last year and Chandler left, I think that was a moment for him of: ‘OK, where does this leave Rick? And how does he move forward?’ I think that was a pause for thought.”\n\nRiggs refuted this, however, while speaking to Metro, revealing that Lincoln had been planning to quit for some time.\n\nHe said: “When I heard [the news], I honestly wasn’t too surprised because we talked about him leaving for a while. He had brainstormed a lot of really cool ideas behind it.\n\n“He misses his family,” Riggs continued. “He leaves every single year for like seven months to go do this show. After a while, you want to raise your kids and spend time with your wife. It was definitely really hard on him and I’m super, super happy for him to be able to raise his family, and do more cool things that he’d always talked about doing that he was never really able to do.”\n\nPayne stated he wouldn’t be surprised if Lincoln was simply tired of being put through the emotional ringer. Across its nine seasons, the character has lost his closest friends and family in traumatic ways and has faced constant distress.\n\n“If you look at all of the work that Andy’s done – [he] has been in floods of tears, with snot hanging out of his nose, and he’s exhausted and covered in blood. Psychologically and physically, that’s got to take its toll on you.”\n\nShape Created with Sketch. The 50 best TV shows on Netflix UK Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 50 best TV shows on Netflix UK 1/50 Bojack Horseman A cartoon about a talking horse, starring the goofy older brother from Arrested Development… on paper little about BoJack Horseman screams “must watch”. Yet the series almost immediately transcended its format to deliver a moving and very funny rumination on depression and middle-age malaise. Will Arnett plays BoJack – one time star of Nineties hit sitcom Horsin’ Around – as a lost soul whose turbo-charged narcissism prevents him getting his life together. Almost as good are a support cast including Alison Brie (Glow, Mad Men), Aaron Paul, of Breaking Bad, and Amy Sedaris as a pampered Persian cat who is also BoJack’s agent. Season five touches the live rail of harassment in the movie industry, offering one of the most astute commentaries yet on the #MeToo movement with an episode based centred around an awards ceremony called “The Forgivies”. The sixth and final series was split in two, with part one debuting on 25 October and part two on 31 January 2020. Netflix 2/50 Stranger Things A valentine to the Spielberg school of Eighties blockbuster, with Winona Ryder as a small town mom whose son is abducted by a transdimensional monster. ET, Goonies, Close Encounters, Alien and everything Stephen King wrote between 1975 and 1990 are all tossed into the blender by Millennial writer-creators the Duffer brothers. It was clear Stranger Things was going to be a mega-smash when Barb – the “best friend” character eaten in the second episode – went viral the weekend it dropped. Netflix 3/50 Daredevil Netflix’s Marvel shows tend towards the overlong and turgid. An exception is the high-kicking Daredevil, with Charlie Cox’s blind lawyer/crimefighter banishing all memory of Ben Affleck's turn donning the red jumpsuit in 2003. With New York’s Hell’s Kitchen neighbourhood as backdrop, Daredevil is caked in street-level grit and features a searing series one performance by Vincent D'Onofrio as the villainous Kingpin. The perfect antidote to the deafening bombast of the big screen Marvel movies. Netflix 4/50 The Staircase Did he do it? Does it matter considering the lengths the Durham, North Carolina police seemingly went in order to stitch him up? Sitting through this twisting, turning documenting about the trial of Michael Peterson – charged with the murder in 2003 of his wife – the viewer may find themselves alternately empathising with and recoiling from the accused. It’s a feat of bravura factual filmmaking from French documentarian Jean-Xavier de Lestrade, which comes to Netflix with a recently shot three-part coda catching up with the (very weird) Peterson clan a decade on. Netflix 5/50 Dark Stranger Things: the Euro-Gloom years. Netflix’s first German-language production is a pulp romp that thinks it’s a Wagner opera. In a remote town surrounded by a creepy forest locals fear the disappearance of a teenager may be linked to other missing persons cases from decades earlier. The timelines get twisted and it’s obvious that something wicked is emanating from a tunnel leading to a nearby nuclear power plant. Yet if the story sometimes trips itself up the Goonies-meets-Götterdämmerung ambiance keeps you hooked. Netflix 6/50 A Series of Unfortunate Events The wry and bleak Lemony Snickett children novels finally get the ghastly adaptation they deserve (let’s all pretend the dreadful 2004 Jim Carrey movie never happened). Neil Patrick Harris gobbles up the scenery as the vain and wicked Count Olaf, desperate to separate the Baudelaire orphans from their considerable inheritance. The look is Tim Burton by way of Wes Anderson, and the dark wit of the books is replicated perfectly (Snickett, aka Daniel Handler, is co-producer). Netflix 7/50 Maniac If you’re curious as to how Cary Fukunaga will handle the Bond franchise, his limited series, starring Emma Stone and Jonah Hill, drops some delicious hints. It’s a mind-bending sci-fi story set in an alternative United States where computers still look like Commodore 64s and in which you pay for goods by having a “travel buddy” sit down and read you adverts. Stone and Hill are star-crossed outcasts participating in a drugs trial that catapults them into a series of trippy genre excursions – including an occult adventure and a Lord of the Rings-style fantasy. It is here that Fukunaga demonstrates his versatility, handling potentially hokey material smartly and respectfully. 007 fans can sleep easy. Netflix 8/50 Better Call Saul The Breaking Bad prequel is starting to outgrow the show that spawned it. Where Breaking Bad delivered a master-class in scorched earth storytelling Saul is gentler and more humane. Years before the rise of Walter White, the future meth overlord’s sleazy lawyer, Saul Goodman, is still plain old Jimmy McGill, a striving every-dude trying to catch a break. But how far will he go to make his name and escape the shadow of his superstar attorney brother Chuck (Michael McKean)? Season five has just arrived and journeys even deeper into the Breaking Bad expanded universe. AMC Studios/Netflix 9/50 Black Mirror Don’t tell Channel 4 but Charlie Brooker’s dystopian anthology series has arguably got even better since making the jump from British terrestrial TV to the realm of megabucks American streaming. Bigger budgets have given creators Brooker and Annabel Jones license to let their imaginations off the leash – yielding unsurpassable episodes such as virtual reality love story \"San Junipero\" and Star Trek parody \"USS Callister\", which has bagged a bunch of Emmys. Netflix 10/50 Mindhunter David Fincher produces this serial killer drama based on the writings of a real-life FBI psychological profiler. It’s the post-Watergate Seventies and two maverick G-Men (Jonathan Groff and Holt McCallany) are going out on a limb by utilising the latest psychological research to get inside the heads of a motley assembly of real-life sociopathic murders – including the notorious “Co-Ed” butcher Ed Kemper, brought chillingly to live in an Emmy-nominated performance by Cameron Britton. Netflix 11/50 The Crown A right royal blockbuster from dramatist Peter Morgan (The Queen, Frost / Nixon). Tracing the reign of Elizabeth II from her days as a wide-eyed young woman propelled to the throne after the surprise early death of her father, The Crown humanises the royals even as it paints their private lives as a bodice-ripping soap. Matt Smith is charmingly roguish as Prince Philip and Vanessa Kirby has ascended the Hollywood ranks on the back of her turn as the flawed yet sympathetic Princess Margaret. Most impressive of all, arguably, is Claire Foy, who plays the Queen as a shy woman thrust unwillingly into the spotlight. Foy and the rest of the principal cast have now departed, with a crew of older actors – headed by Olivia Colman and Tobias Menzies – taking over as the middle-aged Windsors for season three. They’ll be around for season four too. And then the grand endeavour closes with Imelda Staunton as Elizabeth in her twilight years. Netflix 12/50 Narcos This drug trafficking caper spells out exactly what kind of series it is with an early scene in which two gangsters zip around a multi-level carpark on a motorbike firing a machine gun. Narcos, in other words, is for people who consider Pacino’s Scarface a touch too understated. Series one and two feature a mesmerising performance by Wagner Moura as Columbian cocaine kingpin Pablo Escobar, while season three focuses on the notorious Cali cartel. Reported to be one of Netflix’s biggest hits – the company doesn’t release audience figures – it turns its attention in its fourth and fifth season to Mexico’s interminable drugs wars, with Diego Luna playing Guadalajara cartel honcho Miguel Gallardo. Juan Pablo Gutierrez/Netflix 13/50 Master of None A cloud hangs over Aziz Ansari’s future after he was embroiled in the #MeToo scandal. But whatever happens, he has left us with a humane and riveting sitcom about an Ansari-proximate character looking for love and trying to establish himself professionally in contemporary New York. K.C. Bailey / Netflix 14/50 Bloodline One of Netflix’s early blockbusters, the sprawling soap opera updates Dallas to modern day southern Florida. Against the edge-of-civilisation backdrop of the Florida Keys, Kyle Chandler plays the local detective and favourite son of a well-to-do family. Their idyllic lives are thrown into chaos with the return of the clan’s black sheep (an unnervingly intense Ben Mendelsohn). The story is spectacularly hokey but searing performances by Chandler and Mendelsohn, and by Sissy Spacek and the late Sam Shepard as their imperious parents, make Bloodline compelling – a guilty pleasure that, actually, you shouldn’t feel all that guilty about. Rod Millington/Netflix 15/50 The Alienist You can almost smell the shoddy sanitation and horse-manure in this lavish murder-mystery set in 19th New York. We’re firmly in Martin Scorsese's Gangs of New York territory, with a serial killer bumping off boy prostitutes across Manhattan. Enter pioneering criminal psychologist Dr Laszlo Kreisler (Daniel Brühl), aided by newspaper man John Moore (Luke Evans) and feisty lady detective Sara Howard (Dakota Fanning). Kurt Iswarienko 16/50 Love Judd Apatow bring his signature gross-out comedy to the small screen. Love, which Apatow produced, is a masterclass in restraint compared to 40 Year Old Virgin, Knocked Up etc. Paul Rust is Gus, a nerdish movie set tutor, whose develops a crush on Gillian Jacobs’s too-cool-for-school radio producer Mickey. Romance, of a sort, blossoms – but Love’s triumph is to acknowledge the complications of real life and to disabuse its characters of the idea that there’s such a thing as a straightforward happy ending. Hipster LA provides the bustling setting. Netflix 17/50 Queer Eye Who says reality TV has to be nasty and manipulative? This updating of the early 2000s hit Queer Eye for the Straight Guy has five stereotype-challenging gay men sharing lifestyle tips and fashion advice with an engaging cast of All American schlubs (the first two seasons are shot mostly in the state of Georgia). There are laughs – but serious moment too, such as when one of the crew refuses to enter a church because of the still unhealed scars of his strict Christian upbringing. Netflix 18/50 Chef’s Table A high-gloss revamping of the traditional TV food show. Each episode profiles a high wattage international chef; across its three seasons, the series has featured gastronomic superstars from the US, Argentina, India and Korea. Charles Panian/Netflix 19/50 Arrested Development A disastrous group interview in which actor Jason Bateman “mansplained” away the bullying co-star Jessica Walter had suffered at the hands of fellow cast-member Jeffrey Tambor meant season five of Arrested Development was fatally compromised before it even landed. Yet Netflix’s return to the dysfunctional world of the Bluth family stands on its merits and is a worthy addition to the surreal humour of seasons one through three (series four, which had to work around the busy schedules of the cast, is disposable by comparison). Netflix 20/50 Altered Carbon Netflix does Bladerunner with this sumptuous adaptation of the cult Richard Morgan novel. The setting is a neon-splashed cyberpunk future in which the super-wealthy live forever by uploading the consciousness into new “skins”. Enter rebel-turned-detective Takeshi Kovacs (Joel Kinnaman), hired to find out who killed a (since resurrected) zillionaire industrialist while dealing with fallout from his own troubled past. Rumoured to be one of Netflix’s most expensive projects yet, its second run sees Anthony Mackie (aka Marvel’s Falcon) replace Kinnaman as the shape-shifting Kovacs. He’s a perfect fit for the part too, delving into the inner turmoil of a character who accumulates a multitude of ghosts across his endless lifespan. Netflix 21/50 Rick and Morty Dan Harmon, creator of cult sitcom Community (also on Netflix), finds the perfect outlet for zany fanboy imagination with this crazed animated comedy about a Marty McFly/Doc Brown-esque duo of time travellers. Every genre imaginable is parodied with the manic energy and zinging dialogue we have come to expect from Harmon. Netflix/Adult Swim 22/50 GLOW Mad Men’s Alison Brie is our entry point into this comedy-drama inspired by a real life all-female wrestling league in the Eighties. Ruth Wilder (Brie) is a down-on-her luck actor who, out of desperation, signs up a wrestling competition willed into being by Sam Sylvia (podcast king Marc Maron). Britrock singer Kate Nash is one of her her fellow troupe members: the larger than life Rhonda “Britannica” Richardson. Netflix 23/50 Archer Deadpan animated satire about an idiot super spy with shaken and stirred mother issues. One of the most ambitious modern comedies, animated or otherwise, Archer tries on different varieties of humour for size and even occasionally tugs at the heart strings. 24/50 Ozark Breaking Bad for those with short attention spans. The saga of Walter White took years to track the iconic anti-hero’s rise from mild mannered everyman to dead-eyed criminal. Ozark gets there in the first half hour as nebbish Chicago accountant Marty Byrde (Jason Bateman) agrees to serve as lieutenant for the Mexican mob in the hillbilly heartlands of Ozark, Missouri (in return they thoughtfully spare his life). Bateman, usually seen in comedy roles, is a revelation as is Laura Linney as his nasty wife Wendy. There is also a break-out performance by Julia Garner playing the scion of a local redneck crime family. Bateman recently won a best director Emmy for his work on the series, seizing the gong from beneath the noses of Game of Thrones’s David Benioff and DB Weiss. Season three is due in March 2020. Netflix 25/50 The Good Place A heavenly comedy with a twist. Eleanor Shellstrop (Kristen Bell) is a cynical schlub waved through the Pearly Gates by mistake after dying in a bizarre supermarket accident. There she must remain above the suspicions of seemingly well-meaning but disorganised angel Michael (Ted Danson) whilst also negotiating fractious relationships with do-gooder Chidi (William Jackson Harper), spoiled princess Tahani (former T4 presenter Jameela Jamil) and ex-drug dealer Jason (Manny Jacinto). Netflix 26/50 Disenchantment It’s been forever and a few years since The Simpsons was even vaguely essentially viewing. But Matt Groening’s Homer mojo clearly hasn’t abandoned him yet. His Netflix series, just back for a second season, is a hilarious pastiche of fantasy tropes, with Abbi Jacobson as a hard-drinking princess, Eric Andre and Nat Faxon as her demon pal and elf sidekick and Matt Berry as – to quote Wikipedia – “Prince Merkimer, from the kingdom of Bentwood, who is arranged to marry [Princess] Bean, but was turned into a pig”. Netflix 27/50 Top Boy Netflix has been binning shows as if it is going out of fashion. But that didn’t stop Drake from persuading it to revive the Channel 4 drama about rival drug dealers in a fictional south London neighbourhood. Middle-aged Irishman Ronan Bennett captures the reality of life for many young black British people with tremendously sensitivity, while the cast is headed by Ashley Walters, Kane “Kano” Robinson, rapper Little Simz and Mercury Prize winner Dave. Netflix 28/50 Unbelievable A police procedural adapted from a long-form magazine exposé of American justice’s entrenched misogyny sounds like nobody’s idea of a fun night in. But Unbelievable makes serious points about how sufferers of sexual assault are marginalised and victim-blamed while also drawing the viewer into a compelling mystery. Unflinching yet never gratuitous, it stars Toni Collette and Merritt Wever as hard-bitten detectives investigating a serial rapist. Booksmart’s Kaitlyn Dever, meanwhile, plays a young woman wrongly accused of crying wolf when a man attacks her in her apartment. Netflix 29/50 Russian Doll Time becomes a loop in this sci-fi parable about a troubled New Yorker who finds herself reliving the final hours of her life over and over. Is the cosmos itself trying to tell her something? Or is she simply losing her marbles. Natasha Lyonne excels as damaged, potty-mouthed Nadia. Her improbable love interest is played by Charlie Barnett. Netflix 30/50 The Umbrella Academy Gerard Way’s surreal comic book has translated impressively to the screen. Umbrella Academy unfolds as a lightly unhinged anti-Avengers. A family of super-powered siblings tries to solve the mystery of the murder of their domineering adoptive father, who plucked them from the arms of their mothers and raised them to be humanity’s first line of defence. Ellen Page, Tom Hopper and Robert Sheehan head the cast in a series that plays out like a Marvel movie directed by Wes Anderson. Watch out for a cameo by R&B queen Mary J Blige as an inter-dimensional assassin. Netflix 31/50 When They See Us Oscar-nominated Ava DuVernay makes a foray into television with a gripping four-part retelling of the 1989 Central Park Five case in which five African Americans were charged with the rape of a jogger in central Manhattan. Atsushi Nishijima/Netflix 32/50 The Dark Crystal This return to the world of the Jim Henson 1982 fantasy movie is very much a series of two halves. The first five episodes are a confused hodgepodge of exposition and world building. But once it settles down this prequel to the film spins a fantastic tale of puppet Gelflings and Skeksis vying for power in a feudal kingdom… a game of thrones, as it were. Westeros regulars Natalie Dormer, Lena Headey and Nathalie Emmanuel star alongside Simon Pegg, Mark Hamill and Alicia Vikander. 33/50 The Haunting of Hill House A rare TV horror that genuinely gets under the skin. Very loosely adapted from 1959 Shirley Jackson gothic classic, Mike Flanagan’s series chronicles the adulthood agonies of a family whose childhood was traumatised by a run-in with a creepy mansion. Rather than lazy jump-scares, the series ratchets up the dread slowly yet unyieldingly. A few episodes in and you may find yourself holding your breath, so searing is the tension. To really freak you, Flanagan has also inserted dozens of hidden ghosts into the background. See how many you can spot – and good luck getting to sleep afterwards. Steve Dietl/Netflix 34/50 The OA Bonkers on a swizzle stick, this series from Brit Marling and Zal Batmanglij makes Twin Peaks look like an Only Fools and Horses repeat. Prairie (Marling) is an inter-dimensional wanderer with a strange past and an even weirder future. She recruits a group of high school students, teaching them the “movements” that permit travel across time and space. That’s the jumping off point for a meditation on existence, identity and fate. Controversially cancelled after just two seasons – and the mother of all cliff-hangers – the OA is nonetheless a sensory experience worth your time. Did we mention the talking octopus? Netflix 35/50 Our Planet David Attenborough provides the narration – but the real star is the stunning camerawork and general sumptuousness, courtesy of the team behind BBC mega-hits Blue Planet and Planet Earth. Shots of flamingos running across salt flats and blue whales chilling off the coast of Mexico are the perfect excuse to spring for a Netflix HD subscription. Netflix 36/50 The Dragon Prince Game of Thrones exited to the strains of a thousand damp squibs imploding at once. And it’s too early to say whether adaptations of the Witcher or The Wheel of Time will be any use. But one fantasy saga worth getting your chainmail in a twist for is this kid’s animated series from Avatar: The Last Airbender director Aaron Ehasz. The setting is bog standard swords and sorcery – there are dragons, elves and magicians – but the execution is riveting. Ethnic tensions between elves and humans are compellingly drawn – and did we mention the dragons? 37/50 Castlevania A gothic adult cartoon based on an obscure video game does not sound enticing. Yet this baroque fever dream starring Richard Armitage (Thorin from The Hobbit movies) as the last living member of an excommunicated family of vampire hunters and Graham McTavish as a misunderstood Count Dracula (he’s upset after his wife is burned the stake) is a riveting slow burner. A third season is in production. Netflix 38/50 Tuca and Bertie Netflix has lately turned cancelling shows into a competitive sport. This new animated drama from the creators of BoJack Horseman was canned just two months after its debut despite much critical acclaim. In Netflix’s defence, it is rather wacky. To quote Deadline, it tells of “the friendship between two 30-year-old bird-women who live in the same apartment building, Tuca (Tiffany Haddish), a cocky, care-free toucan and Bertie (Ali Wong), an anxious, daydreaming songbird.” The humour is surreal but, just like BoJack Horseman, the emotional beats – specifically its depiction of the central relationship – yank the heartstrings. 39/50 Blown Away Reality TV, the Netflix way. Imagine Bake Off with glass-blowing instead of marzipan manipulation and YouTube star Nick Uhas in for Noel Fielding and Sandi Toksvig. Ten artists test their glass blowing mastery in a series of challenges. The winner walks away with $60,000 and a residency at the Corning Museum of Glass in New York. Just like Bake Off, it’s riveting viewing even if you can’t tell a kiln from a kangaroo. 40/50 Dead to Me Linda Cardellini and Christina Applegate join forces for this super-dark comedy about two women who meet at a therapy group for the recently bereaved. They strike up a natural friendship – but, as we slowly learn, each has secrets they’d rather not share. James Marsden is fantastic as the smarmy ex of Judy (Cardellini) while the behind the scenes involvement of producers Will Ferrell and Anchorman: The Legend of Ron Burgundy director Adam McKay provides a clue as to the mad-cap humour. A word-of-mouth success, it has been picked up for a second series. Saeed Adyani / Netflix 41/50 The Witcher Henry Cavill stars as titular monster hunter Geralt of Rivia in a pulpy adaptation of Andrzej Sapkowski’s best-selling fantasy novels (the show is not directly based on the hit video game series). It’s a ludicrous lark with a plot that often baffles (watch out for those multiple timelines). But Cavill is fantastic as the Witcher and he has a great support cast including Anya Chalotra as sorceress Yennefer , Freya Allan as Princess Ciri and Joey Batey as Jaskier the Bard. It is estimated to be the most in-demand TV show in the world across all platforms. All together now, “toss a coin to your Witcher, oh ratings of plenty…” Netflix 42/50 The Stranger An old-school, over-the-top thriller, adapted from the Harlan Coben bestseller. The setting is a fictional town of Cedarfield, which seems to be somewhere within commuting distance of Manchester. Richard Armitage plays a loving dad and husband whose world falls apart when a mysterious woman tells him his wife (Dervla Kirwan) faked her pregnancy. Jennifer Saunders later pops up as a mother whose family has its own secrets. Netflix 43/50 Chilling Adventures of Sabrina Baroque with bells on and camper than a disco ball at a tent convention, Netflix’s rebooting of Sabrina the Teenage Witch makes a virtue of excess. Kiernan Shipka – Don Draper’s daughter from Mad Men – lights up the screen as the half-human/ half witch teenager drawn into a tangle with the devil himself. Miranda Otto and The Office’s Lucy Davies play her eccentric aunts. And there’s a cat named Salem, though he doesn’t talk. Diyah Pera/Netflix 44/50 Next in Fashion Feel-good reality TV was once a contradiction in terms. But the vibes are agreeably optimistic in this fashionista contest in which professional designers compete for a $250,000 price. Presenters Tan France and Alexa Chung bring the common touch and the contestants appear to be enjoying themselves rather than undergoing the ordeal of a lifetime. Essentially, it’s Bake Off on the catwalk. Netflix 45/50 Locke and Key Joe Hill’s bestselling graphic novels receive the YA treatment in this urban fantasy about a house full of portals to other worlds and the grieving family who make their home there. The break-out performance is by Emilia Jones – daughter of singer Aled – playing middle child Kinsey Locke. Hill, the son of Stephen King, moved heaven and earth to bring his story to the screen and the effort has paid off. Netflix 46/50 Star Trek: Discovery Trekkies have agreed to disagree regarding this often madcap reboot of the venerable sci-fi saga. Suffice to say, if starships powered by “spore drives” or Harry Potter’s Jason Isaacs over-acting across multiple dimensions is off-putting then this isn’t the Trek for you. But others have warmed to the ambitious storytelling, top-notch FX and Sonequa Martin-Green’s earnest performance as science officer Michael Burnham. CBS 47/50 Money Heist The Spanish thriller has become one of Netflix’s most popular non-English language shows. There’s certainly lots going on. The story begins with a daring raid on the Royal Mint of Spain in Madrid, overseen by the mysterious Professor (Álvaro Morte) Thereafter it gets steadily more bonkers and the location shifts from Spain to Germany and Thailand. Though all the twists and turns, highs and lows, Money Heist is never less than gripping. Netflix 48/50 Night on Earth David Attenborough's Our Planet has hoovered up all the attention. But this UK-made series, narrated by Orange is the New Black’s Samira Wiley, brings a new perspective to wildlife TV. Shot using heat-sensitive cameras, Night on Earth features lions romping by moonlight and cacti blooming under the desert stars. It’s like journeying to another world, with reality only returning as the sun rises. Netflix 49/50 Spinning Out Kaya Scodelario – recently seen in the new BBC adaptation of Agatha Christie’s The White Horse – owns the screen as a promising young skater recovering from a serious injury. Her real challenge is off the rink as she tries to conceal her family’s history of mental illness. It’s clearly pitched at a YA audience and is a bit overwrought in places. But Spinning Out is never less than watchable and it’s a shame it was cancelled after just one series. Netflix 50/50 Living with Yourself Paul Rudd and Aisling Bea have good chemistry in this mordant comedy about a white collar schlub (Rudd) who, in the depths of a midlife crisis, accidentally clones himself. He is forced to compete with his happier, more confident, wittier alter-ego while his wife (Bea) tries to make sense of the transformation. You’ll chuckle rather than fall over clutching your sides but the leads are likeable and the script hums along. Netflix 1/50 Bojack Horseman A cartoon about a talking horse, starring the goofy older brother from Arrested Development… on paper little about BoJack Horseman screams “must watch”. Yet the series almost immediately transcended its format to deliver a moving and very funny rumination on depression and middle-age malaise. Will Arnett plays BoJack – one time star of Nineties hit sitcom Horsin’ Around – as a lost soul whose turbo-charged narcissism prevents him getting his life together. Almost as good are a support cast including Alison Brie (Glow, Mad Men), Aaron Paul, of Breaking Bad, and Amy Sedaris as a pampered Persian cat who is also BoJack’s agent. Season five touches the live rail of harassment in the movie industry, offering one of the most astute commentaries yet on the #MeToo movement with an episode based centred around an awards ceremony called “The Forgivies”. The sixth and final series was split in two, with part one debuting on 25 October and part two on 31 January 2020. Netflix 2/50 Stranger Things A valentine to the Spielberg school of Eighties blockbuster, with Winona Ryder as a small town mom whose son is abducted by a transdimensional monster. ET, Goonies, Close Encounters, Alien and everything Stephen King wrote between 1975 and 1990 are all tossed into the blender by Millennial writer-creators the Duffer brothers. It was clear Stranger Things was going to be a mega-smash when Barb – the “best friend” character eaten in the second episode – went viral the weekend it dropped. Netflix 3/50 Daredevil Netflix’s Marvel shows tend towards the overlong and turgid. An exception is the high-kicking Daredevil, with Charlie Cox’s blind lawyer/crimefighter banishing all memory of Ben Affleck's turn donning the red jumpsuit in 2003. With New York’s Hell’s Kitchen neighbourhood as backdrop, Daredevil is caked in street-level grit and features a searing series one performance by Vincent D'Onofrio as the villainous Kingpin. The perfect antidote to the deafening bombast of the big screen Marvel movies. Netflix 4/50 The Staircase Did he do it? Does it matter considering the lengths the Durham, North Carolina police seemingly went in order to stitch him up? Sitting through this twisting, turning documenting about the trial of Michael Peterson – charged with the murder in 2003 of his wife – the viewer may find themselves alternately empathising with and recoiling from the accused. It’s a feat of bravura factual filmmaking from French documentarian Jean-Xavier de Lestrade, which comes to Netflix with a recently shot three-part coda catching up with the (very weird) Peterson clan a decade on. Netflix 5/50 Dark Stranger Things: the Euro-Gloom years. Netflix’s first German-language production is a pulp romp that thinks it’s a Wagner opera. In a remote town surrounded by a creepy forest locals fear the disappearance of a teenager may be linked to other missing persons cases from decades earlier. The timelines get twisted and it’s obvious that something wicked is emanating from a tunnel leading to a nearby nuclear power plant. Yet if the story sometimes trips itself up the Goonies-meets-Götterdämmerung ambiance keeps you hooked. Netflix 6/50 A Series of Unfortunate Events The wry and bleak Lemony Snickett children novels finally get the ghastly adaptation they deserve (let’s all pretend the dreadful 2004 Jim Carrey movie never happened). Neil Patrick Harris gobbles up the scenery as the vain and wicked Count Olaf, desperate to separate the Baudelaire orphans from their considerable inheritance. The look is Tim Burton by way of Wes Anderson, and the dark wit of the books is replicated perfectly (Snickett, aka Daniel Handler, is co-producer). Netflix 7/50 Maniac If you’re curious as to how Cary Fukunaga will handle the Bond franchise, his limited series, starring Emma Stone and Jonah Hill, drops some delicious hints. It’s a mind-bending sci-fi story set in an alternative United States where computers still look like Commodore 64s and in which you pay for goods by having a “travel buddy” sit down and read you adverts. Stone and Hill are star-crossed outcasts participating in a drugs trial that catapults them into a series of trippy genre excursions – including an occult adventure and a Lord of the Rings-style fantasy. It is here that Fukunaga demonstrates his versatility, handling potentially hokey material smartly and respectfully. 007 fans can sleep easy. Netflix 8/50 Better Call Saul The Breaking Bad prequel is starting to outgrow the show that spawned it. Where Breaking Bad delivered a master-class in scorched earth storytelling Saul is gentler and more humane. Years before the rise of Walter White, the future meth overlord’s sleazy lawyer, Saul Goodman, is still plain old Jimmy McGill, a striving every-dude trying to catch a break. But how far will he go to make his name and escape the shadow of his superstar attorney brother Chuck (Michael McKean)? Season five has just arrived and journeys even deeper into the Breaking Bad expanded universe. AMC Studios/Netflix 9/50 Black Mirror Don’t tell Channel 4 but Charlie Brooker’s dystopian anthology series has arguably got even better since making the jump from British terrestrial TV to the realm of megabucks American streaming. Bigger budgets have given creators Brooker and Annabel Jones license to let their imaginations off the leash – yielding unsurpassable episodes such as virtual reality love story \"San Junipero\" and Star Trek parody \"USS Callister\", which has bagged a bunch of Emmys. Netflix 10/50 Mindhunter David Fincher produces this serial killer drama based on the writings of a real-life FBI psychological profiler. It’s the post-Watergate Seventies and two maverick G-Men (Jonathan Groff and Holt McCallany) are going out on a limb by utilising the latest psychological research to get inside the heads of a motley assembly of real-life sociopathic murders – including the notorious “Co-Ed” butcher Ed Kemper, brought chillingly to live in an Emmy-nominated performance by Cameron Britton. Netflix 11/50 The Crown A right royal blockbuster from dramatist Peter Morgan (The Queen, Frost / Nixon). Tracing the reign of Elizabeth II from her days as a wide-eyed young woman propelled to the throne after the surprise early death of her father, The Crown humanises the royals even as it paints their private lives as a bodice-ripping soap. Matt Smith is charmingly roguish as Prince Philip and Vanessa Kirby has ascended the Hollywood ranks on the back of her turn as the flawed yet sympathetic Princess Margaret. Most impressive of all, arguably, is Claire Foy, who plays the Queen as a shy woman thrust unwillingly into the spotlight. Foy and the rest of the principal cast have now departed, with a crew of older actors – headed by Olivia Colman and Tobias Menzies – taking over as the middle-aged Windsors for season three. They’ll be around for season four too. And then the grand endeavour closes with Imelda Staunton as Elizabeth in her twilight years. Netflix 12/50 Narcos This drug trafficking caper spells out exactly what kind of series it is with an early scene in which two gangsters zip around a multi-level carpark on a motorbike firing a machine gun. Narcos, in other words, is for people who consider Pacino’s Scarface a touch too understated. Series one and two feature a mesmerising performance by Wagner Moura as Columbian cocaine kingpin Pablo Escobar, while season three focuses on the notorious Cali cartel. Reported to be one of Netflix’s biggest hits – the company doesn’t release audience figures – it turns its attention in its fourth and fifth season to Mexico’s interminable drugs wars, with Diego Luna playing Guadalajara cartel honcho Miguel Gallardo. Juan Pablo Gutierrez/Netflix 13/50 Master of None A cloud hangs over Aziz Ansari’s future after he was embroiled in the #MeToo scandal. But whatever happens, he has left us with a humane and riveting sitcom about an Ansari-proximate character looking for love and trying to establish himself professionally in contemporary New York. K.C. Bailey / Netflix 14/50 Bloodline One of Netflix’s early blockbusters, the sprawling soap opera updates Dallas to modern day southern Florida. Against the edge-of-civilisation backdrop of the Florida Keys, Kyle Chandler plays the local detective and favourite son of a well-to-do family. Their idyllic lives are thrown into chaos with the return of the clan’s black sheep (an unnervingly intense Ben Mendelsohn). The story is spectacularly hokey but searing performances by Chandler and Mendelsohn, and by Sissy Spacek and the late Sam Shepard as their imperious parents, make Bloodline compelling – a guilty pleasure that, actually, you shouldn’t feel all that guilty about. Rod Millington/Netflix 15/50 The Alienist You can almost smell the shoddy sanitation and horse-manure in this lavish murder-mystery set in 19th New York. We’re firmly in Martin Scorsese's Gangs of New York territory, with a serial killer bumping off boy prostitutes across Manhattan. Enter pioneering criminal psychologist Dr Laszlo Kreisler (Daniel Brühl), aided by newspaper man John Moore (Luke Evans) and feisty lady detective Sara Howard (Dakota Fanning). Kurt Iswarienko 16/50 Love Judd Apatow bring his signature gross-out comedy to the small screen. Love, which Apatow produced, is a masterclass in restraint compared to 40 Year Old Virgin, Knocked Up etc. Paul Rust is Gus, a nerdish movie set tutor, whose develops a crush on Gillian Jacobs’s too-cool-for-school radio producer Mickey. Romance, of a sort, blossoms – but Love’s triumph is to acknowledge the complications of real life and to disabuse its characters of the idea that there’s such a thing as a straightforward happy ending. Hipster LA provides the bustling setting. Netflix 17/50 Queer Eye Who says reality TV has to be nasty and manipulative? This updating of the early 2000s hit Queer Eye for the Straight Guy has five stereotype-challenging gay men sharing lifestyle tips and fashion advice with an engaging cast of All American schlubs (the first two seasons are shot mostly in the state of Georgia). There are laughs – but serious moment too, such as when one of the crew refuses to enter a church because of the still unhealed scars of his strict Christian upbringing. Netflix 18/50 Chef’s Table A high-gloss revamping of the traditional TV food show. Each episode profiles a high wattage international chef; across its three seasons, the series has featured gastronomic superstars from the US, Argentina, India and Korea. Charles Panian/Netflix 19/50 Arrested Development A disastrous group interview in which actor Jason Bateman “mansplained” away the bullying co-star Jessica Walter had suffered at the hands of fellow cast-member Jeffrey Tambor meant season five of Arrested Development was fatally compromised before it even landed. Yet Netflix’s return to the dysfunctional world of the Bluth family stands on its merits and is a worthy addition to the surreal humour of seasons one through three (series four, which had to work around the busy schedules of the cast, is disposable by comparison). Netflix 20/50 Altered Carbon Netflix does Bladerunner with this sumptuous adaptation of the cult Richard Morgan novel. The setting is a neon-splashed cyberpunk future in which the super-wealthy live forever by uploading the consciousness into new “skins”. Enter rebel-turned-detective Takeshi Kovacs (Joel Kinnaman), hired to find out who killed a (since resurrected) zillionaire industrialist while dealing with fallout from his own troubled past. Rumoured to be one of Netflix’s most expensive projects yet, its second run sees Anthony Mackie (aka Marvel’s Falcon) replace Kinnaman as the shape-shifting Kovacs. He’s a perfect fit for the part too, delving into the inner turmoil of a character who accumulates a multitude of ghosts across his endless lifespan. Netflix 21/50 Rick and Morty Dan Harmon, creator of cult sitcom Community (also on Netflix), finds the perfect outlet for zany fanboy imagination with this crazed animated comedy about a Marty McFly/Doc Brown-esque duo of time travellers. Every genre imaginable is parodied with the manic energy and zinging dialogue we have come to expect from Harmon. Netflix/Adult Swim 22/50 GLOW Mad Men’s Alison Brie is our entry point into this comedy-drama inspired by a real life all-female wrestling league in the Eighties. Ruth Wilder (Brie) is a down-on-her luck actor who, out of desperation, signs up a wrestling competition willed into being by Sam Sylvia (podcast king Marc Maron). Britrock singer Kate Nash is one of her her fellow troupe members: the larger than life Rhonda “Britannica” Richardson. Netflix 23/50 Archer Deadpan animated satire about an idiot super spy with shaken and stirred mother issues. One of the most ambitious modern comedies, animated or otherwise, Archer tries on different varieties of humour for size and even occasionally tugs at the heart strings. 24/50 Ozark Breaking Bad for those with short attention spans. The saga of Walter White took years to track the iconic anti-hero’s rise from mild mannered everyman to dead-eyed criminal. Ozark gets there in the first half hour as nebbish Chicago accountant Marty Byrde (Jason Bateman) agrees to serve as lieutenant for the Mexican mob in the hillbilly heartlands of Ozark, Missouri (in return they thoughtfully spare his life). Bateman, usually seen in comedy roles, is a revelation as is Laura Linney as his nasty wife Wendy. There is also a break-out performance by Julia Garner playing the scion of a local redneck crime family. Bateman recently won a best director Emmy for his work on the series, seizing the gong from beneath the noses of Game of Thrones’s David Benioff and DB Weiss. Season three is due in March 2020. Netflix 25/50 The Good Place A heavenly comedy with a twist. Eleanor Shellstrop (Kristen Bell) is a cynical schlub waved through the Pearly Gates by mistake after dying in a bizarre supermarket accident. There she must remain above the suspicions of seemingly well-meaning but disorganised angel Michael (Ted Danson) whilst also negotiating fractious relationships with do-gooder Chidi (William Jackson Harper), spoiled princess Tahani (former T4 presenter Jameela Jamil) and ex-drug dealer Jason (Manny Jacinto). Netflix 26/50 Disenchantment It’s been forever and a few years since The Simpsons was even vaguely essentially viewing. But Matt Groening’s Homer mojo clearly hasn’t abandoned him yet. His Netflix series, just back for a second season, is a hilarious pastiche of fantasy tropes, with Abbi Jacobson as a hard-drinking princess, Eric Andre and Nat Faxon as her demon pal and elf sidekick and Matt Berry as – to quote Wikipedia – “Prince Merkimer, from the kingdom of Bentwood, who is arranged to marry [Princess] Bean, but was turned into a pig”. Netflix 27/50 Top Boy Netflix has been binning shows as if it is going out of fashion. But that didn’t stop Drake from persuading it to revive the Channel 4 drama about rival drug dealers in a fictional south London neighbourhood. Middle-aged Irishman Ronan Bennett captures the reality of life for many young black British people with tremendously sensitivity, while the cast is headed by Ashley Walters, Kane “Kano” Robinson, rapper Little Simz and Mercury Prize winner Dave. Netflix 28/50 Unbelievable A police procedural adapted from a long-form magazine exposé of American justice’s entrenched misogyny sounds like nobody’s idea of a fun night in. But Unbelievable makes serious points about how sufferers of sexual assault are marginalised and victim-blamed while also drawing the viewer into a compelling mystery. Unflinching yet never gratuitous, it stars Toni Collette and Merritt Wever as hard-bitten detectives investigating a serial rapist. Booksmart’s Kaitlyn Dever, meanwhile, plays a young woman wrongly accused of crying wolf when a man attacks her in her apartment. Netflix 29/50 Russian Doll Time becomes a loop in this sci-fi parable about a troubled New Yorker who finds herself reliving the final hours of her life over and over. Is the cosmos itself trying to tell her something? Or is she simply losing her marbles. Natasha Lyonne excels as damaged, potty-mouthed Nadia. Her improbable love interest is played by Charlie Barnett. Netflix 30/50 The Umbrella Academy Gerard Way’s surreal comic book has translated impressively to the screen. Umbrella Academy unfolds as a lightly unhinged anti-Avengers. A family of super-powered siblings tries to solve the mystery of the murder of their domineering adoptive father, who plucked them from the arms of their mothers and raised them to be humanity’s first line of defence. Ellen Page, Tom Hopper and Robert Sheehan head the cast in a series that plays out like a Marvel movie directed by Wes Anderson. Watch out for a cameo by R&B queen Mary J Blige as an inter-dimensional assassin. Netflix 31/50 When They See Us Oscar-nominated Ava DuVernay makes a foray into television with a gripping four-part retelling of the 1989 Central Park Five case in which five African Americans were charged with the rape of a jogger in central Manhattan. Atsushi Nishijima/Netflix 32/50 The Dark Crystal This return to the world of the Jim Henson 1982 fantasy movie is very much a series of two halves. The first five episodes are a confused hodgepodge of exposition and world building. But once it settles down this prequel to the film spins a fantastic tale of puppet Gelflings and Skeksis vying for power in a feudal kingdom… a game of thrones, as it were. Westeros regulars Natalie Dormer, Lena Headey and Nathalie Emmanuel star alongside Simon Pegg, Mark Hamill and Alicia Vikander. 33/50 The Haunting of Hill House A rare TV horror that genuinely gets under the skin. Very loosely adapted from 1959 Shirley Jackson gothic classic, Mike Flanagan’s series chronicles the adulthood agonies of a family whose childhood was traumatised by a run-in with a creepy mansion. Rather than lazy jump-scares, the series ratchets up the dread slowly yet unyieldingly. A few episodes in and you may find yourself holding your breath, so searing is the tension. To really freak you, Flanagan has also inserted dozens of hidden ghosts into the background. See how many you can spot – and good luck getting to sleep afterwards. Steve Dietl/Netflix 34/50 The OA Bonkers on a swizzle stick, this series from Brit Marling and Zal Batmanglij makes Twin Peaks look like an Only Fools and Horses repeat. Prairie (Marling) is an inter-dimensional wanderer with a strange past and an even weirder future. She recruits a group of high school students, teaching them the “movements” that permit travel across time and space. That’s the jumping off point for a meditation on existence, identity and fate. Controversially cancelled after just two seasons – and the mother of all cliff-hangers – the OA is nonetheless a sensory experience worth your time. Did we mention the talking octopus? Netflix 35/50 Our Planet David Attenborough provides the narration – but the real star is the stunning camerawork and general sumptuousness, courtesy of the team behind BBC mega-hits Blue Planet and Planet Earth. Shots of flamingos running across salt flats and blue whales chilling off the coast of Mexico are the perfect excuse to spring for a Netflix HD subscription. Netflix 36/50 The Dragon Prince Game of Thrones exited to the strains of a thousand damp squibs imploding at once. And it’s too early to say whether adaptations of the Witcher or The Wheel of Time will be any use. But one fantasy saga worth getting your chainmail in a twist for is this kid’s animated series from Avatar: The Last Airbender director Aaron Ehasz. The setting is bog standard swords and sorcery – there are dragons, elves and magicians – but the execution is riveting. Ethnic tensions between elves and humans are compellingly drawn – and did we mention the dragons? 37/50 Castlevania A gothic adult cartoon based on an obscure video game does not sound enticing. Yet this baroque fever dream starring Richard Armitage (Thorin from The Hobbit movies) as the last living member of an excommunicated family of vampire hunters and Graham McTavish as a misunderstood Count Dracula (he’s upset after his wife is burned the stake) is a riveting slow burner. A third season is in production. Netflix 38/50 Tuca and Bertie Netflix has lately turned cancelling shows into a competitive sport. This new animated drama from the creators of BoJack Horseman was canned just two months after its debut despite much critical acclaim. In Netflix’s defence, it is rather wacky. To quote Deadline, it tells of “the friendship between two 30-year-old bird-women who live in the same apartment building, Tuca (Tiffany Haddish), a cocky, care-free toucan and Bertie (Ali Wong), an anxious, daydreaming songbird.” The humour is surreal but, just like BoJack Horseman, the emotional beats – specifically its depiction of the central relationship – yank the heartstrings. 39/50 Blown Away Reality TV, the Netflix way. Imagine Bake Off with glass-blowing instead of marzipan manipulation and YouTube star Nick Uhas in for Noel Fielding and Sandi Toksvig. Ten artists test their glass blowing mastery in a series of challenges. The winner walks away with $60,000 and a residency at the Corning Museum of Glass in New York. Just like Bake Off, it’s riveting viewing even if you can’t tell a kiln from a kangaroo. 40/50 Dead to Me Linda Cardellini and Christina Applegate join forces for this super-dark comedy about two women who meet at a therapy group for the recently bereaved. They strike up a natural friendship – but, as we slowly learn, each has secrets they’d rather not share. James Marsden is fantastic as the smarmy ex of Judy (Cardellini) while the behind the scenes involvement of producers Will Ferrell and Anchorman: The Legend of Ron Burgundy director Adam McKay provides a clue as to the mad-cap humour. A word-of-mouth success, it has been picked up for a second series. Saeed Adyani / Netflix 41/50 The Witcher Henry Cavill stars as titular monster hunter Geralt of Rivia in a pulpy adaptation of Andrzej Sapkowski’s best-selling fantasy novels (the show is not directly based on the hit video game series). It’s a ludicrous lark with a plot that often baffles (watch out for those multiple timelines). But Cavill is fantastic as the Witcher and he has a great support cast including Anya Chalotra as sorceress Yennefer , Freya Allan as Princess Ciri and Joey Batey as Jaskier the Bard. It is estimated to be the most in-demand TV show in the world across all platforms. All together now, “toss a coin to your Witcher, oh ratings of plenty…” Netflix 42/50 The Stranger An old-school, over-the-top thriller, adapted from the Harlan Coben bestseller. The setting is a fictional town of Cedarfield, which seems to be somewhere within commuting distance of Manchester. Richard Armitage plays a loving dad and husband whose world falls apart when a mysterious woman tells him his wife (Dervla Kirwan) faked her pregnancy. Jennifer Saunders later pops up as a mother whose family has its own secrets. Netflix 43/50 Chilling Adventures of Sabrina Baroque with bells on and camper than a disco ball at a tent convention, Netflix’s rebooting of Sabrina the Teenage Witch makes a virtue of excess. Kiernan Shipka – Don Draper’s daughter from Mad Men – lights up the screen as the half-human/ half witch teenager drawn into a tangle with the devil himself. Miranda Otto and The Office’s Lucy Davies play her eccentric aunts. And there’s a cat named Salem, though he doesn’t talk. Diyah Pera/Netflix 44/50 Next in Fashion Feel-good reality TV was once a contradiction in terms. But the vibes are agreeably optimistic in this fashionista contest in which professional designers compete for a $250,000 price. Presenters Tan France and Alexa Chung bring the common touch and the contestants appear to be enjoying themselves rather than undergoing the ordeal of a lifetime. Essentially, it’s Bake Off on the catwalk. Netflix 45/50 Locke and Key Joe Hill’s bestselling graphic novels receive the YA treatment in this urban fantasy about a house full of portals to other worlds and the grieving family who make their home there. The break-out performance is by Emilia Jones – daughter of singer Aled – playing middle child Kinsey Locke. Hill, the son of Stephen King, moved heaven and earth to bring his story to the screen and the effort has paid off. Netflix 46/50 Star Trek: Discovery Trekkies have agreed to disagree regarding this often madcap reboot of the venerable sci-fi saga. Suffice to say, if starships powered by “spore drives” or Harry Potter’s Jason Isaacs over-acting across multiple dimensions is off-putting then this isn’t the Trek for you. But others have warmed to the ambitious storytelling, top-notch FX and Sonequa Martin-Green’s earnest performance as science officer Michael Burnham. CBS 47/50 Money Heist The Spanish thriller has become one of Netflix’s most popular non-English language shows. There’s certainly lots going on. The story begins with a daring raid on the Royal Mint of Spain in Madrid, overseen by the mysterious Professor (Álvaro Morte) Thereafter it gets steadily more bonkers and the location shifts from Spain to Germany and Thailand. Though all the twists and turns, highs and lows, Money Heist is never less than gripping. Netflix 48/50 Night on Earth David Attenborough's Our Planet has hoovered up all the attention. But this UK-made series, narrated by Orange is the New Black’s Samira Wiley, brings a new perspective to wildlife TV. Shot using heat-sensitive cameras, Night on Earth features lions romping by moonlight and cacti blooming under the desert stars. It’s like journeying to another world, with reality only returning as the sun rises. Netflix 49/50 Spinning Out Kaya Scodelario – recently seen in the new BBC adaptation of Agatha Christie’s The White Horse – owns the screen as a promising young skater recovering from a serious injury. Her real challenge is off the rink as she tries to conceal her family’s history of mental illness. It’s clearly pitched at a YA audience and is a bit overwrought in places. But Spinning Out is never less than watchable and it’s a shame it was cancelled after just one series. Netflix 50/50 Living with Yourself Paul Rudd and Aisling Bea have good chemistry in this mordant comedy about a white collar schlub (Rudd) who, in the depths of a midlife crisis, accidentally clones himself. He is forced to compete with his happier, more confident, wittier alter-ego while his wife (Bea) tries to make sense of the transformation. You’ll chuckle rather than fall over clutching your sides but the leads are likeable and the script hums along. Netflix\n\nThe ending of last week’s episode saw Rick impaled on a spike and surrounded by walkers. Any concerns that this was Rick’s demise, however, were dispelled when AMC released a new trailer showing Rick out of his terrifying predicament.\n\nAndrew Lincoln can stride away from The Walking Dead knowing he’s left his imprint on television. As Rick Grimes, he’s portrayed one of the small screen’s most interesting heroes who, like Walter White and Don Draper, toed the line between hero and villainy with an intrigue most actors would struggle to convey.\n\nThe good news is that the character will return in three feature-length TV movies that have been announced by franchise overseer Scott Gimple - the first project heralding a series of new scripted projects that’ll focus on other characters within the universe\n\nThe Walking Dead continues in the US on AMC every Sunday with the simulcast airing in the UK at 2am. The episode is also available to watch on NOW TV ahead of its repeat on FOX at 9pm the following evening", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg", "keywords": [], "authors": ["Jacob Stolworthy"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "title": "The Walking Dead season 9: The reason why Rick Grimes actor Andrew Lincoln quit the series", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "title": "The reason why Andrew Lincoln quit The Walking Dead", "description": "The actor has played the lead character since its first episode 2010 – but what inspired his decision to leave?", "updated_time": "2018-11-06T09:13:23+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5854695657001_5854691432001.mp4?pubId=624246174001&videoId=5854691432001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8612766"}, "description": "Andrew Lincoln has officially left The Walking Dead – but will return as Rick Grimes in a trilogy of films.", "keywords": "The Walking Dead, Andrew Lincoln, Rick Grimes, News, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "The Walking Dead", "published_time": "2018-11-05T07:13:00+00:00", "modified_time": "2018-11-06T09:13:23+00:00", "section": "News", "subsection": "Video", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 838, "image_count": 3, "video_count": 0, "embed_count": 0, "internal_link_count": 10, "external_link_count": 4}, "twitter": {"title": "The reason why Andrew Lincoln quit The Walking Dead", "description": "Andrew Lincoln has officially left The Walking Dead – but will return as Rick Grimes in a trilogy of films.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1541401980.0, "source": "https://www.independent.co.uk", "summary": ""}