{"url": "https://deadline.com/2018/02/once-upon-a-time-end-season-7-1202279551/", "text": "ABC’s fairytale drama series Once Upon A Time will end with the current Season 7, Deadline has confirmed.\n\nThe show, created and executive produced by Edward Kitsis and Adam Horowitz, returns for the second half of its final season on March 2, and the finale will air in May, after more than 150 episodes.\n\nOnce Upon a Time went through a creative and casting revamp at the end of Season 6 when a number of original cast members left, and also relocated from its longtime Sunday home to the lower-trafficked Friday night this season. During the TCA winter press tour in January, ABC Entertainment President Channing Dungey said she was “cautiously optimistic” about an eighth season, pending a meeting with Kitsis and Horowitz, but that was not to be.\n\n“When we first heard Adam and Eddy’s pitch for Once Upon a Time, we knew it was something incredibly special,” Dungey said in a statement today. “For seven years, they have captivated us with their creativity and passion while reimagining some of our most beloved Disney fairytales, creating an undeniable global hit. Saying goodbye will be bittersweet, but Once Upon a Time’ will forever be part of the ABC legacy and we can’t wait for fans to join us in this epic final chapter.”\n\nOnce Upon a Time was a breakout hit when it premiered in fall 2011, starring Ginnifer Goodwin, Jennifer Morrison, Lana Parrilla, Josh Dallas, Robert Carlyle and Jared Gilmore, and featuring classic Disney fairytale characters. In addition to strong ratings early in its run, Once fit nicely in the Disney brand with corporate synergies and has been a solid international seller for producer ABC Studios because of the global recognition of its characters.\n\n“’Once Upon a Time has been an amazing journey for all of us at ABC Studios and for fans around the world,” said Patrick Moran, president of ABC Studios. “We’re so proud and appreciative of the hard work and creative talent that Eddy Kitsis, Adam Horowitz and their cast and crew brought to this show for seven magical seasons.”\n\nOnce Upon a Time’s ratings had been declining for the past few seasons and further dropped when the show moved from Sunday to Friday this past fall. The series, whose Season 7 reboot was met by mixed reaction by fans, currently stars Lana Parrilla, Robert Carlyle, Colin O’Donoghue, Andrew J. West, Gabrielle Anwar, Dania Ramirez, Alison Fernandez and Mekia Cox. Steve Pearlman and David H. Goodman also are executive producing.\n\n“Seven years ago, we set out to create a show about hope, where even in the darkest of times, a happy ending would always be possible,” said Once creators/executive producers Edward Kitsis and Adam Horowitz. ” But we never imagined the happy ending that was actually in store for all of us — years and years of adventure, romance, magic and hope. We’re so grateful to our brilliant collaborators – the cast, crew, and writers — as well as our partners at the studio and network for making this journey possible. But most of all, we want to thank the fans. Their fierce loyalty and devotion was the real magic behind Once Upon A Time. We hope they join us for these last few hours as we journey to the Enchanted Forrest for one more adventure.”", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F02%2Fonce-upon-a-time-end-season-7-1202279551%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202279551&comment_count=41", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2017/12/once-upon-a-time-season-7.jpg?w=1024", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/12/once-upon-a-time-season-7.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva Denise Petski", "Nellie Andreeva", "Denise Petski"], "canonical_link": "https://deadline.com/2018/02/once-upon-a-time-end-season-7-1202279551/", "title": "‘Once Upon A Time’ To End With Season 7 On ABC", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "ABC's fantasy drama series Once Upon A Time will end with the current Season 7, Deadline has confirmed.", "news_keywords": "ABC, Once Upon a Time", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Once Upon A Time’ To End With Season 7 On ABC", "url": "https://deadline.com/2018/02/once-upon-a-time-end-season-7-1202279551/", "description": "ABC’s fairytale drama series Once Upon A Time will end with the current Season 7, Deadline has confirmed. The show, created and executive produced by Edward Kitsis and Adam Horowitz, returns …", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/12/once-upon-a-time-season-7.jpg?w=1024", "width": 1200, "height": 800}, "locale": "en_US"}, "article": {"published_time": "2018-02-06T20:09:08+00:00", "modified_time": "2018-02-07T07:04:53+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘Once Upon A Time’ To End With Season 7 On ABC"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/12/once-upon-a-time-season-7.jpg?w=1024", "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘Once Upon A Time’ To End With Season 7 On ABC", "description": "ABC's fantasy drama series Once Upon A Time will end with the current Season 7, Deadline has confirmed."}, "author": "Denise Petski", "content_type": "Article", "post_id": 1202279551, "title": "'Once Upon A Time' To End With Season 7 On ABC", "published_at": "2018-02-06 12:09:08", "image": "https://pmcdeadline2.files.wordpress.com/2017/12/once-upon-a-time-season-7.jpg?w=296&h=166&crop=1", "comment_count": 41, "tags": "Once Upon a Time", "topics": "TV", "body": "ABC's fairytale drama series Once Upon A Time will end with the current Season 7, Deadline has confirmed.\r\n\r\nThe show, created and executive produced by Edward Kitsis and Adam Horowitz, returns for the second half of its final season on March 2, and the finale will air in May, after more than 150 episodes.\r\n\r\nOnce Upon a Time went through a creative and casting revamp at the end of Season 6 when a number of original cast members left, and also relocated from its longtime Sunday home to the lower-trafficked Friday night this season. During the TCA winter press tour in January, ABC Entertainment President Channing Dungey said she was “cautiously optimistic” about an eighth season, pending a meeting with Kitsis and Horowitz, but that was not to be.\r\n\r\n“When we first heard Adam and Eddy’s pitch for Once Upon a Time, we knew it was something incredibly special,\"  Dungey said in a statement today. \"For seven years, they have captivated us with their creativity and passion while reimagining some of our most beloved Disney fairytales, creating an undeniable global hit. Saying goodbye will be bittersweet, but Once Upon a Time’ will forever be part of the ABC legacy and we can’t wait for fans to join us in this epic final chapter.”\r\n\r\nOnce Upon a Time was a breakout hit when it premiered in fall 2011, starring Ginnifer Goodwin, Jennifer Morrison, Lana Parrilla, Josh Dallas, Robert Carlyle and Jared Gilmore, and featuring classic Disney fairytale characters. In addition to strong ratings early in its run, Once fit nicely in the Disney brand with corporate synergies and has been a solid international seller for producer ABC Studios because of the global recognition of its characters.\r\n\r\n“’Once Upon a Time has been an amazing journey for all of us at ABC Studios and for fans around the world,\" said Patrick Moran, president of ABC Studios. \"We’re so proud and appreciative of the hard work and creative talent that Eddy Kitsis, Adam Horowitz and their cast and crew brought to this show for seven magical seasons.”\r\n\r\nOnce Upon a Time's ratings had been declining for the past few seasons and further dropped when the show moved from Sunday to Friday this past fall. The series, whose Season 7 reboot was met by mixed reaction by fans, currently stars Lana Parrilla, Robert Carlyle, Colin O’Donoghue, Andrew J. West, Gabrielle Anwar, Dania Ramirez, Alison Fernandez and Mekia Cox. Steve Pearlman and David H. Goodman also are executive producing.\r\n\r\n“Seven years ago, we set out to create a show about hope, where even in the darkest of times, a happy ending would always be possible,\" said Once creators/executive producers Edward Kitsis and Adam Horowitz. \" But we never imagined the happy ending that was actually in store for all of us -- years and years of adventure, romance, magic and hope. We’re so grateful to our brilliant collaborators – the cast, crew, and writers -- as well as our partners at the studio and network for making this journey possible. But most of all, we want to thank the fans. Their fierce loyalty and devotion was the real magic behind Once Upon A Time. We hope they join us for these last few hours as we journey to the Enchanted Forrest for one more adventure.”", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1517947748.0, "source": "https://deadline.com", "summary": ""}