{"url": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492", "text": "John Cena, Nikki Bella end long-term relationship year after getting engaged The two WWE stars got engaged in the ring last year at Wrestlemania.\n\nWWE stars John Cena and Nikki Bella are calling it quits just one year after getting engaged in the middle of the ring in front of tens of thousands of fans at Wrestlemania 33.\n\nBella, whose real name is Nicole Garcia-Colace, announced the longtime couple were splitting up in a post on Instagram Sunday night.\n\n\"After much contemplation and 6 years of being together Nikki Bella and John Cena announced today their decision to separate as a couple. While this decision was a difficult one, we continue to have a great deal of love and respect for one another. We ask that you respect our privacy during this time in our lives.\"\n\nJohn Cena attends the red carpet premiere of \"Trainwreck.\" ABC News\n\nThe pair, who met as wrestlers for WWE, have had their relationship chronicled for years on the E! reality series \"Total Divas\" and spinoff \"Total Bellas.\" They gave no reason for the separation.\n\nThroughout the series, Cena long held he would never get married only to relent last year when he proposed to Nikki Bella following the pair's match at Wrestlemania 33 in Orlando, Florida. He was previously married to Elizabeth Huberdeau from 2009 to 2012.\n\nCena spoke to ABC's Peter Travers on his show \"Popcorn\" just a couple weeks ago, while promoting his new movie \"Blockers,\" about his wedding and engagement to Nikki.\n\n\"I asked my lovely bride-to-be to marry me in the wrestling ring at Wrestlemania almost one year ago today -- in front of 75,000 of our closest friends,\" he said. \"It meant a lot to me specifically; Nicole and I have been through ups and downs. Relationships are hard, especially when your relationship is in the public. Nicole had to deal with a lot of misconceptions about our relationship. ... I wanted a global stage to tell the woman of my dreams that I wanted to marry her.\"\n\nCena even told Travers the planning for their wedding was moving along well.\n\n\"The planning is going great,\" Cena said. \"I just can't tell you because Nicole is the boss and she's got all the details.\"\n\nNikki's twin sister, Brie, whose real name is Brianna Danielson, responded to her sister's post on Instagram, saying, \"We love you all.\" Brie is married to a fellow WWE wrestler, Bryan Danielson, who recently returned to the ring following a retirement for a neck injury.\n\nCena and Nikki Bella have both spent increasing time away from the wrestling ring.\n\nIn this Tuesday, April 3, 2018, photo, John Cena, left, and Nikki Bella attend the LA Premiere of \"Blockers\" at the Regency Village Theatre in Los Angeles. On Sunday, April 15, 2018, Bella tweeted that she and Cena have ended their engagement, saying that they've made the mutual decision to break up after six years together. AP\n\nNikki made a brief cameo at WWE's Royal Rumble in January, as well as one untelevised match teaming with her fiance in March, but hasn't taken part in a storyline since she and Cena were engaged in the ring last April. She's spent long gaps away from the ring dealing with a serious neck injury in recent years as well. Her comeback to the ring from major surgery was chronicled in \"Total Bellas.\"\n\nCena's movie career has exploded in recent years. He received rave reviews for his performance in the Amy Schumer comedy \"Trainwrecked\" in 2015, and starred in \"Daddy's Home\" in 2015 and \"Daddy's Home 2\" in 2017. He voiced the lead character in the animated comedy \"Ferdinand,\" which was nominated for an Academy Award for Best Animated Feature this year.\n\nHis comedy \"Blockers,\" with actress Leslie Mann, was released last week. The couple attended the premiere together on April 3.\n\nCena had a short match with WWE legend The Undertaker at last week's Wrestlemania 34 in New Orleans.", "images": ["https://s.abcnews.com/images/Entertainment/john-cena-nikki-bella-ap-mo-20180416_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/john-cena-nikki-bella-ap-mo-20180416_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Mark Osborne", "April", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492", "title": "John Cena, Nikki Bella end long-term relationship year after getting engaged", "meta_data": {"keywords": "john cena, nikki bella, wwe, wrestlemania", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "John Cena, Nikki Bella end long-term relationship year after getting engaged", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492", "title": "John Cena, Nikki Bella end long-term relationship year after getting engaged", "image": "https://s.abcnews.com/images/Entertainment/john-cena-nikki-bella-ap-mo-20180416_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-04-16T05:00:36Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,54493492", "ipad": "abcnewsipad://link/story,54493492", "googleplay": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "John Cena, Nikki Bella end long-term relationship year after getting engaged", "url": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/john-cena-nikki-bella-ap-mo-20180416_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,54493492", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,54493492", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/john-cena-nikki-bella-end-long-term-relationship/story?id=54493492"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}