{"url": "https://en.wikipedia.org/wiki/The_Bachelor_Winter_Games", "text": "The Bachelor Winter Games is a winter sports-themed reality competition television series that premiered on February 13, 2018 on ABC. It is a spin-off of the reality television game shows The Bachelor and The Bachelorette, and is a winter counterpart to the summer series Bachelor in Paradise. The show is hosted by Chris Harrison and Hannah Storm. It has been described by ABC as \"an ode to the Winter Olympic Games\", and aired as counterprogramming against NBC's coverage of the 2018 Winter Olympics. Ashley Brewer presents the play-by-play and live interviews during the games.[2]\n\nThe series reunite previous contestants from The Bachelor and The Bachelorette at a winter resort in Manchester, Vermont, where they are competing with contestants from the various international adaptations of the franchise in various winter sports challenges.[1][3]\n\nContestants [ edit ]\n\nElimination table [ edit ]\n\nPlace Contestant Episode 1 2 3 4 1st Ashley Last In Date Winner Kevin Date In Date 2nd Courtney In In In Runner-up Lily In In In Dean In Date Last Runner-up Lesley In Date Last Luke Date Date In Runner-up Stassi In Date In 9-10 Bibiana Date In In Split Jordan N/A[a] In In Split 11–12 Ally In In Out Josiah Last In Out 13–14 Christian In In Split Clare In Last Split 15 Yuki In In Out 16 Michael In In Quit 17 Ben In In Quit 18 Tiffany In In Quit 19–20 Jenny In Out Rebecca Date Out 21 Benoit In Quit 22–26 Eric Out Jamey Out Laura Out Lauren Out Zoe Out\n\nKey [ edit ]\n\nThe contestant is male. The contestant is female. The couple won Bachelor Winter Games. The couples were the runner-ups. Date The contestant went on a date and gave out a rose at the rose ceremony. Date The contestant went on a date and got a rose at the rose ceremony. Date The contestant won the Winter competition, then went on a date and gave out a rose at the rose ceremony. Date The contestant won the Winter competition, then went on a date and got a rose at the rose ceremony. In The contestant gave or received a rose at the rose ceremony, thus remaining in the competition. Last The contestant won the Winter competition, then went on a date and received the last rose. Last The contestant received the last rose. Split The couple broke up and were eliminated. Quit The contestant voluntarily left the show. Out The contestant had to leave the show due to not having a relationship. Out The contestant was eliminated.\n\nRatings [ edit ]\n\nNo. Title Air date Timeslot (ET) Rating/share\n\n(18–49) Viewers\n\n(millions) 1 \"Episode 1\" February 13, 2018 Tuesday 8:00 p.m. 0.8/3 3.01[4] 2 \"Episode 2\" February 15, 2018 Thursday 8:00 p.m. 0.7/3 3.02[5] 3 \"Episode 3\" February 20, 2018 Tuesday 8:00 p.m. 0.9/3 3.26[6] 4 \"Episode 4\" February 22, 2018 Thursday 8:00 p.m. 0.8/3 3.19[7]\n\nNotes [ edit ]\n\n^ Contestant was not in the competition yet.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Bachelor_Winter_Games", "title": "The Bachelor Winter Games", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}