{"url": "https://people.com/health/halsey-freezing-her-eggs-endometriosis/", "text": "After suffering a miscarriage and struggling with endometriosis, singer Halsey is freezing her eggs.\n\nThe singer says that she recognizes it’s a surprising decision for a young person but she wants to be prepared for her future.\n\nGet push notifications with news, features and more.\n\n“I’m 23 years old, and I’m going to freeze my eggs. And when I tell people that, they’re like, ‘You’re 23, why do you need to do that? Why do you need to freeze your eggs?’ Doing an ovarian reserve is important to me because I’m fortunate enough to have that as an option, but I need to be aggressive about protecting my fertility, about protecting myself,” Halsey — whose real name is Ashley Nicolette Frangipane — said on Thursday’s episode of The Doctors.\n\nImage zoom Halsey Dimitrios Kambouris/amfAR/Getty Images\n\nHalsey spoke openly about her endometriosis for the first time in January 2017, detailing the “frustrating” process of getting diagnosed.\n\n“The thing with endometriosis is that it comes down to that doctors can tend to minimize the female experience when it comes to dealing with it,” she said. “My whole life, my mother had always told me, ‘Women in our family just have really bad periods.’ It was just something she thought she was cursed to deal with and I was cursed to deal with, and that was just a part of my life.”\n\nBut as Halsey toured the world to perform, the stress from being on stage — along with her undiagnosed physical health issues — became too much to bear. One day she collapsed outside her tour bus.\n\n“My tour manager had to take me to a hospital. And the whole time I was there no one knew what to tell me,” she recalled. “Dehydration, stress, anxiety and I was saying, ‘What about my pain?’ A lot of the time they can make you think it’s in your head.”\n\nIt wasn’t until she met Dr. Thais Aliabadi that she finally learned she had endometriosis.\n\n“It was so bittersweet, because it was the relief of knowing that I wasn’t making it up, and I wasn’t being sensitive, and it wasn’t all in my head, but it also kind of sucked to know that I was going to be living with this forever,” Halsey said.\n\nRELATED VIDEO: Halsey Opens Up About Her Endometriosis Battle\n\nAnd just a few months after her diagnosis, she underwent a traumatic experience.\n\n“I was on tour, and I found out I was pregnant. And before I could really figure out what that meant to me and what that meant for my future, for my career, for my life, for my relationship, the next thing I knew I was on stage miscarrying in the middle of my concert,” Halsey revealed. “And the sensation of looking a couple hundred teenagers in the face while you’re bleeding through your clothes and still having to do the show, and realizing in that moment that I never want to make that choice ever again of doing what I love or not being able to because of this disease.”\n\nThe experience pushed her to find a way to manage the chronic disorder, and with the help of Dr. Aliabadi, she got an IUD and underwent surgery.\n\nA year later, Halsey said she “feels much better” now and is confident in her decision to freeze her eggs and take control of her fertility.\n\n“Reproductive illness is so frustrating because it can really make you feel like less of a woman,” she said. “There’s a lot of times when you’re sitting at home and you just feel so terrible about yourself. You’re sick, you don’t feel sexy, you don’t feel proud, you don’t feel like there’s much hope. And so taking these measures, so that hopefully I can have a bright future and achieve the things that I want to achieve by doing the ovarian reserve is really important.”\n\nThe Doctors airs weekdays. Check your local listings for times.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1360&h=712&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1360&h=712&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg", "keywords": [], "authors": ["Julie Mazziotta"], "canonical_link": "https://people.com/health/halsey-freezing-her-eggs-endometriosis/", "title": "Singer Halsey, 23, Is Freezing Her Eggs Because of Endometriosis: 'I Need to Be Aggressive'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bodies,Bodies News,Celebrity Bodies,Celebrity Health,Celebrity Health Battles,Halsey,Health,Health News,Medical Conditions,Music News,News", "news_keywords": "Bodies,Bodies News,Celebrity Bodies,Celebrity Health,Celebrity Health Battles,Halsey,Health,Health News,Medical Conditions,Music News,News", "description": "Singer Halsey revealed that she's freezing her eggs at age 23 because of endometriosis", "og": {"title": "Singer Halsey, 23, Is Freezing Her Eggs Because of Endometriosis: 'I Need to Be Aggressive'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/health/halsey-freezing-her-eggs-endometriosis/", "description": "After suffering a miscarriage and struggling with endometriosis, singer Halsey is freezing her eggs. The singer&nbsp;says that she recognizes it’s a surprising decision for a&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1360&h=712&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg", "width": 1360, "height": 712}}, "pinterest": {"url": "https://people.com/health/halsey-freezing-her-eggs-endometriosis/", "description": "Singer Halsey revealed that she's freezing her eggs at age 23 because of endometriosis", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/health/halsey-freezing-her-eggs-endometriosis/", "title": "Singer Halsey, 23, Is Freezing Her Eggs Because of Endometriosis: 'I Need to Be Aggressive'", "description": "Singer Halsey revealed that she's freezing her eggs at age 23 because of endometriosis", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1360&h=712&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fhalsey3.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}