{"url": "https://www.nme.com/blogs/tv-blogs/riverdale-season-2-release-date-cast-plot-2112705", "text": "Since hitting our screens in January, Riverdale surprised critics and viewers alike. The adaptation of the Archie Comics could have been a clunky teen-drama-cum-murder-mystery, but instead managed to be an intricate, clever watch full of pop culture references and easter eggs.\n\nAs millions tuned in for Season 1, in March Riverdale was renewed for a second season, and we’re now mid way through the second series which is a whole lot darker and dramatic than the first. This is what we know about what’s still to come in season two.\n\nRiverdale season 2 release date\n\nIn the US it begins on October 11, 2017 on The CW. It’ll then premier on Netflix UK on Thursday October 12, 2017 – and throughout the season episodes will continue to be made available on the streaming service less than a day after they air in the US. After a mid-season break, the second half of season two is set to return on January 17th in the US, and will be on Netflix on the 18th in the UK.\n\nHow many episodes will there be?\n\nAdvertisement\n\nThere will be 22 episodes – as confirmed by Archie Comics. This is an increase on Season 1, which only had 13 episodes.\n\nThe first episode of #Riverdale Season 2 has finished filming. 21 more episodes to go! pic.twitter.com/PXh0HzYsan — Archie Comics (@ArchieComics) July 7, 2017\n\nThe first episode has already been filmed, and will be called ‘Chapter Fourteen: A Kiss Before Dying’, as confirmed by series developer Roberto Aguirre-Sacasa through his Twitter account.\n\nAny more episode titles?\n\nRoberto Aguirre Sacasa has been revealing the episode titles through his Twitter, and we’ve got up to episode 28:\n\nChapter Fourteen: A Kiss Before Dying\n\nChapter Fifteen: Nighthawks\n\nChapter Sixteen: The Watcher in the Woods\n\nChapter Seventeen: The Town That Dreaded Sundown\n\nChapter Eighteen: When a Stranger Calls\n\nChapter Nineteen: Death Proof\n\nChapter Twenty: Tales from the Darkside\n\nChapter Twenty-One: House of the Devil\n\nChapter Twenty-Two: Silent Night, Deadly Night\n\nChapter Twenty-Three: The Blackboard Jungle\n\nChapter Twenty-Four: The Wrestler\n\nChapter Twenty-Five: The Wicked and the Divine\n\nChapter Twenty-Six: The Tell-Tale Heart\n\nChapter Twenty-Seven: The Hills Have Eyes\n\nChapter Twenty-Eight: There Will Be Blood\n\nAre there any changes to the Riverdale season 2 cast?\n\nDue to Ross Butler’s ongoing commitments with Netflix series 13 Reasons Why, the role of Reggie has been recast, with Charles Melton taking on the role.\n\nAdvertisement\n\nMeanwhile Skeet Ulrich, who plays Jughead’s father FP Jones, will be returning to Season 2 as a series regular, after appearing in 7 episodes in Season 1. Speaking to Deadline, series executive producer Sarah Schecter said: “He’s a stellar actor and we feel we have just scratched the surface of who FP is.” Additionally, TVLine confirmed that Casey Cott, who plays Kevin Keller, will also be promoted to series regular.\n\nIt’s also been confirmed that Molly Ringwald will be reprising her role as Archie’s mum, Mary Andrews.\n\nAnd are there any new characters in Riverdale season 2?\n\nThere will finally be an appearance from Hiram Lodge, who spent season 1 in jail, with Mark Consuelos having been cast. Marisol Nichols, who plays Hermione Lodge, shared this picture on her Instagram of the newly reunited Lodge family:\n\nAccording to Deadline, Brit Morgan has been cast in a recurring role as Penny Peabody, known to some as “Snake Charmer”, an attorney the Southside Serpents keep on retainer – but prefers that her clients don’t pay her with currency; instead they pay her with favours. Deadline are reporting that Jughead will discover this, when he enlists her help to help his Dad in prison.\n\nAs Entertainment Tonight reported, Vanessa Morgan is also set to be joining the cast, as Toni Topaz. Toni is a member of the Southside Serpents who befriends Jughead. Whether she’ll be a love interest for him hasn’t been confirmed.\n\nAdditionally, Hart Denton has been cast as Chic Cooper, the long-lost brother of Betty Cooper.\n\nIs there a Riverdale series 2 trailer yet?\n\nThe first trailer for Riverdale Season 2 debuted at San Diego’s Comic Con on July 22.\n\nOnce again narrated by Jughead (played by Cole Sprouse), the trailer begins with the line, ‘People will look back as the exact moment that last bit of Riverdale’s innocence finally died’. The footage sees Archie (played by K.J. Apa) taking his father (Fred Andrews – played by Luke Perry) into hospital after he was shot at the end of Season 1. Watch it below:\n\nThe second trailer was released on 17 August. The the 30-second teaser sees a shadowy figure reveal that they have “some tragic news to share” – which could relate to the fate of Archie’s father Fred Andrews, who was shot in the season finale.\n\nhttps://www.youtube.com/watch?v=xFkJW1xD7BI\n\nAny idea of the plot?\n\nSeason 1 left us at a cliff-hanger when Fred Andrews was shot in front of his son Archie. Speaking to Entertainment Tonight show runner Roberto Aguirre-Sacasa said the identity of Fred Andrew’s shooter will be “The mystery that launches season two”. He also commented on the rumours that the shooting is no accident, saying “I think there’s definitely a lot to that theory… Hermione says to Veronica, very clearly, if Fred doesn’t sell, it’s going to be really bad for him. And the next thing we see is Fred getting shot. I think that’s one of the first, most likely suspects in my mind.”\n\nIt’s also been reported that we’ll be finding out Fred’s fate at the end of the first episode.\n\nYou find out Fred's ultimate fate at the end of the premiere. #Riverdale #sdcc #wbsdcc — alanna ? (@AlannaBennett) July 22, 2017\n\nAguirre-Sacasa also commented on the Riverdale “civil war” that could occur in Season 2, saying: “In the finale, Betty alludes to it with Jughead. She says, “I don’t want to let the civil war rip us apart.” I can tell you that there’s a civil war brewing between the north side of Riverdale and the south side. That’s something that will really be playing out and complicating our characters’ lives throughout the season.”\n\nCole Sprouse took to reddit to answer some fan questions – and commented that the second season would be: “darker and weirder. much darker. much weirder” adding that “tone and genre elements that we touched upon in the cinematography and narrative are getting a big emphasis season 2.”\n\nWhat about Jughead? Will he be joining the Serpents?\n\nCole Sprouse has confirmed that Jughead will be joining the Serpents. In an interview with Teen Vogue he said: “Jughead ends up joining the Serpents and he gets wrapped up in this world that forces his hand, forces him to play the game — which is something in season one he had a real aversion to.”\n\nAdding that it doesn’t work out as he would plan: “He ends up getting into a lot of trouble because of it. … He ends up a bit more of a damaged kid. He’s a lot angrier than he was in season one. He ends up coming off as kind of a … not necessarily to say a bad boy, but way more angry, which I also think is a fundamentally key experience. He gets himself into a lot of trouble because of his loyalty and honour to his family and friends, and it begins to make him question where his allegiance lies and what that means for his character — if it means stepping back again or if it means putting a foot back in.”\n\nAnd what about the Betty-Archie-Veronica love triangle? Will that play out further in Season 2?\n\nSpeaking to Entertainment Tonight Aguirre-Sacasa said: “Yeah, I think the love triangle, whether we’re playing it directly, or it’s just bubbling underneath, it’s always sort of a part of the show…”\n\nWhat about Veronica, is she set to get more involved in the family business?\n\nSpeaking to NME on set in Canada, Camila Mendes who plays Veronica, revealed that the character would be getting more involved in the family business. Season two sees her father Hiram Lodge being released from prison and returning home, and when asked whether Veronica would be getting more involved in his shady dealings, Mendes responded: “A hundred percent! Veronica season two is fully committing to the family business, and trying to decide how much of that she should share with Archie and her peers; because it is a big secret, but it’s also her life, and she’s chosen to step up to the plate and be part of the family. And be an established member of the family.”\n\nAnd will there be any more deaths?\n\nAlmost certainly. Speaking to NME, when asked what the rest of season two will entail Mädchen Amick revealed: “There will be many more dead bodies” so it looks like the Black Hood’s reign of terror isn’t over yet.", "images": ["https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1.jpg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg", "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1-696x441.jpg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1.jpg", "keywords": [], "authors": ["Hannah Mylrea"], "canonical_link": "https://www.nme.com/blogs/tv-blogs/riverdale-season-2-release-date-cast-plot-2112705", "title": "Riverdale Season 2: New Release Date, Cast & Plot hints", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Riverdale Season 2 is coming in October. Here is everything you need to know, including cast updates, plot hints, release dates and trailers.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "Riverdale Season 2: New Release Date, Cast & Plot hints", "description": "Riverdale Season 2 is coming in October. Here is everything you need to know, including cast updates, plot hints, release dates and trailers.", "url": "https://www.nme.com/blogs/tv-blogs/riverdale-season-2-release-date-cast-plot-2112705", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1.jpg", "width": 1000, "height": 634}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "section": "TV Blogs", "published_time": "2017-12-11T13:55:47+00:00"}, "twitter": {"card": "summary_large_image", "description": "Riverdale Season 2 is coming in October. Here is everything you need to know, including cast updates, plot hints, release dates and trailers.", "title": "Riverdale Season 2: New Release Date, Cast & Plot hints", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2017/07/c05f70fc480027a31cad26f407d7d2e68ce2e097-1.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": ["https://www.youtube.com/embed/FpWZcMWsdk0?feature=oembed"], "publish_date": 1513000547.0, "source": "https://www.nme.com", "summary": ""}