{"url": "https://popculture.com/celebrity/2018/06/08/anthony-bourdain-said-had-responsibility-live-for-daughter/", "text": "In one of his last interviews, Anthony Bourdain said he felt a \"responsibility\" to live for his 11-year-old daughter, Ariane.\n\nDuring his final interview with PEOPLE in February, the Parts Unknown host said he felt \"some responsibility\" to \"at least try to live\" for Ariane.\n\n\"I also do feel I have things to live for,” Bourdain told the magazine. “There have been times, honestly, in my life that I figured, ‘I’ve had a good run — why not just do this stupid thing, this selfish thing… jump off a cliff into water of indeterminate depth.'\"\n\nBefore Bourdain and his ex-wife Ottavia Busia welcomed their daughter, he would go to places where he was \"asking for trouble,\" but he grew apprehensive about \"daredevil\" moves after Ariane was born.\n\n\"I don’t know that I would do that today — now that I’m a dad or reasonably happy,\" he said.\n\nBourdain spoke with PEOPLE in February when the magazine followed Bourdain during the filming of a Parts Unknown episode in Louisiana, which was not scheduled to air until June 17. In that interview, he said he had no interest in ending the show or retiring.\n\n“I gave up on that. I’ve tried. I just think I’m just too nervous, neurotic, driven,” he told PEOPLE. “I would have had a different answer a few years ago. I might have deluded myself into thinking that I’d be happy in a hammock or gardening. But no, I’m quite sure I can’t... I’m going to pretty much die in the saddle.”\n\nBourdain also told PEOPLE he was \"happy in ways that I have not been in memory” and “happy in ways I didn’t think I ever would be, for sure.”\n\nAs Bourdain had done in many interviews in the past, he spoke about his past demons, including his addiction to heroin and cocaine, and his use of alcohol. At the end of his days in the restaurant industry, he was \"definitely drinking too much\" because of the stress and the free alcohol.\n\n\"When there’s something that I like... films or books or a particular author, I do pursue them with more zeal than perhaps a lot of other people,\" Bourdain said. \"I don’t know if that’s addictive, habitual or whatever.”\n\nBourdain also made sure he spent at least five days a month with Ariane, who lives in New York with Busia.\n\n“I’ll go back, see my daughter, unpack, repack, mimic a normal life, which is extraordinarily pleasurable to me,” he told PEOPLE.\n\nBourdain was found dead Friday morning from an apparent suicide in a hotel in France, where he was filming a new episode of Parts Unknown. He was 61.\n\nIf you or someone you know needs help, please call the National Suicide Prevention Lifeline at 1-800-273-TALK (8255).", "images": ["https://media.popculture.com/2018/06/anthony-bourdain-20037091-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/06/anthony-bourdain-20037091-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2018/06/08/anthony-bourdain-said-had-responsibility-live-for-daughter/", "title": "Anthony Bourdain Had a 'Responsibility' to Live for His Daughter in Last Interview", "meta_data": {"description": "In one of his last interviews, Anthony Bourdain said he felt a 'responsibility' to live for his 11-year-old daughter, Ariane.During his final interview with PEOPLE in February, the Parts Unknown host said he felt 'some responsibility' to 'at least try to live' for Ariane.'I also do feel I have [...]", "keywords": "Anthony Bourdain,Celebrity Deaths,suicide", "news_keywords": "Anthony Bourdain,Celebrity Deaths,suicide", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "dsl89", "title": "Anthony Bourdain Had a 'Responsibility' to Live for His Daughter in Last Interview", "description": "In one of his last interviews, Anthony Bourdain said he felt a 'responsibility' to live for his [...]", "image": "https://media.popculture.com/2018/06/anthony-bourdain-20037091-640x320.jpeg"}, "og": {"title": "Anthony Bourdain Had a 'Responsibility' to Live for His Daughter in Last Interview", "type": "article", "url": "https://popculture.com/celebrity/2018/06/08/anthony-bourdain-said-had-responsibility-live-for-daughter/", "image": {"identifier": "https://media.popculture.com/2018/06/anthony-bourdain-20037091-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "In one of his last interviews, Anthony Bourdain said he felt a 'responsibility' to live for his [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1528387200.0, "source": "https://popculture.com", "summary": ""}