{"url": "https://www.necn.com/entertainment/entertainment-news/Ryan-Phillippe-Responds-to-Assault-Allegations-445800213.html", "text": "Ryan Phillippe is making a statement in response to ex-girlfriend Elsie Hewitt's assault allegations.\n\n\"As a staunch advocate for the health, well-being and equality of women, Ryan is completely devastated that these false allegations have been made and circulated,\" a rep for the actor tells E! News in a statement. \"Domestic violence is an incredibly serious issue and fabricated and proven false claims should not be used to unjustly slander the falsely accused. The claims are false.\"\n\nOn Monday, Hewitt had filed a $1 million lawsuit against Phillippe claiming assault, battery and intentional infliction of emotional distress.\n\nRyan Phillippe's Ex-Girlfriend Files $1 Million Lawsuit Claiming the Actor Assaulted Her\n\nDocuments obtained by E! News show that Hewitt claims that on July 4 of this year, Phillippe kicked, punched and threw her down a flight of stars during a fight.\n\nIn response to Phillippe's statement, Hewitt's attorney tells E! News, \"The only thing Phillipe's PR statement has right is the fact that domestic violence is a serious issue. The claim that he didn't assault her is laughable. He must think the media a bunch of fools. She has photos of the serious cuts and bruises she suffered as a result of the assault. She has hospital records documenting her injuries. The police took a report of the assault and issued a restraining order. Her employer Paul Marciano at Guess can confirm her injuries as can her friend who witnessed the assault. Add to this any man who calls a woman a c--- has serious animus towards women in general and would not be one championing the equality of women.\"\n\n[NATL] Top Entertainment Photos: Best of the American Music Awards, and More\n\nRyan Phillippe and Fiance Paulina Slagter Break Up After 5 Years Together\n\nMeanwhile, a source close to Phillippe tells E! News that, \"There is no restraining order presently in force if any kind\" and that there was an emergency protective order which was terminated a few days after the alleged incident.\n\nThe insider also claims that, \"Elsie showed up to Ryan's house uninvited and under the influence a few days after he had broken up with her. She physically attached Ryan, caused a scene and refused to leave his home. As she was ejected from the premises, she claims she fell and injured herself.\"\n\nThe source adds the police rejected her claims and the city attorney is not prosecuting the case based on their own independent investigation. The insider also adds that Hewitt has since tried to seek revenge and fame by sending glamour shots of herself to media outlets with a false story of domestic violence.\n\nRyan Phillippe Hospitalized With Leg Injury: I'm Going to Be Ok\n\nIn response to this information, Hewitt's attorney tells us, \"Neither the police nor the city attorney rejected her claims. In fact the police filed a report and issued a restraining order. The City Attorney is investigating filing charges. She has not felt the need to get an additional restraining order. She rejected his overture to get back with him and since then he has not doing anything to necessitate seeking an additional restraining order. She texted him before coming to his house. She had the password to enter his house-he gave it to her. He was the one under the influence not Ms. Hewitt. She was the one who broke up with him. She has a witness that was present when he battered her. The witness saw him physically grab her and toss her down the stairs like a rag doll. The claim she trip and fell is false and belied by the bruises on her body as well the witness.\"\n\nThe LA City Attorney's office spokesperson tells E! News, \"The City Attorney's Office was referred this matter following an investigation by the LAPD. After a thorough review the matter was set for a City Attorney office hearing, during which both parties were present, detailed the incident, were advised on the law and given guidance as to how to avoid similar incidents in the future. No further action has been scheduled following our office hearing.\"\n\nThe LA City attorney spokesperson added, \"Our office reserves the right to file charges up to one year from the incident, but other than the office hearings, no further action is anticipated.\"\n\nA source also confirms that Phillippe has hired a lawyer.", "images": ["https://media.necn.com/2019/09/goodnews2-apr17.jpg?resize=850%2C478", "https://media.necn.com/2019/09/GettyImages-1219262470.jpg?crop=0px%2C12px%2C1024px%2C576px&resize=850%2C478", "https://media.necn.com/2019/09/Ryan-Philippe-pic.jpg?resize=850%2C478", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.necn.com/2019/09/NECN_On_Dark@3x-3.png?fit=420%2C120", "https://media.necn.com/2019/09/NECN_On_Light-@3x-1.png?fit=354%2C120"], "top_img": "https://media.necn.com/2019/09/Ryan-Philippe-pic.jpg?resize=850%2C478", "keywords": [], "authors": ["Jess Cohen"], "canonical_link": "http://www.eonline.com/news/881387/ryan-phillippe-responds-to-ex-girlfriend-s-assault-allegations-the-claims-are-false", "title": "Ryan Phillippe Responds to Ex-Girlfriend’s Assault Allegations: ‘The Claims Are False’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "og": {"site_name": "NECN", "type": "article", "description": "Ryan Phillippe is making a statement in response to ex-girlfriend Elsie Hewitt’s assault allegations. “As a staunch advocate for the health, well-being and equality of women, Ryan is completely devastated that these false allegations have been made and circulated,” a rep for the actor tells E! News in a statement. “Domestic violence is an incredibly serious issue and fabricated and proven false claims should not be used to unjustly slander the falsely accused. The claims are false.”", "title": "Ryan Phillippe Responds to Ex-Girlfriend’s Assault Allegations: ‘The Claims Are False’", "url": "https://www.necn.com/news/national-international/ryan-phillippe-responds-to-assault-allegations/2032451/", "image": "https://media.necn.com/2019/09/Ryan-Philippe-pic.jpg?resize=850%2C478"}, "google-site-verification": "E-egfefm-gv7oaXIe_jmNFN6dmiCZmu4-1sgCkoQTV8", "fb": {"app_id": 424638114340719}, "twitter": {"site": "@NECN", "creator": "@NECN", "description": "Ryan Phillippe is making a statement in response to ex-girlfriend Elsie Hewitt’s assault allegations. “As a staunch advocate for the health, well-being and equality of women, Ryan is completely devastated that these false allegations have been made and circulated,” a rep for the actor tells E! News in a statement. “Domestic violence is an incredibly serious issue and fabricated and proven false claims should not be used to unjustly slander the falsely accused. The claims are false.”", "title": "Ryan Phillippe Responds to Ex-Girlfriend’s Assault Allegations: ‘The Claims Are False’", "url": "https://www.necn.com/news/national-international/ryan-phillippe-responds-to-assault-allegations/2032451/", "image": "https://media.necn.com/2019/09/Ryan-Philippe-pic.jpg?resize=850%2C478"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/necntv"}, "description": "Ryan Phillippe is making a statement in response to ex-girlfriend Elsie Hewitt’s assault allegations. “As a staunch advocate for the health, well-being and...", "keywords": "actor, Attorney, City Attorney, E! News, Guess, Jess Cohen, lawyer, media outlets, spokesperson", "sailthru.title": "Ryan Phillippe Responds to Ex-Girlfriend’s Assault Allegations: ‘The Claims Are False’", "sailthru.description": "Ryan Phillippe is making a statement in response to ex-girlfriend Elsie Hewitt’s assault allegations. “As a staunch advocate for the health, well-being and...", "sailthru.tags": "actor, Attorney, City Attorney, E! News, Guess, Jess Cohen, lawyer, media outlets, spokesperson", "sailthru.type": "article", "sailthru.date": "2017-09-19T15:30:08+00:00", "msapplication-TileImage": "https://media.necn.com/2019/09/cropped-NECN-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1505835008.0, "source": "https://www.necn.com", "summary": ""}