{"url": "https://www.usatoday.com/story/sports/columnist/brennan/2018/02/07/2018-winter-olympics-vice-president-mike-pence-adam-rippon-south-korea-gay-rights/314167002/", "text": "PYEONGCHANG, South Korea – Vice President Pence is set to arrive here soon to lead the official U.S. delegation to the 2018 Winter Olympic opening ceremony, a delegation that is making a strong political statement against North Korea’s oppressive regime by including the father of Otto Warmbier, the student who died not long after being held in captivity in North Korea.\n\nBut on the afternoon on Jan. 17, Pence had another focus: He was so concerned about the criticism he received from U.S. Olympic figure skater Adam Rippon that his staff went to the extraordinary length of asking the U.S. Olympic Committee to set up a conversation between the two – an offer Rippon turned down.\n\nAccording to two people with knowledge of the situation who were not authorized to speak publicly about it, a member of Pence’s staff requested the conversation with the openly gay Rippon after reading the skater’s derogatory remarks about him in a USA TODAY Sports story that had been published online just an hour earlier.\n\nRippon, the two people said, declined the invitation.\n\nMore:Winter Olympics security workers hit with vomiting illness; military personnel called in for backup\n\nMore:Gus Kenworthy feels like 'whole new person' leading into Pyeongchang\n\nThe spat between the vice president and the figure skater began when I asked Rippon last month about Pence’s selection for the ceremonial role of leading the U.S. delegation to the Olympic opening ceremony.\n\n“You mean Mike Pence, the same Mike Pence that funded gay conversion therapy? I’m not buying it,” Rippon said.\n\nAfter reading the story online, Pence’s press secretary quickly shot back, sending USA TODAY SPORTS a rebuttal to Rippon’s comments:\n\n“The vice president is proud to lead the U.S. delegation to the Olympics and support America’s incredible athletes,” press secretary Alyssa Farah said. “This accusation is totally false and has no basis in fact. Despite these misinformed claims, the vice president will be enthusiastically supporting all the U.S. athletes competing next month in Pyeongchang.”\n\nBut that was not the end of it. Pence apparently was so concerned about Rippon’s comments that he then set in motion the attempt to speak with him. Farah did not reply to an email earlier this week seeking comment, but after the story was published, Jarrod Agen, Pence's deputy chief of staff and communications director, issued a statement.\n\n\"The vice president’s office did not reach out to set up a conversation with Mr. Rippon. As we’ve said before, the Vice President is supporting all the U.S. athletes in the Olympics and is hoping they all win medals.\"\n\nOn Jan. 30, nearly two weeks after the dust-up, Rippon said that he was focusing solely on training for the upcoming Olympics. “I’m not trying to pick a fight with the vice president of the United States,” he said.\n\nRippon has said several times that he would consider meeting with Pence sometime later.\n\n“If I had the chance to meet him afterwards, after I’m finished competing, there might be a possibility to have an open conversation,” Rippon said in the interview last month. “He seems more mild-mannered than Donald Trump. … But I don’t think the current administration represents the values that I was taught growing up. Mike Pence doesn’t stand for anything that I really believe in.”\n\nThe comments from Rippon about gay conversion therapy that so riled Pence come from a widespread belief stemming from a statement Pence made in 2000 on his congressional campaign website: “Resources should be directed toward those institutions which provide assistance to those seeking to change their sexual behavior.”\n\nWhile Pence didn’t explicitly mention gay conversion therapy, leaders in the LGBT community have said they believe that’s exactly what Pence meant in light of his long-standing opposition to gay rights. In November 2016, the New York Times reported that Pence's spokesman at the time, Marc Lotter, denied that Pence supports the practice.\n\nI emailed Farah on Jan. 17 asking what the website statement was referring to, if not gay conversion therapy. She did not send an on-the-record reply.\n\nRippon, 28, the 2016 U.S. men’s figure skating champion who is one of the first openly gay U.S. Winter Olympians, was selected to his first Olympic team in early January after finishing fourth at the U.S. national championships.\n\nHe said he would prefer not to meet Pence during the traditional meet-and-greet between the official delegation and U.S. athletes in the hours leading to the opening ceremony. It’s possible Rippon will have to miss that event anyway to be part of the team figure skating competition.\n\n“If it were before my event, I would absolutely not go out of my way to meet somebody who I felt has gone out of their way to not only show that they aren’t a friend of a gay person but that they think that they’re sick,” Rippon said. “I wouldn’t go out of my way to meet somebody like that.\"\n\nRippon, who said he was bullied and teased as a boy growing up in Scranton, Pa., came out publicly as being gay in an October 2015 story in Skating magazine. He often talks about how he hopes his story can help others, especially young people who might be struggling with their sexuality.\n\nAlways outspoken, Rippon said recently he will not go to the White House for a post-Olympic celebration hosted by President Trump: “I said no.” Legendary skier Lindsey Vonn has also said she will not attend.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5721613879001_5721609726001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/0e2cf45ea44560d1d11ee93f75600ba33d6160cc/c=0-564-1992-1690/local/-/media/2018/02/07/USATODAY/USATODAY/636535621827839316-cxx-Adam-Rippon-18.jpg?width=1992&height=1126&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/190a6e9e3803d396bb5deb5b90b55836331323f7/c=35-271-1925-2791/local/-/media/2018/02/07/USATODAY/USATODAY/636535621827839316-cxx-Adam-Rippon-18.jpg?width=300&height=400&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/0e2cf45ea44560d1d11ee93f75600ba33d6160cc/c=0-564-1992-1690/local/-/media/2018/02/07/USATODAY/USATODAY/636535621827839316-cxx-Adam-Rippon-18.jpg?width=1992&height=1126&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/sports/columnist/brennan/2018/02/07/2018-winter-olympics-vice-president-mike-pence-adam-rippon-south-korea-gay-rights/314167002/", "title": "Openly gay figure skater Adam Rippon declined chance to speak with Vice President Pence", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Openly gay figure skater Adam Rippon declined chance to speak with Vice President Pence", "description": "Pence’s staff requested the conversation with the openly gay Rippon after reading the skater’s derogatory remarks about him in a USA TODAY Sports.", "url": "https://www.usatoday.com/story/sports/columnist/brennan/2018/02/07/2018-winter-olympics-vice-president-mike-pence-adam-rippon-south-korea-gay-rights/314167002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/0e2cf45ea44560d1d11ee93f75600ba33d6160cc/c=0-564-1992-1690/local/-/media/2018/02/07/USATODAY/USATODAY/636535621827839316-cxx-Adam-Rippon-18.jpg?width=1992&height=1126&fit=crop&format=pjpg&auto=webp", "width": 1992, "height": 1126}, "type": "article"}, "article": {"author": "Christine Brennan", "content_tier": "free", "opinion": "false"}, "description": "Pence’s staff requested the conversation with the openly gay Rippon after reading the skater’s derogatory remarks about him in a USA TODAY Sports.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/0e2cf45ea44560d1d11ee93f75600ba33d6160cc/c=0-564-1992-1690/local/-/media/2018/02/07/USATODAY/USATODAY/636535621827839316-cxx-Adam-Rippon-18.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Openly gay figure skater Adam Rippon declined chance to speak with Vice President Pence", "description": "Pence’s staff requested the conversation with the openly gay Rippon after reading the skater’s derogatory remarks about him in a USA TODAY Sports."}}, "movies": [], "publish_date": 1517932800.0, "source": "https://www.usatoday.com", "summary": ""}