{"url": "https://www.hollywoodreporter.com/live-feed/pose-renewed-season-2-at-fx-1126740", "text": "FX is going back to the ball.\n\nThe basic cable network has handed out a second-season renewal for the dance musical drama Pose. The show, from co-creators Ryan Murphy, Brad Falchuk and Steven Canals, will return for its sophomore run in 2019. An episode count has not been determined.\n\n“Ryan Murphy has once again revolutionized television with Pose, an incredibly engaging story of creativity, courage, compassion, love and family at a pivotal time in our culture,” FX CEO John Landgraf said Thursday in a statement. “As television critics have universally acknowledged, there is simply nothing like Pose on TV, so effortlessly excelling on every creative level and earning a place in television history for its infectiously inclusive spirit. We are honored to partner with our producers Ryan, Brad Falchuk, Steven Canals, Nina Jacobson, Brad Simpson, Alexis Martin Woodall and Sherry Marsh, and the incredible cast and crew to continue this groundbreaking journey that is Pose.”\n\nThe renewal comes as Pose has two episodes remaining in its eight-hour freshman run. The series, which has drawn impressive reviews, made history with primetime's largest cast of transgender series regulars portraying transgender characters as well as the largest recurring cast of LGBTQ characters ever for a scripted series. The show also recently made history when Janet Mock became the first trans black woman to direct a primetime drama. Mj Rodriguez, Dominique Jackson, Indya Moore, Hailie Sahar and Angelica Ross star alongside Evan Peters, Kate Mara, James Van Der Beek, Billy Porter, Charlayne Woodard and newcomers Ryan Jamaal Swain, Dyllon Burnside and Angel Bismark Curiel.\n\nThe drama, which is set in the 1980s, explores the New York ball scene as well as issues including HIV/AIDS and the class system during the rise of the luxury Trump-era world. Pose hails from FX Productions and Fox 21 TV Studios.\n\n“Ryan Murphy and his talented collaborators Brad Falchuk, Nina Jacobson, Brad Simpson, Steven Canals, Alexis Martin Woodall and Sherry Marsh have truly outdone themselves with this triumphant show that is as universal in its themes of love and family as it is specific and important and one of a kind,” said Fox Television Group chairmen and CEOs Dana Walden and Gary Newman. “We are so proud of what they’ve achieved and grateful to John and FX for their steadfast belief in the series.”\n\nThe news comes as Murphy exited his longtime home at 20th Century Fox TV for a $300 million deal with Netflix. He will remain involved with Pose as an executive producer.\n\nThe series is part of an FX lineup that also includes the dramas Taboo, Legion, Snowfall, Trust, Fargo and Murphy-produced American Horror Story, American Crime Story and Feud. Next up for the network are Mr Inbetween and Sons of Anarchy spinoff Mayans MC.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/07/pose_s01e02_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2018/12/pose_s01e05_still_1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/11/fx-logo.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/lesley_goldberg_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/2018/07/pose_s01e02_still.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/07/pose_s01e02_still.jpg", "keywords": [], "authors": ["Lesley Goldberg", "Lesley.Goldberg Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/pose-renewed-season-2-at-fx-1126740", "title": "'Pose' Renewed for Season 2 at FX", "meta_data": {"viewport": "width=device-width", "description": "'Pose' renewed for second season at FX.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/pose-renewed-season-2-at-fx-1126740", "domain": "https://www.hollywoodreporter.com/", "title": "'Pose' Renewed for Season 2 at FX", "description": "The drama features primetime's largest cast of trans actors portraying trans characters to date.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/07/pose_s01e02_still.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Pose' Renewed for Season 2 at FX", "description": "The drama features primetime's largest cast of trans actors portraying trans characters to date.", "url": "https://www.hollywoodreporter.com/live-feed/pose-renewed-season-2-at-fx-1126740", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/07/pose_s01e02_still.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Pose' Renewed for Season 2 at FX", "sailthru.description": "The drama features primetime's largest cast of trans actors portraying trans characters to date.", "sailthru.author": "Lesley Goldberg", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-07-12 15:18:07", "sailthru.tags": "Live Feed, Television, FX, Ryan Murphy, Pose, Pose (TV), LGBTQ"}, "movies": [], "publish_date": 1531379887.0, "source": "https://www.hollywoodreporter.com", "summary": ""}