{"url": "https://en.wikipedia.org/wiki/Casey_Affleck", "text": "American actor\n\nCaleb Casey McGuire Affleck-Boldt (born August 12, 1975) is an American actor and director. He began his career as a child actor, appearing in the PBS television film Lemon Sky (1988) and the miniseries The Kennedys of Massachusetts (1990). He later appeared in three Gus Van Sant films – To Die For (1995), Good Will Hunting (1997), and Gerry (2002) – and in Steven Soderbergh's comedy heist trilogy Ocean's Eleven (2001), Ocean's Twelve (2004), and Ocean's Thirteen (2007). His first leading role was in Steve Buscemi's independent comedy-drama Lonesome Jim (2006).\n\nAffleck's breakthrough was in 2007, when he was nominated for the Academy Award for Best Supporting Actor for his performance in the Western drama The Assassination of Jesse James by the Coward Robert Ford and acted in the crime drama Gone Baby Gone, directed by his brother Ben Affleck. In 2010, he directed the mockumentary I'm Still Here. He then had a string of successful films in the early 2010s, with Tower Heist, ParaNorman, and Interstellar, and received particular praise for his performance as an outlaw in the indie film Ain't Them Bodies Saints.\n\nIn 2016, Affleck starred as the lead in the drama film Manchester by the Sea. For his performance as Lee Chandler, a man grieving the loss of his children, he won the Golden Globe, BAFTA and Academy Award for Best Actor, and received a Screen Actors Guild Award nomination. In 2017, Affleck received critical acclaim for his leading role in the supernatural drama film A Ghost Story.\n\nEarly life [ edit ]\n\nCaleb Casey McGuire Affleck-Boldt[1] was born on August 12, 1975 in Falmouth, Massachusetts, to Christopher Anne \"Chris\" Boldt and Timothy Byers Affleck.[2][3][4] The surname \"Affleck\" is of Scottish origin.[5] He also has Irish,[6][7] German,[8] English, and Swiss ancestry.[9][full citation needed] Affleck's maternal great-great grandfather, Heinrich Boldt, -known for the discovery of the Curmsun Disc, emigrated from Prussia in the late 1840s.[10][11] Casey's mother was a Radcliffe College– and Harvard–educated elementary school teacher. His father worked sporadically as an auto mechanic,[12][13] a carpenter,[14] a bookie,[15][16] an electrician,[17] a bartender,[18] and a janitor at Harvard University.[19][20][21][22] In the mid-1960s, he had been a stage manager, director, writer and actor with the Theater Company of Boston.[23][24][25] During Affleck's childhood, his father was \"a disaster of a drinker\".[26] Affleck first started acting by \"reenacting what was happening at home\" during role play exercises at Alateen meetings.[27]\n\nFollowing his parents' divorce when he was 9, Affleck and his older brother, Ben, lived with their mother and visited their father weekly.[26] He learned to speak Spanish during a year spent traveling around Mexico with his mother and brother when he was 10.[28] The two siblings spent \"all of our time together, pretty much. Obviously at school we were in different grades, but we had the same friends.\"[28] When Affleck was 14, his father moved to Indio, California to enter a rehabilitation facility, and later worked there as an addiction counselor.[17][29][30][31] Affleck reconnected with his father during visits to California as a teenager: \"I got to know him, really, because he was sober for the first time ... The man I knew before that was just completely different.\"[26][32]\n\nGrowing up in a politically active, liberal household in Central Square, Cambridge,[15][33] Affleck and his brother were surrounded by people who worked in the arts,[34] were regularly taken to the theater by their mother,[35] and were encouraged to make their own home movies.[36] The brothers sometimes appeared in local weather commercials and as movie extras because of their mother's friendship with a local casting director.[18][32][37] Casey acted in numerous high school theater productions while a student at Cambridge Rindge and Latin School.[32][38] He has said he \"wouldn't be an actor\" if not for his high school theater teacher Gerry Speca: \"He kind of turned me on to acting, why it can be fun, how it can be rewarding.\"[38]\n\nAt the age of 18, Affleck moved to Los Angeles for a year to pursue an acting career, and lived with his brother and their childhood friend Matt Damon.[39] Despite having \"the best possible first experience\" while filming To Die For,[40] he spent much of the year working as a busboy at a restaurant in Pasadena. He decided to move to Washington, D.C., to study politics at George Washington University.[18] He soon transferred to Columbia University in New York City, where he followed the core curriculum for a total of two years.[41][42] However, he did not graduate: \"I would do a semester of school, go do a movie ... Opportunities kept presenting themselves that were hard for me to turn down ... By then, I didn't really have roots at the school or a group of friends.\"[40]\n\nCareer [ edit ]\n\nEarly work (1988–2006) [ edit ]\n\nAffleck acted professionally during his childhood due to his mother's friendship with a Cambridge-area casting director, Patty Collinge.[40] In addition to local weather commercials and movie extra work,[43] he appeared as Kevin Bacon's brother in the PBS television movie Lemon Sky (1988), directed by Collinge's husband Jan Egleson,[40] and as a young Robert Kennedy in the ABC miniseries The Kennedys of Massachusetts (1990).[44] These early acting experiences \"meant nothing more than a day off from school\" to Affleck, and he only began to consider a career as an actor when in high school.[43] When he later moved to Los Angeles to pursue an acting career in earnest, his first movie role was as a sociopathic teenager in Gus Van Sant's 1995 satirical comedy To Die For. During filming in Toronto, Affleck shared an apartment with co-star Joaquin Phoenix and they became close friends.[36] Peter Travers of Rolling Stone praised Affleck's performance, saying he \"skillfully capture[s] the pang of adolescence among no-hopers.\"[45][46] However, Affleck then had a \"disappointing\" experience while making the 1996 drama Race the Sun and, \"as soon as the film finished, I went to school.\"[42]\n\nWhile studying at Columbia, Affleck had a supporting role in Van Sant's Good Will Hunting (1997), written by his brother and their childhood friend Matt Damon.[18][40] Despite arranging a first meeting between Van Sant and his brother to discuss the project, Affleck was reluctant to leave college temporarily to act in the film.[42] He was eventually persuaded to play one of four friends living in South Boston – a role written specifically for him[39] – and improvised many of his lines.[47][48] Jay Carr of The Boston Globe praised the \"emotional subtleties and variety\" of the performances, and singled out \"Casey Affleck's junior member of the quartet, dying to be taken as seriously as the others.\"[49] Following the critical and commercial success of the movie, Affleck's career opportunities did not significantly improve. At the same time, his life became exposed to the public and parts of his life became \"part of pop culture and public life.\"[18] Also in 1997, he had a small role in Kevin Smith's Chasing Amy, starring his brother. He returned to university for a semester before quitting to focus on his acting career.[42]\n\nAffleck's career entered a \"dark\" period, with a series of supporting roles in critical and commercial failures.[39][36] He later remarked: \"It dawned on me late that I should be selective about what I do.\"[40] In the independent comedy Desert Blue (1998), he starred opposite Kate Hudson as a small-town jock.[50] Peter Stack of the San Francisco Chronicle felt that, while \"interesting\", his character was \"entirely underdeveloped\".[51] In 1999, he made an uncredited cameo in the teen comedy American Pie[52] and appeared as a punk rocker romantically involved with both Gaby Hoffmann and Christina Ricci's characters in the New Year's Eve ensemble comedy 200 Cigarettes.[53][54] In the comedy Drowning Mona (2000), starring Danny DeVito, Affleck played a shy gardener suspected of murder.[55] Elvis Mitchell of The New York Times acknowledged, in an otherwise negative review, that his role was \"well played\".[56] Also in 2000, Affleck had a small role in the comedy Attention Shoppers and played Fortinbras in Ethan Hawke's Hamlet.[57] He appeared as the brother of Heather Graham's character in the romantic comedy Committed (2001), with Emanuel Levy of Variety praising a \"terrific\" performance.[58] Also in 2001, he had a small role in American Pie 2 and appeared in the teen slasher film Soul Survivors. Robert Koehler of Variety found him \"bland\"[59] while Carla Meyer of the San Francisco Chronicle said that he did not make \"much of an impression, [but may] have been too depressed to really act.\"[60] One positive experience Affleck had during this period was working with Van Sant and cinematographer Harris Savides on Finding Forrester (2000) as Van Sant's assistant and technical consultant: \"Can you imagine a better film school that that? Gus is not only somebody who I love a lot but is also who has taught me, maybe more than anybody else in film.\"[36][61]\n\nAffleck found a degree of commercial success when he was cast in Steven Soderbergh's heist comedy Ocean's Eleven (2001), starring George Clooney, Brad Pitt and Damon. In roles Soderbergh originally intended for Luke Wilson and Owen Wilson,[62] Affleck and Scott Caan played Mormon brothers and wisecracking mechanics who help to rob three Las Vegas casinos simultaneously.[63] While it was a \"great, fun social experience,\" Affleck spent much of his time on set \"being, like, 100 feet away from the camera in the background.\"[39] He would later reprise his role in Ocean's Twelve (2004) and Ocean's Thirteen (2007).\n\nIn 2002, Affleck and Damon starred in Van Sant's experimental drama Gerry, playing two men who get lost while hiking in the desert.[64][65] Affleck, Damon, and Van Sant conceived of the idea and wrote the screenplay together while living in neighboring New York apartments.[47] The film, which had minimal dialogue, received mixed reviews.[66][67] Affleck, who rarely watches his own movies,[63] said of Gerry in 2016: \"That was an incredible experience. I saw one scene recently out of context at the Telluride Film Festival and I can't believe anyone ever sat through the whole thing. It probably works better as a whole but one scene lifted out – I thought, 'This is unbearable!'\"[40] Also in 2002, Affleck starred with Damon and then-girlfriend Summer Phoenix in a West End stage production of Kenneth Lonergan's This Is Our Youth.[18][68][69] Lonergan and Affleck became friends during rehearsals,[70] and Affleck later acted in workshop productions of Lonergan's plays in New York.[71][72]\n\nAffleck's first leading role was in 2006's little-seen independent comedy-drama Lonesome Jim, directed by Steve Buscemi. He played a depressed writer who returns from New York to live with his parents in Indiana, and begins a relationship with Liv Tyler's character.[73] Buscemi has said he knew Affleck would be able to carry the movie after watching his performance in Gerry.[74][75] Stephen Hunter of the Washington Post remarked: \"Affleck's interesting .. He probably can't be a star in big movies because his drawback is a voice that sounds like a snivel drawn through a wet nasal passage into a whine ... And yet in certain kinds of films – this kind – he's 100 percent authentic.\"[76] Ty Burr of the Boston Globe said Affleck \"gets so far under the skin of this semi-charming jerk that the performance becomes both brave and aggravating.\"[77] However, Stephen Holden of The New York Times felt it \"would be a stronger movie if Mr. Affleck had the wherewithal to bare more of the passive-aggressive rage inside ... a more resourceful actor would have used this blank slate to scrawl a thousand telling details.\"[78] Also in 2006, he had a supporting role in the romantic comedy The Last Kiss as a friend of Zach Braff's character.[79]\n\nBreakthrough (2007–2012) [ edit ]\n\nAffleck had a breakthrough year in 2007, with the release of two films featuring critically acclaimed performances.[80] The first of these performances was in the Western drama The Assassination of Jesse James by the Coward Robert Ford, in which he played Robert Ford to Brad Pitt's Jesse James.[81] Affleck auditioned repeatedly for the role.[82] While the director Andrew Dominik had seen Affleck in Gerry,[83][84] he cast him partly because of his \"beautiful-sounding voice. The voice is the thing that really gets you.\"[85][86] Manohla Dargis of The New York Times described Affleck's performance as a \"revelation\" which \"manages to make the character seem dumb and the actor wily and smart.\"[87] Similarly, Claudia Puig of USA Today declared him a \"real revelation [who] perfectly inhabits the role\"[88] while Todd McCarthy of Variety said Affleck made \"an indelible impression as the insecure, physically unprepossessing weakling.\"[89] Dana Stevens of Slate said \"the movie belongs to Affleck [who] goes for broke in a wonderfully brave and weird performance as the craven naif Bob. Somehow he makes us want to flee this creep at top speed, even as we pray no harm will come to him.\" For his performance, Affleck was nominated for the Golden Globe Award, Screen Actors Guild Award and Academy Award for Best Supporting Actor.\n\nGone Baby Gone in 2006 Affleck on the set ofin 2006\n\nWhile he was filming The Assassination of Jesse James by the Coward Robert Ford in Calgary, Affleck was visited by his brother, who offered him the leading role in his directorial project, the Boston crime thriller Gone Baby Gone (2007).[40] While his brother was a first-time director and in the midst of a career downturn, Affleck had confidence in the project: \"I felt like I knew him better than anyone else did.\"[40][90] His performance, as an inexperienced private investigator tasked with finding a missing child, earned Affleck further plaudits for his acting.[91] Manohla Dargis of The New York Times said: \"I'm not sure exactly when Casey Affleck became such a good actor ... Most actors want you to love them, but [he] doesn't seem to know that, or maybe he doesn't care.\"[92] Jim Ridley of The Village Voice described him as \"a major talent coming into his own\"[93] while Mick LaSalle of the San Francisco Chronicle remarked that \"the revelation is Casey Affleck, who heretofore has been a rather wormy, uncharismatic screen presence.\"[94] Ty Burr of The Boston Globe commented: \"I'd never stopped to consider Casey Affleck as a movie star before, but under his big brother's tutelage, he blooms as a leading man of richly watchable savvy and intelligence.\"[95]\n\nWhile The Assassination of Jesse James by the Coward Robert Ford and Gone Baby Gone were a financial failure and a modest box office success, respectively,[85][96] Affleck's acting career was widely believed to be at a turning point.[36] However, he lost career momentum while directing I'm Still Here (2010), a divisive mockumentary about the musical career of his friend and then brother-in-law Joaquin Phoenix.[36] While Affleck later clarified that it was \"a planned, staged and scripted work of fiction,\"[97] there was much media speculation during filming about whether Phoenix's public behaviour was performance art or a genuine breakdown.[98] Claudia Puig of USA Today remarked that, \"whether truth or folly, it's not particularly well made. Even in the midst of Phoenix's most oddball and obsessive torment, it's boring ... What, exactly, is the point of a joke that nobody really gets?\"[99] Ty Burr of The Boston Globe described it as \"an interesting but half-baked exercise in persona deconstruction, celebrity politics, and meta-meta-entertainment ... Parts of it are close to genius; most of it is actively torturous to watch.\"[100] Kenneth Turan of the Los Angeles Times said the film \"turns out to be much more interesting to speculate about than to actually watch.\"[101] Reflecting on the experience in 2016, Affleck said: \"We never thought people would actually think it was real ... In hindsight, we should have had a press junket and done talk shows and said how it was a mockumentary.\"[72]\n\nAffleck used his own money to fund I'm Still Here and, after running out of cash,[97] filming was paused for a month to allow him to play a Texan serial killer in Michael Winterbottom's crime drama The Killer Inside Me (2010).[102] Affleck later expressed regret over the movie's graphic violence.[72] Philip French of The Guardian found him \"disturbingly brilliant\"[103] while Peter Travers of Rolling Stone praised \"a mesmeric, implosively powerful performance.\"[104] Mark Olsen of the Los Angeles Times said Affleck \"showcases his uncanny ability to project a person holding two thoughts in his head at once, as he often gives away nothing in his face to convey the firestorm obviously raging in his soul.\"[105] Affleck then had a supporting role in the heist comedy Tower Heist (2011)[106] and voiced a character in the 2012 animation ParaNorman.[107]\n\nWider recognition (2013–present) [ edit ]\n\nAfter spending \"a big chunk of time\" directing I'm Still Here and dealing with the subsequent backlash,[108] Affleck returned to regular acting work in 2013. \"It was ugly for a minute ... I sort of remembered why I liked acting and I missed it.\"[61] In David Lowery's Ain't Them Bodies Saints (2013), Affleck and Rooney Mara starred as outlaw lovers in 1970s-era Texas.[109] Affleck was drawn to the opportunity to play a character who \"was a much better person than anyone thought,\" after a string of roles as \"assassins or murderers or just creeps.\"[109] Shannon M. Houston of Paste Magazine described him as the movie's \"standout actor\": \"Down to his very jawline, Affleck captures the physicality and feeling of a sincerely romantic outlaw.\"[110] Betsy Sharkey of the Los Angeles Times remarked: \"Affleck plays conflicted souls so very well ... Here you wish for a criminal's redemption.\"[111] Michael Phillips of the Chicago Tribune said: \"He has great instincts when it comes to morally compromised anti-heroes, and without trolling for our sympathy, Affleck's Bob is more than just a collection of behaviors; it's a smartly considered performance.\"[112] Sebastian Doggart of The Guardian said he \"shows himself again to be a master of the criminal outsider\"[113] while Chuck Wilson of The Village Voice found him \"flat-out heartbreaking.\"[114]\n\nThe opportunity to act opposite Christian Bale in the drama Out of the Furnace \"reinvigorated\" Affleck and reminded him why he enjoyed acting.[115] Claudia Puig of USA Today found his performance as an Iraq War veteran dealing with posttraumatic stress disorder \"completely captivating ... The chemistry between Bale and Affleck is powerful, intensifying the credibility of their brotherly bond.\"[116] Michael Phillips of the Chicago Tribune said Affleck \"finds something fierce and noble in uneven material and in his character's rage. He's not like any other actor in American movies.\"[117] Ann Hornaday of The Washington Post described the performance as \"a searing portrayal of a young man who pushes himself to the punishing physical limit in search of both money and catharsis.\"[118] Manohla Dargis of The New York Times remarked that Affleck \"can come across as intensely vulnerable on screen, which nicely works for a broken man like Rodney.\"[119] In 2014, Affleck and Jessica Chastain had supporting roles in Christopher Nolan's science fiction film Interstellar as the grown-up children of Matthew McConaughey's character,[120] with Todd McCarthy of The Hollywood Reporter describing his character as \"thinly developed\".[121] Also in 2014, Affleck and producer John Powers Middleton launched the production company, The Affleck/Middleton Project.[122]\n\nAffleck starred in three films in 2016, the first two of which underperformed financially.[123][124] In John Hillcoat's crime thriller Triple 9, Affleck played an uncorruptible detective. Mick LaSalle of the San Francisco Chronicle said he \"arrests our attention. I wonder if any other screen actor has ever seemed so focused and so distracted at the same time. He thinks more than he says, and so we listen, trying to get the part he's leaving out.\"[125] Justin Chang of Variety described him as \"one of the most persuasive leading men of his generation\"[126] while Brogan Morris of Paste Magazine declared him \"maybe Hollywood's best offbeat leading man ... Few actors can suggest so much with such quiet precision, and even here Affleck is compulsively watchable despite his undercooked character.\"[127] In Disney's disaster drama The Finest Hours, Affleck played a taciturn engineer on board a sinking ship. David Sims of The Atlantic said he \"gives the kind of measured, thought-out performance he's so eminently capable of, even if the film isn't complex enough to rise to his level ... He animates an introverted character with subtle mental busywork whenever he's on the screen.\"[128] Sheri Linden of The Hollywood Reporter noted that he \"manages to turn his man of few words into the movie's most compelling figure.\"[129]\n\nAffleck in October 2016\n\nIn his final role of 2016, Affleck starred as Lee Chandler, a grief-stricken alcoholic loner, in Kenneth Lonergan's drama Manchester by the Sea. One of the film's producers, Matt Damon, initially intended to star in the film. When scheduling conflicts made this unfeasible, Damon agreed to step aside on the condition that he be replaced with Affleck.[130] Lonergan readily agreed,[131] remarking that Affleck was \"the natural person to go to.\"[132] Affleck had close relationships with both men and had previously offered notes on early drafts of the script.[63] The movie was a box office success,[133] and Affleck's performance received widespread critical praise. A.O. Scott of The New York Times described it as \"one of the most fiercely disciplined screen performances in recent memory. [He] conveys both Lee's inner avalanche of feeling and the numb decorum that holds it back.\"[134]\n\nKenneth Turan of the Los Angeles Times praised his \"quietly ferocious performance, his willingness to submerge himself into this character to an almost frightening extent.\"[135] Ann Hornaday of The Washington Post said the film was \"anchored by a quietly volcanic central performance by Casey Affleck, in a breathtaking breakout role he's long deserved.\"[136] David Fear of Rolling Stone stated: \"He's given impressive turns before [but] the way Affleck gradually shows you the man's bone-deep grief and emotional damage makes you believe that one of this generation's finest actors has simply been waiting to be coaxed out.\"[137] Affleck won the National Board of Review, Critics' Choice, Golden Globe, BAFTA, and Academy Award for his performance.\n\nAfter dropping out of Lowery's Pete's Dragon in order to star in Manchester by the Sea,[63] Affleck reteamed with the director to star opposite Rooney Mara in the experimental drama A Ghost Story, which premiered at the Sundance Film Festival in early 2017.[138] Affleck's character dies suddenly at the outset and he spends much of the film covered by a white sheet with two eye-holes, haunting his former home. David Rooney of The Hollywood Reporter said Affleck's performance managed to resonate despite limited time onscreen.[139] Peter Debruge of Variety said Affleck \"has never been an easy actor to read. He's a low-charisma mumbler who tends to keep his characters' emotions bottled up, making him the rare performer who can convey as much with a sheet over his head as he does without.\"[140] Jordan Hoffman of The Guardian described him as \"cinema's finest mumbler ... I can't even tell if he's speaking or just emitting high-pitched vibrations anymore.\"[141] In 2018, Affleck starred opposite Robert Redford in the outlaw drama The Old Man & the Gun, his third collaboration with Lowery.[142]\n\nIn 2019, he directed, wrote and starred in the survival drama Light of My Life.[143][144] It had its world premiere at the Berlin International Film Festival on February 8, 2019[145] and received positive reviews from film critics.[146] Affleck next starred in The Friend, opposite Dakota Johnson and Jason Segel, directed by Gabriela Cowperthwaite, based upon a true story revolving around a couple, whose best friend moves in for support, following a cancer diagnosis.[147] which had its world premiere at the 2019 Toronto International Film Festival.[148] Affleck will next act and produce The World to Come, directed by Mona Fastvold alongside Katherine Waterston and Vanessa Kirby.[149]\n\nPersonal life [ edit ]\n\nRelationships and family [ edit ]\n\nAffleck was introduced to actress Summer Phoenix by her brother, Joaquin, in the late 1990s.[18][150] They began dating in 2000,[151] and acted together in both the 2000 film Committed[152] and a 2002 stage production of This is Our Youth.[153] The couple became engaged in January 2004[150] and married on June 3, 2006 in Savannah, Georgia.[154] They have two sons, Indiana August (b. May 2004)[28][155][156] and Atticus (b. January 2008).[155][157][158] By November 2015, they had privately separated.[40][159][160] They publicly announced their separation in March 2016.[161] On August 1, 2017, Phoenix officially filed for divorce, citing \"irreconcilable differences\",[162] and it was finalized later that year.[163] Affleck has said it was an amicable divorce and that they remain friends.[26]\n\nIn 2016, he began a relationship with actress Floriana Lima.[164]\n\nAlcoholism [ edit ]\n\nIn a 2016 interview, Affleck said that he had been sober for \"almost three years ... My father was a disaster of a drinker, my grandmother was an alcoholic, my brother spent some time in rehab – it's in our genes.\"[26]\n\nPolitical views [ edit ]\n\nIn 2008, Affleck filmed an episode of documentary series 4Real, in which he visited the Pawnee Nation of Oklahoma, and remarked upon the progress they had made due largely to \"their own resourcefulness and determination and their character, and not because of the goodness of our collective heart.\"[165] During the 2016 presidential campaign, Affleck supported Hillary Clinton[36][166] and characterized Donald Trump as \"a dangerous fool.\"[63][167] In 2017, multiple financial contributions to Trump were made by Affleck's production company, which he co-founded with John Powers Middleton. In a statement, Affleck denied involvement: \"I had no knowledge of it, was never asked, and never would have authorized it ... The policies of the Trump administration, and the values they represent, are antithetical to everything I believe in.\"[168]\n\nSexual harassment allegations [ edit ]\n\nIn 2010, two of his former co-workers from I'm Still Here filed civil lawsuits against Affleck. Amanda White, one of the film's producers, sued Affleck for $2 million with multiple complaints including \"sexual harassment\" and \"breach of oral contract\".[169] She detailed numerous \"uninvited and unwelcome sexual advances\" in the workplace, alleging that Affleck had instructed Spacehog guitarist Antony Langdon to expose himself in her presence, spoke \"inappropriately\" about her advancing age and fertility, discussed his \"sexual exploits\", referred to women as \"cows\", invaded her \"personal space\" by locking her out of her hotel room while entertaining another woman, attempted to \"manipulate\" her into staying with him in a hotel room, \"violently\" grabbed her by the arm when she refused and sent her \"abusive text messages\" for refusing to stay with him. White alleged that Affleck refused to honor the terms of the production agreement, including her fee, in retaliation.[169]\n\nThe film's cinematographer, Magdalena Gorka, sued Affleck for $2.25 million with multiple complaints including \"intentional infliction of emotional distress\" and \"breach of oral contract\".[170][171] Gorka alleged that she had been subjected to \"routine instances\" of sexual harassment by crew members including Langdon, \"within the presence and with the active encouragement of Affleck.\"[170] While staying in Joaquin Phoenix's apartment during filming, Phoenix offered Gorka the private use of his bedroom. Affleck allegedly joined Gorka in bed while she slept, wearing only \"his underwear and a t-shirt ... He had his arm around her, was caressing her back, his face was within inches of hers and his breath reeked of alcohol.\" She claimed that Affleck later berated and verbally attacked her for refusing his advances, and that she was forced to resign because of harassment and abuse.[170]\n\nAffleck denied the allegations and threatened to countersue; his lawyer described both claims as \"total fiction\" and \"completely fabricated.\"[172][173] His lawyer claimed, \"Both women left the film in April 2009 and both were refused when they wanted to return,\" and \"there was no mention of sexual harassment before June [2010].\"[174] In his response to White's lawsuit, Affleck alleged that she had engaged in \"extortionate tactics\" since 2009, by refusing to hand over \"key production documents\" and trying to block the release of the film, in an effort to obtain more compensation for her work than she was \"legally entitled to.\"[175][176] Affleck also submitted a number of email exchanges with White, in which she wrote \"I am really happy to be a part of this project. I do enjoy working with you...\" \"All the best to you and your family.\"[175] The film's associate producer Nicole Acacio and an unnamed female editor both defended Affleck's conduct on set, saying that \"I never saw anything out of the ordinary either on or off set,\" and \"nothing I've ever witnessed would lead me to think he could ever do anything like that.\"[172][177] The lawsuits were later settled out of court.[178] Both women received credit for their work on the project; no details of any financial settlement were released.[179]\n\nAffleck addressed the allegations when speaking to The New York Times in 2016; he stated: \"It was settled to the satisfaction of all. I was hurt and upset — I am sure all were — but I am over it. It was an unfortunate situation — mostly for the innocent bystanders of the families of those involved.\"[180][181][182] Responding to some of the ongoing criticism he faced, Affleck said, \"There's really nothing I can do about it. Other than live my life the way I know I live it and to speak to what my own values are and how I try to live by them all the time.\"[183] Affleck pulled out of presenting the Academy Award for Best Actress at the 90th Academy Awards.\n\nPhilanthropy [ edit ]\n\nAnimal rights activism and veganism [ edit ]\n\nAffleck has been a vegan since 1995.[184] He has been involved with animal rights campaigns for both PETA[185][186][187] and Farm Sanctuary.[188]\n\nVeterans [ edit ]\n\nIn 2017, Affleck supported the 37th Annual National Veterans Wheelchair Games[189] hosted by Paralyzed Veterans of America. In January 2019, he attended the 4th Annual Veterans Awards as a presenter.[190]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Casey_Affleck_on_the_Manchester_by_the_Sea_red_carpet_%2830165304696%29_%28cropped_2%29.jpg/180px-Casey_Affleck_on_the_Manchester_by_the_Sea_red_carpet_%2830165304696%29_%28cropped_2%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Casey_Affleck.jpg/150px-Casey_Affleck.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Casey_Affleck_at_the_Manchester_by_the_Sea_premiere_%2830199719155%29_%28cropped%29.jpg/220px-Casey_Affleck_at_the_Manchester_by_the_Sea_premiere_%2830199719155%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/e/e8/Casey_Affleck_at_the_Manchester_by_the_Sea_premiere_%2830199719155%29_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Casey_Affleck_at_the_Manchester_by_the_Sea_premiere_%2830199719155%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Casey_Affleck", "title": "Casey Affleck", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Casey_Affleck_at_the_Manchester_by_the_Sea_premiere_%2830199719155%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}