{"url": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashian-quotes-about-tristan-thompson/2081397", "text": "Just when all eyes were on Kylie Jenner and her reported pregnancy, big sister, Khloé Kardashian, came in and broke the internet with big news. Us Weekly reported on Sept. 26 that Kardashian is reportedly pregnant with Tristan Thompson's baby. This news came as a surprise to fans, but Khloé Kardashian's quotes about Tristan Thompson prove they are so, so in love. Elite Daily reached out to Kardashian's team for comment, but did not hear back by time of publication.\n\nKardashian and Thompson are not married, but KoKo DGAF. In a recent interview with You Magazine, Kardashian gushed about how happy she is with Thompson and doesn't need a ring to prove it.\n\nI'm in the best relationship I've ever been in and it doesn't take a ring for me to feel that way.\n\nI agree with KoKo 1,000 percent. However, that doesn't mean marriage is totally off the table. In Apr. 2017, Kardashian explained to ES Magazine that she's \"never been in this type of love\" before. When asked if she would say yes if her boyfriend decided to proposed, the Keeping Up With The Kardashians star said, \"Yes, I would.\" Woooo! Whatever the next step is for the couple — we are here for it! Kardashian added in her interview,\n\nWe both felt this strong energy [when we first met]. I was like, oh this is such a nice, normal man — the normalcy is what I was craving. I'm a Christian; he's a believer in God and that's important to me. Tristan's morals and ethics are everything I've wanted and need in my life.\n\nWe definitely need Khloé Kardashian and Tristan Thompson in our lives.\n\nKardashian and Thompson aren't afraid to flaunt their love on social media. Whether it's birthdays or special events, these two always show support for each other. Thompson threw Kardashian a surprise party for her 33rd birthday on June 25. The lavish party featured everything (even the cake pops) dripping in gold, and the entire Kardashian-Jenner clan was there to celebrate.\n\nAfter the party, Kardashian tweeted a sweet message to thank Thompson. She said,\n\nI've never had a surprise party in my life! I was blown away! Im so lucky and blessed! Thank you so much baby!!! You treat me like a queen!\n\nKardashian is a queen, and I'm glad to see she's found someone who treats her accordingly.\n\nThen, on Kardashian's actual birthday (June 27), Thompson shared the sweetest message about the Good American denim designer on Instagram. The Cleveland Cavalier said,\n\nHappy bday my love, this picture right here sums up how wild, crazy and how much we love each other. Let's continue to build more memories and cherish them with each other. God bless you, I love you\n\nSO SWEET. I can't with these two. They are like a fairytale love story — down to the way they met. Kardashian was actually set up on a blind date by a mutual friend of her and Thompson. She revealed the story during the 10-year Keeping Up With The Kardashians anniversary special.\n\n“Brandon Jennings, who's a basketball player — he's a friend of mine and Malika's — he was like, 'you're such a good girl, I want to introduce you to someone,'” Khloé went on. Ah, so it was a setup! More like an ambush. Brandon apparently knew how reluctant Khloé would be to go on a blind date, so the plan was for Tristan to show up at a group dinner, so he could (surprise) sweep her off her feet. “Brandon kind of ambushed the blind date,” Khloé explained. “I had a bunch of people, so he brought him and we just connected.” Well played, Brandon.\n\nOn her and Thompson's status, Kardashian was sure to add,\n\nYeah, it's a serious relationship.\n\nWell, I think we all could've guessed that part.\n\nWhatever is happening with these two, they definitely love and care for each other a lot. Wishing KoKo and Tristan the best in whatever comes next. Take care, dolls.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/06/12100026/khloe-kardashian-tristan-thompson.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/elite-daily/2017/06/12100026/khloe-kardashian-tristan-thompson.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/06/12100026/khloe-kardashian-tristan-thompson.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashian-quotes-about-tristan-thompson/2081397", "title": "Khloé Kardashian's Quotes About Tristan Thompson Prove They're So In Love", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashian-quotes-about-tristan-thompson/2081397", "type": "article", "title": "Khloé Kardashian's Quotes About Tristan Thompson Prove They're So, So In Love", "description": "Just when all eyes were on Kylie Jenner and her reported pregnancy, big sister, Khloé Kardashian, came in and broke the internet with big news. Us Weekly reported on Sept. 26 that Kardashian is reportedly pregnant with Tristan Thompson's baby. This…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/06/12100026/khloe-kardashian-tristan-thompson.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Just when all eyes were on Kylie Jenner and her reported pregnancy, big sister, Khloé Kardashian, came in and broke the internet with big news. Us Weekly reported on Sept. 26 that Kardashian is reportedly pregnant with Tristan Thompson's baby. This…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}