{"url": "https://www.thedailybeast.com/exclusive-former-model-accuses-david-blaine-of-rape", "text": "Scotland Yard is investigating magician David Blaine after a model accused him of raping her in London. Police have asked Blaine to come to Britain to be interviewed, according to emails reviewed by The Daily Beast.\n\nNatasha Prince claims Blaine raped her at a private home in London’s Chelsea neighborhood in the summer of 2004, months after her 21st birthday, she told The Daily Beast in her first-ever interview on the subject.\n\n“Officers from the Met’s Child Abuse and Sexual Offences Command are investigating an allegation of rape,” Scotland Yard said in a statement to The Daily Beast. “The allegation was reported to police on 17 November 2016 by a woman who alleged she was raped at an address in Chelsea in June or July 2004 when she was aged 21. There have been no arrests at this stage and enquiries continue.”\n\nPolice last month emailed Prince that they had requested Blaine, through his attorney, come to the U.K. for an “interview under caution” where he would be provided with the particulars of the allegation. Blaine’s attorney, Marty Singer, denied all allegations to The Daily Beast in a statement.\n\n“My client vehemently denies that he raped or sexually assaulted any woman, ever, and he specifically denies raping a woman in 2004,” the statement said. (“This would include Natasha Prince,” Singer said in an additional statement.) “If, in fact, there is any police investigation, my client will fully cooperate because he has nothing to hide.”\n\nIn the year since Prince contacted police last October, allegations of sexual abuse and harassment have roiled almost every industry. Roger Ailes and Bill O’Reilly of Fox News were dismissed after they were discovered to have paid off accusers. Donald Trump’s presidential campaign was wounded by his boasting of sexual assault on tape and multiple women accusing him of groping, including in an ongoing lawsuit. And Hollywood’s king, Harvey Weinstein, was dethroned after allegations were unearthed that he preyed on women in the industry.\n\n***\n\nI met Prince at a near-empty fast food restaurant near The Beverly Hills Hotel where she was staying. A decade removed from the modeling world, today she works as an art dealer in Manhattan.\n\nPrince was born in England to a middle-class family of a Liverpool businessman and entered the modeling world briefly at 15 before working full time at 18 when she was with Storm in London and then Next in London, Paris, and New York. Before she quit abruptly at 24, Prince graced roughly 25 magazine covers, including German Vogue, French Elle, and Italian Glamour, and was featured prominently in campaigns for Louis Vuitton, Levi’s, and Diesel Jeans.\n\nDuring the same period, Blaine was taking over the world of magic. His feat in late 2003, titled “Above the Below,” where he suspended himself in a glass box 30 feet above the River Thames for 44 days, apparently surviving on nothing but water, had made him a huge star in London, where Prince booked a shoot in July 2004. Blaine was also still a member in good standing of Leonardo DiCaprio’s so-called Pussy Posse (later rechristened “the Wolf Pack”), and had been linked with Fiona Apple, Bijou Phillips, Madonna, Daryl Hannah, and a host of international models.\n\nPrince said she first met Blaine at the Wellington, a posh nightclub in Knightsbridge, where he was at a private table with about 10 other people, in June or July 2004.\n\n“He was nice to me,” she said. “I’m not sure what was said, but I remember he was giving me a lot of attention. I’m thinking, ‘He’s famous; there are beautiful girls all around him.’ I didn’t have any intentions—I just love meeting people. I’m good with people. As I was working the next day, when he went to talk to someone else, I said, ‘Well, I’m going to go now; really nice to meet you.’ And I left.”\n\nThe next day after work, Prince said she received a text from Blaine, inviting her over to his friends’ place for drinks. When she demurred, given the time and her early call the next morning, he offered to send a car.\n\n“I thought, ‘OK, he must really like me,” said Prince. “It wasn’t too far a drive—it was in Chelsea… We pulled up to this mansion—there were electronic gates, and it really intimidated me. It was like an embassy, with 20 or 30 rooms, and I took an elevator up to the third or fourth floor.”\n\nBlaine met her at the door and ushered her into a small living room, Prince said, where another couple with cocktails were standing in the doorway to the terrace, rapt in conversation. At no point during her time there did either of them acknowledge her or seem aware of her interactions with Blaine, Prince claims.\n\nAt one point, Prince said, Blaine disappeared into the kitchen and returned with a vodka and soda “in a tall crystal glass.”\n\n“I had a high tolerance, but that week I was working and had decided not to drink,” Prince said. “But I decided to have that one drink that night. It wasn’t strong; it tasted mostly like soda.” After 20 minutes of superficial conversation, Prince claims Blaine asked to show her something in the adjacent bedroom.\n\n“I remember carrying my drink, because I assumed we were coming back,” she said. “I guess I thought we might look at a view or something.”\n\nAt this point in our conversation, she burst into tears, and we took a 10-minute break to get some air. Then she continued.\n\n“I followed him, and we went into the bedroom, and it’s dark. I told him right away when he texted me that I was working tomorrow. So I was thinking maybe we would have a sort of intimate conversation somewhere else for five or 10 minutes. But he spun around quite quickly and said, ‘Kiss me.’ I did kiss him. And then he said, ‘Finish your drink’ and took the glass from me and put it on the table, and that’s really the last thing I remember.\n\n“At some point, I was on the bed, face-forward, and he was behind me. I think it woke me up a little bit, because I’d never had that [anal sex] done to me before. I remember moving around a lot. I was limp, and I was very floaty; I was in and out of a deep sleep.\n\n“When I woke up, I was very relaxed—very stoned. The lights were on, and I was naked. He was shirtless at the end of the bed. And when I looked at him, he said, ‘You have really nice tits.’ … He was just folding clothes, walking around. He didn’t kiss me or anything.”\n\nThe following morning Prince said she did a photo shoot for New Look, the British clothing store, where she thought about the previous night.\n\n“The next thing I remember, I was sitting in the makeup chair getting my makeup done, and thinking, ‘What did I do last night? Did I have sex with David Blaine? But I didn’t want to…’ I felt hazy, completely out of it. I don’t remember taking a shower, where I changed, leaving his house, or anything.”\n\nA month after the alleged incident, Prince said she accepted an invitation to visit St. Tropez from a club promoter and friend, only to discover that everything was suddenly out of kilter: Now people terrified her. The social intimacy she naturally found with other people had evaporated. She felt outside herself, wobbly on her feet, extremely self-conscious. Drinking was the one thing that helped—enough that at one point, she fell off a table, another first.\n\nOn her first afternoon back in New York, Prince claims Blaine called her.\n\n“It was a very short conversation,” she said. “I was very freaked out; he seemed to be checking up on me, but he didn’t try and make a plan to see me or anything. He sounded very creepy, and it made me feel a bit bullied.” She would see Blaine three additional times: The following year, a friend was invited to a party at Blaine’s house and in a show of bravado, she tagged along. She insisted they leave soon after arriving, but not before Blaine followed her into the bathroom and allegedly told her, “ You were really good in bed.”\n\nSix years later, Prince said she ran into Blaine in the Manhattan subway with his girlfriend and daughter, and they exchanged small talk. Days later, Prince claims Blaine appeared outside of the art gallery where she worked.\n\n“He called my name and asked how I was; it was very brief, but he seemed to come out of nowhere,” Prince said. Feeling “embarrassed,” Prince then invited him in.\n\nBlaine acknowledged meeting Prince in a statement supplied by Singer and claims she approached him.\n\n“The last time my client saw Ms. Prince was approximately five years ago, on the streets of New York, where Ms. Prince approached my client and invited him to see her at the Gagosian Gallery, where she works. This conduct is completely inconsistent with any claim that my client engaged in any wrongful conduct approximately 13 years ago with Ms. Prince.”\n\n***\n\nFor years, Prince said she suffered murky flashbacks of the alleged incident.\n\n“I remember being flipped around, and it all seemed like slow motion,” she said. “I was wracking my brains and retracing all my steps trying to figure out what happened, which is why I remember so many details. I don’t remember any other day of that year.”\n\nPrince said she suffered from anxiety and a fear of men, low self-esteem, and bouts of non-specific, free-floating anger whose target always seemed just out of reach. She became self-destructive and stopped eating.\n\n“I think I tried really hard to block it out. But I carried this awful feeling with me,” she said.\n\nAt age 24, despite a promising career, she stopped modeling.\n\n“I quit modeling very early,” she said. “I didn’t get to be the 30-year-old model I had hoped to be… I had been building a name for myself—very hard work, traveling, leaving behind school, family, my cozy life. I never learned to drive because I was always traveling. I didn’t have a nice high school boyfriend or anything like that. But after this happened, I didn’t want to go out, and I didn’t want to go to my castings. I wouldn’t get the job because now I was insecure.”\n\nThree years ago, Prince said she got sober and began seeing a therapist. In November 2016, she reported the alleged incident London police. There is no statute of limitations for sex crimes in Britain.\n\nThat same month, Prince contacted her ex-boyfriend—the man she was dating in 2004, at the time of the alleged rape. The boyfriend told Prince he felt like men were using her as a “piece of meat” during that summer of 2004, including the man who introduced her to Blaine.\n\n“ I think I tried really hard to block it out. But I carried this awful feeling with me. ” — Natasha Prince\n\nIn a series of direct messages on Instagram, he reminded Prince of “that crazy weird situation with David Blane [sic] after we broke up… That he made move on u in bed like he falsed [forced] himself on u.\n\n“You told me how u ended up in his bed and he was trying on stuff,” he continued.\n\nWhen asked why it took 13 years for her to tell police, Prince told The Daily Beast:\n\n“You have to understand, my interpretation was that it was my fault. I didn’t think of it as rape. In my head, rape was being sober—pull her in a bush, pull down her pants, and just ditch her... So I blamed myself. I did like him. I was interested in him. So I didn’t think about going to the police.\n\n“And then I was so ashamed and worried about everyone knowing in New York. I was just so scared of being around them: ‘Everyone thinks I’m a slut.’ I had always protected myself and my reputation. I considered myself a classy girl from a nice British family. I had standards. I wasn’t the type to sleep around.”\n\nPrince, accompanied by her father, flew to London and met police on Dec. 16 at Kensington Police Station, where she met with investigators and filed a report.\n\nReached on his cellphone by The Daily Beast and asked about the Scotland Yard investigation, Blaine briefly responded, “Wow… there’s absolutely nothing… that’s crazy.”\n\nSinger, whose clients have included John Travolta, Bill Cosby, and Charlie Sheen, among others, said in a phone call that “anyone can make a claim—especially with this Harvey Weinstein thing.” Yet Prince spoke to London police almost a full year before The New York Times story exposing multiple allegations of sexual misconduct by Weinstein.\n\nPrince said she is going public to “expose” Blaine.\n\n“I would never wish anyone to go to jail—that’s in the hands of the law,” she said. “I want him to know that I’m not stupid, and I know what happened.”", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1492194012/author/Mark-Ebner-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1508438432/171018-ebner-blaine-allegations-tease_x1uxwn", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1508438432/171018-ebner-blaine-allegations-tease_x1uxwn", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1508438432/171018-ebner-blaine-allegations-tease_x1uxwn", "keywords": [], "authors": ["Mark Ebner"], "canonical_link": "https://www.thedailybeast.com/exclusive-former-model-accuses-david-blaine-of-rape", "title": "Exclusive: Former Model Accuses David Blaine of Rape", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Exclusive: Former Model Accuses David Blaine of Rape", "keywords": "David Blaine", "og": {"title": "Exclusive: Former Model Accuses David Blaine of Rape", "description": "Scotland Yard tells The Daily Beast that it is ‘investigating an allegation of rape’ against the superstar magician over an incident in London in 2004.", "url": "https://www.thedailybeast.com/exclusive-former-model-accuses-david-blaine-of-rape", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1508438432/171018-ebner-blaine-allegations-tease_x1uxwn"}, "description": "Scotland Yard tells The Daily Beast that it is ‘investigating an allegation of rape’ against the superstar magician over an incident in London in 2004.", "authors": "Mark Ebner", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-10-19T19:54:33.000Z", "author": "https://www.thedailybeast.com/authors/mark-ebner"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1508438432/171018-ebner-blaine-allegations-tease_x1uxwn"}, "sailthru.date": "2017-10-19T19:54:33.000Z", "sailthru.expire_date": "2017-11-02T19:54:33.000Z", "publicationDate": 201710191954, "parsely-page": "{\"author\":\"Mark Ebner\",\"link\":\"https://www.thedailybeast.com/exclusive-former-model-accuses-david-blaine-of-rape\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"SPEAKING OUT\"},\"post_id\":\"exclusive-former-model-accuses-david-blaine-of-rape\",\"pub_date\":\"2017-10-19T19:54:33+00:00\",\"section\":\"Entertainment\",\"tags\":[\"David Blaine\",\"typeArticle\"],\"title\":\"Exclusive: Former Model Accuses David Blaine of Rape\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1508442873.0, "source": "https://www.thedailybeast.com", "summary": ""}