{"url": "www.bustle.com/p/jennifer-lopez-alex-rodriguez-might-be-engaged-theres-instagram-post-to-prove-it-photo-9679319", "text": "Looks like someone might have gotten that \"anillo\" she's been hinting at. Ah, the power of song. On July 5, Jennifer Lopez posted a curious Instagram post that's leading some people to believe that Lopez and Alex Rodriguez might be engaged, In Style reported. (Bustle reached out to Lopez's rep for comment, but has not yet received a response.)\n\nWearing a neon pink one-piece, rose gold shades, and a straw fedora, the post shows Lopez leaning on Rodriguez while he's sprawled out on his back at the beach. Please note the copious amounts of sunscreen on his face, because as always, safety first.\n\nAlso, please note that J. Lo is flashing a very *ahem* interesting accessory in the photo — a ring. Not just any ring on any finger, though. A ring that, upon some zooming, has a thick, gold band and appears to be conspicuously turned inward. A ring that she is very clearly wearing on her left hand's ring finger AKA the finger that one would wear an engagement ring on. Jennifer, Alex? Do you have something you'd like to share with your fans?\n\nObviously, if they are engaged and they did want to share the news with their fans, Lopez's caption of the photo would have been something other than, \"It’s the lil quiet moments that matter the most.\" Wait. Maybe that is the confirmation. Maybe that photo was taken in a \"quiet lil moment\" after Rodriguez proposed. Maybe that ellipsis and heart emoji Lopez added at the end are meant to imply, \"more news to come.\" Or maybe everyone's just reading into this photo way too much. Who knows.\n\nWhat we do know, however, is that Lopez has been dropping some serious hints about wanting to get engaged, as of late. The Bronx-born pop star debuted and performed a new track on April 26 at the 2018 Billboard Latin Music Awards, Billboard reported, titled \"El Anillo,\" which translates from Spanish to \"The Ring\" in English.\n\nIn case you weren't sure whether or not \"The Ring\" alludes to the ring, here's a translation of one of the Spanish-language track's verses: \"I have never felt anything this grand/And your wild side drives me crazy/You’ve given me so much that I’ve been thinking/I already have it all, but/When will I get the ring?\"\n\nBeats 1 on Apple Music on YouTube\n\nShortly after she premiered the song at the Latin BMAs, Lopez explained the lyrics to Ebro Darden in an interview on Apple Music's Beats 1, according to E! News.\n\n\"Here's what's happening. Right now, the songs that I have coming out, everything that's going on with women — it's a very empowering time for us. It's a good time for us. We're like, 'Yo this is not OK/this is OK, I want to be treated with respect, I want my place in your life, I want to be paid equally.' And my next two songs kind of deal with that. It's like, 'Where's my ring, and where's my money?'\"\n\nFair enough, but was she trying to send A-Rod a message? \"We're good right now,\" she told Darden when asked about her beau. \"I'm not trying to rush into anything, I've done that before, to no avail. I'm a little bit more grown up now and I like to let things take their natural course. We are really kind of good for each other and are really having the best time and our kids love each other.\"\n\nLopez said that she let Rodriguez listened to the song before she put it out, and that his response was, \"Yeah, baby, do it — that’ll be fun,\" People reported. So, at least she gave him a head's up before the media pounced all over it.\n\nIn May, Jimmy Fallon grilled both Lopez and Rodriguez (on the 10th and 11th, respectively) during interviews on The Tonight Show Starring Jimmy Fallon, and when Fallon asked Lopez about the connotation of the lyrics in her new song, she replied, \"no pressure.\" The following day, when the host asked Rodriguez, \"Where's the ring?\" the athlete replied, \"Jimmy, when it happens, you'll be the first to know.\"\n\nRumors of a J. Lo and A-Rod romance first started surfacing back in early March 2017, and by the end of the month, it was basically official. The couple attended the 2017 Met Gala together on the first Monday in May — thus making their red carpet debut — and things have been progressively heating up between the two stars ever since.\n\nFans will have to wait and see if the rumors of a Lopez and Rodriguez engagement prove to be true. Or maybe someone should just straight-up go to Jimmy Fallon for confirmation — Jimmy, what's good?", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/524f5e1d-2c9d-4f80-9ca8-84c34bffd783-getty-451431999.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/4/ed906c28-a728-4e62-a5ca-6ee53b9f10cb-getty-1169491940.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/1/93db2c71-c2cd-45f5-874e-4140fe824a7e-screen-shot-2020-04-01-at-92211-am.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/7/5/c834249d-951f-4662-92c1-802e88600a84-getty-675636894.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/7/5/c834249d-951f-4662-92c1-802e88600a84-getty-675636894.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/140f13e5-57be-4d8b-913a-b3ee39ca0dfd-getty-122716729.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/5/c834249d-951f-4662-92c1-802e88600a84-getty-675636894.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/jennifer-lopez-alex-rodriguez-might-be-engaged-theres-instagram-post-to-prove-it-photo-9679319", "title": "Jennifer Lopez & Alex Rodriguez Might Be Engaged, & There’s An Instagram Post To Prove It — PHOTO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/jennifer-lopez-alex-rodriguez-might-be-engaged-theres-instagram-post-to-prove-it-photo-9679319", "type": "article", "title": "Fans Think That Jennifer Lopez & Alex Rodriguez Are Engaged & You Need To See The Photo Evidence", "description": "Looks like someone might have gotten that \"anillo\" she's been hinting at. Ah, the power of song. On July 5, Jennifer Lopez posted a curious Instagram post that's leading some people to believe that Lopez and Alex Rodriguez might be engaged, In Style…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/5/c834249d-951f-4662-92c1-802e88600a84-getty-675636894.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Looks like someone might have gotten that \"anillo\" she's been hinting at. Ah, the power of song. On July 5, Jennifer Lopez posted a curious Instagram post that's leading some people to believe that Lopez and Alex Rodriguez might be engaged, In Style…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}