{"url": "https://en.wikipedia.org/wiki/Cobra_Kai", "text": "American web television series\n\nCobra Kai is an American action comedy-drama YouTube Premium series, presented in an episodic storytelling format, and based on The Karate Kid film series. It was created by Jon Hurwitz, Hayden Schlossberg, and Josh Heald, and stars Ralph Macchio and William Zabka (both of whom are reprising their roles from The Karate Kid, and who also serve as co-executive producers of the series) along with Xolo Maridueña, Courtney Henggeler, Tanner Buchanan and Mary Mouser. Cobra Kai is set 34 years after the original Karate Kid film, and re-examines the narrative from Johnny Lawrence's point of view (placing it within the \"minor-character elaboration\" genre).[1] His decision to reopen the Cobra Kai karate dojo leads to the rekindling of his old rivalry with Daniel LaRusso.\n\nThe first season was released on May 2, 2018 and the second season on April 24, 2019, both on YouTube Premium. On May 2, 2019, YouTube renewed the series for a third season,[2] which is scheduled for a 2020 release.[3] As of January 2020 , the series premiere has received over 80 million views on YouTube.\n\nPremise [ edit ]\n\nThirty-four years after his defeat in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, works in construction and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that had been enabled by his verbally abusive step-father, Sid Weinberg. He has a son, Robby Keene, with ex-girlfriend Shannon Keene, but he abandoned them both the day Robby was born after Johnny's mother Laura died the same day. Johnny, self-admittedly, has never recovered from the breakup with his high school girlfriend, Ali Mills.\n\nAfter losing his job, a down-and-out Johnny rescues his teenage neighbor Miguel Diaz from a gang of bullies using karate. Miguel, an asthmatic raised by his Ecuadorian single mother Carmen, asks Johnny to teach him. Initially reluctant, Johnny finally agrees and decides to reopen the Cobra Kai karate dojo in a chance to recapture his past; however, this act reawakens his rivalry with Daniel LaRusso. Daniel, now the owner of a highly successful car dealership, is married to Amanda and has two children: Samantha and Anthony. Finally living the wealthy lifestyle he envied as a child when he lived in Reseda, but after his friend and mentor Mr. Miyagi passed away, his struggle to meaningfully connect with his children has disrupted the balance in his life. Meanwhile, his mother Lucille, his other source of support, has a complicated relationship with his wife Amanda.\n\nJohnny's dojo attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage, a marked contrast to the kind of students Tommy, Bobby, Dutch, Jimmy and Johnny were when training in the original Cobra Kai run by John Kreese. Johnny develops a bond with his first and best student, Miguel, in a manner that resembles the relationship between Daniel and Mr. Miyagi. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries very hard to infuse it with more honor than Kreese did. Thus, Miguel develops into a very different kind of student than Daniel, or even Johnny, was; he also begins dating Samantha.\n\nAs a means of revenge against his estranged father, Robby convinces Amanda to hire him for a position at the LaRusso auto dealership and develops a close friendship with Daniel (although Daniel is unaware of Robby's lineage). He even studies Mr. Miyagi's form of Karate with Daniel and becomes friendly with Samantha. She eventually joins her father's dojo, which ultimately leads to her breaking up with Miguel. Miguel later begins dating another Cobra Kai student, Tory who is Sam's rival.\n\nThe developing story revolves around these primary relationships, which lead to conflicts that are ultimately the product of Daniel and Johnny's inability to move away from the past.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nPat Morita, Elisabeth Shue, and Thomas Ian Griffith appear via archive footage from the film series as Mr. Miyagi, Ali Mills, and Terry Silver, respectively.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 10 May 2, 2018 ( ) 2 10 April 24, 2019 ( )\n\nSeason 1 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 1 1 \"Ace Degenerate\" Jon Hurwitz & Hayden Schlossberg Josh Heald, Jon Hurwitz, & Hayden Schlossberg May 2, 2018 ( ) Thirty-four years after losing to Daniel LaRusso in the 1984 All Valley Under-18 Karate Championship, Johnny Lawrence struggles to make a living as a handyman while Daniel runs a successful car dealership chain in the San Fernando Valley. Johnny saves his teenage neighbor Miguel Diaz from a group of bullies at a nearby strip mall, but is arrested for assaulting them. Released from police custody, Johnny is visited by his wealthy stepfather Sid Weinberg, who gives Johnny a check before officially disowning him. Getting drunk, Johnny drives to the All Valley Sports Arena and relives his last encounter with his former sensei John Kreese, before his car is wrecked in a hit-and-run. Despite Johnny’s protests, his car is towed to one of Daniel's dealerships for repairs. The next day, he goes to the dealership in an attempt to take the car back, only to run into Daniel. Johnny reluctantly accepts a free car repair from Daniel, who considers Johnny an old friend. While at the dealership, Johnny realizes that Daniel's daughter Samantha was one of the passengers in the hit-and-run. After Daniel says they're all better off without Cobra Kai, Johnny returns home and tells Miguel that he will be his sensei, and opens his own Cobra Kai dojo with the money from Sid. 2 2 \"Strike First\" Jon Hurwitz & Hayden Schlossberg Josh Heald, Jon Hurwitz, & Hayden Schlossberg May 2, 2018 ( ) Miguel begins his karate training with Johnny, who bullys him for his asthma and low self-esteem. The health department informs Johnny that the dojo needs a lot of work before he can officially teach students. Meanwhile, Daniel and his wife Amanda argue after Daniel scolds Samantha for inviting her friends over for a pool party without her parents' permission. Reconciling with Samantha, Daniel learns she is romantically interested in a boy named Kyler and offers to invite him to a family dinner. At school, Miguel befriends social outcasts Dimitri and Eli. During lunch, they talk about the rich girls Samantha hangs out with and discover that Kyler is one of the bullies who attacked Miguel. Johnny is informed that his son, Robby Keene, has been caught with drugs at school. During dinner, Daniel notices Kyler's bruises and learns he received his injuries from Johnny. Kyler lies about why Johnny attacked him, and Daniel goes to the dojo to confront Johnny. 3 3 \"Esqueleto\" Jennifer Celotta Josh Heald, Jon Hurwitz, & Hayden Schlossberg May 2, 2018 ( ) Johnny tries to recruit more students to the dojo, and Daniel decides to chaperone Samantha to the school Halloween dance. Miguel's karate training is stepped up as Johnny urges him to use the Cobra Kai creed of \"Strike first. Strike hard. No mercy\" in his everyday life and gives him a skeleton costume (the same one Johnny wore in the first film) for the dance. Daniel embarrasses Samantha during the dance by finding her and Kyler alone in a suggestive scene. Later, Miguel overhears Kyler and his friends sexually objectifying Samantha. Remembering Johnny's teachings, Miguel attacks Kyler, but is overpowered and severely beaten by the bullies. Johnny, who has been at the school handing out flyers for Cobra Kai, finds Miguel in the bathroom and takes him home to his mother Carmen, who warns him to stay away from her son. 4 4 \"Cobra Kai Never Dies\" Jennifer Celotta Story by : Josh Heald, Jon Hurwitz, & Hayden Schlossberg\n\nTeleplay by : Jason Belleville May 2, 2018 ( ) Robby learns of the new dojo and is embarrassed by his father's recruitment methods. Johnny gets drunk and vandalizes a LaRusso Auto billboard. Samantha sees Kyler bullying Demetri and Eli. At a movie theater, Kyler aggressively attempts to coerce Samantha into having sex, but she embarrasses him in front of the crowd and leaves, infuriating him. Johnny confronts Robby after learning he has been skipping school. When Johnny tells him not to throw his life away, Robby rejects him and points out that Johnny left him as a child and that Johnny's own life is wasted. After seeing a father happily sharing a milkshake with his young son, Johnny pleads for Carmen to let him continue Miguel's training, vowing not to fail him again. When Miguel returns, Johnny tells him to work on his defense and counter attacks. Daniel discovers that Johnny was the one who vandlized the LaRusso Auto billboard. 5 5 \"Counterbalance\" Josh Heald Josh Heald, Jon Hurwitz, & Hayden Schlossberg May 2, 2018 ( ) Miguel shows improvement in both his karate skills and his general health. Daniel tries to make a shady deal that could shut down Cobra Kai, but hurts innocent business owners in the process. Samantha's heavy-set classmate Aisha Robinson joins Cobra Kai, despite Johnny's initial misgivings about training girls. Samantha discovers that Kyler has been spreading nasty rumors about her. When Kyler embarrasses Samantha, Miguel stands up for her and attacks him and his friends, defeating them all in an impressive display and gaining Samantha's respect. Robby decides to reconcile with his father, but sees Johnny acting in a fatherly way with Miguel and feels he has been replaced. Amanda notices the changes in Daniel's behavior since the reopening of Cobra Kai, leading Daniel to visit the grave of Mr. Miyagi to reflect and ask for wisdom. As Daniel prepares to drive away, he suddenly recalls the discussion with Miyagi after he gifted Daniel his yellow 1948 Ford Super De Luxe convertible on his seventeenth birthday, that the lessons on maintaining balance didn't just apply to karate, but to one's entire life.\n\nNote: This episode is dedicated in memory of Noriyuki \"Pat\" Morita. 6 6 \"Quiver\" Josh Heald Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Joe Piarulli & Luan Thomas May 2, 2018 ( ) Daniel tries unsuccessfully to persuade Samantha to take up karate again. The footage of Miguel's fight at school goes viral and brings many new students to the Cobra Kai dojo, but Johnny cannot suppress his old ways and bullies them, embarrassing Eli in front of the entire class. Thanks to Miguel, Johnny is forced to remember his childhood as an outcast with an uncaring stepfather before he discovered Cobra Kai. Johnny admits that he has been tough and cruel to his remaining students, but refuses to apologize, telling them that life is not fair and they must overcome the challenges that life will throw at them. Eli returns to the dojo with a distinctive mohawk haircut, for which Johnny nicknames him \"Hawk\". Robby gets a job at LaRusso Auto to get back at his father, and Miguel and Samantha slowly become friends at school. Robby finally decides he wants to learn karate under Daniel's tutelage after seeing him practice his karate forms. 7 7 \"All Valley\" Steve Pink Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Stacey Harman May 2, 2018 ( ) Johnny uses painful methods to train his new students. Miguel asks Johnny for advice on girls and Johnny gives him a boost of confidence, leading to Miguel asking Samantha out on a successful date. Johnny tries to enter Cobra Kai in the All Valley karate tournament only to learn the dojo is permanently banned due to the transgressions and poor sportsmanship committed in the 1985 tournament by John Kreese, Terry Silver, and Mike Barnes. At a meeting of the athletic committee, Johnny tries to persuade them to reverse the ban, but is opposed by Daniel, a committee member. Johnny tells the committee that his teachings are different from those of Kreese and Silver, revealing that Kreese himself is dead. He says that he has learned from his past mistakes and that his dojo is now a place where people who get bullied are taught self confidence and how to stand up for themselves. The committee is convinced by Johnny's apparent sincerity and allows Cobra Kai to compete, infuriating Daniel. Despite initially agreeing to help his friends sneak inside the dealership at night, Robby stops them using his karate skills and a security camera. 8 8 \"Molting\" Steve Pink Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg, Stacey Harman\n\nStory and teleplay by : Michael Jonathan Smith May 2, 2018 ( ) Despite Daniel's objections, the All Valley Sports Karate Board allows Cobra Kai to compete in the tournament, so Johnny introduces additional training and unconventional methods. Daniel's family learns that Cobra Kai will compete, and only Samantha thinks Cobra Kai has changed; Daniel's cousin Louie decides to take action against Johnny. Johnny warns Miguel about Samantha and the LaRusso family, telling him a biased narration of how Daniel involved himself with Johnny’s ex-girlfriend Ali Mills in 1984. While skateboarding to Daniel's house, Robby meets Samantha. Carmen invites Johnny to dinner, where he learns more about Miguel's family and is inspired to clean up his life, severing ties with Sid after paying off the money he borrowed and attempting to make amends with Robby. Daniel continues bonding with Robby, who joins the LaRussos for dinner. Miguel works up the confidence to introduce himself to Samantha’s family as her boyfriend. At Daniel's house, Miguel sees Samantha and Robby bonding, leaving him heartbroken. Louie and his thugs destroy Johnny's car before Johnny beats the bikers and has Louie tell him where Daniel lives. 9 9 \"Different but Same\" Jon Hurwitz & Hayden Schlossberg Story by : Josh Heald, Jon Hurwitz, & Hayden Schlossberg\n\nTeleplay by : Jason Belleville May 2, 2018 ( ) Johnny arrives at the LaRusso residence, but Amanda defuses the situation by inviting Johnny over for breakfast. Daniel decides to fire Louie and compensate Johnny with a car in the dealership's trade-in lot. Daniel and Johnny bond during the test drive, listening to Take It on the Run by REO Speedwagon, visiting Daniel's old apartment and sharing their lives before they met. Samantha is grounded after Amanda learns she was involved in Johnny’s hit-and-run, causing her to miss many calls from Miguel. Aisha gets several kids in school to attend a party at the park ahead of Yasmine's planned birthday party. Robby gets Samantha out of her home and they head to the party, but a drunk Miguel tries to pick a fight with Robby and accidentally hits Samantha instead, convincing her that her father was right about Cobra Kai. Johnny drives Daniel home where they find Robby, and Johnny is furious to learn his son has been learning karate from Daniel. Feeling hurt by Robby's dishonesty, Daniel fires him and tells him to leave his home. 10 10 \"Mercy\" Jon Hurwitz & Hayden Schlossberg Josh Heald, Jon Hurwitz, & Hayden Schlossberg May 2, 2018 ( ) Cobra Kai returns to the 50th Anniversary All Valley Under-18 Karate Championship with a full team led by Miguel. Robby also participates, unaffiliated with any dojo. Miguel and Hawk advance to the semifinals, and Aisha is eliminated in the quarterfinals, but she and Samantha reconcile. Hawk is disqualified for dislocating Robby's shoulder with a kick from behind. After arguing with Miguel, Samantha leaves the tournament and returns to the family dojo where it becomes apparent she has not forgotten the Karate that Daniel taught her. Daniel assists Robby back into the ring, now as his sensei. Miguel exploits Robby's injured shoulder to win the match, and Johnny realizes that his methods have corrupted Miguel. After the match, Daniel takes Robby to Mr. Miyagi's old home and reveals that he plans to use it as a dojo to continue Robby's training and teach others Miyagi-Do karate. At the Cobra Kai dojo, a drunk and miserable Johnny is confronted by a shadowy figure, revealed to be Kreese, who praises him for resurrecting Cobra Kai.\n\nSeason 2 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 11 1 \"Mercy Part II\" Jon Hurwitz & Hayden Schlossberg Josh Heald, Jon Hurwitz, & Hayden Schlossberg April 24, 2019 ( ) Johnny and Kreese have a brief fight, Johnny gets him in a chokehold but remembers what Kreese did and lets go, which Kreese scolds Johnny for before knocking him down. Samantha blocks Miguel on Instagram, saddening him. Miguel's mom notices his darker nature during the fight but still approves of Johnny teaching him Karate. Robby learns the history of Miyagi-Do, and Daniel plans to open up a dojo, to his wife's reluctance. Kreese tries to convince Johnny to allow him to rejoin Cobra Kai, but he refuses. Miguel and Hawk notice the chaos in the room due to the fight, and Johnny berates them on their dishonorable techniques at the tournament. Daniel brings Samantha into his Karate dojo, and while shopping Johnny awkwardly meets up with Robby and Daniel. Johnny tries to patch things up with Robby, who believes Johnny had his students fight dirty against him. When Johnny calls Daniel a prick, Robby states that Daniel is a better man than Johnny ever was. While Johnny repairs the Cobra Kai dojo, Kreese returns, finally apologizing. Johnny allows Kreese to rejoin Cobra Kai. 12 2 \"Back in Black\" Jon Hurwitz & Hayden Schlossberg Josh Heald, Jon Hurwitz, & Hayden Schlossberg April 24, 2019 ( ) Robby wakes up and accidentally attacks his mom's new boyfriend. His mom tells him that she will be leaving to Mexico for a month. Miguel tries to call Samantha using Aisha's phone, but Sam sees Robby and hangs up. Daniel tries to train Robby and Samantha to sync their karate moves, but his wife calls him out for caring more about teaching Karate than doing his own job. After a successful day of convincing customers to buy their cars, Daniel successfully trains Robby and Samantha in syncing their karate moves. Meanwhile, two of Hawk's bullies who were friends with Kyler want to join Cobra Kai. Kreese meets Miguel, and Johnny's students embarrass him by being immature. Johnny along with Kreese tell everyone to be at the nearby park at 5 am, and makes them go in the cement truck and move it while there's cement in it to train their leg strength. Kreese is impressed that Johnny would do such a reckless thing. Daniel visits Robby, and invites Robby to move in with him after seeing the poor state of Robby's home. Daniel's wife reminds him that although Robby's mom left, Johnny's still around. Daniel arrives in the Cobra Kai dojo, and finds Kreese and Johnny getting beer. Kreese mockingly offers his condolances on Mr. Miyagi's death. Believing that Johnny lied when he tried to persuade the committee to let Cobra Kai in the All Valley Tournament, Daniel mocks Kreese and walks away. 13 3 \"Fire and Ice\" Michael Grossman Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Stacey Harman April 24, 2019 ( ) While Johnny is trying to use his Dell Laptop for the first time, he sees a Miyagi-Do ad where Daniel is promoting Miyagi-Do Karate for free. Kreese sees this, and wants to fight fire with fire. Johnny tells Aisha to make a video ad that will advertise Cobra Kai. Meanwhile, two teenagers want to join Miyagi-do, but when Daniel tells them to wax on and off the fence, they decide to join Cobra Kai instead. Miguel finds a picture of Robby in Johnny's refrigerator, and realizes that Robby is Johnny's son. Miguel tells Hawk, and when they confront Johnny, he admits the truth, but refuses to elaborate more on the matter. Johnny later takes Miguel to eat hamburgers and fries, and confides in him that on the day Robby was born, he wasn't there for him because his mother (at the time the only person Johnny cared about) had passed away. Johnny was afraid of being a father and failed Robby on his first day. Johnny vows to never fail Miguel, and support him. Aisha texts Miguel that people want Cobra Kai to make a performance, and Johnny sees an opportunity and agrees. Daniel, Sam, and Robby do their Miyagi-Do performance, but Cobra Kai arrives and their performance outshines Daniel's performance, causing Cobra Kai to become more popular. 14 4 \"The Moment of Truth\" Michael Grossman Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Kevin McManus & Matthew McManus April 24, 2019 ( ) Demetri goes to Cobra Kai, meets Kreese, annoys him, and gets beaten and thrown out by Kreese. Later, in the Cobra Kai dojo, new student Tory volunteers to fight Miguel, and proves to be his equal. Aisha and Tory bond at a convenience store. Aisha asks Tory if she would like to go to the beach with her and she agrees. Meanwhile, Demetri tells Hawk that Kreese beat him, but Hawk dismisses him, calling Demetri a coward. Miguel tries to tell Johnny about his worries about Kreese's influence, but Johnny reassures him that everyone deserves a second chance. Daniel tries to convince other people to join Miyagi-do, but fails. Samantha and Aisha bond after seeing each other, but Samantha notices that Tory stole a bottle of vodka, and believes she stole her mom's wallet. Tory pushes Samantha down a food table, embarrassing her. Robby tries to stage a fight with his former friends to convince people to join Miyagi-Do, but is hit in the back of the head, though Daniel arrives to save him. Robby recorded the fight, but Daniel asks him not to upload it, explaining that students should join Miyagi-do out of necessity. Demetri arrives and decides to join Miyagi-Do. 15 5 \"All In\" Josh Heald Josh Heald, Jon Hurwitz, & Hayden Schlossberg April 24, 2019 ( ) In a flashback, Eli's mom reports the fact that he is being bullied.In the present day, Eli/Hawk gets a tattoo on his back. Demetri is learning Karate, but he is frustrated and reveals that he wanted to learn karate to stand up to Eli. Hawk sees a Yelp review of Demetri giving Cobra Kai a negative rating, and goes to confront Demetri. At the mall, Hawk finds Demetri, and just before he is about to beat Demetri up, Sam and Robby join in and defeat Hawk and his gang. Demetri gains new resolve to learn Karate properly from Daniel, and slowly improves. Moon, Hawk's girlfriend, breaks up with Hawk because of his violent behavior. Kreese finds Hawk punching a punching bag, and convinces him to vandalize Daniel's dojo. Meanwhile, Miguel kisses Tory and Sam and Robby almost kiss before Robby thinks they shouldn't as he is a guest of the LaRusso family. Johnny goes to LaRusso Car company after going to Robby's old home. Ultimately, he beats Daniel's worker, who reveals that Robby is living with Daniel. Heartbroken, Johnny gets drunk, but Miguel's mother Carmen convinces him to let go of his rivalry. The next day, Daniel discovers the destruction of Miyagi-Do, Mr. Miyagi's Medal of Honor stolen, and the vandalization of his '48 Ford Super De Luxe that Miyagi gifted him. Daniel goes to Cobra Kai and confronts Johnny, but nothing is resolved. Daniel tells everyone about what happened, with Kreese and Hawk not saying anything. As a result, some students from Cobra Kai leave to join Miyagi-Do. 16 6 \"Take a Right\" Josh Heald Josh Heald, Jon Hurwitz, & Hayden Schlossberg April 24, 2019 ( ) Johnny makes everyone do burpees until someone confesses, however he gets a call from one of his old high school friends, and excuses himself. Kreese knows that Hawk did it, but decides not to say anything. Meanwhile, Demetri isn't pleased that Chris, a former Cobra Kai who attacked Demetri in the mall with Hawk, is with Miyagi-do, and Robby is suspicious. However, Daniel reveals that he once was part of Cobra Kai, and recounts his history with Terry Silver. Daniel says that while it's true that Cobra Kai is bad, it doesn't mean all students are bad, and persuades Robby and Demetri to end their feud with the new student. Johnny travels to San Bernardino where he meets up with his old Cobra Kai dojo mates Bobby, Tommy and Jimmy, to support Tommy who has a terminal illness. During a reunion at a local bar, Johnny reveals that he reopened Cobra Kai with John Kreese. Bobby becomes wary due to their past, and implores Johnny to move on from Cobra Kai. A man harasses a waitress with Johnny intervening and resulting in his Cobra Kai winning an all-out bar fight. Johnny and Tommy talk about their history, and the next morning, Tommy dies peacefully. Kreese is making Cobra Kai be more ruthless, telling Tory to finish one dojomate. Miguel calls Kreese out on it, and Kreese says that mercy may be beneficial during a tournament, but in real life they must finish the fight in order to win. While talking to Tory, Tory reveals that her mother had to work as a waitress to support Tory and her brother, and her mom would take leftovers to feed them. Her mom's boss found out, and fired Tory's mom, which caused Tory to decide that since the world shows no mercy, she shouldn't either. Miguel apologizes to Kreese, and Kreese accepts Miguel. 17 7 \"Lull\" Jennifer Celotta Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Kevin McManus & Matthew McManus April 24, 2019 ( ) Daniel goes to his karate dojo, to see Kreese there. Kreese thanks him for taking in the weak Cobra Kai, and tells him that he will be training his own Cobra Kai for the upcoming war against Miyagi-Do. Daniel argues that they're just kids, but Kreese ignores him. Daniel trains his students, with Demetri complaining but slowly improving. Amanda tries calling Daniel multiple times, and at the end of the day Amanda confronts Daniel on the fact that Daniel seems to care more about karate than his own job. Moon and Sam talk, and Moon asks if Sam is developing feelings for Robby, but Sam brushes off the question. Meanwhile, Johnny returns from his trip and takes his Cobra Kai students in the woods to participate in a \"game.\" The dojo is split into two teams, and the last person standing with their headband wins for their respective team. As the game progresses, Johnny is slightly shocked at how merciless Tory is. Eventually, Miguel sees Hawk wearing Miyagi's Medal of Honor, and realizes that he was the one who vandalized the Miyagi dojo. Hawk taunts Miguel on his feelings for Sam, and they eventually fight with Miguel emerging victorious. Miguel takes the Medal of Honor, but he is ambushed and has his headband taken off by a new Cobra Kai student, Stingray. Johnny asks Miguel why is he showing no mercy, and warns him to not take the dark path. At the end of the day, Miguel goes to the LaRusso’s house and gives Robby the Medal of Honor, asking him to give it to Daniel, and also to tell Sam that he's sorry before leaving. When Sam asks Robby who was that, Robby quickly answers that it was nobody, and puts the Medal of Honor in his pocket. Meanwhile after realizing that Kreese hasn’t changed and is trying to corrupt Johnny’s students as he did in the past, Johnny severs ties with Kreese and expels him from Cobra Kai. 18 8 \"Glory of Love\" Jennifer Celotta Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Joe Piarulli & Luan Thomas April 24, 2019 ( ) Johnny starts to have dreams about Carmen, and meets Carmen's new boyfriend. Daniel has a fever during the summer, and his mother visits him to cheer him up and help him with his internal problems with Cobra Kai. Hawk and Miguel make up, and Tory asks Miguel on a date to a skate mall. Johnny also tells Cobra Kai dojo to show mercy, and informs them that Kreese has been kicked out. Meanwhile, Demetri finds the Medal of Honor, which Robby planted on the dojo backyard to prevent Sam from going back to Miguel. Sam asks Robby to go on a date to the skate mall, where the theme will be the 1980s. Miguel helps Johnny set up a Tinder account and sets up Johnny with a bunch of dates. During the dates, Johnny is failing miserably and tries sending a message to Ali Mills Schwarber, but before deleting it his date bumps into him, which causes him to send the message. At the skate mall, Miguel and Tory awkwardly meet up with Robby and Sam, with clear animosity between Tory and Sam. Tory purposely knocks down Sam when she sees Miguel trying to apologize to Sam, and Sam pushes Tory down in return. As a result, Sam and Robby are told to leave. Daniel apologizes to his wife, while Johnny beats up Carmen's boyfriend after hearing the boyfriend planning to dump Carmen soon. Johnny soon meets up with Carmen, and asks her on a date. 19 9 \"Pulpo\" Jon Hurwitz & Hayden Schlossberg Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Michael Jonathan Smith April 24, 2019 ( ) Robby's mom returns, apologizes to Robby about the way she has been treating him, and reveals that her boyfriend left her and that she's going into rehab. Both Cobra Kai and Miyagi-Do kids go to a party hosted by Moon just before school begins and heavy drinking ensues during the party. The rivalry between Tory and Samantha intensifies after Tory witnesses Samantha drunkenly kiss Miguel after Samantha finds out that Miguel returned the Medal of Honor to Robby. After Hawk pours a drink on Demitri, Demitri retaliates by calling out and humiliating Hawk through the form of a toast. The cops arrive just as Cobra Kai and Miyagi-Do are about to fight and everyone flees the party. Elsewhere, Johnny and Carmen go on a date at a Mexican restaurant but unexpectedly see Daniel and Amanda arrive. While Amanda and Carmen are away, Daniel and Johnny have a conversation about getting rid of Kreese and Johnny finds out that Daniel has enrolled Robby in high school, much to the surprise and appreciation of Johnny. The two couples have a good night out and in the end, Daniel and Johnny shake hands, seemingly burying the hatchet during the process. After Johnny and Carmen say goodnight to each other, he gets an unexpected visit from Robby and a drunk Samantha. 20 10 \"No Mercy\" Jon Hurwitz & Hayden Schlossberg Story by : Josh Heald, Jon Hurwitz, Hayden Schlossberg\n\nStory and teleplay by : Joe Piarulli & Luan Thomas April 24, 2019 ( ) Johnny allows Robby and Samantha (who are drunk) to crash at his place for the night after the party. She doesn't tell her family. When Daniel finds out, he goes to Johnny's apartment to get her and he and Johnny get into a fight. Daniel cuts his family off from Robby and Johnny. During the first day back at school, Tory hijacks the PA system and calls out Samantha for kissing Miguel at the party. She then hunts Sam down and begins a fight with her. Robby tries to stop the fight by pulling Tory away from Sam and immediately represses Tory against a batch of lockers when Tory tries to fight Robby, but when a Cobra Kai member tries to attack Robby while Robby inhibits Tory, he kicks him away. Simultaneously, Miguel arrives at the scene and sees Robby restraining Tory and kicking the Cobra Kai member, which leads to Miguel tackling Robby. An all-out karate war between Cobra Kai and Miyagi-Do erupts. The fight ends in disaster, with Miguel on lifesupport and Sam in the hospital from her injuries. Robby flees after his fighting leads to Miguel's fall. Miguel's accident results in Johnny losing Carmen and control of Cobra Kai after his remaining students turn on him and join Kreese, who tells Johnny that the landlord allowed him take over and have full ownership of the dojo when Johnny was in San Bernardino. The aftermath of the fight also provokes Amanda to demand Daniel to stop Miyagi-Do and karate. A guilt-ridden Johnny goes to the beach, where he throws his new cell phone into the sand. He did not notice that he received a Facebook friend request from Ali Mills Schwarber, the ex-girlfriend of both Lawrence and LaRusso who is currently a pediatric surgeon.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe thematic genesis for Cobra Kai began with two works of pop culture. First, the 2007 music video for the song \"Sweep the Leg\" by No More Kings stars William Zabka (who also directed the video) as a caricature of himself as Johnny, and features references to The Karate Kid, including cameo appearances by Zabka's former Karate Kid co-stars.[4][5] In a 2010 interview, Zabka jokingly discussed this video in the context of his vision that Johnny was the true hero of the film.[6] Then, in 2013, Macchio and Zabka made guest appearances as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka.[7]\n\nCobra Kai was greenlit on August 4, 2017, with ten half-hour episodes, written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg.[8] The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television.[9] It was renewed for a second season on May 10, 2018[10] and for a third season on May 2, 2019.[3]\n\nCasting [ edit ]\n\nWilliam Zabka and Ralph Macchio both revived their Karate Kid characters, Johnny Lawrence and Daniel LaRusso, for the series. Randee Heller also reprised her role as Daniel's mother.[11] In addition, Martin Kove joined the series as a regular cast member in the second season, reprising his role as John Kreese (after making a cameo appearance at the end of Season 1).[12] Other actors from The Karate Kid franchise have also commented on the series. Elisabeth Shue (who appeared in the first film as Ali Mills) is ambivalent about appearing in Cobra Kai.[13][14][15][16] Tamlyn Tomita (Kumiko) and Yuji Okumoto (Chozen Toguchi) from the second film,[16] and Robyn Lively (Jessica Andrews),[17] Sean Kanan (Mike Barnes),[18] and Thomas Ian Griffith (Terry Silver) from the third film,[19] have all expressed an interest in appearing in the series. Hilary Swank (who appeared in the fourth film as Julie Pierce), has neither confirmed nor denied her interest. She did acknowledge it would be a chance to have a “showdown” with Ralph Macchio, however.[20]\n\nThe cast list for Season One was announced on October 24, 2017, and included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. Ed Asner was cast in a guest role as Johnny's verbally abusive step-father, Sid Weinberg.[21][22] In December 19, 2017, Vanessa Rubio joined the cast as Miguel's mother.[23]\n\nRalph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned for the second season,[12] with Paul Walter Hauser and Peyton List joining the cast.[24][25]\n\nFilming [ edit ]\n\nPrincipal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University.[26] In November 2017, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb.[27] In December 2017, the production was working out of Marietta and Conyers.[28] Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino.[29] Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.[30]\n\nPrincipal photography for the second season began in September 2018 in Atlanta, Georgia. In October 2018, production continued around Atlanta with shooting also occurring in Marietta.[31] In November 2018, the series was filming in Union City.[32] In December 2018, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.[33]\n\nRelease [ edit ]\n\nMarketing [ edit ]\n\nIn January 2018, the series was promoted at the annual Television Critics Association's winter press tour where YouTube's global head of original content Susanne Daniels described the show saying, \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it’s very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It’s next generation Karate Kid.\"[34]\n\nThe first trailer was released on February 15, 2018,[35] the second on March 1, 2018,[36] and the third a week later.[37] The final official trailer was released on March 21, 2018, and included the announcement that the show would premiere on May 2, 2018.[38]\n\nOn April 17, 2019, YouTube Premium released a six-minute commercial parodying ESPN's 30 for 30, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny.[39][40] It was nominated for a Clio Award.[41]\n\nPremiere [ edit ]\n\nThe series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.[42]\n\nOn April 25, 2018, YouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.[43][44]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe first season of the series had a positive response from critics upon its premiere. At the review aggregator website Rotten Tomatoes, the first season holds a 100% approval rating, with an average score of 7.44 out of 10 based on 41 reviews. The website's critical consensus reads: \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\"[45] Cobra Kai was 2018's best-reviewed TV drama on Rotten Tomatoes.[46] Metacritic, which uses a weighted average, assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews\".[47]\n\nThe second season has also received a positive response at Rotten Tomatoes, holding an 88% approval rating with an average score of 7.49 out of 10, based on 24 reviews. Its critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.”[48] Metacritic's weighted average assigned the second season a score of 67 out of 100, based on 7 critics, indicating generally favorable reviews.[49]\n\nViewership [ edit ]\n\nYouTube has reported that the first episode, which was posted for free along with episode two, had been viewed 5.4 million times within the first 24 hours.[50] While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that, \"YouTube Red's new series debuted to numbers that should make rival streaming services take notice.\"[51]\n\nBy October 30, 2018, ahead of the second-season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times.[52] The first episode was #8 on YouTube's list of ten top-trending videos of 2018.[53]\n\nAccording to market research company Parrot Analytics, the first season of Cobra Kai was the world's most in-demand streaming television show during May 2018.[54] Parrot Analytics later reported that the second season of Cobra Kai was the world's most in-demand digital television show during April 2019[55] through May 2019.[56] As of January 2020 , the season 1 premiere has over 80 million views,[57] and the season 2 premiere has over 50 million views.[58]\n\nAwards and nominations [ edit ]\n\nHome media [ edit ]\n\nCobra Kai: Season 1 was released on DVD and Blu-ray in Australia (Region 4/Region B) on August 14, 2019.[66][67] Cobra Kai: Season 2 has been announced for release in Australia on May 6, 2020.[68]\n\nSony Pictures Home Entertainment [needs update] released the first and second seasons in a four disc DVD collectors edition in Region 1 (United States and Canada) on November 12, 2019. It has since gone out of print with copies being sold at inflated prices.[69]\n\nSoundtracks [ edit ]\n\nSeason 1 [ edit ]\n\nMadison Gate Records released the official soundtrack on May 4, 2018.[70] La La Land Records released the physical version of the soundtrack with additional tracks in June 2018.[71] The soundtrack CD was released in Australia on January 8, 2018.[72]\n\nTrack listing [ edit ]\n\nAll music is composed by Leo Birenberg and Zach Robinson.\n\nNo. Title Length 1. \"Awake the Snake\" 2:06 2. \"Ace Degenerate\" 1:25 3. \"Miyagi Memories\" 1:34 4. \"Strike First\" 1:06 5. \"Father and Son\" 0:38 6. \"50th Anniversary\" 1:00 7. \"The All-Valley Tournament\" 3:34 8. \"A Badass Name for a Dojo\" 0:37 9. \"Miyagi-Do\" 1:52 10. \"Slither\" 1:53 11. \"Cobra Guy\" 0:49 12. \"Balance\" 1:03 13. \"Speak Up, Lip\" 0:57 14. \"Stone vs. Diaz\" 1:40 15. \"Johnny's Story\" 2:28 16. \"You Earned It\" 0:51 17. \"Quiver\" 1:08 18. \"Venomous\" 1:15 19. \"Bonsai Lessons\" 1:50 20. \"Ophidiophobia\" 2:16 21. \"The Wrong Path\" 1:58 22. \"Final Match\" 1:48 23. \"The Cobra and the Mongoose\" 1:19 24. \"Time Out\" 1:35 25. \"No Mercy\" 1:14 26. \"Miyagi's Tomb\" 2:42 27. \"The New Champion\" 1:37 28. \"King Cobra\" 1:37 Total length: 43:53\n\nSeason 2 [ edit ]\n\nMadison Gate Records also released a second official soundtrack soundtrack on April 24, 2019, to accompany the second season.[73]\n\nTrack listing [ edit ]\n\nAll music is composed by Leo Birenberg and Zach Robinson except \"Cruel Summer\" by Sara Dallin, Siobhan Fahey, Keren Woodward, Steve Jolley and Tony Swain.\n\nNo. Title Length 1. \"Miyagi-Do Fix-Up\" 2:33 2. \"Snake Fight\" 2:19 3. \"The Wheel Technique\" 1:54 4. \"Like a Dance\" 3:12 5. \"The Internet\" 1:25 6. \"I Got Old\" 2:53 7. \"An Old Friend\" 1:25 8. \"Shochu-Geiko\" 1:24 9. \"Tory with a Y\" 1:58 10. \"Furious Hawk\" 1:11 11. \"Medal of Honor\" 1:24 12. \"Into the Snake Pit\" 2:26 13. \"Military Exercise – Who's Gonna Break\" 2:13 14. \"New Students\" 0:59 15. \"Fatherly Advice\" 1:48 16. \"Mall Fight\" 1:39 17. \"You're the Champ\" 1:34 18. \"We Are All Miyagi-Do\" 2:48 19. \"Busted\" 0:49 20. \"Worthy Opponent\" 2:12 21. \"Kan-Geiko\" 1:04 22. \"Sam and Robby\" 1:24 23. \"Mercy and Honor\" 2:23 24. \"Apartment Skirmish\" 1:06 25. \"Black Paint on a White Wall\" 1:40 26. \"I'm Coming for You, Bitch\" 1:38 27. \"Hallway Hellscape\" 3:37 28. \"Scale the School\" 0:51 29. \"Hawk's Prey\" 1:29 30. \"Rematch\" 2:08 31. \"Fallen Soldier\" 2:39 32. \"Voicemail\" 1:00 33. \"In It No Matter What\" 1:39 34. \"It Belongs to Me\" 3:20 35. \"Cruel Summer\" (Kari Kimmel) 2:25 Total length: 66:11", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d6/CobraKaiTitleScreen.png/250px-CobraKaiTitleScreen.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/37/Cobra_Kai_season_2_soundtrack_cover.jpg/220px-Cobra_Kai_season_2_soundtrack_cover.jpg", "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cobra_Kai", "title": "Cobra Kai", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}