{"url": "https://en.wikipedia.org/wiki/Keiynan_Lonsdale", "text": "Australian actor, dancer, and singer\n\nKeiynan Lonsdale (born 19 December 1991) is an Australian actor, dancer, and singer-songwriter. He is known for roles such as Oliver Lloyd on the ABC series Dance Academy (2012–2013) and Wally West / Kid Flash on The CW series The Flash (2015–2020) and Legends of Tomorrow (2017–2018); and for film roles in The Divergent Series: Insurgent (2015), The Finest Hours (2016), and Love, Simon (2018). He has also worked as an MTV VJ, and released original music recordings.\n\nEarly life [ edit ]\n\nLonsdale was born in Sydney to a Nigerian father of Edo descent and an Australian mother of Irish and Danish descent.[3][4] He is the youngest of six children on his mother's side, with three brothers and two sisters, and one of seven from his father's side; in total he has eleven siblings.[5]\n\nCareer [ edit ]\n\nLonsdale got his first acting job in 2007, with a bit dancing part in the film Razzle Dazzle: A Journey into Dance. The following year, he appeared in an episode of the Australian television medical drama All Saints.\n\nLonsdale became a recurring member of the cast of the Australian teen drama series Dance Academy in the 2012 second season; his character, Oliver Lloyd, became a regular in the third and final season.\n\nHe was a VJ on MTV for two and a half years.[6] He released a single on iTunes titled \"One and Only\" in 2014. He then played a supporting role as Uriah Pedrad in The Divergent Series: Insurgent (2015), the second film in the series.[7] He briefly reprised the role in The Divergent Series: Allegiant (2016). In 2016, his single \"Higher\" was included on Connor Franta's curated album Common Culture, volume 5.[8] He next appeared in the historical drama The Finest Hours (2016) as Eldon Hanon, the youngest sailor involved in a rescue at sea.\n\nIn 2015, he auditioned for the role of Jefferson Jackson but this role was given to Franz Drameh.[9] Instead, Lonsdale was cast as Wally West (the previously unknown son of Joe West) on the CW's The Flash and became a regular supporting character in season two and as Kid Flash in season three.[10] In 2017, his character left The Flash and debuted on season three of Legends of Tomorrow.[11] That year, Lonsdale also appeared in an episode of Supergirl.[12]\n\nIn 2018, Lonsdale starred as Bram in the film Love, Simon, based on the novel Simon vs. the Homo Sapiens Agenda by Becky Albertalli about a teenage boy who struggles to come out; Lonsdale has said that the role helped him come to terms with his own sexuality.[13] Upon release, the film received positive reviews from critics,[14] and was dubbed historically significant, as it is the first film ever released by a major studio to focus on a gay teenage romance.[15][16]\n\nIn 2019, Lonsdale starred in Camila Cabello's music video for \"Liar\".[17] Lonsdale has also released musical recordings, including \"Higher\" in 2015 and \"Good Life\" in 2017 and \"Kiss The Boy\" in 2018 and \"Preach\" in 2018. Lonsdale also released a single \"Rainbow Dragon\" in 2019.[18]\n\nPersonal life [ edit ]\n\nLonsdale came out as being attracted to people regardless of gender on social media in 2017. Although many news outlets initially reported that he was pansexual, Lonsdale prefers not to label his sexuality.[19][20]\n\nDiscography [ edit ]\n\nExtended plays [ edit ]\n\nTitle Album details Higher Vol. 1[21] Released: 6 October 2015\n\nFormat: Digital download\n\nFilmography [ edit ]\n\nAwards and Nominations [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/2/2f/Keiynan_Lonsdale_%282%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Keiynan_Lonsdale_%282%29_%28cropped%29.jpg/220px-Keiynan_Lonsdale_%282%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Keiynan_Lonsdale_%282%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Keiynan_Lonsdale", "title": "Keiynan Lonsdale", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Keiynan_Lonsdale_%282%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}