{"url": "www.instyle.com/news/alexis-ohanian-serena-williams-interview", "text": "Image zoom Serena Williams / Instagram\n\nImagine this: You're sitting poolside at a hotel, hungover, and just missed the breakfast buffet when you spot a group of people hanging out and quickly start to get flirty with one of their friends. By the way, you're a millionaire tech entrepreneur who co-founded Reddit, and the woman you’re now making googly eyes at is Serena freakin’ Williams.\n\nThat kind of plot twist sounds straight out of a rom com, but such is the beginning of the IRL fairytale of Alexis Ohanian and yes, tennis legend Serena Williams. Ohanian seems to recognize just how fortunate that is, and when he sat down with InStyle, fresh off a trip to Italy (he casually took Williams there because she wanted Italian for dinner) with Lantern Glow coffee in hand, he said as much.\n\nIn addition to chatting about his work and his entrepreneurial spirit, Ohanian opened up about his relationship with Williams and what it's like to raise their 10-month-old daughter, Alexis Olympia, below.\n\nYou flew Serena to Italy because she wanted Italian food for dinner. How was that?\n\nIt was very good. We rarely get vacations and so we take them very seriously when we do it. She certainly deserved one, because it was really our first—we had the honeymoon for sure, but even that, we were still kind of figuring out how to be parents at that point, and Olympia was a lot younger. Now she’s a little bit more mobile. She’s toddling around, so we can travel with her in a more accommodating way. It’s a lot of fun.\n\nAlexis Olympia is going to be a year old soon. What are your plans for her birthday?\n\nShe’s almost 11 months, she’ll be 1 on Sept. 1. It’s funny right, I feel like birthdays, especially at that age, are mostly for the parents. We’re not going to do a birthday party, but I would not be surprised if by the end of the year, we have some kind of baby-fest.\n\nWe have so many friends who have young kids, so just get them all together in a room to watch them roll over on each other, and throw little balls at each other, or whatever little kids do when they hang out. It’s been a lot of fun being a dad. And I tell you, there are definitely mornings when the coffee helps a lot as a new parent. I'm grateful for it.\n\nWhat was it like becoming a first-time dad?\n\nIt was the greatest responsibility I’ve ever had. I became a first-time husband at the same time basically, too. I cherish it. It put it in perspective, all of the career that I’ve had and will continue to have and all of the things I was so proud of before. Because now I feel, I still feel proud of them, but it puts it all into perspective. I feel like I’m doing something for more than just me now, which is exciting.\n\nRELATED: How Serena Williams Feels About Motherhood and the Pressure to Perform\n\nVIDEO: Serena Williams's Most Precious Mom Moments\n\nTell me about watching Serena become a mom.\n\nI was never worried for a second. She’s talked about how she was worried at times, but already seeing the way she interacted with the pets, it was obvious to me that she was going to be a great mother just on that alone.\n\nIt’s funny. She manages to be this supermom and doesn’t drink a lick of coffee. I can’t live without it. I’d have to turn in my dad card because I couldn’t keep up, but it’s great. She’s as awesome a mother as any baby could hope for and any husband could hope for. We're very, very happy.\n\nImage zoom IAN WEST/Getty Images\n\nYou've teamed up with 1850 Brand Coffee's \"Bold Pioneers\" contest, in which people can pitch their enterprising ideas for a chance to win $18,500 and your mentorship. How has becoming a parent changed the way you mentor others?\n\nI definitely feel more responsibility now to help advise founders [Ohanian's term for people with entrepreneurial pursuits]. Because selfishly, I just want my daughter, and any future kids we’re lucky enough to have, to get a better world. Entrepreneurship isn’t the only way that that’s going to happen, but it’s a significant way that that can happen. There are a lot of things that are broken, and I do think there are some talented founders that we’re lucky enough to be the first believers in, the first investors in, who can make things better.\n\nImage zoom Mike Coppola/Getty Images\n\nWhat's a common mistake that young people with entrepreneurial ambitions make?\n\nToo many people who aspire to be entrepreneurs get caught up with acting like or looking like entrepreneurs instead of just actually doing the work. They’re more concerned with what they’re posting on their Instagram feed than what they’re actually doing to build their business. And now more than ever, you have no excuse to not get started, because the cost of starting, of just testing an idea now, is so, so cheap.\n\nTo build a website, it takes time, but you can do it yourself. To get a landing page up, to start collecting email addresses, to run a small targeted Facebook ad campaign to test a product you have in mind, to launch a Kickstarter—all these things you can do on a really small budget, literally tens of dollars to just test an idea. And you have no excuse not to.\n\nThe founders who are successful are the ones who are not obsessed with looking like an entrepreneur and posting on their ‘gram about how they’re working hard, but who are actually doing the work, and actually trying to find their customers by any means necessary and see if they want what they’re making.\n\nRELATED: Serena Williams Wanted Italian Food for Dinner, So Her Husband Flew Her to Venice\n\nTurning \"passion into purpose\" is a phrase used in the campaign, which seems easier said than done. What’s a good first step toward making that happen?\n\nThis is the first generation that—and I mean this generation coming up right now—the first one to actually not just be consumers of things, but also creators. And it’s a mind shift, a major mind shift. I’m just on the cusp of it because I’m 35. So everyone basically younger than me has grown up knowing that something they are consuming is something they can potentially make, or make better.\n\nIf I’m listening to a track, I could remix it, upload it to Soundcloud, and actually have something that’s even more popular. Or if I’m watching a movie, I know that ... every Apple computer [has] iMovie, which can actually let me make something just as comparable. Or if I’m using an app, I can actually get started building something that is as good or better. It’s a generational mind shift, and I want people to be more aggressive in seeking out or figuring out what they’re passionate about by being more open to just exploring and trying new things, especially while they’re younger, especially while they have more chances to say ‘Oh, I’ve always wanted to know how to sample music, let me just try.’ And start by searching and finding a YouTube video for how to do that.\n\nImage zoom Jerod Harris/Getty Images\n\nIn there comes the purpose, because the dream—and it’s something I’ve been lucky enough to do since college—is to be able to work on things that fulfill you in a way that basically makes you feel excited and energized to get up and work. I know what a privilege that is, and I think we have a generation now that almost by their place in history, as well as just broader circumstances, is going to have to engineer and invent careers for themselves. And whether they can find that purpose will come down to how aggressively they can seek out what their passions are, and learn what those things are, and then be willing to take the time and devote the energy to whatever that bold idea is to actually bring to the world.\n\nIt’s not for everyone, but I think everyone should at least give it a shot. Everyone should at least be thinking like an entrepreneur. Because even something that starts as a simple hobby today, for the first time ever, could actually become your lifestyle. It could actually become your full-time business.\n\nThis interview has been edited and condensed.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2Fellen-pompeo-5.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2F022318-danielle-brooks-baw-lead.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F08%2Farticles_african-hair.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1532635570%2FGettyImages-960059874.jpg%3Fitok%3DxmrDpKo4", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1532635570%2FGettyImages-1004917432.jpg%3Fitok%3DuUNsI-pt", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3DUPz6ss7f", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1532635570%2FGettyImages-825311594.jpg%3Fitok%3DkdpuxPWq", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3Dw8PSz29b"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3Dw8PSz29b", "keywords": [], "authors": ["Alexandra Whittaker"], "canonical_link": "https://www.instyle.com/news/alexis-ohanian-serena-williams-interview", "title": "Why Serena Williams’s Husband Knew She Would Be a Great Mother", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "News,Celebrity,latest,Parenting,Kids,Star Couples,Celebrity Moms,Serena Williams", "news_keywords": "News,Celebrity,latest,Parenting,Kids,Star Couples,Celebrity Moms,Serena Williams", "description": "Alexis Ohanian discussed parenthood with Serena Williams to their daughter Alexis Olympia, his biggest advice for young entrepreneurs, and what it was like watching Serena become a mom.", "og": {"title": "Why Serena Williams’s Husband Knew She Would Be a Great Mother", "type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/news/alexis-ohanian-serena-williams-interview", "description": "“She’s talked about how she was worried at times.”", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3Dw8PSz29b"}, "pinterest": {"url": "https://www.instyle.com/news/alexis-ohanian-serena-williams-interview", "description": "Alexis Ohanian discussed parenthood with Serena Williams to their daughter Alexis Olympia, his biggest advice for young entrepreneurs, and what it was like watching Serena become a mom.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3Dw8PSz29b"}, "twitter": {"card": "summary_large_image", "url": "https://www.instyle.com/news/alexis-ohanian-serena-williams-interview", "title": "Why Serena Williams’s Husband Knew She Would Be a Great Mother", "description": "“She’s talked about how she was worried at times.”", "site": "@InStyle", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2F1532635570%2F32526445_813358228867013_8610661472810303488_n.jpg%3Fitok%3Dw8PSz29b"}, "fb": {"app_id": 1846286175658788, "pages": 18938064984}}, "movies": [], "publish_date": null, "source": "http://www.instyle.com", "summary": ""}