{"url": "vt.co/entertainment/celebrity/justin-bieber-selena-gomez-will-not-spending-christmas-together-heartbreaking-reason/", "text": "Sorry, Jelena fans. I know this year you were hoping to see some adorable Christmas photos of Justin Bieber and Selena Gomez. In one photo, they're wearing ugly Christmas sweaters and fuzzy reindeer antlers. In another photo, Justin's lifting Selena up, so she can put the star on the Christmas tree. And in another photo, they're kissing under the mistletoe, while The Weeknd can be seen spying on them through the back window, crying, his heartbroken with jealousy. But it's just not meant to be.\n\nIt's surprising the couple's not spending Christmas together. Since they rekindled their on-again, off-again romance, they've been spotted on several dates out in public - riding bicycles, going to church, kissing at a hockey game. Selena even \"liked\" one of Justin's photos on Instagram, proving she's totally obsessed. Or maybe not. But we do know the relationship is serious. A source close to the pair said she gave Biebs another chance because he's her \"first love.\"\n\nWhat's more, Justin's mother, Pattie Mallette, recently revealed she \"loves\" Selena. While speaking to the press, she said Justin is trying to put his wild days behind him. In the past, he got in trouble for drunk driving, drag racing and throwing eggs at his neighbors' houses. Now he's trying to \"find balance\" in his life, and dating the 25-year-old \"Wolves\" singer keeps him stable. \"I think anyone with real love in their life is more grounded,” said Mallette. “It’s important for us to find the ones that truly care and stick with them.”\n\nIt sounds like Selena would be pretty welcome at the Bieber family Christmas.\n\nHowever, a source close to Jelena told People Magazine the pair will not be spending Christmas together - and the reason is heartbreaking.\n\n“Justin’s family always loved Selena,\" says the source. \"But Selena’s family is still not happy about her seeing Justin. Selena doesn’t bring Justin to any family events. Selena is spending Christmas with her family. As of now, Justin is not invited.”\n\nWow, that is cold. I guess Selena's family was Team Weeknd. Or maybe they're worried the 23-year-old \"Sorry\" singer will have too many Christmas cocktails, go drag racing, and throw eggs at people.\n\nThis marks the second big family holiday the pop stars will spend separately. In November, Selena flew to Texas to celebrate Thanksgiving, while Justin flew to Canada to play hockey with high school kids. A source told E! News, \"Selena felt it was too soon for Justin to come to Texas with her. Her family is still getting comfortable with the idea of them back together.\"\n\nWell, unfortunately, we won't be getting any Jelena Christmas cards this year. But it makes sense the couple wants to take things slow this time around. I mean, we all know how awkward it can be taking your girlfriend or boyfriend home to meet your family, especially if it's an ex that they don't like. Who knows? Maybe they'll spend Easter together.", "images": ["http://vt.co/static/img/logos/jungle-creations.svg", "http://vt.co/static/img/icons/search.svg", "http://vt.co/static/img/icons/share/pinterest.svg", "http://vt.co/static/img/icons/gorilla.svg", "http://vt.co/static/img/icons/share/whatsapp.svg", "http://vt.co/static/img/icons/share/email.svg", "http://vt.co/static/img/logos/vt_white.svg", "http://vt.co/static/img/icons/share/facebook.svg", "https://cdn.junglecreations.com/wp/junglecms/2017/12/Selena-Gomez-Bieber-Site-Image.jpg", "http://vt.co/static/img/logos/vt_black.svg", "http://cdn.junglecreations.com/wp/junglecms/2017/12/Selena-Justin-FB-1.jpg"], "top_img": "http://cdn.junglecreations.com/wp/junglecms/2017/12/Selena-Justin-FB-1.jpg", "keywords": [], "authors": [], "canonical_link": "http://vt.co/entertainment/celebrity/justin-bieber-selena-gomez-will-not-spending-christmas-together-heartbreaking-reason/", "title": "Justin Bieber and Selena Gomez will not be spending Christmas together for a heartbreaking reason", "meta_data": {"viewport": "width=device-width", "description": "Justin Bieber and Selena Gomez are dating again, but they will not be spending the Christmas holiday together for a heartbreaking reason.", "fb": {"app_id": 586923868183434, "pages": 363765800431935}, "og": {"locale": "en-US", "type": "article", "title": "Justin Bieber and Selena Gomez will not be spending Christmas together for a heartbreaking reason", "image": {"identifier": "http://cdn.junglecreations.com/wp/junglecms/2017/12/Selena-Justin-FB-1.jpg", "height": 450, "width": 850}, "description": "Sorry, Jelena fans. I know this year you were hoping to see some adorable Christmas photos of Justin Bieber and Selena Gomez. In one photo, they're wearing ugly Christmas sweaters and fuzzy reindeer antlers. In another photo, Justin's lifting Selena up, so she can put the star on the Christmas&hellip;", "url": "http://vt.co/entertainment/celebrity/justin-bieber-selena-gomez-will-not-spending-christmas-together-heartbreaking-reason/", "site_name": "VT"}, "article": {"publisher": "https://www.facebook.com/VT", "section": "Entertainment", "published_time": "2017-12-13T17:50:15+00:00"}, "twitter": {"card": "summary_large_image", "title": "Justin Bieber and Selena Gomez will not be spending Christmas together for a heartbreaking reason", "image": "http://cdn.junglecreations.com/wp/junglecms/2017/12/Selena-Justin-FB-1.jpg", "description": "Sorry, Jelena fans. I know this year you were hoping to see some adorable Christmas photos of Justin Bieber and Selena Gomez. In one photo, they're wearing ugly Christmas sweaters and fuzzy reindeer antlers. In another photo, Justin's lifting Selena up, so she can put the star on the Christmas&hellip;"}, "next-head-count": 10}, "movies": [], "publish_date": 1513187415.0, "source": "http://vt.co", "summary": ""}