{"url": "https://web.archive.org/web/20180516061112/https://screenrant.com/new-girl-series-finale-review/", "text": "Advertising [x]\n\nby Kevin Yeoman\n\n– on May 15, 2018\n\nin TV Reviews\n\nSeries finales have a tendency to lean too heavily on sentiment or nostalgia to say goodbye to characters preparing to live on forever in syndication or in a more bingeable form on a streaming platform (where they are destined to be reevaluated years later by a younger generation weighing the show against current social mores only to be gobsmacked that a once-beloved series was somehow a product of its time, not prescient, and therefore somehow at fault). Before that can happen, however, the series actually has to reach its conclusion, and be judged based on the merits of its finale, as New Girl has done after seven seasons on FOX.\n\nSome series, like M.A.S.H. or Cheers, ended in such a way as to be considered in the upper echelons of series finales. The shows are seemingly looked at even more fondly on the basis of having “stuck the landing.” And then there’s the finale of Seinfeld, which most viewers resoundingly disapproved of, primarily for its descent into absolute nostalgia that turned the episode into a glorified clip-show. Somewhere in the middle, then, are the finales that are still remembered fondly, but perhaps a little less so, like the last episode of Friends, which seems to be, when all is said and done, where New Girl will probably land.\n\nAdvertising [x]\n\nFor many viewers, New Girl had its perfect series finale at the end of season 6, when Jess (Zooey Deschanel) and Nick (Jake Johnson) shared a sweet, passionate kiss after repeated failed attempts to end up in the same place in their Los Angeles loft. FOX, along with series creator Liz Meriwether, and the cast — Johnson, most vocally — felt there was still a story left to tell about this group of friends and how, after spending an inordinate amount of time living with one another, they finally began to carve out separate lives for themselves. The result was a hasty eight-episode final season that revolved primarily around Nick and Jess’ eventual engagement and marriage — as occurred in the first half of the hour-long finale — but also established the ways in which Schmidt (Max Greenfield), Cece (Hannah Simone), Winston (Lamorne Morris), and Aly (Nasim Pedrad) were all, at long last, entering a long-delayed phase of adulthood.\n\nAdvertising [x]\n\nTo the writers’ credit, the final season of New Girl, although brief, never felt truncated. It played on the strengths of the ensemble cast and, despite the separation of the characters who, with the exception of Nick and Jess, had all moved out of the loft, brought them together without it feeling convoluted or forced. And the season’s through line of Nick’s inevitable but frequently impeded proposal to Jess gave the eight episodes a suitable and not too sentimental air of finality. And the show, unsurprisingly, manages to deliver both the wedding that was promised and the goodbye that is needed without letting the audience down.\n\nAdvertising [x]\n\nThe finale is split into two distinct parts, each bringing a different but equally important sense of closure to the series. The first half, ‘The Curse of the Pirate Bride’ is the payoff to seven seasons worth of on-again, off-again romantic tension between Nick and Jess. Sure, they’ve been together for years now, thanks to the time jump at the start of season 7, but network sitcoms are nothing if not traditionalists at heart. In some series a character isn’t really dead until you see the body, and in a romantic sitcom like New Girl, the couple that needs to be together isn’t really together until some vows (official or otherwise) are spoken in front of friends and family.\n\nAdvertising [x]\n\n‘The Curse of the Pirate Bride’ engages in a little trickery, and plays on the audience’s fear that someway, somehow, Nick and Jess aren’t meant to be together, or that fate will intervene and keep them from matrimonial bliss. That’s not the case, of course, but not for a lack of trying on fate’s part. The episode unfolds like an anxiety dream, beginning with Jess’ mom (Jamie Lee Curtis) showing up to chastise the couple for spending the night before their wedding together — thereby calling down the dreaded curse that’s meant to ruin their pending nuptials. There are plenty of signs things won’t go well for the couple, starting with Jess slipping and scratching her cornea on a dog toy (hence the pirate-y eyepatch). While Jess is tending to her wounds by getting high on her mom’s medical marijuana and eating her own wedding cake ahead of the ceremony, Nick, too, is beset by “signs” their wedding is doomed. The worst of them is, naturally, the arrival of Dermot Mulroney’s Russell, who takes an opportunity in a stairwell to profess his undying love for Jess.\n\nAdvertising [x]\n\nThat Jess and Nick’s wedding ultimately takes place at the same time Aly gives birth to her and Winston’s son, Danbill Bishop (which is an all-time great ludicrous name for a child), makes the event more memorable than it otherwise would have been, even by New Girl’s notoriously high standards for disastrous weddings. Like the actual final episode, ‘Engram Pattersky’, it’s a bittersweet distillation of what made the show work in the first place: the pleasure that seeing these people — sometimes fitfully — share their lives with one another brought those watching at home.\n\nIn the end, ‘Engram Pattersky’ teeters on the verge of becoming a trip down memory lane, with Jess insisting the core group — no Aly or Danbill in this one — gather to help pack the loft since she and Nick are being evicted. It’s something of a welcome surprise, then, that the group’s reluctant packing devolves into another (though not final, as a hopeful look forward suggests) round of True American. There’s a checklist sensibility of sorts to the final episode, but one that never tips too far into becoming perfunctory or purely sentimental.\n\nSchmidt and Cece have already had their ending earlier in the season, so they’re mostly along for the ride (and to get a well-earned “I love you” from Nick). So when it’s revealed that Nick and Jess are leaving the loft because of Winston’s greatest (?) prank, it brings the idea of the series full circle. The circumstances of these characters have and will inevitably continue to change, but they’ll remain a constant in one another’s lives. That’s the power a show built around the pleasure of spending time with these weird, lovably obnoxious people. And for one final time, Liz Meriwether and the New Girl crew figured out a satisfying way to make that what fans will ultimately remember the show for.\n\nAdvertising [x]\n\nGive Screen Rant a Thumbs up!\n\nSneaky Pete Review: A Fun Season 2 Makes Great Use Of An Excellent Cast\n\nShare On Facebook Tweet This Reddit This Share This Email\n\nLooking for an AD FREE EXPERIENCE on ScreenRant?", "images": ["https://web.archive.org/web/20180516061112im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/th-logo-full-white.7684e614781b958aa33abd672f3978ec.svg", "https://web.archive.org/web/20180516061112im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/05/Zooey-Deschanel-and-Jake-Johnson-in-New-Girl-Series-Finale.jpg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4ad197dea153fbf680a8f3429.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29ab5efdec090dd1bd94c65bd2.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb94a50adf8897bb84dae2f505e.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b440d85cf9d231002f8682acc57.svg", "https://web.archive.org/web/20180516061112im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/tr-logo-full-white.090c581a060e5d468f261848fe9b14ab.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cfe90b745527f88220f1fb6bda.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a92962d713fb6f36e5e624c81.svg", "https://web.archive.org/web/20180516061112im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3d6ec4c755e8046b66ba3d16b.svg", "https://web.archive.org/web/20180516061112im_/https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe494e2afb2d6717be022f03158.svg"], "top_img": "https://web.archive.org/web/20180516061112im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/05/Zooey-Deschanel-and-Jake-Johnson-in-New-Girl-Series-Finale.jpg", "keywords": [], "authors": ["Kevin Yeoman"], "canonical_link": "https://web.archive.org/web/20180516061112/https://screenrant.com/new-girl-series-finale-review/", "title": "New Girl Series Finale Review", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, maximum-scale=3.0, width=device-width", "description": "FOX’s New Girl comes to an end with an hour-long series finale that boils the show down to its most basic elements, to just hang out with the cast.", "og": {"title": "Read Our Review of the New Girl Series Finale", "type": "article", "image": {"identifier": "https://web.archive.org/web/20180516061112im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/05/Zooey-Deschanel-and-Jake-Johnson-in-New-Girl-Series-Finale.jpg", "width": 2000, "height": 1000}, "url": "https://web.archive.org/web/20180516061112/https://screenrant.com/new-girl-series-finale-review/", "locale": "en_US", "description": "New Girl bids farewell in a sweet series finale.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-05-15T19:05:16Z", "section": "TV Reviews"}}, "movies": [], "publish_date": 1526411116.0, "source": "https://web.archive.org", "summary": ""}