{"url": "https://web.archive.org/web/20090514023215/http://republicanleader.house.gov/News/DocumentSingle.aspx?DocumentID=125333", "text": "House GOP Introduces Keep Terrorists Out of America Act\n\nWashington, May 7 - House Republicans today introduced the Keep Terrorists Out of America Act, legislation aimed at stopping the transfer or release of terrorists held at the Guantanamo Bay prison into the United States. The legislation unequivocally opposes releasing terrorists from the Guantanamo Bay facility and transferring them to the United States, makes clear that governors and state legislatures must pre-approve the transfer or release of any terrorist detainee into their respective states, and requires the Administration to meet strict criteria and certification standards before terrorists housed at the Guantanamo prison could be brought to the United States. Republican Leader John Boehner (R-OH) issued the following statement on the legislation:\n\n\n\n\n\n“This bill has a straightforward but vital purpose: to ensure that the terrorists held in the Guantanamo Bay prison are not imported into the United States. We are giving every member of Congress an opportunity to stand with the American people by affirming their opposition to bringing these terrorists into our communities, and we hope they join us. Equally as important, this bill holds the Administration accountable if it acts unilaterally against the will of the American people.\n\n“The world did not suddenly become safe in January 2009. There are still terrorists around the world who are committed to killing Americans and destroying our way of life. A number of those terrorists are being held at the prison in Guantanamo Bay right now. If the Administration is allowed to proceed, they won’t be there for long. In fact, they may be right here, in the United States. I have been urging the Administration to finally present to the American people its plan for what to do with the terrorists held at Guantanamo and for confronting and defeating the global terrorist threat. Right now, that plan does not exist, and the safety of our nation depends on it.\n\n“Our ranking members John McHugh, Pete Hoekstra, Lamar Smith, Peter King, and Ileana Ros-Lehtinen all deserve great credit for their work on this measure. I thank them for their efforts in crafting this critically important bill.”\n\nNOTE: Following is a summary of the Keep Terrorists Out of America Act:\n\nAffirming Congress’ Opposition to the Release and Transfer of Terrorists. The bill affirms Congress’ opposition to transferring or releasing terrorists held at the Guantanamo Bay prison into the United States. Most Americans do not support releasing these terrorists from Guantanamo Bay prison and transferring them into the United States. The bill gives Congress an opportunity to show that it stands with the American people on this critical matter, and opposes the release and transfer of these terrorists.\n\nGovernor & State Legislature Pre-Approval. The measure prohibits the Administration from transferring or releasing any terrorist detainees at Guantanamo Bay to any state without express approval from the state’s governor and legislature, and certifies to Congress that strict requirements have been met. For example, the Administration must certify to the respective governor and state legislature that the detainee does not pose a security risk to the United States. The certifications must be made 60 days before any transfer or release.\n\nPresidential Certification Requirements. The measure prohibits the President from transferring or releasing a terrorist detainee into the United States unless he provides the following notification and certification to Congress regarding:\n\n\n\n- The name of the detainee and transfer/release location in the United States.\n\n\n\n- The release/transfer would not negatively impact continued prosecution of the detainee.\n\n\n\n- The release/transfer would not negatively impact continued detention of the detainee.\n\n\n\n- The ability of federal judges to release detainees into the United States.\n\n#####", "images": ["https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/UploadedFiles/1.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image03.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image07.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/UploadedFiles/2.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/images/transpix.gif", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image05.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image06.jpg", "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image04.jpg"], "top_img": "https://web.archive.org/web/20090514023215im_/http://republicanleader.house.gov/img/image03.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "House GOP Introduces Keep Terrorists Out of America Act", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}