{"url": "https://www.etonline.com/met-gala-drama-the-7-most-jaw-dropping-moments-to-ever-happen-at-fashions-biggest-night-101600", "text": "Given the amount of A-listers packed into one venue, it's no surprise the amount of drama that goes down at the annual star-studded Met Gala.\n\nThis year's soiree takes place on Monday, May 6, with the theme being \"Camp: Notes on Fashion,\" which will examine \"how the elements of irony, humor, parody, pastiche, artifice, theatricality and exaggeration are expressed in fashion.\" Co-chairs include Lady Gaga, Serena Williams, Harry Styles, Gucci creative director Alessandro Michele and of course, Vogue editor-in-chief Anna Wintour.\n\nBut aside from the unforgettable fashion, the Met Gala has also been the scene of some of the biggest headline-making moments in pop culture. From Taylor Swift and Tom Hiddleston's dance-off that marked the start of their whirlwind romance, to Solange and JAY-Z's elevator fight caught on tape, let's take a look back at the 11 most jaw-dropping moments.\n\nKim Kardashian West's infamous pregnant 2013 Met Gala debut:\n\nKardashian West definitely made a statement at her first-ever Met Gala in 2013, with an unforgettable skintight floral dress designed by Riccardo Tisci. The reality star was pregnant with daughter North at the time, and made sure her baby bump was on full display.\n\nGetty Images\n\nThe dress sparked plenty of memes, a few comparing Kardashian West's bold look to a couch.\n\nIn 2015 she poked fun at the gown, dressing up as herself for Halloween, this time pregnant with her son, Saint.\n\n\"Still fits,\" she cracked.\n\nKardashian West's Met Gala debut also sparked some controversy when Vogue did not include the reality star in a photo gallery of the best-dressed stars from the event. Kim's husband, Kanye West, made the cut, but Kardashian West was Photoshopped out of the original photo.\n\nTaylor Swift and Tom Hiddleston have a flirty dance-off:\n\nIn hindsight, Swift and Hiddleston's chemistry was pretty obvious.\n\nPrior to the two's whirlwind romance in 2016, Valentino brand ambassador Carlos Souza shared video of Swift and Hiddleston dancing at the Met Gala to rapper T.I.'s 2004 hit, \"Bring Em Out.\"\n\nThe duo also showed off their moves to Beyoncé's \"Crazy in Love,\" with Hiddleston eagerly twirling Swift around.\n\nHiddleston later talked to the Press Association about the viral moment.\n\n\"I love dancing, who doesn't?\" he said. \"It's a weird one. I haven't actually danced for a long time, but I happened to be dancing at the Met Gala, because it was a party.\"\n\n\"I was on a table with Taylor Swift and The Weeknd was playing and she said, 'The thing about these parties is nobody gets up to dance,'\" he continued. \"She, as a musician, was like, 'We've got to dance for The Weeknd!' so we got up and danced.\"\n\nSwift and Hiddleston ended up dating for three months before splitting in September 2016.\n\nSelena Gomez and The Weeknd make their debut as a couple ... with his ex, Bella Hadid, also there:\n\nGomez and The Weeknd made their romance red carpet official at the 2017 Met Gala, showing plenty of PDA for the cameras.\n\nCheck out the two absolutely glowing:\n\nGetty Images\n\nGetty Images\n\nBut the moment was definitely a bit awkward, given that The Weeknd's ex-girlfriend, Hadid, was also in attendance, wearing a super sexy sheer Alexander Wang catsuit.\n\nGetty Images\n\nJust one year prior, The Weeknd was Hadid's date to the Met Gala.\n\nGetty Images\n\nOf course, Gomez and The Weeknd's relationship didn't last through the year. The two split last October after 10 months of dating.\n\nJennifer Lopez and Alex Rodriguez make their red carpet debut ... and Rodriguez shows he's not a dancer:\n\nLopez and Rodriguez also made their splashy red carpet debut at the 2017 Met Gala last year, looking stunning as a power couple.\n\nGetty Images\n\nVideo of the pair at the Met Gala later went viral, when Italian businessman and Valentino pal Giancarlo Giammetti captured Lopez busting a move when Migos performed their hit, \"Bad and Boujee,\" as Rodriguez stayed seated, awkwardly watching Lopez.\n\n... We don't blame you A-Rod!\n\nOne year later, Rodriguez actually Instagrammed Lopez dancing at the Met Gala, this time to Rihanna's \"B**ch Better Have My Money.\"\n\nNicki Minaj shades Demi Lovato ... and Lovato responds:\n\nWhat's the Met Gala without a little shade? At the 2016 soiree, Lovato awkwardly posed for pictures with Moschino designer Jeremy Scott alongside Minaj. Minaj was seen giving Lovato some major side-eye, and to add insult to injury, the rapper shared the photo on Instagram, but didn't tag Lovato, though did make sure to tag Scott.\n\n... Ouch.\n\nLovato seemingly responded on Snapchat, writing, \"When you aren't mentioned in a post but didn't do sh** to the person ...\"\n\nThe \"Cool for the Summer\" singer later addressed the shade in her own Instagram post of the same hilarious photo.\n\n\"This picture pretty much summed up my first and probably last met???,\" she wrote of the now-infamous photo. \"#cool #sof***ingawkward #notforme #sweatpants #forensicfiles #whatsgood.\"\n\n\"P.s. some of y'all need to learn how to take a joke,\" she added. \"I'm obviously laughing at the fact that 1. I look incredibly awkward and 2. That the shade being thrown in this picture actually gives me life???.\"\n\nIn March, Lovato once again spoke about the Met Gala, and said that her \"terrible experience\" drove her to an Alcoholics Anonymous meeting.\n\n\"This one celebrity was a complete b***h and was miserable to be around,\" Lovato told Billboard. \"It was very cliquey. I remember being so uncomfortable that I wanted to drink.\"\n\nLovato says she texted her manager from the event and went straight to a 10 p.m. AA meeting.\n\n\"I changed my clothes, but I still had my diamonds on -- millions of dollars of diamonds on in an AA meeting,\" she recalled. \"And I related more to the homeless people in that meeting who struggled with the same struggles that I deal with than the people at the Met Gala -- fake and sucking the fashion industry's d**k.\"\n\nKylie Jenner is unimpressed with Ryan Reynolds and Blake Lively:\n\nThough Sasha Obama appeared starstuck when she met Reynolds at the White House in 2016, the same definitely can't be said for Jenner. In exclusive pics obtained by ET of the 2017 Met Gala, Jenner is seated by Reynolds at the table, but is hilariously on her phone as Reynolds and Lively engage in conversation with Chrissy Teigen and John Legend. In another pic, Jenner's head is completely turned away as Reynolds and Lively share a laugh.\n\nBilly Farrell / Shuttershock\n\n... Hey, not everybody has to hit it off.\n\nSolange attacks JAY-Z in an elevator, as Beyonce calmly looks on:\n\nSolange's epic fight with Jay-Z in an elevator is the Met Gala moment that tops them all. In 2014, surveillance footage from a Standard Hotel elevator was leaked just moments after they attended the Met Gala, which showed Solange yelling at, kicking and hitting JAY-Z while a security guard restrains her. JAY-Z didn't fight back, and Beyonce, who was also in the elevator, remained stoic during the intense argument.\n\nThe family put out a statement after the incident, which read, \"As a result of the public release of the elevator security footage from Monday, May 5th, there has been a great deal of speculation about what triggered the unfortunate incident. But the most important thing is that our family has worked through it. Jay and Solange each assume their share of responsibility for what has occurred. They both acknowledge their role in this private matter that has played out in the public. They both have apologized to each other and we have moved forward as a united family.\"\n\nGetty Images\n\nInterestingly enough, in 2016, Beyonce attended the Met Gala solo -- and without her wedding ring -- after rumors of JAY-Z's infidelity swirled following the release of her critically acclaimed album, Lemonade.\n\nGetty Images\n\nAside from posing with Solange and her pals, Nicki Minaj and La La Anthony, Queen Bey also posed with Rita Ora, seemingly putting to rest the rumors that Ora was Beyonce's \"Becky with the good hair.\"\n\nThe incident once again made headlines last June when JAY-Z released his song, \"Kill JAY-Z,\" which makes a not so subtle reference to the Met Gala drama.\n\n\"You egged Solange on,\" Jay rhymes, \"knowing all along all you had to say you was wrong.\"\n\nBut it's the next line that fans think is even more telling.\n\n\"You almost went Eric Benét, let the baddest girl in the world get away,\" he raps, referencing the actor and musician who split from Halle Berry in 2003 amid rumors of infidelity. Later, he warns again, \"Never go Eric Benét.\"\n\nLast August, JAY-Z broke his silence on the infamous fight.\n\n\"We had one disagreement ever -- before and after we've been cool,\" he told Rap Radar hosts Elliott Wilson and Brian \"B.Dot\" Miller of the footage. \"She's like my sister. I will protect her. That's my sister, not my sister-in-law. My sister. Period.\"\n\nJaden Smith brings his old hair as his date:\n\nSmith caused a stir in 2017 when he brought his own chopped-off dreadlocks and posed with them on the red carpet.\n\nTaylor Hill/FilmMagic\n\nSmith explained the bold move in an interview with Vogue's Andre Leon Talley.\n\n\"And since I couldn't bring my sister as a date, I brought my old hair,\" he said, referring to his younger sibling, Willow Smith.\n\nFurther explaining his all-black look and sporting a gold grill, he noted, \"I've gone for the Dracula look today.\"\n\nFKA Twigs rocks a penis dress:\n\nNot only did FKA Twigs make her red carpet debut as a couple with Robert Pattinson at the Met Gala in 2015, but she showed up in a Christopher Kane dress featuring a cartoon pink penis drawn on it.\n\nGetty Images\n\nGetty Images\n\nPattinson and Twigs ended up calling it quits in October 2017, but they'll forever have this standout Met Gala moment.\n\nKylie Jenner's dress makes her bleed:\n\nFashion was literally a pain for Jenner in 2016, thanks to her embellished Balmain gown. After the glamorous night, Jenner got real about what sporting the intricate dress cost her.\n\n\"When ur dress made you bleed and ur feet are purple,\" she wrote alongside a photo of multiple cuts on her leg.\n\nSnapchat\n\nHowever, she had no regrets.\n\n\"It was worth it though,\" she later wrote.\n\nSnpachat\n\nReese Witherspoon struggles to pronounce Cara Delevingne's name and also proves herself to be the most fun guest:\n\nSome of the best moments to come out of the Met Gala are the unexpected pairings of A-list celebrities, which happened in 2014 when Witherspoon was with Zooey Deschanel, Kate Upton and Delevingne in an elevator. Delevingne Instagrammed videos of an uninhibited Witherspoon hilariously attempting to pronounce her name, before declaring, \"Do you know what the most important thing in a name is, for a girl? That a man can whisper it in his pillow.\"\n\nNot surprisingly, the videos went viral.\n\nFor more on this year's Met Gala, watch the video below:\n\nWhy Amal Clooney and Rihanna Will Make the Perfect Met Gala Hosts This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\n20 Outrageous Looks That Prove the Met Gala Is the Only Fashion Event That Matters\n\nKendall Jenner Gears Up for the Met Gala With Sassy Throwback Pic\n\nBlake Lively Reveals Her Met Gala Look Is Already In the Works\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2015-05/640_fka_dress_472180914.jpg?itok=JzVX5CsR", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2019-04/kylie-met-gala-selfie.jpg?itok=C159hwVl", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/1280_beyonce_jay_z_gettyimages-457631352.jpg?h=c673cd1c&itok=hsC3p7kR", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gctah300_0.jpg?h=35278c44&itok=wFHc-B3i", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/beyonce_gettyimages-527423300.jpg?itok=gGtk0qIN", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/bella_hadid_gettyimages-678069850.jpg?itok=Q-wDJZBl", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-05/rihanna_met_gala_2015_gettyimages-472971948.jpg?h=844fc704&itok=Hj3tL5hV", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/jennifer_lopez_alex_rodriguez_gettyimages-675600656.jpg?itok=wyqESvcC", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2019-04/kylie-met-gala-snap.jpg?itok=SWoZxbUb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/970xh/public/slides/163911/set_robert_pattinson_fka_twigs_472172548.jpg?itok=33yuLcBr", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-678060218.jpg?itok=z8fcsUr8", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-05/1280_beyonce_jay_Z_GettyImages-457631352.jpg?h=c673cd1c&itok=CF3XcyTz", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-527358852.jpg?itok=OYPgavED", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/1280t_kylie_true2_rexfeatures_8773357qh.jpg?itok=0DoKfQeU", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2019-04/gettyimages-678315704.jpg?itok=_XzzdC6x", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-457631352.jpg?itok=9IDwbe7L", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/kim_kardashian_gettyimages-168209975.jpg?itok=SVcM7jHQ", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/selena_gomez_the_weeknd_gettyimages-678117612.jpg?itok=ixSDFP2P"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/1280_beyonce_jay_z_gettyimages-457631352.jpg?h=c673cd1c&itok=hsC3p7kR", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/met-gala-drama-the-11-most-jaw-dropping-moments-to-ever-happen-at-fashions-biggest-night-101600", "title": "Met Gala Drama: The 11 Most Jaw-Dropping Moments to Ever Happen at Fashion's Biggest Night", "meta_data": {"article": {"opinion": "false"}, "title": "Met Gala Drama: The 11 Most Jaw-Dropping Moments to Ever Happen at Fashion's Biggest Night | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/met-gala-drama-the-11-most-jaw-dropping-moments-to-ever-happen-at-fashions-biggest-night-101600", "title": "Met Gala Drama: The 11 Most Jaw-Dropping Moments to Ever Happen", "description": "Given the amount of A-listers packed into one venue, it's no surprise the amount of drama that goes down at the annual star-studded Met Gala.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/1280_beyonce_jay_z_gettyimages-457631352.jpg?h=c673cd1c&itok=hsC3p7kR", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Given the amount of A-listers packed into one venue, it's no surprise the amount of drama that goes down at the annual star-studded Met Gala.", "title": "Met Gala Drama: The 11 Most Jaw-Dropping Moments to Ever Happen", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/met-gala-drama-the-11-most-jaw-dropping-moments-to-ever-happen-at-fashions-biggest-night-101600", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/1280_beyonce_jay_z_gettyimages-457631352.jpg?h=c673cd1c&itok=hsC3p7kR"}, "description": "Given the amount of A-listers packed into one venue, it's no surprise the amount of drama that goes down at the annual star-studded Met Gala.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Style, Fashion, Met Gala, Beyonce, Jay Z, Demi Lovato, Nicki Minaj, Taylor Swift, Tom Hiddleston, Selena Gomez, The Weeknd, Bella Hadid, Jennifer Lopez, Alex Rodriguez, Solange Knowles, Met Gala", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/5w8qD4TCV34?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}