{"url": "https://www.pwtorch.com/site/2018/05/20/5-20-total-bellas-review-sarah-k-s-full-rundown-and-analysis-of-all-the-drama-with-nikki-cena-brie-bryan-including-lingerie-shoot-big-words-babies/", "text": "SPOTLIGHTED PODCAST (ARTICLE BEGINS A FEW INCHES DOWN)... PWTorch editor Wade Keller presents the Thursday Flagship edition of the Wade Keller Pro Wrestling Podcast with guest cohost PWTorch VIP analyst Todd Martin. Todd and Wade discuss Howard Finkel and what he represented as a great ring announcer but also how Vince McMahon treated him and what that says about McMahon. Todd then gives his strong view on WWE's decision to release so many wrestlers yesterday during a pandemic just days before the next investor's conference call. And much more.\n\n(Search \"wade keller\" to subscribe in podcast app or CLICK HERE to subscribe in Apple Podcasts.)\n\n\n\nTOTAL BELLAS (episode one)\n\nMAY 20, 2018\n\nAIRED ON E! NETWORK\n\nThe show opens with a brief recap of last season: Brie gave birth and Nikki got engaged. Oh, and they said buzz words: WWE Universe and Bella Army. Yeah, I’m trying not to demonstrate that I don’t really wanna watch this; it’s not exactly working. Also, I wanted John and Nikki to marry just so that she could divorce his psychopath ass and take half of his shit. I feel I deserve that for having seen two seasons of Total Bellas. After Nikki says Brie’s vagina has healed, she adds that she gave birth through her belly. Then Nikki updates John Cena’s life: “John, he’s been extremely busy this past year. Like, John’s literally on fire.”\n\nAnyhoo, John and Nikki are on a pier. John is wearing a loud, unfashionable suit jacket that is obviously the costume of someone trying to pretend to be a fancy rich person. Really, no fancy rich person would wear that. Yeah, it’s on E! and I’m going there, it’s like the last frontier. Nikki is wearing something red. It clashes badly with John Cena’s loud unfashionable suit jacket. Clearly, no one has a stylist. John Cena butchers a “you can’t see me” joke. Because Nikki will someday be Nikki Cena, ergo people will not be able to see her. I want this five minutes of my life back.\n\nOnto Brie and Bryan, the pretend environmentalists in another house in a different state. I doubt that Edward O. Wilson thinks you should have like five houses. So, everyone has a house in California now – yes, John and Nikki have a house in San Diego too. Birdie can supposedly say “papa.” In general, baby’s first word is usually dad or dada. Anyway, onto John and Nikki’s new California house. John Cena’s rug has arrived. Yes, this was a YouTube clip. John is disappointed that Nikki didn’t tell him that the rug arrived. I guess maybe John should’ve answered the door when the bell rang. Nikki is wearing Spanx because she ate pizza. Yes, girls, Nikki Bella has unhealthy attitudes about body and food, and do not look to her for advice – EVER. Yeah, I’m old enough to be your mom, and I mean that.\n\nThere’s a tour of this new house. It has fancy shit. Nikki calls John Cena “Love,” which is a thing that normal people in healthy relationships don’t do. John plays the piano and talks about wainscoting. Brie and Bryan arrive and take their shoes off, you know, because they remember that John Cena is an asshole with way too many f—ing rules because fancy shit is more important than people. Anyway, this was also a YouTube clip and, like an out of touch weirdo, John Cena says something in Chinese to the baby. Baby’s first words are discussed again, yes, really. Seriously, like all other infants – it’s probably gonna be dad. Then Nikki and Brie suggest that there should be a nursery, John Cena stares off into the distance and pretends that no one said that. Yes, this was also a YouTube clip. I think maybe they actually showed the whole show on YouTube on three different accounts like two minutes at a time.\n\nBack from the first commercial: Shameless Birdie Bee plug. Brie and Nikki are going to try on lingerie. Meanwhile Bryan and the creepy brother J.J. are on double date with the babies. It was Birdie’s first carousel ride. At Brie and Bryan’s San Diego house, Bryan admit to doing a baby’s first thing without Brie. Bryan apparently missed the first crawl. I guess this is supposed to be a real plot point? Brie pulls out some Birdie Bee lingerie. She says she’s been “wearing a thong since middle school.” Bryan says, “That’s the trashiest thing I’ve ever heard.” Next shameless plug: The place that makes the wine that the Bella Twins name is slapped on is bottling Chardonnay. Oh god, I have to type this: Nikki critiques Brie talking. So, then Nikki dares Brie to used a “big word” in the meeting. She googles big words and comes up with “anomaly.” Neither one of them actually knows what it means. Again kids, read a book and find a real role model.\n\nIn the mean time, supposedly John and Nikki are getting married in West Newbury, Mass. Weird, I wonder if that’s where he married his first wife? Probably. It’s probably convenient for his family and like no one else, which isn’t a surprise, because empathy isn’t really his thing. Nikki would rather be married in Napa or some place romantic. Since we all have the internet, we all know that the wedding that didn’t happen was supposed to take place on Cinco de Mayo in Mexico. So, clearly, at some point in this season John Cena had to compromise… or he lost a bet. Anyway, commercial. They talk about the wedding, and where it should or shouldn’t take place, then Nikki mentions “Dancing With The Stars,” and Brie attempts to sneak in the use of the word “anomaly,” which she uses wrong. That part of me that graduated from high school with a GPA of 4.33 feels sad.\n\nMoving along, Birdie is filmed in a pool. The mom films it so that Brie can watch it later. I have a feeling this isn’t going to go over huge. No segue, the twins are in a vineyard talking about how Nikki and John should get married in a vineyard. But, OMG, you guys, it’s not what John wants. On behalf of women: Screw John and his dipshitted wants. Nikki feels that if she confronts her emotionally abusive fiancee about where the wedding takes place, then he will childishly renege on getting married. Yes, John Cena is that kind of inflexible dick. If you need a reminder, then go to YouTube and find the WWE clip where Nikki cooks John dinner or the other clip where John’s “power of attorney” was a big hairy secret and they argued about it in an SUV. All the future John Cena tears (yeah, I watched the promo commercial) don’t erase what I’ve already seen. If reality TV is fake, I can’t imagine why someone whose target demographic is women and children would choose to be such an ass.\n\nBack from commercial, Brie and Nikki drink wine. Brie brings up the wedding locale again. Nikki says that “wedding planning has been a lot of fun” in the most unconvincing tone of voice ever. “You’re going to sacrifice it all because you’re grateful that John proposed to you,” this may be the smartest thing Brie Bella has said thus far. In a vehicle Brie and Nikki discuss Nikki having baby fever. Brie asks if she’s broached the topic with John. John’s response to having kids is “absolutely not.” Even as a childless old woman (hey, 38 is ancient in WWE Diva years), I have no idea how much Nikki Bella loves fancy purses and designer shoes over something she appears to actually covet, and why if she’s such an empowered woman – why she hasn’t found a partner with the same life goals. Given my family’s reproductive history, had I really wanted kids, then I wouldn’t have spent five-plus years with someone who doesn’t, not for all the shoes or purses in the world.\n\nBrie gets back and Bryan admits that he took Birdie swimming. Evidently they can’t wait forever for the kid to swim for the first time. Yeah, I dunno, pretty sure the first time I swam I was like 3-4 years old, and my mom didn’t miss it. I have a feeling my father was there too. Brie isn’t happy about the recording. Moving along, there’s a formal dinner at John & Nikki’s house. We all dread John Cena’s dumb rules. Anyway, Nikki makes a joke about giving a blow job to a candle (again little girls: NOT A ROLE MODEL), John Cena makes a fellatio reference, Nikki says she was trying to get him excited, John says: “It didn’t work, I’m dead inside.” It’s the truest thing John Cena has ever said!!!! Yeah, that was like 50 minutes into the show. Inevitably, Bryan will spill water on John Cena’s loud and unfashionable costume of a person trying to manifest richness suit… too bad it wasn’t something that would stain – like beet juice. Yes, someone should take that suit out behind a woodshed and shoot it like a rabid dog.\n\nOh no, Bryan spilled water – so, back to these rules. This is the clip from YouTube – so, supposedly there are no rules. I may not be happy for Bryan’s hipster propensities, but I feel a small victory in that he showed up at “formal dinner” wearing a t-shirt under a suit jacket. Long live the proletariat! John has an awkward conversation with Brie and Bryan about going back to wrestling. John still hasn’t figured out to talk to people instead of talking down to them. Somehow, we’re back to talking about Nikki not having kids. In a cut-out, Nikki admits that she’s lonely. They toast to “the moms.” John Cena smiles. Nikki looks sad. They show random clips of the footage coming up on the rest of the season: Bryan’s come back, the dissolution of Cena and Nikki, and the Women’s Royal Rumble.\n\nNOW CATCH UP ON SARAH K’S REPORTS FROM LAST SEASON HERE.", "images": ["https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/01/PWTorchDailyCast2019_MMATalk.jpg?resize=80%2C60&ssl=1", "https://secure.gravatar.com/avatar/c3ced3d59dc5a784592d6d34618f1913?s=60&d=mm&r=g", "https://i2.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/01/ROH_Logo_2020_3x2_600.png?resize=326%2C245&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2017/12/WadeKellerHotline2017.jpg?resize=326%2C245&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?resize=600%2C381&ssl=1", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/08/SmackdownFox_WWELogo2019_600.png?resize=326%2C245&ssl=1", "https://www.pwtorch.com/site/wp-content/uploads/2016/01/PWTorchLogo2016-text580tight.png", "https://secure.gravatar.com/avatar/f6c6ab59a75b01d0c90e3e3d0f50a527?s=24&d=mm&r=g", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2017/12/WadeKellerHotline2017.jpg?resize=80%2C60&ssl=1", "https://i2.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/03/WWE-logo-3x2_600.png?resize=80%2C60&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/2015/10/MainEvent_3x2.jpg?resize=326%2C245&ssl=1", "https://i2.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/03/TorchCover597_3x2_600.png?resize=80%2C60&ssl=1", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/03/BruceMitchellVIPMailbagPodcast2020.png?resize=80%2C60&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/01/WKPWP_Blue_Spreaker.png?resize=80%2C60&ssl=1", "https://secure.gravatar.com/avatar/c496dd1e57a7221d62f20a33aabe0547?s=24&d=mm&r=g", "https://www.pwtorch.com/site/wp-includes/images/rss.png", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/06/OnTheCanvas.jpg?resize=80%2C60&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?fit=600%2C400&ssl=1", "https://secure.gravatar.com/avatar/ebf0f3783deb1e63029861d1845a13ba?s=24&d=mm&r=g"], "top_img": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?fit=600%2C400&ssl=1", "keywords": [], "authors": ["Bryan Metro", "Kevin", "Bob Rimpnerton"], "canonical_link": "https://www.pwtorch.com/site/2018/05/20/5-20-total-bellas-review-sarah-k-s-full-rundown-and-analysis-of-all-the-drama-with-nikki-cena-brie-bryan-including-lingerie-shoot-big-words-babies/", "title": "5/20 TOTAL BELLAS REVIEW: Sarah K.’s full rundown and analysis of all the drama with Nikki & Cena, Brie & Bryan including lingerie shoot, big words, babies -", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "5/20 TOTAL BELLAS REVIEW: Sarah K.’s full rundown and analysis of all the drama with Nikki & Cena, Brie & Bryan including lingerie shoot, big words, babies -", "description": "TOTAL BELLAS (episode one) MAY 20, 2018 AIRED ON E! NETWORK The show opens with a brief recap of last season: Brie gave birth and Nikki got engaged. Oh, and they said buzz words: WWE [...]", "url": "https://www.pwtorch.com/site/2018/05/20/5-20-total-bellas-review-sarah-k-s-full-rundown-and-analysis-of-all-the-drama-with-nikki-cena-brie-bryan-including-lingerie-shoot-big-words-babies/", "image": {"identifier": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?fit=600%2C400&ssl=1", "secure_url": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?fit=600%2C400&ssl=1", "width": 600, "height": 400}}, "article": {"publisher": "https://www.facebook.com/prowrestlingtorch", "section": "TV Shows & Events", "published_time": "2018-05-21T02:56:58+00:00"}, "twitter": {"card": "summary", "description": "TOTAL BELLAS (episode one) MAY 20, 2018 AIRED ON E! NETWORK The show opens with a brief recap of last season: Brie gave birth and Nikki got engaged. Oh, and they said buzz words: WWE [...]", "title": "5/20 TOTAL BELLAS REVIEW: Sarah K.’s full rundown and analysis of all the drama with Nikki & Cena, Brie & Bryan including lingerie shoot, big words, babies -", "site": "@PWTorch", "image": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2016/10/TotalBellas_3x2_600.png?fit=600%2C400&ssl=1", "creator": "@PWTorch"}, "generator": "Seriously Simple Podcasting 1.20.13", "msapplication-TileImage": "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/2015/10/2016_PWTorchFavicon_WhiteRedBlack.png?fit=270%2C270&ssl=1", "google-site-verification": "QbiACLF5tnvvNHV_szLu6UtYT2nUCTBuTJ9TjRkm1bA"}, "movies": [], "publish_date": 1526745600.0, "source": "https://www.pwtorch.com", "summary": ""}