{"url": "www.thesun.co.uk/tvandshowbiz/6013819/brad-pitt-neri-oxman-dating-angelina-jolie-split/", "text": "BRAD Pitt and renowned architect Neri Oxman have reportedly been dating for six months after a picture of the actor visiting the MIT professor's media lab emerged.\n\nThe A-list hunk, 54, became friends with the Israeli-American, 42, late last year when he teamed up with the Massachusetts Institute of Technology professor to work on an architectural project.\n\n6 Brad Pitt and renowned architect Neri Oxman have reportedly been dating for six months after a picture of the actor visiting the MIT professor's media lab has emerged Credit: Carmen Zino/Instagram\n\nA student at MIT shared a picture of herself and friends with Brad inside the lab on November 28, but Neri wasn't in the shot.\n\nThe starstruck student captioned the picture: \"Ocean’s six? #whatjusthappened #bradpitt #medialab.\"\n\nA photograph of Brad and Neri is said to have been uploaded to social media around the same time but was soon deleted.\n\nBrad is known for his interest in architecture, founding the Make It Right Foundation in 2007.\n\n6 Neri's expertise in environmental design made her the ideal candidate to work with Brad, whose foundation creates energy-efficient homes Credit: Getty Images - Getty\n\n6 Brad is known for his interest in architecture, founding the Make It Right Foundation in 2007 Credit: Getty Images - Getty\n\nThe charity designs and builds affordable and energy-efficient homes for communities in need.\n\nBrad launched the foundation in the aftermath of Hurricane Katrina, and its efforts have since moved from beyond New Orleans to countries around the world.\n\nWhile Brad and Neri's relationship isn't a full blown romance just yet, a source told Page Six there is definitely potential there.\n\nThey said: \"Brad and Neri instantly hit it off because they share the same passion for architecture, design and art. This is best described as a professional friendship.'\n\n6 Neri was previously married to Grammy Award-winning composer Osvaldo Golijov Credit: Getty\n\n\"Their friendship has not turned into romance … as both are cautious and this is, again, more of a professional friendship, but Brad is very interested in spending more time with Neri, she is fascinating.\"\n\nNeri was previously married to Grammy Award-winning composer Osvaldo Golijov. Her work has been exhibited around the world and she has given numerous talks on the marriage of design, technology and biology.\n\nEarlier this month The Sun exclusively revealed Brad and Angelina have called a truce and will settle their previously bitter divorce within weeks.\n\nAngelina, 42, has now agreed to give Brad access to their six children.\n\n6 Brad Pitt and Angelina Jolie are finally set to settle their previously bitter divorce within weeks Credit: Getty Images - Getty\n\nLawyers for Hollywood’s former star couple are putting the finishing touches on the agreement.\n\nIt is expected to be filed imminently after they received court approval to continue negotiating in February.\n\nThe amicable formal end to the marriage is in stark contrast to the public warfare after their break-up.\n\nA source close to Angelina revealed: “The terms of the divorce are now agreed.\n\n“They are being finalised by both legal teams, but will be filed within weeks.\n\n“It’s a huge turnaround from where the marriage ended, especially given the claims Angelina made against Brad, but they are now on pretty good terms.\n\n“Both decided it was crucial for the children that they had a respectful relationship.\n\nThe key thing is that they agree to custody sharing, with Brad having access and working with Angelina on logistic issues about work and travel.\n\n6 There were accusations the actor was involved in a physical clash with his son Credit: Handout - Getty\n\nMOST READ IN BIZARRE WAR AND QUICHE Sue Perkins was 'devastated' by Bake Off co-star Paul Hollywood's behaviour Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior Exclusive TAKING THE RICK Ricky Gervais tells celebs to stop moaning in mansions while NHS staff die Exclusive FEARLESS Dynamo performed magic as a kid to thugs who'd have battered him if he was no good Exclusive That's willy close BGT's David Walliams nearly loses his todger in bold motorcycle stunt Exclusive STROKE OF LUCK The Strokes frontman Julian dating roadie half his age after split from wife\n\n“There were rumours the divorce was being called off, but that’s not the case.”\n\nThe pair split in 2016, with Angelina requesting sole custody of the kids.\n\nThere were accusations Brad was involved in a physical clash with son Maddox, 16, on a plane.\n\nA temporary deal last year gave him visitation rights to Maddox, Pax, 14, Zahara, 13, Shiloh, 11, and Vivienne and Knox, nine.\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220.\n\nWe pay for videos too. Click here to upload yours.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2018/04/af-composite-brad-pitt.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/04/af-composite-brad-pitt.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Dan Cain"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/6013819/brad-pitt-neri-oxman-dating-angelina-jolie-split/", "title": "Brad Pitt and uni professor Neri Oxman ‘have been seeing each other for SIX months’ following Angelina Jolie split", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Does this pic prove Brad Pitt is dating architect Neri Oxman?", "url": "https://www.thesun.co.uk/tvandshowbiz/6013819/brad-pitt-neri-oxman-dating-angelina-jolie-split/", "description": "BRAD Pitt and renowned architect Neri Oxman have reportedly been dating for six months after a picture of the actor visiting the MIT professor’s media lab emerged. The A-list hunk, 54, became…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/04/af-composite-brad-pitt.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2018-04-10T07:14:14+00:00", "modified_time": "2018-04-10T10:37:37+00:00", "publisher": 161385360554578, "tag": "Brad Pitt", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The 54-year-old actor was referred to the architect, 42, last year for a work project. A picture of Brad with students inside Neri's MIT lab in November has emerged, dating their relationship at six months", "keywords": "Brad Pitt, Neri Oxman, dating, Angelina Jolie, split", "news_keywords": "Brad Pitt, Neri Oxman, dating, Angelina Jolie, split", "twitter": {"text": {"title": "Brad Pitt and uni professor Neri Oxman ‘have been seeing each other for SIX months’ following Angelina Jolie split"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "building foundations", "headline": "Does this pic prove Brad Pitt is dating architect Neri Oxman?", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/04/af-composite-brad-pitt.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/04/af-composite-brad-pitt.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 6013819, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1523344454.0, "source": "http://www.thesun.co.uk", "summary": ""}