{"url": "https://en.wikipedia.org/wiki/Vanessa_Marcil", "text": "American actress\n\nVanessa Marcil[3] ( mar-SEL;[citation needed] born Vanessa Sally Ortiz; October 15, 1968)[4] is an American actress. She is best known for her television roles as Brenda Barrett on General Hospital, Gina Kincaid on Beverly Hills, 90210, and Sam Marquez on Las Vegas.\n\nEarly life [ edit ]\n\nMarcil, the youngest of four children, was born in Indio, California, to Patricia Marcil, an herbalist, and Pete Ortiz, a contractor and self-made millionaire. Marcil's father is Mexican and her mother is an American of French and Italian ancestry.[5] Vanessa attended Indio High School, located in Indio, California. Shortly after high school she attended a junior college, College of the Desert, in Palm Desert, California.\n\nCareer [ edit ]\n\nMarcil acted in a number of theatre productions before landing the role of Brenda Barrett on the soap opera General Hospital, in 1992. She garnered three Daytime Emmy Award nominations (in 1997, 1998, and 2003) for her portrayal, and won in 2003 as Outstanding Supporting Actress. In February 1998, she was named Outstanding Lead Actress at the Soap Opera Digest Awards.[6]\n\nOn June 14, 1993 she appeared in the Prince music video \"Poorgoo\", which was released officially in very limited numbers. In 1994, she was cast in the Prince music video, \"The Most Beautiful Girl in the World\", and made People's 50 Most Beautiful list the next year.[7] She made her feature-film debut in the film The Rock (1996), in which she appeared opposite Nicolas Cage, Sean Connery, and Ed Harris.\n\nIn 1998, after six years on General Hospital, she left the show to star in the made-for-television movie To Love, Honor and Deceive, and had a recurring guest role on the police drama High Incident, produced by Steven Spielberg. In November 1998, Marcil joined the Beverly Hills, 90210 cast as Gina Kincaid and remained with the show for one-and-a-half seasons. In 1999, she starred in two independent films: Nice Guys Sleep Alone, with Sean O'Bryan, and This Space Between Us, with Jeremy Sisto.\n\nIn 2001, she was initially cast to join NYPD Blue's ninth season as a new series regular, Det. Carmen Olivera. However, after her first appearance in \"Johnny Got His Gold\", the show decided to redo the role and replaced Marcil with Jacqueline Obradors, as Det. Rita Ortiz. Marcil made one more cameo appearance, as Det. Olivera, in the 11th-season episode \"Shear Stupidity\".\n\nFrom 2002 to 2003, she returned to General Hospital, as Brenda Barrett, garnering her a Daytime Emmy Award for Outstanding Supporting Actress in 2003. Vanessa later joined the cast of the NBC drama Las Vegas as Sam Marquez, a casino host, where she remained on the show for five seasons until 2008. That same year, she became the host of Lifetime's reality show Blush: The Search for America's Greatest Makeup Artist, as well as making a three-episode guest appearance on the NBC show Lipstick Jungle.\n\nIn 2009, she starred in the Hallmark channel movie The Nanny Express and in the Lifetime movie One Hot Summer. In 2010, she was in the web series The Bannen Way and in August 2010 after a seven-year absence, she made her return to General Hospital remaining on the show for a year before her departure from the show in July 2011. Marcil did make a guest appearance in April 2013 to commemorate the show's 50th anniversary.\n\nIn 2014, she starred in the Hallmark channel movie Stranded in Paradise, and in 2015, she joined the cast of the Pop reality series Queens of Drama, about the lives of former soap-opera actresses attempting to pitch a pilot for a television network. In 2016, she starred in her latest Hallmark channel movie, The Convenient Groom.\n\nPersonal life [ edit ]\n\nMarcil was married to actor Corey Feldman from 1989 to 1993.\n\nMarcil and her former Beverly Hills, 90210 castmate Brian Austin Green have a son born in 2002.[8][9]\n\nOn July 11, 2010, Marcil married actor Carmine Giovinazzo in a private ceremony in New York City.[3][10] In June 2011, the couple announced they were expecting their first child together;[11] however, Marcil suffered a miscarriage, her second that year.[12] Marcil filed for divorce in August 2012 on the basis of irreconcilable differences.[13] The divorce was finalized in March 2013.[14]\n\nIn April 2015, Marcil revealed that she was engaged to a deputy sheriff, whom she refers to as \"MC\" on social media.[15] On November 13, 2017, Marcil announced she was pregnant yet again.[16] On January 9, 2018, she revealed the she was expecting a daughter, but on January 27, released an Instagram statement stating she had miscarried for the seventh time.[17]\n\nMarcil's father, Pete, died on September 14, 2017.[18]\n\nFilmography [ edit ]\n\nList of film credits Year Title Role Notes 1996 Carla Pestalozzi 1997 976-WISH Danielle 1999 Nice Guys Sleep Alone Erin 2000 This Space Between Us Maggie Harty 2002 Storm Watch Tess Woodward Alternative titles: Virtual Storm, Code Hunter\n\nAwards and nominations [ edit ]\n\nAwards and nominations Year Award Category Work Result 1994 Soap Opera Digest Awards Outstanding Female Newcomer General Hospital Nominated 1995 Soap Opera Digest Awards Hottest Soap Couple (shared with Maurice Benard) General Hospital Nominated 1997 Daytime Emmy Award Outstanding Supporting Actress in a Drama Series General Hospital Nominated 1997 Soap Opera Digest Awards Hottest Female Star General Hospital Won 1998 Soap Opera Digest Awards Outstanding Lead Actress General Hospital Won 1998 Daytime Emmy Award Outstanding Supporting Actress in a Drama Series General Hospital Nominated 2003 Soap Opera Digest Awards Favorite Return General Hospital Won 2003 Daytime Emmy Award Outstanding Supporting Actress in a Drama Series General Hospital Won", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Vanessa_Marcil", "title": "Vanessa Marcil", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}