{"url": "https://ew.com/movies/2017/06/14/ben-stiller-dodgeball-reunion-omaze/", "text": "Dodgeball: A True Underdog Story type Movie\n\nOver the years, there have been dozens of sports movies pitting the lovable underdogs against the seemingly unbeatable elites — it’s a classic American story. But none were perhaps as big of a surprise hit as 2004’s Dodgeball: A True Underdog Story. Directed by Rawson Marshall Thurber, the film starred Vince Vaughn and Ben Stiller as, respectively, the underdog owner of failing gym Average Joe’s and the elite fitness guru trying to push the facility out of business. Backed by a wide and deep cast that also featured Justin Long as a male cheerleader, Alan Tudyk as a 24-7 pirate cosplayer, Rip Torn as a weathered old dodgeball coach, Christine Taylor as an athletically gifted lawyer, and more, Dodgeball was a surprise hit that summer, earning $167 million worldwide on a reported $20 million budget.\n\nAnd while a long-discussed sequel to the film has never materialized, Dodgeball fans scored the next best thing on Wednesday morning when Omaze launched a new charity campaign with a video that reunites the original cast. The clip, seen above, stars Stiller as Globo Gym chief White Goodman, who’s back to implore viewers to team up with him in Omaze’s new contest. But, lo and behold, Vaughn’s Peter LaFleur is on hand too, along with Long and Taylor, to represent the Average Joe’s. Hilarity ensues and so does a request: Fans are encouraged to pick a side by signing up via Omaze’s website (either omaze.com/globo or omaze.com/joes) for the chance to play dodgeball with Stiller himself. Proceeds will benefit the Stiller Foundation, which supports education initiatives for children around the world.\n\nEW talked with Stiller about filming the new video and looking back on the “true underdog story,” 13 years later.\n\nImage zoom Omaze\n\nENTERTAINMENT WEEKLY: What did it feel like to step back into the White Goodman shoes?\n\nBEN STILLER: It was really strange and fun. I didn’t know what it would be like, because I was away from it for so long and I never really thought there would be any reason to do the character again, but then when this opportunity came up, especially talking to Omaze and what good ideas for fundraising there would be, over the years we’ve been aware of people who are fans of the movie and their connection with it, which I’ve appreciated. It’s fun to connect with people on something like that — like at Halloween, I see people dressed up as the movie and things like that. To me, it was really important when we said we could do it, the first person I called was Rawson Thurber, who wrote and directed the movie, and said, “Hey would you get on board with this thing? If you would write and direct this thing, we could put the band back together.” That was the key to it, these things don’t exist in a vacuum in terms of the writing and situation. Once Rawson said yes, I called Vince up, and he immediately said, “I’m in, let’s do it, it’s for a good cause.” Then we got Justin Long and Christine Taylor and Missi Pyle and everybody; it was really exciting for us all to get back together. So we got our Halloween costumes, and luckily it’s Spandex so it all still kind of fit.\n\nAre these new costumes?\n\nWe found the original costumes, literally the original mustache, and wig, this ratty old caterpillar of a mustache. Then it was one of those things where it came back, in terms of the dynamic. I think Rawson wrote a great little piece, it was really fun. We were in a gym and shooting, so it was a very similar situation to when we did the movie except all these years have gone by. So it was kind of bizarre yet fun, but also weird and eerie how everything came back, like Vince’s reactions and our whole dynamic. The dynamic is important when you’re doing a character like White because the whole thing is based on the dynamic of them playing off each other. That was really fun to jump back in.\n\nWhere did you come up with the character for White?\n\nI honestly don’t know. It all kind of comes from the Tony Robbins impression that I tried to do on The Ben Stiller Show, and then it became Tony Perkis from Heavyweights [whom Stiller played] and then it morphed into White Goodman. I don’t have that many moves, really. It’s funny because once you do the makeup and get the wig on, then you’re suddenly like, “Oh yeah, I got this.” But I did watch a couple YouTube clips from the movie to reacquaint myself with what I was doing.\n\nThe original movie is so rich with one-liners and little absurdities. Are there things even you forget about and then get reminded of by fans?\n\nOh yeah. I don’t go back and rewatch the movie a lot unless I’m flipping across the channels and something comes up and I’ll watch for a second. So some of those lines from the movie I remember really well, and then other ones not as well, so it’s funny when people love a very specific thing. “Nobody makes me bleed my own blood” is one that has always kinda stuck with me. In terms of what people respond to, it’s always interesting. I’m always surprised and very happy when people have something they connect with like that, because I know I have those moments with movies that I loved watching growing up. Now that the movie’s been around so long, I hear a lot from kids in their 20s who loved it from when they were kids. That’s the thing I remember from that age: Movies affect you so much, and they stick with you. So that’s really kinda cool.\n\nWhat do you remember most about making Dodgeball?\n\nI remember having a lot of fun making the movie. It was so ridiculous when we were doing it, I remember doing scenes where I was feeling kind of embarrassed because I thought it’s so ridiculous, and the movie was not necessarily a guaranteed success. In terms of like moments that I remember, I remember Chuck Norris being there and that being very exciting. I remember he came in on a chopper – you’d probably expect nothing less. I remember doing the dodgeball scenes themselves, that being very involved.\n\nDid you guys have to actually become good at the actual sport?\n\nWell, we tried. We had some very choreographed shots and things, but when you’re playing dodgeball, it’s hard not to get into it. It’s that very visceral thing we all remember from eighth grade, so everyone was trying to do their best. I just remember laughing a lot, and feeling like gosh, this could just be the end of everything.\n\nOmaze is giving fans the opportunity to choose between the Average Joe’s and Globo Gym’s Purple Cobras. What would you say to people to convince them to join the Purple Cobras?\n\nIt’s more like Omaze is giving people the chance to go with a Winner or a La-loser. And Purple Cobras have much cooler uniforms.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg", "keywords": [], "authors": ["Christian Holub", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/movies/2017/06/14/ben-stiller-dodgeball-reunion-omaze/", "title": "Dodgeball reunion: Ben Stiller suits up Omaze charity video", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ben Stiller,Reunions", "news_keywords": "Ben Stiller,Reunions", "description": "The actor discussed filming a new promo as White Goodman and his memories of the original film", "og": {"title": "Ben Stiller Talks 'Dodgeball' Reunion Video: 'It Was Really Strange and Fun'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/06/14/ben-stiller-dodgeball-reunion-omaze/", "description": "Over the years, there have been dozens of sports movies pitting the lovable underdogs against the seemingly unbeatable elites — it’s a classic American story.&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/movies/2017/06/14/ben-stiller-dodgeball-reunion-omaze/", "description": "The actor discussed filming a new promo as White Goodman and his memories of the original film", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/06/14/ben-stiller-dodgeball-reunion-omaze/", "title": "Ben Stiller Talks 'Dodgeball' Reunion Video: 'It Was Really Strange and Fun'", "description": "The actor discussed filming a new promo as White Goodman and his memories of the original film", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F06%2Fben-stiller-omaze-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": ["https://www.youtube.com/embed/4iw1jTY-X3A"], "publish_date": 1497369600.0, "source": "https://ew.com", "summary": ""}