{"url": "https://ew.com/tv/2017/05/24/dirty-dancing-abc-tv-remake-vs-original/", "text": "Dirty Dancing type Movie\n\nNobody puts Baby in a corner in the television remake of Dirty Dancing, which aired Wednesday on ABC, but other aspects of the original 1987 film have shifted.\n\nThe remake, starring Abigail Breslin and newcomer Colt Prattes, came as ABC’s first television musical (the network has announced a live musical presentation of The Little Mermaid for October). The original, which rocketed Patrick Swayze and Jennifer Grey to fame (and into the hearts of teenage girls), is celebrating its 30th anniversary this year.\n\nABC’s take doesn’t aim to be a carbon copy, but it does seek to recapture many of the beloved moments of the original, maintaining the basic plot and lifting some key dialogue and sequences (though R.I.P. this line of many teenage daydreams: “I’m scared of walking out of this room and never feeling the rest of my whole life the way I feel when I’m with you”). And while the two new stars’ attempts to recreate the crackling chemistry displayed by Grey and Swayze leaves something to be desired, the new version fleshes out some of the supporting characters and tinkers with the songs in a myriad of ways in an effort to update the classic for modern tastes. It also takes the swift 100-minute running time of the original and bloats it to three hours with commercial interruptions.\n\nWe rounded up the major differences between the remake and the original so you don’t have to. If you’re afraid of spoilers, avert your hungry eyes!\n\nImage zoom Everett Collection/ Guy D'Alema/ABC\n\nA musical!\n\nThe original film featured musical sequences, with its chart-topping soundtrack underscoring many key moments and the titular dance numbers dominating the storytelling. It skillfully employed musical montage, using well-edited sequences set to “Wipeout” and “Hey Baby” to lead the audience through Baby’s dance lessons. This update takes it one step further and has characters actually sing their numbers. (Despite the fact that a stage musical production of Dirty Dancing exists, this is the most traditional musical version to date; in the stage show, the actors primarily dance to prerecorded tracks and don’t sing).\n\nSome new songs find their way in, with Debra Messing and Bruce Greenwood each taking their turn on “They Can’t Take that Away from Me” and Katey Sagal delivering her rendition of “Fever.” More notably, many of the classic numbers from the original film, including the finale track “(I’ve Had) The Time of My Life,” are now sung by the characters and the Kellerman band. Johnny Castle still has an impressive record collection, but we rarely see him make use of a turntable. The sexy lip-synching to Mickey and Sylvia’s “Love is Strange” is replaced with actual singing.\n\nD-I-V-O-R-C-E\n\nIn the original film, the older characters are mostly archetypes to help further the plot. Baby’s relationship with her father provides the film’s main conflict as she struggles between her burgeoning independence (and love) and her desire to make her father proud. That story line remains, but here, the Housemans have a conflict of their own: Marjorie (Debra Messing) and Jake (Bruce Greenwood) face marital strife. Now that their kids are grown and going off to college, Marjorie fears a lonely life with her workaholic husband. She mourns the extinguished flame of passion in their relationship. While Baby discovers the pangs of first love, her parents are struggling to rekindle their own romance. Meanwhile, instead of a philandering, bored, rich housewife, Vivian Pressman (Katey Sagal) is now a bored, rich divorcée, and she inspires Marjorie to seize her own destiny and ask for a separation. Two female characters and older women who were once window dressing get an upgrade — Baby’s not the only one refusing to be put in a corner.\n\nThe F-word\n\nThe original Dirty Dancing dwelled on class conflicts; in typical ’80s fashion, it drew its central drama from misunderstandings between rich people with good intentions but bad assumptions and the folks from the wrong side of the tracks with hearts of gold (and it threw in some light misogyny and Ayn Rand worship for good measure). Baby cares about civil rights and other social movements, but we only get this information in passing. In the remake, Baby is an early acolyte of the women’s movement, reading The Feminine Mystique and encouraging her mother and sister to find their own worth and interests outside of marriage and homemaking. Even hapless junior Kellerman, Neil (Trevor Einhorn), tells Baby she shouldn’t have to choose between wearing lipstick and taking dance classes and being an enlightened, intelligent woman (Neil: Mindy Kaling called, she wants you on her writing staff). The updated version also features glimmers of an interracial romance between Lisa Houseman (Sarah Hyland) and new character Marco (J. Quinton Johnson), and to make room for this new romance, Lisa shuts down waiter Robby after his failure to comprehend consent and victim-blaming early on. But for the remake’s attempts to be more socially conscious, the cast is still predominantly white, and the attempts to modernize feel hollow.\n\nYou gotta hold the frame…\n\nThe remake opens on New York City, 1975, in the midst of a new story that frames the plot of the original. The central story line of the 1963 summer Catskill romance remains, but it is now bookended by a flash-forward. Baby attends Dirty Dancing: The Musical in New York City, and we learn that Johnny has fulfilled his dream of becoming a Broadway choreographer. Baby has moved on to a new man (and has a daughter), but she still takes a local community salsa class. Johnny wistfully tells her to keep dancing and watches her go. It’s an attempt to add a new spin on the proceedings, but a) what is Dirty Dancing: The Musical? Is it Baby and Johnny’s story? Or some alternate universe plot that just happens to share a title with the movie we’re watching? And b) none of us realistically expected Baby and Johnny to live happily ever after together beyond this summer fling, but let’s at least leave some room to preserve that illusion.\n\nCover me\n\nThe live musical numbers already introduce new takes on the classic songs of the soundtrack, but that’s not enough. In an attempt to make everything appeal to a new generation, we also get covers of the background tracks. Lady Antebellum offers a countrified “Hey Baby!”; YouTube star Greyson Chance delivers a slightly more electronic “Hungry Eyes”; and Calum Scott replaces Patrick Swayze on “She’s Like the Wind” with a bizarre dance remix. These contemporary takes are jarring since the story is set in the 1960s.\n\nWelcome to the ’60s\n\nThe music may sound more contemporary, but the costumes appear more accurate in this rendition. The 1987 version, while set in 1963, looked distinctively of its time — from Jennifer Grey’s perm to Patrick Swayze’s wild coif to Baby’s anachronistic Keds in the “Hungry Eyes” montage. Many of the costumes feel more ’80s than 1960s mod. When it comes to costuming, Hollywood period pieces have often reflected the eras in which they were made more than the period they intended to represent. But now, in a post-Mad Men world, there’s a far greater degree of wardrobe accuracy. That attention to detail is on display here.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg", "keywords": [], "authors": ["Maureen Lee Lenker", "Seija Rankin", "Jodi Walker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd", "Maggie Fremont"], "canonical_link": "https://ew.com/tv/2017/05/24/dirty-dancing-abc-tv-remake-vs-original/", "title": "'Dirty Dancing': How the TV Remake Compares to the Original", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Abigail Breslin,Colt Prattes,Jennifer Grey,Patrick Swayze", "news_keywords": "Abigail Breslin,Colt Prattes,Jennifer Grey,Patrick Swayze", "description": "We rounded up the major differences between the ABC's remake and the 1987 original so you don't have to.", "og": {"title": "'Dirty Dancing': How the TV Remake Compares to the Original", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/05/24/dirty-dancing-abc-tv-remake-vs-original/", "description": "Nobody puts Baby in a corner in the&nbsp;television remake of&nbsp;Dirty Dancing,&nbsp;which aired Wednesday on ABC, but other aspects of the original 1987 film have shifted.&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg", "width": 1800, "height": 942}}, "pinterest": {"url": "https://ew.com/tv/2017/05/24/dirty-dancing-abc-tv-remake-vs-original/", "description": "We rounded up the major differences between the ABC's remake and the 1987 original so you don't have to.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/05/24/dirty-dancing-abc-tv-remake-vs-original/", "title": "'Dirty Dancing': How the TV Remake Compares to the Original", "description": "We rounded up the major differences between the ABC's remake and the 1987 original so you don't have to.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F05%2Fdirtydancing.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1495555200.0, "source": "https://ew.com", "summary": ""}