{"url": "https://ew.com/movies/2017/12/22/movies-to-see-christmas-2017-in-theaters-streaming/", "text": "Ahh, Christmas. A time of holiday lights, presents under the tree, and arguing with your extended family about what movie you’re going to go see.\n\nThis year, theaters will be packed with everything from family-friendly comedies and sci-fi blockbusters to feel-good crowdpleasers and awards bait. Whether you’re looking to kill a few hours after Christmas dinner or just trying to escape your weird cousins who are visiting, we’ve rounded up all the biggest new releases in theaters and streaming.\n\nNEW RELEASES\n\nMolly’s Game\n\nStarring: Jessica Chastain, Idris Elba, Kevin Costner\n\nDirector: Aaron Sorkin\n\nRating: R\n\nEW review: “With a gift as unique as Sorkin’s, it was always only a matter of when — not if — he would try his hand at directing one of his own scripts. Still, who could’ve predicted that he’d be such a natural behind the camera the first time around? Aside from a few misdemeanor writerly indulgences, Sorkin’s fast-and-funny new morality tale, Molly’s Game, doesn’t feel like a directorial debut. It feels like an assured story told by a seasoned pro. Sorkin grafts his signature staccato lines onto the true story of Molly Bloom — a former Olympic skier who would end up channeling her iron will into more illicit ventures. Namely, running one of the country’s biggest and most exclusive underground poker games. That is, until the feds finally crashed the party. Sorkin, who’s always seemed more comfortable with alpha male types, was smart (or exceedingly lucky) to cast Jessica Chastain as his heroine, Molly. The film is easily the best showcase she’s had since Zero Dark Thirty.” A-\n\nWhere to watch: In theaters Dec. 25 (buy tickets)\n\nWho to watch with: Your cool older cousin who taught you how to play poker.\n\nAll the Money in the World\n\nStarring: Michelle Williams, Christopher Plummer, Mark Wahlberg\n\nDirector: Ridley Scott\n\nRating: R\n\nEW review: “It’s hard to say of course how [original star Kevin] Spacey would have filled the role without actually seeing him onscreen (aside from the fact that he did look odd in the heavy aging prosthetics shown in the initial trailers, like a refugee from a Dick Tracy villain camp circa 1990). But there’s none of the cold Keyser Söze snake in the 88-year-old Plummer’s performance; he’s pitiless, without question, but pitiable too: a lonely old man clinging to things — estates, objets, Old Master paintings — because he can’t trust a human heart, least of all his own. It’s already earned him a Golden Globe nomination (Williams received one as well, as did Scott, for best director), which may be the industry’s way of recognizing an achievement in logistics as much as in quality filmmaking. At its best though, Money makes you forget all that and surrender to a story that might be almost too strange to believe, if it wasn’t entirely true.” B+\n\nWhere to watch: In theaters Dec. 25 (buy tickets)\n\nWho to watch with: Your grandpa who, unlike J. Paul Getty, would pay a lot of money for your ransom if you were kidnapped.\n\nPhantom Thread\n\nStarring: Daniel Day-Lewis, Vicky Krieps, Lesley Manville\n\nDirector: Paul Thomas Anderson\n\nRating: R\n\nEW review: “Now that the movie is finally here, it can now called for what it actually is: the new Paul Thomas Anderson-Daniel Day-Lewis film that, despite all of the anticipation, is a little underwhelming. Don’t get me wrong — like all of Anderson’s films (the best of which remain Boogie Nights and Magnolia), Phantom Thread is meticulously crafted, visually sumptuous, impeccably acted, and very, very directorly. But until the final act, this straight-jacketed character study is also pretty tame stuff — emotionally remote, a bit too studied, and far easier to admire than surrender to and swoon over. It seems to exist under glass.” B\n\nWhere to watch: In theaters Dec. 25 (buy tickets)\n\nWho to watch with: Your fashion-obsessed older sister.\n\nPitch Perfect 3\n\nStarring: Anna Kendrick, Rebel Wilson, Brittany Snow\n\nDirector: Trish Sie\n\nRating: PG-13\n\nEW review: “All things must come to an aca-end. And so after five years, three outings, and an uncountable number of pitch puns, the house that multipart harmonies built is signing off — and if its swan song sometimes feels more like a wild goose chase, plotwise (or maybe a day-drunk penguin), the sheer nutty charisma of its sprawling cast still carries the series out on a pretty sweet high note.” B\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your old college friends you haven’t seen in a while.\n\nThe Greatest Showman\n\nStarring: Hugh Jackman, Michelle Williams, Zac Efron, Zendaya\n\nDirector: Michael Gracey\n\nRating: PG\n\nEW review: “First-time director Michael Gracey, working from a script by Jenny Bicks (Sex & the City) and Bill Condon (Chicago, Gods and Monsters, Dreamgirls), plunges ahead in a giddy rush, carving out ample opportunities for his stars to sing the soaring rock-opera compositions penned by Benj Pasek and Justin Paul, the gifted musical duo behind La La Land and Dear Evan Hansen. What he doesn’t make much room for is subtlety; every emotion is signaled to the peanut gallery, every story beat landed with a foot stomp and a handclap.” B\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your 12-year-old cousin who wants to be a Broadway star when she grows up.\n\nJumanji: Welcome to the Jungle\n\nStarring: Dwayne Johnson, Karen Gillan, Kevin Hart, Jack Black\n\nDirector: Jake Kasdan\n\nRating: PG-13\n\nEW review: “Stop me if you’ve heard this one before: A group of high school kids representing different archetypes (the brain, the princess, the basket case, and so on) meet in detention and, a few hours later, discover that they’re not so different after all. Now stop me if you’ve heard this one before: A seemingly harmless game sucks its players into a magically perilous jungle world of wild flora and rampaging animals, ultimately leading to valuable life lessons. Congratulations, you’ve not only seen 1985’s The Breakfast Club and 1995’s Jumanji, you’ve also already seen the latest Hollywood intellectual-property retread/reboot no one knew they were asking for. Jumanji: Welcome to the Jungle is a film as busy as a mediocre video game and as familiar and by-the-numbers as a dozen other brand-recognition titles that have recently trundled off the Tinseltown widget assembly line.” C\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your sibling, who was traumatized by the CG animals in the original 1995 movie.\n\nDownsizing\n\nStarring: Matt Damon, Christoph Waltz, Hong Chau\n\nDirector: Alexander Payne\n\nRating: R\n\nEW review: “Director Alexander Payne (Nebraska, Election, About Schmidt) specializes in a kind of deadpan heartland absurdity, but he’s never delved into anything nearly as fantastical as this. Though the little-people terrarium of Leisureland may not be what Paul had hoped, it’s also where he learns to stop worrying and love the small, thanks to his hedonist neighbor (Christoph Waltz) and a left-field romance with Vietnamese dissident Ngoc (Hong Chau, bossy and funny and refreshingly oblivious to lip gloss). The result is a dadaist swirl of satire, pie-eyed whimsy, and speculative futurism — like Gulliver’s Travels through the wrong end of a telescope.” B+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your Alexander-Payne-loving cousin, who’s watched Election a thousand times.\n\nHostiles\n\nStarring: Christian Bale, Rosamund Pike, Wes Studi\n\nDirector: Scott Cooper\n\nRating: R\n\nEW review: “Shot in New Mexico and Colorado, Hostiles is visually stunning. And its themes of blind hatred and eventual understanding between the races is reminiscent of Dances With Wolves, minus the preachiness. Still, the biggest draw is watching Bale deliver another master class in invisible acting. Every gesture feels authentic. You immediately understand this spiritually spent man — for better and worse. Westerns can be a tough nut to crack, but Hostiles may be the finest example of the genre since Unforgiven. ” A\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your dad, who always complains about how nobody makes any good Westerns anymore.\n\nThe Post\n\nStarring: Meryl Streep, Tom Hanks, Sarah Paulson\n\nDirector: Steven Spielberg\n\nRating: PG-13\n\nEW review: “Steven Spielberg’s The Post is set in 1971, yet it couldn’t be more about 2017 if it tried. There are period-specific sideburns, mustard-colored shirts, and a screen choked with cigarette smoke, but it’s a timely wake-up call about speaking truth to power in the ‘fake news’ era.\n\nMovies, of course, take a long time to gestate, and when this rousing ink-stained procedural about The Washington Post’s race to publish the Pentagon Papers was being written, the 2016 election wasn’t yet over. Spielberg caught a lucky break — if you can call anything related to that election lucky. The message of the movie is so obvious it’s a shame it needs repeating: namely, that an adversarial press is essential to democracy.” B+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Anyone who likes Meryl Streep and Tom Hanks. (So, everyone.)\n\nSTILL IN THEATERS\n\nStar Wars: The Last Jedi\n\nStarring: Daisy Ridley, John Boyega, Mark Hamill\n\nDirector: Rian Johnson\n\nRating: PG-13\n\nEW review: “There are a handful of truly spectacular moments in The Last Jedi—some as visually sumptuous and others as emotionally poignant and raw as anything in the intergalactic ring cycle so far: The sight of Rebel X-wing fighters emerging from light speed and skidding to a halt; a kamikaze crash rendered in giddy, gasp-inducing super slo-motion; a vertiginous, ground-scraping dogfight on a salt-mining planet that kicks up plumes of velvet-cake red dust. These, along with a few touching reunions and farewells from beloved characters that some of us have known like family for 40 years, will go down as instant classics that will be catnip for fans young and old. That said, I’d stop short of calling director Rian Johnson’s undeniably impressive initiation into the Star Wars fold the masterpiece that some desperately want it to be. The film simply drags too much in the middle. Somewhere in the film’s 152-minute running time is an amazing 90-minute movie.” B+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your nerdy friends, who won’t mind seeing it a second (or third) time.\n\nCoco\n\nStarring: Anthony Gonzalez, Gael García Bernal, Benjamin Bratt, Alanna Ubach, Renee Victor\n\nDirector: Lee Unkrich, Adrian Molina (co-director)\n\nRating: PG\n\nEW review: “Mamas don’t let their babies grow up to be mariachis. That’s one thing Miguel (voiced by newcomer Anthony Gonzalez) knows for sure: Ever since his great-great-grandfather abandoned the family decades ago to pursue la vida musical, every descendant has shunned both his tainted memory and any stray melody unwise enough to drift past a window. They are shoemakers now, not dreamers. But Miguel, a tenacious 12-year-old with a single dimple in his cheek and an unhushable song in his heart, can’t help it; his fingers ache for a guitar. And like every hero on a quest, he will find one. Though unlike most — especially in the shiny world of Pixar, whose Technicolor critters, toy cowboys, and anthropomorphized race cars often seemed to come in every shade but brown — he is also proudly, unmistakably Mexican.” B+\n\nWhere to watch: In theaters everywhere (buy tickets)\n\nWho to watch with: Your young nieces and nephews (who hopefully won’t judge you if you get a little teary).\n\nFerdinand\n\nStarring: John Cena, Kate McKinnon, Gina Rodriguez\n\nDirector: Carlos Saldanha\n\nRating: PG\n\nEW review: “Munro Leaf’s children’s book The Story of Ferdinand is a bona fide classic. With its charming drawings and kid-friendly prose, Ferdinand was an instant hit upon publication in 1936. (It also became politically controversial during the Spanish Civil War and World War II, thanks to its pacifist message, and Hitler famously banned it.) The story is simple: Ferdinand is a strong but peaceful bull who has no interest in bullfighting and would rather spend his days sitting under his favorite cork tree, smelling the flowers. Because of his seemingly fierce appearance, Ferdinand is taken to Madrid and put in the ring to face a matador — only he refuses to fight.\n\nWalt Disney released a short, animated adaptation in 1938, but Ferdinand is making his true big-screen debut now, with John Cena voicing the titular bull in an animated adaptation. Leaf’s book is less than 800 words long, so understandably, director Carlos Saldanha had to add some padding to create a full-length feature. Unfortunately, Ferdinand buries the original story’s message under frenetic action scenes and grating sidekicks, turning a classic tale into just another flat animated comedy.” C+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your young nieces and nephews, when their parents could use a break.\n\nLady Bird\n\nStarring: Saoirse Ronan, Laurie Metcalf, Beanie Feldstein, Lucas Hedges, Timothée Chalamet, Tracy Letts, Lois Smith\n\nDirector: Greta Gerwig\n\nRating: R\n\nEW review: “Gerwig doesn’t trap her protagonist in the oblivious underage bubble that most coming-of-age dramedies inhabit; Lady Bird’s parents, played by Tracy Letts and Laurie Metcalf, are fully formed humans with their own deep flaws and vulnerabilities. Their messiness is hereditary but it’s also a gift, the wind beneath their weird little Bird’s wings.” A-\n\nWhere to watch: In theaters now (buy tickets)\n\nWho to watch with: Your mom, obviously.\n\nThe Shape of Water\n\nStarring: Sally Hawkins, Doug Jones, Michael Shannon\n\nDirector: Guillermo del Toro\n\nRating: R\n\nEW review: “If this all sounds bizarre, well, it is. But it’s also poignant, tender, funny, romantic, and flat-out breathtaking in its shoot-the-moon ambition. There’s even a Busby Berkeley dance-fantasia number! If you’re willing to go with this fishy fairy tale, The Shape of Water is a haunting sci-fi love story like nothing you’ve ever seen before — or dreamed that you ever wanted to see. It’s pure movie magic.” A\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your significant other, because nothing says romance like a movie about a mute cleaning lady and her fish-monster beau.\n\nDarkest Hour\n\nStarring: Gary Oldman, Kristen Scott Thomas, Ben Mendelsohn\n\nDirector: Joe Wright\n\nRating: PG-13\n\nEW review: “I’ll be honest, Oldman hasn’t been this good for a very long time. To be even more honest, he’s starred in a lot of junk in the past decade. But remember, this is the actor who played Sid Vicious in Sid and Nancy and was so hypnotic (and often scary) in Prick Up Your Ears, State of Grace, JFK, The Professional, True Romance, Immortal Beloved, and The Contender. It’s both a relief and revelation to see him get the chance to swing for the fences again.” B+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your dad, who loves World War II history and loved Dunkirk.\n\nThe Disaster Artist\n\nStarring: James Franco, Dave Franco, Seth Rogen\n\nDirector: James Franco\n\nRating: R\n\nEW review: “Isn’t it better to fail spectacularly than to never try at all? Tommy Wiseau’s 2003 magnum opus, The Room — an accidental cult classic once dubbed “the Citizen Kane of bad movies” — was the hard-won sum of his Hollywood dreams; it was also possibly the best worst thing to happen to cinema since Ed Wood picked up a camera. And it feels only appropriate that James Franco, an actor and director for whom weirdness is next to godliness, would be the one to tell his story.” B+\n\nWhere to watch: In theaters (buy tickets)\n\nWho to watch with: Your friend who thinks he has a great Tommy Wiseau impression.\n\nSTREAMING\n\nBright\n\nStarring: Will Smith, Joel Edgerton, Noomi Rapace\n\nDirector: David Ayer\n\nRating: Unrated\n\nEW review: “Genre mashups can be fun! In theory, the idea of a gritty police drama set in a modern-day America where orcs, elves, and humans coexist could be enjoyable! As a general rule, for a genre mashup to succeed, a film has to get at least one of those genres right. Netflix’s Bright, which bills itself as part buddy-cop movie, part lavish fantasy, does neither justice, resulting in lazy nonsense that’s too silly to be good and too self-serious to be any fun.” D+\n\nWhere to watch: Streaming on Netflix\n\nWho to watch with: On second thought, maybe you better put on Netflix’s A Christmas Prince instead.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fnew-releases-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fnew-releases-2000.jpg", "keywords": [], "authors": ["Devan Coggan"], "canonical_link": "https://ew.com/movies/2017/12/22/movies-to-see-christmas-2017-in-theaters-streaming/", "title": "17 movies to see (or not) over Christmas 2017", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "17 movies to see (or not) over Christmas 2017", "og": {"title": "17 movies to see (or not) over Christmas 2017", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/12/22/movies-to-see-christmas-2017-in-theaters-streaming/", "description": "Ahh, Christmas. A time of holiday lights, presents under the tree, and arguing with your extended family about what movie you’re going to go see.&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fnew-releases-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/movies/2017/12/22/movies-to-see-christmas-2017-in-theaters-streaming/", "description": "17 movies to see (or not) over Christmas 2017", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fnew-releases-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/12/22/movies-to-see-christmas-2017-in-theaters-streaming/", "title": "17 movies to see (or not) over Christmas 2017", "description": "17 movies to see (or not) over Christmas 2017", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fnew-releases-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": ["https://www.youtube.com/embed/Vu4UPet8Nyc", "https://www.youtube.com/embed/KXHrCBkIxQQ", "https://www.youtube.com/embed/xNsiQMeSvMk", "https://www.youtube.com/embed/aVsOXRgjeeU", "https://www.youtube.com/embed/AXCTMGYUg9A", "https://www.youtube.com/embed/v_TJKwJwN0E", "https://www.youtube.com/embed/UCrBICYM0yM", "https://www.youtube.com/embed/vJz5l5ru7ws", "https://www.youtube.com/embed/nrXlY6gzTTM", "https://www.youtube.com/embed/Q0CbN8sfihY", "https://www.youtube.com/embed/Rvr68u6k5sI", "https://www.youtube.com/embed/n7RkOfN8KvE", "https://www.youtube.com/embed/cNi_HC839Wo", "https://www.youtube.com/embed/XFYWazblaUA", "https://www.youtube.com/embed/DH9ZWmizdIc", "https://www.youtube.com/embed/cMKX2tE5Luk", "https://www.youtube.com/embed/MUY3GVByRUs"], "publish_date": 1513872000.0, "source": "https://ew.com", "summary": ""}