{"url": "https://pagesix.com/2018/06/09/the-troubling-signs-leading-up-to-anthony-bourdains-suicide/", "text": "Click to email this to a friend (Opens in new window)\n\nClick to share on Twitter (Opens in new window)\n\nClick to share on Facebook (Opens in new window)\n\nIt wasn’t like Anthony Bourdain to skip a good meal.\n\nWhen the star of “Parts Unknown” didn’t come down from his hotel room for a rustic French dinner Thursday night, it was the first sign something was very wrong.\n\n“We thought it was strange,” waiter Maxime Voinson told the New York Times Saturday, recalling Bourdain’s no-show the night before his suicide.\n\n“Mr. Ripert thought it was strange,” he added, referring to Eric Ripert, the renowned French chef who would find close friend Bourdain upstairs the next morning, hanged in his hotel bathroom.\n\nRipert, Bourdain and the crew of the CNN show had traveled early last week to the med­ieval village of Kayserberg in northeastern France to film an episode on Alsatian food.\n\nThey were staying at Le Chambard, a five-star hotel in a cozy, converted 18th-century mansion.\n\nPretty much every night, Bourdain and Ripert, the executive chef at Manhattan’s famed Le Bernadin, would dine together at the hotel’s quaint bistro, the Winstub, known for its foie gras and charcuterie.\n\n“Mr. Bourdain knew the chef, Monsieur Nasti,” the waiter told the Times, referring to chef Oliver Nasti.\n\n“He knew the kitchen,” the waiter recalled. “Maybe he went out and ate somewhere else, we said. But we didn’t think much of it.”\n\nBourdain and Ripert had also eaten breakfast together each morning, again at the Winstub’s big, distressed-wood tables.\n\n“Fresh bread, Viennese pastries, kouglof, panacota verrines, dried fruits,” the hotel lists as breakfast offerings. “Dried fruits, cold cuts, local cheese, fruit salad, butter, honey and a jar of Christine Ferber jam.”\n\nBut again, on Friday morning, Bourdain didn’t join him at the table.\n\n“His friend was waiting at breakfast,” the waiter told the Times.\n\n“And waiting and waiting.”\n\nAlso waiting, just down the road, was Bourdain’s camera crew.\n\nMaster butcher Christine Speisser told People magazine Saturday that the crew had set up to film at an outdoor market in nearby Strasbourg.\n\nSpeisser was to show Bourdain around the market, starting at 10 a.m.\n\n“For me, it was something exceptional,” she told People.\n\n“It was an honor to receive chef Bourdain.\n\n“People knew he was coming to the market, and everything was in place, ready to film,” she said.\n\n‘He is the last person in the world I’d imagine to do something like that.’\n\nBut back at the hotel, Bourdain wasn’t picking up his cellphone. It was 9:30 a.m.\n\nRipert got up from his table at the Winstub, where he had been set to choose from among the breads, pastries and local cheeses with his good friend.\n\nFrench authorities say a receptionist ­unlocked Bourdain’s hotel room door.\n\nInside, the 61-year-old TV host had used the belt of his hotel bathrobe to hang himself in his bathroom.\n\nRipert found him “unresponsive,” CNN reported.\n\nThere were no other signs of violence to Bourdain’s body, local prosecutor Christian de Rocquigny said Saturday.\n\n“There is no element that makes us suspect that someone came into the room at any moment,” the prosecutor added.\n\nDe Rocquigny also noted that the suicide appeared to have been an “impulsive act.”\n\nBlood was drawn from the body, and results of screenings for drugs or other toxins will follow in coming days.\n\n“This is solely to give the family more information about the motivations and the cause of death,” de Rocquigny said of the screenings.\n\n“We have no indication that he was consuming alcohol the days before his death or changed his behavior.”\n\n“A visionary,” Nasti, the Chambard chef, would say Saturday of his lost guest and friend, offering his condolences to Bourdain’s family “and all those around the world who he caused to dream.”\n\nOver at the outdoor market, Speisser continued to wait.\n\nThen a production assistant rushed to the scene, announcing, “There’s a big problem.”\n\n“It was like they were all struck by lightning,” Speisser told People magazine Saturday.\n\n“They all just sat on the ground.”\n\nAn hour would pass.\n\n“They didn’t say what was happening. They probably didn’t know everything,” Speisser’s friend Christelle Schenck, who had been there to help with the filming, told People.\n\nFinally, “apparently, they need to cancel, we were told,” Schenck said.\n\n“They said we’ll call you back.”\n\nThe crew packed up and left the market.\n\nReached by The Post on Saturday, Bourdain’s mother, Gladys, 83, a longtime Times editor, could barely speak.\n\n“It’s really too difficult,” she said.\n\n“He was an incredible guy. I really can’t talk about him … He was brilliant and sharp and funny,” she said.\n\n“He is the last person in the world I’d imagine to do something like that.”\n\nStill, by many accounts, including Ripert’s, Bourdain had not been himself.\n\nThere was exhaustion — and darkness.\n\nGladys Bourdain recalled Ripert telling her that “Tony had been in a dark mood these past couple of days,” Ripert told Bourdain’s mother Friday, according to the Times.\n\nAnthony Bourdain had reportedly kept a brutal work schedule filming “Parts Unknown” in the months before his death and was “absolutely exhausted,” a source told People.\n\n“​His travel schedule was grueling, and he often seemed quite beat-up from it, as anyone would be,” said the source, described by the magazine as having worked closely with Bourdain in the past year.\n\n“He’d put everything into the shoots and then go back to his room to ­isolate.”\n\nTributes to Bourdain continued to pour in from around the world Saturday.\n\nHe had been a devoted student of jiujitsu. Champion Lucas ­Lepri, who trained Bourdain at his home in the Hamptons, recalled how his student surprised him one day with a home-cooked meal inspired by Lepri’s native Brazil.\n\n“I was really moved because he cooked me a feijoada, which is a very special dish from Brazil, made with black beans and pork,” Lepri recalled.\n\n“You have to be really devoted to cook a good feijoada, because you need to simmer the beans all day.\n\n“Tony’s feijoada was incredible. He knew everything about Brazil and Brazilian food, and had traveled all over the country. He told me that the greatest Brazilian chefs came from Minas Gerais, my home state. He really moved me. I’ll never forget him.”\n\nJason Merder, Bourdain’s road manager from 2009 to 2013, remembered it wasn’t all fine dining with the celebrity chef.\n\n“One of the funniest things was Tony’s craving for Popeye’s chicken,” he recalled.\n\n“Every time we flew through Atlanta and had an hour between flights, I would get a look from him. And I was like, ‘All right, man, we’re going to Popeye’s.’\n\n“It happened every single day, and it didn’t matter what time of day it was.”\n\nMarilyn Hagerty was an octogenarian columnist for the Grand Forks Herald when her 2012 rave review for a new Olive Garden in her small South Dakota town went viral.\n\nAs trolls pounced, it was Bourdain who “came to my rescue,” she recalled.\n\nHe flew her to New York City, where they had coffee.\n\n“He said he came to realize that what I do is a reflection of how people eat,” she said.\n\nAnd he surprised her, too.\n\n“I found him to be not a wild, reckless character of a person, as I had expected,” Hagerty told Time magazine. “He was nothing but kind and a gentleman.”\n\nRelated Video Video length 1 minute 38 seconds 1:38 How Anthony Bourdain’s daughter and ex are grieving How Anthony Bourdain’s daughter and ex are grieving\n\nAdditional reporting by Georgett Roberts, Kirsten ­Fleming, Lauren Steussy, Dana Schuster and wire services", "images": ["https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=1200", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://pixel.wp.com/b.gif?v=noscript", "https://s0.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["June"], "canonical_link": "https://pagesix.com/2018/06/09/the-troubling-signs-leading-up-to-anthony-bourdains-suicide/", "title": "The troubling signs leading up to Anthony Bourdain’s suicide", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "It wasn’t like Anthony Bourdain to skip a good meal. When the star of “Parts Unknown” didn’t come down from his hotel room for a rustic French dinner Thursday night, it was the first sign something was very wrong.", "generator": "WordPress.com", "og": {"type": "article", "title": "The troubling signs leading up to Anthony Bourdain’s suicide", "url": "https://pagesix.com/2018/06/09/the-troubling-signs-leading-up-to-anthony-bourdains-suicide/", "description": "It wasn’t like Anthony Bourdain to skip a good meal. When the star of “Parts Unknown” didn’t come down from his hotel room for a rustic French dinner Thursday night, it was the first sign something…", "site_name": "Page Six", "image": {"identifier": "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=1200", "secure_url": "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-06-10T02:45:28+00:00", "modified_time": "2018-06-12T13:30:15+00:00", "publisher": "https://www.facebook.com/pagesix", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@pagesix", "site": "@pagesix", "text": {"title": "The troubling signs leading up to Anthony Bourdain’s suicide"}, "image": {"identifier": "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=664&h=441&crop=1", "alt": "Anthony Bourdain attends the Build Series to discuss The Balvenie's \"Raw Craft\" liqour at Build Studio in 2017.", "src": "https://nyppagesix.files.wordpress.com/2018/06/gettyimages-868225814.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "The troubling signs leading up to Anthony Bourdain's suicide", "description": "It wasn’t like Anthony Bourdain to skip a good meal. When the star of “Parts Unknown” didn’t come down from his hotel room for a rustic French dinner Thursday night, it was the first sign"}, "fb": {"pages": 261611377580503}, "parsely-metadata": "{\"post_id\":\"pagesix-4487655\"}", "keywords": "anthony bourdain,celebrity chefs,suicide", "google-site-verification": "kUaM_iOUItG-sfAnU_xqPqFG_0hl71TEfuta-jVPcSw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "Page Six", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for celebrity news, gossip, entertainment, pop culture, photos, video and more.", "msapplication-task": "name=Subscribe;action-uri=https://pagesix.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/cf931623da1839c0650e550eb1cb4819?s=16"}, "movies": [], "publish_date": 1528473600.0, "source": "https://pagesix.com", "summary": ""}