{"url": "https://www.etonline.com/burt-reynolds-and-sally-fields-love-story-a-look-back-109188", "text": "The late Burt Reynolds will be remembered in Hollywood for his iconic performances, but there's another enduring element to his legacy -- his love for co-star and ex-girlfriend Sally Field.\n\nThe often private actor became rather open about his admiration and love for the 71-year-old actress in his later years, speaking about their relationship as recently as this year. When asked by Hoda Kotb on Today in March who he would consider the love of his life, he confessed it was Field.\n\n\"I would say Sally,\" he admitted. \"Yeah, Sally Field. She was, well, she is still... I wanted her really bad for Smokey and they said, 'Well, she's not sexy.' And I said, 'You don't get it, talent is sexy.' And she's got that.\"\n\nThe two actors met on the set of the 1977 film Smokey and the Bandit. Field praised Reynolds in relation to the film, telling Closer Weekly, \"Burt was the most important influence that came into my life other than my children at the time.\"\n\nThe couple dated for five years after the film, and co-starred in three more films together, before calling it quits in 1982.\n\nField spoke about the split to Closer Weekly as well, saying, \"He gave me a feeling that I was sexy, and I wanted to be everything he ever wanted. [But] that was terrible because what happened is that I stopped existing. I dressed for him, looked for him, walked for him. He asked me to marry him many times, [but] I knew his heart wasn’t in it. We’d have ended up just feeling terrible.\"\n\nReynolds started opening up about his still-lingering love for Field while promoting the release of his book, But Enough About Me: A Memoir, in 2015. He told Vanity Fair that he had \"certain regrets and issues I've lived with.\" He addressed the rumors about his wealth at the time, including his costly divorce from Loni Anderson that dropped his net worth from $15 million to $5 million, but the revelation about Field being \"the love of my life\" loomed largest.\n\n\"I miss her terribly,\" he said. \"Even now, it's hard on me. I don't know why I was so stupid. Men are like that, you know. You find the perfect person, and then you do everything you can to screw it up.\"\n\nThe Boogie Nights star sat down with ET in 2015, complimenting Field. \"I do miss her. I think she was one of the most underrated actresses, you know?\" he shared. \"She was the best actress I ever worked with.\"\n\nHe echoed that sentiment again in 2016 to The Daily Mail, saying, \"I did four movies with Sally and spent five years with her. She was the love of my life and I screwed the relationship up. That sense of loss never goes away. I have no idea what Sally thinks about it. She could pick up the phone and speak to me but she never does. I spoke to her son recently. He said that his mom talks about me all the time. Maybe she’ll phone me one day. I’d love to have that conversation.\"\n\nField has been more reticent about her feelings regarding her relationship with Reynolds. She responded to the Vanity Fair interview, telling People at the time, \"I have no response, really, and any response I would have would belong to him.\"\n\nThe question was posed again during The Jess Cagle Interview on Sirius XM in 2016, where Field admitted they don't have much contact.\n\n\"We don't really talk to each other, no,\" she shared.\n\nField was then told, \"He often says you're the one that got away. He loves to say that,\" to which she responded, \"Well, yeah.\"\n\nThe two-time Oscar winner is releasing her own memoir on Sept. 18, titled In Pieces. She toldPeople, “I have this life that no one really knows… or at least I didn’t even know truly. This is incredibly raw and intimate and personal. [The memoir includes] things I never thought I wanted to say out loud.”\n\nDetails about the memoir have been scarce, and at the moment it remains unclear how much she will discuss her love life in the book.\n\nField released a touching statement about the death of her one-time romantic partner on screen and off on Thursday, saying, “There are times in your life that are so indelible, they never fade away. They stay alive, even forty years later. My years with Burt never leave my mind. He will be in my history and my heart, for as long as I live. Rest, Buddy.”\n\nReynolds died at age 82, with his family by his side. For more on the actor's legacy, watch the video below.\n\nRELATED CONTENT:\n\nBurt Reynolds Dead at 82\n\nArnold Schwarzenegger, Reba McEntire and More Stars React to Burt Reynolds' Death\n\nSally Field Says Ex-Boyfriend Burt Reynolds Will Be in 'My Heart for as Long as I Live'\n\nEXCLUSIVE: Burt Reynolds Makes Rare Public Appearance at 'Dog Years' Premiere This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sally_burt_gettyimages-105391154.jpg?h=2043a100&itok=Mlw1VZMB", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-12/gettyimages-476050887.jpg?h=c673cd1c&itok=OI2INJGA", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gctah300_0.jpg?h=35278c44&itok=wFHc-B3i"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sally_burt_gettyimages-105391154.jpg?h=2043a100&itok=Mlw1VZMB", "keywords": [], "authors": ["Elizabeth Stanton"], "canonical_link": "https://www.etonline.com/burt-reynolds-and-sally-fields-love-story-a-look-back-109188", "title": "Burt Reynolds and Sally Field's Love Story: A Look Back", "meta_data": {"article": {"opinion": "false"}, "title": "Burt Reynolds and Sally Field's Love Story: A Look Back | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/burt-reynolds-and-sally-fields-love-story-a-look-back-109188", "title": "Burt Reynolds and Sally Field's Love Story: A Look Back", "description": "The late movie icon had called his Oscar-winning co-star \"the love of my life.\"", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sally_burt_gettyimages-105391154.jpg?h=2043a100&itok=Mlw1VZMB", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The late movie icon had called his Oscar-winning co-star \"the love of my life.\"", "title": "Burt Reynolds and Sally Field's Love Story: A Look Back", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Elizabeth Stanton‍", "url": "https://www.etonline.com/burt-reynolds-and-sally-fields-love-story-a-look-back-109188", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/sally_burt_gettyimages-105391154.jpg?h=2043a100&itok=Mlw1VZMB"}, "description": "The late movie icon had called his Oscar-winning co-star \"the love of my life.\"", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, burt reynolds, Sally Field", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/f-043sc-HK4?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}