{"url": "https://www.stuff.co.nz/entertainment/film/101655347/a-photocall-for-jennifer-lawrences-red-sparrow-attracts-criticism", "text": "JLaw dressed to kill... or die of hypothermia? Actors Jeremy Irons, from right, Joel Edgerton, Jennifer Lawrence, Matthias Schoenaerts and director Francis Lawrence in a roof top photo call for the film Red Sparrow in London on Tuesday.\n\nThis promotional photo for the film Red Sparrow is being described as a \"quietly depressing\" example of everything that is wrong with Hollywood.\n\nPictures from the London media call show actress Jennifer Lawrence with co-stars Joel Edgerton, Jeremy Irons, Matthias Schoenaerts and director Francis Lawrence, on a hotel balcony in the middle of winter.\n\nNotice anything unusual about the photo?\n\nThe spy thriller's female film star wore a plunging Versace dress complete with thigh-high split.\n\nREAD MORE: Jennifer Lawrence slammed for shutting down Bafta host Joanna Lumley's compliment\n\nYet all the men are wrapped up against the cold. The maximum London temperatures this week were hovering around 3-9 degrees Celsius.\n\nIt is not being suggested the Oscar-winning actress was forced to dress the way she did, or wasn't allowed warmer clothes, but the group's clothing became a topic of discussion on social media.\n\nBritish journalist Helen Lewis identified what she called the \"quietly depressing\" double standard at play.\n\nThis is such a quietly depressing (and revealing) image. Not least because I've been outside today and it's bloody FREEZING. pic.twitter.com/BRnmgKJ5wY — Helen Lewis (@helenlewis) February 20, 2018\n\nOthers offered their opinions on Twitter.\n\ndid the topic of a coat ever come up? — Elizabeth Pears (@BizPears) February 20, 2018\n\nThe only rational reason for this picture is that her clothes spontaneously combusted and Liz Hurley happened to be passing on her way to a charity shop. — Melissa Cole (@MelissaCole) February 20, 2018\n\nAlso, who knows how many other things she's already said \"no\" to? This is the stuff that gets you branded \"difficult\" pic.twitter.com/X2yvFpmeUe — Helen Lewis (@helenlewis) February 20, 2018\n\nThe film Red Sparrow is based on the 2013 novel by the same name written by former CIA operative Jason Matthews. It follows Egorova (Lawrence), a prima ballerina who suffers an injury that ends her career. Egorova turns to spying at Sparrow School, a secret intelligence service that trains exceptional young people to use their minds and bodies as weapons. Egorova enters a life of espionage with a US CIA agent Nate Nash (Joel Edgerton) who tries to convince her that he's the only one she can trust, creating a battle of loyalties.\n\nLawrence hit the headlines last week when she announced that she intended to take a break from acting so she is able to help \"fix\" democracy in America.\n\n20th Century Fox Jennifer Lawrence is a Russian spy who falls for a CIA officer (Joel Edgerton) in this thriller based on the novel by Jason Matthews.\n\n\"I'm going to be working with this organisation as a part of (anti-corruption organisation) Represent.US... trying to get young people engaged politically on a local level,\" Entertainment Tonight reported. However, a representative for Lawrence later told Entertainment Weekly that she will return to work when one of several projects in development is ready to go.\n\nLawrence has repeatedly discussed temporarily stepping back from her acting career. She first talked about taking a break in September 2017 during an appearance on Today. \"I'm taking one. I don't have anything set for two years,\" she said.\n\nThe Silver Linings Playbook star, who has been working non-stop since 2010, also said in November 2017 that she wants to buy a farm and milk goats.\n\nAccording to IMDB, Lawrence currently has seven projects in development, including an untitled film with Amy Schumer, Ron Howard's Zelda Fitzgerald biopic Zelda, Adam McKay's Bad Blood, Luca Guadagnino's Burial Rites, and more.\n\nRed Sparrow will be in cinemas from 1 March.", "images": ["https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript", "https://resources.stuff.co.nz/content/dam/images/1/o/i/t/q/l/image.related.StuffLandscapeSixteenByNine.1420x800.1oitrn.png/1519198783340.jpg"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/o/i/t/q/l/image.related.StuffLandscapeSixteenByNine.1420x800.1oitrn.png/1519198783340.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.stuff.co.nz/entertainment/film/101655347/a-photocall-for-jennifer-lawrences-red-sparrow-attracts-criticism", "title": "The 'quietly depressing' photocall for Jennifer Lawrence's Red Sparrow", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "Jennifer Lawrence's efforts to promote the film Red Sparrow are being described as \"quietly depressing\".", "source": "Stuff", "og": {"description": "Jennifer Lawrence's efforts to promote the film Red Sparrow are being described as \"quietly depressing\".", "title": "The 'quietly depressing' photocall for Jennifer Lawrence's Red Sparrow", "url": "https://www.stuff.co.nz/entertainment/film/101655347/a-photocall-for-jennifer-lawrences-red-sparrow-attracts-criticism", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/o/i/t/q/l/image.related.StuffLandscapeSixteenByNine.1420x800.1oitrn.png/1519198783340.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "https://www.stuff.co.nz", "summary": ""}