{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/20/kim-and-kanye-named-their-new-baby-girl-chicago-west-and-the-city-is-loving-the-attention/", "text": "Kim tweeted the name Friday afternoon — and the jokes came immediately: Chicago West sounded like the name of a hospital. Would the child’s nickname be “Windy”? Would she always be cold? Kim Kardashian, one person argued, had just out-Kim Kardashianed herself.\n\nAD\n\nKim and Kanye named their baby Chicago West. She's 7 lbs, 6 oz and -14° with wind chill. — Comedy Central (@ComedyCentral) January 19, 2018\n\nBut, given that the nation’s third-largest city often finds itself in the news for other, less positive reasons, Chicagoans’ responses to the name of the newest Kardashian West child were mostly good-natured. Choose Chicago, the city’s tourism bureau, immediately approved.\n\nAD\n\nWe like it, Kimye.\n\n\n\nWelcome, Chicago West! — Choose Chicago (@ChooseChicago) January 19, 2018\n\n“We congratulate Kim and Kanye on the wonderful addition to their family,” Choose Chicago president David Whitaker said in a statement. “We realize this is a special time for them and we’re thrilled that they’ve chosen a name that represents a city we’re so proud to call home. And, we look forward to welcoming Chicago for her first visit.”\n\nThe Chicago Bears and Chicago White Sox also acknowledged the tribute.\n\nAD\n\nChicago Bears est. 1920\n\nChicago West est. 2018 — Chicago Bears (@ChicagoBears) January 19, 2018\n\nThe restaurant chain Portillo’s offered the child a lifetime supply of its Chicago-style eats — “redeemable by your parents until you can eat solid foods.”\n\nEven the Windy City’s self-proclaimed cynics begrudgingly voiced their appreciation for the moniker.\n\nSee, the cynic in me wants to be all 'that's a dumb name..... why Kimye' but me being from Chicago, I'm \"YASSSSSS KIMYE YASSSSSS\"\n\n\n\nNo one loves Chicago more than people from Chicago man.#ChicagoWest — Erik Zachary (@ErikZ) January 19, 2018\n\nNot to be outdone by real life, NBC’s array of Chicago-themed shows — “Chicago Fire,” “Chicago Med” and “Chicago PD” — jumped aboard the Chicago West train, joking it would be “coming soon” to the network.\n\nAD\n\nJokes aside, the name tribute brought some unexpected positive attention to a city that is perpetually used by politicians as a proxy for conversations about crime, policing and violence. In his first major television interview after taking office, President Trump last year highlighted Chicago’s homicide rate — which had reached a two-decade high — and suggested police and city officials were “not doing the job,” perhaps because they were “being overly politically correct.”\n\nAD\n\nTrump once threatened to “send in the Feds!” and said the city’s crime was “totally out of control,” two of about a half-dozen tweets he has posted over the past year about Chicago. All but one, a tweet welcoming the Chicago Cubs to the White House, were negative.\n\nIt was my great honor to welcome the 2016 World Series Champion Chicago @Cubs ⚾️ to the @WhiteHouse this afternoon. Congratulations! pic.twitter.com/ZZl3GrFFU9 — Donald J. Trump (@realDonaldTrump) June 28, 2017\n\nIt’s no wonder the city would welcome such a tribute, even in the form of a celebrity baby name. The announcement prompted a couple of Chicago’s suburbs to try to ride the coattails of the trending topic to promote themselves, with varying degrees of success.\n\nAD\n\nWe're thinking \"Oak Park\" could be a good nickname... 😀 — Visit Oak Park (@VisitOakPark) January 19, 2018\n\nWe’re not technically Chicago west, or West Chicago, but we think Chicago West would love our western Chicago suburb. Kanye and Kim could take her on a stroller ride along our Riverwalk. Bring North and Saint along, too. #ChicagoWest — NapervilleIL (@NapervilleIL) January 19, 2018\n\nAs The Washington Post’s Sonia Rao pointed out, Chicago might actually be a perfect name for Kim and Kanye’s baby for several reasons, not the least of which is Kanye’s deep ties to the city:\n\nAD\n\nAfter his parents divorced when he was 3, Kanye and his mother, Donda, moved to Chicago . He grew up in Oak Lawn and references the city in his work quite often, most prominently in the 2007 song, “Homecoming.” Featured artist Chris Martin sings about fireworks at Lake Michigan, and Kanye raps about meeting a girl named Windy, a blatant metaphor for the Windy City that could double as a nickname for his child. In case it was not clear, he later raps, “If you don’t know by now, I’m talkin’ ’bout Chi-town.” Rumor has it the Wests named their first daughter North because she represented a high point in their lives. Saint was reportedly chosen for their second child because he was a blessing after Kim’s difficult pregnancy. Chicago seems to be just as special to the couple.\n\nThe rapper Common, a frequent Kanye collaborator who also hails from Chicago, told TMZ that it was a fitting name, and not just because of Kanye’s devotion to Chi-town.\n\n“He deserves to be able to name his child Chicago, for as much as he does for our city, and as much as he loves our city,” Common told the celebrity news site. “And that’s a fresh name for a kid. I love it.”\n\nA spokesman for Chicago Mayor Rahm Emanuel — who also hosts the podcast “Chicago Stories” — did not immediately respond to a request for comment Saturday morning on the unexpected tip of the hat toward his city.\n\nRead more:\n\nAD", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9deae4bf-86c8-4f49-8658-ce5f2f4b2a30.png&w=90&h=90", "https://www.washingtonpost.com/resizer/I8vHRqztuz2UwDaOqjOwVDSu5Ig=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QWDDUZ7I345ARPEUYOXM6ZFK4M.jpg"], "top_img": "https://www.washingtonpost.com/resizer/I8vHRqztuz2UwDaOqjOwVDSu5Ig=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QWDDUZ7I345ARPEUYOXM6ZFK4M.jpg", "keywords": [], "authors": ["Amy B Wang", "National Politics Reporter Covering Presidential Campaigns"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/20/kim-and-kanye-named-their-new-baby-girl-chicago-west-and-the-city-is-loving-the-attention/", "title": "Kim and Kanye named their new baby girl Chicago West, and the city is loving the attention", "meta_data": {"description": "Chicago is the newest member of the Kardashian West clan, joining siblings North and Saint.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/01/20/kim-and-kanye-named-their-new-baby-girl-chicago-west-and-the-city-is-loving-the-attention/", "image": "https://www.washingtonpost.com/resizer/I8vHRqztuz2UwDaOqjOwVDSu5Ig=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QWDDUZ7I345ARPEUYOXM6ZFK4M.jpg", "title": "Kim and Kanye named their new baby girl Chicago West, and the city is loving the attention", "description": "Chicago is the newest member of the Kardashian West clan, joining siblings North and Saint."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Kim and Kanye named their new baby girl Chicago West, and the city is loving the attention", "description": "Chicago is the newest member of the Kardashian West clan, joining siblings North and Saint."}, "last_updated_date": "2018-02-26T00:18:13.597Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1516377600.0, "source": "https://www.washingtonpost.com", "summary": ""}