{"url": "people.com/tv/kim-kardashian-talks-khloe-kardashian-tristan-thompson-reconciliation/", "text": "Khloé Kardashian has put Tristan Thompson‘s cheating scandal behind her — but the drama is about to unfold on this season of Keeping Up with the Kardashians.\n\nCalling into On Air with Ryan Seacrest on Thursday, Kim Kardashian West revealed that some of the aftermath will be documented on season 15, which premieres Sunday. (Khloé, 33, and Thompson, 27, welcomed their first child together, daughter True, on April 12 — just two days after allegations surfaced that he cheated on her throughout her pregnancy.)\n\nGet push notifications with news, features and more.\n\n“I don’t want to give too much away, because we genuinely had those conversations and sometimes we were filming and sometimes we weren’t,” said Kim, 37. “It was more maybe when Khloé wanted her privacy and no cameras when she was in Cleveland going through that, [but] the sisters were still all filming and talking [about] how to approach it and what to do.”\n\nKim admitted the situation was a first for the famous family.\n\n“It was definitely new territory for us when you have a new baby coming into the world,” she said. “I think ultimately, we always want her to be happy, but it gets all clouded when there’s a baby, you know?”\n\n“Her motherly instincts kicked in and she has to do what makes her happy,” she added of Khloé standing by Thompson. “So we’ll support that.”\n\nReflecting on Khloé going into labor in Cleveland while the rest of the family was in Los Angeles, Kim said her sister wanted to keep the news under wraps.\n\n“[Khloé] didn’t want anyone to know she was in labor so my mom just left and got on a plane,” said Kim. “Then me and my other sisters get on another plane and we were like, ‘This is so stupid, we all need to be together and go through this!’ And it was so much drama getting there. You’ll see it all — season 15. … This season, honestly, it’s one of our best. It’s so crazy. And I’ve seen crazy.”\n\nRELATED VIDEO: Kris Jenner Struggles Not to Cry as She Talks About Khloé Giving Birth During Cheating Scandal\n\nKim has been most outspoken member of the family about the cheating scandal, previously calling it “so f—ed up,” which resulted in Thompson blocking her on Instagram. They’ve since smoothed things over, and Thompson officially unblocked her after she playfully teased him about it while they were celebrating Khloé’s birthday together in June.\n\nThough Khloé’s decision to reconcile with Thompson initially didn’t go over well with her famous family, a source told PEOPLE at the time that they “respect her decision.”\n\n“Everyone knows Khloé plans on staying with Tristan, so things have been civil so far,” said the source. “They still have opinions about Tristan’s bad behavior, of course, but no one wants to upset Khloé.”\n\nRELATED: Tristan Thompson Says Khloé Kardashian Knows His iPhone Passcode in Wake of Cheating Scandal\n\nLast week, another source told PEOPLE that it’s been a “tough learning lesson” for Thompson.\n\n“The whole family had to deal with the public’s perception of him and his relationship with Khloé changing dramatically,” said the source. “He also doesn’t fully ‘get’ that she’s been through this before [with ex-husband Lamar Odom], except that this time there’s a child involved.”\n\n“When he got with Khloé, he tried to adapt to the best of his ability but he struggled with being part of such a high-profile family and crossed lines he shouldn’t have,” added the source. “He wasn’t expecting such major backlash from the public and it’s been a lot for him to handle.”\n\nNevertheless, the source said everyone just wants the best for the couple and their baby girl.\n\n“The whole family is there to support both him and Khloé through everything,” said the source. “But they also need his commitment in order for the relationship to succeed. All of them are really hoping for a positive outcome for Khloé’s sake.”\n\nSeason 15 of Keeping Up with the Kardashians premieres Sunday at 9 p.m. ET on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkt_k-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkt_k-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kim-kardashian-talks-khloe-kardashian-tristan-thompson-reconciliation/", "title": "Kim Kardashian on Khloé Reconciling with Tristan Thompson: 'She Has to Do What Makes Her Happy'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kardashians,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,News,Tristan Thompson,TV", "news_keywords": "Kardashians,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,News,Tristan Thompson,TV", "description": "\"Her motherly instincts kicked in and she has to do what makes her happy,\" says Kim", "og": {"title": "Kim Kardashian on Khloé Reconciling with Tristan Thompson: 'She Has to Do What Makes Her Happy'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-kardashian-talks-khloe-kardashian-tristan-thompson-reconciliation/", "description": "Khloé Kardashian&nbsp;has put&nbsp;Tristan Thompson‘s cheating scandal behind her — but the drama is about to unfold on this season of&nbsp;Keeping Up with the Kardashians. Calling&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkt_k-2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/tv/kim-kardashian-talks-khloe-kardashian-tristan-thompson-reconciliation/", "description": "\"Her motherly instincts kicked in and she has to do what makes her happy,\" says Kim", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkt_k-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-kardashian-talks-khloe-kardashian-tristan-thompson-reconciliation/", "title": "Kim Kardashian on Khloé Reconciling with Tristan Thompson: 'She Has to Do What Makes Her Happy'", "description": "\"Her motherly instincts kicked in and she has to do what makes her happy,\" says Kim", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkt_k-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}