{"url": "https://en.wikipedia.org/wiki/The_Originals_(season_4)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode US viewers\n\n(millions)\n\n67 1 \"Gather Up the Killers\" Lance Anderson Michael Russo & Michael Narducci March 17, 2017 ( ) 401 1.05[14]\n\nPicking up five years since the defeat of Klaus and the expulsion of the Mikaelsons from New Orleans, their compound is in a state of disrepair and Marcel is the sole vampire king of the city. He welcomes all the un-sired vampires to New Orleans, only to find they pose an unexpected threat to his rule, leading him to seek counsel from an unlikely source. Meanwhile, Hayley closes in on the cure that will allow her to revive Elijah and the slumbering Mikaelsons, but she faces a final task that will force her to make a ruthless decision to abduct Keelin, a fellow werewolf. Elsewhere, Vincent learns of a potential threat to the coven when he begins investigating the disappearance of the son of a coven member.\n\n68 2 \"No Quarter\" Bethany Rooney Talicia Raggs & Michelle Paradise March 24, 2017 ( ) 402 0.99[15]\n\nNow awake, the Originals plan a mission to rescue Klaus; while Rebekah lures Marcel to the cemetery as a distraction, Elijah, Hayley, Freya and Kol track down Joshua and force him to point out where Marcel is keeping Klaus. In the meantime, Klaus is tormented by Camille's illusion, who is pressing him to find the strength to find a way to escape. Meanwhile, Vincent continues his search for Maxine's son and the search leads him to an abandoned house where Vincent is beset by a powerful blue light that he recognizes as the new threat to both him and other missing children.\n\n69 3 \"Haunter of Ruins\" Jeffrey Hunt Carina Adly Mackenzie & Declan de Barra March 31, 2017 ( ) 403 0.93[16]\n\nWith the Mikaelsons hiding out at a plantation on the outskirts of the city, Klaus demands one day to try to connect with his seven-year-old daughter Hope, whom they warmly bond over their stories about Klaus' past. Freya is still keeping the werewolf Keelin captive to make more werewolf antivenom despite Hayley's protests to let her go. Meanwhile, Vincent informs Marcel about the new evil called the Hollow, which a secret coven is abducting children to be used as a ritual sacrifice to bring upon the Hollow's pure form. Vincent also flashes back to years earlier with his wife Eva and how she persuaded him to summon the Hollow.\n\n70 4 \"Keepers of the House\" Joseph Morgan Beau DeMayo & Christopher Hollier April 7, 2017 ( ) 404 1.08[17]\n\nWhen Hope is overcome by the Hollow's evil spell, both Klaus and Marcel are forced to ask each other for help to assist Vincent's search for the missing children before they can be sacrificed and the Hollow's power will become invulnerable. Meanwhile, Freya re-captures Keelin and imprisons her at the church tower to further use her for other purposes, which include breaking into Marcel's penthouse to search for a spell instruction to solidify Freya's power. Hayley searches for a potential werewolf to learn more about the Hollow and of its power over Hope.\n\n71 5 \"I Hear You Knocking\" Chris Grismer Kyle Arrington April 14, 2017 ( ) 405 0.87[18]\n\nWith both Klaus and Marcel under the influence of the Hollow's power over them, they fight among their personal demons (Mikael and Elijah, respectively) to resist a confrontation where they are persuaded to fight to the death. Sofya tries to keep Marcel contained, as Vincent does the same in his search for a way to fight the Hollow's influence. Meanwhile, both Freya and Keelin continue to bond while working together to help out Klaus before a lethal confrontation begins with him and Marcel.\n\n72 6 \"Bag of Cobras\" Jesse Warn Michael Russo & Michelle Paradise April 28, 2017 ( ) 406 0.96[19]\n\nWhen they discover that The Hollow has employed a mysterious servant to do its bidding, Klaus and Elijah host an elaborate party at the restored Mikaelson compound in order to lure the new threat out and uncover its identity. Feeling a sense of responsibility for The Hollow's resurgence, Vincent agrees to help Klaus and Elijah in using his magic to help the Mikaelsons root out this latest threat. Meanwhile, after uncovering information about who may have been behind her parents' death, Hayley turns to Freya to help unlock her memories from that fateful day. Freya continues to keep a close eye on Keelin who shows up at the party, as does Sofya who has a quarrel with words with Klaus. Elsewhere, Marcel appears now confined in the same underground prison where he kept Klaus.\n\n73 7 \"High Water and a Devil's Daughter\" Charles Michael Davis Celeste Vasquez & Carina Adly MacKenzie May 5, 2017 ( ) 407 0.93[20]\n\nFreya places a protection spell on the compound when it's discovered that the Hollow's latest servant is on the loose, but it forces Klaus, Hayley and Hope to remain trapped inside with nowhere to go, as Marcel plots to befriend Hope in order to try to help him escape form his confinement. Meanwhile, Elijah takes matters into his own hands when he forces a reluctant Vincent to perform a dangerous ritual at the cemetery needed to strengthen their defense against the Hollow. Also, Freya enacts a risky plan by using Josh as bait which brings her face to face with their latest threat, but an unexpected twist involving her growing romantic feelings for Keelin leaves Freya's life hanging in the balance.\n\n74 8 \"Voodoo in My Blood\" John Hyams Talicia Raggs & Christopher Hollier May 12, 2017 ( ) 408 0.85[21]\n\nAfter being summoned by the witch's ancestors, Hayley and Klaus travel to the ancestral world plane of existence and come face to face with Davina, Klaus' former foe and the one person who claims that she holds the secrets to The Hollow's demise. Meanwhile, Elijah and Marcel are forced into an uneasy alliance where they meet up with Alaric (guest star Matt Davis) who has tracked down a crucial artifact that could help in their fight against The Hollow. But Sofya is one step ahead of them as she plots to steal the artifact for herself and the Hollow's minions.\n\n75 9 \"Queen Death\" Nicole Rubio Beau DeMayo May 19, 2017 ( ) 409 0.84[22]\n\nWhen The Hollow sends a terrifying message to Vincent, he must team up with Haley and Freya to embark on a desperate mission to stop the Hollow once and for all... even if it requires a heartbreaking sacrifice of Elijah whose life is slowly draining from him due to Sofya staking him with white oak thorns. Refusing to allow anyone in his family to pay the high price of defeating their enemy, Klaus makes a surprising alliance with Marcel and enacts a plan to take down Sofya that threatens to change the Mikaelson family forever.\n\n76 10 \"Phantomesque\" Daniel Gillies K.C. Perry & Kyle Arrington June 2, 2017 ( ) 410 1.03[23]\n\nKlaus requests that his estranged siblings, Rebekah and Kol, return to New Orleans to help him out in his stand against The Hollow which has now re-entered corporeal existence in the form of a young woman. Meanwhile, Freya recruits Hayley for a dangerous task to enter the dead Elijah's mind to repair the broken amulet containing his soul that will put both their lives at risk... but may be the sole means of saving someone they love. When the task proves more difficult then thought, Hope decides to help out Freya and Hayley. Elsewhere, tensions rise when Marcel leads a hunt for The Hollow and putting him on a collision course with the person he was least prepared to face. Also, as Kol continues to mourn the loss of Davina, he is forced to consider the lengths he'd go to see her again when he also comes face to face with the Hollow.\n\n77 11 \"A Spirit Here That Won't Be Broken\" Hanelle Culpepper Carina Adly MacKenzie & Michael Russo June 9, 2017 ( ) 411 0.89[24]\n\nWhen it's discovered that The Hollow is using a magical totem to fuel her power, Freya enlists Rebekah and Klaus to help locate and destroy it in order to hopefully awaken Elijah. Meanwhile, an ultimatum by The Hollow puts Kol at odds with his own siblings, while an unexpected run-in forces Marcel and Rebekah to confront the growing tension between them. Freya and Hayley manage to track down and arrives at the Hollow's residence only for both of them to fall victim to her power source which leaves Hayley comatose and fighting for her life and seeing visions of her lost husband Jackson who attempts to kill her, while Freya sees visions of Keelin who taunts her.\n\n78 12 \"Voodoo Child\" Michael Grossman Michelle Paradise & Christopher Hollier June 16, 2017 ( ) 412 1.01[25]\n\nWhen The Hollow now targets Hope, the most vulnerable Mikaelson, Klaus is forced to rely on Vincent who believes he can use The Hollow's own dark magic to defeat their enemy for good. Meanwhile, as Marcel worries that Vincent's plan might backfire, he decides on a deadly backup plan of his own by enlisting Sofya, Rebekah, and Elijah to help him make a stand against the evil entity. Elsewhere, after falling victim to The Hollow's manipulations, Hayley struggles to figure out Hope's future in New Orleans, while Freya must confront her own darkest fears; one of which is being in a romantic relationship with Keelin, and the other in figuring out how to save Hope from the Hollow's power.\n\n79 13 \"The Feast of All Sinners\" Bethany Rooney Michael Narducci June 23, 2017 ( ) 413 0.80[26]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/e/e6/The_Originals_S4_Poster.jpg/220px-The_Originals_S4_Poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Originals_(season_4)", "title": "The Originals (season 4)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}