{"url": "https://people.com/tv/dancing-with-the-stars-season-27-cast/", "text": "ABC just revealed the celebrities competing on the upcoming season of Dancing with the Stars — and the names may surprise you!\n\nThe cast of the 27th season of DWTS, along with their pro dancer partners, appeared on Good Morning America on Wednesday to discuss the upcoming season.\n\nGet push notifications with news, features and more.\n\nImage zoom\n\nHere are the season 27 pairings:\n\nBobby Bones and Sharna Burgess\n\nThe on-air radio personality hosts the nationally syndicated radio show The Bobby Bones Show in Nashville and is a New York Times best-selling author. Bones, a 38-year-old Arkansas native, recently served as a mentor on ABC’s American Idol earlier this year.\n\nIn 2017, he became the youngest person to be inducted into the National Radio Hall of Fame.\n\nImage zoom ABC/Lou Rocco\n\nDeMarcus Ware and Lindsay Arnold\n\nA former linebacker and defensive end for the Dallas Cowboys for nine seasons, Ware left the franchise in 2013 as the all-time leader in quarterback sacks. Playing for the Denver Broncos for three seasons, the Alabama native, 36, retired from the NFL in 2016.\n\nWare’s ex-wife, Taniqua Smith, previously suffered two miscarriages and later gave birth to their son, Omar, who was stillborn in 2006.\n\n“I feel Omar out there with me, watching over me and protecting me,” he told the New York Times in 2008. “Sometimes, when I’m tired on the field, and I feel like I can’t go anymore, I just think, what if he had one more breath? What if all three did?”\n\nThe couple adopted their daughter, Marley, in 2008. Ware and Smith divorced in 2012.\n\nMilo Manheim and Witney Carson\n\nManheim, who rose to fame as the star of this year’s Disney Channel original movie Zombies, will be season 27’s youngest competitor at 17 years old. During an appearance on Good Morning America on Tuesday, the actor described his experience thus far to host Michael Strahan.\n\n“Once we started getting going, it was nothing like I ever imagined,” he said of training with Carson. “It’s so much more difficult than I thought it would be.”\n\n“I’ll be dancing with her and thinking I’m doing a really good job, and then I’ll look back at the video and I just look terrible,” he added with a laugh.\n\n“I’m really excited,” Carson said. “This is my tenth season on the show and that’s a lucky number for me. He’s got the personality, he’s got some rhythm and that’s all we really need.”\n\n“We have so much fun,” added Manheim. “I look forward to it every day. … But she is tough.”\n\nImage zoom ABC/Lou Rocco\n\nDanelle Umstead and Artem Chigvintsev\n\nThe 46-year-old American Alpine skier and Paralympian competed in the 2018 Winter Paralympics earlier this year. Umstead, who suffers from a genetic eye condition called retinitis pigmentosa, began skiing 18 years ago after losing her eyesight and, later, losing her mother to colon cancer in 1999.\n\n“Through the sport of skiing, I’ve learned that anything is possible,” she said in her American Profile in 2014. “I can do anything; I just do it different from most people.”\n\nJoe “Grocery Store Joe” Amabile and Jenna Johnson\n\nThough he was sent home on night one of the most recent season of The Bachelorette, “Grocery Store Joe” (lovingly nicknamed because of his job as a produce buyer in Chicago) got another chance at love on Bachelor in Paradise.\n\nWhile on Paradise, Amabile dated Kendall Long. She broke up with him on Monday night’s episode, but during the reunion segment Tuesday, they revealed they’ve reconnected.\n\nAnd when it comes to love, Amabile will (hopefully!) get plenty of advice from partner Jenna Johnson, who recently got engaged to fellow pro, Val Chmerkovskiy.\n\nJohn Schneider and Emma Slater\n\nBest known for his portrayal of Beauregard “Bo” Duke in the comedy series The Dukes of Hazzard, Schneider, 58, has also found success as a country music star.\n\nIn June, he was sentenced to three days behind bars in the Los Angeles County Jail for failure to pay more than $150,000 in owed alimony payments to his ex-wife, Elvira “Elly” Schneider.\n\nA month later, Schneider said it was “unlikely” he would be able to comply with the conditions set forth by the court to have the charge dropped, and thus avoid his three-day jail sentence, so he instead effectively asked the court to simply lock him up for the entirety of that sentence.\n\n“I am willing and able to accept the punishment for my actions/inactions as to this matter and I request this court to impose such sentence without further delay,” he wrote in a letter to the judge in his case.\n\nImage zoom ABC/Lou Rocco\n\nNancy McKeon and Val Chmerkovskiy\n\nBest known for her role as Jo Polniaczek on the 1980 NBC sitcom The Facts of Life, McKeon, 52, also acted in Sonny with a Chance, Without a Trace, Touched by an Angel, and the TV movie Wild Hearts.\n\nLast week, during an appearance on Good Morning America, McKeon said Chmerkovskiy is “the most amazing partner, most patience than anybody I know and I’m so lucky.”\n\nImage zoom ABC/Lou Rocco\n\nMary Lou Retton and Sasha Farber\n\nThe retired gymnast, 50, was the first U.S. woman to win the individual all-around Olympic gold medal and is often considered the greatest American gymnast of all time.\n\nThe West Virginia native, who retired in 1986, was inducted into the International Gymnastics Hall of Fame in 1997.\n\nBorn with hip dysplasia, years of gymnastics further aggravated the condition and eventually led her to receiving a hip implant in 2008.\n\nFun Fact: Retton was the first female athlete to be pictured on the front of a Wheaties box!\n\nThe athlete is paired with pro dancer and newlywed Sasha Farber, who recently married his fellow pro Emma Slater in March.\n\nTinashe and Brandon Armstrong\n\nThe Zimbabwean singer-songwriter was a part of the musical group The Stunners, but has since found success as a solo artist. She recently released her third studio album, Joyride.\n\nThe 25-year-old, who was most recently linked to Kendall Jenner’s love interest, Ben Simmons, made headlines earlier this year after her younger brother Kudzai accused the NBA star of cheating on his sister with Jenner.\n\n“Never met you before in my life. days after u break my sis heart u do this… people all lied on her talking fake news about my sis *doing kardashian s— * u cheat on her w a Jenner,” wrote Kudzai in response to Page Six’s report.\n\nImage zoom ABC/Lou Rocco\n\nJuan Pablo Di Pace and Cheryl Burke\n\nBest known for his role as Fernando on Netflix’s Fuller House, the Argentinian actor-singer, 39, kickstarted his career by performing in a number of musicals in Europe, including Mamma Mia!\n\nNikki Glaser and Gleb Savchenko\n\nThe stand-up comedienne, 34, has been featured on Comedy Central and also had a role on Judd Apatow’s Trainwreck.\n\nImage zoom ABC/Lou Rocco\n\nAlexis Ren and Alan Bersten\n\nThe model was featured as Maxim‘s cover girl for the August 2017 issue. In 2017, Ren, who is known for her massive social media following, opened up about her eating disorder.\n\nIn an interview with Cosmopolitan, she said, “I kind of was just like, ‘I’m just going to be upfront with everyone.’ I have nothing to hide.”\n\nShe added, “Looking up to girls for inspo is a beautiful thing, but comparing yourself is what creates the anxiety and self-hatred. It’s really important that young girls know the difference.”\n\nEvanna Lynch and Keo Motsepe\n\nThe Irish actress, 27, rose to fame with her portrayal of Luna Lovegood in the Harry Potter films.\n\nIn 2016, Lynch hit the pavement in the New York City Half Marathon to raise awareness for the World Animal Protection.\n\nImage zoom ABC/Lou Rocco\n\nSo what was on the Ravenclaw’s playlist? “When the running gets tough, that’s when I need to put on my Disney soundtracks,” the actress told PEOPLE. “The ones where they defy the odds.”\n\nAny princess in particular? “Mulan, because she had to fight a war and pretend she was a man,” said Lynch. “It’s so inspiring, so motivating. You picture her jumping across the logs, getting in banging shape.”\n\nSeason 27 of Dancing with the Stars premieres Sept. 24 at 8 p.m. ET on ABC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_0590-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_05611-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_0582-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0556-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_0559-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_0587-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2F150280_ar_0569-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg", "keywords": [], "authors": ["Christina Dugan"], "canonical_link": "https://people.com/tv/dancing-with-the-stars-season-27-cast/", "title": "Dancing with the Stars Season 27: See the Full Cast", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Dancing with the Stars,News,TV", "news_keywords": "Dancing with the Stars,News,TV", "description": "The celebrity and pro dancer pairings were announced Wednesday on Good Morning America", "og": {"title": "Dancing with the Stars Unveils Season 27 Cast — Find Out Who's Competing!", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/dancing-with-the-stars-season-27-cast/", "description": "ABC just revealed the celebrities competing on the upcoming season of&nbsp;Dancing with the Stars — and the names may surprise you! The cast of the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/dancing-with-the-stars-season-27-cast/", "description": "The celebrity and pro dancer pairings were announced Wednesday on Good Morning America", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/dancing-with-the-stars-season-27-cast/", "title": "Dancing with the Stars Unveils Season 27 Cast — Find Out Who's Competing!", "description": "The celebrity and pro dancer pairings were announced Wednesday on Good Morning America", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2F150280_ar_0499-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}