{"url": "https://www.townandcountrymag.com/society/tradition/a21931232/prince-william-recreates-kate-middleton-photo-jordan/", "text": "Prince William is currently on a royal tour in the Middle East, and the royal is visiting Jordan, Israel, and Palestinian this week. Even though Kate Middleton isn't traveling with him, the Duchess is clearly on William's mind.\n\nToday, the Duke visited Jerash, an archaeological site and one of Jordan's most popular tourists spots. While touring the site, William stopped to pay tribute to Kate by recreating a sweet childhood photo taken when the Duchess was four years old. William posed at the same exact spot seen here in this Middleton family photo:\n\nIn the Middleton family photo taken at the historic site, a young Kate smiles with Michael Middleton and her sister, Pippa. The Middletons lived in Amman, Jordan in May 1984 through September 1986 after relocating due to Michael's job with British Airways. This sweet snap was released by the Middleton family and the Palace just before Will and Kate's royal wedding in 2011.\n\n\n\nSee how William recreated the photo by posing in the same spot today:\n\nWilliam in Jerash, Jordan on June 25, 2018 Shutterstock\n\nKensington Palace released a comparison of the two photos on their official Twitter:\n\n\n\nThe Duke of Cambridge visits Jerash, the same site that The Duchess of Cambridge visited, aged 4, with her sister and father when the family lived in Jordan. pic.twitter.com/PMoFrr4Snt — Kensington Palace (@KensingtonRoyal) June 25, 2018\n\nRoyal reporter Rebecca English also shared a BTS video of William's photo moment on Twitter. The footage reveals a large photo of the Middleton family portrait was at the spot when the Duke of Cambridge arrived:\n\nPrince William in one of those random moments you only get on a royal tour - standing at the rock where his wife played as a child 30 years earlier. And a giant picture of that moment for posterity! #RoyalVisitJordan pic.twitter.com/F4WSL8LZOe — Rebecca English (@RE_DailyMail) June 25, 2018\n\nKate, who is still on maternity leave after welcoming Prince Louis on April 23, has very sweetly been on her husband's mind throughout his visit to Jordan. On Sunday, William shared how sad Kate was to miss this trip. According to People, William revealed Kate “is very sorry she cannot be here with me so soon after the birth of our son Louis, but her family remembers very fondly the almost three years she spent here as a child when her father worked for British Airways in Amman.\"\n\nWilliam kicked off his tour in Jordan on Sunday with a warm welcome from Crown Prince Al Hussein bin Abdullah II. On his first day in Jordan, William and the Crown Prince watched England's world cup match versus Panama, which England won.\n\n\n\nWill will be on his royal tour of the Middle East until Thursday, June 28th. After this photo op in Jordan, William headed to Israel for a historic visit: the Duke of Cambridge is the first senior member of the British royal family to make an official visit to the country. We've got more on William's history-making tour of Israel right here.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Maggie Maloney", "Associate Digital Editor", "Maggie Maloney Is The Associate Editor At Town", "Country", "Elle Decor", "Where She Covers Style", "Beauty", "Jewelry", "The Many Members Of The Royal Family."], "canonical_link": "https://www.townandcountrymag.com/society/tradition/a21931232/prince-william-recreates-kate-middleton-photo-jordan/", "title": "Prince William Just Recreated One of Kate Middleton's Sweet Childhood Photos in Jordan", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Prince William Just Recreated One of Kate Middleton's Sweet Childhood Photos in Jordan", "description": "Will posed for a photo in the same spot the Middleton family was once photographed.", "url": "https://www.townandcountrymag.com/society/tradition/a21931232/prince-william-recreates-kate-middleton-photo-jordan/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-06-25 05:00:55", "published_time": "2018-06-25 04:25:00", "section": "Heritage", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Prince William Recreates Kate Middleton's Childhood Photo - Prince William Jordan Photo", "description": "Prince William recreated one of Kate Middleton's sweet childhood photos while visiting Jerash, one of the Jordan's famous archeological sites. Prince William is on a royal tour to Jordan,  Israel, and Palestinian this week.", "keywords": "prince william, kate middleton, prince william jordan, kate middleton jordan, kate middleton childhood photo, prince william jordan photo, kate middleton jordan photo, kate middleton family photo, middleton family jordan", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society,tradition", "sailthru.date": "2018-06-25T16:25:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/princewilliamkatemiddletonjordanphoto-1529938855.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Prince William Just Recreated One of Kate Middleton's Sweet Childhood Photos in Jordan", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1529871900.0, "source": "https://www.townandcountrymag.com", "summary": ""}