{"url": "https://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "text": "I did not see Harvey again until September 2013 when I was in Toronto for the premiere of “12 Years a Slave,” the first feature film I was in. At an after-party, he found me and evicted whoever was sitting next to me to sit beside me. He said he couldn’t believe how fast I had gotten to where I was, and that he had treated me so badly in the past. He was ashamed of his actions and he promised to respect me moving forward. I said thank you and left it at that. But I made a quiet promise to myself to never ever work with Harvey Weinstein.\n\nNot long after I won the Academy Award in 2014, I received an offer to play a role in one of the Weinstein Company’s forthcoming films. I knew I would not do it simply because it was the Weinstein Company, but I did not feel comfortable telling this to anybody. I turned down the role, but Harvey would not take no for an answer. While at Cannes, he insisted on meeting with me in person. I agreed to do it only because my agent would be present. In the meeting, he was honest about intending to persuade me to do his movie. I told him I simply did not feel it was a role I needed to play. He said he was open to making it bigger, more significant, maybe they could add a love scene. He said if I did this one for him, he would do another one for me — basically guaranteeing backing a star-vehicle film for me. I ran out of ways of politely saying no and so did my agent. I was so exasperated by the end that I just kept quiet. Harvey finally accepted my position and expressed that he still wanted to work with me at some point. “Thank you, I hope so,” I lied.\n\nAnd that was the last of my personal encounters with Harvey Weinstein. I share all of this now because I know now what I did not know then. I was part of a growing community of women who were secretly dealing with harassment by Harvey Weinstein. But I also did not know that there was a world in which anybody would care about my experience with him. You see, I was entering into a community that Harvey Weinstein had been in, and even shaped, long before I got there. He was one of the first people I met in the industry, and he told me, “This is the way it is.” And wherever I looked, everyone seemed to be bracing themselves and dealing with him, unchallenged. I did not know that things could change. I did not know that anybody wanted things to change. So my survival plan was to avoid Harvey and men like him at all costs, and I did not know that I had allies in this.\n\nFortunately for me, I have not dealt with any such incidents in the business since. And I think it is because all the projects I have been a part of have had women in positions of power, along with men who are feminists in their own right who have not abused their power. What I am most interested in now is combating the shame we go through that keeps us isolated and allows for harm to continue to be done. I wish I had known that there were women in the business I could have talked to. I wish I had known that there were ears to hear me. That justice could be served. There is clearly power in numbers. I thank the women who have spoken up and given me the strength to revisit this unfortunate moment in my past.\n\nOur business is complicated because intimacy is part and parcel of our profession; as actors we are paid to do very intimate things in public. That’s why someone can have the audacity to invite you to their home or hotel and you show up. Precisely because of this we must stay vigilant and ensure that the professional intimacy is not abused. I hope we are in a pivotal moment where a sisterhood — and brotherhood of allies — is being formed in our industry. I hope we can form a community where a woman can speak up about abuse and not suffer another abuse by not being believed and instead being ridiculed. That’s why we don’t speak up — for fear of suffering twice, and for fear of being labeled and characterized by our moment of powerlessness. Though we may have endured powerlessness at the hands of Harvey Weinstein, by speaking up, speaking out and speaking together, we regain that power. And we hopefully ensure that this kind of rampant predatory behavior as an accepted feature of our industry dies here and now.\n\nNow that we are speaking, let us never shut up about this kind of thing. I speak up to make certain that this is not the kind of misconduct that deserves a second chance. I speak up to contribute to the end of the conspiracy of silence.", "images": ["https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-facebookJumbo.jpg", "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-articleLarge.jpg?quality=75&auto=webp&disable=upscale"], "top_img": "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-facebookJumbo.jpg", "keywords": [], "authors": ["Lupita Nyong O"], "canonical_link": "https://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "title": "Opinion | Lupita Nyong’o: Speaking Out About Harvey Weinstein", "meta_data": {"article": {"published": "2017-10-19T23:07:40.000Z", "modified": "2017-10-20T02:04:39.000Z", "section": "Opinion", "tag": "Weinstein, Harvey", "opinion": "true", "content_tier": "metered"}, "robots": "noarchive", "articleid": 100000005505402, "nyt_uri": "nyt://article/6c67f001-d723-5fbd-bd37-a95bb4ee123b", "pubp_event_id": "pubp://event/11ac392188344243b799faf913eda38e", "description": "I don’t feel alone anymore. Let us never shut up about this.", "image": "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-facebookJumbo.jpg", "byl": "By Lupita Nyong’o", "thumbnail": "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-thumbStandard.jpg", "news_keywords": "Movies,Actor,Women and Girls,Sexual harassment,Harvey Weinstein", "pdate": 20171019, "og": {"url": "https://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "type": "article", "title": "Opinion | Lupita Nyong’o: Speaking Out About Harvey Weinstein", "image": {"identifier": "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-facebookJumbo.jpg", "alt": "Lupita Nyong’o in 2015."}, "description": "I don’t feel alone anymore. Let us never shut up about this."}, "twitter": {"url": "https://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "title": "Opinion | Lupita Nyong’o: Speaking Out About Harvey Weinstein", "description": "I don’t feel alone anymore. Let us never shut up about this.", "image": {"identifier": "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-videoSixteenByNineJumbo1600.jpg", "alt": "Lupita Nyong’o in 2015."}, "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/6c67f001-d723-5fbd-bd37-a95bb4ee123b"}}, "site": "@nytimes"}, "CG": "opinion", "CN": "harass-opinion", "CT": "spotlight", "PT": "article", "PST": "Op-Ed", "url": "https://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/6c67f001-d723-5fbd-bd37-a95bb4ee123b", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2017/10/19/opinion/lupita-nyongo-harvey-weinstein.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1508342400.0, "source": "https://www.nytimes.com", "summary": ""}