{"url": "https://www.elitedaily.com/p/michelle-obama-wished-barack-obama-happy-birthday-with-a-thoughtful-instagram-post-9998543", "text": "Michelle Obama and Barack Obama might be two of the most-missed former residents of the White House. Even though Obama's presidency ended over a year-and-a-half ago, the couple known for being #relationshipgoals has recently come back into the spotlight. With Obama's 57th birthday on Saturday, Aug. 4, Michelle took to social media to wish her husband a happy birthday with a sweet post about him. Michelle Obama wished Barack Obama happy birthday with a thoughtful photo and message to Obama on Instagram.\n\nLike any good significant other in the age of technology, Michelle made sure that she wished Obama a happy birthday on social media. The photo of Obama on Instagram and Twitter is accompanied by a short caption, but Michelle did anything but phone it in on this one. She posted what looks like a personal picture of Obama looking deep in thought as he overlooks a desert, and she wrote,\n\nHappy birthday @BarackObama! The view is always better with you.\n\nOK, you can now add \"expert at writing captions\" to Michelle's resume. I mean, c'mon, that post is sure to bring a smile to Obama's face when he sees it. Would you really expect anything less from this couple, though?\n\nThese two have proven time and again that they know how to keep their relationship going strong. Just look at their date night on the weekend of July 28, when the couple attended Beyoncé and JAY-Z's OTR II tour in Maryland. Not only did they make time to spend together at the show, but they spent that time doing what you should be doing at a Beyoncé concert: dancing! Seriously, the Obamas showed that they know how to move to the music, and the lucky concertgoers around them caught it all on video — but beware to get all the FOMO when you watch it.\n\nWhen it comes to birthdays, though, it really isn't shocking that Michelle knocked it out of the park with this post. Her short and sweet caption about how \"the view is always better\" with Obama is such a thoughtful message to her husband. The swoon-worthy birthday posts must be a hallmark of their relationship, because Obama also shared an IG post to his better half on Jan. 17 to celebrate Michelle's big day. He wrote,\n\nYou're not only my wife and the mother of my children, you're my best friend. I love your strength, your grace, and your determination. And I love you more each day. Happy Birthday, @MichelleObama\n\nIt's not only birthdays that bring out the sweet messages from this couple, though. Obama also wrote Michelle a Valentine's Day post on Feb. 14 that said she makes \"every day and every place better.\" I'm inclined to agree with the former POTUS on that one.\n\nReally, there is no shortage of examples of how these two celebrate and lift each other up on the most special days in their lives. I would like to imagine that they are also they kind of couple that leaves little love notes for each other around the house on a daily basis.\n\nOf course, I don't know if that's how the Obamas roll, but I do know they've perfected the art of the social media birthday post. Hopefully Obama is brainstorming Michelle's post for January!", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/8/4/fc2619df-b603-4bef-9882-db519407fbd9-getty-917433514.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/efcfe482-42db-44fb-b94f-2d1e84bc738c-getty-631566144.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/50113b53-ea7f-414f-9754-0e5cc11a9ed3-gossip-girl-social-image.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/8/4/fc2619df-b603-4bef-9882-db519407fbd9-getty-917433514.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/14/a659b8e0-0822-4393-bf29-e2b999e050e5-getty-1217817954.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/8/4/fc2619df-b603-4bef-9882-db519407fbd9-getty-917433514.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/michelle-obama-wished-barack-obama-happy-birthday-with-a-thoughtful-instagram-post-9998543", "title": "Michelle Obama Wished Barack Obama Happy Birthday With A Thoughtful Instagram Post", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/michelle-obama-wished-barack-obama-happy-birthday-with-a-thoughtful-instagram-post-9998543", "type": "article", "title": "Michelle Obama's Birthday Post To Barack Obama Shows They Are #RelationshipGoals", "description": "Michelle Obama and Barack Obama might be two of the most-missed former residents of the White House. Even though Obama's presidency ended over a year-and-a-half ago, the couple known for being #relationshipgoals has recently come back into the…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/8/4/fc2619df-b603-4bef-9882-db519407fbd9-getty-917433514.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Michelle Obama and Barack Obama might be two of the most-missed former residents of the White House. Even though Obama's presidency ended over a year-and-a-half ago, the couple known for being #relationshipgoals has recently come back into the…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}