{"url": "https://www.indiewire.com/2018/05/new-tv-trailers-fall-2018-best-worst-1201964592/", "text": "NBC, Fox, ABC, CBS, and the CW are laying out what to expect this year in terms of new TV shows, and we're ready for them.\n\nUpfronts Week means a glorious celebration of the new shows we can look forward to premiering this fall or later in the year. It also means a glorious opportunity to judge the shows in question, thanks to the trailers that are launched online.\n\nReviewing a show based on a trailer is a technically dicey proposition, which is why officially what we’re doing here is evaluating the trailers for each show. After all, communicating a premise and a raison d’etre is tougher than you might think within the span of three minutes or less — which is why we herald the trailers that do so well, and worry about the trailers that fail to excel at capturing our interest.\n\nBelow are IndieWire’s ongoing reviews of every trailer to debut…some of which do a better job than others at selling their shows.\n\nCW\n\n“Charmed”\n\nThe Power of Three is back! In this reboot of the ‘90s “Charmed” series, the clip sets up the how a trio of Latinx sisters discover that they’re actually witches, and damn powerful ones, especially when they combine forces. While the sneak peek is brief, it sets up a few expectations that compare favorably to the original series. First, there’s a certain relaxed charm (sorry) to the scene that helps when it comes to the suspension of disbelief required when combining magical tropes in modern times. Also, the three sisters are shackled, which doesn’t bode well for the peril they’ll most likely find themselves in, but hopefully that’s temporary. Also, the setting looks very similar to the old Halliwell household’s, which was never modern or hip, but instead promised possible hidden artifacts or “Antiques Roadshow” finds in the nooks and crannies. It’s a shame that this isn’t a trailer since that may have revealed far more about the show’s themes and tone, but so far, this isn’t a bad start, and we’re cautiously optimistic that this will slot in well with The CW’s other supernatural fare. Now if only they could get Love Spit Love’s cover version of “How Soon Is Now?” by The Smiths as its theme song again, and we’d be totally on board.\n\nGrade: B\n\n“All American”\n\nLike a blend of “Friday Night Lights” and “The O.C.,” this hourlong CW series about a star athlete from Compton who gets a full ride to a Beverly Hills high school looks like it might actually strike the right balance between the two. The brief glimpses of football look well-captured and there are plenty of topical issues being addressed in earnest fashion. (Though Spencer scaring his friend about picking him up in a red car with a red hat might be the best part.) On the other side, the young cast doesn’t show any initial weak spots and Taye Diggs should make for a convincing coach trying to win at all costs. If “All American” can balance out its teen drama with a serious take on what it’s like growing up black in America, this could be a keeper.\n\nPopular on IndieWire\n\nGrade: A-\n\nCBS\n\n“God Friended Me”\n\nGet ready for a lot of religion puns and comparisons to ABC’s now-canceled “Kevin (Probably) Saves the World,” as this hour-long drama starring Brandon Michael Hall (who starred in last fall’s “The Mayor,” another canceled ABC show) plays with the concept of what would happen if God started making his will be known to one young man… via social media. There are a lot of obvious millennial cliches thrown into the mix (you’d better believe Hall’s charaacter has a podcast) but the show does seem interested in engaging with the theological questions inspired by the premise, at least based on the screen time allotted to those moments in the trailer. However, this is also one of those show-the-entire-pilot-in-the-trailer type trailers, and if you can’t guess at least two of the biggest twists revealed, you haven’t watched any television before. There are promising elements here, but those big plot swings have us unconvinced that this one is blessed.\n\nGrade: C+\n\n“FBI”\n\nEven though they couldn’t have known it was coming, invoking the name of the FBI training location mere days after ABC pulled the plug on “Quantico,” it still seems like this is twisting the knife just a tad. But if this new Dick Wolf show is carrying the torch of Bureau-based TV offerings, this promises a much bigger show than Wolf procedurals usually go for. Much of what’s here is probably pilot spectacle, so it’ll be up to the cast to carry it from week to week. (More shows should use Dallas Roberts as a heavy. Fingers crossed he sticks around somehow.) Even though this first look has some focus to it, the big trick will be to keep this to some kind of lane — with attention spread across the legal, spy, and law enforcement fields, this is one that could get unwieldy real quick. For now, it should be an effective cog in the CBS machine.\n\nGrade: B-\n\n“Happy Together”\n\nThe most frustrating thing about this trailer is how well it sells the idea of a listless married couple whose lives are reinvigorated by the addition of a world-famous pop star to their home. But because this is a CBS comedy, it’s going to be the wholesome version of this idea, and this trailer gave no indication as to what happens once Connor (Felix Mallard) settles into happy companionship with this couple. Plus, in his few moments on screen, Damon Wayans Jr. appears to be going much, much bigger than his co-stars, which is a shame because Amber Stevens West has proven to be a stand-out and has decent chemistry in her time with Mallard. TV trailers need to sell not just what’s there, but what’s to come in the future, and unfortunately “Happy Together” simply lacks those answers.\n\nGrade: B\n\n“Magnum, P.I.”\n\nAh, who can resist a giant exploding truck careening over the guardrail of a winding mountain road? CBS looks to be following the same pattern that led the “Hawaii Five-O” reboot to a certain level of success: update the theme song, bring in a sleek sports car, and gender swap a member of the show’s central quartet. (Danno never did a full-on Felix Baumgartner space dive, though.) Quality is almost secondary to feel in TV revivals, and this one seems to have the helicopter-hopping acrobatics pretty well in hand. Jay Hernandez should fit well into this role and an extra dose of Zach Knighton is welcome. It’s a shame it won’t be on a show with more ambition than recapturing the network’s bygone era, but this will probably be one of CBS’ more watchable new series.\n\nGrade: B\n\n“Murphy Brown”\n\nThough not technically a trailer — “Murphy Brown” didn’t shoot a pilot, so there’s no episodic footage yet — this catch-up with the characters is still telling in its rhythms, jokes, and purpose. Murphy (Candice Bergen) makes it clear she came back to the news because of Trump, and (in what proves to be a recurring dose of meta-commentary) heavily implies the show is returning for the same reason. Some of the timing is a little slow, but that’s in line with what preexisting viewers will expect, and a few of the gags prove reason for optimism. (The “new guy’s” phone bit is terrible and tired, but Phyllis’ blackboard joke is aptly solid.) The closing montage of footage from the original series certainly holds up, so “Murphy Brown” could, in fact, be one of the few revivals to earn its second life. We’ll know more when a real trailer hits, but this is somewhat promising, at least.\n\nGrade: B\n\n“The Neighborhood”\n\nThe concept of a clueless-but-affable white guy from the Midwest moving his family into a predominantly black neighborhood in Los Angeles could be insightful and hilarious or go horribly offensive and flat. Here, Cedric the Entertainer’s comedic timing and relaxed gruffness as next-door neighbor Calvin — on his guard against possible racism from the new guy Dave (Josh Lawson) — already makes what could be a shaky premise far funnier. Overall, the energy and specificity of jokes already make this show look promising. But wait, there’s more! Fresh off “New Girl,” Max Greenfield will be taking over the role of Dave Johnson, which feels like the right fit for the show’s tone and chemistry. With the casting seen in the trailer, Cedric the Entertainer stole every scene. With Greenfield in the mix, he has a far better chance of holding his own than Lawson does. Block party!\n\nGrade: B+\n\nABC\n\n“Whiskey Cavalier”\n\nWe really, really, really, really wanted to like this, but let’s hope the humor evolves from what’s seen in the trailer. Scott Foley finally gets to be the leading man, and the lovelorn agent on assignment who has chemistry with another government agent (Lauren Cohan) would be intriguing if a) the dialogue was actually clever, and b) there was chemistry between the two leads. The jokes – both written and visual ones – are so very phoned in that they barely register. For now, the action elements are the only thing keeping us from not writing this off altogether, but come on, ABC. Don’t waste your boy like that.\n\nGrade: C\n\n“The Fix”\n\nIf Marcia Clark feels the need to fictionalize her life, why can’t she answer the question of what really happened between her and Christopher Darden? (#Clarden for life!) Beyond that niggling issue, it’s definitely a pleasure to see Robin Tunney on screen again, but it’s worth wondering if this show wouldn’t have been better served by being disconnected from any real world context, especially since this trailer does nothing to establish that there’s more to this premise than this one case. Based on what’s presented here, it’s hard to imagine “The Fix” having a long-term future.\n\nGrade: C+\n\n“The Rookie”\n\nAfter a contentious end to “Castle,” Nathan Fillion is back on ABC, and he’s traded his writer’s wit and pen for blunt sincerity and a mid-life crisis. Fillion can do drama: He handled the hero role on “Firefly” just fine and makes for a solid mysterious stranger in “A Series of Unfortunate Events.” But he’s playing sad sack John Nolan, a divorced dad who looks for salvation in the LAPD, with a bullied kid’s assurance — as if he’s convincing himself he belongs when he tells his boss the same thing. That doesn’t work so well in this trailer, and without a hint toward bubble-bursting levity, that kind of humorless gravity could prove grating over a full hour (let alone a season). If the trailer’s purpose was to make people forget “Castle,” mission accomplished, but ABC should think twice about that strategy in the long run.\n\nGrade: C+\n\n“The Kids Are Alright”\n\n“The Goldbergs” is a fun show, but at what point did ABC wake up and say to itself “we need another one of those?” (Technically two more, if you consider the “Goldbergs” spinoff also in the works.) “The Kids Are Alright” sets itself up for disaster immediately thanks to the premise (eight siblings in an on-screen family hasn’t worked since “Eight Is Enough”), and this trailer is way too packed with characters and storylines; there’s no easy emotional hook here, beyond the usual family feelings. Points, though, to Mary McCormack for owning her moments of screentime; the tough and jaded mom is an ABC staple at this point, but she might be able to provide her own spin on the trope.\n\nGrade: B-\n\n“Grand Hotel”\n\nOh great, another one of those trailers that goes on forever and seems to summarize the entire pilot. But that’s OK because this is the American adaptation of the Spanish series “Gran Hotel” (which can be streamed on Netflix), so maybe check that one out since it’s actually a period piece and has fun turn-of-the-century costuming and far more interesting character dynamics.\n\nThis “Grand Hotel” is contemporary and set in the last family-owned hotel in Miami. Fortunately, there are plenty of rooms for all the hooking up that happens. But it’s fair to say that there’s also pool-swimming, backstabbing and champagne-sipping. This is the typical “rich, sexy people with simmering secrets” sort of series that is alternately riveting and nauseating. While the gorgeous setting and chi-chi trappings look like a helluva lot of fun, there’s also some slut-shaming in the trailer that we really hope was taken out of context. While it’s great to see a more inclusive cast (hooray for Demian Bichir and a predominantly Latinx ensemble!), we can’t help wish that the staff were dressed as if they worked at the Marbella Hotel from “Jane the Virgin.”\n\nGrade: B-\n\n“A Million Little Things”\n\n#ThisIsFriends…? Down the all-caps lettering and sparkling background of the text cards in between the footage, “A Million Little Things” is such a calculated response to the NBC surprise runaway hit that it’s hard not to see much else in this preview. Although, having a cast filled with performers like Ron Livingston, Romany Malco, and James Roday certainly helps elevate an overly simple premise. Time will tell if this falls into the same “This is Us” oppressive seriousness trap. The trailer has it well on its way, but if this leans a little more this cast’s humor chops and less into what reads now as something of a suicide mystery, the show will be better off. Just make sure all these characters keep their Crock Pots unplugged.\n\nGrade: B-\n\n“Single Parents”\n\nWe are here for the Leighton Meester comedic renaissance. No, there’s not a catchy way to combine those words — Meestaissance? Renameester? just no — but that shouldn’t detract from the excitement of seeing the former “Gossip Girl” star in a new, adult-oriented sitcom. Sure, “Making History” died a quick death despite an enticing ensemble (and a strong start), but that wasn’t her fault. She was funny, quick, charming, and everything you look for in a lead. (Plus, she made a helluva guest star on “The Last Man on Earth.”)\n\nNow she’s back with “SNL” alum Taran Killam and “Everybody Loves Raymond” vet Brad Garrett to help parents rediscover who they are when they’re not mommy and daddy. That’s a good cause and a tricky line to walk on broadcast television (where plenty of viewers will see parenthood as a life-absorbing requirement, rather than one part of who they are). The trailer shows they’re willing to try and can find a few good jokes along the way. (“Your pants are making my baby cry,” for example.) Bring on the Leiaissance…nope, still not working. But whatever it’s called, we’re here for it.\n\nGrade: B+\n\nFox\n\n“Rel”\n\nBest-case scenario: The trailer above represents a quickly thrown together cut pulled only from a premise-establishing pilot — things will get better when they shoot more episodes that can build character (and humor) outside of the fact that Rel lost his wife and kids. Worst-case scenario: LilRel Howery’s comedic timing and leading man chops can’t support his own network sitcom, and his first series is an unfunny, outdated mess. These aren’t the kind of extremes one hopes to pull from the first look at a new show, but the above trailer for “Rel” is as redundant as it is underwhelming. The break-out star of “Get Out” and “The Carmichael Show” has proven to be a charming burst of life when he’s popping in and out of scenes, but this spot rests entirely on building sympathy for his character while he mocks a woman for wearing “loose boots.” “Rel” needs to get a whole lot funnier if it hopes to earn an ongoing slot in the Fox lineup.\n\nGrade: C+\n\n“The Cool Kids”\n\nIs it a good idea to let Leslie Jordan sneak in as the stand-out star of your show? Sure, if your show is about a gang of funny old people striving for relevance in a difficult world from the confines of their retirement home. Hopefully, Martin Mull and Artemis Pebdani (two consistently hilarious performers, the former of whom is a living legend) get more of a chance to stand out down the line. These sorts of shows are always reliant on their talents, and this trailer barely showcases them.\n\nGrade: B\n\n“Cosmos: Possible Worlds”\n\nThey’re only on screen for a half-second, but we’re going to assume this new season of “Cosmos” is all about tardigrades. But if for some reason, Neil deGrasse Tyson doesn’t get consumed “Sunshine”-style, like that last shot hints at, we’re in for another season of an exploration of the universe that stretches out and the impossible one that lies within the living things in our own backyards. There’s epic vistas, swirling galaxies, the greatest hits of the series that Carl Sagan once helmed (and that calls on his legacy on multiple occasions). It will be interesting to see if that “Possible” means this go-around will veer more into what we still don’t know about what lies beyond science’s reach. This doesn’t look radically different from the first Fox “Cosmos” season, but we’re ready to be surprised either way.\n\nGrade: B+\n\n“The Passage”\n\nWe’ve missed you Mark-Paul Gosselaar! Sign us up for what looks like some great chemistry between him and an adorable kid whose life he’s trying to save by keeping her away from government medical experimentation. Throw in a story about them on the run, the strange global pandemic that seems to create zombies, and some very questionable ethics, and this might be the best genre mashup involving zombies on broadcast TV since “iZombie.”\n\nGrade: B+\n\nSyfy\n\n“Deadly Class”\n\nIt’s hard to say what “Deadly Class” is the answer to. From this first look, it seems like “Marvel’s Runaways” plus a sharper edge, “X-Men” with a little more preppiness, or “The Magicians” with a few less f-bombs. Regardless of its most accurate comp, the pedigree behind the show (EPs The Brothers Russo) might just lend this series a sense of threat and danger that could separate it from other private-school superpower fare. Shaved heads, ominous entities made of static, and Benedict Wong? Could be a formula for a less traditional Syfy comics adaptation. At the very least, those uniform blazers look pretty sharp.\n\nGrade: B+\n\n“Nightflyers”\n\nSince this is only a teaser, from what we see, we’re intrigued. Based solely on the imagery and sound, it’s horror set in outer space with some pretty damn cool sets and cinematography. But we also know this is based on an old novella and series of short stories by George R.R. Martin, and that Gretchen Mol stars in it, so for now, we will be boarding this spacecraft.\n\nGrade: B+\n\nNBC\n\n“New Amsterdam”\n\n“How can we help?” Maybe don’t name your medical show the same title as a failed Fox drama from a decade ago? That bit of confusion aside, NBC’s new medical series “New Amsterdam” takes its name from the fictionalized hospital that provides the setting for all the drama. Although it is the oldest and most revered hospital in the nation, new medical director Dr. Max Goodwin (Ryan Eggold) wants to shake it up and get back to basics: being doctors and helping patients. Radical! Eggold was one of the best things on “The Blacklist” besides James Spader, and so he’s welcome back to our TVs as someone who will get plenty of screen time looking earnest and winning. Even if you didn’t guess the big twist a the end of the trailer though, this show looks like it’s set up to deliver some grade-A inspiration porn, complete with a portentous, heart-rending piano score. Given the success of “The Good Doctor,” that may play well. Besides, we’re thrilled for any reason for Freema Agyeman to show up.\n\nGrade: B-\n\n“Manifest”\n\nAt least this show isn’t waiting around to pull off a time jump. This “Lost”/”The 4400” mashup imagines a Theory of Relativity-adjacent setup where a plane filled with destiny-bound passengers make their arrival five years after they took off. As this trailer runs down all the life circumstances of what all these people on board missed while time went on without them, it’s a hodgepodge of premises of other dramas: the police officer who’s probably not ready to go back to work after a traumatic experience, parents looking for a cure for their child, a doctor trying to save humanity. (Maybe in later episodes, we’ll find out that one of the passengers is super into a niche hobby like amateur zoology or something?) Extra points for a double-meaning title, but a lot of this will certainly depend on execution.\n\nGrade: B\n\n“I Feel Bad”\n\nA trailer like this could be in danger of feeling extremely generic and dull… if its star wasn’t as dynamic and interesting as Sarayu Rao, who quickly proves her capabilities as the lead of a show about family life in the modern era. Beyond the diversity angle, it’s clear that there’s a very specific point of view driving this premise, which is essential when making this show stand out in the vast realm of family comedies already on the air. There’s more work to go, but this trailer does leave us intrigued about the series.\n\nGrade: A-\n\nThe CW trailers will be coming soon…\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F05%2Fnew-tv-trailers-fall-2018-best-worst-1201964592%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201964592", "https://www.indiewire.com/wp-content/uploads/2018/02/AudienceNetwork_Condor.png?w=117&h=82&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/05/cmd101g_0002r.jpg?w=609", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/uploads/2018/02/Amazon_VeryEnglishScandal.jpg?w=117&h=82&crop=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2018/05/cmd101g_0002r.jpg"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/05/cmd101g_0002r.jpg", "keywords": [], "authors": ["Liz Shannon Miller Hanh Nguyen Steve Greene Ben Travers", "Liz Shannon Miller", "Hanh Nguyen", "Steve Greene", "Ben Travers"], "canonical_link": "https://www.indiewire.com/2018/05/new-tv-trailers-fall-2018-best-worst-1201964592/", "title": "New Fall 2018 TV Trailers, Ranked From Worst to Best", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "NBC, Fox, ABC, CBS, and the CW are laying out what to expect this year in terms of new TV shows, and we're ready for them.", "news_keywords": "ABC, Trailers, Upfronts", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Ben Travers", "content_type": "Article", "post_id": 1201964592, "title": "New Fall 2018 TV Trailers, Ranked From Worst to Best", "published_at": "2018-05-15 13:29:21", "image": "https://www.indiewire.com/wp-content/uploads/2018/05/cmd101g_0002r.jpg?w=300", "comment_count": 0, "tags": "Upfronts", "topics": "Television", "body": "Upfronts Week means a glorious celebration of the new shows we can look forward to premiering this fall or later in the year. It also means a glorious opportunity to judge the shows in question, thanks to the trailers that are launched online.\r\n\r\nReviewing a show based on a trailer is a technically dicey proposition, which is why officially what we're doing here is evaluating the trailers for each show. After all, communicating a premise and a raison d'etre is tougher than you might think within the span of three minutes or less — which is why we herald the trailers that do so well, and worry about the trailers that fail to excel at capturing our interest.\r\n\r\nBelow are IndieWire's ongoing reviews of every trailer to debut...some of which do a better job than others at selling their shows.\r\n\r\n\r\nCW\r\n“Charmed”\r\nhttps://youtu.be/OsKXUXrMRRQ\r\n\r\nThe Power of Three is back! In this reboot of the ‘90s “Charmed” series, the clip sets up the how a trio of Latinx sisters discover that they’re actually witches, and damn powerful ones, especially when they combine forces. While the sneak peek is brief, it sets up a few expectations that compare favorably to the original series. First, there’s a certain relaxed charm (sorry) to the scene that helps when it comes to the suspension of disbelief required when combining magical tropes in modern times. Also, the three sisters are shackled, which doesn’t bode well for the peril they’ll most likely find themselves in, but hopefully that’s temporary. Also, the setting looks very similar to the old Halliwell household’s, which was never modern or hip, but instead promised possible hidden artifacts or “Antiques Roadshow” finds in the nooks and crannies. It’s a shame that this isn’t a trailer since that may have revealed far more about the show’s themes and tone, but so far, this isn’t a bad start, and we’re cautiously optimistic that this will slot in well with The CW’s other supernatural fare. Now if only they could get Love Spit Love's cover version of \"How Soon Is Now?\" by The Smiths as its theme song again, and we’d be totally on board.\r\nGrade: B\r\n\"All American\"\r\nhttps://www.youtube.com/watch?v=LGn8mkOgLwI\r\n\r\nLike a blend of \"Friday Night Lights\" and \"The O.C.,\" this hourlong CW series about a star athlete from Compton who gets a full ride to a Beverly Hills high school looks like it might actually strike the right balance between the two. The brief glimpses of football look well-captured and there are plenty of topical issues being addressed in earnest fashion. (Though Spencer scaring his friend about picking him up in a red car with a red hat might be the best part.) On the other side, the young cast doesn’t show any initial weak spots and Taye Diggs should make for a convincing coach trying to win at all costs. If \"All American\" can balance out its teen drama with a serious take on what it’s like growing up black in America, this could be a keeper.\r\n\r\nGrade: A-\r\nCBS\r\n\"God Friended Me\"\r\nhttps://www.youtube.com/watch?v=o6XfmicoyZw\r\n\r\nGet ready for a lot of religion puns and comparisons to ABC's now-canceled \"Kevin (Probably) Saves the World,\" as this hour-long drama starring Brandon Michael Hall (who starred in last fall's \"The Mayor,\" another canceled ABC show) plays with the concept of what would happen if God started making his will be known to one young man... via social media. There are a lot of obvious millennial cliches thrown into the mix (you'd better believe Hall's charaacter has a podcast) but the show does seem interested in engaging with the theological questions inspired by the premise, at least based on the screen time allotted to those moments in the trailer. However, this is also one of those show-the-entire-pilot-in-the-trailer type trailers, and if you can't guess at least two of the biggest twists revealed, you haven't watched any television before. There are promising elements here, but those big plot swings have us unconvinced that this one is blessed.\r\nGrade: C+\r\n\"FBI\"\r\nhttps://www.youtube.com/watch?v=O7oPFgb6VNE\r\n\r\nEven though they couldn't have known it was coming, invoking the name of the FBI training location mere days after ABC pulled the plug on \"Quantico,\" it still seems like this is twisting the knife just a tad. But if this new Dick Wolf show is carrying the torch of Bureau-based TV offerings, this promises a much bigger show than Wolf procedurals usually go for. Much of what's here is probably pilot spectacle, so it'll be up to the cast to carry it from week to week. (More shows should use Dallas Roberts as a heavy. Fingers crossed he sticks around somehow.) Even though this first look has some focus to it, the big trick will be to keep this to some kind of lane — with attention spread across the legal, spy, and law enforcement fields, this is one that could get unwieldy real quick. For now, it should be an effective cog in the CBS machine.\r\nGrade: B-\r\n\"Happy Together\"\r\nhttps://www.youtube.com/watch?v=s4Oqyv75His\r\n\r\nThe most frustrating thing about this trailer is how well it sells the idea of a listless married couple whose lives are reinvigorated by the addition of a world-famous pop star to their home. But because this is a CBS comedy, it's going to be the wholesome version of this idea, and this trailer gave no indication as to what happens once Connor (Felix Mallard) settles into happy companionship with this couple. Plus, in his few moments on screen, Damon Wayans Jr. appears to be going much, much bigger than his co-stars, which is a shame because Amber Stevens West has proven to be a stand-out and has decent chemistry in her time with Mallard. TV trailers need to sell not just what's there, but what's to come in the future, and unfortunately \"Happy Together\" simply lacks those answers.\r\nGrade: B\r\n\"Magnum, P.I.\"\r\nhttps://www.youtube.com/watch?v=qMmv9JFOEB0\r\n\r\nAh, who can resist a giant exploding truck careening over the guardrail of a winding mountain road? CBS looks to be following the same pattern that led the \"Hawaii Five-O\" reboot to a certain level of success: update the theme song, bring in a sleek sports car, and gender swap a member of the show's central quartet. (Danno never did a full-on Felix Baumgartner space dive, though.) Quality is almost secondary to feel in TV revivals, and this one seems to have the helicopter-hopping acrobatics pretty well in hand. Jay Hernandez should fit well into this role and an extra dose of Zach Knighton is welcome. It's a shame it won't be on a show with more ambition than recapturing the network's bygone era, but this will probably be one of CBS' more watchable new series.\r\nGrade: B\r\n\"Murphy Brown\"\r\nhttps://www.youtube.com/watch?v=LH_EiPC9FAM\r\n\r\nThough not technically a trailer — \"Murphy Brown\" didn't shoot a pilot, so there's no episodic footage yet — this catch-up with the characters is still telling in its rhythms, jokes, and purpose. Murphy (Candice Bergen) makes it clear she came back to the news because of Trump, and (in what proves to be a recurring dose of meta-commentary) heavily implies the show is returning for the same reason. Some of the timing is a little slow, but that's in line with what preexisting viewers will expect, and a few of the gags prove reason for optimism. (The \"new guy's\" phone bit is terrible and tired, but Phyllis' blackboard joke is aptly solid.) The closing montage of footage from the original series certainly holds up, so \"Murphy Brown\" could, in fact, be one of the few revivals to earn its second life. We'll know more when a real trailer hits, but this is somewhat promising, at least.\r\nGrade: B\r\n\"The Neighborhood\"\r\nhttps://www.youtube.com/watch?v=oG9Hc_vFlTM\r\n\r\nThe concept of a clueless-but-affable white guy from the Midwest moving his family into a predominantly black neighborhood in Los Angeles could be insightful and hilarious or go horribly offensive and flat. Here, Cedric the Entertainer’s comedic timing and relaxed gruffness as next-door neighbor Calvin — on his guard against possible racism from the new guy Dave (Josh Lawson) — already makes what could be a shaky premise far funnier. Overall, the energy and specificity of jokes already make this show look promising. But wait, there’s more! Fresh off “New Girl,” Max Greenfield will be taking over the role of Dave Johnson, which feels like the right fit for the show's tone and chemistry. With the casting seen in the trailer, Cedric the Entertainer stole every scene. With Greenfield in the mix, he has a far better chance of holding his own than Lawson does. Block party!\r\nGrade: B+\r\nABC\r\n\"Whiskey Cavalier\"\r\nhttps://www.youtube.com/watch?v=FhYQU5eWdCo\r\n\r\nWe really, really, really, really wanted to like this, but let’s hope the humor evolves from what’s seen in the trailer. Scott Foley finally gets to be the leading man, and the lovelorn agent on assignment who has chemistry with another government agent (Lauren Cohan) would be intriguing if a) the dialogue was actually clever, and b) there was chemistry between the two leads. The jokes - both written and visual ones - are so very phoned in that they barely register. For now, the action elements are the only thing keeping us from not writing this off altogether, but come on, ABC. Don’t waste your boy like that.\r\nGrade: C\r\n\"The Fix\"\r\nhttps://www.youtube.com/watch?v=dkJhX-ccM5k\r\n\r\nIf Marcia Clark feels the need to fictionalize her life, why can't she answer the question of what really happened between her and Christopher Darden? (#Clarden for life!) Beyond that niggling issue, it's definitely a pleasure to see Robin Tunney on screen again, but it's worth wondering if this show wouldn't have been better served by being disconnected from any real world context, especially since this trailer does nothing to establish that there's more to this premise than this one case. Based on what's presented here, it's hard to imagine \"The Fix\" having a long-term future.\r\nGrade: C+\r\n\"The Rookie\"\r\nhttps://www.youtube.com/watch?v=k9K06dCP-lc\r\n\r\nAfter a contentious end to \"Castle,\" Nathan Fillion is back on ABC, and he's traded his writer's wit and pen for blunt sincerity and a mid-life crisis. Fillion can do drama: He handled the hero role on \"Firefly\" just fine and makes for a solid mysterious stranger in \"A Series of Unfortunate Events.\" But he's playing sad sack John Nolan, a divorced dad who looks for salvation in the LAPD, with a bullied kid's assurance — as if he's convincing himself he belongs when he tells his boss the same thing. That doesn't work so well in this trailer, and without a hint toward bubble-bursting levity, that kind of humorless gravity could prove grating over a full hour (let alone a season). If the trailer's purpose was to make people forget \"Castle,\" mission accomplished, but ABC should think twice about that strategy in the long run.\r\nGrade: C+\r\n\"The Kids Are Alright\"\r\nhttps://www.youtube.com/watch?v=h5-0wgrWB9g\r\n\r\n\"The Goldbergs\" is a fun show, but at what point did ABC wake up and say to itself \"we need another one of those?\" (Technically two more, if you consider the \"Goldbergs\" spinoff also in the works.) \"The Kids Are Alright\" sets itself up for disaster immediately thanks to the premise (eight siblings in an on-screen family hasn't worked since \"Eight Is Enough\"), and this trailer is way too packed with characters and storylines; there's no easy emotional hook here, beyond the usual family feelings. Points, though, to Mary McCormack for owning her moments of screentime; the tough and jaded mom is an ABC staple at this point, but she might be able to provide her own spin on the trope.\r\nGrade: B-\r\n\"Grand Hotel\"\r\nhttps://www.youtube.com/watch?v=FsSMv0EcX04\r\n\r\nOh great, another one of those trailers that goes on forever and seems to summarize the entire pilot. But that’s OK because this is the American adaptation of the Spanish series “Gran Hotel” (which can be streamed on Netflix), so maybe check that one out since it’s actually a period piece and has fun turn-of-the-century costuming and far more interesting character dynamics.\r\n\r\nThis “Grand Hotel” is contemporary and set in the last family-owned hotel in Miami. Fortunately, there are plenty of rooms for all the hooking up that happens. But it’s fair to say that there’s also pool-swimming, backstabbing and champagne-sipping. This is the typical “rich, sexy people with simmering secrets” sort of series that is alternately riveting and nauseating. While the gorgeous setting and chi-chi trappings look like a helluva lot of fun, there’s also some slut-shaming in the trailer that we really hope was taken out of context. While it’s great to see a more inclusive cast (hooray for Demian Bichir and a predominantly Latinx ensemble!), we can’t help wish that the staff were dressed as if they worked at the Marbella Hotel from \"Jane the Virgin.\"\r\nGrade: B-\r\n\"A Million Little Things\"\r\nhttps://www.youtube.com/watch?v=Mz0dB5BInOk\r\n\r\n#ThisIsFriends...? Down the all-caps lettering and sparkling background of the text cards in between the footage, \"A Million Little Things\" is such a calculated response to the NBC surprise runaway hit that it's hard not to see much else in this preview. Although, having a cast filled with performers like Ron Livingston, Romany Malco, and James Roday certainly helps elevate an overly simple premise. Time will tell if this falls into the same \"This is Us\" oppressive seriousness trap. The trailer has it well on its way, but if this leans a little more this cast's humor chops and less into what reads now as something of a suicide mystery, the show will be better off. Just make sure all these characters keep their Crock Pots unplugged.\r\nGrade: B-\r\n\"Single Parents\"\r\nhttps://youtu.be/9vujgmSPp0c\r\n\r\nWe are here for the Leighton Meester comedic renaissance. No, there's not a catchy way to combine those words — Meestaissance? Renameester? just no — but that shouldn't detract from the excitement of seeing the former \"Gossip Girl\" star in a new, adult-oriented sitcom. Sure, \"Making History\" died a quick death despite an enticing ensemble (and a strong start), but that wasn't her fault. She was funny, quick, charming, and everything you look for in a lead. (Plus, she made a helluva guest star on \"The Last Man on Earth.\")\r\n\r\nNow she's back with \"SNL\" alum Taran Killam and \"Everybody Loves Raymond\" vet Brad Garrett to help parents rediscover who they are when they're not mommy and daddy. That's a good cause and a tricky line to walk on broadcast television (where plenty of viewers will see parenthood as a life-absorbing requirement, rather than one part of who they are). The trailer shows they're willing to try and can find a few good jokes along the way. (\"Your pants are making my baby cry,\" for example.) Bring on the Leiaissance...nope, still not working. But whatever it's called, we're here for it.\r\nGrade: B+\r\nFox\r\n\"Rel\"\r\nhttps://www.youtube.com/watch?v=xsUa5ObfCMs\r\n\r\nBest-case scenario: The trailer above represents a quickly thrown together cut pulled only from a premise-establishing pilot — things will get better when they shoot more episodes that can build character (and humor) outside of the fact that Rel lost his wife and kids. Worst-case scenario: LilRel Howery's comedic timing and leading man chops can't support his own network sitcom, and his first series is an unfunny, outdated mess. These aren't the kind of extremes one hopes to pull from the first look at a new show, but the above trailer for \"Rel\" is as redundant as it is underwhelming. The break-out star of \"Get Out\" and \"The Carmichael Show\" has proven to be a charming burst of life when he's popping in and out of scenes, but this spot rests entirely on building sympathy for his character while he mocks a woman for wearing \"loose boots.\" \"Rel\" needs to get a whole lot funnier if it hopes to earn an ongoing slot in the Fox lineup.\r\n\r\nGrade: C+\r\n\"The Cool Kids\"\r\nhttps://www.youtube.com/watch?v=T1-lhUD9YfE\r\n\r\nIs it a good idea to let Leslie Jordan sneak in as the stand-out star of your show? Sure, if your show is about a gang of funny old people striving for relevance in a difficult world from the confines of their retirement home. Hopefully, Martin Mull and Artemis Pebdani (two consistently hilarious performers, the former of whom is a living legend) get more of a chance to stand out down the line. These sorts of shows are always reliant on their talents, and this trailer barely showcases them.\r\n\r\nGrade: B\r\n\"Cosmos: Possible Worlds\"\r\nhttps://www.youtube.com/watch?v=DiVN-GFYLGo\r\n\r\nThey're only on screen for a half-second, but we're going to assume this new season of \"Cosmos\" is all about tardigrades. But if for some reason, Neil deGrasse Tyson doesn't get consumed \"Sunshine\"-style, like that last shot hints at, we're in for another season of an exploration of the universe that stretches out and the impossible one that lies within the living things in our own backyards. There's epic vistas, swirling galaxies, the greatest hits of the series that Carl Sagan once helmed (and that calls on his legacy on multiple occasions). It will be interesting to see if that \"Possible\" means this go-around will veer more into what we still don't know about what lies beyond science's reach. This doesn't look radically different from the first Fox \"Cosmos\" season, but we're ready to be surprised either way.\r\nGrade: B+\r\n“The Passage”\r\nhttps://www.youtube.com/watch?v=6rJ64J-gSbY&t=1s\r\n\r\nWe’ve missed you Mark-Paul Gosselaar! Sign us up for what looks like some great chemistry between him and an adorable kid whose life he’s trying to save by keeping her away from government medical experimentation. Throw in a story about them on the run, the strange global pandemic that seems to create zombies, and some very questionable ethics, and this might be the best genre mashup involving zombies on broadcast TV since “iZombie.”\r\nGrade: B+\r\n\r\n\r\nSyfy\r\n\"Deadly Class\"\r\nhttps://www.youtube.com/watch?v=uFqoqzyT4JQ&feature=youtu.be\r\n\r\nIt's hard to say what \"Deadly Class\" is the answer to. From this first look, it seems like \"Marvel's Runaways\" plus a sharper edge, \"X-Men\" with a little more preppiness, or \"The Magicians\" with a few less f-bombs. Regardless of its most accurate comp, the pedigree behind the show (EPs The Brothers Russo) might just lend this series a sense of threat and danger that could separate it from other private-school superpower fare. Shaved heads, ominous entities made of static, and Benedict Wong? Could be a formula for a less traditional Syfy comics adaptation. At the very least, those uniform blazers look pretty sharp.\r\nGrade: B+\r\n“Nightflyers”\r\nhttps://www.youtube.com/watch?v=CiaoqISBw4I&feature=youtu.be\r\n\r\nSince this is only a teaser, from what we see, we’re intrigued. Based solely on the imagery and sound, it’s horror set in outer space with some pretty damn cool sets and cinematography. But we also know this is based on an old novella and series of short stories by George R.R. Martin, and that Gretchen Mol stars in it, so for now, we will be boarding this spacecraft.\r\nGrade: B+\r\nNBC\r\n“New Amsterdam”\r\nhttps://www.youtube.com/watch?v=vY_5EvoL1Is\r\n\r\n“How can we help?” Maybe don’t name your medical show the same title as a failed Fox drama from a decade ago? That bit of confusion aside, NBC’s new medical series “New Amsterdam” takes its name from the fictionalized hospital that provides the setting for all the drama. Although it is the oldest and most revered hospital in the nation, new medical director Dr. Max Goodwin (Ryan Eggold) wants to shake it up and get back to basics: being doctors and helping patients. Radical! Eggold was one of the best things on “The Blacklist” besides James Spader, and so he’s welcome back to our TVs as someone who will get plenty of screen time looking earnest and winning. Even if you didn’t guess the big twist a the end of the trailer though, this show looks like it’s set up to deliver some grade-A inspiration porn, complete with a portentous, heart-rending piano score. Given the success of “The Good Doctor,” that may play well. Besides, we’re thrilled for any reason for Freema Agyeman to show up.\r\nGrade: B-\r\n\"Manifest\"\r\nhttps://www.youtube.com/watch?v=Dwc27Lsr1EY\r\n\r\nAt least this show isn't waiting around to pull off a time jump. This \"Lost\"/\"The 4400\" mashup imagines a Theory of Relativity-adjacent setup where a plane filled with destiny-bound passengers make their arrival five years after they took off. As this trailer runs down all the life circumstances of what all these people on board missed while time went on without them, it's a hodgepodge of premises of other dramas: the police officer who's probably not ready to go back to work after a traumatic experience, parents looking for a cure for their child, a doctor trying to save humanity. (Maybe in later episodes, we'll find out that one of the passengers is super into a niche hobby like amateur zoology or something?) Extra points for a double-meaning title, but a lot of this will certainly depend on execution.\r\nGrade: B\r\n\"I Feel Bad\"\r\nhttps://www.youtube.com/watch?v=XMCbf-oWDe0\r\n\r\nA trailer like this could be in danger of feeling extremely generic and dull... if its star wasn't as dynamic and interesting as Sarayu Rao, who quickly proves her capabilities as the lead of a show about family life in the modern era. Beyond the diversity angle, it's clear that there's a very specific point of view driving this premise, which is essential when making this show stand out in the vast realm of family comedies already on the air. There's more work to go, but this trailer does leave us intrigued about the series.\r\n\r\nGrade: A-\r\n\r\nThe CW trailers will be coming soon...", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/05/new-tv-trailers-fall-2018-best-worst-1201964592/", "title": "New Fall 2018 TV Trailers, Ranked From Worst to Best", "description": "NBC, Fox, ABC, CBS, and the CW are laying out what to expect this year in terms of new TV shows, and we're ready for them.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/05/cmd101g_0002r.jpg", "width": 609, "height": 440}}, "article": {"published_time": "2018-05-15T17:29:21+00:00", "modified_time": "2018-05-21T18:19:02+00:00", "author": "https://www.indiewire.com/author/hnguyen/", "section": "Television", "tag": "Upfronts"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": ["https://www.youtube.com/embed/OsKXUXrMRRQ?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/LGn8mkOgLwI?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/o6XfmicoyZw?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/O7oPFgb6VNE?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/s4Oqyv75His?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/qMmv9JFOEB0?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/LH_EiPC9FAM?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/oG9Hc_vFlTM?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/FhYQU5eWdCo?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/dkJhX-ccM5k?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/k9K06dCP-lc?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/h5-0wgrWB9g?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/FsSMv0EcX04?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Mz0dB5BInOk?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/9vujgmSPp0c?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/xsUa5ObfCMs?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/T1-lhUD9YfE?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/DiVN-GFYLGo?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/6rJ64J-gSbY?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&start=1&wmode=transparent", "https://www.youtube.com/embed/uFqoqzyT4JQ?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/CiaoqISBw4I?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/vY_5EvoL1Is?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Dwc27Lsr1EY?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/XMCbf-oWDe0?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1526405361.0, "source": "https://www.indiewire.com", "summary": ""}