{"url": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "text": "Japanese fashion label\n\nComme des Garçons is a Japanese fashion label founded and headed by Rei Kawakubo in Tokyo and Place Vendôme in Paris, the city in which they show their main collections during Paris Fashion Week and Paris Men's Fashion Week.[1] The Japanese flagship store is in Aoyama, Tokyo's high fashion district. The company also has concept stores Trading Museum Comme des Garçons and 10 Corso Como Comme des Garçons in Tokyo, and stores in Kyoto, Osaka and Fukuoka. Worldwide they have traditional Comme des Garçons stores in Rue du Faubourg St-Honoré in Paris and on West 22nd Street in New York City, as well as stores in Hong Kong, Beijing, Bangkok, Seoul, Singapore, Melbourne and Manila.\n\nSince 2004, Comme des Garçons has developed a market-based department store concept stocking its main collections, its other brands such as Shirt and Play, as well as fashions by other designers. Its original market store, called Dover Street Market, is in London. In 2010, the company opened I.T Beijing Market Comme des Garçons,followed by a new market store in Ginza, Tokyo, in 2012 and New York City in 2013, as well as Berlin and Los Angeles.[2]\n\nHistory [ edit ]\n\nThe label was started in Tokyo by Rei Kawakubo in 1969 and established as a company Comme des Garçons Co. Ltd in 1973. It is written in Japanese as コム・デ・ギャルソン (Komu de Gyaruson), and translates as \"like boys\" in French.[3] The brand's name was inspired by Francoise Hardy's 1962 song Tous les garçons et les filles, particularly from the line Comme les garçons et les filles de mon âge.[4] The brand became successful in Japan in the 1970s; a menswear line was added in 1978. The year 1981 saw Comme des Garçons's debut show in Paris. Kawakubo's heavy use of black, as well as distressed fabrics and unfinished seams, were viewed negatively by French critics.[5] Throughout the 1980s, Comme des Garçons's clothes often were associated with a 'distressed' and 'punk' oriented style. Comme des Garçons continued to produce unusual styles through the 1990s, many of which were disliked by experts but by 2004 the company had grown Homme des Garçons Deux and Comme des Garçons Shirt, are all handmade. This is because Comme des Garçons adamantly values the quality of hand-made garments, reflected in the more expensive price and longevity of their products. Play, the company's luxury casual streetwear line, is mainly produced in Japan, Spain, and Turkey, with France's Play factory still utilizing many hand-made procedures as opposed to Japan, Spain, and Turkey's production line factory. This is because France's factory also produces hand-made only lines, including Tricot Comme des Garçons, Comme des Garçons Homme Plus Evergreen, and Junya Watanabe Comme Des Garçons. It is believed that all fabrics are produced in Japan, but some China and Australia sold pieces are hand-finished in France for quality control purposes (distinguishable by the hand stitched heart emblem). In an article for Business of Fashion in April 2017, Tim Blanks reported generated revenue for CDG and its affiliates as \"over $280 million a year\".[6]\n\nFashion [ edit ]\n\nComme des Garçons collections are designed in the Comme des Garçons studio in Aoyama, Tokyo and are manufactured in Japan, France, Spain, and Turkey. The company has over the years recurrently associated itself with the arts and cultural projects internationally. The 1997 spring-summer collection, often referred to the \"lumps and bumps\" collection, which contained fabric in bulk and balls on the garments, led to a collaboration, also in 1997, between Rei Kawakubo and New York-based choreographer Merce Cunningham called \"Scenario\". The 2006 autumn/winter collection dealt with the concept of the \"persona\",[7] the different ways we present ourselves to the world. Fusing tailored menswear with more feminine elements such as corsets and flower printed dress fabrics, \"Persona\" was another collection that combined the feminine with the masculine by Comme des Garçons.\n\nJunya Watanabe[8][9] and, as of recently, Tao Kurihara[10][11] have started their own sub-labels under the Comme des Garçons name to much acclaim. Both also were involved in designing for the casual women's knitwear line \"Comme des Garçons Tricot\".\n\nComme des Garçons dress\n\nComme des Garçons have collaborated with various other labels over the years including Fred Perry, Levi's, Converse All Star, Speedo, Nike, Moncler, Lacoste, Cutler and Gross, Chrome Hearts, Hammerthor,[12] S. N. S. Herning, Louis Vuitton, Supreme, and many others. Comme des Garçons and H&M collaborated on a collection which was released in the fall of 2008.[13][14]\n\nNotably, Björk wears Comme des Garçons in the music video for \"Isobel\". Other celebrities who have worn Comme des Garçons include Lady Gaga, Matt Bellamy, Alexander McQueen, Krikor Jabotian, Chloë Sevigny, Kanye West, Usher, Tilda Swinton, Herb Ritts, Tatiana Sorokko, Karl Lagerfeld, Heidi Albertsen, Mary-Kate Olsen, Vincent Ng, Selma Blair, Leila Aldik, Drake, Joe Jonas, Ellen DeGeneres, ASAP Rocky, 2 Chainz, Frank Ocean who devoted a song to and her. John Waters, who devoted a chapter of his 2010 book Role Models to Comme des Garçons and Rei Kawakubo. Swedish musician Jonna Lee collaborated with Comme des Garçons in the creation of her audiovisual album Everyone Afraid to Be Forgotten, where the fashion house designed the costumes for the film.\n\nExhibitions [ edit ]\n\nAfter the Paris début, Comme des Garçons exhibited photographs by Peter Lindbergh at the Centre Georges Pompidou in Paris in 1986.[15] In 1990, they held an exhibition of sculpture. The year 2005 saw an exhibition in Shinjuku, Tokyo of Comme Des Garçons advertising and graphic designs.\n\nIn August 2010, Comme des Garçons opened a 19,000 square feet (1,800 m2), six-level flagship store in Seoul, South Korea, featuring a branded art-exhibition space, the company's first outside Japan.[16]\n\nComme Des Garçons Play [ edit ]\n\nCommonly known for its heart-shaped logo with two eyes, Comme Des Garçons Play is Comme Des Garçons' casual luxury line. It is a more accessible variation of Comme Des Garcons's other lines. Directed at the younger market, Play is Comme Des Garcon's best selling clothes line.\n\nAfter Play made its debut on celebrities such as Kanye West, Pharell Williams, and Justin Timberlake,[17] Play introduced collaborations with Nike, Jordan, and Louis Vuitton,[18] and was quickly viewed as a prominent international fashion brand. Perhaps Comme Des Garçons best-recognized branding is the Filip Pagowski-designed heart logo stitched onto Play pieces. Dover Street Market Group carries both Play products and Comme Des Garçons's higher-end lines.\n\nPerfume [ edit ]\n\nComme des Garçons also produces a line of agendered fragrances, most of which are unconventional in the world of perfume, in the same spirit as the label's garments.[19]\n\nThe company released its first fragrance, Comme des Garçons, in 1994.[20] 1998 saw the release of Comme des Garçons's first \"anti-perfume\" Odeur 53,[21] a blend of 53 non-traditional notes to create a modern and striking scent.[22] Some of these notes are: oxygen, flash of metal, wash drying in the wind, mineral carbon, sand dunes, nail polish, cellulose, pure air of the high mountains, burnt rubber, and flaming rock. Director John Waters and architect Stephen Alesch both wear the fragrance.[23][24]\n\nComme des Garçons released the perfume for the Luxe series \"Champaca\", for which artist Katerina Jebb produced the visuals.\n\nSince 2002, the perfume line joined Puig company to become part of its catalogue of fragrances.[25] The company Puig owns a partial license for Comme des Garçons fragrances under company of, Comme des Garçons Parfums.[26] Since granting a partial license for fragrances to Puig, Joffe has also created a division of fragrances within the Comme des Garçons company itself named, Comme des Garçons Parfums Parfums.[27]\n\nComme des Garçons developed a unisex fragrance, G I R L, with Pharrell Williams, released on 28 August 2014.[28] Artist KAWS designed the bottle.[29]\n\nComme des Garçons lines [ edit ]\n\nDesigned by Rei Kawakubo\n\nComme des Garçons – main womenswear line (since 1969)\n\nComme des Garçons Noir – black-dominated womenswear collection (since 1987)\n\nComme des Garçons Comme Des Garçons – (a.k.a. 'Comme Comme') womenswear (since 1993)\n\nComme des Garçons Homme Plus – main menswear line (since 1984)\n\nComme des Garçons Homme Plus Sport – sporty subline of Homme Plus\n\nComme des Garçons Homme Plus Evergreen – subline of Homme Plus, re-invented items from past collections (since 2005)\n\nComme des Garçons Homme Deux – formal tailored menswear (since 1987)\n\nComme des Garçons SHIRT – shirt-dominated collection (since 1988)\n\nComme des Garçons SHIRT Girl\n\nComme des Garçons SHIRT Boy(s) (since 2014, discontinued 2019)\n\nComme des Garçons Girl (Since 2015)\n\nPlay Comme des Garçons – casual streetwear for younger men and women with bug-eyed heart logo (collaboration with New York City graphic artist Filip Pagowski )\n\nBLACK Comme des Garçons – unisex, lower-priced line, initially started due to the recession in 2008. also sold in signature BLACK pop-up shops.\n\nDesigned by Junya Watanabe\n\nComme des Garçons Homme – menswear Japanese line (since 1978)\n\nComme des Garçons Robe de Chambre – womenswear Japanese line (discontinued)\n\nJunya Watanabe Comme des Garçons – womenswear (since 1992)\n\nJunya Watanabe Comme des Garçons Man – menswear (since 2001)\n\nJunya Watanabe Comme des Garçons Man Pink – menswear items for women (discontinued)\n\nDesigned by Tao Kurihara\n\nTao Comme des Garçons – womenswear (launched 2005, discontinued after spring 2011)\n\nTricot Comme des Garçons – womenwear knits\n\nDesigned by Fumito Ganryu\n\nGanryu Comme des Garçons – asexual street style label, Ganryu was a former pattern-maker at Junya\n\nDesigned by Kei Ninomiya\n\nNoir Kei Ninomiya – womenswear (launched in 2013), Ninomiya was a former pattern-maker at CdG\n\nAccessories\n\nComme des Garçons Edited – special items for Edited shops in Japan\n\nComme des Garçons Pearl – jewelry (since 2006)\n\nComme des Garçons Parfum – (since 1994)\n\nComme des Garçons Parfum Parfum\n\nComme des Garçons Wallet\n\nSpeedo Comme des Garçons – swimwear collaboration (since 2005)\n\nHammerthor Comme des Garçons Shirt – underwear collaboration (since 2007)\n\nOthers\n\nComme des Garçons Peggy Moffitt\n\nComme des Garçons Six – bi-annual magazine (from 1988 to 1991)\n\nCollaborations\n\nStores [ edit ]\n\nAoyama Store\n\nSignature Comme des Garçons boutiques are located in London (Dover Street Market), Paris, New York City,[30] Beijing,[31] Hong Kong,[32] Seoul, St. Petersburg, Tokyo (2x), Kyoto, Osaka, Fukuoka. The company also maintains concessions at select department stores, such as Isetan. In Paris, a Comme des Garçons perfumery can be found at 23 Place Marché St-Honoré.\n\nComme des Garçons opened the first of their 'Guerrilla' stores in 2004 in Berlin.[33] The aim of the Guerrilla stores is to be open for only one year[34] and to spend a minimal amount of money on the interiors.[35] The stores also are to be located away from fashionable hubs and districts of a city. Comme des Garçons Guerrilla stores have been opened (and subsequently closed) in Reykjavik, Warsaw, Helsinki, Singapore, Stockholm, and Athens, amongst others. In July 2007, a Guerrilla Store opened in the Achrafieh district of Beirut, Lebanon, and in February 2008, a Guerrilla Store opened in downtown Los Angeles, the first in the United States.[36] In November 2008, they opened another Guerilla store in the west end of Glasgow. 2004 also saw the opening in London of Dover Street Market (DSM),[37][38] a multilevel store conceptualised by Rei Kawakubo.\n\nIn December 2009, Comme des Garçons opened a 4,400 square feet (410 m2) store in Hong Kong called Under The Ground. Hong Kong also has had a Guerrilla store opened and closed in previous years, run by Silly Thing Hong Kong.[39] In March 2012, Comme des Garçons opened a store in One Rockwell, Rockwell Center, Manila. Also, the first Dover Street Market in Japan opened in Ginza.[40] In December 2013, Dover Street Market in New York City opened.[41]\n\nMuseum exhibition in 2017 [ edit ]\n\nStarting in May 2017, Rei Kawakubo will be the subject of one of the Metropolitan Museum of Art's fashion exhibitions in New York.[42] Vogue magazine and the Metropolitan Museum in New York have announced that the exhibition dedicated to Kawakubo is scheduled for its 2017 season between 4 May 2017 and 4 September 2017. In an interview with Vogue in April 2017, Andrew Bolton, the curator for the Kawakubo exhibit at the Met stated: \"I really think her influence is so huge, but sometimes it's subtle. It's not about copying her; it's the purity of her vision... Rei was really involved in the design of the exhibit\".[43] Bolton also stated that the exhibit in May 2017 will be an austere, all-white maze hosting approximately 150 Comme ensembles.\n\nBoth the exhibit and accompanying book by Bolton are based upon the recurrent fashion dichotomies concentrating on eight thematic oppositions listed as:\n\nfashion/antifashion; design/not design; model/multiple; then/now; high/low; self/other; object/subject; and clothes/not clothes.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg/200px-Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/220px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Comme_des_Garcons_at_the_Met_%2862466%29.jpg/220px-Comme_des_Garcons_at_the_Met_%2862466%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/CdG.JPG/220px-CdG.JPG", "https://upload.wikimedia.org/wikipedia/commons/4/47/CommeDesGarcons.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Comme_des_Garcons_men_for_H%26M_09.jpg/220px-Comme_des_Garcons_men_for_H%26M_09.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "title": "Comme des Garçons", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}