{"url": "https://www.thewrap.com/the-keepers-filmmaker-on-his-personal-connection-to-sister-cathy-theory-on-who-killed-her/", "text": "Warning: Major spoilers appear below.\n\n“The Keepers” filmmaker Ryan White made the new Netflix docuseries that has everyone on the edge of their seats. He spearheaded the project because of his personal connection to Sister Catherine Cesnik, a nun who was found murdered in January of 1970 and who serves as the centerpiece of the true crime series.\n\n“My access point was a personal connection: My aunt went to Archbishop Keough High School and was Sister Cathy’s student,” White told TheWrap. His aunt was also friends with Jean Wehner, one of multiple people in the documentary who say they were sexually abused by Father Joseph Maskell in the Baltimore, Maryland area.\n\nThe series delves deeply into sexual abuse allegations and a lawsuit against Father Maskell brought by “Jane Doe,” now identified as Wehner, and “Jane Roe,” since identified as Teresa Lancaster. Throughout the series, the devastation experienced by survivors is laid bare, as is their strength in confronting unthinkable childhood horrors.\n\nAlso Read: 'The Keepers' Filmmaker: Father Maskell Abused 40 Victims, Not Just the 6 in Netflix's Doc\n\n“I hope this documentary can be a tool of healing, but it’s about to be very triggering for the survivors,” said White.\n\nIn the end, “The Keepers” doesn’t solve its biggest question: Who killed Sister Cathy? And although the seven-episode series explores — through its lead investigators Gemma Hoskins and Abbie Schaub — three main suspects, including Father Maskell, who died in 2001, White does have his own theory on who abducted and murdered the nun. But he’s only willing to share a slice of it.\n\nFind out what it is in TheWrap’s Q&A with White below.\n\nTheWrap: What was the process of getting this documentary together?\n\nWhite: My access point was personal connection: My aunt went to Archbishop Keough High School and was Sister Cathy’s student, so she always had a personal connection. I never grew up knowing her teacher had been murdered. A few years ago my aunt connected me to Jean, her friend. She didn’t know Jean had gone through that abuse. Jean is the reason I made “The Keepers” — I had a five-hour conversation with Jean and I left saying, “I need to do something with this woman’s story.” She, to me, was one of the most compelling people I’ve ever met.\n\nWhen she decided that this would be a healthy step, we went ahead with it.\n\nWe did it slowly — it took three years. She was comfortable with that — the long length of production actually helped her comfort level. Obviously, the story grew and grew and one of our first access points was Gemma. We met Gemma in a Home Depot parking lot, a few blocks from where Sister Cathy’s car was found. I was so drawn to Gemma… right when I met her, she had such a unique way. She’s so driven to find out what happened to her teacher. Gemma connected us with so many people in ‘The Keepers.”\n\nAlso Read: 'The Keepers': What's Behind the Name of the Netflix Documentary Series?\n\nIf you were part of the Facebook group, people got to know us very well. We would go to Baltimore every two months for the last three years, so people started to feel comfortable around us … Survivors would reach out to us on Facebook.\n\nWhat’s behind the title?\n\nIn one scene, Jean told her friends, “we are the keepers of the secrets,” and I knew that had to be the title. Obviously, it has other meanings — one other meaning was the idea of gatekeepers. The theory that people in position of authority and power are able to decide what we as the populous know or don’t know or whether survivors of abuse are validated or not… I also liked the institutional meaning of “The Keepers.”\n\nWhen you say survivors, how many are there?\n\nThere are six survivors showcased in the documentary but we had many conversations with other survivors who weren’t featured in the documentary.\n\nOur focus was definitely on the survivors of Keough, but many Maskell victims came after Keough, and it’s horrifying. We weren’t actively looking at what he was doing after Keough but obviously, Charles [another abuse victim] played a narrative in the abuse.\n\nI would say there were at least 40 survivors… That’s just 40 from who Gemma and Abbie found, and most of them are no longer alive. But through Gemma and Abbie, we talked to about 25 for the documentary.\n\nDid you face any hurdles? Were you scared of taking on the Catholic Church?\n\nWell, it’s funny how you asked that because I never saw it as taking on the Catholic Church. I was raised Catholic and I had a very positive experience. I had fond memories of the church, but for this, they were so non-participatory with it.\n\nJust Friday, the Archdiocese of Baltimore retweeted something in regards to documentary, and I was appalled that the Archdiocese was retweeting something like that and how insulting that must be for our survivors. And they just paid settlements to the survivors — it’s not that they deny it happened. At this point, I’m so disenchanted with my church — it’s really disappointing. I thought they would have been more participatory.\n\nThe biggest hurdle was that the case was so old, that it was 45 years old. So much of the investigation of the murder disappeared and we ran into that time and time again. We were trying to reconstruct the truth when it had been deliberately hidden or kept secret. The only way to do that was to find people who were involved. I have deep gratitude for the detectives who sat down with me and had complete transparency in opening their crime scene photos and investigation. They made the right decision in participating — it wasn’t always easy to persuade someone to take part.\n\nAlso Read: 'The Keepers': Sister Cathy's Medical Examiner Also Worked on JFK, JonBenet Ramsey Cases\n\nWhat do you think happened to Sister Cathy?\n\nEveryone has a different theory. Mine is different than Gemma’s theory, but we were all looking at the various versions of the “truth” and deciding what we believed was true. What we tried to do in the editing was present all various narratives. I won’t tell you my theory, but I will say: I believe Jean, and I have corroborated Jean, that this is a woman who was telling the truth from the beginning. That means Father Maskell was somehow involved. I have very little doubt at the finish line.\n\nSome are calling it “The Next ‘Making a Murderer'” — what is your response to that?\n\n“Making a Murderer” was such a phenomenon and if we have a fraction the popularity of “Making a Murderer,” I will be a happy filmmaker. But it’s not about popularity, it’s about the impact … My hope is that we can have a fraction of that popularity that leads to justice. The more people watch it, the more information will come out of the woodwork.\n\nWere you impressed with Gemma’s investigative skills given that she has no police or journalism experience?\n\nWhat’s really funny about Gemma, she’s taking criminology classes right now which I find hilarious. She always wanted to become a Personal Investigator. I told her, “everyone is going to recognize you and you’re going to be the worst PI in the world!” Look, my mom and my aunt are women in Baltimore, so Gemma in a way is my mom and my aunt — she’s so much like them, and I hope “The Keepers” doesn’t get relegated to another crime story in Baltimore. I’m also not a journalist or a detective but I borrowed a lot of skills from Gemma’s skillset over the years.\n\nHow did the women keep their faith and how were they able to move on and have kids after what they went through?\n\nI mean, it’s a survivor story at its core. Jean is the most incredible survivor that I’ve ever witnessed. She doesn’t recognize that of course — she lives small. But people from the outside that intercept with her realize the power of the survivor story in her. I don’t know how they do it — I don’t think she knows. I think the really special part of “The Keepers” is that people are speaking up for a lot of people who didn’t survive it. People walked to suicide, people are still hiding and keeping their secrets, and I think all of the survivors recognize the power in numbers.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/laura-bush-michelle-obama-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/05/the-keepers-major-players-split.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/white-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2017/05/Meyerowitz-Stories-Cannes-Emma-Thompson-Ben-Stiller-Dustin-Hoffman-Noah-Baumbach-Adam-Sandler-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/04/bill-cosby-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2017/04/the-keepers-sister-cathy-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "https://www.thewrap.com/wp-content/uploads/2017/03/GettyImages-52741361-160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-2017-160x105.png", "https://www.thewrap.com/wp-content/uploads/2020/04/Dwayne-Johnson-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "keywords": [], "authors": ["Beatrice Verhoeven", "Sharon Waxman", "Steve Pond", "Carli Velocci", "Daniel Goldblatt", "Rosemary Rossi", "Trey Williams"], "canonical_link": "https://www.thewrap.com/the-keepers-filmmaker-on-his-personal-connection-to-sister-cathy-theory-on-who-killed-her/", "title": "‘The Keepers’ Filmmaker Has Theory on Sister Cathy Murder, Personal Connection to Case", "meta_data": {"parsely-title": "‘The Keepers’ Filmmaker Has Theory on Sister Cathy Murder, Personal Connection to Case", "parsely-link": "https://www.thewrap.com/the-keepers-filmmaker-on-his-personal-connection-to-sister-cathy-theory-on-who-killed-her/", "parsely-type": "post", "parsely-pub-date": "2017-05-22T10:08:28-07:00", "parsely-section": "tv", "parsely-author": "Beatrice Verhoeven", "parsely-tags": "catherine-cesnik, jean-wehner, joseph-maskell, netflix, ryan-white, teresa-lancaster, the-keepers", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "\"The Keepers\" filmmaker Ryan White reveals his own personal connection to Sister Catherine Cesnik, who was found murdered in 1970.", "news_keywords": "catherine cesnik, jean wehner, joseph maskell, netflix, ryan white, teresa lancaster, the keepers", "original-source": "https://www.thewrap.com/the-keepers-filmmaker-on-his-personal-connection-to-sister-cathy-theory-on-who-killed-her/", "og": {"locale": "en_US", "type": "article", "title": "'The Keepers' Filmmaker Has Theory on Sister Cathy Murder, Personal Connection to Case", "description": "\"The Keepers\" filmmaker Ryan White reveals his own personal connection to Sister Catherine Cesnik, who was found murdered in 1970.", "url": "https://www.thewrap.com/the-keepers-filmmaker-on-his-personal-connection-to-sister-cathy-theory-on-who-killed-her/", "site_name": "TheWrap", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "http://facebook.com/BeatriceVerhoevenOfficial", "tag": "The Keepers", "section": "TV", "published_time": "2017-05-22T17:08:28-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "\"The Keepers\" filmmaker Ryan White reveals his own personal connection to Sister Catherine Cesnik, who was found murdered in 1970.", "title": "'The Keepers' Filmmaker Has Theory on Sister Cathy Murder, Personal Connection to Case", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "creator": "@bverhoev"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘The Keepers’ Filmmaker Has Theory on Sister Cathy Murder, Personal Connection to Case", "sailthru.date": "2017-05-22T17:08:28+00:00", "sailthru.author": "Beatrice Verhoeven", "sailthru.tags": "netflix,the keepers,joseph maskell,jean wehner,ryan white,catherine cesnik,teresa lancaster", "sailthru.category": "tv", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/05/WhoKilledSisterCathy-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1495498108.0, "source": "https://www.thewrap.com", "summary": ""}