{"url": "www.inquisitr.com/4893529/jessica-simpsons-bikini-body-pics-lead-to-bogus-depression-weight-gain-claims/", "text": "As of late, Jessica Simpson has been proudly flaunting her bikini body for fans on her Instagram page, indicating that she has been hitting the gym hard and is proud of the results.\n\nAs the Inquisitr reported a few weeks ago, Jessica Simpson took to her Instagram page to share a photo of herself in a leopard print bikini while on a tropical getaway with her husband, Eric Johnson. Not surprisingly, the photo gained a ton of traffic with over 121,000 likes. A few days later, the mother of two shared yet another photo in a skimpy string bikini on the same trip, according to the Inquisitr. The photo trifecta was complete with the last picture, one of Johnson and Simpson, both in their swimsuits.\n\nHowever, even after posting a ton of body positive images, an NW tabloid cover claims that Simpson feels “fat and alone” while they also shared a less than flattering bikini picture from Jessica’s vacation. But Gossip Cop reports that the tabloid cover couldn’t be any further from the truth and neither could the accompanying article, which claims Simpson gained over 50 lbs and is down in the dumps because of her “weight gain.”\n\nThe article also claims that Simpson feels as though she has hit a “low point” at her acting and singing careers and since her professional life no longer puts her on the stage, she doesn’t have “motivation” to work out. But the publication fails to mention the fact that the 37-year-old is head of a billion dollar fashion brand and appears to be doing just fine career wise.\n\nA post shared by Jessica Simpson (@jessicasimpson) on Apr 28, 2018 at 11:29am PDT\n\nTo debunk the baseless rumors, Gossip Cop took it upon themselves to speak with Jessica Simpson’s actual rep to get the full scoop. A rep for Jessica told the magazine that there is “no merit” to the claims that Simpson is depressed over her size and where she is at in her career. Furthermore, the 37-year-old teased fans back in February with a photo of herself and Annie Bosko writing songs in a studio, hinting that a new album could be in the works.\n\nJessica has also been posting a ton of family photos on her Instagram, including one from her daughter Maxwell’s Greatest-Showman-themed birthday. In the photos, the family is all smiles and definitely appears to be a happy — further solidifying the fact that the rumors are just silly rumors.", "images": ["https://secure.gravatar.com/avatar/54254827fab5e9de95f128cf1f4d78a5?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Jessica-Simpson-Bikini-Rumors-Debunked.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Kathryn Cook"], "canonical_link": "https://www.inquisitr.com/4893529/jessica-simpsons-bikini-body-pics-lead-to-bogus-depression-weight-gain-claims/", "title": "Jessica Simpson’s Bikini Body Pics Lead To Bogus Depression, Weight Gain Claims", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}