{"url": "https://web.archive.org/web/20181130111423/https://www.forbes.com/sites/veronicavillafane/2018/11/29/nicky-jam-el-ganador-starring-the-reggaeton-singer-premieres-on-netflix-but-not-on-telemundo/", "text": "Nicky Jam: El Ganador, the music bio series that tells the life story of popular award-winning reggaeton singer songwriter Nicky Jam, makes its debut on Netflix, but not on Telemundo.\n\nThe network previously announced it would air the series first during the summer, with Netflix following suit. But now, it's the streaming service that gets the first shot at sharing the story of the rise, fall and rebirth of the hit-making reggaeton singer.\n\nNicky Jam: El Ganador, will be available on the streamer starting Friday, November 30 in Latin America and Spain. Telemundo has not set a date yet for its release in the United States and Puerto Rico, where it holds the rights to the series.\n\nAccording to a Telemundo, programming conflicts prompted the delay in airing the bioseries.\n\n\"Due to the airing of the World Cup and Exatlón during the summer, we are looking at other scheduling options, but have not made a decision yet,\" states a company spokesperson.\n\nThe 13-episode musical drama stars Nicky Jam as himself, with Avery Rodríguez portraying him as a child and Puerto Rican urban pop singer and rapper Darkiel playing him as a young Nicky. The series will show how Nick Rivera Caminero becomes Nicky Jam, his humble beginnings in Boston, where he was born, his life in Puerto Rico, his rise to fame, how he battled drug and alcohol addiction, his downfall and how his decision to move to Colombia paved the way for his \"rebirth.\"\n\nA Latin Grammy winner, the singer is now a chart-topping global phenomenon, who has had 29 songs reach Hot Latin Songs with four of them hitting No. 1, including \"Hasta El Amanecer\" and \"El Perdón,\" a collaboration with Enrique Iglesias. This year, Nicky Jam's star has continued to rise with the \"Te Boté\" remix with Casper Magico, Nio Garcia, Darell, Ozuna and Bad Bunny, and his J Balvin collaboration \"X,\" both of which hit Billboard's Hot 100, peaking at No. 36 and No. 41, respectively.\n\nNicky Jam: El Ganador was shot in México, Colombia, Puerto Rico and New York is produced by Endemol Shine Boomdog for Telemundo and Netflix. It's executive produced and directed by Jessy Terrero, best known for directing music videos for a wide range of famous artists and is tightly connected to the reggaeton scene.\n\n\"The global power of reggaeton music has placed Latinos at the forefront of pop culture trends,\" states Terrero, who believes in producing long-form content that speaks directly to Latino audiences and whose objective as a Latino filmmaker is to \"foster and create stories that continue to push our culture forward.\"\n\nTerrero says his biggest challenge in doing El Ganador was to capture the authenticity of Nicky Jam's story. \"Nickyʼs story travels through many different time periods, countries and cultures and I wanted to make sure that the storytelling was credible and relevant to each one.\n\nWhat does Terrero think will be the audience's takeaway from watching the series?\n\n\"The series story arc is one of renewal and redemption, which are timeless themes,\" notes Terrero. \"Nickyʼs journey shows the viewer that if you follow your passion, then anything is possible.\"", "images": ["https://web.archive.org/web/20181130111423im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fveronicavillafane%2Ffiles%2F2018%2F11%2FNicky-Jam-El-Ganador.jpg", "https://web.archive.org/web/20181130111423im_/https://secure.gravatar.com/avatar/7477b443b064d716765d924f9fce88c2?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20181130111423im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fveronicavillafane%2Ffiles%2F2018%2F11%2FNicky-Jam-El-Ganador.jpg", "keywords": [], "authors": ["Veronica Villafañe"], "canonical_link": "https://web.archive.org/web/20181130111423/https://www.forbes.com/sites/veronicavillafane/2018/11/29/nicky-jam-el-ganador-starring-the-reggaeton-singer-premieres-on-netflix-but-not-on-telemundo/", "title": "Nicky Jam: El Ganador, Starring The Singer Himself, Premieres on Netflix, But Not On Telemundo", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Nicky Jam: El Ganador, Starring The Singer Himself, Premieres on Netflix, But Not On Telemundo", "image": "https://web.archive.org/web/20181130111423im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fveronicavillafane%2Ffiles%2F2018%2F11%2FNicky-Jam-El-Ganador.jpg", "updated_time": "2018-11-29T23:35:02-05:00", "url": "https://web.archive.org/web/20181130111423/https://www.forbes.com/sites/veronicavillafane/2018/11/29/nicky-jam-el-ganador-starring-the-reggaeton-singer-premieres-on-netflix-but-not-on-telemundo/", "description": "Telemundo previously announced it would air the series first, but now the streaming service gets the first shot at sharing the story of the rise, fall and rebirth of the hit-making reggaeton singer.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Nicky Jam: El Ganador, Starring The Singer Himself, Premieres on Netflix, But Not On Telemundo", "description": "Telemundo previously announced it would air the series first, but now the streaming service gets the first shot at sharing the story of the rise, fall and rebirth of the hit-making reggaeton singer.", "image": "https://web.archive.org/web/20181130111423im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fveronicavillafane%2Ffiles%2F2018%2F11%2FNicky-Jam-El-Ganador.jpg", "creator": "@veronicavillafane"}, "description": "Telemundo previously announced it would air the series first, but now the streaming service gets the first shot at sharing the story of the rise, fall and rebirth of the hit-making reggaeton singer.", "author": "Veronica Villafañe", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Veronica Villafañe", "section": "Consumer", "section_url": "https://www.forbes.com/hollywood-entertainment//", "id": "blogAndPostId/blog/post/4676-2173", "published": "2018-11-30", "modified": "2018-11-30"}}, "movies": [], "publish_date": 1543420800.0, "source": "https://web.archive.org", "summary": ""}