{"url": "https://web.archive.org/web/20180514221132/https://www.thebreakingdawn.site/it-begins-california-appoints-first-illegal-alien-to-state-office-trump-has-better-plan/", "text": "Illegal aliens residing in the state of California in defiance of federal immigration laws would now be able to serve on all state and local boards and commissions under a proposal introduced before the California state Senate. Now the state of California has appointed its first “unprotected” illegal alien in state office after Senate President Pro Tem Kevin de León (D-Los Angeles) appointed Lizbeth Mateo an advisory committee.\n\nThe committee’s formal name is a bureaucratic mouthful — the California Student Opportunity and Access Program Project Grant Advisory Committee, or “Cal-SOAP,” for short — but its mission is one that will be familiar to Mateo: to find ways to help students from underserved communities go to college\n\nMateo is aa 33-year-old attorney and civil rights activist who was born in Mexico and came to the United States illegally at the age of 14 with her parents, who are also illegal aliens, according to the Sacramento Bee. She often complains that illegal aliens are treated unjustly and are not adequately represented in state government. As a result, she describes her appointment as a means towards correcting that alleged injustice.\n\nMateo said via Fox News – “While undocumented students have become more visible in our state, they remain underrepresented in places where decisions that affect them are being made.”\n\nTrending: Melania Just Fired Them ALL! ‘That Is Not Acceptable Here – I Won’t Allow It!’\n\nSenate Bill 174 made Mateo’s appointment possible by amending existing state law to allow the appointment of any resident over the age of 18 to a civil office regardless of citizenship or immigration status. California law currently states that someone is incapable of holding office if they are not a citizen at the time of their appointment.\n\n“California is stronger when we utilize talents of all our residents, and opening state and local boards and commissions to every Californian will allow us to better serve our diverse communities,” Sen. Ricardo Lara, D-Bell Gardens, and the bill’s author said in a statement. “Undocumented Californians are our neighbors, co-workers, and parents, and as lawmakers, we can’t make good policy if their voices are left out of the discussion.”\n\nIt marked the first time the Senate appointed someone living within the borders of the United States illegally to a state post. De León’s office attempted to make the argument that the appointment was perfectly legal because Mateo’s committee is advisory in nature only and not delegated to adopt laws and regulations or allocate state funds.\n\nMateo took to Twitter to celebrate tweeting – In #lawschool I often wondered if I was fit to b in #lawjournal, #mootcourt bc not many ppl w/ my same background did. I always went for it bc even if I felt inadequate I thought I could add something of value. I hope to do the same w/ @StudentAidCommission. #undocumentedunafraid.\n\nIn #lawschool I often wondered if I was fit to b in #lawjournal, #mootcourt bc not many ppl w/ my same background did. I always went for it bc even if I felt inadequate I thought I could add something of value. I hope to do the same w/ @StudentAidCommission. #undocumentedunafraid https://t.co/JpZOOhJfMU — Lizbeth Mateo, Esq. (@LizbethMateo) March 15, 2018\n\nThank you Sen. @ kdeleon for appointing me to the CalSOAP Advisory Committee. I look forward to working w/ the rest of the committee & the Student Aid Commission in such important task – increase the accessibility of postsecondary education opportunities for low-income students.\n\nIn #lawschool I often wondered if I was fit to b in #lawjournal, #mootcourt bc not many ppl w/ my same background did. I always went for it bc even if I felt inadequate I thought I could add something of value. I hope to do the same w/ @StudentAidCommission. #undocumentedunafraid https://t.co/JpZOOhJfMU — Lizbeth Mateo, Esq. (@LizbethMateo) March 15, 2018\n\nInterestingly enough, however, Moteo seems to be confused about which country she prefers and which country has her loyalty. In a 2016 Facebook post that appears in celebration of her graduation from Santa Clara University School of Law, Mateo proclaims publicly in Spanish –\n\n“Everything is dedicated to Oaxaca, Mexico!! to that land that I miss so much.”\n\nIf she misses it so much? Why does she not return? After all, it is her homeland and the country of which is she is a citizen. Yet here she is in America, in a country in which her very presence is in defiance of the law she swears to uphold both as an attorney and officer of the court, and also as an officer of the California state government.\n\nIt is important to note that while Mateo is the first “unprotected” illegal alien to hold a state office, she is not the first elevated to public office in California. In 2015, the city council of Huntington Park, California, appointed two illegal aliens to city commissions, sparking a public backlash.\n\nDe León and other state officials are stoking an ongoing confrontation with the federal government over federal immigration laws.\n\nMany were also quick to point out Mateo’s hypocrisy in her chosen profession in the law and in government with her own illegal status and refusal to adhere federal immigration law. One Twitter user asked Mateo some very pointed and direct questions – “As someone who studies and practices the law, how can you at the same time flout the very principles of justice that law and order is based on?!?! You are a fraud and should answer for breaking the laws of this land.”\n\nIn #lawschool I often wondered if I was fit to b in #lawjournal, #mootcourt bc not many ppl w/ my same background did. I always went for it bc even if I felt inadequate I thought I could add something of value. I hope to do the same w/ @StudentAidCommission. #undocumentedunafraid https://t.co/JpZOOhJfMU — Lizbeth Mateo, Esq. (@LizbethMateo) March 15, 2018\n\nCiting EdSource data, de Leon’s office said an estimated 72,300 undocumented students are enrolled in California’s public colleges and universities. (Of those, about 60,000 attend community colleges, 8,300 are in the California State University system and 4,000 are on University of California campuses.) Perhaps ICE should hit here for their next raid?", "images": ["https://web.archive.org/web/20180514221132im_/https://www.thebreakingdawn.site/wp-content/uploads/2018/05/Untitled-4.png", "https://web.archive.org/web/20180514221132im_/http://media.breitbart.com/media/2018/03/Screen-Shot-2018-03-15-at-6.52.21-AM.png"], "top_img": "https://web.archive.org/web/20180514221132im_/https://www.thebreakingdawn.site/wp-content/uploads/2018/05/Untitled-4.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180514221132/https://www.thebreakingdawn.site/it-begins-california-appoints-first-illegal-alien-to-state-office-trump-has-better-plan/", "title": "IT BEGINS: California Appoints FIRST Illegal Alien to State Office – Trump Has Better Plan", "meta_data": {"fb": {"pages": 817541391723453}, "viewport": "width=device-width, initial-scale=1.0", "format-detection": "telephone=no", "generator": "WordPress 4.9.5", "og": {"type": "article", "title": "IT BEGINS: California Appoints FIRST Illegal Alien to State Office – Trump Has Better Plan", "url": "https://web.archive.org/web/20180514221132/https://www.thebreakingdawn.site/it-begins-california-appoints-first-illegal-alien-to-state-office-trump-has-better-plan/", "description": "Illegal aliens residing in the state of California in defiance of federal immigration laws would now be able to serve on all state and local boards and commissions under a proposal introduced befor…", "site_name": "The Breaking Dawn", "image": {"identifier": "https://web.archive.org/web/20180514221132im_/https://www.thebreakingdawn.site/wp-content/uploads/2018/05/Untitled-4.png", "width": 571, "height": 300}, "locale": "en_US"}, "article": {"published_time": "2018-05-10T10:27:59+00:00", "modified_time": "2018-05-10T10:27:59+00:00"}, "twitter": {"text": {"title": "IT BEGINS: California Appoints FIRST Illegal Alien to State Office – Trump Has Better Plan"}, "image": "https://web.archive.org/web/20180514221132im_/https://www.thebreakingdawn.site/wp-content/uploads/2018/05/Untitled-4.png?w=640", "card": "summary_large_image"}}, "movies": [], "publish_date": 1525948079.0, "source": "https://web.archive.org", "summary": ""}