{"url": "https://www.harpersbazaar.com/culture/film-tv/a19081077/frances-mcdormand-oscars-speech-transcript-2018/", "text": "Frances McDormand gave a rousing speech demanding gender parity in the entertainment industry while accepting the Oscar for Best Actress at tonight's Academy Awards.\n\nWhile receiving the statue for her role in Three Billboards Outside Ebbing, Missouri, McDormand asked every female nominee inside the Dolby Theatre to stand with her in solidarity. Then, she implored industry bigshots to pay attention to female talent. \"We all have stories to tell and projects we need financed,\" she said. \"Don't talk to us about it at the parties tonight. Invite us into your office in a couple days, or you can come to ours, whatever suits you best, and we'll tell you all about them.\"\n\nFrances McDormand recognizes women in Hollywood during her Oscars acceptance speech. McDormand won the Oscar for Best Actress for her performance in \"Three Billboards Outside Ebbing Missouri\" https://t.co/AWx0OL64KA pic.twitter.com/X49wgnxl2J — NBC News (@NBCNews) March 5, 2018\n\nMcDormand finished her speech with two words—\"inclusion rider”—which, according to actress and comedian Whitney Cummings on Twitter, is “something actors put into their contracts to ensure gender and racial equality in hiring on movie sets.” According to The Hollywood Reporter, the phrase originated with Stacy Smith, director of USC Annenberg's Media, Diversity & Social Change Initiative: \"The clause would state that tertiary speaking characters should match the gender distribution of the setting for the film, as long as it's sensible for the plot.\"\n\nMcDormand's sentiment was an appropriate cap to awards season 2018, which saw women lead the charge against sexual harassment and abuse in the entertainment industry with the #MeToo movement and the Time's Up initiative. Even McDormand, who declared she \"keep[s] her politics private\" in her Golden Globes acceptance speech earlier this year, couldn't resist a rallying cry with her Oscar platform.\n\nRead the full transcript of her speech below.\n\n\"Okay, so I'm hyperventilating a little bit. If I fall over, pick me up cause I've got some things to say. So I think this is what Chloe Kim must have felt like after doing back-to-back 1080s in the Olympic halfpipe. Did you see that? Okay, that's what it feels like.\n\n\n\n\"I want to thank Martin McDonagh, look what you did. We are a bunch of hooligans and anarchists but we do clean up nice. I want to thank every single person in this building. And my sister Dorothy. I love you, Dot. And I especially want to thank my clan, Joel and Pedro \"McCoen.\" These two stalwart individuals were well-raised by their feminist mother. They value themselves, each other and those around them. I know you are proud of me and that fills me with everlasting joy.\n\n\n\n\"And now I want to get some perspective. If I may be so honored to have all the female nominees in every category stand with me in this room tonight, the actors—Meryl, if you do it, everybody else will, c'mon—the filmmakers, the producers, the directors, the writers, the cinematographer, the composers, the songwriters, the designers. C'mon! Okay, look around everybody. Look around, ladies and gentlemen, because we all have stories to tell and projects we need financed. Don't talk to us about it at the parties tonight. Invite us into your office in a couple days, or you can come to ours, whatever suits you best, and we'll tell you all about them. I have two words to leave with you tonight, ladies and gentlemen: 'inclusion rider.'\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Julie Kosin", "Senior Culture Editor", "Julie Kosin Is The Senior Culture Editor Of Elle.Com", "Where She Oversees All Things Movies", "Tv", "Books", "Music", "Art", "Trawling Netflix For A Worthy Binge To Endorsing Your Next Book Club Pick."], "canonical_link": "https://www.harpersbazaar.com/culture/film-tv/a19081077/frances-mcdormand-oscars-speech-transcript-2018/", "title": "Frances McDormand Just Brought Down the House with Her Oscars Speech", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Frances McDormand Just Brought Down the House with Her Oscars Speech", "description": "She invited every other female nominee to stand with her in solidarity.", "url": "https://www.harpersbazaar.com/culture/film-tv/a19081077/frances-mcdormand-oscars-speech-transcript-2018/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-03-05 05:49:16", "published_time": "2018-03-05 05:34:00", "section": "Film, TV & Theatre", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Frances McDormand Oscars Speech Transcript - Academy Awards Best Actress Winner", "description": "Frances McDormand invited every other female nominee to stand with her during her Best Actress Oscars acceptance speech.", "keywords": "oscars 2018 best actress, frances mcdormand, frances mcdormand oscars, Oscars 2018, Oscars, Academy Awards 2018, Academy Awards, frances mcdormand oscars speech, frances mcdormand speech transcript, inclusion rider", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,film-tv", "sailthru.date": "2018-03-05T05:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-frances-mcdormand-index-shutterstock-1520224875.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Frances McDormand Just Brought Down the House with Her Oscars Speech", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1520199240.0, "source": "https://www.harpersbazaar.com", "summary": ""}