{"url": "https://www.nme.com/blogs/tv-blogs/game-of-thrones-arya-sansa-plot-littlefinger-bran-2129881", "text": "Spoilers follow for Game of Thrones season 7 episode 7 – The Dragon And The Wolf.\n\nLittlefinger finally had his come-uppance in the Game of Thrones season 7 finale, ambushed by a united front of Starks: it was revealed that Arya, Sansa and Bran had been talking to each other and all of them knew what was going on. Littlefinger, meanwhile, did not. He was standing calmly in Winterfell’s great hall, believing he was about to watch the execution of Arya Stark – something he’d been wheedling Sansa into for several episodes – when Sansa suddenly turned the tables on him and revealed that she’d been playing him all along.\n\nAdvertisement\n\nFans are, of course, happy about the demise of the dastardly Lord Baelish – but they’re also confused about how the narrative of the Winterfell subplot stitches together across the episodes of season 7. In a much-upvoted post, Redditor DarkSun09 wrote: “I guess the Stark girls were just acting like they had turned against one another in order to fool Littlefinger. What I don’t understand is why. Why did they have to fool Littlefinger in the first place? What purpose did that serve? They had Bran and, presumably, all the evidence they needed against Littlefinger already, so why not just drag him out, expose his crimes, and execute him? Why did they have to do all that acting in front of him?\n\n“In the end,” they continue, “all they did was accuse him of a bunch of stuff, which he simply denies. Then they just killed him anyway without actually producing any evidence to prove him wrong. I don’t get the point of any of this. Someone please explain.”\n\nAnother Redditor replied that the showrunners “say they were solely focused on making the viewer believe the Starks would turn on each other before twisting it at the end. It doesn’t seem like they were concerned with in-character explanations, they were just concerned with selling the viewer on the fake-out. That’s why the plot seems weird and difficult to parse, because there isn’t really an in-universe explanation.”\n\nThere’s a lot of opposition to this storyline – but there is some sense in it. Let’s go through the scenes one by one to try and sort it out:\n\nArya returns home (Episode 4)\n\nWhat it tells us: The ‘hard feelings’ Arya and Sansa display towards one another in episodes 5 and 6 can only be a ruse.\n\nWhen Arya returns to Winterfell in episode 4 – before she even realises that Littlefinger is there too – she heads down to the crypts to find the tomb of her father, Ned. Sansa comes to find her there, and they’re completely alone. Arya tells Sansa that being lady of Winterfell “suits you”. When Arya asks if Sansa killed Joffrey says she “wishes” she had, proving to Arya straight away that she hated her former fiancé. There is a lot of affection in this interaction, and no mistrust: unlike the staged argument they have a couple of episodes later, there’s no beef here about how Sansa “did nothing” when Ned was executed, and in this scene they’re literally standing in front of a statue of their dead father.\n\nAdvertisement\n\nhttps://www.youtube.com/watch?v=prMqY9W08II\n\nArya berates Sansa (Episode 5)\n\nWhat it tells us: Arya is faking it – she told Sansa in episode 4 that being Lady of Winterfell “suits” her.\n\nArya comes to Sansa’s room and loudly tells Sansa off for moving herself into their parents’ room, for having ‘nice things’ and for aspiring to hold the power that Jon has. In hindsight, we can view this as the point where Arya and Sansa begin acting out a disagreement to see what Littlefinger does – because they know he’s spying on them. By faking it, they’re able to make him play his hand and cause him to incriminate himself irreversibly.\n\nArya steals from Littlefinger (Episode 5)\n\nWhat it tells us: Arya lets Littlefinger see her steal the note because she wants him to think she is planning to take down Sansa.\n\nIt’s only after Arya and Sansa’s first staged argument that Littlefinger asks Winterfell’s Maester to find the incriminating message Sansa sent to Robb, where she asked him to bend the knee to her evil fiancé Joffrey Baratheon, after her father was accused of treason and awaiting execution by the Lannisters. By taking the ‘bait’ of this message, Arya is tricking Littlefinger into thinking she wants leverage with which to take down Sansa.\n\nArya and Sansa argue again (Episode 6)\n\nWhat it tells us: The staged fight continues.\n\nOut on the balcony of Winterfell’s courtyard, Arya and Sansa have another, even more public staged argument, where Arya reads out the note Littlefinger wanted Arya to find. It says:\n\n“Robb, I write to you today with heavy heart. Our good King Robert is dead. Killed from wounds he took in a boar hunt. Father has been charged with treason. He conspired with Robert’s brothers against my beloved Joffrey and tried to steal his throne. The Lannisters are treating me well and providing me with every comfort. I beg you, come to King’s Landing, swear fealty to King Joffrey and prevent any strife between the great houses of Lannister and Stark. Your faithful sister, Sansa.”\n\nArya then says: I would have let them kill me before I betrayed my family.”\n\nhttps://www.youtube.com/watch?v=rxwaMM2RiHc\n\nSansa then pretends to get uppity, boasting about her contribution in the Battle of Bastards: “You didn’t win [Winterfell] back, Jon didn’t win it back, he lost the Battle of the Bastards. The Knights of the Vale have won the battle and they rode north for me.” Arya then takes the argument a step further by threatening to show the message to the Northern Lords.\n\nLittlefinger tries to pit Sansa against Arya with Brienne (Episode 6)\n\nWhat it tells us: Littlefinger is beginning to show his hand: he wants Arya dead, because she poses a danger to his ‘control’ over Sansa.\n\nAt this news, Littlefinger makes his first real error: he suggests Sansa use Brienne as a bodyguard in case Arya tries anything. It becomes clear he wants Arya dead, because she is only a threat to him. Either Arya will kill him, or she will kill Sansa – thereby removing what he sees as his ‘control’ over the north.\n\nIn order to destabilise Littlefinger further, Sansa ignores his advice, sending Brienne away to King’s Landing. Littlefinger is later forced to suggest more explicitly that Sansa get rid of Arya, which proves to Sansa that he’s no use to her any more.\n\nhttps://www.youtube.com/watch?v=FFZgyJZObOI&t=6s\n\nArya proves her loyalty by giving Sansa her dagger (Episode 6)\n\nWhat it tells us: The sisters are plotting together – what they’re saying aloud doesn’t mean anything.\n\nWhen Sansa enters Arya’s room at the end of this episode and discovers her bag full of faces, Arya makes a speech that appears to threaten her, before handing her the dagger. Redditor summyg writes “We have no indication of what her handing the dagger meant other than ‘maybe it meant something.’”\n\nIt seems that what the showrunners were really trying to show us here is that Arya and Sansa have been in cahoots the whole time. Their conversations sound terrible to the casual listener – like a spy at the door, for instance – but really they’re just acting.\n\nLittlefinger again hints at getting rid of Arya (Episode 7)\n\nWhat it tells us: Littlefinger is sure Sansa wants to kill Arya.\n\nLittlefinger says to Sansa: “After [Arya] murders you, what does she become? Lady of Winterfell.” Like us, Sansa knows Arya has never wanted to be a lady, but Littlefinger thinks this is the way to coax Sansa into killing Arya.\n\nIt’s at this point that Littlefinger has used up all his chances: Sansa knows he is only trying to sow more chaos, and will only ever continue to do so. This is when she decides he is no longer an asset, and gets rid of him with the piles of evidence she, Bran and Arya have on him.\n\nThe big twist (Episode 7)\n\nWhat it tells us: Sansa and Arya were working together the entire time – with Bran’s help.\n\nThis is where the decision only to show us scenes of disagreement between Sansa and Arya comes to fruition. Surprise! Littlefinger’s been busted – he’s done himself out of a job by trying to pit the Starks against each other. Not only have Arya and Sansa been working to take him down, but they’ve also had Bran to help. Littlefinger’s tricks don’t work on the Starks, and he’s reduced to begging for mercy. He gets none.\n\n“What’s the worst reason you have for turning me against my sister?” Sansa asks aloud. “That’s what you do, isn’t it? That’s what you’ve always done turn family against family, turn sister against sister. That’s what you did to our mother and Aunt Lysa, and that’s what you tried to do to us.” He pleads to the contrary, but he knows it’s true. He’s been played – just like most of Game of Thrones‘ viewership.\n\nhttps://www.youtube.com/watch?v=NoVWZrhd05o\n\nWhat do you reckon? Were you confused by the Winterfell storyline? Does it make more sense now? Let us know what you think in the comments.", "images": ["https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07.jpg", "https://media.giphy.com/media/zEaGwL0QN5N1m/giphy.gif", "https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07-696x442.jpg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07.jpg", "keywords": [], "authors": ["Larry Bartleet"], "canonical_link": "https://www.nme.com/blogs/tv-blogs/game-of-thrones-arya-sansa-plot-littlefinger-bran-2129881", "title": "Thrones: How Sansa and Arya worked together to take down Littlefinger", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Bran, Sansa and Arya were working together the whole time to bring down Littlefinger. You just didn't see how it happened...", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "Thrones: How Sansa and Arya worked together to take down Littlefinger", "description": "Bran, Sansa and Arya were working together the whole time to bring down Littlefinger. You just didn't see how it happened...", "url": "https://www.nme.com/blogs/tv-blogs/game-of-thrones-arya-sansa-plot-littlefinger-bran-2129881", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07.jpg", "width": 1000, "height": 635}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "tag": "Game of Thrones fan theories", "section": "TV Blogs", "published_time": "2017-08-29T16:52:10+00:00"}, "twitter": {"card": "summary_large_image", "description": "Bran, Sansa and Arya were working together the whole time to bring down Littlefinger. You just didn't see how it happened...", "title": "Thrones: How Sansa and Arya worked together to take down Littlefinger", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2017/08/07_16_GameOfThrones_S07.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": ["https://www.youtube.com/embed/Dk-oBUjx0K8?feature=oembed", "https://www.youtube.com/embed/nmhGA1qzYTk?feature=oembed", "https://www.youtube.com/embed/XdpcyovK0ZU?feature=oembed"], "publish_date": 1504025530.0, "source": "https://www.nme.com", "summary": ""}