{"url": "https://nypost.com/2013/10/19/the-childhood-hell-of-the-lost-boys/", "text": "The day Corey Feldman met Corey Haim, when they were 14 years old and preparing to work together on the film “The Lost Boys,” they bonded instantly. Both were young Jewish actors who often competed for the same roles. They shared a first name and even a favorite number, sort of. Haim’s was 222. Feldman’s was 22.\n\nAs they spoke, it became clear that they also shared horrific histories of abuse.\n\nHaim confided in his new friend that on the set of the 1986 film “Lucas,” “an adult male convinced him that it was perfectly normal for older men and younger boys in the business to have sexual relations, that it was what all the guys do. So they walked off to a secluded area between two trailers . . . and Haim allowed himself to be sodomized.”\n\nHaim then followed this shocking tale with a question.\n\n“So,” he said to his new bestie. “I guess we should play around like that, too?”\n\nThe Meal Ticket\n\nIn “Coreyography,” Feldman — one of Hollywood’s top child actors in the 1980s with hits like “Stand By Me,” “The Lost Boys,” “Gremlins” and “The Goonies” — shares tales of his own abuse at the hands of trusted adults throughout his Hollywood experience.\n\nAlong the way, he recounts his often twisted friendship with Haim — the two spent their teen years partying and living with their molesters (and no, Feldman writes, he did not take Haim up on his suggestion) — as well as his friendship with Michael Jackson, which, in a sign of how screwed up Feldman’s life was, served as one of his healthiest and most supportive relationships.\n\nFeldman’s troubles began at home. His mother, Sheila, was a former Playboy model with severe depression and drug issues, and his father, Bob, had been in a post-hit version of ’60s one-hit wonders Strawberry Alarm Clock and only seemed to care about his son when they were getting high together.\n\nSheila began telling Feldman how flawed he was at age 4, when she dyed his hair blond, saying, “You were supposed to be blond.” She also tortured him about his weight, calling him fat and eventually force-feeding him diet pills.\n\nWhen she caught him sneaking two cookies when he was 5, she made him stand facing a wall for an hour, then went off, Feldman writes, on an insane verbal rant.\n\n“You have no right to disrespect me like this . . . you ungrateful s – – t,” she railed before somehow segueing to, “Do you realize that most women would die to look like this after two kids? Look at these t – – s,” she said, cupping her breasts toward him.\n\nBy the time he was 7, Feldman was working as a commercial actor and was relied on as the family bread-winner. He was banned from ever riding a bicycle because, his mother told him, he couldn’t afford to be injured. “You have responsibilities now,” she said.\n\nUnsurprisingly, the starved-for-love Feldman began acting out on-set and became regarded by some as a brat. When he was fired from a TV movie, his mother forced him to remove his clothes as she reached for “a long wooden dowel . . . [that acted] as a window stop.”\n\n“ ‘How could you f – – – ing do this to me?’ she screams. She is out of control, wild-eyed, like an animal. Her face is bright red and blotchy, her cheeks are streaked with mascara. ‘You know I need this f – – – ing money. I will kill you. I will f – – – ing kill you, you worthless piece of s – – t.”\n\nFeldman tried to hide under his little brother’s crib as his mother shoved the dowel toward him.\n\n“She’s bent at the waist, ramming the pole under the cotton eyelet dust ruffle . . . jabbing at my ribs, my arms, my face,” he writes. “My skin is raw and bleeding. I think that, maybe, she is serious. She really does want to kill me. Then everything goes black.”\n\nLater that week, she taunts him further.\n\n“ ‘I’m going to kill you.’ My mother delivers this line in a sing-song cadence, like she’s suggesting we go to a picnic, or make balloon animals, or fly a kite in Chatsworth Park. ‘On Saturday,’ she says, with a wink.”\n\nNights with ‘Ron’\n\nWith such turmoil at home, Feldman sought relief on Hollywood soundstages, where he could interact with other like-minded kids and hopefully be around genuine adult role models. But while Steven Spielberg, who hired him for the first time for “Gremlins,” and director Richard Donner became trusted and supportive friends, most of the adults he met did him harm.\n\nHis father, who managed him for a time, hired an assistant in his early 20s who Feldman calls “Ron.” Ron struck up an instant friendship with Feldman, who writes, “It was almost eerie how similar we were. It was as if he had studied me and was copying my every move.”\n\nRon was soon spending all his time with Feldman, taking him out on the town and turning him on to new drugs. One night, after taking a concoction of pills “that Ron had made up,” the woozy teenager felt a hand on his thigh. Ron asked if it was OK and wound up having oral sex with the “petrified” and “revolted” Feldman, who was frightened of a confrontation and of alienating his new close friend.\n\nThis twisted relationship lasted for years. With none of his family members there for him, Feldman formed relationships with any adults who reached out, and in numerous instances, these men turned out to be pedophiles. In one especially sad aside, he reflects on a picture he took at his 15th birthday party and notes that in the photo, he and Haim were flanked by five of them.\n\n“Slowly, over a period of many years,” he writes, “I would begin to realize that many of the people I had surrounded myself with were monsters.”\n\nIt got so bad that after fleeing Ron’s clutches one night only to have another adult male friend attempt to molest him right after, he escaped to the only safe and friendly place he knew.\n\n“I was shattered, disgusted, devastated. I needed some normalcy in my life. So, I called Michael Jackson,” he writes. “Michael Jackson’s world, crazy as it sounds, had become my happy place. Being with Michael brought me back to my innocence. When I was with Michael, it was like being 10 years old again.”\n\nSurprisingly, his friendship with Jackson — who, he makes very clear, never touched him sexually or even tried to — includes some of the book’s lightest passages.\n\nIntroduced by mutual friend Spielberg, the two became close friends, and Feldman got to know Jackson’s playful side. When they spoke on the phone, Jackson would put on voices, including “an imitation of what sounded like an uptight, conservative Caucasian, not unlike [when] Dave Chappelle . . . pretends to be white.”\n\nThe pair confided in each other about their respective childhood traumas, with Feldman noting that even then, Jackson was “still absolutely terrified of his father.”\n\nAnd when they decided to take a trip to Disneyland, Feldman discovered that Jackson kept a secret penthouse apartment on Wilshire Boulevard in Westwood, for the sole purpose of housing the many disguises he used when going out in public.\n\nSadly, the friendship ended in 2001, when Jackson heard a rumor that Feldman was planning to trash him in a book. Despite Feldman’s adamant denials, Jackson shut him out, and the two never spoke again.\n\nCorey Gone Wild\n\nFar sadder was his friendship with Haim, a brotherhood bonded by terrors. From that first meeting, when Feldman had to explain to his new friend that having sex with grown men was “not what kids do, man,” the two shared their best and worst moments.\n\nPublicly, they made nine films and starred in one TV series, the reality show “The Two Coreys,” together and had their partying antics heavily documented in the press. But privately, these antics were driven by the darkest of secrets.\n\nFrom early on, whenever they hung out, Haim would beg Feldman to find him someone to have sex with, harping endlessly on, “I need a girl. I need a girl right now. Can you call a girl for me? Come on, man. I just need somebody to take care of me.”\n\nOne time, Haim was so horny that he again tried to hook up with Feldman. Wanting to deflect his attention, Feldman writes, he referred Haim to a man he refers to as Tony Burnham who he knew had a crush on Haim, and Burnham became in Haim’s life similar to what Ron was in Feldman’s.\n\nThe boys’ lives became so deranged that when Feldman’s father kicked him out of the house, the only person Feldman had to turn to was Burnham, and he rationalized it because “he was the only person in my immediate circle who wasn’t molesting me.”\n\nFeldman’s cocaine use, which began when he once found his mother’s stash, found him snorting an eight ball — an eighth of an ounce — every two days, a habit helped along by his new friendship with comedy party monster Sam Kinison. Together, the two smoked bales of weed in Feldman’s trailer, and were “having regular coke-off challenges, daring each other to see who can stay up the longest, who can do the most rails.”\n\nIn the ensuing years, Haim spiraled hard, even once being caught asking high-school students where he could buy crack.\n\nHis career in tatters, Haim rehabbed and relapsed several times, and died of pneumonia in 2010 at age 38.\n\nHell of Child Stars\n\nFeldman’s spiral was harsh as well. His heroin habit — Ron had introduced him to that drug and crack — grew to $300 a day and precipitated several arrests. By 1990, he was “selling my CDs on a corner in exchange for crack rocks.”\n\nWhile attempts at sobriety proved challenging, he writes that since a severe but short relapse in 1995, he “never had another hard drug again.”\n\nThese days, Feldman still acts — often in low-budget horror films — and performs music with his band, Truth Movement. He also has a 9-year-old son named Zen from his second marriage, to Playboy model Susie Sprague, which ended in 2009.\n\nAfter all he went through, Feldman has blunt words for those who propose to drag their children through show business.\n\n“People always ask me about life after childhood stardom. What would I say to parents of children in the industry?” he writes. “My only advice, honestly, is to get these kids out of Hollywood and let them lead normal lives.”", "images": ["https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2020/04/spanx-sale.png?w=300&h=200&crop=1", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=1200", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=618&h=410&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["October"], "canonical_link": "https://nypost.com/2013/10/19/the-childhood-hell-of-the-lost-boys/", "title": "The childhood hell of ‘The Lost Boys’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "The day Corey Feldman met Corey Haim, when they were 14 years old and preparing to work together on the film “The Lost Boys,” they bonded instantly. Both...", "generator": "WordPress.com", "og": {"type": "article", "title": "The childhood hell of ‘The Lost Boys’", "url": "https://nypost.com/2013/10/19/the-childhood-hell-of-the-lost-boys/", "description": "The day Corey Feldman met Corey Haim, when they were 14 years old and preparing to work together on the film “The Lost Boys,” they bonded instantly. Both were young Jewish actors who often competed…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2013-10-20T01:45:24+00:00", "modified_time": "2013-10-20T17:52:04+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@larrygetlen", "site": "@nypost", "text": {"title": "The childhood hell of ‘The Lost Boys’"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=664&h=441&crop=1", "alt": "Corey Haim (left) and Corey Feldman in the 1987 film 'The Lost Boys'", "src": "https://thenypost.files.wordpress.com/2013/10/feldman.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "The childhood hell of 'The Lost Boys'", "description": "The day Corey Feldman met Corey Haim, when they were 14 years old and preparing to work together on the film “The Lost Boys,” they bonded instantly. Both were young Jewish actors who often"}, "fb": {"pages": 225343690812937}, "nypost-section": "Entertainment", "parsely-metadata": "{\"post_id\":\"nypost-1661027\"}", "keywords": "Entertainment,a&e,child stars,drugs,playboy,reality tv", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/0F6krixzNPw?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/Tgt803cFABU?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/_QCg5oQI0Cg?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1382112000.0, "source": "https://nypost.com", "summary": ""}