{"url": "www.theguardian.com/music/2017/jun/11/katy-perry-interview-witness-album-glastonbury", "text": "In among the typical recording detritus of New York’s Jungle City Studios – boxes of foam ear plugs, rolls of tape, untouched buttons on a soundboard the size of a London studio flat – sits a Febreze candle, its lime-green wax emitting a scent like sweetened detergent. It’s the first thing Katy Perry notices as she suddenly appears behind me. “It’s so chic,” she says drolly, her immaculately constructed outfit of orange mesh top, cropped tartan trousers and Adidas sliders topped off by a shiny black pore strip stretched tight across the bridge of her nose. “At some point I’m going to give myself the pleasure of peeling this off,” she laughs, smoothing it down over her bulky nose ring.\n\nSuddenly the mise-en-scene makes perfect sense: surface glamour underpinned by a hint of down-to-earth realness is very much Katy Perry’s MO, and has been since she emerged almost a decade ago with the global hit I Kissed a Girl. Perry is the girl-next-door-turned-megastar you want to hang out with, have a laugh with, possibly talk about blackheads with. If, on the superstar scale, Beyoncé is almost superhuman then Perry prides herself on being, as she puts it later, “super human; like, really human”.\n\nShe recognises me from a previous interview we did three years ago in Belfast, one in which she was hampered by a cold so violent I lost track of the amount of snot I saw her wipe on her sleeve. Today she apologises for being an hour late, and thanks me for pushing my flight back after our initial interview date was postponed by 24 hours. Her tardiness is understandable; she’s just announced details of her fifth album, Witness, her first since 2013’s Prism, a world tour of the same name, and has been busy preparing for that evening’s (we meet in late May) performances on Saturday Night Live.\n\nShe’s keen to make it clear nothing is off limits: “I’m going to give you everything and more,” she beams. But before we start, she shows me her iPhone, which is already recording. “We all know that tone and context are everything, so this might be one of my last print interviews,” she says, setting her phone down next to my Dictaphone. “Because. People. Do. Not. Get. It. These. Days,” she adds, each word punctuated by a handclap. She settles into her chair, grey cardigan resting on crossed legs. While her persona in TV interviews and music videos is often hyperactive, goofy older sister, this afternoon she’s earnest, bordering on businesslike. “This is my disclaimer: my intention is so pure these days,” she states. “I know nothing. All the thoughts and opinions I express are my own. Period, end of story.”\n\nFacebook Twitter Pinterest ‘Don’t let them win’: Perry performing at the One Love Manchester benefit concert at Old Trafford on 4 June. Photograph: Kevin Mazur/One Love Manchester\n\nLike all the best pop superstars, Katy Perry seemed to emerge fully formed – a riot of cartoonish exaggeration – when she bulldozed into the public consciousness in 2008. I Kissed a Girl – a stone-cold pop classic – expertly positioned her in the middle of a perfect storm of tabloid-baiting playfulness, knowing kitsch and just enough relatable charm to keep things family friendly (in 2015 she described her appeal as “soft-serve sexiness”). Alongside the more self-consciously outre Lady Gaga, who emerged the same year, and Single Ladies-era Beyoncé, Perry started to dominate the female-led pop landscape, following I Kissed a Girl with a clutch of sugar-coated hits, before enjoying a purple patch of record-breaking success with 2010’s Teenage Dream. It was an album that defined the two sides of her musical personality – from the candyfloss swirl of California Gurls to the self-help sloganeering of Firework. By the summer of 2011, Perry had become the first woman in US chart history to have five No 1 singles from one album, equalling a record previously held by Michael Jackson in his 80s pomp.\n\nShe also started dominating a more modern popularity metric, becoming the most followed person on Twitter in 2016 (her follower count is steadily creeping towards 100m). In February 2015, in the middle of a gruelling world tour in support of the Prism album, which added Roar and Dark Horse to her growing pop canon, she performed at the Super Bowl halftime show with a stage set that included a gargantuan gold-plated mechanical lion and a beach scene complete with meme-ready dancing sharks. The 12-minute extravaganza garnered the highest Super Bowl ratings of all time, with 118 million people tuning in for Perry (4 million more than for the sports bit either side of it).\n\nHopefully there’s a real change coming. We have to change. We have to shake some things up\n\nWith astute awareness of her position in the pop cosmos, Perry has always understood the power of reinvention, moving from vintage pin-up (One of the Boys) to kitsch vamp (Teenage Dream), to pick-yourself-up-and-carry-on warrior (the more spiritually minded Prism, released after her divorce from Russell Brand). Her current, more politicised iteration feels the boldest. Witness’s first single, February’s disco-pop confection Chained to the Rhythm, heralded what Perry – a long-term supporter of Hillary Clinton – referred to as the arrival of “purposeful pop”, and was written in the aftermath of Donald Trump’s victory. The lyric, rapped by Skip Marley, calls on people to wake up to the world’s troubles: “Break down the walls to connect, inspire / Ay, up in your high place, liars / Time is ticking for the empire.” During her performance of the song at that month’s Brit awards, she was joined on stage by giant skeletal effigies of Donald Trump and Theresa May.\n\nThe song’s intention, it seemed, was to connect the dots to her newly updated Twitter bio that read “Artist. Activist. Conscious” (it’s recently been changed to “I know nothing”). So how does she feel about the election result now? “Listen, there’s a time of mourning. I think with Hillary, it was something bigger than her, and she had to be the person to pull the sword out of the stone and wake up this movement, which is really important. What I started to realise was that it’s not about one person: it’s about the kingdom, it’s not about the king. It’s about us. We write the rules as a community, and so I’m so grateful that Hillary was strong enough to withstand everything and also wake the sleeping giant. We are the sleeping giant.”\n\nShe starts to pick at the pore strip, which ends up flapping at half-mast. “I’m a realist but I’m definitely an optimist, and so hopefully there’s a real change coming, there isn’t just complacency coming. We have to change. We have to shake some things up.”\n\nShe is keen to include those who voted for Donald Trump in her broad church. “That’s something I’m going to do on tour – I can’t wait to meet those people. I just want to hear what they have to say, and hope they can hear what I have to say.”\n\nIn April, Chained to the Rhythm was followed by Bon Appétit, an innuendo-heavy, nudge-nudge wink-wink ode to oral sex (“got me spread like a buffet”) that featured Migos, the Georgia rap trio recently accused of homophobia following a Rolling Stone interview in which they expressed surprise at the support shown to recently out rapper iLoveMakonnen. That same week an Instagram livestream showed an apparently upset Perry, resulting in fans starting a WeLoveYouKaty hashtag. “They tried to make me out to be a victim,” she says. “I am not a victim. I never cried.” On the day Bon Appétit entered the US chart at a lower-than-expected 76, Perry went on holiday. Again, in the hyper-scrutinised world of pop, fans picked up on it. “I went on a vacation that I had planned weeks and weeks ago with my girlfriends. Everybody calm down. Why don’t people ask me what my story is?”\n\nPerry’s story is a unique take on the American dream. Born Katheryn Elizabeth Hudson 32 years ago in Santa Barbara, California, she is the self-confessed “black sheep” daughter of two born-again Christians, both Pentecostal pastors. It was a restrictive, regimented childhood dominated by censorship: secular music was banned (along with her family, she picketed concerts by both Marilyn Manson and Madonna); Lucky Charms cereal was verboten because luck was linked to the devil (devilled eggs became angel eggs), and Perry spent summers at youth groups, some of which, she said recently, were in favour of gay conversion camps. Singing became a form of escapism, both in church and alone with an acoustic guitar she was given at age 13. That same year she persuaded her parents to take her to Nashville to record a gospel album, and, two years later, aged 15, she discovered Queen, an epiphany that broadened her pop horizons. “That was my first perspective on that world, and I just loved it. I felt so free and accepted,” she told Vogue last month.\n\nAt 17 she left school and moved to Los Angeles to pursue a music career. In 2001 an independently released gospel album sold roughly 200 copies, while subsequent record deals with Island and Columbia both came to nothing. “People saw me as damaged goods,” she has said of that time. By 2006, having had a pop/rock album she’d been recording for years shelved, she found herself working for an independent A&R company and singing at open mic nights. A year later, however, those songs ended up with the head of Capitol Records, who promptly signed her. After swapping Hudson for her mother’s maiden name, Katy Perry, the multi-platinum-selling (she’s shifted around 81m singles globally), award-winning, apparently unstoppable hit machine was born.\n\nPart of Perry’s early appeal was a sense of fantasy. The larger-than-life character she’d created – sort of Betty Boop meets LA party girl with a heart – felt like the perfect encapsulation of every young girl’s pop star dreams, with the determined, never-give-up-on-yourself backstory chiming with every TV talent show. (To bring it full circle, Perry has just signed up to be a judge on the returning American Idol.)\n\nI’m not going to please everyone, and I’m not trying to. If you run around pleasing everyone, you’re done\n\nThe reality of Perry’s construction, she says now, was more prosaic. “A lot of people are living in fear from something that happened in their childhood, or some form of PTSD they picked up along the way, and I created this wonderful character called Katy Perry that I very much am, and can step into all the time, but I created that character out of protection,” she says. “I was scared that if you saw me, Katheryn Hudson, the girl wearing the Bioré strip on my nose, you’d be like, ‘that’s not glamorous’. It was me going, ‘OK, I’ve been upset my whole childhood so I’m going to show the world I am something, that I am going to do something and that I am enough’. I didn’t want to be Katheryn Hudson. I hated that, it was too scary for me, so I decided to be someone else.” Finally, she yanks the gloopy strip clean off her nose. She looks at it and sighs. “It didn’t really take enough stuff out.”\n\nThe disadvantage of creating a character with such a broad appeal is that it can be difficult to remain all things to all people, especially when, as she puts it, “liberating [yourself] from everything”. Chained to the Rhythm, though painted with broad brushstrokes, was Perry’s statement of intent, and one with implications, both personally and professionally. She’s respectful of her Republican parents’ political views but keen to engage them in debate. “If you can have patience and don’t flip the table, then a healthy discourse is so important,” she says.\n\nDid she worry about the commercial risks involved? “I’m not going to please everyone, and I’m not trying to. If you run around pleasing everyone, you’re done. If you stand for nothing then you’re done.”\n\nHer words suddenly become more pointed. “I think it’s actually quite selfish: if you’re all about ‘the people’ but you don’t want to help ‘the people’, because you don’t want to say things when things get tough, then what are you about? Protecting your brand? Making sure you don’t lose zeros in your bank account?”\n\nHave you lost money from speaking out? “Some people said, ‘look we can’t do this thing with you any more because we’ve gotten letters’. Basically, corporations are like, ‘don’t have an opinion’, and I’m like, ‘so if I was vocalising for the other side, you’d still get letters, you know that right’. What they’re asking me to do is not to speak at all. So, God bless you on your journey.” She unleashes a huge grin.\n\nGiven purposeful pop’s statement of intent, there was a palpable sense of disappointment from some of Perry’s fanbase in April when Bon Appétit returned to Carry On-style kitsch with its awkward buffet-based sexual metaphors. “[Bon Appétit] is full-on sexual liberation!” Perry insists, visibly annoyed. “Liberation doesn’t just come in the form of talking about politics. Some people will get turned on by it – I’ve seen it happen.”\n\nObviously me and her [Taylor Swift] have our stuff, and I have offered it up to her to work out\n\nWe talk about Migos, and how some of her gay fanbase were disappointed at their inclusion. “First and foremost, I didn’t know about [the Rolling Stone interview] when I met them. I didn’t do a background check. Some people don’t say the things you want them to say, because they don’t know how to say them,” she continues. “There’s also a double standard – no one said anything about Frank Ocean, who worked with them on a track, or Liam Payne, who uses [Migos’s] Quavo [on his new single]. Nobody’s talking about that.”\n\nThe conversation quickly escalates into a broader monologue about the dangers of online tribe wars. “The problem is that these fan groups think that everybody is in competition, and everybody needs to stop with that shit,” she says. “Everybody’s trying to pit everyone against each other, especially with all this bullshit about women hating women. I am so disgusted by it and done with it. You can ask me that question, I can’t speak for [Migos], but anything I do – let me reiterate – my intentions are pure. I don’t know everything, and I’m going to fumble, but don’t fucking double standard me.”\n\nFacebook Twitter Pinterest Perry with former husband Russell Brand at an event in Beverly Hills, 2010. Photograph: John Shearer/WireImage\n\nEven when angry, Perry’s words are often delivered with a measured, Zen-like calm, something she ascribes partly to a new maturity (“I left my 20s, I’ve embraced and surrendered to my 30s, and I love it. I wouldn’t go back at all”) and partly to her passion for transcendental meditation. “TM changed my life,” she says. “I studied it five years ago in India during my wedding [to Brand], and it was an incredible thing that I received from that time. Some people get very nervous about the spiritual connotations of things, but TM is very medical and scientific. This [she prods at her mobile] is the new form of sugar. It’s the new dopamine, the new stimulant, and everybody has 20 minutes once a day to turn it off and meditate. When I do it, I can feel the cobwebs lifting and can feel this halo. I think that TM is a beautiful way to find real stillness. You should do it.”\n\nIts calming influence is on display when talk turns to Taylor Swift and their fractured relationship, said to be the subject of Swift’s song Bad Blood, although neither star is on record as to exactly how the feud began. Swish Swish, Witness’ third single, has reopened old wounds. “You’re calculated, I got your number,” sings Perry over 90s-inspired house, before adding: “Don’t you come for me, no, not today.” Does that song feel like exorcising some demons from your past, I ask. “No, I think the trolls come hard at me all the time,” she says. So it’s not about Taylor Swift? “It’s a message to all of the people who have tried to tear me down. All the haters, the trolls, the negativity. It’s liberation from all of the negativity. It could be liberation from” – she pauses and lowers her voice to a whisper – “the biggest troll that’s in office right now. Why is it one thing?” Before I can answer, she adds: “Obviously me and her have our stuff, and I have offered it up to her to work out. In person. Over the phone. The whole bit. When she’s ready to do that, then I’m ready to do it. I’m ready to just let that all go. We need to have a conversation about it, totally, and I love her, I really do. But this is something that’s different.”\n\nYou can see her point. It feels like a contradiction to, on the one hand, dismiss the constant pitting of women against each other (“it’s the spawn of Satan”, she says), and then on the other to keep stoking the fires of an ongoing feud. Perry surrounds herself with a lot of women – does she prefer female energy right now? “I love the female energy. Females in general are so beautiful and powerful. They’re the ones that have enough power to bring life into this world. I’m not saying they’re better, because everyone plays their role, and a good man is so beautiful. What I’m saying is that women should really know their power and that’s what power is about. It’s about ‘when did you decide to give away your power?’”\n\nWe chat about Perry’s imminent Glastonbury debut; she’s excited about bringing “the bells and whistles and the authenticity in between” to Worthy Farm. “I’ve only been to the luxury of Coachella,” she laughs, referring to the California desert-based festival, which this year hosted an afternoon brunch to help Perry launch her new shoe range. Given the curious decision to have her warming up on the Pyramid stage for beardy alt-rockers the National and default festival fodder Foo Fighters, would she like to one day come back and headline? “Sure, if they’ll have me.” She shrugs. “I’m happy with where I’m at. The thing is, don’t cry for me. I’m all right. I’m happy.”\n\nAt one point, as the interview starts to unspool and our time together comes to an end, we get into a surreal discussion about ice-cream flavours, and an off-the-cuff comment about a song being “too vanilla” leads to raised voices and dodgy accents.\n\n“Do you know what real, homemade Italian vanilla tastes like, with vanilla bean? It’s the most luxurious taste in the world.”\n\nI just see vanilla as a bit basic, I confess.\n\n“People like vanilla!” she screams in mock anger, her springy office chair bouncing up and down. “That’s why it’s one of the top three Neapolitan flavours, motherfucker! It’s strawberry, chocolate and vanilla!”\n\nThe word vanilla starts to roll around her mouth with a slight New York-Italian twang. “Who the fuck said vanilla is the barometer for basic? People like vanilla!”\n\nThe conversation ricochets back to Witness. “There are 15 flavours on the record!” she says. “Get your Rocky Road, get your vanilla, get your chocolate, get your strawberry, get your mint and chip – they’re all there.”\n\nFacebook Twitter Pinterest ‘Gloriously anarchic’: Katy Perry poses with fans as she leaves her intimate gig at the the Water Rats in King’s Cross last month. Photograph: Ricky Vigil/GC Images\n\nFive days later, and those various flavours are being road-tested in the unlikeliest of environments. Nine years after she made her UK live debut at the Water Rats, a dingy, shoebox pub venue in London’s King’s Cross, Perry’s back there, performing at the launch of the new Capital Breakfast show. It’s a gloriously anarchic, hit-stuffed hour that starts with Perry trying to connect to the internet so she can livestream the show to the millions who couldn’t make it. “You know me, always doing the most, always trying to do it all,” she laughs. At one point she gives her phone to a guy in the front row so he can film it, before kissing a female fan full on the lips during I Kissed a Girl. “I love this because there’s no format for tonight,” she beams. “It could be anything!”\n\nLater, before a stripped-back version of 2012’s plaintive Part of Me, she refers to the Manchester terrorist attack, and the unifying power of music (she will go on to play at the One Love fundraiser alongside Ariana Grande, Liam Gallagher and Justin Bieber, among others). “Whatever you can do to help, you should – and if you can’t do anything, that’s fine,” she says through tears. “But what you should do is not let them win.”\n\nIt’s a powerful moment, and one that seems to amplify the gig’s back-to-basics catharsis for Perry. “When I come to the UK, I’m going to do a ton of these types of shows,” she says later, eyebrow slightly raised as she adds the inevitable, “I want to get intimate with you.”\n\nBefore the closing self-empowerment treaty of Roar, the super-fans pressed at the front launch into an impromptu rendition of Fingerprints from 2008’s One of the Boys, a rallying cry to overcome people’s expectations. By the time the assembled chorus gets to “I’m leaving you my legacy, I got to make my mark,” Perry joins in, screaming the lyrics she wrote all those years ago when she was still unknown. “I got to run it hard,” she sings, a huge grin smeared across her face, “I want you to remember me.”\n\nKaty Perry’s Witness is out now (on Capitol). She plays Glastonbury’s Pyramid stage on 24 June, returning to the UK on her world tour in June 2018", "images": ["https://i.guim.co.uk/img/media/2ab96eda37f262ed0ae945b808cda6f4ab0e93a5/0_140_3000_1800/master/3000.jpg?width=300&quality=85&auto=format&fit=max&s=75050d6c1e500075cf810163fa0d52de", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Katy+Perry%2CPop+and+rock%2CMusic%2CCulture", "https://i.guim.co.uk/img/media/da6700f71063220241fc3db86f3c76464804d532/0_51_3600_2160/master/3600.jpg?width=300&quality=85&auto=format&fit=max&s=55dd14f150c9c2024559b1f99c54442e", "https://i.guim.co.uk/img/media/2e65f64b554dda5446e71277b1aade68ff9a1e30/0_99_3000_1800/master/3000.jpg?width=300&quality=85&auto=format&fit=max&s=2586d51738ce5e3849ed973dcb9f3232", "https://i.guim.co.uk/img/media/2dedc4a73e80fbf9626de0e5570b11a94f7f11a6/25_0_773_464/master/773.jpg?width=300&quality=85&auto=format&fit=max&s=1338c4605d398f6647e6b380ff40510b", "https://i.guim.co.uk/img/media/cb37188e379d8c358732e4a9e7aa72ac95c42cad/0_110_3500_2100/master/3500.jpg?width=300&quality=85&auto=format&fit=max&s=a3ea064b07cde3b6d293a8888cdcabb6", "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=bf71d17f58783d41b23c8f232791ef70", "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=300&quality=85&auto=format&fit=max&s=093f64c5ce46266baf5cdde7fc7ded5d", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/fad5f19ab8bc523344a9a9e856672bb835582f8c/0_0_2019_1211/master/2019.jpg?width=300&quality=85&auto=format&fit=max&s=6cbb0411b7fa51c4b2862e333e1e4f2b", "https://i.guim.co.uk/img/media/6426b4ac9ba9a6ab461e1fd32b23e998f4b7c05d/0_0_2115_3000/master/2115.jpg?width=300&quality=85&auto=format&fit=max&s=8e5930e505dbe0ac3993ef9e401d62a8"], "top_img": "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=bf71d17f58783d41b23c8f232791ef70", "keywords": [], "authors": ["Michael Cragg"], "canonical_link": "https://www.theguardian.com/music/2017/jun/11/katy-perry-interview-witness-album-glastonbury", "title": "‘I created this character called Katy Perry. I didn’t want to be Katheryn Hudson. It was too scary’", "meta_data": {"description": "On the eve of her fifth album and Glastonbury debut, the pastors’ daughter-turned-hit machine talks about ‘purposeful pop’, the joy of meditation, and her feud with Taylor Swift", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Michael Cragg", "thumbnail": "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=620&quality=85&auto=format&fit=max&s=214aa1554050a86a5bd2f6f1e058fe1a", "keywords": "Katy Perry,Pop and rock,Music,Culture", "news_keywords": "Katy Perry,Pop and rock,Music,Culture", "og": {"url": "http://www.theguardian.com/music/2017/jun/11/katy-perry-interview-witness-album-glastonbury", "image": "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=bf71d17f58783d41b23c8f232791ef70", "description": "On the eve of her fifth album and Glastonbury debut, the pastors’ daughter-turned-hit machine talks about ‘purposeful pop’, the joy of meditation, and her feud with Taylor Swift", "type": "article", "title": "‘I created this character called Katy Perry. I didn’t want to be Katheryn Hudson. It was too scary’", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/michaelcragg", "publisher": "https://www.facebook.com/theguardian", "section": "Music", "published_time": "2017-06-11T07:59:49.000Z", "tag": "Katy Perry,Pop and rock,Music,Culture", "modified_time": "2018-03-21T23:51:19.000Z"}, "al": {"ios": {"url": "gnmguardian://music/2017/jun/11/katy-perry-interview-witness-album-glastonbury?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://music/2017/jun/11/katy-perry-interview-witness-album-glastonbury?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/music/2017/jun/11/katy-perry-interview-witness-album-glastonbury", "iphone": "gnmguardian://music/2017/jun/11/katy-perry-interview-witness-album-glastonbury?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/f5c1ab9ea0a0e3cccaa708558918cdb300c126d2/0_635_4480_2687/master/4480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&s=274c3afe921cb6fe2c4bbc703e6ff726", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/cx1pQiETQm4?wmode=opaque&feature=oembed"], "publish_date": 1497110400.0, "source": "http://www.theguardian.com", "summary": ""}