{"url": "www.theguardian.com/science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture", "text": "Robin William’s widow Susan has revealed the beloved actor was struggling with dementia with Lewy Bodies . This may help to explain his tragic actions, as despite being relatively unfamiliar, it is a deeply serious and unpleasant condition\n\nNearly a year and half ago, I wrote a piece about suicide and depression in the wake of Robin Williams’ death. You may have read it. A lot of people did. I didn’t expect to have revisit this subject again, and yet here we are. But for good reason.\n\nThe original piece, and the unpleasant comments from numerous people that first inspired it, stemmed from the widespread assumption that Robin Williams ended his life due to struggles with depression, a condition he was known to have dealt with often.\n\nHowever, a recent interview with his widow, Susan Williams, reveals that the beloved actor was actually struggling with dementia with Lewy Bodies, sometimes known as Lewy Body dementia. While making the loss of such a beloved individual no less tragic, this does throw a different light on matters.\n\nDementia with Lewy Bodies is not as common or well known as depression, or the more familiar forms of dementia, most obviously Alzheimer’s disease. However, even among the grim spectrum of neurological disorders and mental illnesses, dementia with Lewy Bodies is a particularly nasty condition. Here’s why.\n\nWhat are Lewy Bodies?\n\nThe most obvious question when encountering dementia with Lewy Bodies is, what are Lewy Bodies? What do they do? Why are they important? What damage do they cause?\n\nPut simply, Lewy Bodies are lumps, known as aggregates, of misshapen protein (of the type Alpha-synuclein) that occur in nerve cells (neurons) of people with certain conditions, most often Parkinson’s disease, and but also (obviously) dementia with Lewy Bodies. Cells as complex and important as neurons produce a bewildering array of proteins, to aid in the necessary functions and form the delicate cytoskeletal structure in place to maintain everything.\n\nSometimes, certain proteins are formed wrongly, and rather than integrating seamlessly into the cell they form (relatively) big clumps. Exactly why this happens is currently unknown, but the fact that it occurs in cells throughout the brain suggests some sort of underlying genetic effect.\n\nWhatever the initial cause, these protein aggregates build up in neurons, and are believed to clog and disrupt the vital processes taking place within, damaging the cell and eventually causing it to die. Similar processes are believed to take place in other neurodegenerative disorders, like tau tangles in Alzheimer’s disease, and inclusion bodies in Huntington’s disease.\n\nWhat problems do they cause?\n\nThe thing about dementia with Lewy Bodies is that it’s not at all restrained when it comes to causing debilitating symptoms. The Lewy Bodies occur in regions throughout the brain, all of which provide important, often crucial functions for everyday life. The presence of Lewy Bodies mean multiple problems occur in conjunction, but for a diagnosis of probable dementia with Lewy Bodies, two of the following three symptoms must be evident\n\nFluctuating cognition with pronounced variations in attention and alertness (meaning a wildly varying level of mental ability and thinking)\n\n\n\nRecurrent visual hallucinations that are typically well formed and detailed (striking and persistent hallucinations, seeing things that aren’t there)\n\n\n\nSpontaneous motor features of Parkinsonism (stiffness, tremor, involuntary jerks etc.)\n\n\n\nWe say “probable” dementia with Lewy Bodies because at present it can only be confirmed with a post-mortem. But there are numerous features that back up a diagnosis of dementia with Lewy Bodies if added to the three core symptoms above, and these include sleep disruption, repeated falls, non-visual hallucinations, loss of consciousness, delusions and, back where we started, depression.\n\nTaken all together, a severe case of dementia with Lewy Bodies means you potentially can’t think, can’t sleep, can’t stay awake, can’t trust what you see, can’t move, can’t understand what’s going and can’t be happy. Judging by her Susan Williams’ comments about the speed of progression of his symptoms, it sounds like Robin Williams had a severe case of dementia with Lewy Bodies.\n\nHow common is dementia with Lewy Bodies?\n\nCurrent figures suggest that dementia with Lewy Bodies is the third most common type of distinct dementia, after Alzheimer’s disease and vascular dementia successively. Around 4% of dementia cases are believed to be dementia with Lewy Bodies (although some estimates put it as high as 10%), and that’s an increasingly large number. With 850,000 dementia sufferers in the UK at present, and an increasingly ageing population meaning this is predicted to increase to 1.15 million over the next 10 years, this means we can expect to see 46,000 cases of dementia with Lewy Bodies by 2025 in the UK alone.\n\nThe most likely people to develop dementia with Lewy Bodies are men, aged early 60s to 70s. Sadly, Robin Williams fell right into this category.\n\nWhy isn’t it more well-known?\n\nAs stated, it’s not the most common dementia. Alzheimer’s disease, the most familiar type of dementia, is far more common, and tends to get the most attention and recognition as a result. Dementia with Lewy Bodies is also somewhat hard to pin down. You’re relying on observations of people who have it, and as detailed above their current mental state is severely compromised, so it’s very hard to get consistent or reliable reports from them on what they’re experiencing.\n\nThis is also compounded by the fact that not every possible symptom occurs in every patient, and many symptoms are also evident in other types of dementia, further confounding diagnosis. The big overlap with Parkinson’s disease is the same problem from another angle.\n\nOn top of this, there’s also disagreement among the relevant experts as to how to classify it. Some argue that it shouldn’t be a distinct type of dementia and is more of a subtype of Parkinson’s disease, but the current consensus is that it is a separate disorder. But if even the experts in possession of all the available data can’t quite agree on what it is, it’s unsurprising that more among the general public don’t have much of an idea about it.\n\nWhat can be done about dementia with Lewy Bodies?\n\nThere’s little to be done about it, sadly. Behavioural and therapeutic interventions exist that can help manage the symptoms, but that’s about it. Some pharmacological treatments may help, but frustratingly dementia with Lewy Bodies rules out some of the already limited drugs for neurological disorders. Levodopa, the typical treatment for symptoms of Parkinson’s disease, is known to worsen the mental symptoms of dementia with Lewy Bodies. And antipsychotics are ruled out entirely, as they exacerbate things to the point where risk of death is greatly increased.\n\nSo it wasn’t depression?\n\nAs Susan Williams said, if Robin Williams had depression at the time of his death, it was one of countless other symptoms he was dealing with. A look at the brief summary above shows just how all-consuming dementia with Lewy Bodies can be.\n\nBut depression and dementia with Lewy Bodies often occur together, as is the case with most dementias. This is entirely understandable; it would take someone of superhuman mental fortitude to not let such a diagnosis affect them very deeply.\n\nWe will never know exactly what Robin Williams was thinking when he opted to end his own life, and at this point it seems disrespectful and more than a little sinister to keep asking. However, given the number of things dementia with Lewy Bodies can put a person through, accusations of “selfishness” now seem more unwarranted than ever.\n\nThe NHS has detailed information on dementia with Lewy Bodies for individuals who may be concerned or interested in the condition. Organisations like The Alzheimer’s Society, Parkinson’s UK or The Mental Health Foundation are also available to help.\n\nDean Burnett would really rather not have to write about this again, to be honest. He’s on Twitter, @garwboy", "images": ["https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63f9c39a11ba6843e53a2f8ae2fd0db8", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Science%2CNeuroscience%2CDementia%2CRobin+Williams%2CMental+health%2CPsychology", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=300&quality=85&auto=format&fit=max&s=4998d0238129bfc25995bf46cfd63cba"], "top_img": "https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63f9c39a11ba6843e53a2f8ae2fd0db8", "keywords": [], "authors": ["Dean Burnett"], "canonical_link": "https://www.theguardian.com/science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture", "title": "Robin Williams, depression and dementia: the clinical picture", "meta_data": {"description": "Dean Burnett: Robin Williams was diagnosed with dementia with Lewy Bodies. That such a beloved individual was struck with such a terrible condition is yet another tragedy.", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Dean Burnett", "thumbnail": "https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=620&quality=85&auto=format&fit=max&s=56d6d0a01bbd71e33f2c79516e3fec82", "keywords": "Science,Neuroscience,Dementia,Robin Williams,Mental health,Psychology", "news_keywords": "Science,Neuroscience,Dementia,Robin Williams,Mental health,Psychology", "og": {"url": "http://www.theguardian.com/science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture", "image": "https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63f9c39a11ba6843e53a2f8ae2fd0db8", "description": "Dean Burnett: Robin Williams was diagnosed with dementia with Lewy Bodies. That such a beloved individual was struck with such a terrible condition is yet another tragedy.", "type": "article", "title": "Robin Williams, depression and dementia: the clinical picture", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/dean-burnett", "publisher": "https://www.facebook.com/theguardian", "section": "Science", "published_time": "2015-11-04T16:19:52.000Z", "tag": "Science,Neuroscience,Dementia,Robin Williams,Mental health,Psychology", "modified_time": "2018-02-14T21:14:14.000Z"}, "al": {"ios": {"url": "gnmguardian://science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture", "iphone": "gnmguardian://science/brain-flapping/2015/nov/04/robin-williams-depression-and-dementia-the-clinical-picture?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/bb20e0e30902f87a2279ee7e2bf5be4bb5544a8c/604_185_2082_1249/master/2082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=d322283ef7a8c17e42027a9ad1253427", "site": "@guardian", "card": "summary_large_image", "creator": "@garwboy", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1446566400.0, "source": "http://www.theguardian.com", "summary": ""}