{"url": "people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "text": "Kylie Jenner was first spotted with rapper Travis Scott in April 2017 after splitting from her on-again, off-again boyfriend Tyga.\n\nSince first linking up, the couple’s whirlwind romance has included low-key dates, flashy birthday presents and quality time with the KarJenner crew — Scott even got the famous family’s seal of approval. And now, the couple are parents to daughter Stormi.\n\nGet push notifications with news, features and more.\n\nIn honor of the couple’s joint GQ cover, we’re taking a look back at the pair’s relationship.\n\nFIRST SPOTTED TOGETHER AT COACHELLA — APRIL 2017\n\nDuring an off phase of Jenner’s relationship with Tyga, the reality star was spotted getting cozy with Scott at a Coachella party. “Travis and Kylie have been friends for a while and they all hang out,” a source told PEOPLE at the time. “When she and Tyga are having drama, she tries to make him jealous by hanging out with other guys.”\n\nBut it turns out Scott has been close with the Jenner sisters for quite some time: He even performed at Kendall Jenner’s star-studded 21st birthday bash in November 2016.\n\nPACKING ON PDA — APRIL 2017\n\nImage zoom Bob Levey/Getty\n\nA few weeks after hanging out at Coachella together, the couple seemed to make their love official by getting cuddly at an NBA playoff game in Houston, Texas.\n\nAccording to an onlooker at the Houston Rockets vs. Oklahoma City Thunder game — where Scott performed before tip-off — the Keeping Up with the Kardashians star and the hip-hop artist were spotted holding hands and “definitely looked like a couple.”\n\n“During his performance, Kylie was hiding in the Rockets’ courtside club anxiously waiting for him to come back to her. Once he got back, they definitely looked like a couple, cuddled up next to each other among her friends,” said the onlooker, who attended the game and spotted Jenner kissing Scott’s neck.\n\nA SHOW OF SUPPORT — APRIL 2017\n\nJenner headed to Bentley University outside Boston to support her beau. Located just outside Boston in the town of Waltham, Bentley was celebrating their annual Spring Day, which always included a big a concert on campus featuring Scott.\n\nLater, the couple headed to Boston’s Theater District where Scott made an appearance at Bijou nightclub\n\n“He was definitely looking for something intimate,” one club-goer told PEOPLE. “They also talked a lot. Like, actually having a conversation. They were dancing at the club. They were definitely super into each other. He didn’t really perform, he just showed up and partied. They left in the same car too.”\n\nGETTING HANDSY — JUNE 2017\n\nImage zoom GAMR / BACKGRID\n\nThe Keeping Up with the Kardashians star stopped by the rapper’s Los Angeles home, where the duo were spotted getting handsy with one another. Scott was spotted grabbing the bum of the then-19-year-old Kylie Cosmetics founder, who sported a black sweatshirt, with a red rose-embroidered hoodie, and fitted black leggings. At one point during their romantic embrace, Scott lifted up the reality star into the air as they snuggled up in front of the black Cadillac SUV outside of his residence.\n\nMATCHING INK — JUNE 2017\n\nImage zoom Kylie Jenner Snapchat\n\nJenner and Scott attended Khloé Kardashian‘s 33rd birthday party at TAO in Los Angeles, where they were “all over each other,” said the source.\n\n“They recently got matching butterfly tattoos on their ankles that they were showing off to their friends and family,” the insider added. “They were super affectionate and Travis was constantly kissing Kylie on the cheek and whispering in her ear. Their relationship seems to be getting stronger and they’re closer than ever.”\n\nJenner also went on to get an ankle tattoo (in tribute to ex Tyga) redone — transforming what once was a lowercase “t” to a lowercase “la.”\n\nMATCHING RINGS — JUNE 2017\n\nImage zoom CPR/Premiere/BACKGRID\n\nFirst matching tattoos, now this?! Jenner and Scott seemed quite determined to make their love known, and their latest romantic display came in the form of matching rings. The Keeping Up with the Kardashians star and the rapper were spotted out in Los Angeles, both wearing sparkling bands on their ring fingers.\n\nRELATED: Is This When Travis Scott Found Out Kylie Jenner Was Pregnant with His Child?\n\nBIRTHDAY BLING — AUGUST 2017\n\nImage zoom BACKGRID\n\nOn her 20th birthday in August, the Life of Kylie star enjoyed a low-key family celebration at home before hitting a movie theater with Scott. But what fans were quick to point out was the fact that Jenner was sporting some new bling — a very sparkly new diamond necklace, which was a birthday gift from her rapper-boyfriend.\n\nSEAL OF APPROVAL — AUGUST 2017\n\nImage zoom INSTARimages.com\n\nRELATED PHOTOS: All the Outfits Kylie Jenner Has Worn to Hide Her Pregnancy\n\nThough Jenner and Scott’s relationship was still rather new at the time, her family was definitely on board with the romance: A source told PEOPLE in August that the KarJenner crew “loves Travis.”\n\n“Kylie and Travis are doing great,” said the source. “There’s no drama with Travis. He’s a cool guy.” “He treats Kylie with a lot of respect and love,” added the source. “Kylie is very happy.”\n\nBABY ON BOARD — SEPTEMBER 2017\n\nIn September, multiple sources told PEOPLE the Kylie Lip Kit creator was pregnant with her first child. “They started telling friends a few weeks ago,” said the source. “The family has known for quite some time. She is really excited and so is Travis.” Another source close to the family told PEOPLE: “It is an unexpected but completely amazing turn of events that she could not be more excited or thrilled about.”\n\nNEW PARENTS — FEBRUARY 2018\n\nAfter months of keeping fans in the dark, Jenner confirmed pregnancy rumors and announced she and boyfriend Scott had welcomed their first child, daughter Stormi Webster, together on Feb. 1.\n\n“After the baby was born, Kylie was relieved that the moment was finally here,” a source told PEOPLE. And even though the delivery room was “a bit chaotic with all the family and friends around,” the source added that the 20-year-old “was overwhelmed in a good way — overwhelmed with the joy, love and support everyone was giving to her and Travis.”\n\nHAPPY TIMES — FEBRUARY 2018\n\nThe Keeping Up with the Kardashians star became a first-time mom on Feb. 1 when she welcomed daughter Stormi with her rapper boyfriend Travis Scott, who has his own place but is co-parenting with Jenner. “Despite being new parents, Kylie and Travis are still in a new relationship too. Kylie is happy with their living situation,” a source close to Jenner told PEOPLE. “Travis is a great dad. When he wants to work, Kylie is supportive.” The source added that the Kylie Lip Kit creator “has everything she needs right now and seems very happy.”\n\nHOT WHEELS — MARCH 2018\n\nImage zoom Kylie Jenner/Instagram\n\nShowing off two sleek and shiny new cars, Jenner hinted that the vehicles were meant for her and her boyfriend when she captioned the shot, “mom and dad.” While one of the vehicles is a bright orange Lamborghini Aventador, the other appears to be a matching model in a darker hue.\n\nBIRTHDAY BOY — APRIL 2018\n\nImage zoom Kylie Jenner/Instagram\n\nTo celebrate boyfriend Travis Scott’s 26th birthday on April 30, Jenner had a private party at Six Flags Magic Mountain in Los Angeles, which was attended by her sisters Kendall Jenner, Kourtney Kardashian, Kim Kardashian West and her husband Kanye West. “Rented out six flags for baby’s birthday,” she wrote alongside a video of the start of one of the night’s many roller coaster rides on her Instagram Story. “They’ve never been.”\n\nCOVER STARS — JULY 2018\n\nImage zoom Ronald Martinez/Getty\n\nGracing the cover of GQ’s August issue, Jenner and her boyfriend are opening up about how they first met, how their lives have changed since they welcomed daughter Stormi — and whether they’re worried about the so-called “Kardashian curse,” the belief that all the men who date a member of the famous family ultimately end up derailing.\n\n“I don’t even be looking at motherf—ers,” he told the magazine. “I don’t be looking at s—. Kylie actually likes me for me. Man, hell nah. Nervous for what? I’m on my own island. So hey, come over there to Astroworld. I’m not into all the other s—. I don’t get involved. I’m over here. Kylie is different.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkylie-b1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fjenner-scott-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkylie-jenner7.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkylie02.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Ftravis-kylie.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fkylie-jenner-travis-scott-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fkylie-c.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fkylie-jenner9-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkylie-jenner11.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fkylie-jenner3-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Ftravis-kylie.jpg", "keywords": [], "authors": ["Grace Gavilanes"], "canonical_link": "https://people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "title": "From Welcoming a Baby Together to Their Joint GQ Cover: Inside Kylie Jenner & Travis Scott's Whirlwind Romance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celeb Relationships,Couples,Kylie Jenner,News,Specials,Travis Scott", "news_keywords": "Celeb Relationships,Couples,Kylie Jenner,News,Specials,Travis Scott", "description": "Kylie Jenner and Travis Scott, who were first spotted together in April 2017, are parents to daughter Stormi", "og": {"title": "From Welcoming a Baby Together to Their Joint GQ Cover: Inside Kylie Jenner & Travis Scott's Whirlwind Romance", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "description": "Kylie Jenner was first spotted with rapper Travis Scott in April 2017 after splitting from her on-again, off-again boyfriend Tyga. Since first linking up, the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Ftravis-kylie.jpg", "width": 1500, "height": 785}}, "pinterest": {"url": "https://people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "description": "Kylie Jenner and Travis Scott, who were first spotted together in April 2017, are parents to daughter Stormi", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Ftravis-kylie.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "title": "From Welcoming a Baby Together to Their Joint GQ Cover: Inside Kylie Jenner & Travis Scott's Whirlwind Romance", "description": "Kylie Jenner and Travis Scott, who were first spotted together in April 2017, are parents to daughter Stormi", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=785&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Ftravis-kylie.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/BhIEIO0vaBE"], "publish_date": null, "source": "http://people.com", "summary": ""}