{"url": "https://ew.com/tv/2018/01/23/this-is-us-milo-ventimiglia-jack-death/", "text": "This Is Us type TV Show network NBC Where to watch Close Streaming Options\n\nNow that the mystery of what happened to Clooney the cat has been resolved, and the issue of whether Miguel was in love with Rebecca while Jack was still alive seems to have been resolved, it’s time to face the flames that are currently engulfing the Pearson home and focus on the real burning question: How exactly did Jack meet his maker?\n\nThe mystery encasing the demise of the beloved-yet-flawed Super Dad, played by the Emmy-nominated Milo Ventimiglia, may not be the most intriguing or nuanced part of This Is Us, but it has generated the most chatter, looming over NBC’s feelings-focused family drama ever since the fifth episode of season 1, when Kate (Chrissy Metz) introduced her urn-based father to Toby (Chris Sullivan). The show has toyed with expectations of revelation ever since then — we are all inquisitive Toby, dying to be in the know! — most notably by withholding the answer in the season 1 finale, much to fans’ frustration, and also by occasionally doling out tantalizing clue morsels such as the approximate time of death (the Big Three were only teenagers when he died), the family member that feels the most guilt about it (Kate), a likely cause of demise (fire), and how tragedy may have been avoided (if only the smoke detector had a new battery!).\n\nLast summer, This Is Us creator Dan Fogelman promised that audiences would finally receive the critical information they’ve been craving during the second season — and they wouldn’t have to wait all the way until the series finale to get it. Clues were conspicuously placed in the past-flashforward in the season 2 premiere: Kevin’s cast, Kevin’s whereabouts, Randall with his red-headed girlfriend, Kate with an unfamiliar dog, Rebecca in a Steelers jersey. Given that tonight’s closing image was of that a very eager fire, and that those clues have been accounted for in our story, and that only four episodes are left to air before the finale — one of them situated in the plum post-Super Bowl slot — it appears that the grim reaper will come knocking as early as next episode, something confirmed in the promo for the Super Bowl installment that ran after the episode.\n\nImage zoom Ron Batzdorff/NBC\n\nFans had long been theorizing about the precise manner of Jack’s death, ranging from a plane crash to a heart attack to a drunk driving accident (he is a recovering alcoholic) to Miguel (Jon Huertas) murdering Jack. Then came a key clue, which dropped at the end of the season 2 premiere, as Rebecca (Mandy Moore) was seen wailing in front of the burned down Pearson home. (That led to more theories, including this creative one, that the longstanding washing machine — a.k.a., the best washing machine in the whole world — was the spark for tragedy.) Did Jack indeed go out in a blaze of glory? With each cliffhanger clue, it seems more likely. And the final seconds of Tuesday’s episode — a montage of wonderful family memories juxtaposed with flames winding through the house, caused by that faulty slow cooker — will only add fuel to the fire that a fire fueled his death.\n\nVentimiglia has found it “amazing that people are so engaged” by the morbid mystery. Surprisingly enough, though, fans have restrained themselves in running their theories by him over the last year, and that’s something he has appreciated. “It’s very respectful as well as kind because I don’t want to sit there and deflect too much,” he told EW earlier this season, “because I’m sure at some point someone’s going to say something that’s going to ring true, and then my talent as an actor is really going to come to the forefront. It’s the hardest position to be in, because I want people to know, but I also want them to wait for it.” (As for debunking any theories, all he’ll say is: “It’s not Colonel Mustard with a wrench in the library. It feels like a game of Clue, right?”)\n\nFor the record, Ventimiglia is sympathetic to those fans who felt let down when left hanging at the end of season 1. “I absolutely understand how the audience wanted to see Jack’s death because it was teed up for that,” he says. “I don’t think they were led to believe that it was happening; they just had a desire because it felt like the biggest moment for this family was their father passing.” He can relate to viewers’ desire to simply fast-forward to The Answer: “I think people want to get to it so they can have acceptance, they can have closure, they can have an understanding moving forward.” But he believes they should leave their theories and expectations at the door. “Having the understanding that these kids and this woman are going to lose a massive part of their family should be enough that whatever happens — or how it happens — should be satisfying enough. Or heartbreaking enough,” he says. “How do you applaud a man’s death, especially a good man? People should just understand that it’s coming and wait and process it when it does. Not everybody has the luxury to know that death is coming — but we all know that Jack’s death is coming.”\n\nAnd when death actually becomes him, how traumatic and teary will it be?”It’s just an absolute soul-crushing event,” he answers. “Once you figure out the moment where it’s going to happen, you may get some hope — and then it’s all going to go away.” He has another way of putting it: “I think the best thing I can say — or the worst thing I can say — is: It’s going to be f—ing painful.”\n\nOf course, This Is Us is no stranger to piercing, poignant passings — last season’s third-to-last episode featured the bittersweet loss of the terminally ill William (Ron Cephas Jones), an event Ventimiglia says “crushed” him. And as intense and heartbreaking as “Memphis” proved to be, the episode that takes down Jack will cut and resonate even deeper. “When they learn what happened to Jack, I think people are going to find themselves surprised with their own emotion,” he continues. “I really think people are going to have a hard time accepting it, but what they should know is that even when we do find out Jack’s death, it doesn’t mean that Jack goes away. That’s a good thing to remind people of — I’m not going away from the show, Jack is still around. There is still so much story to mine in this world of This Is Us.” He adds with a laugh: “I think at that point then you gotta start wondering if anyone else is going to die. I’m going, ‘Whoo! All right! I’m off the hook!'”\n\nThere is also the matter of Kate’s guilt — “I’m the reason he’s dead,” she tearfully told Toby last season — and more light will be shed on that darkness. How justifiable is her guilt? “I would say it’s all pretty accurate and really devastating to her,” he says. “It’s something she still hangs onto. It took her a long time to be able to talk about her father, and she’s still not giving Toby everything she feels about Jack’s passing. She’s had to battle her demons, and a lot of that stuff is going to come to the front of her story line.”\n\nVentimiglia hopes that fans don’t become so consumed with the mystery and mystique of Jack’s death that they lose sight of the proud papa himself. “I still say to people, ‘Focus on the man’s life and don’t show me at least how much you’re salivating for his death,” he says. “I’m like ‘Man, wait ’til people find out this next bit of information that they’re going to start to understand about Jack or the family.’ God, there’s so much still to learn about these people, so I hope people can get the satisfaction of the death and move on — and understand it goes even deeper.”\n\nTo read what hints This Is Us creator Dan Fogelman dropped about Jack’s death — and the post-Super Bowl episode on Feb. 4 — click here.\n\nTo see how Crock-Pot defended its slow-cookers after fans’ fiery fears, click here.\n\nFor more This Is Us scoop, follow @dansnierson on Twitter.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F03%2Fnup_185862_1462-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg", "keywords": [], "authors": ["Dan Snierson", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2018/01/23/this-is-us-milo-ventimiglia-jack-death/", "title": "This Is Us: Milo Ventimiglia calls Jack's death a soul-crushing event", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Milo Ventimiglia", "news_keywords": "Milo Ventimiglia", "description": "The star of the NBC dramedy star says the patriarch's death will be 'painful' to watch", "og": {"title": "'This Is Us' star Milo Ventimiglia warns Jack's death will be an 'absolute soul-crushing event'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/01/23/this-is-us-milo-ventimiglia-jack-death/", "description": "Now that the mystery of what happened to Clooney the cat has been resolved,&nbsp;and the issue of whether Miguel was in love with Rebecca while&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2018/01/23/this-is-us-milo-ventimiglia-jack-death/", "description": "The star of the NBC dramedy star says the patriarch's death will be 'painful' to watch", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/01/23/this-is-us-milo-ventimiglia-jack-death/", "title": "'This Is Us' star Milo Ventimiglia warns Jack's death will be an 'absolute soul-crushing event'", "description": "The star of the NBC dramedy star says the patriarch's death will be 'painful' to watch", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F07%2Fnup_176073_07991-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1516636800.0, "source": "https://ew.com", "summary": ""}