{"url": "www.thesun.co.uk/tvandshowbiz/1274188/oj-simpsons-prison-guard-claims-khloe-kardashian-begged-the-disgraced-star-for-a-paternity-test-to-find-out-if-he-was-her-real-dad/", "text": "KHLOE Kardashian reportedly begged OJ Simpson for a paternity test in order to find out if he was her real father.\n\nOJ's prison guard, Jeffrey Felix, claims he heard the pair having a conversation at Lovelock prison in Nevada, where Simpson is serving a 33-year jail term for robbery.\n\n8 OJ Simpsons prison guard has claimed he heard Khloe Kardashian begging OJ for a paternity test\n\nJeffrey spoke in an upcoming documentary, Kardashian: The Man Who Saved OJ Simpson about his claims.\n\nKhloe's father Robert Kardashian became famous for his friendship with OJ and represented him at his 1995 murder trial for the murders of his ex-wife Nicole Brown and Ronald Lye Goldman.\n\n8 Robert Kardashian represented OJ Simpson during his 1995 murder trial for the deaths of his ex-wife Nicole Brown and Ronald Lye Goldman Credit: Getty Images\n\n8 A new documentary looks at Robert Kardashian's role in OJ Simpson's murder trial back in 1995 Credit: Getty Images\n\nRobert and Khloe's mother Kris were married for 13 years and had Kim, Kourtney, Khloe and Rob together.\n\nHowever, there have been repeated rumours that Robert was not Khloe's biological father with his third wife, Ellen Pierson recently questioning his paternity.\n\n8 Rumours about Khloe's paternity have come up a number of times in recent years Credit: Splash News\n\nSpeaking in the documentary, which will air tonight on US channel Reelz, OJ's prison guard Jeffrey speaks about Khloe's relationship with the disgraced football star.\n\nHe said: \"Khloe is his favourite.\n\n\"The mom Kardashian does not talk to OJ. She's upset with OJ for thinking that he killed her best friend, Nicole Brown.\n\n\"But I know he still talks to Khloe behind her back.\n\n\"In the prison, the phone calls have to be made out by OJ, so he would call at least once a week. That was his way of keeping up with the Kardashians...\"\n\nHe then claims that her paternity came up in one of these conversations and OJ tried to calm her down.\n\nJeffrey said: \"One day I could hear Khloe screaming in the phone.\n\n\"He said she was upset because she wanted him to take a paternity test, because the media is all over him, to see if OJ is her actual dad - and OJ told her 'no'.\n\n\"A few minutes after that phone call he pulled me up and asked me what I would do, and I told the Juice to take it, and he said 'no'.\n\n\"And I said, 'Why won't you take it?'. He said: 'It's a family matter, it's none of the public's business'.\"\n\n8 OJ Simpson's prison guard claims he heard Khloe begging OJ for a paternity test Credit: AP:Associated Press\n\n8 OJ Simpson is currently serving 33 years for robbery and is eligible for parole next year Credit: Supplied by Pacific Coast News\n\nBack in 2013, Robert Kardashian's third wife Ellen Pierson - who he married six weeks before his death back in 2003 - sold excerpts of his private diaries and claimed Khloe was not his daughter.\n\nRobert's second wife, Jan Ashley backed up Ellen's claims and said he told her that Khloe wasn't his.\n\nJan told Star magazine: \"Khloe is not his kid — he told me that after we got married.\n\n\"He just kind of looked at me and said [it] like it was a matter of fact. He said, 'Well, you know that Khloe's not really a Kardashian, don't you?'\"\n\n8 Robert Kardashian said Khloe was his biological child in some legal documents Credit: Instagram\n\nHowever, in legal documents that surfaced when Robert was trying to gain an annulment from Jan, he described Khloe as his \"biological child\".\n\nBoth Khloe and her mother Kris reacted angrily to the claims and Khloe admitted earlier this year that it was really tough having other people discuss who her father was.\n\n8 Khloe said she finds it hurtful when people discuss her dad, who died in 2003, and her paternity Credit: Instagram\n\nSpeaking on Kocktails with Khloe, she said: \"I think the thing that most became overwhelming was when, like, the stuff happened with one of my dad's wives.\n\n\"She wanted to come out, like, 10 years later after my dad passed away and said that I'm not his daughter and that he confided in her and blah-say-blah.\n\n\"I was like, 'Listen, you can talk about me and my sisters all you f***ing want. Do not talk about my dad…He's not here!'\"\n\nNeither Kris or Khloe have responded to the fresh claims.\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["https://www.thesun.co.uk/wp-content/uploads/2016/06/composite-khloe-kardashian-landscape.jpg?strip=all&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2016/06/composite-khloe-kardashian-landscape.jpg?strip=all&w=750&h=500&crop=1", "keywords": [], "authors": ["Elaine Mccahill"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/1274188/oj-simpsons-prison-guard-claims-khloe-kardashian-begged-the-disgraced-star-for-a-paternity-test-to-find-out-if-he-was-her-real-dad/", "title": "OJ Simpson’s prison guard claims Khloe Kardashian begged the disgraced star for a paternity test to find out if he was her real dad", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "OJ Simpson's prison guard claims Khloe Kardashian begged the disgraced star for a paternity test", "url": "https://www.thesun.co.uk/tvandshowbiz/1274188/oj-simpsons-prison-guard-claims-khloe-kardashian-begged-the-disgraced-star-for-a-paternity-test-to-find-out-if-he-was-her-real-dad/", "description": "KHLOE Kardashian reportedly begged OJ Simpson for a paternity test in order to find out if he was her real father. OJ’s prison guard, Jeffrey Felix, claims he heard the pair having a conversa…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2016/06/composite-khloe-kardashian-landscape.jpg?strip=all&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Khloe Kardashian"}, "locale": "en_GB"}, "article": {"published_time": "2016-06-13T11:41:11+00:00", "modified_time": "2016-06-13T11:57:44+00:00", "publisher": 161385360554578, "tag": "Khloe Kardashian, Kris Jenner, OJ Simpson, Keeping Up with the Kardashians, Los Angeles", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "twitter": {"text": {"title": "OJ Simpson’s prison guard claims Khloe Kardashian begged the disgraced star for a paternity test to find out if he was her real dad"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "WHO'S THE DADDY?", "headline": "OJ Simpson's prison guard claims Khloe Kardashian begged the disgraced star for a paternity test", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2016/06/composite-khloe-kardashian-landscape.jpg?strip=all&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2016/06/composite-khloe-kardashian-landscape.jpg?strip=all&w=620&h=413&crop=1"}}, "parsely-post-id": 1274188, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1465818071.0, "source": "http://www.thesun.co.uk", "summary": ""}