{"url": "https://www.thesun.co.uk/tvandshowbiz/bizarre/3312461/louis-tomlinson-will-not-be-charged-for-airport-brawl-involving-girlfriend-eleanor-calder/", "text": "LOUIS Tomlinson will not be charged over his airport brawl with a photographer in LA last month.\n\nThe One Direction singer was arrested following the bust-up on March 3 at Los Angeles International Airport when he was travelling with his girlfriend Eleanor Calder.\n\n5 Louis Tomlinson will not be charged fro his airport brawl involving a photographer Credit: Radar Online / Coleman Rayner\n\nBut the Los Angeles City Attorney’s Office said the 25-year-old will only be called to a hearing before the authority.\n\nA spokesman said: “Each of the parties will be interviewed regarding the incident and advised of the law and ways to avoid similar incidences in the future.\n\n“Typically there is no further action taken by our office after the hearing, though we do reserve the right to file charges up to one year from the date of the original incident should additional information or future actions require additional measures.”\n\nMOST READ IN TV & SHOWBIZ New start Phil Schofield 'moves out of family home & into London flat after coming out' Park run Katie Price stuns in black gymwear as she exercises with Dreamboys friend 'DIFFICULT NEWS' Broadway star's wife claims his leg will be amputated during virus fight Virus battle Gogglebox's Jonathan Tapper fought for life after falling ill with coronavirus MEOW Gordon Ramsay takes swipe at Cornwall neighbours by offering them a burger ROCK ON Lady Gaga, JLo and Elton John sing at virus benefit as Beyonce surprises fans 'the hardest time' Will Mellor tearfully reveals his 'hero' dad has died in emotional video 'NOT TRUE' Charlotte Crosby denies 'beating up' ex Josh Ritchie after his Instagram rant TOM OF THE POPS Captain Tom's NHS charity single hits No1 as fundraising passes £22m SPLIFFABABE Sugababes star Mutya Buena shocks fans by 'rolling a joint' during Insta Live\n\n5 The fight erupted when a pap refused to stop filming Louis and Eleanor Credit: Radar Online / Coleman Rayner\n\nPals insisted at the time he had been trying to defend his girlfriend, who was also caught up in the scuffle, from a gang who refused to stop filming his fight with paparazzo Karl Larsen, shown in shocking pictures published exclusively in the Sun on Sunday.\n\nThe couple had been returning to LA after a holiday in Vegas when the clash happened.\n\nThe attorney’s office added that a letter would be sent to Louis on Tuesday with details of the hearing, which will take place at the end of April.\n\n5 The One Direction singer was with his girlfriend Eleanor Calder when the fracas took place and pals insist he was trying to defend her Credit: Splash News\n\nThe case was due to be heard at LAX courthouse on March 29 but the hearing was postponed.\n\nAfter the incident, Louis’ lawyer Martin Singer said: “The paparazzi provoked and caused the altercation that occurred with Louis at the airport.\n\n“This is not the first or last time that a paparazzi has created an altercation with a celebrity.\n\n“While the altercation was going on with the paparazzi, three other individuals were attacking his girlfriend during this incident and he came to her defence.”\n\n5 The singer's lawyer firmly placed the blame on the photographer who Louis threw to the floor Credit: coleman rayner\n\n5 The police report stated that Louis suffered abrasions to his hands Credit: Radar Online / Coleman Rayner\n\nA police report of the incident revealed Louis had “fresh abrasions” on his knuckles after the fracas and Larsen claimed he was knocked unconscious.\n\nOnlooker Ana Becerra, who was embroiled in the scrap, had claimed Louis punched her in the eye and broke her glasses and her wife Bianca Garza told cops the singer grabbed her spouse by the waist “bear hug style” and threw her over his shoulder.\n\nWhen an officer asked Louis if he recalled sweeping Larsen’s legs causing him to fall to the ground, the star answered: “I may have taken him down...I remember we both fell to the floor.”\n\nEleanor admitted to cops she tried to slap the phone out of Becerra’s hands after she began filming the scuffle, but claims she was then punched and kicked by the woman before Louis intervened.\n\nHowever, while Louis won't face charges, Ana previously claimed she would sue the star.\n\nA spokesperson for Louis confirmed that the charges have been dropped.", "images": ["https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/af-composite-louis-tomlinson.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.6 1\"%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg"], "top_img": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/af-composite-louis-tomlinson.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Nicola Fahey"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/bizarre/3312461/louis-tomlinson-will-not-be-charged-for-airport-brawl-involving-girlfriend-eleanor-calder/", "title": "Louis Tomlinson will NOT be charged for airport brawl involving girlfriend Eleanor Calder", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Louis Tomlinson will NOT be charged by police over LA airport brawl involving girlfriend Eleanor Calder", "url": "https://www.thesun.co.uk/tvandshowbiz/bizarre/3312461/louis-tomlinson-will-not-be-charged-for-airport-brawl-involving-girlfriend-eleanor-calder/", "description": "LOUIS Tomlinson will not be charged over his airport brawl with a photographer in LA last month. The One Direction singer was arrested following the bust-up on March 3 at Los Angeles International …", "site_name": "The Sun", "image": {"identifier": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/af-composite-louis-tomlinson.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800, "alt": "Louis Tomlinson"}, "locale": "en_GB"}, "article": {"published_time": "2017-04-11T20:23:48+00:00", "modified_time": "2017-04-13T03:33:41+00:00", "publisher": 161385360554578, "tag": "Louis Tomlinson", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "LOUIS Tomlinson will not be charged over his airport brawl with a photographer in LA last month.", "keywords": "louis tomlinson, elanor calder, airport, arrest,", "news_keywords": "louis tomlinson, elanor calder, airport, arrest,", "twitter": {"text": {"title": "Louis Tomlinson will NOT be charged for airport brawl involving girlfriend Eleanor Calder"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "IN THE CLEAR", "headline": "Louis Tomlinson will NOT be charged by police over LA airport brawl involving girlfriend Eleanor Calder", "image": {"medium": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/af-composite-louis-tomlinson.jpg?crop=0px%2C0px%2C750px%2C500px&resize=300%2C192&ssl=1", "large": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/af-composite-louis-tomlinson.jpg?crop=0px%2C0px%2C750px%2C500px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 3312461, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1491942228.0, "source": "https://www.thesun.co.uk", "summary": ""}