{"url": "https://www.shape.com/celebrities/celebrity-workouts/shakira-s-trainer-anna-kaiser-singers-diet-and-fitness-routine", "text": "Image zoom Getty Images\n\nAs one of the sexiest pop stars on the planet, there's no doubt Shakira has a rocking bod. But with a hit TV show, a new album, and a new baby, the 37-year-old songstress has a lot to juggle. And by the looks of her super fit and firm physique, there's no doubt she makes serious time for her workouts.\n\nIn fact, the \"Hips Don't Lie\" singer trains with fitness guru Anna Kaiser, owner of AKT InMotion Studio in New York City, who most recently helped Shakira shed baby weight and get back into sizzling shape. \"Being consistent with exercise is the biggest hurdle to overcome for every woman,\" says Kaiser. \"Shakira also works so hard. She gives 150 percent with everything she does.\"\n\nWe went one-on-one with Kaiser for more-including her secrets for shaping up and slimming down, Shakira-style. From the Colombian stunner's exact workout to her specific menu, you'll be hip-shaking like a pro in no time.\n\nShape: Shakira looks fantastic! Tell us what you've been doing with her.\n\nAnna Kaiser [AK]: We started with 30 minutes in the morning and 30 minutes in the evening. You get an added metabolism-booster in the second half of the day. After six weeks, she did an hour in the morning and another hour in the evening.\n\nShape: What does your training entail?\n\nAK: It depends on where she is. She loves to mix it up and go out and play sports like tennis, squash, and paddleboarding. One session might consist of a ballet combo and barre exercises, then kickboxing and sports training, hip-hop, or Pilates.\n\nShape: Did you help with Shakira's diet at all?\n\nAK: I did help with meal plans, especially because in the Latin culture, they love foods high on the glycemic index or with large portions of meat. I recommended small meals throughout the day to help fight against that dreaded food coma. The meals range from 200 to 300 calories each, five to six times a day. When you get very few breaks during the day and you don't get a full night's sleep, you need those small meals to keep your energy up.\n\nShape: What was on her menu?\n\nAK: One meal option is a piece of poached chicken the size of your fist with a green salad sprinkled with lemon juice, carrots, cherry tomatoes, cucumber, and celery. Another is a cup and a half of quinoa with minced veggies, all cooked at once so the quinoa absorbs the nutrients. For snacks, a vegetable puréed soup with pumpkin seeds, olive oil, or flaxseed oil works. We'd also incorporate 125-calorie protein shakes with ice, water, stevia, and a chocolate whey protein mix that had 12 grams of protein. You can also add berries and a scoop of almond butter. Shakira also loves oranges with almonds.\n\nRELATED: 10 Latina Women Who Inspire Greatness\n\nShape: She had a baby in January 2013. What is most important when it comes to getting in shape after pregnancy?\n\nAK: It's important to work slowly and intelligently in your strength work before revving up the intensity. Start with deep diaphragmatic breathing to reengage and reconnect with your abdominals. Cardio should remain low-impact at first. You can gradually kick up the intensity. Interval training is a great way to incorporate short bouts of strength and cardio efficiently too (moms have small windows of time!). You can even integrate yoga poses between intervals to get more out of one session.\n\nThis full-body routine will engage your core, burn out your legs, stretch out your back and chest, and decompress your spine while bringing your heart rate up for total toning and sculpting.\n\nStep Kick Step Lunge\n\nSets: 1\n\nReps: 15 per side\n\nStand with arms at sides. Step forward with left foot, then kick with right foot. Step back with right foot and lunge back with left foot, twisting torso to the right.\n\nIsolated Glute/Adductor Pulse\n\nSets: 1\n\nReps: 30 to 40 per side\n\nStanding, holding onto a barre or a box with left hand to stabilize. Lift right leg parallel out to the side about 6 to 12 inches off the floor. Try to balance by taking hand off the barre. Flex right foot and pulse it up and down.\n\nAbs Exercise\n\nSets: 2\n\nReps: 15 per side\n\n1. Start in second position in a wide squat, knees pointing over toes, and hands behind head. Engage glutes, then open inner thighs one more inch to engage your abductors.\n\n2. Holding the squat, Hold that position bring right elbow down to tap right knee. Return to starting position.\n\nLeg/Booty Burnout\n\nSets: 2\n\nReps: 15\n\n1. Start in second position in a wide squat, knees pointing over toes, and hands behind head. Engage glutes, then open inner thighs one more inch to engage your abductors.\n\n2. Lift heels up and down for 15 reps.\n\n3. In the same position, hop up and down for another 15 reps.\n\nPulsing Cat\n\nSets: 1\n\nReps: 30\n\n1. Get on all fours, press hands into the floor, and round back up to the ceiling, pulling belly in as much as possible (cat pose).\n\n2. Quickly pulse belly button to spine with a little tuck of the hips, keeping back rounded toward the ceiling.\n\nMoving Half-Plank Pushup\n\nSets: 1\n\nReps: 15\n\nA. Start in a half-plank position, continue down into a pushup (with elbows bent 45 degrees), then push back into child's pose. Return to starting position.\n\n2. Hold a half-plank pushup, pulsing down 20 times.\n\nThe Sphinx\n\nSets: 1\n\nReps: 30\n\nLie facedown with forearms on the ground in front of you. Press down into hands and straighten arms.\n\nThera-Band Burn and Chest Opener\n\nSets: 2\n\nReps: 20 per side\n\nStanding holding a Thera-Band between hands, arms straight in front of you. Keeping left arm steady, open right arm all the way to the side as you twist torso to the right. Return to starting position.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F01%2F03210210%2Fjulia-body-recomposition-transformation-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F02%2F04023333%2Fwide-keto-diet-meal-plan-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F19202142%2F1244-squat-challenge-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=700&h=366&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=700&h=366&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg", "keywords": [], "authors": ["Kristen Aldridge"], "canonical_link": "https://www.shape.com/celebrities/celebrity-workouts/shakira-s-trainer-anna-kaiser-singers-diet-and-fitness-routine", "title": "Anna Kaiser on Shakira's Abs Workout Routine", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Voice judge and sexy pop singer’s trainer tells us how she stays super fit even when she’s super busy", "og": {"title": "Steal Shakira’s Rockin’ Body Workout", "type": "article", "site_name": "Shape", "url": "https://www.shape.com/celebrities/celebrity-workouts/shakira-s-trainer-anna-kaiser-singers-diet-and-fitness-routine", "description": "The Voice judge and sexy pop singer’s trainer shares the diet and training secrets that keep her in amazing shape.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=700&h=366&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg", "width": 700, "height": 366}}, "pinterest": {"url": "https://www.shape.com/celebrities/celebrity-workouts/shakira-s-trainer-anna-kaiser-singers-diet-and-fitness-routine", "description": "The Voice judge and sexy pop singer’s trainer tells us how she stays super fit even when she’s super busy", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg"}, "twitter": {"card": "summary", "url": "https://www.shape.com/celebrities/celebrity-workouts/shakira-s-trainer-anna-kaiser-singers-diet-and-fitness-routine", "title": "Shakira’s Trainer Anna Kaiser on the Singer's Diet and Fitness Routine", "description": "The Voice judge and sexy pop singer’s trainer tells us how she stays super fit even when she’s super busy", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=700&h=366&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2014%2F04%2F03185437%2Fshakira-700_0.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}}, "movies": [], "publish_date": null, "source": "https://www.shape.com", "summary": ""}