{"url": "http://www.freaksugar.com/britney-young-on-carmens-growth-in-glow-season-2/", "text": "GLOW season 1 hit all the right notes with viewers: It brimmed with 1980s nostalgia, mixing Aquanet, synthesized music, and American cultural hopes and fears seamlessly. The wrestling, of course, was a huge draw to fans, bringing back a whoosh of memories, whether you watched the WWF or were fans of the Gorgeous Ladies Of Wrestling (GLOW) or both! Weaving through the spectacle of the matches, however, was the fictionalized story of the GLOW wrestlers and their alter egos and how women of disparate professional backgrounds were able to make their first televised wrestling event a success. And that tale owes so much to the pitch perfect writing and casting to make all of those parts move together smoothly.\n\nOne of those perfectly cast actresses came in the form of Britney Young, who portrays Carmen “Machu Picchu” Wade, a GLOW cast member who slowly begins to break out from the shadow of her family’s overprotective tendencies and her own self-doubt to put her foot in the light of confidence. While that process really comes to the fore when her character has her big victory during the first televised show, Young points out that this is just the first step in a long process of for Carmen and becoming comfortable asserting herself and going after what she wants.\n\nMs. Young spoke with me recently about where we find the GLOW wrestler when the season begins, how and why building Carmen’s self-esteem is a work in progress, the increased physicality that season 2 brought to the ring, and how she hopes the episodes will inspire and entertain viewers.\n\nFreakSugar: Where do we find Carmen and the rest of the GLOW crew at the beginning of season 2?\n\nBritney Young: At the end of season 1, the team had just shot the pilot. When we pick up in season 2, they are trying to get everything they need to make a full season of the show. They move the whole process back into their gym and try to recreate it to make it look like the hotel where they shot they pilot.\n\nSam [Sylvia–played by Marc Maron–the director of the GLOW wrestling series within the show] hired some crewmen to do that. The season is looking at the ladies now that they’ve won and are now on an official show. They’ve also started find a little bit of fame, so it’s how they deal with that, being micro-celebrities.\n\nAnd it’s about the new relationships that form and the new rivalries as well. I feel like where we find Carmen, she kind of conquered her fear at the end of season 1 with her match with Welfare Queen, but now it’s a question of whether she can continue to fight for what she wants to reach her dreams. This is especially important now that Cherry [Bang–played by Sydelle Noel–the wrestlers’ trainer on the show who left at the end season 1] is gone and Carmen is stepping more into the trainer role and has to coach these girls. As a result, her own routines start to get pushed to the side. So she’s in this place where she asks herself, “Okay, am I going to help all these ladies become wrestlers or am I going to step up and decide whether I am going to do this for myself?”\n\nFS: You can see that in her arc in the first season that she’s slowly coming into her own.\n\nBY: I love that about our show writers—not just Carmen’s arc but with the show as a whole—don’t really feed into giving you the typically happy ending typical Hollywood story. At the end of the first season, a lot of viewers were like, “Carmen found her confidence.” No, Carmen found a little bit of her confidence, but she is still growing. She is still working at it. That’s real life you: don’t all of a sudden win a match and then you’re Machu Picchu all the time. This is just the beginning for Carmen.\n\nFS: I love her character because she’s so sweet and because she recognizes that her confidence needs to grow and she’s actively working on building that. As an actor, what is it about Carmen that appeals to you?\n\nBY: Right off the bat when I first got the cast breakdown, they describe Carmen as a gentle giant. Coming from Hollywood where most of roles for plus-sized women are stereotypically bullies or characters with low self-esteem, it’s nice to see that someone is looking for an actor to be kind and sweet.\n\nI immediately knew that I have to be part of this. As the season went on, we got to see different ways she cares about others more than she cares about herself and I think that’s something we have in common. So to play that for the first time in a character, I found it to be a challenge, and it was actually different for me to pull from own experiences and put it into this character.\n\nIn season 2, Carmen is still a sweet kind character, but she definitely has moments where she does gets fed up and releases anger and frustration and that was so much fun. I definitely had my Gordon Bombay moment. [laughs]\n\nFS: I enjoyed friendship between Bash [the producer on the show] and Carmen in season 1. They have more in common than you would think at first, particularly with their respective family dynamics.\n\nBY: I love Bash and Carmen and love that other people have rallied behind this unconventional friendship. As season 1 went on, you saw similarities between their family dynamics. And how they see themselves is very similar. They both have passions and dreams, but can’t necessarily live them out because other people are telling them they’re not good. They both have those insecurities together.\n\nI love working with Chris Lowell [who plays Bash]. He’s a fantastic actor, but even better all-around person. He and I had a lot of conversations throughout season 1 about what we thought Bash and Carmen meant to each other and I swear with each episode where they interacted it changed. I think that’s great. Again, our writers are showing so many more dynamic layers to these characters than just what’s on the surface\n\nIn Season 2, there is more interaction between Bash and Carmen; we’re continuing that relationship. They definitely get a lot closer and continue to support each other and help each other out. But a lot of stuff does happen between them that a lot of people are going to go, “Oh, that’s interesting.” So I’m really curious to see how the audience will react to them this time around.\n\nThat’s my vague answer. [laughs]\n\nFS: Carmen is stepping up to a trainer role among the GLOW wrestlers. How does the physicality change for you and the other actresses this season?\n\nBY: We definitely wrestle more in season 2. I think I wrestled more than I acted. [laughs] I think I only have two to three episodes where I don’t wrestle. That’s a lot for me. I actually have fights where I’m fighting multiple girls at a time. That was definitely something that was new. After season 1, we became so passionate for the sport and respect it so much that we want to make it as authentic as possible. We want to make it bigger, we want to make it better.\n\nComing into boot camp in season 2, we’d been watching wrestling during hiatus, so we’re telling Chavo [Guerro], our wrestling coordinator, that we wanted to do certain moves. He is so great at telling us okay, if it wasn’t happening in wrestling in 1985, we’re not doing it. [laughs] He really wants to keep it appropriate which we respect because, again, we just love this sport so much now. So it really did get a lot bigger in season 2. It didn’t really change how we approached it; it was just “Let’s go hard, let’s go big”, and we did it.\n\nFS: Unfortunately, there was harassment of women in the workplace in 1980s and today. Do you touch on that in season 2?\n\nBY: We do touch on it quite a bit in season 2. There’s a storyline that has to do with harassment in the workplace. I think the interesting thing about it is that is not necessarily part of #MeToo movement, but this is what was happening then. We are trying to be authentic in storytelling, costumes, productions design, hair, makeup, everything. We are trying to live this time period in all its facets and, unfortunately, harassment in the workplace was a facet of life in 1985. So that’s why we have it in there.\n\nFS: I know Machu Picchu’s character is not exactly like the real-life GLOW wrestler Mt. Fuji, played by Emily Dole, but inspired by her. Were there any characteristics you took from Mt. Fuji as inspiration?\n\nBY: She is inspired Emily, as the rest of the characters on the show are inspired real GLOW wrestlers and GLOW events. I didn’t necessarily take characteristic of Mt. Fuji and use them for Machu Picchu. I wanted Machu Picchu to be her own person. What I did gravitate toward Emily about was just seeing in her in general as an actor and athlete, and seeing her as a plus-sized woman, strong and gentle at the same time. She showed you can be aggressive and be kind. That’s what I really tried to emulate with Machu Picchu and make it her own. That’s what I took away when I watched some of Emily’s fights when I went down my GLOW YouTube black hole—which is totally worth doing, by the way. [laughs]\n\nIt’s interesting, too, because GLOW was real. A lot of fans will say that X didn’t happen and we have to keep saying that we’re inspired by, not based on, the real GLOW wrestlers. In season 2, we really diverge from the GLOW storyline in the original. Season 2 is fictionalized. It’s the story our producers and writers wanted to tell. We’re not following the path of the original show.\n\nFS: Besides being entertained, is there anything you want viewers to take away from season 2? Is there anything you can tease?\n\nBY: Besides being entertained, I think for us women—and even Marc [Maron] and Chris—GLOW has been such an empowering experience for each of us. It’s really shown us that we can do things we thought we never could. We had all put up these boundaries, whether it was emotional or physical, mental, and with GLOW we’ve been able to take them down and really realize that we really are these strong, amazing people. And I kind hope that’s what people take away from this season. You can go after whatever it is you want and you can get it. There’s no one standing in your way but yourself. Just open up and go for it and you can succeed and you can do well in the things you want to do.\n\nAs for a tease about season 2, there’s a lot more wrestling. We have new characters, in particular a new wrestler named Yolanda played by Shakira Barrera. She’s going to feel like she’s been there since season 1. She seamlessly fits into our group and is just fantastic.\n\nWe have one specific episode that I think is really going to blow everyone’s minds. It’s unlike anything I’ve ever been a part of or anything I’ve seen on TV. I think people are going to gravitate toward it and it’s just a fun, fun, funny episode. When you get to it, you’ll know.\n\nIt’s a great season and I’m really proud of it.\n\nGLOW season 2 is now streaming on Netflix.", "images": ["http://www.freaksugar.com/wp-content/uploads/2020/02/fro2-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2016/04/aliens-defiance-1-360x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/10/Jed-W.-Keith_avatar_1541009698-120x120.jpeg", "http://www.freaksugar.com/wp-content/uploads/2018/07/2017-07-01-glow13.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/07/webtoon-480x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/11/everythin-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/08/672930._SX1280_QL80_TTD_-360x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/03/D76F44D8-3C97-46FA-B585-2ACF2888B6D4-80x60.jpeg", "http://www.freaksugar.com/wp-content/uploads/2020/02/fs-logo-3.png", "http://www.freaksugar.com/wp-content/uploads/2020/03/rw9muqmwjgnm5qn5ew3v-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/03/7ACB8DC6-9E45-499F-89D1-18FDBB451409-80x60.jpeg", "http://www.freaksugar.com/wp-content/uploads/2015/02/daredevil-flipping-360x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/02/IMG_0669-1-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/02/Brooklyn-Bridge-Cropped-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/06/glow_301_unit_00915r-480x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/01/mal2-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2014/05/logo-footer.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/12/dwight-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/07/Britney-Young-Carmen-Machu-Picchu-Wade-909x1024.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/11/AGODSMS_i7_CVR_4X6-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/01/hopper-80x60.jpeg", "http://www.freaksugar.com/wp-content/uploads/2019/09/BOFBV2_CVR_4x6_SOL-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/11/Liebestrasse-Cover-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2019/05/kztctdg20a9qvgl0bffs-1-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/03/502A37B3-DDFD-4C42-B523-2F475F84BBA9-80x60.jpeg", "http://www.freaksugar.com/wp-content/uploads/2018/12/obama-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/02/last-christmas-header-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2017/01/GalleryComics_1920x1080_20170111_ASBM_Cv6_58540fd55c36d9.17918705-360x240.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/07/alison-1024x683.jpg", "http://www.freaksugar.com/wp-content/uploads/2018/07/26-britney-young.w710.h473.jpg", "http://www.freaksugar.com/wp-content/uploads/2020/01/joepera-80x60.jpg", "http://www.freaksugar.com/wp-content/uploads/2015/05/fangirl-480x240.jpg"], "top_img": "http://www.freaksugar.com/wp-content/uploads/2018/07/26-britney-young.w710.h473.jpg", "keywords": [], "authors": ["Jed W. Keith", "Jed W. Keith Makes Squiggle-Thoughts Into Word-Thinkems On", "Off The Internet. Aside Freaksugar", "You May Have Seen His Scrawlings At The Mary Sue", "Legion Of Leia", "The Association For Linen Management. When Not Writing About Pop Culture", "He Does Educational", "Technical Writing For A Whole Host Of Companies. Also", "He Plays A Mean Game Of Ms. Pac-Man."], "canonical_link": "http://www.freaksugar.com/britney-young-on-carmens-growth-in-glow-season-2/", "title": "Britney Young on Carmen’s Growth in GLOW Season 2", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Britney Young on Carmen’s Growth in GLOW Season 2", "description": "GLOW season 1 hit all the right notes with viewers: It brimmed with 1980s nostalgia, mixing Aquanet, synthesized music, and American cultural hopes and fears seamlessly. The wrestling, of course, was a huge draw to fans, bringing back a whoosh of memories, whether you watched the WWF or were fans of the Gorgeous Ladies Of […]", "url": "http://www.freaksugar.com/britney-young-on-carmens-growth-in-glow-season-2/", "site_name": "Freaksugar", "image": {"identifier": "http://www.freaksugar.com/wp-content/uploads/2018/07/26-britney-young.w710.h473.jpg", "width": 710, "height": 473}}, "article": {"author": "www.facebook.com/thejedkeith", "tag": "wrestling", "section": "TV", "published_time": "2018-07-10T00:52:55+00:00"}, "shareaholic": {"site_name": "Freaksugar", "language": "en-US", "url": "http://www.freaksugar.com/britney-young-on-carmens-growth-in-glow-season-2/", "keywords": "tag:britney young, tag:carmen wade, tag:glow, tag:glow season 2, tag:gorgeous ladies of wrestling, tag:interviews, tag:machu picchu, tag:netflix, tag:wrestling, cat:tv, type:post", "article_published_time": "2018-07-10T00:52:55+00:00", "article_modified_time": "2018-07-10T00:52:55+00:00", "shareable_page": "true", "article_author_name": "Jed W. Keith", "site_id": "dd31931c777d951405827ffc2f5ad3e4", "wp_version": "9.2.0", "image": "http://www.freaksugar.com/wp-content/uploads/2018/07/26-britney-young.w710.h473-300x200.jpg"}, "twitter": {"card": "summary_large_image", "url": "http://www.freaksugar.com/britney-young-on-carmens-growth-in-glow-season-2/", "title": "Britney Young on Carmen’s Growth in GLOW Season 2", "description": "GLOW season 1 hit all the right notes with viewers: It brimmed with 1980s nostalgia, mixing Aquanet, synthesized music, and American cultural hopes and fears seamlessly. The wrestling, of course, was a huge draw to fans, bringing back a whoosh of memories, whether you watched the WWF or were fans of the Gorgeous Ladies Of […]", "image": "http://www.freaksugar.com/wp-content/uploads/2018/07/26-britney-young.w710.h473.jpg"}, "msapplication-TileImage": "http://www.freaksugar.com/wp-content/uploads/2020/02/cropped-FS-270x270.jpg"}, "movies": ["https://www.youtube.com/embed/9iM7W1Dvl6Q?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1531183975.0, "source": "http://www.freaksugar.com", "summary": ""}