{"url": "variety.com/2017/tv/awards/emmy-snubs-oprah-winfrey-biggest-snub-jimmy-fallon-snub-americans-snub-no-nomination-1202491464/", "text": "With more than 400 television shows to choose from and only a handful of ballot slots per category, the 21,000-plus voting members of the TV Academy had no choice but to leave quite a few strong contenders off the 2017 Emmy ballots. However, with such a plethora of worthy candidates, there were also quite a few pleasant surprises along the way. Now that the official nominations have been announced, Variety breaks down the biggest snubs and surprises of this small-screen award season.\n\nSNUB: Oprah Winfrey\n\nYou may have thought the Academy could never snub Winfrey — voters just spot her name on the ballot, and even if they haven’t seen her in the role for which she’s nominated, they’ll usually still give her the nod. But this year that proved not to be true, as Winfrey was overlooked for limited series “The Immortal Life of Henrietta Lacks.”\n\nSURPRISE: “Westworld” ties with “Saturday Night Live” for the most Emmy nominations this year.\n\nAfter years of genre programming not getting much attention in the top categories (with the notable exception of “Game of Thrones,” of course), the Academy recognized HBO’s sci-fi western thriller. “Westworld” garnered 22 nominations in categories that ranged from outstanding drama series to outstanding directing for a drama. This could be a turning point for the awards.\n\nSNUB: Jimmy Fallon\n\nThough Fallon and his “Tonight Show” didn’t win the Emmy for variety talk series last year, this year they didn’t even get nominated. While similar broadcast fun fare like “Jimmy Kimmel Live!” and “The Late Late Show With James Corden” made the cut, more noms went to those with a political edge, including last year’s winner in the category, “Last Week Tonight With John Oliver,” as well as “Full Frontal With Samantha Bee” and “Real Time With Bill Maher.”\n\nSURPRISE: “Genius”\n\nWhile seeing Geoffrey Rush’s name (and as Albert Einstein to boot!) on an Emmy ballot may inspire some voters to automatically select it, it is more of a surprise that the National Geographic anthology series saw so much love across other categories like directing and overall limited series. There was not a lot of buzz about this when it aired, but the star power seems to have proved too great to ignore.\n\nSNUB: “The Americans”\n\nIt may have taken the Academy a few years to recognize the FX period spy drama, but once it finally did, there was great hope it would become a ballot staple for drama series. Though series stars Keri Russell and Matthew Rhys both got noms for their leading roles, the series as a whole was shut out in its penultimate year.\n\nSURPRISE: Pamela Adlon\n\nAdlon was an Academy favorite for her role on “Louie,” for which she received nominations for writing and guest actress, as well as for “King of the Hill,” for which she received a nom for her voice talent. The last time she was on the ballot, though, was in 2015, for the former comedy series. Now she is back to represent “Better Things,” the FX series she co-created and which is loosely based on her own life. While Adlon has received critical praise for this role, the competition in the category was so stiff she seemed like an underdog for the nomination.\n\nSNUB: “Transparent”\n\nSeries star (and previous Emmy winner) Jeffrey Tambor is once again nominated for his role as Maura Pfefferman in the lead actor category, but the Amazon show was shut out of the top comedy series category after being nominated for the last two years.\n\nSURPRISE: Zach Galifianakis\n\nThis is the first Emmy nomination for a lead acting role for Galifianakis, who previously took trophies for his “Between Two Ferns” short-form series. Galifianakis is doing complicated work in the dual role of twins Chip and Dale Baskets on the aptly-titled FX comedy series “Baskets,” but the attention — from the media and the Academy in the previous year — has been much more focused on Louie Anderson in the role of Chip and Dale’s mother.\n\nSNUB: “The Leftovers”\n\nHBO’s post-rapture series adapted from Tom Perrotta’s novel of the same name just lost its last chance at Emmy gold. The series came to an end in June of this year surrounded by a lot of critical acclaim, including high praise for lead actress Carrie Coon. Coon may not have been recognized by the Academy for her work here, but at least she was for the other role she held this TV season … which leads us to …\n\nSURPRISE: Carrie Coon\n\nIn the much-heated race for limited series/TV movie lead actress, Coon was recognized for her work on FX’s “Fargo.” The actress is a critical darling from both her work here, as well as the recently-ended “Leftovers” on HBO. While it would have been nice to see her recognized for a series that centered its final episode on her character, at least she got some Emmy love.\n\nSNUB: Rami Malek\n\nIt was a surprise last year when the TV Academy awarded Malek the lead actor trophy for his role on USA’s “Mr. Robot” — but a welcome one given the progress it represented for outside the box voting. Then Malek toppled heavy hitters like Bob Odenkirk, Matthew Rhys, Liev Schreiber, and Kevin Spacey, all of whom are back in the category again this year. Unfortunately, Malek did not make the cut this time around.\n\nSURPRISE: “Billy on the Street”\n\nBilly Eichner’s variety sketch series received a nomination after a very creative For Your Consideration campaign in which voters were reminded of some of the other surprise names that got nominations, let alone trophies, so why not him? This nomination also marks the first time truTV has ever been in the Emmy race.\n\nSNUB: Lena Dunham\n\nWith the series finale of “Girls” airing in April of this year, Dunham had one last chance at the top comedy acting prize for the show she co-created. After being nominated for the first three seasons, there were expectations she might nab another one at the end. But not even the chance to give Dunham a swan song could sway voters to put her back on the ballot for the first time since 2014.\n\nSURPRISE: Reality/Reality Competition Host Nominees\n\nWith “American Idol” gone, there was one open spot expected to be filled with a newcomer to this race, but in actuality only two nominees from last year returned (the duo of Heidi Klum and Tim Gunn for “Project Runway,” as well as 2016’s winner in the category, RuPaul Charles for “RuPaul’s Drag Race”). This category now features familiar face Gordon Ramsay for “MasterChef Junior,” as well as a number of wild cards — duo Martha Stewart and Snoop Dogg for “Martha & Snoop’s Potluck Dinner Party”), Alec Baldwin for “Match Game,” and W. Kamau Bell for “United Shades of America with W. Kamau Bell.”\n\nSNUB: “Dancing with the Stars”\n\nNot only did ABC’s reality competition giant fail to receive a nomination in the reality competition category, but host Tom Bergeron failed to receive one for his individual achievement as a host. This is particularly surprising given that the series has been on the ballot every year since 2006, and Bergeron on since 2008, most recently winning in 2015.\n\nSURPRISE: Jane Fonda\n\nLily Tomlin, Fonda’s other half on “Grace and Frankie,” has been nominated twice for their Netflix comedy, but this year marks the first time for Fonda. Fonda, who was last on the Emmy ballot in 2014 for her guest role on HBO’s “The Newsroom,” has never been nominated in the lead actress comedy or drama categories at all.\n\nSNUB: Jude Law in “The Young Pope”\n\nIt seems crazy that someone of Jude Law’s caliber would get left off an Emmy ballot but — that’s what happened. After all, the limited series or movie lead actor race was just too stacked with talent like Ewan McGregor, Geoffrey Rush, Benedict Cumberbatch, Riz Ahmed, John Turturro, and Robert De Niro.\n\nSURPRISE: Milo Ventimiglia\n\nWhile it was expected that “This Is Us” star Sterling K. Brown would get a lead actor nod after winning a limited acting statue for “The People v. O.J. Simpson” last year, seeing his co-star Ventimiglia opposite him on the ballot was less of a sure thing. These nominations help put broadcast drama back in the race in a big way.\n\nSNUB: “Gilmore Girls: A Year in the Life” and Lauren Graham\n\nThe Academy went for topical over nostalgia at almost every turn this year, which meant Netflix’s “Gilmore Girls” revival came up short. Though series star Alexis Bledel’s name does appear on the ballot, it is for her guest work on streaming competitor Hulu’s “The Handmaid’s Tale” instead. Not even Lauren Graham, who so many contend was robbed years earlier by never receiving a nomination while the show was in its original run, could break through.\n\nSURPRISE: Shannon Purser\n\nPurser and her “Stranger Things” character, Barb, became an internet sensation after the first season was released on Netflix, but few expected a trending hashtag (#JusticeForBarb) to turn into accolades. Purser is now up for a guest actress Emmy for her turn on the sci-fi series.\n\nSNUB: Christine Baranski\n\nBaranski was first recognized for her role as Diane Lockhart on CBS’ “The Good Wife” in 2010, when she was nominated in the supporting actress category for drama. She appeared on the ballot subsequently for the next six years, yet she was shut out now that she has spun-off into streaming service CBS All Access original “The Good Fight” and eligible for a lead actress nom.\n\nSNUB: “Insecure”\n\nOnly one freshman comedy — “Atlanta” — broke through to receive Emmy love this season. So it stings when considering the talent at HBO’s “Insecure” who didn’t make it on the ballot. The show as a whole, and series star and co-creator Issa Rae, who was nominated at the Golden Globes, were beloved choices.", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/04/biggest-snubs-emmy-nominations-20171.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fawards%2Femmy-snubs-oprah-winfrey-biggest-snub-jimmy-fallon-snub-americans-snub-no-nomination-1202491464%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202491464&comment_count=69"], "top_img": "https://pmcvariety.files.wordpress.com/2017/04/biggest-snubs-emmy-nominations-20171.jpg?w=1000", "keywords": [], "authors": ["Danielle Turchiano"], "canonical_link": "https://variety.com/2017/tv/awards/emmy-snubs-oprah-winfrey-biggest-snub-jimmy-fallon-snub-americans-snub-no-nomination-1202491464/", "title": "Emmy Nominations: The Biggest Snubs and Surprises", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "2017 Emmy nomination snubs include Oprah Winfrey, Jimmy Fallon, and \"The Americans.\"", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202491464, "author": "Danielle Turchiano", "pmc-category": "Awards,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-07-13T09:58:59"}, "pmc-tag": "Carrie Coon,Emmys,Jimmy Fallon,Oprah Winfrey,Rami Malek,The Americans,Transparent,Westworld", "title": "Emmy Nominations: The Biggest Snubs and Surprises", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Awards", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Emmy Nominations: The Biggest Snubs and Surprises", "url": "https://variety.com/2017/tv/awards/emmy-snubs-oprah-winfrey-biggest-snub-jimmy-fallon-snub-americans-snub-no-nomination-1202491464/", "description": "With more than 400 television shows to choose from and only a handful of ballot slots per category, the 21,000-plus voting members of the TV Academy had no choice but to leave quite a few strong co…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/biggest-snubs-emmy-nominations-20171.jpg?w=1000", "width": 1000, "height": 562, "alt": "Emmys noms 2017 Biggest Snubs and Suprises"}, "locale": "en_US"}, "article": {"published_time": "2017-07-13T16:58:59+00:00", "modified_time": "2017-07-14T04:59:35+00:00"}, "twitter": {"creator": "@https://twitter.com/danielletbd", "site": "@variety", "text": {"title": "Emmy Nominations: The Biggest Snubs and Surprises"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/04/biggest-snubs-emmy-nominations-20171.jpg?w=1000", "alt": "Emmys noms 2017 Biggest Snubs and Suprises"}, "card": "summary_large_image", "title": "Emmy Nominations: The Biggest Snubs and Surprises", "description": "2017 Emmy nomination snubs include Oprah Winfrey, Jimmy Fallon, and \"The Americans.\""}, "author": "Danielle Turchiano", "content_type": "Article", "post_id": 1202491464, "title": "Emmy Nominations: The Biggest Snubs and Surprises", "published_at": "2017-07-13 09:58:59", "image": "https://pmcvariety.files.wordpress.com/2017/04/biggest-snubs-emmy-nominations-20171.jpg?w=1000", "comment_count": 69, "tags": "Westworld", "topics": "News", "appeared_in_print": "No", "body": "With more than 400 television shows to choose from and only a handful of ballot slots per category, the 21,000-plus voting members of the TV Academy had no choice but to leave quite a few strong contenders off the 2017 Emmy ballots. However, with such a plethora of worthy candidates, there were also quite a few pleasant surprises along the way. Now that the official nominations have been announced, Variety breaks down the biggest snubs and surprises of this small-screen award season.\r\n\r\nSNUB: Oprah Winfrey\r\n\r\nYou may have thought the Academy could never snub Winfrey -- voters just spot her name on the ballot, and even if they haven't seen her in the role for which she's nominated, they'll usually still give her the nod. But this year that proved not to be true, as Winfrey was overlooked for limited series \"The Immortal Life of Henrietta Lacks.\"\r\n\r\nSURPRISE: \"Westworld\" ties with \"Saturday Night Live\" for the most Emmy nominations this year. \r\n\r\nAfter years of genre programming not getting much attention in the top categories (with the notable exception of \"Game of Thrones,\" of course), the Academy recognized HBO's sci-fi western thriller. \"Westworld\" garnered 22 nominations in categories that ranged from outstanding drama series to outstanding directing for a drama. This could be a turning point for the awards.\r\n\r\n\r\n\r\nSNUB: Jimmy Fallon\r\n\r\nThough Fallon and his \"Tonight Show\" didn't win the Emmy for variety talk series last year, this year they didn't even get nominated. While similar broadcast fun fare like \"Jimmy Kimmel Live!\" and \"The Late Late Show With James Corden\" made the cut, more noms went to those with a political edge, including last year's winner in the category, \"Last Week Tonight With John Oliver,\" as well as \"Full Frontal With Samantha Bee\" and \"Real Time With Bill Maher.\"\r\n\r\nSURPRISE: \"Genius\"\r\n\r\nWhile seeing Geoffrey Rush's name (and as Albert Einstein to boot!) on an Emmy ballot may inspire some voters to automatically select it, it is more of a surprise that the National Geographic anthology series saw so much love across other categories like directing and overall limited series. There was not a lot of buzz about this when it aired, but the star power seems to have proved too great to ignore.\r\n\r\nSNUB: \"The Americans\"\r\n\r\nIt may have taken the Academy a few years to recognize the FX period spy drama, but once it finally did, there was great hope it would become a ballot staple for drama series. Though series stars Keri Russell and Matthew Rhys both got noms for their leading roles, the series as a whole was shut out in its penultimate year.\r\n\r\nSURPRISE: Pamela Adlon\r\n\r\nAdlon was an Academy favorite for her role on \"Louie,\" for which she received nominations for writing and guest actress, as well as for \"King of the Hill,\" for which she received a nom for her voice talent. The last time she was on the ballot, though, was in 2015, for the former comedy series. Now she is back to represent \"Better Things,\" the FX series she co-created and which is loosely based on her own life. While Adlon has received critical praise for this role, the competition in the category was so stiff she seemed like an underdog for the nomination.\r\n\r\nSNUB: \"Transparent\"\r\n\r\nSeries star (and previous Emmy winner) Jeffrey Tambor is once again nominated for his role as Maura Pfefferman in the lead actor category, but the Amazon show was shut out of the top comedy series category after being nominated for the last two years.\r\n\r\nSURPRISE: Zach Galifianakis \r\n\r\nThis is the first Emmy nomination for a lead acting role for Galifianakis, who previously took trophies for his \"Between Two Ferns\" short-form series. Galifianakis is doing complicated work in the dual role of twins Chip and Dale Baskets on the aptly-titled FX comedy series \"Baskets,\" but the attention -- from the media and the Academy in the previous year -- has been much more focused on Louie Anderson in the role of Chip and Dale's mother.\r\n\r\nSNUB: \"The Leftovers\"\r\n\r\nHBO's post-rapture series adapted from Tom Perrotta's novel of the same name just lost its last chance at Emmy gold. The series came to an end in June of this year surrounded by a lot of critical acclaim, including high praise for lead actress Carrie Coon. Coon may not have been recognized by the Academy for her work here, but at least she was for the other role she held this TV season ... which leads us to ...\r\n\r\nSURPRISE: Carrie Coon\r\n\r\nIn the much-heated race for limited series/TV movie lead actress, Coon was recognized for her work on FX's \"Fargo.\" The actress is a critical darling from both her work here, as well as the recently-ended \"Leftovers\" on HBO. While it would have been nice to see her recognized for a series that centered its final episode on her character, at least she got some Emmy love.\r\n\r\nSNUB: Rami Malek\r\n\r\nIt was a surprise last year when the TV Academy awarded Malek the lead actor trophy for his role on USA's \"Mr. Robot\" -- but a welcome one given the progress it represented for outside the box voting. Then Malek toppled heavy hitters like Bob Odenkirk, Matthew Rhys, Liev Schreiber, and Kevin Spacey, all of whom are back in the category again this year. Unfortunately, Malek did not make the cut this time around.\r\n\r\nSURPRISE: \"Billy on the Street\"\r\n\r\nBilly Eichner's variety sketch series received a nomination after a very creative For Your Consideration campaign in which voters were reminded of some of the other surprise names that got nominations, let alone trophies, so why not him? This nomination also marks the first time truTV has ever been in the Emmy race.\r\n\r\nSNUB: Lena Dunham\r\n\r\nWith the series finale of \"Girls\" airing in April of this year, Dunham had one last chance at the top comedy acting prize for the show she co-created. After being nominated for the first three seasons, there were expectations she might nab another one at the end. But not even the chance to give Dunham a swan song could sway voters to put her back on the ballot for the first time since 2014.\r\n\r\nSURPRISE: Reality/Reality Competition Host Nominees\r\n\r\nWith \"American Idol\" gone, there was one open spot expected to be filled with a newcomer to this race, but in actuality only two nominees from last year returned (the duo of Heidi Klum and Tim Gunn for \"Project Runway,\" as well as 2016's winner in the category, RuPaul Charles for \"RuPaul's Drag Race\"). This category now features familiar face Gordon Ramsay for \"MasterChef Junior,\" as well as a number of wild cards -- duo Martha Stewart and Snoop Dogg for \"Martha & Snoop's Potluck Dinner Party\"), Alec Baldwin for \"Match Game,\" and W. Kamau Bell for \"United Shades of America with W. Kamau Bell.\"\r\n\r\nSNUB: \"Dancing with the Stars\"\r\n\r\nNot only did ABC's reality competition giant fail to receive a nomination in the reality competition category, but host Tom Bergeron failed to receive one for his individual achievement as a host. This is particularly surprising given that the series has been on the ballot every year since 2006, and Bergeron on since 2008, most recently winning in 2015.\r\n\r\nSURPRISE: Jane Fonda\r\n\r\nLily Tomlin, Fonda's other half on \"Grace and Frankie,\" has been nominated twice for their Netflix comedy, but this year marks the first time for Fonda. Fonda, who was last on the Emmy ballot in 2014 for her guest role on HBO's \"The Newsroom,\" has never been nominated in the lead actress comedy or drama categories at all.\r\n\r\nSNUB: Jude Law in \"The Young Pope\"\r\n\r\nIt seems crazy that someone of Jude Law's caliber would get left off an Emmy ballot but -- that's what happened. After all, the limited series or movie lead actor race was just too stacked with talent like Ewan McGregor, Geoffrey Rush, Benedict Cumberbatch, Riz Ahmed, John Turturro, and Robert De Niro.\r\n\r\nSURPRISE: Milo Ventimiglia\r\n\r\nWhile it was expected that \"This Is Us\" star Sterling K. Brown would get a lead actor nod after winning a limited acting statue for \"The People v. O.J. Simpson\" last year, seeing his co-star Ventimiglia opposite him on the ballot was less of a sure thing. These nominations help put broadcast drama back in the race in a big way.\r\n\r\nSNUB: \"Gilmore Girls: A Year in the Life\" and Lauren Graham\r\n\r\nThe Academy went for topical over nostalgia at almost every turn this year, which meant Netflix's \"Gilmore Girls\" revival came up short. Though series star Alexis Bledel's name does appear on the ballot, it is for her guest work on streaming competitor Hulu's \"The Handmaid's Tale\" instead. Not even Lauren Graham, who so many contend was robbed years earlier by never receiving a nomination while the show was in its original run, could break through.\r\n\r\nSURPRISE: Shannon Purser\r\n\r\nPurser and her \"Stranger Things\" character, Barb, became an internet sensation after the first season was released on Netflix, but few expected a trending hashtag (#JusticeForBarb) to turn into accolades. Purser is now up for a guest actress Emmy for her turn on the sci-fi series.\r\n\r\nSNUB: Christine Baranski \r\n\r\nBaranski was first recognized for her role as Diane Lockhart on CBS' \"The Good Wife\" in 2010, when she was nominated in the supporting actress category for drama. She appeared on the ballot subsequently for the next six years, yet she was shut out now that she has spun-off into streaming service CBS All Access original \"The Good Fight\" and eligible for a lead actress nom.\r\n\r\n SNUB: \"Insecure\"\r\n\r\nOnly one freshman comedy -- \"Atlanta\" -- broke through to receive Emmy love this season. So it stings when considering the talent at HBO's \"Insecure\" who didn't make it on the ballot. The show as a whole, and series star and co-creator Issa Rae, who was nominated at the Golden Globes, were beloved choices.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1499965139.0, "source": "http://variety.com", "summary": ""}