{"url": "https://moneyish.com/ish/kylie-jenners-best-friend-jordyn-woods-is-building-her-own-brand/", "text": "Model Jordyn Woods, often known in headlines as “Kylie Jenner’s best friend,” wants to make a name for herself.\n\n“People always ask, ‘What does she do besides be someone’s best friend?’ And I do a lot,” Woods told Moneyish. “I’m working; I started my own business. I think eventually, people will start to see that whole title kind of switch over.”\n\nThe Gen Zers reportedly met as pre-teens at a mutual friend’s party where they exchanged numbers; they’ve remained inseparable ever since. Their friendship led to Woods, a 20-year-old Los Angeles, Calif., native, appearing on “Keeping Up with the Kardashians” and its spinoff reality show “Life of Kylie” alongside her bestie Jenner. In recent years, Woods has gained her own stardom as a plus-size model signed with Wilhelmina International’s Curve division, propelling her to influencer status with more than 5 million Instagram followers. It’s all proof that she can hold her own as a household name -- but it’s not fame that she’s after.\n\n“I don’t really care to be known,” she said while promoting St. Ives beauty products at an event in New York City. “I just want to be successful and happy.”\n\nJordyn Woods at the St. Ives Mixing Bar in Flatiron creating custom scrubs and lotions in New York City. (Photo by Ben Gabbe/Getty Images for St. Ives)\n\nWoods is just getting started building her own brand in the fashion, lifestyle and plus-size women’s clothing space, an industry that’s valued at $17 billion, according to NPD Group. She worked the runway at the Chromat show during New York Fashion Week last fall, and got her feet wet in the design world with a new Barney’s New York shoe collection earlier this month. She’s also collaborated on her own namesake clothing collection with plus-size Canadian clothing retailer Addition Elle, and was featured in Kanye West’s Yeezy Season 6 fashion ads as one of the models posing as Kim Kardashian. Woods is also designing an activewear line of her own that is slated to drop later this year.\n\nWhen it comes to building a successful business, she’s had plenty of seasoned pros to look up to, considering she’s constantly surrounded by female entrepreneurs like the Kardashians and Jenner, who already has an estimated net worth of $50 million at age 20. Jenner used Woods’ name for a lip kit she created for her booming beauty business, Kylie Cosmetics, which has made $420 million since its launch less than two years ago and is estimated to become a billion-dollar company by 2022, according to Women’s Wear Daily. The Jordyn Woods lip kit comes in a cool red shade, and Woods says watching it come to life has been a thrill.\n\n“It’s definitely crazy,” she said, adding that the best advice she’s learned from the Kardashian-Jenner clan is to stay involved in the behind-the-scenes work from inception to production.\n\n“Being involved in your own company, and being involved in the decisions and the process, that’s the best thing you can do, because if you have a vision or something you want to do, you have to be behind it to make sure that it happens,” she said.\n\nWoods’ commitment to being a role model for young girls influences the kind of work that she plans to take on, particularly when it comes to being a symbol for body positivity.\n\n“I have a little sister, so automatically, I try to be a good role model in general -- and I do think of all the young people out there like my little sister who need guidance and direction, so I try to keep everything I do as positive as possible, and as honest as possible,” she said.\n\nAnd while living in a filtered world can make anyone seem picture-perfect, Woods says successful brands are those that come across as authentic instead of trying too hard, like her partnership with St. Ives and its commitment to using natural ingredients and embracing real beauty.\n\n“When I first started modeling, I didn’t really think of it as a body-positivity movement,” said Woods, who often posts unretouched photos of herself on Instagram. “I wasn’t even too sure what that whole movement was at the time. But as I got more into it, I realized that we really can be leaders of the movement. It was natural to me. It was solely based off of me being myself, and people started gravitating towards it.”\n\nAnd her growing brand has been successful because it happened so naturally, she says. “I don’t really have to try to stay on top of it. As long as I’m being myself, and staying genuine to myself and my work and everything I’m doing, I feel like it shows, and that’s how I keep it going,” she added.\n\nWoods also surrounds herself with inspiring women, like her mom and manager Elizabeth Woods. And she dreams of meeting more successful female mentors — such as two of the women she admires most.\n\n“I don’t know Oprah, but I would love for her to be my mentor,” she said. “Or Michelle Obama -- those two would be awesome.”", "images": ["https://s.wsj.net/public/resources/images/MW-GW803_cb1653_ZG_20181030180625.jpg", "https://sts3.wsj.net/bucket-a/maggie/static/images/google-play.png", "https://moneyish.com/Multimedia/2018/10/30/Photos/ZH/MW-GW803_cb1653_20181030180625_ZH.jpg", "https://s.marketwatch.com/public/resources/MWimages/MW-IE698_stimul_ZU_20200417141427.jpg", "https://sts3.wsj.net/bucket-a/maggie/static/images/app-store.svg", "https://moneyish.com/Multimedia/2018/10/30/Photos/NS/MW-GW804_32055c_20181030180627_NS.jpg"], "top_img": "https://s.wsj.net/public/resources/images/MW-GW803_cb1653_ZG_20181030180625.jpg", "keywords": [], "authors": ["Jeanette Settembre"], "canonical_link": "http://www.marketwatch.com/story/kylie-jenners-best-friend-jordyn-woods-is-building-her-own-brand-2018-06-20-12882851", "title": "Kylie Jenner’s best friend Jordyn Woods is building her own brand", "meta_data": {"og": {"title": "Kylie Jenner’s best friend Jordyn Woods is building her own brand", "site_name": "MarketWatch", "type": "article", "url": "https://www.marketwatch.com/story/kylie-jenners-best-friend-jordyn-woods-is-building-her-own-brand-2018-06-20-12882851", "description": "The reality star’s longtime friend is launching an activewear line and promoting body positivity campaigns", "image": {"identifier": "https://s.wsj.net/public/resources/images/MW-GW803_cb1653_ZG_20181030180625.jpg", "width": 1320, "height": 742}}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "page.site": "marketwatch", "twitter": {"site": {"identifier": "@marketwatch", "id": 624413}, "domain": "marketwatch.com", "description": "The reality star’s longtime friend is launching an activewear line and promoting body positivity campaigns", "image": {"identifier": "https://s.wsj.net/public/resources/images/MW-GW803_cb1653_ZG_20181030180625.jpg", "width": 1320, "height": 742}, "card": "summary_large_image"}, "article.content_group": "marketwatch", "article": {"publisher": "https://www.facebook.com/marketwatch", "opinion": "false"}, "fb": {"app_id": 283204329838}, "theme-color": "#2e2e2f", "referrer": "no-referrer-when-downgrade", "robots": "noarchive,noodp", "googlebot-news": "index", "article.doctype": 88, "cXenseParse": {"wsj-doctype": 88, "wsj-product": "Moneyish Blogs", "wsj-column": "Moneyish"}, "article.id": "72e10c10-ad03-47cd-8a0f-be178277b612", "apple-itunes-app": "app-id=336693422,app-argument=mwatch://article?id=72e10c10-ad03-47cd-8a0f-be178277b612", "article.section": "Personal Finance", "article.column": "Moneyish", "author": "Jeanette Settembre", "description": "The reality star’s longtime friend is launching an activewear line and promoting body positivity campaigns", "article.template": "full", "keywords": "article_normal", "news_keywords": "article_normal", "parsely-link": "https://www.marketwatch.com/story/kylie-jenners-best-friend-jordyn-woods-is-building-her-own-brand-2018-06-20-12882851", "parsely-type": "post", "parsely-title": "Kylie Jenner’s best friend Jordyn Woods is building her own brand", "parsely-section": "Personal Finance", "parsely-post-id": "72e10c10-ad03-47cd-8a0f-be178277b612", "parsely-tags": "PageType: Article, Template: full, ArticleId: 72e10c10-ad03-47cd-8a0f-be178277b612, Column: Moneyish, DocType: 88, Subsection: Personal Finance", "parsely-pub-date": "2018-06-20T12:28:00-04:00", "parsely-author": "Jeanette Settembre"}, "movies": [], "publish_date": null, "source": "https://moneyish.com", "summary": ""}