{"url": "https://www.hollywoodreporter.com/news/late-night-hosts-slam-trump-plan-transgender-military-ban-donald-you-are-stupid-1024606", "text": "Jimmy Fallon featured transgender comedian Patti Harrison on 'The Tonight Show,' who shared her perspective: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"\n\nPresident Donald Trump was criticized on Wednesday for his decision to ban transgender people from serving in the U.S. military.\n\nLate-night hosts joined activists, politicians, journalists and military members on Wednesday night in their criticism over Trump's plan, which he announced through a series of tweets earlier in the day.\n\nTrump tweeted that the U.S. government \"will not accept or allow\" transgender people to serve \"in any capacity\" in the military. \"Our military must be focused on decisive and overwhelming victory,\" he wrote. \"And cannot be burdened with the tremendous medical costs and disruption that transgender in the military would entail.\"\n\nLater during the White House press briefing, Sarah Huckabee Sanders said that Trump's plan was a \"military decision,\" adding that Trump's national security advisers helped him to make the decision.\n\nTrump didn't elaborate what would happen under his plan to the transgender people currently serving in the military, nor did he explain how he plans to implement such a ban. Nonetheless, several celebrity activists including Caitlyn Jenner, Laverne Cox, George Takei, Ellen DeGeneres and more responded to his plan, calling it \"hurtful, baseless and wrong.\"\n\nJimmy Fallon invited transgender comedian Patti Harrison on NBC's The Tonight Show to share her thoughts.\n\n\"As a trans person, it's hard to articulate exactly how I feel,\" said Harrison. \"But I guess if I had to describe it, I'd say, 'Donald, you are so stupid. You are so stupid.'\" She added: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"\n\nHer final thoughts: \"Trump says transgender people in the military would be a tremendous disruption. And I get it. If you constantly draw attention to yourself, spend all day distracting everyone and cost taxpayers millions of dollars, the perfect job for you isn't the military, it's the president of the United States.\"\n\nJames Corden turned to music on CBS' Late Late Show to criticize Trump's announcement. He sang a parody of the song \"L-O-V-E\" with the letters \"LGBT.\"\n\n\"B to his dumb knowledge is just a phase in college, T he finds confusing so the Army's now refusing, trans women who only want to serve, trans men who want rights we all deserve,\" sang Corden. He added, \"Trump's got hate for me and you.\"\n\n\"How is their disruption worse than Trump's corruption, why's it such a crisis, thousands willing to fight ISIS,\" Corden continued in his tuxedo and tophat. \"LGBT we love all of you,\" he sang, waving a rainbow flag.\n\nCorden also spoke about the ban in his monologue saying that usually when Trump \"wants to keep someone out of military service he just fakes a doctor's note saying he has a foot injury.\" He added, \"Worked fine for him during Vietnam.\"\n\nEarlier on CBS, Late Show host Stephen Colbert came to the conclusion that the president is \"really off his meds.\"\n\n\"Today, he went from crazy to cruel,\" Colbert said, reading Trump's tweets announcing a transgender military ban, which ended in \"thank you.\"\n\n\"Thank you? Fuck you,\" responded Colbert, to loud applause from his audience.\n\nColbert also took the liberty of editing Trump's tweet to reflect Trump's true feelings.\n\nSamantha Bee shared a similar (word-for-word) sentiment on TBS' Full Frontal for Trump's sign-off in his tweet. \"Thank you? Fuck you,\" she said.\n\n“Firing thousands of active-duty service members during the big push against ISIS is Trump’s version of ‘don’t ask, don’t tell.’ He didn’t ask anyone if it was a good idea and didn’t tell anyone he was doing it,” said Bee.\n\nThe Daily Show's Trevor Noah broke down Trump's tweets, as well as his history with the LGBTQ community (and his history of forgetting parts of the acronym).\n\n\"Just so we're on the same page,\" the Comedy Central late-night host said, \"Transgender-related military expenses for the military cost at most $8 million per year ... In contrast, taxpayers will be paying $60 million per year just for Trump to visit his own properties like Mar-a-Lago. And that's before he orders dessert.\"\n\nNoah had two transgender military veterans on his show to speak about the ban. \"The past administration made a lot of strides in order to lift this ban,\" said Joey Whimple. He said individuals felt \"that safety net to come out\" and now the \"carpet is being completely pulled out from underneath\" leaving a question of uncertainty.\n\nOn NBC's Late Night With Seth Meyers, the host turned it over to four of his female writers for reactions.\n\n\"President Trump, you just requested a $600 billion military budget,\" said writer Amber Ruffin. \"You think you can't afford health care for trans people? The military spends $41 million a year on Viagra. What are you guys doing, screwing the enemy to death?\"\n\nReferencing a recent tweet by Trump's daughter, Ivanka, in which she wrote she was \"proud to support my LGBT friends,\" the writers tossed it over to the \"daughter to the president and world-renowned entrepreneur\" — only to show an empty podium at the White House. The gag was repeated later with footage of a tumbleweed crossing a desolate road and a lone wolf howling in a snowy field. \"She's just stuck in traffic,\" noted the writers.\n\nChelsea Handler previewed Friday's episode of her Netflix show with a message to the transgender community: \"I'm sorry a man that has never served in the military a day in his life is denying you the right to serve your country. Thank you for your service and thank you for your bravery. And to the members of the Republican party who continue to choose party over politics, grow a fucking spine!\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2017/07/stephen_colbert_chelsea_handler_trevor_noah_split_0.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/12/aaeaaqaaaaaaaafiaaaajgyxmtvhnmm0ltcynjetngvmmy1iyzvllwq4odlhyzqwzjyznw.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/07/stephen_colbert_chelsea_handler_trevor_noah_split_0.jpg", "keywords": [], "authors": ["Jennifer Konerman Patrick Shanley Lorena O'Neil", "Jennifer Konerman", "Patrick Shanley", "Lorena O'Neil", "Jennifer.Konerman Thr.Com", "Patrick.Shanley Thr.Com", "Lorena.Oneil Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/late-night-hosts-slam-trump-plan-transgender-military-ban-donald-you-are-stupid-1024606", "title": "Late-Night Hosts Slam Trump Over Plan for Transgender Military Ban: \"Donald, You Are So Stupid\"", "meta_data": {"viewport": "width=device-width", "description": "Jimmy Fallon featured transgender comedian Patti Harrison on 'The Tonight Show,' who shared her perspective: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/late-night-hosts-slam-trump-plan-transgender-military-ban-donald-you-are-stupid-1024606", "domain": "https://www.hollywoodreporter.com/", "title": "Late-Night Hosts Slam Trump Over Plan for Transgender Military Ban: \"Donald, You Are So Stupid\"", "description": "Jimmy Fallon featured transgender comedian Patti Harrison on 'The Tonight Show,' who shared her perspective: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/07/stephen_colbert_chelsea_handler_trevor_noah_split_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Late-Night Hosts Slam Trump Over Plan for Transgender Military Ban: \"Donald, You Are So Stupid\"", "description": "Jimmy Fallon featured transgender comedian Patti Harrison on 'The Tonight Show,' who shared her perspective: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"", "url": "https://www.hollywoodreporter.com/news/late-night-hosts-slam-trump-plan-transgender-military-ban-donald-you-are-stupid-1024606", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/07/stephen_colbert_chelsea_handler_trevor_noah_split_0.jpg", "width": 1280, "height": 720, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Late-Night Hosts Slam Trump Over Plan for Transgender Military Ban: \"Donald, You Are So Stupid\"", "sailthru.description": "Jimmy Fallon featured transgender comedian Patti Harrison on 'The Tonight Show,' who shared her perspective: \"I don't even think Trump knows what transgender means — he probably thinks transgender people are those cars that turn into robots.\"", "sailthru.author": "Jennifer Konerman,Patrick Shanley,Lorena O'Neil", "sailthru.vertical": "Television", "sailthru.date": "2017-07-26 18:42:34", "sailthru.tags": "Television,Politics,Chelsea Handler,Donald Trump,James Corden,Jimmy Fallon,Samantha Bee,Stephen Colbert,Trevor Noah,Full Frontal with Samantha Bee,The Daily Show with Trevor Noah,The Late Late Show,The Late Show,The Tonight Show,Tonight Show Starring Jimmy Fallon,LGBTQ,Late-Night TV"}, "movies": [], "publish_date": 1501065754.0, "source": "https://www.hollywoodreporter.com", "summary": ""}