{"url": "en.wikipedia.org/wiki/Cindy_Crawford", "text": "American model and actress\n\nCynthia Ann Crawford (born February 20, 1966) is an American model and actress. Her years of success at modeling made her an international celebrity that have led to roles in television and film, and work as a spokesperson. During the 1980s and 1990s, Crawford was among the most popular supermodels and a ubiquitous presence on magazine covers, runways, and in fashion campaigns.\n\nEarly life [ edit ]\n\nCynthia Ann Crawford was born in DeKalb, Illinois, on February 20, 1966,[2] the daughter of Dan Crawford and Jennifer Sue Crawford-Moluf (née Walker).[3][4] She has two sisters, Chris and Danielle,[5] as well as a brother, Jeffery, who died of childhood leukemia at age 3.[6] She has stated that her family has been in the United States for generations and that her ancestry is mostly German, English, and French.[7] By appearing in an episode of Who Do You Think You Are? in 2013, she discovered that her ancestors included English nobility and continental royal families of the Middle Ages and that she was descended from Charlemagne.[8]\n\nIn her sophomore year at high school, she received a call from a local clothing store regarding modeling work, only to discover that it was a practical joke set up by two of her classmates. However, the following year another store hired a number of high-school girls, including Crawford, to work for them (including a fashion shoot). In her junior year, local photographer Roger Legel, whose duties included photographing a different college girl to be that week's coed in the DeKalb Nite Weekly, asked to take her picture for the publication; the result was Crawford's first cover.[9] The photo and positive feedback she received were enough to convince her to take up modeling. She entered the Elite Model Management's Look of the Year contest at 17 and was the runner-up. Elite Model Management in Chicago then started representing her.\n\nCrawford graduated from DeKalb High School in 1984 as valedictorian.[10] She earned an academic scholarship to study chemical engineering at Northwestern University, which she attended for only one quarter. She dropped out in order to pursue a full-time modeling career. After working for photographer Victor Skrebneski in Chicago, Crawford moved to New York City in 1986, and signed with the Elite New York modeling agency.[11]\n\nCareer [ edit ]\n\nDuring the 1980s and 1990s, Crawford was among the most popular supermodels and a ubiquitous presence on magazine covers, runways, and in fashion campaigns. She was repeatedly and frequently featured on the cover of many magazines, including Vogue, W, People, Harper's Bazaar, Elle, Cosmopolitan, and Allure. A partial count in 1998 totalled over 500 appearances.[12] Crawford has walked the runways for Chanel, Versace, Dolce & Gabbana, Christian Dior, Calvin Klein, Ralph Lauren, Michael Kors, Todd Oldham, DKNY, and Valentino. Crawford also appeared in many fashion campaigns during her career, including those for Versace, Calvin Klein, Escada, David Yurman, Oscar De La Renta, Balmain, Hermes, Ellen Tracy, Valentino, Bally, Liz Claiborne, Hervé Leger, Halston, Anne Klein, Isaac Mizrahi, Blumarine, Guess, Ink, Gap, and Revlon. She has also worked for Omega, Maybelline, Clairol, Pepsi, and Chilean retail stores Ripley (partner of Macy's).\n\nIn 1987, Crawford appeared during the opening credits of the Michael J. Fox film The Secret of My Success. Three years later, she appeared alongside top models Christy Turlington, Linda Evangelista, Tatjana Patitz and Naomi Campbell on the cover of the January 1990 edition of British Vogue magazine. Crawford and the other four models subsequently appeared in the video for George Michael's hit \"Freedom '90\" later that year. Subsequently, Crawford played the lost love of Jon Bon Jovi in the 1994 video for his version of \"Please Come Home For Christmas\", \"John Taylor\" in the 2011 video for Duran Duran's \"Girl Panic\" (featuring supermodels as the band, including Naomi Campbell as Simon Le Bon), and Headmistress in the 2015 video for Taylor Swift's \"Bad Blood\" as part of a cast including Jessica Alba (Domino), Selena Gomez (Arsyn), and fellow models Lily Aldridge, Cara Delevingne, Gigi Hadid, Martha Hunt and Karlie Kloss (as Frostbyte, Mother Chucker, Slay-Z, Homeslice and Knockout respectively).\n\nThe red Versace dress which she wore to the 63rd Academy Awards in 1991 had a major influence on fashion, and many copies and fakes of the dress were produced.[13][14][15] In 1992, Crawford—through GoodTimes Home Video and her company Crawdaddy Productions—made an exercise video with Radu Teodorescu named Cindy Crawford: Shape Your Body; although criticised by some[who?] for being unsafe,[citation needed] it was hugely successful and led to two equally lucrative followups, Cindy Crawford: The Next Challenge in 1993 (again with Radu) and Cindy Crawford: A New Dimension in 2000; the latter, made with fitness expert Kathy Kaehler and produced not long after Crawford gave birth to her first child, was aimed at new mothers getting back into shape. In 2001, Crawford also made a shorter fitness video aimed at children, Mini-Muscles with Cindy Crawford and the Fit-wits, an animated production featuring the voices of Crawford (who also appears at the beginning in live action), Radu and Kobe Bryant.\n\nThe inaugural issue of George, a short lived political magazine in the 1990s, featured Crawford dressed like George Washington on the cover. In 2005, the American Society of Magazine Editors listed it as the 22nd best magazine cover of the last 40 years.[16]\n\nCrawford is 5 feet 9 inches (175 cm) tall[1] with brown hair and eyes. Her measurements are 34–25.5–36\".[17] Crawford's trademark is a mole (or \"beauty mark\") above her upper lip. She is so closely associated with this physical feature that she appeared in an Australian advertising campaign for flavoured milk featuring a TV commercial wherein she \"licked off\" her own mole.[18] During the beginning of her career, the mole was removed from her modeling pictures, including her first Vogue cover.[citation needed] Her resemblance to model Gia Carangi led her to being known as \"Baby Gia\".[19][20]\n\nCrawford in 1995\n\nCrawford has also been on TV and in films. From 1989 to 1995, Crawford was host of MTV's House of Style. In the early 1990s, Crawford starred in the Pepsi and Pepsi Stuff advertising.[21][22] In 1992, she appeared in Pepsi's Super Bowl commercial,[23] aired during Super Bowl XXVI. In 2016, Pepsi released a remake of the commercial, also featuring Crawford.[23] In 1995, Crawford broke into movies as the female lead in the movie Fair Game. Her performance was panned by critics—Leonard Maltin commented \"In her acting debut, supermodel Crawford makes a good jogger.\"[24] The film was also a financial failure, with expenses of $50 million and $11 million takings at the box office. In 2001, she costarred as part of an ensemble cast in The Simian Line. Again the film was not successful or critically acclaimed, but Crawford's acting was not criticized. She has had many lesser roles guest starring on TV and as supporting roles, often playing herself. For example, in 2000, she was one of the celebrities (along with Victoria Silvstedt, Anna Falchi and Megan Gale) playing themselves in the Italian comedy Body Guards - Guardie del corpo. In the 1990s, Carol Shaw, her make-up artist, named a lipstick color after Crawford as a part of the Lorac Cosmetics lip-wear line.[25]\n\nIn July 1988, she posed nude for Playboy magazine in a shoot by photographer Herb Ritts.[26] In October 1998, Crawford returned to the pages of Playboy for a second nude pictorial, again taken by Ritts.[27]\n\nCrawford has consistently ranked highly on lists of the world's sexiest people. She was ranked number 5 on Playboy's list of the 100 sexiest stars of the 20th century. A 1997 Shape magazine survey of 4,000 picked her as the second (after Demi Moore) most beautiful woman in the world. In 2002, Crawford was named one of the 50 most beautiful people by People magazine. In her forties, she claimed No. 26 in the 2006 Hot 100 issue of Maxim magazine.[28] She was named No. 3 on VH1's 40 Hottest Hotties of the 90s and was named one of the \"100 Hottest Women of All-Time\" by Men's Health.[29]\n\nFashion designer Michael Kors summed up her impact:\n\n“ Cindy changed the perception of the 'sexy American girl' from classic blue eyed blonde to a more sultry brunette with brains, charm, and professionalism to spare.[30] ”\n\nAfter modeling [ edit ]\n\nCrawford quit full-time modeling in 2000 and now appears only occasionally in fashion magazines. She continues to provide celebrity endorsement for a variety of projects. In 2005, Crawford created a line of beauty products with Jean-Louis Sebagh called Meaningful Beauty for Guthy-Renker.[31] Crawford has stated that she regularly receives certain cosmetic procedures, including Botox and vitamin injections. She first saw a plastic surgeon at the age of 28.[32]\n\nIn 2005, Crawford launched a new line of furniture under the \"Cindy Crawford Home Collection\" name. The collection is manufactured by HM Richards Inc. She assisted in the creation of the line by consulting on the features, colors, or styles that fit the needs of families or reflected her own tastes.[33] She also has a furniture line with Raymour & Flanigan and launched a home goods line with J. C. Penney in late 2009.[34]\n\nCrawford in October 2009\n\nIn 2009, Crawford was one of many celebrities to be photographed by Deborah Anderson for the coffee table book Room 23, produced by philanthropist Diana Jenkins. In addition to appearing in the book, Crawford was the cover model and wrote the dedication.[35]\n\nCrawford returned to modeling in May 2011, appearing on the cover of the May 2011 issue of Vogue Mexico.[36]\n\nBecoming, a book about Crawford's life and career co-written by Crawford and Katherine O'Leary, was published in September 2015.[37]\n\nCrawford and her daughter Kaia appeared together on the cover of the April 2016 issue of Vogue Paris.[38] In 2016, she became a spokesperson for Acqua Minerale San Benedetto in Italy.[39]\n\nIn September 2017, Crawford, along with models Claudia Schiffer, Naomi Campbell, Helena Christensen and Carla Bruni, closed the Versace spring/summer 2018 fashion show, which was an homage to the late Gianni Versace.[40]\n\nIn January 2019, Crawford, along with her husband Rande Gerber, Mike Meldman, Jeff Shell, and Jay Sures announced they would purchase the Hollywood deli, Nate 'n Al, to keep its doors open after three generations of family ownership.[41][42]\n\nPersonal life [ edit ]\n\nCrawford was married to actor Richard Gere from 1991 until their divorce in 1995. She married businessman and former model Rande Gerber on May 29, 1998.[43] They have two children, son Presley Walker Gerber (born July 2, 1999)[44] and daughter Kaia Jordan Gerber (born September 3, 2001),[2][45] both of whom went into modeling.[46][47]\n\nActivism and charity work [ edit ]\n\nWhen Crawford was 10 years old, her three-year-old brother Jeff—whom she continues to praise as \"the fourth most influential person in [her] life\"—died of leukemia. Since becoming a model, Crawford has made childhood leukemia a focal point of her charity work, donating proceeds of her calendars to medical research.[48] Crawford has been a long-time supporter of the pediatric oncology program at the University of Wisconsin–Madison, where Jeff was treated, stating that she believes he received the best care possible.[49] She is also an honorary board member of the Multiple Myeloma Research Foundation.[50]\n\nIn 2007, she became an official supporter of the Ronald McDonald House Charities and is a member of their celebrity board, called the Friends of RMHC.[51] Crawford is on the honorary committee of the California Wildlife Center.[52]\n\nPolitical endorsements [ edit ]\n\nIn 2008, Crawford endorsed Barack Obama for President of the United States.[53] Despite reports, Crawford denied endorsing Mitt Romney for the 2012 election.[54]\n\nFilmography [ edit ]\n\nFilms [ edit ]\n\nVideos [ edit ]\n\nFitness videos [ edit ]\n\nYear Title 1992 Cindy Crawford: Shape Your Body Workout 1993 Cindy Crawford: The Next Challenge Workout 2000 Cindy Crawford: A New Dimension 2001 Mini-Muscles with Cindy Crawford and the Fit-wits\n\nMusic videos [ edit ]\n\nTelevision [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/9/92/CindyCrawfordOct09.jpg/220px-CindyCrawfordOct09.jpg", "https://upload.wikimedia.org/wikipedia/commons/8/8b/Cindy_Crawford_in_London.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Cindy_Crawford_in_London.jpg/220px-Cindy_Crawford_in_London.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Cindy_Crawford_1995.jpg/220px-Cindy_Crawford_1995.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Cindy_Crawford_in_London.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cindy_Crawford", "title": "Cindy Crawford", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Cindy_Crawford_in_London.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}