{"url": "time.com/money/5224398/kate-middleton-net-worth/", "text": "Catherine, Duchess of Cambridge wasn’t always a royal, but even before her marriage to Prince William, Kate Middleton had an impressive net worth.\n\nMiddleton had a comfortable upbringing before she became the first commoner to join the royal family after she married William in 2011. But Middleton’s net worth ballooned once she became a duchess.\n\nDaily Money Sign up to receive the latest updates and the smartest advice. View Sample Sign Up Now\n\nHere’s everything we know about Middleton’s net worth:\n\nWhat is Kate Middleton’s net worth?\n\nThe 36 year-old mother of three — who gave birth to a second baby boy in April — is worth at least £5 million, or $7 million, according to global wealth-tracking firm Wealth-X, though some estimates put her net worth as high as £7.3 million, or $10 million. Middleton’s wealth is mostly in cash because she doesn’t have a personal portfolio of property or artwork.\n\nThat being said, Middleton’s net worth is a lot less than her prince — Wealth-X estimates Prince William’s net worth is at least $30 million, though some reports put his fortune closer to $40 million. According to Wealth-X, $19 million of Prince William’s wealth is in cash. The wealth tracking firm also noted that William has an expensive helicopter fit for a royal — an Augusta A109S Grand helicopter which is valued at $11 million.\n\nCatherine, Duchess of Cambridge, Princess Charlotte of Cambridge, Prince George of Cambridge and Prince William, Duke of Cambridge arrive for a children's party for Military families during the Royal Tour of Canada on September 29, 2016 in Victoria, Canada. Chris Jackson—Getty Images\n\nWhat do we know about Kate Middleton’s money?\n\nMost of Middleton’s net worth stems from Party Pieces, an online party supplies business started by her parents. The company is estimated to be worth around £30 million, or $50 million, thanks in no small part to the exposure it gets from being associated with the royals, according to royal expert Marlene Koenig.\n\nPrior to her life as a full-time duchess, Middleton worked for the family business and was a part-time accessories buyer for a retailer called Jigsaw.\n\nGrowing up, Kate and her two siblings, Pippa and James Middleton, attended expensive privates schools from a young age, with years of tuition for just one child estimated to be at least £250,000, or $350,000. Kate met Prince William while in college in Scotland at the prestigious University of St. Andrew’s. She graduated in 2005 with a degree in Art History.\n\nHow did Kate Middleton’s net worth change after marrying Prince William?\n\nJoining the royal family meant that Middleton was marrying into an incredible $88 billion fortune amassed over generations.\n\nBefore Will and Kate became the Duke and Duchess of Cambridge and moved into a 20-room apartment in Kensington Palace, Kate lived in an apartment purchased by her parents in the Chelsea neighborhood of London believed to be worth £1 million, or $1.4 million.\n\nPrince William, Duke of Cambridge and Catherine, Duchess of Cambridge smile following their marriage at Westminster Abbey on April 29, 2011 in London, England. Chris Jackson—Getty Images\n\nBut once Kate officially became a royal she didn’t need to spend much of her own money anymore. Most of her living costs are covered by the private estate Prince Charles manages, the Duchy of Cornwall. The revenue from the Duchy of Cornwall pays for the most of Prince Charles and his family’s royal expenses: things like official travel, wardrobe, housing and staff costs. When Meghan Markle marries Prince Harry on May 19, she too, will get to keep most of her own money — her net worth is believed to be about $5 million — as the Duchy of Cornwall will also absorb the majority of her living costs associated with royal responsibilities.\n\nWhat is the ‘Kate effect’?\n\nAs the Duchess of Cambridge, Kate sets fashion trends all over the world. While she herself does not retain any income from the flurry of economic activity set off by the designer clothes she wears for public appearances, she has triggered what is known as “the Kate Effect,” meaning that whatever she wears more or less sells out immediately across the globe. Some designer labels she has worn have had to double their staff just to keep up with demand after a photo of her in a particular outfit is published.\n\nLONDON, ENGLAND - JUNE 17: Catherine, Duchess of Cambridge, Princess Charlotte of Cambridge, Prince George of Cambridge and Prince William, Duke of Cambridge look out from the balcony of Buckingham Palace during the Trooping the Colour parade on June 17, 2017 in London, England. Chris Jackson—Getty Images\n\nHer two older children, Prince George, 4, who is third in line for the throne, and Princess Charlotte, 2, also produce the “Prince George Effect” and the “Princess Charlotte Effect.” According to Brand Finance, Princess Charlotte could spur as much as $5 billion boost to the economy, with Prince George creating a slightly smaller economic impact, estimated to be around $3.6 billion. Their third royal baby could generate up to $1 billion for the British economy.\n\nCorrection: This article originally misstated Prince William dukedom. He and Kate Middleton are the Duke and Duchess of Cambridge, not the Duke and Duchess of Cornwall.", "images": ["http://time.com/images/newsletter-money.png", "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth2.jpg?quality=85", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth-kate-effect.jpg", "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth3.jpg", "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth-wedding.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth2.jpg?quality=85", "keywords": [], "authors": ["Alix Langone"], "canonical_link": "https://money.com/kate-middleton-net-worth/", "title": "Kate Middleton Had a Massive Fortune Before She Was a Duchess. Here’s What We Know About the Royal’s Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "onetime,Royal Family", "news_keywords": "onetime,Royal Family", "description": "Kate Middleton rarely has to spend her own money, but the Duchess of Cambridge had a massive net worth before she married Prince William", "og": {"title": "Kate Middleton Had a Massive Fortune Before She Was a Duchess. Here’s What We Know About the Royal’s Net Worth", "type": "article", "site_name": "Money", "url": "https://money.com/kate-middleton-net-worth/", "description": "The 36 year-old Duchess of Cambridge rarely has to spend her own money", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth2.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/kate-middleton-net-worth/", "description": "Kate Middleton rarely has to spend her own money, but the Duchess of Cambridge had a massive net worth before she married Prince William", "media": "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth2.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/kate-middleton-net-worth/", "title": "Kate Middleton Had a Massive Fortune Before She Was a Duchess. Here’s What We Know About the Royal’s Net Worth", "description": "The 36 year-old Duchess of Cambridge rarely has to spend her own money", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/04/kate-middleton-net-worth2.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}