{"url": "https://www.etonline.com/blac-chynas-attorneys-speak-out-against-revenge-porn-after-leak-of-alleged-sex-tape-96691", "text": "Following the leak of a sex tape allegedly featuring Blac Chyna and an unknown man, the reality star's lawyers are speaking out against the release of the tape, calling it \"revenge porn.\"\n\nChyna's attorney, Walter Mosley, tells ET that the minute-long clip, leaked on Monday, is \"a matter for the police to investigate\" and that he and Chyna are \"taking that course of action.\"\n\n\"We’re going to turn over all of our leaks to the authorities and let them pursue the matter the best way that they’ve been trained to do,\" Mosley said.\n\nMosley has also been sending cease and desist letters to various websites hosting the video, and many have subsequently removed the video. Additionally, the Twitter account that originally posted the clip has been removed.\n\nOn Monday, Mosley took to Instagram to share a statement condemning the prevalence of sex tape leaks and the culture that he feels excuses it.\n\n\"We have to change this culture of abuse and assault against women. Today’s post saddens me deeply as it is an attack not only against my client but my friend,\" Mosley wrote. \"Why do we think it’s acceptable to sell, or publish, or seek revenge, or blackmail women in this way and without their consent? It’s not.\"\n\nThe high-profile attorney then implored men to \"do better.\"\n\n\"I’m tired of telling my clients to not make videos because the men will put them out later. It’s like I’m telling them not to wear short skirts because you’re going to entice a man to rape you,\" he continued. \"And like most rapes, these betrayals often come from those most close to us. So today I’m saying, men we need to do better. We need to tell each other to do better. We need to stop sharing these videos with each other in the club, at the barbershop or (and especially) online.\"\n\nMosely concluded by calling it a \"morally corrupt action,\" one that is criminal in the state of California.\n\n\"Maybe it is time to set an example,\" he wrote.\n\nAttorney Lisa Bloom, who represented Chyna during her lawsuit against her ex-fiance, Rob Kardashian, last year, took to Twitter to explain the dangers of illegally posting sex tapes.\n\n\"Revenge porn -- posting explicit images without the consent of everyone in those images -- is a crime, a civil wrong, and a form of domestic abuse,\" Bloom wrote, without referring to Chyna by name in her posts. \"It's also a way to try to slut shame women for being sexual. Girls have killed themselves over revenge porn. It's not a joke.\"\n\nRevenge porn -- posting explicit images without the consent of everyone in those images -- is a crime, a civil wrong, and a form of domestic abuse.\n\nIt's also a way to try to slut shame women for being sexual.\n\nGirls have killed themselves over revenge porn.\n\nIt's not a joke. — Lisa Bloom (@LisaBloom) February 19, 2018\n\nBloom also responded to a critic who dismissed the outrage because, they claimed, Chyna \"knew [the man] was recording.\"\n\n\"Whether a woman knows she's being recorded is not the issue. Whether she consented to posting is,\" Bloom tweeted. \"Our bodies, our choice, each and every time.\"\n\nWhether a woman knows she's being recorded is not the issue. Whether she consented to posting is.\n\nOur bodies, our choice, each and every time. https://t.co/4mhradQk4c — Lisa Bloom (@LisaBloom) February 19, 2018\n\nET has reached out to Chyna's attorney for comment.\n\nCurrently, Chyna is involved in a lawsuit against several members of the Kardashian family -- including her ex, Kris Jenner, Kim Kardashian, Khloe Kardashian and Kylie Jenner. Check out the video below to hear more on the contentious legal battle.\n\nKhloe Kardashian Thinks Blac Chyna Is 'Taunting' Rob During Their Legal Drama This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nBlac Chyna Adds Khloe Kardashian and Kylie Jenner Back Into Her Lawsuit Against Kardashian Family\n\nRob Kardashian & Blac Chyna's Most Dramatic Moments: A Timeline\n\nRob Kardashian and Blac Chyna's NSFW Feud: Here's Everything You Need to Know!", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/blac_chyna_gettyimages-858483410.jpg?h=900fcf70&itok=maV7TWuR", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-10/blac_chyna_gettyimages-858483410.jpg?h=900fcf70&itok=Kz-5WYFB", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/blac_chyna_gettyimages-858483410.jpg?h=900fcf70&itok=maV7TWuR", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/blac-chynas-attorneys-speak-out-against-revenge-porn-after-leak-of-alleged-sex-tape-96691", "title": "Blac Chyna's Attorneys Speak Out Against 'Revenge Porn' After Leak of Alleged Sex Tape", "meta_data": {"article": {"opinion": "false"}, "title": "Blac Chyna's Attorneys Speak Out Against 'Revenge Porn' After Leak of Alleged Sex Tape | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/blac-chynas-attorneys-speak-out-against-revenge-porn-after-leak-of-alleged-sex-tape-96691", "title": "Blac Chyna's Attorneys Speak Out Against 'Revenge Porn' After Leak of Alleged Sex Tape", "description": "The reality star's lawyers took to social media to slam the practice of releasing sex tapes to the public, calling it a 'morally corrupt action.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/blac_chyna_gettyimages-858483410.jpg?h=900fcf70&itok=maV7TWuR", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The reality star's lawyers took to social media to slam the practice of releasing sex tapes to the public, calling it a 'morally corrupt action.'", "title": "Blac Chyna's Attorneys Speak Out Against 'Revenge Porn' After Leak of Alleged Sex Tape", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/blac-chynas-attorneys-speak-out-against-revenge-porn-after-leak-of-alleged-sex-tape-96691", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/blac_chyna_gettyimages-858483410.jpg?h=900fcf70&itok=maV7TWuR"}, "description": "The reality star's lawyers took to social media to slam the practice of releasing sex tapes to the public, calling it a 'morally corrupt action.'", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Blac Chyna", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}