{"url": "https://web.archive.org/web/20180514093542/https://www.elle.com/uk/life-and-culture/culture/news/a33406/the-weeknd-and-selena-gomez-are-in-relationship/", "text": "31 October: Photos emerge of Selena Gomez and Justin Bieber's breakfast reunion\n\nNow, photographs have surfaced of the pair heading to a service at Zoe Church following a breakfast date, marking this the first time the former couple have been photographed together since 2015.\n\n30 October: Selena and The Weeknd reportedly split after 10 months of dating\n\nAdvertisement - Continue Reading Below\n\nPeople reports that after 10-months-of dating, the pair have called time on their union due to conflicting schedules and the challenges of keeping up a long distance relationship.\n\nGetty Images\n\n'She and Abel have been going back and forth for a few months about their relationship,' a source told the publication.\n\n29 October: The Weeknd unfollows Selena's friends and family on Instagram\n\nThe crooner was seen to have unfollowed his girlfriend's closest family and friends on the social media platform, the same day Selena was spotted with her ex Justin Bieber at breakfast and attending a church service together.\n\nAdvertisement - Continue Reading Below\n\n17 October: Selena and The Weeknd wear matching hoodies for fright night date\n\nOn Friday, the adorable pair were spotted enjoying a date night at Los Angeles's Universal Studios Halloween Horror Nights, wearing matching black hoodies tied tightly around their necks, which proved to be unsuccessful in disguising their A-list looks for fans.\n\n18 September: Selena gets a puppy\n\nOn Friday, the 'Fetish' singer was spotted for the first time since revealing she'd undergone a kidney transplant due to her lupus wearing a red hoodie and fringed black sweatpants carrying a teeny tiny Cavalier King Charles Spaniel puppy.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nEarlier this month, the singer and her boyfriend were spotted in a puppy pen with dogs in New York City. The little pup is reportedly called Charles, naturally.\n\nSelena having fun with her new puppy, video from Selena’s Instagram Story https://t.co/sdhCyIt1H7 pic.twitter.com/nzn9SsY9Yu — Wasa Miroshnichenko (@SELENATORSS) September 10, 2017\n\n17 September: Selena supports The Weeknd at concert\n\nThe Weeknd played in Philadelphia on Saturday night, and in Washington D.C. on Friday. As usual, Gomez was happy to pose with fans that spotted her at the concert.\n\nAmazing night with amazing friends A post shared by Gianna Isabella (@thegiannaisabella) on Sep 16, 2017 at 7:32pm PDT\n\nAdvertisement - Continue Reading Below\n\n15 September 2017: The Weeknd scheduled his tour around Selena's surgery\n\nYesterday afternoon, Gomez shocked the world when she announced she had undergone a major kidney transplant over the summer as a a result of her Lupus, much to her fans dismay.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nIn a post to Instagram, the 25-year-old revealed her best friend Francia Raisa had donated the kidney.\n\nA source has now revealed to People that The Weeknd scheduled his 'Starboy: Legend of the Fall' tour around her surgery so he could spend time with her while she recuperated.\n\nThe Weeknd (real name Abel Tesfaye) started the first part of his world tour in February and ended in 22 July. He was then went on a break from performing until the second part of his tour started again on 6 September.\n\nAs a result, this game him enough time during the summer to be at Gomez's bedside.\n\nA post shared by Selena Gomez (@selenagomez) on Sep 5, 2017 at 12:09am PDT\n\nAdvertisement - Continue Reading Below\n\nWhile we still don't know when the transplant took place, the singer did mention the procedure is the reason why she was under-the-radar for 'part of the summer'.\n\nThe Weeknd, you just received major boyfriend points.\n\n11 September 2017: Selena opens up about her favourite gift from Abel\n\nIn a Business of Fashion interview, Selena spoke openly about growing up in Texas, her mental health and more.\n\nWhat really had us riveted to our seats, however, was Selena explaining what her favourite present is from her leading man.\n\nShe told the magazine: 'My boyfriend just got me a beautiful Chanel bag, and [I love it.]'\n\nA post shared by Selena Gomez (@selenagomez) on Sep 5, 2017 at 12:09am PDT\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nBut, it isn't the label that has the singer excited, instead hinting towards a deeper, sentimental value, 'It wasn't because it was a Chanel bag, it's because of where it came from and what it meant. So I wear it so proudly, and I feel cute when I have it on. I feel like, \"I love this!\" it makes me so happy.'\n\nShe loves it so much, her friends literally take the micky out of her, 'It literally just happened so all my friends are laughing because every time I have it on, I feel a certain way. And that to me is an experience.'\n\nAll together now, 'Awww.'\n\n8 September 2017: Selena and The Weeknd make second red carpet appearance as couple\n\nFour months after making their red carpet debut together at the 2017 Met Gala, Selena and The Weeknd were spotted walking the red carpet at New York's Plaza Hotel for the Harper's Bazaar Celebration of Icons By Carine Roitfeld on Friday.\n\nGetty Images\n\nAdvertisement - Continue Reading Below\n\nThe 25-year-old wore a long-sleeved pink Valentino turtleneck dress, strappy red Stuart Weitzman heels, and a green clutch. Meanwhile, The Weeknd wore a tuxedo with sequins on the jacket - one she decided to try on before their night out.\n\nVictoria's Secret model Josephine Skriver also visited the pair head of their star-studded night.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n5 September 2017: Selena posts adorable date night photograph\n\nAfter spending the weekend playing with puppies, the 25-year-old singer and her boyfriend have been enjoying each other's company in New York, holding hands and wearing all-black matching ensembles while strolling the streets of Soho.\n\nAdvertisement - Continue Reading Below\n\nThis morning, Selena posted a photograph to Instagram of her on a date night with her boyfriend of nine-months at celebrity hotspot Carbonne.\n\nIn the snap, the Texas-born singer can be seen pouting her lips into a kiss for the camera while the Canadian crooner has his arm around her and looks into the distance.\n\nA post shared by Selena Gomez (@selenagomez) on Sep 5, 2017 at 12:09am PDT\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nBeyond cute.\n\n22 August 2017: Selena and The Weeknd enjoy date-filled weekend at Disneyland\n\nHaving spent their Saturday night in with pizza and video games on Saturday night in, Selena Gomez and The Weeknd reportedly took a trip to Disneyland, California on Sunday night to conclude their romantic weekend.\n\nE! News reports the pair arrived at the theme park at 8:30 p.m. and spent two and a half hours inside visiting attractions including the Haunted Mansion and Pirates of the Caribbean.\n\nInstagram @brian_stifler\n\nThe pair are said to have enjoyed a VIP tour with another couple, which granted them access to over 30 attractions, character greetings and shows, as well as reserved seating for select nighttime spectaculars, parades and stage shows.\n\nAdvertisement - Continue Reading Below\n\nThe duo, who only went public with their romance at the 2017 Met Gala in May also were spotted snacking on churros during their trip, before eating some corn dogs.\n\n3 August 2017: Selena and The Weeknd gush over each other's magazine covers\n\nLast night, Selena Gomez took to social media t\n\no congratulate her boyfriend, The Weeknd, for his latest magazine cover.\n\nPosing alongside the likes of Adriana Lima and Irina Shayk, the Canadian singer can be seen posing on the cover of Harpers Bazaar in a navy-black shirt and jacket.\n\nInstagram selenagomez\n\nInside the magazine, 'The Hills' singer opened up about the importance of keeping his private life away from the media and his fans.\n\n'I'm not in a rush to let people know everything about me. Mystery is always great,' he admits.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n'Luckily, the only thing the world demands of me is music. I don't have to give them anything else for the rest of my life,' he adds.\n\nHear, hear.\n\n23 July 2017: Selena wears secret message on her pyjama top for her boyfriend\n\nA day after celebrating her birthday with friends and family at a pyjama party at her Lose Angeles home, we noticed the 25-year-old sent a secret message to her boyfriend who was flying back to spend the weekend with her.\n\nOn closer inspection of her Instagram posts from her birthday, we spotted Selena wore a sweatshirt designed by Dream Scene Clothing with the word 'loved' emblazoned on the front, which pretty much sums up how she must be feeling right not.\n\nAfter all, it's not every boyfriend who would fly 12 hours from Paris to Los Angeles to have a birthday lunch with you.\n\nAdvertisement - Continue Reading Below\n\n22 July 2017: The Weeknd rushes home to celebrate Selena's 25th birthday\n\nThere's nothing quite like the feeling of guilt at the thought of missing a loved one's birthday.\n\nSo, that's probably why The Weeknd jetted home following his headlining performance at Headlining Lollapalooza Paris to spend the weekend with his girlfriend Selena Gomez to celebrate her turning 25.\n\nHaving celebrated her birthday with close family and friends at her Los Angeles home on Friday night, Selena then welcomed her boyfriend home after he posted the most adorable video to his Instagram Stories of him driving along to his song 'I Feel It Coming'.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nOn Sunday, the pair were spotted enjoying a lunch-date together in Los Angeles.\n\nCute, says what?\n\n13 July 2017: Selena Gomez's fans think The Weeknd is having a great influence on her music\n\nFollowing the release of Gomez's latest single, 'Fetish', and the leaked track 'Stained' yesterday, fans are now freaking out at how heavily influenced her new music is by her boyfriend, The Weeknd.\n\nOk so fetish sounds like The Weeknd accidentally gave the record producers his lyrics and they made Selena sing it anyways — har (@harrisbay_) July 13, 2017\n\nI like Fetish a lot! Selena is changing (in a good way 😊). Maybe because of Abel, there's some The Weeknd vibes in the rhythm 😍🙌🙌 pic.twitter.com/CFy0BK4j1r — Inês Simões (@JustNesSimons) July 13, 2017\n\nAdvertisement - Continue Reading Below\n\n\"if I were you, I'd do me too\" 👀👀 ok selena gomez, the weeknd has brought out yo freaky side 😂😁 fetish is a jam tho 👌 — that damn kel (@Blvck_Picvsso) July 13, 2017\n\nThe Weeknd has definitely been influencing Selena on her new music #SelenasNewSingleOutNow #Fetish — Kenny Jones (@relientkenny) July 13, 2017\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nIMAGINE FETISH REMIX FT. KENDRICK LAMAR & THE WEEKND — . (@jamesjointed) July 13, 2017\n\nCome on guys, give us a collaboration!\n\n10 July: The Weeknd 'Likes' Post About Selena Gomez Looking Hot\n\nDespite having dated for several months and appeared on the 2017 Met Gala together to show the world they were finally 'official', we can imagine Selena Gomez was pretty chuffed when she realised her boyfriend recently 'liked' a fan video of her with a seriously complimentary caption.\n\nOn Monday, a fan of the 24-year-old posted a clip of the singer meeting fans, wearing a plunge-neck back jumpsuit, with the captioned, 'She looks hot' – a sentiment her beau clearly agreed with.\n\nAdvertisement - Continue Reading Below\n\n30 June: Selena likes three of The Weeknd's Instagram photos\n\nAfter weeks of press appearances and interviews about her latest single 'Bad Liar', Selena Gomez has enjoyed several days off social media.\n\nHowever, the singer returned to Instagram yesterday to 'like' three photos that her boyfriend posted.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n22 June: Selena proudly snaps an Instagram video of her boyfriend's Forbes cover\n\nThe 24-year-old snapped a picture of her boyfriend's recent Forbes cover, after touring with the Canadian crooner for several weeks.\n\nInstagram selenagomez\n\nIn response, The Weeknd posted an Instagram story of an image from Gomez's just-released Coach campaign.\n\nInstagram theweeknd\n\nCute, or what?\n\n13 June: Selena explains why she went public with her relationship\n\nIn a recent interview on On Air With Ryan Seacrest, Selena opened up about the mental toll of keeping her superstar romance under wraps.\n\nAdvertisement - Continue Reading Below\n\n'It's really hard when I would want to spend so much time hiding things. It's too much pressure, and I think everyone gets over everything eventually. I just want to be happy. If that's me just being myself, then I don't really care,' she told the presenter.\n\n7 June: Selena eats cheesecake before The Weeknd's concert\n\nAlright guys, if you needed any further proof these two were 'official' this it: footage of Selena pre-gaming with cheesecake before her boo's gig in New York.\n\nSelena via Instagram stories!! pic.twitter.com/EMPROn1DFV — Selena Gomez News (@SelenaGomezNews) June 7, 2017\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n'I got a cheesecake before my boyfriend's concert,' Gomez said in her Instagram story.\n\nDessert or no dessert, it seems the Bad Liar singer is taking the 'supportive girlfriend' role fairly seriously. During an interview with American radio show, Gomez spoke about being backstage at the Starboy's shows. 'I love just being there and having someone's back. It feels good. I haven't had that feeling in a while,' she said.\n\nTrue to her word, she then attended Abel Tesfaye's show at the Brooklyn's Barclays Center looking adorably cute:[instagram ]https://www.instagram.com/p/BVByE1jgpxe/[/instagra... a thoroughly good time:\n\nAnd\">https://twitter.com/SelenaGomezNews/status/8723001... then put up another Instagram Story of her cuddling up to Tesfaye:\n\nAdvertisement - Continue Reading Below\n\nWe\">https://twitter.com/SelenaGomezNews/status/8723129... think she's sitting on his lap, but we can't be too sure. Either way, the vibe is very Can't Keep My Hands to Myself and further proof that this couple are very happy and DGAF who knows.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n23 May: Selena and Abel take their relationship slowly as they separately buy homes\n\nThe pair are taking each day as it comes with regards to their relatively new romance as both Selena and The Weeknd have just bought mansions in Los Angeles – separately.\n\nFollowing the release of her single, Bad Liar, last week and the success of her Netflix series 13 Reasons Why on which she works as executive producer, Gomez has reportedly bought herself a £1.7 million new house in Los Angeles, according to the Observer.\n\nMeanwhile, her 27-year-old boyfriend has also reportedly dropped a staggering £13.8 million mansion in Hidden Hills, California featuring a whopping nine bedrooms, 11 bathrooms, a resort style saltwater pool (because, of course), a wine cellar, 8-stall barn, a guesthouse and five-car garage, according to the Daily Mail.\n\nWe're just happy to see the pair celebrating their independence.\n\n22 May: Selena and The Weeknd might be collaborating on new music together\n\nIt's like our prayers have been answered.\n\nThe Wikipedia page of songwriter/producer Max Martin – who has collaborated on tunes for the likes of Backstreet Boys, Britney Spears, Celine Dion, Katy Perry, Usher and Taylor Swift – has given a clue as to Gomez's number one choice when it came to collaborating on her up-coming single, 'In Her Element'.\n\nA post shared by Selena Gomez (@selenagomez) on Apr 15, 2017 at 6:04pm PDT\n\nAdvertisement - Continue Reading Below\n\nThe page lists Nicki Minaj, Ryan Tedder (of One Republic fame) and Selena Gomez as songwriters on the track but also named – yeah, that's right – The Weeknd as a co-artist.\n\n'In Her Element' (featuring The Weeknd)' reads the caption.\n\nWe bow down to the Gods of music if this proves to be true.\n\n12 May 2017: Selena teases new music and we hope it's not about the Weekend\n\nThe 24-year-old shared three photos of a mirror, each with the words 'Bad Liar' written on them in what appears to be in purple and red lipstick.\n\nA post shared by Selena Gomez (@selenagomez) on May 11, 2017 at 11:00am PDT\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nFrom the looks of Selena and The Weeknd (real name Abel Makkonen Tesfaye) at the Met Gala, we have a feeling the words 'Bad Liar' won't refer to her 27-year-old beau, although, there is one person she might be sending a subtle/not-so-subtle message to (*cough* Justin Bieber).\n\n7 May 2017: Selena takes her family to The Weeknd's concert\n\nHaving received the stamp of approval from her mother with a comment on Instagram, the 'It Ain't Me' singer invited her family and friends to watch her boyfriend's concert in Dallas, Texas over the weekend.\n\nThe 24-year-old attended the 'Starboy: Legend of the Fall' gig with her cousin, Priscilla DeLeon, and nephew, Aiden.\n\nPriscilla later shared photos of her famous cousin on the day of the show, captioning the image on Instagram: 'Still got it.'\n\nAdvertisement - Continue Reading Below\n\nStill got it. A post shared by Priscilla DeLeon (@pmdeleon22) on May 5, 2017 at 8:50am PDT\n\nHours later, a fan filmed a video of Selena and her family enjoying her beau's performance of his hit single, 'Starboy', with Priscilla later sharing a photo of her walking backstage.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nA post shared by Priscilla DeLeon (@pmdeleon22) on May 5, 2017 at 8:50am PDT\n\n1 May 2017: Selena Gomez kiss on 2017 Met Gala red carpet\n\nIt was the moment we were all waiting for.\n\nAt the 'Rei Kawakubo/Comme des Garcons: Art Of The In-Between' Costume' event in New York earlier this month, the 24-year-old singer was spotted snuggling up to her Canadian beau on the red carpet, wearing an embellished pink slip gown by Coach's Stuart Vevers and matching bag which had a secret message embroidered into it's base for her fans.\n\nGetty Images\n\nAdvertisement - Continue Reading Below\n\nWalking hand-in-hand with The Weeknd, the singers kissed for the cameras in front of the paparazzi, with Selena reportedly even dropping the 'L-word' to her new boyfriend at the event.\n\nGetty Images\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nAll together now...cute!\n\n16 April 2017: Selena and The Weeknd go public with their romance at Coachella\n\nOver the weekend, the Canadian singer surprised his fans with a performance at Coachella Festival before enjoying a PDA-filled evening with his girlfriend, Selena, during the weekend's Neon Carnival party.\n\nA day later, the 24-year-old singer posted a picture of her cosying up to her new beau to Instagram, wearing a sunflower-print blue dress with a matching neck scarf.\n\nA post shared by Selena Gomez (@selenagomez) on Apr 15, 2017 at 6:04pm PDT\n\n7 April 2017: The Weeknd goes Instagram 'official' with Selena\n\nAfter months of dating, the Canadian singer has finally gone public with his high-profile relationship with Selena Gomez in the only way celebrities know how: with a post to Instagram.\n\nAdvertisement - Continue Reading Below\n\nOn Friday, The Weeknd posted a candid shot of Selena kissing him on the cheek, much to the joy of his fans who called them a 'dream couple' and said they were 'made for each other'.\n\n6 April 2017: Bella Hadid finally unfollows The Weeknd On Instagram\n\nBella might have unfollowed Selena soon after she was spotted smooching The Weeknd earlier this year, but it appears the time has come to finally cut off all ties with her ex-boyfriend for good.\n\nYesterday, the model unfollowed the Canadian crooner on Instagram.\n\n❤️ A post shared by 🦋 (@bellahadid) on Oct 11, 2016 at 9:38am PDT\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nWhile pictures of the pair during the relationship still remain on her Instagram feed, the 19-year-old has quietly put an end to their social media ties, unlike her sister, Gigi, who still follows The Weeknd and Gomez.\n\n🌸🕊 A post shared by 🦋 (@bellahadid) on Apr 2, 2017 at 10:14pm PDT\n\nWe don't blame Bella for unfollowing her ex, nobody wants to see a former flame with someone new.\n\n24 March 2017: Following, Unfollowing\n\nUh-oh, it's all got a little bit cloak and dagger in celeb land, with two different camps emerging on Twitter and Instagram.\n\nHailey Baldwin has already made her allegiances very clear on Twitter, with her support-tweet for BFF Bella Hadid on January 31.\n\nBut as of this week, The Weeknd and Selena have gone in for a double un-follow of Bella Hadid on Instagram.\n\nAdvertisement - Continue Reading Below\n\nNo results for Bella Hadid as of this morning\n\n19 March 2017: The Weeknd Sweetly Tells Selena Off For Borrowing His Hoodie\n\nA post shared by Selena Gomez (@selenagomez) on Mar 10, 2017 at 9:38pm PST\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nOn the above Insta post, he commented \"sweater 🙄.\"\n\n27th February 2017: Selena jets to Paris to visit The Weeknd\n\nOn Monday, The Weeknd welcomed his rumoured girlfriend, Selena Gomez, to Paris ahead of his gig at the AccorHôtels Arena.\n\nThe Weeknd (real name Abel Tesfaye) is currently on the European stint of his tour and celebrated his 23-year-old girlfriend's visit to the 'city of love' by treating her to a date night ahead of his concert.\n\nThe pair were spotted leaving La Réserve hotel, with Selena wearing a black turtleneck jumper to keep her warm from the cold February weather, mere streets away from Bella Hadid – The Weeknd's ex-girlfriend – who is currently staying in the same city at the Hotel George V hotel.\n\nAdvertisement - Continue Reading Below\n\nThe following day, Selena posted a video to her Instagram story of her cuddling up in her duvet while a male voice can be heard rapping in the background – a voice thought to be that of her new beau.\n\nSelena via Instagram Story. pic.twitter.com/HIOmoQmtu6 — Selena Gomez News (@SelenaGomezNews) February 28, 2017\n\nThe news comes days after Selena posted another video to Instagram of her watching her rumoured boyfriend on television, in which she can be heard saying 'hey, baby' when he appears on screen.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nTheir relationship is too adorable, right now.\n\n22 February 2017: Selena wears The Weeknd's T-shirt\n\nDespite keeping their romance on the low-down in recent weeks, Selena has just been spotted wearing a T-shirt from her beau's tour merchandise range, featuring two little red lightning bolts and a red cross.\n\nOn Monday, Gomez's mother, Mandy Teefey, posted a photo to Instagram of her family game night. Mandy made the joke her daughter's date for the night was talent manager Ray Hughes, but if Selena's T-shirt is any indication, we have a feeling a certain Monsieur Weeknd (real name Abel Tesfaye) has well and truly stolen her heart.\n\nAnd, we're not the only ones to have spotted Gomez's clue to her blossoming new relationship.\n\nAdvertisement - Continue Reading Below\n\nFans of both Gomez and The Weeknd have taken to Twitter to confirm the news that Gomez is, in fact, wearing his T-shirt.\n\nIt's happening, people!\n\n4 February 2017: Selena and The Weeknd's snuggle up with newborn child\n\nIt's been less than a month since we learned of the blossoming romance between Selena Gomez and The Weeknd, and now it looks like the pair are already thinking about babies. Well, sort of.\n\nOver the weekend, the two were snapped meeting the newborn baby of The Weeknd's manager, Tony Sal.\n\nIn a collaged image posted by the new father, Abel can be seen snuggling up to the baby. In another, Selena (top left) sits on the hospital bed with the new mother and the baby in her arms.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nDespite the fact the musical pair's relationship is still in its honeymoon phase, their fans are already thinking about their family lineage, suggesting the pair look eerily like Gomez's parents, Ricardo Gomez and Mandy Teefy.\n\n3 February 2017: Selena Gomez teases fans with new music, rumoured to be about Justin Bieber\n\nOn Friday, the singer teased a snippet of a new track on her Instagram story. In the black-and-white clip, she can be seen tossing her tousled locks and miming the lyrics: 'I had a dream, we were back to 17, summer nights... never growing up.'\n\nAdvertisement - Continue Reading Below\n\nAs Gomez started dating Bieber when she was 17-years-old, many fans think her new single could be a direct reference to her relationship with her ex.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n31 January 2017: Hailey Baldwin suspected of throwing shade at Selena\n\nOn Tuesday morning, the 20-year-old model gave a shout-out to her BFF Bella Hadid, posting a video of Hadid chilling out at home.\n\nAnd while the clip of Bella playing in a bath with rubber ducks, eating pizza on her couch and playing Jenga is adorable, it was Hailey's tweet that got Selena fans talking.\n\n'Wait sorry, WHO could possibly be cuter than @bellahadid .... literally nobody,' she wrote.\n\nWait sorry, WHO could possibly be cuter than @bellahadid .... literally nobody. https://t.co/GqOieih2g6 — Hailey Baldwin (@haileybaldwin) January 31, 2017\n\nAfter posting the tweets, fans of the pair began speculating her post might have been a subtle dig at Selena, who is currently dating Hadid's ex The Weeknd.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\n30 January 2017: Selena deletes Instagram video of the Weeknd\n\nHours after the Canadian singer posted a video of himself on Selena's Instagram account, the former Disney star surprisingly deleted the clip.\n\nInstagram selenagomez\n\nAdvertisement - Continue Reading Below\n\nIn its place, she posted a quote from Ashton Kutcher, who spoke out in defence of immigrants in the US during his SAG award speech, following Donald Trump's #MuslimBan.\n\n[instagram ]\n\nA post shared by Selena Gomez (@selenagomez) on Jan 30, 2017 at 1:27am PST\n\nThe star later posted a picture of her mother, Mandy Teefey, to Instagram with the caption:\n\n'I sit back and think about how much she has done and shown me. It truly has blown me away. She teaches me most about life and I couldn't be luckier to have a partner like her in life.'\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nIt appears Selena isn't ready to make things 'Instagram official' with her new beau quite yet.\n\n30 January 2017: Selena and the Weeknd make their relationship Instagram official\n\nLast week, the loved up couple were spotted hanging out in Italy – aka one of the romantic countries in the world – and seemed to confirm their new romance was the real deal.\n\nDays later, the pair started following each other on Instagram with 'The Hills' singer taking to Instagram stories to post a picture of his rumoured girlfriend admiring The Birth of Venus at The Uffizi Gallery in Florence.\n\nInstagram theweeknd\n\nAnd now, The Weeknd has just made his relationship 'official' by posting an Instagram video of himself on Selena's account. I mean, there's no denying the pair are an item now, is there?\n\nAdvertisement - Continue Reading Below\n\nIn the clip, Selena can be heard speaking to someone in the background while her new beau takes a video of himself on what appears to be a boat.\n\n25 January 2017: Selena Gomez and the Weeknd spotted holding hands\n\nAccording to E! News, the former Disney star and the singer were seen indulging in some P.D.A during a trip to the arcade with friends, including the likes of rapper French Montana, Jaden Smith and the Khadra twins.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nFor their group date, Gomez was seen rocking an oversized denim jacket with a bare midriff, paired with wide-legged jeans, while her new beau sported an all-black ensemble with a gold jacket and tennis shoes.\n\nFrench Montana shared a picture to Instagram of him posing with the Weeknd and Jaden and wrote the caption, 'Young legends #newsboyband #shwag'.\n\nNow, this is a boy band we'd love to see.\n\n21 January 2017: Justin Bieber calls The Weeknd's music 'whack'\n\nOn Saturday, Selena Gomez' ex-boyfriend Justin Bieber didn't hold back when questioned about Gomez's recent romance with The Weeknd.\n\nWhen asked by TMZ whether he'd be listening to The Weeknd's music anytime soon, Justin replied: 'Hell no, that sh*t is whack.'\n\nAdvertisement - Continue Reading Below\n\nGetty Images\n\nSounds like the Biebs is totally fine with his ex moving on then...not.\n\n20 January 2017: The Weeknd runs into ex-girlfriend Bella Hadid at concert\n\nOn 18 January, Bella and The Weeknd bumped into each other at a concert in New York City's Madison Square Garden.\n\nAccording to Teen Vogue, the gig was a tribute to the late super-producer A$AP Yams, who passed away two years ago.\n\nSnapchat: Ben Baller\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nOn the night, The Weeknd was seen taking to the stage for a surprise performance, while Bella – who was snapped on Snapchat by friend Ben Baller – stood in the crowd dancing with Kendall Jenner.\n\nSnapchat: Ben Baller\n\n13 January 2017: The Weeknd's latest song hints at Selena Gomez romance\n\nShowbusiness is a fickle world.\n\nCast your mind back to 2015, when The Weeknd featured his then rumoured girlfriend Bella Hadid in the music video for his hit single 'In The Night', which ultimately confirmed to the world that yes, the pair were indeed an item. I mean, how could they not be with that kiss.\n\nWell, it now looks like The Weeknd has found a new muse for his musical delights – none other than former Disney child actress and pop star, Selena Gomez.\n\nGetty Images\n\nAdvertisement - Continue Reading Below\n\nYesterday, the Canadian-born star – otherwise known as Abel Makkonen Tesfaye – dropped the music video for his hotly-anticipated single 'Party Monster' and, on first glance, you might notice there's a similar theme running through the clip.\n\nYes, all of the models featured look exactly like Selena.\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nOf course, this could be a coincidence, but earlier this week Gomez and Abel gave the biggest hint of the century that they were more than just friends, with the 22-year-old starlet seen kissing her rumoured beau, resulting in a swift 'unfollowing' from Hadid on Instagram.\n\nOuch.\n\nHowever, The Weeknd has just given fans another clue into the pair's budding relationship, with his latest single featuring a not-so-subtle line all about Selena.\n\n'Ooh, she mine, ooh girl, bump a line/Angelina, lips like Angelina/like Selena, ass shaped like Selena,' he sings.\n\nGetty Images\n\nAdvertisement - Continue Reading Below\n\nI mean, why not write tattoo 'I fancy Selena Gomez' on your forehead, it's far less obvious.\n\nOf course, it didn't take long before the pair's fans look to Twitter to find out whether the lyrics are definitively about Gomez, and not another American singer called Selena Quintanilla-Pérez.\n\nSo many Selenas!\n\nrealizing the lyrics in party monster were in fact about selena gomez pic.twitter.com/RpIVBAMqzZ — carlos (@carlos_rrey) January 12, 2017\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nIn Party Monster i can bet my life that The Weeknd is talking about Selena Quintanilla not Gomez — Kenny Jones (@relientkenny) January 12, 2017\n\nYALL TRYING TO SAY THE LYRIC IN PARTY MONSTER WASNT ABOUT SELENA GOMEZ pic.twitter.com/qLN9ay9PCH — ryan :$ (@Iustforlove) January 11, 2017\n\nAdvertisement - Continue Reading Below\n\nWe can't wait to see this one play out.\n\n12 January 2017: Bella Hadid unfollows Selena Gomez on Instagram\n\nLast night, Selena Gomez confirmed to the paparazzi via a series of make-out pics that she's hanging out with The Weeknd – Hadid's ex-boyfriend.\n\nGetty Images\n\nThe pair were spotted hugging and kissing following a three-hour long date night at Santa Monica hotspot Giorgio Baldi.", "images": ["https://web.archive.org/web/20180514093542im_/https://hips.hearstapps.com/elleuk.cdnds.net/17/19/3200x1600/landscape-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://web.archive.org/web/20180514093542im_/https://hips.hearstapps.com/elleuk.cdnds.net/17/02/980x490/landscape-1484213057-landscape-1484158697-selena-bella.jpg?resize=300:*"], "top_img": "https://web.archive.org/web/20180514093542im_/https://hips.hearstapps.com/elleuk.cdnds.net/17/19/3200x1600/landscape-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg?resize=1200:*", "keywords": [], "authors": ["Katie O'Malley"], "canonical_link": "https://web.archive.org/web/20180514093542/https://www.elle.com/uk/life-and-culture/culture/news/a33406/the-weeknd-and-selena-gomez-are-in-relationship/", "title": "Selena Gomez And The Weeknd Are Dating: A Timeline Of Everything", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "A Timeline Of Selena Gomez And The Weeknd's Relationship", "description": "R.I.P 'Abelena'", "url": "https://web.archive.org/web/20180514093542/http://www.elleuk.com/life-and-culture/culture/news/a33406/the-weeknd-and-selena-gomez-are-in-relationship/", "image": {"identifier": "https://web.archive.org/web/20180514093542im_/https://hips.hearstapps.com/elleuk.cdnds.net/17/19/3200x1600/landscape-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 201742389861242}, "article": {"publisher": "https://www.facebook.com/ELLEuk", "modified_time": "2018-03-21 09:18:05", "published_time": "2017-10-31 12:00:00", "section": "Culture"}, "twitter": {"site": "@ELLEUK", "card": "summary_large_image", "image": "https://web.archive.org/web/20180514093542im_/https://hips.hearstapps.com/elleuk.cdnds.net/17/19/3200x1600/landscape-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Selena Gomez And The Weeknd Are Dating: A Timeline Of Everything", "description": "Subtlety isn't your strong point, is it Abel?", "keywords": "Bella Hadid,Selena Gomez", "news_keywords": "Selena Gomez, The Weeknd, single, Party Monster, Bella Hadid", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/elleuk.cdnds.net/17/19/1600x1600/square-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Life + Culture,Bella hadid,Selena Gomez", "sailthru.date": "2017-10-31T00:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/elleuk.cdnds.net/17/19/3200x1600/landscape-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/elleuk.cdnds.net/17/19/1600x1600/square-1494328813-selena-gomez-the-weekend-met-gala-2017.jpg", "sailthru.socialtitle": "A Timeline Of Selena Gomez And The Weeknd's Relationship", "sailthru.excerpt": "31 October: Photos emerge of Selena Gomez and Justin Bieber's breakfast reunion Now, photographs have surfaced of the pair heading to a service at Zoe Church following a breakfast date, marking this the first time the former couple have been photographed together since 2015. 30 October: Selena and The Weeknd...", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1509422400.0, "source": "https://web.archive.org", "summary": ""}