{"url": "https://www.heyalma.com/11-times-jenny-slate-proved-she-is-all-of-us/", "text": "Jenny Slate is everyone’s favorite internet BFF. The Jewish comedian, actor, and author is best known as the star of award-winning indie abortion comedy Obvious Child. Lately, she’s become a fan favorite for her character work on hit shows like Parks and Recreation, Bob’s Burgers, Hello Ladies, and Kroll Show.\n\nSlate’s brash, no-filter style makes her one of the most memeable–not to mention relatable–celebs out there. Sure, she pals around with famous comedians and has dated super-celebrity Chris Evans, but when push comes to shove, Jenny Slate always keeps it real. Here are 11 times she’s proved that she is all of us:\n\n1. When she accidentally dropped an f-bomb on SNL:\n\n(Image: SNL/NBC)\n\nOk, so most of us will never appear on SNL, but who can’t relate to dropping an f-bomb at an inopportune time? Slate famously cursed on her very first appearance on SNL. She was unceremoniously fired from the show at the season’s end, and has called the experience “embarrassing, devastating, humiliating, a bummer of a mistake.” Years later, she’s finally come out on top. She is the underdog we all see in ourselves.\n\n2. When she thought it was a prank that Chris Evans was into her:\n\n(Image: Comedy Central)\n\nSlate famously dated Hollywood heartthrob Chris Evans after the two filmed the movie Gifted together. She has admitted that originally, she didn’t think she was Captain America’s type: “Eventually, when it was like, Oh, you have these feelings for me?, I was looking around like, Is this a prank? I mean, I understand why I think I’m beautiful, but if you’ve had a certain lifestyle and I’m a very, very different type of person — I don’t want to be an experiment.”\n\n3. And when she got over their breakup by watching You’ve Got Mail on repeat:\n\n(Image: Obvious Child)\n\nSlate said she wept through You’ve Got Mail “so many times it was unbelievable” during her breakup with Evans. She also took comfort in listening to Alanis Morrisette’s infamous breakup album Jagged Little Pill on repeat. Everybody knows nothing heals a broken heart like sobbing it out to your favorite romcoms and screaming “You Oughta Know” at the top of your lungs. See? All of us!\n\n4. When she had this hilarious reaction to being told she couldn’t order a Bloody Mary before noon:\n\n5. When she refused to grow up:\n\n(Image: Late Night Seth Meyers)\n\n6. When she perfectly explained what modern life is like\n\n7. When she thought her childhood stuffed animals were alive\n\nSlate shared this gem of an anecdote with the NY Times: “When I was little I felt that there was something alive in my stuffed animals and in this Madame Alexander doll I slept with every night named Pudding. I slept with 36 stuffed animals and they were in a specific rotation so that each could get a night sleeping next to me. I didn’t want to hurt their feelings.”\n\n8. When she got lonely and begged one of her girlfriends to get drunk with her\n\n(Image: Mae Whitman Instagram)\n\nOne night, Slate was sitting at a bar alone, reading a book about the Holocaust, and she felt a wave of loneliness. She immediately texted one of her BFFs, Mae Whitman (of NBC’s Parenthood): “I was just like, ‘Can you please help me? I’m so lonely.’ And she came and we got shitbombed, and I woke up the next morning and saw my headphones on my neighbor’s yard. I have no idea how they ended up there.”\n\n9. When she admitted she feels like an imposter adult\n\n(Image: Obvious Child)\n\nIn an essay for Lenny Letter, Slate wrote: “Listen, I often walk around feeling that I’m an impostor adult. I make a ton of mistakes, and if my feelings were a person, that person would have messy hair like a bird’s nest (there might even be birds in there), skinned knees, and crumbs in her pockets, but also vibrant powers.”\n\n10: When she unfollowed NASA because space is just too real\n\n(Image: Comedy Central)\n\nWhen Slate made an appearance on Comedy Central’s Drunk History, she shared that she had to unfollow NASA: “I had to unfollow NASA on Instagram ‘cause it made me too crazy. It would be like, ‘here’s a picture of a fucking black hole,’ and I was like *SCREAMS*”\n\n11. When she was lip syncing to Beyoncé and her dogs weren’t having it", "images": ["https://www.heyalma.com/wp-content/uploads/2017/07/Stuffed-animal-panda-costume.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-13-at-2.16.09-PM.png", "https://www.heyalma.com/wp-content/uploads/2017/07/giphy-22.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/Bx7qJ7.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/tumblr_n6uyovfd2b1qhly8ko2_250.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/giphy-downsized-medium.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/tumblr_nb0vryr1oi1rvsoq2o1_500.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/2zpni8p.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-13-at-1.58.49-PM.png", "https://www.heyalma.com/wp-content/uploads/2017/07/jenny-slate.jpg", "https://www.heyalma.com/wp-content/uploads/2017/07/pasted-image-0.png", "https://www.heyalma.com/wp-content/uploads/2017/07/tumblr_nb0vryr1oi1rvsoq2o2_500.gif", "https://www.heyalma.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-13-at-1.58.34-PM.png"], "top_img": "https://www.heyalma.com/wp-content/uploads/2017/07/jenny-slate.jpg", "keywords": [], "authors": ["Chelsea Levinson", "Chelsea Levinson Is A Freelance Writer", "Researcher", "Award-Winning Video Producer Who Lives At The Beach", "Loves Her Red-Bearded Dog A Little Too Much.", "Molly Tolsky", "Amanda Doreson"], "canonical_link": "https://www.heyalma.com/11-times-jenny-slate-proved-she-is-all-of-us/", "title": "11 Times Jenny Slate Proved She is All of Us", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "11 Times Jenny Slate Proved She is All of Us", "description": "Jenny Slate is everyone’s favorite internet BFF. The Jewish comedian, actor, and author is best known as the star of award-winning indie abortion comedy Obvious Child. Lately, she’s become a fan favorite for her character work on hit shows like Parks and Recreation, Bob’s Burgers, Hello Ladies, and", "url": "https://www.heyalma.com/11-times-jenny-slate-proved-she-is-all-of-us/", "site_name": "Alma", "updated_time": "2018-08-02T15:07:39-04:00", "image": "https://www.heyalma.com/wp-content/uploads/2017/07/jenny-slate.jpg"}, "article": {"tag": "Pop Culture", "section": "Uncategorized", "published_time": "2017-07-19T09:09:53-04:00", "modified_time": "2018-08-02T15:07:39-04:00", "publisher": "https://www.facebook.com/heyalmacom/"}, "fb": {"app_id": 255227188348018}, "twitter": {"card": "summary_large_image", "description": "Jenny Slate is everyone’s favorite internet BFF. The Jewish comedian, actor, and author is best known as the star of award-winning indie abortion comedy Obvious Child. Lately, she’s become a fan favorite for her character work on hit shows like Parks and Recreation, Bob’s Burgers, Hello Ladies, and", "title": "11 Times Jenny Slate Proved She is All of Us", "image": "https://www.heyalma.com/wp-content/uploads/2017/07/jenny-slate.jpg", "url": "https://www.heyalma.com/11-times-jenny-slate-proved-she-is-all-of-us/", "site": "@hey_alma"}, "wp-parsely_version": "1.13.0"}, "movies": [], "publish_date": 1500469793.0, "source": "https://www.heyalma.com", "summary": ""}