{"url": "https://variety.com/2017/film/news/the-mummy-meltdown-tom-cruise-1202465742/", "text": "There were few signs that a major blockbuster was about to premiere when “The Mummy” rolled into Manhattan last week. The marquee of the AMC Loews Lincoln Square Theatres had gone blank. The carpet was totally covered with black plastic. Security only let guests past barricades after quizzing them about what they were there to see, and everybody had to walk through two imposing metal detectors.\n\nInside the theater, Tom Cruise was jubilant, as he stood in front of the crowd. “Hey y’all,” said the 54-year-old actor. He introduced Alex Kurtzman, the film’s director, as well as the cast members, who stood quietly as Cruise delivered a 10-minute improvised speech. “Movies aren’t made by single people,” he said. “It’s a team effort.”\n\nBut in the case of “The Mummy,” one person–Cruise–had an excessive amount of control, according to several people interviewed. The reboot of “The Mummy” was supposed to be the start of a mega-franchise for Universal Pictures. But instead, it’s become a textbook case of a movie star run amok.\n\nAs Hollywood is playing the blame game on what went wrong on “The Mummy,” which had a measly domestic opening of just $32 million, many fingers are pointing to Cruise. In the same way that he commanded the stage at the film’s premiere, leaving his cast standing awkwardly by his side, several sources close to the production say that Cruise exerted nearly complete creative oversight on “The Mummy,” essentially wearing all the hats and dictating even the smallest decisions on the set. On stage, Cruise admitted his own perfectionist tendencies. “I don’t just make a movie. I give it everything I have and I expect it from everyone also.”\n\nUniversal, according to sources familiar with the matter, contractually guaranteed Cruise control of most aspects of the project, from script approval to post-production decisions. He also had a great deal of input on the film’s marketing and release strategy, these sources said, advocating for a June debut in a prime summer period.\n\nWith terrible reviews, “The Mummy,” which insiders say cost as much as $190 million to make and more than $100 million more to market and release worldwide, may struggle to make its money back. The film is performing much stronger overseas, where it was Cruise’s biggest international rollout with a $142 million opening weekend. It’s not clear if the movie will break even, and it’s cast a shadow on the studio’s plans for a Dark Universe franchise that’s supposed to feature A-list stars like Johnny Depp (as “The Invisible Man”) and Angelina Jolie (in negotiations for “The Bride of Frankenstein”).\n\nA representative for Cruise didn’t respond to a request for comment. In a statement, Universal refuted that Cruise had a negative influence on the production.\n\n“Tom approaches every project with a level of commitment and dedication that is unmatched by most working in our business today,” the statement read. “He has been a true partner and creative collaborator, and his goal with any project he works on is to provide audiences with a truly cinematic moviegoing experience.”\n\nCruise’s controlling behavior comes as Hollywood’s star system is in tatters. In the 1990s and early aughts, studios shelled out big money for the likes of Mel Gibson, Julia Roberts, and Harrison Ford, confident that their names above the title could guarantee ticket sales. In exchange they were offered big perks, hefty salaries, and a sizable share of the profits. Along with the money came the power to veto key decisions. But as comic book movies and special effects-heavy productions took over, top actors found themselves in less demand and with less influence. Cruise has navigated the new landscape better than some–the “Mission: Impossible” franchise still makes money but other efforts such as “Oblivion” have disappointed. Going forward, he may have difficulty exerting the same kind of sway over other films.\n\nIt may be the last hurrah for big movie stars, but on the set of “The Mummy,” Cruise acted like the top gun he once was, calling all the shots. Kurtzman had been in the running to direct the project before Cruise signed on, but the actor gave his blessing for the filmmaker to slide behind the camera. They’d established a comfort level when Kurtzman worked as the screenwriter of “Mission: Impossible III.”\n\nIn the wake of “The Mummy’s” failure, the decision to tap such an untested director on a sprawling action-adventure seems to have been foolhardy. Kurtzman wouldn’t necessarily rank high on a studio’s wish list for a project this big, given that he’s a producer and writer who only helmed one small feature that debuted to mixed reviews (2012’s Chris Pine drama “People Like Us”). As Kurtzman struggled to adjust to scope of the project, it felt more like Cruise was the real director, often dictating the major action sequences and micro-managing the production, according to sources.\n\nThere were other ways that “The Mummy” was transformed from a scary summer popcorn movie into a standard-issue Tom Cruise vehicle. The actor personally commissioned two other writers along with McQuarrie to crank out a new script. Two of the film’s three credited screenwriters, McQuarrie and Dylan Kussman, an actor-writer who played small roles in “The Mummy” and “Jack Reacher,” were close allies of Cruise’s. The script envisioned Nick Morton as an earnest Tom Cruise archetype, who is laughably described as a “young man” at one point.\n\nHis writers beefed up his part. In the original script, Morton and the Mummy (played by Sofia Boutella) had nearly equal screen time. The writers also added a twist that saw Cruise’s character become possessed, to give him more of a dramatic arc. Even though Universal executives weren’t thrilled about the story — which feels disjointed and includes Russell Crowe as Dr. Jekyll — they went along with Cruise’s vision.\n\nAnd the crew fell in line too, behind Cruise as the boss. “This is very much a film of two halves: before Tom and after Tom,” said Frank Walsh, the supervising art director, at a London screening of “The Mummy” this week. “I have heard the stories about how he drives everything and pushes and pushes, but it was amazing to work with him. The guy is a great filmmaker and knows his craft. He will walk onto a set and tell the director what to do, say ‘that’s not the right lens,’ ask about the sets, and as long as you don’t fluff what you’re saying to him … he’s easy to work for.”\n\nOnce the film was done, Cruise brought in his longtime editor Andrew Mondshein to piece together the final picture. (The film’s credits also list Gina and Paul Hirsch as editors.) He spent time in the editing suite overseeing the cutting, which everybody agreed wasn’t working. On the lot, there were differences of opinions about whether Cruise’s directions were improving a picture that had been troubled from its inception or whether they were turning a horror film into a Cruise infomercial. Some believed that Cruise had no choice but to assert himself. Given Kurtzman’s inexperience directing tentpoles, Cruise, who has carried heavily choreographed action movies all his life, had to try to rally the troops or risk having the production fall behind schedule.\n\nUniversal knew that if it wanted “The Mummy” to compete against the likes of “Wonder Woman” and “Guardians of the Galaxy Vol. 2” it needed every ounce of Cruise’s waning star power. As the studio scrambled to deal with weak tracking, it released a portrait in late May of Cruise with other actors from the Dark Universe franchise, including Depp and Javier Bardem (who will play Frankenstein). Yet the studio couldn’t even assemble all the actors in the room at the same time, and the image had to be Photoshopped. The Internet reaction to the last-ditch marketing effort was tepid at best. It was another reminder that the big names that once ruled Hollywood are inspiring a lot less love from audiences.\n\nThe reviews may have been brutal, but at the premiere Cruise seemed pleased, complimenting everyone involved and portraying the finished film as a team effort. “Jake! Jake!” he shouted at one of his co-stars Jake Johnson. “It was awesome working with you, Jake!”\n\nJustin Kroll and Stewart Clarke contributed to this story.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ffilm%2Fnews%2Fthe-mummy-meltdown-tom-cruise-1202465742%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202465742&comment_count=233", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/06/the-mummy-2017-4.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/06/the-mummy-2017-4.jpg?w=1000", "keywords": [], "authors": ["Ramin Setoodeh Brent Lang", "Ramin Setoodeh", "Brent Lang"], "canonical_link": "https://variety.com/2017/film/news/the-mummy-meltdown-tom-cruise-1202465742/", "title": "Inside ‘The Mummy’s’ Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "As Hollywood is playing the blame game on what went wrong on “The Mummy,” many fingers are pointing to Tom Cruise.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202465742, "author": "Ramin Setoodeh,Brent Lang", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-06-14T16:09:04"}, "pmc-tag": "Alex Kurtzman,The Mummy,Tom Cruise", "title": "Inside ‘The Mummy’s’ Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Inside ‘The Mummy’s’ Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)", "url": "https://variety.com/2017/film/news/the-mummy-meltdown-tom-cruise-1202465742/", "description": "There were few signs that a major blockbuster was about to premiere when “The Mummy” rolled into Manhattan last week. The marquee of the AMC Loews Lincoln Square Theatres had gone blank. The carpet…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/the-mummy-2017-4.jpg?w=1000", "width": 1000, "height": 563, "alt": "The Mummy 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-06-14T23:09:04+00:00", "modified_time": "2017-06-15T06:31:40+00:00"}, "twitter": {"creator": "@https://twitter.com/RaminSetoodeh", "site": "@variety", "text": {"title": "Inside ‘The Mummy’s’ Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/the-mummy-2017-4.jpg?w=1000", "alt": "The Mummy 2017"}, "card": "summary_large_image", "title": "Inside ‘The Mummy’s’ Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)", "description": "As Hollywood is playing the blame game on what went wrong on “The Mummy,” many fingers are pointing to Tom Cruise."}, "author": "Brent Lang", "content_type": "Article", "post_id": 1202465742, "title": "Inside 'The Mummy's' Troubles: Tom Cruise Had Excessive Control (EXCLUSIVE)", "published_at": "2017-06-14 16:09:04", "image": "https://pmcvariety.files.wordpress.com/2017/06/the-mummy-2017-4.jpg?w=1000", "comment_count": 233, "tags": "Tom Cruise", "topics": "News", "appeared_in_print": "No", "body": "There were few signs that a major blockbuster was about to premiere when “The Mummy” rolled into Manhattan last week. The marquee of the AMC Loews Lincoln Square Theatres had gone blank. The carpet was totally covered with black plastic. Security only let guests past barricades after quizzing them about what they were there to see, and everybody had to walk through two imposing metal detectors.\r\n\r\nInside the theater, Tom Cruise was jubilant, as he stood in front of the crowd. “Hey y’all,” said the 54-year-old actor. He introduced Alex Kurtzman, the film’s director, as well as the cast members, who stood quietly as Cruise delivered a 10-minute improvised speech. “Movies aren't made by single people,\" he said. \"It's a team effort.\"\r\n\r\nBut in the case of \"The Mummy,\" one person--Cruise--had an excessive amount of control, according to several people interviewed. The reboot of \"The Mummy\" was supposed to be the start of a mega-franchise for Universal Pictures. But instead, it's become a textbook case of a movie star run amok.\r\n\r\nAs Hollywood is playing the blame game on what went wrong on “The Mummy,” which had a measly domestic opening of just $32 million, many fingers are pointing to Cruise. In the same way that he commanded the stage at the film’s premiere, leaving his cast standing awkwardly by his side, several sources close to the production say that Cruise exerted nearly complete creative oversight on \"The Mummy,” essentially wearing all the hats and dictating even the smallest decisions on the set. On stage, Cruise admitted his own perfectionist tendencies. “I don’t just make a movie. I give it everything I have and I expect it from everyone also.”\r\n\r\nUniversal, according to sources familiar with the matter, contractually guaranteed Cruise control of most aspects of the project, from script approval to post-production decisions. He also had a great deal of input on the film's marketing and release strategy, these sources said, advocating for a June debut in a prime summer period.\r\n\r\nWith terrible reviews, “The Mummy,” which insiders say cost as much as $190 million to make and more than $100 million more to market and release worldwide, may struggle to make its money back. The film is performing much stronger overseas, where it was Cruise’s biggest international rollout with a $142 million opening weekend. It’s not clear if the movie will break even, and it’s cast a shadow on the studio’s plans for a Dark Universe franchise that's supposed to feature A-list stars like Johnny Depp (as “The Invisible Man”) and Angelina Jolie (in negotiations for “The Bride of Frankenstein”).\r\n\r\nA representative for Cruise didn't respond to a request for comment. In a statement, Universal refuted that Cruise had a negative influence on the production.\r\n\r\n\r\n\r\n\"Tom approaches every project with a level of commitment and dedication that is unmatched by most working in our business today,\" the statement read. \"He has been a true partner and creative collaborator, and his goal with any project he works on is to provide audiences with a truly cinematic moviegoing experience.”\r\n\r\nCruise's controlling behavior comes as Hollywood’s star system is in tatters. In the 1990s and early aughts, studios shelled out big money for the likes of Mel Gibson, Julia Roberts, and Harrison Ford, confident that their names above the title could guarantee ticket sales. In exchange they were offered big perks, hefty salaries, and a sizable share of the profits. Along with the money came the power to veto key decisions. But as comic book movies and special effects-heavy productions took over, top actors found themselves in less demand and with less influence. Cruise has navigated the new landscape better than some--the \"Mission: Impossible\" franchise still makes money but other efforts such as \"Oblivion\" have disappointed. Going forward, he may have difficulty exerting the same kind of sway over other films.\r\n\r\nIt may be the last hurrah for big movie stars, but on the set of “The Mummy,” Cruise acted like the top gun he once was, calling all the shots. Kurtzman had been in the running to direct the project before Cruise signed on, but the actor gave his blessing for the filmmaker to slide behind the camera. They'd established a comfort level when Kurtzman worked as the screenwriter of “Mission: Impossible III.”\r\n\r\nIn the wake of \"The Mummy's\" failure, the decision to tap such an untested director on a sprawling action-adventure seems to have been foolhardy. Kurtzman wouldn't necessarily rank high on a studio’s wish list for a project this big, given that he’s a producer and writer who only helmed one small feature that debuted to mixed reviews (2012’s Chris Pine drama “People Like Us”). As Kurtzman struggled to adjust to scope of the project, it felt more like Cruise was the real director, often dictating the major action sequences and micro-managing the production, according to sources.\r\n\r\nThere were other ways that \"The Mummy\" was transformed from a scary summer popcorn movie into a standard-issue Tom Cruise vehicle. The actor personally commissioned two other writers along with McQuarrie to crank out a new script. Two of the film's three credited screenwriters, McQuarrie and Dylan Kussman, an actor-writer who played small roles in \"The Mummy\" and \"Jack Reacher,\" were close allies of Cruise's. The script envisioned Nick Morton as an earnest Tom Cruise archetype, who is laughably described as a “young man” at one point.\r\n\r\nHis writers beefed up his part. In the original script, Morton and the Mummy (played by Sofia Boutella) had nearly equal screen time. The writers also added a twist that saw Cruise’s character become possessed, to give him more of a dramatic arc. Even though Universal executives weren’t thrilled about the story — which feels disjointed and includes Russell Crowe as Dr. Jekyll — they went along with Cruise's vision.\r\n\r\nAnd the crew fell in line too, behind Cruise as the boss. “This is very much a film of two halves: before Tom and after Tom,” said Frank Walsh, the supervising art director, at a London screening of “The Mummy” this week. “I have heard the stories about how he drives everything and pushes and pushes, but it was amazing to work with him. The guy is a great filmmaker and knows his craft. He will walk onto a set and tell the director what to do, say ‘that’s not the right lens,’ ask about the sets, and as long as you don’t fluff what you’re saying to him … he’s easy to work for.”\r\n\r\nOnce the film was done, Cruise brought in his longtime editor Andrew Mondshein to piece together the final picture. (The film’s credits also list Gina and Paul Hirsch as editors.) He spent time in the editing suite overseeing the cutting, which everybody agreed wasn’t working. On the lot, there were differences of opinions about whether Cruise’s directions were improving a picture that had been troubled from its inception or whether they were turning a horror film into a Cruise infomercial. Some believed that Cruise had no choice but to assert himself. Given Kurtzman's inexperience directing tentpoles, Cruise, who has carried heavily choreographed action movies all his life, had to try to rally the troops or risk having the production fall behind schedule.\r\n\r\nUniversal knew that if it wanted “The Mummy” to compete against the likes of “Wonder Woman” and “Guardians of the Galaxy Vol. 2” it needed every ounce of Cruise’s waning star power. As the studio scrambled to deal with weak tracking, it released a portrait in late May of Cruise with other actors from the Dark Universe franchise, including Depp and Javier Bardem (who will play Frankenstein). Yet the studio couldn’t even assemble all the actors in the room at the same time, and the image had to be Photoshopped. The Internet reaction to the last-ditch marketing effort was tepid at best. It was another reminder that the big names that once ruled Hollywood are inspiring a lot less love from audiences.\r\n\r\nThe reviews may have been brutal, but at the premiere Cruise seemed pleased, complimenting everyone involved and portraying the finished film as a team effort. “Jake! Jake!” he shouted at one of his co-stars Jake Johnson. “It was awesome working with you, Jake!”\r\n\r\nJustin Kroll and Stewart Clarke contributed to this story.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1497481744.0, "source": "https://variety.com", "summary": ""}