{"url": "https://en.wikipedia.org/wiki/The_Voice_(U.S._season_14)", "text": "The fourteenth season of the American reality The Voice premiered on February 26, 2018, on NBC with Blake Shelton and Adam Levine returning as coaches once again, making it their fourteenth season on the show. Returning coach Alicia Keys returned to the panel for her third season and New coach Kelly Clarkson joined the coaching panel.[1]\n\nOn May 22, 2018, Brynn Cartelli was crowned the winner of The Voice. With her win, the fifteen-year-old became the youngest winner in the show's history.[2] Sawyer Fredericks and Danielle Bradbery at sixteen were the youngest previously.[3] With her victory, Kelly Clarkson became the first new coach to win on her first season, and overall, the third female winning coach, behind Alicia Keys and Christina Aguilera. Additionally, runner-up Britton Buchanan became the highest-placing artist who advanced via an Instant Save, following Joshua Davis of season eight and Chris Jamison of season seven, who both placed third.[2]\n\nCoaches and hosts [ edit ]\n\nThe coaching lineup changed once again for the fourteenth season. Adam Levine and Blake Shelton returned as coaches, making them the only members of the coaching panel to be part of all fourteen seasons. Miley Cyrus and Jennifer Hudson were replaced by new coaches Kelly Clarkson, who was Team Blake's battle advisor in the second season and key advisor for the Knockout Rounds in the thirteenth season, and Alicia Keys who returned to the panel, Carson Daly returned for his fourteenth season as host.[4]\n\nThis season a new feature, the Block, was added during the Blind Auditions. This allows the coaches to block one coach from getting an artist the coach turned around for.[5]\n\nAlso, Season 14 introduced a Save button that allowed a coach to save an artist they just eliminated during the Knockouts Round. However, if another coach also pressed his or her Steal button, the contestant could then decide whether they wanted to go to a new team or stay with their coach.[1]\n\nThis season's advisors for the Battle Rounds were Julia Michaels for Team Adam, Shawn Mendes for Team Alicia, Hailee Steinfeld for Team Kelly, and Trace Adkins for Team Blake.[6]\n\nNote: At 19, Shawn Mendes become the youngest advisor in American version of The Voice history.\n\nThe coaches perform a medley set in vintage Las Vegas in the promo. Adam Levine and Blake Shelton duet on \"Fly Me to the Moon\", Kelly Clarkson and Alicia Keys perform an amazing version of \"Feeling Good\".[7]\n\nTeams [ edit ]\n\nColor key\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth place\n\nFourth place Eliminated in Live Shows\n\nEliminated in Live Shows Eliminated in the Live Playoffs Stolen in the Knockout rounds\n\nStolen in the Knockout rounds Eliminated in The Knockouts\n\nEliminated in The Knockouts Stolen in the Battle rounds\n\nStolen in the Battle rounds Eliminated in the Battle rounds\n\nEliminated in the Battle rounds Withdrew\n\nCoaches Top 48 artists Adam Levine Rayshun LaMarr Jackie Verna Sharane Calister Mia Boostrom Drew Cole Reid Umstattd Gary Edwards Jackie Foster Jordyn Simone Miya Bass Tish Haynes Keys Angel Bonilla Stephanie Skipper Genesis Diaz Davison Alicia Keys Britton Buchanan Jackie Foster Christiana Danielle Johnny Bliss Terrence Cunningham Kelsea Johnson Sharane Calister Dallas Caroline Miya Bass Jaclyn Lovey Jordyn Simone Livia Faith Megan Lee Shana Halligan Jamai Kelly Clarkson Brynn Cartelli Kaleb Lee D.R. King Alexa Cappelli Tish Haynes Keys Dylan Hartigan Jorge Eduardo Jamella Justin Kilgore Jackie Foster Dylan Hartigan Molly Stevens Teana Boston Amber Sauer Hannah Goebel Blake Shelton Kyla Jade Spensha Baker Pryor Baird Gary Edwards Austin Giorgio WILKES Dylan Hartigan Jaron Strom Jaclyn Lovey Dallas Caroline Kaleb Lee Jordan Kirkdorffer Brett Hunter Bransen Ireland JessLee Note: Italicized names are stolen artists (names struck through within former teams). Underlined names are artists who were saved by their coach in the Knockouts and advanced to the Live Playoffs.\n\nBlind auditions [ edit ]\n\nA new feature within the Blind Auditions this season is the Block, which each coach can use once to prevent one of the other coaches from getting a contestant.[1]\n\nColor key\n\n✔ Coach pressed \"I WANT YOU\" button Artist defaulted to a coach's team Artist elected a coach's team Artist eliminated with no coach pressing their button ✘ Coach pressed the \"I WANT YOU\" button, but was blocked by Adam from getting the artist ✘ Coach pressed the \"I WANT YOU\" button, but was blocked by Alicia from getting the artist ✘ Coach pressed the \"I WANT YOU\" button, but was blocked by Kelly from getting the artist ✘ Coach pressed the \"I WANT YOU\" button, but was blocked by Blake from getting the artist\n\nEpisode 1 (Feb. 26) [ edit ]\n\nEpisode 2 (Feb. 27) [ edit ]\n\nEpisode 3 (March 5) [ edit ]\n\nEpisode 4 (March 6) [ edit ]\n\nEpisode 5 (March 12) [ edit ]\n\nEpisode 6 (March 13) [ edit ]\n\nThe Battles [ edit ]\n\nThe Battle Rounds started on March 19.[8] Season fourteen's advisors include: Julia Michaels for Team Adam, Shawn Mendes for Team Alicia, Hailee Steinfeld for Team Kelly, and Trace Adkins for Team Blake.[6] The coaches can steal two losing artists from other coaches. Contestants who win their battle or are stolen by another coach will advance to the Knockout rounds.\n\nColor key:\n\nArtist won the Battle and advanced to the Knockouts Artist lost the Battle but was stolen by another coach and advanced to the Knockouts Artist lost the Battle and was eliminated Artist voluntarily left the competition\n\nThe Knockouts [ edit ]\n\nThe Knockouts round started on April 2. The coaches can each steal one losing artist from another team and save one artist who lost their Knockout on their own team. The top 24 contestants then moved on to the Live Playoffs.\n\nFor the first time ever in The Voice history, past winners of the show returned as Key Advisors — Jordan Smith for Team Adam, Chris Blue for Team Alicia, Cassadee Pope for Team Kelly, and Chloe Kohanski for Team Blake.[9]\n\nColor key:\n\nArtist won the Knockout and advanced to the Live Playoffs Artist lost the Knockout but was stolen by another coach and advanced to the Live Playoffs Artist lost the Knockout but was saved by their coach and advanced to the Live Playoffs Artist lost the Knockout and was Eliminated\n\nLive Shows [ edit ]\n\nColor key:\n\nArtist was saved by the Public's votes Artist was placed in the bottom two, bottom three, or middle three or was saved by the coach Artist was saved by the Instant Save Artist's iTunes vote multiplied by 5 (except The Finals) after his/her studio version of the song reached iTunes top 10 Artist was eliminated\n\nWeek 1: Live Playoffs (April 16, 17, and 18) [ edit ]\n\nFor the first time, the Live Playoffs were split into two rounds and introduced immunity to the highest vote-getters to advance to the Top 12 in Round 1.\n\nRound 1 [ edit ]\n\nDuring the first round of the Live Playoffs, all of the Top 24 performed for the votes of the public. The artist with the highest number of votes on each team directly advanced to the Top 12, receiving immunity from the Round 2 eliminations, and left the remaining five artists from each team to perform again in Round 2.\n\nColor key:\n\nArtist received the highest number of votes on his/her team and directly advanced to the Top 12 Artist was not chosen by the public and was left to perform again in Round 2\n\nRound 2 [ edit ]\n\nOn Nights 2 and 3, the twenty remaining artists performed a second time for the votes of the public (this vote was separate from the Round 1 vote). The highest vote-getter and a coach's choice from each team joined the other four artists from Round 1 in the Top 12.\n\nColor key:\n\nArtist received the Public's vote and advanced to the Top 12 Artist was selected by their coach to advance to the Top 12 Artist was eliminated\n\nWeek 2: Top 12 (April 23 & 24) [ edit ]\n\nThis week's theme was “Story Behind The Song”. The two artists with the fewest votes competed for an Instant Save, with one or two leaving the competition each week until the semifinals. No artists single reached the Top 10 iTunes, hence, no one received the iTunes vote multiplier.\n\nWeek 3: Top 11 (April 30 & May 1) [ edit ]\n\nThe theme for this week was \"Fan Night\", meaning that the artists performed songs chosen by the fans.\n\niTunes bonuses were awarded to Pryor Baird (#4) and Britton Buchanan (#6).[10]\n\nWeek 4: Top 10 (May 7 & 8) [ edit ]\n\nThe theme for this week was “Overcoming Struggles”. Different from previous weeks, the bottom three vote-getters competed in the Instant Save, with two artists being eliminated.\n\niTunes bonuses were awarded to Kyla Jade (#5), Brynn Cartelli (#8), Britton Buchanan (#9) and Pryor Baird (#10).[11]\n\nWeek 5: Semifinals (May 14 & 15) [ edit ]\n\nThe Top 8 performed on Monday, May 14, 2018, with the results following on Tuesday, May 15, 2018. This week's theme is \"Duet Medley Songs\".[12] In the semifinals, three artists automatically moved on to next week's finale, the two artists with the fewest votes were immediately eliminated and the middle three contended for the remaining spot in next week's finale via the Instant Save. iTunes bonuses were awarded to Kyla Jade (#2), Britton Buchanan (#3), Brynn Cartelli (#4), Kaleb Lee (#5), Pryor Baird (#7) and Spensha Baker (#10).[13] In addition to their individual songs, each artist performed a duet with another artist in the competition, though these duets were not available for purchase on iTunes.\n\nWith the elimination of Rayshun LaMarr, Adam Levine no longer had any artists remaining on his team. This is the first time since the fourth season that he had lost his entire team prior to the finale, and the third time overall, the first time being the third season. In addition, with the advancement of Brynn Cartelli to the finale, Kelly Clarkson became the third new coach to successfully get an artist on their team to the finale on their first attempt as a coach, the second being Alicia Keys, who coached Wé McDonald all the way to the finale of the eleventh season, and the first being Usher, who coached Michelle Chamuel all the way to the finale of the fourth season. This also marked the first time ever that two female coaches were represented in the finale.\n\nWeek 6: Finale (May 21 & 22) [ edit ]\n\nThe Final 4 performed on Monday, May 21, 2018, with the final results following on Tuesday, May 22, 2018. This week, the four finalists performed a solo cover song, a duet with their coach, and an original song. iTunes bonuses were awarded to Britton Buchanan (#1 and #10), Brynn Cartelli (#3 and #6), Spensha Baker (#4) and Kyla Jade (#9).[14] Buchanan's \"Where You Come From\" and Cartelli's \"Walk My Way\" are the only songs that charted #1 on iTunes.\n\nThis is the first time that an artist who won the Instant Save in the semifinals did not finish in the last two spots in the finals, with Britton Buchanan finishing 2nd. With Britton Buchanan and Brynn Cartelli making it to the Top 2, this marked the first time in which the final results came down to two artists who have neither represented Blake Shelton nor Adam Levine. This is also the first time that the final results came down to two artists coached by two female coaches, with Buchanan representing Alicia Keys, and Cartelli representing Kelly Clarkson.\n\nElimination chart [ edit ]\n\nOverall [ edit ]\n\nColor key Artist's info\n\nTeam Adam\n\nTeam Adam Team Alicia Team Kelly\n\nTeam Kelly Team Blake\n\nResults details\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth place Saved by Instant Save (via Twitter)\n\nSaved by Instant Save (via Twitter) Saved by the public\n\nSaved by the public Saved by their coach\n\nSaved by their coach Artist did not receive immunity from the Round 2 eliminations\n\nArtist did not receive immunity from the Round 2 eliminations Immune\n\nImmune Eliminated\n\nLive Show Results per week Artist Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Finale Round 1 Round 2 Brynn Cartelli Safe Immune Safe Safe Safe Safe Winner Britton Buchanan Safe Immune Safe Safe Safe Safe Runner-up Kyla Jade Safe Immune Safe Safe Safe Safe 3rd place Spensha Baker Not Chosen Safe Safe Safe Safe Safe 4th place Pryor Baird Not Chosen Safe Safe Safe Safe Eliminated Eliminated (Week 5) Kaleb Lee Not Chosen Safe Safe Safe Safe Eliminated Jackie Foster Not Chosen Safe Safe Safe Safe Eliminated Rayshun LaMarr Not Chosen Safe Safe Safe Safe Eliminated Christiana Danielle Not Chosen Safe Safe Safe Eliminated Eliminated (Week 4) Jackie Verna Not Chosen Safe Safe Safe Eliminated Sharane Calister Safe Immune Safe Eliminated Eliminated (Week 3) D.R. King Not Chosen Safe Eliminated Eliminated (Week 2) Johnny Bliss Not Chosen Eliminated Eliminated (Week 1) Mia Boostrom Not Chosen Eliminated Alexa Cappelli Not Chosen Eliminated Drew Cole Not Chosen Eliminated Terrence Cunningham Not Chosen Eliminated Gary Edwards Not Chosen Eliminated Austin Giorgio Not Chosen Eliminated Dylan Hartigan Not Chosen Eliminated Kelsea Johnson Not Chosen Eliminated Tish Haynes Keys Not Chosen Eliminated Reid Umstattd Not Chosen Eliminated WILKES Not Chosen Eliminated\n\nTeams [ edit ]\n\nColor key Artist's info\n\nTeam Adam\n\nTeam Adam Team Alicia Team Kelly\n\nTeam Kelly Team Blake\n\nResult details\n\nWinner\n\nWinner Runner-up\n\nRunner-up Third place\n\nThird place Fourth place Artist did not receive immunity for the Round 2 eliminations\n\nArtist did not receive immunity for the Round 2 eliminations Immune\n\nImmune Eliminated\n\nEliminated Saved by Instant Save (via Twitter)\n\nSaved by Instant Save (via Twitter) Artist received one or more iTunes bonus that week\n\nArtist received one or more iTunes bonus that week Number of iTunes bonuses received\n\nArtist Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Finale Round 1 Round 2 Rayshun LaMarr Not Chosen Public's choice Advanced Advanced Advanced Eliminated Jackie Verna Not Chosen Coach's Choice Advanced Advanced Eliminated Sharane Calister Public's Choice Immune Advanced Eliminated Mia Boostrom Not Chosen Eliminated Drew Cole Not Chosen Eliminated Reid Umstattd Not Chosen Eliminated Britton Buchanan Public's Choice Immune Advanced Advanced Advanced Advanced Runner-up Jackie Foster Not Chosen Public's choice Advanced Advanced Advanced Eliminated Christiana Danielle Not Chosen Coach's Choice Advanced Advanced Eliminated Johnny Bliss Not Chosen Eliminated Terrence Cunningham Not Chosen Eliminated Kelsea Johnson Not Chosen Eliminated Brynn Cartelli Public's Choice Immune Advanced Advanced Advanced Advanced Winner Kaleb Lee Not Chosen Public's choice Advanced Advanced Advanced Eliminated D.R. King Not Chosen Coach's Choice Eliminated Alexa Cappelli Not Chosen Eliminated Dylan Hartigan Not Chosen Eliminated Tish Haynes Keys Not Chosen Eliminated Kyla Jade Public's Choice Immune Advanced Advanced Advanced Advanced Third place Spensha Baker Not Chosen Coach's choice Advanced Advanced Advanced Advanced Fourth place Pryor Baird Not Chosen Public's choice Advanced Advanced Advanced Eliminated Gary Edwards Not Chosen Eliminated Austin Giorgio Not Chosen Eliminated WILKES Not Chosen Eliminated\n\nRatings [ edit ]\n\nEpisode Original airdate Production Time slot (ET) Viewers\n\n(in millions) Adults (18–49) Source Rating Share 1 \"The Blind Auditions Premiere, Part 1\" February 26, 2018 ( ) 1401 Monday 8:00 p.m. 12.31 2.8 10 [15] 2 \"The Blind Auditions Premiere, Part 2\" February 27, 2018 ( ) 1402 Tuesday 8:00 p.m. 10.84 2.4 9 [16] 3 \"The Blind Auditions, Part 3\" March 5, 2018 ( ) 1403 Monday 8:00 p.m. 11.62 2.5 9 [17] 4 \"The Blind Auditions, Part 4\" March 6, 2018 ( ) 1404 Tuesday 8:00 p.m. 10.09 2.1 8 [18] 5 \"The Blind Auditions, Part 5\" March 12, 2018 ( ) 1405 Monday 8:00 p.m. 11.87 2.4 9 [19] 6 \"The Blind Auditions, Part 6\" March 13, 2018 ( ) 1406 Tuesday 8:00 p.m. 11.17 2.3 9 [20] 7 \"The Battles Premiere, Part 1\" March 19, 2018 ( ) 1407 Monday 8:00 p.m. 11.83 2.4 9 [21] 8 \"The Battles Premiere, Part 2\" March 20, 2018 ( ) 1408 Tuesday 8:00 p.m. 10.96 2.2 9 [22] 9 \"The Battles, Part 3\" March 26, 2018 ( ) 1409 Monday 8:00 p.m. 10.37 2.0 8 [23] 10 \"The Battles, Part 4\" March 27, 2018 ( ) 1410 Tuesday 8:00 p.m. 9.02 1.7 7 [24] 11 \"Best of Blinds & Battles\" March 28, 2018 ( ) 1411 Wednesday 8:00 p.m. 6.95 1.3 5 [25] 12 \"The Knockouts Premiere, Part 1\" April 2, 2018 ( ) 1412 Monday 8:00 p.m. 10.03 1.9 7 [26] 13 \"The Knockouts Premiere, Part 2\" April 3, 2018 ( ) 1413 Tuesday 8:00 p.m. 9.43 1.8 7 [27] 14 \"The Knockouts, Part 3\" April 9, 2018 ( ) 1414 Monday 8:00 p.m. 9.86 1.9 7 [28] 15 “The Road To The Lives\" April 10, 2018 ( ) 1415 Tuesday 8:00 p.m. 7.82 1.3 5 [29] 16 “The Live Playoffs, Night 1\" April 16, 2018 ( ) 1416 Monday 8:00 p.m. 9.35 1.8 7 [30] 17 “The Live Playoffs, Night 2\" April 17, 2018 ( ) 1417 Tuesday 8:00 p.m. 8.35 1.5 6 [31] 18 “The Live Playoffs, Night 3\" April 18, 2018 ( ) 1418 Wednesday 8:00 p.m. 8.38 1.5 6 [32] 19 “Live Top 12 Performance\" April 23, 2018 ( ) 1419 Monday 8:00 p.m. 8.43 1.5 6 [33] 20 “Live Top 12 Results\" April 24, 2018 ( ) 1420 Tuesday 8:00 p.m. 9.26 1.6 6 [34] 21 “Live Top 11 Performance\" April 30, 2018 ( ) 1421 Monday 8:00 p.m. 8.82 1.7 6 [35] 22 “Live Top 11 Results\" May 1, 2018 ( ) 1422 Tuesday 8:00 p.m. 7.64 1.2 5 [36] 23 “Live Top 10 Performance\" May 7, 2018 ( ) 1423 Monday 8:00 p.m. 8.38 1.5 6 [37] 24 “Live Top 10 Results\" May 8, 2018 ( ) 1424 Tuesday 8:00 p.m. 7.26 1.3 5 [38] 25 “Live Top 8 Semifinals Performance\" May 14, 2018 ( ) 1425 Monday 8:00 p.m. 8.71 1.6 6 [39] 26 “Live Top 8 Semifinals Results\" May 15, 2018 ( ) 1426 Tuesday 8:00 p.m. 8.15 1.4 6 [40] 27 “Live Finale Performance\" May 21, 2018 ( ) 1427 Monday 8:00 p.m. 8.67 1.5 6 [41] 28 “Live Finale Results\" May 22, 2018 ( ) 1428 Tuesday 9:00 p.m. 8.77 1.5 6 [42]\n\nArtists who appeared on other shows or seasons [ edit ]\n\nGenesis Diaz and Johnny Bliss later appeared in the first season of the American-Spanish version of this show. Bliss also appeared on Univision's Va Por Ti.\n\nThe Winos (Kathie Lee and Hoda) are hosts of the fourth-hour TODAY show.\n\nJorge Eduardo appeared on the 5th season of La Voz...México and placed fourth place.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Check_mark.svg/18px-Check_mark.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Adam_Levine_performing_live_onstage_in_2014.jpg/163px-Adam_Levine_performing_live_onstage_in_2014.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Kelly_Clarkson_2018_DoD_Warrior_Games_Opening_Ceremony_12.jpg/144px-Kelly_Clarkson_2018_DoD_Warrior_Games_Opening_Ceremony_12.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Blake_Shelton_July_2017_%28cropped%29.jpg/174px-Blake_Shelton_July_2017_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Alicia_Keys%2C_Lisboa_08_c.jpg/145px-Alicia_Keys%2C_Lisboa_08_c.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Voice_(American_season_14)", "title": "The Voice (American season 14)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}