{"url": "www.dailymail.co.uk/news/article-4978890/Prince-Harry-Meghan-Markle-house-hunting-Cotswolds.html", "text": "Advertisement\n\nForget Wills and Kate's dusty old Norfolk. The lovebirds want to hang out with the groovy set in the Cotswolds - and the local estate agents' eyes are lighting up.\n\nThere comes a time in every couple's relationship when the question of moving in together becomes impossible to ignore.\n\nAnd when those two lovebirds have been stepping out for 15 months — even though they live 3,500 miles apart; he in the UK, she in Canada — it's not so much a case of 'if' as of 'when' they will settle down.\n\nSo it comes as no surprise that Prince Harry, 33, and his actress girlfriend Meghan Markle, 36, are said to be house-hunting.\n\n£7.25million - North Aston Manor, Oxfordshire: This eight bedroom property, overlooking the stunning Cherwell Valley, has seven reception rooms, a spa, swimming pool and 18.2 acres with equestrian facilities. It's nine miles from Soho Farmhouse and swanky shopping centre Bicester Village, should Meghan fancy snapping up some designer bargains\n\nPrince Harry and actress girlfriend Meghan Markle were pictured together at the Invictus Games in Toronto last month\n\nRoyal sources have exclusively told the Daily Mail that the royal couple are looking in Oxfordshire and are particularly interested in high-end properties tucked away in the rolling Cotswold hills.\n\nA good friend of Harry's says the Prince, whose father's residence, Highgrove House, is in the south Cotswolds, has a long-standing affection for the area, while Meghan is said to be entranced by its rustic charm.\n\n'He is searching for a new home in the area,' the friend reveals.\n\n'Before Meghan, he was vaguely looking in Norfolk, but didn't find what he wanted. Now, with her input, he's renewed his search.'\n\n£2million - The Old Rectory, Lower Brailes, Oxfordshire: A stunning wood-panelled property dating from the 14th century, this boasts eight bedrooms, a sun-drenched terrace and its own private lake, complete with duck house. There’s a three-bedroom coach house for guests and it’s set at the end of a no-through road.\n\nCertainly, the lush green countryside encompassing swathes of Warwickshire, Oxfordshire and Gloucestershire is a huge draw for London-dwellers eager to snap up rural boltholes.\n\nJust an hour or so from the capital, it's home (or at least a weekend retreat) to A-listers, politicians and media executives: the Camerons, Beckhams, Kate Moss, Lily Allen and Stella McCartney all have million-pound properties in the area.\n\n'It's like a magnet,' says Sophie Gannon, of Savills Estate Agents in Banbury, Oxfordshire. 'If you get one person, you get them all.'\n\nHowever, Harry isn't following the crowd but listening to his heart. The Cotswolds, and specifically Highgrove, which was bought by his father's private estate in 1980, is where the Prince spent much of his childhood.\n\nIt was Charles and Diana's weekend home, with 15-acre grounds and, later on, a teenage haven in the cellars of the main house, which Harry nicknamed 'Club H'.\n\n£2.95million - Fanthill, Banbury, Oxfordshire: Accessed through electric gates, up a winding driveway, this eight-bedroom house sits among 20 acres of land, so ticks all Harry’s boxes when it comes to privacy. There’s a heated outdoor pool, miniature golf course and a carp lake, where the young lovebirds could row off the private pier\n\nA local who knows the family says: 'It's not surprising that Harry would like to live where he feels at home.\n\n'He's lived in the Cotswolds all his life and often returns to visit his father. After his mother died, it became a place of sanctuary.\n\n'When the boys entered their teens, Charles bought several homes in the area, thinking they might want one in the future.'\n\nTen years ago, Charles bought up properties adjacent to his sprawling estate, paying £2 million apiece for nearby manor houses and farm buildings.\n\nBut sources say rather than living off his father's generosity, Harry wants to invest in a place of his own.\n\n£4.25million - Cross Hill House, Adderbury, Oxfordshire: This 10-bedroom house, surrounded by landscaped gardens, is eight miles from Soho Farmhouse. There are ample stables in the grounds as well as a reassuringly private Victorian walled garden. The centrepiece of the house is a huge open-plan sitting and dining room\n\nHe has friends and relatives dotted across the Cotswolds, an area estate agents dub the 'Royal Triangle'.\n\nCousin Zara, her rugby-player husband Mike Tindall and their daughter Mia, three, live six miles from Highgrove in a cottage at Gatcombe Park, Princess Anne's country estate.\n\nThe Beckham brood, of whom the Prince is very fond, have been renovating a £5 million plot on the 4,000-acre Great Tew Estate in Chipping Norton since 2015.\n\nPalace insiders say it's this tight-knit circle of friends that has prompted the couple to focus their search on the Cotswolds rather than Norfolk, where William and Kate rule the roost at Anmer Hall, a grand Georgian pile boasting a swimming pool and tennis court.\n\n'They don't want to be second-runners to Kate and William,' one source says.\n\nLocals have spotted the Prince — without his girlfriend — discreetly checking out several Cotswolds hotspots in recent months.\n\nThe blacked-out Range Rovers driven by royal protection officers have been spotted navigating the country lanes around Cirencester and Stow-on-the-Wold, while Harry has apparently been sipping pints of bitter in low-key village pubs.\n\n£7.75million - Luckington Court, Chippenham, Wiltshire: This 11th-century house with original Tudor features is set in 157 acres of woodland and pasture, surrounded by a secure fence. There are eight bedrooms, four reception rooms, two kitchens, a music room, study and plenty of space for staff — a must for any royal retreat\n\n'I'm not surprised he's moving here — he's in the local quite often,' says one resident. 'You'd see his security men sitting outside and you'd know he'd be in there.'\n\nOf course, there are practical reasons for moving to the Cotswolds. Harry's royal duties require him to be close to London and Toronto-based Meghan, whose time on the U.S. TV series Suits is coming to an end, wouldn't cope well with being cut off from the metropolis.\n\n'Harry is conscious that Norfolk would be too far out for someone with media leanings and an urban upbringing like Meghan,' a source close to the couple explains.\n\nThe couple have tested the water with two mini-breaks, in February and July, at Soho Farmhouse, the private members' club-cum-hotel in Great Tew, which has become a haven for stars who want to go under the radar.\n\nRegulars include George and Amal Clooney, while Harry's cousins Beatrice and Eugenie were recently spotted sipping mojitos by the pool.\n\nLuxury cabins at the farmhouse — owned by the West London club Soho House, whose consultant Markus Anderson introduced Harry and Meghan last July — cost up to £725 a night, but members say it's more likely the pair took the main farmhouse for £6,000 a night.\n\nMeghan is said to adore the £110 brightening facials and £120 evening primrose body wraps at the on-site Cowshed spa.\n\n£3.95million - Amberley Court, Stroud, Gloucestershire: This 17th century manor boasts eight bedrooms, six receptions, a tennis court, infinity pool, stables and a two-bedroom guest lodge. It also has 22-cares of grounds. It's eight miles from Highgrove and two miles from Gatcombe Park, and within striking distance of Beaufort Polo Club, where Harry attends charity days\n\nProximity to the Farmhouse, as well as Daylesford Organic, a chi-chi farm shop and bakery 15 miles away, are said to be top of Meghan's requirements for a new home.\n\nSecond on her list is plenty of outside space for her two rescue dogs, Bogart and Guy.\n\nHarry is also said to be looking for somewhere spacious, but not big or showy, so he can keep horses and turn the land into a polo field.\n\n'That's always been his dream,' a royal source explains.\n\nOther must-haves are a decent kitchen — Harry is a keen chef — a helipad and a space to host parties out of reach of neighbours, passing traffic and long lenses.\n\nThe royal budget should be more than enough to secure a place that meets these requirements. Harry has a fortune in excess of £30 million. Meghan is worth around £4 million from film and TV work.\n\nBut more pressing than price is how they go about finding their dream home. Royals don't peer in estate agents' windows; well-connected chums will have been asked to do research for them.\n\n'Harry is being discreet,' a friend says. 'This is a word-of-mouth search, with Harry's friends pulling out all the stops.'\n\n£3.95million - Amberley Court, Stroud, Gloucestershire: This 17th century manor boasts eight bedrooms, six receptions, a tennis court, infinity pool (pictured), stables and a two-bedroom guest lodge. It also has 22-cares of grounds. It's eight miles from Highgrove and two miles from Gatcombe Park, and within striking distance of Beaufort Polo Club, where Harry attends charity days\n\nPalace sources say VanHan, a property company founded by royal confidants Thomas van Straubenzee and Rory Penn, has been given the nod to lead the hunt.\n\nThe Mayfair firm markets some of the capital's finest properties — recently including the £39 million Bulgari Hotel penthouse — to wealthy clients.\n\nVanHan also has access to a small roster of exclusive country piles. Viewings are strictly private and the properties are labelled 'off market' to deter prying eyes.\n\nSources say Harry's inner circle — Tom Inskip, whose Jamaican wedding he and Meghan attended in March; Eton pal Jake Warren; filmmaker Arthur Landon and Viscount Julian Erleigh — will be alerting contacts behind the scenes, while cousin Zara, is on hand for local advice.\n\nOf course, there is still the tricky question of timing. Traditionally, royal couples haven't lived together until after marriage, but Kate and William set a precedent in Anglesey, spending time in their North Wales home before their wedding in 2011.\n\nInsiders say protocol dictates Harry and Meghan should at least be engaged before moving in.\n\nSo is the house-hunt a sign that a proposal is on the cards? This week, U.S. magazines claimed the couple are already engaged, after Harry popped the question in Botswana in August.\n\nSources close to the couple say this may not be far from the truth, with the pair starting seriously discussing marriage — a step some are calling an 'unofficial' engagement.\n\nBut the timing of an announcement would be tricky, with so many royal anniversaries taking place, not least the Queen and Philip's 70th wedding anniversary in November.\n\nHowever long they have to wait, locals are thrilled by the prospect of their new neighbours.\n\n'The last thing we want is the world and his wife trying to get into Soho Farmhouse,' one Chipping Norton resident confides. 'You get a bit fed up of the actresses swanning around. But a prince — now, that's a real celebrity.'", "images": ["https://i.dailymail.co.uk/i/pix/2017/10/13/21/454176DD00000578-4978890-image-a-16_1507924810266.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/1s/2020/04/17/20/27331384-0-image-a-22_1587150056520.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454176BC00000578-4978890-image-a-12_1507924620760.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/10/27348844-0-image-a-6_1587203459353.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/18/27283520-0-image-a-13_1587059349556.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454176F800000578-4978890-image-a-10_1507924487373.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/10/13/21/454B921700000578-4978890-image-a-23_1507925052824.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316454-0-image-a-18_1587125714890.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/19/27330756-0-image-a-6_1587148551167.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454DB85800000578-0-image-a-2_1507924078460.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/1s/2020/04/18/09/27348120-0-image-a-6_1587200255933.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2017/10/13/21/454176AC00000578-4978890-image-a-18_1507924850805.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/18/454CEDDD00000578-0-image-a-10_1507916846456.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27313170-0-image-m-25_1587119028862.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/21/454176EC00000578-4978890-image-a-20_1507924908423.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454C13FD00000578-4978890-image-a-15_1507924653889.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/14/01/45433AC700000578-4978890-image-m-70_1507942346734.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454D7A1400000578-0-image-m-46_1507922969931.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454DB85800000578-0-image-a-2_1507924078460.jpg", "keywords": [], "authors": ["Ross Slater", "Sarah Rainey For The Daily Mail"], "canonical_link": "https://www.dailymail.co.uk/news/article-4978890/Prince-Harry-Meghan-Markle-house-hunting-Cotswolds.html", "title": "Prince Harry and Meghan Markle house-hunting in Cotswolds", "meta_data": {"keywords": "dailymail,news,Meghan Markle,Prince Harry", "news_keywords": "dailymail,news,Meghan Markle,Prince Harry", "original-source": "https://www.dailymail.co.uk/news/article-4978890/Prince-Harry-Meghan-Markle-house-hunting-Cotswolds.html", "description": "Forget Wills and Kate's dusty old Norfolk. Harry and Megan (pictured) want to hang out with the groovy set in the Cotswolds - and the local estate agents' eyes are lighting up.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Harry and Megan are looking to the Cotswolds for their dream home", "description": "Forget Wills and Kate's dusty old Norfolk. Harry and Megan (pictured) want to hang out with the groovy set in the Cotswolds - and the local estate agents' eyes are lighting up.", "url": "https://www.dailymail.co.uk/news/article-4978890/Prince-Harry-Meghan-Markle-house-hunting-Cotswolds.html", "image": "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454DB85800000578-0-image-a-2_1507924078460.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4978890, "author": "Ross Slater", "divclasspage": "articlePage", "mol": {"headline": "How Harry and Meghan want to join the Chipping Norton set: Gorgeous Cotswolds homes that could be the house-hunting couple's new palace"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-10-13T22:02:19+0100", "modified_time": "2017-10-14T01:53:37+0100", "section": "News", "tag": "Prince Harry Meghan Markle house hunting Cotswolds", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Harry and Megan are looking to the Cotswolds for their dream home", "type": "article", "description": "Forget Wills and Kate's dusty old Norfolk. Harry and Megan (pictured) want to hang out with the groovy set in the Cotswolds - and the local estate agents' eyes are lighting up.", "url": "http://www.dailymail.co.uk/~/article-4978890/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/10/13/20/454DB85800000578-0-image-a-2_1507924078460.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/09/28/724776021901919663/1024x576_MP4_724776021901919663.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4978890/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4978890/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1507928539.0, "source": "http://www.dailymail.co.uk", "summary": ""}