{"url": "www.twoeggz.com/int/5453707.html", "text": "Jim Carrey says the Illuminati is pushing Satanism through the entertainment industry\n\nThe Trueman Show star claims that a push is being made by \"dark forces that control the world\" to promote Satanism in the mainstream and turn people away from traditional values.\n\nDuring an aftershow event at the Chinese Theatre on Hollywood Boulevard, where his new documentary, \"Jim & Andy: The Great Beyond\" was being screened at the AFI Fest, Carrey was answering questions from a group of fans on his preparation for his acting roles.\n\nJim & Andy chronicles the time when Jim Carrey was filming his 1999 movie biography Andy Kaufman in Man on the Moon, for which he won multiple awards, including the Golden Globe Award for Best Actor.\n\nCarrey is known for his method acting, in which he lives his life on and off the set as his character.\n\nJim & Andy explores his methods and details how he \"nearly lost it\" after becoming so deeply involved in his character.\n\nCarrey joked with fans about how he drove his friends and family \"crazy\" whilst he was filming The Grinch, with one of them asking if that meant he \"wasn't looking forward to Christmas,\" to which he replied:\n\n\"No, I love Christmas. \"I fully embrace the festivities as I know that we, as a civilization, don't have many of them left.\"\n\nFollowing a smattering of nervous laughter from the group, Carrey was prompted to elaborate:\n\n\"Those dark forces who control everything - the Illuminati - the Illumi-nutty - they are working hard to eradicate tradition values. \"Satanism is being pushed through movies, TV, and pop music to brainwash young minds into following Satan. \"You must of all seen that, right? \"It's everywhere and has been for years. \"They are not trying to manifest themselves into the zeitgeist: Satan is already fully embedded in the public psyche. \"It's only now that the trigger is being engaged and the final stages of the agenda are being fulfilled. \"You keep seeing these celebrities opening up about their devotion to Lucifer, and that's not a slip of the tongue: They are preparing for the final push. \"Once Satan is the dominant force on Earth, there will be no more Christmas. \"I don't know what they will replace it with. \"Probably one of their rituals where they sacrifice children and drink their blood. \"Trust me, once you see what these guys in Hollywood really get up to, you'll think Weinstein was a boy scout.\"\n\nAt this point, the atmosphere changes as the group seem confused as they nervously smile at each other, to which Carrey steers the conversation back.\n\n\"Anyway, at least we still have this Christmas to look forward to,\" he said before raising a glass of soda water to toast saying:\n\n\"To Satan... I mean Santa!\"\n\nJim Carrey's concerns about a push towards a Devil-worshipping future may not actually be so far-fetched.\n\nFor generations, Illuminati symbolism has been subliminally pushed though pop culture, but more recently there has been a dramatic rise of Satanic symbols in music.\n\nCelebrities, from Nicki Minaj to Lil Wayne to Rihanna, are accused of filling the airwaves with Illuminati imagery.\n\nIn music videos, promotional materials, video games, and paparazzi photos, the most famous guys and girls in pop culture are caught repping the All-Seeing Eye.\n\nThis eye, a singular eyeball in a pyramid-esque shape, is associated with this occult group of Satanists who have sold their souls for success.\n\nTurn on the MTV VMAs for Illuminati symbolism, courtesy of Lady Gaga and Miley Cyrus.\n\nScroll through old album covers and find one-eyed Jordin Sparks and Celine Dion confirming their membership in the occult organization.\n\nTurn the pages of Parlour magazine and Esquire to see Katy Perry and Nicki Minaj use triangular mannerisms to cover one eye.\n\nThe Eye of Horus isn't even disguised as the CBS logo, nor is it disguised in scenes from the hit video game \"Grand Theft Auto V.\"\n\nLook close enough, and Illuminati Eyes sightings are all over pop culture.\n\nIlluminati symbols in pop culture aren't uncommon, but now they are becoming more frequent and less subtle.\n\nJay-Z wears a Satanic slogan across his sweatshirt: 'Do What Thou Wilt'\n\n© press\n\nRecently music stars have become far more open about their devotion to the occult and their love for their \"Lord Satan.\"\n\nJust last month, Hip Hop star Jay-Z has blasted traditional Christian values in an epic rant where he claims to be part of an exclusive club of \"smart people\" who worships \"our true lord; Satan.\"\n\nThe billionaire rapper has also claimed that \"God created Lucifer to be the bearer of truth and light,\" and that \"Jesus never existed\" but was merely a \"tool created by smart people to control dumb people.\"\n\nMore recently, pop star Miley Cyrus left her followers shocked and confused after advising her young fans to \"worship Satan\" if they want to become \"rich & famous\" like their heroes.\n\nIf what Carrey is saying is correct, then maybe these revelations aren't accidental slip-ups at all but are meant to be an intentional push at taking their Satanic teachings into the mainstream.\n\nFox has invested millions into pro-Satanic programming like TV show 'Lucifer'\n\n© press\n\nTV network Fox has also being accused of trying to \"take the Devil mainstream\" after investing millions into pro-Satanic programming.\n\nOne of Fox's most popular shows, Lucifer, depicts a cool, good-looking incarnation of the devil who drives a Corvette and owns a nightclub.\n\nThe series makes the idea of Satan seem exciting, and clearly being aimed at teenagers and young adults, it certainly fits in with Carrey's brainwashing comments.\n\nFox has also heavily promoted a show that's a modern reinvention of William Peter Blatty’s bestselling 1971 book, The Exorcist.\n\nThe project is described as \"a propulsive, serialized psychological thriller following two very different men tackling one family’s case of horrifying demonic possession, and confronting the face of true evil.\"\n\nRupert Murdoch’s media conglomerate News Corp., that owns Fox, also owns a company called Avon that publishes and promotes Anton Lavey’s book The Satanic Bible.\n\nIf the Illuminati is trying to push Satanism onto the public, then the signs are all there.\n\nAnd, if there are trying to influence the beliefs of future generations, then pushing Satanic values through popular culture would certainly be the most effective way to brainwash young minds.\n\nPeople often assume that Jim Carrey is either joking or crazy when he makes statements that most people are unable to decipher, yet in this case, and many others, it seems as though he's making more sense than ever.", "images": ["https://p0.ipstatp.com/large/005a2713ee1000927ee0", "https://p9.pstatp.com/list/300x196/pgc-image/a12e057a8390482fa1a4e9628013356d.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/a2c8e5cca0644e94864dda78bb979b6f.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/01d07b78936845fd89043cf6603c8963.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/a0e0399d069e4991b70c6bca53747c48.jpg", "https://p0.ipstatp.com/large/005a0acfe6d840a470c8", "https://p9.pstatp.com/list/300x196/pgc-image/2316d3a0054f433e8c0a75d08e4e9507.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/RrKvXR31dhM9Su.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/ac8512a691a84062a037a4e1cdd8c9bd.jpg", "https://p9.pstatp.com/list/300x196/dfic-imagehandler/2e475a24-d4c5-4a82-b17d-3fec0f09cae0.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/c07fcfd9e0b44ceabf84f63b814708b0.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/961976016bb54a96b18c4bdf134827c1.jpg", "https://p9.pstatp.com/list/300x196/dfic-imagehandler/bb58d68a-4258-42ce-aac2-b210e692d332.jpg", "https://p9.pstatp.com/list/300x196/dfic-imagehandler/c4f940ff-0284-40d3-b23f-e01119e67bc9.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/00072b7c6164405a85d992cf55041880.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/668ad8a75e934abbb0c6d6b4a0cacfc6.jpg", "http://www.twoeggz.com/res/images/logo.png", "https://p9.pstatp.com/list/300x196/pgc-image/679da2c69ce44a51b0e56639594eb349.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/Re4tv6gH4eEwqt.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/97889fb17676401d8013bf198efa2f61.jpg", "https://p0.ipstatp.com/large/005a2713ede300930582", "http://www.twoeggz.com/pic/int/2017-12-06/2a57187c75bda7c98a7a52de04edb5e8.jpg", "https://p9.pstatp.com/list/300x196/pgc-image/RZg5RDK7eKwxf8.jpg"], "top_img": "http://www.twoeggz.com/pic/int/2017-12-06/2a57187c75bda7c98a7a52de04edb5e8.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Jim Carrey: 'The Illuminati is Brainwashing Children into Worshipping Satan'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=0, minimum-scale=1.0, maximum-scale=1.0", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "og": {"type": "article", "title": "Jim Carrey: 'The Illuminati is Brainwashing Children into Worshipping Satan'", "description": "Hollywood star says entertainment industry is pushing Satanism\n        \n         \n  \nJim Carrey says the Illuminati is pushing Satanism through the entertainmen", "image": "/pic/int/2017-12-06/2a57187c75bda7c98a7a52de04edb5e8.jpg"}, "keywords": "Jim,Carrey:,''The,Illuminati,is,Brainwashing,Children,into,Worshipping,Satan''", "description": "Hollywood star says entertainment industry is pushing Satanism\n        \n         \n  \nJim Carrey says the Illuminati is pushing Satanism through the entertainmen"}, "movies": [], "publish_date": null, "source": "http://www.twoeggz.com", "summary": ""}