{"url": "https://ew.com/tv/2017/12/08/queer-eye-fab-5-netflix-first-look/", "text": "Image zoom Carin Baer/Netflix\n\nQueer Eye for the Straight Guy type TV Show network Bravo genre Reality,\n\nLGBTQ\n\nTo see more from the First Look issue, pick up the latest Entertainment Weekly on stands Friday, or buy it here now. Don’t forget to subscribe for more exclusive interviews and photos, only in EW.\n\nThe series famous for giving makeovers is getting one of its own. Come February on Netflix, Karamo Brown (culture), Jonathan Van Ness (grooming), Tan France (fashion), Antoni Porowski (food and wine), and Bobby Berk (design) will assume the Queer Eye for the Straight Guy Fab 5 mantle once occupied by Jai Rodriguez, Kyan Douglas, Carson Kressley, Ted Allen, and Thom Filicia.\n\nWhen the show — which follows the stars as they give holistic makeovers to straight men — premiered in 2003 on Bravo, it quickly became a cultural phenomenon, even winning the Outstanding Reality Program Emmy the following year. A lot has changed in the years since, though. “It’s a new time with a new audience,” series creator David Collins tells EW. “If the original round was about tolerance, this time it is about acceptance.”\n\nWhich means audiences — but especially each episode’s subject, or “hero” as they’re called — will learn more about the Fab 5’s personal lives as they ditch the concrete jungle of New York City to take on straight guys in red states. “In order to make the emotions bigger, you actually had to see how [the Fab 5] were reacting to being with a cop from the South who was a Trump supporter, [or] ‘hillbilly Tom,’ who refers to himself by saying ‘you can’t fix ugly,’” executive producer Rob Eric explains. “These guys walked away truly loving every single hero that they made over and talked about them for weeks afterward. It affected them just as much as they affected our hero.”\n\nFinding the new Fab 5 was “a blast,” Collins says, but still no easy task. Producers narrowed the field from hundreds to 40 guys after an international search, with some “silly, amazing” auditions earlier this year in L.A. The result is an eclectic mix of personalities. Brown, who appeared on The Real World: Philadelphia, stood out for his charisma and style. Viewers may know Van Ness from his hit web series Gay of Thrones, or Berk from his line of home furnishings. Producers have former Fab 5-er Ted Allen to thank for finding Porowski; he was the Chopped host’s protégé and personal chef. And France, originally from England, is the creator of women’s clothing line Kingdom & State and co-creator of Rachel Parcell Inc, serving as lead designer for both brands until this year.\n\n“Each one of them is so unique,” Collins says proudly. Not to mention, fabulous.\n\nAbove, check out the exclusive first look at the new Fab 5, and below, Collins explains why now was the right time to revive the show, how the move to Netflix has given them more freedom, what he loves about each of the new guys, and whether we might see any of the original Fab 5 on the revival.\n\nENTERTAINMENT WEEKLY: In the couple episodes I got to watch, the thing that really stood is out is how much more of a “connection” there seems to be between the new Fab 5 and the straight guy than I remember from the original series. These stories are so entirely different but so engrossing… and emotional!\n\nDAVID COLLINS: It’s great to hear that. Storytelling, obviously, is ultimately the topline goal. There is a format to the show — it’s all in pieces there – but for sure the episodic hero is our main focus, his story and his interactions with the Fab 5. It’s all about story, always.\n\nWhen I watched the episode featuring Cory, the police officer from Winder, Georgia, I wondered where it would go with him considering he wasn’t in huge need of a physical makeover, but that episode really proves it’s not always about the clothes and mustache and hair.\n\nIt’s interesting that you bring up the makeover part because a lot of times for us, this time is — makeovers are very important and the reveal and all that, but really the bottom line is that inside change, that moment where they’ve had a revelation, they’ve had an understanding; “confidence breeds success” has always been our through line there, and that’s one of those things that I have to say we’re really proud of that’s come through in these individual stories.\n\nThere’s a really powerful moment between Karamo and Cory as they discuss relations between police and black communities. Karamo admitted he was not excited to spend time with Cory because of something that happens at the beginning of the episode. Did you have any idea that’s how he was going to react?\n\n[Laughs] We had no idea how Karamo was going to react, and it really ended up, obviously, driving the entire episode and telling the story. The experience of our Fab 5 with each guy is real-time — five full days with our guy — so that conversation really got to grow organically and authentically over their time together, and that’s been something in the Netflix Queer Eye that we’ve been able to do, which is allow those relationships to really develop and grow over their time together.\n\nOn that topic, what kind of new freedoms do you have being on Netflix versus cable?\n\nA lot. There was the one “gay day” in the original Queer Eye and in this one we realized that the Fab 5 and the time spent with our episodic hero was critical. To allow a real, authentic relationship to grow, you gotta hang out, you gotta have some coffee, you gotta eat some bread. Those are the moments we realized really gave breadth to the story… you see how the conversation grows and especially how the questions change; the episodic hero says, “Huh, well I never thought of it this way, but what about this?” and our Fab 5, because we get to hear their stories now and see them and hear their journey as part of the individual episode, it’s been a really great marriage of those two worlds.\n\nWhy was now the right time to revive the show?\n\nIt’s one of those things that for me is really simple: It’s a really great show, and it’s a new time with a new audience. The millennials don’t remember the old show. It’s got such a great heart and soul and humor to it, so I’m excited for a new audience. But I guess if there was something to be real specific, if the original round was about tolerance, this time it is about acceptance. We ultimately realized that there was a great opportunity for the Fab 5 to grow and be much more open about their personal lives. If you think about the original five, we definitely weren’t going to be talking about that Tan is married to a Mormon cowboy, let alone that he’s Muslim. [Laughs] So it’s those authentic moments that really pay off in this new version of Queer Eye.\n\nWhy now? There’s really an ultimate moment: Why not? These are five guys who come in, they help someone in not just the outward but the inward, and ultimately, we’ve always said confidence breed success, and when they bring that confidence into someone’s world, like Tom — when you see Tom realize that he starts to feel good about himself, you see it, you feel it. And the same with Cory; Cory had such a great experience. It’s been funny, because we had to keep everything under wraps, he is so dying to reconnect with the guys. He keeps texting and sending me Instagram messages because he really wants to stay in touch with them. It’s been that; it’s kinda cool.\n\nWhich one of the Fab 5 did you cast first?\n\nThe casting was a blast. [Laughs] We had a really large nationwide — actually it was global because we had Australia and the U.K. all part of our casting — we had literally hundreds and hundreds of guys that we went through, and we ultimately picked our top 40 and flew them all out to Los Angeles and had a three-and-a-half day extravaganza like you’ve never seen. [Laughs] We brought everyone to the same hotel and we rented out this big banquet hall room and had some silly, amazing casting going on. The team really — it’s probably one of those full circle moments for me — when the first Fab 5 were coming together, the same thing happened; it just starts to happen, the chemistry starts to click, you see that this guy and that guy are an amazing duo, and then you add the third, fourth, and fifth and you realize, wow, this is a team. Each one of them is so unique.\n\nWhat is it you love about each of them?\n\nJonathan, obviously, it would be hard to miss how authentic he is. He’s so proud of being himself and he’s so confident in himself because he really battled that. He was the middle-of-nowhere kid who really grew up getting bullied hard. He fought, he really fought, for being who he is; he has no body shame, he has no shame of his sexuality, he is beautifully himself and authentic. [Laughs] And he’s kinda funny too… just cracking you up at every turn.\n\nKaramo is just the epitome of style and taste and class. He’s so charismatic, he pulls you right in, smart as a whip. What’s beautiful about him is, he’s an amazing listener; he stops and really hears what everyone, what the guys are saying to him and then he’s able to really process that and bring it back. It’s really a beautiful gift of his.\n\nTan… style and class… he is the full picture there. His sense of posh is just beautiful. He’s also got that edge to him. He’s a little like Adele, I used to say [laughs] — Adele has that gorgeous voice and she sings so beautifully, and then when she talks she’s got that Cockney accent and will tell you how to shove it up your whatever. Tan’s got the same thing; he’s smart and witty, but always classy.\n\nBobby, aside from being crazily talented — he’s so, so good with what he does with his style and his design work — Bobby is a guy who worked really hard to get where he is. He’ll tell you, he’s a kid who grew up with nothing and really fought hard to really do well for himself. He’s a hard worker, he’s a really hard worker, and he brought that to the table. He really cared about each of our episodes and each of the guys and bringing something special along the way.\n\nAnd then, Mr. Antoni. He’s just so filled with passion and he’s scarily smart. He was actually Ted [Allen]’s protégé. Ted sent him our way and we couldn’t be happier. He’s got that adorable face and you just want to squeeze his little head off. He’s so, so smart, he’s very well read, and his sense of passion and taste is beautiful as well.\n\nSpeaking of Ted, is there any chance we’ll see the original Fab 5 show up in any episodes with the new guys, or does moving the show from New York into more rural areas make that difficult?\n\nWell, I’m not going to say no or never because you never know, but the new team is there and… I can’t say no because who knows, maybe we will do something where they all come together. But I think right now it’s the new show, it’s the new Fab 5 and they are definitely out there in the red states and seeing the world. It’s kind of their moment and their time, but definitely the original guys, the OG, are thrilled for us. That’s probably been one of the most beautiful things is that everyone has been so supportive on this journey and really, really loved each other. The Fab 10, as they are, have all really bonded beautifully.\n\nQueer Eye will debut on Netflix in February.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg", "keywords": [], "authors": ["Gerrad Hall", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2017/12/08/queer-eye-fab-5-netflix-first-look/", "title": "Meet the new Queer Eye Fab 5 in this first look", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,First Look,Netflix", "news_keywords": "Exclusive,First Look,Netflix", "description": "The makeover reality series revival premieres in February on Netflix", "og": {"title": "Meet the new 'Queer Eye' Fab 5 in this first look", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/12/08/queer-eye-fab-5-netflix-first-look/", "description": "To see more from the First Look issue, pick up the latest Entertainment Weekly on stands Friday, or buy it here now. Don’t forget to&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2017/12/08/queer-eye-fab-5-netflix-first-look/", "description": "The makeover reality series revival premieres in February on Netflix", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/12/08/queer-eye-fab-5-netflix-first-look/", "title": "Meet the new 'Queer Eye' Fab 5 in this first look", "description": "The makeover reality series revival premieres in February on Netflix", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fqueereye-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1512662400.0, "source": "https://ew.com", "summary": ""}