{"url": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "text": "Paris Hilton kicked off 2018 with a mountaintop proposal from her boyfriend actor Chris Zylka. Here's what we know about their wedding plans so far.\n\nThe Engagement Ring\n\nWhen Zylka popped the question, he did so with a stunning 20-carat pear shaped diamond ring by celebrity jewelry Greene & Co.\n\n\"The ring was so gorgeous and sparkling,\" Hilton told People. \"I was shaking as I put it on. It is the most beautiful ring that I have ever seen!\"\n\nWorth $2 million, the piece was inspired by a ring belonging to Hilton's mother Kathy.\n\n\"So happy & excited to be engaged to the love of my life,\" Hilton wrote on Instagram at the time. \"My best friend & soulmate. Perfect for me in every way. So dedicated, loyal, loving & kindhearted. I feel like the luckiest girl in the world! You are my dream come true! Thank you for showing me that fairytales do exist.\"\n\nMore details on the ring, right this way.\n\n\n\nThe Wedding Planner\n\nHilton's mother is helping to organize the nuptials. \"'I love planning weddings—I'm the wedding planner,\" she told Life & Style. The magazine also claims that Hilton wants \"an over-the-top, fairy-tale wedding.\"\n\nThe Dress\n\nAccording to Cosmopolitan.com, Hilton plans to visit \"a few showrooms\" in New York City to search for her wedding gown. \"I’m really inspired by Princess Grace Kelly and Elizabeth Taylor,\" she says. \"I thought they looked so classic and elegant and beautiful. I definitely want it to be a very timeless and elegant look.\"\n\nShe and her sister clearly have similar taste. When Nicky Hilton married James Rothschild in July of 2015, her Valentino gown was inspired by Kelly. \"I love Grace Kelly. She can do no wrong,\" she said.\n\n\n\nNicky Hilton on her wedding day in 2015. Getty Images\n\nBut nothing's been decided for the older Hilton sister just yet.\n\n\"Right now we’re picking out gowns,\" she told Us Weekly.\" I’ve had so many designers sending over sketches and hotels offering up venues and wedding planners wanting to be a part of it, so it’s just a matter of picking our faves. Not sure when it will be, but it’s so fun looking at dresses and venues for now.”\n\n\n\nThe Guest List\n\nPlans are still coming together for Hilton's nuptials, but we do know one person on the guest list, her longtime friend, Kim Kardashian. \"Yes, of course I will invite [Kim],\" Hilton says. \"I love her. We’ve been friends since we were little girls.\"\n\nHilton and Kardashian have had a complicated friendship over the past decade, but given Hilton's recent participation in the Yeezy 6 campaign, posing as a Kim clone, it's safe to say the two are on good terms once again.\n\nThe Location\n\nHilton hasn't set a date yet (in January she told Extra it would be \"soon\"), but she does know she wants the ceremony to be \"close to home,\" reports Cosmopolitan. \"I really want my grandfather to be there and my family. I don’t want to have it somewhere where people need to travel too far,\" she says.\n\nPreviously Hilton had also mentioned that she might like to have multiple weddings. \"For my 21st birthday I had five parties, so maybe for the wedding I’ll have a European one, an American one, one for everyone around the world,\" she said.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.33330011956954964xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.33330011956954964xh;center,top&resize=1200:*", "keywords": [], "authors": ["Caroline Hallemann", "Senior Digital News Editor", "As The Senior Digital News Editor For Town", "Country", "Caroline Hallemann Covers Everything The British Royal Family To The Latest Episodes Of Outlander", "Killing Eve", "The Crown."], "canonical_link": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "title": "Everything We Know So Far About Paris Hilton's Wedding", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Everything We Know So Far About Paris Hilton's Wedding", "description": "From the date to details on what the bride's dress might look like.", "url": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.33330011956954964xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-04-11 08:05:54", "published_time": "2018-02-15 11:36:00", "section": "Weddings", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.33330011956954964xh;center,top&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Paris Hilton Wedding News - Details on the Dress, Date & More", "description": "Stay up to date with the latest news and details for Paris Hilton's wedding. Here's what we think it'll be like, from the dress to the reception, and who we think will attend.", "keywords": "Paris Hilton, Chris Zylka, Paris Hilton wedding, Paris Hilton Wedding Details, Paris Hilton Wedding news, Paris Hilton Wedding Date, Paris Hilton Wedding dress, Paris Hilton Wedding location, Paris Hilton wedding Planner, Paris Hilton Wedding Ring", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.6666002391390993xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "The Scene,the-scene,weddings", "sailthru.date": "2018-02-15T23:36:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.33330011956954964xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-688360794-1518729360.jpg?crop=1xw:0.6666002391390993xh;center,top", "sailthru.socialtitle": "Everything We Know So Far About Paris Hilton's Wedding", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1518665760.0, "source": "https://www.townandcountrymag.com", "summary": ""}