{"url": "https://www.vogue.co.uk/article/pippa-middleton-honeymoon-pictures", "text": "PIPPA MIDDLETON and her new financier husband, James Matthews, are having the time of their lives on their honeymoon. From exotic escapes to city breaks, the newlyweds have been holidaying since their nuptials on May 22 in Berkshire, causing much speculation as to where the pair will land next.\n\nRead more: Pippa Middleton's Wedding Day\n\nThe new husband and wife most recently made their way to the western coast of Australia. The events planner wore a pale-blue Maje shirt dress accessorised with the holiday staples she hasn’t been without since landing in Australia - a Sensi Studio woven bag and Castaner espadrilles - as the pair prepared to leave the city of Perth on Monday.\n\n© Backgrid\n\nWhilst the the Western Australia capital is known for its beautiful beaches, the port area of Fremantle is famous for its architectural heritage and historic harbour. Beyond the city, the picturesque island of Rottnest, just 11 miles west of Perth, offers plenty of outdoor activities for the adventurous couple from surfing to snorkelling, whereas wine regions in the south of the state offer a sophisticated escape in the hills.\n\nRead more: How To Plan The Ultimate English Wedding\n\nThe newlywed couple first kicked off their honeymoon with an exclusive stay on a private island in French Polynesia, following a short layover in LA. It is believed that Middleton and Matthews stayed at the Brando, the most luxurious eco-friendly resort in the world, reportedly costing them around £3,000 a night.\n\n© Rex Features\n\nIt is thought that the happy couple then went on to New Zealand before landing in Australia on Tuesday. Whether this is true or not, the couple’s visit to Australia comes only a short while before Prince Harry is expected to arrive in Sydney for a series of events in the city that is set to host the 2018 Invictus Games.\n\nRead more: Pippa Middleton's Wedding: What The Guests Wore\n\nFor their first stop Down Under, the newlyweds chose to stay in the Park Hyatt, a hotel situated in the sought-after Rocks area of Sydney. At nearly £11,000 per night, the suite is a hotspot for celebrities staying in the city and features a private terrace with panoramic views of the top tourists spots in the bay: the harbour, Opera House and bridge.\n\nRead more: Pippa Middleton: Style File\n\nWhilst in the sea-side city, the couple have been spotted enjoying the outdoor activities that Sydney has to offer: the pair appreciated the sites on a jog around the Opera House and took in the city by night as they scaled the Harbour Bridge on Wednesday evening.\n\nThe youngest Middleton sister stepped out with her new husband in a Kate Spade dress, accessorised with Castaner espadrilles and an Aspinal bag, on their honeymoon in Sydney. © Rex Features\n\nAs for her holiday wardrobe, the Duchess of Cambridge’s younger sister has so far taken a Sensi Studio weaved bag as her staple honeymoon sidekick, occasionally switching out for an Aspinal bag, worn with a Kate Spade dress and her signature Castaner espadrilles for a dinner with her new husband. The couple took a water taxi to Rose Bay Terminal before climbing into a sea plane to fly to the Cottage Point Inn, an exclusive restaurant in the Ku-ring Gai National Park known for it’s A-list clientele. \"It's chaos,\" restaurant owner, Ally Olesen, told the Sydney Morning Herald. \"We're surprised and flattered they chose us.\"\n\n© Rex Features\n\nFollowing their short, but sweet, stay in Sydney, the 33-year-old was seen in an Orla Kiely broderie-anglaise blouse as the pair touched down in Darwin - a city on the northernmost coast of Australia - on Thursday morning. The Nitmiluk Gorge, Kakadu National Park and Uluru in Australia’s Northern Territory seems only fitting for the adventure-loving couple who have together completed a 54-mile bike ride from London to Brighton, a 33-mile cross-country ski race in Norway (both in 2016) and the Otillo Swimrun World Championship - a six-mile swim in the Baltic Sea followed by a 40-mile trail run which Pippa completed in under 14 hours in 2015.\n\nThe couple have gone off-grid since their departure from Perth, and are most likely enjoying some private time away from the public eye.\n\nRead more: Pippa Middleton Weds In Giles Deacon", "images": ["https://media.vogue.co.uk/photos/5e690a90948e4d0008f62220/1:1/w_100%2cc_limit/UK%20train%20travel%20default.jpg", "https://media.vogue.co.uk/photos/5e6108acc59fb30008dbd3fd/1:1/w_100%2cc_limit/Duchess%20of%20Cambridge%20PA-51155775.jpg", "https://media.vogue.co.uk/photos/5d5455b87e26090008fa8dcb/master/w_100%2cc_limit/original", "https://media.vogue.co.uk/photos/5d5455b884bc2a0008c64c5b/master/w_100%2cc_limit/pippa-middleton-vogue-1June2017-rex-5.jpg", "https://media.vogue.co.uk/photos/5d5455b8b89c2a00085c038f/16:9/w_1920,c_limit/pippa-middleton-vogue-1June2017-getty.jpg", "https://media.vogue.co.uk/photos/5d5455b8e59828000877dc4d/master/w_100%2cc_limit/original", "https://media.vogue.co.uk/photos/5d5455b8b89c2a00085c038f/2:3/w_100%2cc_limit/pippa-middleton-vogue-1June2017-getty.jpg", "https://media.vogue.co.uk/photos/5d5455b8df3584000807cd5f/master/w_100%2cc_limit/original"], "top_img": "https://media.vogue.co.uk/photos/5d5455b8b89c2a00085c038f/16:9/w_1920,c_limit/pippa-middleton-vogue-1June2017-getty.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vogue.co.uk/article/pippa-middleton-honeymoon-pictures", "title": "Pippa Middleton's Honeymoon", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "og": {"locale": "en_GB", "site_name": "British Vogue", "image": {"identifier": "https://media.vogue.co.uk/photos/5d5455b8b89c2a00085c038f/16:9/w_1920,c_limit/pippa-middleton-vogue-1June2017-getty.jpg", "alt": "June 1 2017"}, "url": "https://www.vogue.co.uk/article/pippa-middleton-honeymoon-pictures", "title": "Pippa Middleton's Honeymoon", "type": "article", "description": "From exotic escapes to city breaks, where will the newlyweds head next?"}, "robots": "all", "fb": {"app_id": 449870811704655}, "twitter": {"card": "summary_large_image", "site": "BritishVogue", "title": "Pippa Middleton's Honeymoon", "description": "From exotic escapes to city breaks, where will the newlyweds head next?", "image": {"identifier": "https://media.vogue.co.uk/photos/5d5455b8b89c2a00085c038f/16:9/w_1920,c_limit/pippa-middleton-vogue-1June2017-getty.jpg", "alt": "June 1 2017"}}, "description": "Pippa Middleton on honeymoon with James Matthews in Sydney and French Polynesia"}, "movies": [], "publish_date": null, "source": "https://www.vogue.co.uk", "summary": ""}