{"url": "https://en.wikipedia.org/wiki/Fear_Factor", "text": "This article is about the American television show. For other uses, see Fear factor (disambiguation)\n\nFear Factor was an American stunt/dare game show that first aired on NBC from 2001 to 2006. The show was adapted from the original Dutch version Now or Neverland and renamed Fear Factor by Endemol USA and NBC for the American market. It was initially hosted by comedian and UFC commentator Joe Rogan.\n\nThe show pits contestants against each other in a variety of three stunts for a grand prize, usually of $50,000. From the first to fifth season, the contestants consisted regularly of three men and three women who were competing for themselves. In the sixth season, the show's format was modified to feature four competing teams of two people who have a pre-existing relationship with one another.\n\nFear Factor was cancelled by NBC in 2006, briefly revived in 2011 and then cancelled again in 2012. It was revived for a second time in 2017 to air on MTV with rapper and actor Ludacris assuming the host role; the series would ultimately end in the summer of 2018 after two seasons on that network.\n\nHistory [ edit ]\n\nAs NBC's answer to the CBS television series Survivor, the show was initially a hit for the network in the summer of 2001 and built strong ratings and popularity in the following seasons. Joe Rogan, then known for his role on the sitcom NewsRadio (1995-1999) and as a commentator for Ultimate Fighting Championship was hired as the host. According to a 2015 interview with Art Bell, Rogan expected Fear Factor to be cancelled after a few episodes due to objections to some of the content and further stated that he took the job mainly to obtain observations and anecdotes for his stand-up comedy career.[2]\n\nThe series had a runaway success during the first few seasons, but after the series' fourth season, the popularity and ratings for Fear Factor began to decline. By 2006, when Fear Factor was in its sixth season, the ratings for the series were in steep decline as a result of content concerns and a growing loss of viewer interest, coupled with the series facing tough competition with other TV shows in the same time slot. As a result, the series was only averaging a 2.6 in the ratings.[3][4] Later that year, Fear Factor faced tough competition with the TV ratings champion, Fox's talent series American Idol on Tuesday nights, and the ratings declined further, and continued to trend further downward during this period. Despite much publicity concerning an improved format and better stunts for Season Six, the series' ratings continued to drop and consequently, NBC put the struggling program on hiatus for the remainder of the season to make room for the sitcom Joey, which was removed from the NBC lineup a few weeks later. After a continuous and steep drop in the series' ratings, it was officially cancelled by NBC in May 2006 after six seasons and the network began airing the remainder of the season on June 13, 2006, with the remaining episodes to be aired throughout the summer, with its last episode airing on September 12, 2006. In 2004, Fear Factor became the first network reality show to be syndicated. Over its six seasons, Fear Factor earned NBC a reported $600 million in advertising revenue. Currently only the first season has been released on DVD, but in early 2009, plans were made to release a box set containing the entire series on DVD. The project was put on hold for an unknown reason in March 2010. On June 5, 2010, it was announced that the project was cancelled because of the low sales of the first season DVD.\n\nWith Chiller airing reruns of the show every Sunday night, the ratings on Chiller led to Comcast informing Entertainment Weekly in a May 31, 2011 report that Fear Factor would be revived for a new season. Eight episodes were ordered, with two of them being two-hour episodes and Rogan returning to the hosting duties.[5][6] The revival was shot in high-definition, and owing to concerns over the then-ongoing NFL Lockout and the loss of NBC Sunday Night Football episodes, TV Guide reported in early July the show could be ready as early as September as lockout replacement programming.[7] (NBC eventually lost one episode, the season premiere Hall of Fame Game, because of the lockout that ended in late July.) The program began airing December 12, 2011,[8] with the final episode airing July 16, 2012. On May 13, 2012, NBC announced that Fear Factor was officially cancelled.[9]\n\nIn April 2017, MTV announced that it would be reviving Fear Factor a second time for a 12-episode season. The first season of MTV's Fear Factor premiered on May 30, 2017 and concluded on August 22, 2017. Just prior to the first-season finale, it was announced that MTV had renewed the series for a second season consisting of 20 episodes.[10] The second season, subtitled Season From Hell, began airing on February 25, 2018.[11] The MTV revival is hosted by Ludacris and continues to use the format of four teams competing for a $50,000 prize. The stunts draw inspiration from elements of pop culture, such as horror movies, urban legends, and viral videos.[12]\n\nIn addition to Chiller, reruns of Fear Factor have aired in syndication, on FX and MTV2. The series also has a YouTube channel, where previously unaired footage is shown.\n\nOriginal format (2001–06) [ edit ]\n\nBefore the contestants are introduced (and at the half-way point of a two-hour special), Rogan presents a verbal disclaimer. The wording has changed with certain versions, but this is one most commonly used:\n\n“ I'm Joe Rogan, and this is Fear Factor. The stunts you're about to see were all designed and supervised by trained professionals. They are extremely dangerous and should not be attempted by anyone, anywhere, anytime. ”\n\nBefore Rogan presents a verbal disclaimer, the narrator presents a statement, and this is one most commonly used:\n\n“ Imagine a world where your greatest fears become reality. Welcome to Fear Factor. Each shows, six contestants from around the country battle each other in three extreme stunts. These stunts are designed to challenge the contestants both physically and mentally. If the contestant is too afraid to complete a stunt, they're eliminated. If they fail a stunt, they're eliminated. But if they succeed, they will be one step closer to the grand prize, $50,000. ”\n\nThe normal format involves three men and three women, or four teams of two people with a pre-existing relationship, who have to complete three professional stunts to win US$50,000. Rogan noted that the stunts not only test any contestants/teams physically, but mentally as well. Any contestant(s)/team(s) who were too scared to attempt a stunt, failed to complete a stunt, or underperformed a stunt were eliminated from the competition. If only one contestant/team successfully completed the first or the second stunt, they automatically win $25,000, and the other contestants eliminated in the stunt along with the winner of the stunt return for the next stunt to compete for the remaining $25,000. If no one successfully completed the first or the second stunt, then all of the contestants/teams eliminated in the stunt would return to the next stunt to compete for a reduced $25,000 (this rule did not apply for non-elimination stunts). The only exception to this was in season one, where if one person completed the stunt, then the completer won $10,000 and the $50,000 grand prize was not reduced.\n\nOnly once in the history of Fear Factor did the $50,000 top prize go unclaimed in an episode. This happened on a Best Friends edition on September 27, 2004, when none of the remaining teams were able to complete the final stunt. In the stunt, one member of each team had to drive a ramp car, while the other member had to drive a sports car. The one driving the sports car had to drive it onto the truck bed via the ramp car. If the sports car fell off of the truck bed at any time, the team was automatically eliminated. Had it been successfully completed, the team who did this the fastest would have won. However, the last remaining contestants walked away with two Mazda vehicles for winning a previous stunt (see Second stunt).\n\nAfter the acquisition of Universal Studios of Vivendi by NBC's parent company General Electric in 2004, contestants could win vacations in order to promote the theme park division of NBCUniversal at Universal Orlando, or win trips to Universal Studios in Hollywood.\n\nThe order of the stunts on a typical episode of Fear Factor is as follows:\n\nFirst stunt: The first stunt is designed to physically test each of the contestants or teams (for example, jumping from one building to the next or hanging from a helicopter and collecting flags on a ladder). Usually, the two men and the two women, or the three teams, that gave the best performance (such as the fastest time, farthest distance, or number of flags collected in under a certain time) will move on to the second stunt. The others are eliminated. In the sixth season, a sometimes used rule was that the best-performing team won the ability to eliminate the team of their choice, meaning that teams who failed to complete the stunt or had the worst performance could still advance to the next round if the winning team did not choose to eliminate them.\n\nSecond stunt: The second stunt is meant to mentally challenge the contestants or teams. The three most common types of stunts in the second round are eating stunts, animal stunts, and retrieval/transfer stunts. Eating stunts entail ingesting vile animal parts, live bugs, or a blended concoction of multiple items; animal stunts entail immersing one's head or entire body in animals considered to be disgusting or intimidating (such as rats, spiders, snakes, or worms); retrieval/transfer stunts entail retrieving items or gross objects (often by mouth) hidden in disgusting substances (for example, blood or lard) or live animals. Less often, the second stunt involves a pain endurance challenge or embarrassment tolerance challenge, such as outlasting competitors in a tear gas chamber, walking on broken glass with bare feet, getting a tattoo, having their head shaved, getting piercings, or ingesting habanero peppers. With the exception of retrieval/transfer stunts, contestants are usually not eliminated after this stunt unless they fail to complete it or vomit before finishing. In the case of teams, one team may be eliminated for having the worst performance. In later episodes, a common (but not always used) rule was that no one would be eliminated after the second stunt; instead, the contestant or team that performed the best would receive a prize, such as a vehicle or a prize package similar in value. More often than not, the contestant/team with the best performance had the privilege of choosing the order that the contestants/teams had to go in to perform the next stunt [for the following day].\n\nThird stunt: The third and final stunt is usually something from an extreme type of stunt seen in an action film. Like the first stunt, it usually involves heights, water, vehicles, or some combination of the three. In order to avoid ties, this stunt is always competitive. The player or team with the best performance this round wins the grand prize, usually $50,000, and has the privilege of being informed by Rogan that \"evidently, fear is not a factor for you\".\n\nSpecial formats [ edit ]\n\nFour-Stunt Show [ edit ]\n\nThis was typically a 90-minute episode featuring four stunts instead of three. The first such episode aired in Season 3 and was notable for a stunt involving body piercing. In Seasons 4 to 6, at least one of the four stunts was a non-elimination stunt in which contestants competed for a prize. The four-stunt format was sometimes used in conjunction with themed episodes, such as Family Fear Factor, Twins Fear Factor, and Thanksgiving Fear Factor. In Season 5, six contestants from other reality shows competed in a two-hour, four-stunt episode for $50,000.\n\nExtended competitions [ edit ]\n\nSome Fear Factor competitions consisted of five or more stunts and featured an increased grand prize. These competitions were always presented as multi-part episodes or single two-hour episodes. The first such competitions were the Tournaments of Champions in Seasons 2 and 3 (see below). Season 4 included a two-hour season premiere in which twelve contestants competed in six stunts for a grand prize of $1,000,000; and a two-part, six-stunt Las Vegas episode where the winner would have a chance to win up to $100,000 based on his or her performance in the final stunt (they would then have to bet half their winnings on a hand of blackjack). Season 6 featured two three-episode, six-stunt competitions (\"Psycho Fear Factor\" and \"Reality Stars Fear Factor\"). Season 7 included two five-stunt competitions in which five teams competed for a grand prize of $100,000; the first aired as a single two-hour episode, and the second aired in two parts.\n\nTournament of Champions: The second and third seasons concluded with a Tournament of Champions featuring the winners of each show in that season and a $100,000 grand prize. In Season two, the thirteen non-celebrity winners were divided into groups of eight men and five women. For the first four stunts, men competed amongst men and women competed amongst women, in two stunts each. The men had to release a flag from a locked box while hanging suspended in the air and eat three different items from a table. The women had to collect flags while on top of an aircraft and retrieve three poles from a tank with alligators. The stunts narrowed the contestants down from eight men and five women to two men and two women who will, in the end, compete against each other for the grand prize by using a key to activate a horn while riding on a speeding truck. In Season three, the twenty-four winners were divided into two groups of twelve, each containing seven men and five women. In the first semifinal episode, the group was cut from twelve to six to three to two finalists. In the second semifinal episode, the group was cut from twelve to six in the first stunt, then the men competed amongst the men and the women competed amongst the women in the second stunt, and then the final four contestants, two men and two women, were cut to two finalists. Each finalist won a 2004 Mazda RX-8 and a chance at the $100,000. In the finals, the four finalists competed in three stunts. Each stunt eliminated one contestant, and the final stunt determined the winner.\n\nCouples Fear Factor: Seasons 4 and 5 both included Couples Fear Factor competitions that played out over seven episodes and featured a grand prize of $1,000,000. Nine couples competed in 17 stunts in Season 4, and eight couples competed in 14 stunts in Season 5. In Season 4, each episode contained two or three stunts, with at least one stunt being a non-elimination stunt. In Season 5, each episode featured two stunts; the first was always a non-elimination stunt, and the second usually eliminated the team with the worst performance. In contrast to the regular format, only one team was eliminated in each elimination stunt; if multiple teams failed the stunt, then the teams that succeeded would vote on which failing team to eliminate. Almost every stunt offered a prize (e.g., cars, vacations, pre-loaded credit cards, a chance to steal a desired prize from another team) or a $10,000 incentive to the team with the best performance. Couples Fear Factor episodes had certain stylistic differences from the regular format, including a different opening sequence, and onscreen interviews with the contestants (regular episodes usually presented interviews in voiceover format only).\n\nPsycho Fear Factor: A three-episode series in which six couples competed in six stunts for various cash and prizes, including a grand prize of $250,000. The stunts were centered around the Bates Motel on the set of the original Psycho horror movie from Paramount Pictures. Unlike other Fear Factor episodes, contestants were required to sleep in the filthy Bates Motel between stunts and were subjected to Fear Factor pranks and mini-challenges while in the motel.\n\nReality Stars Fear Factor: A three-episode series in which five teams of Reality TV stars competed in six stunts for various cash and prizes, including a grand prize of $150,000. The series featured teams from The Amazing Race, Survivor, American Idol, The Apprentice, and The Real World.\n\nOther formats [ edit ]\n\nCelebrity special (Seasons two, three, and six): In Seasons 2 and 3, episodes with celebrity contestants were played in the normal format, except that contestants were playing for charity. The winning contestant's charity would receive $50,000, and other contestants' charities would receive a lesser amount ($10,000 or $25,000). In Season 6, eight celebrity contestants paired up into teams of two for the first two stunts but competed individually in the final stunt. Stephen Baldwin, Kevin Richardson and Alan Thicke are among the celebrities who have competed on Fear Factor.[13] Season 2 included an episode featuring six WWF/E stars; it was won by Matt Hardy.\n\nAll-Gross Show (Seasons three to six): All three stunts on this show followed the format of the second (gross) stunt as described above. The first such episode involved bobbing for objects in a vat containing 50 gallons of cow blood. In seasons four and five, the all-gross format was used for Halloween-themed episodes. In season six, a \"Farm Fear Factor\" episode featured all gross stunts.\n\nMixed Team and Individual Stunts (Seasons two, five, and six): In most episodes, contestants competed individually or in teams of two for the entire competition. However, there were three episodes in which contestants paired up into teams for the first and/or second stunt but competed individually in the final stunt. The first instance of this was a Season 2 episode in which three pairs of twins competed as teams in the first stunt, and competed individually the second and third stunts. In Season 5's \"New York vs. L.A.\" episode, the first stunt narrowed a pool of eight contestants down to four (one man and one woman from each city); contestants from the same city then teamed up in the second stunt, and all contestants competed as individuals in the final stunt. A Season 6 celebrity episode had contestants competing as teams in the first two stunts and individually in the final stunt. In the latter episode, contestants were allowed to attempt the stunts alone if their partner quit before the stunt started.\n\nHoliday specials (Seasons three to five): Over the course of the series, Fear Factor produced three Christmas episodes, two Halloween episodes, and a Thanksgiving episode. The Christmas episodes featured Christmas-themed stunts but were otherwise played in the normal format. The Halloween episodes followed the all-gross format, and the Thanksgiving episode followed the four-stunt format.\n\nLas Vegas Show (Seasons three to five): Stunts took place at various hotels and casinos in Las Vegas. The show's winner was required to bet at least half of their winnings on one hand of Blackjack, with the chance to continue gambling if successful.\n\nSpecial Contestants (Seasons two to seven): Some episodes featured a specific type of contestant (e.g., models, all-female, twins, military members, reality TV stars, freaks and geeks, young and old, returning contestants) or teams with a specific type of relationship (e.g., couples, newlyweds, siblings, best friends, parent/child teams, exes). Many of these episodes were played in the regular format, although some used a four-stunt or extended competition format.\n\nFear Factor Super Bowl Halftime Show (Season two): Played in the normal format with Playboy Playmates. The first stunt aired as counter programming to the Super Bowl halftime show and ended right before the third quarter of the game started. The remaining two stunts were shown immediately after the game as counter programming to the Super Bowl lead-out show.\n\nMiss USA (Seasons three to five): Played in the normal format with Miss USA contestants, with the winning contestant keeping $25,000 and giving $25,000 to a charity of their choice. There was no Miss USA edition in the sixth season of Fear Factor, as NBC produced a Miss USA edition of Deal or No Deal instead; the Miss USA contestants were the briefcase models for the entire episode. The next time that Miss USA delegates would be involved in a game show was in 2010 on Minute to Win It. The Miss USA edition was not present in the show's final two seasons, as the current format had four teams of two people.\n\nBlind Date (Season six): Four single men were introduced to four single women, and either the women (in the first episode) or the men (in the second episode) got to choose their partner among the available contestants of the opposite sex. The game was then played in the regular format, with the winning team dividing the prize.\n\nSleep Deprivation (Season four): Five co-ed pairs of contestants competed as teams in the normal format, with one exception: contestants had to stay awake for the 48-hour duration of the competition. If a contestant fell asleep at any time before the final stunt was completed, his or her team would be eliminated. This was the only episode in the TV series in which contestants could be eliminated in the downtime between stunts.[citation needed]\n\nMillion Dollar Heist: (Season six): Played in the regular teams format, but instead of competing for the normal $50,000 prize, teams would race head-to-head to \"steal\" up to $1,000,000 worth of gold from an armored truck submerged in water for their final stunt. The team that \"stole\" the most money's worth of gold within the time limit would win the combined amount of money collected by both teams.\n\nHome Invasion: This short segment was included at the end of each episode in Season six. It involved Joe Rogan going to different homes across America and challenging a family to compete in a stunt. Each stunt usually involved the contestants, under time limit (usually one minute), ingesting or bobbing in something foul or undesirable. If successful, the family would win up to $5,000 in the form of pre-loaded credit cards from Capital One.\n\nRevived series (2011–12) [ edit ]\n\nThe series revival began airing on December 12, 2011, and the two premiere episodes were viewed by 8.7 million and 8.5 million viewers, respectively.[14] This makes the premiere the highest non-sports programming to air on NBC at 8:00 p.m. since February 2008. Following Rogan's word for a verbal disclaimer, the narrator gives a statement, and this is one most commonly used:\n\n“ It all began ten years ago, at the dawn of reality television. Audiences had never seen anything like it. Now, the legend begins all over again. It's bigger, better and more intense than ever before. Welcome back to Fear Factor. ”\n\nThe revival featured four teams of two people with a preexisting relationship per episode, rather than the original versions' six people (three males and three females). The first five seasons had typically used the three male, three female grouping, but the sixth and final pre-revival season always utilized 4 teams of two people each. The stunts have remained basically the same, with the \"gross\" one in between the two physical ones.\n\nNBC pulled a two-hour, five team, five stunt episode entitled \"Leeches & Shaved Heads & Tear Gas, Oh My!\" which featured a stunt where teams spun a wheel to determine whether they would have to shave their heads and eyebrows, get tattooed, or be tear gassed. This episode was scheduled to air in two parts on January 23 and 30, 2012, but it was postponed after Part 1 was replaced by a GOP debate.\n\nAnother episode, entitled \"Hee Haw! Hee Haw!\" and featuring a stunt where contestants drink the urine and semen of a donkey, was then scheduled to air January 30, 2012. Hesitant about airing the stunt, NBC eventually pulled the episode after pictures of the stunt appeared online. Video footage of the stunt appeared online after the episode aired on Danish TV in June 2012,[15] and Fear Factor eventually posted short clips of all three stunts on their YouTube channel in July 2014.[16][17][18]\n\nThe sixth episode, entitled \"The Bees Are So Angry\", was two hours instead of the usual one, and included five teams, five stunts, and a $100,000 prize instead of the usual four teams, three stunts, and $50,000 prize. Following this episode, The Voice replaced the series' slot on Monday nights.\n\nNBC rescheduled the two hour \"Leeches & Shaved Heads & Tear Gas, Oh My!\" episode, which aired in two parts over the nights of July 9 and July 16. The first part ended with the \"To Be Continued\" subtitle followed by a preview for the second part. As of July 2012, Fear Factor was officially cancelled.\n\nUS Nielsen ratings [ edit ]\n\nOrder Episode Airdate Rating Share Rating/Share\n\n(18–49) Viewers\n\n(millions) Rank\n\n(Timeslot) Rank\n\n(Night) 1 \"Scorpion Tales\" December 12, 2011 5.0[19] 8 3.3/9[20] 8.78 #2 #5 2 \"Broken Hearts and Blood Baths\" December 12, 2011 4.6 7 3.5/8 8.52 #2 #4 3 \"Tall Crappaccino\" December 19, 2011 3.5[21] 5 2.5/6[22] 6.37 #1 #5 4 \"Snake Bite\" January 2, 2012 3.2[23] 5 2.4/5[24] 6.01 #2 #7 5 \"Roach Coach\" January 9, 2012 3.1[25] 5 2.3/5[26] 5.53 #2 #5 6 \"The Bees Are So Angry\" February 12, 2012 2.3[27] 4 1.5/3[28] 3.73 #3 #11 7 \"Leeches & Shaved Heads & Tear Gas, Oh My! (Part 1)\" July 9, 2012 2.5[29] 4 1.4/4[30] 4.01 #3 #4 8 \"Leeches & Shaved Heads & Tear Gas, Oh My! (Part 2)\" July 16, 2012 2.4[31] 4 1.5/5[32] 4.21 #3 #5 9 \"Hee Haw! Hee Haw!\" Unaired in the U.S. due to content concerns.\n\nMTV format (2017–2018) [ edit ]\n\nMTV's Fear Factor revival continued to use the format of four teams of two people competing in three challenges for a $50,000 grand prize, as in Seasons 6 and 7 of the NBC series. As the show started, Ludacris gives a verbal disclaimer. The wording has changed with certain versions, but this is one commonly used:\n\n“ The challenges you are about to see were designed and tested by trained professionals. They are extremely ludicrous and should never be attempted by anyone, anywhere, or at anytime. This is MTV's Fear Factor. ”\n\nHowever, the order of the stunts, as well as some of the rules, differ from the original format. Each episode of the MTV version has three named rounds: Beat the Beast, Face Your Fear, and The Final Fear.\n\nBeat the Beast: This stunt challenges the contestants to conquer their fear of something creepy (usually live creatures considered gross or intimidating) and generally follows the same format as animal stunts from the second stunt of the original version. The team with the best performance in this round wins a \"FearVantage\", which is an advantage in the next round (such as picking the order).\n\nFace Your Fear: This is a challenge tailored to a common fear shared by all of the contestants on a particular episode. The nature of this stunt varies widely depending on the fears of the contestants.\n\nThe Final Fear: This is an extreme physical stunt that follows the same format as the first and third stunts from the original version of the show. The team with the best performance wins the $50,000 grand prize.\n\nInternational versions [ edit ]\n\nControversy [ edit ]\n\nFear Factor has received criticism from the general public mainly because of the show's second stunt, which intends to disgust its viewers. The American Humane Association expressed concerns for allowing various animals to get injured, and even killing insects by eating them alive during the videotaping of the show. The association also revealed that professional animal trainers have refused to work on the show because the producers of Fear Factor have demanded stunts which violate the association's guidelines.\n\nAmerican Humane believes that shows like Fear Factor are on a slippery slope of animal mistreatment and provide poor examples of animal treatment and humane ethics. As we work diligently to expand voluntary compliance with animal safety guidelines, organisations like Endemol who blatantly demonstrate complete disregard for animal welfare, or even that of their human contestants — are producing unacceptable programming. Karen Rosa (Communications Manager of AHA Film and TV Unit)[35]\n\nIn January 2005, an episode featuring a stunt involving blended rats aired in its normal prime time slot. Austin Aitken, a part-time paralegal from Cleveland, Ohio, sued NBC for $2.5 million USD for airing the show, claiming that he felt so disgusted from watching the stunt, his blood pressure rose until he felt dizzy and lightheaded and subsequently vomited. He claimed that his disorientation was so severe that he ran into a doorway and seriously injured himself. In March 2005, U.S. District Judge Lesley Wells threw out the lawsuit on the grounds of First Amendment protection.[36]\n\nFear Factor was also criticized by major U.S. electrical utilities for an episode that required contestants to climb through a simulated electrical substation with \"electrified wires\" replete with simulated sparks and electrical sounds added in post-processing. The Edison Electric Institute issued a warning regarding the episode, fearing that viewers might attempt to climb through a real substation with potentially fatal results.[37]\n\nAn episode originally scheduled for January 30, 2012, featuring contestants drinking donkey semen and urine, was rejected by NBC, which instead aired a rerun.[38] On January 31, 2012, two of the contestants, twin sisters Claire and Brynne Odioso, appeared on The Cowhead Show on Tampa Bay radio station WHPT to talk about their experiences in that episode; however, according to TMZ.com, producers of Fear Factor warned the Odioso sisters not to continue any discussion of the program, as doing so would put them in breach of their confidentiality agreements.[39]\n\nSpin-off products [ edit ]\n\nFear Factor has also resulted in various spin-off products:", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/23px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/en/a/ab/Fear-factor-logo.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Flag_of_Pakistan.svg/23px-Flag_of_Pakistan.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Flag_of_Argentina.svg/23px-Flag_of_Argentina.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Flag_of_Quebec.svg/23px-Flag_of_Quebec.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Colombia.svg/23px-Flag_of_Colombia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/23px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/21px-Flag_of_Albania.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ab/Fear-factor-logo.jpg/250px-Fear-factor-logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flag_of_Turkey.svg/23px-Flag_of_Turkey.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/23px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/23px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Flag_of_the_Arab_League.svg/23px-Flag_of_the_Arab_League.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/23px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/23px-Flag_of_Indonesia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/23px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Flag_of_Egypt.svg/23px-Flag_of_Egypt.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Flag_of_Malaysia.svg/23px-Flag_of_Malaysia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/23px-Flag_of_Poland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_the_Dominican_Republic.svg/23px-Flag_of_the_Dominican_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Flag_of_Bulgaria.svg/23px-Flag_of_Bulgaria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flag_of_Romania.svg/23px-Flag_of_Romania.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/23px-Flag_of_Greece.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Flag_of_Chile.svg/23px-Flag_of_Chile.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/23px-Flag_of_Hungary.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/23px-Flag_of_Portugal.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/ab/Fear-factor-logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Fear_Factor", "title": "Fear Factor", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/ab/Fear-factor-logo.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}