{"url": "https://people.com/tv/inside-julianne-hough-brooks-laich-wedding-photos/", "text": "DWTS judge and actress Julianne Hough married NHL star Brooks Laich in a romantic outdoor Idaho wedding. Subscribe now for exclusive photos inside the gorgeous celebration — only in PEOPLE!\n\nIt was a night of “perfection” for Julianne Hough.\n\nGet push notifications with news, features and more.\n\nThe Dancing with the Stars judge married NHL star Brooks Laich on July 8 in a romantic, outdoor wedding on Lake Coeur d’Alene, Idaho, where Hough spent summer holidays growing up. “When I introduced Brooks to the lake, he fell in love with this special spot, and we knew this was where we wanted to raise our family and grow old together,” Hough, 28, tells PEOPLE in this week’s exclusive cover story. “It just felt right to be married here.”\n\nDesigned by event planner Troy Williams of Simply Troy Lifestyle + Events, the wedding weekend was a celebration of love and nature — both of which were essential to the bride and groom. “It was really important to me that we had our ceremony outdoors,” says Laich, 34, who wore a Brooks Brothers tuxedo. “Julianne and I are very adventurous and free, and wanted the setting to be in nature.”\n\nImage zoom © Julianne and Brooks Laich. All rights reserved. Photographed by Sarah Falugo\n\nMore than 2,000 blooms were used to create the floral arrangements, all designed by Kristen Griffith-VanderYacht of Wild Bloom, including 100 flower boxes and at least 200 garden roses in the reception centerpieces. After the wedding, Hough and Laich donated all the flowers to The Full Bloom, a non-profit organization that repurposes gently used flowers into bouquets for patients in area hospitals, hospice care and other facilities.\n\nFor all the intimate details inside Hough and Laich’s gorgeous Idaho nuptials — including exclusive wedding photos — pick up this week’s issue of PEOPLE, on newsstands Friday\n\nImage zoom © Julianne and Brooks Laich. All rights reserved. Photographed by Sarah Falugo\n\nDuring the ceremony, Hough, who wore a custom strapless sweetheart Marchesa gown, and Laich said traditional vows and exchanged Lorraine Schwartz-designed rings. “Brooks and I kept eye contact the entire ceremony,” she says. “We never stopped looking at each other.” Her favorite moment was “kissing each other for the first time as husband and wife as the confetti cannons exploded around us,” Hough adds. “I couldn’t stop crying all weekend and most people [thought] I would have cried during the entire ceremony, but instead I was just so excited and ready to celebrate!”\n\nRELATED VIDEO: Wedding Details! Going Inside Julianne Hough & Brooks Laich’s Elegant Idaho Reception\n\nAfterwards at their reception, Hough was surprised by her bridesmaids and girlfriends with a choreographed dance number to Sia’s song, “The Greatest,” a favorite from Hough’s recent tour with her brother, Derek. The bride surprised her groom as well — with timed fireworks over the lake during their first dance to OneRepublic’s “All This Time” (to which she also walked down the aisle).\n\nWatch People Weddings: Julianne Hough and Brooks Laich, available now, on the new People/Entertainment Weekly Network (PEN). Go to PEOPLE.com/PEN, or download the PEN app on your favorite mobile or connected TV device.\n\nImage zoom\n\nGuests were given turn-down gifts each night, put together from the bride and groom by Gifts for the Good Life, which included a Happy Spritz facial mist, Sugarfina Bubbly Bears with a J&B monogrammed label, and a make-your-own margarita set with Casamigos Tequila or make-your-own lemonade kit, among other goodies.\n\nHough and Laich announced their engagement in August 2015 after dating for a year and a half. Their wedding weekend was “perfection,” she says. “I don’t think I ever really necessarily dreamed about my wedding as a kid. But I know I will always cherish and remember it for the rest of my life.”\n\nPut your celeb and pop culture knowledge to the test and download PEOPLE and Zynga’s Crosswords with Friends.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fjulianne-wedding.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=945&h=495&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fjulianne-wedding-2.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=945&h=495&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg", "keywords": [], "authors": ["Julie Jordan"], "canonical_link": "https://people.com/tv/inside-julianne-hough-brooks-laich-wedding-photos/", "title": "Inside Julianne Hough's Perfect Wedding to Brooks Laich: Exclusive Photos", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brooks Laich,Dancing with the Stars,Exclusive,Julianne Hough,News,PEN Exclusive,Rollout,TV,Zynga", "news_keywords": "Brooks Laich,Dancing with the Stars,Exclusive,Julianne Hough,News,PEN Exclusive,Rollout,TV,Zynga", "description": "The DWTS judge shares exclusive photos — and all the details — from her romantic Idaho wedding", "og": {"title": "Inside Julianne Hough's Perfect Wedding to Brooks Laich: Exclusive Photos", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/inside-julianne-hough-brooks-laich-wedding-photos/", "description": "DWTS judge and actress Julianne Hough married NHL star Brooks Laich in a romantic outdoor Idaho wedding. Subscribe now for exclusive photos inside the gorgeous&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=945&h=495&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg", "width": 945, "height": 495}}, "pinterest": {"url": "https://people.com/tv/inside-julianne-hough-brooks-laich-wedding-photos/", "description": "The DWTS judge shares exclusive photos — and all the details — from her romantic Idaho wedding", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/inside-julianne-hough-brooks-laich-wedding-photos/", "title": "Inside Julianne Hough's Perfect Wedding to Brooks Laich: Exclusive Photos", "description": "The DWTS judge shares exclusive photos — and all the details — from her romantic Idaho wedding", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=945&h=495&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fcover-regular-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}