{"url": "https://people.com/style/anna-wintour-praises-scarlett-johansson-for-wearing-marchesa-to-met-gala/", "text": "Scarlett Johansson‘s decision to wear Marchesa on the red carpet to the 2018 Met Gala held significant impact for the brand and it’s co-founder, Georgina Chapman, estranged wife of disgraced Hollywood mogul Harvey Weinstein. Johansson was one of the first actresses to wear the high-fashion label to a major red carpet event since news of Weinstein’s sexual misconduct scandal broke last fall.\n\nAndVogue editor-in-chief Anna Wintour, who has long hosted the Costume Institute’s benefit at New York City’s Metropolitan Museum of Art, fully supported Johansson’s decision.\n\nGet push notifications with news, features and more.\n\n“I totally agree with that,” Wintour said during a visit to The Late Show with Stephen Colbert. “Georgina is a brilliant designer and I don’t think she should be blamed for her husband’s behavior.\n\n“I think it was a great gesture of support on Scarlett’s part to wear a dress like that, a beautiful dress like that, on such a public occasion,” she added.\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nJohansson was the first star to give Marchesa a high-profile red carpet moment in months since Weinstein was accused of sexual harassment and assault by dozens of women last fall.\n\nThe actress, 33, wore a romantic off-the-shoulder burgundy gown featuring a tulle skirt embellished with floral appliqués. She attended the annual event alongside her newly-confirmed boyfriend and SNL star Colin Jost.\n\nRELATED: The Met Gala’s Most Unbelievable Style Moments: See 120+ Stunning Stars on Fashion’s Biggest Red Carpet\n\nImage zoom Scarlett Johansson and Colin Jost Andrew H. Walker/REX/Shutterstock\n\nOn Tuesday, Johansson stood by her choice to wear a Marchesa gown.\n\n“I wore Marchesa because their clothes make women feel confident and beautiful and it is my pleasure to support a brand created by two incredibly talented and important female designers,” Johansson said in a statement to PEOPLE, who selected a romantic off-the-shoulder burgundy gown featuring a tulle skirt embellished with floral appliqués.\n\nMarchesa echoed a similar sentiment in the following statement to PEOPLE: “We are truly honored that Scarlett chose to wear Marchesa for the Met Gala. She is an amazingly talented actor who has incredible style and presence. It was wonderful to work so closely with her in creating this custom look.”\n\nImage zoom Harvey Weinstein and Georgina Chapman Gisela Schober/Getty\n\nSince the news about Weinstein broke, Marchesa’s fate as one of Hollywood’s go-to labels has been questioned by some in the industry.\n\nFemale stars of Weinstein’s films often wore Marchesa designs on the red carpet, and Chapman and Weinstein’s businesses were often linked. A few stars, including Jessica Chastain, claimed that Weinstein would pressure them to wear his wife’s designs. In Chastain’s case, she said he mocked her when she didn’t do so.\n\n“They absolutely had a push from Harvey,” writer Neil Gaiman, a friend of Chapman’s, told Vogue in an interview published Thursday. “But you cannot hype something from nothing and make it last. And Harvey’s hyping worked because George is actually an artist. I’ve watched her at work and been impressed and fascinated. She has a vision, and she’s really good at it.”\n\nRELATED VIDEO: Georgina Chapman, Harvey Weinstein Prenup Revealed: She Could Get Nearly $12 Million in Divorce\n\nAfter Weinstein and Chapman agreed to a divorce settlement in January (they haven’t yet publicly filed for divorce), Marchesa canceled its runway show at New York Fashion Week.\n\nThey also didn’t offer any dresses to celebrities for awards season — something Chapman told Vogue was her decision alone. “We didn’t feel it was appropriate given the situation,” she said. “All the women who have been hurt deserve dignity and respect, so I want to give it the time it deserves. It’s a time for mourning, really.”\n\nThe brand, however, is continuing its business. Chapman and co-founder Keren Craig even recently released a lookbook of pre-fall 2018 designs and announced it would be debuting a Fall 2018 line in a new format.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fgettyimages-688373634-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/style/anna-wintour-praises-scarlett-johansson-for-wearing-marchesa-to-met-gala/", "title": "Anna Wintour Calls Scarlett Johansson Wearing Marchesa to Met Gala a 'Great Gesture of Support'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Met Gala,News,Scarlett Johansson,Stephen Colbert,The Late Show with Stephen Colbert", "news_keywords": "Met Gala,News,Scarlett Johansson,Stephen Colbert,The Late Show with Stephen Colbert", "description": "Anna Wintour opened up about Scarlett Johansson's decision to support Harvey Weinstein's estranged wife Georgina Chapman's fashion brand Marchesa at the 2018 Met Gala", "og": {"title": "Anna Wintour Calls Scarlett Johansson Wearing Marchesa to Met Gala a 'Great Gesture of Support'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/anna-wintour-praises-scarlett-johansson-for-wearing-marchesa-to-met-gala/", "description": "Scarlett Johansson‘s decision to wear&nbsp;Marchesa on the red carpet to the 2018 Met Gala held significant impact for the brand and it’s co-founder, Georgina Chapman,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg", "width": 1231, "height": 645}}, "pinterest": {"url": "https://people.com/style/anna-wintour-praises-scarlett-johansson-for-wearing-marchesa-to-met-gala/", "description": "Anna Wintour opened up about Scarlett Johansson's decision to support Harvey Weinstein's estranged wife Georgina Chapman's fashion brand Marchesa at the 2018 Met Gala", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/anna-wintour-praises-scarlett-johansson-for-wearing-marchesa-to-met-gala/", "title": "Anna Wintour Calls Scarlett Johansson Wearing Marchesa to Met Gala a 'Great Gesture of Support'", "description": "Anna Wintour opened up about Scarlett Johansson's decision to support Harvey Weinstein's estranged wife Georgina Chapman's fashion brand Marchesa at the 2018 Met Gala", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1231&h=645&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fscarlett-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/oFGNSPgQFss"], "publish_date": null, "source": "https://people.com", "summary": ""}