{"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "text": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter\n\n...not quite what we meant. (James Ensor, The Painting Skeleton)\n\n— Thiessen's Law of Art \"The overwhelming prerequisite for the greatness of an artist is that artist's death.\"\n\nAdvertisement:\n\nThe vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a great deal of painters, modern and classic, that have been recognized while still alive. Nor has the deceased been recognized immediately after his corpse hits the ground, as it seems to happen when this trope is in effect. (Historically, this has affected composers and writers far less than people assume. Shakespeare was successful during his lifetime, so was Beethoven. It stands to reason - only a few people would continue doing something for a long time without some kind of success. This is glaringly obvious for composers - of the top tier, only Bach and Tchaikovsky comes even remotely close to this trope, and they were still far from starving during their lifetimes.)\n\nAdvertisement:\n\nIn theory, the idea that dead artists are better may result from them dying at their peak: they don't have the time to taint their earlier successes with a Dork Age of divisive later works that fail to live up to the masterpieces (whether through being too different or more of the same).\n\nIn 99% of the cases where this trope is mentioned, one character, either the artist or an associate, will come up with the \"brilliant\" idea of spreading rumors of the artist's death, which immediately causes said artist's work to magically get the recognition that eluded it all these years. Of course, something inevitably goes wrong, the artist is found to be alive, and the status quo is restored. For some reason, fraud accusations are seldom made.\n\nThe modern-day sentiment is probably \"Dead Musicians Are Better\", music being arguably the second-most personal media form. Technology has also amplified this trope's effects, with streams of a freshly-deceased artist's songs skyrocketing and social media making people's opinions more apparent. (2016 was a good year-long example.)\n\nAdvertisement:\n\nSee also Vindicated by History, True Art Is Ancient, and Short-Lived Big Impact. When a musician's death or departure leads to their group doing better than before, it's an aversion of The Band Minus the Face. When a dead artist is celebrated (through song), it's a Celebrity Elegy. Many examples below also fall under Never Speak Ill of the Dead, in that some artists who became greatly celebrated after their death lived miserable and/or ridiculed lives before dying.\n\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware.\n\nExamples:\n\nFictional examples\n\nopen/close all folders\n\nAnime & Manga\n\nThe plot device with a faked death skyrocketing popularity and recognition is used in Galaxy Angel almost perfectly, although with a military officer instead of an artist. A similar thing happens in Cannon God Exaxxion, though in this case the people playing up the war hero's death actually believed he was dead at first. When it turns out he wasn't, rather than admitting their mistake, they decide to make it come true.\n\nIn Mega Man Star Force, Hyde is under the impression that people will not love his grim, macabre works of art until after he dies. This is a motive for his villainy in the first place, as he tries to find Mu to become immortal so that he may live to see people appreciate him. When this doesn't seem to be working out, he starts an art class for children to get them to appreciate the art when they grow older, but they all ignore him and simply come for the free food. Free food provided by Luna Platz at that, who is perhaps is his sole earnest student.\n\nIn one chapter of Pet Shop of Horrors, a has-been actor whose only success was a small role in a cult-classic sci-fi film dies of suicide by basilisk. At his funeral, people are already starting to speak of him as if he were a great actor whose immense talent was too quickly robbed from the world.\n\nManjimutt from Yo-Kai Watch uses this as an excuse for why he has no friends. It should be noted Manjimutt is already dead and is not even an actual artist. Manjimutt: The snowflakes are my only friends. Artists are never appreciated in their lifetime.\n\nComic Books\n\nIn the Doctor Who comic strip \"Interstellar Overdrive 2\" in Doctor Who Magazine, the manager of a band plans to kill them all in a spaceship 'accident' so the record company can make a fortune reissuing new editions of their back catalogue.\n\nIn Adventure Time: Marceline Gone Adrift, an evil hipster takes advantage of Marceline's apparent death to appoint himself the keeper of her memory, produce unauthorised merch, and eventually loot her house for memorabilia.\n\nIn MAD, in one Melvin and Jenkins feature, Melvin pockets a terminally ill boy's art, hoping that it will increase in value once the kid dies.\n\nComic Strips\n\nThe New Yorker once ran a cartoon with a well-off couple asking a street artist \"And how much more would this be worth if you died?\"\n\nFan Works\n\nIn The Horror! The Horror! Nicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. Nicolas: Famous artist?\n\nPerenelle: Maybe, but you'd have to die before your paintings would be worth anything.\n\nNicolas: Famous artist?Maybe, but you'd have to die before your paintings would be worth anything. Done it before. We could do it again.\n\nNicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. In No Competition Ally consoles an eight-year-old Harry for his poor grade in art. Ally: No artist is truly famous unless they are dead, so it scarcely matters while you're alive.\n\nAlly consoles an eight-year-old Harry for his poor grade in art. In Claro de Luna it's mentioned that the famous cellist Colccherini wasn't well-recognized until after his death. This also foreshadows Octavia's own fate, as her lover Luna immortalizes her in history after her death.\n\nFilms — Live-Action\n\nThe movie Pauly Shore is Dead shamelessly parodies this trope.\n\nThis trope is the subject of the song performed in the opening sequence of Phantom of the Paradise.\n\nRobin Williams' son in World's Greatest Dad is a terrible person in life, but Robin takes advantage of his death to sell his own book, disguised as a journal the son wrote before death.\n\nTitanic (1997): \"It's a pity we couldn't hold on to that drawing. It'll be worth a lot more in the morning.\" Ironically, he's kind of right — the painting is found in a safe and restored, and given that it's a memento that was brought up from the Titanic it's now a priceless historical artefact. And the artist dies in the sinking, so bonus.\n\nIn She's All That, two girls in Lani's art class compliment her on how wonderful her paintings are. She thinks it's a genuine compliment until they suggest she invoke this trope and \"off herself\" as all the greats did.\n\nThe trope is the whole plot of the '60s movie The Art Of Love, which has Dick Van Dyke staging his own death to increase the value of his paintings.\n\nDiscussed in Die Another Day. Jinx is meeting with a surgeon on the Cuban island, discussing a drastic procedure to change her looks. He says that he considers himself an artist, and she remarks that most great artists aren't celebrated until after their deaths, upon which she shoots him.\n\nIn Bring Me the Head of Mavis Davis, a struggling record producer plots to invoke this trope by murdering his one remaining artist in order to boost flagging sales of her work. It... doesn't go according to plan.\n\nLiterature\n\nIn the Discworld novel Soul Music, Music With Rocks In requires the early death of its first host (the singer Buddy) in order to spread further. \"Everyone will remember the songs he never had a chance to sing. And they would be the greatest songs of all.\" See the quote page.\n\nOlder Than Radio: In one of Mark Twain's short stories, two starving artists manufacture a great deal of art... and then manufacture a story about how the artist who painted these things is fatally ill. Naturally, the artist in question eventually \"dies\", and his paintings become valuable overnight. Note that said dead artist is François Millet.\n\nStrong Poison by Dorothy L. Sayers is a murder mystery in which the victim and the prime suspect are both authors. The publicity from the trial substantially helps both their sales; the detective discusses this as a possible motive for the murder but doesn't pursue it because he's in love with the suspect and trying to clear her. As it turns out, she's innocent, and his murder had nothing to do with him being an author.\n\nIn Margaret Atwood's Resources of the Ikarians, the inhabitants of a barren island devoid of sources of income start cultivating dead artists.\n\nNoted in Dumas' novel The Count of Monte Cristo, where the Count notes that the modern school of artists has one major failing — \"They have not had enough time to become Old Masters\".\n\nThe Second Deadly Sin (1977) by Lawrence Sanders uses this trope. The artist with the terminal illness has stockpiled paintings to provide for his family and agent. But he lives longer than expected and keeps on producing more paintings...\n\nThis was the entire motive of the killer in Phryne Fisher novel Murder in Montparnasse.\n\nThe first case Kevin J. Anderson's Dan Shamble is shown working on in Death Warmed Over is that of a ghost artist, who's having a feud with his heirs: they don't want him to start painting again, because his pre-mortem paintings' value will plummet if they aren't his \"last work\" anymore.\n\nAverted in Max Beerbohm's Victorian Era short story Enoch Soames. The titular obscure poet is convinced that his reputation will soar after his death, so he sells his soul to travel 100 years into the future and bask in his posthumous glory. An afternoon spent in the Reading Room of the British Museum teaches him the bitter truth. Not only is he considered a mediocre poet; he's also believed to be a fictional character created by Beerbohm.\n\nInvoked in the Felicia, Sorceress of Katara novella \"The Cult of the Rubber Nose\", the owner of an art gallery bought a bunch of crappy paintings at excessive prices, then attempted to make up his losses by assassinating the artists to make them more valuable.\n\nin the novella \"Getting Even\" by Ray Brown, an entire extraterrestrial race (sometime before the story starts) got wiped out by a bomb dropped into their sun, causing a solar flare to wash over their planet; and the art of that race suddenly became quite valuable as a result.\n\nIn The Newest Plutarch, Walter Monks\u0092 last movie was a major hit due to his No Stunt Double policy getting him killed on set.\n\nLive-Action TV\n\nMusic\n\nThe Dire Straits song \"In the Gallery\" relates the story of an artist driven to create but never gaining recognition, until... \"I've got to say he passed away in obscurity / And now all the vultures are coming down from the tree / So he's going to be in the gallery\"\n\nThe title of the Nightwish song \"Kuolema Tekee Taiteilijan\" translates to \"Death Makes an Artist\". They also have \"The Poet and the Pendulum\", which is basically a 14-minute Epic Rocking song about Tuomas dying, which was written by Tuomas himself.\n\nThe whole point of \"Self Suicide\" by Goldie Lookin Chain\n\nby Goldie Lookin Chain \"Schneller Leben\" (Live Faster) by German punk band Die Ärzte is all about parodying this trope.\n\n(Kurt Cobain knew, with age comes loss of face. What do you think Jesus Christ died so young? Jimi Hendrix and Bruce Lee, they never got to grow old. Learn from these great examples, everyone likes you as a corpse.) \"Kurt Cobain hat es gewusst, im alter droht Gesichtsverlust. Was glaubst du warum Jesu Christ, schon so jung gestorben ist. Jimi Hendrix und Bruce Lee , alt geworden sind die nie. Lern von diesen Vorbildern, als Leiche hat dich jeder gern.\"(Kurt Cobain knew, with age comes loss of face. What do you think Jesus Christ died so young? Jimi Hendrix and Bruce Lee, they never got to grow old. Learn from these great examples, everyone likes you as a corpse.)\n\nThe Smiths song \"Paint A Vulgar Picture\" is about the record industry's tendency to do this with dead musicians. At the record company meeting, on their hands a dead star.\n\nThe Christian Rock band Dead Artist's Syndrome is named for this trope.\n\nMentioned in \"If I Die Young\" by The Band Perry: \"Penny for my thoughts? Oh no, I'll sell them for a dollar / They're worth so much more now that I'm a goner / Maybe then you'll hear the words I've been singin' / Funny when you're dead, that's when people start listenin'\"\n\n\"Fake My Own Death and Go Platinum\" by Psychostick. Well you see, I wanna sell a million records / But my music sucks so what am I to do? / They say an artist is appreciated after he's dead / I have no talent, but I bet that it's still true. / The lyrics all suck / and the chords are too funky / We're on a major label cuz / we're just plain lucky / We sold 4 albums to our own mothers / we have a few supporters / (but there aren't many others ) / What if I could live / When they all would think I'm dead / Oh just what if I could have me a cake / and eat it too? / I'd be set for life / No more struggles, no more strife / Let the money do the talking / I'm a dead man walking.\n\nThe Twenty One Pilots song \"Neon Gravestones\" is about how we should stop doing this, especially in regards to romanticizing an artist's suicide.\n\nRadio\n\nInvoked in The Goon Show episode \"Tales of Montmartre:\" Gauguin: You can keep my paintings.\n\nToulouse-Lautrec: What good are they?\n\nGauguin: Nothing now, they'll be worth a fortune after I'm dead.\n\nToulouse-Lautrec: After you're dead... [GUNSHOT] I'm rich! You can keep my paintings.What good are they?Nothing now, they'll be worth a fortune after I'm dead.After you're dead... [GUNSHOT] I'm rich!\n\nThe Hotblack Desiato story arc in The Hitch Hikers Guide To The Galaxy has the universe-famous rock star spend a year dead for \"tax reasons\". It doesn't do his music sales any harm, either.\n\nTheatre\n\nTimberlake Wertenbaker's play Three Birds Alighting on a Field invokes this trope repeatedly. One scene has an art dealer discussing the disappointing sales of a particular painter. The artist had died young, which the dealer mentions as a \"good thing, from a marketing point of view\".\n\nA discovered play by Mark Twain, Is He Dead?, is based on the short story described above with a smattering of Attractive Bent-Gender and some rather funny Melodrama.\n\nIn Pippin, the title character tries to succeed at life by taking up art, only to discover that \"you got to be dead to you find out if you were any good.\"\n\nVideo Games\n\nVisual Novels\n\nThis forms part of the plot of the Visual Novel Hotel Dusk: Room 215 for the Nintendo DS; an artist who is very much alive and his partner had been exploiting this effect, getting high prices for the artist's paintings by making up a dead artist named \"Osterzone\" and saying that Osterzone was the one who painted them.\n\nWeb Comics\n\nWeb Original\n\nThis shirt explains it rather bluntly.\n\nWestern Animation\n\nAnime & Manga\n\nBefore news of his passing broke in 2010, few Pokémon fans knew who Takeshi Shudō was. Once it did, though, he became more appreciated for his work as the head writer of the series up until partway through Johto, as well as writing the first three movies. Having written many fan-favorite episodes, his departure is now often considered to be the point where the series dropped in quality and never quite recovered.\n\nArts\n\nVincent van Gogh is the poster child of this trope, managing to sell just one painting during his lifetime, but becoming much sought after soon after his suicide.\n\nEl Greco was not appreciated in his lifetime, the 16th century, because his art didn't conform to the norm of realism. Only in the 20th century has his work been reappreciated for exactly this reason. Nowadays it's far more worth.\n\nPieter Bruegel the Elder: For many centuries his work was seen as vulgar and crass because it depicted ordinary peasants. Only in the 19th century did people finally realize that it was still amazingly well painted and did the prices for his work go up.\n\nAlthough not known by many outside Korea, painter Lee Jung-seob is arguably the most famous modern artist in Korea, and while his paintings are sold in average millions of dollars now, he died in Seoul of hepatitis, broke and alone.\n\nFilms — Live-Action\n\nLiterature\n\nLive-Action TV\n\nMusic\n\nPoetry\n\nSylvia Plath. When she was alive, she struggled to gain recognition at all for her poetry. After her death? She was the first poet to posthumously win the Pulitzer Prize, is now regarded as one of the key figures in confessional poetry, and Joyce Carol Oates hailed the publication of Plath's unabridged journals as a \"genuine literary event.\" Both her contemporary Anne Sexton and her husband Ted Hughes might also fit this trope.\n\nOlder Than Radio: After John Keats' death, literati everywhere said he would've surpassed Shakespeare if he had lived longer. He did die at the age of 26, though, and only really began producing once it was clear he was dying, so they might have a point.\n\nEmily Dickinson wasn't even published before her death. If she had been well enough to destroy her own work before she died (instead of trusting a friend to do so) we never would have seen a word of it.\n\nCharles Bukowski. He became somewhat popular in The '80s but is now considered a legend.\n\nRoman poet Marcus Valerius Martialis (known as Martial) complained of this in the first century AD. \"You puff the poets of other days, The living you deplore. Spare me the accolade: your praise Is not worth dying for.\". Making this (at least according to Martial) older than print.\n\nPro Wrestling\n\nInitially averted by Chris Benoit. As when word broke out of what really happened to himself and his family, much of the Internet Wrestling Community turned on him instantly, the same IWC that once worshiped him as their god. However, this started to turn back in his favor when it was revealed that, due to the many, many concussions he suffered during his wrestling career, his brain resembled that of an 80-year-old Alzheimer's patient, helping to explain the otherwise inexcusable act. Adding to this is the accounts of his close relatives, mentioning that Benoit never got over the death of his best friend Eddie Guerrero (and witnessed a lot of his wrestling friends dying at young ages), which would explain why he ended up losing it. These days, while there is still condemnation, at the very least the IWC can understand that he was not completely at fault as circumstances were simply not that kind to him.\n\nPlayed straight by most other wrestlers who die young though, especially Owen Hart, who was never more than an upper-midcarder at best in his lifetime (though according to Triple H, he was about to get a major push when he died; the push that Triple H himself ended up getting, in fact), Randy Savage (whose soiled reputation — largely due to an alleged sex scandal involving an underage Stephanie McMahon — was completely rehabilitated overnight) and Eddie Guerrero, who was extremely over but then became like a GOD after his death.\n\nAs a rule of thumb, songs by professional wrestlers tend to be So Bad, It's Good at best. However, Randy Savage's rap album, Be A Man , has been looked upon much more favorably after his death. The Bryan & Vinny Show went so far as to point out that rap artists have been known to release albums posthumously, so they expressed hope that another one would be released someday.\n\n, has been looked upon much more favorably after his death. The Bryan & Vinny Show went so far as to point out that rap artists have been known to release albums posthumously, so they expressed hope that another one would be released someday. Nearly averted by Ultimate Warrior, who had built a standing over the last couple of decades as a recluse, bridge-burner (he basically refused to involve himself with anything WWE-affiliated), Cloudcuckoolander, and cynic (with some mild-to-moderate bigotry suggested as well). At WrestleMania XXX, he put all that to rest and made up with several people whom he shared beefs with, got inducted into the 2014 Hall of Fame, mending things over with the audience the night after, which preceded his death from heart failure the following day. All this went to restore his reputation, allowing him to be fondly remembered in the times after as a great wrestling legend without the need for posthumous reconsideration.\n\nChyna didn't have the best relationship with WWE after her departure from the company due to her career in pornography, but after her death, both Triple H and Stephanie McMahon acknowledged her accomplishments. She was eventually posthumously inducted into the Hall of Fame as a member of D-Generation X, which seemed very unlikely while she was still alive note Presumably out of fear that someone with such unstable mental health shouldn't be allowed near a live microphone.\n\nSports\n\nFormula One has the Brazilian driver Ayrton Senna. He's one of the most talented and noteworthy drivers from the '80s-'90s, renowned as an effectively aggressive driver who won three world championships within a short time and a master at driving in heavy rain - though admittedly he was not without powerful rivals. Following his shocking death in the 1994 San Marino GP, however, he has become an unrivaled legend that absolutely nobody in the future can match, especially considering the extreme They Changed It, Now It Sucks! attitude from the fanbase. This is especially true in Brazil, where Senna became the country's biggest sporting hero, even surpassing Pelé, after his death - to the point that other Brazilian F1 champions like Emerson Fittipaldi and Nelson Piquet are completely forgotten, and good Brazilian drivers who never won the championship like Rubens Barrichello and Felipe Massa are treated as symbols of shame. Many former Brazilian F1 fans insist F1 died with Senna.\n\nIn the North American racing series, Dale Earnhardt (NASCAR), Dan Wheldon and Justin Wilson (Indy Car) all won Most Popular Driver awards in the seasons they were killed in action, although like Senna, many can argue they were still at or almost at the peak of their talents when they died. An even bigger example is Bryan Clauson, who won Indy's Most Popular Driver award in 2016. Unlike Wheldon or Wilson, he never started a single race in the series outside of the Indianapolis 500, and wasn't even killed in an Indy car crash, but rather a sprint car crash on a dirt track. Much of his popularity from that season came from his campaign to run a combined 200 paved and dirt races in various disciplines (including the 500) in 2016 and reviving the old-school dream of short track open wheel racers working their up to the promised land of Indianapolis.\n\nFormer NHL player Pavol Demitra gained a lot of fans when he passed away, along with the rest of Lokomotiv Yaroslavl, in a plane crash.\n\nPete Maravich was considered a phenomenal basketball player but the lack of success of the teams he played for was held against him. LSU never made the NCAA tournament during his college years and he never made it past the first round of the NBA playoffs. Also, he ran into injury problems. But after his premature death at age 40 more attention was paid to his individual accomplishments and he's now considered one of the true legends of basketball.\n\nMiami Marlins pitcher José Fernandez did very well for a player who was in the early years of his career, including two All-Star Game appearances and winning Rookie of Year. His untimely death during a boating accident in September 2016 has ensured that he will always be a legend and one of the most beloved players in the team's history.\n\nRoberto Clemente was one of the great Major League Baseball players of the 1960s (15-time All-Star, MVP in 1966). After his death in 1972 note He died in a plane crash off the coast of his native Puerto Rico, delivering humanitarian aid to survivors of an earthquake in Nicaragua , a special Hall of Fame election was held four months later to waive the five-year waiting period (he was elected with a 92.7% percentage of the vote). note The Hall of Fame has since written a similar exception into its rules for induction. Any player otherwise eligible for induction who dies while active, or within the normal 5-year waiting period, becomes eligible for induction 6 months after his death. His career total of 3,000 hits is now considered the standard for a Hall of Fame-level player.\n\n, a special Hall of Fame election was held four months later to waive the five-year waiting period (he was elected with a 92.7% percentage of the vote). His career total of 3,000 hits is now considered the standard for a Hall of Fame-level player. Kobe Bryant was one of the most popular NBA players of all time thanks to his success on the Los Angeles Lakers, but even then, he was not quite the icon that say, Michael Jordan was. That all changed following his sudden death in a helicopter crash in January 2020. Within hours of his passing, people were calling for the NBA silhouette to be changed to one of Bryant, and for his numbers #8 and #24 to be retired league-wide like the MLB did for Jackie Robinson and the NHL for Wayne Gretzky. In fact, Mark Cuban quickly announced that the Dallas Mavericks would retire #24 despite the fact that Bryant never once played for them. In fact, the Grammy Awards, which were held at the Lakers\u0092 home Staples Center that night, quickly became a tribute to him.\n\nTheatre\n\nHeinrich von Kleist is considered one of the great classics of German theatre, but before his 1811 suicide, he only managed to get two of his plays performed on stage, both in mutilated form. For instance, Goethe (in his capacity as director of the theatre in Weimar) felt it necessary to transform Kleist's one-act comedy Der zerbrochne Krug (\"The broken jug\") into a three-act play, thereby completely spoiling its effect. IN some respects Kleist was so far ahead of his time that he had to be Vindicated by History, which helps to explain why his Penthesilea and Amphitryon would have to wait until 1876 and 1898, respectively, for their first performance.\n\nIt's hard to say if the Broadway musical RENT would have turned into the long-running smash it is if its author, Jonathon Larson, hadn't died shortly before its debut, but it certainly added to the show's legacy. (However, unlike Angel, he didn't die of AIDS). Arguably, RENT was also highly valued because Broadway attendance was slumping at the time, and a Rock Opera about sassy young hipsters offered appeal to someone besides middle-aged Camp-lovers and little old matinee ladies.\n\n\n\nVideo Games\n\nSatoru Iwata, former president of Nintendo, was a rather polarising figure for his strategy of attracting new, \"casual\" gamers with the Wii, as opposed to appealing to established players. Many called for him to resign after the Wii U failed to match sales with its Xbox One and PlayStation 4 rivals. After he passed away in 2015, he was known as a fellow gamer who cared for Nintendo's audience, and more of his Genius Programming feats were known — almost universally turning his portrayal amongst gamers into a positive one.\n\nWeb Original\n\nMonty Oum was somewhat renowned and respected through his early animating career for neat personal passion projects like Dead Fantasy, but Volume 1 of his last work RWBY released to a rather lukewarm reception, with critics citing janky animations and low production values. Just as the show was starting to hit its stride with Volume 2, Monty shockingly passed away in February 2015 from an allergic reaction in hospital. Colleagues have continued Monty's work and turned RWBY into a juggernaut which has become a smash hit in Japan and was featured in the Arc System Works Fighting Game BlazBlue: Cross Tag Battle, while Monty is considered to be one of the best (if not the) 3D web animators to have ever lived.\n\nWestern Animation", "images": ["https://static.tvtropes.org/pmwiki/pub/external_link.gif", "https://static.tvtropes.org/images/logo-white-big.png", "https://static.tvtropes.org/img/howlandsc-side.jpg", "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "https://static.tvtropes.org/images/communityShowcase-echochamber.jpg", "https://static.tvtropes.org/img/tvtropes-footer-logo.png"], "top_img": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "keywords": [], "authors": [], "canonical_link": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "title": "Dead Artists Are Better", "meta_data": {"description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "twitter": {"card": "summary_large_image", "site": "@tvtropes", "owner": "@tvtropes", "title": "Dead Artists Are Better - TV Tropes", "description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "image": {"src": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png"}}, "og": {"site_name": "TV Tropes", "locale": "en_US", "title": "Dead Artists Are Better - TV Tropes", "type": "website", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "image": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "description": "The vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a great deal of painters, modern and …"}, "article": {"publisher": "https://www.facebook.com/tvtropes"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://tvtropes.org", "summary": ""}