{"url": "www.theguardian.com/music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star", "text": "In a video viewed more than 6m times on Twitter, 21-year-old Chika Oranika summed up the current feelings of many black Americans about Kanye West. She delivered her own lyrics over the beat of the rap star’s Jesus Walks. “How you say you Yeezus but do nothing to restore us? You support the people up in power that abort us,” she raps into the camera. “It don’t matter how much money you got or you lack, when that cheque clear don’t forget that your children are still black.”\n\nWhy the opprobrium, which has come from activists, Hollywood stars and fellow musicians, as well as withering online freestyles? West, one of the most significant, complex and celebrated rappers in the US, has used a 350-tweet stream of consciousness over the past fornight to throw his support firmly behind Donald Trump. But yesterday, he went way beyond party politics in an interview with TMZ, saying, in a sloppy bit of rhetoric: “You hear about slavery for 400 years. For 400 years? That sounds like a choice.”\n\nHost Van Lathan tore back at him: “While you are making music and being an artist and living the life that you’ve earned by being a genius, the rest of us in society have to deal with these threats to our lives.” Roxane Gay reacted on Twitter by calling his comments “dangerous” and “trite, shallow … he is not a free thinker. He is a free moron.”\n\nPlay Video 2:34 From Taylor Swift to Hurricane Katrina: five of Kanye West's memorable outbursts – video\n\nBlack America’s dismay at West has been brewing for some time. He puzzled many when he posed for photos with Trump in December 2016, making him one of the first celebrities to apparently endorse the new president. But his recent tweets left no room for doubt. He posted a picture of himself wearing the Trump campaign’s Make America Great Again cap, and tweeted: “You don’t have to agree with Trump but the mob can’t make me not love him. We are both dragon energy. He is my brother.” After an intervention by a presumably somewhat weary Kim Kardashian, West wrote: “My wife just called me and she wanted me to make this clear to everyone. I don’t agree with everything Trump does. I don’t agree 100% with anyone but myself.”\n\nIn response, R&B singer Frank Ocean emerged from hibernation with a sarcastic screengrab of the time West went off-script during a 2005 Hurricane Katrina appeal to say “George Bush doesn’t care about black people”, the intimation being that it is now West who doesn’t care. Samuel L Jackson suggested West was courting an audience in “the sunken place” – the psychic interzone in the horror film Get Out into which black people are hypnotised and silenced (the film’s director, Jordan Peele, has previously linked it to Trump’s America).\n\nFacebook Twitter Pinterest Dragon brothers? West with Donald Trump, 2016. Photograph: REX/Shutterstock\n\n“So many people who love you feel so betrayed right know because they know the harm that Trump’s policies cause, especially to people of colour,” West’s friend John Legend wrote in a text message that West posted on Twitter. The rap star wrote back: “You bringing up my fans or my legacy is a tactic based on fear used to manipulate my free thought.” Among ordinary Americans, meanwhile, there was seething anger at West supporting someone who has reportedly said “laziness is a trait in blacks”; who campaigned for the death penalty for the black teenagers, later proven innocent, in the Central Park Five case; and who thought there were some “very fine people” marching alongside neo-Nazis and white supremacists in Charlottesville.\n\nReacting to – or having perhaps anticipated – all this, West released a new track, Ye Vs the People, the first music from two new albums being released in June. In a dialogue with the American people (vocalised by rapper T.I.), Kanye tries to detoxify the Trump brand and reclaim his Make America Great Again slogan: “Wearin’ the hat’ll show people that we equal,” he raps, arguing for a why-can’t-we-all-just-get-along humanism. He ultimately distils the debate thus: “You on some choosin’ side shit, I’m on some unified shit.”\n\nSo many people who love you feel so betrayed right know – John Legend\n\nFor Kanye, this chapter is just the latest incident in an uncompromising career. At the turn of the century, as a beatmaker for Jay-Z and others, he really did seem to be on “some unified shit”, taking the chopped-up soul samples of “backpack” hip-hop and pairing them with the blockbuster tropes of mainstream rap production; he then successfully segued into being a unified producer-rapper. His first two albums charmed the whole spectrum of rap fans with their diversity and humour: he riffed on black cultural reference points – slow-jam love songs, social climbers – like a standup comedian.\n\nHis albums became more ambitious with each new release, unifying diverse cultural reference points – Graduation sampled Daft Punk and explored a more electronic sound; 808s & Heartbreak used Auto-Tune to reflect and enact emotional dissonance, to brilliant effect; My Beautiful Dark Twisted Fantasy was as operatic as the title suggests. His interest in visual art grew, with artists from Takashi Murakami to George Condo commissioned for his album covers; he designed his own fashion collections and collaborated with Adidas. In 2013, he said: “Creative genius, that’s my title. My title is not rapper any more.” West positioned himself as a rounded aesthete, obsessed with form and how art impacts society – his Twitter feed has recently featured everything from tech solutions for water desalination to artists Joseph Beuys and David Hammons. Part of his attraction to Kardashian seemed to be her very iconography: “My girl a superstar all from a home movie”, he wondered admiringly on 2012 track Clique.\n\nFacebook Twitter Pinterest With his wife Kim Kardashian in the video for Famous. Photograph: Tidal\n\nHe also continued his analysis of black America. On the same track he raps: “You know white people get money, don’t spend it / Or maybe they get money, buy a business / I’d rather buy 80 gold chains and go ig’nant.” West sees himself as celebrating the economic freedom black Americans were denied for decades, and to which they still have much less access than whites. It’s an extension of a key Jay-Z line – “I do this for my culture, to let ’em know what a nigga look like, when a nigga in a roadster” – from Izzo (HOVA), a track that Kanye produced.\n\nOn New Slaves, meanwhile, from 2013 album Yeezus, West expressed a more nuanced version of his slavery comments this week: that black Americans were subject to a new kind of slavery, the rabid consumerism for Maybach cars and Alexander Wang clothes that traps them in economic bondage. Julius Bailey, a philosophy professor at Ohio’s Wittenberg University, who has edited a book of essays called The Cultural Impact of Kanye West, argues that West should be criticised for his TMZ interview, but “on the basis that he didn’t speak to the material implications of post-chattel slavery,” as he has done on New Slaves and Clique. “Kanye’s heartfelt apology [to Van Lathan on TMZ after his comments] was a way of realising that his words, when not qualified or contextualised, do more damage than the emancipating good he seeks.” Some of West’s other lyrics have been similarly clumsy, even offensive. He sampled Billie Holiday’s Strange Fruit, a song about lynching, for Blood on the Leaves, a song about the destructive power of fame in which he also compared a man having his wife and mistress separated at a basketball game to apartheid.\n\nAnd since Yeezus, his self-obsession has become stifling. His 2016 album The Life of Pablo has a great skit called I Love Kanye, where he imagines: “What if Kanye made a song about Kanye called I Miss the Old Kanye? Man, that’d be so Kanye!”\n\nIn the wake of his slavery comments, the skit stops being funny: black people really do miss the old, outward-looking Kanye. Rapper Meek Mill summed up the thoughts of many when he posted an image of Kanye to Instagram yesterday, surrounded by the words “RIP Old Kanye” and quoting Kanye’s lyrics back at him: “I feel the pressure, under more scrutiny / And what I do? Act more stupidly.”\n\nFacebook Twitter Pinterest Kanye West xAdidas show, autumn/winter New York, 2015. Photograph: Leandro Justen/BFANYC.com/REX/Shutterstock\n\nThe problem is that Kanye’s self-scrutiny has become so advanced that he is beginning to see the world purely through the prism of Kanye, rather than the eyes of black America. That’s harmful not just to himself, but to an ongoing civil rights struggle in a still-racist US; his provocations have the potential to embolden the alt-right and others who would diminish the standing of African Americans.\n\nLike Steve Jobs and Elon Musk, both figures he admires, it’s hard to place Kanye on to a left-right political binary. His personal political philosophy doesn’t neatly dovetail with existing belief systems – witness how the alt-right embraced him after his championing of Trump, and then deserted him when he also championed Parkland shooting survivor and activist Emma Gonzalez last weekend.\n\nHis embrace of Trump – as with his embrace of black conservative commentator Candace Owens, whom he met with after tweeting “I love the way [she] thinks” – is, to him, apolitical. “I see it as simply being contrarian and a bit arrogant, not an actual cosigning of the ideas espoused by Trump relative to immigration, urban policy or militarism,” Bailey says. “He’s being a fan of wealth.” Kanye champions Trump’s “energy” and sees in him the same self-creation that he wants for himself, and, perhaps, for black America – but like other successful, moneyed libertarians, he has become cut off from reality, and assumes that all you need to make it is willpower, perhaps helped along by his inspirational bromides on Twitter (today’s being “Most fear is learned”). Insulated by his money and cultural clout, West is immune from the draining power of Trump’s energy and the legacies of slavery, and is free to celebrate or question them. The racism he has experienced – being ostracised by pop radio and high fashion – is real and clearly painful, as he returns to the subject in another interview this week with radio host Charlamagne tha God. Yet having eventually been given access to fashion at least, West seems to believe that all black people can have that kind of agency – that self-belief alone can set you free. It’s the kind of illusion that makes Trumpism so seductive.\n\nAny analysis is complicated by West’s hospitalisation for two weeks in 2016 after a mental breakdown, following intense touring and an incident where Kardashian was robbed in Paris. He has recast the episode as a “breakthrough” and says he is using medication that “helps calm me down”; Kardashian has expressed frustration at how Kanye is framed as mentally ill when he is “just being himself when he has always been expressive”. And of course, there is a long history of black people being dismissed as crazy.\n\nFacebook Twitter Pinterest Kanye West performing on The Pyramid Stage at Glastonbury, 2015. Photograph: Yui Mok/PA\n\nA more generous reading is that Kanye still cares a lot about black America, and in some ways he is a victim of an increasingly dogmatic, polarised culture – one created, in part, by his and Trump’s mouthpiece of choice, Twitter. “Slavery in America was from 1618 to 1865?” asks Bailey. “If so, 400 years takes us to 2018, which [chimes with] exactly what all those black nationalists, anti-colonialists, some academicians, and even George Clinton called for, namely an emancipation of the mind.” Kanye is frustrated by the social homogeneity he perceives: “See that’s the problem with this damn nation / All blacks gotta be Democrats, man, we ain’t made it off the plantation,” he raps in Ye Vs the People, suggesting that supporting Republicans is an expression of black freedom. “I vehemently hate the ‘sunken place’ reference, for Kanye has proven his bona fides in black emancipation and black love,” says Bailey. “We know, via his own words on his albums and interviews, that he stands against racism in all its forms. Kanye may be arrogant, mentally unstable, narcissistic and insensitive but, for him, he is free.”\n\n• This article was amended on 3 May 2018 to add the word “reportedly” in relation to a quote attributed to Donald Trump: while a former employee said in a 1991 book that Trump had told him “laziness is a trait in blacks”, Trump has denied saying that or anything like it.", "images": ["https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2bc214d88e08c293c0d9b0b2c13079d9", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Kanye+West%2CMusic%2CCulture", "https://i.guim.co.uk/img/media/b8fb93828ce628da2b01da5f367c76bd18de10ac/0_6_4094_2456/master/4094.jpg?width=300&quality=85&auto=format&fit=max&s=fb6428ff9310a6b30b8055442f11bf0c", "https://i.guim.co.uk/img/media/ebb7f2559f95a0ae68702d39f9b3e21f3f277119/24_0_633_380/master/633.jpg?width=300&quality=85&auto=format&fit=max&s=3268bc2b009a31db221b489c976694cb", "https://i.guim.co.uk/img/media/385951350bd844542da6ed8dd41039344441eebd/0_104_2362_3296/master/2362.jpg?width=300&quality=85&auto=format&fit=max&s=e92e94652c7e29f4c4939f446c4dd66f", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/61ca8478f1043e97dcf48c944b418747a007d5a5/0_53_4252_2551/master/4252.jpg?width=300&quality=85&auto=format&fit=max&s=6ed76356a6968740626daa0e2ef893ee", "https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=300&quality=85&auto=format&fit=max&s=b857faa890ac8238b0b07afa54a60dbd"], "top_img": "https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2bc214d88e08c293c0d9b0b2c13079d9", "keywords": [], "authors": ["Ben Beaumont-Thomas"], "canonical_link": "https://www.theguardian.com/music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star", "title": "‘I miss the old Kanye’: what has happened to rap’s most complex star?", "meta_data": {"description": "His suggestion that black people have been complicit in their own slavery has prompted widespread outrage. What lies behind Kanye West’s recent provocations?", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Ben Beaumont-Thomas", "thumbnail": "https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=620&quality=85&auto=format&fit=max&s=acf95bc0993914bc895ade7f482290fa", "keywords": "Kanye West,Music,Culture", "news_keywords": "Kanye West,Music,Culture", "og": {"url": "http://www.theguardian.com/music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star", "image": "https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2bc214d88e08c293c0d9b0b2c13079d9", "description": "His suggestion that black people have been complicit in their own slavery has prompted widespread outrage. What lies behind Kanye West’s recent provocations?", "type": "article", "title": "‘I miss the old Kanye’: what has happened to rap’s most complex star?", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/ben-beaumont-thomas", "publisher": "https://www.facebook.com/theguardian", "section": "Music", "published_time": "2018-05-02T17:03:19.000Z", "tag": "Kanye West,Music,Culture", "modified_time": "2018-05-03T11:05:53.000Z"}, "al": {"ios": {"url": "gnmguardian://music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star", "iphone": "gnmguardian://music/2018/may/02/i-miss-the-old-kanye-what-has-happened-to-raps-most-complex-star?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/07a511a30b63750f7be54ee6107ab243b592c01f/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=721005b5f009023958db5861a5bba4fc", "site": "@guardian", "card": "summary_large_image", "creator": "@ben_bt", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1525190400.0, "source": "http://www.theguardian.com", "summary": ""}