{"url": "https://www.vulture.com/2018/12/golden-globes-2019-predictions-for-nominations-tv-and-film.html", "text": "Clockwise from top left: A Star Is Born, Bohemian Rhapsody, Atlanta, and Killing Eve. Photo: Warner Bros/Twentieth Century Fox/FX/Nick Briggs/BBC America\n\nIt’s time for the Golden Globes, the only televised awards show that hands out trophies for movies and TV and airs on NBC in January! The Hollywood Foreign Press Association announces its nominations on Thursday morning — as we wait with bated breath to find out who will be lucky enough to enjoy a sloshed evening on someone else’s dime, here are Vulture’s 2019 Golden Globe predictions in both TV and film.\n\nBest Television Series: Drama\n\nWith three of the five dramas nominated last year — The Crown, Game of Thrones, and Stranger Things — all out of contention in 2018, that opens up the category to some potential new entries.\n\nThe Hollywood Foreign Press was right on top of Sam Esmail’s Mr. Robot, nominating it in its first season, so I fully expect it to give the same treatment to Esmail’s excellent Homecoming, especially with a star as big as Julia Roberts at the helm. In addition to being one of the year’s buzziest, most addictive series, Killing Eve is also a British-made series, and that may carry extra sway with U.K. voters. Same goes for Bodyguard, the biggest drama-series hit in England in years, even though it landed on Netflix in the U.S. with a bit less fanfare. Given the Globes’ track record with Ryan Murphy shows (Glee won for outstanding TV comedy twice, and the limited series/TV movie category has featured a Murphy outing every year for the past five years), it seems more than fair to assume that [Billy Porter voice] the category is … also going to include Pose.\n\nWhich leaves room for one more drama. It could be last year’s winner, The Handmaid’s Tale; This Is Us, also nominated last year; fan-favorite The Haunting of Hill House; or The Americans, which has been criminally overlooked by the HFPA in this field every year that it’s been on the air. I think this could go a number of different ways, but I am going to give Globe voters the benefit of the doubt and assume that they’ll finally rectify their very wrong shunning of the Jennings family.\n\nPredicted nominees: The Americans, Bodyguard, Homecoming, Killing Eve, Pose\n\nBest Television Series: Musical or Comedy\n\nThe Marvelous Mrs. Maisel was named Best Comedy at last year’s Globes and at this year’s Emmys, so I can’t imagine it being passed over for a nomination here. Add Atlanta back into the competition, too, which qualifies in the race again after taking a year off. Black-ish has been nominated for the past two years, but I can imagine voters moving away from that ABC sitcom to let some new shows into the mix. Kidding, the Showtime series about the grieving children’s show host played by Jim Carrey, strikes me as the sort of series that could bump Black-ish. (The Globes voters love Carrey — more on this shortly.)\n\nThe HFPA relishes any chance to get ahead of the Emmys, which means that this is also a great time for it to finally recognize the genius of The Good Place. GLOW, which found an even stronger sense of voice in season two, is also a likely candidate for inclusion, given the nomination Alison Brie received for her performance last year. But what about Murphy Brown? In that Candice Bergen comedy’s heyday, it was nominated five times and took the top prize once. Globe voters made a point of honoring Will & Grace last year for its revival. They could do the same with Murphy Brown. But since the general public reaction to Murphy has been a bit muted, they may ignore it.\n\nPredicted nominees: Atlanta, GLOW, The Good Place, Kidding, The Marvelous Mrs. Maisel\n\nBest Miniseries or TV Film\n\nAs I see it, there are seven top contenders in this category: The Assassination of Gianni Versace: American Crime Story, Escape at Dannemora, Maniac, Sharp Objects, Patrick Melrose, A Very English Scandal, and The Little Drummer Girl. The first four seem like locks, given their quality and the caliber of talent involved. I feel like Patrick Melrose will be perceived as more of a showcase for Benedict Cumberbatch, who will earn a nomination. And in a battle between A Very English Scandal, the BBC mini-series picked up in the States by Amazon, and The Little Drummer Girl, another BBC entry that aired very recently on AMC, I suspect A Very English Scandal may have the edge. I also suspect that I could be dead wrong. Nevertheless …\n\nPredicted nominees: The Assassination of Gianni Versace: American Crime Story, Escape at Dannemora, Maniac, A Very English Scandal, Sharp Objects\n\nBest Actor in a TV Drama\n\nSterling K. Brown won the Globe last year and he’ll definitely compete again for his role as Randall on This Is Us. Other actors who will probably be nominated again this year: Jason Bateman, who landed a nod for Ozark last year and two previous times for Arrested Development; and Matthew Rhys, who won an Emmy earlier this year but who has only been nominated for the Globe once, two years ago, for his work on The Americans. There are all kinds of directions voters could go to fill out the field: They could nominate J.K. Simmons for his dual roles on Counterpart, or Milo Ventimiglia for This Is Us, since Jack’s experience in the Crock-Pot fire didn’t air until this year. Or they could go with Game of Thrones alum Richard Madden for Bodyguard, Kevin Costner for his work on Yellowstone, Stephan James for his subtle turn on Homecoming, or John Krasinski for taking over Jack Ryan duties on Tom Clancy’s Jack Ryan. It’s a wide-open field, so take your pick.\n\nPredicted nominees: Jason Bateman (Ozark), Sterling K. Brown (This Is Us), Kevin Costner (Yellowstone), Richard Madden (Bodyguard), Matthew Rhys, (The American)\n\nBest Actress in a TV Drama\n\nLet’s try to imagine the HFPA not nominating Julia Roberts for her first starring role in a regular television series … nope, can’t do it. Roberts has been nominated eight times for her film roles, and she’s won three Globes. Mark her down in this field in permanent ink. Joining her will likely be Elisabeth Moss, who won last year for The Handmaid’s Tale. That leaves a tough choice: Killing Eve stars Sandra Oh and Jodie Comer; Keri Russell, whom the Globes have recognized for playing Elizabeth Jennings just once before; and Robin Wright, who took over as star of House of Cards under especially challenging circumstances. This is another tough one, but my guess is that the list will shake out with a lot of love for Eve — and not so much for Russell, unfortunately.\n\nPredicted nominees: Jodie Comer (Killing Eve), Elisabeth Moss (The Handmaid’s Tale), Sandra Oh (Killing Eve), Julia Roberts (Homecoming), Robin Wright (House of Cards)\n\nBest Actor in a TV Comedy\n\nThe Hollywood Foreign Press loves big movie stars. It definitely loves Jim Carrey, who has been nominated six times, won twice, and will undoubtedly score another nod for his TV comeback on Kidding. Similarly, I don’t think the HFPA would dare not to nominate eight-time nominee, two-time winner, and Cecil B. DeMille Award recipient Michael Douglas for his role in Netflix’s The Kominsky Method. Other shoo-ins: Donald Glover for Atlanta, who won in this category two years ago, and Barry’s Bill Hader, who took home this year’s Emmy for his portrayal of a conflicted hit man. The remaining question: Will two-time nominee Anthony Anderson get another nod for Black-ish, or will Ted Danson’s Good Place demon slide in and snag that last spot? Given the Globes’ tendency to embrace what’s a little more fresh, I’m leaning toward Danson.\n\nPredicted nominees: Jim Carrey (Kidding), Ted Danson, (The Good Place), Michael Douglas (The Kominsky Method), Donald Glover (Atlanta), Bill Hader (Barry)\n\nBest Actress in a TV Comedy\n\nAside from another nomination for Rachel Brosnahan, who won last year for her performance in The Marvelous Mrs. Maisel, nothing seems 100 percent certain in this category. I feel fairly confident that Alison Brie will get nominated again for GLOW, particularly since her role in season two confronted some thorny #MeToo issues. The other three nominations could go to Maya Rudolph, who delivers the standout performance in Forever; Issa Rae, previously nominated for Insecure; Jennifer Garner, a big name who is the most delightful part of HBO’s Camping; or, in keeping with potential heavy HFPA support for The Good Place, Kristen Bell.\n\nHere’s where I landed, with the caveat that Rae could easily still squeeze out Bell or Garner.\n\nPredicted nominees: Kristen Bell (The Good Place), Alison Brie (GLOW), Rachel Brosnahan (The Marvelous Mrs. Maisel), Maya Rudolph (Forever), Jennifer Garner (Camping)\n\nBest Actor in a Miniseries or TV Film\n\nIt’s a tight race this year, but it’ll certainly include Emmy winner Darren Criss from The Assassination of Gianni Versace: American Crime Story, Hugh Grant for A Very British Scandal, and Benedict Cumberbatch for his all-in performance of an addict in Patrick Melrose. From there, it’s a toss-up between Jonah Hill for Maniac, Benicio del Toro for Escape at Dannemora, and John Legend for becoming our Lord and Savior in NBC’s live staging of Jesus Christ Superstar. As always, keep in mind the HFPA’s love of established film stars.\n\nPredicted nominees: Darren Criss (The Assassination of Gianni Versace: American Crime Story), Benedict Cumberbatch (Patrick Melrose), Jonah Hill (Maniac), Hugh Grant (A Very British Scandal), Benicio del Toro (Escape at Dannemora)\n\nBest Actress in a Miniseries or TV Film\n\nIf Amy Adams doesn’t get nominated for Sharp Objects, I will drink any poison that Patricia Clarkson whips up and forces me to consume. Translation: I’m confident that she’s getting nominated. I feel the same way about Patricia Arquette’s full-body transformation into Tilly Mitchell in Escape at Dannemora, as well as Emma Stone’s genre and subconscious-spanning turn in Maniac. From there, things get dicier. Regina King, who won this year’s Emmy for her work in Netflix’s Seven Seconds, should get a nomination, along with Laura Dern for The Tale. But the Golden Globes has a tendency to throw one wild card into the mix, and I’m guessing that may happen here. Even if The Little Drummer Girl doesn’t get nominated for best mini-series, I think the HFPA will want to show some love to that limited work, and may do so via its star, Florence Pugh.\n\nPredicted nominees: Amy Adams, (Sharp Objects), Patricia Arquette (Escape at Dannemora), Laura Dern (The Tale), Florence Pugh (The Little Drummer Girl), Emma Stone (Maniac)\n\nBest Supporting Actor in a Series, Miniseries, or Television Film\n\nThere is one definite lock in this category and that’s Henry Winkler, who won the Emmy for his portrayal of Gene Cousineau on Barry and will almost certainly be nominated for a Golden Globe as well. Other potential contenders: Tony Shalhoub for The Marvelous Mrs. Maisel, Edgar Ramirez for The Assassination of Gianni Versace, Ben Whishaw for A Very English Scandal, Alan Arkin for The Kominsky Method; Brian Tyree Henry for Atlanta, and Joseph Fiennes for The Handmaid’s Tale. Even though Shalhoub wasn’t nominated last year, his previous Globe track record — he was nominated five times for Monk, and won once — should put him in the mix this year. Support for both The Assassination of Gianni Versace and A Very English Scandal should translate into nods for Ramirez and Whishaw. (Actors who appear in limited series or TV movies traditionally do well in this broad-brush category.) And I’m going to call that last slot for Brian Tyree Henry who, in addition to doing stand-out work on Atlanta this season, has also done some fine film work this year that will likely raise his profile in the eyes of HFPA members.\n\nPredicted nominees: Edgar Ramirez (The Assassination of Gianni Versace: American Crime Story), Tony Shalhoub (The Marvelous Mrs. Maisel), Brian Tyree Henry (Atlanta), Ben Whishaw (A Very English Scandal), Henry Winkler (Barry)\n\nBest Supporting Actress in a Series, Miniseries, or Television Film\n\nI believe Ann Dowd, nominated last year for The Handmaid’s Tale, will repeat that feat this year. Alex Borstein’s Emmy win for The Marvelous Mrs. Maisel should bolster her case for a Golden Globe nod as well. I’ll be very surprised if Patricia Clarkson isn’t nominated for Sharp Objects, and I suspect Penélope Cruz will have enough support among HFPA members to be recognized for her work in The Assassination of Gianni Versace: American Crime Story. That leaves one opening that could conceivably go to Judith Light for The Assassination of Gianni Versace, Emmy winner Thandie Newton for Westworld, Betty Gilpin for GLOW, Zazie Beetz for Atlanta, Yvonne Strahovski for The Handmaid’s Tale, or Chrissy Metz for This Is Us. I think it’s going to break Newton’s way.\n\nPredicted nominees: Alex Borstein (The Marvelous Mrs. Maisel), Patricia Clarkson (Sharp Objects), Penélope Cruz (The Assassination of Gianni Versace: American Crime Story), Ann Dowd (The Handmaid’s Tale), Thandie Newton (Westworld)\n\nBest Motion Picture, Drama\n\nRoma is ineligible here because of an arcane HFPA rule that says foreign-language films can’t also compete in the Best Picture categories. That opens up a field that was in danger of getting very crowded after A Star Is Born, Bohemian Rhapsody, and Can You Ever Forgive Me? all decided to run as dramas. Of those, I think the Globes will smile on ASIB and BoRhap, two big, popular hits that may entrance voters who love it when someone puts on a show. And if freakin’ Deadpool can get a Globe nomination, I see no reason why Black Panther can’t as well.\n\nI can’t quite get a finger on BlacKkKlansman, which has only garnered a handful of nominations for Adam Driver. And if, as rumored, the HFPA doesn’t love Black Panther, a lower-key movie like Can You Ever Forgive Me? could sneak in.\n\nPredicted nominees: If Beale Street Could Talk, Black Panther, Bohemian Rhapsody, First Man, A Star Is Born\n\nBest Motion Picture, Musical or Comedy\n\nThe lack of Freddie Mercury and Jackson Maine means plenty of room for all manner of comedies here, from scabrous satires (Vice, The Favourite) to humane crowd-pleasers (Crazy Rich Asians, Green Book). But the heavyweight is probably Mary Poppins Returns, which suddenly has the singing-and-dancing lane all to itself. Can you imagine that?\n\nIt’s worth remembering that the Globes went for Lady Bird in a major way last year, handing Greta Gerwig’s dramedy four nods. Will the similarly warm-hearted Eighth Grade follow in its footsteps, or those of The Big Sick, another summer comedy that got blanked at the Globes?\n\nPredicted nominees: Crazy Rich Asians, The Favourite, Green Book, Mary Poppins Returns, Vice\n\nBest Performance by an Actress in a Motion Picture, Drama\n\nIn Glenn Close, Lady Gaga, and Melissa McCarthy, this category contains three of the four women thought to be leading the Oscar race. The other two spots are up for grabs: Will it be Ben Is Back’s Julia Roberts, Destroyer’s Nicole Kidman, Widows’ Viola Davis, Roma’s Yalitza Aparicio, or — be still my heart — Natalie Portman’s Noo Yawk Pop Stah in Vox Lux? I have the Globes going for Aparicio and Roberts, getting both newcomer cred and someone super famous who can sit at the front table. (Voters do love Kidman, but I think she’s stronger in Best Supporting Actress.)\n\nPredicted nominees: Yalitza Aparicio (Roma), Glenn Close (The Wife), Lady Gaga (A Star Is Born), Melissa McCarthy (Can You Ever Forgive Me?), Julia Roberts (Ben Is Back)\n\nBest Performance by an Actress in a Motion Picture, Musical or Comedy\n\nEmily Blunt and Olivia Colman face off in a battle of stern British women who yell at children. Further down the ballot, things get a little interesting, as voters have the opportunity to highlight a selection of movies that have been slightly outside the mainstream awards conversation, including Tully and Crazy Rich Asians. Kathryn Hahn could make it in if the HFPA goes for Private Life in a big way. Or, to take things in an even indier direction, what about Regina Hall of Support the Girls?\n\nPredicted nominees: Emily Blunt (Mary Poppins Returns), Olivia Colman (The Favourite), Elsie Fisher (Eighth Grade), Charlize Theron (Tully), Constance Wu (Crazy Rich Asians)\n\nBest Performance by an Actor in a Motion Picture, Drama\n\nTwo musicians — one deep-voiced and fictional; the other real, with God- and tooth-given range — lead the way here, with Ethan Hawke riding a wave of wins from critics’ ceremonies to a nomination of his own. And though First Man has had an underwhelming reception so far, I don’t think the HFPA will be able to resist the gravitational pull of Ryan Gosling, a winner two years ago. Steve Carell’s odds might be longer, but it’s worth noting that the Globes have generally not passed up a chance to reward the actor when he’s in “please gimme an Oscar” mode.\n\nThe Globes have a track record of appreciating Julian Schnabel, a Best Director winner for The Diving Bell and the Butterfly, so despite the fallow reception for At Eternity’s Gate, two-time nominee Willem Dafoe could wind up joining the HFPA’s starry night.\n\nPredicted nominees: Steve Carell (Beautiful Boy), Bradley Cooper (A Star Is Born), Ryan Gosling (First Man), Ethan Hawke (First Reformed), Rami Malek (Bohemian Rhapsody)\n\nBest Performance by an Actor in a Motion Picture, Musical or Comedy\n\nPaul Giamatti has been submitting himself in Supporting Actor for Private Life, but the Globes overruled him and bumped him up to the main category. A sign that it likes the movie enough to care where it places? I don’t think the Globes will pass up the chance to honor Robert Redford for what the actor says is his final film role. And Ryan Reynolds scoring a second nomination for the Deadpool franchise is just the kind of crazy you can expect from the Globes.\n\nIf the Globes go Poppins-crazy, Lin-Manuel Miranda could tag along with a nomination here. And Carell may sneak in here for Welcome to Marwen instead.\n\nPredicted nominees: Christian Bale (Vice), Paul Giamatti (Private Life), Viggo Mortensen (Green Book), Robert Redford (The Old Man & the Gun), Ryan Reynolds (Deadpool 2)\n\nBest Performance by an Actor in a Supporting Role in a Motion Picture\n\nThis race seems to have narrowed down to a top four of Mahershala Ali, Timothée Chalamet, Sam Elliott, and Richard E. Grant. Who will nab the final spot? I’m going with last year’s winner Sam Rockwell, whose gonzo George W. Bush impression in Vice seems on the HFPA’s wavelength. BlacKkKlansman’s Adam Driver and Black Panther’s Michael B. Jordan are both orbiting this category as well, but neither has gotten much love from the Globes in the past: Driver was never nominated for Girls, while Jordan was snubbed for the first Creed three years ago. Will this be the year it turns around for them?\n\nPredicted nominees: Mahershala Ali (Green Book), Timothée Chalamet (Beautiful Boy), Sam Elliott (A Star Is Born), Richard E. Grant (Can You Ever Forgive Me?), Sam Rockwell (Vice)\n\nBest Performance by an Actress in a Supporting Role in a Motion Picture\n\nThis category offers a nice test case of whether all three Favourite actresses can score nominations. I think the HFPA might spread the wealth around, preferring instead someone like Boy Erased’s Nicole Kidman, a Globes fave. (She’s been nominated 12 times, with four wins.) And I don’t think it’ll overlook Regina King, who’s been taking home this trophy at every ceremony so far, or Claire Foy, a past Globe winner for The Crown.\n\nBut voters do like Rachel Weisz, having thrown her a nomination for The Deep Blue Sea (not that one) after her win for Constant Gardener. And a nod for Crazy Rich Asians’ Michelle Yeoh would be fun.\n\nPredicted nominees: Amy Adams (Vice), Claire Foy (First Man), Nicole Kidman (Boy Erased), Regina King (If Beale Street Could Talk), Emma Stone (The Favourite)\n\nBest Director, Motion Picture\n\nOnly two of the Globes’ directing nominees made it into Oscar’s final five in 2018; looking at the three men the HFPA preferred — Steven Spielberg, Ridley Scott, and Martin McDonagh — offers a hint at its taste. It likes well-respected white guys! That’s why I see the Globes this year going with its favorite wunderkind Damien Chazelle, as well as Peter Farrelly, a comedy director going (slightly) serious, and Rob Marshall — because musicals.\n\nIf you find that you can easily recall last year’s directing category at the Globes, that’s probably because Natalie Portman chided the Globes onstage for its all-male slate. If voters took her words to heart, honoring Marielle Heller’s nuanced work on Can You Ever Forgive Me? offers a chance for a course correction. Barry Jenkins probably has a better shot at an Oscar nomination (though he did get a Globe nom for Moonlight), while a Spike Lee nod for BlacKkKlansman could seriously boost his fortunes. Adam McKay for Vice is also a possibility, but he did get passed over in this category for The Big Short, which people seem to like better than Vice.\n\nPredicted nominees: Alfonso Cuarón (Roma), Bradley Cooper (A Star Is Born), Peter Farrelly (Green Book), Rob Marshall (Mary Poppins Returns), Yorgos Lanthimos (The Favourite)", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/12/04/04-golden-globes-noms-predix.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/12/04/04-golden-globes-noms-predix.w700.h467.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/04/04-golden-globes-noms-predix.w1200.h630.jpg", "keywords": [], "authors": ["Jen Chaney", "Nate Jones"], "canonical_link": "https://www.vulture.com/2018/12/golden-globes-2019-predictions-for-nominations-tv-and-film.html", "title": "Which TV Shows and Movies Will Be Nominated for the 2019 Golden Globes?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Which TV Shows and Movies Will Be Nominated for the 2019 Golden Globes?", "url": "https://www.vulture.com/2018/12/golden-globes-2019-predictions-for-nominations-tv-and-film.html", "description": "Vulture’s picks in all major categories.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/04/04-golden-globes-noms-predix.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "What Will Get Nominated at the Golden Globes This Year?", "description": "Vulture’s picks in all major categories.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/12/04/04-golden-globes-noms-predix.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@chaneyj", "site": "@vulture"}, "article": {"published_time": "2018-12-04T15:43:31.300-05:00", "tag": "2019 golden globes, golden globes 2019, awards, movies, tv, vulture homepage lede, golden globes", "publisher": "https://www.facebook.com/Vulture"}, "description": "Vulture’s Golden Globes 2019 predictions cover all the nominations in the major categories for TV and movies.", "sailthru.tags": "2019 golden globes, golden globes 2019, awards, movies, tv, vulture homepage lede, golden globes", "author": "Jen Chaney, Nate Jones", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1543956211.3, "source": "https://www.vulture.com", "summary": ""}