{"url": "www.thehollywoodgossip.com/2017/09/kendall-jenner-banned-from-clippers-games-due-to-blake-griffin-r/", "text": "Though they haven't made an official announcement yet, it's pretty clear Kendall Jenner and Blake Griffin are dating.\n\nNo one knows exactly when the relationship started, but it seems that Kendall and Blake started hooking up sometime over the summer.\n\nWhich means Kendall won't get to make her big courtside debut at the Staples Center until the start of the 2017-18 NBA season.\n\nIt would be a big moment for the 21-year-old model, as even a regular season game would mean more eyes on her than any fashion show or episode of Keeping Up With the Kardashians.\n\nUnfortunately for Kendall, it seems the Clippers front office is trying to stop her from shining.\n\nSources tell Radar Online that Griffin has been strongly encouraged to not invite Kendall to any home games, as his bosses fear she would serve as a distraction.\n\nGriffin's coaches have reportedly “warned that his new relationship with Kendall better not affect his form this season.\"\n\n“He’s not telling anyone yet whether they’re actually together, but Clippers bosses have told him that regardless, she’s not welcome to crash their locker room and distract everyone with the Kardashian circus,” says one insider.\n\n“They saw what happened to [former Clipper] Lamar Odom when he was with Khloe [Kardashian] and they are not having that from their marquee player.”\n\nThe source adds that Griffin's management team is concerned that a public relationship with Kendall might affect Blake's image as a down-to-earth nice guy.\n\nEspecially since his longtime, on-again, off-again girlfriend, Brynn Cameron, is so well-liked in the community.\n\n“Not to mention everyone feels sorry for his longtime partner Brynn, who everyone knows and loves” the informant says.\n\n“They can’t imagine how she must be feeling right now having the father of her children linked to a Kardashian.”\n\nBut whether his team likes it or not, it seems Blake and Kendall are definitely an item.\n\nE! News reports that the pair was seen dining at LA hot spot Craig's earlier this week.\n\n\"It was definitely more than just a friendly outing because the girls were seated close to their men.,\" says one witness.\n\nWhile Blake and Kendall were with another couple, onlookers say there was no mistaking the chemistry between them.\n\n\"You could tell Blake was more into Kendall by the way he was staring and smiling at her. He looked very into her,\" the source adds.\n\nWell, it sounds like Kendall might want to enjoy being the center of Blake's attention while she can.\n\nTip-off is right around the corner, and she's apparently persona non-grata at the games.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vPt4DVGa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1504176302/kendall-jenner-sizzles.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vPt4DVGa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1504176302/kendall-jenner-sizzles.jpg", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/09/kendall-jenner-banned-from-clippers-games-due-to-blake-griffin-r/", "title": "Kendall Jenner: Banned From Clippers Games Due to Blake Griffin Relationship?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/09/kendall-jenner-banned-from-clippers-games-due-to-blake-griffin-r/", "title": "Kendall Jenner: Banned From Clippers Games Due to Blake Griffin Relationship?", "description": "Kendall Jenner is dating from Blake Griffin. But apparently, she won't be watching him play for the Clippers.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--PiyNof8E--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1392050369/kendall-jenner-in-w.png", "type": "image/png", "width": 472, "height": 612}}, "article": {"published_time": "2017-09-01T11:52:05-04:00", "modified_time": "2017-09-01T11:56:12-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kendall Jenner: Banned From Clippers Games Due to Blake Griffin Relationship?", "description": "Kendall Jenner is dating from Blake Griffin. But apparently, she won't be watching him play for the Clippers.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--vPt4DVGa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1504176302/kendall-jenner-sizzles.jpg"}}, "description": "Kendall Jenner is dating from Blake Griffin. But apparently, she won't be watching him play for the Clippers."}, "movies": [], "publish_date": 1504281125.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}