{"url": "https://www.goodhousekeeping.com/life/entertainment/a24739440/theresa-larry-caputo-reunite-long-island-medium/", "text": "Long Island Medium star Theresa Caputo saw her ex, Larry, for the first time in months.\n\nTheir reunion was filmed for the TLC reality show.\n\nThe two said they look back at their decades together fondly and still respect each other.\n\nTheresa and Larry Caputo met in person for the first time in nine months on Monday night’s Long Island Medium. The two are going through a divorce, but have maintained a positive, friendly relationship despite the split. And that was clear when they reminisced about the good times in Los Angeles.\n\nBefore they met, Larry opened up about his new life in California, and said moving away helped him distance himself from the stress of his life. He was filmed working out in the gym, where a new focus on his health has led to a whole new physique. “I’ve worked on myself, and I’ve realized that this is a new chapter in my life and to embrace it and to make the best of it,” he said.\n\nHe told his friend Kejo what he wanted out of meeting Theresa. “I know there are some things that I want to say and need to tell her,” he said. “She’s been a part of my life for so long that I just want to know how she’s doing, and I’m sure she’d like to know how I’m doing. And I want to tell her how I’m doing.”\n\nThe two sat down at a restaurant in Santa Monica, California to talk about the year they had lived on separate coasts. They discussed their children, their parents, and how they both look back on their decades together fondly despite how things ended.\n\nLarry wanted to clear the air about why he moved to California, but Theresa said she understood. “It seems like a long time, and what can I tell you? It’s been an adjustment,” Larry said. “And I miss everybody. I don’t want you to think that I just up and left and ran away.”\n\n“That’s the thing, Larry, it just wasn’t working,” Theresa said. “Things were so tense between us in the end, and I feel like as hard and as difficult it was for us to separate, we could have stayed and things could have went horrifically wrong, and we might not be sitting here.”\n\n\n\nIn the end, the conversation was friendly and heartfelt, and Theresa later said it “set the tone” for when they meet in the future. “I’ve had a lot of time to reflect on everything, and I just want to thank you for all our wonderful years. Because they were,” Larry said. “I helped you grow, and you helped me grow, and you helped me be the person I am today. I’m proud of you and I’m proud to have been a part of your success.”\n\nAt the end of the day Larry and I will always Love and Respect each other and will always be in each other’s lives That will never change Thank you all for watching ❌⭕️❌⭕️ #LongIslandMedium — Theresa Caputo (@Theresacaputo) November 6, 2018\n\n“You still are,” Theresa said. “We have 33 years together, you just can’t dismiss that, and I wouldn’t want to. At the end of the day, no matter what, we can continue as a unit for our children as role models.”", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresacaputoextra-939802108-1525798628.jpg?crop=1xw:0.75xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "keywords": [], "authors": ["Megan Friedman"], "canonical_link": "https://www.goodhousekeeping.com/life/entertainment/a24739440/theresa-larry-caputo-reunite-long-island-medium/", "title": "Theresa and Larry Caputo Discussed Separation and Divorce on ‘Long Island Medium’", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Good Housekeeping", "title": "Theresa Caputo and Larry Had an Extremely Emotional Reunion on ‘Long Island Medium’", "description": "The two hadn't seen each other in months.", "url": "https://www.goodhousekeeping.com/life/entertainment/a24739440/theresa-larry-caputo-reunite-long-island-medium/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 119423528138309, "pages": 40241492597}, "article": {"publisher": "https://www.facebook.com/GOODHOUSEKEEPING", "modified_time": "2018-11-06 10:09:13", "published_time": "2018-11-06 05:18:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@goodhousemag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=1.00xw:0.890xh;0,0.0482xh&resize=640:*"}, "google-site-verification": "Cyrrih2f3Dh884Dysa4Fuafe2UewzpbR6gnQipgICss", "title": "Theresa and Larry Caputo Discussed Separation and Divorce on  ‘Long Island Medium’", "description": "\"Long Island Medium\" star Theresa Caputo saw her ex, Larry, for the first time in months. Their reunion was filmed for the TLC reality show. The two said they look back at their decades together fondly and still respect each other.", "keywords": "larry caputo, long island medium, theresa caputo, tlc, theresa caputo divorce, theresa caputo separated, larry caputo", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=0.383xw:0.677xh;0.0513xw,0.0453xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Life,life,entertainment,long island medium,larry caputo,theresa caputo,tlc", "sailthru.date": "2018-11-06T17:18:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=1.00xw:0.890xh;0,0.0482xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/theresa-larry-caputo-1541523514.png?crop=0.383xw:0.677xh;0.0513xw,0.0453xh", "sailthru.socialtitle": "Theresa Caputo and Larry Had an Extremely Emotional Reunion on ‘Long Island Medium’", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1541452680.0, "source": "https://www.goodhousekeeping.com", "summary": ""}