{"url": "https://variety.com/2018/tv/news/this-is-us-dan-fogelman-emmy-nominations-season-3-1202872412/", "text": "“This Is Us” solidified its stance as both an audience favorite and an awards contender, grabbing eight nominations for its sophomore season, including best drama and lead actor for its leading men, Sterling K. Brown (the reigning champ) and Milo Ventimiglia.\n\n“This is what really matters,” joked series creator and executive producer Dan Fogelman, in an interview with Variety. “This is the stuff. Not family, not health — it’s Emmy nominations.”\n\nBut in all seriousness, Fogelman says he’s “thrilled” to be part of the awards conversation — and to be representing for broadcast, as the lone network contender in the drama race. “The goal when I sat down was to try and make something that was high quality while at the same time being accessible to regular people and not be so kind of art house, avant garde or dark that people could not access the show. So to be popular and well-regarded by fancy people is exciting because it means we’re threading a very fine needle.”\n\nHere, he tells Variety what’s in store for season three (which is now in production), his plan for the series finale, and who he’ll be rooting for on Emmy night.\n\nWhy do you think the show is resonating so much?\n\nI hate to break it down to a bare minimum. I think people really love the actors and I think they really love the way the actors inhabit the characters. So we don’t have, necessarily, plot lines that drive people to our television show. I think there’s a warmth to it and a tone to it and a melancholy optimism to it that obviously draws people in. But I really do think it’s these actors who are doing something that is very, very hard to do, which is they are super fun to look at while being incredibly talented actors while also being incredibly charming and funny and accessible. And so I think people turn on their television at 9:00 on Tuesday and see versions of their lives and their families and themselves. I think it’s the actors who seem to be getting it done for us.\n\nSeveral of your actors were nominated — including Sterling and Milo, as well as guest actors Ron Cephas Jones and Gerald McRaney. But Mandy Moore, Chrissy Metz and Justin Hartley were overlooked. How do you assess the situation with the acting races?\n\nI don’t understand how the whole thing works. It’s an interesting thing because when we set out to do this show, I almost never would have thought we would have been able to be allowed into this fancy conversation. But then once you’re there, you’re going, how can Mandy and Justin and Chrissy not be nominated for what they did this season? And you get sucked in a little bit. You go real quick from being grateful to being disappointed for the ones that you didn’t get. But I think our group is close enough that collectively we just feel that when any individual gets the nomination, they’re representing the larger whole. And we’re not just saying it like in a platitude kind of way. The show gets nominated. They won a SAG award last year against all these other fancy cable shows. That’s exciting stuff. So for us that’s the win. We’ve got 20 million people a week watching the show, the cast can’t walk down the street, and famous directors and writers are calling me about actors who they didn’t know a couple of years ago. And so it’s all really, really exciting.\n\nGiven the success of the show, are you surprised not to see more shows trying to copy your formula? Has broadcast learned anything from your success?\n\nI don’t think that’s how television in any form of writing or producing really works. Our show is very hard to do. It’s deceptively hard. And so, just because you’re trying to do something with emotion or multiple characters doesn’t mean it’s that simple. When we made this show, one of the things people would say was, “I liked the script but these shows don’t work. They don’t draw in mass audiences, they don’t get high ratings.” And we did it anyway. And so I’m a believer that when something hits, it can be good to go in the complete opposite direction because that’s why something hits, it fills a void. It’s different from what people have been getting fed. So my opinion is hit them where they are as opposed to just trying to do something. What would be nice is if this show’s popularity allowed people to live in this kind of dramedy space a little bit more. Not because they’re being copycats but because its success proved that there’s an appetite for it. That would be an exciting thing for me as a person who loves that s—, you know?\n\nWhen you look back over the course of the season, what moment are you proudest of?\n\nI have a few. We did an 11-minute family therapy scene in the middle of the season last year where the three siblings and Mandy as their matriarch were going back and forth at each other. Just watching the way our writers wrote that and that way the actors performed it I was like, ‘Wow, we’re really doing something here.’\n\nHow does that impact you going into season three? How did you avoid that sophomore slump?\n\nI’m surrounded by people who take this show and their job and their work very seriously and they’re very good at it. The world is cynical and the Internet has turned into this vicious cynical place. I know the show’s not going to dip in quality because we’re not going to allow it to happen. If you liked the show for two seasons, you’re going to like it now. We have nothing left to prove for ourselves now. Now we want to sit down and just make a bunch more great episodes of television and then get out while we’re on top and while we’re still feeling good before it all goes to s— and we’ve overstayed our welcome. We’re not gonna stick around forever. Our show has some scope and some size to it and we have a set story we set out to tell with an ending and we’re not going to stretch it just to make more money or continue more seasons with more ratings. It’s just not what we’re going to do on this one.\n\nDo you have that end game in mind?\n\nI do. In some ways we’ve shot some of it already. In my mind’s eye I know what that episode is and how many episodes we kind of roughly have before then and seasons. We know where we’re going and that’s why I’m not really worried about slumps. We know what our storylines are, we know what our arcs are, we know how we’re going to kill ourselves to execute. We go through a process here where a script gets written, whether it’s myself writing it or one of our writers, and we sit in a room and we beat it up and we criticize and then we rewrite and we work it and we work it and we work it and we do the same thing with our cuts and our edits and we don’t stop until we feel we’ve got something that we’re really, really proud of. And as long as we continue that process, I don’t see why we should take a step backwards.\n\nAre there things that you want to do with the third season that you haven’t gotten to do yet?\n\nI think the third season we’re going to be doing a lot of stuff that we haven’t gotten to do yet because you know, the end of our second season was a bit of a chapter closing and new chapters opening and that was the point of our throw forward into the future, but also why we ended at a wedding where the family is collectively taking a breath and saying they’re going to take a breath and try and move past these things they’ve been holding onto. And so what’s really exciting about the third season is we continue these same exact characters we know in their storylines, but there’s new chapters for everybody and so it’s not like starting over, but it’s like we’re embarking on some new plotlines for everybody that go to some issues that people are going to really attach to and have access points to and others will find that in other storylines. But there’s a lot of new stories coming everyone’s way, which is exciting for us.\n\nHow are you feeling about the third season?\n\nIt feels really strong. We’re doing some really ambitious stuff. Our first episode back is our past storyline which is basically the first date, the first night following their meeting that Jack and Rebecca ever have together. We’re really into early, early Jack and Rebecca incarnations, origin story, and then we’re doing stuff with Vietnam. I just wrote an early episode of the series. It’s a standalone Vietnam episode about Jack’s story, and I wrote it with Tim O’Brien who is our foremost author on Vietnam, so we’re doing really cool ambitious stuff. And then we also have really relatable human stories for Beth and Randall on fertility and Kate and Kevin, and so I’m really excited about what we’re doing. I’m as excited as I’ve been and more than our first two seasons.\n\nIt sounds like you’re going to deliver on all those promises of the flash forward in the season 2 finale.\n\nThe future storyline is not going to play a big part in the season, but it’s a framing device until we get the answers. We’re not going to bring it all the way to the end of the season. I think it will be answered much sooner than that, like the midway section.\n\nIs there a nomination other than your own that you’re excited about?\n\nJudd Apatow’s documentary on Garry Shandling was the best thing I’ve seen on a screen this year, I found it incredibly interesting and moving and smart. I found it profound and complicated and moving. I loved it. And anything with “Game of Thrones” is always like a win for me. The first year we got nominated for everything, “Game of Thrones” wasn’t eligible. And so to be able to go to the [awards show] this year along with “Game of Thrones,” it will be like being an eight-year-old boy and seeing like your favorite superhero dressed on Hollywood Boulevard for me. Like I don’t know what I’m going to do with myself when they’re all there together.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/02/this-is-us-tv-show-nbc.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fthis-is-us-dan-fogelman-emmy-nominations-season-3-1202872412%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202872412&comment_count=3", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/02/this-is-us-tv-show-nbc.jpg?w=1000", "keywords": [], "authors": ["Debra Birnbaum"], "canonical_link": "https://variety.com/2018/tv/news/this-is-us-dan-fogelman-emmy-nominations-season-3-1202872412/", "title": "‘This Is Us’ Boss on Emmy Noms and Snubs, Season 3’s ‘New Chapters,’ the Series Finale", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"This Is Us\" boss Dan Fogelman on what's in store for season three, his plan for the series finale, and who he'll be rooting for on Emmy night.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202872412, "author": "Debra Birnbaum", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-12T19:36:34"}, "pmc-tag": "Dan Fogelman,Emmys,This Is Us", "title": "‘This Is Us’ Boss on Emmy Noms and Snubs, Season 3’s ‘New Chapters,’ the Series Finale", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘This Is Us’ Boss on Emmy Noms and Snubs, Season 3’s ‘New Chapters,’ the Series Finale", "url": "https://variety.com/2018/tv/news/this-is-us-dan-fogelman-emmy-nominations-season-3-1202872412/", "description": "“This Is Us” solidified its stance as both an audience favorite and an awards contender, grabbing eight nominations for its sophomore season, including best drama and lead actor for its…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/02/this-is-us-tv-show-nbc.jpg?w=1000", "width": 1000, "height": 562, "alt": "This is Us TV Show NBC"}, "locale": "en_US"}, "article": {"published_time": "2018-07-13T02:36:34+00:00", "modified_time": "2018-07-13T14:04:47+00:00"}, "twitter": {"creator": "@debrabirnbaum", "site": "@variety", "text": {"title": "‘This Is Us’ Boss on Emmy Noms and Snubs, Season 3’s ‘New Chapters,’ the Series Finale"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/02/this-is-us-tv-show-nbc.jpg?w=1000", "alt": "This is Us TV Show NBC"}, "card": "summary_large_image", "title": "‘This Is Us’ Boss on Emmy Noms and Snubs, Season 3’s ‘New Chapters,’ the Series Finale", "description": "\"This Is Us\" boss Dan Fogelman on what's in store for season three, his plan for the series finale, and who he'll be rooting for on Emmy night."}, "author": "Debra Birnbaum", "content_type": "Article", "post_id": 1202872412, "title": "'This Is Us' Boss on Emmy Noms and Snubs, Season 3's 'New Chapters,' the Series Finale", "published_at": "2018-07-12 19:36:34", "image": "https://pmcvariety.files.wordpress.com/2017/02/this-is-us-tv-show-nbc.jpg?w=1000", "comment_count": 3, "tags": "This Is Us", "topics": "News", "appeared_in_print": "No", "body": "\"This Is Us\" solidified its stance as both an audience favorite and an awards contender, grabbing eight nominations for its sophomore season, including best drama and lead actor for its leading men, Sterling K. Brown (the reigning champ) and Milo Ventimiglia.\r\n\r\n\"This is what really matters,\" joked series creator and executive producer Dan Fogelman, in an interview with Variety. \"This is the stuff. Not family, not health — it's Emmy nominations.\"\r\n\r\nBut in all seriousness, Fogelman says he's \"thrilled\" to be part of the awards conversation — and to be representing for broadcast, as the lone network contender in the drama race. \"The goal when I sat down was to try and make something that was high quality while at the same time being accessible to regular people and not be so kind of art house, avant garde or dark that people could not access the show. So to be popular and well-regarded by fancy people is exciting because it means we're threading a very fine needle.\"\r\n\r\nHere, he tells Variety what's in store for season three (which is now in production), his plan for the series finale, and who he'll be rooting for on Emmy night.\r\n\r\nWhy do you think the show is resonating so much?\r\n\r\nI hate to break it down to a bare minimum. I think people really love the actors and I think they really love the way the actors inhabit the characters. So we don't have, necessarily, plot lines that drive people to our television show. I think there's a warmth to it and a tone to it and a melancholy optimism to it that obviously draws people in. But I really do think it's these actors who are doing something that is very, very hard to do, which is they are super fun to look at while being incredibly talented actors while also being incredibly charming and funny and accessible. And so I think people turn on their television at 9:00 on Tuesday and see versions of their lives and their families and themselves. I think it's the actors who seem to be getting it done for us.\r\n\r\nSeveral of your actors were nominated — including Sterling and Milo, as well as guest actors Ron Cephas Jones and Gerald McRaney. But Mandy Moore, Chrissy Metz and Justin Hartley were overlooked. How do you assess the situation with the acting races?\r\n\r\nI don't understand how the whole thing works. It's an interesting thing because when we set out to do this show, I almost never would have thought we would have been able to be allowed into this fancy conversation. But then once you're there, you're going, how can Mandy and Justin and Chrissy not be nominated for what they did this season? And you get sucked in a little bit. You go real quick from being grateful to being disappointed for the ones that you didn't get. But I think our group is close enough that collectively we just feel that when any individual gets the nomination, they're representing the larger whole. And we're not just saying it like in a platitude kind of way. The show gets nominated. They won a SAG award last year against all these other fancy cable shows. That's exciting stuff. So for us that's the win. We've got 20 million people a week watching the show, the cast can't walk down the street, and famous directors and writers are calling me about actors who they didn't know a couple of years ago. And so it's all really, really exciting.\r\n\r\nGiven the success of the show, are you surprised not to see more shows trying to copy your formula? Has broadcast learned anything from your success?\r\n\r\nI don't think that's how television in any form of writing or producing really works. Our show is very hard to do. It's deceptively hard. And so, just because you're trying to do something with emotion or multiple characters doesn't mean it's that simple. When we made this show, one of the things people would say was, \"I liked the script but these shows don't work. They don't draw in mass audiences, they don't get high ratings.\" And we did it anyway. And so I'm a believer that when something hits, it can be good to go in the complete opposite direction because that's why something hits, it fills a void. It's different from what people have been getting fed. So my opinion is hit them where they are as opposed to just trying to do something. What would be nice is if this show's popularity allowed people to live in this kind of dramedy space a little bit more. Not because they're being copycats but because its success proved that there's an appetite for it. That would be an exciting thing for me as a person who loves that s---, you know?\r\n\r\nWhen you look back over the course of the season, what moment are you proudest of? \r\n\r\nI have a few. We did an 11-minute family therapy scene in the middle of the season last year where the three siblings and Mandy as their matriarch were going back and forth at each other. Just watching the way our writers wrote that and that way the actors performed it I was like, 'Wow, we're really doing something here.'\r\n\r\nHow does that impact you going into season three? How did you avoid that sophomore slump? \r\n\r\nI'm surrounded by people who take this show and their job and their work very seriously and they're very good at it. The world is cynical and the Internet has turned into this vicious cynical place. I know the show's not going to dip in quality because we're not going to allow it to happen. If you liked the show for two seasons, you're going to like it now. We have nothing left to prove for ourselves now. Now we want to sit down and just make a bunch more great episodes of television and then get out while we're on top and while we're still feeling good before it all goes to s--- and we've overstayed our welcome. We're not gonna stick around forever. Our show has some scope and some size to it and we have a set story we set out to tell with an ending and we're not going to stretch it just to make more money or continue more seasons with more ratings. It's just not what we're going to do on this one.\r\n\r\nDo you have that end game in mind?\r\n\r\nI do. In some ways we've shot some of it already. In my mind's eye I know what that episode is and how many episodes we kind of roughly have before then and seasons. We know where we're going and that's why I'm not really worried about slumps. We know what our storylines are, we know what our arcs are, we know how we're going to kill ourselves to execute. We go through a process here where a script gets written, whether it's myself writing it or one of our writers, and we sit in a room and we beat it up and we criticize and then we rewrite and we work it and we work it and we work it and we do the same thing with our cuts and our edits and we don't stop until we feel we've got something that we're really, really proud of. And as long as we continue that process, I don't see why we should take a step backwards.\r\n\r\nAre there things that you want to do with the third season that you haven't gotten to do yet?\r\n\r\nI think the third season we're going to be doing a lot of stuff that we haven't gotten to do yet because you know, the end of our second season was a bit of a chapter closing and new chapters opening and that was the point of our throw forward into the future, but also why we ended at a wedding where the family is collectively taking a breath and saying they're going to take a breath and try and move past these things they've been holding onto. And so what's really exciting about the third season is we continue these same exact characters we know in their storylines, but there's new chapters for everybody and so it's not like starting over, but it's like we're embarking on some new plotlines for everybody that go to some issues that people are going to really attach to and have access points to and others will find that in other storylines. But there's a lot of new stories coming everyone's way, which is exciting for us.\r\n\r\nHow are you feeling about the third season?\r\n\r\nIt feels really strong. We're doing some really ambitious stuff. Our first episode back is our past storyline which is basically the first date, the first night following their meeting that Jack and Rebecca ever have together. We're really into early, early Jack and Rebecca incarnations, origin story, and then we're doing stuff with Vietnam. I just wrote an early episode of the series. It's a standalone Vietnam episode about Jack's story, and I wrote it with Tim O'Brien who is our foremost author on Vietnam, so we're doing really cool ambitious stuff. And then we also have really relatable human stories for Beth and Randall on fertility and Kate and Kevin, and so I'm really excited about what we're doing. I'm as excited as I've been and more than our first two seasons.\r\n\r\nIt sounds like you're going to deliver on all those promises of the flash forward in the season 2 finale.\r\n\r\nThe future storyline is not going to play a big part in the season, but it's a framing device until we get the answers. We're not going to bring it all the way to the end of the season. I think it will be answered much sooner than that, like the midway section.\r\n\r\nIs there a nomination other than your own that you're excited about? \r\n\r\nJudd Apatow’s documentary on Garry Shandling was the best thing I've seen on a screen this year, I found it incredibly interesting and moving and smart. I found it profound and complicated and moving. I loved it. And anything with \"Game of Thrones\" is always like a win for me. The first year we got nominated for everything, \"Game of Thrones\" wasn't eligible. And so to be able to go to the [awards show] this year along with \"Game of Thrones,\" it will be like being an eight-year-old boy and seeing like your favorite superhero dressed on Hollywood Boulevard for me. Like I don't know what I'm going to do with myself when they're all there together.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1531449394.0, "source": "https://variety.com", "summary": ""}