{"url": "www.thenational.ae/arts-culture/nicole-kidman-a-stay-at-home-sunday-girl-1.583953", "text": "Hard to believe, but even movie stars get lonely. Even harder to believe that Nicole Kidman once knew loneliness all too well.\n\nTo the public and the paparazzi who swarmed around her as she walked confidently along the red carpets, she was the glamorous, smiling film star who had it all. A gorgeous, Oscar-winning actress earning US$15 million (Dh55.1 million) a movie, she was the envy of women around the world.\n\nYet at the end of the evening she would go home to an empty house with no one to keep her company.\n\n\"When I was alone I became very isolated and felt very lonely and it was difficult to meet someone,\" she says, recalling the long, solitary nights. \"I realised you can have so many beautiful things around you and if you don't have someone in your life to share it with, it doesn't mean that much.\"\n\nThen Australian country singing star Keith Urban came into her life and everything changed.\n\n\"We were two lonely people who met at a time when we could open up to each other,\" she says. \"We were a mixture of frightened and brave. It's hard when you're alone. When you have someone else in your life it makes it a lot easier. I'm just so grateful I have someone to share the highs and also the lows.\"\n\nTheir two-year-old daughter, Sunday Rose, is so named not because she was born on a Sunday, as most people think, but as a reminder of the lonely days they both endured and the happiness they now share.\n\n\"When neither of us had partners Sunday was the day we most dreaded because if you're alone it's a very lonely day, and when we met we went from really dreading Sundays to loving Sundays because they were our days,\" she says. \"Nobody bothered us, nobody was calling and we could stay in bed and do what we wanted, so we just thought it was such a great name for our baby.\n\n\"The three of us just love to hang together; we love to cook together; we love to bathe together. I just love watching Sunday Rose blossom, and I have to say it's a beautiful thing to have a two-and-a-half year old baby at 43.\"\n\nWith their lives centred around Sunday Rose it takes a lot of persuasion for Kidman to leave their home in Tennessee, unless, of course, she is going back to their 100-acre cattle ranch in the New South Wales countryside.\n\nShe is on her way to Sydney with Urban and Sunday Rose to visit her parents when she stops briefly in Los Angeles to talk about her role in the low-budget movie Rabbit Hole that lured her away from home for a month and earned her a Golden Globe nomination for Best Actress in a drama.\n\n\"I believed in the subject matter and I like to champion stories that are hard to get made,\" says Kidman, who produces as well as stars in the story of a couple caught in a maze of memory, guilt, recrimination and rage following the death of their son in a road accident.\n\nHer role as Becca, the taciturn, grieving mother who reaches out to the teenager who caused the accident that killed her son has, she says, had an indelible effect on her.\n\n\"I haven't suffered through something like this but I understand the feeling of being so remote and so far from happiness that you can be driving in a car and you look into the other car and see somebody laughing and smiling and you think: 'Will I ever, ever know that again?'\n\n\"I'm at the time in my life where I am able to access the emotions and the intensity very quickly but I am not able to let go easily. A number of times during filming I would wake up in the night just sobbing and shaken to the bone. It's happened to me before but never three or four times over a period of six weeks, and I knew it was disturbing my subconscious.\n\n\"It's somewhere psychologically I never wanted to go, yet for some reason, here I am. I think that's me with a lot of my work. It takes a lot to get me there but when I'm there I'm completely absorbed.\"\n\nEven so, it took a push from her husband before she committed to the production. \"I have a really nice life down in Tennessee and I wasn't sure if I should do it because I didn't want to leave the baby. Keith was pushing me to leave the nest. He told me I should still do these things and shouldn't give up everything for the family.\n\n\"I'm so glad he did because every now and then we all need a bit of a push to get out of our comfort zone. I have a very comfortable life but I still have artistic ideas and things I want to express.\"\n\nDuring the intense 28 days of filming on location in Queens, New York, Kidman shared a house with her co-star, Aaron Eckhart, and the director, John Cameron Mitchell.\n\n\"Keith is very trusting and doesn't ask a lot of questions,\" she says with a smile. \"It was sort of weird sharing a house but the great thing was that it became our home so we jumped from not knowing each other very well to a very, very close, very intimate relationship, which is what you need when you're trying to create on screen a 10-year marriage that is falling apart.\"\n\nWe are talking in a suite at the Four Seasons Hotel and she is wearing a cream, silk shirt from the Australian designer Easton Pearson under a Prada cardigan with taupe Stella McCartney trousers and snakeskin Christian Louboutin pumps.\n\nUnlike most stars, Kidman freely admits she has tried Botox, but says: \"I didn't like the way my face looked with it so I don't use it now. I'm glad I've stopped because now I can move my forehead.\"\n\nShe laughs heartily and, as usual, she is friendly and open and talks willingly about the life and home she shares with Keith Urban in Nashville.\n\n\"It's a much quieter, slower way of life, which really suits me. You can be out in the countryside within 10 minutes and we've just planted an orchard. We have chickens and a vegetable patch and a berry patch and things that for me are just very simple and very good for Sunday Rose because there's enormous balance and it's a very quiet existence.\n\n\"Occasionally, there are some paparazzi but very rarely. We don't get followed and people are very friendly and polite. It's an easy, simple life there.\n\n\"On weekends we'll go to people's houses and everybody is around the piano and playing the guitar and singing. For me, the highlight is being around a whole different type of people. I've been around actors and filmmakers my whole life so now I love being around musicians and seeing what gets put into their music. I get to sit in the background and listen and watch and hum along and it's beautiful.\"\n\nShe and Urban, also 43, met at an Australian promotional party in Los Angeles in January 2005 and they quietly dated for several months before becoming engaged. They married in June the following year in Sydney but four months later her new husband checked into the Betty Ford Centre in California for 90 days of rehab for alcohol abuse.\n\nKidman stuck by him, visiting him regularly and encouraging him in his recovery. \"I learned an enormous amount having a relationship with someone in recovery,\" she says. \"We were in a bad, painful place and managed to step through it. I love him for his honesty and bravery. Simply put, he's a wonderful, wonderful man and I'm very lucky to have him.\"\n\nShe is lucky, too, to have her parents and her 39-year-old sister, Antonia, in Sydney, and they visit each other regularly.\n\n\"I think when you hit a certain age as sisters you really start to need each other on a deeper level,\" she says. \"When you have children and your life takes twists and turns is when you think: 'I'm so glad I have a sibling I'm close to.'\n\n\"There's only two of us in the family so Antonia and I are extremely close. We've been accused of being twin-like in our attachment to each other. We dream about being old ladies together.\" She laughs at the thought. \"I was at her house when I was back in Australia and she was out in the garden with a hat on and gardening gloves and her kids were running around and I said: 'My gosh, I hope to get to live to be 80 and see you still gardening and doing this.'\n\n\"I suddenly saw 20, 30, 40 years of the same image and it was so comforting. It's comforting having the love of a family member like that.\"\n\nOver the years Kidman has needed the love and support of her family as a refuge from gossips and rumour-mongers. Paparazzi stalked her throughout her 10-year marriage to Tom Cruise, and after their 2001 divorce she was linked with a number of men, including the actor Tobey Maguire, the rapper Q-Tip, the singer Lenny Kravitz, the New Zealand businessman Eric Watson and Elizabeth Hurley's ex-boyfriend Steve Bing.\n\nBut if her private life was something of a roller-coaster ride for a while, Kidman's professional career has been mainly a steady upwards climb, from the age of 15 when she made her first real impression as a frizzy-haired teenager in the Australian holiday film Bush Christmas. She made her international breakthrough co-starring with Sam Neill in the thriller Dead Calm and met Cruise when she was cast opposite him in Days of Thunder. They were married in December 1990. The two children she and Cruise adopted, Isabella, 18, and Connor, 15, live with Cruise in Los Angeles and, like their father, are Scientologists.\n\nKidman has demonstrated her willingness to explore her talent and experiment with a wide variety of roles, some in decidedly non-commercial projects, and with only a few exceptions her choices have proved to be both brave and interesting.\n\nShe showed off her strong singing voice in Moulin Rouge! and won a Best Actress Oscar for her portrayal of Virginia Woolf in The Hours. Her roles in The Human Stain, Cold Mountain and Lars von Trier's Dogville enhanced her reputation as a \"serious actress\". However, she has also had her share of box-office flops. The Stepford Wives, Bewitched, Birth and Fur were all missteps in an otherwise sparkling career.\n\nNow she looks back with satisfaction, musing: \"I suppose it's been a long career with many ebbs and flows and I've gone off course at times and then I've come back. But I would hope that through most of it I've championed complicated women and stories and tried to push myself. I've made huge mistakes and then at other times I've had massive successes.\n\n\"I think I can look back at a body of work that kind of defines my spirit. And I would hope that my spirit is pure.\"\n\nRabbit Hole awaits a release date in the UAE. Just Go With It, a romantic comedy in which Kidman co-stars with Adam Sandler and Jennifer Aniston, is due in cinemas here on February 10.", "images": ["http://www.thenational.ae/polopoly_fs/7.107!/file/placeholder.png", "http://www.thenational.ae/polopoly_fs/7.107!/file/prayer.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/4.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/3.png", "http://www.thenational.ae/image/policy:1.371:1548933886/logo-76.jpg?f=1x1&w=55&$p$f$w=7c74f24", "http://www.thenational.ae/polopoly_fs/3.378!/temperature.png", "http://www.thenational.ae/polopoly_fs/7.107!/file/temperature.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/1.png", "http://www.thenational.ae/polopoly_fs/3.378!/icons/sky/XL/2.png", "http://www.thenational.ae/polopoly_fs/3.381!/prayer.png", "https://www.thenational.ae/image/policy:1.583952:1499968403/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9", "http://www.thenational.ae/polopoly_fs/7.107!/file/footer-logo.svg", "http://www.thenational.ae/polopoly_fs/7.107!/file/homepage-logo.svg"], "top_img": "https://www.thenational.ae/image/policy:1.583952:1499968403/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9", "keywords": [], "authors": [], "canonical_link": "https://www.thenational.ae/arts-culture/nicole-kidman-a-stay-at-home-sunday-girl-1.583953", "title": "Nicole Kidman: a stay at home Sunday girl", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "creator": "Atex – http://www.atex.com", "application-name": "The National", "description": "Nicole Kidman is the superstar who has admitted that life at the top of the Hollywood tree can be lonely. With two films due for release, the Oscar-winning actress talks about how she has found contentment, and why her family comes first.", "news_keywords": "John Hiscock,MAGAZINE,ADM,ADM,Arts & Culture,Film,Arts & Culture,Film,Celebrities,Arts & Culture,Film,Film reviews,Celebrities,", "parsely-post-id": "1.583953", "google-site-verification": "zupZPvcJ4TjE2PUIBOr4ND8eWiJR95ArU4eLYC0FpCw", "og": {"title": "Nicole Kidman: a stay at home Sunday girl", "site_name": "The National", "url": "https://www.thenational.ae/arts-culture/nicole-kidman-a-stay-at-home-sunday-girl-1.583953", "description": "Nicole Kidman is the superstar who has admitted that life at the top of the Hollywood tree can be lonely. With two films due for release, the Oscar-winning actress talks about how she has found contentment, and why her family comes first.", "type": "article", "image": "https://www.thenational.ae/polopoly_fs/7.107!/file/logo_big.png"}, "apple-mobile-web-app-title": "The National", "msapplication-TileImage": "/polopoly_fs/7.107!/file/logo-144.jpg", "msapplication-TileColor": "#0095da", "apple-itunes-app": "app-id=1281497691, app-argument=https://www.thenational.ae/arts-culture/nicole-kidman-a-stay-at-home-sunday-girl-1.583953", "pocket-site-verification": "e213738e8509de340a044fefa896b8", "twitter": {"card": "summary_large_image", "site": "@TheNationalUAE", "title": "Nicole Kidman: a stay at home Sunday girl", "image": "https://www.thenational.ae/image/policy:1.583952:1499968403/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9"}}, "movies": [], "publish_date": null, "source": "http://www.thenational.ae", "summary": ""}