{"url": "https://www.glamour.com/story/thoroughbreds-friendship", "text": "“The only thing worse than being incompetent, or being unkind, or being evil, is being indecisive,” Amanda says, mockingly, to her childhood friend Lily in Thoroughbreds.\n\nOut this Friday, the movie follows Amanda (Olivia Cooke) and Lily (Anya Taylor-Joy) as they plot to kill Lily’s loathsome stepdad. The two were friends a young children but drifted apart as Lily sank into the prim, preppy, affluent Connecticut lifestyle that her rich stepdad afforded her. Amanda, meanwhile, fumbled down a much different path—after discovering she doesn’t feel emotions, she gruesomely kills her horse and is charged with animal cruelty. The girls reunite in high school when Amanda’s mom pays Lily to tutor her daughter. Soon they discover a newfound teenage rapport.\n\nAs their friendship grows, Amanda chips away at Lily and seduces her into the idea of killing her stepdad—and I couldn’t help but feel as though I’ve been there before. Not the murder plot, of course, but I think every woman can relate to this very specific type of adolescent friendship: a potentially dangerous relationship, one that is governed by the titillating power of sisterhood. I certainly remember being lured into one, and just as in Thoroughbreds, it rocked my world. Just like Lily and Amanda, by the time I got out I was a completely different person.\n\nI think every woman can relate to this very specific type of adolescent friendship: a potentially dangerous relationship.\n\nWhen I was 13, a girl named Abby* moved into my conservative hometown, and she was like nothing I’d ever seen before. She wore studded Hot Topic belts, shredded black jeans, midnight eyeliner, and stitched Misfists patches on her acid-wash denim jacket. She was a rock star, and she was magnetic. Thanks to our shared taste in music and sarcasm, we became instant friends. I was allured by her glib opinions on pop culture, her pierced septum, and her nihilistic outlook on relationships.\n\nIn Thoroughbreds, Amanda coaxes Lily into doing things she normally wouldn’t do. Bad things. But Amanda isn’t totally to blame; everything Lily does, she wanted to do—she just needed a little massaging, or a sliver of permission to follow through. Similarly, Abby opened my eyes to a world of new adventures, and with her permission, I dove headfirst with a cinderblock bound to my ankle into each one.\n\nAbby smoked cigarettes and, sometimes, weed. At first I was too scared to join. But then, one time in her room, while doodling edgy Sharpie drawings in our composition notebooks, she pulled an infinitesimal nugget out of a ball of aluminum foil. Our dumbasses nibbled at the weed, wondering if we’d get high just from eating it. I remember it tasted bad.\n\nOver time things got worse. Abby's group of friends were the type of kids who hung out in detention, a real-life Breakfast Club. Some were older—they drove mopeds and drank beer. They wore all black, cracked jokes about suicide, and worshipped Taking Back Sunday. Some were into pills and cocaine, which I had only seen in D.A.R.E. pamphlets. These teens were thrill-seekers, going cliff-jumping in restricted lakes, setting fires in the woods and chalking it up to pyromania, and pushing each other into sexual situations. We all thought we were beyond our years, vibrating with creative energy and misfiring it in berating our teachers, using fake AIM screen names to prank nerds, and daring each other to take it a step further. And we always did.\n\nAbby opened my eyes to a world of new adventures, and with her permission, I dove headfirst with a cinderblock bound to my ankle into each one.\n\nIn Thoroughbreds, Lily and Amanda’s friendship ends abruptly and it's absolutely final. They take things too far, and as a result, both their worlds are flipped upside down. Like them, Abby and I fumbled through the final moments of our friendship. One night she pushed me too far, and just like that, goading each other into the next fraught situation wasn’t fun anymore. All the danger and excitement caught up to me, and I crashed violently.\n\nAbby's dad went out of town, so we squatted in his empty house, a claustrophobic, scarcely furnished one-bedroom where the walls emanated thick cigarette smoke. We drank beer and smoked, played some of her dad’s old records, and cracked tipsy jokes about the popular girls, whom I was still friends with. She invited some guys I didn’t know, older ones from another town. One had graduated high school. His name was Dave* and his hair was so greasy it looked as is if it would drip onto his cigarette-holed hooded sweatshirt. Or maybe it wasn’t. Maybe I just remember it being that way because of how much he scared me. He was definitely too old to be around 13-year-olds and knew things we wouldn’t learn for years. In the corner of the room, Dave furtively exchanged drugs with our other friend, Mike*, who was my first boyfriend in middle school. Though we weren’t together at the time, I was scared for him.", "images": ["https://media.glamour.com/photos/5a9ebf36c0cda831d24f447d/16:9/w_1280,c_limit/thoroughbreds.jpg", "https://www.glamour.com/verso/static/glamour/assets/logo-header.aeb2e510354d524c42a87c5d0a97d0a73c5d7581.svg", "https://www.glamour.com/verso/static/glamour/assets/logo-reverse.b2ce20427c8d415381a18834c479e653848cc926.svg", "https://media.glamour.com/photos/5a9ebed9466922366a88299f/16:9/w_2560%2Cc_limit/thoroughbreds.jpg"], "top_img": "https://media.glamour.com/photos/5a9ebf36c0cda831d24f447d/16:9/w_1280,c_limit/thoroughbreds.jpg", "keywords": [], "authors": ["Jill Gutowitz", "Jill Gutowit"], "canonical_link": "https://www.glamour.com/story/thoroughbreds-friendship", "title": "Thoroughbreds and the Enduring Allure of the ‘Bad Friend’", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Jill Gutowitz", "copyright": "Copyright (c) Condé Nast 2020", "description": "Out this Friday, 'Thoroughbreds' follows Amanda (Olivia Cooke) and Lily (Anya Taylor-Joy) as they plot to kill Lily’s loathsome stepdad.", "id": "5a9e8ee7c0cda831d24f447b", "keywords": "movies,thoroughbreds,friends", "news_keywords": "movies,thoroughbreds,friends", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a9e8ee7c0cda831d24f447b", "parsely-metadata": "{\"description\":\"Out this Friday, 'Thoroughbreds' follows Amanda (Olivia Cooke) and Lily (Anya Taylor-Joy) as they plot to kill Lily’s loathsome stepdad.\",\"image-16-9\":\"https://media.glamour.com/photos/5a9ebed9466922366a88299f/16:9/w_1000,c_limit/thoroughbreds.jpg\",\"image-1-1\":\"https://media.glamour.com/photos/5a9ebed9466922366a88299f/1:1/w_1000,c_limit/thoroughbreds.jpg\"}", "og": {"description": "I think every woman can relate to this very specific type of friendship.", "image": "https://media.glamour.com/photos/5a9ebf36c0cda831d24f447d/16:9/w_1280,c_limit/thoroughbreds.jpg", "site_name": "Glamour", "title": "'Thoroughbreds' and the Enduring Allure of the Bad Friend", "type": "article", "url": "https://www.glamour.com/story/thoroughbreds-friendship"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@glamourmag", "description": "I think every woman can relate to this very specific type of friendship.", "domain": "https://www.glamour.com", "image": {"src": "https://media.glamour.com/photos/5a9ebf36c0cda831d24f447d/16:9/w_1280,c_limit/thoroughbreds.jpg?mbid=social_retweet"}, "site": "@glamourmag", "title": "'Thoroughbreds' and the Enduring Allure of the Bad Friend"}, "fb": {"app_id": 101358874221, "pages": 26815555478}}, "movies": [], "publish_date": null, "source": "https://www.glamour.com", "summary": ""}