{"url": "https://www.bustle.com/p/who-is-lele-pons-the-2018-teen-choice-awards-host-has-a-huge-following-10063763", "text": "Wax your surfboards, because the Teen Choice Awards are this Sunday, Aug. 12, at 8 p.m. ET on FOX. And while the ubiquitous Nick Cannon is hosting the ceremony, his co-host, Lele Pons, is a bit more under-the-radar. She's a Venezuelan-American comedian who garnered attention first on Vine and now YouTube, but there are still a bunch of people out there (anyone who's not a teenager, that is) who might be wondering who Lele Pons is and why she's hosting the Teen Choice Awards this year.\n\nBut first, what can readers expect from this year's ceremony? Avengers: Infinity War, Black Panther, and Star Wars: The Last Jedi lead the TCA movie nominations, while Cardi B and Selena Gomez are both up for four music awards, according to Entertainment Tonight. What's more, the co-host herself is nominated for three awards: Choice Female Web Star, Choice Comedy Web Star, and Choice YouTuber. And, per another Entertainment Tonight report, Bebe Rexha will perform \"I'm a Mess,\" her hit single.\n\nAs for Pons, this won't be the last time she plays hostess. The content creator is set to be the next host of La Voz... México — the Mexican version of The Voice. The next season of the singing competition show airs Oct. 14, per Variety. According to an interview she did with The Cut last year, Pons was born in Venezuela and moved to Miami with her parents when she was 5. \"LATINA AND PROUD,\" her Twitter bio reads, in part.\n\nSo how did she end up co-hosting the Teen Choice Awards? The 22-year-old Venezuelan-American actress first cut her teeth on Vine, and now has a widely popular YouTube account, which boasts over 10,000,000 subscribers. Pons is currently in the webseries Amigos, a Latino parody of Friends, alongside fellow YouTubers Rudy Mancuso, Hannah Stocking, Anwar Jibawi, Ana Marte, and Juanpa Zurita.\n\nSpeaking with Teen Vogue back in 2015, Pons explained that she got her first phone at 15, which was the inciting incident for her career. \"My best friend was like, 'Lele, you better start getting into social media because that's the next thing,'\" she recalled. \"I was always the last one on Facebook, Instagram — everything.\" However, she jumped on Vine at the first opportunity, where she soon racked up followers.\n\nBut despite her success as a comedian, she has bigger dreams. \"I always wanted to be a singer,\" she told Teen Vogue back in 2015. \"I was going to finish school and go to Berkley, and then Vine came out, and I felt like I could finally show people my talent.... It's honestly changed my life. I don't know where I would be right now without it.\" However, Pons also wants to direct. \"Acting first,\" she told The Cut in the same interview. \"It’s like Angelina Jolie. She acted, and then she directed a movie.\"\n\nNot to mention that the Internet personality has a healthy collection of side projects. In February 2017, she published the book Surviving High School, which she co-wrote with Melissa de la Cruz. What's more, Cover Girl announced in February 2017 that Pons would be coming onboard as a brand ambassador, per Just Jared. And she's even appeared in several music videos, including Camille Cabello's \"Havana\" and Anitta and J Balvin's song, \"Downtown.\" And Pons has also been in her own: \"Dicen,\" which she performs with singer Matt Hunter.\n\nMattHunterVEVO on YouTube\n\nAll of this leads up to Sunday night. Not only has Pons been nominated for several awards from the awards ceremony that she's hosting, but she's a darling on both social media and YouTube (she has 24.6m followers on Instagram!!). So it only makes sense that the TCAs would choose someone so widely recognized as co-host. Let's just hope Nick Cannon can keep up.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/7f8de711-e6d7-41da-9b99-1bdb99d96a9f-getty-1187273504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/ee5b8174-ed13-40e6-b2ba-0f42eb8f2fc4-getty-1189431708.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/8/9/9a708277-c847-43a1-be05-d47d42dcfd26-fangirls1-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/8/9/a30c3947-eb11-4e6a-a461-f2a0113772c7-getty-875092984.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/9/41994c86-7310-456a-93a7-f3fc388d343b-screen-shot-2020-04-09-at-55010-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/8/9/a30c3947-eb11-4e6a-a461-f2a0113772c7-getty-875092984.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/13/e8a28938-0e7b-47b1-9bb9-5ed4c3574904-154709_8569.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/8/9/a30c3947-eb11-4e6a-a461-f2a0113772c7-getty-875092984.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/who-is-lele-pons-the-2018-teen-choice-awards-host-has-a-huge-following-10063763", "title": "Who Is Lele Pons? The 2018 Teen Choice Awards Host Has A Huge Following", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/who-is-lele-pons-the-2018-teen-choice-awards-host-has-a-huge-following-10063763", "type": "article", "title": "This Hilarious YouTuber Is Co-Hosting the Teen Choice Awards This Year", "description": "Wax your surfboards, because the Teen Choice Awards are this Sunday, Aug. 12, at 8 p.m. ET on FOX. And while the ubiquitous Nick Cannon is hosting the ceremony, his co-host, Lele Pons, is a bit more under-the-radar. She's a Venezuelan-American…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/8/9/a30c3947-eb11-4e6a-a461-f2a0113772c7-getty-875092984.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Wax your surfboards, because the Teen Choice Awards are this Sunday, Aug. 12, at 8 p.m. ET on FOX. And while the ubiquitous Nick Cannon is hosting the ceremony, his co-host, Lele Pons, is a bit more under-the-radar. She's a Venezuelan-American…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}