{"url": "https://www.khou.com/article/news/entertainment-news/travis-scott-kylie-jenner-wrap-up-huge-weekend-in-houston/285-615728636", "text": "HOUSTON — It was a huge weekend for Missouri City native and superstar Travis Scott.\n\nHis inaugural Astroworld Festival was a complete success.\n\nHis other half, reality star Kylie Jenner, cashed in on her boyfriend’s visit to H-town by surprising some of her fans at a local beauty shop.\n\nHundreds of fans greeted Jenner as she arrived at the Ulta Beauty store near the Galleria to promote her make-up line.\n\nKarla Martinez, a die-hard fan said, “I have her notifications on Kylie Comestics. I saw they were coming to houston and we live all the way in Rosenberg so we made a drive.”\n\nHundreds of @KylieJenner fans gathered at @ultabeauty. Here she is taking a video after visiting the store. Her makeup, @kyliecosmetics, her the store today. Hear from fans and the impact she and her boyfriend @trvisXX are making in #Houston at 5:30 & 10. #khou11 pic.twitter.com/GyRFAGvA2x — David Gonzalez (@DavidGonzKHOU) November 18, 2018\n\nSome like Heather Ryder risked it all for a chance to see the star.\n\n“It’s all worth it,” Ryder said. “I canceled work. I was supposed to go in and work at three and I said, ‘I have to go. I have to go meet Kylie Jenner.’ I don’t care if I get fired.”\n\nFor those that don’t get the hype, Andrea Espin explains.\n\n“We’re just excited because it has never come to stores. It’s always online and it’s really hard to get them at times so for her to have them at Ulta, it’s really amazing for all of us.”\n\nJenner’s supporters say there’s a reason the 21-year-old is worth almost a billion dollars.\n\n“The cool thing about her, like I said, her lip kits that it comes with a lip liner and her full lipstick, it makes just the lips look a little like big in a way.\n\nJenner’s best friend and make-up collaborator Jordyn Woods said the love they receive is overwhelming.\n\nWoods said, “It’s just the internet comes to real life and you get to feel the love and see everyone in real life, it’s beautiful.”\n\nTravis Scott also wrapped an unforgettable weekend in Houston.\n\nHis sold out Astroworld Festival on Saturday received rave reviews, he opened an already popular Astroworld pop-up shop in Rice Village selling merchandise.\n\nOn Sunday, his acheivements were recognized by the city.\n\n“For I, Sylvester turner, mayor of the city of Houston hereby proudly proclaim November 18, 2018 as Astroworld Day/Travis Scott Day in the city of Houston.”\n\nScott dedicates his accomplishments to the city he loves.\n\n“I grew up here my whole life. I was inspired by Astroworld in 05 when they took it away,” Scott said. “It kind of took a big piece of my heart away. I didn’t have anywhere to go.”\n\nHe’s now a hometown hero giving the world a piece of Houston through his music.", "images": ["https://cdn.tegna-media.com/wbir/assets/khou-votenow-live-survey-352x52.jpg", "https://www.khou.com/Content/logos/dark/khou.png", "https://media.khou.com/assets/KHOU/images/615729045/615729045_1140x641.jpg", "https://cdn.tegna-media.com/wbir/assets/verify-352x52.jpg", "https://www.khou.com/content/logos/mobile/khou.png", "https://cdn.tegna-media.com/wbir/assets/coronavirus-facts-not-fear-352x52.jpg"], "top_img": "https://media.khou.com/assets/KHOU/images/615729045/615729045_1140x641.jpg", "keywords": [], "authors": ["Author", "David Gonzalez", "Published", "Pm Cst November", "Updated"], "canonical_link": "https://www.khou.com/article/news/entertainment-news/travis-scott-kylie-jenner-wrap-up-huge-weekend-in-houston/285-615728636", "title": "Travis Scott, Kylie Jenner wrap up huge weekend in Houston", "meta_data": {"viewport": "width=1170", "site": "khou.com", "fb": {"app_id": 1981419195445082}, "og": {"site_name": "KHOU", "locale": "en_US", "url": "https://www.khou.com/article/news/entertainment-news/travis-scott-kylie-jenner-wrap-up-huge-weekend-in-houston/285-615728636", "title": "Travis Scott, Kylie Jenner wrap up huge weekend in Houston", "description": "On Sunday, Mayor Sylvester Turner declared it \"Astroworld Day\" in Houston to recognize Scott and the debut of the Astroworld Festival.", "type": "article", "image": {"identifier": "https://media.khou.com/assets/KHOU/images/615729045/615729045_1140x641.jpg", "width": 1140, "height": 641}, "article": {"published_time": "11/19/2018 12:18:52 AM"}}, "description": "On Sunday, Mayor Sylvester Turner declared it \"Astroworld Day\" in Houston to recognize Scott and the debut of the Astroworld Festival.", "category": "news", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"title": "Travis Scott, Kylie Jenner wrap up huge weekend in Houston", "image": {"src": "https://media.khou.com/assets/KHOU/images/615729045/615729045_360x203.jpg"}, "card": "summary", "site": "KHOU", "description": "On Sunday, Mayor Sylvester Turner declared it \"Astroworld Day\" in Houston to recognize Scott and the debut of the Astroworld Festival.", "domain": "www.khou.com"}}, "movies": [], "publish_date": 1542557932.0, "source": "https://www.khou.com", "summary": ""}