{"url": "https://web.archive.org/web/20180414054648/http://onlypolitics.info:80/breaking-malia-obama-suspended-after-racist-anti-white-attack-goes-viral", "text": "BREAKING: Malia Obama SUSPENDED After Racist Anti-White Attack Goes Viral\n\nA few days ago, a student at Harvard leaked the contents of Malia Obama’s speech final. The topic? A World Without Whites. And now it may get Malia Obama suspended.\n\n“White people are so 1960’s. Sometimes the only thing that keeps me going is the fact that they will be blended out by the time I am 30,” a recording of Obama’s speech shared on Snapchat said. “Imagine a world without white people.” Obama was of course referring to the scientific belief that if whites continue to breed at low rates in America while others races continue to breed at current rates, white babies will be virtually nonexistent in our country by 2038.\n\nA post quoting Obama was shared more than 14,000 times with a reach of nearly 1 million Americans, which forced Harvard to take action.\n\n“This sort of attack against any race is uncalled for,” Harvard Dean Cain Markholder said in a statement Sunday. “Ms. Obama has been informed she is suspended pending an investigation into her statement.” But it gets worse for Obama — Markholder says that if a disciplinary board finds her guilty, she will “forfeit her grade for the exam” which is worth 47% of her grade according to one of the students who shared video of her racist hate speech-filled attack on whites.\n\nThe dean notes that punishment for racist attacks like this can lead to “expulsion,” but we’re sure that her dad will once again bail her out of trouble.", "images": ["https://web.archive.org/web/20180414054648im_/http://sstatic1.histats.com/0.gif?4038444&101", "https://web.archive.org/web/20180414054648im_/http://onlypolitics.info/wp-content/uploads/2018/03/icon.png", "https://web.archive.org/web/20180414054648im_/http://onlypolitics.info/wp-content/uploads/2018/03/logo.png", "https://web.archive.org/web/20180414054648im_/http://onlypolitics.info/wp-content/uploads/2018/04/malia-678x381.jpg"], "top_img": "https://web.archive.org/web/20180414054648im_/http://onlypolitics.info/wp-content/uploads/2018/03/icon.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180414054648/http://onlypolitics.info/breaking-malia-obama-suspended-after-racist-anti-white-attack-goes-viral/", "title": "BREAKING: Malia Obama SUSPENDED After Racist Anti-White Attack Goes Viral", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 4.9.4"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}