{"url": "www.latimes.com/world/la-fg-britain-royal-wedding-20180519-htmlstory.html", "text": "Until Meghan Markle came along, it’s unlikely that anyone would associate the words “royal wedding” with the phrase “ringing call for social justice.”\n\nBut that was the inescapable conclusion Saturday as Markle, a biracial, L.A.-bred American actress — glamorous and dewy-eyed, preternaturally composed — exchanged marriage vows with a sometimes visibly nervous Prince Harry , a veteran of the war in Afghanistan who is sixth in line to the British throne.\n\nYes, there were all the traditional trappings of royal nuptials in what may be the world’s most storied monarchy: the 19th century horse-drawn carriage, a sumptuous tiara dusted off for the occasion, the jewel-like Gothic cathedral contained within the turreted walls of medieval Windsor Castle, which has for centuries been a seat of British royalty.\n\nTo sighs of pleasure on the part of some royal-watchers, the wedding day saw some arcane mysteries revealed: The newlyweds’ titles would be the Duke and Duchess of Sussex, after word came down that Harry’s grandmother, Queen Elizabeth II , had bequeathed him a dukedom, as she did his elder brother upon his marriage.\n\nFull coverage: Prince Harry and Meghan Markle are wed amid pomp and pageantry at Windsor chapel »\n\nPrince Harry and Meghan Markle, now the Duke and Duchess of Sussex, leave St. George's Chapel at Windsor Castle after their May 19 wedding ceremony. Neil Hall / EPA / Shutterstock\n\nPhotos of the royal couple »\n\nAnd Harry was allowed to wear his ginger beard with his formal-dress military uniform — facial hair would otherwise be frowned upon — with the blessing of the queen. Other fashion-crucial news revolved around Meghan’s sleek silk boatneck gown: it was by the British designer Clare Waight Keller, for Givenchy.\n\nThere was plenty of fairy-tale romantic spark on plain view for a worldwide audience of millions to soak up eagerly: a sotto-voce “You look amazing” from the groom to his beloved at the altar, the pair hand-holding and gazing deeply into each other’s eyes as the ceremony progressed, the iconic kiss on the sun-dappled steps of the chapel, with the bride’s voluminous veil and long train draped just so.\n\nAs the day’s festivities shaded into twilight, the vibe shifted distinctly in the direction of Hollywood mystique, when a tuxedoed Harry squired Meghan — now clad in a bare-shouldered halter-type gown — to an evening reception in a classic Jaguar E-type all-electric convertible, with their wedding date as the license tag.\n\nA royal wedding TV spectacle where the new world met the old and showed a rethinking of the monarchy »\n\nThat was just one of the ways in which the couple signaled that theirs would be a more modern sort of royal union.\n\nIn marrying into the House of Windsor, Markle, a divorcee who is 36 to Harry’s 33, provided an invigorating jolt not only to the royal family, but to a Twitterverse that suddenly sat up and took notice, in what were the wee hours in much of America, that this was perhaps not a staid, standard-issue royal ceremonial occasion.\n\nThat realization took hold when the Most Rev. Michael Bruce Curry, the first African American to lead the Church of England’s American cousin, the Episcopal Church, stepped up to the pulpit to deliver a stirring wedding address probably unlike any ever heard within the chapel’s venerable walls.\n\nSpeaking in the classic cadences of African American preachers — and in fact specifically invoking the Rev. Martin Luther King Jr. — Curry turned a predictable paean to romantic love into a powerful call for justice and equality, and in doing so rendered it a pointed commentary for these highly fraught times, in both Britain and the United States.\n\nMeghan Markle arrives for her wedding to Prince Harry. WPA Pool / Getty Images\n\nMeghan Markle marries Prince Harry wearing a wedding dress designed by Givenchy's Clare Waight Keller »\n\n\"It's not just for and about a young couple, who we rejoice with; it's more than that,” he said, with the camera occasionally cutting away to quizzical reaction shots from some of the groom’s royal kin.\n\nCiting King’s faith in “the redemptive power of love,” Curry exhorted the weddinggoers and a world audience: “When love is the way, there’s plenty of room for all of God’s children. When love is the way, we actually treat each other — well, like we are actually family.”\n\nFrom the start of this particular love story, Harry seemed to have sought a life partner outside the normal range of expectations for a senior member of the royal family, even one very unlikely to ascend the throne. (As has been pointed out by many commentators, Harry would only become king if some cruel Game of Thrones-style fate befell not only his grandmother, the 92-year-old queen, and his father, 69-year-old Prince Charles , but also his elder brother William, 35, and William’s three small children, two of whom played a prominent and eye-meltingly adorable role in Saturday’s nuptials.)\n\nHarry dated a series of posh British blondes — at least two of whom were looking on as Saturday’s vows were recited, in a wholly modern nod to dealing respectfully and civilly with one’s exes — but wound up smitten by Markle, who came into his life via a mutual friend who thought they might just click.\n\nThey did.\n\nPhotos of the royal wedding bridal party »\n\nBut back to the ceremony, which went more or less as might be expected in its initial moments. Royal relatives, friends of the bride and groom and celebrities both British and American — Elton John , Oprah Winfrey, Serena Williams, Idris Elba, George and Amal Clooney, David and Victoria Beckham, cast members from Markle’s long-running TV drama “Suits” — mingled in a cocktail-party-without-the-cocktails milieu in the chapel nave.\n\nThe bride’s mother, Doria Ragland, a 61-year-old social worker and yoga teacher from Los Angeles, was ushered into the chapel after — in a break with tradition — accompanying her daughter by car to the castle from the nearby luxe hotel where they had spent the night.\n\nWomen wearing wedding dresses and signs for Prince Harry are part of the crowd for the royal wedding in Windsor, England, on May 19. Tom Nicholson / EPA/Shutterstock\n\nHarry arrived at the wedding chapel with his brother and best man, William, both of them resplendent in custom-tailored military formalwear from the Blues and Royals, a British cavalry regiment.\n\nThe sight of the two princes striding in tandem a short distance along a castle roadway brought back, for many Britons, a memory of two boys, 15 and just 12, walking 21 years ago behind the coffin of their mother, Princess Diana. Both Harry and William have spoken of their regret that Diana, who died at 36, did not live to see them grow to adulthood and meet their respective brides.\n\nDiana was indeed a ghostly presence at the wedding, but somewhat of an understated and wistful one, in light of child-of-divorce sensibilities that so often persist into adulthood.\n\nPrince Charles, whose 1996 split with Diana was drawn-out, cringemakingly public and highly acrimonious, stepped in at the bride’s request, on the eve of the wedding, to walk Markle down the aisle after her own father, Thomas Markle, bowed out. (His decision followed an ambiguous mix of health issues and a tabloid-fueled scandal over staged paparazzi-style shots of him preparing to travel to Britain.)\n\n“Thanks, Pa,” British press reports quoted Harry as saying as Charles settled Markle in her place at the altar next to his son.\n\nSorry, but a wedding — no matter how royal — will not create 'Princess Meghan' »\n\nDiana’s sister Lady Jane Fellowes, who has largely shunned the spotlight since her sister’s death, did the only reading at the ceremony: a passage from the biblical Song of Solomon that the British press said had particular resonance for Diana’s bereaved sons.\n\n“Set me as a seal upon your heart, as a seal upon your arm,” Lady Jane intoned quietly. “For love is as strong as death, passion fierce as the grave.”\n\nAnother reminder of Diana was the presence at the wedding of Elton John, who memorably sang at Diana’s funeral — repurposing his song “Candle in the Wind” with new lyrics — then refused to perform the song ever again.\n\nKensington Palace said Sir Elton performed at a post-wedding reception in recognition of the “close connection” with the prince and his family. The celebrity gossip website TMZ said the selection was his 1970 hit “Your Song.”\n\nAmong the crowd of tens of thousands gathered outside the confines of the castle, some felt a particular pride in Markle’s biracial background, thrilling at the sight of her as the couple passed by in a horse-drawn carriage.\n\nRuth Maunze, a 48-year-old midwife who moved to Britain from her native Zimbabwe, traveled to Windsor with her friend Beauty Nxumalo, 55, originally from Swaziland.\n\nWhen they heard the strains of American soul singer Ben E. King’s “Stand by Me,” performed by a gospel choir and piped from the chapel — an arresting counterpoint to the more traditional fare of Handel, Anglican anthems and English choral music — they sang along.\n\n“I had shivers down my spine,” Maunze said. “At the end of the day, love conquers all.”\n\nSupport our journalism Already a subscriber? Thank you for your support. If you are not, please consider subscribing today. Get full access to our signature journalism for just 99 cents for the first four weeks.\n\nlaura.king@latimes.com\n\nTwitter: @laurakingLAT\n\nBoyle is a special correspondent.\n\nUPDATES:\n\n4:30 p.m.: This article has been updated throughout with background on the ceremony and its historical context.\n\n6:10 a.m.: This article has been updated with procession, description of dress, other details.\n\n5:10 a.m.: This article has been updated with details from ceremony.\n\n4:35 a.m.: This article has been updated with Harry and Meghan married.\n\n3:50 a.m.: This article has been updated with arrival of Princes Harry and William.\n\n3:15 a.m.: This article has been updated with guests arriving and Prince Harry and Meghan Markle receiving their post-wedding titles.\n\n2:25 a.m.: This article has been updated with crowds gathering and invited guests arriving before the wedding.\n\nThis article was originally published at 12 a.m.", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://www.trbimg.com/img-5b001970/turbine/la-et-the-royal-wedding-20180519-pg-013/2000", "https://www.trbimg.com/img-5b032a5a/turbine/la-1526934100-j3q6vutc7i-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6a15348/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.trbimg.com/img-5afff4f0/turbine/la-1526723820-x1qvxyuahd-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/7eb249d/2147483647/strip/true/crop/2048x1365+0+85/resize/1680x1120!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/6a15348/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020", "keywords": [], "authors": ["Laura King Is A Washington", "D.C.-Based Reporter For The Los Angeles Times. A Member Of The Foreign National Staff", "She Primarily Covers Foreign Affairs. She Previously Served As Bureau Chief In Jerusalem", "Kabul"], "canonical_link": "https://www.latimes.com/world/la-fg-britain-royal-wedding-20180519-htmlstory.html", "title": "A royal wedding for the 21st century: Prince Harry weds Meghan Markle amid calls for social justice", "meta_data": {"og": {"title": "A royal wedding for the 21st century: Prince Harry weds Meghan Markle amid calls for social justice", "url": "https://www.latimes.com/world/la-fg-britain-royal-wedding-20180519-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/6a15348/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020", "url": "https://ca-times.brightspotcdn.com/dims4/default/6a15348/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "The royal wedding"}, "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/laura-king", "content_tier": "metered", "published_time": "2018-05-19T23:30:00", "opinion": "false", "section": "World & Nation"}, "twitter": {"card": "summary_large_image", "creator": "@laurakingLAT", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/c424ef9/2147483647/strip/true/crop/2048x1152+0+192/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2Faf%2Fb5123597e1dd9a2186026347133e%2Fla-et-the-royal-wedding-20180519-pg-020", "alt": "The royal wedding"}, "site": "@latimes", "title": "A royal wedding for the 21st century: Prince Harry weds Meghan Markle amid calls for social justice"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimes"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "Until Meghan Markle came along, it’s unlikely that anyone would associate the words “royal wedding” with the phrase “ringing call for social justice.”", "keywords": "royal wedding, britain, monarchy, meghan markle, prince harry", "brightspot.contentId": "00000169-0cc0-dbbe-a16f-4ee0097e0000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1526659200.0, "source": "http://www.latimes.com", "summary": ""}