{"url": "https://www.bustle.com/p/how-many-characters-does-neil-patrick-harris-play-in-a-series-of-unfortunate-events-he-shows-a-lot-of-range-28467", "text": "A Series Of Unfortunate Events has a great many villains and enemies lurking within it, but none more menacing or inventive than Count Olaf. As terrible a man as he is an actor, Count Olaf spends Lemony Snicket's entire book series chasing after the Baudelaire orphans in the hopes of obtaining their massive fortune. In Netflix's adaptation, the menacing amateur thespian is portrayed by charming master thespian Neil Patrick Harris, but it sometimes looks like Count Olaf isn't the only role he'll play. Just how many characters is Neil Patrick Harris in A Series Of Unfortunate Events?\n\nTechnically, Harris is only playing the role of Count Olaf in the Series. However, Count Olaf himself portrays a number of characters, all in an effort to sneak his way closer to the Baudelaire orphans and get his hands on their immense wealth. The first season of A Series Of Unfortunate Events follows the orphans as they are sent to four different caregivers, during which they meet many different characters that Olaf portrays and usually catch his legion of henchman disguising themselves in various roles as well.\n\nHarris uses the opportunity to play multiple roles to stellar effect, portraying the often ridiculous caricatures that Count Olaf thinks up. Here's a look at the many faces of Count Olaf in Season 1 of A Series Of Unfortunate Events. Beware, for there are minor A Series of Unfortunate Events spoilers for the book and TV show below.\n\nCount Olaf\n\nJoe Lederer/Netflix\n\nIntroduced in The Bad Beginning of Snicket's horrid tale of the Baudelaire orphans, Count Olaf wastes no time establishing just how evil and cruel he is. He finds pleasure in other people's pain, lives in a dilapidated house with trash everywhere, and puts up elaborate song-and-dance numbers with his troupe of misfits. Olaf's villainy is further enhanced by Harris' performance, taking care to enunciate each despicable word that escapes his mouth.\n\nA Brand New Disguise\n\nJoe Lederer/Netflix\n\nWithout giving away too much, Count Olaf quickly throws together an outfit for a consultant alter-ego exclusive to the Netflix series. Here, the character is speaking with Mr. Poe, the executive of the deceased Baudelaire parents estate. Luckily, in the future Olaf is sure to improve his costuming skills in a major way.\n\nStefano\n\nJoe Lederer/Netflix\n\nStefano is Olaf's first major disguise, and doing away with his iconic hair and donning a massive beard along with an Italian accent works wonders. Olaf manages to fool just about everyone but the Baudelaires, who are faced with the vaguely farcical duty of convincing the adults in their life that Stefano is, in fact, Count Olaf.\n\nCaptain Sham\n\nJoe Lederer/Netflix\n\nWhen the Baudelaire Orphans are sent to live on the shore of Lake Lachrymose, Count Olaf infiltrates their lives by becoming the rugged Captain Sham — a man whose knowledge of the salty sea is almost as expansive as his sideburns.\n\nShirley\n\nJoe Lederer/Netflix\n\nOlaf's final disguise of Season 1 sees him taking the role of Shirley, secretary to optometrist Dr. Orwell. Harris' cross-dressing turn as Olaf-as-Shirley isn't the first time that Harris has toyed with gender for a role, as he took on the Tony-winning role of genderqueer singer Hedwig in Hedwig And The Angry Inch. With that experience behind him, it's safe to say that NPH had no problem walking in Shirley's heels.\n\nIf the show continues to devoutly follow the original Series Of Unfortunate Events books in Season 2, Olaf will continue to construct many disguises and personalities all for the purpose of ridding the Baudelaire orphans of their fortune. Harris is more than up to the challenge of taking on any role and stretching his already considerable talents to fully encapsulate the many different versions of this single villainous character.", "images": ["https://imgix.bustle.com/2017/1/6/d6dd6c67-dfe6-41e8-ba89-b108a661e992.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/6/f329d086-262b-4eaa-81fa-7bc35557e98a.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/a050599c-0f91-449c-a680-e88ed10034ae-getty-1202992300.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/8/c02da796-5b21-4b0e-aae5-cfb00f3fdded.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/6/dfabd8ee-58e8-4de9-bd08-8568c9deb1ea.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/8/50adce3b-08ee-494f-b927-4feb42a99717-screen-shot-2020-04-07-at-30828-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/3/99943db3-98ad-4042-b38f-ae81222aa490-4760f1ee6d7382e3cb38e88f2f0e730f22ed4a2be805d0f20e1dcfac5e38ac5703ead59ce6e6f4f1f2c0b00b5c40d34d.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/1/8/c02da796-5b21-4b0e-aae5-cfb00f3fdded.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/2017/1/6/e9ed42e8-f2fd-4d33-88bf-ddb49be5b96a.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/14a8d2bf-6a64-40cc-a104-034fe33752a4-getty-1188778598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/2017/1/6/1f4a9012-4fc7-4e5b-8d4c-eb03c2b93d5f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/2017/1/8/c02da796-5b21-4b0e-aae5-cfb00f3fdded.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/how-many-characters-does-neil-patrick-harris-play-in-a-series-of-unfortunate-events-he-shows-a-lot-of-range-28467", "title": "How Many Characters Does Neil Patrick Harris Play In 'A Series Of Unfortunate Events'? He Shows A Lot Of Range", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/how-many-characters-does-neil-patrick-harris-play-in-a-series-of-unfortunate-events-he-shows-a-lot-of-range-28467", "type": "article", "title": "Meet NPH's Many 'Unfortunate Events' Alter Egos", "description": "A Series Of Unfortunate Events has a great many villains and enemies lurking within it, but none more menacing or inventive than Count Olaf. As terrible a man as he is an actor, Count Olaf spends Lemony Snicket's entire book series chasing after the…", "image": {"identifier": "https://imgix.bustle.com/2017/1/8/c02da796-5b21-4b0e-aae5-cfb00f3fdded.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "A Series Of Unfortunate Events has a great many villains and enemies lurking within it, but none more menacing or inventive than Count Olaf. As terrible a man as he is an actor, Count Olaf spends Lemony Snicket's entire book series chasing after the…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}