{"url": "www.inquisitr.com/4488210/tom-cruise-envious-and-furious-over-katie-holmes-and-jamie-foxx-doesnt-look-like-it/", "text": "So it seems that Katie Holmes and Jamie Foxx have finally decided to go public with their romance which the two have managed to keep under wraps for years now. The ongoing denials by each star certainly had the masses scratching their heads seeing as the duo were often seen in one another’s company on getaways and at various locales in Los Angeles.\n\nReasons for Katie and Jamie not going public earlier are rumored to be due to a contract that was signed by Holmes during her swift divorce proceedings with her ex-husband Tom Cruise. The contract was said to have included a five-year dating clause which meant that the Dawson’s Creek star was not allowed to date publicly for this duration. Well, that was back in 2012, so the five years are up, which leads onlookers to believe that the contract was a real binding agreement.\n\nAdditional claims, since Jamie and Katie were spotted walking in Malibu holding hands, have been made regarding Cruise’s reaction to his ex and former co-star coming clean about their relationship. The action star is reportedly “furious” and “envious” about the relationship between Holmes and Foxx and feels a sense of betrayal over it all, as International Business Times states.\n\nA said source indicates that Tom is bothered by the romance and that “Katie is so happy with someone else,” adding that “Tom would love to find his own true love, someone he can share the rest of his life with too. “\n\n‘Katie Holmes finally goes public with new man Jamie Foxx, I’m questioning why she ever agreed to marry Tom Cruise’https://t.co/NWx1Ogo3ml — The Sun (@TheSun) September 10, 2017\n\nIt’s been no secret that Cruise’s relationship with the Church of Scientology has caused both of his marriages to fail and if the star is to find love again, it must be with the approval of the faith. As for Tom being “furious,” this seems a bit far-fetched seeing as the actor was snapped looking as happy as can be, even after news broke that Katie and Jamie are, in fact, an item.\n\nTom Cruise is pictured for the first time since ex-wife Katie Holmes confirmed her relationship with Jamie Foxx https://t.co/BqKD4cDrxm — Daily Mail Celebrity (@DailyMailCeleb) September 6, 2017\n\nAs The Sun indicated, Cruise recently landed in London and fans awaiting the Hollywood heartthrob were greeted with an ear-to-ear smile from Tom, who also gave an enthusiastic thumbs up. The actor had recently been injured while filming the latest installment for the Mission Impossible franchise, yet looked much better and entirely unaffected by the Katie Holmes and Jamie Foxx reveal.\n\n[Featured Image by Andrew H. Walker/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/09/Cruise-Furious-at-Holmes-and-Foxx.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/4488210/tom-cruise-envious-and-furious-over-katie-holmes-and-jamie-foxx-doesnt-look-like-it/", "title": "Tom Cruise ‘Envious’ And ‘Furious’ Over Katie Holmes And Jamie Foxx? Doesn’t Look Like It", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}