{"url": "www.thesun.co.uk/fabulous/5765311/kate-middleton-queen-official-royal-title-prince-william-king/", "text": "KATE Middleton married Prince William in 2011 to become the Duchess of Cambridge and a member of the British royal family.\n\nThe mum-of-three gave birth to her third child with Prince William on April 23, 2018. Here's the lowdown on her royal title and whether it will change if he becomes King...\n\n5 Prince William is second in line to the throne after his father, Princes Charles. Credit: AP:Associated Press\n\nWhat will happen when Charles becomes King?\n\nIf Prince Charles takes the throne and becomes The King of England after his mother Queen Elizabeth, both the Duke and Duchess of Cambridge will move up the line of succession.\n\nPrince William will likely become the Prince of Wales and Kate will hold a very special title as the Princess of Wales.\n\nThe last time someone was named the Princess of Wales was William's late mother, Princess Diana.\n\nWhen William takes the throne will Kate be Queen?\n\nOnce Prince William then takes the throne and becomes the King of England, Kate will then be the Queen Consort.\n\nKate, 37, will only hold the title of Queen Consort, and not be The Queen of England in the same way the sovereign is now.\n\nAll females who marry sovereigns are styled as Queen Consorts, except in rare cases.\n\nWhile males are officially the consort, they may be referred to as Prince, as with the Queen and Prince Philip, although they can be referred to as Prince Consorts.\n\n5 The mum-of-three gave birth to her third child with Prince William, on April 23, 2018 Credit: AP:Associated Press\n\nWhereas Kate will not be the official Queen, Princess Charlotte has the potential to hold that title, just like her great-grandmother Queen Elizabeth II.\n\nPrincess Charlotte is fourth in line to the throne, after Prince Charles, Prince William and Prince George, but will be ahead of her new brother, even though he is male, due to a change in the law of primogeniture.\n\nPreviously boys took precedence over any older siblings if they were girls, but new legislation was created before Prince George’s birth ending this tradition.\n\nCamilla Parker Bowles, who is line before Kate, will technically become the Queen Consort also, but it has been said Camilla will adopt the style of Princess Consort.\n\n5 Prince William will be King of England and Kate will be the Queen Consort Credit: PA:Press Association\n\nWhat's Kate Middleton's royal title now?\n\nKate Middleton’s title is Her Royal Highness the Duchess of Cambridge.\n\nThe morning of her wedding to Prince William he was created Duke of Cambridge, Earl of Strathearn and Baron Carrickfergus.\n\nKate assumes all the feminine titles of her husband, and her full title and style is Her Royal Highness the Duchess of Cambridge, Countess of Strathearn and Lady Carrickfergus.\n\nIn Scotland she is also styled as Her Royal Highness The Countess of Strathearn.\n\nWhen Kate married Prince William, she also technically became Mrs Prince William.\n\nBut Kate is not referred to as a princess as she was not born into the role, whereas Princess Charlotte is as she was born into royalty.\n\n5 Kate married Prince William in 2011 and became the Duchess of Cambridge Credit: PA:Press Association\n\nWhat will it be when Prince William is King?\n\nIt is widely assumed Kate will assume the official title of Queen Consort Catherine, but it is likely she will be referred to as Queen, or Queen Catherine.\n\nThe last predecessor in that role was the Queen Mother.\n\nLady Elizabeth Bowes-Lyon married Prince Albert, Duke of York, in 1923, and she assumed the feminine form of his titles.\n\n5 Kate Middleton’s title is Her Royal Highness the Duchess of Cambridge Credit: PA:Press Association\n\nWhen he became King in 1936, she became the Queen Consort, but was referred to as the Queen.\n\nShe was officially styled Her Majesty Queen Elizabeth The Queen Mother following the death of her husband.\n\nIt is the normal style for the widow of a King to assume the title Queen accompanied by their name.\n\nIn this case it was Queen Elizabeth, but this was too close to her daughter and current monarch, Queen Elizabeth II, so the Queen Mother was adopted to avoid confusion.\n\nthe latest on kate WILLS' WORRIES William and Kate reveal concerns for the Queen during 'stressful' lockdown SCHOOL'S NOT OUT Kate ‘guilty’ about homeschool lie she told George & Charlotte over Easter fund of him Captain Tom Moore hails 'my super Prince' as Will honours 'fundraising machine' ROYAL RULES ‘Strict’ Kate Middleton 'doesn’t let her kids have too much screen time' HER MODESTY Queen 'taught Kate how to exit a carriage without exposing her modesty' ROYAL SUPPORT Kate & Will wish the nation a ‘safe Easter’ with daffodil photo amid pandemic\n\nThis is when the Duchess’ baby arrived and all the baby name predictions.\n\nHere are the weird royal rules she had to follow.\n\nAnd who’s next in line to the throne and where do Meghan Markle’s future children come?", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.2 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2018/03/nintchdbpict000386227144-e1520595880142.jpg?strip=all&quality=100&w=1155&h=800&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/03/nintchdbpict000386227144-e1520595880142.jpg?strip=all&quality=100&w=1155&h=800&crop=1", "keywords": [], "authors": ["Rebecca Flood"], "canonical_link": "https://www.thesun.co.uk/fabulous/5765311/kate-middleton-queen-official-royal-title-prince-william-king/", "title": "What is Kate Middleton’s royal title, will it change when Prince William becomes King and will she ever be Queen?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Find out whether Kate Middleton will be Queen when Prince William is King", "url": "https://www.thesun.co.uk/fabulous/5765311/kate-middleton-queen-official-royal-title-prince-william-king/", "description": "KATE Middleton married Prince William in 2011 to become the Duchess of Cambridge and a member of the British royal family. The mum-of-three gave birth to her third child with Prince William on Apri…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/03/nintchdbpict000386227144-e1520595880142.jpg?strip=all&quality=100&w=1155&h=800&crop=1", "width": 1155, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2019-01-09T10:20:27+00:00", "modified_time": "2019-08-30T12:22:40+00:00", "publisher": 161385360554578, "tag": "Kate Middleton, Prince William, Explainers, Royal Family", "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "Will Kate Middleton be Queen, what's her official royal title and will it change once Prince William becomes King?", "keywords": "Kate Middleton, Queen, princess, royal, throne, Prince William", "news_keywords": "Kate Middleton, Queen, princess, royal, throne, Prince William", "twitter": {"text": {"title": "What is Kate Middleton’s royal title, will it change when Prince William becomes King and will she ever be Queen?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "ALL HAIL", "headline": "Find out whether Kate Middleton will be Queen when Prince William is King", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/04/nintchdbpict0003861269171-e1524647643736.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/04/nintchdbpict0003861269171-e1524647643736.jpg?strip=all&quality=100&w=314&h=220&crop=1"}}, "parsely-post-id": 5765311, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1547029227.0, "source": "http://www.thesun.co.uk", "summary": ""}