{"url": "https://web.archive.org/web/20080918023646/http://my.barackobama.com:80/page/community/post/amandascott/gG5XWF", "text": "Community Blogs Post from Amanda Scott's Blog Senator Obama in Golden, CO: Confronting an Economic Crisis Comments | Mail to a Friend | Report Objectionable Content This afternoon in Golden, Colorado, Senator Obama delivered an address on the economic crisis. He outlined his record, his economic plan and how he will bring change when John McCain will bring more of the same. Here are some of his remarks... Over the last few days, we have seen clearly what’s at stake in this election. The news from Wall Street has shaken the American people’s faith in our economy. The situation with Lehman Brothers and other financial institutions is the latest in a wave of crises that have generated tremendous uncertainty about the future of our financial markets. This is a major threat to our economy and its ability to create good-paying jobs and help working Americans pay their bills, save for their future, and make their mortgage payments.\n\n\n\nSince this turmoil began over a year ago, the housing market has collapsed. Fannie Mae and Freddie Mac had to be effectively taken over by the government. Three of America’s five largest investment banks failed or have been sold off in distress. Yesterday, Wall Street suffered its worst losses since just after 9/11. We are in the most serious financial crisis in generations. Yet Senator McCain stood up yesterday and said that the fundamentals of the economy are strong.\n\n\n\n...So let’s be clear: what we’ve seen the last few days is nothing less than the final verdict on an economic philosophy that has completely failed. And I am running for President of the United States because the dreams of the American people must not be endangered any more. It’s time to put an end to a broken system in Washington that is breaking the American economy. It’s time for change that makes a real difference in your lives.\n\n\n\n...Make no mistake: my opponent is running for four more years of policies that will throw the economy further out of balance. His outrage at Wall Street would be more convincing if he wasn’t offering them more tax cuts. His call for fiscal responsibility would be believable if he wasn’t for more tax cuts for the wealthiest Americans, and more of a trillion dollar war in Iraq paid for with deficit spending and borrowing from foreign creditors like China. His newfound support for regulation bears no resemblance to his scornful attitude towards oversight and enforcement. John McCain cannot be trusted to reestablish proper oversight of our financial markets for one simple reason: he has shown time and again that he does not believe in it.\n\n\n\nWhat has happened these last eight years is not some historical anomaly, so we know what to expect if we try these policies for another four. When lobbyists run your campaign, the special interests end up gaming the system. When the White House is hostile to any kind of oversight, corporations cut corners and consumers pay the price. When regulators are chosen for their disdain for regulation and we gut their ability to enforce the law, then the interests of the American people are not protected. It’s an ideology that intentionally breeds incompetence in Washington and irresponsibility on Wall Street, and it’s time to turn the page.\n\n\n\nJust today, Senator McCain offered up the oldest Washington stunt in the book – you pass the buck to a commission to study the problem. But here’s the thing ... we know how we got into this mess. What we need now is leadership that gets us out. I’ll provide it, John McCain won’t, and that’s the choice for the American people in this election. Read Barack's full remarks as prepared for delivery...\n\n\n\nRemarks of Senator Barack Obama\n\n\n\nConfronting an Economic Crisis\n\n\n\nAs Prepared For Delivery\n\n\n\nTuesday, September 16th, 2008\n\n\n\nGolden, Colorado\n\n\n\n\n\nOver the last few days, we have seen clearly what’s at stake in this election. The news from Wall Street has shaken the American people’s faith in our economy. The situation with Lehman Brothers and other financial institutions is the latest in a wave of crises that have generated tremendous uncertainty about the future of our financial markets. This is a major threat to our economy and its ability to create good-paying jobs and help working Americans pay their bills, save for their future, and make their mortgage payments.\n\n\n\nSince this turmoil began over a year ago, the housing market has collapsed. Fannie Mae and Freddie Mac had to be effectively taken over by the government. Three of America’s five largest investment banks failed or have been sold off in distress. Yesterday, Wall Street suffered its worst losses since just after 9/11. We are in the most serious financial crisis in generations. Yet Senator McCain stood up yesterday and said that the fundamentals of the economy are strong\n\n\n\nA few hours later, his campaign sent him back out to clean up his remarks, and he tried to explain himself again this morning by saying that what he meant was that American workers are strong. But we know that Senator McCain meant what he said the first time, because he has said it over and over again throughout this campaign – no fewer than 16 times, according to one independent count.\n\n\n\nNow I certainly don’t fault Senator McCain for all of the problems we’re facing, but I do fault the economic philosophy he subscribes to. Because the truth is, what Senator McCain said yesterday fits with the same economic philosophy that he’s had for 26 years. It’s the philosophy that says we should give more and more to those with the most and hope that prosperity trickles down. It’s the philosophy that says even common-sense regulations are unnecessary and unwise. It’s a philosophy that lets Washington lobbyists shred consumer protections and distort our economy so it works for the special interests instead of working people.\n\n\n\nWe’ve had this philosophy for eight years. We know the results. You feel it in your own lives. Jobs have disappeared, and peoples’ life savings have been put at risk. Millions of families face foreclosure, and millions more have seen their home values plummet. The cost of everything from gas to groceries to health care has gone up, while the dream of a college education for our kids and a secure and dignified retirement for our seniors is slipping away. These are the struggles that Americans are facing. This is the pain that has now trickled up.\n\n\n\nSo let’s be clear: what we’ve seen the last few days is nothing less than the final verdict on an economic philosophy that has completely failed. And I am running for President of the United States because the dreams of the American people must not be endangered any more. It’s time to put an end to a broken system in Washington that is breaking the American economy. It’s time for change that makes a real difference in your lives.\n\n\n\nIf you want to understand the difference between how Senator McCain and I would govern as President, you can start by taking a look at how we’ve responded to this crisis. Because Senator McCain's approach was the same as the Bush Administration’s: support ideological policies that made the crisis more likely; do nothing as the crisis hits; and then scramble as the whole thing collapses. My approach has been to try to prevent this turmoil.\n\n\n\nIn February of 2006, I introduced legislation to stop mortgage transactions that promoted fraud, risk or abuse. A year later, before the crisis hit, I warned Secretary Paulson and Chairman Bernanke about the risks of mounting foreclosures and urged them to bring together all the stakeholders to find solutions to the subprime mortgage meltdown. Senator McCain did nothing.\n\n\n\nLast September, I stood up at NASDAQ and said it’s time to realize that we are in this together – that there is no dividing line between Wall Street and Main Street – and warned of a growing loss of trust in our capital markets. Months later, Senator McCain told a newspaper that he’d love to give them a solution to the mortgage crisis, “but” – he said – “I don’t know one.”\n\n\n\nIn January, I outlined a plan to help revive our faltering economy, which formed the basis for a bipartisan stimulus package that passed the Congress. Senator McCain used the crisis as an excuse to push a so-called stimulus plan that offered another huge and permanent corporate tax cut, including $4 billion for the big oil companies, but no immediate help for workers.\n\n\n\nThis March, in the wake of the Bear Stearns bailout, I called for a new, 21st century regulatory framework to restore accountability, transparency, and trust in our financial markets. Just a few weeks earlier, Senator McCain made it clear where he stands: “I’m always for less regulation,” he said, and referred to himself as “fundamentally a deregulator.”\n\n\n\nThis is what happens when you confuse the free market with a free license to let special interests take whatever they can get, however they can get it. This is what happens when you see seven years of incomes falling for the average worker while Wall Street is booming, and declare – as Senator McCain did earlier this year – that we’ve made great progress economically under George Bush. That is how you can reach the conclusion – as late as yesterday – that the fundamentals of the economy are strong.\n\n\n\nWell, we have a different way of measuring the fundamentals of our economy. We know that the fundamentals that we use to measure economic strength are whether we are living up to that fundamental promise that has made this country great –that America is a place where you can make it if you try.\n\n\n\nAmericans have always pursued our dreams within a free market that has been the engine of our progress. It’s a market that has created a prosperity that is the envy of the world, and rewarded the innovators and risk-takers who have made America a beacon of science, and technology, and discovery. But the American economy has worked in large part because we have guided the market’s invisible hand with a higher principle – that America prospers when all Americans can prosper. That is why we have put in place rules of the road to make competition fair, and open, and honest.\n\n\n\nToo often, over the last quarter century, we have lost this sense of shared prosperity. And this has not happened by accident. It’s because of decisions made in boardrooms, on trading floors and in Washington. We failed to guard against practices that all too often rewarded financial manipulation instead of productivity and sound business practices. We let the special interests put their thumbs on the economic scales. The result has been a distorted market that creates bubbles instead of steady, sustainable growth; a market that favors Wall Street over Main Street, but ends up hurting both.\n\n\n\nLet me be clear: the American economy does not stand still, and neither should the rules that govern it. The evolution of industries often warrants regulatory reform - to foster competition, lower prices, or replace outdated oversight structures. Old institutions cannot adequately oversee new practices. Old rules may not fit the roads where our economy is leading. But instead of sensible reform that rewarded success and freed the creative forces of the market, too often we’ve excused an ethic of greed, corner-cutting and inside dealing that threatens the long-term stability of our economic system.\n\n\n\nIt happened in the 1980s, when we loosened restrictions on Savings and Loans and appointed regulators who ignored even these weaker rules. Too many S&Ls took advantage of the lax rules set by Washington to gamble that they could make big money in speculative real estate. Confident of their clout in Washington, they made hundreds of billions in bad loans, knowing that if they lost money, the government would bail them out. And they were right. The gambles did not pay off, our economy went into recession, and the taxpayers ended up footing the bill. Sound familiar?\n\n\n\nAnd it has happened again during this decade, in part because of how we deregulated the financial services sector. After we repealed outmoded rules instead of updating them, we were left overseeing 21st century innovation with 20th century regulations. When subprime mortgage lending took a reckless and unsustainable turn, a patchwork of regulators systematically and deliberately eliminated the regulations protecting the American people and failed to raise warning flags that could have protected investors and the pensions American workers count on.\n\n\n\nThis was not the invisible hand of the market at work. These cycles of bubble and bust were symptoms of the ideology that my opponent is running to continue. John McCain has spent decades in Washington supporting financial institutions instead of their customers. In fact, one of the biggest proponents of deregulation in the financial sector is Phil Gramm – the same man who helped write John McCain’s economic plan; the same man who said that we’re going through a ‘mental recession’; and the same man who called the United States of America a “nation of whiners.” So it’s hard to understand how Senator McCain is going to get us out of this crisis by doing the same things with the same old players.\n\n\n\nMake no mistake: my opponent is running for four more years of policies that will throw the economy further out of balance. His outrage at Wall Street would be more convincing if he wasn’t offering them more tax cuts. His call for fiscal responsibility would be believable if he wasn’t for more tax cuts for the wealthiest Americans, and more of a trillion dollar war in Iraq paid for with deficit spending and borrowing from foreign creditors like China. His newfound support for regulation bears no resemblance to his scornful attitude towards oversight and enforcement. John McCain cannot be trusted to reestablish proper oversight of our financial markets for one simple reason: he has shown time and again that he does not believe in it.\n\n\n\nWhat has happened these last eight years is not some historical anomaly, so we know what to expect if we try these policies for another four. When lobbyists run your campaign, the special interests end up gaming the system. When the White House is hostile to any kind of oversight, corporations cut corners and consumers pay the price. When regulators are chosen for their disdain for regulation and we gut their ability to enforce the law, then the interests of the American people are not protected. It’s an ideology that intentionally breeds incompetence in Washington and irresponsibility on Wall Street, and it’s time to turn the page.\n\n\n\nJust today, Senator McCain offered up the oldest Washington stunt in the book – you pass the buck to a commission to study the problem. But here’s the thing – this isn’t 9/11. We know how we got into this mess. What we need now is leadership that gets us out. I’ll provide it, John McCain won’t, and that’s the choice for the American people in this election.\n\n\n\nHistory shows us that there is no substitute for presidential leadership in a time of economic crisis. FDR and Harry Truman didn’t put their heads in the sand, or hand accountability over to a Commission. Bill Clinton didn’t put off hard choices. They led, and that’s what I will do. My priority as President will be the stability of the American economy and the prosperity of the American people. And I will make sure that our response focuses on middle class Americans – not the companies that created the problem.\n\n\n\nTo get out of this crisis – and to ensure that we are not doomed to repeat a cycle of bubble and bust again and again – we must take immediate measures to create jobs and continue to address the housing crisis; we must build a 21st century regulatory framework, and we must pursue a bold opportunity agenda that creates new jobs and grows the American economy.\n\n\n\nTo jumpstart job creation, I have proposed a $50 billion Emergency Economic Plan that would save 1 million jobs by rebuilding our infrastructure, repairing our schools, and helping our states and localities avoid damaging budget cuts.\n\n\n\nI worked with leaders in Congress to create a new FHA Housing Security Program, which will help stabilize the housing market and allow Americans facing foreclosure to keep their homes at rates they can afford. Going forward, we need to replace Fannie Mae and Freddie Mac as we know them with a structure that is focused on helping people buy homes – not engaging in market speculation. We can’t have a situation like the old S&L scandal where its “heads” investors win, and “tails” taxpayers lose. That’s going to take ending the lobbyist-driven dominance of these institutions that we’ve seen for far too long in Washington.\n\n\n\nTo prevent fraud in the mortgage market, I've proposed tough penalties on fraudulent lenders, and a Home Score system that will ensure consumers fully understand mortgage offers and whether they'll be able to make payments. To help low- and middle-income families, I will ease the burden on struggling homeowners through a universal homeowner’s tax credit. This will add up to a 10 percent break off the mortgage interest rate for 10 million households. That’s another $500 each year for many middle class families.\n\n\n\nUnlike Senator McCain, I will change our bankruptcy laws to make it easier for families to stay in their homes. Right now, if you’re a family that owns one house, bankruptcy judges are actually barred from helping you keep a roof over your head by writing down the value of your mortgage. If you own seven homes, the judge is free to write down any or all of the debt on your second, third, fourth, fifth, sixth or seventh homes. Now that may be of comfort to Senator McCain, but that’s the kind of out-of-touch Washington loophole that makes no sense. When I’m President, we’ll make our laws work for working people.\n\n\n\nBut as we’ve seen the last few days, the crisis in our financial markets now reaches well beyond the housing market. That’s why it’s time to do what I called for last September and again this past March – and it is only more overdue today.\n\n\n\nOur capital markets cannot succeed without the public's trust. It’s time to get serious about regulatory oversight, and that’s what I will do as President. That starts with the core principles for reform that I discussed at Cooper Union.\n\n\n\nFirst, if you’re a financial institution that can borrow from the government, you should be subject to government oversight and supervision. When the Federal Reserve steps in as a lender of last resort, it is providing an insurance policy underwritten by the American taxpayer. In return, taxpayers have every right to expect that financial institutions with access to that credit are not taking excessive risks.\n\n\n\nSecond, we must reform requirements on all regulated financial institutions. We must strengthen capital requirements, particularly for complex financial instruments like some of the mortgage securities and other derivatives at the center of our current crisis. We must develop and rigorously manage liquidity risk. We must investigate rating agencies and potential conflicts of interest with the people they are rating. And we must establish transparency requirements that demand full disclosure by financial institutions to shareholders and counterparties. As we reform our regulatory system at home, we must address the same problems abroad so that financial institutions around the world are subject to similar rules of the road.\n\n\n\nThird, we need to streamline our regulatory agencies. Our overlapping and competing regulatory agencies cannot oversee the large and complex institutions that dominate the financial landscape. Different institutions compete in multiple markets - Washington should not pretend otherwise. A streamlined system will provide better oversight and reduce costs.\n\n\n\nFourth, we need to regulate institutions for what they do, not what they are. Over the last few years, commercial banks and thrift institutions were subject to guidelines on subprime mortgages that did not apply to mortgage brokers and companies. This regulatory framework failed to protect homeowners, and made no sense for our financial system. When it comes to protecting the American people, it should make no difference what kind of institution they are dealing with.\n\n\n\nFifth, we must crack down on trading activity that crosses the line to market manipulation. The last six months have shown that this remains a serious problem in many markets and becomes especially problematic during moments of great financial turmoil. We cannot embrace the administration's vision of turning over the protection of investors to the industries themselves. We need regulators that actually enforce the rules instead of overlooking them. The SEC should investigate and punish market manipulation, and report its conclusions to Congress.\n\n\n\nSixth, we must establish a process that identifies systemic risks to the financial system like the crisis that has overtaken our economy. Too often, we end up where we are today: dealing with threats to the financial system that weren't anticipated by regulators. We need a standing financial market advisory group to meet regularly and provide advice to the President, Congress, and regulators on the state of our financial markets and the risks they face. It’s time to anticipate risks before they erupt into a full-blown crisis.\n\n\n\nThese six principles should guide the legal reforms needed to establish a 21st century regulatory system. But the change we need goes beyond laws and regulation. Financial institutions must do a better job at managing risks. There is something wrong when boards of directors or senior managers don't understand the implications of the risks assumed by their own institutions. It's time to realign incentives and CEO compensation packages, so that both high level executives and employees better serve the interests of shareholders.\n\n\n\nFinally, the American people must be able to trust that their government is looking out for all of us - not the special interests that have set the agenda in Washington for eight years, and the lobbyists who run John McCain’s campaign.\n\n\n\nI’ve spent my career taking on lobbyists and their money, and I’ve won. If you wanted a special favor in Illinois, there was actually a law that let you give campaign cash to politicians for their own personal use. In the State House, they called it business-as-usual. I called it legalized bribery, and while it didn’t make me the most popular guy in Springfield, I put an end to it.\n\n\n\nWhen I got to Washington, we saw some of the worst corruption since Watergate. I led the fight for reform in my party, and let me tell you – not everyone in my party was too happy about it. When I proposed forcing lobbyists to disclose who they’re raising money from and who in Congress they’re funneling it to, I had a few choice words directed my way on the floor of the Senate. But we got it done, and we banned gifts from lobbyists, and free rides on their fancy jets. And I am the only candidate who can say that Washington lobbyists do not fund my campaign, they will not run my White House, and they will not drown out the voices of the American people when I am President of the United States. That’s how we’re going to end the outrage of special interests tipping the scales.\n\n\n\nThe most important thing we must do is restore opportunity for all Americans. To get our economy growing, we need to recapture that fundamental American promise. That if you work hard, you can pay the bills. That if you get sick, you won’t go bankrupt. That your kids can get a good education, and that we can leave a legacy of greater opportunity to future generations.\n\n\n\nThat’s the change the American people need. While Senator McCain likes to talk about change these days, his economic program offers nothing but more of the same. The American people need more than change as a slogan– we need change that makes a real difference in your life.\n\n\n\nChange means a tax code that doesn’t reward the lobbyists who wrote it, but the American workers and small businesses who deserve it. I will stop giving tax breaks to corporations that ship jobs overseas, and I will start giving them to companies that create good jobs right here in America. I will eliminate capital gains taxes for small businesses and start-ups – that’s how we’ll grow our economy and create the high-wage, high-tech jobs of tomorrow.\n\n\n\nI will cut taxes – cut taxes – for 95% of all working families. My opponent doesn’t want you to know this, but under my plan, tax rates will actually be less than they were under Ronald Reagan. If you make less than $250,000 a year, you will not see your taxes increase one single dime. In fact, I offer three times the tax relief for middle-class families as Senator McCain does – because in an economy like this, the last thing we should do is raise taxes on the middle-class.\n\n\n\nI will finally keep the promise of affordable, accessible health care for every single American. If you have health care, my plan will lower your premiums. If you don’t, you’ll be able to get the same kind of coverage that members of Congress give themselves. And I will stop insurance companies from discriminating against those who are sick and need care the most\n\n\n\nI will create the jobs of the future by transforming our energy economy. We’ll tap our natural gas reserves, invest in clean coal technology, and find ways to safely harness nuclear power. I’ll help our auto companies re-tool, so that the fuel-efficient cars of the future are built right here in America. I’ll make it easier for the American people to afford these new cars. And I’ll invest 150 billion dollars over the next decade in affordable, renewable sources of energy – wind power and solar power and the next generation of biofuels; an investment that will lead to new industries and five million new jobs that pay well and can’t ever be outsourced\n\n\n\nAnd now is the time to finally meet our moral obligation to provide every child a world-class education, because it will take nothing less to compete in the global economy. I’ll recruit an army of new teachers, and pay them higher salaries and give them more support. But in exchange, I will ask for higher standards and more accountability. And we will keep our promise to every young American – if you commit to serving your community or your country, we will make sure you can afford a college education.\n\n\n\nThis is the change we need – the kind of bottom up growth and innovation that will advance the American economy by advancing the dreams of all Americans.\n\n\n\nTimes are hard. I will not pretend that the changes we need will come without cost – though I have presented ways we can achieve these changes in a fiscally responsible way. I know that we'll have to overcome our doubts and divisions and the determined opposition of powerful special interests before we can truly reform a broken economy and advance opportunity.\n\n\n\nBut I am running for President because we simply cannot afford four more years of an economic philosophy that works for Wall Street instead of Main Street, and ends up devastating both.\n\n\n\nI don’t want to wake up in four years to find that more Americans fell out of the middle-class, and more families lost their savings. I don’t want to see that our country failed to invest in our ability to compete, our children’s future was mortgaged on another mountain of debt, and our financial markets failed to find a firmer footing.\n\n\n\nThis time – this election – is our chance to stand up and say: enough is enough!\n\n\n\nWe can do this because Americans have done this before. Time and again, we’ve battled back from adversity by recognizing that common stake that we have in each other’s success. That’s why our economy hasn’t just been the world’s greatest wealth generator – it’s bound America together, it’s created jobs, and it’s made the dream of opportunity a reality for generation after generation of Americans.\n\n\n\nNow it falls to us. And I need you to make it happen. If you want the next four years looking just like the last eight, then I am not your candidate. But if you want real change – if you want an economy that rewards work, and that works for Main Street and Wall Street; if you want tax relief for the middle class and millions of new jobs; if you want health care you can afford and education so that our kids can compete; then I ask you to knock on some doors, and make some calls, and talk to your neighbors, and give me your vote on November 4th. And if you do, I promise you – we will win Colorado, we will win this election, and we will change America together.\n\n\n\n", "images": ["https://web.archive.org/web/20080918023646im_/http://www.barackobama.com/images/nav-donate_btn.jpg", "https://web.archive.org/web/20080918023646im_/http://www.barackobama.com/images/en_espanol.gif", "https://web.archive.org/web/20080918023646im_/http://www.barackobama.com/favicon.ico"], "top_img": "https://web.archive.org/web/20080918023646im_/http://www.barackobama.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Amanda Scott's Blog: Senator Obama in Golden, CO: Confronting an Economic Crisis", "meta_data": {"copyright": "Copyright (c) 2007 Barack Obama. All rights reserved.", "description": "Official Website of Barack Obama 2008 Presidential Campaign", "keywords": "president, senator, illinois, chicago, barack, barck, barek, obama, 2008, 08, presidential, president, campaign, election"}, "movies": ["http://www.youtube.com/v/HlZt5iN96iM&hl=en&fs=1"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}