{"url": "https://www.billboard.com/articles/columns/pop/7965926/lady-gaga-five-foot-two-netflix-documentary-things-learned", "text": "Why she and ex-fiance Taylor Kinney broke up, her true feelings toward Madonna, dealing with fibromyalgia and more.\n\nLady Gaga will show all of herself to anyone who chooses to watch her new Netflix documentary Five Foot Two, which is available beginning Friday (Sept. 22). The documentary was directed by Chris Moukarbel and shot over an extended period of time throughout the making of Gaga's fifth studio album, Joanne.\n\nHere are 11 things we learned from watching Five Foot Two.\n\nWhy she and ex-fiance Taylor Kinney broke up\n\nWithin the first three minutes of the documentary, Gaga mentions ex-fiance Taylor Kinney.\n\n\"Yeah,\" she says while cooking at her Malibu home, \"me and Taylor [Kinney] are fighting. So, that sucks.\" Gaga goes on to say that her \"threshold for bullshit with men is -- I don't have one anymore\" because she's 30, she feels better and her insecurities are gone.\n\nWe don't hear anything about Kinney until just over an hour into the documentary during a sit down interview with Beats 1 radio host Zane Lowe, where Lowe asks Gaga what has happened in the last five years. She responds by saying she has felt anxiety, body pain, paranoia and fear and has abused alcohol and drugs.\n\n\"The public announcement that your marriage is breaking up and you've got to go make a record,\" Lowe says.\n\n\"Well, engagement,\" Gaga corrects him. \"Let's not say marriage. But yeah. Very painful. It's hard enough when love isn't working out the way you want it to, and you've got to walk down the street and have somebody go, 'Are you OK?'\n\n\"I had to go into the deepest pain in my life,\" she says. \"I had to go into the part of myself that you don't want to face.\"\n\nThis acts as a segue to a totally black screen, where we hear Gaga crying as she says, \"I just want to make music and make people happy, and, like, I'm on tour and I have a family and I just can never get it all right at the same time. I always have a shoot ... My love life's imploded.\"\n\nShe adds: \"It's a sad day when I'm doing the Super Bowl, and I'm so excited to do it, but I can't help but realize that when I sold 10 million records, I lost Matt. I sell 30 million, I lose Luc. You know? I get the move, I lose Taylor. It's like a turnover. This is the third time I've had my heart broken like this. I'm alone, Brandon, every night. And all these people will leave. Right? They will leave. And then I'll be alone. And then I go from everyone touching me all day and talking at me all day to total silence.\"\n\nThe aftermath of her broken hip and dealing with fibromyalgia\n\nThe documentary begins at Gaga's Malibu home. We quickly find her on a massage table getting worked on. She tells the camera that if she gets depressed, her body goes into a full-body spasm. All of which, she says, stems from when she broke her hip three years ago. This is even more relevant now that she has postponed the European leg of her Joanne World Tour due to her ongoing pain.\n\nHer struggles with chronic body pain, which we now know is fibromyalgia, appear several times throughout the one hour and 40 minutes. Some scenes are more dramatic than others, including just before she is set to perform for Tony Bennett's birthday -- she's bawling on the couch in pain. \"I just think about other people that have maybe something like this that are struggling to figure out what it is, and they don't have the money to have somebody help them,\" she says through tears. \"Like, I don't know what I'd fuckin' do if I didn't have everybody here to help me. What the hell would I do? ... Do I look pathetic? I'm so embarrassed.\"\n\nWhile shooting the \"Perfect Illusion\" music video, she has to pause and ice her hip and ankle. While rehearsing for the Super Bowl 51 halftime show, she has to pause and screams into a pillow as someone works on her hip.\n\nWhile sitting in a doctor's office later on, she admits, \"I have chased this pain for five years.\"\n\nThe making of Joanne\n\nThroughout the documentary, we revisit Gaga in the studio with producers Mark Ronson and Bloodpop and other members of her team during the making of Joanne.\n\n\"You have to go to that broken place of your heart to write songs,\" Gaga tells the camera while taking a break from recording \"Million Reasons\" and smoking a cigarello. \"They say sometimes it's like open heart surgery, making music. Every time. It's invasive.\"\n\nIt is made very clear that Gaga fully trusts Ronson and perhaps wouldn't have been able to make such a vulnerable record with anyone else. At one point, she says, \"So many men in my life -- in business and also that I've dated over the years -- I just started to feel like what I was on my own wasn't good enough. And I don't feel that way working with Mark.\"\n\nOf the process, Gaga describes, \"When you reference or nod to something in music, it's just like putting something precious in plastic in a suitcase that you are going to take into the future.\"\n\nHer true feelings toward Madonna\n\nGaga addresses the fact that Madonna has never directly told her the problems she has with her. Instead, Gaga says, she found it all out through television. She compares finding out how Madonna feels about her through the media to a guy passing her a note through his friend.\n\n\"The thing with me and Madonna, for example, is that I admired her always. I still admire her, no matter what she might think of me. The only thing that really bothers me about her is that I'm Italian and from New York. So if I have a problem with somebody, I'm going to fucking tell you to your face.\"\n\n\"But no matter how much respect I have for her as a performer, I could never wrap my head around the fact that she wouldn't look me in the eye and tell me I was reductive or whatever.\"\n\nThe inner-workings of her performing at the Super Bowl\n\nThe documentary ends right as Gaga is about to take the stage at Super Bowl 51 in Houston. Just before going on, she tells her team that she has worked her whole life for this and repeatedly reminds herself to enjoy it.\n\nEarlier in the documentary, we're shown a meeting at her home with members of her team and the Super Bowl committee. \"You guys are just making my day talking about this,\" she tells them. \"I could just cry. Thank you for this opportunity. This is just a dream come true. I want to do the opposite of what everyone thinks that I'm gonna do. Everybody thinks that I'm going to come out there on a fucking throne in a meat dress with 90 shirtless men and unicorns.\"\n\n\"This is the one,\" she tells her stylist on the day of the Super Bowl. \"It's almost, like, a little bit sad. It doesn't get bigger than this, so what do I do after this?\"\n\nHer thoughts on women -- especially powerful women\n\nAfter a studio session, she says, \"When producers, unlike Mark [Ronson], start to act like they're the -- like, you know, 'You'd be nothing without me!' For women, especially, those men have so much power that they can have women in a way that no other men can. Whenever they want, whatever they want. ... And then I walk in the room, and it's like eight times out of 10, I'm put in that category. And they expect from me what those girls have to offer when that's just not at all what I have to offer in any way.\"\n\nThis transitions into Gaga admitting that the way she pushed back against those men who expected her to be a sex object was to \"always fuckin' put some absurd spin on it that made me feel like I was still in control. So, you know what, if I'm going to be sexy at the VMAs and sing about the paparazzi, I'm going to do it while I'm bleeding to death.\"\n\nLater on, Gaga says, \"I want to become a woman in this business and grow up. When you become famous at 21 or 22, it's like you stop growing up. I want to become a woman because the truth is that I can always bring my past with me, but I can never go back. You've got to leave yourself behind.\"\n\nShe really loves her family\n\nThis much is evident in the title of her fifth studio album alone: Joanne, after her aunt who died at age 19 from lupus. Joanne is Gaga's father's sister, and Gaga -- whose real name is Stefani Joanne Angelina Germanotta -- is named after her.\n\nEarly on is footage of Gaga and her family at church for the christening of a baby. As Gaga's mother, Cynthia, is leaving the church, an elderly woman stops her to say, \"Both your daughters are beautiful girls.\" \"They're good people,\" Cynthia responds.\n\nLater on, Gaga is previewing Joanne in a room with New York Times reporter Darryl Pinckney, whom she tells, in part, \"My family is the most important thing in my life. Joanne was an artist. What happened was that my grandmother couldn't take her hands from her.\"\n\nFollowing her time with Pinckney, Gaga goes to visit her grandmother to go through some of Joanne's old things and play her title track \"Joanne\" for the first time. It's a very emotional scene, as previously reported by Billboard. So much so, that as Gaga is playing the song for her grandmother, her father, Joe, has to leave the room.\n\n\"Did I get it right?\" Gaga asks through tears.\n\n\"You did,\" her grandmother tells her.\n\nWhy she used to wear those costumes, maybe\n\n\"I never felt comfortable enough to sing and just be this way, now,\" Gaga says. \"To just sing, wear my hair back. I never felt pretty enough or smart enough or a good enough musician. That's the good part. The good part is that I just didn't feel good enough, and I do now. I know I deserve -- of all the things I deserve, that is where I know I'm worth something so I have to stay there.\"\n\nThroughout the documentary, there are various references to leaving her eccentric persona in the past and finally stepping out into the world as just herself. There are conversations had throughout the documentary about what she wants her wardrobe and aesthetic to be for Joanne and mentions that maybe she'd like to go with a black T-shirt, black jeans and black boots. We now know that she went with the iconic pink hat.\n\n\"I can see now,\" she says. \"I don't need to have a million wigs on and all that shit to make a statement.\"\n\nHer first ever car accident was rear-ending Mark Ronson's Mercedes\n\nAs Gaga arrives at a session to record \"Hey Girl\" with Florence Welch of Florence + the Machine, we hear a bang before she confesses, \"I hit Mark's car.\" She goes inside and tells him, where he quips back playfully, \"I wish if you have a problem with me, just tell it to my face not to my bumper.\"\n\nGaga seems to be truly mortified and admits that this is her first ever car accident.\n\nShe was at the doctor when Joanne leaked\n\nJoanne leaked online when a record store at Belgium decided to sell the album early.\n\nGaga was at the doctor as this happened. She's describing to a doctor her atrocious pain and inflammation all over her body, how her hip hurts every day. The doctor suggests that they try and relieve her face pain, re-educate her muscles and do a blood spinning.\n\n\"While this is all occurring, my album is hemorrhaging all over the internet,\" Gaga says.\n\nShe checked on Joanne at Walmart\n\nGaga casually strolls into a Walmart with her manager, Bobby Campbell, to check the visibility of Joanne on the shelves. Initially, she asks a cashier, \"Do you have the new Lady Gaga album?\" And he genuinely has no idea what she's talking about or who he's talking to.\n\nIt's not until the store's manager is called -- \"I thought I was in trouble!\" says Gaga -- that everybody realizes that it's Lady Gaga asking for the new Lady Gaga album. Of course, mobs of people then begin asking her for photos.", "images": ["https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?4863e69cb9d656c61185", "https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/media/lady-gaga-five-foot-two-2017-billboard-1548-1024x677.jpg", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg"], "top_img": "https://static.billboard.com/files/media/lady-gaga-five-foot-two-2017-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Megan Armstrong"], "canonical_link": "https://www.billboard.com/articles/columns/pop/7965926/lady-gaga-five-foot-two-netflix-documentary-things-learned", "title": "11 Things We Learned in Lady Gaga's 'Five Foot Two' Netflix Documentary", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2017-09-22T13:18:25-04:00", "published_time": "2017-09-21T21:08:38-04:00"}, "description": "Lady Gaga will show all of herself to anyone who chooses to watch her new Netflix documentary 'Five Foot Two,' which is available beginning Friday, Sept. 22.", "og": {"description": "Lady Gaga will show all of herself to anyone who chooses to watch her new Netflix documentary 'Five Foot Two,' which is available beginning Friday, Sept. 22.", "image": {"identifier": "https://static.billboard.com/files/media/lady-gaga-five-foot-two-2017-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Lady Gaga's 'Five Foot Two' Netflix Documentary: 11 Things We Learned | Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/pop/7965926/lady-gaga-five-foot-two-netflix-documentary-things-learned", "site_name": "Billboard"}, "title": "11 Things We Learned in Lady Gaga's 'Five Foot Two' Netflix Documentary", "twitter": {"card": "summary_large_image", "description": "Lady Gaga will show all of herself to anyone who chooses to watch her new Netflix documentary 'Five Foot Two,' which is available beginning Friday, Sept. 22.", "image": "https://static.billboard.com/files/media/lady-gaga-five-foot-two-2017-billboard-1548-1024x677.jpg", "title": "11 Things We Learned in Lady Gaga's 'Five Foot Two' Netflix Documentary", "site": "@billboard"}}, "movies": [], "publish_date": 1506042518.0, "source": "https://www.billboard.com", "summary": ""}