{"url": "https://people.com/tv/bethenny-frankel-charters-four-planes-to-aid-hurricane-maria-victims/", "text": "One week after her trip to Mexico to aid victims of the devastating 7.1 magnitude earthquake, Bethenny Frankel is on the move again.\n\nThe Real Housewives of New York City star — who is currently recovering from skin cancer removal surgery with 12 stitches on her face — traveled to Puerto Rico to help Hurricane Maria victims.\n\nGet push notifications with news, features and more.\n\n“This is a forgotten island,” she tells PEOPLE. “People have been living on their roofs for 13 days. It is like nothing I have ever seen. People’s entire homes and cars are immersed in mud, the likes I’ve never seen.”\n\nImage zoom Courtesy Bethenny Frankel\n\nImage zoom Courtesy Bethenny Frankel\n\nFrankel, 46, chartered a total of four planes leaving from Miami, Fort Lauderdale and New Jersey to distribute more than 20,000 lbs. of donated medical and survival supplies: water, canned goods, diapers, baby food, medical supplies, toys, insulin (courtesy of Univision) — plus 2,000 pounds in non-perishable, nutrient-dense meals from Feeding America and City Harvest, $25,000 in cash gift cards and cash (courtesy of Yieldstreet) and $30,000 in Costco gift cards.\n\nWATCH: Bethenny Frankel Talks Puerto Rico Relief & Her #BStrong Initiative\n\nBesides her own money, Frankel paid for this out of thousands of dollars in donations from Andy Cohen, Donny Deutsch, Elvis Duran and others to her B Strong charity, in partnership with Delivering Good. In addition to donating $10,000 to her nonprofit and pitching in $20,000 for Frankel’s four private planes, Duran pledged $100,000 to Feeding America to help with disaster relief.\n\nUpon arrival, the planes were used to transport dozens of sick and wounded women and children, and cancer victims, from local hospitals to the United States for treatment.\n\nThe Global Empowerment Mission also helped with this cause, and Frankel is on track to raise more than a $1 million in donations and supplies for Puerto Rico alone.\n\nEndorsed by FEMA and the State Department in Puerto Rico, Frankel stopped in towns surrounding San Juan, visiting homes, a children’s hospital and more.\n\nImage zoom Courtesy Bethenny Frankel\n\n“We arrived in the first town before their own mayor,” she says. “We pulled onto a street with a truck of basic necessities, and you would have thought I was giving out diamonds. What struck me was people politely waiting in line patiently. They are so proud. I gave them cash cards in envelopes, and they were emotional yet still proud. Their faith is intact.”\n\n“There is no color on the island. Every palm tree is rooted. This bitch hit every inch of this island. The low death toll is only counting what happened when it hit, but a storm happens more gradually than a hurricane. Now is when people are dying. They are starving. They are thirsty. They cannot communicate. They cannot bathe themselves. They wash their babies and laundry in street water,” she adds. “It is a war zone. I do not play the blame game, but the 73 towns of Puerto Rico need to be methodically mapped out and visited, and the relief needs to be organized, delegated and executed.”\n\nRELATED VIDEO: Bethenny Frankel Travels to Mexico to Aid Earthquake Survivors: ‘To Say They Have Nothing Is an Understatement’\n\nSo far, Hurricane Maria — which ravaged the U.S. territory Sept. 20, leaving the entire island without electricity and destroying many homes — has claimed at least 16 lives in Puerto Rico, the Associated Press reports. Experts estimate that without electricity and supplies, that number could increase to thousands, and many residents are still without clean water, food and electricity.\n\nShe has already raised more than $300,000 for Houston and $150,000 for Mexico after their respective natural disasters.\n\nImage zoom Courtesy Bethenny Frankel\n\nFrankel is using Twitter as a platform to rally other celebrities to donate, as well as communicate with people on the island in need.\n\n“As of 36 hours ago, my team of complete strangers as of 36 hours ago has managed to load and distribute 3 planes (with 4 on deck) medical supplies, food, petcare, hygiene, food and transport home desperate, elderly, sick people,” she says. “Everyone pitched in. Crisis and relief is all about communication and dropping zero balls. If I had a bigger army we could really make a dent. This thing has only just begun. It is a startup.”\n\n“I need to also thank Guardians of Rescue, Omar Rosario, Nicole Castrillo, Saira Rivas, Margie Arbizo and Michael Capponi,” she concludes. “These people worked 24/7 on relief chats with her to make this happen. My friend Maria Menounos also reached out tirelessly help to connect with suppliers in her network. And without Twitter, this never would have happened. Twitter users literally saved babies’ lives by connecting me to pediatric hospital allowing me to transport patients home. It is the most incredible tool in the world.”\n\nTo donate, visit www.bstrongdeliveringgood.org/bstrong.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel-2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel-4-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel.jpg", "keywords": [], "authors": ["Aurelie Corinthios", "Liz Mcneil"], "canonical_link": "https://people.com/tv/bethenny-frankel-charters-four-planes-to-aid-hurricane-maria-victims/", "title": "Bethenny Frankel Charters 4 Planes to Aid Hurricane Maria Victims in Puerto Rico: 'It Is a War Zone'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bethenny Frankel,Charity,Hurricanes,News,Real Housewives,Real Housewives of New York City,TV", "news_keywords": "Bethenny Frankel,Charity,Hurricanes,News,Real Housewives,Real Housewives of New York City,TV", "description": "Real Housewives of New York City star Bethenny Frankel charted four planes to Puerto Rico", "og": {"title": "Bethenny Frankel Charters 4 Planes to Aid Hurricane Maria Victims in Puerto Rico: 'It Is a War Zone'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bethenny-frankel-charters-four-planes-to-aid-hurricane-maria-victims/", "description": "One week after her trip to Mexico to aid victims of the devastating&nbsp;7.1 magnitude earthquake, Bethenny Frankel is on the move again. The Real Housewives&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/bethenny-frankel-charters-four-planes-to-aid-hurricane-maria-victims/", "description": "Real Housewives of New York City star Bethenny Frankel charted four planes to Puerto Rico", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bethenny-frankel-charters-four-planes-to-aid-hurricane-maria-victims/", "title": "Bethenny Frankel Charters 4 Planes to Aid Hurricane Maria Victims in Puerto Rico: 'It Is a War Zone'", "description": "Real Housewives of New York City star Bethenny Frankel charted four planes to Puerto Rico", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fbethenny-frankel.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}