{"url": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "text": "Meg Ryan is undoubtedly one of Hollywood’s most iconic stars. In an illustrious career spanning more than four decades, she has featured in several unforgettable movies. She has also won a slew of awards while establishing herself as the rom-com queen. Unfortunately, all that glitters is not gold. Ryan has endured her fair share of scandals, including rumoured affairs, as well as a reported decade-long estrangement from her own mother. So, which of these is fact and which is fiction? All these and more are explored below.\n\nCareer Beginnings and Breakthrough\n\nMargaret Mary Emily Hyra (now popularly known as Meg Ryan) was born on the 19th of November 1961 in Fairfield, Connecticut. Her father is a maths teacher named Harry while her mother is an English teacher named Susan Jordan. The Hollywood thespian also has three siblings – Dana, Annie, and Andrew. Ryan grew up in Bethel, Connecticut, and completed her diploma at the local high school. She subsequently headed off to college, intent on getting a degree on journalism. While in college, the young lady ventured into acting and made her professional debut on the 1981 movie, Rich and Famous.\n\nShe subsequently appeared in several other movies and TV series before landing her career breakthrough on the 1989 rom-com, When Harry Met Sally. The film revolves around two graduates, Sally and Harry, who initially start out as friends but are forced to confront their growing feelings for each other. The movie featured Billy Crystal as Harry while Ryan portrayed the iconic role of Sally. Her excellent performance propelled her to the limelight and also fetched her a Golden Globe nomination for best actress in a comedy or musical.\n\nA Look At Meg Ryan’s Scandalous Love Life And Tumultuous Relationship With Her Mother\n\nMany celebrities cherish their moms and often credit them for helping them achieve great heights. However, for Ryan, the case seems to be different. The actress has been estranged from her mother, Susan Jordan, since 1990, and the rift shows no signs of healing. Trouble first started when Ryan’s parents split in 1976. The couple amicably agreed that Harry would get the kids while Susan would move out, get a job and then take the kids.\n\nSusan lived up to the agreement and moved out. She also made an effort to visit often but Ryan, nevertheless, felt abandoned by her mother. To further worsen matters; by the time Susan could afford to support her kids, Ryan was now in college and couldn’t live with her anymore. Despite the circumstances, the mother and daughter did not completely cut each other off. They remained on talking terms and Susan even helped her daughter to launch her acting career. The relationship between the two however deteriorated after the actress started dating her co-star, Dennis Quaid, in 1987.\n\nSusan disliked the fact that Quaid was erratic, and had a drug problem, and tried to dissuade her daughter from the romance. Ryan, however, refused to listen and when she wed Quaid in 1991, she did not invite her mom to the wedding. This face-off persisted during the actress’s decade-long marriage, and when she divorced her husband in 2001, she reportedly placed a portion of the blame on her mother. Her mother, however, dismissed these allegations.\n\nThe strained relationship between Meg Ryan and her mom also took a hit after the actress was involved in a romance with Aussie star, Russell Crowe. Ryan had commenced a relationship with Crowe while still legally married to Quaid, in 2001. The whole romance created a scandalous situation as many dubbed the actress as a cheat. Her mom also publicly rebuked her and this further widened the gap between them.\n\nTo this day, Ryan and her mom are not on speaking terms and Susan has described the whole estrangement as a painful business. According to her, she thinks of her daughter everyday and wishes that there would be forgiveness. Ryan, on her own part, is focusing on her kids, Jack and Daisy True. The actress is also in a relationship with rock legend, John Mellencamp. The couple first started dating in 2011, broke up in 2014 and reunited in 2017. They subsequently got engaged in 2018.\n\nPlastic Surgery Rumours\n\nDuring the 2016 Tony Awards, Meg Ryan appeared on the red carpet, sporting a new and jaw-dropping look. Her features raised several eyebrows and after a while, rumours began to fly around that the amazing actress had cosmetic surgery. Some people suggested that she had done a total face-lift while some others limited their own assessment to just fillers. Ryan has since refused to confirm or deny these rumours. One thing that remains for sure is that the actress looks quite gorgeous for her age.\n\nView this post on Instagram #tbt @esquire 📷 @jameswhitefoto A post shared by Meg Ryan (@megryan) on Nov 30, 2017 at 10:09am PST\n\nHow Rich Is Meg Ryan?\n\nRyan has a net worth of $45 million and her primary source of income remains her prolific acting career. Since her 1989 breakthrough, the Connecticut native has gone on to feature in over 30 movies and TV series. During the ’90s, Ryan appeared in movies such as The Doors, Sleepless in Seattle, I.Q., City of Angels, Anastasia, Addicted to Love, Courage Under Fire, and French Kiss. During the early 2000s, she featured in several movies such as Proof of Life, Hanging Up, Kate & Leopold, In the Cut, Against the Rocks, and Rocky. Ryan took a temporary break from acting in 2004. She returned in 2007 and has since featured in movies such as In the Land of Women, The Deal, The Graduate, My Mom’s New Boyfriend, Long Time Gone, Half the Sky, How I Met Your Dad, Fan Girl, and Web Therapy etc.", "images": ["https://heightline.com/wp-content/uploads/Ryan-1-e1577969686268.jpg", "https://heightline.com/wp-content/uploads/Nwobodo-Ikenna-150x150.jpg", "https://heightline.com/wp-content/uploads/20190617170853f7-01fe-66c8-8451-7a1b6c56aced.jpg", "https://heightline.com/wp-content/uploads/logo_heightline.png", "https://heightline.com/wp-content/uploads/Ryan2-e1577969483155.jpg"], "top_img": "https://heightline.com/wp-content/uploads/Ryan-1-e1577969686268.jpg", "keywords": [], "authors": ["Ikenna Nwobodo"], "canonical_link": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "title": "Unveiled Truths About Meg Ryan’s Scandalous Relationships, Net Worth and Body Enhancement", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Meg Ryan has had a glorious career. However, when it comes to her personal life, it is a mixed bag of fortunes as the actress has been estranged from her ...", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Unveiled Truths About Meg Ryan's Scandalous Relationships, Net Worth and Body Enhancement", "description": "Meg Ryan has had a glorious career. However, when it comes to her personal life, it is a mixed bag of fortunes as the actress has been estranged from her ...", "url": "https://heightline.com/meg-ryan-bio-plastic-surgery-net-worth/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People", "updated_time": "2020-03-17T16:13:44+00:00", "image": {"identifier": "https://heightline.com/wp-content/uploads/Ryan-1-e1577969686268.jpg", "secure_url": "https://heightline.com/wp-content/uploads/Ryan-1-e1577969686268.jpg", "width": 640, "height": 392}}, "article": {"author": "https://web.facebook.com/nwobodoi", "tag": "Xmas", "section": "Actresses", "published_time": "2018-07-26T12:12:35+00:00", "modified_time": "2020-03-17T16:13:44+00:00"}, "twitter": {"card": "summary", "description": "Meg Ryan has had a glorious career. However, when it comes to her personal life, it is a mixed bag of fortunes as the actress has been estranged from her ...", "title": "Unveiled Truths About Meg Ryan's Scandalous Relationships, Net Worth and Body Enhancement", "image": "https://heightline.com/wp-content/uploads/Ryan-1-e1577969686268.jpg"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1532607155.0, "source": "https://heightline.com", "summary": ""}