{"url": "https://www.dailymail.co.uk/tvshowbiz/article-4484014/Tom-Daley-wedding-cake-nuptials.html", "text": "Advertisement\n\nThey vowed to spend the rest of their lives together in a lavish wedding ceremony at Bovey Castle, near Plymouth, Devon on Saturday.\n\nAnd Tom Daley and Dustin Lance Black took to their Instagram pages on Monday morning to excitedly share the first photos from their stunning nuptials.\n\nThe Olympic diver, 22, uploaded a photo of him and his new husband, 42, walking down the aisle hand-in-hand - sweetly telling fans in the caption that he had finally married 'the love of his life'.\n\nScroll down for video\n\nI do! Tom Daley and Dustin Lance Black took to their Instagram pages on Monday morning to share the first photos from their nuptials\n\nWe did it: Meanwhile Dustin shared a more intimate moment of the day by posting a photo of him and Tom clasping hands after the ceremony, in the stunning Bovey Castle grounds (above)\n\n'When all my hopes came true': Dustin posted a loving tribute to his new husband after their fairytale big day\n\nExplosive: Tom later shared a snap of the fireworks display as the couple cosied up to one another\n\nThe first exciting glimpse of their big day showed the loved-up pair walking back down the aisle after tying the knot - to the delight of their applauding guests.\n\nThe couple, who have been together for four years, looked overcome with joy as they ventured down the aisle in stylish Burberry suits, with their beaming faces clear to see.\n\nClearly excited to share the special occasion with his fans, Tom wrote to his 1.8 million followers beside the snap: 'On 6th May 2017, I married the love of my life.\n\n'We shared the day with 120 of our closest friends and family, from Texarkana to Plymouth! Thank you to everyone who made this weekend the most special weekend of our lives!'\n\nPartied too hard? The newlyweds were then looking slightly bleary-eyed on Monday as they stepped out in London following a weekend of celebrations\n\nHoneymoon period: The newly-married couple headed out for a Bucks Fizz lunch in London together for the first time since their lavish wedding at Bovey Castle in Tom's native Plymouth\n\nPut a ring on it! The pair sports their matching wedding bands as they headed out for continued celebrations\n\nHe then followed the caption up with the playful hashtag '#NoRomeo'.\n\nMeanwhile Dustin shared a more intimate moment of the day to commemorate their union - posting a photo of him and Tom clasping hands after the ceremony, away from their family and friends.\n\nThe duo, who share a twenty-year age gap, look more loved-up than ever in the snap as they posed on a bridge in the stunning Bovey Castle grounds, gazing into each other's eyes.\n\nMaking the romantic snap more light-hearted however, the filmmaker wrote teasingly beside it: 'So... what did you get up to this weekend?'\n\nMaster baker: It seems Tom Daley, 22, and Dustin Lance Black, 42, were involved in every step of their nuptials on Saturday - with the diver (above) even baking his own wedding cake\n\nNew intimate details of their wedding on Saturday had emerged on Monday morning, proving the pair had been involved in every step of their special day.\n\nAccording to The Mirror, the Olympic diver and the actor had their personalities 'stamped on every detail' - with guests enjoying a wedding cake made by Tom himself, before his family gave touching speeches in tribute to his late father Rob.\n\nThe paper reports that the pair had injected their personalities and families in every element of the wedding - with Tom's love of food, having released a cookbook earlier this year, coming in to play.\n\nMarrying at the stunning Bovey Castle, guests feasted on British classics such as beef wellington, sausage and mash and Eton Mass.\n\nFlying the flag: Sources reveal guests feasted on British classics like beef wellington, sausage and mash and Eton Mass, before enjoying Tom's homemade multi-tiered wedding cake\n\nParty-goers then toasted the couple with flutes of champagne, before they devoured a piece of Tom's homemade multi-tiered wedding cake, decorated with psychedelic icing.\n\nAfter the breakfast, the attention then turned to speeches, with grooms Tom and Lance kicking off proceedings before Tom's mother Debbie stood before guests.\n\nIt was reported that Debbie had paid a touching tribute to Tom's late father Rob during her speech, following his untimely death from a brain tumour in 2011.\n\nMusic also played a big part in the pair's big day - with a string quartet playing as they walked down the aisle, before members of the London Gay Men's Choir sang Marry You by Bruno Mars after their union became official.\n\nEmotional: It was reported that Tom mum's Debbie paid a touching tribute to his late father Rob (above) during her speech, following his untimely death from a brain tumour in 2011\n\nYou make my heart sing: A string quartet playing as the pair walked down the aisle, before members of the London Gay Men's Choir sang Marry You by Bruno Mars\n\nAfter a night of dancing and festivity, the ceremony then went out with a bang as the pair organised an extravagant fireworks display at 10pm.\n\nInsiders told the paper that the pair's nuptials had been truly 'beautiful', and reflected their personality as a couple at every angle.\n\nA source told the Plymouth Herald: 'It was a beautiful ceremony, their vows were so brilliant and heartfelt.\n\n'Tom and Lance organised the wedding themselves and it had their personalities stamped on every detail.'\n\nThe festivities had occurred on Saturday, when the pair finally tied the knot after four years together.\n\nHappy ever after! The festivities had occurred on Saturday, when the pair finally tied the knot after four years together\n\nAccording to The Sun, the 22-year-old had recreated the scene in Shakespeare's Romeo and Juliet stood on the balcony in front of guests as he professed his love to his beau, 42.\n\nHe is said to have delivered the star-crossed lover's famous lines: 'O Romeo, Romeo, wherefore art thou, Romeo?'\n\nThe lovebirds were happily married in the Cathedral Room at the stately home before guests toasted to the couple's happiness with a glass of champagne.\n\nThe after party was hosted in the Dartmoor Suite ballroom where people danced the night away until the early hours of the morning.\n\nLove: The diver, 22, recreated the scene in Shakespeare's Romeo and Juliet stood on the balcony in front of guests as he professed his love to his beau, 42, at Bovey Castle, near Plymouth, Devon\n\nRevealed: The lovers were happily married in the Cathedral Room at the stately home before guests enjoyed a three-course meal\n\nMailOnline has contacted Daley's representatives for comment.\n\nThe Olympic diver and the filmmaker tied the knot after they got engaged in October 2015.\n\nThe pair - who have a 20-year age gap - recently celebrated their four-year anniversary, insisting they had moved on from the cheating scandals.\n\nTom and Lance are determined to put on a united front in the wake of accusations about the Olympic diver having an '18-month affair with a male model'.\n\nMaking it official: The Olympic diver and the filmmaker were reportedly married in front of friends and family in a lavish ceremony\n\nSuggesting they have now put the claims well and truly behind them, Dustin took to Twitter last month to sweetly mark his four year anniversary with the Team GB athlete.\n\nIn a loving post, the screen writer shared a photo of himself and Tom in high spirits as they posed for a selfie together while wearing matching Ray-Ban sunglasses.\n\nWhile he is seen planting a kiss on the sports star, Tom couldn't look happier as he beamed for the camera.\n\nAlongside the cute throwback picture of the pair, Dustin revealed it had been taken on a trip to Cornwall in 2013, while adding: 'Happy Anniversary my love. 3.22.13 #FourYears.'\n\n'Happy anniversary my love': The screenwriter marked four years together with Tom by sharing a throwback photo of the couple during a trip to Cornwall in 2013\n\nTom, meanwhile, shared an artistic shot of Dustin sitting in the sunshine.\n\nHe posted two love heart emojis alongside it and simply tweeted the date his romance with the Academy Award winner begun: '22.03.13.'\n\nThe engaged couple's anniversary posts come just weeks after their relationship was rocked by claims accusing Tom of being unfaithful two years ago.\n\nIt was reported the athlete had an 18-month affair with a male model Edward William while his movie maker fiance was working abroad.\n\nAccording to the claims, Tom had met Edward in the street and the duo began chatting online in 2014 - he is thought to have exchanged sexually explicit messages with the 27-year-old and had 'physical' liaisons with him.\n\nAffair allegations: It's been reported the Team GB star sent male model Edward William 'sexually explicit messages' and had 'physical' liaisons with him\n\nA source told The Sun in February: 'Ed said the messages Tom sent would say things like, 'I'm home and horny, can you come round?'\n\n'Others would say, 'Lance is away, are you going to be about?' Ed told them it was a purely physical relationship with not much emotion involved.\n\n'He said Tom was very confident and forward with a huge sex drive.'\n\nTheir 'affair' is said to have ended in 2015, but it was claimed Tom and Edward had still been in touch as of last month.\n\nBack on track: Tom and his movie maker beau have brushed off the accusations and confirmed things between them are 'all good' in an Instagram video\n\nThe allegations came after the diving ace previously confessed to having an online tryst with another man while taking a secret break from his relationship with Dustin.\n\nHe admitted the duo had been on a seven-month 'break' due to demanding work commitments.\n\nTom has since made sure to put on a united front with his husband-to-be and during a trip to San Francisco not long after the allegations first surfaced, the pair proved they are now stronger than ever.\n\nTom shared a clip of himself and Dustin to Instagram and was seen asking his beau: 'Are we good?' to which Dustin shouted back, 'Yeah, we're good'.\n\nMoving forward: The Olympian was seen asking his beau in the video: 'Are we good?' to which Dustin shouted back, 'Yeah, we're good'\n\nTom first announced he and Dustin were engaged in October 2015.\n\nHe has since insisted that he knew he wanted to settle down with Dustin just a week into their romance.\n\nTom claimed it only took a month of being together before the duo discussed marriage and told The Mirror: 'After the first week we'd been together, I just knew.\n\n'And ever since then it's just felt like a waste of time not being married to Lance.'", "images": ["https://i.dailymail.co.uk/i/pix/2017/05/08/15/3FF3A2B400000578-4484014-Happy_ever_after_The_festivities_had_occurred_on_Saturday_when_t-a-2_1494254262752.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/furniture/fff/hub_link.png", "https://i.dailymail.co.uk/i/pix/2017/04/27/21/3FAC2B3600000578-0-image-m-65_1493323423737.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/3FF3A2C800000578-4484014-Flying_the_flag_Sources_reveal_guests_feasted_on_British_classic-a-343_1494248750213.jpg", "https://a3655836d5c58a086ac2-4e8d43a89f100386d472e9f1a1dc59ca.ssl.cf3.rackcdn.com/images/extraextralarge/965840244_01.jpg?lg-inline", "https://i.dailymail.co.uk/i/pix/2017/05/08/17/40191A2100000578-4484014-image-m-3_1494262731207.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/19/27331352-0-image-m-22_1587149954129.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/09/10/4020374500000578-0-image-a-28_1494321806342.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/23/27364420-0-image-m-4_1587249369709.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4006E0B700000578-4484014-Love_The_diver_22_recreated_the_scene_in_Shakespeare_s_Romeo_and-a-347_1494248750215.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/15/3FF3A29900000578-4484014-Back_on_track_Tom_and_his_movie_maker_beau_have_brushed_off_the_-a-6_1494254634297.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/furniture/fff/fff-hub-banner-wide.png", "https://i.dailymail.co.uk/i/pix/2017/05/08/07/4014129100000578-0-image-a-27_1494225773209.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/02/27368358-0-image-a-42_1587259780504.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4015982C00000578-4484014-We_did_it_Meanwhile_Dustin_shared_a_more_intimate_moment_of_the_-a-339_1494248750211.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/3FF3A2A800000578-4484014-You_make_my_heart_sing_A_string_quartet_playing_as_the_pair_walk-a-345_1494248750214.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/16/4017F6D500000578-4484014-Put_a_ring_on_it_The_pair_sports_their_matching_wedding_bands_as-a-65_1494259059730.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/02/27368990-0-image-m-25_1587260965872.jpg", "https://cache.mrporter.com/images/products/738678/738678_mrp_ou_l.jpg", "https://i.dailymail.co.uk/i/pix/2017/04/05/03/3EF3B31200000578-0-image-a-41_1491358624669.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/20/27360080-0-image-m-16_1587237279637.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/10/27376286-0-image-a-1_1587288977499.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/03/27369744-0-image-m-31_1587264231153.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/0B91A41B000005DC-4484014-Emotional_It_was_reported_that_Tom_mum_s_Debbie_paid_a_touching_-a-344_1494248750213.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4017F66F00000578-4484014-Honeymoon_period_The_newly_married_couple_headed_out_for_a_Bucks-m-353_1494248775331.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/05/08/15/0BA809F700000578-4484014-Moving_forward_The_Olympian_was_seen_asking_his_beau_in_the_vide-a-7_1494254634368.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "http://media.topman.com/wcsstore/TopMan/images/catalog/TM87J40OBRN_Large_F_31.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/15/4017F5E100000578-4484014-Partied_too_hard_The_newlyweds_were_then_looking_slightly_bleary-a-1_1494254262750.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/1s/2020/04/19/03/27369786-0-image-m-34_1587264666213.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-hub-promo-banner-inline.png", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/3FF3A2DD00000578-4484014-Making_it_official_The_Olympic_diver_and_the_filmmaker_were_repo-a-349_1494248750259.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/13/27350900-0-image-a-3_1587211974034.jpg", "http://images.asos-media.com/groups/asos-skinny-burgundy-suit/12530-group-1", "https://i.dailymail.co.uk/i/furniture/fff/preload-inline.gif", "https://i.dailymail.co.uk/i/pix/2017/05/08/15/3FF3A2BE00000578-4484014-Wedding_prep_Tom_and_Dustin_announced_their_engagement_in_Octobe-a-5_1494254634213.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/21/27362202-0-image-m-1_1587242307813.jpg", "https://i.dailymail.co.uk/i/pix/2017/04/27/20/3FAC10D400000578-0-image-a-61_1493321037901.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/3FF3A2CD00000578-4484014-Master_baker_It_seems_Tom_Daley_22_and_Dustin_Lance_Black_42_wer-a-342_1494248750212.jpg", "https://i.dailymail.co.uk/i/pix/2017/03/22/18/3E892D4C00000578-4339726-Affair_allegations_It_s_been_reported_the_Team_GB_star_sent_male-a-9_1490209068251.jpg", "https://s-media-cache-ak0.pinimg.com/736x/d5/3c/4f/d53c4fa4947dbbe462602e4f8aaa6660.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4017F5FD00000578-4484014-image-a-354_1494248783011.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/21/27361614-0-image-m-19_1587241111598.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/03/27369280-0-image-m-28_1587262220265.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4015981F00000578-4484014-I_do_Tom_Daley_and_Dustin_Lance_Black_took_to_their_Instagram_pa-a-338_1494248750210.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/14/4006E24800000578-4484014-Revealed_The_lovers_were_happily_married_in_the_Cathedral_Room_a-a-348_1494248750215.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-logo-lowercase.png", "https://i.dailymail.co.uk/i/pix/2017/04/30/15/3FC668D000000578-0-image-m-119_1493561056735.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-banner-wide.png", "https://i.dailymail.co.uk/i/pix/2017/03/22/18/3E88E01500000578-0-image-a-1_1490205941892.jpg", "https://i.dailymail.co.uk/i/pix/2017/05/08/16/4019165900000578-4484014-image-m-68_1494259092873.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/05/09/10/4020374500000578-0-image-a-28_1494321806342.jpg", "keywords": [], "authors": ["Julia Pritchard", "Lily Waddell", "Kate Thomas For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/tvshowbiz/article-4484014/Tom-Daley-wedding-cake-nuptials.html", "title": "Tom Daley and Dustin Lance Black share wedding photos", "meta_data": {"keywords": "dailymail,tvshowbiz,Instagram,Tom Daley", "news_keywords": "dailymail,tvshowbiz,Instagram,Tom Daley", "original-source": "https://www.dailymail.co.uk/tvshowbiz/article-4484014/Tom-Daley-wedding-cake-nuptials.html", "description": "According to The Mirror, the Olympic diver and the actor had their personalities 'stamped on every detail' of the nuptials - with Tom even making his own wedding cake.", "channel": "Celebrities,Entertainment,TV,Tv&Showbiz", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Tom Daley shares first photo of wedding to Dustin Lance Black", "description": "According to The Mirror, the Olympic diver and the actor had their personalities 'stamped on every detail' of the nuptials - with Tom even making his own wedding cake.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-4484014/Tom-Daley-wedding-cake-nuptials.html", "image": "https://i.dailymail.co.uk/i/pix/2017/05/09/10/4020374500000578-0-image-a-28_1494321806342.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4484014, "author": "Julia Pritchard", "divclasspage": "articlePage", "mol": {"headline": "'I married the love of my life': Tom Daley, 22, gushes about new husband Dustin Lance Black, 42, as they share the first photos from their stunning castle wedding"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-05-08T09:42:37+0100", "modified_time": "2017-05-09T10:25:02+0100", "section": "TV&Showbiz", "tag": "Tom Daley wedding cake nuptials", "author": "https://www.facebook.com/DailyMailCeleb"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Tom Daley shares first photo of wedding to Dustin Lance Black", "type": "article", "description": "According to The Mirror, the Olympic diver and the actor had their personalities 'stamped on every detail' of the nuptials - with Tom even making his own wedding cake.", "url": "http://www.dailymail.co.uk/~/article-4484014/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/05/09/10/4020374500000578-0-image-a-28_1494321806342.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/01/13/1356723402201320986/1024x576_MP4_1356723402201320986.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4484014/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4484014/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1494232957.0, "source": "https://www.dailymail.co.uk", "summary": ""}