{"url": "en.wikipedia.org/wiki/Mike_Fisher_(ice_hockey)", "text": "Michael Andrew Fisher (born June 5, 1980) is a Canadian-American former professional ice hockey centre who played for the Ottawa Senators and Nashville Predators in the National Hockey League (NHL). He was drafted by the Senators in the second round, 44th overall, in the 1998 NHL Entry Draft.[1]\n\nPlaying career [ edit ]\n\nJunior [ edit ]\n\nFisher grew up playing hockey in the Peterborough Minor Hockey Association (OMHA) with the rep Minor Petes program.[citation needed] He was drafted from Jr. A Peterborough Petes (OHA) by the Sudbury Wolves in the second round, 22nd overall, in the 1997 OHL Priority Draft.[2] After putting up 49 points in 66 games in his first year with the Wolves, Fisher was drafted in the second round, 44th overall, by the Ottawa Senators in the 1998 NHL Entry Draft. Returning to the OHL for one more season, Fisher recorded 106 points, fifth overall in league scoring.[3]\n\nOttawa Senators [ edit ]\n\nFisher debuted with the Senators in 1999–2000 and recorded 9 points in an injury-shortened 32-game rookie season. He became known for his aggressive style of play and began to also show his penchant for offensive production as he improved to 18 goals and 38 points in his fourth season in 2002–03.\n\nDuring the lock-out year of 2004–05, Fisher played overseas for EV Zug in the Swiss Nationalliga A. As NHL play resumed the next season, in 2005–06, Fisher emerged with 22 goals and 44 points, providing valuable secondary scoring for the Spezza-Heatley-Alfredsson line. He helped the Senators to a first seed in the Eastern Conference going into the playoffs, but they were defeated by the fourth-seeded division rivals Buffalo Sabres in five games in the second round. With a career-high plus-minus (+/-) rating of +23 in the regular season, Fisher was nominated for the Frank J. Selke Trophy as the best defensive forward. He finished as second runner-up behind Jere Lehtinen of the Dallas Stars and trophy-winner Rod Brind'Amour, captain of the Stanley Cup champion Carolina Hurricanes.[4]\n\nThe following season, Fisher duplicated his previous campaign's goals total with 22 and improved to a personal best 26 assists and 48 points. He was kept to 68 games due to a left knee injury, sustained on December 27, 2006, against the New York Islanders,[5] forcing him to sit out four weeks. In the playoffs, Fisher helped the Senators to the 2007 Stanley Cup Finals, where they fell short to the Anaheim Ducks in five games. Fisher posted career playoff highs with 5 goals, 5 assists and 10 points in 20 games.\n\nWith one year left on his contract heading into the 2007–08 season, Fisher re-signed with the Senators to a five-year, $21 million contract extension.[6] He went on to set a career-high 23 goals that season. However, Fisher was forced to miss the playoffs, injuring his left knee in a knee-on-knee hit from Toronto Maple Leafs forward Mark Bell in the final game of the regular season.[7]\n\nA month and a half into the 2008–09 season, Fisher suffered another knee injury, straining a ligament in his right knee against the New York Islanders on November 17, 2008.[8]\n\nNashville Predators [ edit ]\n\nOn February 10, 2011, Fisher was traded to the Nashville Predators in exchange for the Predators' 2011 first round draft pick (Stefan Noesen) and a conditional pick in 2012 (Jarrod Maidens). The condition was that should the Predators win a playoff series, the Senators would receive a third-round pick, and a second round pick if the Predators won two or more playoff series.[9] The Predators won their first round playoff but ultimately lost their second round series, to the Vancouver Canucks, meaning the Senators received a third-round pick. According to Fisher, although there were many trade deals for him, Ottawa GM Bryan Murray and Ottawa owner Eugene Melnyk had chosen to accept Nashville's offer so that Fisher could be closer to his wife, country singer Carrie Underwood.[10][11]\n\nFisher played his first game with the Predators on February 12, 2011, and scored an assist in a 5–3 win over the Colorado Avalanche. He scored his first goal as a Predator five days later, on February 17, against the Vancouver Canucks.\n\nFisher was the winner of the 2012 NHL Foundation Player Award, awarded to the NHL player who applies the core values of hockey – commitment, perseverance and teamwork – to enrich the lives of people in his community.[12]\n\nOn June 26, 2015, just prior to becoming an unrestricted free agent on July 1, Fisher signed a two-year, $8.8 million contract extension with the Predators, paying $4.8 million in 2015–16 and $4 million in 2016–17.[13]\n\nOn May 5, 2016, he scored with 8:48 left in triple overtime in game four of the Western Conference Semi-finals to beat the San Jose Sharks 4–3, tying the series at two games apiece.\n\nOn September 7, 2016, Fisher was named the sixth captain of the Predators after previous captain Shea Weber was traded to the Montreal Canadiens for defenceman P. K. Subban. He led the Predators to the 2017 Stanley Cup Finals eventually losing to the Pittsburgh Penguins in six games. On August 3, 2017, Fisher announced his retirement from the NHL via a letter addressed to Predators fans in that day's edition of The Tennessean,[14] becoming the first Predators captain to retire with the team.[15]\n\nOn January 31, 2018, Fisher announced that he intended to end his retirement to help the Predators make another Stanley Cup run. Fisher said that he would practice with the Predators and eventually sign a contract before the trade deadline of February 26, 2018.[16] On February 26, 2018, Fisher signed a one-year contract with the Predators.[17]\n\nOn May 12, 2018, Fisher announced his re-retirement, a few days after the Predators were eliminated in the second round of the playoffs by the Winnipeg Jets.[18]\n\nPersonal life [ edit ]\n\nFisher was born and raised in Peterborough, Ontario, to parents Jim and Karen[19] and is a devout Christian.[20] He has two brothers (Rob and Gregory, aka \"Bud\") and one sister (Meredith).[21] Fisher's uncle is David Fisher, a former chaplain to the Toronto Blue Jays baseball club.[22] Fisher's brother Gregory is also a hockey player; he is a goaltender who played for Quinnipiac University in the ECAC.[23][19] On October 23, 2009, Gregory replaced the Senators' then-starting goaltender Pascal Leclaire in net during a Senators' practice after Leclaire fell ill.[24]\n\nIn the off-season, Fisher devotes time to hockey camps in his hometown in Peterborough, Kingston and Ottawa through Hockey Ministries International.[20] Fisher has also been a guest instructor at the Roger Neilson Hockey Camp.[25]\n\nFisher is married to American singer Carrie Underwood. They met backstage after one of Underwood's concerts in 2008. The couple became engaged on December 20, 2009. The engagement was confirmed by Fisher the next morning during the Senators' morning skate.[26] On July 10, 2010, Fisher married Underwood at The Ritz-Carlton Lodge, Reynolds Plantation, in Greensboro, Georgia, with more than 250 people in attendance.[27][28] Underwood surprised Fisher by having one of their favourite artists, Brandon Heath, sing his song \"Love Never Fails\" for their first dance.[29] It was announced on September 1, 2014, that Fisher and Underwood were expecting their first child together. In February 2015, Underwood gave birth to their first child, a son.[30] In January 2019, she gave birth to their second son.[31]\n\nOn March 21, 2019, Fisher became a United States citizen.[32]\n\nCareer statistics [ edit ]\n\nRegular season and playoffs [ edit ]\n\nRegular season Playoffs Season Team League GP G A Pts PIM GP G A Pts PIM 1996–97 Peterborough Bees OJHL 51 26 30 56 56 — — — — — 1997–98 Sudbury Wolves OHL 66 24 24 49 64 9 2 2 4 13 1998–99 Sudbury Wolves OHL 66 41 65 106 55 4 2 1 3 4 1999–00 Ottawa Senators NHL 32 4 5 9 15 — — — — — 2000–01 Ottawa Senators NHL 60 7 12 19 46 4 0 1 1 4 2001–02 Ottawa Senators NHL 58 15 9 24 55 10 2 1 3 0 2002–03 Ottawa Senators NHL 74 18 20 38 54 18 2 2 4 16 2003–04 Ottawa Senators NHL 24 4 6 10 39 7 1 0 1 4 2004–05 EV Zug NLA 21 9 18 27 39 9 2 3 5 20 2005–06 Ottawa Senators NHL 68 22 22 44 64 10 2 2 4 12 2006–07 Ottawa Senators NHL 68 22 26 48 41 20 5 5 10 24 2007–08 Ottawa Senators NHL 79 23 24 47 82 — — — — — 2008–09 Ottawa Senators NHL 78 13 19 32 66 — — — — — 2009–10 Ottawa Senators NHL 79 25 28 53 59 6 2 3 5 6 2010–11 Ottawa Senators NHL 55 14 10 24 33 — — — — — 2010–11 Nashville Predators NHL 27 5 7 12 10 12 3 4 7 11 2011–12 Nashville Predators NHL 72 24 27 51 33 10 1 3 4 8 2012–13 Nashville Predators NHL 38 10 11 21 27 — — — — — 2013–14 Nashville Predators NHL 75 20 29 49 60 — — — — — 2014–15 Nashville Predators NHL 59 19 20 39 39 3 0 1 1 0 2015–16 Nashville Predators NHL 70 13 10 23 29 14 5 2 7 2 2016–17 Nashville Predators NHL 72 18 24 42 55 20 0 4 4 2 2017–18 Nashville Predators NHL 16 2 2 4 8 12 1 0 1 2 NHL totals 1,104 278 311 589 815 146 24 28 52 91\n\nInternational [ edit ]\n\nYear Team Event Result GP G A Pts PIM 2005 Canada WC 9 0 1 1 4 2009 Canada WC 9 2 3 5 14 Senior totals 18 2 4 6 18", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Silver_medal_icon.svg/16px-Silver_medal_icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Mike_Fisher.jpg/230px-Mike_Fisher.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Mike_Fisher_%284144850605%29.jpg/170px-Mike_Fisher_%284144850605%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/0/09/Mike_Fisher.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/09/Mike_Fisher.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mike_Fisher_(ice_hockey)", "title": "Mike Fisher (ice hockey)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/09/Mike_Fisher.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}