{"url": "https://www.brides.com/gallery/princess-diana-prince-charles-royal-wedding", "text": "Before there was Will and Kate and before there was Harry and Meghan, there was Charles and Diana. Though the marriage didn't have quite the happy ending expected, Diana's wedding in July of 1981 was the fairytale everyone wanted. Ask anyone who was alive in 1981 to tell you where they watched Prince Charles and Diana's royal wedding and we bet they have it engraved in their memory. Watched by one billion spectators the world over, Charles and Diana's \"I dos\" were nothing short of spectacular. From Princess Diana's over-the-top wedding dress (which like Kate Middleton's and now Meghan Marke's spawned an entire generation of look-alike brides), to the 27 wedding cakes, and the throngs of spectators waiting to wish the couple well, every detail of this royal wedding has been pored over and over for the last three (almost four!) decades.\n\nWant even more royal wedding bliss? We've scoured the depths of the internets to bring you 30 photos from Prince Charles and Princess Diana's wedding we bet you haven't seen. Keep scrolling royal wedding junkies.\n\nGetty Images\n\nLike every couple, Charles and Diana had to attend a rehearsal at St. Paul's Cathedral before making it down the aisle. Several thousand onlookers had already gathered to await the royal couple's wedding as they emerged from the hour-long rehearsal.\n\nThe Prince of Wales proposed after six months of dating Diana, but the engagement was kept secret for several weeks while Diana selected the now-famous £30,000 sapphire-and-diamond engagement ring which was not designed specifically for her. The engagement ring was part of crown jewelers Garrard's regular collection.\n\nGetty Images\n\nDiana's bridesmaids included the daughters of important royal friends, including Princess Margaret's daughter; Winston Churchill's great-granddaughter; Charles' goddaughter India Hicks; Charles' racehorse trainer's daughter; and the daughter of close friends of the prince. The girls wore scalloped dresses with yellow sashes by Emanuel, and carried baskets of yellow roses and wildflowers. Fashion editor Suzy Menkes wrote in the The Times that they looked like \"they could have been plucked from a Victorian child's scrapbook.\"\n\nGetty Images\n\nGetty Images\n\nDiana's wedding dress was by Emanuel, a couture label designed by Welsh-born David Emanuel and his wife Elizabeth. The Emanuels code-named their client Deborah and hired two guards to help keep the design a secret (their Mayfair studio was constantly swarmed by paparazzo trying to point their camera lenses into the windows).\n\nThe trend-defining gown was made of ivory silk taffeta and antique lace that once belonged to Queen Mary, and was hand-embroidered with mother-of-pearl sequins and 10,000 pearls. The first knockoff, rendered in polyester satin, was in a department store barely five hours after the ceremony.\n\nGetty Images\n\nDiana accessorized with matching silk and lace wedding slippers decorated with 150 pearls and over 500 sequins, made by royal cobbler Clive Shilton. The soles were made of suede to prevent slipping, and the heels were kept low so that she wouldn't be taller than Prince Charles (Diana was 5'10\"). The arches were hand-painted with a floral pattern and the letters \"C\" and \"D\" around a tiny heart.\n\nShe also wore the Spencer family tiara and a 40 foot-long veil embroidered with sequins, and carried a cascading bouquet of gardenias, stephanotis, freesias, orchids, lily of the valley, Earl Mountbatten roses (a tribute to Charles' late uncle, Lord Louis Mountbatten), ivy, veronica, and myrtle (a royal wedding tradition).\n\nGetty Images\n\nThe U.K. declared a public holiday to mark what the press referred to as \"the wedding of the century.\" 750 million people watched the televised ceremony worldwide (the audience was one billion when radio listeners are included). 600,000 spectators lined the procession route, while 4,000 police and 2,200 military officers did their best to manage the crowds. The Times described it as a \"carnival atmosphere,\" with onlookers singing, dancing, and waving British flags—some even painted the Union Jack on their faces. Other revelers near Buckingham Palace used the fountain at the base of Queen Victoria's statue to chill Champagne.\n\nGetty Images\n\nStarting from Buckingham Palace, the wedding party and the royal family rode to the ceremony in horse-drawn carriages, complete with footmen. 20-year-old Diana made the journey from Clarence House (further down the Mall) in a glass coach with her father, the Earl of Spencer.\n\nGetty Images\n\nGetty Images\n\nCharles and Diana traveled to Buckingham Palace for the reception in an open carriage, as the adoring crowds cheered and waved—some even tossed rice and rose petals at the couple.\n\nGetty Images\n\nThe ceremony was held at St. Paul's Cathedral rather than at Westminster Abbey, where royal weddings are generally held, because the grandiose cathedral offered more seating. Trumpeters sounded as Diana exited her carriage with her record-breaking 25 foot train. \"[At rehearsals] a dust cloth was tied at Diana's waist and we were shown how to fold and unfold the fabric so it would glide behind the bride,\" bridesmaid India Hicks later recalled to Tatler. \"On the day itself...panic took over and we resorted to a lot of pushing and creasing.\"\n\nGetty Images\n\nThere were 3,500 people in the congregation at St. Paul's Cathedral watching when Diana broke with tradition by excluding the promise to \"obey\" her husband in her vows, instead promising to \"love him, comfort him, honor and keep him in sickness and health.\" The newlyweds exited the cathedral to Elgar's \"Pomp and Circumstance No. 4.\"\n\nGetty Images\n\nPrince Charles whispers something to his bride. Hopefully it was something as charming as Prince Harry's \"wait until you see her,\" to Prince William on his wedding day.\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nThe royal marriage certificate was signed by both Charles and Diana as well as the Archbishop of Canterbury.\n\nGetty Images\n\nGetty Images\n\nShortly before the wedding party posed for pictures on the palace's balcony, police allowed the crowd to spill out onto the Mall—many raced up to the gates of the palace and some even climbed into the fountain to get a better view. As Charles and Diana appeared on the balcony, \"a rapturous cheer swept from the palace gates down the length of the Mall,\" reported The Times. \"The couple seemed taken aback by thousands of Union Jacks waving below.\"\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\nAfter the cake was cut, Diana changed into her going-away outfit, a pink ensemble designed by Belville Sassoon. Charles' brothers had attached a \"Just Married\" sign, along with silver and blue balloons, to the carriage that brought the newlyweds to Waterloo Station. The couple took a train to Hampshire, where they spent two nights before leaving for a two-week Mediterranean cruise on the royal yacht Brittania.\n\nGetty Images\n\nBefore the celebratory luncheon began, the newlyweds posed for official portraits with their families and the wedding party in the Throne Room. In addition to the five bridesmaids, the royal wedding group included Charles' godsons Lord Nicholas Windsor, 11, and Edward van Cutsem, 8, who served as pageboys, and Charles' younger brothers, Prince Andrew and Prince Edward, who served as his supporters (by tradition, kings and princes of England have \"supporters\" instead of a best man). \"Patrick Lichfield took the wedding photographs—a cousin-once-removed to the Queen, he was well practiced at being around the royals and came armed with a whistle so he could keep the wedding party in line,\" bridesmaid India Hicks recently told Tatler.\n\nGetty Images\n\nGetty Images\n\nAt the wedding luncheon, 120 guests were served brill in lobster sauce, chicken breasts stuffed with lamb mousse, and strawberries with Cornish cream. The royal couple had 27 wedding cakes, with the official wedding cake (pictured) made by the Naval Armed Forces. The five foot cake, which Charles sliced with a ceremonial sword, featured the prince's coat of arms, Diana's family crest, an ornamental \"C\" and \"D,\" and was topped with roses, lilies of the valley, and orchids.\n\nGetty Images", "images": ["data:image/svg+xml,%3Csvg width=%274727%27 height=%273825%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271280%27 height=%27999%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275269%27 height=%273528%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275093%27 height=%273632%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%271646%27 height=%272363%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27460%27 height=%27680%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272598%27 height=%273953%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://:0", "data:image/svg+xml,%3Csvg width=%27518%27 height=%27680%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275236%27 height=%273501%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.brides.com/thmb/JsWCwL1i9FQdFcZzKrsmOTD5rsI=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aaab290b4ab3e207945ae7c__11-dd92d3b7bb5a48ffae970e934ce0fc81.jpeg", "data:image/svg+xml,%3Csvg width=%271280%27 height=%27983%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275180%27 height=%273476%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.brides.com/thmb/5-D2NfCM1cgterBBPUofltcuPfM=/2864x1611/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aaab290b4ab3e207945ae7c__169-aafa01c1621b4271b5312a65e87e2bfc.jpeg", "data:image/svg+xml,%3Csvg width=%273258%27 height=%272091%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%273482%27 height=%272772%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27680%27 height=%27680%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272700%27 height=%271507%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275203%27 height=%273488%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275065%27 height=%273515%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%274277%27 height=%274257%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%272876%27 height=%274228%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%274918%27 height=%273554%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%275280%27 height=%273437%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E"], "top_img": "https://www.brides.com/thmb/5-D2NfCM1cgterBBPUofltcuPfM=/2864x1611/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aaab290b4ab3e207945ae7c__169-aafa01c1621b4271b5312a65e87e2bfc.jpeg", "keywords": [], "authors": ["Roberta Correia"], "canonical_link": "https://www.brides.com/gallery/princess-diana-prince-charles-royal-wedding", "title": "Prince Charles and Princess Diana's Wedding in Photos", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "We're taking a look back at the nuptials that started all the royal wedding madness: Prince Charles and Princess Diana's royal wedding", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Roberta Correia", "sailthru.tags": "news,royal-weddings", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/gallery/princess-diana-prince-charles-royal-wedding", "title": "Prince Charles and Princess Diana's Wedding in Photos", "description": "We're taking a look back at the nuptials that started all the royal wedding madness: Prince Charles and Princess Diana's royal wedding", "image": "https://www.brides.com/thmb/5-D2NfCM1cgterBBPUofltcuPfM=/2864x1611/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aaab290b4ab3e207945ae7c__169-aafa01c1621b4271b5312a65e87e2bfc.jpeg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Prince Charles and Princess Diana's Wedding in Photos", "description": "We're taking a look back at the nuptials that started all the royal wedding madness: Prince Charles and Princess Diana's royal wedding", "image": "https://www.brides.com/thmb/EdZqiamSNdYnCAo_REsudacYhPw=/2875x2875/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aaab290b4ab3e207945ae7c__11-dd92d3b7bb5a48ffae970e934ce0fc81.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}