{"url": "https://www.romper.com/p/kendra-duggar-revealed-she-her-mom-were-pregnant-at-the-same-time-on-counting-ons-baby-birth-special-9644049", "text": "The Duggar family and stars of TLC's Counting On just keep on growing. Last month, Joseph Duggar and his wife, Kendra (Caldwell) Duggar, welcomed their first child — a son named Garrett David Duggar. But since Counting On wasn't airing new episodes at the time of their son's birth, fans weren't able to follow along with Joseph and Kendra's journey to becoming parents — until now. In a new special, posted on TLC's website, fans were able to find out about some pretty exciting and intimate details about the couple as they got ready for their son's arrival. For example, Kendra Duggar revealed she and her mom were pregnant at the same time and how they bonded even more during those overlapping months.\n\nAlthough the Duggar family might be a little more used to the spotlight, Kendra's parents aren't necessarily as high profile as Joseph's parents, Jim Bob and Michelle Duggar. Kendra's parents, Paul and Christina Caldwell, are reportedly in their early 40s and late 30s, respectively, according to In Touch Weekly. Paul, who is a pastor, and Christina have seven children together, according to In Touch Weekly — and Kendra confirmed, in her new special, that her parents have one more on the way.\n\nIn the episode, as Kendra took breathing lessons from her mom, she said that her mom was also expecting a baby. As seen in the TLC special, Kendra said:\n\nWe found that my mom was expecting about a month ago. I think this has definitely been really interesting because we've been able to share a lot of things that we didn't get to share before so I feel like we've become even more like friends. And I guess our relationship has gone more to a different level, I guess.\n\nConsidering Kendra's parents' ages, it's not necessarily shocking to learn that they're expecting another child right now. It's pretty cool that Kendra's son will grow up close in age to her baby brother (aka baby Garrett's uncle), when he does arrive. Not only that, but you can tell that Kendra is so happy that these simultaneous pregnancies brought the two of them closer together.\n\nOn Reddit user even predicted this, seven months ago. \"I'm calling it now! At some point Kendra and her mom will be pregnant at the same time,\" they wrote. But this wasn't the only thing that was revealed during the two-part birthing special that might have been shocking for fans to find out.\n\nKendra Was Afraid Of Her Breathing During Labor\n\nYou read that right. During the first part of her labor special, Kendra said that she had to practice breathing before she left for the hospital and gave birth, because she needed to be reminded of how to do it. Kendra explained in the episode:\n\nI tend to want to stop breathing and just kind of hold my breath when I'm in a lot of pain. And that's something that even during my childhood I've had to work on when I would fall down — to remember to breathe and not hold my breath because that causes more problems.\n\n\"If she was by herself, I think that would happen and she would pass out,\" Kendra's sister, Lauren Caldwell, said in the episode. \"But with all of us there, I know I could help her not pass out.\" Very reassuring.\n\nKendra Did Not Opt For A Home Birth\n\nAlthough Kendra's sister-in-laws might have opted for home births, she revealed during the beginning of the episode that she had planned on giving birth in a hospital. From the time that fans are introduced to Joe and Kendra in the episode, it is shown that they were planning on watching her contractions over night before making the call to head to the hospital, which was 25 minutes away from their home. But, they were able to make it to the hospital in time before Kendra's labor progressed any further.\n\nJoseph's Siblings Welcomed The Couple Home With A Special Gift\n\nDuring the episode, it was revealed that Joseph's many siblings were so, so excited for their nephew's birth and welcomed Joseph, Kendra, and Garrett home with special welcome gifts for the new family. The gifts, organized by Joseph's older sister, Jessa, included special treats made by his younger siblings, and a welcome home banner.\n\nThere is always something going on in the Duggar family, and this new TLC special was further proof of that.", "images": ["https://imgix.romper.com/uploads/image/2018/7/1/5b6d65e6-bf0d-4861-90b0-ff4374c98af5-unnamed.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/2b4b42d3-4475-4d32-af08-89bbe2575aa3-getty-1200433192.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/1/7d336b68-6f9f-4034-ade8-636a6a77fa89-screen-shot-2018-07-01-at-20540-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/6/15155e54-1e2c-439c-870e-2ae9587ae2e8-getty-1169525359.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/1/7d336b68-6f9f-4034-ade8-636a6a77fa89-screen-shot-2018-07-01-at-20540-pm.png?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/1/7d336b68-6f9f-4034-ade8-636a6a77fa89-screen-shot-2018-07-01-at-20540-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/kendra-duggar-revealed-she-her-mom-were-pregnant-at-the-same-time-on-counting-ons-baby-birth-special-9644049", "title": "Kendra Duggar Revealed She & Her Mom Were Pregnant At The Same Time On 'Counting On's Baby & Birth Special", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/kendra-duggar-revealed-she-her-mom-were-pregnant-at-the-same-time-on-counting-ons-baby-birth-special-9644049", "type": "article", "title": "Kendra Duggar Just Revealed She & Her Mom Were Pregnant At The Same Time", "description": "The Duggar family and stars of TLC's Counting On just keep on growing. Last month, Joseph Duggar and his wife, Kendra (Caldwell) Duggar, welcomed their first child — a son named Garrett David Duggar. But since Counting On wasn't airing new episodes…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/1/7d336b68-6f9f-4034-ade8-636a6a77fa89-screen-shot-2018-07-01-at-20540-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "The Duggar family and stars of TLC's Counting On just keep on growing. Last month, Joseph Duggar and his wife, Kendra (Caldwell) Duggar, welcomed their first child — a son named Garrett David Duggar. But since Counting On wasn't airing new episodes…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}