{"url": "https://variety.com/2018/tv/news/comic-con-2018-tv-schedule-doctor-who-riverdale-1202846141/", "text": "With more TV shows available than ever before, this year’s San Diego Comic-Con will likely be bigger and better for small-screen content. To keep you updated on the happenings this year, Variety is compiling a master list of screenings and panels for the July 19 to July 22 pop culture convention.\n\nHere is the complete TV schedule:\n\nThursday, July 19:\n\nStar vs. the Forces of Evil and Big City Greens (10-11:15 a.m., Room 6DE, Disney Channel) Panelists for Disney Channel’s animated hit “Stars vs. the Forces of Evil” include creator-producer Daron Nefcy and voice actors Eden Sher, Adam McArthur, and Esme Bianco. Speakers from the upcoming animated series “Big City Greens” include creators and executive producers Chris and Shane Houghton, as well as voice actress Marieve Herington. The animators and actors will perform a live table read and open up the floor for audience questions about their shows.\n\nSiren (11-11:50 a.m., Indigo Ballroom, Freeform) The cast and executive producers of Freeform’s fantasy series “Siren” will join Thursday’s lineup to discuss the making of a mermaid tale and offer insight into the show’s upcoming sophomore season. Panelists include stars Eline Powell, Alex Roe, Fola Evans-Akingbola, Ian Verdun and Rena Owen, joined by executive producers Emily Whitesell and Eric Wald.\n\nCharmed (11:15 a.m.-12:15 p.m., Ballroom 20, The CW) Back just in time to celebrate its 20th anniversary, the reboot of the original “Charmed” series centers on three sisters in a college town who, after the tragic loss of their mother, discover they are powerful witches. Series stars Melonie Diaz, Sarah Jeffery, Madeleine Mantock, and Rupert Evans, along with producers Jennie Snyder Urman, Jessica O’Toole and Amy Rardin, will appear for an exclusive sneak peek screening of the first episode of the series followed by a panel discussion.\n\nTell Me a Story (12:15-12:45 p.m., Ballroom 20, CBS All Access) From the mind of Kevin Williamson, “Tell Me a Story” reimagines the world’s most beloved fairytales like “The Three Little Pigs,” “Little Red Riding Hood,” and “Hansel and Gretel” as they come to life as dark and twisted psychological thrillers interweaving with each other against the backdrop of modern day New York City. Following an exclusive sneak peek of the series, Williamson and series stars Paul Wesley and James Wolk will appear for a panel discussion moderated by Entertainment Weekly editor-in-chief Henry Goldblatt.\n\nBobcat Goldthwait’s Misfits and Monsters (2:15 p.m., Ballroom 20, TruTV) Comedian Bobcat Goldthwait is bringing his anthology sketch series “Misfits and Monsters” to Comic-Con for a panel discussion and sneak peek into the pilot. Guest stars Jake Hurwitz, Amir Blumenfeldand, and Tara Lynne Barr will join Goldthwait to discuss what inspired various parts of the comical show.\n\nNightflyers (3-3:50 p.m., Indigo Ballroom, Syfy) The “Nightflyers” panel will serve as an intro to the upcoming psychological thriller from the mind of “Game of Thrones” author George R.R. Martin. Panelists include Jeff Buhler, Eoin Macken, Gretchen Mol, David Ajala, Jodie Turner-Smith, Gene Klein and David Bartis, who will take attendees to the year 2093 to talk about the new show, which follows a team of scientists traveling through the universe on their dangerous spaceship.\n\nBetter Call Saul (3:30-4:30 p.m., Hall H, AMC) The “Better Call Saul” will make its Comic-Con debut alongside a reunion panel for “Breaking Bad” in celebration of the show’s 10-year anniversary. The “Better Call Saul” panel will be moderated by comedian Bill Burr and will feature cast members Bob Odenkirk, Giancarlo Esposito, Rhea Seehorn, Patrick Fabian and Michael Mando, along with executive producers and showrunners Vince Gilligan and Peter Gould.\n\nBreaking Bad (4:30-5:30 p.m., Hall H, AMC) The “Breaking Bad” companion panel will be celebrating the show’s 10-year anniversary. Moderated by Bill Burr, the panel includes cast members Bryan Cranston, Aaron Paul, Anna Gunn, RJ Mitte, Dean Norris, Betsy Brandt, Bob Odenkirk and Giancarlo Esposito, along with series creator Vince Gilligan.\n\nRise of the Teenage Mutant Ninja Turtles (1:45-2:45 p.m., Room 6A, Nickelodeon) Nickelodeon is bringing its new animated series based on the hit “Teenage Mutant Ninja Turtles” franchise to life with a panel featuring the voices behind the beloved green giants. Stars Omar Miller, Josh Brener, Brandon Mychal Smith, Kat Graham and Eric Bauza, will be joined by executive producers Andy Suriano and Ant Ward, as well as director Rob Paulsen to offer insight into the turtle team’s newest adventures.\n\nMarvel Animation Presents: Marvel Rising (3:15-4:15 p.m., Room 6DE) Marvel is bringing together the next generation of superheroes for the next generation of Marvel fans. Quake Chloe Bennet (“Marvel’s Agents of S.H.I.E.L.D.,” “Nashville”), Squirrel Girl Milana Vayntrub (“This Is Us,” “Silicon Valley”), Ms. Marvel Kathreen Khavari (“Big Little Lies,” “Marvel’s Avengers”), Patriot Kamil McFadden (“K.C. Undercover,” “Grown Ups 2”), Mairghread Scott (writer for “Marvel Rising”), Cort Lane (SVP of Animation and Family Entertainment), Marsha Griffin (VP of Animation Current Series and Development), and Sana Amanat (VP of Content and Character Development) as well as additional surprise guests will appear for a panel discussion that will showcase the first look of the animated shorts, special announcements, and more.\n\nVan Helsing (4-5 p.m., Indigo Ballroom, Syfy) The cast of SYFY’s action horror series “Van Helsing” will once again descend on San Diego Comic-Con to give fans an exclusive first-look at what’s in store for the upcoming third season. Panelists include Kelly Overton, Jonathan Scarfe, Vincent Gale, Aleks Paunovic, Rukiya Bernard and Trezzo Mahoro as well as creator/showrunner Neil LaBute and executive producers Mike Frislev and Chad Oakes in a Q&A moderated by Bevin from Den of Geek.\n\nMagnum P.I. (4:15-5:30 p.m., Room 6A, CBS) A modern take on the classic series, “Magnum P.I.” stars Jay Hernandez as Thomas Magnum, a decorated former Navy SEAL who, upon returning home from Afghanistan, repurposes his military skills to become a private investigator. Series stars Hernandez and Perdita Weeks as well as executive producers Peter Lenkov and Eric Guggenheim will be on-hand for a panel discussion following an exclusive sneak peak of the premiere episode of the series.\n\nSYFY WIRE Hosts the Great Debate (4:45-5:45 p.m., Ballroom 20, SyFy) Aisha Tyler will be hosting the Great Debate an interactive panel aims to solve some of the ultimate questions in geekdom. After each round, the audience gets to settle the debate by casting their vote for the most convincing argument. Joining Tyler are panelists John Barrowman, Felicia Day, Orlando Jones, Joe Manganiello, Adam Savage and Janet Varney.\n\nZ Nation (5-5:50 p.m., Indigo Ballroom, Syfy) Panelists DJ Qualls, Kellita Smith, Russell Hodgkinsonand, and Karl Schaefer will welcome fans back to a dystopian landscape to offer insight into what’s to come in the fifth season of “Z Nation” as zombie-kind evolves to further threaten the sci-fi action dramas human heroes.\n\nCrazy Ex-Girlfriend: The Final Curtain Call (5:45-6:30 p.m., Room 6A, The CW) As the critically-acclaimed series enters its final season, co-creators Rachel Bloom and Aline Brosh McKenna are celebrating by taking a trip down memory lane and looking back on some of the series’ most memorable moments. They will also discuss what’s ahead for Rebecca Bunch. Series guest star Michael McMillian will moderate the panel, which will include a special performance and never-before-seen footage.\n\nMarvel’s Iron Fist (6-7 p.m., Ballroom 20, Netflix) Executive Producer and Marvel’s Head of Television, Jeph Loeb will conduct a panel to discuss the upcoming second season of “Iron Fist” with unannounced surprise guests.\n\nBrooklyn Nine-Nine (7-8 p.m., Indigo Ballroom, NBC) “Brooklyn Nine-Nine” is heading to SDCC for a panel for the fans of the recently renewed show. Panelists are still TBD\n\nMr. Mercedes (8-9 p.m., Room 7AB, Audience) Fans of the Audience adaption of Stephen King’s original thriller novel, “Mr. Mercedes” will be able to hear panelists discuss the making of the show’s first season. Joining executive producer and director Jack Bender on the panel will be Jack Huston, Max Fernandez, Breeda Wool, Justine Lupe, and Nancy Travis.\n\nFriday, July 20:\n\nYoung Justice: Outsiders (10-11 a.m., Room 6DE, Cartoon Network) Producers Greg Weisman, Brandon Vietti, art director Phil Bourassa, voice director Jamie Thomasson and members of the voice cast, Troy Baker and Stephaine Lemelin will join the “Young Justice” panel to talk about the teen superheroes’ latest challenge: meta-human trafficking and a genetic arms race. The show, produced by Warner Bros. Animation, follows the heroes of the DC comics as they come of age and will soon be available to watch via the DC Universe digital streaming service.\n\nThe Big Bang Theory (10:15-11:15 a.m., Ballroom 20, CBS) The writers and producers of the hit comedy series will participate in a panel that seeks to take fans inside the writers’ room, providing behind-the-scenes insight into some of Season 11’s most memorable moments, including the big engagement and wedding.\n\nVoltron (10:15-11:15 a.m., Room 6 BCF, Netflix) The voice cast of Netflix’s animated original series are coming to SDCC to answer audience questions about the upcoming seventh season. Series stars Rhys Darby, Bex Taylor-Klaus, and Jeremy Shada will participate in the panel along with executive producers Joaquim Dos Santos and Lauren Montgomery and story editor Josh Hamilton.\n\nFear the Walking Dead(11:15-12:15 p.m., Hall H, AMC) Moderated by Yvette Nicole Brown, AMC’s spinoff prequel show “Fear the Walking Dead’s” panel will feature cast members Colman Domingo, Alycia Debnam-Carey, Lennie James, Danay Garcia, Garret Dillahunt, Maggie Grace and Jenna Elfman, along with executive producers and showrunners Andrew Chambliss and Ian Goldberg, executive producers Scott M. Gimple, Robert Kirkman, Gale Anne Hurd, Greg Nicotero and David Alpert.\n\nVikings (11:30-12:30 p.m., Ballroom 20, History) The cast of History’s most popular television drama, “Vikings,” will invade Ballroom 20 for a panel with the show’s creator Michael Hirst. Joining him are cast members Katheryn Winnick, Clive Standen, Alexander Ludwig, Alex Høgh Andersen and Georgia Hirst.\n\nThe Walking Dead (12:15-1:15 p.m., Hall H, AMC) Moderated by Yvette Nicole Brown, “The Walking Dead” panel will include cast members Andrew Lincoln, Norman Reedus, Lauren Cohan, Danai Gurira, Melissa McBride and Jeffrey Dean Morgan, along with executive producer and showrunner Angela Kang, executive producers Scott M. Gimple, Robert Kirkman, Gale Anne Hurd, David Alpert and executive producer, director and special effects makeup supervisor Greg Nicotero.\n\nDC Super Hero Girls (12:30-1:30 p.m., Room 6DE, Cartoon Network) In addition to a video presentation teasing the new animated super series, producer Lauren Faust, as well as other members of the creative team, will hold a panel to answer audience questions about the show, which follows the young lives of female super heroes Wonder Woman, Supergirl and Batgirl as their teenage aliases Diana, Kara and Barbara. Plus, DC Group Editor Marie Jarvins will offer a glimpse inside of the upcoming books to be released in tandem with the series.\n\nCastle Rock (12:45-2 p.m., Ballroom 20, Hulu) Based on the works of Stephen King, Hulu’s “Castle Rock” will premiere its first episode during this exclusive screening, followed by a panel discussion with creators and executive producers Sam Shawand and Dustin Thomason, as well as stars Sissy Spacek, Bill Skarsgard, Melanie Lynskey, and Jane Levy. The “Castle Rock” team will talk about their process delving into King’s mind to craft a chilling picture of the haunting town that is Castle Rock.\n\nInvader ZIM: Enter the Florpus! (1-2 p.m., Room 6A, Nickelodeon) Original “Invader ZIM” voice cast members Richard Horvitz, Rikki Simons, Kevin McDonald and Wally Wingert will join original series creator Jhonen Vasquez for a panel promoting Nickelodeon’s new TV movie based on the early 2000s show about a space alien who finds himself struggling to fit in on Earth, despite his human disguise.\n\nStar Trek: Discovery (1:30-2:30 p.m., Hall H, CBS) Fans can climb aboard the U.S.S. Discovery to celebrate 50 years of “Star Trek” at the “Star Trek: Discovery” panel, featuring “Discovery” stars Sonequa Martin-Green, Doug Jones, Shazad Latif, Mary Wiseman, Anthony Rapp, Wilson Cruz, Mary Chieffo and Anson Mount, as well as executive producers Alex Kurtzman and Heather Kadin. While reflecting on the space saga that started it all, the panelists will also tease glimpses into the spinoff’s sophomore season. The panel will be moderated by series guest star Tig Notaro, who will appear as Chief Engineer Reno.\n\nDuckTales (3:30-4:30 p.m., Room 6A, Disney Channel) Danny Pudi, Ben Schwartz, and Bobby Moynihan, who voice Donald Duck’s rambunctious trio of nephews, Huey, Dewey, and Louie, will all be present for Disney Channel’s “DuckTales” panel, revealing secrets about the mystery surrounding the young ducks’ missing mother, as well as glimpses into the sophomore season. Other panelists include executive producer Matt Youngberg and producer-story editor Francisco Angones.\n\nAmazon Prime (3:30-5:30 p.m., Ballroom 20) Amazon Prime has booked a two-hour slot to showcase several of its projects, including the upcoming John Krasinski-starrer “Jack Ryan,” the Julia Roberts-starrer “Homecoming,” “The Tick,” “Good Omens,” “Lore,” and “The Expanse.” Executive producer Carlton Cuse will join the panel for “Jack Ryan,” as well as creator Ben Edlund for “The Tick,” director Sam Esmail for “Homecoming,” author and showrunner Neil Gaiman for “Good Omens,” executive producer Gale Anne Hurd for “Lore,” and showrunner Naren Shankar for “The Expanse.”\n\nFinal Space (3:30-4:10 p.m., Indigo Ballroom, TBS) Series creator Olan Rogers along with the cast and producers of the recently renewed epic space opera will descend on fans for a Q&A about the adventures and mystery of Final Space, including a special fan contest announcement. Along with Rogers, panelists include David Sacks, Tika Sumpter, Tom Kenny and Coty Galloway.\n\nBob’s Burgers (4:15-5:10 p.m., Indigo Ballroom, Fox) Creator and executive producer Loren Bouchard is set to break news about the upcoming season of the Emmy Award-winning animated series. Cast members including H. Jon Benjamin, Dan Mintz, Eugene Mirman, John Roberts, Kristen Schaal and Larry Murphy are slated to feature never-before-seen footage followed by a Q&A panel discussion.\n\nArcher (5:15-6:15 p.m., Indigo Ballroom, FXX) Coming off its fifth season, the Emmy Award-winning animated comedy series will feature a panel discussion and Q&A. The TBA cast and producers of Adam Reed’s sitcom will also be signing autographs.\n\nSYFY WIRE Fangrrls: Women Changing the Game(5:30-6:30 p.m., Room 6DE, SyFy) Moderated by SYFY WIRE Fangrrls’ managing editor Cher Martinetti, this panel will feature the panelists’ current obsessions and discussions about how each woman is blazing their own path and changing the industry. Joining Martinetti will be Rachel Bloom, Amanda Conner, Lights and Nichelle Nichols.\n\nMarvel’s Cloak & Dagger (5:45-6:45 p.m., Ballroom 20, Freeform) Head of Marvel TV and executive producer Jeph Loeb will be moderating a panel and Q&A with stars Olivia Holt, Aubrey Joseph, Emma Lahana, and Ally Maki along with executive producer and showrunner Joe Pokaski. They will also show exclusive, never-before-seen footage of the series.\n\nThe Passage (6-7 p.m., Room 6A, Fox) Based on Justin Cronin’s best-selling fantasy book trilogy, Fox will debut the world premiere screening of the epic, character-driven thriller about a secret government medical facility experimenting with a dangerous virus that could either cure all disease or cause the downfall of the human race. Following the screening, stars Mark-Paul Gosselaar, Saniyaa Sidney, Henry Ian Cusick, Jamie McShane, executive producer Liz Heldens, executive producer and director Jason Ensler, and author Justin Cronin will appear for a moderated discussion and fan Q&A.\n\nThe Last Sharknado: It’s About Time (7-8 p.m., Room 6BCF, Syfy) The Sharknado franchise is coming to a close with a final TV movie, aptly titled “The Last Sharknado: It’s About Time,” on Syfy, and panelists Ian Ziering, Tara Reidand, and Cassie Scerbo will be present to answer fans last burning questions about the disaster-prone universe. The panelists will also give attendees a glimpse into the final installment.\n\nThe Twilight Zone Marathon Screening (7:15-9:15 p.m., Room 6A, CBS All Access) The new, modern “Twilight Zone” coming to CBS All Access reimagines the iconic series that took viewers to another dimension–a dimension not only of sight and sound but of mind. CBS will host a special marathon screening and a look back at some of the fan-favorite episodes from the original series. Concessions and an exclusive giveaway item will be provided.\n\nPreacher (7:30-8:30 p.m., Hall H, AMC) The television show adaptation of Garth Ennis’ comic book series “Preacher” will feature a panel including cast members Dominic Cooper, Ruth Negga and Joseph Gilgun, along with executive producer and showrunner Sam Catlin and executive producers Seth Rogen and Evan Goldberg.\n\nSaturday, July 21:\n\nUnikitty! (10-11 a.m., Room 6DE, Cartoon Network) “The Lego Movie’s” Unikitty moves from a supporting role on the big screen to a starring role on the small screen with this light and colorful children’s programming. The “Unikitty” spot will feature an exclusive screening of a new episode, as well as a panel discussion with producers Lynn Wang and Ed Skudder, animation director Anna Hollingsworth and the voice cast, Tara Strong, Grey Griffin, Eric Bauza, H. Michael Croner, Roger Craig Smith.\n\nBlack Lightning (11-11:45 a.m., Ballroom 20, The CW) A video presentation will welcome fans back to the corrupt world Black Lightning feels obligated to come out of hiding in order to protect. The following panel will feature stars Cress Williams, China Anne McClain, Nafessa Williams, Christine Adams, Marvin “Krondon” Jones III, Damon Gupton, and James Remar, as well as producer Salim Akil, who will provide a first look into the DC series super sophomore season.\n\nThe Simpsons (12-12:45, Ballroom 20, Fox) Looking ahead to their 30th season, creator Matt Groening, executive producer Al Jean, supervising director Mike Anderson, director David Silverman, and Tress MacNeille (the voice of Agnes Skinner, Lindsey Naegle, and more) will appear in a discussion moderated by Johnathan Fernandez. There will also be prizes.\n\nKrypton (12-12:50 p.m., Indigo Ballroom, Syfy) With the help of a video spot, panelists will offer an exclusive glimpse into Season 2 of “Krypton,” which follows DC’s Superman as his life spirals into imminent peril. Joining the discussion are executive producers and DC veterans David S. Goyer and Cameron Welsh, as well as members of the live action cast. The panelists will also take a look back on the most shocking moments of Season 1 in anticipation for the return to Krypton.\n\nBig Hero 6 the Series (12:30-1:30 p.m., Room 6A, Disney Channel) The creative minds and stars of Disney’s TV spinoff of 2014’s “Big Hero 6” will join Comic-Con to talk about the process of repurposing the beloved characters and settings for a TV format, as well as reveal footage from the new series. Panelists include voice actors Ryan Potter, Scott Adsit, Jamie Chung, Khary Payton, Genesis Rodriguez and Brooks Wheelan, as well as executive producers Mark McCorkle, Bob Schooley and Nick Filippi.\n\nManifest (1-2 p.m., Indigo Ballroom, NBC) NBC will premiere the pilot of its new time warp drama “Manifest,” which follows a group of passengers who disembark from a turbulent flight to New York to find that five years have passed in the world around them, and their loved ones, who thought them dead, have moved on. Executive producer Jeff Rake and stars Melissa Roxburgh and Josh Dallas make up the team of panelists, who will give audiences a first look into the unexpected take on a crash-landing narrative.\n\nAmerican Dad! and Family Guy (1-2:15 p.m., Ballroom 20, Fox) It’s a Smith-family Funday with Wendy Schaal (Francine), Scott Grimes (Steve), Dee Bradley Baker (Klaus) along with Curtis Armstrong (Snot), Eddie Kaye Thomas (Barry), Daisuke Suzuki (Toshi) and executive producer Matt Weitzman on-hand to treat “American Dad!” fans to a first look at scenes from all-new episodes coming soon to TBS. Then, Seth MacFarlane, Alex Borstein, Seth Green, Mike Henry, and executive producers Rich Appel, Alec Sulkin, and Steve Callaghan will take a look back at their favorite “family” memories, plus a sneak peek featuring hilarity and hi-jinx from the upcoming season.\n\nLegacies (2-2:50 p.m., Indigo Ballroom, The CW) When one “Vampire Diaries” spinoff closes, another opens. Set in the same world of witchcraft and magical creatures as “The Originals” and its parent series, “Legacies” centers on Hope Mikaelson, Klaus Mikaelson’s teenage daughter, as well as Alaric Saltzman’s twin sons, who are all enrolled at the Salvatore School for the Young and Gifted. The CW’s exclusive video presentation and panel with executive producer Julie Plec and stars Danielle Rose Russell and Matthew Davis will return fans to the “TVD” universe through young, new eyes.\n\nThe Gifted (2:30-3:15 p.m., Ballroom 20, Fox) Season 2 of “The Gifted” picks up after the explosion of the Atlanta Station, as the Mutant Underground search for their friends and family who left with The Inner Circle. Having tracked them outside of Washington, D.C., they must contend with new groups with extreme ideologies, both human and mutant alike, to stave off a brewing conflict. Executive producers Matt Nix and Jeph Loeb and stars Stephen Moyer, Sean Teale, Jamie Chung, Emma Dumont, Blair Redford, Natalie Alyn Lind, and Skyler Samuels will share an exclusive first look at the upcoming season.\n\nCosmos: Possible Worlds (3-3:50 p.m., Indigo Ballroom, Fox) “Cosmos,” Fox’s space odyssey docu-series hosted by astrophysicist Neil deGrasse Tyson, will debut its sophomore season in the fall, and Tyson will be present at Comic-Con to give insight into Season 2’s universal wonders. Executive producer, writer, director and creator Ann Druyan and executive producers Seth MacFarlane, Brannon Braga and Jason Clark will join Tyson for the panel discussion.\n\nSupergirl (3:30-4:15 p.m., Ballroom 20, The CW) The “Supergirl” panel consists of cast members Melissa Benoist, Chyler Leigh, Mehcad Brooks, David Harewood, Katie McGrath and Jesse Rath, as well as executive producers Robert Rovner, Jessica Queller and Sarah Schechter, as they will discuss what they’re most excited for fans to see in Season 4, as well as answer any questions still burning about Season 3. A video presentation will give a first look into the fourth season.\n\nThe Orville (4-4:50 p.m., Indigo Ballroom, Fox) Back for a second season, executive producer and creator Seth MacFarlane will appear along with some of the crew members from the U.S.S. Orville including Adrianne Palicki, Penny Johnson Jerald, and Scott Grimes. Executive producers David A. Goodman, Brannon Braga, and Jon Cassar will also join them to tease an exclusive look at some of the new and exciting missions in the upcoming season.\n\nArrow (4:15-5 p.m., Ballroom 20, The CW) After an action-packed sixth season, which forced Oliver Queen to unmask himself as the Green Arrow, panelists and stars Stephen Amell, David Ramsey, Emily Bett Rickards, Katie Cassidy, Echo Kellum, Juliana Harkavy, Rick Gonzalez, and Colton Haynes, as well as executive producer Beth Schwartz , will offer glimpses into Oliver’s Season 7 journey, which sees him more vulnerable than ever now that his identity has been revealed.\n\nThe Man in the High Castle (4:15-5:15 p.m., Room 6A, Amazon Prime) The stars and producers of Amazon Prime’s “Man in the High Castle” will join the SDCC lineup to discuss the upcoming third season of the sci-fi thriller, promising exclusive sneak peaks into the show’s new storyline and answers to fan questions. Panelists include actors Alexa Davalos, Rufus Sewell, Jason O’Mara and Stephen Root, as well as executive producers Isa Dick Hackett and Dan Percival.\n\nDC’s Legends of Tomorrow (5-5:45 p.m., Ballroom 20, The CW) “Legends” panelists and stars Caity Lotz, Brandon Routh, Dominic Purcell, Nick Zano, Maisie Richardson-Sellers, Tala Ashe, Matt Ryan, Jes Macallan, Courtney Ford, showrunner Phil Klemmer, and producer Keto Shimizu will discuss the Legends sophomore season, which led to the defeat of Mallus, as well as the upcoming third season, which will see the heroes face new nemeses in the form of “fugitives” that consist of magical creatures from myths, fairytales, and legends.\n\nThe Flash (5:45-6:30 p.m., Ballroom 20, The CW) “The Flash” rounds out The CW’s Saturday panels, featuring stars Grant Gustin, Jesse L. Martin, Tom Cavanagh, Candice Patton, Danielle Panabaker, Carlos Valdes, Hartley Sawyer, Jessica Parker Kennedy, and Danielle Nicolet, as well as executive producer Todd Helbing, who will talk the series’ upcoming fifth season as the Flash moves on from his battles with The Thinker to tackle challenges presented by new characters, including his daughter from the future, Nora.\n\nDeadly Class (6-6:50 p.m., Indigo Ballroom, Syfy) Based on the graphic novel by panelists Rick Remender and Wes Craig, this Comic-Con spot will offer fans a glimpse into Syfy’s new series “Deadly Class,” which centers on a teen who suddenly finds himself enrolled in the King’s Dominion, one of the world’s top crime academies. Miles Orion Feldsott, Mick Betancourt, Benjamin Wadsworth, Lana Condor, María Gabriela De Faría, and Benedict Wong will join the authors to offer a sneak peak into the action-packed adaptation.\n\nCrazy Ex-Girlfriend Live Starring Rachel Bloom (7:30 p.m., Balboa Theatre, The CW) The cast of the award-winning musical comedy is taking their show on the road in this live tour. Rachel Bloom, the rest of the cast, and the “Crazy Ex-Girlfriend” songwriters are bringing the show’s songs to life in this very special live concert event. The concert is a ticketed event and is currently sold out.\n\nProject Blue Book (6:45-7:45, Room 6A, History) The cast of the upcoming science fiction drama “Project Blue Book” will engage its earthling audience for a panel including the show’s creator David O’Leary and writer Sean Jablonski. Cast members include Aidan Gillen, Michael Malarkey, Neal McDonough and Laura Mennell.\n\nWynonna Earp (6:45-7:45 p.m., Room 6DE, Syfy) Panelists Melanie Scrofano, Shamier Anderson, Tim Rozon, Domonique Provost-Chalkley, Katherine Barrell, Varun Saranga, Chantel Riley, Emily Andras, and Beau Smith will take fans behind the scenes of the fantasy series as it nears its third season, including behind-the-scenes reels, as well as exclusive footage from the upcoming episodes.\n\nThe Magicians (7-8 p.m., Indigo Ballroom, Syfy) Panelists John McNamara, Sera Gamble, Jason Ralph, Stella Maeve, Olivia Taylor Dudley, Hale Appleman, Arjun Guptaand, and Summer Bishil will offer fans an exclusive look into the upcoming fourth season of “The Magicians” based on the hit young adult novels by Quentin Coldwater.\n\nSunday, July 22:\n\nSupernatural (10:30-11:30 a.m., Hall H, The CW) As “Supernatural” nears its 14th season, fans will be treated to a video presentation and Q&A with stars Jensen Ackles, Jared Padalecki, Misha Collins, Alexander Calvert, as well as executive producers Robert Singer, Andrew Dabb, Eugenie Ross-Leming and Brad Buckner, who will answer any questions about Season 13’s finale and tease the content of the show’s latest season. The video reel will touch on series highlights so far in anticipation for “Supernatural’s” 300th episode.\n\nRiverdale (11:45-12:45 p.m., Hall H, The CW) “Riverdale” will make its third Comic-Con appearance with a video presentation and panel featuring stars KJ Apa, Lili Reinhart, Camila Mendes, Cole Sprouse, Marisol Nichols, Madelaine Petsch, Ashleigh Murray, Mark Consuelos, Casey Cott, Skeet Ulrich, Mädchen Amick, Luke Perry, and Vanessa Morgan, as well as producers Roberto Aguirre-Sacasa, Sarah Schechter and Jon Goldwater. The Archie team will discuss Season 3’s post-hiatus surprises as the gang continues to uncover the many dark secrets casting an ominous shadow over Riverdale.\n\nMayans M.C. (1-2 p.m., Hall H, FX) The next chapter of the “Sons of Anarchy” saga is here. Set in a post-Jax Teller world, Ezekiel “EZ” Reyes is fresh out of prison and a prospect in the Mayans M.C. charter on the Cali/Mexi border. Now, EZ must carve out his new identity in a town where he was once the golden boy with the American Dream in his grasp. Discussing what to look forward to from Season 1, co-creator, executive producer, writer, and director Kurt Sutter will appear in a conversation alongside fellow co-creator, co-executive producer, and writer Elgin James, executive producer and director Norberto Barba, and stars JD Pardo, Clayton Cardenas, Edward James Olmos, Sarah Bolger, Michael Irby, Carla Baratta, Antonio Jaramillo, Raoul Max Trujillo, Richard Cabral, Danny Pino, Emilio Rivera, Frankie Loyal, Joseph Lucero, and Vincent Rocco Vargas.\n\nLegion (2:15-3:15 p.m., Hall H, FX) Noah Hawley’s groundbreaking superhero series starring Dan Stevens, Rachel Keller, and Aubrey Plaza will give fans a chance to dive deeper into the recently concluded second season. Executive producers John Cameron and Marvel’s Jeph Loeb, along with co-executive producer Nathaniel Halpern, will discuss what to look forward to from Season 3. Cast member appearances are still TBD.\n\nAdditional panels and events:\n\nDoctor Who (TBA, Hall H, BBC America) The 13th Doctor, played by Jodie Whittaker, will make her debut in San Diego this year, alongside “Doctor Who” co-stars Tosin Cole and Mandip Gill, showrunner Chris Chibnall and executive producer Matt Strevens. Hosted by comedian Chris Hardwick, the panel will include a sneak peak at Season 11 of the revived show, which previously starred Matt Smith, David Tennant and Peter Capaldi in the title role. Whittaker will be the first woman to play The Doctor when the show returns in the fall.\n\nMr. Mercedes (643 G Street, AT&T Audience Network) Based on the trilogy by Stephen King, “Mr. Mercedes” will be bringing an “Immersive Experience” to give fans a glimpse into the past and into the future of the series at SDCC, which will include an augmented reality adventure game, a virtual reality escape room game, and a private screening room where media, VIP, and lucky fans will get the chance to watch a sneak peek at Season 2. “Mr. Mercedes” will also appear in a show panel, but date, time, and panelists are TBA.\n\nTom Clancy’s Jack Ryan (Park located at the corner of 1st street and Martin Luther King Promenade, Amazon) In addition to its mega-panel, Amazon is bringing a “Jack Ryan” fan experience to San Diego this Comic-Con. Visitors can complete the hyper-reality virtual reality spy experience Jack Ryan Training Field by infiltrating, fighting and evading the enemy to gain full field clearance. They will then use that training to help Jack Ryan himself in Dark Ops, a groundbreaking escape room that recreates the pilot episode. Attendees can also explore the Middle Eastern bazaar, which has assignments to be completed at every turn, watch a live leaderboard and pick up some iconic Jack Ryan swag. Created with MediaMonks, the Jack Ryan Training Field stands over 30 feet tall and uses the latest Optitrack 4D and Oculus Rift technology to make visitors physically feel as if they were thrust into the action. Dark Ops is a first of its kind escape room, created by AKQA and Unit 9, which lets participants live the first episode of “Jack Ryan.” This fan experience will take place Thursday, July 19 through Sunday, July 22, from 9 a.m. to 7 p.m. Thursday through Saturday, and 9 a.m. to 5 p.m. on Sunday.\n\nMarvel’s Cloak & Dagger – Fan Activation (Petco Park, Freeform) On-site through Sunday, Freeform will tie in the “divine pairing” theme of the show by recreating the iconic moment between the two leads Tyrone and Tandy when their powers interact. Participants will be harnessed to a bungee that will propel them backwards to feel the force of their powers. A slow-motion recording will capture the moment, which will also include an overlay effect that shows both the light and dark energy emitting from the participants. Fans can also stop by the ROXXON Corp station to create their own customized badge and lanyard. Each badge will include a secret code that is connected to a wide range of prizes from Sony PlayStation Vue and Freeform.\n\nStar Trek: Discovery Mirror Universe Gallery Takeover (Michael J. Wolfe Fine Arts Gallery, CBS All Access) CBS is creating a fully immersive “Star Trek: Discovery” Mirror Universe experience. The exhibit, scheduled to run from Thursday, June 19 through Sunday, July 22, will feature a photo opportunity with Emperor Georgiou’s throne and will showcase props and costumes from the series’ Terran Empire. The gallery will also house an official “Star Trek” shop with Comic-Con exclusives.\n\nThe Purge (215 Tony Gwynn Drive, USA) On Thursday, July 19, USA will open the doors of America’s first Purge City store, an immersive experience in the heart of San Diego’s Gaslamp District, to the public. Transporting fans into the world of “The Purge”, Purge City is a tongue-in-cheek, one-stop shop for the perfect Purge Night, where friendly Purge City staff help visitors browse the aisles for items from emergency candles to masks to energy drinks—to help citizens stay safe and awake for the 12 hours of annual lawlessness. Shoppers can also enjoy Purge photo opportunities and browse an area dedicated to the political rise of the New Founding Fathers of America, from the first Purge experiment on Staten Island to subsequent annual Purge Nights.\n\nCosmos Ship of the Imagination Experience (Hilton Bayfront Lawn, Fox) Fans of Neil deGrasse Tyson’s docu-series “Cosmos” will have the chance to launch into space via a 33-foot visual effects viewing dome. Aboard the recreated set of the show’s “Ship of the Imagination,” fans will get a sneak peek of the series’ upcoming season via a two-minute VFX display exploring space from the Sagittarius field to other planets, featuring the same colors and graphics as seen on “Cosmos.” After the dome show, the audience will have access to a photo opportunity sitting in Tyson’s captain’s chair, delivered directly from the “Cosmos” set.\n\nThe Passage Project Noah Viral Cell Lab (Hilton Bayfront Lawn, Fox) Fox’s upcoming biomedical apocalypse drama “Passage” is recreating the medical labs from the show that launched the controversial Project Noah, offering guests an up-close look at the lab’s viral patients.\n\nThe Orville Pedi-Pods Fleet (Gaslamp Quarter, Fox) Comic-Con attendees seeking reprieve from foot travel will have the opportunity to hop on one of “The Orville’s” custom pedi-cab shuttle pods to any location in the Gaslamp Quarter complete with a U.S.S. Orville Crew Pin and a sneak peak at the sophomore season of Fox’s comedic space odyssey.\n\nBob’s Burgers Shake Shack (Shake Shack, Mission Valley, Fox) Fans of food and “Bob’s Burgers” can satisfy their cravings by taking a charter bus to “Shake Shack” in Mission Viejo directly from the Comic-Con headquarters where they can eat the “Burger of the Day” with a side of fries — and maybe even some special guests from the show behind the counter.", "images": ["https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=681&h=383&crop=1", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fcomic-con-2018-tv-schedule-doctor-who-riverdale-1202846141%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202846141&comment_count=2", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=1000", "keywords": [], "authors": ["Variety Staff"], "canonical_link": "https://variety.com/2018/tv/news/comic-con-2018-tv-schedule-doctor-who-riverdale-1202846141/", "title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "From \"Doctor Who\" to \"Riverdale,\" several longstanding TV favorites and hot new series will appear at San Diego Comic-Con from July 19-22.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202846141, "author": "Variety Staff", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-06-25T13:15:41"}, "pmc-tag": "Comic-Con,Doctor Who,Mayans MC,Riverdale", "title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?", "url": "https://variety.com/2018/tv/news/comic-con-2018-tv-schedule-doctor-who-riverdale-1202846141/", "description": "With more TV shows available than ever before, this year’s San Diego Comic-Con will likely be bigger and better for small-screen content. To keep you updated on the happenings this year, Vari…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=1000", "width": 1000, "height": 562}, "locale": "en_US"}, "article": {"published_time": "2018-06-25T20:15:41+00:00", "modified_time": "2018-07-18T18:43:11+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?"}, "image": "https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=1000", "card": "summary_large_image", "title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?", "description": "From \"Doctor Who\" to \"Riverdale,\" several longstanding TV favorites and hot new series will appear at San Diego Comic-Con from July 19-22."}, "author": "Variety Staff", "content_type": "Article", "post_id": 1202846141, "title": "Comic-Con 2018 TV Schedule: When Are Your Favorite Shows Taking Over San Diego?", "published_at": "2018-06-25 13:15:41", "image": "https://pmcvariety.files.wordpress.com/2018/06/drwhoriverdale1.jpg?w=1000", "comment_count": 2, "tags": "Riverdale", "topics": "News", "appeared_in_print": "No", "body": "With more TV shows available than ever before, this year's San Diego Comic-Con will likely be bigger and better for small-screen content. To keep you updated on the happenings this year, Variety is compiling a master list of screenings and panels for the July 19 to July 22 pop culture convention.\r\n\r\nHere is the complete TV schedule:\r\n\r\nThursday, July 19:\r\n\r\nStar vs. the Forces of Evil and Big City Greens (10-11:15 a.m., Room 6DE, Disney Channel) Panelists for Disney Channel's animated hit \"Stars vs. the Forces of Evil\" include creator-producer Daron Nefcy and voice actors Eden Sher, Adam McArthur, and Esme Bianco. Speakers from the upcoming animated series \"Big City Greens\" include creators and executive producers Chris and Shane Houghton, as well as voice actress Marieve Herington. The animators and actors will perform a live table read and open up the floor for audience questions about their shows.\r\n\r\nSiren (11-11:50 a.m., Indigo Ballroom, Freeform) The cast and executive producers of Freeform's fantasy series \"Siren\" will join Thursday's lineup to discuss the making of a mermaid tale and offer insight into the show's upcoming sophomore season. Panelists include stars Eline Powell, Alex Roe, Fola Evans-Akingbola, Ian Verdun and Rena Owen, joined by executive producers Emily Whitesell and Eric Wald.\r\n\r\nCharmed (11:15 a.m.-12:15 p.m., Ballroom 20, The CW) Back just in time to celebrate its 20th anniversary, the reboot of the original \"Charmed\" series centers on three sisters in a college town who, after the tragic loss of their mother, discover they are powerful witches. Series stars Melonie Diaz, Sarah Jeffery, Madeleine Mantock, and Rupert Evans, along with producers Jennie Snyder Urman, Jessica O’Toole and Amy Rardin, will appear for an exclusive sneak peek screening of the first episode of the series followed by a panel discussion.\r\n\r\nTell Me a Story (12:15-12:45 p.m., Ballroom 20, CBS All Access) From the mind of Kevin Williamson, \"Tell Me a Story\" reimagines the world's most beloved fairytales like “The Three Little Pigs,” “Little Red Riding Hood,” and “Hansel and Gretel” as they come to life as dark and twisted psychological thrillers interweaving with each other against the backdrop of modern day New York City. Following an exclusive sneak peek of the series, Williamson and series stars Paul Wesley and James Wolk will appear for a panel discussion moderated by Entertainment Weekly editor-in-chief Henry Goldblatt.\r\n\r\nBobcat Goldthwait’s Misfits and Monsters (2:15 p.m., Ballroom 20, TruTV) Comedian Bobcat Goldthwait is bringing his anthology sketch series \"Misfits and Monsters\" to Comic-Con for a panel discussion and sneak peek into the pilot. Guest stars Jake Hurwitz, Amir Blumenfeldand, and Tara Lynne Barr will join Goldthwait to discuss what inspired various parts of the comical show.\r\n\r\nNightflyers (3-3:50 p.m., Indigo Ballroom, Syfy) The \"Nightflyers\" panel will serve as an intro to the upcoming psychological thriller from the mind of \"Game of Thrones\" author George R.R. Martin. Panelists include Jeff Buhler, Eoin Macken, Gretchen Mol, David Ajala, Jodie Turner-Smith, Gene Klein and David Bartis, who will take attendees to the year 2093 to talk about the new show, which follows a team of scientists traveling through the universe on their dangerous spaceship.\r\n\r\n\r\n\r\nBetter Call Saul (3:30-4:30 p.m., Hall H, AMC) The \"Better Call Saul\" will make its Comic-Con debut alongside a reunion panel for “Breaking Bad” in celebration of the show's 10-year anniversary. The \"Better Call Saul\" panel will be moderated by comedian Bill Burr and will feature cast members Bob Odenkirk, Giancarlo Esposito, Rhea Seehorn, Patrick Fabian and Michael Mando, along with executive producers and showrunners Vince Gilligan and Peter Gould.\r\n\r\nBreaking Bad (4:30-5:30 p.m., Hall H, AMC) The \"Breaking Bad\" companion panel will be celebrating the show's 10-year anniversary. Moderated by Bill Burr, the panel includes cast members Bryan Cranston, Aaron Paul, Anna Gunn, RJ Mitte, Dean Norris, Betsy Brandt, Bob Odenkirk and Giancarlo Esposito, along with series creator Vince Gilligan.\r\n\r\nRise of the Teenage Mutant Ninja Turtles (1:45-2:45 p.m., Room 6A, Nickelodeon) Nickelodeon is bringing its new animated series based on the hit \"Teenage Mutant Ninja Turtles\" franchise to life with a panel featuring the voices behind the beloved green giants. Stars Omar Miller, Josh Brener, Brandon Mychal Smith, Kat Graham and Eric Bauza, will be joined by executive producers Andy Suriano and Ant Ward, as well as director Rob Paulsen to offer insight into the turtle team's newest adventures.\r\n\r\nMarvel Animation Presents: Marvel Rising (3:15-4:15 p.m., Room 6DE) Marvel is bringing together the next generation of superheroes for the next generation of Marvel fans. Quake Chloe Bennet (\"Marvel’s Agents of S.H.I.E.L.D.,\" \"Nashville\"), Squirrel Girl Milana Vayntrub (\"This Is Us,\" \"Silicon Valley\"), Ms. Marvel Kathreen Khavari (\"Big Little Lies,\" \"Marvel’s Avengers\"), Patriot Kamil McFadden (\"K.C. Undercover,\" \"Grown Ups 2\"), Mairghread Scott (writer for \"Marvel Rising\"), Cort Lane (SVP of Animation and Family Entertainment), Marsha Griffin (VP of Animation Current Series and Development), and Sana Amanat (VP of Content and Character Development) as well as additional surprise guests will appear for a panel discussion that will showcase the first look of the animated shorts, special announcements, and more.\r\n\r\nVan Helsing (4-5 p.m., Indigo Ballroom, Syfy) The cast of SYFY's action horror series \"Van Helsing\" will once again descend on San Diego Comic-Con to give fans an exclusive first-look at what's in store for the upcoming third season. Panelists include Kelly Overton, Jonathan Scarfe, Vincent Gale, Aleks Paunovic, Rukiya Bernard and Trezzo Mahoro as well as creator/showrunner Neil LaBute and executive producers Mike Frislev and Chad Oakes in a Q&A moderated by Bevin from Den of Geek.\r\n\r\nMagnum P.I. (4:15-5:30 p.m., Room 6A, CBS) A modern take on the classic series, \"Magnum P.I.\" stars Jay Hernandez as Thomas Magnum, a decorated former Navy SEAL who, upon returning home from Afghanistan, repurposes his military skills to become a private investigator. Series stars Hernandez and Perdita Weeks as well as executive producers Peter Lenkov and Eric Guggenheim will be on-hand for a panel discussion following an exclusive sneak peak of the premiere episode of the series.\r\n\r\nSYFY WIRE Hosts the Great Debate (4:45-5:45 p.m., Ballroom 20, SyFy) Aisha Tyler will be hosting the Great Debate an interactive panel aims to solve some of the ultimate questions in geekdom. After each round, the audience gets to settle the debate by casting their vote for the most convincing argument. Joining Tyler are panelists John Barrowman, Felicia Day, Orlando Jones, Joe Manganiello, Adam Savage and Janet Varney.\r\n\r\nZ Nation (5-5:50 p.m., Indigo Ballroom, Syfy) Panelists DJ Qualls, Kellita Smith, Russell Hodgkinsonand, and Karl Schaefer will welcome fans back to a dystopian landscape to offer insight into what's to come in the fifth season of \"Z Nation\" as zombie-kind evolves to further threaten the sci-fi action dramas human heroes.\r\n\r\nCrazy Ex-Girlfriend: The Final Curtain Call (5:45-6:30 p.m., Room 6A, The CW) As the critically-acclaimed series enters its final season, co-creators Rachel Bloom and Aline Brosh McKenna are celebrating by taking a trip down memory lane and looking back on some of the series' most memorable moments. They will also discuss what's ahead for Rebecca Bunch. Series guest star Michael McMillian will moderate the panel, which will include a special performance and never-before-seen footage.\r\n\r\nMarvel's Iron Fist (6-7 p.m., Ballroom 20, Netflix) Executive Producer and Marvel’s Head of Television, Jeph Loeb will conduct a panel to discuss the upcoming second season of \"Iron Fist\" with unannounced surprise guests.\r\n\r\nBrooklyn Nine-Nine (7-8 p.m., Indigo Ballroom, NBC) \"Brooklyn Nine-Nine\" is heading to SDCC for a panel for the fans of the recently renewed show. Panelists are still TBD\r\n\r\nMr. Mercedes (8-9 p.m., Room 7AB, Audience) Fans of the Audience adaption of Stephen King's original thriller novel, \"Mr. Mercedes\" will be able to hear panelists discuss the making of the show's first season. Joining executive producer and director Jack Bender on the panel will be Jack Huston, Max Fernandez, Breeda Wool, Justine Lupe, and Nancy Travis.\r\n\r\nFriday, July 20:\r\n\r\nYoung Justice: Outsiders (10-11 a.m., Room 6DE, Cartoon Network) Producers Greg Weisman, Brandon Vietti, art director Phil Bourassa, voice director Jamie Thomasson and members of the voice cast, Troy Baker and Stephaine Lemelin will join the \"Young Justice\" panel to talk about the teen superheroes' latest challenge: meta-human trafficking and a genetic arms race. The show, produced by Warner Bros. Animation, follows the heroes of the DC comics as they come of age and will soon be available to watch via the DC Universe digital streaming service.\r\n\r\nThe Big Bang Theory (10:15-11:15 a.m., Ballroom 20, CBS) The writers and producers of the hit comedy series will participate in a panel that seeks to take fans inside the writers' room, providing behind-the-scenes insight into some of Season 11's most memorable moments, including the big engagement and wedding.\r\n\r\nVoltron (10:15-11:15 a.m., Room 6 BCF, Netflix) The voice cast of Netflix's animated original series are coming to SDCC to answer audience questions about the upcoming seventh season. Series stars Rhys Darby, Bex Taylor-Klaus, and Jeremy Shada will participate in the panel along with executive producers Joaquim Dos Santos and Lauren Montgomery and story editor Josh Hamilton.\r\n\r\nFear the Walking Dead(11:15-12:15 p.m., Hall H, AMC) Moderated by Yvette Nicole Brown, AMC's spinoff prequel show \"Fear the Walking Dead's\" panel will feature cast members Colman Domingo, Alycia Debnam-Carey, Lennie James, Danay Garcia, Garret Dillahunt, Maggie Grace and Jenna Elfman, along with executive producers and showrunners Andrew Chambliss and Ian Goldberg, executive producers Scott M. Gimple, Robert Kirkman, Gale Anne Hurd, Greg Nicotero and David Alpert.\r\n\r\nVikings (11:30-12:30 p.m., Ballroom 20, History) The cast of History's most popular television drama, \"Vikings,\" will invade Ballroom 20 for a panel with the show's creator Michael Hirst. Joining him are cast members Katheryn Winnick, Clive Standen, Alexander Ludwig, Alex Høgh Andersen and Georgia Hirst.\r\n\r\nThe Walking Dead (12:15-1:15 p.m., Hall H, AMC) Moderated by Yvette Nicole Brown, \"The Walking Dead\" panel will include cast members Andrew Lincoln, Norman Reedus, Lauren Cohan, Danai Gurira, Melissa McBride and Jeffrey Dean Morgan, along with executive producer and showrunner Angela Kang, executive producers Scott M. Gimple, Robert Kirkman, Gale Anne Hurd, David Alpert and executive producer, director and special effects makeup supervisor Greg Nicotero.\r\n\r\nDC Super Hero Girls (12:30-1:30 p.m., Room 6DE, Cartoon Network) In addition to a video presentation teasing the new animated super series, producer Lauren Faust, as well as other members of the creative team, will hold a panel to answer audience questions about the show, which follows the young lives of female super heroes Wonder Woman, Supergirl and Batgirl as their teenage aliases Diana, Kara and Barbara. Plus, DC Group Editor Marie Jarvins will offer a glimpse inside of the upcoming books to be released in tandem with the series.\r\n\r\nCastle Rock (12:45-2 p.m., Ballroom 20, Hulu) Based on the works of Stephen King, Hulu's \"Castle Rock\" will premiere its first episode during this exclusive screening, followed by a panel discussion with creators and executive producers Sam Shawand and Dustin Thomason, as well as stars Sissy Spacek, Bill Skarsgard, Melanie Lynskey, and Jane Levy. The \"Castle Rock\" team will talk about their process delving into King's mind to craft a chilling picture of the haunting town that is Castle Rock.\r\n\r\nInvader ZIM: Enter the Florpus! (1-2 p.m., Room 6A, Nickelodeon) Original \"Invader ZIM\" voice cast members Richard Horvitz, Rikki Simons, Kevin McDonald and Wally Wingert will join original series creator Jhonen Vasquez for a panel promoting Nickelodeon's new TV movie based on the early 2000s show about a space alien who finds himself struggling to fit in on Earth, despite his human disguise.\r\n\r\nStar Trek: Discovery (1:30-2:30 p.m., Hall H, CBS) Fans can climb aboard the U.S.S. Discovery to celebrate 50 years of \"Star Trek\" at the \"Star Trek: Discovery\" panel, featuring \"Discovery\" stars Sonequa Martin-Green, Doug Jones, Shazad Latif, Mary Wiseman, Anthony Rapp, Wilson Cruz, Mary Chieffo and Anson Mount, as well as executive producers Alex Kurtzman and Heather Kadin. While reflecting on the space saga that started it all, the panelists will also tease glimpses into the spinoff's sophomore season. The panel will be moderated by series guest star Tig Notaro, who will appear as Chief Engineer Reno.\r\n\r\nDuckTales (3:30-4:30 p.m., Room 6A, Disney Channel) Danny Pudi, Ben Schwartz, and Bobby Moynihan, who voice Donald Duck's rambunctious trio of nephews, Huey, Dewey, and Louie, will all be present for Disney Channel's \"DuckTales\" panel, revealing secrets about the mystery surrounding the young ducks' missing mother, as well as glimpses into the sophomore season. Other panelists include executive producer Matt Youngberg and producer-story editor Francisco Angones.\r\n\r\nAmazon Prime (3:30-5:30 p.m., Ballroom 20) Amazon Prime has booked a two-hour slot to showcase several of its projects, including the upcoming John Krasinski-starrer \"Jack Ryan,\" the Julia Roberts-starrer \"Homecoming,\" \"The Tick,\" \"Good Omens,\" \"Lore,\" and \"The Expanse.\" Executive producer Carlton Cuse will join the panel for \"Jack Ryan,\" as well as creator Ben Edlund for \"The Tick,\" director Sam Esmail for \"Homecoming,\" author and showrunner Neil Gaiman for \"Good Omens,\" executive producer Gale Anne Hurd for \"Lore,\" and showrunner Naren Shankar for \"The Expanse.\"\r\n\r\nFinal Space (3:30-4:10 p.m., Indigo Ballroom, TBS) Series creator Olan Rogers along with the cast and producers of the recently renewed epic space opera will descend on fans for a Q&A about the adventures and mystery of Final Space, including a special fan contest announcement. Along with Rogers, panelists include David Sacks, Tika Sumpter, Tom Kenny and Coty Galloway.\r\n\r\nBob's Burgers (4:15-5:10 p.m., Indigo Ballroom, Fox) Creator and executive producer Loren Bouchard is set to break news about the upcoming season of the Emmy Award-winning animated series. Cast members including H. Jon Benjamin, Dan Mintz, Eugene Mirman, John Roberts, Kristen Schaal and Larry Murphy are slated to feature never-before-seen footage followed by a Q&A panel discussion.\r\n\r\nArcher (5:15-6:15 p.m., Indigo Ballroom, FXX) Coming off its fifth season, the Emmy Award-winning animated comedy series will feature a panel discussion and Q&A. The TBA cast and producers of Adam Reed's sitcom will also be signing autographs.\r\n\r\nSYFY WIRE Fangrrls: Women Changing the Game(5:30-6:30 p.m., Room 6DE, SyFy) Moderated by SYFY WIRE Fangrrls’ managing editor Cher Martinetti, this panel will feature the panelists’ current obsessions and discussions about how each woman is blazing their own path and changing the industry. Joining Martinetti will be Rachel Bloom, Amanda Conner, Lights and Nichelle Nichols.\r\n\r\nMarvel's Cloak & Dagger (5:45-6:45 p.m., Ballroom 20, Freeform) Head of Marvel TV and executive producer Jeph Loeb will be moderating a panel and Q&A with stars Olivia Holt, Aubrey Joseph, Emma Lahana, and Ally Maki along with executive producer and showrunner Joe Pokaski. They will also show exclusive, never-before-seen footage of the series.\r\n\r\nThe Passage (6-7 p.m., Room 6A, Fox) Based on Justin Cronin's best-selling fantasy book trilogy, Fox will debut the world premiere screening of the epic, character-driven thriller about a secret government medical facility experimenting with a dangerous virus that could either cure all disease or cause the downfall of the human race. Following the screening, stars Mark-Paul Gosselaar, Saniyaa Sidney, Henry Ian Cusick, Jamie McShane, executive producer Liz Heldens, executive producer and director Jason Ensler, and author Justin Cronin will appear for a moderated discussion and fan Q&A.\r\n\r\nThe Last Sharknado: It's About Time (7-8 p.m., Room 6BCF, Syfy) The Sharknado franchise is coming to a close with a final TV movie, aptly titled \"The Last Sharknado: It's About Time,\" on Syfy, and panelists Ian Ziering, Tara Reidand, and Cassie Scerbo will be present to answer fans last burning questions about the disaster-prone universe. The panelists will also give attendees a glimpse into the final installment.\r\n\r\nThe Twilight Zone Marathon Screening (7:15-9:15 p.m., Room 6A, CBS All Access) The new, modern \"Twilight Zone\" coming to CBS All Access reimagines the iconic series that took viewers to another dimension--a dimension not only of sight and sound but of mind. CBS will host a special marathon screening and a look back at some of the fan-favorite episodes from the original series. Concessions and an exclusive giveaway item will be provided.\r\n\r\nPreacher (7:30-8:30 p.m., Hall H, AMC) The television show adaptation of Garth Ennis' comic book series \"Preacher\" will feature a panel including cast members Dominic Cooper, Ruth Negga and Joseph Gilgun, along with executive producer and showrunner Sam Catlin and executive producers Seth Rogen and Evan Goldberg.\r\n\r\nSaturday, July 21:\r\n\r\nUnikitty! (10-11 a.m., Room 6DE, Cartoon Network) \"The Lego Movie's\" Unikitty moves from a supporting role on the big screen to a starring role on the small screen with this light and colorful children's programming. The \"Unikitty\" spot will feature an exclusive screening of a new episode, as well as a panel discussion with producers Lynn Wang and Ed Skudder, animation director Anna Hollingsworth and the voice cast, Tara Strong, Grey Griffin, Eric Bauza, H. Michael Croner, Roger Craig Smith.\r\n\r\nBlack Lightning (11-11:45 a.m., Ballroom 20, The CW) A video presentation will welcome fans back to the corrupt world Black Lightning feels obligated to come out of hiding in order to protect. The following panel will feature stars Cress Williams, China Anne McClain, Nafessa Williams, Christine Adams, Marvin “Krondon” Jones III, Damon Gupton, and James Remar, as well as producer Salim Akil, who will provide a first look into the DC series super sophomore season.\r\n\r\nThe Simpsons (12-12:45, Ballroom 20, Fox) Looking ahead to their 30th season, creator Matt Groening, executive producer Al Jean, supervising director Mike Anderson, director David Silverman, and Tress MacNeille (the voice of Agnes Skinner, Lindsey Naegle, and more) will appear in a discussion moderated by Johnathan Fernandez. There will also be prizes.\r\n\r\nKrypton (12-12:50 p.m., Indigo Ballroom, Syfy) With the help of a video spot, panelists will offer an exclusive glimpse into Season 2 of \"Krypton,\" which follows DC's Superman as his life spirals into imminent peril. Joining the discussion are executive producers and DC veterans David S. Goyer and Cameron Welsh, as well as members of the live action cast. The panelists will also take a look back on the most shocking moments of Season 1 in anticipation for the return to Krypton.\r\n\r\nBig Hero 6 the Series (12:30-1:30 p.m., Room 6A, Disney Channel) The creative minds and stars of Disney's TV spinoff of 2014's \"Big Hero 6\" will join Comic-Con to talk about the process of repurposing the beloved characters and settings for a TV format, as well as reveal footage from the new series. Panelists include voice actors Ryan Potter, Scott Adsit, Jamie Chung, Khary Payton, Genesis Rodriguez and Brooks Wheelan, as well as executive producers Mark McCorkle, Bob Schooley and Nick Filippi.\r\n\r\nManifest (1-2 p.m., Indigo Ballroom, NBC) NBC will premiere the pilot of its new time warp drama \"Manifest,\" which follows a group of passengers who disembark from a turbulent flight to New York to find that five years have passed in the world around them, and their loved ones, who thought them dead, have moved on. Executive producer Jeff Rake and stars Melissa Roxburgh and Josh Dallas make up the team of panelists, who will give audiences a first look into the unexpected take on a crash-landing narrative.\r\n\r\nAmerican Dad! and Family Guy (1-2:15 p.m., Ballroom 20, Fox) It's a Smith-family Funday with Wendy Schaal (Francine), Scott Grimes (Steve), Dee Bradley Baker (Klaus) along with Curtis Armstrong (Snot), Eddie Kaye Thomas (Barry), Daisuke Suzuki (Toshi) and executive producer Matt Weitzman on-hand to treat \"American Dad!\" fans to a first look at scenes from all-new episodes coming soon to TBS. Then, Seth MacFarlane, Alex Borstein, Seth Green, Mike Henry, and executive producers Rich Appel, Alec Sulkin, and Steve Callaghan will take a look back at their favorite \"family\" memories, plus a sneak peek featuring hilarity and hi-jinx from the upcoming season.\r\n\r\nLegacies (2-2:50 p.m., Indigo Ballroom, The CW) When one \"Vampire Diaries\" spinoff closes, another opens. Set in the same world of witchcraft and magical creatures as \"The Originals\" and its parent series, \"Legacies\" centers on Hope Mikaelson, Klaus Mikaelson's teenage daughter, as well as Alaric Saltzman's twin sons, who are all enrolled at the Salvatore School for the Young and Gifted. The CW's exclusive video presentation and panel with executive producer Julie Plec and stars Danielle Rose Russell and Matthew Davis will return fans to the \"TVD\" universe through young, new eyes.\r\n\r\nThe Gifted (2:30-3:15 p.m., Ballroom 20, Fox) Season 2 of \"The Gifted\" picks up after the explosion of the Atlanta Station, as the Mutant Underground search for their friends and family who left with The Inner Circle. Having tracked them outside of Washington, D.C., they must contend with new groups with extreme ideologies, both human and mutant alike, to stave off a brewing conflict. Executive producers Matt Nix and Jeph Loeb and stars Stephen Moyer, Sean Teale, Jamie Chung, Emma Dumont, Blair Redford, Natalie Alyn Lind, and Skyler Samuels will share an exclusive first look at the upcoming season.\r\n\r\nCosmos: Possible Worlds (3-3:50 p.m., Indigo Ballroom, Fox) \"Cosmos,\" Fox's space odyssey docu-series hosted by astrophysicist Neil deGrasse Tyson, will debut its sophomore season in the fall, and Tyson will be present at Comic-Con to give insight into Season 2's universal wonders. Executive producer, writer, director and creator Ann Druyan and executive producers Seth MacFarlane, Brannon Braga and Jason Clark will join Tyson for the panel discussion.\r\n\r\nSupergirl (3:30-4:15 p.m., Ballroom 20, The CW) The \"Supergirl\" panel consists of cast members Melissa Benoist, Chyler Leigh, Mehcad Brooks, David Harewood, Katie McGrath and Jesse Rath, as well as executive producers Robert Rovner, Jessica Queller and Sarah Schechter, as they will discuss what they're most excited for fans to see in Season 4, as well as answer any questions still burning about Season 3. A video presentation will give a first look into the fourth season.\r\n\r\nThe Orville (4-4:50 p.m., Indigo Ballroom, Fox) Back for a second season, executive producer and creator Seth MacFarlane will appear along with some of the crew members from the U.S.S. Orville including Adrianne Palicki, Penny Johnson Jerald, and Scott Grimes. Executive producers David A. Goodman, Brannon Braga, and Jon Cassar will also join them to tease an exclusive look at some of the new and exciting missions in the upcoming season.\r\n\r\nArrow (4:15-5 p.m., Ballroom 20, The CW) After an action-packed sixth season, which forced Oliver Queen to unmask himself as the Green Arrow, panelists and stars Stephen Amell, David Ramsey, Emily Bett Rickards, Katie Cassidy, Echo Kellum, Juliana Harkavy, Rick Gonzalez, and Colton Haynes, as well as executive producer Beth Schwartz , will offer glimpses into Oliver's Season 7 journey, which sees him more vulnerable than ever now that his identity has been revealed.\r\n\r\nThe Man in the High Castle (4:15-5:15 p.m., Room 6A, Amazon Prime) The stars and producers of Amazon Prime's \"Man in the High Castle\" will join the SDCC lineup to discuss the upcoming third season of the sci-fi thriller, promising exclusive sneak peaks into the show's new storyline and answers to fan questions. Panelists include actors Alexa Davalos, Rufus Sewell, Jason O'Mara and Stephen Root, as well as executive producers Isa Dick Hackett and Dan Percival.\r\n\r\nDC's Legends of Tomorrow (5-5:45 p.m., Ballroom 20, The CW) \"Legends\" panelists and stars Caity Lotz, Brandon Routh, Dominic Purcell, Nick Zano, Maisie Richardson-Sellers, Tala Ashe, Matt Ryan, Jes Macallan, Courtney Ford, showrunner Phil Klemmer, and producer Keto Shimizu will discuss the Legends sophomore season, which led to the defeat of Mallus, as well as the upcoming third season, which will see the heroes face new nemeses in the form of \"fugitives\" that consist of magical creatures from myths, fairytales, and legends.\r\n\r\nThe Flash (5:45-6:30 p.m., Ballroom 20, The CW) \"The Flash\" rounds out The CW's Saturday panels, featuring stars Grant Gustin, Jesse L. Martin, Tom Cavanagh, Candice Patton, Danielle Panabaker, Carlos Valdes, Hartley Sawyer, Jessica Parker Kennedy, and Danielle Nicolet, as well as executive producer Todd Helbing, who will talk the series' upcoming fifth season as the Flash moves on from his battles with The Thinker to tackle challenges presented by new characters, including his daughter from the future, Nora.\r\n\r\nDeadly Class (6-6:50 p.m., Indigo Ballroom, Syfy) Based on the graphic novel by panelists Rick Remender and Wes Craig, this Comic-Con spot will offer fans a glimpse into Syfy's new series \"Deadly Class,\" which centers on a teen who suddenly finds himself enrolled in the King's Dominion, one of the world's top crime academies. Miles Orion Feldsott, Mick Betancourt, Benjamin Wadsworth, Lana Condor, María Gabriela De Faría, and Benedict Wong will join the authors to offer a sneak peak into the action-packed adaptation.\r\n\r\nCrazy Ex-Girlfriend Live Starring Rachel Bloom (7:30 p.m., Balboa Theatre, The CW) The cast of the award-winning musical comedy is taking their show on the road in this live tour. Rachel Bloom, the rest of the cast, and the \"Crazy Ex-Girlfriend\" songwriters are bringing the show's songs to life in this very special live concert event. The concert is a ticketed event and is currently sold out.\r\n\r\nProject Blue Book (6:45-7:45, Room 6A, History) The cast of the upcoming science fiction drama \"Project Blue Book\" will engage its earthling audience for a panel including the show's creator David O'Leary and writer Sean Jablonski. Cast members include Aidan Gillen, Michael Malarkey, Neal McDonough and Laura Mennell.\r\n\r\nWynonna Earp (6:45-7:45 p.m., Room 6DE, Syfy) Panelists Melanie Scrofano, Shamier Anderson, Tim Rozon, Domonique Provost-Chalkley, Katherine Barrell, Varun Saranga, Chantel Riley, Emily Andras, and Beau Smith will take fans behind the scenes of the fantasy series as it nears its third season, including behind-the-scenes reels, as well as exclusive footage from the upcoming episodes.\r\n\r\nThe Magicians (7-8 p.m., Indigo Ballroom, Syfy) Panelists John McNamara, Sera Gamble, Jason Ralph, Stella Maeve, Olivia Taylor Dudley, Hale Appleman, Arjun Guptaand, and Summer Bishil will offer fans an exclusive look into the upcoming fourth season of \"The Magicians\" based on the hit young adult novels by Quentin Coldwater.\r\n\r\nSunday, July 22:\r\n\r\nSupernatural (10:30-11:30 a.m., Hall H, The CW) As \"Supernatural\" nears its 14th season, fans will be treated to a video presentation and Q&A with stars Jensen Ackles, Jared Padalecki, Misha Collins, Alexander Calvert, as well as executive producers Robert Singer, Andrew Dabb, Eugenie Ross-Leming and Brad Buckner, who will answer any questions about Season 13's finale and tease the content of the show's latest season. The video reel will touch on series highlights so far in anticipation for \"Supernatural's\" 300th episode.\r\n\r\nRiverdale (11:45-12:45 p.m., Hall H, The CW) \"Riverdale\" will make its third Comic-Con appearance with a video presentation and panel featuring stars KJ Apa, Lili Reinhart, Camila Mendes, Cole Sprouse, Marisol Nichols, Madelaine Petsch, Ashleigh Murray, Mark Consuelos, Casey Cott, Skeet Ulrich, Mädchen Amick, Luke Perry, and Vanessa Morgan, as well as producers Roberto Aguirre-Sacasa, Sarah Schechter and Jon Goldwater. The Archie team will discuss Season 3's post-hiatus surprises as the gang continues to uncover the many dark secrets casting an ominous shadow over Riverdale.\r\n\r\nMayans M.C. (1-2 p.m., Hall H, FX) The next chapter of the \"Sons of Anarchy\" saga is here. Set in a post-Jax Teller world, Ezekiel \"EZ\" Reyes is fresh out of prison and a prospect in the Mayans M.C. charter on the Cali/Mexi border. Now, EZ must carve out his new identity in a town where he was once the golden boy with the American Dream in his grasp. Discussing what to look forward to from Season 1, co-creator, executive producer, writer, and director Kurt Sutter will appear in a conversation alongside fellow co-creator, co-executive producer, and writer Elgin James, executive producer and director Norberto Barba, and stars JD Pardo, Clayton Cardenas, Edward James Olmos, Sarah Bolger, Michael Irby, Carla Baratta, Antonio Jaramillo, Raoul Max Trujillo, Richard Cabral, Danny Pino, Emilio Rivera, Frankie Loyal, Joseph Lucero, and Vincent Rocco Vargas.\r\n\r\nLegion (2:15-3:15 p.m., Hall H, FX) Noah Hawley's groundbreaking superhero series starring Dan Stevens, Rachel Keller, and Aubrey Plaza will give fans a chance to dive deeper into the recently concluded second season. Executive producers John Cameron and Marvel's Jeph Loeb, along with co-executive producer Nathaniel Halpern, will discuss what to look forward to from Season 3. Cast member appearances are still TBD.\r\n\r\nAdditional panels and events:\r\n\r\nDoctor Who (TBA, Hall H, BBC America) The 13th Doctor, played by Jodie Whittaker, will make her debut in San Diego this year, alongside \"Doctor Who\" co-stars Tosin Cole and Mandip Gill, showrunner Chris Chibnall and executive producer Matt Strevens. Hosted by comedian Chris Hardwick, the panel will include a sneak peak at Season 11 of the revived show, which previously starred Matt Smith, David Tennant and Peter Capaldi in the title role. Whittaker will be the first woman to play The Doctor when the show returns in the fall.\r\n\r\nMr. Mercedes (643 G Street, AT&T Audience Network) Based on the trilogy by Stephen King, \"Mr. Mercedes\" will be bringing an \"Immersive Experience\" to give fans a glimpse into the past and into the future of the series at SDCC, which will include an augmented reality adventure game, a virtual reality escape room game, and a private screening room where media, VIP, and lucky fans will get the chance to watch a sneak peek at Season 2. \"Mr. Mercedes\" will also appear in a show panel, but date, time, and panelists are TBA.\r\n\r\nTom Clancy's Jack Ryan (Park located at the corner of 1st street and Martin Luther King Promenade, Amazon) In addition to its mega-panel, Amazon is bringing a \"Jack Ryan\" fan experience to San Diego this Comic-Con. Visitors can complete the hyper-reality virtual reality spy experience Jack Ryan Training Field by infiltrating, fighting and evading the enemy to gain full field clearance. They will then use that training to help Jack Ryan himself in Dark Ops, a groundbreaking escape room that recreates the pilot episode. Attendees can also explore the Middle Eastern bazaar, which has assignments to be completed at every turn, watch a live leaderboard and pick up some iconic Jack Ryan swag. Created with MediaMonks, the Jack Ryan Training Field stands over 30 feet tall and uses the latest Optitrack 4D and Oculus Rift technology to make visitors physically feel as if they were thrust into the action. Dark Ops is a first of its kind escape room, created by AKQA and Unit 9, which lets participants live the first episode of \"Jack Ryan.\" This fan experience will take place Thursday, July 19 through Sunday, July 22, from 9 a.m. to 7 p.m. Thursday through Saturday, and 9 a.m. to 5 p.m. on Sunday.\r\n\r\nMarvel's Cloak & Dagger - Fan Activation (Petco Park, Freeform) On-site through Sunday, Freeform will tie in the \"divine pairing\" theme of the show by recreating the iconic moment between the two leads Tyrone and Tandy when their powers interact. Participants will be harnessed to a bungee that will propel them backwards to feel the force of their powers. A slow-motion recording will capture the moment, which will also include an overlay effect that shows both the light and dark energy emitting from the participants. Fans can also stop by the ROXXON Corp station to create their own customized badge and lanyard. Each badge will include a secret code that is connected to a wide range of prizes from Sony PlayStation Vue and Freeform.\r\n\r\nStar Trek: Discovery Mirror Universe Gallery Takeover (Michael J. Wolfe Fine Arts Gallery, CBS All Access) CBS is creating a fully immersive \"Star Trek: Discovery\" Mirror Universe experience. The exhibit, scheduled to run from Thursday, June 19 through Sunday, July 22, will feature a photo opportunity with Emperor Georgiou's throne and will showcase props and costumes from the series' Terran Empire. The gallery will also house an official \"Star Trek\" shop with Comic-Con exclusives.\r\n\r\nThe Purge (215 Tony Gwynn Drive, USA) On Thursday, July 19, USA will open the doors of America’s first Purge City store, an immersive experience in the heart of San Diego’s Gaslamp District, to the public. Transporting fans into the world of \"The Purge\", Purge City is a tongue-in-cheek, one-stop shop for the perfect Purge Night, where friendly Purge City staff help visitors browse the aisles for items from emergency candles to masks to energy drinks—to help citizens stay safe and awake for the 12 hours of annual lawlessness. Shoppers can also enjoy Purge photo opportunities and browse an area dedicated to the political rise of the New Founding Fathers of America, from the first Purge experiment on Staten Island to subsequent annual Purge Nights.\r\n\r\nCosmos Ship of the Imagination Experience (Hilton Bayfront Lawn, Fox) Fans of Neil deGrasse Tyson’s docu-series \"Cosmos\" will have the chance to launch into space via a 33-foot visual effects viewing dome. Aboard the recreated set of the show’s “Ship of the Imagination,” fans will get a sneak peek of the series’ upcoming season via a two-minute VFX display exploring space from the Sagittarius field to other planets, featuring the same colors and graphics as seen on “Cosmos.” After the dome show, the audience will have access to a photo opportunity sitting in Tyson’s captain’s chair, delivered directly from the “Cosmos” set.\r\n\r\nThe Passage Project Noah Viral Cell Lab (Hilton Bayfront Lawn, Fox) Fox's upcoming biomedical apocalypse drama \"Passage\" is recreating the medical labs from the show that launched the controversial Project Noah, offering guests an up-close look at the lab's viral patients.\r\n\r\nThe Orville Pedi-Pods Fleet (Gaslamp Quarter, Fox) Comic-Con attendees seeking reprieve from foot travel will have the opportunity to hop on one of \"The Orville's\" custom pedi-cab shuttle pods to any location in the Gaslamp Quarter complete with a U.S.S. Orville Crew Pin and a sneak peak at the sophomore season of Fox's comedic space odyssey.\r\n\r\nBob's Burgers Shake Shack (Shake Shack, Mission Valley, Fox) Fans of food and \"Bob's Burgers\" can satisfy their cravings by taking a charter bus to \"Shake Shack\" in Mission Viejo directly from the Comic-Con headquarters where they can eat the “Burger of the Day” with a side of fries — and maybe even some special guests from the show behind the counter.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1529957741.0, "source": "https://variety.com", "summary": ""}