{"url": "www.mercurynews.com/2018/03/27/angelina-jolies-new-boyfriend-hes-not-what-youd-expect-from-angelina-jolie/", "text": "CLICK HERE if you are having trouble viewing the photos or video on a mobile device\n\nWith Angelina Jolie finally moving on from her nasty, splashy split from Brad Pitt, you would expect her to shy away from dating someone else super-famous.\n\nBut you would think her next romantic interest would still be someone whose profession matched her preferences for prestige artistry or international do-gooding: a documentary filmmaker, a human rights crusader, an Ebola doctor.\n\nBut no, Jolie’s choice reportedly is far more home-grown and, well, mundane in a L.A. way.\n\nJolie, the Oscar winning actress, UNHCR special envoy and occasional New York Times op-ed columnist, is dating a real estate agent. That’s according to a new report in “Entertainment Tonight.”\n\nOf course, at this stage, things are still pretty new, which means “it’s not serious,” a source told ET.\n\nBut the so-called real estate agent, who has not been identified, reportedly has a few things going for him that would make him appealing to the glamorous 42-year-old actress and mother of six, ET said.\n\nHe’s handsome, a source close to the actress told ET. He’s also “older-looking” and isn’t “a celebrity or high-profile” in any way, the source added. These are qualities that would probably make him relatively down-to-earth — by Jolie standards — and confer on him a maturity and stability that could be comforting to her.\n\nAfter all, she was “in a very bad place” after her acrimonious split from Pitt in September 2016, “ET” reported. Their breakup included allegations of drinking and anger management problems — on his part — and led to investigations by child welfare authorities until the couple quietly worked out visitation and other issues. The estranged couple share children Maddox, 16, Zahara, 13, Pax, 14, Shiloh, 11, and nine-year-old twins Knox and Vivienne.\n\n“Just having another adult to spend time with has been helpful,” the source added to ET.\n\nBut not so fast, sources have told both Us Weekly and People. Both outlets reported Tuesday, citing their own Jolie sources, that Jolie isn’t dating a real estate agent — or anyone for that matter at the moment.\n\n“Yes, she has hung out with a couple of guys over the last year, but it’s extremely low-key,” a source told Us.\n\nUnfortunately, things are still difficult between her and Pitt, added The Daily Mail. “Things between Brad and Angie really ended poorly, and while they’ve attempted therapy with the children, they can barely be in the same room together,” a source said.\n\nABOVE: Today’s top stories include an expansion at Yosemite’s Bridal Falls to make parking easier, California is at odds with the feds again, this time it’s over the 2020 census and find out how to ease your allergies woes now that the sun is back in the Bay Area.\n\nBecause the breakup has forced Jolie to curtail her globe-trotting ways and base herself in Los Angeles — close to Pitt for the sake of the children — there is speculation that if Jolie were seeing a real estate agent — or anyone else — the man would be based in Los Angeles, the Daily Mail said.\n\nAnd if there is a real estate agent with whom she has become friendly, he could be someone with celebrity clientele.\n\nPerhaps he could have been someone involved in settling Jolie into her new house — the $25 million estate in Los Feliz she bought last year, which once belonged to legendary director Cecil B. DeMille. Incidentally, Jolie’s mansion is “just down the street” from Pitt’s estate in Los Feliz — for the sake of the kids, of course.\n\nWhether or not there is a real estate agent boyfriend in Jolie’s life, or she’s just single and focusing on her kids, her friends are relieved to see her happy for a change, ET reported.\n\nShe also seems to have settled into enjoying her day-to-day life. She is often spotted out and about in Los Angeles, usually with one of her six kids in tow, doing ordinary-people things like shopping at a neighborhood Whole Foods or going to the movies — including, reportedly, the new “Tomb Raider” reboot, starring Alicia Vikander in the iconic role that Jolie made famous in 2001’s “Lara Croft: Tomb Raider” and the 2003 sequel.\n\nBut fans should get over the idea that Jolie and Pitt will reunite. “It will never happen,” a source told ET. The 54-year-old Pitt is quietly and casually going out on dates, but mostly getting out to spend time with friends, “ET” added.\n\nThis story has been updated.", "images": ["https://www.mercurynews.com/wp-content/uploads/2017/09/jolie_2.jpg?w=1024&h=733", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/05/2000demilledr_1-800x500_c.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2017/05/joliehouse4.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2016/10/joliepittdivorce.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/09/jolie_5.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/09/jolie_2.jpg?w=1024&h=733", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/03/27/angelina-jolies-new-boyfriend-hes-not-what-youd-expect-from-angelina-jolie/", "title": "Angelina Jolie’s reported new boyfriend is not what you’d expect from Angelina Jolie", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Angelina Jolie supposedly has started to date again since her nasty, splashy split from Brad Pitt, and her new boyfriend is 'handsome' and 'older.'", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Angelina Jolie’s reported new boyfriend is not what you’d expect from Angelina Jolie", "url": "https://www.mercurynews.com/2018/03/27/angelina-jolies-new-boyfriend-hes-not-what-youd-expect-from-angelina-jolie/", "description": "Angelina Jolie has started to date again since her nasty, splashy split from Brad Pitt, and her new boyfriend is ‘handsome’ and ‘older,’ according to reports.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/09/jolie_2.jpg?w=1024&h=733", "width": 1024, "height": 733}, "locale": "en_US"}, "article": {"published_time": "2018-03-27T13:58:44+00:00", "modified_time": "2018-03-28T22:13:42+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Angelina Jolie’s reported new boyfriend is not what you’d expect from Angelina Jolie"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/09/jolie_2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1522080000.0, "source": "http://www.mercurynews.com", "summary": ""}