{"url": "https://en.wikipedia.org/wiki/You_Can%27t_Do_That_on_Television", "text": "Canadian sketch comedy television series\n\nYou Can't Do That on Television is a Canadian sketch comedy television series that first aired locally in 1979 before airing in the United States in 1981. It featured preteen and teenage actors in a sketch comedy format similar to that of American sketch comedies Rowan & Martin's Laugh-In and Saturday Night Live. Each episode had a specific theme normally relating to pop culture of the time. During its original run, the show was seen as one and the same with the cable network Nickelodeon in its early years on the air, achieved high ratings, and is most famous for introducing the network's iconic green slime. The show was also notable for launching the careers of many performers, including alternative rock musician Alanis Morissette, filmmaker Patrick Mills, and television producer and screenwriter Bill Prady.\n\nTed Wilson and Les Lye on set\n\nThe show was produced by and aired on Ottawa's CTV station CJOH-TV, and was marketed specifically for an American audience. After production ended in 1990, the show continued in reruns on the Nickelodeon cable network in the United States through 1994, when it was replaced with the similar themed sketch-comedy variety program All That.\n\nThe show is the subject of the 2004 feature-length documentary You Can't Do That on Film,[1] directed by David Dillehunt, which was released in North America by Shout! Factory in 2012.\n\nAbby Hagyard played numerous characters on YCDTOTV\n\nHistory [ edit ]\n\nLocal television [ edit ]\n\nYou Can't Do That on Television debuted on February 3, 1979 on CJOH-TV in Ottawa as a locally-aired and produced one-hour low-budget variety program with some segments performed live. The show consisted of comedy skits, music videos (usually three per episode) and live phone-in contests in which the viewer could win a variety of prizes (transistor radios, record albums, model kits, etc.). The format also included performances by local disco dancers and special guests such as Ottawa-based cartoonist Jim Unger. Every week the show took its \"Roving Camera\" to hangouts around town, recording kids' jokes or complaints about life, which would be played on the following week's broadcast. The show also made several tie-ins with Ottawa radio station CFGO, then a popular Top 40 music outlet (now a sports-talk station), including having one of the station's personalities, Jim Johnson, emcee the disco dance segments and share tidbits about the artists featured in the music videos played on the show, yet the show never really took off.\n\nVeteran comedy actor Les Lye played numerous recurring characters and was initially the only adult to perform in the show's sketches; he was also the only actor to appear for the entire length of the series' run. Actress Abby Hagyard, who played \"Mom\" opposite Lye's role as \"Dad\", would not join the cast until 1982. Occasionally, the older children in the cast (such as Christine McGlade, Sarah West, or Cyndi Kennedy) played adult characters.\n\nThe show was meant to offer a program for children on Saturday mornings that made no attempt to be an educational program. The idea was successful, as (according to one episode) the show scored a 32 share of the ratings for CJOH in its 10:30 a.m. Saturday time slot. The studio masters for the first-season episodes no longer exist, and thus all but three of the episodes from this season were believed lost until early 2013, when copies from off-air recordings of the missing episodes from that season were contributed by Roger Price and posted on YouTube.\n\nNational television in Canada [ edit ]\n\nAfter a successful first season, a national network version of You Can't Do That on Television entitled Whatever Turns You On was produced for CTV and debuted in September 1979 (having already aired an hour-long pilot episode in May). The show's creators shortened it to a half-hour, removed local content, added a laugh track, and replaced music videos with live performances from popular artists from Canada at the time, including Trooper, Max Webster, Ian Thomas, Ottawa's own Cooper Brothers (one of whose members, Dick Cooper, would later become a writer for YCDTOTV), and disco singer Alma Faye Brooks. Ruth Buzzi joined the cast playing many of the adult female characters, which included a strict schoolteacher named Miss Fitt and the studio secretary Miss Take. In addition, 22 children from the first season were trimmed down to seven: Christine McGlade, Lisa Ruddy, Jonothan Gebert, Kevin Somers, Kevin Schenk, Rodney Helal, and Marc Baillon (another first-season cast member, Elizabeth Mitchell, only appeared in the pilot episode). The show was placed in the 7:00 pm timeslot on Tuesday nights, which due to low ratings, and some CTV affiliates opted not to carry the show, possibly due to content. As a result, CTV cancelled the show in December 1979 after only 13 episodes.\n\nIn January 1981, production on YCDTOTV resumed, and a new set of episodes aired locally on CJOH through May of that year. The format of the 1981 episodes as aired on CJOH was similar to that of the inaugural 1979 season, but each episode featured skits that revolved around a certain topic (something that carried over from Whatever Turns You On), and as the music genre's popularity had died down by this time, the disco dancers were replaced by video game competitions, which had become popular by then.\n\nIn the meantime, Price and Darby decided to try to syndicate the show, and they edited each 1981 episode into a half-hour format similar to Whatever Turns You On. Some scenes were re-shot to filter out any Ottawa-based or Canadian content, and the half-hour syndicated edits became entirely sketch comedy. The 1981 season was rerun on CJOH in early 1982 in the half-hour syndicated format; to make up for the removal of local content, Price and Darby made a new local show for CJOH titled Something Else, which featured many of the YCDTOTV cast in a game show/variety format similar to The Price Is Right. The YCDTOTV team also made a pilot television film for Disney in 1981 titled Bear Rapids, which was never picked up.\n\nFour of the hour-long CJOH episodes from the 1981 season (\"Strike Now\", \"Sexual Equality\", \"Crime and Vandalism\", and \"Peer Pressure\") are available for public viewing on YouTube. The rest are only currently available in the half-hour edits.\n\nThe show featured live music performances, including band Trooper\n\nNickelodeon [ edit ]\n\nPeak years [ edit ]\n\nIn 1981, the new American youth-oriented cable network, Nickelodeon, took an interest in YCDTOTV. Nickelodeon originally aired several episodes in the edited half-hour syndicated format as a test run. Response was positive, and in January 1982, Nickelodeon began airing the entire edited season and YCDTOTV became their highest rated show by 1983.\n\nProduction on new episodes of YCDTOTV resumed full-time in 1982, all of them made in the half-hour all-comedy format, with Nickelodeon and CJOH as production partners. Over the next few years, the series was only seen occasionally on a national basis within Canada (CTV, the network of record for the show's home base of CJOH-TV, played the show on some Saturday mornings in 1982), but YCDTOTV continued to expand its audience in the United States on Nickelodeon, where it initially aired five times a week and, eventually, every day. It was not until 1988 that the series finally gained similar national exposure in its native Canada, when it was added by the newly-established youth-oriented YTV cable network.\n\nViewers in the United States were given the opportunity to enter the Slime-In, a contest hosted by Nickelodeon that flew the winner to the set of You Can't Do That on Television to be slimed (a contest later replicated by Canada's YTV as the Slime Light Sweepstakes).\n\nIn 1983, at WGBH-TV in Boston, Massachusetts, Roger Price created a successor of YCDTOTV for the American public television network, PBS, titled Don't Look Now (originally to be titled Don't Tell Your Mother!). The show was similar to the 1979 season of YCDTOTV, including music videos and several earlier YCDTOTV skits and motifs (including a variation on the show's trademark green slime gag called \"Yellow Yuck\"). Despite high ratings, the series ended after its five-episode trial run in October 1983, possibly due to complaints from parents for its content, and by Nickelodeon for concerns the YCDTOTV would continue[2] and that the success of Don't Look Now, and if had it not been cancelled may have spelled the end of YCDTOTV.[3] The series was believed lost until all five episodes surfaced in early 2013; these have been posted on YouTube excluding the copyrighted music videos.\n\nRoger Price created another show for Nickelodeon, the less successful Turkey Television, in 1985, which used several main cast members of YCDTOTV, including Les Lye, Christine McGlade, Kevin Kubusheskie and Adam Reid. By this time, McGlade, now well into her twenties and eager to move on with her life, had moved to Toronto and was flying back to Ottawa for YCDTOTV taping sessions. Turkey Television also marked McGlade debut as a producer, a career with which she would continue after leaving YCDTOTV in 1986. Another Price production using YCDTOTV cast members, UFO Kidnapped, had been made in 1983. Although the pilot aired on Nickelodeon, the series was not picked up.\n\nChanging of the guard and controversies [ edit ]\n\nBy 1987, many of the \"veteran\" cast members such as Matt Godfrey, Doug Ptolemy, Vanessa Lindores, and Adam Reid had grown too old for the show. Longtime hostess Christine McGlade (\"Moose\") had departed the previous year, as had Alasdair Gillis (who had been promoted to co-host with McGlade in 1985 before leaving towards the end of the 1986 season); Lisa Ruddy (\"Motormouth\"), McGlade's longtime sidekick on the show, was also gone, having left at the end of the 1985 season. Only five episodes were filmed in this season, the shortest season of You Can't Do That on Television's 15-year span on the air (tied with 1990, which also lasted only five episodes), and one of the episodes (Adoption) proved so controversial that it was banned after being shown twice[4] (a \"DO NOT AIR\" sticker was reportedly placed on the master tape at CJOH).[5][6] Adoption is the only episode that was banned in the United States, In Canada, the \"Divorce\" episode was banned, but the \"Adoption\" episode was shown with one part cut: in the sketch where Senator Prevert calls the adoption agency to send his son Adam back after using him to do chores all day, the part where Senator Prevert calls the adoption agency officer a \"damn bureaucrat\" after learning that \"Adoption is forever\" was edited out.\n\nIn addition, Nickelodeon had removed the half-hour edits of the 1981 episodes of You Can't Do That on Television from its daily time slot rotation, along with the 1982 \"Cosmetics\" episode.[citation needed] The 1981 episodes were supposed to air for the last time ever during a week-long promotion in 1985 called \"Oldies But Moldies\", which featured contests where Nickelodeon viewers could win prizes like \"tasty, fresh chocolate syrup\"; instead, the episodes continued to air until the end of 1987 but not very often. Reportedly, this was because Nickelodeon's six-year contract to air the 1981 season expired in 1987, and since Nickelodeon was beginning to aim for a younger demographic and many of the 1981 episodes dealt with topics more relevant to adolescents (such as smoking, drugs, sexual equality, and peer pressure); the network opted not to renew the contract. Nickelodeon allegedly removed the \"Cosmetics\" episode from rotation for the latter reason (although the \"Addictions\" episode from that same season was not dropped). By contrast, when Canada's YTV began airing the series in 1989, they continued airing the 1981 season as part of the package, as well as Whatever Turns You On, which was never shown in the United States.\n\nFinal years [ edit ]\n\nRoger Price moved to France following production of the 1987 season, after being informed that Nickelodeon was not planning to order more episodes, and production was suspended for 1988. When Price eventually returned to Canada, he wanted to resume production of You Can't Do That on Television from the city of Toronto, but was convinced by the cast and crew to return to Ottawa and CJOH. Nickelodeon ordered more YCDTOTV episodes for the 1989 season. Auditions were held at CJOH in the spring of 1988, and taping began that fall. The only child cast members to make the transition from 1987 to 1989 were Amyas Godfrey and Andrea Byrne, although a few minor cast members seen in 1986, including Rekha Shah and James Tung, returned for an episode or two.\n\nOpinions on the 1989 and 1990 episodes of YCDTOTV are mixed among longtime fans of the show, particularly regarding the new episodes' increasing reliance on bathroom humor and more slime and water gags (which was supposedly at the request of Nickelodeon executives). In any case, the show did not completely sever ties to its past, as many former cast members reappeared during the 1989 season in cameo roles, most notably in the \"Age\" episode, which was hosted by Vanessa Lindores (who was slimed twice during it) and also featured cameos by Doug Ptolemy, Alasdair Gillis, Christine McGlade, and Kevin Kubusheskie (who by that time had become a stage producer on the show). Gillis also appeared briefly in the \"locker jokes\" segment during the \"Fantasies\" episode, and Adam Reid, who by this time had become an official writer for YCDTOTV, also appeared (and was slimed) at the very end of the episode \"Punishment\".\n\nThe show's ratings declined throughout 1989 and 1990. The network's desire to produce more of its own shows at its new studios at Universal Studios in Orlando, Florida, coupled with low ratings, causing production of You Can't Do That on Television to officially end in 1990 after only five episodes (tying 1990 with 1987 as the shortest season of the series). Though ratings declined, Nickelodeon continued to air reruns until January 1994, at which point it was only being aired on weekends.\n\nOn October 5, 2015, Nickelodeon's sister network TeenNick brought the show back in reruns as the first program on The Splat, its expanded classic-themed block. The airings began with the first two 1981 episodes, \"Work\" and \"Transportation,\" marking the first time those episodes had aired on American television in 30 years. However, only two additional episodes (\"Christmas\" and \"Holidays\" from the 1984 season) have been aired since.\n\nInternational airings [ edit ]\n\nYCDTOTV was aired in Australia on ABC Television in the mid-1980s, beginning with 1981's \"Work, Work, Work,\" it aired at 5:30 pm weekdays until August 1987 when the initial run ended, after its first two runs it was moved to a 7:00 am weekday morning timeslot in 1989. It continued to run on and off on ABC Television for the next few years, mainly as a filler during the school holidays until the rights expired in the early 1990s. It was very successful in Australia. The show was aired in its entirety, including the final seasons of 1989–90. As in the United States, the series was rerun into the early 1990s.\n\nThe series was also seen in some European countries and reportedly in the Middle East as well (Arabic dubbing), although no French-dubbed version for distribution in either France or Francophone Canada is known to exist, nor were any local adaptations based on the YCDTOTV format known to have been made.\n\nYCDTOTV was also broadcast in several other countries such as the United Kingdom (on the former satellite and cable television for children The Children's Channel), New Zealand (on TV3), Germany (on Armed Forces Network with the original English audio), Saudi Arabia (on the country's former English-language channel Saudi 2) and the Philippines (on RPN-9).\n\nParody [ edit ]\n\nYCDTOTV has been occasionally referenced on Robot Chicken, including some of the show's trademark gags, such as locker jokes, Barth's Burgery, and green slime.\n\nIn the Family Guy episode \"Fast Times at Buddy Cianci Jr. High\", Peter Griffin is slimed after saying \"I don't know,\" followed immediately by a still shot that is a direct reference to YCDTOTV's opening sequence, with the words \"You Can't Do That on Television\" written in red over a man's face. A later episode of the series was titled \"You Can't Do That on Television, Peter\", but contained no overt references to YCDTOTV.\n\nIn the NewsRadio episode The Song Remains The Same, Mr. James decides to celebrate April Fool's Day (in February!) by having Joe install the \"trigger machines\" from YCDTOTV, and then spends the episode tricking the cast into getting slimed and watered at increasingly inopportune times, ruining Cathy's Versace blouse when she gets slimed before going on air, destroying Matthew's computer when he is watered, and angering both Bill and Lisa when they're hit with water and slime at the end of the episode.\n\nThe 1984 episode of VH1's I Love the '80s features a segment on Nickelodeon that includes locker jokes, and features Alyson Hannigan, Hal Sparks, Soleil Moon Frye, and \"Weird Al\" Yankovic all getting slimed after being tricked into saying \"I don't know\".\n\nYCDTOTV is also loosely parodied in the 2010 How I Met Your Mother episode Glitter, with Robin's child star career on the Canadian television show \"Space Teens\" making several references to the show. In reality, Canadian actress (and HIMYM cast member) Cobie Smulders grew up a fan of the show.[7]\n\nReunion [ edit ]\n\nIn July 2004, on what was the program's 25th anniversary, a reunion special called Project 131 which was named Changes and was produced at CJOH-TV starring five members of the original cast. These included Brodie Osome, Marjorie Silcoff, and Vanessa Lindores (visibly pregnant at the time), Justin Cammy and Alasdair Gillis. It was directed by David Dillehunt.\n\nProposed Reboot [ edit ]\n\nIn August 2017, it was announced that You Can't Do That on Television would be getting a reboot. Original creator Roger Price would be serving as executive producer, while Jimmy Fox of Main Event Media would be developing the project.[8] However, Fox stated on his Twitter account on September 14, 2019 that the revival had been called off.[9]\n\nTrademarks [ edit ]\n\nEpisodes of YCDTOTV included recurring gimmicks and gags. The following is a partial list.\n\nPre-empted shows [ edit ]\n\nAfter the 1981 season, each show began with a title card featuring a parody TV-show title with a silly (often macabre) picture and the announcer (Les Lye) making the following announcement: \"(Phony TV show) will not be seen today/at this time in order for us to bring you (witty remark).\" The pre-empted shows were parodies of current TV shows (e.g. The A-Team Makes One Cup of Coffee Last Five Hours, \"Hanging Out\" or \"Malls\", 1984), movies (e.g. Top Gun Gets Put on Latrine-Cleaning Duty, \"Discipline\", 1986), or other pop culture icons (e.g. Boy George Without Make-up, \"Halloween\", 1984), and were often relevant to the theme of the current episode (e.g. the pre-empted show for \"Safety\" (1981) was Hit and Run on Sesame Street). The pre-empted show announcement concept was borrowed from Saturday Night Live, which introduced their shows with similar announcements in the late 1970s. YCDTOTV had also preempted itself on three occasions (Television, Media, and Priorities). \"The Generation Gap\" episode did not begin with a preempted episode; instead, a disclaimer read \"The following program contains certain scenes which may not be suitable for mature audiences. Juvenile discretion is advised\". There was no pre-emption for the \"Success and Failure\" episode (1989) because the producers failed to come up with a gag show to pre-empt.\n\nOpening animation: The Children's Television Sausage Factory [ edit ]\n\nOriginally created by Rand MacIvor (under Art Director John C. Galt), who was inspired by Terry Gilliam's \"gilliamations\", the opening animation sequence was a sequence of surreal images set to Rossini's \"William Tell Overture\", performed in a Dixieland jazz arrangement by The National Press Club and Allied Workers Jazz Band. Though the arrangement of the theme music stayed the same throughout the entire series run (although there are subtle differences between the themes in various seasons – especially the closing themes – and Whatever Turns You On used a completely different theme song), the opening animation itself changed in different ways.\n\nThe Centre Block of the Canadian Parliament complex was used in the first season and in the original hour-long versions of the 1981 season episodes. In this animation sequence, a person pulls the roof off one side of the building, releasing three balloons bearing the likenesses of the three party leaders at the time: Pierre Trudeau (Liberal), Joe Clark (Progressive Conservative), and Ed Broadbent (NDP). Then, a hand from off-screen ignites the bottom of the Peace Tower with a match and it takes off like a rocket. The start of the animation features a likeness of 1979 cast member David Helpin.\n\nThere are two versions of the \"Children's Television Sausage Factory\" animation. In this sequence, children are \"processed\" in the \"sausage factory\" and deposited onto a school bus at the bottom of the factory that transports them to the TV studio (a likeness of the CJOH studios on Merivale Road in Nepean, Ontario). The first version was created for the half-hour, internationally syndicated versions of the 1981 episodes. The second version, which featured larger images and cleaner (albeit less fluid) scene animation than the first version, was introduced in the beginning 1982 season and used for both the U.S. and Canadian broadcasts of You Can't Do That on Television until the end of the show in 1990.\n\nuntil the end of the show in 1990. Both versions of the \"Children's Television Sausage Factory\" animation feature likenesses of Jonothan Gebert, Kevin Somers, Marc Baillon and Christine McGlade exiting the school bus, as well as a likeness of Les Lye as the security guard at the door of the TV studio. This footage was re-used from the opening sequence of 1979's short-lived Whatever Turns You On .\n\n. The ending of the introduction saw Lye's face in a sketch with his mouth opening up, leading to a stamp put on his face reading You Can't Do That on Television, followed by the screen cracking and finally splitting in 2 pieces which the cast are seen and the show begins. (Lye's facial expression is somewhat different between the pre-1982 and post-1982 openings in that the former his mouth stays open while the latter his mouth is closed. Also in the pre-1982 opening, the cut to the show starting is a more television-ish cut.)\n\nOpposites [ edit ]\n\nEach episode had an \"opposites\" segment, introduced by a visual effect of the screen flipping upside down, shifting left to fade to the next sketch, and then righting itself. Typically, right before this happened, one or more cast members would be interrupted by another cast member saying the opposite of what the monologue (or dialogue) was about, at which the cast would say, \"It must be the introduction to the opposites\", and then the inversion fade would happen. The sketches that followed were a tongue-in-cheek reversal of the show's subject and of daily life, often featuring children having authority over adults or adults encouraging children to behave badly (for example, eating sweets instead of vegetables, or wasting money on something frivolous rather than putting the money in the bank).\n\nSometimes opposite sketches involved cast members not being hit with slime or water after saying the \"trigger phrase\" (see below section), as in Rekha's case in City Life (1987) or Chris' in Excess (1989). Often cast were punished with slime if they said \"I know,\" rather than \"I don't know\" during an opposite sketch, such as what happened to Lisa in Heroes (1982), or Vanessa in Smells (1986). Lastly, occasionally a cast member would get dumped on later in the show for saying the \"magic words\" earlier during the opposites, such as when Christian is slimed in Excess (1989), and Jennifer teases that \"the slime never forgets\", only to end covered in slime herself moments later.\n\nOther prominent Opposite Sketch features were reversals of the roles and gags related to the show's re-occurring characters (usually played by Les Lye or Abby Hagyard, such as the cast getting to execute El Captaino at the Firing Squad, or torturing Nasti the dungeon keeper in the dungeon. Inverse tropes related to Mr. Schitdler in the Classroom, and the Principal in Detention were also frequent, however very rarely would an opposite feature the kids getting their revenge on Barth.\n\nA return to the show's daily subject was indicated by another inversion fade, sometimes accompanied by one of the cast members saying, \"Back to reality.\" These would occasionally occur in the middle of a sketch, resulting in the characters inverting whatever they were doing prior to the conclusion of the sketch.\n\nOpposite sketches were used in the inaugural season of the show on CJOH in 1979 (the first one, used in Episode Two, was submitted by a viewer), but it was not until Whatever Turns You On that they became an integral part of the show.\n\nFiring squad [ edit ]\n\nMost episodes starting in 1981 included one or more firing squad sketches, where Les Lye played \"El Capitano\", a Latin American military officer with a sword in hand preparing to order a firing squad (whom he addressed as \"the amigos\") to execute one of the children actors, who was tied up standing in front of a firing post. The punchline of this sketch was usually the kid tricking El Capitano into walking in front of the post and then saying the word \"fire\", thus getting him shot by the firing squad himself.\n\nEvery Firing Squad scene was centered around the same basic format, beginning just before the execution was to take place, with;\n\nEl Capitano: \"Ready..., Aim...\"\n\nCast Member: \"...Wait a minute, stop the execution!\"\n\nEl Capitano: \"(Groans) What is it this time?\"\n\nThe cast member would then make some attempt to stall or stop the execution. Most of the time, the cast member would be successful. Occasionally, however, Lye's character would \"successfully\" complete the scene. On these occasions, the scene would end with \"Ready..., Aim...\" and then as the cast member flinched, the show would cut to the next scene, thus not actually showing when the squad would have fired. The only cast members who were actually shown being shot were Kevin Sommers, Lisa Ruddy and Alisdaire Gillis. There is also one episode in which during the opposites, the cast member cries out: \"Hurry up, hurry up, start the execution!\" This, of course, draws the executioner's attention, and soon he is shot as they commence fire.\n\nStage Pollution was very rarely seen at the Firing Squad, most likely due to the cast members inability to wipe the mess from their face (and continue the scene) due to their hands being tied. That said, there were a few slimings at the post, including Kevin in Growing Up (1982), Alasdair in Fears (1985), and Vanessa in the CTV version of the Adoption (1987) episode. Lisa was also \"executed\" with custard pies in both the US and Canadian versions of that episode.\n\nBarth's Burgers [ edit ]\n\nStarting with the 1981 season, most episodes featured sketches with the kids eating at Barth's Burgery, a fast-food burger restaurant run by Barth (played by Les Lye), a chain-smoking, unpleasant, disgusting cook who used unsanitary and questionable methods of creating burgers. Most of the sketches began with Barth giving the kids their orders, the kids hesitant on eating their food, Barth telling them what he used as burger meat (most of the time he said unpleasant things like rodents, poison, various animals not fit for human consumption, used kitty litter, human body parts, etc.) and the kids growing queasy and eventually throwing up.\n\nMost of the sketches featured the following dialogue somewhere in the scene:\n\nCast Member: \"Who/What do you think is in the burgers?\"\n\nBarth: \"Duh IIIIIIII heard that!\"\n\nSome sketches featured Barth worried about the health inspector shutting down his restaurant and telling the kids how he was going to solve the problem. On rare occasions, the kids actually enjoyed their meal and be satisfied, only to find out Barth mistakenly gave them the wrong order, prompting Barth to demand the kids return their food. (\"I would never give my customers real meat!\").\n\nOccasionally scenes at Barth's would feature \"stage pollution\", often with Barth himself dumping something nasty on a cast member, such as vomit on Vanessa in Moving (1984), mustard on Adam in World Records (1985), or \"secret sauce\" (which was really just yellow slime) on Carlos and Stephanie in Secrets (1990). No one was ever watered at Barth's, and one cast member, Stephanie Chow in World Records (1985), was green slimed there, since it was a \"logistical nightmare\" for the production.\n\nIn the 1981 and 1982 seasons, Barth had a worker, Zilch (played by Darryll Lucas), whom he frequently insulted and abused, often by hitting him with a pan and knocking him out cold. In the 1982 \"Bullies\" episode, a young Alasdair Gillis tried to show Zilch how to defend himself by clobbering him over the head with the pan, resulting in Alasdair and Barth taking turns assaulting Zilch until Zilch fell to the floor unconscious.\n\nLocker jokes [ edit ]\n\nDuring the \"locker jokes\" segment of each episodes, cast members, standing inside school lockers with the words \"You Can't Do That on Television\" painted on them, told jokes to each other. The person telling the joke opened their locker, sticking their head out and calling another cast member to tell the joke to. For the duration of the joke, those cast members would be the only ones seen with open lockers. When the punchline was delivered, there would be a laugh track and the actors would close their lockers, allowing the process to start again with different people and a different joke. This was almost certainly an homage to the well-known \"joke wall\" segment on Rowan and Martin's Laugh-In. This feature of the show was also introduced during its first season in 1979 and continued until the end of the series in 1990, with the lockers themselves undergoing a few minor physical makeovers during the show's early years, but for the most part, remaining the same for the entire run of the show. In 2004, when fans and cast reunited for the show's 25th anniversary, the original lockers were auctioned off.\n\nProduction bumper [ edit ]\n\nUsed in a few episodes in the first two seasons and almost every episode in later seasons, the closing credits of You Can't Do That on Television are followed by an announcement of the \"company\" that produced the program, with the name generally tying in with the episode's main subject. These announcements are given in the form of \"'You Can't Do That on Television' is a ______ production.\" For example, the 1982 \"Bullying\" episode was a \"Black Eye\" Production; the 1984 \"Marketing\" show was a \"Can't Give It Away\" Production; the \"Divorce\" episode was a \"Split Down The Middle\" Production;\"Project 131\" was a \"Changing Day\" Production; The \"Malls\" episode was a \"Hang Out to Dry\" production. The announcement of the production company was done by a fictitious announcer in a radio booth (played by Les Lye), who would usually make an off-color joke about the show or its producers afterwards, only to realize that the cameras were still rolling, and he would now have to deal with what he had just said under the auspice of it being a private comment.\n\nPost-credit scene [ edit ]\n\nThe post-credit production bumper was generally followed by one final sketch, also borrowing a concept from Laugh-In, in which the jokes continued for a time after the credits finished rolling. The post-credit button frequently took place \"backstage\" and would break the 4th wall and be about the episode that just finished, usually featuring one final humiliation or comeuppance for that episodes' main cast member. Often this meant Christine getting slimed once more, however, in The Not So Fair Show (1982), this was turned on its head, and she actually gets to slime the rest of the cast during the button. Often these post-credit scenes were cut short (or sometimes lopped off altogether), especially in the United States, since Nickelodeon frequently shifted where the show fell in its broadcast schedule, as well as often aired re-runs of YCDTOTV as \"filler\" during their daytime TV block.\n\nOther [ edit ]\n\nOther signature re-occurring bits on the show include:\n\nFake Commercials: Parodies of television commercials were part of the series as early as the first season and were the subject of one full episode in 1986, but the 1982 episodes contained commercial parodies which aired in between the commercial bumpers, where real commercials would ordinarily fit. The products featured ranged from parodies of actual products (i.e. the Lotachi Lugman, a parody of the Sony Walkman) to completely fictional products (such as a fragrance called \"Creme de peanut\", advertised by Abby Hagyard in a blonde wig and slinky black dress). These fake commercials were cut from the shows once Nickelodeon became advertiser-supported in 1983, although the \"Creme de peanut\" and \"Hero Cereal\" spots were preserved for later Worst of YCDTOTV compilations.\n\ncompilations. Blip's Arcade: Blip, owner of the local video arcade, would find ever more inventive and devious ways to cheat his customers out of money, such as rigging unwinnable video games or running \"specials\" in which he would exchange only three quarters for a dollar.\n\nNasti's Dungeon: A kid shackled in a dungeon for unknown reasons would be approached by prison warden Nasti, who would make a statement that briefly allowed the prisoner to believe that they were being set free (usually with a longing cry of \"Blue skies! Barthy Burgers! Girls!\") only to learn that their imprisonment was about to get worse. Very rarely could a prisoner convince Nasti to free him, or even trick Nasti into exchanging places.\n\nBenedict Arnold School: Strict Mr. Schidtler wages an eternal war with his unruly, ill-prepared students. The school skits were split roughly evenly between Mr. Schidtler prevailing (by embarrassing students in front of the class, catching them in lies, or sending them to detention) and the students tricking their teacher into looking foolish or dismissing class early. Mr. Schidtler frequently ended each of these scenes with \"Where do they find them, and why do they keep sending them to me?\" (except one instance, where he stated he'd \"start sending them back\").\n\nVarious interiors of the Prevert home, including the front steps as Mom prepared to send the kids off to school.\n\nA bunkbed at summer camp where the kids discussed how uncomfortable and sadistic the camp activities are.\n\nA doctor's office, dentist office, and principal's office, which all were similarly evil or mischievous.\n\nWater, Slime and Pies [ edit ]\n\nAffectionately referred to as \"stage pollution\" by the cast and crew, certain key words resulted in cast members having unpleasant substances poured onto them from above, or thrown at them from off-camera.\n\nWater [ edit ]\n\nWhen someone said the word \"water\", \"wash\" or \"wet\", a large amount of ice cold water mysteriously cascaded onto them from above. This was also an homage to Laugh-In, which featured their similar \"Sock It To Me\" sketches. In the earlier years of the show, cast members (especially Christine) were frequently caught with pails of water physically thrown on them, but starting in 1981, this began to change to the much more mysterious motif of water falling down on the victim from above. By the 1984 season, only the word \"water\" led to a dousing or \"watering\"; where-as in earlier seasons, the words \"wet\" and \"H2O\" also did. On occasion, cast members tried to \"dodge\" getting hit with water by saying \"agua\" (Spanish) or \"eau\" (French) instead, only to still be soaked anyway. (The latter was Christine actually saying \"Oh, no you don't.\" but \"oh\" sounded too much like \"eau\".) One episode also had Christine McGlade and Kevin Kubusheskie drenched for saying \"What're,\" the reason being that their speaking in \"slang\" sounded too similar to \"Water.\"\n\nIconically, there were two circumstances where one person said \"water\", but another person on screen got soaked. Both times, it was Christine McGlade who took the unfair waterings, and then got soaked again when she protested that she wasn't the one who said \"water\" (thus now saying it). The first of these was with Kevin Kubusheskie when he was wearing a suit of armor, and Ross explained that if he got hit, the suit would rust and since the studio had rented it, they would be liable for it, which they just could not afford. The other time was when Ross's nephew, Jeff Mosseau, was being protected from both water and slime due to Ross' fear that his mother would kill him. (Although Christine had to take his initial watering, he did eventually get slimed at the end of the show, much to Ross's horror.)\n\nWhile the show's green slime changed ingredients, and even consistencies frequently, the water was almost always the same. There were a few instances where cast members were dumped on with variations; such as soapy water (Christine), hot water (Christine, twice), brown toilet water (Matthew, Stephanie, Jill), and yellow polluted water (Carlos, Chris, Rekha, Andrea). The show also occasionally used water as a gag without the trigger phrase being said, such as when Adam turns the hose on his mom in Communications (1989).\n\nSlime [ edit ]\n\nLikewise, when someone said \"I don't know\", green slime, a gross gooey substance, poured all over them from above. This prank was known as being \"slimed\", and inventing it is one of the show's most notable elements. As with waterings, the sliming gag was used in almost every episode, especially from 1982 onward (a number of 1979 and 1981 episodes featured no slime at all, and slime is known to have been used on only one episode of Whatever Turns You On).\n\nGreen slime was a fixture of the series from the very beginning. In a Detention/Dungeon scene in the show's first episode, Tim Douglas is told to not pulling on his chains by the principal. After he leaves, Tim does just that. A \"toilet flushing\" sound is heard, and the first YCDTOTV sliming occurs.\n\nAccording to Geoffrey Darby in the book Slimed! An Oral History of Nickelodeon's Golden Age, the original slime developed \"by accident\": Darby had originally planned for a bucket of food leftovers from the CJOH cafeteria, with water added, to be dumped on Tim, but the production of that first episode was delayed by a week, and when the time came to shoot the scene, the contents of the bucket had turned green with mold. Due to time constraints, Darby authorized the noxious, moldy mixture to be dumped on Tim anyway. Roger Price was furious when he found out, but the response from the viewing audience was positive, and so Darby and Price decided to write an entire show around the slime,[10] the result of which was \"The Green Slime Show\" of March 17, 1979 (fittingly, St. Patrick' Day), in which Lisa Ruddy was the victim of six slimings (a YCDTOTV record). With that episode, the use of \"I don't know\" as the slime's trigger phrase was introduced, and it quickly became the show's trademark gag.\n\nMost of the cast did not like getting slimed (Christine McGlade said it was \"gross and challenging\"[11]), and on occasion, they tried to circumvent the dreaded three words. This usually backfired, like in the \"Computers\" episode, when Christine McGlade said \"Insufficient Data\" instead of \"I don't know\" and got green slime dumped on her anyway. Lisa Ruddy then told her the slime was computer controlled. Some variations of the magic words also triggered the slime, such as in the \"Blame\" episode when the entire cast got slimed together, after one of them said, \"We don't know\". Occasionally cast members were slimed without saying \"I don't know\", such as when the audience voted for Vanessa Lindores to be slimed in the \"Technology\" episode, or when the entire cast was slimed by \"the unfairy godmother\" in the \"Not So Fair\" episode. Although the slime was usually green, other colors, such as red, blue, yellow, and even black and white, were occasionally used. 1981's \"Safety First\" episode, which featured white slime as part of a recurring joke in about \"wearing white at night,\" was the first episode known to have used a slime color other than green. The most dramatic example of this, however, was in the 1982 episode \"Television,\" in which Christine is slimed in green, red, blue, yellow and \"stripes\" (green, red, blue, and yellow at once), while trying to explain about green slime to then-newcomer Vanessa Lindores. This sketch was later seen in the opening to the 1987 thriller film Fatal Attraction. In one of the show's crueler pranks, Ross (Les Lye) promises Christine that there won't be any green slime, only to trick her into saying the magic words and getting dumped on with a thicker, chunkier, blue slime. In another memorable moment, the 1986 \"Enemies and Paranoia\" episode used the word \"Free\" as a trigger phrase for red slime after the studio was taken over by Russian Communists. Other infamous non-green slimings include; Vanessa getting orange slimed in the \"Myths\" episode, Lisa having brown slime dumped on her in the \"Cosmetics\" episode, and Chris being black slimed in the \"Time\" episode.\n\nOn the show, the recipe for the green slime was treated as a closely guarded secret, with attempts by the kids to find out the true recipe all being unsuccessful. In one episode, Ross (Les Lye) even went so far as to decoy the kids with a fake recipe), although some episodes posited revolting theories as to what the slime was really made of – one 1989 episode which dealt with smoking, for example, theorized that slime was mucus from smokers' lungs, and others frequently inferred that it was sewage. While the original recipe consisted of rotten food, after continued complaints from the cast, the recipe for green slime was changed to a more innocuous mixture of lime green gelatin powder, oatmeal, and water.[12] Eventually baby shampoo was added to the recipe so that it would wash out of the actors' hair more easily after several of the female cast members complained. In the aforementioned 1982 episode \"Television,\" Christine revealed the ingredients to the green slime, confirming all of the previously stated items. In later years however, the recipe consisted of simply adding green food coloring to a bucket of cottage cheese, which had the side effect of spoiling if left too long under hot studio lights (Vanessa complained of its smell almost making her sick after her sliming in the 1987 'Worst Of You Can't Do That On Television').[13]\n\nEspecially in the later years of the show, cast members who were slimed frequently looked upward into the slime as it was falling so that it covered their faces (the same was also true of the waterings). To avoid damage to the set from water or slime, a clear tarpaulin was placed over the main portion of the set for scenes in which an actor was to be hit with either. The tarpaulin can occasionally be seen and/or heard underneath the actors in these scenes, and in fact the loud splatter sound usually heard during a watering or sliming is due to this tarpaulin. Actors who were scripted to be slimed or have water soaked on them usually appeared barefoot in the scene, and several cast members who were slimed were reportedly paid extra. Scenes involving slimings were the final ones taped during a recording, allowing the actors to immediately rinse off after the scene was over.\n\nGreen Slime grew to become a trademark image for Nickelodeon, which began demanding more slimings on the show as the years went on, resulting in episodes such as 1985's \"Movies,\" in which the entire cast (save for Abby Hagyard) is slimed. They later introduced Green Slime Shampoo (marketed with the slogan \"Gets you clean, won't turn you green!\"), which was a frequent parting gift for contestants on Nick's popular game show Double Dare, where slime was heavily used along with several variations such as 'gak' or 'gooze', and Mattel even sold Nickelodeon slime and the Gak brand in the 1990s. Slime was also frequently used in the network's advertisements, many of which featured cast members from the show (usually Christine McGlade) as victims of an impromptu sliming. Nickelodeon's former studios in Orlando had a green slime geyser and green slime is still dumped on the host of the annual Kids Choice Awards at the end of the ceremony, and on at least one celebrity during the ceremony. It is also still used in ads showing the network's current stars getting slimed from all sides in slow motion, and is used to slime the winner at the end of the Nickelodeon game show BrainSurge, which debuted in 2009 (slime, as well as pies, was also used as a prize, rather than a penalty, in Nickelodeon's live daily game show Slime Time Live in the early 2000s). Saying \"I don't know\" to get slimed was later used on Nickelodeon's show Fanboy & Chum Chum as the main plot of the episode \"Slime Day.\"\n\nOriginal cast member Ruth Buzzi\n\nPies [ edit ]\n\nThe original slapstick pie-in-the-face gag was also frequently used on YCDTOTV, although pie scenes were most common during the early years of the show. One whole episode, 1981's Drugs, was constructed completely around the pie-in-the-face gag: to avoid the wrath of the censors, the episode showed the cast getting \"high\" by pieing themselves continuously over and over, comparing the stupidity of hitting oneself with a pie to the stupidity of taking drugs. Unlike the slime and water, pies were not usually triggered by any certain word or trigger phrase, although in the earlier years, saying \"Let Me Have It\" or \"Give It To Me\" would frequently result in a pieing.\n\nCast [ edit ]\n\nApart from the central cast as Les Lye and Abby Hagyard who played the adult character roles, over 100 pre-teen and teenaged actors appeared on YCDTOTV between 1979 and 1990. Some of the most notable cast members included:\n\nName Year(s) First Appearance Last Appearance Notes Stephanie Bauder 1989–90 Episode 114: Choices Episode 142: Privileges Went on to star in Night of the Demons 3, alongside fellow castmate Christian Tessier.[14] Nick Belcourt 1989 Episode 114: Choices Episode 134: Effort Known for a recurring gag of being unable to remember whether his name was Nick or Ted, stemming from a real-life incident during a read-through in which he read Ted Wilson's lines by mistake. Chris Bickford 1989–90 Episode 114: Choices Episode 143: Inventions Fourth and final host. Known for his trademark leather jacket. Jennifer Brackenbury 1989–90 Episode 114: Choices Episode 143: Inventions Referred to by some fans as \"The New Vanessa.\" Jen co-hosted the Worst of YCDTOTV videocassette along with Chris Bickford and Christian Tessier. Carlos Braithwaite 1989–90 Episode 114: Choices Episode 141: Learning The only African-American cast member during the show's 1990 season. Andrea Byrne 1987–89 Episode 111: Adoption Episode 122: Pollution Famous for her \"Little Orphan Andrea\" persona in the Adoption episode. Ruth Buzzi 1979 Episode 001: Live! Episode 014: End Of The Line Played many of the adult female characters, and was only slimed twice. Justin Cammy 1983–86 Episode 049: Classical Music Episode 084: Revenge Did not appear in any 1986 episodes although he is in the official cast photo. Appeared in his first episode clad in a diaper playing a sitar, as Roger Price's revenge for having to deal with Justin's difficult mother. Stephanie Chow 1984–87 Episode 074: Families Episode 112: Anniversaries Offered the chance to return for the 1989 season, but declined. Angie Coddett 1981–84 Episode 017: Dating Episode 060: Foreign Countries Known for her character \"Angie the Talking Doll\" during the 1981 season. She appeared in only one episode each in 1982 and '84. Eugene Contreras 1982–85 Episode 029: Popularity Episode 088: Movies He and his brother Roddy were chosen after Roger Price, who had been looking for Hispanic kids for the show, overheard them speaking Spanish, although they had arrived at the studio too late to audition. Roddy Contreras 1982 Episode 035: Television Episode 035: Television Roddy's appearances in his only episode were edited out of the Nickelodeon airings of the show post-1983, once the network became advertiser-supported. Tim Douglas 1979 Episode 001 Episode 010 Tim was the first cast member to be slimed, and one of only two cast members to have the \"real\" green slime dumped on him made from moldy food leftovers. Ian Fingler 1979 Episode 009 Episode 009 Only appeared in one episode. Jonothan Gebert 1979–81 Episode 001 Episode 023: Crime and Vandalism Jono was also a cast member on Whatever Turns You On and Something Else. By the 1981 season he was too tall to appear on the link set and was seen mainly in execution and dungeon skits. Alasdair Gillis 1982–86 Episode 031: Vacations Episode 108: Mysteries and Crimes Second official host. Cameo in 1989's Fantasies and Age episodes. Amyas Godfrey 1986–89 Episode 089: Fairy Tales, Myths, & Legends Episode 139: Embarrassment Along with Andrea Byrne, Rekha Shah and James Tung, Amyas was one of only three kid cast members to transition from 1986–87 to 1989, and the only one to appear regularly in '89. Matthew Godfrey 1986–87 Episode 091: Know-It-Alls Episode 112: Anniversaries Older brother of Amyas Godfrey. He and his brother had just moved back to Ottawa after four years living in Dallas when they were cast; their time in Texas was occasionally used as an in-joke on the show. Abby Hagyard 1982–90 Episode 027: Cosmetics Episode 143: Inventions Adult cast member. Her most frequent roles were Mom (Valerie Prevert) and the British-accented Librarian, but she played most adult female roles during her time on the show. She was not slimed until the 1989 season. David Helpin 1979 Episode 001: Live Episode 014: End Of The Line David was one of the original cast members, and hosted many of the \"call in\" segments. He was slimed, along with the rest of the cast, in the St. Patrick's Day episode. Brad Hampson 1979 Episode 002: CJOH Shoestring Episode 010: Bored Brad was one of the only cast members of the inaugural season to not get slimed. Rodney Helal 1979–81 Episode 001: Live Episode 026: Peer Pressure Rodney was one of a few cast members to be featured on both YCDTOTV, as well as its sister show, Whatever Turns You On. Although he was never slimed, Rodney was frequently on the receiving end of pies. Ramona Helal 1979 Episode 003: Nickel and Dime Episode 003: Nickel and Dime Ramona was the older sister of Rodney Helal, and was only in one episode. She was however featured in several episodes of Whatever Turns You On. Michael Hora 1983–84 Episode 044: Future World Episode 051: Fame Never Slimed. Jim Johnson 1979 Episode 001: Live! Episode 014: End of the Line Only on the show for first season Adam Kalbfleisch 1984–86 Episode 062: Moving Episode 095: Country Watered twice during his run on the show, but never slimed. Cyndi Kennedy 1979 Episode 001: Live! Episode 014: End Of The Line Cyndi hosted several of the 1979 episodes, and famously went home sick after being slimed for the first time. Martin Kerr 1981–83 Episode 025: Nutrition Episode 040: Pets Kerr joined the cast after Roger Price saw him in one of the local \"Roving Camera\" segments when the show aired on CJOH and decided he liked him. He also participated in Something Else. Pauline Kerr 1984 Episode 060: Foreign Countries Episode 078: Wealth Martin Kerr's younger sister. Tanya King 1981 Episode 018: Fitness Episode 018: Fitness Tanya only appeared in one episode, and is one of the few cast to avoid being pied, slimed, or watered. Kevin Kubusheskie 1981–84 Episode 016: Strike Now Episode 068: Halloween Kubusheskie became a writer and producer on the series during the 1989 and 1990 seasons, and on occasion made cameos. Vanessa Lindores 1982–87 Episode 035: Television Episode 112: Anniversaries Lindores was the show's third host, and returned to host 1989's Age episode. She also appeared (then pregnant) in 2004's reunion \"Project 131\". The only other cast member to have the \"real\" green slime dumped on her made from rotten food leftovers.[15] Tony Lefebvre 1982 Episode 036: Sports Episode 036: Sports Tony was one of only three cast members that never appeared on the link set, but was watered at Barth's. Simone Lumsden 1982 Episode 036: Sports Episode 036: Sports Simone also never appeared on the link set. She was properly \"initiated\" into the cast, getting slimed in the dungeon. Les Lye 1979–90 Episode 001 Episode 143: Inventions One of only two adult cast members, and the only one to appear in the show from its very first to its very last episode. Also starred in Whatever Turns You On. Mike Lyon 1981 Episode 018: Fitness Episode 024: Drugs Appeared in only two episodes. Christine \"Moose\" McGlade 1979–86 Episode 001 Episode 093: Garbage Christine was the first official host. She featured also in many skits and also had a brief cameo in the \"Age\" episode in 1989. Her younger sister Lisa was used in some skits as an uncredited extra. She also appeared on Whatever Turns You On and Something Else, and went on to develop the short-lived Turkey Television with Roger Price. Patrick Mills 1989–90 Episode 121: Security Episode 143: Privileges Mills became a film director and screenwriter, post YCDTOTV. Forest Wolf Mohawk 1982 Episode 039: The Not-So-Fair-Show Episode 039: The Not-So-Fair-Show The only Native American cast member. Only appeared in one episode. Alanis Morissette 1986 Episode 090: Pop Music Episode 100: Contests Appeared in a total of five episodes. Was slimed three times, but only one of her slime scenes aired (Pop Music).[16] Brodie Osome 1981–83 Episode 015: Transportation Episode 049: Classical Music Osome appeared in Project 131 with Vanessa Lindores and Marjorie Silcoff. Doug Ptolemy 1982–87 Episode 030: Fads and Fashion Episode 112: Anniversaries Ptolemy made a cameo appearance in the 1989 Age episode, after leaving and also had a battle with drug addiction after the show ended. Natalie Radmore 1982 Episode 039: The Not-So-Fair-Show Episode 039: The Not-So-Fair-Show Natalie was slimed, watered, and pied in her only appearance. Adam Reid 1984–87 Episode 078: Wealth Episode 112: Anniversaries Reid made a cameo in the 1989 Punishment episode. He also co-wrote several episodes that season with Roger Price. Elizabeth Richardson[17] 1982 Episode 28: Cosmetics Episode 48: Inequality: Kids vs. Adults Elizabeth is one of the very few cast members never to be watered, pied or slimed during her time on the show. Lisa Ruddy 1979–85 Episode 001 Episode 088: Movies Ruddy was a cast member on Whatever Turns You On as well. At the end of her tenure on the show, she, Christine McGlade and Les Lye were the only remaining original cast members. Ruddy was sometimes called \"Motormouth\" Lisa Ruddy, because of her tendency to talk a lot. She took the longest sliming of the show during the \"Cooking\" episode, having two extra large buckets dumped on her during the sliming at the dinner table.[18] Scott Sandeman 1981 Episode 019: Safety First Episode 025: Nutrition Scott appeared in only two episodes and is one of only a few cast members to be featured in multiple episodes without getting slimed, pied, or watered. Sidharth Sahay 1989 Episode 116: Communication Episode 135: Sports Brother of Vik Sahay. Vik Sahay 1986–87 Episode 105: Sleep Episode 112: Anniversaries Canadian actor of Indian descent, whose brother Sidharth Sahay, also appeared on show. Kevin Schenk 1979–81 Episode 008 Episode 026: Peer Pressure Schenk was also a cast member on Whatever Turns You On. Klea Scott 1982–84 Episode 031: Vacations Episode 054: ESP – Magic Astrology Scott was born in Panama. After You Can't, she played significant roles in the movies Minority Report and Collateral, as well as a leading role in the television series Intelligence. She also was featured in other Roger Price productions, such as UFO Kidnapped. Rekha Shah 1986–89 Episode 094: Garbage Episode 122: Pollution Shah went on to star in another successful Nickelodeon show Fifteen. Was only green slimed once because she hated it so much. Sariya Sharp 1989–90 Episode 122: Fantasy Episode 143: Inventions Sariya's trademark became complaining about her \"totally Neanderthal mother\" who never let her have her ears pierced, and her nice hair frequently getting ruined by green slime. Marjorie Silcoff 1984–85 Episode 056: History Episode 084: Revenge Silcoff was watered in three episodes plus Project 131, but never slimed. She returned for Project 131 along with Vanessa Lindores and Brodie Osome. Kevin Somers 1979–81 Episode 001: Live! Episode 019: Safety First Somers was also a cast member on Whatever Turns You On. Like Gebert, he appeared chiefly in execution and dungeon skits by 1981 due to his height and age, although he did also participate in Something Else. Amy Stanley 1989–90 Episode 133: Celebrations Episode 141: Learning Amy, the younger sister of Jill Stanley, was the only cast member not yet born when the series premiered in February 1979. Jill Stanley 1989–90 Episode 115: Chores Episode 141: Learning Jill had previously starred in the movie Tommy Tricker and the Stamp Traveller as \"Nancy.\" She had a problem with remembering her lines, which became a running gag on YCDTOTV. Was offered the hosting gig but turned it down. Christian Tessier 1989–90 Episode 116: Communication Episode 143: Inventions Tessier is an actor and singer, whose first appearance on television was this program. Sarah West 1979 Episode 007: The famous green slime show (St. Patrick's Day) Episode 009: Executive Washrooms Was the first female cast member to be slimed in the dungeon.[19] Teddy Wilson 1989–90 Episode 114: Choices Episode 143: Inventions Billed here as Ted Wilson, he later shared hosting duties on Never Ever Do This At Home and Innerspace. Bradfield Wiltse 1979 Episode 007: The famous green slime show (St. Patrick's Day) Episode 007: The famous green slime show (St. Patrick's Day) Only appeared in one episode.\n\nReferences [ edit ]\n\nFurther reading [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Teddy_Wilson_and_Les_Lye%2C_filming_You_Can%27t_Do_That_On_Television.png/170px-Teddy_Wilson_and_Les_Lye%2C_filming_You_Can%27t_Do_That_On_Television.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/TrooperLiveIn75.jpg/170px-TrooperLiveIn75.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/4/4a/A-youcan-maint.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/A-youcan-maint.jpg/250px-A-youcan-maint.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Abby_Hagyard.jpg/170px-Abby_Hagyard.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Ruth_Buzzi.jpg/170px-Ruth_Buzzi.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/16px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/4a/A-youcan-maint.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/You_Can%27t_Do_That_on_Television", "title": "You Can't Do That on Television", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/4a/A-youcan-maint.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}