{"url": "https://www.bbc.com/news/entertainment-arts-41580010", "text": "Image caption Angelina Jolie, Gwyneth Paltrow and Cara Delevingne have all spoken out\n\nSalma Hayek, Rose McGowan and Gwyneth Paltrow are among dozens of women who have come forward with allegations ranging from rape to sexual harassment by movie mogul Harvey Weinstein.\n\nHe is currently facing five charges relating to two women in New York.\n\nHe has previously admitted his behaviour has \"caused a lot of pain\" but has described many of the allegations against him as \"patently false\".\n\nHis spokesperson has said \"any allegations of non-consensual sex are unequivocally denied\" and there were \"never any acts of retaliation\" against women who turned him down.\n\nImage copyright Getty Images Image caption Clockwise from top left: Gwyneth Paltrow, Angelina Jolie, Cara Delevingne, Mira Sorvino, Rosanna Arquette and Lea Seydoux\n\nHere are some of those who have made allegations against him.\n\nRose McGowan\n\nImage copyright Getty Images\n\nThe actress has accused Weinstein of raping her by performing oral sex in a hotel at the Sundance Film Festival in 1997, when she was 23 and had just appeared in Scream.\n\nShe later reached a $100,000 settlement with him - and says he offered her $1m for a further non-disclosure deal to stay silent. She declined and has been one of his most vocal accusers.\n\nAnnabella Sciorra\n\nImage copyright Getty Images\n\nThe Emmy-nominated former Sopranos actress has alleged that Weinstein forced himself into her apartment in New York in 1992 and raped her.\n\n\"I was so ashamed of what happened,\" Sciorra told the New Yorker. \"And I fought. I fought. But still I was like, Why did I open that door?\"\n\nAshley Judd\n\nImage copyright Getty Images\n\nThe actress says Weinstein asked her to go to his hotel room under the guise of a business meeting, but appeared in a bathrobe and asked if he could give her a massage or if she could watch him shower.\n\nShe refused, and says he got revenge by seeking to damage her career. Director Peter Jackson has come forward to say he removed her from a casting list \"as a direct result\" of what he now thinks was \"false information\" provided by Weinstein.\n\nIn May 2018 Judd sued Weinstein claiming he damaged her career in retaliation for her rejecting his sexual advances but a Los Angeles court later dismissed her sexual harassment suit.\n\nHer defamation claim may still proceed, the judge said.\n\nMira Sorvino\n\nImage copyright Getty Images Image caption Mira Sorvino was photographed at a Weinstein Company party in January 2017\n\nThe Mighty Aphrodite star says he harassed her in a hotel room in 1995. \"He started massaging my shoulders, which made me very uncomfortable, and then tried to get more physical, sort of chasing me around,\" she said.\n\nLike with Ashley Judd, Peter Jackson said Weinstein warned him off casting her.\n\nSalma Hayek\n\nImage copyright AFP/Getty Image caption Hayek said Weinstein threatened to kill her\n\nThe Frida actress says she turned down repeated sexual advances from Weinstein while making the 2002 film Frida.\n\nAnd she says his persuasion tactics included threats. Hayek said Weinstein once told her: \"I will kill you, don't think I can't.\"\n\nAsia Argento\n\nImage copyright Getty Images\n\nThe Italian actress and director Asia Argento says she reluctantly agreed to give him a massage in a hotel room on the French Riviera, but he then raped her.\n\nWeinstein \"terrified me, and he was so big\", she said. \"It wouldn't stop. It was a nightmare.\"\n\nLucia Evans\n\nLucia Evans - nee Stoller - encountered Weinstein in 2004 in a New York club when she was an aspiring actress. She says she was forced to perform oral sex by the producer after going to his office for what she thought was a casting meeting.\n\n\"The type of control he exerted, it was very real,\" she told The New Yorker. \"Even just his presence was intimidating.\"\n\nPaz de la Huerta\n\nImage copyright Getty Images\n\nThe Boardwalk Empire star has accused Weinstein of raping her twice in New York in 2010.\n\nThe first time was after he offered her a ride home, and the second was when he turned up uninvited at her apartment. \"I did say no, and when he was on top of me I said, 'I don't want to do this',\" she said.\n\nGwyneth Paltrow\n\nImage copyright Getty Images Image caption Gwyneth Paltrow with Harvey Weinstein in 2002\n\nPaltrow says Weinstein asked her to give him a massage in his hotel suite after casting her in the leading role of 1996's Emma when she was 22.\n\nShe refused. \"He screamed at me for a long time. It was brutal,\" she said. She told then boyfriend Brad Pitt - who threatened to kill the producer if he did anything like that to Paltrow again.\n\nMimi Haleyi\n\nImage copyright AFP\n\nFormer production worker Mimi Haleyi alleges that she was raped by Weinstein when he forcibly performed oral sex on her in 2006 in his New York apartment.\n\n\"I told him 'no, no, no'. But he insisted,\" Ms Haleyi told a press conference in New York.\n\nDominique Huett\n\nImage copyright AFP\n\nThe actress also alleges she was raped by Weinstein when he performed oral sex on her without her consent. She says he lured her to a hotel room in 2010 under the guise of helping her procure future TV and film roles.\n\n\"I didn't know how to say no to someone like him at the time, which I regret,\" she said.\n\nNatassia Malthe\n\nImage copyright AFP\n\nThe Norwegian actress accuses Weinstein of raping her in a London hotel after the 2008 Bafta Awards ceremony.\n\nShe also alleges that he then asked her to engage in a threesome with him and another woman when back in Los Angeles following the Baftas.\n\nLysette Anthony\n\nImage copyright PA\n\nBritish actress Lysette Anthony says he carried out a \"pathetic, revolting\" attack at her London home in the late 1980s, which left her \"disgusted and embarrassed\".\n\nLysette Anthony told The Sunday Times she had reported an attack by Weinstein to the Metropolitan Police in London.\n\nCara Delevingne\n\nImage copyright Getty Images\n\nIn an Instagram post, Delevingne writes how uncomfortable she felt during an encounter with Weinstein in a hotel room and describes what allegedly happened when she told him she wanted to leave.\n\n\"He walked me to the door and stood in front of it and tried to kiss me on the lips. I stopped him and managed to get out of the room,\" she says.\n\nLea Seydoux\n\nImage copyright Getty Images\n\nThe French actress has written about how he invited her to come to his hotel room for a drink.\n\n\"We were talking on the sofa when he suddenly jumped on me and tried to kiss me,\" she wrote in The Guardian. \"I had to defend myself. He's big and fat, so I had to be forceful to resist him.\"\n\nAngelina Jolie\n\nImage copyright Getty Images Image caption Angelina Jolie with Gillian Anderson at the premiere of Playing by Heart in 1998\n\nJolie says she was propositioned by Weinstein in a hotel room in 1998.\n\n\"I had a bad experience with Harvey Weinstein in my youth, and as a result, chose never to work with him again and warn others when they did,\" she said.\n\nUma Thurman\n\nImage copyright Getty Images\n\nThe Pulp Fiction actress says Weinstein pushed her down and \"tried to expose himself\" at the producer's hotel room in London during the 1990s.\n\n\"He tried to shove himself on me... He did all kinds of unpleasant things,\" Thurman said. \"But he didn't actually put his back into it and force me. You're like an animal wriggling away, like a lizard.\"\n\nHeather Graham\n\nImage copyright REX/Shutterstock Image caption Harvey Weinstein and Heather Graham at a film party in 1999\n\nThe Boogie Nights actress told Variety she was once propositioned by Weinstein in the early 2000s when she met him to discuss being cast in one of his movies.\n\nShe alleges he implied she had to sleep with him to get a film role, telling her that his wife would have been fine with it.\n\nZoe Brock\n\nMedia playback is unsupported on your device Media caption Model Zoe Brock tells Radio 4's Today that she was one of Harvey Weinstein's victims\n\nThe model and actress says he asked for a massage in the south of France in 1997. She said: \"I didn't know what to do and I felt that letting him maybe touch me a little bit might placate him enough to get me out of there somehow.\"\n\nBefore long, she \"bolted\" into the bathroom. He banged on the door with his fists before eventually retreating, putting on a dressing gown and starting to cry.\n\nLouisette Geiss\n\nImage copyright CBS News Image caption Louisette Geiss holding a press conference on Tuesday\n\nThe actress and producer says she was attacked by Weinstein when he invited her to his office in a hotel for a meeting about a script she had written at the Sundance Film Festival in 2008.\n\nHe insisted on listening to her pitch in his hot tub, then asked her to watch him masturbate, she says - and told her he could green-light her script if she did so. She left.\n\nDaryl Hannah\n\nImage copyright Getty Images\n\nThe Splash actress says she repeatedly turned down Weinstein's advances during promotion for Kill Bill and its sequel. He tried, she says, to get into her hotel room on multiple occasions, once getting a key and \"burst[ing] in like a raging bull.\"\n\nHe asked to grope her breasts and then asked her to expose herself to him, she alleges. She suffered physical repercussions as her flights were cancelled and she was left stranded after she turned him down on one occasion, she adds.\n\nRosanna Arquette\n\nImage copyright Getty Images\n\nThe actress says she rejected Weinstein's advances and that she believes her acting career suffered as a result.\n\nShe told the New York Times in the early 1990s she was directed to his hotel room, where he was in a bathrobe and asked her for a massage. When she refused she says he grabbed her hand and pulled it toward his crotch.\n\nMore voices\n\nModel Ambra Battilana Gutierrez has said she was groped by Weinstein and later went to New York police in 2015, saying the producer assaulted her. She then met Weinstein wearing a hidden microphone. But prosecutors took no action.\n\nOther stars to have detailed how he made advances in his home or hotel rooms include Brit Marling, Lupita Nyong'O, Lena Headey and Kate Beckinsale.\n\nOther women who have come forward since then with their stories include French actresses Florence Darel, Judith Godreche and Emma de Caunes.\n\nBritish model Kadian Noble, US actresses Jessica Barth, Katherine Kendall and aspiring actresses Dawn Denning, who is now a costume designer, Tomi-Ann Roberts, who is now a psychology professor, have also gone on the record.\n\nTV anchor Lauren Sivan alleges Weinstein cornered her in an empty basement area of a New York restaurant in 2007 and masturbated in front of her.\n\nAnd other workers at the Weinstein film company told the New Yorker about their experiences, including Emily Nestor, who was a temporary front desk assistant who said she had had to refuse his advances \"at least a dozen times\".\n\nActress Claire Forlani has said \"nothing happened\" between her and Weinstein - but only because she \"escaped five times\".\n\nIn an interview with Canadian TV, actress Lauren Holly said the producer approached her naked and requested a massage, at which point she \"pushed him and ran\".\n\nZelda Perkins, a British former assistant of Harvey Weinstein, says she resigned after a colleague accused him of trying to rape her.\n\nWeinstein's spokeswoman Sallie Hofmeister issued a statement on 10 October in response to the allegations of sexual harassment and assault.\n\n\"Any allegations of non-consensual sex are unequivocally denied by Mr Weinstein,\" she said. \"Mr Weinstein has further confirmed that there were never any acts of retaliation against any women for refusing his advances.\n\n\"Mr Weinstein obviously can't speak to anonymous allegations, but with respect to any women who have made allegations on the record, Mr Weinstein believes that all of these relationships were consensual. Mr Weinstein has begun counselling, has listened to the community and is pursuing a better path.\"\n\nFollow us on Facebook, on Twitter @BBCNewsEnts, or on Instagram at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.", "images": ["https://ichef.bbci.co.uk/images/ic/720x405/p05jmrcv.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/1024/branded_news/597C/production/_98280922_montage_getty.gif", "https://ichef.bbci.co.uk/news/320/cpsprodpb/12A15/production/_98290367_82c5796e-ec63-4472-8772-604551c39912.png", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.41580010.page&x1=[urn:bbc:cps:c054adc8-c77d-d041-8268-27aff7198316]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/597C/production/_98280922_montage_getty.gif", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-41580010", "title": "Harvey Weinstein scandal: Who has accused him of what?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "A string of actresses have claimed he harassed or assaulted them in hotel rooms and offices.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 133647463, "og": {"title": "Harvey Weinstein's accusers", "type": "article", "description": "A string of actresses have claimed he harassed or assaulted them in hotel rooms and offices.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-41580010", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/597C/production/_98280922_montage_getty.gif", "alt": "BBC News. (L-R) Gwyneth Paltrow, Angelina Jolie, Cara Delevingne, Lea Seydoux, Rosanna Arquette, Mira Sorvino"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Harvey Weinstein's accusers", "description": "A string of actresses have claimed he harassed or assaulted them in hotel rooms and offices.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/597C/production/_98280922_montage_getty.gif", "alt": "(L-R) Gwyneth Paltrow, Angelina Jolie, Cara Delevingne, Lea Seydoux, Rosanna Arquette, Mira Sorvino"}, "domain": "www.bbc.com"}, "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}