{"url": "https://www.digitaltrends.com/movies/star-wars-episode-ix-release-date-trailer-cast-news/", "text": "There’s been plenty of speculation about the future of the Star Wars franchise since 2017’s Star Wars: Episode VIII — The Last Jedi hit theaters, and now the premiere of Star Wars: Episode IX – The Rise of Skywalker is here The final, full-length trailer for The Rise of Skywalker offered some intriguing hints as to how the Skywalker saga will conclude, including a brief scene from an epic space battle featuring more than a few iconic ships, and now that we’ve seen it, we’ve got our own opinions that don’t necessarily follow the critics’ consensus.\n\nThe Rise of Skywalker brings back director J.J. Abrams to close out this arc of the iconic sci-fi saga after he helmed 2015’s franchise-relaunching Star Wars: Episode VII — The Force Awakens. While Star Wars: Episode IX is now available for your viewing pleasure, if you’ve yet to see the film, here’s everything to know ahead of the action.\n\nJedi mind tricks\n\nIn a special event hosted in the game Fortnite, Disney released another clip from the upcoming film.\n\nThis time, we see Rey, Finn, and Poe land on an Imperial space station (which looks strangely familiar to previous films’ Death Star scenes) and instantly take out a few Stormtroopers. They run into a corridor where they’re stopped by two more Stormtroopers and look to be done for. However, Rey raises a hand and pulls a classic page from Obi-Wan Kenobi’s book, telling the Stormtroopers, “It’s okay that we’re here.”\n\nThey agree, after which Poe asks Finn, “Does she do that to us?”\n\nIt’s a little comic relief following a potentially significant reveal: That Rey has fully embraced and mastered the Jedi ability to control minds.\n\nA telling new clip\n\nA clip from Episode IX released a week before Rise of Skywalker hit theaters features the voice of James Earl Jones, who famously voiced Darth Vader in the original Star Wars trilogy.\n\nEmperor Palpatine’s voice joins that of Vader, as are the voices of Supreme Leader Snoke, taunting Kylo Ren.\n\n“I have been every voice you have ever heard inside your head,” the Sith voices hiss at Kylo, implying that Palpatine’s powers may have conquered death long enough to pull the strings for the rise of the First Order. Of course, without additional context, it’s impossible to say definitively what’s going on here and that, naturally, is the point of the teaser.\n\nAt the very least, the clip shows that The Rise of Skywalker makes a concerted effort to tie together all three trilogies to bring the Star Wars saga to a close.\n\nThey can fly now\n\nDisney released a clip from The Rise of Skywalker on November 25 featuring Rey, Finn, Poe, and a few more familiar characters racing across a desert while being pursued by stormtroopers. They weren’t your usual First Order troops, however, as the stormtroopers took to the sky using jetpacks in the 30-second clip, prompting some surprise from the hero characters. Yes, they can fly now.\n\nFinal trailer and ticket sales\n\nThe final trailer for Star Wars: The Rise of Skywalker (see above) premiered — much like past trailers for the episodic installments of the franchise — during a broadcast of the NFL’s Monday Night Football on October 21. Tickets for The Rise of Skywalker officially went on sale just before the trailer’s debut.\n\nHello, Babu\n\nAs part of Lucasfilm’s annual “Force Friday” campaign, the studio revealed a new character who debuted in The Rise of Skywalker: Babu Frik.\n\nThe character’s official description (via StarWars.com) reads as follows: “The tiny Anzellan droidsmith … works among the Spice Runners of Kijimi and can reprogram or modify virtually any droid — regardless of the security measures protecting its systems.”\n\nWelcome to the Star Wars universe, Babu.\n\nD23 preview: The last Jedi goes dark?\n\nDisney gave Star Wars fans an early look at some new footage from The Rise of Skywalker during the company’s D23 Expo in August, and the preview generated quite a bit of discussion due to its closing scene: A shot of Rey (Daisy Ridley) in a dark cloak, wielding a double-bladed, red lightsaber similar to the one Darth Maul used in The Phantom Menace.\n\nAlong with that cryptic tease, the video also featured one of the repurposed scenes from the prior films that feature the late Carrie Fisher as Leia, as well as a few other notable moments.\n\nA foreboding poster\n\nRevealed at Disney’s surprisingly packed D23 Expo event in Anaheim, California, the poster for the film is a daringly imaginative battle scene between our hero Rey (Daisy Ridley) and a fully masked Kylo Ren (Adam Driver). The previously rumored return of Emperor Palpatine (Ian McDiarmid) is front and center as he looks on at the fight from the skies above with demonic eyes.\n\nA tight schedule\n\nThe film’s late change in directors (by Star Wars standards, at least) was keenly felt by the production team, and prompted some creative maintenance of the filming schedule, according to Rise of Skywalker editor Maryann Brandon.\n\nIn an interview with Express U.K., the longtime collaborator with Abrams revealed that the tight production schedule for the film had her take the unusual step of cutting footage on set, while they were still filming.\n\n“When we did The Force Awakens, we started in May and we finished shooting in October, and we were out [the following] Christmas,” she explained. “For this film, we didn’t start until August, so we weren’t done until February shooting — so we have four months less time, and it’s a very big film.”\n\n“So I convinced JJ to let me cut on the set,” she said. “He was like, ‘No, we never do that.’ I [said], ‘Just try it, so I can start turning over shots.'”\n\nThe result was a situation in which Brandon was rarely more than 10 feet from Abrams at any given point during the filming of Rise of Skywalker, editing the movie as it was being filmed.\n\n“So if the camera would move 10 feet, I would move 10 feet,” she recalled. “I was everywhere.”\n\nMore details (and photos) emerge\n\nIn May, Vanity Fair published an in-depth preview of Rise of Skywalker featuring some of the first looks at the characters — both new and returning — that appear in the trilogy-ending chapter of the saga.\n\nAmong the biggest revelations from the preview include the return of the Knights of Ren, and the confirmation of Keri Russell’s character in the film, a “masked scoundrel” known as Zorri Bliss.\n\nV.F. can exclusively confirm that the mysterious Knights of Ren—first seen in #StarWars: The Force Awakens—are back in #TheRiseofSkywalker https://t.co/ER4XSJmZ8k pic.twitter.com/cBrdAOrqSv — VANITY FAIR (@VanityFair) May 22, 2019\n\nA photo also revealed the first look at Naomi Ackie as Jannah, who joins Finn (John Boyega) in one of the photos, riding into battle on creatures known Orbaks.\n\nHere’s what we can tell you about #TheRiseofSkywalker: when the film picks up—about a year after the end of The Last Jedi—Rey, Finn, and Poe are all finally in the same place for the first time since The Force Awakens https://t.co/cbjHB1IDSd pic.twitter.com/XWqLCCbsrK — VANITY FAIR (@VanityFair) May 22, 2019\n\nFranchise newcomer Richard E. Grant is also seen in the photos as the First Order’s Allegiant General Pryde.\n\nNew villain alert! Richard E. Grant joins #StarWars as Allegiant General Pryde https://t.co/MZcbyGMav7 — VANITY FAIR (@VanityFair) May 22, 2019\n\nThe full gallery of photos is available at Vanity Fair’s website.\n\nThe first look\n\nThe first trailer for The Rise of Skywalker dropped in front of a packed crowd at Star Wars Celebration in Chicago, and it revealed much more than just the film’s title. The trailer would be viewed more than 111 million times within the first 24 hours it was available, according to Deadline, receiving 20 million more views than the trailer for Episode VIII — The Last Jedi did during the same period of time.\n\nAs far as what the trailer revealed, Mark Hamill provided the preview’s evocative voice-over, while footage of Carrie Fisher as General Leia Organa — which was originally filmed for The Force Awakens — tugged at fans’ heartstrings. Billy Dee Williams as the elder Lando Calrissian looked as dapper as ever sitting in the Millennium Falcon’s cockpit.\n\nMore Star Wars News\n\nThe trailer’s biggest surprise came at the very end, however, when a maniacal laugh took over the soundtrack. That cackle belongs to none other than former Emperor Palpatine, who (supposedly) died at the end of Star Wars: Episode VI — Return of the Jedi. Just in case there was any confusion, Palpatine actor Ian McDiarmid took the Star Wars Celebration stage after the trailer finished playing and, in character, growled, “Roll it again.”\n\nOtherwise, the Star Wars Celebration Episode IX panel was light on details, although Lucasfilm President Kathleen Kennedy let the assembled cast members share a few small tidbits. Naomi Ackie’s new character is named Jannah. The Rise of Skywalker brings the sequel trilogy characters together for a single adventure, and BB-8 has a new droid pal named DIO, who is just as cute as you would imagine.\n\nA leaked peek?\n\nJust a couple of weeks before Star Wars Celebration Chicago alleged promotional materials for the film leaked on Making Star Wars. The images, which include a collage and character sheets, confirm a number of long-standing rumors and offer fans a glimpse of some of Star Wars: Episode IX‘s new characters.\n\nRey takes center stage on the “leaked” image, dressed in an outfit that recalls both Luke Skywalker’s all-white get-up in Star Wars: Episode IV — A New Hope and Padme’s costume during Attack of the Clones’ final battle scene. Poe Dameron is wearing full-on Resistance fighter garb, Finn holds a blaster, and C-3PO wields a Wookiee bowcaster, just like previous reports said he would. Kelly Marie Tran’s Rose Tico, who first appeared in Star Wars: The Last Jedi, is conspicuously absent.\n\nOn the villains’ side, Kylo Ren seems to have reforged his mask and is flanked by a group of similarly clad soldiers who are most likely the mysterious Knights of Ren. Kylo’s long-rumored legion of red Stormtroopers also appears as does a masked woman who the character sheets call “Zorri,” and who matches previous descriptions of the new character played by The Americans’ Keri Russell.\n\nThe character sheets correctly identify Naomi Ackie’s bow-wielding character as Jannah and offer a very blurry glimpse at Billy Dee Williams as Lando Calrissian, whose fashion sense doesn’t seem to have changed much over the past 40 years.\n\nThe end of an era\n\nOn January 15, 2019, Abrams shared some momentous news on Twitter: Principal photography on Star Wars: Episode IX has wrapped after a six-month shoot, marking the end of filming on both Disney’s sequel trilogy and the Skywalker family saga as a whole.\n\n“It feels impossible, but today wrapped photography on Episode IX,” Abrams wrote alongside a photo of stars Daisy Ridley, John Boyega, and Oscar Issac embracing on set. “There is no adequate way to thank this truly magical crew and cast. I’m forever indebted to you all.”\n\nIt feels impossible, but today wrapped photography on Episode IX. There is no adequate way to thank this truly magical crew and cast. I’m forever indebted to you all. pic.twitter.com/138AprtFuZ — JJ Abrams (@jjabrams) February 15, 2019\n\nAbrams wasn’t the only one who felt that way. Boyega posted the same photo on his social media feed, along with a heartfelt message. “That’s a wrap on Star Wars episode 9 and the end to a chapter of my life that I couldn’t be more thankful for,” Boyega said. “It really has been a joy to be in these movies surrounded by amazing people. JJ thank you for making my dreams come true.”\n\nCosmic cameos\n\nThe Star Wars saga has a long history of bringing in famous actors, musicians, and other familiar faces for small parts — often under heavy makeup or costumes — as a nod to some of the franchise’s most high-profile fans.\n\nStar Wars: Celebrity Chef Jamie Oliver Lands Episode IX Cameo https://t.co/3LXRF7QEGZ pic.twitter.com/5vNAsNsSK8 — Comic Book Resources (@CBR) December 26, 2018\n\nAccording to The Sun, celebrity chef Jamie Oliver suited up as a First Order stormtrooper for Episode IX. Oliver, who hosted the popular BBC series The Naked Chef for its three-season run, was offered the part after gaining attention for his Star Wars fandom over the years.\n\nOliver joins award-winning musician Ed Sheeran, who will also have a cameo in Episode IX, with both men playing First Order stormtroopers in the film.\n\nOne year later\n\nGiven how little time elapsed between the events of Star Wars: Episode VII — The Force Awakens and Episode VIII — The Last Jedi, it comes as a bit of a surprise that Episode IX jumps ahead in the timeline a bit for its story.\n\nSpeaking to Empire Magazine about the film, actor John Boyega — who portrayed former First Order stormtrooper Finn in The Force Awakens and The Last Jedi — indicated that Episode IX will pick up “roughly one year” after the events of its 2017 predecessor. At Star Wars Celebration 2019, panelists confirmed that there would be a sizable time jump between The Last Jedi and The Rise of Skywalker.\n\nJohn Boyega has confirmed that Star Wars: Episode #IX takes place ONE YEAR after the events of 'The Last Jedi'. [Empire Issue] pic.twitter.com/wC8iOV9Bv6 — Star Wars Stuff (@starwarstuff) December 22, 2018\n\nRumor patrol: Knights of Ren\n\nAs with any Star Wars movie, there’s no shortage of rumors circling Episode IX, and a few have sparked quite a bit of discussion in mainstream circles.\n\nThe mysterious Knights of Ren were also the subject of a popular rumor making the rounds, with ComicBook.com reporting that a person present at a Disney marketing event confirmed that the shadowy group seen in Episode VII — The Force Awakens and led by Kylo Ren will indeed be in Episode IX.\n\n“They will definitely be in the next movie,” writes the unidentified source. “They did show numerous pictures/artwork of them.”\n\nThe Doctor is in\n\nOne of cinema’s most popular sci-fi franchises will draw from the ranks of one of television’s longest-running sci-fi sagas.\n\nIn late August 2018, former Doctor Who star Matt Smith (pictured above) was reported to be the latest casting addition to Episode IX.\n\nSmith, who played the 11th Doctor in the wildly popular British sci-fi series and recently earned a Primetime Emmy Award nomination for his performance in the Netflix series The Crown, will play an unidentified “key role” in the Star Wars sequel, according to Variety.\n\nA bittersweet beginning\n\nAbrams commemorated the August 1 start of production on Episode IX with his first post on Twitter, which acknowledged the absence of franchise veteran Carrie Fisher on the set and thanked Episode VIII director Rian Johnson and Star Wars creator George Lucas for getting the saga to this point.\n\nBittersweet starting this next chapter without Carrie, but thanks to an extraordinary cast and crew, we are ready to go. Grateful for @rianjohnson and special thanks to George Lucas for creating this incredible world and beginning a story of which we are lucky to be a part. #IX pic.twitter.com/FOfnGwVut5 — JJ Abrams (@jjabrams) August 1, 2018\n\nOfficial cast\n\nOn July 27, Lucasfilm’s official Star Wars page listed the major cast list, including the big names returning and those joining anew the latest film in the franchise. And yes, that means Billy Dee Williams officially returns as the iconic Lando Calrissian, as does Mark Hamill which, for reasons we won’t specify here, may come as a surprise to some. Follow below for the official cast list:\n\nOfficially returning for Episode IX are Daisy Ridley, Adam Driver, John Boyega, Oscar Isaac, Lupita Nyong’o, Domhnall Gleeson, Kelly Marie Tran, Joonas Suotamo, and Billie Lourd.\n\nJoining the cast for their first Star Wars experience are Naomi Ackie (Dr. Who), Richard E. Grant, and Keri Russell. In addition, veteran Star Wars actors returning include Williams (as promised), Hamill (Luke Skywalker), and Anthony Daniels (C-3PO).\n\nBut those aren’t the only familiar faces coming back. The announcement states that the late Carrie Fisher’s character, Leia Organa, also returns for the film “using previously unreleased footage shot for Star Wars: The Force Awakens.” This may come as a surprise to some following news that no CG version of Fisher’s character would be used for Episode IX (seemingly implying Leia would not return). However, Episode IX director J.J. Abrams made a statement to alleviate concerns.\n\n“We desperately loved Carrie Fisher,” Abrams said. “Finding a truly satisfying conclusion to the Skywalker saga without her eluded us. We were never going to recast, or use a CG character. With the support and blessing from her daughter, Billie, we have found a way to honor Carrie’s legacy and role as Leia in Episode IX by using unseen footage we shot together in Episode VII.”\n\nA tricky new title\n\nStar Wars films are notorious for using working titles to throw off the public and keep production costs low in terms of locations and services. Episode VI — Return of the Jedi was shot under the guise of a horror movie called Blue Harvest. Meanwhile, Episode II — Attack of the Clones poked fun at the negative response to prequel trilogy’s Gungan leader with the title Jar-Jar’s Big Adventure.\n\nSometimes the production title can offer clues, though they may not make sense until after the film is released. Fantha Tracks has reported that the working title for Episode IX was trIXie. The site claimed that “the same research methods and public sources were used by the same team to uncover the production names of every Disney-era Star Wars film to date.”\n\nThe Force Awakens was shot under the title AVCO, which Bleeding Cool reported was the name of the theater in Los Alamos where a young J.J. Abrams saw the first Star Wars film. So what does trIXie refer to, if anything? It appears to simply be a way to get the roman numeral for the number 9 in the title.\n\nReunion time\n\nFollowing in the footsteps of the Star Wars trilogies that came before it, the current three-part story arc had its main characters separating in Episode VIII — The Last Jedi, the middle chapter of the saga (much like the characters did in Episode II — Attack of the Clones and Episode V — The Empire Strikes Back). As with those previous trilogies, though, the cast reunited for one big team-up for the concluding installment.\n\nAsked about Episode IX during a convention in Washington, D.C. in 2018, Boyega said he expects the film to bring together his character, Finn, with Daisy Ridley’s character, Rey. The pair have been separated since the events of Episode VII — The Force Awakens, but that period apart is nearing its end.\n\n“I haven’t read the script for Episode IX,” he said (via SlashFilm). “But Daisy did shoot me a text saying, ‘Oh my gosh, I just heard from J.J. [Abrams], and we’re back together.’ That’s what I’m really excited about, is Finn and Rey back together again.”\n\nDifferent endings, same result?\n\nWhile discussing the differences in working with Star Wars directors J.J. Abrams and Rian Johnson, Hamill revealed how the creator of the sci-fi saga, Lucas, planned to handle the later years of his iconic character, Luke Skywalker.\n\n“I happen to know that George didn’t kill Luke until the end of [Episode] IX, after he trained Leia,” Hamill told IGN. “Which is another thread that was never played upon [in The Last Jedi].”\n\nAlthough most of Lucas’ plans for a sequel trilogy were reportedly scrapped when Disney took over the franchise, The Last Jedi did get to a point with some of its main characters that has a lot in common with those early outlines. Luke’s death occurred one episode earlier, and Leia (Carrie Fisher) did show some aptitude with The Force in Johnson’s 2017 film.\n\n“George had an overall arc — if he didn’t have all the details, he had sort of an overall feel for where the [sequel trilogy was] going — but this [sequel trilogy] is more like a relay race,” Hamill said of the current saga, which appears to be letting its creative teams take the over-arching events in some unexpected directions, too. “You run and hand the torch off to the next guy, he picks it up and goes.”\n\nThe rich get richer\n\nWhatever your thoughts about Episode VIII, most can agree that it was a visually spectacular film. Scenes like the throne room saber battle and Vice Admiral Holdo’s lightspeed strike were breathtaking, thanks to some excellent art direction and production design. Now, the team for Episode IX has a new, distinguished member: Paul Inglis, who served as art director for the excellent (and gorgeous) Blade Runner 2049.\n\nThanks to a report from Omega Underground, we know Inglis was tapped as the supervising art director for Episode IX, to work alongside Abrams and the production team to define the film’s aesthetic. Inglis’ previous credits also include Skyfall, Game of Thrones, Prometheus, and Children of Men.\n\nA different kind of ship\n\nSome Star Wars fans saw Rey (Ridley) and Poe (Isaac) meet in The Last Jedi and started hoping it was their meet-cute. The single scene was enough to fuel shipping rumors — so much so that Ridley had to answer a question about it during a promotional event in China. Redditor Niamor89 posted a video (via Sleemo) showing the actress discussing the two Resistance fighters’ possible romantic future. Put simply, she doesn’t really want them to have one.\n\n“It’s wonderful to have relationships that are not romantic,” Ridley said. “I don’t think in films you always need a romantic relationship. I think friend relationships can be romantic in their gestures and their intimacy and all of that. So I think, hopefully — you know, if Rey and Poe get to have some scenes together and stuff — that there will be intimacy, but I think, for me, it doesn’t have to be romantic love.”\n\nLocation on loch\n\nThe next installment of the Star Wars franchise headed to the highlands — the county of Argyll in the Scottish Highlands, to be precise.\n\nA report in Scotland’s Daily Record indicated that a new Star Wars movie began filming in the western Scottish county of Argyll in June, with shooting taking place in the historic mountain pass known as the Rest and Be Thankful. Although the initial report suggested that it was Johnson’s spinoff trilogy that filmed in Argyll, that series hasn’t entered production — so if a Star Wars movie did indeed shoot in Argyll, it’s most likely Abrams’ Episode IX.\n\nParent problems, redux\n\nAlthough The Last Jedi seemed to offer some resolution regarding the mystery of Rey’s lineage, Johnson indicated in an interview with Huffington Post that fans might not have heard the end of that particular identity crisis.\n\n“Anything’s still open, and I’m not writing the next film. [Abrams and co-writer Chris Terrio] are doing it,” said Johnson while discussing the revelation about Rey’s parents that has become one of the most polarizing aspects of the film.\n\nTheir story will go on\n\nDon’t let the description of Episode IX as a “concluding chapter” mislead you: The stars of the sequel trilogy aren’t going away.\n\nIn a November 2017 interview featured on The Star Wars Show, Lucasfilm president Kathleen Kennedy indicated that many of the main characters introduced in Star Wars: Episode VII — The Force Awakens will continue their stories in Episode IX and beyond the sequel trilogy.\n\n“We’re sitting down now, we’re talking about the next 10 years of Star Wars stories, and we’re looking at, narratively, where that might go,” Kennedy said. “Future stories beyond Episode IX with these new characters — Rey, Poe, Finn, BB-8 — but we’re also looking at working with people who are interested in coming into the Star Wars world and taking us places we haven’t been yet. That’s exciting too because it’s a vast galaxy far, far away.”\n\nGoing back to the beginning\n\nAfter original Episode IX director Colin Trevorrow exited the project in September 2017 due to creative differences with the studio, it didn’t take long for Disney and Lucasfilm to find a new filmmaker to helm the movie — and he was a familiar face to fans of the franchise.\n\nAbrams was named the new director of the film just a week after the post was vacated, with the film’s co-writer, Academy Award winner Chris Terrio (Argo, Justice League), also announced at that time.\n\n“With The Force Awakens, J.J. delivered everything we could have possibly hoped for, and I am so excited that he is coming back to close out this trilogy,” Kennedy said in a statement on StarWars.com.\n\nGiven the success of Abrams’ franchise-relaunching sequel The Force Awakens, the decision to bring him back for Episode IX seems like a safe bet for the studio.\n\nRelease date, updated\n\nNot too long after Abrams was announced as the director of Episode IX, the film also received a new release date.\n\nStar Wars: Episode IX officially hit theaters on December 20, 2019, several months later than its original release date of May 24, 2019.\n\nThe new release date has the film arriving in theaters on the same weekend as a live-action feature based on the popular Broadway musical Cats. It also allows the film to carry on the tradition set by the two serialized installments of the Star Wars franchise that immediately precede it, Star Wars: Episode VII — The Force Awakens and Star Wars: Episode VIII — The Last Jedi, which were both assigned December premieres.\n\nEditors' Recommendations", "images": ["https://icdn3.digitaltrends.com/image/digitaltrends/the-rise-of-skywalker-final-trailer-2-1200x630-c-ar1.91.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://icdn3.digitaltrends.com/image/digitaltrends/the-rise-of-skywalker-final-trailer-2-1200x630-c-ar1.91.jpg", "keywords": [], "authors": ["Rick Marshall", "December"], "canonical_link": "https://www.digitaltrends.com/movies/star-wars-episode-ix-release-date-trailer-cast-news/", "title": "Star Wars: The Rise of Skywalker: Everything We Know So Far", "meta_data": {"description": "Star Wars: Episode IX -- The Rise of Skywalker will finally hit theaters on December 20, and here's everything we know about the sci-fi sequel so far, including official details on the story and the film's trailers, which confirm the unexpected return of a key character.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Star Wars: The Rise of Skywalker: Everything We Know So Far", "description": "Star Wars: Episode IX -- The Rise of Skywalker will finally hit theaters on December 20, and here's everything we know about the sci-fi sequel so far, including official details on the story and the film's trailers, which confirm the unexpected return of a key character.", "url": "https://www.digitaltrends.com/movies/star-wars-episode-ix-release-date-trailer-cast-news/", "site_name": "Digital Trends", "image": {"identifier": "https://icdn3.digitaltrends.com/image/digitaltrends/the-rise-of-skywalker-final-trailer-2-1200x630-c-ar1.91.jpg", "secure_url": "https://icdn3.digitaltrends.com/image/digitaltrends/the-rise-of-skywalker-final-trailer-2-1200x630-c-ar1.91.jpg", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/digitaltrends", "author": "https://www.facebook.com/rickmarshall25", "tag": "Tier 4", "section": "Movies & TV", "published_time": "2019-12-21T01:17:49+00:00", "modified_time": "2019-12-21T01:18:16+00:00"}, "twitter": {"card": "summary_large_image", "description": "Star Wars: Episode IX -- The Rise of Skywalker will finally hit theaters on December 20, and here's everything we know about the sci-fi sequel so far, including official details on the story and the film's trailers, which confirm the unexpected return of a key character.", "title": "Star Wars: The Rise of Skywalker: Everything We Know So Far", "site": "@digitaltrends", "image": "https://icdn4.digitaltrends.com/image/digitaltrends/the-rise-of-skywalker-final-trailer-2-510x0.jpg", "creator": "@rickmarshall"}, "apple-itunes-app": "app-id=500266645, affiliate-data=11lnN7", "fb": {"app_id": 61377565444}, "onesignal": "wordpress-plugin", "theme-color": "#0095da", "viewport": "minimum-scale=1, initial-scale=1, width=device-width, shrink-to-fit=no"}, "movies": [], "publish_date": 1576891069.0, "source": "https://www.digitaltrends.com", "summary": ""}