{"url": "https://www.etonline.com/inside-golden-globes-2018-after-parties-how-stars-cut-loose-93823", "text": "For many celebrities, the night was just getting started when host Seth Meyers wrapped up the 75th Annual Golden Globe Awards on Sunday.\n\nFollowing the show, ET hit up the most exclusive after-parties in Hollywood, and got a firsthand look at how the stars mingle when the cameras are off.\n\nHere's what went down when the real partying began!\n\nAmazon Studios' Golden Globes Celebration presented by Audi at Beverly Hilton Hotel: Bromances and Dances\n\nGetty Images\n\nMatt Damon and Chris Hemsworth inspired some major friendship goals when they greeted one another with a hug while at Amazon's after-party presented by Audi at the Beverly Hilton Hotel.\n\nHemsworth was seen shimmying to The Weeknd's \"I Can't Feel My Face\" and chatting with friends, while Damon and his wife, Luciana Barroso, took to the dance floor to cut loose.\n\nMeanwhile, The Marvelous Mrs. Maisel star Rachel Brosnahan mingled at the party with her Golden Globe in hand and a champagne in another. She was later seen cuddling up to her date on one of the couches.\n\nKate Beckinsale was a fan favorite at the event. Mobbed by party goers for photos, the actress happily stopped to pose with anyone that asked her.\n\nAs for Paris Hilton and her fiance, Chris Zylka, they had a look of love when they arrived to the event. The 36-year-old socialite was seen showing off her new engagement ring that she was wearing over lace gloves.\n\nAlso spotted at the bash was Modern Family star Sarah Hyland and her boyfriend, Wells Adams. The two were seen kissing while waiting to get into the video booth, and Hyland even danced a little bit to Justin Bieber's \"Sorry.\"\n\nInStyle and Warner Bros. Golden Globe Post-Party at Beverly Hilton Hotel: Major Star Sightings\n\nGetty Images\n\nA slew of stars hit up this party on Sunday night!\n\nEven before the A-listers stepped into the soiree, they were letting loose in the elevator. Pregnant supermodel Miranda Kerr even did a little jig while putting her baby bump on display.\n\nThe women of Big Little Lies, Reese Witherspoon, Laura Dern, Zoe Kravitz and Shailene Woodley, were seen toasting at a table together following the show's big win. Kerry Washington, Emma Watson and Michelle Williams were also at their table, and all sang along with the actresses to Madonna.\n\nWitherspoon didn't stay seated for very long. The 41-year-old actress made sure to say hello to Orange Is the New Black star Laverne Cox.\n\nMariah Carey showed up to the soiree with boyfriend Bryan Tanaka, and at one point in the evening, Salma Hayek was seen dancing in front of the singer's table. Carey seemed very smitten with Tanaka, and happily posed for photos with fans who stopped at her table.\n\nHenry Cavill made friends with a fans! The Man of Steel star asked a woman to do a tequila shot with him after she praised his work.\n\nAt another table, Allison Janney was celebrating her Golden Globes win with a large group of people. Seated on the upper part of the booth, the actress was moving along to the beat of the music.\n\nHulu's 2018 Golden Globes After Party at Beverly Hilton Hotel: Handmaids Hit the Dance Floor\n\nGetty Images\n\nThe stars of The Handmaid's Tale were seen celebrating the show's big wins on the dance floor! An eyewitness at the party saw Elisabeth Moss and Alexis Bledel busting a move to Luis Fonsi's \"Despacito\" and Taylor Swift's \"End Game.\"\n\nSeth Meyers' Golden Globe After-Party at The h.wood Group's Poppy, presented by Beats By Dre: J.T. Brings the Fun\n\nGetty Images\n\nJustin Timberlake's table was the place to be at this party! The triple-threat star and his wife, Jessica Biel, were seen in deep conversation with Jon Hamm before Michelle Williams headed over. It wasn't long before Timberlake was on his feet and dancing.\n\nHamm was also a standout on the dance floor, though he did take a break from busting a move to chat with Saturday Night Live boss Lorne Michaels.\n\nIn addition to Hamm, Emma Watson and Master of None star Lena Waithe showed off their skills on the dance floor.\n\nMeanwhile, This Is Us star Justin Hartley and wife Chrishell Stause danced in their seats, and over at the back bar was Game of Thrones' Kit Harington laughing with a group of friends.\n\nFocus Features Golden Globe Awards After Party: 'Get Out' Cast Hangs Out\n\nGetty Images\n\nGet Out director Jordan Peele and wife Chelsea Peretti were happy to meet and greet with guests as they made their way through the party.\n\nGet Out leading man Daniel Kaluuya was also at the event, and he and the rest of the movie squad were seen leaving the party together.\n\nMeanwhile, Golden Globe winner Gary Oldman hung out with his wife, Gisele Schmidt, and his sons. The actor playfully danced with his kids and snapped PDA pics with Schmidt.\n\nNetflix Golden Globes After-Party at Waldorf Astoria Beverly Hills: Angelina Jolie and Jennifer Aniston Both Attend\n\nNetflix\n\nBrad Pitt's exes both attended this soiree. Aniston posed with Netflix Chief Content Officer, Ted Sarandos, at the event while Jolie brought her 14-year-old son, Pax, as her date. However, a source tells ET that the two did not have any awkward run-ins, despite everyone being on edge about the possibility of it. \"Angie was there first for a couple minutes and then immediately left,\" our source says. \"And then later Jennifer came later and she too only stayed for a few photos and then left.”\n\nKevin Mazur/Getty Images for Netflix\n\nDrake was also living it up at the party, taking photos with everyone but especially spending time with the Stranger Things cast and Millie Bobby Brown.\n\nAlso at the event was the Stranger Things cast, Drake, Aziz Ansari, Alison Brie, Jason Bateman and Mary J. Blige.\n\nHBO's Official Golden Globe Awards After Party at Circa 55: Stars Couple Up!\n\nGetty Images\n\nHilton and Zylka couldn't help but dote on one another when talking to ET at the after-party. \"I used to call him ‘my love’ or ‘my hubby’ already,” the Simple Life star gushed over her guy. “I’ve been saying that for a year now, so fiancé is different.”\n\nMeanwhile, Carmen Electra showed up to the party holding hands with Clifton Collins Jr., but the two played coy about their relationship when chatting with ET. “I didn’t know [we were a couple] either,” Carmen quipped to Clifton. “Did you know?”\n\nHere's more:\n\nRELATED CONTENT:\n\nStars Continue to Wear Black at 2018 Golden Globe After-Parties -- See the Looks!\n\nReese Witherspoon ‘Cried 16 Times’ After Golden Globes Wins, Talks Introducing Oprah Winfrey (Exclusive)\n\nCarmen Electra & Clifton Collins Jr. Hold Hands, Talk Dating at Golden Globes After Party (Exclusive)\n\nCarmen Electra & Clifton Collins Jr. Attend Golden Globes Party Together (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/crop_drake_millie_bobby_brown_netflix.jpg?itok=FQFZYplk", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/paris_hilton_902434722.jpg?itok=vPIqNFK2", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/matt_chris_902416888.jpg?itok=iTa_VWBZ", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/handmaids_902445968.jpg?itok=qc-IziMC", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/20180107_goldenglobes_0710.jpg?itok=W3dzS-dp", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-01/1280_timesup_getty902403226.jpg?h=aadecbda&itok=hiH5Xlu9", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/biel_timberlake_902343980.jpg?itok=OkHcbquJ", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/instyle_warner_party.jpg?itok=hURWgaPi", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/damon_hemsworth_902412936.jpg?h=c673cd1c&itok=hJPd_1Pv", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-01/peele_902405238.jpg?itok=cL5InEQu"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/damon_hemsworth_902412936.jpg?h=c673cd1c&itok=hJPd_1Pv", "keywords": [], "authors": ["Jackie Willis"], "canonical_link": "https://www.etonline.com/inside-the-golden-globes-2018-after-parties-how-the-stars-cut-loose-93823", "title": "Inside the Golden Globes 2018 After-Parties: How the Stars Cut Loose", "meta_data": {"article": {"opinion": "false"}, "title": "Inside the Golden Globes 2018 After-Parties: How the Stars Cut Loose | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/inside-the-golden-globes-2018-after-parties-how-the-stars-cut-loose-93823", "title": "Inside the Golden Globes 2018 After-Parties: How the Stars Cut Loose", "description": "ET was inside some of the most exclusive parties of the evening.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/damon_hemsworth_902412936.jpg?h=c673cd1c&itok=hJPd_1Pv", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "ET was inside some of the most exclusive parties of the evening.", "title": "Inside the Golden Globes 2018 After-Parties: How the Stars Cut Loose", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jackie Willis‍", "url": "https://www.etonline.com/inside-the-golden-globes-2018-after-parties-how-the-stars-cut-loose-93823", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/damon_hemsworth_902412936.jpg?h=c673cd1c&itok=hJPd_1Pv"}, "description": "ET was inside some of the most exclusive parties of the evening.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "standout": "https://www.etonline.com/inside-the-golden-globes-2018-after-parties-how-the-stars-cut-loose-93823", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Awards, Golden Globes", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}