{"url": "https://www.vulture.com/2017/09/american-horror-story-cult-season-premiere-recap.html", "text": "American Horror Story: Cult is not helping. Most people living in Trump’s America want one of two things, based on which side of the political divide they fall. Liberals want the scripted equivalent of a big hug, coupled with an announcement that Trump will be called out for his ties to Russia and quickly impeached. Meanwhile, Trump’s fervent base wants the sort of legitimacy that says not only are they important, but they are also right.\n\nNeither of those groups will get what they want from AHS: Cult, at least not judging by the first episode. As “Election Night” begins, we meet avatars for the left and the right in a small town in Michigan, a battleground state that went uncharacteristically red in 2016. In the blue corner is Ally Mayfair-Richards (Sarah Paulson), a liberal lesbian who feels like her very way of life has been attacked and that her family will be ripped apart by the Trump administration. In the red corner is Kai Anderson (Evan Peters), a blue-haired do-nothing who seems to live in his parents’ basement, and who wants to use the chaos of Trump’s presidency to cull the weak from the herd.\n\nWhat’ll be uncomfortable for viewers is that neither of these characters are right. Ally is just ridiculous, letting politics ruin a very nice life with her wife, Ivy (Alison Pill), and her young son, Ozzy. Even worse, she is someone who committed an unspeakable act against her community: She voted for Jill Stein. The big reveal of Ally’s vote is straight-up camp and played brilliantly. We realize that the reason why Ally is so tortured by the outcome is because she cast a protest vote, one of just 11,000 that could have swayed Michigan to Clinton. Like in so many horror movies, she is tortured by her betrayal, but this one seems both monumental and insignificant at the same time.\n\nPaulson is playing an unhinged woman perfectly, and Ally surely has more than her fair share of problems. Just like the rest of America, it seems like she’s being gas-lit by current events. On a trip to the supermarket after her therapy session, she sees the checkout guy wearing a #MAGA hat and goes into a tizzy. She’s seemingly attacked by a bunch of killer clowns sporting terrifying masks, who are led by one with a three-pronged dildo nose riding a scooter. (I’m not scared by the clowns having sex in the produce section because, well, clown porn kind of turns me on.) Her reaction, obviously, is to throw bottles of rosé at them, because that is what any good liberal would think to do in a moment of terror.\n\nBut it also seems like this is just a figment of Ally’s imagination. As she spirals further into her post-election fugue state, she’s haunted by more and more phobias, like killer clowns and surfaces with tiny holes.\n\nJust as Ally is a basket case, Kai seems like a total whack job. Humping his TV and coating his face in Cheetos paste isn’t the worst of it. (The worst of it is his faded Manic Panic blue haircut, which I would donate $1 million to the Mike Pence 2020 campaign fund to get rid of forever.) Soon after the election, Kai goes before the city council to testify about why there shouldn’t be increased security at the Jewish Community Center, despite threats that were commonplace across the country at the time.\n\n“Above all people love fear,” he says. “People want to be scared to be released from their desires and needs … and those who are not afraid will return at the head of the evolutionary table to lead the weak to freedom.” This, ladies and gentlemen, is fascism. Kai is advocating that people give up their freedom so that they can be rid of the things that haunt them in the supermarket. This is actually quite an insightful look at how people are emboldened to act when the natural political order is upended. Here is a guy who fills a condom with pee and hurls it at a bunch of Mexicans so they’ll beat him up and he can film it. There is something seriously wrong with this dude.\n\nBut enough about politics, let’s look at all the scary stuff that’s happening this season. Twisty the Clown, the villain from Freak Show, returns to slay another couple getting dirty at a picnic in a scene reminiscent of season four’s premiere episode — but then we find out this version of Twisty exists in a mere comic book that Ozzy got his hands on. So Twisty apparently isn’t real, he’s just a creature from a story.\n\nThe Insane Clown Posse (sorry, I couldn’t resist) that’s stalking Ally also seems to exist only in her head, but I think that they’re actually real. After Ozzy and his nanny Winter (Billie Lourd) stumble onto a murder across the street, he tells his moms that he watched the clowns kill their neighbors — the same neighbors who humiliated Kai at the city-council meeting. We can tell that something really crazy is going on with Winter, even if we don’t know exactly what it is, so I’m more apt to believe Ozzy’s explanation than her claim that he’s making it all up.\n\nSpeaking of Winter, her relationship with Kai is very strange. One minute he’s terrorizing her for quitting school to work for Hillary’s campaign, and the next they’re pinkie-swearing and she’s confessing her love for anal. I don’t think they’re lovers, but considering they share a last name, it seems like they’re brother and sister. My theory is that they are in the season’s titular cult and it has something to do with worshipping Twisty the Clown. Winter and Kai made some sort of bet around the election and since she lost, she has to work in service for Kai to bring about a new world order where everyone lives in fear all the time. I’m not sure how Ally plays into this theory just yet, but like the rest of liberal America, she sure has seen her fair share of torture this past year.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2017/09/05/recaps/05-ahs-cult.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/09/05/recaps/05-ahs-cult.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/05/recaps/05-ahs-cult.w1200.h630.jpg", "keywords": [], "authors": ["Brian Moylan"], "canonical_link": "https://www.vulture.com/2017/09/american-horror-story-cult-season-premiere-recap.html", "title": "American Horror Story: Cult Recap: Send in the Clowns", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "American Horror Story: Cult Recap: Send in the Clowns", "url": "https://www.vulture.com/2017/09/american-horror-story-cult-season-premiere-recap.html", "description": "Who will be the season’s biggest villain: Killer clowns or Donald Trump?", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/05/recaps/05-ahs-cult.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "American Horror Story: Cult Recap: Send in the Clowns", "description": "Who will be the season’s biggest villain: Killer clowns or Donald Trump?", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/05/recaps/05-ahs-cult.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-09-05T23:07:00.657-04:00", "tag": "tv, tv recaps, overnights, recaps, american horror story, american horror story: cult, ahs: cult, fx", "publisher": "https://www.facebook.com/Vulture"}, "description": "Who will be the season’s biggest villain: Killer clowns or Donald Trump? A recap of FX’s ‘American Horror Story: Cult’ premiere episode.", "sailthru.tags": "tv, tv recaps, overnights, recaps, american horror story, american horror story: cult, ahs: cult, fx", "author": "Brian Moylan", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1504667220.657, "source": "https://www.vulture.com", "summary": ""}