{"url": "www.townandcountrymag.com/the-scene/weddings/a20964314/royal-wedding-rumors-debunked/", "text": "The months before the royal wedding were rife with speculation, from who would design the dress to the reception menu to potential gifts. You might think that now that the happy couple has been lawfully wed for over a week, all of the mysteries would have been solved, but the post-ceremony rumors still persist. So to set your royal mind at ease consider this you royal wedding myth-busting cheat sheet—the true, the plausible, and the definite nos.\n\nRumor: The Empty Chair Was For Diana\n\nWhile the ceremony was happening, the internet was already abuzz with a heartwarming story of maternal love. Harry's mother, Princess Diana was already an important part of the bride and groom's planning for the big day, so when eagle-eyed viewers spotted a conspicuously empty seat in the front row of St. George's Chapel of Windsor Castle, a seat right next to Prince William, no less, many began to speculate that the empty space was left as an homage to the late princess. The story was so charming, it had spread like wildfire before the couple had even finished their romantic carriage ride through London, but the reality was a bit more practical.\n\nBtw - I’ve seen some reports about the spare seat by Prince William in the chapel as having being left in memory of Princess Diana. It wasn’t empty for that reason. The seat in front of the Queen is always left empty, I am told by BP #royalwedding — Rebecca English (@RE_DailyMail) May 19, 2018\n\n\"Btw - I’ve seen some reports about the spare seat by Prince William in the chapel as having being left in memory of Princess Diana. It wasn’t empty for that reason. The seat in front of the Queen is always left empty, I am told by BP #royalwedding,\" royal reporter Rebecca English shared, later clarifying, \"She needs to be seen — and the seat she was sitting in today is her favourite seat in that chapel, apparently!\"\n\n\n\nWhat can we say, it's good to be Queen.\n\nVerdict: False\n\nRumor: Celebs Had to Hand Over Their Phones for the Reception\n\nFeeling deprived of photos of Meghan Markle's mom getting down on the dance floor with the royal family? There's a good reason. One early rumor that appears to have born itself out was word that wedding guests would be required to surrender their cell phones and cameras before the reception started.\n\nGetty Images\n\nThough the ceremony itself was a worldwide event, the receptions (both the luncheon hosted by the Queen as well as the later event at Frogmore House hosted by Prince Charles) were designed to be more private affairs where the tabloid magnets on the guest list and in the wedding party could relax and enjoy themselves, so it makes sense that the palace would set up a strict no cell phone policy (though guests did manage to sneak in a few pre-reception Instagrams for us to enjoy.) But that doesn't make us long video of William's supposedly naughty best man speech any less.\n\nVerdict: True\n\nRumor: Serena Williams Smashed It at the Reception's Beer Pong Table\n\nHardly a surprise, but the rumor that one of the receptions featured games of beer pong is apparently untrue. That tidbit seems to have started in the British tabloid The Sun, which featured a \"reception insider\" swearing that \"Sere­na Williams played beer pong like it was tennis.\" Meghan's close friend Serena has since cleared things up, explaining after a match at the French Open that the story was \"not even remotely true\" and adding that she \"doesn't even drink beer.\"\n\nThough its tough to imagine any of the royal functions—even the more intimate 200-guest affair at Frogmore House—featuring plastic cups and ping pong balls, we would certainly love to watch a matchup between Prince Harry and Serena.\n\nVerdict: False\n\nRumor: Guy the Beagle Attended the Reception\n\nIt's no secret that the royal family is filled with dog lovers—the Queen, in particular, is a lifelong devotee to four-legged friends. So naturally, it would make sense for the new Duchess of Sussex, who moved her rescue beagle Guy across the pond with her when she left Toronto behind, to include her beloved pup in the festivities. According to the Mirror, Guy was one part guest, one part entertainment as he \"caused chaos, running all over the place lapping up any spilled canapés.\"\n\nAdding plausibility to the story was video of Guy catching a very regal carpool to Windsor with Queen Elizabeth earlier in the week leading up to the wedding, but as no other confirmations of the pup's presence have been forthcoming, we still have to raise an eyebrow in this rumor's direction. Whether he made the official guest list or not, Guy's still a good boy in our books.\n\nVerdict: Plausible, but unlikely\n\nRumor: Michelin-Starred Chef Clare Smyth Catered the Frogmore House Reception\n\nThough Windsor Castle's Head Chef Mark Flanagan and his team handled the larger-scale afternoon reception on the castle grounds (the menu was seasonally-driven and featured an assortment of miniature desserts, FYI) the evening event is rumored to have been helmed by Clare Smyth, the first woman in the UK to be awarded three Michelin stars.\n\nTo pair with the separate Drinks of the World-themed bar that Us Weekly reports included a ginger and rum cocktail named “When Harry Met Meghan\" the chef is said to have served a sit-down dinner of light-bite canapes with a \"spring meets summer\" theme (organically-sourced, per Prince Charles's request) and possibly an elevated burger. Though few details have emerged about the event's menu, Irish-born Smyth, with her lauded pedigree working for Gordon Ramsey and her recently bestowed title of \"Best Female Chef\" from the World’s 50 Best committee, does seem like an ideal choice for the Duke and Duchess of Sussex's second meal as a married couple.\n\nVerdict: Plausible and likely\n\nRumor: Idris Elba Handled the Music\n\nAs if being an exceptionally handsome, talented, successful actor wasn't enough, Idris Elba is rumored to have added a new accolade to his resume on May 19th—royal DJ. Though DJ Sam Totolee, who also performed at Pippa Middleton's wedding, is said to have been the primary maestro for the reception with a mix of Harry's favorite tracks, according to The Telegraph, Elba got in on the game as well, DJ’ing a playlist filled with soul classics, 1960s R&B and 1980s dance.\n\nConsidering that the couple's first dance was reportedly \"I Wanna Dance with Somebody (Who Loves Me)\" by Whitney Houston, the '80s dance direction sounds reasonable, and with Elba's long-standing history at the turntables and the multiple guest reports of his turn at the DJ booth, we're going to call this rumor a thumbs up. After all, who would say no to having the perfect James Bond DJ their reception?\n\nVerdict: Likely\n\nRumor: They Ended the Evening with Fireworks\n\nThough there have been no videos released from inside of the reception (thanks to that pesky cell phone ban) word has it that the Frogmore House reception ended with a very literal bang. Late on the evening of the even, several sources in the historic market town of Windsor, where the venue sits, posted photos and videos of fireworks going off in the distance—supposedly at the reception hall.\n\n\n\nThough there has been no official statement on the matter, we think we can all agree that these were Harry and Meghan's celebratory sparkles; what's the likelihood of anyone else in Windsor setting off a massive fireworks display that night? We may not have been close enough to see the sparks, but to us this looks like one more magical touch to an already fairytale day.\n\nVerdict: True", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-wedding-diana-ring-1526756639.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-961607484-1527258543.jpg?crop=1.00xw:0.336xh;0,0.0720xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960036232-1527267086.jpg?crop=0.776xw:0.259xh;0.0833xw,0.00534xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=1xw:0.7501129688206055xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=1xw:0.7501129688206055xh;center,top&resize=1200:*", "keywords": [], "authors": ["Lauren Hubbard", "Lauren Hubbard Is A Freelance Writer", "Town", "Country Contributor Who Covers Beauty", "Shopping", "Entertainment", "Travel", "Home Decor", "Wine"], "canonical_link": "https://www.townandcountrymag.com/the-scene/weddings/a20964314/royal-wedding-rumors-debunked/", "title": "Gossip Behind Prince Harry and Meghan Markle's Wedding Explained", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "The Truth Behind the Royal Wedding Rumors That Everyone's Talking About", "description": "The confirmed, the debunked, and everything in between.", "url": "https://www.townandcountrymag.com/the-scene/weddings/a20964314/royal-wedding-rumors-debunked/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=1xw:0.7501129688206055xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-06-01 12:00:48", "published_time": "2018-06-01 12:00:00", "section": "Weddings", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=1xw:0.7501129688206055xh;center,top&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Royal Wedding 2018 Rumors Debunked - Gossip Behind Prince Harry and Meghan Markle's Wedding Explained", "description": "You might think that now that Prince Harry and Meghan Markle have been lawfully wed for over a week, all of the mysteries would have been solved, but the post-ceremony rumors still persist. So to set your royal mind at ease consider this you royal wedding rumors cheat sheet - the true, the plausible, and the definite nos.", "keywords": "royal wedding rumors, royal wedding gossip, royal wedding rumors debunked, prince harry meghan markle wedding, prince harry wedding rumors, meghan markle wedding rumors, royal wedding 2018", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=0.666566265060241xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "The Scene,the-scene,weddings", "sailthru.date": "2018-06-01T12:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=1xw:0.7501129688206055xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960067584-1527708393.jpg?crop=0.666566265060241xw:1xh;center,top", "sailthru.socialtitle": "The Truth Behind the Royal Wedding Rumors That Everyone's Talking About", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1527825600.0, "source": "http://www.townandcountrymag.com", "summary": ""}