{"url": "https://people.com/country/blake-shelton-karma-tweet-miranda-lambert-personal-thing/", "text": "After seemingly tweeting about his ex-wife Miranda Lambert’s relationship drama, Blake Shelton is now staying mum.\n\nThe country music singer, 41, tweeted about “karma” last week following the news that Lambert is dating married musician Evan Felker, and fans immediately speculated he was calling out the “Tin Man” singer.\n\nGet push notifications with news, features and more.\n\n“It was a personal thing that’s in a small circle of my people and that’s why it was written the way it was, and then people took it and make it into what they want to make it into, which I don’t want any part of that,” Shelton told Extra on Monday when asked directly about his tweet.\n\n“But at the same time, I can’t help but to think it’s funny how these fires get lit and it takes off and I don’t have time to care. That’s why I’ve kind of moved on,” he added.\n\nShelton spoke to Entertainment Tonight about his tweet as well and said it wasn’t fully intended for his fans to understand.\n\nImage zoom John Shearer/Getty\n\n“If it was meant for people to know exactly what it meant, it wouldn’t have been so cryptic,” he told the outlet during a Facebook Live interview with his fellow Voice coach Kelly Clarkson.\n\n“But I can tell you it’s been, actually, very entertaining to watch the world run with it and assume what they think it’s about,” he continued.\n\nShelton said most guesses as to what his tweet was about were not entirely correct, adding, “I’ll say this, people are way off the mark. But I don’t have time to worry about it.”\n\nLast week, he tweeted, “Been taking the high road for a long time.. I almost gave up. But I can finally see something on the horizon up there!! Wait!! Could it be?! Yep!! It’s karma!!”\n\nImage zoom Miranda Lambert, Evan Felker Jason Merritt/Getty; Frazer Harrison/Getty\n\nWhile the “I Lived It” singer demurred on who or what he was exactly tweeting about, multiple sources previously confirmed to PEOPLE it was indeed about the 30-time ACM award winner.\n\nOne Shelton insider says he feels “vindicated” after news broke that Lambert was dating the Turnpike Troubadours frontman, who filed for divorce from his estranged wife Staci Nelson two weeks after meeting Lambert for the first time in person.\n\nAccording to another source close to the estranged spouses, Lambert and Felker, both 34, connected via text message before his band opened for the country superstar during her Livin’ Like Hippies Tour for three dates in early February. Lambert’s split from former boyfriend Anderson East was made public in early April.\n\nRELATED VIDEO: Miranda Lambert’s New Boyfriend’s Wife Addresses Her Tough Week After Relationship News Breaks\n\n“They had never met and she had started texting him about looking forward to playing together and getting to know each other and maybe they could write because she really liked his writing sort of thing,” the source said. “It started very much about work. He was completely thrilled. By the time he was leaving for tour, it had become a lot flirtier.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nThe source continued, saying Lambert and Felker got closer in the three-day tour they were on. When Felker was supposed to return home to Nelson in Oklahoma, he allegedly skipped his flight, telling Nelson via email, “I’m not coming home this week,” according to the source.\n\nIn the midst of the drama last week, Nelson alluded to the cheating allegations in a “public service announcement” posted to her Instagram Story on Thursday. “PSA: If Staci Felker can make it through this week, so can you,” Nelson, who continues to use Evan’s last name on social media, captioned a teary-eyed picture of herself.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fmiranda-lambert-evan-felker.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1358&h=711&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1358&h=711&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/country/blake-shelton-karma-tweet-miranda-lambert-personal-thing/", "title": "Blake Shelton Won't Confirm 'Karma' Tweet Was About Miranda Lambert, Calls It a 'Personal Thing'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Blake Shelton,Celebrities,Evan Felker,Miranda Lambert,Music News,News", "news_keywords": "Blake Shelton,Celebrities,Evan Felker,Miranda Lambert,Music News,News", "description": "Blake Shelton is playing coy about the cryptic tweet he made following news his ex-wife Miranda Lambert is dating married musician Evan Felker", "og": {"title": "Blake Shelton Won't Confirm 'Karma' Tweet Was About Miranda Lambert, Calls It a 'Personal Thing'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/country/blake-shelton-karma-tweet-miranda-lambert-personal-thing/", "description": "After seemingly tweeting about his ex-wife Miranda Lambert’s relationship drama, Blake Shelton is now staying mum. The country music singer, 41, tweeted about “karma” last&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1358&h=711&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg", "width": 1358, "height": 711}}, "pinterest": {"url": "https://people.com/country/blake-shelton-karma-tweet-miranda-lambert-personal-thing/", "description": "Blake Shelton is playing coy about the cryptic tweet he made following news his ex-wife Miranda Lambert is dating married musician Evan Felker", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/country/blake-shelton-karma-tweet-miranda-lambert-personal-thing/", "title": "Blake Shelton Won't Confirm 'Karma' Tweet Was About Miranda Lambert, Calls It a 'Personal Thing'", "description": "Blake Shelton is playing coy about the cryptic tweet he made following news his ex-wife Miranda Lambert is dating married musician Evan Felker", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1358&h=711&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fblake-shelton.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}