{"url": "https://people.com/movies/tiffany-haddish-mispronounces-oscar-nominees/", "text": "Tiffany Haddish may have been snubbed for an Oscar on Tuesday, but she did win Twitter’s heart.\n\nThe 38-year-old comedian, known for her breakout role in Girl’s Trip, joined Andy Serkis to host the nominations announcement for the 90th Academy Awards on Tuesday— and had the Internet ablaze with her mispronunciation of some of the nominees, including Get Out star Daniel Kaluuya.\n\nGet push notifications with news, features and more.\n\n“Daniel Kool-yay… Kal-a-loo… Kall-elujah… Daniel Kall-elujah… — You know it, he know his name!” she said.\n\nDressed in a black tuxedo pantsuit, Haddish remained in good spirits throughout her early morning flubs (it was 5:30 a.m. PT, after all). Among her other stumbles? Call Me By Your Name‘s screenwriter James Ivory and producers Luca Guadagnino, Emilie Georges and Marco Morabito; The Post‘s producer Kristie Macosko Krieger, and Three Billboards Outside Ebbing, Missouri‘s producers Graham Broadbent and Pete Czernin.\n\n“Missouri” proved to be a recurring problem as well, Haddish wavering between pronouncing the state “Missour-ie” and “Missour-a” while reading the film’s 7 nominations.\n\nThe actress later took to Twitter and said that she felt like she “was a substitute teacher in a Key & Peel skit” in a reply to The Disaster Artist writer Michael H. Weber, whose name she also struggle with.\n\nImage zoom Andy Serkis and Tiffany Haddish Academy of Motion Pictures and Sciences\n\nTwitter couldn’t get enough.\n\n“I could watch Tiffany Haddish mispronounce names all morning,” said writer Joe Berkowitz.\n\n“I had my name butchered at my college graduation but I would’ve been totally fine with it had it been Tiffany Haddish,” Teen Vogue writer Gabe Bergado said.\n\nAdded one user with a conspiracy theory: “They gave the Tiffany Haddish the hard names on purpose!”\n\nOf course, there were those who weren’t as charmed by Haddish’s struggles.\n\n“This is brutal watching Tiffany Haddish mispronounce everything during these Oscar announcements,” wrote morning DJ Abe Kanan. “It was disrespectful and pathetic.”\n\nBut even The Disaster Artist‘ Michael H. Weber, who was nominated for Best Adapted Screenplay alongside writer Scott Neustadter, praised Haddish for it.\n\n“Tiffany Haddish can mispronounce my name any way she wants!” he tweeted after she messed up his name. “WOOOOOOO.”\n\nIt wasn’t just her mispronunciations that had Twitter laughing. The stand-up star was also throwing out jokes here and there. “Do you think they could install a steam shower in my house? ‘Cause I need one,” she joked after the Production Design nominees were announced.\n\n“I gotta see this Dunkirk. It seems like a lot of people like it,” she added after the Christopher Nolan film then picked up back-to-back nominations for Sound Editing and Sound Mixing.\n\nAfter announcing the nominees for Best Animated Short Film and Best Live Action Short Film, Haddish quipped, “The last category proves that length doesn’t matter!”\n\nAnd the Best Documentary Short Subject nominees — Edith and Eddie, Heaven is a Traffic Jam on the 405, Heroin(e), Knife Skills, and Traffic Stop — had Haddish shook. “All these titles make a woman from an urban area very uncomfortable,” she joked. “I’m just saying…”\n\nBy morning’s end, it appeared everyone was asking for Haddish to host the Oscars.\n\nShe’ll have to wait though, as Jimmy Kimmel is returning to host the ceremony for the second year in a row. He famously hosted the ceremony last year, when the wrong film was announced as the Best Picture winner.\n\nDespite the snafu, Kimmel received rave reviews for his performance as host. He held nothing back while making a few jabs at Mel Gibson, Justin Timberlake and Manchester by the Sea. And of course, he brought his ongoing feud with Matt Damon to the show.\n\nThe 2018 Oscars ceremony will be held at the Dolby Theatre at Hollywood & Highland Center on March 4 and will be televised live on ABC at 7 p.m. ET/4 p.m. PT.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/movies/tiffany-haddish-mispronounces-oscar-nominees/", "title": "Tiffany Haddish Mispronounced Names During Oscar Nominations and Twitter Loved Her for It", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Academy Awards,Movie Celebrities,Movie News,News,Tiffany Haddish", "news_keywords": "Academy Awards,Movie Celebrities,Movie News,News,Tiffany Haddish", "description": "Tiffany Haddish may have been snubbed for an Oscar on Tuesday, but she did win Twitter's heart", "og": {"title": "Tiffany Haddish Mispronounced Names During Oscar Nominations and Twitter Loved Her for It", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/tiffany-haddish-mispronounces-oscar-nominees/", "description": "Tiffany Haddish may have been snubbed for an Oscar on Tuesday, but she did win Twitter’s heart. The 38-year-old comedian, known for her breakout role&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/tiffany-haddish-mispronounces-oscar-nominees/", "description": "Tiffany Haddish may have been snubbed for an Oscar on Tuesday, but she did win Twitter's heart", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/tiffany-haddish-mispronounces-oscar-nominees/", "title": "Tiffany Haddish Mispronounced Names During Oscar Nominations and Twitter Loved Her for It", "description": "Tiffany Haddish may have been snubbed for an Oscar on Tuesday, but she did win Twitter's heart", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Ftiffany-haddish2-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/caCdf94Blfw"], "publish_date": null, "source": "https://people.com", "summary": ""}