{"url": "https://web.archive.org/web/20090425195727/http://republicanleader.house.gov:80/News/DocumentSingle.aspx?DocumentID=123296", "text": "Debt Day: A Symbol of Washington’s Arrogant Culture of Borrowing and Spending (Boehner Op-Ed on Townhall.com)\n\nWashington, Apr 22 - Next week, the Obama Administration will mark its 100th day in power. The first three-plus months of this Administration have been turbulent, to say the least. Confronted with the most severe economic crisis in generations, President Obama and congressional Democrats have set out on a spending spree the likes of which our nation has never seen. In fact, the Administration has spent more in its first 100 days than all previous presidents have combined – hardly a distinction of which to be proud.\n\n\n\nFeeling the heat, the President has asked his Cabinet to begin identifying wasteful programs to cut from the federal budget. While this sort of talk sounds good, the inescapable fact is that the Administration and Congress have spent the last three months piling mountains of wasteful debt on the backs of our children and grandchildren. Just take a look at how some of the so-called “stimulus” dollars are being spent. In spite of promises of transparency and accountability from the Administration, hundreds of millions of taxpayer dollars are being spent on wasteful projects: a skateboard park in Rhode Island, bike racks in the District of Columbia, highway studies instead of construction projects in my native Ohio, and programs led by housing agencies that have repeatedly failed audits – all in the name of economic “stimulus.”\n\nThis Sunday marks a day that is symbolic not only of our government’s arrogant culture of spending – but of this Administration’s borrowing binge as well. It’s called “Debt Day.” Many workers have become familiar with a concept known as “Tax Freedom Day,” which is the day on which Americans begin working for themselves each year, after having covered Uncle Sam’s tax bill for the year. Debt Day is very similar. It is the day of the Fiscal Year – beginning on October 1 of the previous calendar year – on which total government spending exceeds total federal revenues. And in our current Fiscal Year, that falls on April 26 – this Sunday, just days before the Administration’s 100th day milestone. In short, about halfway through Fiscal Year 2009, Washington has run out of money.\n\nI often like to highlight the folly of politicians spending money we don’t have. Well, Debt Day illustrates exactly what I’m talking about. Starting this Sunday, every day between now and September 30, 2009, when the federal government’s budget year ends, we’ll be deficit spending and piling more massive debt onto the backs of our children and grandchildren.\n\nThink about it from your family’s perspective. If your entire income for the year was paid out in the first six months of the year, would you spend it all during that first half of the year and charge the rest of the year’s spending on a credit card – plunging your family deeper and deeper into debt? Almost certainly not. A responsible family would show some discipline by drawing up and following a budget so its annual spending was spread out throughout the entire year.\n\nThis is a concept House Republicans had in mind when we offered a better solution during the budget debate several weeks ago. Our plan would curb spending, create jobs by cutting taxes, and control the debt – all with an eye toward restoring some fiscal sanity on both ends of Pennsylvania Avenue. But the Democrats in charge of our government would have none of it.\n\nWashington’s attitude gives new meaning to the common sales phrase “buy now, pay later.” Congress and the White House have burned through our government’s “income” for the current Fiscal Year – a practice that shows no signs of stopping after Debt Day comes and goes on Sunday. So, Washington will continue to “buy now,” while taxpayers 10, 20, and 30 years from now will be forced to “pay later.” And pay dearly, they will.", "images": ["https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image05.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/UploadedFiles/2.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image07.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image06.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image04.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/images/transpix.gif", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image03.jpg", "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/UploadedFiles/1.jpg"], "top_img": "https://web.archive.org/web/20090425195727im_/http://republicanleader.house.gov/img/image05.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Debt Day: A Symbol of Washington’s Arrogant Culture of Borrowing and Spending (Boehner Op-Ed on Townhall.com)", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}