{"url": "people.com/politics/people-president-trump-blocked-twitter-chrissy-teigen-stephen-king/", "text": "President Donald Trump‘s use of Twitter has long been a controversial component of his presidency, in part because of his frequent use of the “block” button, which the president has unleashed on a number of notable actors, authors and activists who have used Twitter as a platform to criticize him and his administration.\n\nBut his critics scored a victory on Wednesday when a federal judge in Manhattan ruled that blocking his foes from viewing his tweets violates the First Amendment — because his Twitter feed is an official government account.\n\nGet push notifications with news, features and more.\n\n“Well well well we meet again @realDonaldTrump,” model and author Chrissy Teigen, whom Trump blocked in July 2017, tweeted Wednesday after the judge’s ruling was announced.\n\nAccording to The New York Times, seven Twitter users and the Knight First Amendment Institute at Columbia University sued the president, claiming Trump’s account is part of the government and blocking them violates their First Amendment rights.\n\nJudge Naomi Reice Buchwald agreed with the plaintiffs, noting in her ruling that “the speech in which they seek to engage is protected by the First Amendment.” She also wrote that Trump and White House social media director Dan Scavino “exert governmental control over certain aspects of the @realDonaldTrump account.”\n\nHere’s a running list of notable people who have received the “@arealDonaldTrump blocked you” message on Twitter — but should be able to read his tweets again soon:\n\n1. Laura Packard\n\nPackard, a small business owner from Las Vegas who is currently battling stage four Hodgkin’s Lymphoma, was blocked by Trump after tweeting at him about health care and concerns over the repeal of Obamacare. The tweets that seemed to push Trump over the edge are from Sept. 19 of last year, in which she accused him of putting “America last,” and questioned him over the Graham-Cassidy healthcare bill.\n\nThe morning of Sept. 20, she woke up and discovered that Trump had blocked her. Now, she has one request for Trump, she told ThinkProgress — and it isn’t that he’ll lift the block: “I just wish that he would listen.”\n\nBut Packard addressed Wednesday’s ruling, helpfully explaining how Trump can unblock users en masse.\n\n2. Rosie O’Donnell\n\nTrump and O’Donnell have been feuding for years, but it took until July 23, 2017, for him to finally block her on Twitter. It was a tweet that mentioned the instantly infamous unsubstantiated Russian dossier, which alleged that Russian spies had explicit information about Trump, which finally prompted him to block the former talk show host\n\nJust a few hours after sending the tweet, O’Donnell found herself blocked.\n\nShe’s still tweeting about him, though — and has asked others to forward along her messages.\n\n3. Anne Rice\n\nThe president denied the Interview With the Vampire author one of her favorite pastimes — personally responding to Trump’s many tweets. She frequently tweeted about the president, his policy decisions, and yes, his tweets. In fact, it’s almost all she tweets about even now, after she’s been blocked. It was a now-deleted tweet about the Republican health care plan that finally got her banned from his account on June 26.\n\nImage zoom Jeff Vespa/WireImage; Alex Wong/Getty\n\nThe tweet read:\n\n“The Trump-GOP health care plan is a tax cut for the rich. Millions will lose coverage. A complete rip off.”\n\nNow, like O’Donnell, Rice hopes that her messages will still find their way to Trump through her followers.\n\n4. Chrissy Teigen\n\nThe latest addition to the “blocked by Trump” club, Teigen is an outspoken critic of the president, and has been, in her own words, for “nine years” — long before he ever ran for the White House. What was the insult though, that pushed Trump to hit the block button? According to Teigen, it was her most recent attack, on Sunday:\n\nTeigen shared a screenshot of the notification that Trump had blocked her, writing: “After 9 years of hating Donald J Trump, telling him ‘lol no one likes you’ was the straw.”\n\nImage zoom Francois Mori/AP\n\n5. Stephen King\n\nHe’s an expert on twists and turns, but not even King could have predicted that the president would block him on Twitter. Before the block, in mid-June, King had frequently tweeted criticisms of Trump, but rarely tagged the president’s twitter accounts (@realDonaldTrump or @POTUS). However, there were some pretty tough-worded tweets, so it’s possible they ended up on Trump’s radar.\n\n6. Marina Sirtis\n\nThe actress and Star Trek: The Next Generation star can pinpoint her blockage to a single tweet. The whole thing happened pretty quickly. First, she tweeted this on May 8:\n\nSix minutes later, she tweeted that she had been blocked. Sometimes, these things happen fast.\n\n7. Bess Kalb\n\nA writer for Jimmy Kimmel Live! and The New Yorker, Kelb found herself blocked by the president after a posting a number of tweets about him, as well as regular responses to many of his tweets. She said she was blocked because she “hurt his feelings.” There’s no telling which of Kelb’s tweets was the final straw for Trump, but here are a number of guesses:\n\n8. Andy Signore\n\nSignore is the mastermind behind the YouTube channel Honest Trailers. What’s surprising is that Signore wasn’t a habitual tweet-at-Trump-er. Instead, he wrote one critical tweet, about Trump misconstruing a quote by London Mayor Sadiq Khan on the terror attack at London Bridge.\n\nBy the next night, he was blocked.\n\n9. Angelo Carusone\n\nTrump’s blocking of Carusone, the president of the progressive watchdog group Media Matters for America, left him at a loss.\n\nCarusone said he hadn’t tweeted at Trump in four months by the time the president blocked him on June 15.\n\n“Sigh. The last time I @ mentioned him on Twitter was back in February. So what gives? Does he really not have better things to do right now?” Carusone wrote.\n\n10. Holly Figueroa O’Reilly\n\nSongwriter O’Reilly, who was also one of the organizers of the #MarchForTruthcalling for an independent probe into the Trump administration’s possible ties to the Russian government, found herself blocked by Trump at the end of May. She’s tweeted a number of insults at Trump, including the following:\n\nO’Reilly, however, isn’t taking Trump’s blockage lightly. She, along with six other blocked-by-Trump Twitter users, as well as the Knight First Amendment Institute at Columbia University, have sued Trump, saying that the blocking is “unconstitutional” and seeking to remove it, according to court documents.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fstephen-king-wp.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg", "keywords": [], "authors": ["Diana Pearl"], "canonical_link": "https://people.com/politics/people-president-trump-blocked-twitter-chrissy-teigen-stephen-king/", "title": "Good News, Chrissy Teigen: Judge Rules Trump Violates First Amendment by Blocking Twitter Followers", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Chrissy Teigen,Donald Trump,Stephen King", "news_keywords": "Chrissy Teigen,Donald Trump,Stephen King", "description": "President Trump's critics scored a victory on Wednesday when a federal judge in Manhattan ruled that blocking his foes from viewing his tweets violates the First Amendment", "og": {"title": "Good News, Chrissy Teigen: Judge Rules Trump Violates First Amendment by Blocking Twitter Followers", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/politics/people-president-trump-blocked-twitter-chrissy-teigen-stephen-king/", "description": "President Donald Trump‘s use of Twitter has long been a controversial&nbsp;component of his presidency, in part because of his frequent use of the “block” button,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/politics/people-president-trump-blocked-twitter-chrissy-teigen-stephen-king/", "description": "President Trump's critics scored a victory on Wednesday when a federal judge in Manhattan ruled that blocking his foes from viewing his tweets violates the First Amendment", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/politics/people-president-trump-blocked-twitter-chrissy-teigen-stephen-king/", "title": "Good News, Chrissy Teigen: Judge Rules Trump Violates First Amendment by Blocking Twitter Followers", "description": "President Trump's critics scored a victory on Wednesday when a federal judge in Manhattan ruled that blocking his foes from viewing his tweets violates the First Amendment", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchrissy-teigen7-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}