{"url": "https://web.archive.org/web/20160118082936/https://berniesanders.com/press-release/sanders-supports-gun-safety-bill/", "text": "Press Release Sanders Supports Gun Safety Bill January 16, 2016 Twitter\n\nFacebook\n\nEmail Link\n\nCHARLESTON, S.C. – U.S. Sen. Bernie Sanders on Saturday made good on his promise to support legislation to amend a 2005 law on firearms manufacturers’ liability.\n\n“I’m pleased that this legislation is being introduced,” Sanders said of proposals by Sen. Richard Blumenthal and Rep. Adam Schiff to rescind portions of a law granting broad immunity from lawsuits to gun manufacturers and dealers. “As I have said for many months now, we need to look at the underlying law and tighten it up,” Sanders added.\n\nSanders called it “good news” that the Senate and House bills proposed by Blumenthal and Schiff would leave in place provisions in the 2005 law that require child safety locks on guns and ban armor-piercing ammunition. “Those were important provisions that I did support,” he said.\n\nSanders also renewed his concern that the law should not subject the owners of small gun stores, which have not acted negligently, to lawsuits. “As I have said, I do want to make sure that this legislation does not negatively impact small gun stores in rural America that serve the hunting community. So I’m pleased to support the legislation and should it come up for consideration I would work to make sure it includes a provision that allows us to monitor its impact so that we may determine if it is having any unintended consequences.”\n\nSanders proposed amendment to the Blumenthal and Schiff bills would require the Commerce Department to monitor and report on the law’s impact in rural areas on the availability of hunting supplies, including firearms, sold by non-negligent local gun stores. Sanders amendment would add this section to the proposed legislation:\n\nSec. 3. Protection of non-negligent rural mom and pop hunting stores. The Secretary of Commerce shall monitor the impact of this statute, if any, on the availability of hunting supplies, including firearms, in rural communities from non-negligent local sellers. Within six months of enactment, and every six months thereafter, the Secretary shall transmit the results of the monitoring to the Committee on the Judiciary of the United States House of Representatives and United States Senate, respectively.", "images": ["https://web.archive.org/web/20160118082936im_/https://s.bsd.net/bernie16/main/page/-/website/fb-share.png"], "top_img": "https://web.archive.org/web/20160118082936im_/https://s.bsd.net/bernie16/main/page/-/website/fb-share.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20160118082936/https://berniesanders.com/press-release/sanders-supports-gun-safety-bill/", "title": "Sanders Supports Gun Safety Bill", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "mobile-web-app-capable": "yes", "theme-color": "#147FD7", "og": {"locale": "en_US", "type": "article", "title": "Sanders Supports Gun Safety Bill - Bernie Sanders", "description": "CHARLESTON, S.C. – U.S. Sen. Bernie Sanders on Saturday made good on his promise to support legislation to amend a 2005 law on firearms manufacturers’ liability. “I’m pleased that this legislation is being introduced,” Sanders said of proposals by Sen. Richard Blumenthal and Rep. Adam Schiff to rescind portions of a law granting broad immunity from lawsuits to gun manufacturers and dealers. “As I have said for many months now, we need to look at the underlying law and tighten it up,” Sanders added. Sanders called it “good news” that the Senate and House bills proposed by Blumenthal and Schiff …", "url": "https://web.archive.org/web/20160118082936/https://berniesanders.com/press-release/sanders-supports-gun-safety-bill/", "site_name": "Bernie Sanders", "image": "https://web.archive.org/web/20160118082936im_/https://s.bsd.net/bernie16/main/page/-/website/fb-share.png"}, "article": {"section": "Press Release"}, "twitter": {"card": "summary_large_image", "description": "CHARLESTON, S.C. – U.S. Sen. Bernie Sanders on Saturday made good on his promise to support legislation to amend a 2005 law on firearms manufacturers’ liability. “I’m pleased that this legislation is being introduced,” Sanders said of proposals by Sen. Richard Blumenthal and Rep. Adam Schiff to rescind portions of a law granting broad immunity from lawsuits to gun manufacturers and dealers. “As I have said for many months now, we need to look at the underlying law and tighten it up,” Sanders added. Sanders called it “good news” that the Senate and House bills proposed by Blumenthal and Schiff …", "title": "Sanders Supports Gun Safety Bill - Bernie Sanders", "image": "https://web.archive.org/web/20160118082936im_/https://s.bsd.net/bernie16/main/page/-/website/fb-share.png"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}