{"url": "www.mercurynews.com/2017/07/13/jennifer-lopez-hired-private-detective-to-check-out-alex-rodriguez-cheating-allegations-report-says/", "text": "Jennifer Lopez was apparently worried enough about the state of her four-month romance with Alex Rodriguez that she hired a private investigator to confirm or debunk allegations that he is a serial cheater who was still seeing a former mistress, according to a report in Us Weekly. Related Articles Jennifer Lopez: ditching undies to rock revealing Billboard Latin Music Awards outfits?\n\nJennifer Lopez and Alex Rodriguez on romantic getaway\n\nJennifer Lopez has moved on to Alex Rodriguez, report says\n\nJennifer Lopez and Drake’s supposed romance ‘fizzles’\n\nJennifer Lopez is a cougar, and she explains why\n\nLopez made this move because she was alarmed by a story that broke in the National Enquirer in June, in which his alleged former mistress Lauren Hunter claimed that the former New York Yankees third baseman isn’t faithful, the report said.\n\n“I don’t think he’s sexually attracted to her,” Hunter told the Enquirer.\n\nHunter, 34, said her affair with Rodriguez began in 2011 when he was still seeing actress Cameron Diaz. Hunter said their affair continued even after she had a baby with former football star Marcus Allen in 2014.\n\nHunter added that Rodriguez contacted her as recently as May about having a rendezvous, and she has the text messages to prove it. Stories about Lopez, 47, and Rodriguez, 41, dating began in March and they went public with their relationship at the Met Gala in New York in May.\n\nBut Hunter contended that he was probably imagining her when he was with Lopez and described his very adventurous sexual tastes, including threesomes. Get more celebrity news and photos delivered to your inbox for free on weekdays. Sign up for our Coffee Break newsletter here.\n\nIn response to these allegations, the singer and actress took a cue from one of her current jobs, playing an NYPD detective in the NBC crime drama “Shades of Blue.” She hired a private detective to tail Rodriguez, an “insider” told Us.\n\n“She’s really into Alex and wants it to work,” the source added. “So she’s trying to control as much as she can.”\n\nBut her need to control angered Rodriguez when he found out about the detective.\n\n“They had a huge fight,” the insider told Us.\n\nDespite this apparent breakdown of trust in this fledging relationship, the two are determined to work “through it,” Us Weekly said.\n\nMore recently, they’ve acted like everything is wonderful between them, gushing over each other in interviews. Earlier this month, J. Lo told Extra that her beau is “a beautiful person” and a “loving father” to his daughters, Natasha, 12, and Ella, 9, whom he shares with ex-wife Cynthia Scurtis.\n\n“He’s a generous human being with his family, with his friends, with me,” Lopez told the outlet. “He’s caring and sweet and capable and responsible and just all the beautiful things you would want a man to be. I feel really lucky right now, so I’m excited about life, but I’m more excited for people to get to see who he really is.”\n\nRodriguez has apparently spent time with Lopez’ 9-year-old twins Emma and Max with her ex-husband Marc Anthony. He had similarly adoring things to say about Lopez during a March appearance on “The View,” Us said.\n\n“We’re having a great time,” he said. “She’s an amazing, amazing girl. One of the smartest human beings I’ve ever met and also an incredible mother.”", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2017/05/jlo.jpg?w=1024&h=812"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/05/jlo.jpg?w=1024&h=812", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/07/13/jennifer-lopez-hired-private-detective-to-check-out-alex-rodriguez-cheating-allegations-report-says/", "title": "Jennifer Lopez hired private detective to check out Alex Rodriguez cheating allegations, report says", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Jennifer Lopez was worried about claims made by Alex Rodriguez' former mistress that he is a serial cheater with an adventurous sexual appetite, a report says.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Jennifer Lopez hired private detective to check out Alex Rodriguez cheating allegations, report says", "url": "https://www.mercurynews.com/2017/07/13/jennifer-lopez-hired-private-detective-to-check-out-alex-rodriguez-cheating-allegations-report-says/", "description": "Jennifer Lopez was worried about claims made by Alex Rodriguez’ former mistress that the former New York Yankees third baseman is a serial cheater with an adventurous sexual appetite, a repor…", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/05/jlo.jpg?w=1024&h=812", "width": 1024, "height": 812}, "locale": "en_US"}, "article": {"published_time": "2017-07-13T13:25:30+00:00", "modified_time": "2017-07-13T15:58:47+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Jennifer Lopez hired private detective to check out Alex Rodriguez cheating allegations, report says"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/05/jlo.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1499875200.0, "source": "http://www.mercurynews.com", "summary": ""}