{"url": "http://time.com/5105990/ann-currys-complex-relationship-with-matt-lauer-and-the-today-show/", "text": "Ann Curry will soon make her return to television with her new PBS program We’ll Meet Again, but in interviews promoting the show, she is being asked to look backwards — to her exit from the Today show nearly six years ago.\n\nCurry spent 15 years with NBC’s morning show, and from 2011 to 2012 she served as co-anchor alongside Matt Lauer.\n\nHer tearful on-air announcement that she was leaving is remembered as a landmark moment in morning show television. NBC has long said the decision was based on ratings, and the network declined to comment on Wednesday. But fans and journalists like then-New York Times media critic Brian Stelter, who detailed the tension between Lauer and Curry in his 2013 book “Top of the Morning,” believe Lauer had something to do with her departure.\n\nIn an interview on CBS This Morning on Wednesday, co-anchor Gayle King said to Curry, “It was viewed that a very powerful man, meaning Matt Lauer, derailed your career.” Curry — after joking, “Don’t worry, I’m not going to start crying” — responded, “You should ask someone else, I’m not the one to ask about that … I don’t know what was all behind it. I do know that it hurt like hell.”\n\nAsked if she thought Lauer – who was fired in November over claims of sexual misconduct – abused his power, Curry said, “I’m trying to do no harm in these conversations. I can tell you that I am not surprised by the allegations.”\n\nWhen King asked Curry whether she “heard things” or “knew things” while she was at NBC, Curry responded: “I’m trying not to hurt people and I know what it’s like to be publicly humiliated. I never did anything wrong to be publicly humiliated, and I don’t want to cause that kind of pain to somebody else.\n\n“But I can say that I, because you’re asking me a very direct question, I would be surprised if many women did not understand that there was a climate of verbal harassment that existed.”\n\nAfter Lauer’s firing, some of Curry’s fans took to social media to speculate how she felt about the news. The meme “Somewhere Ann Curry” imagined the former co-anchor greeting the news in various ways, for instance, “Somewhere Ann Curry is breaking out that champagne.”\n\nCurry told People this week that she didn’t revel in Lauer’s firing at all. Instead, she said: “I wish I could say that I was celebrating. But actually I immediately checked myself. Because I knew women had suffered.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/TheCircle.jpeg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/11/ann-curry-matt-lauer.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/ann-curry-matt-lauer.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Sarah Begley"], "canonical_link": "https://time.com/5105990/ann-currys-complex-relationship-with-matt-lauer-and-the-today-show/", "title": "Ann Curry's History With Matt Lauer and the Today Show", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "ann curry, why ann curry left the today show, why did ann curry leave the today show, ann curry matt lauer, why was ann curry fired from nbc, ann curry interview about matt lauer, ann curry on cbs this morning, ann curry interview", "news_keywords": "ann curry, why ann curry left the today show, why did ann curry leave the today show, ann curry matt lauer, why was ann curry fired from nbc, ann curry interview about matt lauer, ann curry on cbs this morning, ann curry interview", "description": "Ann Curry gained national attention for her emotional goodbye when she was fired from the Today show.", "og": {"title": "Ann Curry's Complex Relationship With Matt Lauer and 'Today'", "type": "article", "site_name": "Time", "url": "https://time.com/5105990/ann-currys-complex-relationship-with-matt-lauer-and-the-today-show/", "description": "Her emotional goodbye in 2012 is a landmark moment in morning television", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/ann-curry-matt-lauer.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5105990/ann-currys-complex-relationship-with-matt-lauer-and-the-today-show/", "description": "Ann Curry gained national attention for her emotional goodbye when she was fired from the Today show.", "media": "https://api.time.com/wp-content/uploads/2017/11/ann-curry-matt-lauer.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5105990/ann-currys-complex-relationship-with-matt-lauer-and-the-today-show/", "title": "Ann Curry's Complex Relationship With Matt Lauer and 'Today'", "description": "Her emotional goodbye in 2012 is a landmark moment in morning television", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/ann-curry-matt-lauer.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/eUtEn5tGsSI"], "publish_date": null, "source": "http://time.com", "summary": ""}