{"url": "en.wikipedia.org/wiki/Fall_in_Line", "text": "2018 single by Christina Aguilera featuring Demi Lovato\n\n\"Fall in Line\" is a song by American singer Christina Aguilera for her eighth studio album Liberation (2018), featuring guest vocals from American singer Demi Lovato. It was released as the album's second single on May 16, 2018 by RCA Records, impacting hot adult contemporary radio and contemporary hit radio on June 19 and May 28, respectively.[1][2] Aguilera co-wrote the song with Johnny Simpson, Mark Williams, Audra Mae, Raul Cubina and Jon Bellion, while the production was handled by the latter.\n\n\"Fall in Line\" is centered around lyrical themes of female empowerment, being recognized as a feminist anthem.[3] The song received positive response from music critics, who commended Aguilera and Lovato's vocal deliveries, as well as the lyrics and the inspiring theme. Commercially, \"Fall in Line\" made minor impact on charts, but reached top-forty positions in Hungary and the digital charts of Greece, Spain and the United States. For promotion, an accompanying lyric video was uploaded onto Aguilera's official YouTube channel simultaneously with the song's release, followed by a music video directed by Luke Gilford. The singer also performed it on several occasions, including the Carpool Karaoke segment of The Late Late Show with James Corden, 2018 Billboard Music Awards, The Tonight Show Starring Jimmy Fallon, and Today Show. The song was nominated for Best Pop Duo/Group Performance at the 61st Annual Grammy Awards.[4] This marked Aguilera's twentieth Grammy nomination and Lovato's second Grammy nomination.\n\nBackground [ edit ]\n\nAguilera described the song: \"I wrote 'Fall in Line' a few years ago before all this news came out [Time's Up and Me Too movement]. It was the song that needed to be heard. Because of what I witnessed when I was growing up I always felt really driven to have a voice that my mom kind of never had in my childhood. So I've always wanted to be that advocate for women and anybody that was struggling to have their own voice. I watched my mom have to be submissive, watch her Ps and Qs or she's gonna get beat up. You can either be, unfortunately, so damaged by it that you take a turn for the worse, or you can feel empowered by it and make choices to never go down that route.\"[5] In November 2018, the track's songwriter and producer Jon Bellion revealed that at one point, Beyoncé had tried to secure the song for the R&B duo Chloe x Halle.[6]\n\nIn June 2018, Aguilera appeared on DJ Zane Lowe's Beats 1 radio show, giving an interview about Liberation. The singer explained that the track was committed to everyone that felt disempowered, adding: \"It's a message that I've preached [...] I think the chorus can fit anybody's feeling if they feel repressed, or oppressed, or whatever's going on in their lives that they feel they need to come to their own realization\". Aguilera also revealed that she decided to work with Lovato because it was important to choose someone that is vocal about their own struggles and past, stating: \"I wanted somebody that could 'come to play', and she put so much heart and passion into it [...] I teared up when I first heard her vocal on it. I sent her flowers and I was just like, 'Oh my God, you took it to the next level'\".[7]\n\nRelease and promotion [ edit ]\n\n\"Fall in Line\" premiered on May 16, 2018, at 8 a.m. EST, and was released commercially for digital download worldwide at the same time.[8] Aguilera stated in a tweet: \"To anyone who's ever felt silenced and repressed, the truth seekers and bold thinkers...may you liberate your voice and break the mold, never back down, and never fall in line.\"[9]\n\nRecording and composition [ edit ]\n\nAguilera co-wrote \"Fall in Line\" alongside Johnny Simpson, Mark Williams, Audra Mae, Jon Bellion, and Raul Cubina, while the production was handled by Jon Bellion. The track was recorded at The Guest House in Hollywood Hills, California, while the mixing was handled by Manny Marroquin at Larrabee Sound Studios. The mastering was performed by Dave Kutch at The Mastering Palace, New York City. Instrumentation for the song included trumpet and flugelhorn by Ryan Svendsen.[10] The song is performed in the key of C major with a slow tempo of 40 beats per minute, and the vocals span from B♭ 2 to C 6, with Lovato's belting range reaching up to a B♭ 5 .[11]\n\n\"Fall in Line\" has been described as a \"feminist anthem\" and a sequel to Aguilera's 2003 song, \"Can't Hold Us Down\" with a lyrical content of women's rights.[12][13][14] The introduction to the song is the track \"Dreamers\", which \"features a group of young girls declaring goals like 'I want to be a journalist,' 'I want to be heard,' 'I want to be president.'\" Aguilera stated that the track was recorded a few years ago and before movements such as Time's Up and Me Too came out. She added: \"It was the song that needed to be heard. Because of what I witnessed when I was growing up I always felt really driven to have a voice that my mom kind of never had in my childhood. So I've always wanted to be that advocate for women and anybody that was struggling to have their own voice.\"[15]\n\nCritical reception [ edit ]\n\npictured in 2018). \"Fall In Line\" features Demi Lovato ().\n\nJon Pareles from New York Times felt that \"Fall in Line\" is \"addressed directly to 'little girls'\", pointing out the lyric \"You do not owe them your body and your soul\",[16] while Brittany Spanos from Rolling Stone described the track as an \"empowering duet\".[17] During a review for Liberation for USA Today, Patrick Ryan said that the song is a \"soulful riff-off\", and Aguilera and Lovato are \"belting to the rafters as they preach to young girls the importance of speaking their minds and being themselves\".[18] Chuck Arnold from New York Post described the song as \"torchy\" and \"fiery\", also stating that \"Fall in Line\" is \"defiant duo\".[19] Nicholas Hautman of US Weekly described the track as \"anthemic\" and felt that \"the duet continues the theme of female empowerment with #MeToo-era lyrics such as, 'I got a mind to show my strength / And I got a right to speak my mind.'\"[20] Ilana Kaplan and Joe Goggins from Independent felt that \"Fall in Line\" is a standout on Liberation, describing it as a \"impassioned feminist anthem\", and also stating that Aguilera and Lovato are \"two of the best vocal powerhouses in the game\".[21]\n\nDaniel Kreps of Rolling Stone called Aguilera and Lovato's singing abilities \"remarkable\" and deemed the final chorus a \"skyscraping duet\".[22] Gil Kaufman of Billboard described the track as \"a towering empowerment anthem\".[23] Rebecca Farley of Refinery29 described the track as Aguilera's 2002 song \"Beautiful\"-meets-Lovato's 2017 song \"Sorry Not Sorry\", calling both singers as \"obstreperous pop performers who are done being sorry\".[24]\n\nCommercial performance [ edit ]\n\nAfter its release, \"Fall in Line\" had a minor impact on charts. In the United States, it entered at number 39 on the Billboard Digital Songs chart with only two days of sales, since the song was released towards the end of the tracking week. The next week, the single ascended to its peak of number 17, becoming her highest charting song since \"Say Something\".[25] Thereby, it debuted at number-one on the Bubbling Under the Hot 100 chart, which serves as an extension to the Billboard Hot 100.[26] In Canada, \"Fall in Line\" reached number 97 on Canadian Hot 100, becoming Aguilera's second lowest charting song.[27] Elsewhere, the track achieved its strongest position in Hungary, debuting and peaking at number 17 on the Single Top 40 chart.[28] It also achieved top-forty positions on the digital charts of Greece and Spain, reaching number 21 and 37, respectively.[29][30]\n\nMusic video [ edit ]\n\nThe accompanying music video was directed by Luke Gilford and premiered May 23, 2018.[31] It depicts Aguilera and Lovato being kidnapped and forced to sing in a futuristic prison filled with surveillance cameras; the two eventually fight their way to freedom. Aguilera stated on Twitter, \"Fall In Line is as much about supporting each other as it is about self-empowerment. I wanted to convey that in this video by visually representing the imprisonment that so many of us have felt, and the freedom we can achieve together.\"[32] According to Billboard and Rolling Stone, \"The oppressive, male-dominated prison facility is a clear critique on society's oppression of women.\"[33][34]\n\nLive performances [ edit ]\n\nAguilera made the live performance debut of \"Fall in Line\" on Carpool Karaoke episode 471, which was first broadcast on May 16.[35][36] She performed the song with Lovato at the 2018 Billboard Music Awards four days later.[37] The song was also added to the set list of the European leg of Lovato's Tell Me You Love Me World Tour.[38] On 14 June, Aguilera performed \"Think\", \"Fighter\" and \"Fall in Line\" on The Tonight Show Starring Jimmy Fallon.[39] The next day, she performed \"Can't Hold Us Down\", \"Fall in Line\" and \"Fighter\" on Today Show.[40] Aguilera also performed the song on her ongoing residency and tour, The Xperience and The X Tour respectively.\n\nCredits and personnel [ edit ]\n\nRecording and management\n\nPersonnel\n\nChristina Aguilera – vocals, songwriting\n\nDemi Lovato – vocals\n\nJon Bellion – songwriting, production, background vocals\n\nAudra Mae – songwriting, background vocals, additional vocals\n\nMark Williams – songwriting, co-production\n\nRaul Cubina – songwriting, co-production\n\nJonathan \"Johnny\" Simpson – songwriting, recording, co-production\n\nMitch Allan – Demi Lovato vocal production\n\nRyan Svendsen – trumpet, flugelhorn\n\nOscar Ramirez – Christina Aguilera vocal engineering\n\nScott Robinson – additional vocal engineering\n\nManny Marroquin – mixing\n\nChris Galland – mix engineering\n\nRobin Florent – mix assistance\n\nScott Desmarais – mix assistance\n\nDave Kutch – mastering\n\nCredits adapted from Liberation.[10]\n\nCharts [ edit ]\n\nRelease history [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Demi_Lovato_3_%2842749539272%29_%28cropped%29.jpg/170px-Demi_Lovato_3_%2842749539272%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/3/3f/Christina_Aguilera_Fall_in_Line.png/220px-Christina_Aguilera_Fall_in_Line.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/3/3f/Christina_Aguilera_Fall_in_Line.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/3f/Christina_Aguilera_Fall_in_Line.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Fall_in_Line", "title": "Fall in Line", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/3/3f/Christina_Aguilera_Fall_in_Line.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}