{"url": "https://www.etonline.com/khalid-reflects-his-five-grammy-nominations-exclusive-92868", "text": "2017 has been quite a year for Khalid.\n\nThe 19-year-old performer kicked things off strong in January, when his breakthrough single, “Location,” hit the Billboard R&B Top 10. Two months later, the song’s remix -- featuring Lil Wayne and Kehlani -- was released, along with his debut album, American Teen. In August, he won Best New Artist at the VMAs. By November, he was a GRAMMY nominee.\n\n“This year has most absolutely been one big whirlwind,” the artist, born Khalid Donnel Robinson, recently told ET. “I try to take all of my experiences in and not take anything for granted. It’s really hard for me to pick and choose highlights because everything has been so incredible!”\n\nIt may be tough for him to pick a standout moment from a year that looks more like a best-of reel, but one highlight has to be the singer calling his own shot when it comes to the GRAMMYs. On the morning that nominations were announced, fans were quick to point out a 2014 tweet where a then-15-year-old Khalid declared, “I want to go to the Grammys one day.”\n\nI want to go to the Grammys one day. — Khalid (@thegreatkhalid) January 27, 2014\n\nOn Jan. 28, 2018, nearly four years to the day after sending that tweet, the singer will attend the awards ceremony as a nominee in five categories: Best New Artist; Best Urban Contemporary Album, for American Teen; Best R&B Song, for “Location” as well as Song of the Year and Best Music Video for his feature spot on Logic's \"1-800-273-8255.\"\n\n\"It definitely has not sunk in yet. I don’t know if it ever will,” Khalid said of the nominations. \"This journey so far has been truly amazing, and I'm so grateful to have this platform to share my art and who I am as an individual. To be recognized and accepted by my musical peers is truly an honor.\"\n\nJudging by his Rolodex, the young star has certainly earned the recognition of his peers, even before GRAMMY nods were announced. This year alone, he’s worked with some of the music world’s biggest stars, including Lorde, Calvin Harris, Marshmello and Charli XCX. So what was his favorite musical collab of 2017?\n\n\"I'd definitely say performing a mash-up of 'Thunder' and 'Young Dumb & Broke' with Imagine Dragons at the AMAs was the coolest collaborative moment so far,” Khalid mused. “I think the performance was unexpected, but it turned out great, and it was so much fun.”\n\nAs for an artist he’s dying to work with, the performer admitted, “I’d love to collaborate with Frank Ocean. He’s one of my favorite artists of all time.”\n\nIf anyone can make a collaboration with the elusive Ocean happen, it may be Khalid, who shows no signs of slowing down after kicking his career into high-gear this year. Following the GRAMMYs ceremony, he’s headed to Europe for concert dates throughout the spring before returning stateside to kick off his North American tour, which is adorably named after his new rescue pup, Roxy. But even that's not all for him.\n\n“I’m going to keep on writing and making new music,” he said. “I’m in the studio every chance I get and hope I can collaborate with some more of my favorite artists.”\n\nLife on the road comes pretty naturally to Khalid, who grew up moving around the United States and even spent six years in Germany due to his mother’s career in the military. The singer has spoken in the past about how his mother, Sergeant First Class Linda Wolfe -- who sang in the Army band before retiring earlier this year after 23 years of service -- has been his biggest musical inspiration, and he can’t wait to take her with him to the GRAMMY Awards in January.\n\n“I wouldn’t be where I am right now if it wasn’t for my mom,” he explained. “The moment is going to be unforgettable for the both of us, and I wouldn’t want anyone else by my side.”\n\nAt the ceremony, the singer and his mom will likely be sharing the red carpet with similarly-named super producer DJ Khaled, and it’s not the first time the two will be crossing paths. But, while Khalid admits that getting mixed up with the “super cool” music mogul can be frustrating at times, he’s confident about making his own name in the business: “Everyone will get the hang of it eventually!”\n\nAnd even after the whirlwind success that came with 2017, when it comes to his music, he’s taking things one step at a time.\n\n“I try not to get too ahead of myself in terms of my career and take in each moment as it comes,” Khalid reflected. “I’m just going to keep creating music, performing and connecting with my fans. I’m really excited about what the future holds and to grow as an individual and as an artist.”\n\nThe GRAMMY Awards air on CBS on Sunday, Jan. 28.\n\nRELATED CONTENT:\n\nREAD: GRAMMYs Snubs and Surprises: Ed Sheeran, Taylor Swift & More!\n\nWATCH: The 10 Best GRAMMY Duets\n\nPICS: Meet All 75 Swoonworthy Guys in Charli XCX's 'Boys' Video -- From Joe Jonas to KAYTRANADA", "images": ["https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-12/1280_khalid_gettyimages-867678168.jpg?h=c673cd1c&itok=y3c1OPpw", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/eto_trending_vanessabryantribute_041320_vidpic.jpg?h=d1cb525d&itok=MkFXHUBX", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_khalid_gettyimages-867678168.jpg?h=c673cd1c&itok=KtgWJ0XP", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_khalid_gettyimages-867678168.jpg?h=c673cd1c&itok=KtgWJ0XP", "keywords": [], "authors": ["Meredith B. Kile"], "canonical_link": "https://www.etonline.com/khalid-reflects-his-five-grammy-nominations-exclusive-92868", "title": "Khalid Reflects on His Five GRAMMY Nominations (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Khalid Reflects on His Five GRAMMY Nominations (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/khalid-reflects-his-five-grammy-nominations-exclusive-92868", "title": "Khalid Reflects on His Five GRAMMY Nominations (Exclusive)", "description": "The 19-year-old artist called his GRAMMY shot all the way back in 2014.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_khalid_gettyimages-867678168.jpg?h=c673cd1c&itok=KtgWJ0XP", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 19-year-old artist called his GRAMMY shot all the way back in 2014.", "title": "Khalid Reflects on His Five GRAMMY Nominations (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Meredith B. Kile‍", "url": "https://www.etonline.com/khalid-reflects-his-five-grammy-nominations-exclusive-92868", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/1280_khalid_gettyimages-867678168.jpg?h=c673cd1c&itok=KtgWJ0XP"}, "description": "The 19-year-old artist called his GRAMMY shot all the way back in 2014.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Music, Features, News, Khalid, Grammys", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}