{"url": "www.elitedaily.com/p/selena-gomezs-reported-reaction-to-justin-biebers-engagement-confirmation-seems-like-idgaf-9717944", "text": "It's been a pretty surprising last few days for fans of Justin Bieber and Selena Gomez, AKA Jelena. Many rooting for the on-again, off-again couple to get back together once and for all are probably just a tad bit shattered now that it's been confirmed that Bieber and Hailey Baldwin are engaged to be married after Bieber's proposal on July 7 during a trip to the Bahamas. But, while we're all over here mourning the loss of the couple that we thought would be endgame, our girl Selena is literally the epitome of the shrugged-shoulders emoji, clearly not caring as much as we all thought she would. And honestly, Selena Gomez's reaction to Justin Bieber's engagement confirmation will probably make you love her even more than you already do, if that's possible.\n\nAccording to E! News, a source told the publication that, although the news of Bieber and Baldwin's engagement was unexpected, Gomez \"doesn't really care\" about her ex-boyfriend's new romance. The source said,\n\nSelena was surprised an engagement happened this quickly but not surprised Justin would do something like this knowing who he is. At the end of the day though she doesn't really care. Selena is totally over him. She had tried again to make it work that last time and it didn't work out.\n\nElite Daily reached out to Gomez's team regarding the report, but has not heard back by the time of publication.\n\nLe sigh. For everyone who knew Justin Bieber and Selena Gomez's relationship, it's a bit sad to hear that these two clearly aren't getting back together, but perhaps that's for the best, considering they are in completely different phases of their lives right now.\n\nCraig Barritt/Getty Images Entertainment/Getty Images\n\nThe source continued, saying, \"Selena is definitely on a different path right now and in a much better place since Justin is out of the picture. Mentally, she is done with him,\" adding that \"she isn't focused on dating as much as she's just really focusing on herself. She's happy right now just spending time with her girlfriends and going to church.\"\n\nChristopher Polk/Getty Images Entertainment/Getty Images\n\nA second source also noted that Gomez is putting her relationship with her ex-boyfriend \"in the past,\" adding that while she's \"very shocked\" to hear about Bieber's whirlwind engagement, she simply \"doesn't care.\"\n\nYasss, girl!\n\n\"Selena knows that Justin makes rash decisions, but wishes them both the best. She is truly focused on herself and Justin is no longer a topic of conversation in her life,\" the second source told E! News.\n\nSorry, Justin. Looks like our girl is just as over you as you are with her.\n\nOn July 10, just days after Bieber's engagement was confirmed, Gomez was seen in New York City wearing gray sweatpants and a black T-shirt that said, \"only the strong survive,\" and let me tell you, it is a mood and I am feeling it. While some might say that this is her way of telling the world that she's a fierce warrior in the midst of all the engagement hubbub, let's be honest: we already knew that.\n\nAnd, considering that we saw her without a care in the world shortly after the news of the engagement actually broke, methinks that she's doing juuuust fine.\n\nOn Sunday, July 8, Gomez's friend and assistant, Theresa Mingus, posted a photo to Instagram showing herself and Gomez hanging out on a yacht, looking like they were living their best life (because spoiler alert: if you're on a yacht, you are UNDOUBTEDLY doing just that):\n\nSo c'mon, fam. It looks like Bieber's quite smitten with Baldwin, and Gomez is living it up with friends and enjoying being single, so I think it's time we give Jelena a rest and set our sights on Jailey.\n\nMaybe it's not what we anticipated the outcome would be for this love triangle, but let's work with what we've got and be happy that everyone involved is happy — or seems to be, at the very least.\n\nLet's all give a big congrats to the happy couple, and an even bigger applause to Selena. You do you, boo!", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2018/7/10/78bad4c6-1143-4028-a3ea-70aa64349926-selenabiebs.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/10/78bad4c6-1143-4028-a3ea-70aa64349926-selenabiebs.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.elitedaily.com/uploads/getty/2018/7/10/2678253d-a03f-437c-a67c-a9432b3095b5-getty-118992049.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/555700cf-c269-4ba5-9ad4-004df0469bc7-getty-1170538224.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2018/7/10/a850b3ce-8f46-4fd3-9946-d54f3fda3039-getty-109496477.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/7136529d-01cd-4144-849c-502e8ab4a6e6-getty-1176988943.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/069fdfe3-d829-477e-9562-dcba704bddcb-getty-530047400.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/10/78bad4c6-1143-4028-a3ea-70aa64349926-selenabiebs.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/selena-gomezs-reported-reaction-to-justin-biebers-engagement-confirmation-seems-like-idgaf-9717944", "title": "Selena Gomez's Reported Reaction To Justin Bieber's Engagement Confirmation Seems Like IDGAF", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/selena-gomezs-reported-reaction-to-justin-biebers-engagement-confirmation-seems-like-idgaf-9717944", "type": "article", "title": "Selena Gomez Was Reportedly \"Surprised\" By Justin Bieber's Engagement, But She Still DGAF", "description": "It's been a pretty surprising last few days for fans of Justin Bieber and Selena Gomez, AKA Jelena. Many rooting for the on-again, off-again couple to get back together once and for all are probably just a tad bit shattered now that it's been…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/10/78bad4c6-1143-4028-a3ea-70aa64349926-selenabiebs.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It's been a pretty surprising last few days for fans of Justin Bieber and Selena Gomez, AKA Jelena. Many rooting for the on-again, off-again couple to get back together once and for all are probably just a tad bit shattered now that it's been…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}