{"url": "https://theneptunes.org/2017/10/j-balvin-talks-about-his-friendship-with-pharrell-williams/", "text": "\n\nLos Angeles fans were in for a big surprise Sunday night when BIA and Pharrell Williams joined J Balvin at his sold-out concert. The three joined forces for the first concert performance of “Safari.” The Colombian singer and Williams have been friends for a while and we’ve all been following this bromance since day one. “It is a blessing anytime I get to work with Pharrell. He has been a great teacher, in music, fashion, my career and more,” the singer tells E! News.\n\n\n\n“Having him and BIA join me on the recording of ‘Safari‘ was a dream come true, and I’m grateful that we all finally got the chance to perform the song together in concert.” The Energía Tour, presented by Buchanan’s, might just bring more celebrity guests since we know Balvin’s got some pretty famous friends. The 32-year-old singer continues to work with whisky brand for their #EsNuestroMomento campaign. Back in March, the singer gave fans an opportunity to collaborate with him. Balvin’s humble approach and constant evolution might just be the secret sauce of his unprecedented success seeing as “Mi Gente” is about to join the Billion club on YouTube and Beyoncé remixed the Balvin and Willy William smash hit. The track just skyrocketed to No. 3 on Billboard Hot 100.\n\n*eonline.com", "images": ["https://img6.uploadhouse.com/fileuploads/25518/255183868d381c283abb0746db98235232d490bd.jpg", "https://img7.uploadhouse.com/fileuploads/25518/25518387e2d27e652d25808a9154deece5416291.jpg"], "top_img": "https://img6.uploadhouse.com/fileuploads/25518/255183868d381c283abb0746db98235232d490bd.jpg", "keywords": [], "authors": ["Author Archive", "Tahir Hussain"], "canonical_link": "https://theneptunes.org/2017/10/j-balvin-talks-about-his-friendship-with-pharrell-williams/", "title": "The Neptunes #1 fan site, all about Pharrell Williams and Chad Hugo", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "generator": "WordPress 4.9.3"}, "movies": [], "publish_date": null, "source": "https://theneptunes.org", "summary": ""}