{"url": "caffertyfile.blogs.cnn.com/2011/09/27/has-president-obama-made-racism-worse/", "text": "FROM CNN's Jack Cafferty:\n\nPresident Obama has made racism worse in America.\n\nSo says the African-American actor Morgan Freeman. He told CNN's Piers Morgan that the tea party's opposition to Mr. Obama, the nation's first black president, is rooted in racism.\n\nFreeman claims tea partiers will do whatever it takes to \"get this black man out of here.\"\n\nHe adds that the tea party shows the \"weak, dark underside of America,\" and that \"we're supposed to be better than that.\"\n\nThe only black Republican candidate for president pushed right back. Businessman and tea party member Herman Cain says most of the people who criticize the movement have never been to a tea party rally.\n\nCain says \"name calling\" will continue because opponents don't know how to stop the tea party movement.\n\nMeanwhile - with black leaders grumbling that Mr. Obama hasn't done enough about staggering black unemployment - the president has evoked language that sounds a whole lot like the civil rights era.\n\nHe told the Congressional Black Caucus to march with him: \"Take off your bedroom slippers, put on your marching shoes.\"\n\nAmericans are split on how Mr. Obama's presidency has changed race relations in the U.S.\n\nA recent USA Today/Gallup poll shows 35% of those surveyed said race relations have improved, while 23% say they've gotten worse under President Obama.\n\n41% percent see no change.\n\nBack in 2008, when the nation voted for \"hope and change,\" Americans had a much rosier view of what this president would do for race relations.\n\nGallup found that the day after Mr. Obama was elected, a whopping 70% predicted race relations would improve.\n\nHere’s my question to you: Has President Obama made racism worse?\n\nInterested to know which ones made it on air?\n\nRick:\n\nNot really, but a lot of people have grown weary of all the \"race card\" excuses for Obama's very poor performance. And those critical of his performance are really sick of being labeled racist. Presidents are subject to criticism of their actions, policies, and coordination with Congress. This president gets no \"get out of jail free\" card for being black.\n\nCharles:\n\nYes and no. He has made racism better by allowing us to talk about the issues, debate them and see a black man as a man. We are not there yet completely, but closer. And yes, he has made it worse: just look at the type of president that he has been. Awful. I say this as a black man who voted for him. Maybe we as a nation and we here in the black community might have been better off if Hillary had won or if Colin Powell had been the first black president.\n\nDebbie on Facebook:\n\nNo, the president has not made racism worse. People were already racist and when a man of color became president of \"their country\", they stopped trying to hide what was already there.\n\nBarbara:\n\nSomehow his being elected brought the worst out of people. They are having a hard time hiding their racism - just the opposite of what I hoped would happen. It’s a very sad state of affairs. No one can convince me that his race doesn't have a lot to do with the Republicans’ hatred. A lot of these good Christian, family values people are indeed racist.\n\nBob:\n\nObama has made everything worse; I think he does it on purpose.\n\nBilly:\n\nHerman Cain's success is proof that the economy is more of an enemy than racism. So in a weird and unanticipated way, he has actually made things better.\n\nM.:\n\nYou have got to be kidding me with that loaded question. Short answer: No. He's bi-racial, and I think that many of the Caucasian people (Republicans and Tea Partiers) have a problem with his skin color. He didn't make it worse by running for President. This is one of the worst questions you have ever asked.", "images": ["http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/right_rail/grey_corner_BL.gif", "https://pixel.wp.com/b.gif?v=noscript", "http://pbs.twimg.com/profile_images/67228968/icon.jackcafferty_normal.png", "http://i.cdn.turner.com/cnn/.element/img/3.0/1px.gif", "http://newspulse.cnn.com/images/no_image_cnn_90x51.jpg", "http://i2.cdn.turner.com/cnn/2011/images/08/15/tzsrch.jack.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/sect/blogs/ac360/home.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/icons/btn_close.gif", "http://i2.cdn.turner.com/cnn/2012/images/09/05/tzsrch.nasdaq.jpg", "http://i2.cdn.turner.com/cnn/2012/images/02/07/sitroom-logo-new-tzsrch.jpg", "http://i2.cdn.turner.com/cnn/2012/images/09/05/2012.jpg", "http://i2.cdn.turner.com/cnn/2011/images/08/12/tzsrch.obama.jpg", "http://i.cdn.turner.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/right_rail/grey_corner_TL.gif"], "top_img": "http://newspulse.cnn.com/images/no_image_cnn_90x51.jpg", "keywords": [], "authors": [], "canonical_link": "http://caffertyfile.blogs.cnn.com/2011/09/27/has-president-obama-made-racism-worse/", "title": "Has President Obama made racism worse?", "meta_data": {"title": "Has President Obama made racism worse?", "description": "FROM CNN's Jack Cafferty: President Obama has made racism worse in America. So says the African-American actor Morgan Freeman. He told CNN's Piers Morgan that the tea party's opposition to Mr. Obama, the nation's first black president, is rooted in racism.", "keywords": "president barack obama, race, race relations, cnn's jack cafferty", "google-site-verification": "YJKIaiHoJma-AbxboXeaQoCag0GsxoUgUE_-fEToVx8", "generator": "WordPress.com", "application-name": "Cafferty File", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Tell Jack how you really feel", "msapplication-task": "name=Subscribe;action-uri=https://caffertyfile.blogs.cnn.com/feed/;icon-uri=https://s1.wp.com/i/favicon.ico", "og": {"title": "Has President Obama made racism worse?", "url": "https://caffertyfile.blogs.cnn.com/2011/09/27/has-president-obama-made-racism-worse/", "type": "article", "description": "FROM CNN's Jack Cafferty:\r\n\r\nPresident Obama has made racism worse in America.\r\n\r\nSo says the African-American actor Morgan Freeman. He told CNN's Piers Morgan that the tea party's opposition to Mr. Obama, the nation's first black president, is rooted in racism.", "image": "http://newspulse.cnn.com/images/no_image_cnn_90x51.jpg"}, "fb": {"admins": 690014395, "app_id": 80401312489}}, "movies": [], "publish_date": 1317052800.0, "source": "http://caffertyfile.blogs.cnn.com", "summary": ""}