{"url": "https://globalnews.ca/news/3608867/game-of-thrones-director-ed-sheeran/", "text": "SPOILER ALERT: Do not read on unless you’ve watched the Game of Thrones Season 7 premiere.\n\nWhile many Game of Thrones fans had different reactions to Ed Sheeran’s cameo in the Season 7 premiere, Game of Thrones director Jeremy Podeswa had nothing but good things to say about the singer.\n\nThe Thinking Out Loud singer made a cameo appearance as a Lannister soldier with his campfire singing catching the attention of Arya Stark (Maisie Williams) who was passing by but then cautiously joined their party for dinner.\n\n“It was lovely working with Ed,” Podeswa told Variety. “He is one of the nicest guys in the world, and he really is one of the guys. He’s lovely, he’s a team player, he wants to do a good job, he takes direction, he’s very open.”\n\nREAD MORE: Ed Sheeran’s ‘Game of Thrones’ cameo receives mixed reviews from fans\n\nThe episode’s director continued: “He’s a big fan of the show and he was really excited to be a part of it. I think his lovely voice was used to great effect and he just has a really nice presence.”\n\nStory continues below advertisement\n\nPodeswa also said that Sheeran “blends into the world of the show in a nice way” and that if people didn’t know who the singer was, “nobody would even blink about his presence on the show.”\n\nSheeran’s appearance as a Lannister soldier drew a mix of criticism and praise from fans of the show, including some calling the show “less authentic” due to his cameo.\n\nPodeswa told Newsweek that he was “quite surprised” about the reaction to Sheeran’s appearance.\n\n“I know he’s very well known and a successful singer but you’re in the bubble of the show — the cast are well known too, everybody is really well known… none of them can walk down the street without being followed,” Podeswa said. “I think people interrogated it too much, they’re bringing so much of his [superstar] presence into the thing which is far beyond what anybody was thinking going into it. He is known to the producers of the show and some of the cast, and he’s a gigantic fan of the show.”\n\nREAD MORE: ‘Game Of Thrones’ actor Kit Harington speaks out about ‘a**holes’ who leak spoilers\n\nThe Castle on the Hill singer isn’t the first musician to make a cameo appearance on the HBO show. Gary Lightbody of Snow Patrol, Will Champion from Coldplay, Sigur Rós band members Orri Páll Dýrason, Georg Hólm and Jón Þór Birgisson and Brann Dailor, Bill Kelliher and Brent Hinds of the American heavy metal band Mastodon, have previously appeared on Game of Thrones.\n\nSo I did my scene this morning for @GameOfThrones. I looked like this. Can't say much just it's no pivotal role. Fun! pic.twitter.com/aV9ii7X1 — gary lightbody (@garysnowpatrol) July 23, 2012\n\nREAD MORE: New ‘Game of Thrones’ Season 7 trailer: Winter is coming\n\nAfter Sheeran’s appearance on the show as a singing soldier became a buzzed-about topic on social media, his Twitter account suddenly vanished.\n\nStory continues below advertisement\n\nThe Twitter disappearance was short-lived because he is now back online but all of his tweets since April 2015 have been removed and the singer’s more than 19 million followers have been reduced to a few thousand.\n\nThe 26-year-old told Britain’s Sun tabloid this month that he was no longer using his Twitter account aside from posting his Instagram pictures to it. He called Twitter a platform for “saying mean things” and was trying to “work out why people dislike me so much.”\n\nSheeran took to Instagram on Wednesday to deny that his Twitter absence had anything to do with the backlash from his Game of Thrones appearance.\n\n“I came off Twitter coz I was always intending to come off Twitter, had nothing to do with what people said about my Game of Thrones cameo,” the singer wrote. “Why the hell would I worry what people thought about that. It’s clearly f***in’ awesome.”\n\nThe HBO drama’s seventh-season premiere last weekend drew a record-setting 10.1 million viewers, according to Nielsen company figures released Tuesday.\n\n—With files from the Associated Press", "images": ["https://shawglobalnews.files.wordpress.com/2016/07/katie_scott_img_8302-e1585682373283.png?w=136&h=136&crop=1", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert-red.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield-blue.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-corus.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005670&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://shawglobalnews.files.wordpress.com/2017/07/nyet107-717_2017_171921_high.jpg?quality=70&strip=all&w=650", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/morty.svg", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-black.svg", "https://shawglobalnews.files.wordpress.com/2017/07/nyet107-717_2017_171921_high.jpg?quality=70&strip=all&w=650&h=379&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-mobile.svg"], "top_img": "https://shawglobalnews.files.wordpress.com/2017/07/nyet107-717_2017_171921_high.jpg?quality=70&strip=all&w=650&h=379&crop=1", "keywords": [], "authors": ["Katie Scott", "Global News", "Posted July", "Updated July"], "canonical_link": "http://globalnews.ca/news/3608867/game-of-thrones-director-ed-sheeran/", "title": "‘Game of Thrones’ director reacts to Ed Sheeran cameo backlash", "meta_data": {"theme-color": "#133F6F", "viewport": "width=device-width, initial-scale=1.0", "title": "‘Game of Thrones’ director reacts to Ed Sheeran cameo backlash - National | Globalnews.ca", "description": "'Game of Thrones' director Jeremy Podeswa said that Ed Sheeran \"blends into the world of the show in a nice way.\"", "keywords": "ed sheeran, ed sheeran game of thrones, ed sheeran GoT, ed sheeran twitter, game of thrones cameos, game of thrones director, game of thrones ed sheeran, GoT, GoT cameos, GoT ed sheeran, GoT HBO, Entertainment", "news_keywords": "ed sheeran, ed sheeran game of thrones, ed sheeran GoT, ed sheeran twitter, game of thrones cameos, game of thrones director, game of thrones ed sheeran, GoT, GoT cameos, GoT ed sheeran, GoT HBO, Entertainment", "article": {"tag": "Entertainment"}, "og": {"title": "‘Game of Thrones’ director reacts to Ed Sheeran cameo backlash", "description": "'Game of Thrones' director Jeremy Podeswa said that Ed Sheeran \"blends into the world of the show in a nice way.\"", "type": "article", "url": "https://globalnews.ca/news/3608867/game-of-thrones-director-ed-sheeran/", "site_name": "Global News", "image": "https://shawglobalnews.files.wordpress.com/2017/07/nyet107-717_2017_171921_high.jpg?quality=70&strip=all&w=650&h=379&crop=1"}, "twitter": {"title": "‘Game of Thrones’ director reacts to Ed Sheeran cameo backlash", "url": "https://globalnews.ca/news/3608867/game-of-thrones-director-ed-sheeran/", "description": "'Game of Thrones' director Jeremy Podeswa said that Ed Sheeran \"blends into the world of the show in a nice way.\"", "card": "summary_large_image", "site": "@globalnews", "image": "https://shawglobalnews.files.wordpress.com/2017/07/nyet107-717_2017_171921_high.jpg?quality=70&strip=all&w=650&h=379&crop=1"}, "fb": {"app_id": 318812448281278, "pages": 91251252807}, "application-name": "Global News", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://globalnews.ca/feed/;icon-uri=https://secure.gravatar.com/blavatar/134ef81f5668dc78080f6bd19ca2310b?s=16"}, "movies": [], "publish_date": null, "source": "https://globalnews.ca", "summary": ""}