{"url": "https://www.romper.com/p/jill-duggar-might-have-a-nose-ring-fans-are-freaking-out-5958297", "text": "Counting On fans, you might want to sit down for this one. During Thanksgiving weekend, some fans took to Reddit to speculate that Jill Duggar *might* have a nose ring. Yes, you read that correctly: a nose ring. Given Jill's ultra-conservative background, people are downright stunned that she might be sporting a face piercing, an accessory that seems totally off-brand for a Duggar. In fact, I can barely believe it myself. So, is Jill the new rebel Duggar?\n\nThese days, the Duggar ladies are keeping fans on their toes. Shortly after Jinger Duggar's marriage to Jeremy Vuolo in November 2016, she shocked fans by wearing pants. As Counting On viewers already know, Jim Bob and Michelle Duggar don't encourage their daughters to wear pants due to religious reasons. Although a lot of fans speculated that Jinger would be the first Duggar daughter to break away from Jim Bob and Michelle's conservative teachings, many were still stunned by the move. It's not everyday that you see a Duggar woman wearing trousers, that's for sure.\n\nAnd just when you thought things couldn't get any more wild, Jill was spotted in pants on Nov. 11. This sighting really rocked the Counting On universe, especially since Jill is arguably the most traditional out of all the Duggar kids. Not to mention she's married to Derick Dillard, a very religious and conservative guy who recently caught flak for tweeting transphobic remarks to Jazz Jennings, the star of TLC's I Am Jazz, according to Us Weekly. Fans wondered if Jill donned the pants to deflect from Dillard's controversial behavior, or if it was more of a personal decision to reflect her growing independence. Either way, the move caused a big stir.\n\nThen on Sunday, the Dillard Family Facebook page shared a very interesting picture of Jill holding her second son, Samuel. By the looks of it, Jill is showing off a nose ring in the family pic. You can get a better gander of the supposed nose ring if you zoom in, by the way.\n\nYep, I never thought I'd one day be zooming in on a Duggar's nose to find evidence of a nose ring. I guess this is very on-brand for 2017, right?\n\nFollowing the picture, fans took to the Counting On Reddit page to discuss the alleged piercing. One Redditor said, \"She was wearing pants. Now her nose is pierced? WHAT IS NEXT?\" Another added: \"I thought it was a shadow at first but when I zoomed in - it looks like a nose piercing. I just can't imagine that she has a nose piercing!\"\n\nAnd my personal favorite: \"Everything I know is a lie.\"\n\nOf course, other Redditors had different theories about the picture. Some people believe the nose ring is actually a pimple, a mole, or a simple trick of the eye. A fan argued, \"It looks like a huge covered up pimple to me. Definitely not a nose piercing.\" Another user said: \"If anything it looks like a mole.\"\n\nSo, I'm not sure what to believe here. In a sense, it's plausible that Jill would have a nose ring, because the Duggars aren't against piercings. In fact, a lot of the Duggar children get their ears pierced when they're just babies. An ear piercing is a big difference from a nose piercing, however, and it seems to be a big leap for someone who just started to wear jeans.\n\n*If* Jill did pierce her nose, I have a few theories as to why. For starters, she could be trying to distract from Dillard's recent behavior on social media. Dude is still sharing transphobic content on Twitter, despite the major backlash from fans and TLC. Second, this could be further evidence that Jill is starting to come into her own. Maybe she's trying out new styles, which is totally OK. And lastly, some people suspect that Jill is trying to fit in with her new friends at Cross Church in Arkansas. Some fans pointed out that Cross Church puts forth a more modern and relaxed vibe, which could explain Jill's recent changes. It's a possible theory.\n\nEither way, fans won't know if Jill has a nose ring unless she confirms it or shares more telling photos on social media. Until then, people will just have to speculate.\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/13/db97fe4c-15fe-48ec-af66-483d7f8bace0-screen-shot-2020-04-13-at-101140-am.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/11/27/01f0d321-0e29-47fe-81be-e2c5f0f6914d-screen-shot-2017-11-27-at-13555-pm.png?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/dccb0cb8-ff80-40c9-883c-2ef27b22eac5-gallery_princess_ariel_1_bc7355f9.jpeg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/f0ae15b8-f1c5-4b45-8fcc-fb00d5adfdc0-screen-shot-2020-04-10-at-125658-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2017/11/27/01f0d321-0e29-47fe-81be-e2c5f0f6914d-screen-shot-2017-11-27-at-13555-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/27/01f0d321-0e29-47fe-81be-e2c5f0f6914d-screen-shot-2017-11-27-at-13555-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/jill-duggar-might-have-a-nose-ring-fans-are-freaking-out-5958297", "title": "Jill Duggar Might Have A Nose Ring, & Fans Are Freaking Out", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/jill-duggar-might-have-a-nose-ring-fans-are-freaking-out-5958297", "type": "article", "title": "Jill Duggar Might Have A Nose Ring, & Fans Have So Many Feelings About It", "description": "Counting On fans, you might want to sit down for this one. During Thanksgiving weekend, some fans took to Reddit to speculate that Jill Duggar *might* have a nose ring. Yes, you read that correctly: a nose ring. Given Jill's ultra-conservative…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/27/01f0d321-0e29-47fe-81be-e2c5f0f6914d-screen-shot-2017-11-27-at-13555-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Counting On fans, you might want to sit down for this one. During Thanksgiving weekend, some fans took to Reddit to speculate that Jill Duggar *might* have a nose ring. Yes, you read that correctly: a nose ring. Given Jill's ultra-conservative…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}