{"url": "www.independent.co.uk/life-style/fashion/leonardo-dicaprio-eyebrow-artist-oscars-tobey-maguire-flight-la-a7601731.html", "text": "How much effort do you put into the appearance of your eyebrows? Tinting? Threading? Pencilling in? Plucking the strays? Or perhaps nothing at all?\n\nWell if you’re an A-lister with the eyes of the world watching, it seems no length is too extreme to ensure your brows are perfect.\n\nAustralian eyebrow-artist to the stars Sharon-Lee Hamilton was flown from Sydney to Los Angeles to tend to a select few celebrities’ brows before the 2017 Oscars.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nWe previously reported that Leonardo DiCaprio was one member of the Hollywood elite who flew Hamilton the 7,500 across the Pacific Ocean, but we have since learnt that this was incorrect.\n\nHamilton has previously revealed that when travelling on request, her costs are covered.\n\nSo with Hamilton’s signature brow consultation costing $200 (£124) for men, it’s safe to say the celebs will have paid a small fortune for their perfect Oscars brows.\n\nHamilton’s website states that the treatment includes: “A full face read, followed by an all-inclusive service that comprises any tints, stains or lightening required in conjunction with your full expert shaping.\n\n“Included is an eyelash tint as well as a glycolic infused collagen eye treatment plus a full heated paraffin hand treatment followed by a light eye makeup application.”\n\nGuests who visit Hamilton in one of her salons can enjoy a complimentary beverage including Champagne, wine and coffee.\n\nHowever it’s likely that Champagne was not in short supply when Hollywood’s elite were getting ready for the biggest night of the year.\n\nWhilst their outfits were critiqued to the nth degree, eyebrows suffered less scrutiny.\n\nHamilton has not revealed all the celebrities she treated before the Oscars, but her previous clients include Beyoncé, George Clooney, Kim Kardashian, Mary-Kate and Ashley Olsen, Serena Williams and Princess Mary of Denmark.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/02/28/17/oscars.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/02/28/17/oscars.jpg", "keywords": [], "authors": ["Rachel Hosie"], "canonical_link": "https://www.independent.co.uk/life-style/fashion/leonardo-dicaprio-eyebrow-artist-oscars-tobey-maguire-flight-la-a7601731.html", "title": "A-listers flew eyebrow artist 7,500 miles to do their brows for the Oscars", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/life-style/fashion/leonardo-dicaprio-eyebrow-artist-oscars-tobey-maguire-flight-la-a7601731.html", "title": "A-listers flew an 'eyebrow artist' 7,500 miles to do their brows for the Oscars", "description": "That's a long way to go for the sake of eyebrows", "updated_time": "2017-03-03T08:30:50+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/02/28/17/oscars.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5342899272001_5342874400001.mp4?pubId=624246174001&videoId=5342874400001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7601731"}, "description": "How much effort do you put into the appearance of your eyebrows? Tinting? Threading? Pencilling in? Plucking the strays? Or perhaps nothing at all? Well if you’re an A-lister with the eyes of the world watching, it seems no length is too extreme to ensure your brows are perfect. Australian eyebrow-artist to the stars Sharon-Lee Hamilton was flown from Sydney to Los Angeles to", "keywords": "Oscars 2017, eyebrows, Celebrities, Fashion, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Oscars 2017", "published_time": "2017-02-27T12:00:00+00:00", "modified_time": "2017-03-03T08:30:50+00:00", "section": "Fashion", "subsection": "Video", "author_name": "Rachel Hosie", "content_type": "story", "word_count": 358, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 3}, "twitter": {"title": "A-listers flew an 'eyebrow artist' 7,500 miles to do their brows for…", "description": "How much effort do you put into the appearance of your eyebrows? Tinting? Threading? Pencilling in? Plucking the strays? Or perhaps nothing at all? Well if you’re an A-lister with the eyes of the", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1488196800.0, "source": "http://www.independent.co.uk", "summary": ""}