{"url": "https://www.thehollywoodgossip.com/2017/06/chloe-lukasiak-rubs-dance-moms-return-in-abby-lee-millers-face/", "text": "Abby Lee Miller is on her way out.\n\nAnd one of her sworn enemies is on her way back.\n\nWe should probably clarify that second statement, huh? Considering how many enemies Miller has racked up over the years.\n\nChloe Lukasiak, who left Dance Moms in 2014 amidst an ongoing feud with her the notorious dance instructor, has announced that she'll return to the Lifetime series for Season 8.\n\nBy sheer coincidence (or the opposite of that, really), Miller will NOT be a part of Season 8.\n\nShe angrily announced her resignation from the program in March, and was then sentenced to over a year in prison a couple months later for her role in deceiving the government about her finances.\n\nDuring her run on the show, Miller often bullied Lukasiak to the point of tears.\n\nWe were happy when Chloe chose to leave and now we're happy that she's rubbing her return in Miller's face.\n\nMore or less, at least.\n\n\"It was pretty insane and out of nowhere,\" Lukasiak tells Seventeen of why she's chosen to make her comeback, emphasizing that she hasn't seen Abby in a long time and gushing over her replacement.\n\n\"We have Cheryl Burke. She is so amazing. She's been in the industry a long time. She was on Dancing with the Stars.\n\n\"She really got us and took us under her wing.\"\n\nHow would Chloe compare Burke to Miller? Are the two equally competitive?\n\n\"She's pretty competitive, but she really cares about us,\" Chloe said, throwing some quality subtle shade in Miller's direction.\n\nHow does it feel to be back on a team?\n\n\"I was thrilled to be dancing with my friends again,\" Chloe told the publication, adding:\n\n\"I competed for a year without them, but it wasn't the same. And there are some new faces on the show this season.\"\n\nLifetime released an extended trailer for Season 8 (below) earlier this week, making it clear that Miller's presence will still be felt on the series and that some major drama is on tap.\n\n\"You can expect... lots of crying,\" Lukasiak teases of what's to come, expounding as follows:\n\n\"I cried so much. I was like, 'I'm such a crybaby.' And all of the dances I've done on the most recent season I've really loved. The last number of the season is amazing.\n\n\"But you have to keep an open mind this season because it does change a lot and it's going to be a little different than what fans are used to.\n\n\"I think the change was good for all of us.\"\n\nWhile you wait to watch Dance Moms online and/or on television after it returns in August, Lukasiak would also like to remind you that she has a book coming out.\n\nIt’s titled “Girl on Pointe: Chloe’s Guide to Talking on the World” and it will be released on January 23, 2018.\n\nChloe will delve into her history on Dance Moms in the memoir, which she previews in this way:\n\n“It’s kind of an inspiration and advice book, so I think it’s for anyone who needs help, or wants to know they’re not alone in these teen years.\n\n\"I give advice about how to get through a bad day or a bad week, and how I deal with that.”\n\nWe look forward to reading it.\n\nAnd we look forward to your Dance Moms return, Chloe.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--g3uEqjlP--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498231116/chloe-lukasiak-picture.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--g3uEqjlP--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498231116/chloe-lukasiak-picture.png", "keywords": [], "authors": ["Hilton Hater"], "canonical_link": "https://www.thehollywoodgossip.com/2017/06/chloe-lukasiak-rubs-dance-moms-return-in-abby-lee-millers-face/", "title": "Chloe Lukasiak Rubs Dance Moms Return in Abby Lee Miller's Face", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/06/chloe-lukasiak-rubs-dance-moms-return-in-abby-lee-millers-face/", "title": "Chloe Lukasiak Rubs Dance Moms Return in Abby Lee Miller's Face", "description": "Chloe Lukasiak has basically issued a giant EFF YOU to Abby Lee Miller. She explains here why she's coming back to Dance Moms.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--qCJFitm4--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497361545/slideshows/13-scandals-that-rocked-reality-tv.jpg", "type": "image/jpeg", "width": 630, "height": 438}, "video": {"identifier": "https://www.thehollywoodgossip.com/videos/dance-moms-season-8-promo-all-the-tears-all-the-fights-all-the-r/", "type": "text/html"}}, "article": {"published_time": "2017-06-23T11:44:03-04:00", "modified_time": "2017-06-23T11:44:03-04:00", "tag": "Reality TV", "author": "Hilton Hater"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Chloe Lukasiak Rubs Dance Moms Return in Abby Lee Miller's Face", "description": "Chloe Lukasiak has basically issued a giant EFF YOU to Abby Lee Miller. She explains here why she's coming back to Dance Moms.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--g3uEqjlP--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498231116/chloe-lukasiak-picture.png"}}, "description": "Chloe Lukasiak has basically issued a giant EFF YOU to Abby Lee Miller. She explains here why she's coming back to Dance Moms."}, "movies": [], "publish_date": 1498232643.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}