{"url": "https://tv.avclub.com/the-mindy-project-danny-and-mindy-1798180360", "text": "TV Reviews All of our TV reviews in one convenient place. Prev Next View All\n\nThe Mindy Project Season 2 A \"Danny And Mindy\" Episode 22\n\n“I love romantic comedies. I feel almost sheepish writing that, because the genre has been so degraded in the past twenty years or so that admitting that you like these movies is a form of mild stupidity… I enjoy watching people fall in love on-screen so much that I can suspend my disbelief for the contrived situations that only happen in the heightened world of romantic comedies.” —Mindy Kaling, Is Everyone Hanging Out Without Me?\n\nAt the end of its second season, The Mindy Project has become one of those shows that inspires strong reactions on either side, and very few in the middle. If you scout out Mindy Project reviews (wait, I’ve done it for you!), you’ll find both total pans (“The Mindy Project fails at everything it attempts”) and complete raves (“Why only an idiot would miss out on TV’s funniest comedy”). I fall closer to the latter on the scale, but I understand the former. I don’t really care if Mindy’s likable or not, as long as she’s entertaining, but some of her actions are insane (tracing her one-night stand to his workplace, a first-grade classroom) or ignorant (a medical doctor who doesn’t know what “condo” stands for?) enough to take the viewer out of the actual show to ponder, “Why am I watching this person?” When the show does stumble (“L.A.,” or the recent ill-scheduling of “Girl Crush”), it takes at least a week or so to right itself.\n\nAdvertisement\n\nBut when it realigns, The Mindy Project becomes one of the most enjoyable comedies on TV. Todd VanDerWerff points out that although the show seems to be in a constant state of transition, at least its trajectory is skewing upward, with a big leap forward between this season and last. I would probably watch it for the one-liners and absurdist asides (like the stalker raccoon) alone, but I also appreciate Mindy Kaling’s overall mission: To draft her own brand of romantic comedy. From the show’s first episodes, it established that Dr. Mindy Lahiri only wants to be Meg Ryan in a movie with Tom Hanks, as idealistic and unrealistic as that sounds. Her real-life counterpart has studied these rom-com tropes as well, so nods to the Nora Ephron canon (like “You’ve Got Sext”) abound in her scripts. She’s writing within the mold while redefining it: The saga of Mindy and Danny has contained some of the show’s finest work, as a hot in-air kiss led to a short yet delightful relationship, a too-quick and devastating breakup, and a hesitant walk toward each other again.\n\nHeading into the finale, I fully expected Mindy and Danny to end up together (the episode title is a dead giveaway), but wondered how Kaling would make it memorable, meaningful, and most of all, funny. Fortunately, she pulled off this particular hat-trick. The episode features an absolute treasure trove of hilarious lines (I could list them all in stray observations, but that would be this entire review) strewn throughout the plot that finally brings Mindy and Danny together. This storyline not only utilizes the entire supporting cast for once (Zoe Jarman, we hardly knew ye), but it also uses Kaling’s rom-com curation as an actual plotting device. Pile on devastating performances by Kaling and Chris Messina, especially, and you have one of my favorite episodes of the year.\n\nAdvertisement\n\nDanny pretending to be Mindy’s mysterious train admirer honors You’ve Got Mail, but also The Shop Around The Corner, the movie on which it was based. He knows her well enough to know that the promise of perfect romance will be enough to make her dump her real relationship with Detective Charlie. Danny suggests they meet on the top of the Empire State Building—add An Affair To Remember by way of Sleepless In Seattle—where he will reveal that he has loved her all along. After a slight derail, he visits her when she’s sick (You’ve Got Mail again), while offering to watch the ultimate film study in friendship-leading-to-romance: When Harry Met Sally (He: “I’ll order whatever gave her an orgasm!” She: “You paraphrased one of the most famous lines pretty well!”). Then, in a Danny voiceover, he takes her all over New York, “visiting any place that Meg Ryan ever laugh-cried.”\n\nI cite Messina’s performance because although he tells Morgan and Tamra and Mindy his true feelings this episode, he has not voiced them since the breakup. But for the last four or five episodes, we still have known—by his frequent smoldering looks, attempts to work his way back into Mindy’s life, and just his ready acceptance to go get breakfast with her and be late for work.\n\nWhen the entire office staff gets pulled in to lead Mindy and Danny back to each other, it works so well I wish they’d been used more throughout the entire season. Morgan has always been the office’s unsung MVP, as he figures out Danny’s secret plan (Danny asks, “How did you figure it out?”, then realizes he’s talking to Morgan: “How did you figure it out?”). Jeremy was awesome with his waivers, as was Peter with his final pep talk this season as he proves to Mindy that Danny still loves her.\n\nSo Mindy and Danny both race to the Empire State, and in one of my favorite bits of the episode, Danny gets hit by a car, yet still hobbles off. This is a hilarious nod to An Affair To Remember (which I will not spoil in case you haven’t seen it, but really, you should see it). Danny and Mindy reunite, and all is right with the sitcom world.\n\nAdvertisement\n\nIt’s such a perfect finale, I almost wish the show hadn’t been renewed. But then there would be no more Mindy Project, which would be a real disappointment. That’s the thing about rom-coms: The ending is always the same. But Mindy and Danny’s journey to get there was such an enjoyable trip. The challenge for season three will be to keep the momentum going into Danny and Mindy’s actual relationship, without contrived breakups or third-party romantic obstacles. This finale points to the possibility that The Mindy Project could pull it off.\n\nFinale grade: A\n\nSeason grade: B\n\nStray observations:\n\nOn the train, Mindy’s coworkers are having a boring conversation about street mimes: “Mimes don’t even talk!”\n\nFor the record, Katie Holmes is six months older than Mindy Kaling.\n\nI fervently hope Tim Daly is on the list for Emmy-nominated guest stars this year. Even his final scene is killer: He chastises Mindy for describing herself as a prostitute again (she shakes her head and agrees, “I know, I know”), then walks out of their breakup like a boss without ever acknowledging that he may have any flaws. I miss him already.\n\nLoved Morgan’s dawning look of realization about Mindy’s “Mindy2ndaccount@hotmail” email address. And his sarcastic nods to Danny about honesty.\n\nAlso, Beverly covering her ears so she won’t have to hear Jeremy’s catfish story about the man with no torso again.\n\nThe title of Danny’s fake emails to Mindy: “what if… ,” “hello,” “today,” “coffee,” “good times.”\n\nMorgan explains why Mindy should know Danny loves her: “He laughs at all of your jokes, and let’s face it, comedy is not your strong suit.”\n\nThe elevator guy sends Mindy up 104 floors seconds before the elevators start working again.\n\n“You’re killing me, Bradley Cooper! What is this, a 20-piece suit?”\n\n“Danny, who did I mail my underwear to?”\n\nI starting reviewing The Mindy Project about midway through this season; I was not a huge fan of the show’s early episodes, but by the time Adam Pally showed up, it began to win me over. It was a lot of fun to write about; thanks for reading!", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dbrlhkynhfyllzttychd.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dbrlhkynhfyllzttychd.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/the-mindy-project-danny-and-mindy-1798180360", "title": "The Mindy Project: “Danny And Mindy”", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "TV, The Mindy Project, Recap, TV Club", "news_keywords": "TV, The Mindy Project, Recap, TV Club", "twitter": {"url": "https://tv.avclub.com/the-mindy-project-danny-and-mindy-1798180360", "card": "summary_large_image", "site": "AVTVClub", "title": "The Mindy Project: “Danny And Mindy”", "description": "“I love romantic comedies. I feel almost sheepish writing that, because the genre has been so degraded in the past twenty years or so that admitting that you like these movies is a form of mild stupidity… I enjoy watching people fall in love on-screen so much that I can suspend my disbelief for the contrived situations that only happen in the heightened world of romantic comedies.”", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dbrlhkynhfyllzttychd.jpg"}, "description": "“I love romantic comedies. I feel almost sheepish writing that, because the genre has been so degraded in the past twenty years or so that admitting that you like these movies is a form of mild stupidity… I enjoy watching people fall in love on-screen so much that I can suspend my disbelief for the contrived situations that only happen in the heightened world of romantic comedies.”", "og": {"title": "The Mindy Project: “Danny And Mindy”", "type": "article", "url": "https://tv.avclub.com/the-mindy-project-danny-and-mindy-1798180360", "description": "“I love romantic comedies. I feel almost sheepish writing that, because the genre has been so degraded in the past twenty years or so that admitting that you like these movies is a form of mild stupidity… I enjoy watching people fall in love on-screen so much that I can suspend my disbelief for the contrived situations that only happen in the heightened world of romantic comedies.”", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/dbrlhkynhfyllzttychd.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}