{"url": "http://toofab.com/2018/05/23/rhony-dorinda-screaming-match-bethenny-carole/", "text": "Things got messy on Wednesday's \"Real Housewives of New York,\" and it wasn't just because the ladies participated in a murder mystery held at Dorinda Medley's Berkshires home.\n\nPrior to the Berkshires rendezvous, Dorinda and Ramona Singer told Carole Radziwill that her once-BFF, Bethenny Frankel, felt some type of way after Carole's then-boyfriend, Adam, asked for compensation when Bethenny invited him to Puerto Rico with her relief team to photograph the hurricane aftermath. Bethenny felt Adam shouldn't have asked to be paid to work a charity event and told Dorinda she was offended. Dorinda then relayed the message to Carole, who was \"shocked\" because Bethenny had made no mention of it to her.\n\nDuring the murder mystery dinner, Bethenny called out Ramona for telling Carole that Bethenny had called her a \"puppet.\" Bethenny was adamant that she never used that word (she didn't, but what she did say was not far off), and Carole said she believed her. Case closed, right? Wrong. In walks Dorinda.\n\n\"Don't get mad,\" Dorinda said as she stared at Bethenny and Carole. \"Do you think you two have tension? We all feel it. Group, support me here. I'm the only brave one who said it.\"\n\nBethenny said she didn't feel tense, but Carole did not reciprocate.\n\n\"I mean, I feel our vibe is off a little bit,\" she said. \"We're a little disconnected.\"\n\nBethenny agreed there had been a \"shift.\"\n\n\"Is there a reason for it?\" Carole asked. \"Because I'm feeling like there has been a shift, and I don't understand the reason.\"\n\nBethenny and Carole agreed they'd discuss the issue at a later time, but Dorinda insisted: \"Let's get it out on the table.\" Dammit, Dorinda!\n\n\"If you have a problem with me--\" Carole said.\n\n\"I don't have a problem with you,\" Bethenny replied.\n\n\"Not from what I heard last night,\" Carole fired back. \"I heard that you were either upset with me over something having to do with Adam not working for your charity for free, or you are upset with me and my level of financial support for your charity.\"\n\n\"I didn't ask for more of a financial support,\" Bethenny replied. \"I don't need any support from you for the charity. You haven't asked me about it once. Never. Over the summer, we didn't talk about it at all.\"\n\nCarole denied that she never showed interest. She then brought up that Page Six had contacted her about a rumored feud going on between her and Bethenny. Carole said she shut the story down and revealed in front of everyone that Bethenny told her it was Dorinda who leaked it to the gossip site.\n\nBethenny was furious.\n\nThen the Adam issue came up, and a screaming match ensued. Carole told her side of the Adam situation and said Bethenny was lying.\n\n\"Oh, my God, Carole!\" Bethenny said. \"You're freaking me out right now.\"\n\n\"Does the truth freak you out?\" Carole asked before calling Bethenny \"honey.\" Wrong move, Carole.\n\nThe screaming match continued -- and will continue on next week's episode.\n\n\"The Real Housewives of New York\" airs Wednesdays at 9 p.m. on Bravo.\n\nSavage! Getty/Twitter", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2018/05/23/rhony-bravo-inset-1200x630.jpg", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2018/05/23/rhony-bravo-inset-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/05/23/rhony-dorinda-screaming-match-bethenny-carole/", "title": "'RHONY' Bad Apple of the Week: Dorinda Ignites Screaming Match Between Bethenny and Carole", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "'RHONY' Bad Apple of the Week: Dorinda Ignites Screaming Match Between Bethenny and Carole", "description": "Dorinda Medley stirs up trouble on \"RHONY\" when she tells Bethenny Frankel and Carole Radziwill to \"get it out on the table.\"", "image": "https://toofab.akamaized.net/2018/05/23/rhony-bravo-inset-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Dorinda Medley stirs up trouble on \"RHONY\" when she tells Bethenny Frankel and Carole Radziwill to \"get it out on the table.\"", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/05/23/rhony-dorinda-screaming-match-bethenny-carole/", "site_name": "toofab", "type": "article", "title": "'RHONY' Bad Apple of the Week: Dorinda Ignites Screaming Match Between Bethenny and Carole", "description": "Dorinda Medley stirs up trouble on \"RHONY\" when she tells Bethenny Frankel and Carole Radziwill to \"get it out on the table.\"", "image": "https://toofab.akamaized.net/2018/05/23/rhony-bravo-inset-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1527004800.0, "source": "http://toofab.com", "summary": ""}