{"url": "https://en.wikipedia.org/wiki/Darren_Aronofsky", "text": "American Filmmaker\n\nDarren Aronofsky (born February 12, 1969)[1] is an American filmmaker and screenwriter. His films are noted for their surreal, melodramatic, and often disturbing elements, usually based in psychological horror and drama.\n\nAronofsky attended Harvard University, where he studied film and social anthropology, and the American Film Institute where he studied directing.[2] He won several film awards after completing his senior thesis film, Supermarket Sweep, which went on to become a National Student Academy Award finalist. Aronofsky's feature debut, the surrealist psychological thriller Pi, was shot in November 1997. The low-budget, $60,000 production, starring Sean Gullette, was sold to Artisan Entertainment for $1 million, and grossed over $3 million; Aronofsky won the Directing Award at the 1998 Sundance Film Festival and an Independent Spirit Award for Best First Screenplay.\n\nAronofsky's followup, the psychological drama Requiem for a Dream, was based on the novel of the same name by Hubert Selby, Jr. The film garnered strong reviews and received an Academy Award nomination for Ellen Burstyn's performance. The film also generated considerable controversy due to the graphic nature of several scenes, and was eventually released unrated. After writing the World War II horror film Below, Aronofsky began production on his third film, the romantic fantasy sci-fi drama The Fountain. The film received mixed reviews and performed poorly at the box-office, but has since garnered a cult following.[3]\n\nHis fourth film, the sports drama The Wrestler, was released to critical acclaim and both of the film's stars, Mickey Rourke and Marisa Tomei, received Academy Award nominations. In 2010, Aronofsky was an executive producer on The Fighter and his fifth feature film, the psychological horror film Black Swan, received further critical acclaim and many accolades, being nominated for five Academy Awards, including Best Picture and Best Director; Natalie Portman won Best Actress for her performance in the film. Aronofsky also received nominations for Best Director at the Golden Globes, and a Directors Guild of America Award nomination for his work on Black Swan. Aronofsky's sixth film, the biblically inspired epic Noah, was released in 2014 becoming Aronofsky's first film to open at No.1 at box office.[4] His seventh film, the psychological horror mother! (2017), sparked controversy upon release due to its biblical allegories and depiction of violence,[5] and polarized audiences.[6][7]\n\nEarly life and education [ edit ]\n\nAronofsky was born in the Brooklyn borough of New York City, New York, the son of teachers Charlotte and Abraham Aronofsky,[1][8] and grew up in the borough's Manhattan Beach neighborhood.[9][10] He said he was \"raised culturally Jewish, but there was very little spiritual attendance in temple. It was a cultural thing—celebrating the holidays, knowing where you came from, knowing your history, having respect for what your people have been through.\"[9][11] He graduated from Edward R. Murrow High School.[12] He has one sister, Patti, who attended a professional ballet school through high school.[13] His parents would often take him to Broadway theatre performances, which sparked his keen interest in show business.[14][15]\n\nDuring his youth, he trained as a field biologist with The School for Field Studies in Kenya in 1985 and Alaska in 1986.[16] He attended school in Kenya to pursue an interest in learning about ungulates.[16] He later said, \"[T]he School for Field Studies changed the way I perceived the world\".[16] Aronofsky's interest in the outdoors led him to backpack his way through Europe and the Middle East. In 1987, he entered Harvard University, where he majored in social anthropology and studied filmmaking; he graduated in 1991.[17]\n\nHe became seriously interested in film while attending Harvard after befriending Dan Schrecker, an aspiring animator,[18] and Sean Gullette, who would go on to star in Aronofsky's first film, Pi.[19] His cinematic influences included Akira Kurosawa,[20] Roman Polanski,[21] Terry Gilliam,[21] Shinya Tsukamoto,[21] Hubert Selby, Jr.[21] Spike Lee,[22] Satoshi Kon,[23] and Jim Jarmusch.[22]\n\nAronofsky's senior thesis film, Supermarket Sweep, was a finalist in the 1991 Student Academy Awards.[24] In 1992, Aronofsky received his MFA degree in directing from the AFI Conservatory, where his classmates included Todd Field, Doug Ellin, Scott Silver and Mark Waters.[25][26] He won the institute's Franklin J. Schaffner Alumni Medal.[27]\n\nCareer [ edit ]\n\nEarly work [ edit ]\n\nAronofsky's debut feature, titled Pi—sometimes stylized as π—was shot in November 1997. The film was financed in part from numerous $100 donations from friends and family.[28] In return, he promised to pay each back $150 if the film made money, and they would at least get screen credit if the film lost money.[14] Producing the film with an initial budget of $60,000, Aronofsky premiered Pi at the 1998 Sundance Film Festival, where he won the Best Director award. The film itself was nominated for a special Jury Award.[29] Artisan Entertainment bought distribution rights for $1 million.[14] The film was released to the public later that year to critical acclaim and it grossed a total of $3,221,152 at the box-office.[30][31] Pi was the first film to be made available for download on the Internet.[32]\n\nAronofsky followed his debut with Requiem for a Dream, a film based on Hubert Selby, Jr.'s novel of the same name. He was paid $50,000, and worked for three years with nearly the same production team as his previous film.[33] Following the financial breakout of Pi, he was capable of hiring established actors, including Ellen Burstyn and Jared Leto, and received a budget of $3,500,000 to produce the film.[34] Production of the film occurred over the period of one year, with the film being released in October 2000. The film went on to gross $7,390,108 worldwide.[35] Aronofsky received acclaim for his stylish direction, and was nominated for another Independent Spirit Award, this time for Best Director.[36] The film itself was nominated for five awards in total, winning two, for Best Actress and Cinematography.[36] Clint Mansell's soundtrack for the film was also well-regarded, and since their first collaboration in 1996, Mansell has composed the music to every Aronofsky film, (except for Mother!, 2017).[37][38] Ellen Burstyn was nominated for numerous awards, including for an Academy Award for Best Actress, and won the Independent Spirit Award.[36][39][40] Aronofsky was awarded the PRISM Award from the Robert Wood Johnson Foundation with the National Institute on Drug Abuse for the film's depiction of drug abuse.[41]\n\nIn May 2000, Aronofsky was briefly attached to make an adaptation of David Wiesner's 1999 children's book Sector 7 for Nickelodeon Movies, the project remains unmade.[42] In mid-2000, Warner Bros. hired Aronofsky to write and direct Batman: Year One, which was to be the fifth film in the Batman franchise.[43] Aronofsky, who collaborated with Frank Miller on an unproduced script for Ronin, brought Miller to co-write Year One with him, intending to reboot the series.[44] \"It's somewhat based on the comic book\", Aronofsky later said. \"Toss out everything you can imagine about Batman! Everything! We're starting completely anew\", who intended to re-imagine the titular character in a darker, adult-oriented and grounded style, with his adaptation aiming for an R-rating.[45] Regular Aronofsky collaborator Matthew Libatique was set as cinematographer,[46] and Aronofsky had also approached Christian Bale for the role of Batman. Bale later would be cast in the role for Batman Begins.[47] After that project failed to develop, Aronofsky declined the opportunity to direct an entry in the Batman franchise.[48] In March 2001, he helped write the screenplay to the horror film Below, which he also produced.[49]\n\nIn April 2001, Aronofsky entered negotiations with Warner Bros. and Village Roadshow to direct a then-untitled science fiction film, with Brad Pitt in the lead role.[50] In June 2001, actress Cate Blanchett entered talks to join the film,[51] which Aronofsky, wanting the title to remain secret, had given the working title of The Last Man.[52] Production was postponed to wait for a pregnant Blanchett to give birth to her child in December 2001. Production was ultimately set for late October 2002 in Queensland and Sydney.\n\nBy now officially titled The Fountain, the film had a budget of $70 million, co-financed by Warner Bros. and New Regency, which had filled the gap after Village Roadshow withdrew.[53] Pitt left the project seven weeks before the first day of shooting, halting production.[54] In February 2004, Warner Bros. resurrected it on a $35 million budget with Hugh Jackman in the lead role.[55] In August, actress Rachel Weisz filled the vacancy left by Blanchett.[56] The Fountain was released on November 22, 2006, a day before the American Thanksgiving holiday; ultimately it grossed $15,978,422 in theaters worldwide.[57] Audiences and critics were divided in their responses to it.[58][59][60]\n\nBreakthrough [ edit ]\n\nIn 2007, Aronofsky hired writer Scott Silver to develop The Fighter with him.[61] He had approached actor Christian Bale for the film, but Aronofsky dropped out because of its similarities to The Wrestler and to work on MGM's RoboCop remake.[62] In July 2010, Aronofsky had left the project due to uncertainty over the financially distressed studio's future.[63] When asked about the film, he said, \"I think I'm still attached. I don't know. I haven't heard from anyone in a while\".[64] Later during 2007, Aronofsky said he was planning to film a movie about Noah's Ark.[65]\n\nAronofsky had the idea for The Wrestler for over a decade.[66] He hired Robert Siegel to turn his idea into a script. The actor Nicolas Cage entered negotiations in October 2007 to star as Randy, the film's protagonist.[67] The following month Cage left the project, and Mickey Rourke replaced him in the lead role. Aronofsky said that Cage pulled out of the movie because Aronofsky wanted Rourke to star; Aronofsky said, stating that Cage was \"a complete gentleman, and he understood that my heart was with Mickey and he stepped aside. I have so much respect for Nic Cage as an actor and I think it really could have worked with Nic but, you know, Nic was incredibly supportive of Mickey and he is old friends with Mickey and really wanted to help with this opportunity, so he pulled himself out of the race.\"[68] Cage responded, \"I wasn't quote 'dropped' from the movie. I resigned from the movie because I didn't think I had enough time to achieve the look of the wrestler who was on steroids, which I would never do\".[69] The roughly 40-day shoot began in January 2008.[70]\n\nBlack Swan Aronofsky with the cast and crew of\n\nThe Wrestler premiered at the 65th Venice International Film Festival. Initially receiving little attention, the film wound up winning the Golden Lion, the highest award at the world's oldest film festival.[71] The Wrestler received critical acclaim, and both Rourke and co-star Marisa Tomei received Academy Award, Golden Globe, SAG, and BAFTA nominations for their performances.[72] Rourke won a Golden Globe, as did Bruce Springsteen for his original song written for the film. The Wrestler grossed $44,674,354 worldwide on a budget of $6,000,000 making it Aronofsky's highest-grossing film to that point.[73]\n\nAronofsky's next film was Black Swan, which had been in development since 2001, a psychological thriller horror film about a New York City ballerina.[74][75] The film starred actress Natalie Portman, whom Aronofsky had known since 2000. She introduced Aronofsky to Mila Kunis, who joined the cast in 2009.[76] Black Swan had its world premiere as the opening film at the 67th Venice Film Festival in September 2010. It received a standing ovation whose length Variety said made it \"one of the strongest Venice openers in recent memory\".[77]\n\nBlack Swan has received high praise from film critics, and received a record 12 Broadcast Film Critics Association nominations, four Independent Spirit Award nominations, four Golden Globe nominations, three SAG nominations, and many more accolades.[78][79][80] Aronofsky received a Golden Globe nomination for Best Director.[80] The film broke limited-release box-office records and grossed an unexpectedly high $329,398,046.[81][82] On January 25, 2011, the film was nominated for a total of five Academy Awards; Best Picture, Best Director, Best Actress, Best Cinematography and Best Film Editing. On February 27, 2011, Portman won for Best Actress.[83] The film was awarded the PRISM Award from the Substance Abuse & Mental Health Services Administration for its depiction of mental health issues.[84] Aronofsky served as an executive producer on The Fighter, which was also nominated for Best Picture at the Oscars and won two for Best Supporting Actor and Best Supporting Actress for Christian Bale and Melissa Leo.[83]\n\nLarger-budget productions [ edit ]\n\nAronofsky was attached to The Wolverine, which was scheduled to begin production in March 2011, but he left the project due to scheduling issues.[85] The film was set to be sixth entry of the X-Men film series, featuring a story revolving around Wolverine's adventures in Japan.[85] In December 2011, Aronofsky directed the music video for Lou Reed and Metallica's \"The View\" from their album Lulu.[86]\n\nAronofsky was set to direct an HBO series pilot called Hobgoblin. Announced on June 16, 2011, the series would have depicted a group of magicians and con artists who use their powers of deception to defeat Hitler during World War II.[87] He was set to work on the project with Pulitzer Prize winning author Michael Chabon and his wife Ayelet Waldman.[87] In June 2013, it was announced that HBO had dropped the show and Aronofsky had pulled out, as well.[88]\n\nIn 2011, Aronofsky tried to launch production on Noah, a retelling of the Bible story of Noah's Ark, projected for a $115 million budget.[89] By the following year, the film had secured funding and distribution from New Regency and Paramount Pictures, with Russell Crowe hired for the title role.[90] The film was adapted into a serialized graphic novel written by Aronofsky and Ari Handel, published in French in October 2011 by the Belgian publisher Le Lombard.[91] By July 2012, Aronofsky's crews were building an ark set in Oyster Bay, Long Island, New York.[92] Aronofsky announced the start of filming on Noah on Twitter in the same month, tweeting shots of the filming in Iceland.[93] The film featured Emma Watson, Anthony Hopkins, Logan Lerman, and Jennifer Connelly, with the latter having also starred in Requiem for a Dream.[94] During its opening weekend, Noah held the largest non-sequel opening within Russia and Brazil, and the fourth-largest opening of all time.[95] Aronofsky did not use live animals for the film, saying in a PETA video that \"There's really no reason to do it anymore because the technology has arrived\".[96] The HSUS gave him their inaugural Humane Filmmaker Award in honor of his use of computer-generated animals.[97]\n\nAronofsky's next film, mother!, was released by Paramount Pictures on September 15, 2017.[98] It stars Jennifer Lawrence, Javier Bardem, Michelle Pfeiffer, Domhnall Gleeson, Ed Harris and Kristen Wiig.[99][100] The film sparked controversy upon release for its depiction of violence,[5] and, though it received generally positive reviews,[101] it polarized audiences, becoming one of few films to receive a \"F\" CinemaScore grade.[6][7] On review aggregator Rotten Tomatoes, the film has an approval rating of 69% based on 278 reviews, and an average rating of 6.8/10. The site's critical consensus reads, \"There's no denying that mother! is the thought-provoking product of a singularly ambitious artistic vision, though it may be too unwieldy for mainstream tastes.\"[101]\n\nDirecting style [ edit ]\n\nAronofsky with frequent collaborators Matthew Libatique and Andrew Weisblum\n\nAronofsky's first two films, Pi and Requiem for a Dream, were low-budget and used montages of extremely short shots, also known as hip hop montages.[102] While an average 100-minute film has 600 to 700 cuts Requiem for a Dream features more than 2,000. Split-screen is used extensively, along with extremely tight closeups.[103] Long tracking shots, including those shot with an apparatus strapping a camera to an actor, called the Snorricam, and time-lapse photography are also prominent stylistic devices.[104] Often with his films, Aronofsky alternates between extreme closeups and extreme wide shots to create a sense of isolation.[105]\n\nWith The Fountain, Aronofsky restricted the use of computer-generated imagery. Henrik Fett, the visual effects supervisor of Look Effects, said, \"Darren was quite clear on what he wanted and his intent to greatly minimize the use of computer graphics ... and I think the results are outstanding.\"[106] He used more subtle directing in The Wrestler and Black Swan, in which a less-visceral directing style better showcases the acting and narratives. Aronofsky filmed both works with a muted palette and a grainy style.[107] Part of this consistent style involves collaborations with frequent partners cinematographer Matthew Libatique, editor Andrew Weisblum and composer Clint Mansell.[108] Mansell's music is an often important element of the films.[109]\n\nThemes and influences [ edit ]\n\nPi features several references to mathematics and mathematical theories.[28] In a 1998 interview, Aronofsky acknowledged several influences for Pi: \"I'm a big fan of Kurosawa and Fellini. In this film in particular I think there's a lot of Roman Polanski influence and Terry Gilliam influence as well as a Japanese director named Shinya Tsukamoto—he directed The Iron Man, Tetsuo.\" The visual style of Pi and Requiem for a Dream features numerous similarities to Tetsuo: The Iron Man.[110][111]\n\nThe majority of reviewers characterized Requiem for a Dream in the genre of \"drug movies\", along with films like The Basketball Diaries, Trainspotting, Spun, and Fear and Loathing in Las Vegas.[102] But, Aronofsky placed his movie in a wider context, saying:\n\nRequiem for a Dream is not about heroin or about drugs ... The Harry-Tyrone-Marion story is a very traditional heroin story. But putting it side by side with the Sara story, we suddenly say, 'Oh, my God, what is a drug?' The idea that the same inner monologue goes through a person's head when they're trying to quit drugs, as with cigarettes, as when they're trying to not eat food so they can lose 20 pounds, was really fascinating to me. I thought it was an idea that we hadn't seen on film and I wanted to bring it up on the screen.[112]\n\nDream logic is another leitmotif.[113]\n\nWith his friend Ari Handel, Aronofsky developed the plot for The Fountain; the director wrote the screenplay. In 1999, Aronofsky thought that The Matrix redefined the science fiction genre in film. He sought to make a science fiction film that explored new territory, as did The Matrix and its predecessors Star Wars and 2001: A Space Odyssey. He wanted to go beyond science fiction films with plots driven by technology and science.[50]\n\nIn the Toronto International Film Festival interview conducted by James Rocchi, Aronofsky credited the 1957 Charles Mingus song \"The Clown\" as a major influence on The Wrestler. It is an instrumental piece, with a poem read over the music about a clown who accidentally discovers the bloodlust of the crowds and eventually kills himself in performance.[114]\n\nAronofsky called Black Swan a companion piece to The Wrestler, recalling one of his early projects about a love affair between a wrestler and a ballerina. He eventually separated the wrestling and the ballet worlds, considering them as \"too much for one movie\". He compared the two films: \"Wrestling some consider the lowest art—if they would even call it art—and ballet some people consider the highest art. But what was amazing to me was how similar the performers in both of these worlds are. They both make incredible use of their bodies to express themselves.\"[76] About the psychological thriller nature of Black Swan, actress Natalie Portman compared the film's tone to Polanski's 1968 film Rosemary's Baby,[115] while Aronofsky said Polanski's Repulsion (1965) and The Tenant (1976) were \"big influences\" on the final film.[76] Actor Vincent Cassel also compared Black Swan to Polanski's early films, commenting that it was also influenced by Alejandro Jodorowsky's movies[116] and David Cronenberg's early work.[117]\n\nControversy [ edit ]\n\nSeveral aspects of Aronofsky's films have been controversial, most notably Requiem for a Dream, Black Swan, and mother!. Requiem for a Dream was originally set for release in 2000, but it met with controversy in the United States, being rated NC-17 by the MPAA due to a graphic sex scene.[118] Aronofsky appealed the rating, claiming that cutting any portion of the film would dilute its message. The appeal was denied and the film's distributor Artisan Entertainment decided to release the film unrated.[119]\n\nThe Wrestler has been condemned as an \"anti-Iranian\" film in many Iran newspapers and websites, in response to a scene in which Mickey Rourke violently breaks a pole bearing an Iranian flag in half across his knee.[120] Borna News, a state-run Iranian newspaper, also criticized The Ayatollah, the heel, the \"bad guy\" wrestler character. Portrayed as a villain, he wears Arabic items of clothing (keffiyeh and bisht), which the newspaper believed was intended to lead audiences to associate Iranians with Arabs.[120] In the wrestling ring, he wears a skimpy leotard in the pattern of an Iranian flag with the alef character, representing the first letter of the word Ayatollah.[120]\n\nSome Iranian newspapers avoided mentioning the character, presumably to avoid offending Iran's clerical rulers.[120] In March 2009, Javad Shamaqdari, cultural adviser to President Mahmoud Ahmadinejad, demanded an apology from a delegation of Academy of Motion Picture Arts and Sciences actors and producers visiting Iran for what he characterized as negative and unfair portrayals of the Islamic republic in The Wrestler and other Hollywood films.[121]\n\nThe question of who had designed 40 ballet costumes for Portman and the dancers in Black Swan was one publicized controversy related to the film.[122] The media gave substantial coverage to the dance double controversy: how much credit for the dancing in the film was being given to Portman and how much to her \"dance double,\" Sarah Lane, an American Ballet Theatre soloist.[123] Lane claimed to have danced more than she was credited. The director and Fox Searchlight disputed Lane's claim. Their released statements said, \"We were fortunate to have Sarah there to cover the more complicated dance sequences and we have nothing but praise for the hard work she did. However, Natalie herself did most of the dancing featured in the final film.\"[124]\n\nAronofsky said in an interview with Entertainment Weekly:[125]\n\nI had my editor count shots. There are 139 dance shots in the film. 111 are Natalie Portman untouched. 28 are her dance double Sarah Lane. If you do the math, that's 80% Natalie Portman. What about duration? The shots that feature the double are wide shots and rarely play for longer than one second. There are two complicated longer dance sequences that we used face replacement. Even so, if we were judging by time, over 90% would be Natalie Portman. And to be clear, Natalie did dance en pointe in pointe shoes. If you look at the final shot of the opening prologue, which lasts 85 seconds, and was danced completely by Natalie, she exits the scene on pointe. That is completely her without any digital magic.\n\nWhile Aronofsky's other movies have evoked significant emotional response, they were still far from the turmoil aroused by Noah. It was screened for the first time on March 28, 2014, and despite its PG-13 rating, it has quickly been recognized by Box Office Mojo as one of the most controversial movies of the last 35 years along with such titles as The Passion of the Christ or The Da Vinci Code.[126] Noah has been banned in United Arab Emirates, Qatar, and Indonesia on religious grounds with other countries following suit.[127]\n\nPersonal life [ edit ]\n\nAronofsky began dating English actress Rachel Weisz in the summer of 2001, and in 2005 they were engaged.[128] Their son was born on May 31, 2006, in New York City.[129][130] The couple resided in the East Village in Manhattan. In November 2010, Weisz and Aronofsky announced that they had been apart for months, but were continuing to raise their son together in New York.[131] In September 2016, he began dating actress Jennifer Lawrence, whom he met during the filming of mother!.[132][133] The relationship ended in November 2017.[134]\n\nHe said of his spiritual beliefs in 2014, \"I think I definitely believe. My biggest expression of what I believe is in The Fountain\".[135]\n\nHe writes his films on a custom-built desk, crafted from Bastogne walnut, an extremely valuable wood.[136][137] Within the desk is a wooden pipe organ, which plays with the opening of its drawers. David Blaine commented, \"The desk is a very cool thing that’s a lot like Darren himself—there’s always another twist and turn.\"[137]\n\nIn April 2011, Aronofsky was announced as the President of the Jury for the 68th Venice International Film Festival.[138]\n\nIn November 2014, Aronofsky was announced as the President of the Jury for the 65th Berlin International Film Festival, for February 2015.[139]\n\nEnvironmental activism [ edit ]\n\nAronofsky is known for his environmental activism. A number of his films, notably Noah and mother!, can be read as environmental parables. In 2014, he traveled to the Alberta Tar Sands with the Sierra Club's Michael Brune and Leonardo DiCaprio.[140] In 2015, he traveled to Alaska's Arctic National Wildlife Refuge with Brune, Keri Russell, and the leaders of several veterans groups.[141]\n\nIn 2014, he received the Humane Filmmaker Award from the Humane Society of the United States.[142]\n\nIn 2015, he collaborated with the artist JR on \"The Standing March,\" a public art installation in Paris encouraging diplomats at COP21 to take action against climate change.[143]\n\nHe is a board member of the Sierra Club Foundation[144] and The School for Field Studies.[145]\n\nFilmography [ edit ]\n\nShort films [ edit ]\n\nYear Film Director Writer Producer 1991 Supermarket Sweep Yes Yes No Fortune Cookie Yes No Yes 1993 Protozoa Yes Yes No 1994 No Time Yes No No\n\nFeature films [ edit ]\n\nOther productions [ edit ]\n\nYear Title Notes 2018 One Strange Rock Television documentary series Spheres: Songs of Spacetime Virtual reality\n\nAccolades [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg/220px-OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg/1200px-OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Black_Swan_press_2010.jpg/240px-Black_Swan_press_2010.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Aranofsky%2C_Libatique%2C_Weisblum_2011.jpg/230px-Aranofsky%2C_Libatique%2C_Weisblum_2011.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg/1200px-OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg", "keywords": [], "authors": ["No Author Listed."], "canonical_link": "https://en.wikipedia.org/wiki/Darren_Aronofsky", "title": "Darren Aronofsky", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg/1200px-OIFF_2015-07-17_193547_-_Darren_Aronofsky.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}