{"url": "https://www.thedailybeast.com/mitch-landrieu-roasts-tom-cotton-rand-paul-and-donald-trump-at-the-gridiron", "text": "New Orleans Mayor Mitch Landrieu delivered the following address at the 133rd Annual Gridiron Club & Foundation Dinner on March 3, 2018\n\nThank you, David. Thank you to everyone at the Gridiron.\n\nI just came here from Mardi Gras and I have to say: boy do you guys have some weird traditions.\n\nI did like that song y’all did for me. But you do know what the actual House of the Rising Sun was, right? I’ll put this diplomatically. It was a house of ill repute… you know, the kind of place where if you walk in with enough money you can get whatever you want. Kind of like Congress.\n\nAnyway this is new to me. I heard about your rule: singe, don’t burn? What does that even mean? Does it mean less Tabasco sauce?\n\nI’m not gonna lie -- I feel kinda out of place here. More out of place than Mike Pence at a men’s figure skating competition. More out of place than Hillary Clinton in Wisconsin. More out of place than the Mnuchins in a Waffle House. More out of place than Jeff Sessions at the Department of Justice. More out of place than John Kelly. Period.\n\nThe point is: I’m not from here. I just don’t get Washington. Like closing the government. It’s not how adults behave… it’s not how the real world works.\n\nI can’t stop picking up the garbage just because I don’t like Mitch McConnell. Think how much garbage there would be if everyone did that!\n\nAnd I can’t close the playgrounds because someone won’t play ball. If I do something like that, parents would be on me like Rand Paul’s neighbor.\n\nI don’t know. Maybe it’s because I’m a mayor. I did some homework: Did you know that the last sitting mayor to speak at your Spring dinner was John Lindsay in 1966?\n\nFrom the looks of it, a whole bunch of you were there!\n\nMark Shields- you were there, right? I mean think about where you were in 1966. Walter Isaacson and I were 6-year-olds, playing “Kick the Can” in Broadmoor. Tom Cotton wasn’t even a sparkle in his mother’s eye. In 1966, Al Hunt, well, he already had gray hair. Seriously, the last time you guys had a mayor -- a speaker who actually gets things done -- was 52 years ago.\n\nAnd when I say “get things done” -- I mean it.\n\nMayors work with the other side to solve problems. We balance budgets. We fight climate change. Here’s a little secret, off-the-record… it’s real. We fight crime. We invest in infrastructure and build things. We actually do. Check out the rebuilding in New Orleans. It’s just unbelievable.\n\nIn fact, just the other week, I had the New Orleans Department of Public Works pull 46 tons of Mardi Gras beads out of the sewers. That’s true. 46 tons of Mardi Gras beads. You’re looking at whole lot of drinking… and a whole lot of poor decisions.\n\nSpeaking of Mardi Gras… President Trump, you should really come down to New Orleans.\n\nMy lovely wife Cheryl and I actually saw you in Paris on Bastille Day. We were only about 500 yards away. We saw how much joy you took in watching the military march by. I actually said to Cheryl: You know, New Orleans has everything Donald Trump talks about.\n\nParades? We’ve been having those since 1699 with military bands and all. We have a parade or krewe as we call it, called the Knights of Chaos. There’s even someone called the King of Chaos.\n\nMr. President, I know you like giving nicknames. Come to think of it, that’s a perfect one for you. King Chaos. What do y’all think?\n\nWe have more things in New Orleans that you’d like.\n\nA wall? We got one of those. We call it a levee.\n\nToo much public leaking? Happens on Bourbon Street all the time.\n\nGold? We’ve got that, too. There are enough gold doubloons in our city that you could literally write your name across a building in huge gold letters. I mean, not that anyone would ever do that.\n\nAnd know what else? No matter how many times we say it, we don’t drain any swamps either.\n\nI will say this about swamps: They’re part of the ecosystem. So you just gotta get used to the fact that they’re teeming with all manner of hideous beasts. Snakes. Alligators. James Carville.\n\nAnyway, you’d love New Orleans. And a little getaway might be good for you, because I know things have been tough lately: Recently, there was a survey that ranked all of our presidents. President Trump came in dead last.Fake news, right?\n\nWell, this is real: there was another ranking of presidents who declared themselves to be stable geniuses, and Mr. President, you were indeed the greatest of all time.\n\nI jest. The truth is the President and I have a lot in common. We’re both a little overweight and balding. I just have had an easier time admitting it. I know you like winning but...you’re not gonna win this battle. We both love Wrestlemania. We both take more mulligans than we’d admit to.\n\nAnd another thing that we have in common -- the President has a lonely job, and I understand lonely.\n\nI’m a Democrat from the south. That’s lonely. Nobody ever comes to visit.\n\nFor Nancy Pelosi, the south is San Jose. For Chuck Schumer, the South is the Jersey shore sunbathing with a shirtless Chris Christie.\n\nHe didn’t do that… but just try to get that image out of your mind now that I said it.\n\nAnyway, I’m thrilled to be sharing the stage tonight with my fellow Southerner, Senator Tom Cotton.\n\nSenator Cotton’s family were cattle farmers. Which prepared him for the Senate, because he’s pretty experienced with BS.\n\nI was worried that I was going to slip up and actually curse there. But even if I did, I can count on Tom Cotton to say that he and David Purdue actually heard something different.\n\nBut Senator, here’s the thing. You can’t sprinkle BS with sugar and turn it into a cupcake.\n\nNow, that’s about as far as I can go with jokes about Tom Cotton. Otherwise, I’ll get one of those cease and desist letters he likes to send.\n\nActually, I will say one more thing about the Senator. He’s a favorite of the President. A real up and comer. The President has been talking about choosing him for all type of positions. Mr. President, a little advice from a southern Democrat: You want to expand your base? Stop talking about picking cotton.\n\nYou know, when I think of what y’all are dealing with here… I’m reminded of a Boudreaux and Thibodaux joke my dad used to tell me.\n\nBoudreaux and Thibodaux got a pilot to fly them to Canada to hunt moose. They bagged six. Unfortunately, when they got back, the pilot said the plane could take only four.\n\nThibodaux said “Last year we shot six and the pilot let us take ‘em all in that same plane as yours.” Eventually the pilot relented. But even on full power, the little plane went down.\n\nBoudreaux and Thibodaux survived the crash, sitting over the six moose.\n\nBoudreaux turned to Thibodaux, and asked, “Where we at?”\n\nThibodaux replied, “I think we’re pretty close to the place we crashed last year.”\n\nIn Louisiana, we say: “Where you at?” or “Where we at?”\n\nIt can mean a bunch of things, including how are you or we doing not just where you happen to be. So if I asked “where we at” in our politics nationally, the truth is we’re not doing so well. And that means we need to change things up. It means telling the truth and confronting the truth.\n\nI have had to confront a totally broken city and rebuild it, and I had to confront the truth of Confederate statues.\n\nThe President has to confront the truth of a fractured nation.\n\nAnd we all have to confront the truth that we human beings can act poorly towards one another sometimes.\n\nY’all in the press can’t let us off the hook on that. Because an independent press is indispensable to a free and just nation.\n\nNow, we can be blinded by anger, hate, fear and actually turn on each other. But eventually, we’re going to come back to earth, start putting one foot in front of the next and start seeing each other again as fellow human beings. We live and breathe the same air, raise our kids and pray we get them through our teenage years, go to church, go to ballgames, cheer for our country in the olympics and begin once again to find our common purpose.\n\nYou see, it all comes full circle and I am hopeful because when all is said and done…I believe love wins.\n\nIt’s a lesson as old as the Bible itself. One that Billy Graham himself and so many others remind us of so often.\n\n“Whatsoever you do to the least of my brothers that you do unto to me.”\n\nThat’s a pretty good way to live. And it happens to be a pretty good governing philosophy as well.\n\nWe live in the greatest country in the world. But the truth is, we cannot be great unless we are good.\n\nMr. President- You are my president. You are our president.\n\nWe all want you to do good. And we want you to do well.\n\nOur country depends on it.\n\nGod bless you all.\n\nAnd God bless the United States of America.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1520271778/180305-Mitch-Landrieu-tease_zm0fbq", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520271778/180305-Mitch-Landrieu-tease_zm0fbq", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520271778/180305-Mitch-Landrieu-tease_zm0fbq", "keywords": [], "authors": ["Mitch Landrieu"], "canonical_link": "https://www.thedailybeast.com/mitch-landrieu-roasts-tom-cotton-rand-paul-and-donald-trump-at-the-gridiron", "title": "Mitch Landrieu Roasts Tom Cotton, Rand Paul and Donald Trump at the Gridiron", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Mitch Landrieu Roasts Tom Cotton, Rand Paul and Donald Trump at the Gridiron", "keywords": "Donald J. Trump, Rand Paul, Tom Cotton, Opinion", "og": {"title": "Mitch Landrieu Roasts Tom Cotton, Rand Paul and Donald Trump at the Gridiron", "description": "The mayor of New Orleans killed it at the Gridiron Club. Read his speech here.", "url": "https://www.thedailybeast.com/mitch-landrieu-roasts-tom-cotton-rand-paul-and-donald-trump-at-the-gridiron", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520271778/180305-Mitch-Landrieu-tease_zm0fbq"}, "description": "The mayor of New Orleans killed it at the Gridiron Club. Read his speech here.", "authors": "Mitch Landrieu", "wrap": "/content/dailybeast/politics", "article": {"section": "politics", "published_time": "2018-03-05T18:00:17.000Z", "author": "https://www.thedailybeast.com/authors/mitch-landrieu"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1520271778/180305-Mitch-Landrieu-tease_zm0fbq"}, "sailthru.date": "2018-03-05T18:00:17.000Z", "sailthru.expire_date": "2018-03-19T18:00:17.000Z", "publicationDate": 201803051800, "parsely-page": "{\"author\":\"Mitch Landrieu\",\"link\":\"https://www.thedailybeast.com/mitch-landrieu-roasts-tom-cotton-rand-paul-and-donald-trump-at-the-gridiron\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"\"},\"post_id\":\"mitch-landrieu-roasts-tom-cotton-rand-paul-and-donald-trump-at-the-gridiron\",\"pub_date\":\"2018-03-05T18:00:17+00:00\",\"section\":\"Politics\",\"tags\":[\"Donald J. Trump\",\"Rand Paul\",\"Tom Cotton\",\"Opinion\",\"typeArticle\"],\"title\":\"Mitch Landrieu Roasts Tom Cotton, Rand Paul and Donald Trump at the Gridiron\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1520272817.0, "source": "https://www.thedailybeast.com", "summary": ""}