{"url": "https://tvweb.com/pose-tv-series-order-fx-largest-lgbtq-cast-ryan-murphy/", "text": "FX has ordered Pose, a new dance musical series from Emmy and Golden Globe award-winning producers Ryan Murphy, Nina Jacobson, Brad Simpson and Brad Falchuk, it was announced today by John Landgraf, CEO, FX Networks and FX Productions. The history-making Pose will feature the largest cast of transgender actors in series regular roles and the largest recurring LGBTQ cast ever for a scripted television series. Here's what series co-creator Ryan Murphy had to say in a statement.\n\n\"I am thrilled to join forces with John Landgraf and FX Networks and FXP and Dana Walden, Gary Newman and Fox 21 Television Studios to present what I think is a game changer of a show, which at its heart is an uplifting series about the universal quest for identity, family and respect. Along with being a dance musical and an affirming look at American life in the 1980s, I'm so proud that Pose and FX has made history right from the beginning by featuring the most trans series regular actors ever in an American television production. Additionally, the first season Pose will feature 50-plus LGBTQ characters, a record in American television history. I can't wait for people to see this incredibly talented, passionate cast.\"\n\nGet notified when your movie theaters open back up! We'll let you know when your local theaters open so that you can start enjoying the cinemas once again.\n\nPose was written by co-creators and executive producers Murphy, Falchuk and Steven Canals, with Murphy directing the first two episodes. Nina Jacobson and Brad Simpson also serve as executive producers alongside fellow executive producers Alexis Martin Woodall, Sherry Marsh and Erica Kaye. Janet Mock and Our Lady J will also serve as producers. The series is produced by Fox 21 Television Studios and FX Productions. Set in the 1980s, Pose looks at the juxtaposition of several segments of life and society in New York: the rise of the luxury Trump-era universe, the downtown social and literary scene and the ball culture world. Here's what FX's John Landgraf had to say in his statement.\n\n\"In the 15 years we've worked with Ryan, he has demonstrated time and again that every person's story is joyful, illuminating, and must to be told. With Pose, Ryan, and his producing partners Nina Jacobson, Brad Simpson, Brad Falchuk and Steven Canals, introduce us to a new group of characters whose talent, life force, and self-made community is greater than the daunting obstacles created by a society that can be threatened by their native identities.\"\n\nFX has ordered eight episodes for season one of Pose, which is scheduled to begin production in February in New York and premiere on FX in the summer of 2018. Evan Peters (American Horror Story, the X-Men franchise) and Kate Mara (American Horror Story, House of Cards) play New Jersey couple \"Stan\" and \"Patty,\" who get sucked into the glamour and intrigue of New York City in the 1980s. James Van Der Beek (Dawson's Creek, What Would Diplo Do?) plays Peters' financial kingpin boss \"Matt.\" Here's what FTG Chairman and CEOs Dana Walden and Gary Newman had to say in a statement.\n\n\"A decade ago, Ryan brought us the groundbreaking pilot script for Glee, a show that celebrated underdogs, proudly showcased a completely diverse cast of unknown actors and led the way for new norms of inclusion and diversity on television. In Pose, Ryan has again, with his gifted collaborators, placed a spotlight on people who have been marginalized in society, bringing together emotional stories and a hugely talented cast in an inspirational series.\"\n\nAfter a six-month nationwide search helmed by casting director Alexa Fogel (Atlanta), Murphy and his collaborators are making television history by assembling the largest cast of transgender actors in series regular roles ever for a scripted series. The transgender cast includes MJ Rodriguez, Dominique Jackson, Indya Moore, Hailie Sahar and Angelica Ross. Also co-starring are Tony Award winner Billy Porter as well as newcomers Ryan Jamaal Swain and Dyllon Burnside. When Pose was initially announced, it was reported that Tatiana Maslany was cast in one of the roles. That role was reconceived and re-written to be a 50-year-old African-American woman. Charlayne Woodard (The Leftovers, Law & Order: SVU, ER) has been cast in that role. In conjunction with Ryan Murphy's Half Initiative, the FX Networks series will be bringing on emerging transgender directors to be mentored through his Directing Mentorship Program.", "images": ["https://cdn3.tvweb.com/i/article/XthmvQv21e4IM7vIQPwaI4n8pqlIT3/1200:100/Pose-Tv-Series-Order-Fx-Largest-Lgbtq-Cast.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17091571&cv=2.0&cj=1"], "top_img": "https://cdn3.tvweb.com/i/article/XthmvQv21e4IM7vIQPwaI4n8pqlIT3/1200:100/Pose-Tv-Series-Order-Fx-Largest-Lgbtq-Cast.jpg", "keywords": [], "authors": ["Tvweb Contributor"], "canonical_link": "https://tvweb.com/pose-tv-series-order-fx-largest-lgbtq-cast-ryan-murphy/", "title": "Ryan Murphy's Pose Makes History with Largest Transgender Cast", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "FX has issued a series order for the 1980s-set series Pose, which will have the largest transgender cast in TV history.", "fb": {"app_id": 148730265137092}, "robots": "max-image-preview:large", "og": {"title": "Ryan Murphy's ‘Pose’ Makes History with Largest Transgender Cast", "type": "article", "image": "https://cdn3.tvweb.com/i/article/XthmvQv21e4IM7vIQPwaI4n8pqlIT3/1200:100/Pose-Tv-Series-Order-Fx-Largest-Lgbtq-Cast.jpg", "url": "https://tvweb.com/pose-tv-series-order-fx-largest-lgbtq-cast-ryan-murphy/", "description": "FX has issued a series order for the 1980s-set series ‘Pose,’ which will have the largest transgender cast in TV history.", "site_name": "TVweb"}, "article": {"published_time": "2017-12-28T08:03:58-08:00", "section": "TV News"}, "twitter": {"card": "summary_large_image", "site": "@tvweb", "title": "Ryan Murphy's ‘Pose’ Makes History with Largest Transgender Cast", "description": "FX has issued a series order for the 1980s-set series Pose, which will have the largest transgender cast in TV history.", "image": {"identifier": "https://cdn3.tvweb.com/i/article/XthmvQv21e4IM7vIQPwaI4n8pqlIT3/1200:100/Pose-Tv-Series-Order-Fx-Largest-Lgbtq-Cast.jpg", "alt": "Ryan Murphy's Pose Makes History with Largest Transgender Cast"}, "url": "https://tvweb.com/pose-tv-series-order-fx-largest-lgbtq-cast-ryan-murphy/"}}, "movies": [], "publish_date": 1514477038.0, "source": "https://tvweb.com", "summary": ""}