{"url": "www.thesun.co.uk/tvandshowbiz/6149389/kim-kardashians-khloe-kourtney-unfollow-kanye-west-twitter/", "text": "KIM Kardashian's sisters Kourtney, Khloe and Kylie have cut ties with Kanye West on Twitter after the rapper posted messages in support of US President Donald Trump.\n\nThe sisters have seemingly been left unimpressed by the rapper's continual stream of tweets over the last two days, following a year-long absence from the platform.\n\n6 Khloe and Kourtney Kardashian have cut ties with Kanye West on Twitter after pro-Trump tweets Credit: Rex Features\n\n6 Kanye, mocked up as Trump, has been criticised for his bromance with the US President\n\nThey're not the only high profile names to boycott Kanye online, with Kanye's former collaborators Drake, Nicki Minaj, and Rihanna joining Justin Bieber, Harry Styles and Kendrick Lamar all unfollowing the controversial star.\n\nThe online exodus hasn't been missed by eagle-eyed social media users, with one writing on Twitter: \"Zayn & Harry both unfollowed Kanye on Twitter. Kings.\n\nAnother said :\"Rihanna, Drake, Katy, Ariana, Kendrick, Zayn, Nicki etc. all unfollowed Kanye 💀 he really ended himself :(.\"\n\nWhile a third added: \"Khloe, Kylie and Kourtney all unfollowed Kanye. Kris working hard today.\"\n\n6 The rapper has broken a year-long absence from Twitter in spectacular fashion Credit: Splash News\n\n6 Kylie Jenner has also snubbed the musician Credit: Getty Images - Getty\n\njaden smith, rihanna, harry styles, justin bieber, the weeknd, kendrick lamar etc. all unfollowed kanye! i love this song pic.twitter.com/BVMCYInuH0 — mani (@marasmeIody) April 25, 2018\n\nKhloe, Kylie and Kourtney all unfollowed Kanye. Kris working hard today pic.twitter.com/dBwLcd2Ijo — fake georgia (@lemonadenormani) April 25, 2018\n\nRihanna, Drake, Katy, Ariana, Kendrick, Zayn, Nicki etc. all unfollowed Kanye 💀 he really ended himself :( — ً (@xtinaspipe) April 25, 2018\n\nKanye proved his bromance with Donald Trump is still going strong yesterday in a series of tweets.\n\nCalling Trump \"my brother,\" he claimed they both have \"dragon energy\". The President replied saying the rapper was \"very cool\".\n\n6 Kanye and Trump pose together at Trump Tower the day after the 2016 US election Credit: AP:Associated Press\n\n6 Kanye has never hidden his love for the US President and even embraced him at Trump Tower Credit: AFP or licensors\n\nTheir most recent display of affection follows years of social media appreciation between Trump and the President.\n\nThe loved-up posts were rumoured to have cost the rapper nine million Twitter follows, but the claims have been proved false after Twitter confirmed Kanye still boasts around 27million followers.\n\nKanye, 40, tweeted: \"You don’t have to agree with Trump but the mob can’t make me not love him.\"\n\nHe also shared a picture of a Make America Great Again cap and wrote: \"My MAGA hat is signed\", followed by a string of fire emojis.\n\nYou don't have to agree with trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought. — ye (@kanyewest) April 25, 2018\n\nThank you Kanye, very cool! https://t.co/vRIC87M21X — Donald J. Trump (@realDonaldTrump) April 25, 2018\n\nKanye's wife Kim Kardashian defended her husband by tweeting: \"To the media trying to demonise my husband let me just say this... your commentary on Kanye being erratic & his tweets being disturbing is actually scary.\n\n\"So quick to label him as having mental health issues for just being himself when he has always been expressive is not fair.\"\n\nI love when people have their own ideas. You don't have to be allowed anymore. Just be.\n\n\n\nLove who you want to love. That's free thought. I'm not even political. I'm not a democrat or a republican — ye (@kanyewest) April 25, 2018\n\nmy wife just called me and she wanted me to make this clear to everyone. I don't agree with everything Trump does. I don't agree 100% with anyone but myself. — ye (@kanyewest) April 25, 2018\n\nThe rapper also took potshots at Obama during the tweeting flurry, stating that nothing changed in Chicago during his presidency.\n\nCombating backlash from anti-Trump protesters he also shared a picture of a post by Chance The Rapper which read: \"Black people don't have to be Democrats.\"\n\nObama was in office for eight years and nothing in Chicago changed. — ye (@kanyewest) April 25, 2018\n\nKanye continued that he loved free thinkers and showed alt-right supporter Peter Thiel.\n\nThe dad-of-three tweeted: \"I'm so happy to hear that Peter Thiel would like to take a meeting. I feel very optimistic about the future.\"\n\nThiel is a controversial figure in American politics as he backs the alt-right and funded the Hulk Hogan case against Gawker Media for publishing a video of Hogan having sex.\n\nThe case saw an injunction placed on the footage being published and saw the media firm go bankrupt before being sold to another company.\n\nKanye West tells crowd he would have voted for Donald Trump in US election\n\nA fan noticed Kanye's following seemed to have fallen after the series of Trump-loving tweets and wrote: \"Kanye losing 9 million followers because of the Trump tweet.\"\n\nBut Twitter confirmed to The Verge: \"We can confirm that Kanye’s follower count is currently at approximately 27M followers.\n\n\"Any fluctuation that people might be seeing is an inconsistency and should be resolved soon.\"\n\nmost read in news Latest LEVELLING OFF? Coronavirus deaths rise by 847 to 14,576 but rate appears to plateau VIRAL WAVES Coronavirus deaths 'could hit 40k in first wave with NINE more waves possible' RISHI TO THE RESCUE Furlough job scheme extended to stop thousands being laid off WHAT A WINNER British ticket-holder claims £57.8m EuroMillions jackpot after 1 month 'DARK CLOUD' UK coronavirus cases ‘frightening’ Europe as infections rise '4 times faster' Revealed GRIM REAPER Why is the UK coronavirus death rate so high compared with the rest of Europe?\n\nThe College Dropout MC has never hidden his admiration for Donald Trump, turning up at Trump Tower the day after the 2016 election and posing for pictures in the lobby.\n\nKanye has even hinted he could run for President in 2024, saying: \"Keep America Great #Kanye2024\".\n\nHe even once joked: \"When we become president we have to change the name of the plane from Air Force one to Yeezy force one\".\n\nKim Kardashian has an awkward kiss with husband Kanye West at sister Kourtney's boozy birthday bash\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220.\n\nWe pay for videos too. Click here to upload yours.", "images": ["http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2018/04/dd-composite-kanye-trump.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1"], "top_img": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2018/04/dd-composite-kanye-trump.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Dan Cain"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/6149389/kim-kardashians-khloe-kourtney-unfollow-kanye-west-twitter/", "title": "Kim Kardashian’s sisters unfollow Kanye West on Twitter as a host of stars also ditch rapper over his support for ‘my brother’ Donald Trump", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Khloe and Kourtney Kardashian unfollow Kanye West on Twitter following pro-Trump tweets", "url": "https://www.thesun.co.uk/tvandshowbiz/6149389/kim-kardashians-khloe-kourtney-unfollow-kanye-west-twitter/", "description": "KIM Kardashian’s sisters Kourtney, Khloe and Kylie have cut ties with Kanye West on Twitter after the rapper posted messages in support of US President Donald Trump. The sisters have seemingl…", "site_name": "The Sun", "image": {"identifier": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2018/04/dd-composite-kanye-trump.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2018-04-26T12:52:49+00:00", "modified_time": "2018-04-26T15:22:13+00:00", "publisher": 161385360554578, "tag": "Donald Trump, Kanye West, Khloe Kardashian, Kourtney Kardashian", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The 40-year-old rapper called the President 'my brother' and declared his love for him and his 'dragon energy'", "keywords": "Kim Kardashian, sisters, Khloe Kardashian, Kourtney Kardashian, unfollow, Kanye West, Twitter, Rihanna, Drake, Katy Perry, Nicki Minaj, Donald Trump", "news_keywords": "Kim Kardashian, sisters, Khloe Kardashian, Kourtney Kardashian, unfollow, Kanye West, Twitter, Rihanna, Drake, Katy Perry, Nicki Minaj, Donald Trump", "twitter": {"text": {"title": "Kim Kardashian’s sisters unfollow Kanye West on Twitter as a host of stars also ditch rapper over his support for ‘my brother’ Donald Trump"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "KAN-NAY", "headline": "Kim's sisters unfollow Kanye on Twitter as stars dump rapper over support for Trump", "image": {"medium": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2018/04/dd-composite-kanye-trump.jpg?crop=0px%2C0px%2C750px%2C500px&resize=300%2C192&ssl=1", "large": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2018/04/dd-composite-kanye-trump.jpg?crop=0px%2C0px%2C750px%2C500px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 6149389, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1524747169.0, "source": "http://www.thesun.co.uk", "summary": ""}