{"url": "https://www.indiewire.com/2018/01/catherine-zeta-jones-michael-douglas-sexual-harassment-1201917639/", "text": "Douglas came forward on January 10 to deny a sexual harassment allegation he said is currently being shopped around to different publications.\n\nCatherine Zeta-Jones is standing by husband Michael Douglas after he came forward to preemptively deny a sexual harassment claim set to be made against him. The actress told PEOPLE while promoting her upcoming Lifetime film “Cocaine Godmother” that “there was no other way” for Douglas to handle the situation.\n\n“There was no other way than to be preemptive in a story that had to be watched. He did a statement. I think it’s very clear the way that he stands,” Zeta-Jones said. “I cannot elaborate on something that’s so very personal to him.”\n\nZeta-Jones made it clear she supports both her husband’s denial and the #MeToo anti-harassment movement at large: “My reaction was that as two people who have been in this business — him longer than me — was that we support ‘Me Too’ and the movement more than anybody, anybody — me as a woman, him as a man.”\n\nIn an interview with Deadline published January 10, Douglas noted that a sexual harassment claim was going to be made against him in the future. The actor said he received a message from his attorney that The Hollywood Reporter was interested in a story involving one of the actor’s former employees who alleges he sexually harassed her approximately 32 years ago. The woman alleges Douglas “spoke raunchily” to her and to his friends when she was around. She also claims Douglas masturbated in front of her.\n\n“I had the choice of waiting for a story to come out, one that will clearly get picked up by other newspapers and magazines, and then I have to sit there and try to defend myself. Or, try to share with the public, a little ahead of the story, my thoughts and concerns,” Douglas said about his decision to come forward before the allegations were made publicly.\n\nPopular on IndieWire\n\nDouglas apologized to the woman if he used “coarse language” in front of her, but he denied ever masturbating in front of her. The actor said this accusation is a “complete lie” and that there is “no truth to it whatsoever.” He also expressed concerns over the fact that an allegation could harm the future of his career.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-16-at-10-40-59-am.png", "https://i2.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/GettyImages-86143102.jpg?resize=230%2C135&ssl=1&w=300", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2020/04/ltyh.jpg?resize=230%2C135&ssl=1&w=300", "https://pmctvline2.files.wordpress.com/2020/04/magnum-pi-2x16-1.jpg?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F01%2Fcatherine-zeta-jones-michael-douglas-sexual-harassment-1201917639%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201917639", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/02/drew-carey-e1587181608936.jpg?resize=230%2C135&w=300", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2018/06/Zack-Sharf.png?resize=96%2C96&ssl=1", "https://pmcvariety.files.wordpress.com/2020/04/michael-jordan-1.jpg?resize=230%2C135&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-16-at-10-40-59-am.png?w=780"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-16-at-10-40-59-am.png", "keywords": [], "authors": ["Zack Sharf"], "canonical_link": "https://www.indiewire.com/2018/01/catherine-zeta-jones-michael-douglas-sexual-harassment-1201917639/", "title": "Catherine Zeta-Jones Stands By Michael Douglas After Preemptive Sexual Harassment Denial: ‘There Was No Other Way’", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "The actress says \"there was no other way\" but for Douglas to come forward.", "news_keywords": "Catherine Zeta-Jones, Michael Douglas, Sexual Harassment", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Zack Sharf", "content_type": "Article", "post_id": 1201917639, "title": "Catherine Zeta-Jones Stands By Michael Douglas After Preemptive Sexual Harassment Denial: 'There Was No Other Way'", "published_at": "2018-01-16 10:56:56", "image": "https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-16-at-10-40-59-am.png?w=300", "comment_count": 0, "tags": "Sexual Harassment", "topics": "Film", "body": "Catherine Zeta-Jones is standing by husband Michael Douglas after he came forward to preemptively deny a sexual harassment claim set to be made against him. The actress told PEOPLE while promoting her upcoming Lifetime film \"Cocaine Godmother\" that \"there was no other way\" for Douglas to handle the situation.\r\n\r\n\r\n\r\n\"There was no other way than to be preemptive in a story that had to be watched. He did a statement. I think it’s very clear the way that he stands,\" Zeta-Jones said. \"I cannot elaborate on something that’s so very personal to him.\"\r\n\r\nZeta-Jones made it clear she supports both her husband's denial and the #MeToo anti-harassment movement at large: \"My reaction was that as two people who have been in this business — him longer than me — was that we support ‘Me Too’ and the movement more than anybody, anybody — me as a woman, him as a man.\"\r\n\r\nIn an interview with Deadline published January 10, Douglas noted that a sexual harassment claim was going to be made against him in the future. The actor said he received a message from his attorney that The Hollywood Reporter was interested in a story involving one of the actor’s former employees who alleges he sexually harassed her approximately 32 years ago. The woman alleges Douglas “spoke raunchily” to her and to his friends when she was around. She also claims Douglas masturbated in front of her.\r\n\r\n\"I had the choice of waiting for a story to come out, one that will clearly get picked up by other newspapers and magazines, and then I have to sit there and try to defend myself. Or, try to share with the public, a little ahead of the story, my thoughts and concerns,\" Douglas said about his decision to come forward before the allegations were made publicly.\r\n\r\nDouglas apologized to the woman if he used \"coarse language\" in front of her, but he denied ever masturbating in front of her. The actor said this accusation is a “complete lie” and that there is “no truth to it whatsoever.” He also expressed concerns over the fact that an allegation could harm the future of his career.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/01/catherine-zeta-jones-michael-douglas-sexual-harassment-1201917639/", "title": "Catherine Zeta-Jones Stands By Michael Douglas After Preemptive Sexual Harassment Denial: ‘There Was No Other Way’", "description": "Douglas came forward on January 10 to deny a sexual harassment allegation he said is currently being shopped around to different publications.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-16-at-10-40-59-am.png", "width": 780, "height": 507}}, "article": {"published_time": "2018-01-16T15:56:56+00:00", "modified_time": "2018-01-16T15:56:56+00:00", "author": "https://www.indiewire.com/author/zacksharf/", "section": "Film", "tag": "Sexual Harassment"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1516118216.0, "source": "https://www.indiewire.com", "summary": ""}