{"url": "https://www.vulture.com/2017/10/american-vandal-biggest-influences.html", "text": "Photo: NBC/Netflix/Getty Images\n\nAt the end of American Vandal, the question remains: Who did the dicks?! But as anyone who’s watched the Netflix mockumentary will tell you, it’s so much more than a hilarious dick joke, which leads to another important question: What influenced such an excellent blend of true-crime documentaries and high-school drama?\n\nVulture got in touch with American Vandal co-creators Dan Perrault and Tony Yacenda to find out how they synthesized movies, podcasts, TV, and their own personal experiences to make a show that imbues heart and criticism of the justice system into the case of Dylan Maxwell (Jimmy Tatro) and the spray-painted penises investigated by Peter Maldonado (Tyler Alvarez) and Sam Ecklund (Griffin Gluck). Below, Perrault and Yacenda explain their nine biggest inspirations for American Vandal.\n\nThe Jinx\n\nTony Yacenda: I like the journey they took the audience on, how they made the crime feel so cinematic. It created this really tense world with everything from the re-creations and the music, but most importantly, the way they rationed information to the audience. The turning points and the cliff-hangers were super-effective. Once it gets real-time with the cadaver letter and everything, the documentarian, Andrew Jarecki, is actually making the story about himself. And that was something we always wanted to do with our story.\n\nDan Perrault: It wouldn’t make sense if our main documentarian narrator is discovering things in the midst of voice-over. Obviously, by the time he’s editing and recording voice-over for that episode, he’s already come to these discoveries. To have someone like Sam, who Peter shows all this evidence like the ball hairs to, that was very Jinx-like. The cadaver letter was revealed to the guy on camera, so if you wanted an element of someone being surprised by a new piece of evidence, it helps to have somebody like Sam who would be experiencing this for the first time on-camera.\n\nSerial\n\nTY: Our biggest reference is Serial. The way that Sarah Koenig was this unreliable narrator. There’s a great moment where she’s talking about Adnan and she says, “I look into his eyes and they’re like, big baby owl’s eyes. And I just think, ‘How could this guy do that?’” In that moment she’s telling the audience, “I have this bias. My gut tells me he didn’t do it, but I know that’s irrational thought. Let’s look at the facts and figure this out together.”\n\nDP: We have a very Sarah Koenig–like narrator … We knew that we needed a similarly committed borderline-obsessed documentarian narrator. That’s what we try to do with Peter.\n\nMaking a Murderer\n\nDP: The main reference for [Dylan Maxwell] is definitely Steven Avery. Initially, you know he has done some pretty crappy things. He’s earned those detentions he got in the past and we’d like to think that you’re not rooting for him because you love the guy. I mean, this is a guy who farts on babies. We wanted a character who you’re drawn into, not because he has an amazing character but because there seems to be an injustice here. That’s why you root for Steven Avery — not necessarily because I want to get a beer with the guy, but because it seems like there’s been a major miscarriage of justice.\n\nElection\n\nTY: Election is this great satire of high school and the political system, and we wanted to make a satire about high school and the justice system. You’re not necessarily watching it for the next joke or the next punch line — you’re in it because you actually care about this high-school election and these characters. The engine is the plot and the comedy follows. Even though ours is a big dick joke, we wanted the mystery to be the really driving element. We know that an election or getting expelled isn’t the end of the world. It’s not like anybody was killed or he’s going to jail or anything like that. But when you’re in high school, those are the hugest stakes.\n\nThe Staircase\n\nTY: We definitely used Michael Peterson as a template when mapping out Dylan’s arc. It was also very helpful in figuring out how Peter and Sam could discover new evidence on-camera that felt like a documentary and not like a kid’s high-school story. Because there’s a lot of things they find in The Staircase: the second death, the blow poke, all these other things are turning points. It’s like living in real time to some extent. That really helped us figure out our structure for Peter and Sam to do some sleuthing of their own.\n\nThe Thin Blue Line\n\nTY: I watched The Thin Blue Line in film school and thought about it for years. I was pretty obsessed with it. It was one of my favorite movie experiences ever. I think it started the genre, so all of the other references that we’ve mentioned can tip their hat to The Thin Blue Line.\n\nActual High-School Memories\n\nTY: I was making the video yearbook at our school and I always had a camera, always making movies, so I was a bit like Peter — except for my high-school movies were terrible. It was helpful when talking about that character. With wardrobe for instance, when they would try to dress him like a nerd, I’d be like, “It’s not like he’s a nerd. He just doesn’t really know how to dress really well. He wears clothes that don’t quite fit and wears the same sweatshirt every day.” Little things like that. The other thing that we always talk about is our high-school experiences weren’t like The Breakfast Club or Mean Girls where it’s just the jocks, the nerds, goths, the cheerleaders in different factions. It’s much more of a melting pot.\n\nTickled\n\nDP: There was a movie called Tickled that we really enjoyed about this documentarian [David Farrier] who discovers secret tickle-fetish sleeper cells. What we love about it is how creative the documentarian got with how he obtained and shot his footage, because he’s dealing with people who are very rich and powerful and determined to keep this stuff secret. There are some influences with that when it came to how Peter tries to get his information when he’s been banned from campus. In certain scenes, it was much more compelling to be restricted to just an iPhone camera in Peter’s pocket.\n\nFreaks and Geeks\n\nDP: It was nice to watch Freaks and Geeks in between sittings of The Jinx and Making a Murderer to get us in the mind set of high school and true crime. My favorite parts of the show are when both of tropes merge. The hand job story line is one of my favorites because it is so high school and pretty close to true crime as well, the detail-oriented way in which we analyzed the story of a hand job.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2017/10/19/19-american-vandal-influence.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/10/19/19-american-vandal-influence.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/10/19/19-american-vandal-influence.w1200.h630.jpg", "keywords": [], "authors": ["Dan Reilly"], "canonical_link": "https://www.vulture.com/2017/10/american-vandal-biggest-influences.html", "title": "Freaks and Geeks, Serial, and 7 Other Influences on American Vandal", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Freaks and Geeks, Serial, and 7 Other Influences on American Vandal", "url": "https://www.vulture.com/2017/10/american-vandal-biggest-influences.html", "description": "The creators explain how they synthesized movies, podcasts, TV, and their own personal experiences.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/10/19/19-american-vandal-influence.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Freaks and Geeks and 8 Other Influences on American Vandal", "description": "The creators explain how they synthesized movies, podcasts, TV, and their own personal experiences.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/10/19/19-american-vandal-influence.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-10-19T13:14:59.702-04:00", "tag": "vulture lists, american vandal, who did the dicks?, tv, tony yacenda, dan perrault, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "From Making a Murderer to Freaks and Geeks, American Vandal creators Tony Yacenda and Dan Perrault share what inspired their Netflix mockumentary.", "sailthru.tags": "vulture lists, american vandal, who did the dicks?, tv, tony yacenda, dan perrault, vulture homepage lede", "author": "Dan Reilly", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1508433299.702, "source": "https://www.vulture.com", "summary": ""}