{"url": "https://people.com/food/asia-argento-cryptic-message-before-anthony-bourdain-suicide/", "text": "In the hours before news broke of Anthony Bourdain‘s apparent suicide, his girlfriend Asia Argento was active on social media.\n\nThe 42-year-old Italian actress shared videos and photos on her Instagram story throughout the day on Thursday, including one with the Rome geotag, seemingly indicating she was not in the same country as Bourdain at the time of his death. The host of CNN’s Anthony Bourdain: Parts Unknown, who was 61, was found unresponsive in his hotel room in France on Friday morning by close friend and French chef, Eric Ripert, according to CNN. Both were filming an upcoming episode of Bourdain’s award-winning show.\n\nGet push notifications with news, features and more.\n\nArgento’s recent Instagram story, posted around three hours before Bourdain’s death was first reported, was a photo of herself wearing a ripped t-shirt that read: “F— EVERYONE.”\n\n“You know who you are,” she captioned the post.\n\nArgento’s Instagram story has since been deleted.\n\nImage zoom Asia Argento/Instagram\n\nRELATED: Rose McGowan Mourns the Loss of Friend Anthony Bourdain in Teary Video: ‘I’m So Mad at You’\n\nArgento has since released a statement regarding Bourdain on Twitter. “Anthony gave all of himself in everything that he did,” she said. “His brilliant, fearless spirit touched and inspired so many, and his generosity knew no bounds. He was my love, my rock, my protector. I am beyond devastated. My thoughts are with his family. I would ask that you respect their privacy and mine.”\n\nA Strasbourg police spokesperson confirmed Bourdain’s death to PEOPLE. Colmar, France, public prosecutor Christian de Rocquigny du Fayel told PEOPLE that Bourdain died by hanging at a luxury hotel in Kaysersberg called Le Chambard, noting “at this stage, nothing suggests the intervention of a third party.”\n\n“It is with extraordinary sadness we can confirm the death of our friend and colleague, Anthony Bourdain,” CNN said in a statement. “His love of great adventure, new friends, fine food and drink and the remarkable stories of the world made him a unique storyteller. His talents never ceased to amaze us and we will miss him very much. Our thoughts and prayers are with his daughter and family at this incredibly difficult time.”\n\nArgento and Bourdain met when the two collaborated on the Rome episode of Parts Unknown in 2016, and Argento became heavily involved in his creative process. She recently directed an upcoming episode set in Hong Kong, and Bourdain would often consult her for her rich knowledge of music and film when putting together the series.\n\nRELATED VIDEO: Anthony Bourdain, Celebrated American Chef, Dead at 61 from Apparent Suicide\n\nSpeaking to PEOPLE earlier this year, Bourdain opened up about how he made long-distance work with the Rome-based actress amid his hectic travel schedule.\n\n“I want to spend as much time with her as I can,” he said, explaining that he reserved about five days a month to spend with Ariane, his 11-year-old daughter with his ex-wife Ottavia Busia in New York, followed by trips to visit Argento in Italy.\n\nRELATED: Anthony Bourdain Joked He Wanted to ‘Die in the Saddle’ in PEOPLE Interview Months Before Death\n\nAsked if her presence has made him softer on and off set, Bourdain said, “I’m happier for sure. It’s nice to be with somebody who I see as a peer.”\n\n“She’s been in this circus since she was nine,” he said. “She knows so much more about so many of the things that are important to me — music, books, film, the technical aspects of film, and just the weird state of celebrity, being somebody that people come up to. That’s something she’s dealt with a lot longer than me. I was 44 before that started happening. Whereas, it’s been like that for her since she was a kid.”\n\n“This woman likes to work,” he continued. “She is strong, independent, creative, and needs to have an obsession, needs to make things. I think we’re both relieved by the fact that we both respect each other’s work. Nobody’s ever going to say, ‘Oh, but you promised we were going to go to the beach.’ No, you get a gig, that’s it. Work first.”\n\nArgento’s most recent photo with Bourdain was posted on May 27.\n\n“It’s a wrap!” she captioned a black and white photo of the two. “#Firenze @partsunknowncnn @anthonybourdain #makearteveryday.”\n\nBourdain also liked a photo Argento posted to Instagram four days before his death.\n\nIf you or someone you know is considering suicide, please contact the National Suicide Prevention Lifeline at 1-800-273-TALK (8255).", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1997&h=1046&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1997&h=1046&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-2.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/food/asia-argento-cryptic-message-before-anthony-bourdain-suicide/", "title": "Anthony Bourdain: Asia Argento Shared Cryptic Message Before His Apparent Suicide", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Anthony Bourdain,Asia Argento,Death,News", "news_keywords": "Anthony Bourdain,Asia Argento,Death,News", "description": "The renowned chef, TV host and author died of apparent suicide at 61", "og": {"title": "Asia Argento Shared Cryptic Message Hours Before Anthony Bourdain's Apparent Suicide: 'F— Everyone...You Know Who You Are'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/food/asia-argento-cryptic-message-before-anthony-bourdain-suicide/", "description": "In the hours before news broke of Anthony Bourdain‘s apparent suicide, his girlfriend Asia Argento was active on social media. The 42-year-old Italian actress shared&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1997&h=1046&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-2.jpg", "width": 1997, "height": 1046}}, "pinterest": {"url": "https://people.com/food/asia-argento-cryptic-message-before-anthony-bourdain-suicide/", "description": "The renowned chef, TV host and author died of apparent suicide at 61", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/food/asia-argento-cryptic-message-before-anthony-bourdain-suicide/", "title": "Asia Argento Shared Cryptic Message Hours Before Anthony Bourdain's Apparent Suicide: 'F— Everyone...You Know Who You Are'", "description": "The renowned chef, TV host and author died of apparent suicide at 61", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1997&h=1046&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fasia-argento-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}