{"url": "http://www.theashleysrealityroundup.com/2012/03/06/mtvs-the-challenge-your-frequently-asked-questions-answered/", "text": "The Ashley is pretty much obsessed with MTV’s The Challenge. Each week, she looks forward to seeing which cast member is involved in zany hi-jinks and crazy hookups. (Um, yeah, it’s usually Paula for both of those.)\n\nHowever, The Ashley is often asked by readers how things worked on ‘The Challenge’ so she set out to find answers to your burning questions about the show. After a lot of research, The Ashley has finally managed to get some inside info on what it’s like to be on this show!\n\nQ: How did MTV get the idea for ‘The Challenge?’\n\nA: According to Wikipedia, it all started back in the late-1990s when the casts of ‘The Real World: Boston’ and ‘Road Rules: Islands’ met while the ‘Real World’ cast was vacationing in San Juan, Puerto Rico.\n\n“Producers set up a face-off where both teams would compete for a cash prize. The intensely competitive challenge brought in high ratings and this set ideas in motion to produce yet another spin-off series.”\n\nQ: How long does the Challenge actually last? How long are they in the house if they make it to the end?\n\nA: Cast member Katie Doyle has said many times on her twitter that those crazy kids are stuck in the house for about six weeks while filming, if they make it to the end.\n\nQ: Does MTV foot the bill when the cast mates go out on the town during the Challenges?\n\nA: “Battle of the Exes” cast member Priscilla Mendez told US Davis’ newspaper The Auggie that MTV does not pay for the cast’s recreational activities, and does not condone underage drinking. Of course, the ‘Challenges’ always take place in foreign countries, and oftentimes it’s not illegal to drink in those country if you’re under 21. Still, the cast members have to pay for their own drinks, nightclub admission, etc.\n\nQ: Are the cast members putting on an act for the cameras? Are they really that way in real life?\n\nA: “I tell people if they’ll lie, cheat, steal on a challenge it means to lie, cheat and steal in the real life. What I really think, and where I’m getting at is, however you act on the Challenge for whatever extenuating circumstance, that’s really how you are under pressure or not,” Abram Boise told The Celebrity Café in a recent interview.\n\nPriscilla Mendez agreed, telling The Auggie “It is impossible to fake your life for [that long.] What you see on the show is truly me.”\n\nHowever, all of the cast members aren’t party animals, despite how it may look. According to a reporter for Crushable.com that attended a reunion show taping in December 2010 and wrote about it, several of the cast members claim that MTV made them go out to clubs, even though all they wanted to do is stay home and rest. (Of course MTV didn’t air that part of the interview!)\n\nQ: Do the cast members have to cook and clean for themselves?\n\nA: “We have…maids that come in whenever we do a challenge which is about twice a week, and they do a really really good clean over,” Cara Maria Sorbello said in a recent interview. “They do all of the dishes and the bathrooms and stuff.”\n\nQ: Who has the record for participating in the most ‘Challenges?’\n\nA: If it seems like you always see the same faces on ‘The Challenge,’ you’re right. MTV has done 22 seasons of ‘The Challenge.’ (It was previously called ‘Real World/Road Rules Challenge’ before MTV changed it to its current, much-snappier name!)\n\nDerrick Kosinski, Katie Doyle, Paula Meronek and Robin Hibbard have all competed in nine ‘Challenges,’ the most of any contestants.\n\nOf all the contestants ever to appear on ‘The Challenge,’ Darrell Taylor holds the record for most money earned from the show. In total he’s raked in over $240,000 in prize money from winning ‘The Challenges.’ Kenny Santucci is a close second, having won over $236,000 from the shows.\n\nMost of these people don’t have jobs (outside of MTV) and consider this their career. I find this creepy.\n\nQ: Why do the cast members do when they’re not participating in challenges on the show?\n\nA: “Battle of the Exes” cast member Dustin Zito told The Celebrity Café that the contestants have no outside communication whatsoever.\n\n“There is no radio, there’s no Internet, phone to call home or anything,” he said in a recent interview. “It’s definitely hard when you’re there because of the lack of communication with the outside world and everything it entails it’s extremely stressful.”\n\nQ: Do the cast members know who will be on a Challenge and what the theme will be.\n\nA: Yes and no. The cast members all keep in close contact with each other so the word spreads quickly when the production company is casting for a new Challenge.\n\n“Bunim-Murray, they call like 40 people and then pick out of the 40,” Cara Maria recently said in an interview with Ifelicious.com. “This time around [Battle of the Exes] they called everybody because they know that as soon as they call a few people, that we all call each other, and we’re like ‘Oh, we already figured out the theme.’\n\nQ: Is it true that one of ‘The Challenge’ cast members is suing MTV?\n\nA: Yes! Read more about that here!\n\nGot a question about ‘The Challenge’ that you want The Ashley to find an answer to? Send it to her via The Twitter here!", "images": ["https://secure.gravatar.com/avatar/98c10d3d12eaf7a9861e330709afd66b?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/d162b38a41e7f74bf5c180baa53ed072?s=56&d=monsterid&r=r", "https://s17077.pcdn.co/wp-content/uploads/2012/03/challenge_group_retouched__feature.jpg", "https://secure.gravatar.com/avatar/ba2d1e8676d9bf79f97d43843fd7b3ba?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/b7661dbc55eb49bf9f0140b92b3e10f1?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/e06357f5aa2076960b2a7b3010121a6a?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/125cfc2df36aa956319a0a4d253a4449?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/91fc43299c2b85e5aefbfe46146f36ef?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/09e0e01633f38f0fed8815c236617cfd?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/61b8400feede6d88631dc854755bfed6?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/8282dc2da5e52f1d8ab6bc0d7249678f?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/15abf68ba61b1c6abfcdd21c8a37b680?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/a452d65f134f6c7c2931ae39f273a8c1?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/8b0f6ee95082c28a59c0290fe43abc74?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/0ca629ed8b2635861eaa7689f2f19fc2?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/b20da6bc1d1930df4cb069f85c6080ad?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/dc0ced4ae820ca9f41563faab3137b6e?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/3ce1eaf0572d8da04ceb84d1cb968790?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/3cfcc3278d4b25022ffc6da9e5a73c46?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/01817df79d53d06647850562ec957c89?s=56&d=monsterid&r=r", "https://s17077.pcdn.co/wp-content/themes/thevoux-wp-2/assets/img/logo.png", "https://secure.gravatar.com/avatar/2101450818b32f42c021b993e4eaabab?s=164&d=monsterid&r=r", "https://s17077.pcdn.co/wp-content/uploads/2012/03/ohshit-300x202.jpg", "https://secure.gravatar.com/avatar/be52c47a669d73bf4fa10a2b82fde9d7?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/498ddf7c70d176693c69220dac94cc08?s=56&d=monsterid&r=r", "https://secure.gravatar.com/avatar/3e55bd0308ae6e4b027e9f2265b39b2b?s=56&d=monsterid&r=r"], "top_img": "https://s17077.pcdn.co/wp-content/uploads/2012/03/ohshit-300x202.jpg", "keywords": [], "authors": ["The Ashley"], "canonical_link": "https://www.theashleysrealityroundup.com/2012/03/06/mtvs-the-challenge-your-frequently-asked-questions-answered/", "title": "MTV’s ‘The Challenge’: Your Frequently Asked Questions Answered!", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-mobile-web-app-capable": "yes", "apple-touch-fullscreen": "yes", "HandheldFriendly": "True", "msapplication-TileImage": "https://s17077.pcdn.co/wp-content/uploads/2016/03/cropped-NEW-LOGO-April-2017-270x270.jpg", "og": {"type": "article", "title": "MTV’s ‘The Challenge’: Your Frequently Asked Questions Answered!", "url": "https://www.theashleysrealityroundup.com/2012/03/06/mtvs-the-challenge-your-frequently-asked-questions-answered/", "description": "The Ashley has answers to all of your burning questions regarding MTV’s ‘The Challenge!’", "site_name": "The Ashley's Reality Roundup", "image": {"identifier": "https://s17077.pcdn.co/wp-content/uploads/2012/03/ohshit-300x202.jpg", "width": 300, "height": 202}, "locale": "en_US"}, "article": {"published_time": "2012-03-07T02:12:27+00:00", "modified_time": "2012-03-07T02:12:27+00:00"}, "twitter": {"text": {"title": "MTV’s ‘The Challenge’: Your Frequently Asked Questions Answered!"}, "card": "summary"}}, "movies": [], "publish_date": 1330963200.0, "source": "http://www.theashleysrealityroundup.com", "summary": ""}