{"url": "https://en.wikipedia.org/wiki/Robert_Wagner", "text": "American actor\n\nFor other people named Robert Wagner, see Robert Wagner (disambiguation)\n\nRobert John Wagner Jr. (born February 10, 1930) is an American actor of stage, screen, and television, best known for starring in the television shows It Takes a Thief (1968–1970), Switch (1975–1978), and Hart to Hart (1979–1984). He also had a recurring role as Teddy Leopold on the TV sitcom Two and a Half Men and has a recurring role as Anthony DiNozzo Sr. on the police procedural NCIS.\n\nIn movies, Wagner is known for his role as Number 2 in the Austin Powers trilogy of films (1997, 1999, 2002), as well as for A Kiss Before Dying, The Pink Panther, Harper, The Towering Inferno and many more.\n\nIn 2018, Wagner was named a person of interest in an ongoing investigation into the mysterious drowning death of his wife, Natalie Wood, in 1981.[1]\n\nEarly life [ edit ]\n\nWagner was born February 10, 1930, in Detroit, Michigan. He is the son of Hazel Alvera (née Boe), a telephone operator, and Robert John Wagner Sr., a traveling salesman who worked for the Ford Motor Company. His paternal grandparents were from Germany[2][3] and his maternal grandparents were Norwegian. Wagner has a sister, Mary. He graduated from Saint Monica Catholic High School in 1949.[4]\n\nWagner became interested in acting, and after an unsuccessful screen test directed by Fred Zinnemann for his film Teresa, Wagner was represented by Albert R. Broccoli.[5]\n\nHe made his uncredited film debut in The Happy Years (1950); was signed by agent Henry Willson and put under contract with 20th Century-Fox.[6]\n\n20th Century Fox and Columbia [ edit ]\n\n\"I started off as an ingenue,\" recalled Wagner. \"I was 19 years old. I was the boy next door. But you always felt you could work your way up, that you could have a better part in the next picture. {Head of Fox} Darryl Zanuck was always placing me in different positions.\"[6]\n\nWagner's first film for Fox was Halls of Montezuma (1951) a World War Two film. Wagner had a supporting role, with Richard Widmark as the star. The studio then had him perform a similar function in another war movie, The Frogmen (1951), again with Widmark; the cast also included another young male under contract to the studio, Jeffrey Hunter, with whom Wagner would often work. Let's Make It Legal (1951) was a comedy where Wagner again supported an older star, in this case Claudette Colbert.[7]\n\nWagner first gained significant attention with a small but showy part as a shell-shocked soldier in With a Song in My Heart (1952), starring Susan Hayward as Jane Froman.[7]\n\n\"You were part of 20th Century Fox,\" he said. \"You felt proud of being part of the organization. When I wasn't working, I was on the road, going out and selling movies or dancing on the stage and meeting the public. They never let you rest.\"[6]\n\nFox started to give Wagner better roles. He was the romantic male lead in Stars and Stripes Forever (1952), a biopic about John Philip Sousa starring Clifton Webb. He supported James Cagney and Dan Dailey in John Ford's version of What Price Glory (1952) and supported Webb again in Titanic (1953). He was in a minor Western, The Silver Whip (1953) with Rory Calhoun.[7]\n\nLeading man [ edit ]\n\nFox gave Wagner his first starring role in Beneath the 12-Mile Reef (1953). Reviews were poor but the movie was only the third ever to be shot in CinemaScope and was a big hit.[8]\n\nAlso popular was a Western, Broken Lance (1954), where Wagner supported Spencer Tracy for director Edward Dmytryk, appearing as Tracy's son. Fox gave Wagner the lead in an expensive spectacular, Prince Valiant (1954). While popular, critical reception was poor and Wagner later joked his wig in the movie made him look like Jane Wyman. He was teamed with Jeffrey Hunter in a Western, White Feather (1955).[7]\n\nWagner was borrowed by Paramount for The Mountain (1956), directed by Dmytryk, where Wagner was cast as Spencer Tracy's brother, having played his son just two years earlier in the same director's Broken Lance. He received more critical acclaim for the lead in A Kiss Before Dying (1956), from the novel by Ira Levin; it was made for Crown Productions, a company of Darryl F. Zanuck's brother in law (the leads were all under contract to Fox) and released through United Artists.[citation needed]\n\nBack at Fox he was in Between Heaven and Hell (1956), a war movie, and The True Story of Jesse James (1957), playing the leading role for director Nicholas Ray (Jeffrey Hunter was Frank). Both movies were box office disappointments and it seemed Wagner was unable to make the transition to top level star. This appeared confirmed when he was the lead in Stopover Tokyo (1957). In 1959, Wagner disparaged the film:\n\nWhen I started at Fox in 1950 they were making sixty-five pictures a year. Now they're lucky if they make thirty. There was a chance to get some training in B pictures. Then TV struck. Everything went big and they started sticking me into Cinemascope spectacles. One day, smiling Joe Juvenile with no talent was doing a role intended for John Wayne. That was in a dog called Stopover Tokyo. I've really had to work to keep up.[9]\n\nHe supported Robert Mitchum in a Korean War movie, The Hunters (1958), and appeared with a number of Fox contractees in a World War Two drama, In Love and War (1958); the latter was a hit.[citation needed]\n\nAfter a cameo in Mardi Gras (1958), Wagner supported Bing Crosby and Debbie Reynolds in Say One for Me (1959).[citation needed]\n\nTrying to kick start his career, he appeared with his then-wife Natalie Wood (they married in 1957) in All the Fine Young Cannibals (1960), made for MGM. The film was a flop.[citation needed]\n\nColumbia [ edit ]\n\nIn January 1961, Wagner and Wood formed their own company, Rona Productions, named after the first two letters of both their first names. Rona signed a three-picture deal with Columbia pictures for Wagner's services, which was to start with Sail a Crooked Ship (1961) and The Interns. He also had a deal to make one more film at Fox, which was to be Solo, the story of a jazz drummer directed by Dick Powell, or The Comancheros with Gary Cooper.[10]\n\nWagner made Sail a Crooked Ship but his part in The Interns went to Jame MacArthur. Solo was never made, and The Comancheros was made instead with John Wayne and Stuart Whitman. Wagner did make The War Lover (1962) with Steve McQueen.[11]\n\nEurope [ edit ]\n\nWagner's first marriage to Wood had broken up and he relocated to Europe. He had a small role in The Longest Day (1962), produced by Daryl Zanuck for Fox. He had a larger part in The Condemned of Altona (1962), a commercial and critical disappointment despite being directed by Vittorio de Sica.[11]\n\nConsiderably more popular was The Pink Panther (1963), a massive hit, although Wagner's part was very much in support to those of David Niven, Capucine, Peter Sellers, and Claudia Cardinale. It was directed by Blake Edwards, who wanted Wagner for the lead in The Great Race (1965), but Jack L. Warner overruled him.[12]\n\nReturn to Hollywood and Universal [ edit ]\n\nHis return to America found him playing in the theatre for the first time with the lead role in Mister Roberts for one week at a holiday resort just outside Chicago.[13] The disciplines of the theatre were not his forté and Wagner was glad to be back in Hollywood to find a good supporting role in the modern-day private investigator hit, Harper (1966), starring Paul Newman.\n\nWagner signed with Universal Studios in 1966 starring in the films How I Spent My Summer Vacation, a made-for-TV movie released in the United Kingdom as Deadly Roulette, and Banning (1967). He returned to Italy to make a caper film for MGM, The Biggest Bundle of Them All (1968), but it was not a success.[citation needed]\n\nTelevision star [ edit ]\n\nIn 1967, Lew Wasserman of Universal convinced Wagner to make his television series debut in It Takes a Thief (1968–1970) on ABC-TV. \"\"I was opposed to doing Thief,\" Wagner said later. \"But Lew Wasserman said: 'I want you to be in TV Guide every week. This is your medium, you've got to try it, you'll be great.' Roland Kibbee wrote the part for me, and I would have missed all that if I hadn't listened to Lew.\"[14]\n\nWhile the success of The Pink Panther and Harper began Wagner's comeback, the successful two-and-a-half seasons of his first TV series completed it. In this series, he acted with Fred Astaire, who played his father. Wagner was a longtime friend of Astaire, having gone to school with Astaire's eldest son, Peter. Wagner's performance would earn him an Emmy nomination for Best TV Actor.[11]\n\nDuring the making of the series he made a film for Universal, the comedy Don't Just Stand There! (1968) with Mary Tyler Moore. It was not a success. More popular was Winning (1969), a racing car drama where Wagner supported Paul Newman and Joanne Woodward. He also guest starred in The Name of the Game (1970).[citation needed]\n\nWagner's friend and agent Albert Broccoli suggested that he audition to play James Bond, but he decided it was not right for him.\n\nWagner appeared in the series pilot, City Beneath the Sea (1971), that was not picked up. The following year, he produced and cast himself opposite Bette Davis in the made-for-TV film Madame Sin, which was theatrically released overseas as a feature film.[15]\n\nHe was a regular in the BBC/Universal World War II prisoner-of-war drama Colditz (1972–1974) for much of its run. He reunited with McQueen, along with Paul Newman and Faye Dunaway, in the disaster film The Towering Inferno released in the same year. It was a massive hit, although Wagner's part was relatively small.[11]\n\nSwitch [ edit ]\n\nBy the mid-1970s, Wagner's television career was at its peak with the CBS-TV television series Switch (1975–1978) opposite Eddie Albert, Sharon Gless, and Charlie Calas after re-signing a contract with Universal Studios in 1974. Before Switch, Albert was a childhood hero of Wagner, after he watched the movie Brother Rat along with a few others. The friendship started in the early 1960s, where he also co-starred in a couple of Albert's movies. After the series' end, the two remained friends until Albert's death on May 26, 2005. Wagner spoke at his funeral, and gave a testimonial about his longtime friendship with him.[citation needed]\n\nIn partial payment for starring together in the Aaron Spelling and Leonard Goldberg production of the TV movie The Affair, Wagner and Natalie Wood were given a share in three TV series that the producers were developing for ABC.[16] Only one reached the screen, the very successful TV series Charlie's Angels, for which Wagner and Wood had a 50% share, though Wagner was to spend many years in court arguing with Spelling and Goldberg over what was defined as profit.[17]\n\nWagner and Wood acted with Laurence Olivier in Cat on a Hot Tin Roof (1976), as part of Olivier's television series Laurence Olivier Presents for the UK's Granada Television.[18]\n\nWagner had a small role in some all-star Universal films, Midway (1976) and The Concorde ... Airport '79 (1979).[19]\n\nHart to Hart [ edit ]\n\nWagner's third successful series was Hart to Hart, which co-starred Stefanie Powers and Lionel Stander and was broadcast on ABC-TV from 1979 to 1984. No one else was seriously considered for the role. George Hamilton had a high-profile at the time and was suggested, but producer Aaron Spelling said that if he was cast \"the audience will resent him as Hart for being that rich. But no one will begrudge RJ [Wagner] a nickel.\"[20]\n\nDuring the series run, Wagner reprised his old Pink Panther role in Curse of the Pink Panther (1983).[21] He also had a supporting role in I Am the Cheese (1983).[22]\n\nHe played an insurance investigator in the short-lived TV series Lime Street (1985).[11]\n\nIn 1985, he reflected, \"Bad-guy roles work if they're really good parts, but they don't come along very often. I think that what I've been doing has worked for me. Sure I'd like to do a Clint Eastwood, grizzled, down-and-out guy, but there aren't many scripts like that... What has been projected for me is an international quality that can take me anywhere and get me into all kind of involvements; to do otherwise would mean a character role.\"[23]\n\nLater career [ edit ]\n\nNCIS and older work on MBN Newsvideoweb in 2013 Wagner interviewed aboutand older work on MBN Newsvideoweb in 2013\n\nWagner appeared in a TV movie with Audrey Hepburn, Love Among Thieves (1987) and in a miniseries with Jaclyn Smith, Windmills of the Gods (1988). For Tom Mankiewicz he played a supporting part in Delirious (1991). More widely seen was Dragon: The Bruce Lee Story (1993), where Wagner played a producer.[24] Wagner played Love Letters on stage with Stefanie Powers.[25] They also reprised their Hart characters in a series of TV movies.[26]\n\nWagner's film career received a boost after his role in the Austin Powers series of spy spoofs starring Mike Myers. Wagner played Dr. Evil's henchman Number 2 in all three films: Austin Powers: International Man of Mystery (1997), Austin Powers: The Spy Who Shagged Me (1999) and Austin Powers in Goldmember (2002). He also had small roles in Wild Things (1998), Crazy in Alabama (1999), Play It to the Bone (2000), Becoming Dick (2001) and Sol Goode (2001).\n\nWagner became the host of Fox Movie Channel's Hour of Stars, featuring original television episodes of The 20th Century-Fox Hour (1955), a series which Wagner had appeared on in his early days with the studio. In 2005, Wagner became the television spokesman for the Senior Lending Network, a reverse mortgage lender and in 2010 he began serving as a spokesman for the Guardian First Funding Group, also a reverse mortgage lender. As of June 2011, Guardian First Funding was acquired by Urban Financial Group, who continue to use Mr. Wagner as their spokesperson.[27][28]\n\nIn 2007, Wagner had a role in the BBC/AMC series Hustle. In season four's premiere, Wagner played a crooked Texan being taken for half a million dollars. As Wagner is considered \"a suave icon of American caper television, including It Takes a Thief and Hart to Hart\", Robert Glenister (Hustle's fixer, Ash Morgan) commented that \"to have one of the icons of that period involved is a great bonus for all of us\".[29] Wagner also played the pivotal role of President James Garfield in the comedy/horror film Netherbeast Incorporated (2007). The role was written with Wagner in mind. He had a recurring role of a rich suitor to the main characters' mother on the sitcom Two and a Half Men. His most recent appearances on the show were in May 2008.\n\nWagner has guest-starred in ten episodes of NCIS[30] as Anthony DiNozzo Sr., the father of Anthony DiNozzo Jr., played by Michael Weatherly. Weatherly had previously appeared as Wagner in the TV movie The Mystery of Natalie Wood.[31]\n\nWagner was set to star as Charlie in the 2011 remake of Charlie's Angels, but had to exit the project due to scheduling conflicts.[32]\n\nPersonal life [ edit ]\n\nIn his memoirs, Wagner claimed to have had affairs with Yvonne De Carlo, Joan Crawford, Elizabeth Taylor, Anita Ekberg, Shirley Anne Field, Lori Nelson, and Joan Collins.[33] He also claimed a four-year romantic relationship with Barbara Stanwyck after they acted together in the movie Titanic (1953).[34] According to Wagner, because of the age difference – he was 22, she was 45 – they kept the affair secret in order to avoid damage to their careers.[35]\n\nOn December 28, 1957, the 27-year-old Wagner married 19-year-old actress Natalie Wood. They separated in June 1961 and divorced on April 27, 1962.[36]\n\nWagner and daughter Katie interviewed on MBN Newsvideoweb in 2013\n\nWhile working on location in Europe, Wagner reconnected with an old friend, actress Marion Marshall. In the spring of 1963, after a brief courtship, Wagner, Marshall, and her two children from her marriage to Stanley Donen moved back to America.\n\nWagner and Marshall married on July 22, 1963, in the Bronx Courthouse. Soon after, they had a daughter, Katie Wagner (born May 11, 1964). They divorced on October 14, 1971,[37] after eight years of marriage.\n\nIn early 1972, Wagner reconnected with Wood and remarried her on July 16, 1972[38] after a six-month courtship. Their only child together, Courtney Wagner, was born on March 9, 1974. Wood died in November 1981. Wagner subsequently became the legal guardian of Wood's daughter Natasha Gregson, then 11. He also became estranged from his former sister-in-law, Lana Wood.[39] The latter has claimed that the reason behind the couple's divorce was that Natalie caught Wagner in the arms of another man.[40]\n\nWagner and actress Jill St. John began a relationship in February 1982.[41] After eight years together, they married on May 26, 1990.[42]\n\nOn September 21, 2006, Wagner became a first-time grandfather when Katie Wagner, his daughter with Marshall, gave birth to her son Riley John Wagner-Lewis.[43]\n\nNatalie Wood drowning [ edit ]\n\nOn November 29, 1981, Wood drowned near the yacht Splendour while it was moored near Catalina Island; also on board were Wagner; Christopher Walken, who was co-starring with her in the motion picture Brainstorm; and Dennis Davern, the Splendour's captain.[39] According to Wagner, when he went to bed, Wood was not there.[44] The autopsy report revealed that Wood had bruises on her body and arms as well as an abrasion on her left cheek.[45]\n\nLater, in his memoir Pieces of My Heart, Wagner acknowledged that he had had an argument with Wood before she disappeared.[45] The autopsy found that Wood's blood alcohol content was 0.14%, and there were traces of two types of medication in her bloodstream: a motion-sickness pill and a painkiller, both of which increase the effects of alcohol. Two witnesses, who had been on a boat nearby, stated they had heard a woman scream for help during the night.[47] Following his investigation, Los Angeles County coroner Thomas Noguchi ruled her death an accident by drowning and hypothermia.\n\nThe case was reopened in November 2011 after Davern publicly stated that he had lied to police during the initial investigation and that Wood and Wagner had an argument that evening. He alleged that Wood had been flirting with Walken, that Wagner was jealous and enraged, and that following Wood's disappearance, Wagner had prevented Davern from turning on the search lights and notifying authorities. According to Davern, Wagner was responsible for Wood's death.[45][49][50][51]\n\nIn 2012, Los Angeles County Chief Coroner Lakshmanan Sathyavagiswaran amended Wood's death certificate and changed the cause of her death from accidental drowning to \"drowning and other undetermined factors.\"[52] The amended document included a statement that the circumstances of how Wood ended up in the water are \"not clearly established\". On January 14, 2013, the Los Angeles County coroner's office offered a 10-page addendum to Wood's autopsy report. The addendum stated that she might have sustained some of the bruises on her body before she went into the water and drowned.[53]\n\nOn February 1, 2018, the Los Angeles County Sheriff's Department named Wagner a \"person of interest\" in the investigation into Wood's death.[54] He has denied any involvement.[55][56][57]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nSelected television appearances [ edit ]\n\nBooks [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Wood_-_Wagner_-_1960.jpg/220px-Wood_-_Wagner_-_1960.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Robert_Wagner_on_MBN_Newsvideoweb.jpg/220px-Robert_Wagner_on_MBN_Newsvideoweb.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Jean_peters_broken_lance5.jpg/220px-Jean_peters_broken_lance5.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Robert_and_Katie_Wagner_on_MBN_Newsvideoweb.jpg/220px-Robert_and_Katie_Wagner_on_MBN_Newsvideoweb.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Robert_Wagner_1967.JPG/220px-Robert_Wagner_1967.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/2/2e/Robert_Wagner_1967.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Robert_Wagner_1967.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Robert_Wagner", "title": "Robert Wagner", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Robert_Wagner_1967.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}