{"url": "www.thehollywoodgossip.com/2018/02/kate-middleton-is-she-pregnant-with-twin-girls/", "text": "As you've likely heard by now, Kate Middleton is pregnant with her third child.\n\nBut could the Duchess of Cambridge be expecting a fourth child, as well?\n\nThat's the rumor floating around social media today thanks to a new report from Life & Style magazine.\n\nThe tabloid claims that Kate is pregnant with twins, and sonograms have revealed that she's expecting two girls.\n\nA source says Will and Kate “couldn’t be happier about their double-baby news\" and have already begun picking out names.\n\n“She’s been telling pals that she’s thrilled to be pregnant with two little princesses and has been proudly showing the sonogram to those closest to her.”\n\nYes, insiders claim a pair of princesses will be entering the world in 2018.\n\nBut don't expect any of that cutesy name nonsense:\n\n“They don’t plan to coordinate the girls’ names to rhyme or start with the same letter,\" says the source.\n\n\"Though they’re still debating the final choices, they’ve narrowed down names for the second baby, the source said: “They both like Victoria, Alice, Olivia, Alexandra, and Elizabeth.”\n\n“One of the babies was calm and relaxed, whereas the other had endless energy,” the source adds.\n\n“In a way, Kate feels like she got an idea of what the girls’ personalities are like! Kate jokes that the active baby is a ‘drama queen in the making.’”\n\nThe insider claims that the twins have already begun to express their different personalities:\n\n“Kate says the chill baby is taking after George, and her sister is like Charlotte, personality-wise,” the source continued.\n\n“But both babies have been keeping Kate awake at night, as they’re constantly hiccupping and moving around!”\n\nWe don't know why Will and Kate are bothering with all these traditional names when obviously they should dub the twins Chill Child and Princess Anxiety.\n\nJeez, it's like we have to think of everything for these royals!\n\nThe source adds that the whole family has been helping out around the palace as Kate prepares to welcome the new arrivals, including Meghan Markle who will marry Prince Harry in May:\n\n“Meghan [Markle] has been by Kate’s side during the pregnancy and is always helping out,” the source reveals.\n\n“Meghan often cooks healthy meals for Kate to ensure she’s getting all the right nutrients. She adores George and Charlotte and looks after them if Kate wants to take a nap.”\n\nYes, if the source is reliable, a royal wedding and two royal babies are on the horizon.\n\nIf this were a reality show, we'd say they're overdoing it!", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s---Eal1HUA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511884862/kate-middleton-thumbs-up.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s---Eal1HUA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511884862/kate-middleton-thumbs-up.jpg", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2018/02/kate-middleton-is-she-pregnant-with-twin-girls/", "title": "Kate Middleton: Is She Pregnant With Twin Girls?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/02/kate-middleton-is-she-pregnant-with-twin-girls/", "title": "Kate Middleton: Is She Pregnant With Twin Girls?!", "description": "Kate Middleton is reportedly pregnant with twin girls. And one source claims to have inside info regarding thr babies' names.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--mcRAV2Sl--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1507734162/kate-and-william-at-world-mental-health-day.jpg", "type": "image/jpeg", "width": 630, "height": 1003}}, "article": {"published_time": "2018-02-15T13:28:12-05:00", "modified_time": "2018-02-15T13:30:30-05:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kate Middleton: Is She Pregnant With Twin Girls?!", "description": "Kate Middleton is reportedly pregnant with twin girls. And one source claims to have inside info regarding thr babies' names.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s---Eal1HUA--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511884862/kate-middleton-thumbs-up.jpg"}}, "description": "Kate Middleton is reportedly pregnant with twin girls. And one source claims to have inside info regarding thr babies' names."}, "movies": [], "publish_date": 1518719292.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}