{"url": "https://www.rollingstone.com/culture/culture-sports/john-mcenroe-my-girls-dont-think-i-can-beat-serena-williams-201788/", "text": "John McEnroe had more than angry fans to answer to when he made disparaging remarks about fellow tennis champ Serena Williams during a recent interview with NPR: His daughters weren’t too pleased either.\n\nThe seven-time Grand Slam winner, who is father to Emily McEnroe (with ex-wife Tatum O’Neal), Anna McEnroe, Ava McEnroe and stepdaughter Ruby Meyers (with wife Patty Smyth), told Stephen Colbert during The Late Show Tuesday that his sexist remarks “didn’t go over big” with his daughters.\n\n“My girls don’t think I can beat her now,” McEnroe said. “I thought I could beat her.” In 2015, the retired athlete famously told Jimmy Kimmel that he believed he could take on Williams in a showdown; he speculated at the time that his daughters thought otherwise.\n\nEarlier this week, McEnroe caused a ruckus when he claimed in an interview with NPR that though he holds Williams in high regard, he does not believe that she would crack the top 700 in men’s tennis.\n\n“That doesn’t mean I don’t think Serena is an incredible player,” he said at the time. “I do, but the reality of what would happen would be I think something that perhaps it’d be a little higher, perhaps it’d be a little lower. And on a given day, Serena could beat some players. I believe because she’s so incredibly strong mentally that she could overcome some situations where players would choke ’cause she’s been in it so many times, so many situations at Wimbledon, The U.S. Open, etc. But if she had to just play the circuit – the men’s circuit – that would be an entirely different story.”\n\nMcEnroe’s controversial comments led to a flurry of angry reactions from tennis fans, and an irritated Wiliams even weighed in.\n\n“Dear John, I adore and respect you but please please keep me out of your statements that are not factually based,” the 23-time grand slam champ tweeted. “I’ve never played anyone ranked ‘there’ nor do I have time. Respect me and my privacy as I’m trying to have a baby. Good day sir.”\n\nDear John, I adore and respect you but please please keep me out of your statements that are not factually based. — Serena Williams (@serenawilliams) June 26, 2017\n\nI’ve never played anyone ranked “there” nor do I have time. Respect me and my privacy as I’m trying to have a baby. Good day sir — Serena Williams (@serenawilliams) June 26, 2017\n\nMcEnroe further fanned the flames Sunday when he refused to apologize for his remarks, only saying on This Morning that he didn’t mean to upset the pregnant athlete. “I don’t want anything to go wrong with Serena because she’s pregnant,” he said. “I don’t want to upset her or whatever it was. She’s – I think she was doing a tongue-in-cheek as well.”\n\nTalking with Colbert, McEnroe may have dug himself further into a hole by reiterating that he didn’t feel it was “necessary” to apologize to Williams, and even joking that perhaps it would be best for him to challenge Williams to a match during her pregnancy.\n\n“She’s pregnant, so maybe I should play her now – I’d have a better chance,” McEnroe said, soliciting a mixed reaction from the audience. “But, either way, I wish her the absolute best. She’s the best thing that’s happened to American tennis in the last 10 to 15 years.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/rs-john-mcenroe-77a246aa-270f-4b5c-9543-4f45b726055b.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-sports%2Fjohn-mcenroe-my-girls-dont-think-i-can-beat-serena-williams-201788%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=201788", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-john-mcenroe-77a246aa-270f-4b5c-9543-4f45b726055b.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-sports/john-mcenroe-my-girls-dont-think-i-can-beat-serena-williams-201788/", "title": "John McEnroe: ‘My Girls Don’t Think I Can Beat’ Serena Williams", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Legendary tennis champ John McEnroe says daughters were angered by his NPR remarks", "news_keywords": "Serena Williams", "og": {"type": "article", "title": "John McEnroe: 'My Girls Don't Think I Can Beat' Serena Williams", "url": "https://www.rollingstone.com/culture/culture-sports/john-mcenroe-my-girls-dont-think-i-can-beat-serena-williams-201788/", "description": "Notoriously outspoken tennis champ says daughters were angered by his NPR remarks", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-john-mcenroe-77a246aa-270f-4b5c-9543-4f45b726055b.jpg", "width": 1024, "height": 683, "alt": "john mcenroe, john mcenroe serena williams, serena williams, serena williams john mcenroe tennis, john mcenroe npr, serena williams pregnant, serena williams best player, serena williams champion, serena williams women's tennis, john mcenroe controversy"}, "locale": "en_US"}, "article": {"published_time": "2017-06-28T15:35:00+00:00", "modified_time": "2018-06-25T15:11:34+00:00"}, "twitter": {"text": {"title": "John McEnroe: 'My Girls Don't Think I Can Beat' Serena Williams"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-john-mcenroe-77a246aa-270f-4b5c-9543-4f45b726055b.jpg?w=1024", "alt": "john mcenroe, john mcenroe serena williams, serena williams, serena williams john mcenroe tennis, john mcenroe npr, serena williams pregnant, serena williams best player, serena williams champion, serena williams women's tennis, john mcenroe controversy"}, "card": "summary_large_image", "site": "@RollingStone", "title": "John McEnroe: ‘My Girls Don’t Think I Can Beat’ Serena Williams", "description": "Legendary tennis champ John McEnroe says daughters were angered by his NPR remarks"}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 201788, "title": "John McEnroe: 'My Girls Don't Think I Can Beat' Serena Williams", "published_at": "2017-06-28 15:35:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-john-mcenroe-77a246aa-270f-4b5c-9543-4f45b726055b.jpg?w=1024", "comment_count": 0, "tags": "Serena Williams", "topics": "Sports", "body": "John McEnroe had more than angry fans to answer to when he made disparaging remarks about fellow tennis champ Serena Williams during a recent interview with NPR: His daughters weren't too pleased either.The seven-time Grand Slam winner, who is father to Emily McEnroe (with ex-wife Tatum O'Neal), Anna McEnroe, Ava McEnroe and stepdaughter Ruby Meyers (with wife Patty Smyth), told Stephen Colbert during The Late Show Tuesday that his sexist remarks \"didn't go over big\" with his daughters.\"My girls don't think I can beat her now,\" McEnroe said. \"I thought I could beat her.\" In 2015, the retired athlete famously told Jimmy Kimmel that he believed he could take on Williams in a showdown; he speculated at the time that his daughters thought otherwise.Earlier this week, McEnroe caused a ruckus when he claimed in an interview with NPR that though he holds Williams in high regard, he does not believe that she would crack the top 700 in men's tennis.\"That doesn't mean I don't think Serena is an incredible player,\" he said at the time. \"I do, but the reality of what would happen would be I think something that perhaps it'd be a little higher, perhaps it'd be a little lower. And on a given day, Serena could beat some players. I believe because she's so incredibly strong mentally that she could overcome some situations where players would choke ’cause she’s been in it so many times, so many situations at Wimbledon, The U.S. Open, etc. But if she had to just play the circuit – the men's circuit – that would be an entirely different story.\"McEnroe's controversial comments led to a flurry of angry reactions from tennis fans, and an irritated Wiliams even weighed in.\"Dear John, I adore and respect you but please please keep me out of your statements that are not factually based,\" the 23-time grand slam champ tweeted. \"I've never played anyone ranked 'there' nor do I have time. Respect me and my privacy as I'm trying to have a baby. Good day sir.\"Dear John, I adore and respect you but please please keep me out of your statements that are not factually based.— Serena Williams (@serenawilliams) June 26, 2017\n\n\nI've never played anyone ranked \"there\" nor do I have time. Respect me and my privacy as I'm trying to have a baby. Good day sir— Serena Williams (@serenawilliams) June 26, 2017\nMcEnroe further fanned the flames Sunday when he refused to apologize for his remarks, only saying on This Morning that he didn't mean to upset the pregnant athlete. \"I don't want anything to go wrong with Serena because she's pregnant,\" he said. \"I don't want to upset her or whatever it was. She's – I think she was doing a tongue-in-cheek as well.\"Talking with Colbert, McEnroe may have dug himself further into a hole by reiterating that he didn’t feel it was \"necessary\" to apologize to Williams, and even joking that perhaps it would be best for him to challenge Williams to a match during her pregnancy.\"She's pregnant, so maybe I should play her now – I'd have a better chance,\" McEnroe said, soliciting a mixed reaction from the audience. \"But, either way, I wish her the absolute best. She's the best thing that's happened to American tennis in the last 10 to 15 years.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1498664100.0, "source": "https://www.rollingstone.com", "summary": ""}