{"url": "en.wikipedia.org/wiki/Richard_Gere", "text": "American actor\n\nRichard Tiffany Gere[1] (IPA: GEER;[2][3] born August 31, 1949)[citation needed] is an American actor and producer. He began in films in the 1970s, playing a supporting role in Looking for Mr. Goodbar (1977) and a starring role in Days of Heaven (1978). He came to prominence with his role in the film American Gigolo (1980), which established him as a leading man and a sex symbol.[4] He went on to star in many well-received films, including An Officer and a Gentleman (1982), The Cotton Club (1984), Pretty Woman (1990), Sommersby (1993), Primal Fear (1996), Runaway Bride (1999), I'm Not There (2007), Arbitrage (2012) and Norman: The Moderate Rise and Tragic Fall of a New York Fixer (2016). For portraying Billy Flynn in the Academy Award-winning musical Chicago (2002), he won a Golden Globe Award and a Screen Actors Guild Award as part of the cast.\n\nEarly life and education\n\nGere was born in Philadelphia, Pennsylvania; he grew up in Syracuse, New York.[5] His mother, Doris Ann (née Tiffany, 1924–2016),[1] was a housewife. His father, Homer George Gere (born 1922),[1] was an insurance agent for the Nationwide Mutual Insurance Company and had originally intended to become a minister.[6] Gere is their eldest son and second child.[1]\n\nHis paternal great-grandfather George Lane Gere (1848-1932) had changed the spelling of the surname from \"Geer\".[1] The direct paternal ancestor is George Geer along with his brother Thomas from Heavitree, Devon, England who settled in Connecticut Colony in 1638.[1][7] Both of his parents were Mayflower descendants; Gere's ancestors include Pilgrims Francis Eaton, John Billington, George Soule, Richard Warren, Degory Priest, Francis Cooke, and William Brewster.[1]\n\nIn 1967, Gere graduated from North Syracuse Central High School, where he excelled at gymnastics and music and played the trumpet.[6] He attended the University of Massachusetts Amherst on a gymnastics scholarship, majoring in philosophy; after two years, he left and did not graduate.[6][8]\n\nCareer\n\nStage\n\nGere first worked professionally at the Seattle Repertory Theatre and the Provincetown Playhouse on Cape Cod in 1969, where he starred in Rosencrantz and Guildenstern Are Dead. His first major acting role was in the original London stage version of Grease, in 1973.[6] Gere was one of the first notable Hollywood actors to play a homosexual character, starring as a gay Holocaust victim in the 1979 Broadway production of Bent; Gere's performance earned him a Theatre World Award.\n\nFilm\n\nHe began appearing in Hollywood films in the mid-1970s. Originally cast in a starring role in The Lords of Flatbush (1974), he was replaced after fighting with another star of the film, Sylvester Stallone. He played a small but memorable part in Looking for Mr. Goodbar (1977) and starred in director Terrence Malick's well-reviewed drama Days of Heaven (1978).[6] The crime drama American Gigolo (1980) significantly boosted his profile and the romantic drama An Officer and a Gentleman (1982) (co-starring Debra Winger) cemented Gere's ascent to stardom, grossing almost $130 million[9] and winning two Academy Awards out of six nominations;[10] Gere himself received his first Golden Globe Award nomination.[11]\n\nFor the remainder of the 1980s, Gere appeared in films of varying critical and commercial reception.[12][13] His career rebounded with the releases of Internal Affairs (1990) and Pretty Woman (1990), the latter of which earned him his second Golden Globe Award nomination.[14] The 1990s saw Gere star in successful films including Sommersby (1993) (opposite Jodie Foster), Primal Fear (1996) and Runaway Bride (1999) (which reunited him with his Pretty Woman co-star Julia Roberts).[12] He also took a leading role in the action thriller The Jackal (1997), playing former IRA militant Declan Mulqueen; Gere affected an Irish accent for the role.[15]\n\nGere was named People magazine's \"Sexiest Man Alive\" in 1999. Not long thereafter, all in the same year, he appeared in the hit films The Mothman Prophecies (2002), Unfaithful (2002) and the Academy Award-winning musical film adaptation Chicago (2002),[6] for which he won his first Golden Globe Award. Gere's ballroom dancing drama Shall We Dance? (2004) was also a solid performer that grossed $170 million worldwide.[16] His next film, the book-to-screen adaptation Bee Season (2005), was a commercial failure.[17] Gere went on to co-star with Jesse Eisenberg and Terrence Howard in The Hunting Party (2007), a thriller in which he played a journalist in Bosnia. He next appeared with Christian Bale, Heath Ledger and Cate Blanchett in Todd Haynes' semi-biographical film about Bob Dylan, I'm Not There (2007); Gere was one of six actors to portray a variation of Dylan.\n\nGere co-starred with Diane Lane in the romantic drama Nights in Rodanthe (2008). The film was widely panned by critics[18] (making #74 on The Times Worst Films of 2008 list),[19] but grossed over $84 million worldwide.[20] The film is Gere's most recent to have been produced entirely by a major film studio. Gere has expressed belief that his politics regarding China, the latter an important financial resource for major studios, have made him persona non grata within Hollywood.[21]\n\nGere embraced his apparent exile from Hollywood, appearing in independent features that garnered some of the best reviews of his career.[13] He was notably singled out for portraying businessman Robert Miller in Arbitrage (2012), earning his fourth Golden Globe Award nomination. Among many positive reviews,[22] Peter Travers of Rolling Stone cited Gere's performance as \"too good to ignore\" and \"an implosive tour de force\".[23] Lou Lumenick of the New York Post further wrote \"Richard Gere gives the best performance of his career\".[24][25] Also in 2012, Gere received the Golden Starfish Award for Lifetime Achievement from the Hamptons International Film Festival and the Career Achievement Award from the Hollywood Film Awards.[26][27] He had earlier received an award from the 34th Cairo International Film Festival in December 2010.[28]\n\nGere made a notable departure from his traditional screen persona with Norman: The Moderate Rise and Tragic Fall of a New York Fixer (2016). The political drama (written and directed by Academy Award-nominee Joseph Cedar) saw him portray Norman Oppenheimer, a \"small time Jewish 'fixer'\". Gere himself described the character as an embodiment of the \"sides of us we know are annoying and needy\".[29] His portrayal of Oppenheimer was called \"consistently, completely fascinating\" by RogerEbert.com[30] and was singled out as a worthy Academy Award contender by Variety.[31]\n\nMusic and dance\n\nGere is an accomplished musician, composing and performing the Pretty Woman piano theme and a guitar solo in Runaway Bride. He learned tap dance for Chicago and karate for An Officer and a Gentleman.[32]\n\nPersonal life and activism\n\nGere had a relationship with actress Penelope Milford in 1971–78.[33] He had relationships with Priscilla Presley in 1983[34] and Kim Basinger in 1986.[35]\n\nGere was married to supermodel Cindy Crawford in 1991-95. In November 2002, he married model and actress Carey Lowell.[36] They have a son, Homer James Jigme Gere, who was born in February 2000 and is named for his grandfathers as well as the Tibetan name Jigme.[6][37]\n\nIn September 2013, the two separated after 11 years of marriage. The couple spent three years in highly contested divorce proceedings in New York County Supreme Court.[38][39] The case was settled in October 2016.[40]\n\nIn early April 2018, he married Spanish activist Alejandra Silva.[41] In August 2018, the couple announced that they were expecting their first child,[42][43] a baby boy who was born in February 2019.[44][45]\n\nGere speaking about the Dalai Lama in 2000\n\nGere was raised Methodist.[46][47] His interest in Buddhism began when he was in his 20s.[48] He first studied Zen Buddhism[48] under Kyozan Joshu Sasaki. After having studied Zen for five or six years,[48] in 1978 he traveled with the Brazilian painter Sylvia Martins[49] to Nepal, where he met many Tibetan monks and lamas.[49] He then met the 14th Dalai Lama in India[48] and became a practicing Tibetan Buddhist of the Gelugpa school of Tibetan Buddhism[48] and an active supporter of the Dalai Lama.[6] Gere regularly visits Dharamshala, the headquarters of the Tibetan government-in-exile.[50]\n\nGere is also an advocate for human rights in Tibet. He is a co-founder of the Tibet House US, creator of the Gere Foundation and Chairman of the Board of Directors for the International Campaign for Tibet. Because he supports the Tibetan Independence Movement, he is permanently banned from entering the People's Republic of China.[51][52]\n\nIn 1993, Gere was banned from being an Academy Award presenter after he denounced the Chinese government in his capacity while announcing the nominees.[53][54]\n\nIn September 2007, Gere called for the boycott of the 2008 Beijing Olympic Games to put pressure on China to make Tibet independent. He starred in a Free Tibet-themed Lancia commercial featuring the Lancia Delta.[55] On June 27, 2011, Gere meditated in Borobudur Temple,[56] in Indonesia.\n\nGere actively supports Survival International, an organization dedicated to protecting the rights and lands of tribal peoples throughout the world.[49]\n\nHe contributed some of his writing for the book, We Are One: A Celebration of Tribal Peoples, released in October 2009.[57] Gere discussed the persecution and loss of land of the Jummas as an example of a tragic story that repeats itself in different continents of the world, calling attention to the crime against their peaceful culture and how it reflects on humankind's own relationship with nature and capacity to survive.[58] The royalties from the sale of the book go to the indigenous rights organization, Survival International.\n\nGere campaigns for ecological causes and AIDS awareness. He currently serves on the board of directors for Healing the Divide, an organization that supports global initiatives to promote peace, justice and understanding.[59] He helped to establish the AIDS Care Home, a residential facility in India for women and children with AIDS, and also supports campaigns for AIDS awareness and education in that country. In 1999, he created the Gere Foundation India Trust to support a variety of humanitarian programs in India.[60]\n\nOn April 15, 2007, Gere appeared at an AIDS awareness rally in Jaipur, India. During a live news conference to promote condom use among truck drivers, he embraced Bollywood superstar Shilpa Shetty, dipped her, and kissed her several times on the cheek. As a result of that gesture, a local court ordered the arrest of Gere and Shetty, finding them in violation of public obscenity laws. Gere has said the controversy was \"manufactured by a small hard-line political party.\" About a month later, a two-judge bench headed by the Chief Justice of India, K. G. Balakrishnan, described the case as \"frivolous\" and believed that such complaints (against celebrities) were filed for \"cheap publicity\" and have brought a bad name to the country. They ruled that Gere would remain free to enter the country.[61]\n\nGere's name is on some lists of famous vegetarians.[62][63] However, he is not a vegetarian.[64]\n\nIn 2016, he endorsed Hillary Clinton for president and donated $2,700 to her campaign.[65]\n\nIn 2016 during the TaorminaFilmFest opening night dedicated to Homeless People he launched the campaign #HomelessZero, promoted by fio.PSD, with the spot \"#HomelessZero\"\n\nHonors and awards\n\nIn 1995, he was the President of the Jury at the 19th Moscow International Film Festival.[66]\n\nOn May 17, 2012, Albanian President, Bamir Topi awarded the \"Medal of Gratitude\" to Richard Gere with the citation: \"With gratitude and honor outstanding personality of the world art, great humanist and activist for the protection of human rights, which unmasked and the American public made known, and further, inhuman crimes, ethnic cleansing in Kosovo, in 1999, the Serbian military machine against the Albanian civilian population living in its land\".[67] On February 16, 2012, the George Eastman Museum honored Gere with the George Eastman Award for distinguished contribution to the art of film.[68]\n\nPolitical views\n\nIn 2010, Gere stated that the war in Iraq wasn't supported by the American people and that the George W. Bush administration \"bullied\" Americans into the decision. He called George W. Bush a \"very poor president\".[69]\n\n\"I'm very sorry about what the U.S. has done in Iraq. This war has been a tragedy for everyone. I hope that the people of Iraq can rebuild their country,\" Gere said in a press conference held on the sidelines of the 34th Cairo International Film Festival.[70]\n\nGere stated that he was no longer welcome to participate in mainstream Hollywood films after criticizing the Chinese government and calling for a boycott of the Summer Olympics in Beijing.[71][72]\n\nIn 2017, Gere criticized Benjamin Netanyahu's policies on the Palestinians and Israel's expansion of settlements in the occupied West Bank, stating that \"Settlements are such an absurd provocation and, certainly in the international sense, completely illegal—and they are certainly not part of the program of someone who wants a genuine peace process.\"[73]\n\nFilmography\n\nFilm\n\nTelevision\n\nAwards and nominations", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Wikiversity-logo-en.svg/27px-Wikiversity-logo-en.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Flag_of_Pennsylvania.svg/24px-Flag_of_Pennsylvania.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Flag_of_New_York.svg/24px-Flag_of_New_York.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Richard_Gere%2C_December_2017.jpg/220px-Richard_Gere%2C_December_2017.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Richard_Gere_with_PM_Modi.jpg/220px-Richard_Gere_with_PM_Modi.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/24px-Audio_a.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/0/01/A_coloured_voting_box.svg/21px-A_coloured_voting_box.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/39/Richard_Gere%2C_December_2017.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Richard_gere2.jpg/170px-Richard_gere2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Asia_%28orthographic_projection%29.svg/21px-Asia_%28orthographic_projection%29.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/27px-Wiktionary-logo-v2.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/24px-Flag_of_the_People%27s_Republic_of_China.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Richard_Gere_by_John_Mathew_Smith.jpg/170px-Richard_Gere_by_John_Mathew_Smith.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/P_culture.svg/23px-P_culture.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/39/Richard_Gere%2C_December_2017.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Richard_Gere", "title": "Richard Gere", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/39/Richard_Gere%2C_December_2017.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}