{"url": "nypost.com/2018/04/08/how-tina-fey-messed-up-mean-girls-musical/", "text": "Mean should never feel this warm and fuzzy.\n\nTina Fey’s musical opened on Broadway Sunday night, in a high-budget but watered-down adaptation of her wonderfully nasty, 2004 hit comedy. This is “Mean Girls” lite.\n\nDirected and choreographed by Casey Nicholaw, the musical starts on a high note, with stage-wall projections of the infamous Burn Book’s slams — “I suck in all ways,” “Can’t contour for s - - t.” A likably daffy Erika Henningsen gets out from under the long shadow cast by the teenage Lindsay Lohan as Cady Heron, transported from the Kenyan savannah, where she was homeschooled, to suburban Chicago.\n\nOnce there, she’s thrown into a different wild kingdom — high school, where a clique known as the Plastics reigns supreme. Narrating the action is the outsider duo of Janis (Barrett Wilbert Weed, who makes an excellently sardonic Goth girl) and the “almost too gay to function” Damian (a droll Grey Henson), who befriend Cady and goad her into going undercover to undo the Plastics’ queen bee.\n\nHere’s the thing: As off-Broadway’s “Heathers” proved, it’s tough to transfer a big-screen bitch onto the stage. As Regina George, Taylor Louderman can really belt, stomping around on a cafeteria table in tight white denim announcing she’s a “massive deal.” But she comes across as less cruel nightmare, more future reality-show star. As her wingwomen, Ashley Park’s Gretchen Wieners is a fluttery mass of insecurity, while Kate Rockwell’s Karen Smith is still dumb as rocks but not as overtly laughable; here, thanks to Fey’s updated book about the hazards of social media, Karen’s a sexting victim.\n\n“Mean Girls” fans will love hearing their favorite lines, from “On Wednesdays we wear pink” to “Stop trying to make ‘Fetch’ happen!” and “You go, Glen Coco!” To their credit, Fey, her composer-husband Jeff Richmond and lyricist Nell Benjamin have resisted crafting these into shameless musical numbers (though I’d have liked to see Coco get his moment in the spotlight). But many of the songs feel like padding, including an uninspired ballad (“More Is Better”) between Cady and her love interest, Aaron (Kyle Selig).\n\n“Mean Girls” the musical is best when it breaks from the movie. Damian amps up the energy in the room with a tap-dancing ode to the perils of smartphone addiction (“Stop”), and another song, “Apex Predator,” links Cady’s zoologist past to the primal rites of high school.\n\nIn this post-“13 Reasons Why” world, some of Fey’s script changes are for the better. The film’s racially branded social groups are exchanged for monikers like “Woke Seniors,” and there are far fewer mentions of “sluts” and “whores.” Fey still finds her way to the core of the story.\n\n“Calling someone ugly doesn’t make you better looking,” says math teacher Ms. Norbury (Kerry Butler, doing a credible Fey imitation). “We have to stop beating each other up over every little thing, ’cause meanwhile men are running around grabbing butts and shooting everybody!”\n\nBut let’s be real: Fey is at her funniest when she’s brutally cutting, and songs like Getchen’s lament, “What’s Wrong With Me?,” and Karen’s PG-rated ode to racy Halloween costumes (“Sexy”) fall far short of the so-real-it’s-painful zingers from her film.\n\nFey’s show has heart, but it’s not terribly fetch.", "images": ["https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=1200", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["Sara Stewart", "April"], "canonical_link": "https://nypost.com/2018/04/08/how-tina-fey-messed-up-mean-girls-musical/", "title": "How Tina Fey messed up ‘Mean Girls’ musical", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "Mean should never feel this warm and fuzzy.\nTina Fey’s musical opened on Broadway Sunday night, in a high-budget but watered-down adaptation of her...", "generator": "WordPress.com", "og": {"type": "article", "title": "How Tina Fey messed up ‘Mean Girls’ musical", "url": "https://nypost.com/2018/04/08/how-tina-fey-messed-up-mean-girls-musical/", "description": "Mean should never feel this warm and fuzzy. Tina Fey’s musical opened on Broadway Sunday night, in a high-budget but watered-down adaptation of her wonderfully nasty, 2004 hit comedy. This is “Mean…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-04-09T02:01:38+00:00", "modified_time": "2018-04-09T16:28:52+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@sarafstewart", "site": "@nypost", "text": {"title": "How Tina Fey messed up ‘Mean Girls’ musical"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2018/04/060418-mean-girls-bway1.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "How Tina Fey messed up 'Mean Girls' musical", "description": "Mean should never feel this warm and fuzzy.\nTina Fey’s musical opened on Broadway Sunday night, in a high-budget but watered-down adaptation of her wonderfully nasty, 2004 hit comedy. This is"}, "fb": {"pages": 225343690812937}, "nypost-section": "Entertainment", "parsely-metadata": "{\"post_id\":\"nypost-12399476\"}", "keywords": "Theater,broadway,broadway musicals,mean girls,tina fey", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 1523116800.0, "source": "http://nypost.com", "summary": ""}