{"url": "abcnews.go.com/Primetime/story?id=132445&page=1", "text": "Oct. 8, 2003 -- Gwyneth Paltrow says she wasn't surprised to see her ex-boyfriend Ben Affleck's planned wedding to Jennifer Lopez be put on hold last month.\n\n\"Ben makes life tough for himself,\" Paltrow told ABCNEWS' Diane Sawyer in an exclusive interview airing in full on Primetime Thursday. \"He's got a lot of complication, and you know, he really is a great guy. So I hope he sorts himself out.\"\n\nPaltrow dated Affleck on and off for two years, but says she never expected to end up with him. \"I just think we have a very different sort of value system,\" she said.\n\nNowadays, the blonde-tressed actress is dating Coldplay singer Chris Martin. She broke up with Affleck for good in October 2000, and says she no longer communicates with him.\n\nAn Enduring Grace\n\nPaltrow is back in her hometown of New York after spending some time abroad. It's a busy time for the 31-year-old star, who has taken a challenging new role in the movie Sylvia, about the life of American poet and novelist Sylvia Plath. She is also coping with the loss of her father, producer-director Bruce Paltrow, who passed away last year.\n\nFrom her early stardom in Emma (1996), to her Oscar-winning role in Shakespeare in Love (1998) and her singing debut in Duets (2000), Paltrow has managed to maintain a certain grace while living her adult life in front of the cameras. The scrutiny was ongoing through the breakup of her engagement with Brad Pitt and then, those two years with Affleck.\n\nWhile they were dating, Affleck told Good Morning America that he believed Paltrow's perfect man would be someone like her dad. She said that his perfect woman would be \"any sort of stripper at Scores. Anyone that serves cold beer in a bikini.\" Paltrow laughed at the memory.\n\n\"Oh, God!\" she joked. \"Why do I drink before these interviews?!\"\n\nLosing the ‘Perfect Man’\n\nIt has been a long and bruising year for Paltrow. Her father — the \"perfect man\" Affleck spoke of — died of cancer last year.\n\n\"I'm really like the daddy's girl of all time,\" Paltrow said. \"And I just always wanted to get in his pocket.\"\n\nIn October 2002, the family thought his cancer was at bay, and he went to Rome to celebrate Gwyneth's 30th birthday. But he began feeling sick.\n\n\"We got him to the hospital and he didn't make it through the first night, because the cancer had come back,\" Paltrow said. \"It was in his bronchial tubes, which we didn't know. None of us knew, including him, thank God.\"\n\nShe thinks it is a blessing that her father did not know how sick he was.\n\n\"Because he would have faced a few really miserable months and I don't know, I think there's something kind of elegant and great about dying in Rome,\" she said.\n\nBut the grieving period was extremely difficult for Paltrow. The young actress said she couldn't believe she was able to wake up and function each day while feeling such pain.\n\nPlaying a ‘Complicated, Cracked Spirit’\n\nJust two weeks after his death, Paltrow started work on the new movie being released Oct. 17, called Sylvia. It is based on the life of the brilliant and lyrical poet, Sylvia Plath, who struggled through a rocky marriage before committing suicide.\n\n\"She was this woman in the '50s and she was trying to be everything that a woman in the '50s was supposed to be,\" Paltrow said. \"A wife and a mother, and a baker and a sewer and an organizer. And she was also most importantly this incredibly complicated, cracked spirit.\"\n\nThere was someone else in the movie who had to work through heartbreak, too: Gwyneth Paltrow's mother, actress Blythe Danner, who plays Plath's mother in the movie.\n\nGwyneth said that she wants so much to see her mother heal.\n\n\"I would just love her to have some peace and — you know she's had — we've all had such a difficult time with it,\" Paltrow said. \"She's so incredible and she's such a beautiful woman and she's so full of life. And she's in so much pain. So I hope that sort of subsides.\"", "images": ["http://abcnews.go.com/Primetime/null", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "http://abcnews.go.com/Primetime/null", "keywords": [], "authors": ["Abc News", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/Primetime/story?id=132445&page=1", "title": "Paltrow Not Surprised at J.Lo-Affleck Drama", "meta_data": {"keywords": "Gwyneth Paltrow, interview, Diane Sawyer, Ben Affleck,", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Paltrow Not Surprised at J.Lo-Affleck Drama", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Primetime/story?id=132445&page=1", "title": "Paltrow Not Surprised at J.Lo-Affleck Drama", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2006-01-06T23:42:21Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,132445", "ipad": "abcnewsipad://link/story,132445", "googleplay": "https://abcnews.go.com/Primetime/story?id=132445&page=1"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Paltrow Not Surprised at J.Lo-Affleck Drama", "url": "https://abcnews.go.com/Primetime/story?id=132445&page=1", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,132445", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,132445", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Primetime/story?id=132445&page=1", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Primetime/story?id=132445&page=1"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}