{"url": "www.mercurynews.com/2017/07/25/maybe-justin-bieber-wants-to-start-his-own-church-report-from-down-under-says/", "text": "As Justin Bieber shocked the worldwide Belieber community Monday by canceling the remaining 15 dates of his Purpose tour, he explained he’s fine but needed to take a break after 16 intense months of being on the road.\n\nThe 23-year-old singer also said he needed to go on some “bike rides” — or perhaps hikes, as he was photographed over the weekend, striding shirtless in the company of a beautiful brunette model in the hills around Los Angeles, Page Six reported.\n\nIn any case, maybe the world should take Bieber at his word, that he’s fine and not on the verge of some kind of physical or mental breakdown — or that he’s being an arrogant jerk.\n\nIndeed, a report from Down Under suggests that Bieber is feeling so good about life that he might want to share that good feeling with others and start his own church.\n\nElle magazine, citing a “world exclusive” report from Australia’s Today Show, said that the real reason Bieber decided to end his tour is that he wants to “reconnect with his faith.” TMZ also cited sources as saying that Bieber suddenly quit the tour because “rededicated his life to Christ.”\n\nWORLD EXCLUSIVE: An inside source revealed @JustinBieber cancelled his world tour to focus on his faith and start his own church. #9Today pic.twitter.com/BzZw1cnihC — The Today Show (@TheTodayShow) July 25, 2017\n\nBieber is well known for attending the Hillsong Church, described in a 2015 GQ report as the megachurch “of choice” for hot young celebrities like Bieber, as well as Kevin Durant, Kendall Jenner and Selana Gomez. “It’s where the cool kids spend Sunday morning after Saturday night at the club,” the GQ piece said.\n\nThe Pentecostal church was founded in New South Wales in 1983 and has since expanded to outposts all over that country as well as the world, from Kiev to Paris to Buenos Aires. Most notably, there is the Hillsong NYC, which opened in New York in 2010, the Guardian reported.\n\nThe church is led by “rock star preacher” Carl Lentz who spoke of bringing Bieber to salvation in that GQ piece and who shadowed him on his tour of Australia in March. Pastor Carl, as he is known, said Bieber got down on his knees “ravaged by loss” and sobbed: “I want to know Jesus.”\n\nIn early July, Bieber, who has a “Son of God” tattoo across his chest, attended the annual Hillsong conference in Sydney, Australia with Pastor Carl, the Daily Mail reported. He secretly arrived via private plane for the three-day event and appeared “in happy spirits.”\n\nThe source told Australia Today: “We know that he was in (Australia) a few weeks ago having meetings and attending the big Hillsong convention that they had here.”\n\nThe source added that Bieber is very close to “a lot of the Hillsong people.” However the source conceded it’s not yet certain whether Bieber is looking to partner with the Hillsong people in some way, or is considering some “religious activity on his own,” including “starting his own church.”\n\nSo, the Belieber community will just have to wait and see but maybe they’ll soon be hearing from Pastor Justin.", "images": ["https://www.mercurynews.com/wp-content/uploads/2017/07/bieber.jpg?w=1024&h=668", "http://thumbnail.newsinc.com/32740886.sf.jpg", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/07/bieber.jpg?w=1024&h=668", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/07/25/maybe-justin-bieber-wants-to-start-his-own-church-report-from-down-under-says/", "title": "Maybe Justin Bieber quit tour to start his own church, reports say", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "A report from an Australian TV news show suggests that Justin Bieber canceled the rest of his world tour because he wants to 'reconnect' with his faith.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Maybe Justin Bieber quit tour to start his own church, reports say", "url": "https://www.mercurynews.com/2017/07/25/maybe-justin-bieber-wants-to-start-his-own-church-report-from-down-under-says/", "description": "A report from an Australian TV news show suggests that Justin Bieber canceled the rest of his world tour because he wants to ‘reconnect’ with his faith in a big way.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/07/bieber.jpg?w=1024&h=668", "width": 1024, "height": 668}, "locale": "en_US"}, "article": {"published_time": "2017-07-25T14:58:57+00:00", "modified_time": "2017-07-25T22:12:48+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Maybe Justin Bieber quit tour to start his own church, reports say"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/07/bieber.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1500912000.0, "source": "http://www.mercurynews.com", "summary": ""}