{"url": "https://en.wikipedia.org/wiki/Shondaland", "text": "Shondaland (stylized as ShondaLand from 2005–2016 and shondaland) is an American television production company founded by television writer/producer Shonda Rhimes.[1] She founded it to be one of the production companies of her first series Grey's Anatomy in 2005. It has since gone on to produce Rhimes's other creations, Grey's spinoff Private Practice and the widely popular political drama Scandal, and her other productions—the short-lived Off the Map, the Viola Davis-starring legal thriller How to Get Away with Murder, and the crime thriller The Catch—all of which are co-produced with ABC Studios and air on ABC. As of 2017, it has a partnership affiliation with Netflix, and before that Disney-ABC.\n\nHistory [ edit ]\n\nProgramming block [ edit ]\n\nIn 2014, the ABC network programmed its entire Thursday primetime lineup with television series produced by Shondaland, then branded the Shondaland-filled programming block as \"Thank God It's Thursday,\" also referred to in its shortened form, TGIT.[2] This echoes ABC's former TGIF branding of its Friday night family sitcoms[3] and NBC's Must See TV promotion of formidable Thursday night television hits in the 1990s. Thursday is an especially important night for American television networks because it is the last chance for advertisers of weekend purchases, like movies and cars, to reach a large TV audience, and networks schedule highly rated programming for the night to attract those advertising dollars.[4] The Associated Press called Rhimes' reign of an entire night of network television \"unmatched in TV history.\"[5]\n\nProductions [ edit ]\n\nThe first series produced by Shondaland is Grey's Anatomy, which premiered on March 27, 2005, and currently is broadcasting its sixteenth season.[6] In 2007, Private Practice premiered, and lasted for six seasons, until its final broadcast, on January 22, 2013.[7] The third installment, Off the Map, was created by Jenna Bans and lasted for only one season, in 2011.[8] Scandal and How to Get Away with Murder, premiered in 2012 and 2014, respectively, with the latter still in production, and the former airing its final episode on April 19, 2018. The comedy-driven crime drama The Catch aired for two seasons and received generally positive reviews from critics.[9] The period drama Still Star-Crossed premiered on May 29, 2017, and was cancelled after one season.[10] The legal drama For the People, created by Paul William Davies and set to premiere in the 2017–18 television season,[11] is the eighth television series produced by Shondaland. In May 2019, it was cancelled after two seasons.[12] It was announced on January 3, 2018 that Scandal and How to Get Away With Murder would crossover with one another in Shondaland's first crossover event (excluding spin-offs).[13]\n\nWebsite [ edit ]\n\nIn 2017, Shondaland launched the lifestyle website Shondaland.com in partnership with Hearst.[14]\n\nInitiatives [ edit ]\n\nShonda Rhimes shares her knowledge with aspiring screenwriters and producers through ShondaLand and initiatives for her MasterClass.com program.[15]\n\nShondaland partnered with Seriesfest[16] in 2019 to launch the Women's Directing Mentorship,[17] a competition designed to discover aspiring female directors.[18][19] The Seriesfest panel included Shondaland's Head of Fiction Alison Eakle, Akua Murphy, Katie Lowes and Anna Deavere Smith.[20]\n\nShonda Rhimes partnered with iHeartMedia,[21] to launch Shondaland Audio.\n\nShondaland overview [ edit ]\n\nRecurring actors [ edit ]\n\nSome actors appear in more than one television show produced by Shondaland. Currently, Liza Weil, Mimi Kennedy, John Getz, José Zúñiga, and Cynthia Stevenson are the only actors to make appearances in four shows.\n\n= Main role = Recurring role", "images": ["https://upload.wikimedia.org/wikipedia/commons/f/f1/Images.Shondaland.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0f/Hearst_logo.svg/130px-Hearst_logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Images.Shondaland.png/220px-Images.Shondaland.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Images.Shondaland.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Shondaland", "title": "Shondaland", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Images.Shondaland.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}