{"url": "https://people.com/tv/farrah-abraham-splits-aden-stay/", "text": "Farrah Abraham has called it quits with boyfriend Aden Stay.\n\nJust days after the former Teen Mom OG star spoke with PEOPLE about Stay, she has ended her romance with the Hollywood stuntman, Radar first reported.\n\nGet push notifications with news, features and more.\n\n“I need to watch whom I date as many men target me for my success. I’m focused on work right now between TV and film projects,” she said in a statement to PEOPLE Wednesday.\n\n“I found it interesting what Rebel Wilson said in an interview about him and how similar mine was — it’s showing and telling,” Abraham said about Stay, who was previously linked to actress Rebel Wilson.\n\n“I wish him well, but I’m not rushing into relationships and I like to take my time to do it right for myself and my daughter,” Abraham added. “Being the best parent I can be is my priority.\n\nShe also shared that she has “met someone new,” but is keeping her “dating life low-key for now.”\n\nAbraham, who is the single mother of 9-year-old daughter Sophia, told PEOPLE that she was “super lucky” to be in a relationship with Stay, who has worked on movies like Pitch Perfect 3 and Logan. “When you find someone and you have that connection, I think [that] is so rare.”\n\n“He’s pretty amazing — hopefully he will ‘stay’ around,” she added.\n\nStay also issued a statement to PEOPLE following their split, denying that he dated the reality star for fame or success.\n\n“Our split had nothing to do with success. I have zero desire to be famous. I never even knew she was on a reality TV show that I’ve never even seen, or herd of. No offense to the show. She’s a nice person from what I got to know on the two dates we went on. But that’s as far as it went. I think the whole thing got blown a little out of proportion because of her role on her show,” said Stay.\n\n“I wish her success in what ever ventures she is going to do in the future. But as for me, I’m going to keep being a stuntman and keep making actors look there best,” he continued. “I’ll be single till the right woman comes my way. And I know with a little help from the big man up stairs, that day will come. Mahalo for your time.”\n\nImage zoom Farrah Abraham and Aden Stay Stefanie Keenan/Getty; BACKGRID\n\nThe MTV personality previously was linked to her on-again, off-again boyfriend Simon Saran for more than two years, but the pair called it quits in April 2017. Her relationship with Saran was the first to be documented on the show since her high school boyfriend, Derek Underwood, died in a car accident two months before their daughter Sophia was born.\n\n“When I met Sophia’s father, it was like love at first sight,” she said.\n\n“Luckily, I’ve been blessed to work around some great people and met [Aden] and it was kind of like love at first sight again. I honestly felt for a while I didn’t deserve to have an amazing relationship or if that would ever happen,” Abraham said. “So if I was single for the rest of my life, I was more than prepared to enjoy that journey.”\n\nHer split comes on the heels of her lawsuit against Viacom. After announcing she was “moving on” from the MTV series in January, blasting the show as “hateful” and “horrible,” the reality star is taking legal action, suing parent company Viacom for $5 million.\n\nAccording to court documents obtained by The Blast, Abraham claims she was fired because of her decision to work in the adult entertainment industry. The 26-year-old previously released sex tapes with Vivid Entertainment in 2013 and 2014 with porn star James Deen, and since then, she has done adult webcam shows and appearances at strip clubs. She has also endorsed sex toys.\n\n“We respect Farrah’s decision to pursue other endeavors and we wish her the best,” a Viacom spokesperson told PEOPLE. “Regarding her suit, the claims are without merit.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1024&h=536&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1024&h=536&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg", "keywords": [], "authors": ["Natalie Stone", "Brianne Tracy"], "canonical_link": "https://people.com/tv/farrah-abraham-splits-aden-stay/", "title": "Farrah Abraham Splits from Boyfriend Aden Stay", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Breakups,Farrah Abraham,News,Teen Mom OG,TV", "news_keywords": "Breakups,Farrah Abraham,News,Teen Mom OG,TV", "description": "Farrah Abraham told PEOPLE that \"it was kind of like love at first sight again\" when she met Aden Stay", "og": {"title": "Teen Mom OG's Farrah Abraham Splits from Boyfriend Aden Stay", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/farrah-abraham-splits-aden-stay/", "description": "Farrah Abraham has called it quits with boyfriend Aden Stay. Just days after the&nbsp;former Teen Mom OG&nbsp;star spoke with PEOPLE about Stay, she has ended&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1024&h=536&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg", "width": 1024, "height": 536}}, "pinterest": {"url": "https://people.com/tv/farrah-abraham-splits-aden-stay/", "description": "Farrah Abraham told PEOPLE that \"it was kind of like love at first sight again\" when she met Aden Stay", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/farrah-abraham-splits-aden-stay/", "title": "Teen Mom OG's Farrah Abraham Splits from Boyfriend Aden Stay", "description": "Farrah Abraham told PEOPLE that \"it was kind of like love at first sight again\" when she met Aden Stay", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1024&h=536&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Ffarrah-abraham.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}