{"url": "https://www.self.com/story/gina-rodriguez-february-2018", "text": "When I spoke to Gina Rodriguez on a recent Wednesday night, I was still pumped from attending a press screening of her latest movie, Annihilation, earlier that day (a fact that Rodriguez met with delighted laughter, admitting that even she hadn’t seen it yet). I have very high standards for sci-fi and horror films—I expect to startle and gasp and cover my eyes—and this movie didn’t just clear my very high bar; it vaulted over it. But to be honest, even if it had failed to register on my scare-o-meter, I would have loved it for what it is at its heart: in Rodriguez’s words, “a human story and…bad bitches going into action.”\n\nIn the film, which lands in theaters nationwide on Friday, February 23, Rodriguez plays Anya Thorensen, a paramedic who has volunteered to explore The Shimmer, a mystifying, dangerous, ever-expanding territory. Those who go into The Shimmer often don’t return.\n\nVenturing into the force field alongside Anya are women toting guns, ammo, and advanced degrees in STEM: biologist Lena (Natalie Portman), physicist Josie (Tessa Thompson), geologist Cass (Tuva Novotny), and psychologist Dr. Ventress (Jennifer Jason Leigh). Together, they’re determined to do what practically no one else has: enter The Shimmer, discover what it is, and return unscathed.\n\nThe role fit Rodriguez like Anya’s well-worn fatigues. “The classic roles that are afforded to me—here, Gina, this is what you’re capable of doing—are usually roles I don’t even relate to,” she says, explaining that she identifies more with layered parts like the main character in Lady Bird than with parts inscribed by one-dimensional Latina stereotypes. Playing Anya? “It felt like butter.”\n\nNadya Wasylko. Wardrobe Styling by Shibon Kennedy. Makeup by Carissa Ferreri with Tracey Mattingly. Hair by Paul Norton with Tracey Mattingly. On Gina: Bralette by Calvin Klein. Top by 3.1 Phillip Lim. Leggings by Opening Ceremony.\n\nMaybe that’s because the film could be a metaphor for her life for the last several years: Flanked by her own support squad, Rodriguez has marched headlong into a forbidding reality of chronic illness and come out stronger and bolder than ever. As she asserts her power in her personal life and her career, battling forces that, like The Shimmer, loom large and seemingly beyond her control, she is fighting not just for herself, but for other women in Hollywood and beyond, forging for them a path forward and up.\n\nRodriguez, 33, has Hashimoto’s disease, an autoimmune condition that wages war on the thyroid gland, which produces hormones that influence how your body uses energy. Hashimoto’s can lead to an underactive thyroid that doesn’t produce enough of these hormones, and symptoms can be devastating and wide-ranging, including fatigue, joint pain, memory issues, and weight gain, to name a few.\n\n“To the core of my being, I know what it’s like to feel like there is no way I can win this, so where do I even begin?”\n\nAt first, Rodriguez says, Hashimoto’s felt like “the curse of a lifetime,” especially in an industry that places so much emphasis on size. The disease, though treatable, has no cure. For years after being diagnosed with hypothyroidism at 19 and Hashimoto’s at 26, and putting on weight that wouldn’t budge, Rodriguez preferred to deny what she was going through rather than focus her efforts on doing whatever she could to feel better. “To the core of my being, I know what it’s like to feel like there is no way I can win this, so where do I even begin,” she reflects.", "images": ["https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg", "https://media.self.com/photos/5a7dfbbde1c59b0841326f99/master/w_1600%2Cc_limit/Gina_Rodriguez_1.jpg", "https://media.self.com/photos/5a7dfbbea2e4610403db1d80/master/w_1600%2Cc_limit/Gina_Rodriguez_2.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/5a7dfbc5a2e4610403db1d86/master/w_1600%2Cc_limit/Gina_Rodriguez_6.jpg", "https://media.self.com/photos/57e1f41894d0889f18bc7098/1:1/w_90%2Cc_limit/Zahra_Barnes-2.jpg", "https://media.self.com/photos/5a85e2bee1c59b0841327607/4:3/w_2560%2Cc_limit/gina-rodriguez-alexander-wang.jpg", "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/w_1280,c_limit/gina-rodriguez-alexander-wang.jpg", "https://media.self.com/photos/5a7dfbc3a2e4610403db1d84/master/w_1600%2Cc_limit/Gina_Rodriguez_4.jpg"], "top_img": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/w_1280,c_limit/gina-rodriguez-alexander-wang.jpg", "keywords": [], "authors": ["Zahra Barnes", "Zahra Barne"], "canonical_link": "https://www.self.com/story/gina-rodriguez-february-2018", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Zahra Barnes", "copyright": "Copyright (c) Condé Nast 2020", "description": "Actor and director Gina Rodriguez is taking on Hollywood, and dealing with Hashimoto's disease. She tells SELF about her health and her new movie, Annihilation.", "id": "5a85d872a2e4610403db23e3", "keywords": "culture,gina rodriguez,hypothyroidism,mental health,panic attacks,anxiety,hashimoto's disease", "news_keywords": "culture,gina rodriguez,hypothyroidism,mental health,panic attacks,anxiety,hashimoto's disease", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a85d872a2e4610403db23e3", "parsely-metadata": "{\"description\":\"Actor and director Gina Rodriguez is taking on Hollywood, and dealing with Hashimoto's disease. She tells SELF about her health and her new movie, Annihilation.\",\"image-16-9\":\"https://media.self.com/photos/5a7dfbc3a2e4610403db1d84/16:9/w_1000,c_limit/Gina_Rodriguez_4.jpg\",\"image-1-1\":\"https://media.self.com/photos/5a7dfbc3a2e4610403db1d84/1:1/w_1000,c_limit/Gina_Rodriguez_4.jpg\"}", "og": {"description": "The actor is taking on Hollywood, taking over her health, and taking it one day at a time.", "image": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/w_1280,c_limit/gina-rodriguez-alexander-wang.jpg", "site_name": "SELF", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself", "type": "article", "url": "https://www.self.com/story/gina-rodriguez-february-2018"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "The actor is taking on Hollywood, taking over her health, and taking it one day at a time.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5a85e2bee1c59b0841327607/2:1/w_1280,c_limit/gina-rodriguez-alexander-wang.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Gina Rodriguez on Hashimoto's, Equal Pay, and Learning to Fight For Herself"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}