{"url": "www.mercurynews.com/2018/06/29/katie-holmes-trials-fighting-reports-about-a-jamie-foxx-breakup-and-a-tom-cruise-suri-reunion/", "text": "Poor Katie Holmes! That is, if you believe a series of reports swirling around the former “Dawson’s Creek” actress and her relationships with boyfriend Jamie Foxx, ex-husband Tom Cruise and daughter Suri.\n\nAccording to a report in RadarOnline, Holmes and Foxx were on the verge of marrying in a lavish $300,000 ceremony, with 12-year-old Suri as her bridesmaid. This supposed wedding would finally make their relationship permanent and open after five years of mostly covert dating.\n\nBut then the 39-year-old actress and single mom realized her 50-year-old, Oscar-winning boyfriend wasn’t ready to give up his flirtatious bachelor ways, including his friendly relationship with Kristin Grannis, his ex-girlfriend and mother to his 8-year-old daughter, RadarOnline reported. Indeed, Foxx took Grannis, not Holmes, with him to Leonardo DiCaprio’s birthday party in November, the site alleges.\n\nSo Holmes called off the wedding and quietly told her “Django Unchained” boyfriend they needed to break up.\n\n“Jamie balked at the idea of signing (a prenup with a no-cheating clause) because he realized that being unfaithful could be costly,” a source told RadarOnline. “Katie noticed a total lack of respect in Jamie’s behavior. She knew it wasn’t healthy for her or Suri, and she has to protect them both.”\n\nAt the same time, Holmes has supposedly been dealing with efforts by her mega-star ex-husband Cruise to push his way back into their daughter Suri’s life. According to Hollywood Life, citing a report by Star magazine, Cruise ached over the fact that he had been an absent father and not seen his daughter in more than five years, because his Church of Scientology bosses told him he couldn’t see her.\n\n“Tom is a loyal Scientologist, so when church leaders told him he couldn’t see Suri, he didn’t question it,” an insider told the Star. “But Tom’s tired of being bossed around by them. He’s had to watch from afar as Suri grew into a lovely young lady, and he regrets that he’s missed out on so much. He’s dying to be a part of her life!”\n\nHolmes isn’t a fan of a reunion, given that she agreed to stay quiet about Cruise and Scientology if he agreed to stay away from their daughter and not try to “brainwash” her into becoming a part of the controversial self-styled religious organization, the Star reported. But Holmes also was torn because she wants to do what’s best for Suri.\n\n“She’s slowly warming up to the idea of a reunion,” an insider told the Star. “Suri must desperately be missing her dad, and in the end, Katie only wants what’s best for her. Tom has assured her he won’t bring his religion into it, and Katie is starting to believe him.”\n\nRepresentatives for Holmes have denied both the report about her and Foxx breaking up and the report about a Cruise and Suri reunion.\n\nBut notably, the denial about the Foxx breakup report comes from Holmes’ publicist, who was willing to attach her name to her statement.\n\n“The Radar story is 100 percent untrue,” Leslie Sloane, the representative for Holmes told People.\n\nPeople and other outlets attached a great deal of significance to the fact that Holmes’ publicist denied the report because her statement marks the first official, on-the-record acknowledgement from either Holmes or Foxx that a relationship has even existed.\n\nAfter the two reportedly began dating in 2013, they went to great lengths to keep their relationship a secret, with Holmes even donning a disguise at one point to meet up with him in a restaurant.\n\nThe secrecy was necessary because Holmes was legally obligated by her divorce settlement from Cruise to not publicly date anyone for five years after their breakup, according to reports in September 2017.\n\nThose reports came after Holmes and Foxx were photographed by a paparazzo walking hand-in-hand on a Malibu beach. There was speculation at the time that the two knew they were being photographed and allowed themselves to be seen together in this way because that five-year public dating ban had expired. They were finally ready to announce to the world that they were a couple.\n\nSince then, Holmes and Foxx have been spotted together more openly at various events, including sitting next to each other at Clive Davis’s Pre-Grammy Awards Gala in January, People reported. Holmes also turned up at Foxx’s 50th birthday party in Los Angeles in mid-December.\n\nHolmes’ romantic history has long been marked by intense, high-profile highs and devastating lows, especially surrounding her high-octane courtship and marriage to Cruise.\n\nHolmes and Cruise got engaged in 2005 after just seven weeks of dating. Cruise famously gushed about his love for Holmes by jumping on Oprah Winfrey’s TV show couch. They became parents to daughter Suri in 2006 and married in a lavish Church of Scientology wedding in an Italian castle.\n\nHolmes initiated the divorce from Cruise because she reportedly became concerned about raising Suri as a Scientologist. Numerous investigative reports over the years have shown that the Church exercises an enormous amount of control over the lives of members, including over how parents raise their children. Critics regard Scientology as a mind-controlling cult.\n\nWhat appears certain about Holmes’ life is that she’s been a devoted, protective mother to Suri, doing the best she can to raise her on her own.\n\nNumerous reports describe Suri as an intelligent, kind-hearted girl, with Holmes herself opening up about her daughter’s philanthropic heart in a 2015 interview with Today.\n\n“My little one is very, very generous and very sensitive,” Holmes said, according to People.\n\nOver the years, their mother-daughter bond has been documented in photos at events, as in when Suri and Holmes appeared on the Madison Square Garden stage together in December to introduce Taylor Swift at the Jingle Ball concert.\n\nHolmes also has shared images of their sometimes playful, friendly bond in a series of photos she has posted to Instagram.", "images": ["https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2017/06/babydriver_4.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2016/08/20150318_100415_OSCARS.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2016/08/20120709__peoplemag1.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2018/06/KatieHolmes11.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/12/suricruise2.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/06/KatieHolmes11.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/06/29/katie-holmes-trials-fighting-reports-about-a-jamie-foxx-breakup-and-a-tom-cruise-suri-reunion/", "title": "Katie Holmes’ trials: Fighting reports about a Jamie Foxx breakup and a Tom Cruise, Suri reunion", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Katie Holmes representatives have denied reports she and Jamie Foxx have broken up and that Tom Cruise wants to be a father to Suri.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Katie Holmes’ trials: Fighting reports about a Jamie Foxx breakup and a Tom Cruise, Suri reunion", "url": "https://www.mercurynews.com/2018/06/29/katie-holmes-trials-fighting-reports-about-a-jamie-foxx-breakup-and-a-tom-cruise-suri-reunion/", "description": "Katie Holmes is at the center of reports involving Jamie Foxx, a canceled wedding, and Tom Cruise maybe wanting to be more than an absent father to Suri.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/06/KatieHolmes11.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-06-29T14:47:10+00:00", "modified_time": "2018-06-29T18:00:11+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Katie Holmes’ trials: Fighting reports about a Jamie Foxx breakup and a Tom Cruise, Suri reunion"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/06/KatieHolmes11.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1530201600.0, "source": "http://www.mercurynews.com", "summary": ""}