{"url": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "text": "Married At First Sight Genre Reality Series Directed by Ryan Potter Starring John Aiken\n\nTrisha Stratford\n\nMel Schilling (2016–)\n\nSabina Read (2015) Narrated by Georgie Gardner Country of origin Australia Original language(s) English No. of seasons 7 No. of episodes 138 Production Executive producer(s) Tara McWilliams\n\nJohn Walsh Production location(s) Sydney, New South Wales Running time 60–90 minutes Production company(s) Endemol Australia Release Original network Nine Network Picture format 576i (SDTV)\n\n1080i (HDTV) (2016- ) Audio format Stereo Original release 18 May 2015 ( ) –\n\npresent External links Website\n\nMarried At First Sight is an Australian reality television series, based on the Danish program of the same name, on the Nine Network. The show featured couples getting married by being matched by \"experts\".[1] However, unlike other versions of the show around the world, the couples do not partake in a legally-binding marriage due to legal restrictions in Australia, but instead meet as strangers at the altar of a commitment ceremony.[2] The couples spend their wedding night in a hotel, then leave for a honeymoon. Upon returning they live together for a period of time, during which they meet at commitment ceremonies and choose whether or not they will continue their relationship.\n\nThe first season premiered on 18 May 2015 on the Nine Network.[3] A second season began on 4 April 2016[4] with the third season premiering later in the same year on 29 August 2016.[5] A fourth season premiered on Monday 30 January 2017. The fifth season premiered on Monday 29 January 2018.[7] The sixth season premiered on Monday 28 January 2019.[8] The seventh season premiered on Monday 3 February 2020.[9]\n\nSeason overview [ edit ]\n\nSeason Episodes Originally aired Season premiere Season finale 1 6 18 May 2015 22 June 2015 2 7 4 April 2016 27 April 2016 3 8 29 August 2016 13 September 2016 4 29 30 January 2017 3 April 2017 5 32 29 January 2018 21 March 2018 6 41 28 January 2019 8 April 2019 7 36 3 February 2020 5 April 2020\n\nSeason 1 (2015) [ edit ]\n\nDuring the first season, a panel of \"experts\" matched four females with four males. In the first episode, two couples (Michael & Roni, Clare & Lachlan) got married at their first introduction. In the second episode, another two couples (Zoe & Alex, Michelle & James) did the same. The couples embarked on married life for the rest of the season.[10] In the fourth episode, the couples met each other for the first time and discussed their current experiences.\n\nCouples [ edit ]\n\n# Couple Age Location Occupation Final Decision Status 1 Lachlan McAleer 36 Sydney, New South Wales Farmer Yes Separated Clare Tamas 37 Sydney, New South Wales Marketing manager 2 Roni Azzopardi 32 Melbourne, Victoria Payroll manager Broke up before final decision Separated Michael O'Dea 31 Melbourne, Victoria Event manager 3 Zoe Hendrix 25 Melbourne, Victoria Digital marketing executive Yes Separated Alex Garner 29 Melbourne, Victoria Plumber 4 Michelle Worsley 34 Sydney, New South Wales Communications manager Yes Separated James Webster 36 Sydney, New South Wales Sign writer\n\nLachlan and Clare [ edit ]\n\nLachlan and Clare met and wed in Sydney on the show's first episode. Despite their decision to continue their relationship at the end of the season, the couple revealed they had split but remained good friends.[11] The Nine Network announced on 26 June 2015, that Lachlan would participate in the network's upcoming revival of The Farmer Wants a Wife.[12]\n\nRoni and Michael [ edit ]\n\nRoni and Michael met and wed in Melbourne on the show's first episode. By the fifth episode, they found their relationship was not working for them and they both agreed to split.[13]\n\nZoe and Alex [ edit ]\n\nZoe and Alex met and wed in Melbourne in the show's second episode. Following the conclusion of the season, Zoe and Alex are the only couple currently still together. In March 2016, Zoe and Alex revealed they are planning to get married legally.[14] After suffering a miscarriage in June 2015,[11] Zoe and Alex revealed they were expecting their first child in October 2016.[15] On 14 November 2016 Zoe gave birth to their baby girl named Harper-Rose Garner. On 17 April 2018 Zoe announced via Instagram she and Alex had split up.[16]\n\nJames and Michelle [ edit ]\n\nJames and Michelle met and wed in Sydney in the show's second episode. The two are no longer in contact with each other.[11]\n\nSeason 2 (2016) [ edit ]\n\nAfter airing only one episode, the Nine Network on 19 May 2015, announced the series had been renewed for a second season which began to air on 4 April 2016.[17] During the second season, four female contestants were matched with their 'perfect' male partner by a panel of \"experts\". In the first episode, two couples (Erin & Bryce, Christie & Mark) meet and wed. In the second episode, another two couples (Clare & Jono, Simone & Xavier) did the same. They all embarked on married life for the rest of the series. In the fifth episode, the couples met for the first time and discussed their experiences.\n\nCouples [ edit ]\n\n# Couple Age Location Occupation Final Decision Status 1 Erin Bateman 26 Melbourne, Victoria Retail Manager Yes Together Bryce Mohr 31 Melbourne, Victoria Business analyst 2 Christie Jordee 39 Sydney, New South Wales Business Owner Yes Separated Mark Hughes 36 Gippsland, Victoria Farmer 3 Clare Verrall 32 Melbourne, Victoria Recruitment Consultant Broke up before final decision Separated Jono Pitman 28 Melbourne, Victoria Tradie 4 Simone Lee Brennan 29 Sydney, New South Wales Make-up artist No Separated Xavier Forsberg 26 Sydney, New South Wales Sales manager\n\nErin & Bryce [ edit ]\n\nErin and Bryce met and wed in Melbourne on the show's first episode. In the final episode, they decided to stay together. They are the only couple currently still together.[18] Since the show ended Erin has started her own fashion label called Boy Is Mine[19] and is writing a fashion lifestyle blog, erinbateman.com.[20]\n\nChristie & Mark [ edit ]\n\nChristie and Mark met and wed in Sydney on the show's first episode. In the final episode, they decided to stay together. On 15 June 2016, they announced they had split up.[20]\n\nClare & Jono [ edit ]\n\nClare and Jono met and wed in Melbourne on the show's second episode and quickly became the season's most controversial couple. By the fifth episode, Clare decided their relationship was not working as she felt 'uncomfortable' with Jono's constant aggressive outbursts. She decided to end the relationship prior to the couple's dinner.[21] After the show it was revealed by investigative journalist Siobhan Duck of the Herald Sun that Jono Pitman had previously been arrested and charged with assault after a bar brawl, and had completed a court ordered anger management course. Jono was then matched with Clare Verrall, who had been open about being attacked on the street by a stranger only months prior to filming, and suffering from post-traumatic stress disorder after the incident. A Nine Network spokesperson confirmed they were aware of Jono Pitman's violent history prior to pairing up the couple.[22][23]\n\nSince the show Clare has spoken openly about her battle with mental health issues since her attack, resulting in two suicide attempts before she checked herself into a trauma center for a month. Staying out of the limelight for over 18 months after the show, photos emerged of Clare having gained over 40 kg. In 2018, after her time at the trauma center and a second back surgery, Clare lost the weight she had gained and re-emerged at some Melbourne events.\n\nJono has also spoken out about his mental health struggles with anxiety after the show. At the time of writing (September 2018) he has been in a steady relationship for five months. Clare remains single.\n\nSimone & Xavier [ edit ]\n\nSimone and Xavier met and wed in Sydney in the show's second episode. In the final decision, Simone decided to walk away from the relationship and they are now separated.[20]\n\nSeason 3 (2016) [ edit ]\n\nIt was announced in February 2016 the show would return with two seasons, seasons two and three. There would be a bold casting move this season. It was the first to have five couples and included the series' first ever same-sex male couple.[5] During the third season, four female contestants were matched with their 'perfect' male partner and for the first time a male contestant was matched with his 'perfect' male partner by a panel of \"experts\". In the first episode, two couples (Keller & Nicole, Mark & Monica) met and wed. In the second episode, another two couples (Jess & Dave, Bella & Michael) did the same. In the third episode, one more couple (Craig and Andy) were wed. The couples embarked on married life together for the rest of the series. In the sixth episode, all couples (bar one) met for the first time and discussed their current experiences.[24]\n\nCouples [ edit ]\n\n# Couple Age Location Occupation Final Decision Status 1 Craig Keller 26 Brisbane, Queensland Mechanical fitter Yes Separated Nicole Heir 28 Gold Coast, Queensland Teacher 2 Mark Ellam 30 Sydney, New South Wales Firefighter Yes Separated Monica Vanderkley 28 Sydney, New South Wales Project manager 3 Jess Wardrop 31 Sydney, New South Wales Bank officer Broke up before final decision Separated Dave Crisp 28 Melbourne, Victoria Account manager 4 Bella Frizza 30 Gold Coast, Queensland Radio announcer Yes Separated Michael Hughes 32 Brisbane, Queensland Fashion accessories designer 5 Craig Roach 41 Gold Coast, Queensland Hairdresser Broke up before final decision Separated Andy Ankers 41 Sydney, New South Wales Global account director\n\nKeller & Nicole [ edit ]\n\nKeller and Nicole met and wed in Brisbane in the show's first episode. In the final episode, they decided to stay together.[25] Since filming, the couple have called it quits.[26]\n\nMark & Monica [ edit ]\n\nMark and Monica met and wed in Sydney in the show's first episode. In the final episode, they decided to stay in the relationship.[25] Since filming, the couple have decided to break up.[26]\n\nJess & Dave [ edit ]\n\nJess and Dave met and wed in Sydney in the show's second episode. In the fifth episode, Dave felt their relationship was \"going nowhere\" so they broke up.[27]\n\nBella & Michael [ edit ]\n\nBella and Michael met and wed in Brisbane in the show's second episode. In the final episode, they both agreed to stay together.[25] Since filming, the couple have decided to split up.[26]\n\nCraig & Andy [ edit ]\n\nCraig and Andy met and wed in New Zealand in the show's third episode. In the fifth episode, Craig decided to walk away from the relationship during the honeymoon, due to a \"lack of intimacy\".[28]\n\nSeason 4 (2017) [ edit ]\n\nIt was announced on 12 September 2016 the programme would return in 2017 with an extended series which saw 10 couples being wed.[29] During the fourth season, 10 female contestants were matched with their 'perfect' male partner by a panel of \"experts\".[30] In the first episode, two couples (Cheryl & Jonathan, Susan & Sean) met and wed in Sydney and Melbourne. In the second episode, another two couples (Scarlett & Michael, Nadia & Anthony) met and wed in Sydney. In the third episode, two more couples (Alene & Simon, Vanessa & Andy) met and wed in Sydney and Melbourne respectively. In the fourth episode, another two couples (Lauren & Andrew, Deborah & John) met and wed in Sydney. In the fifth episode, the final two couples (Michelle & Jesse, Sharon & Nick) met and wed in Perth at the same time.\n\nCouples [ edit ]\n\n# Couple Age Hometown Occupation Final Decision Status 1 Sean Hollands 35 Maryborough, Queensland Farmer No Separated Susan Rawlings 37 Perth, Western Australia Mining truck driver 2 Jonathan Troughton 30 Brisbane, Queensland Entrepreneur Broke up before final decision Separated Cheryl Maitland 25 Gold Coast, Queensland Hair salon assistant 3 Michael Tomic 30 Perth, Western Australia Data entry clerk/stripper Broke up before final decision Separated Scarlett Cooper 30 Sydney, New South Wales Aspiring author 4 Nadia Stamp 36 Brisbane, Queensland Flight attendant/model Yes Separated Anthony Manton 33 Sydney, New South Wales Racing broadcaster 5 Simon McQuillan 36 Ipswich, Queensland Business owner Yes Separated Alene Khatcherian 31 Sydney, New South Wales Registered nurse 6 Andy Hills 30 Gold Coast, Queensland Aerodrome plant operator Yes Separated Vanessa Belvedere 31 Melbourne, Victoria Student 7 Lauren Bran 33 Sydney, New South Wales Automotive aftermarket sales Broke up before final decision Separated Andrew Jones 38 Perth, Western Australia Firefighter 8 John Robertson 53 Melbourne, Victoria Business owner Broke up before final decision Separated Deborah Brosnan 53 Sunshine Coast, Queensland Ex-model 9 Michelle Marsh 31 Perth, Western Australia Commercial cleaner No Separated Jesse Konstantinoff 31 Adelaide, South Australia Retailer 10 Sharon Marsh 31 Perth, Western Australia Business owner Yes Separated Nick Furphy 30 Melbourne, Victoria Carpenter 11 Cheryl Maitland 25 Gold Coast, Queensland Hair salon assistant Broke up before final decision Separated Andrew Jones 38 Perth, Western Australia Firefighter\n\nSean & Susan [ edit ]\n\nSean and Susan broke up but decided to \"stay friends\" citing the fact they lived too far away from one another, and Susan could not live on Sean's farm.[31] Since the show ended, Susan has not spoken to Sean and is said to be quite upset with the way the producers portrayed her.\n\nJonathan & Cheryl [ edit ]\n\nDespite having a good start, Jonathan and Cheryl's relationship began to develop cracks during their honeymoon in New Zealand. These cracks deepened at the dinner party which resulted in Jonathan exchanging numbers with Scarlett; the duo spent the night texting. At the first commitment ceremony, Cheryl claimed she did not wish to continue with Jonathan as \"he seemed more interested in someone else\". The duo called it quits at the commitment ceremony. Jonathan is now dating someone else.\n\nMichael & Scarlett [ edit ]\n\nThings started unraveling for the couple when Michael told Scarlett he would not move to meet her halfway between their current states. Since he was \"established\", and he thought because she was less tied down, she could move to him. From that point on they only saw each other as friends and nothing was going to happen as Scarlett was not Michael's dream girl. After the first commitment ceremony, the couple decided to go their different ways and later that night it came out that Scarlett and Jonathan (Cheryl's husband) had sent text messages to each other for hours the night before.\n\nNadia & Anthony [ edit ]\n\nAs of the last Commitment Ceremony, they decided to stay together. Anthony said that Nadia would have to move in order for him to provide for them both as he was in a \"niche market\". Nadia turned up to the reunion dinner alone, and when asked where Anthony was she confided that he had dumped her the day after filming had ended saying that \"his feelings weren't progressing\".\n\nSimon & Alene [ edit ]\n\nAs of the Final Commitment Ceremony before the Final Decision they had both decided to stay and said that they told everyone they had feelings for each other. They had decided to stay committed to each other after the experiment. They have since separated.\n\nAndy & Vanessa [ edit ]\n\nAt the Final Commitment Ceremony before the Final Decision they decided to stay, though the fact they may have to do have to have a long-distance relationship for a while before they decide what happens may be contentious in the long run. Despite this the couple have decided to stay together after the experiment. Andy and Vanessa subsequently broke up because of the difference in communication styles.\n\nLauren & Andrew [ edit ]\n\nOn the wedding night Lauren disappeared leaving Andrew unaware of her whereabouts. After a confrontation meeting, Lauren said she wanted to try again, but Andrew decided that he did not wish to continue the experiment with Lauren.[32] Andrew has since re-entered the experiment with hair salon manager Cheryl. A friend of Lauren's has since done an interview in which she said the reason Lauren ran away is because when she went out to a club with Andrew he started abusing a club bouncer who would not let them in because it was past 1:00 am.\n\nJohn & Deborah [ edit ]\n\nUpon meeting, Deborah initially expressed disappointment that John was not a Polynesian man or \"someone with culture\". As the series progressed, John and Deborah seemed to get on each other's nerves because John was simply everything she hated. During the honeymoon in Samoa they ended up sleeping in separate beds, and John removed his wedding ring which caused further tension between them. At the commitment ceremony Deborah wanted to give it another try so they ended up staying. The next day, however, John left the experiment saying: \"They wouldn't be anything but friends and that's not what he was there for\".\n\nMichelle & Jesse [ edit ]\n\nAs of the Final Commitment Ceremony they are still together, despite Michelle's doubts as to whether she sees Jesse more as a friend than her husband. In their Vow Renewal ceremony, Jesse told Michelle he wants to stay in the relationship, but Michelle revealed to him that she wants him in her life forever, but not as her partner; they are now broken up.[33]\n\nSharon & Nick [ edit ]\n\nAs of the Final Commitment Ceremony they have decided to stay, Nick even going so far as to say, \"That he would go anywhere as long as Sharon was by his side.\" Although the original plan was for Nick to move to Perth because of Sharon's cleaning business, Nick got news that his father has a medical condition so he is unable to leave his family as they would need his help. They have since broken up. Nick has renewed his membership at the strip club.\n\nCheryl & Andrew [ edit ]\n\nAfter Cheryl left the experiment following the Jonathan and Scarlett texting scandal, she spoke to the \"experts\" and asked if they could set up a date between Andrew and herself. They went on two dates before deciding they would re-enter the experiment together as an unmarried couple. This caused controversy around the table at the dinner party as she was at the dinner the week prior with Jonathan. Even though the couple originally had some sparks, they were thrown into the deep end of the experiment having to jump right into the home stays. Tensions began to rise when Andrew met Cheryl's abrasive father for the first time and it did not go well. Andrew felt Cheryl did not have his back against her bullying dad. He chose to leave while Cheryl chose to stay to see if the relationship could be salvaged.\n\nWhen the couples all had a family get together Cheryl and Andrew were put into an intense boot camp to see if John the expert could overhaul the bond they had. They decided to give it another go, but when the boys and girls night came about Andrew spent most of the night bagging out and putting down Cheryl, even going as far to say that his runaway bride, Lauren, \"was way more fun\". Some of the boys took offense to this, namely Sean and Simon, and even silently Andy. Sean and Susan told Cheryl about it the next day but when Cheryl confronted Andrew about it he got snarky and condescending, even going so far as to start mimicking Cheryl. Andrew and Cheryl chose to leave the experiment at the Final Commitment Ceremony after the video of the boys night was shown to the girls.\n\nSeason 5 (2018) [ edit ]\n\nIn February 2017, the season was renewed for a fifth season which began airing on 29 January 2018.[34] On 11 October 2017, the fifth season was officially confirmed at Nine's upfronts and again includes 11 couples like the previous season. During the fifth season, 11 female contestants are matched with their 'perfect' male partner by a panel of \"experts\". In the first episode, the first two couples (Tracey & Dean, Sarah & Telv) met and wed in Sydney and Melbourne.[35] In the second episode, another two couples (Jo & Sean, Alycia & Mat) met and wed in Sydney and Melbourne.[36] In the third episode, two more couples (Davina & Ryan, Charlene & Patrick) met and wed in Warrawong and Melbourne.[37] In the fifth episode, two more couples (Ashley & Troy, Melissa & John) met and wed in Gold Coast and Melbourne.[38] In the sixth episode, another two couples (Gabrielle & Nasser, Carly & Justin) met and wed in Sydney.[39] In the seventh episode, the final couple (Blair & Sean) met and wed in Sydney.[40]\n\nCouples [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Sarah Roza 38 Melbourne, Victoria Beauty specialist Cairns, Queensland Yes Separated Telv Williams 33 Perth, Western Australia Machinery technician 2 Dean Wells 39 Sydney, New South Wales Executive creative director Fiji No Separated Tracey Jewel 34 Perth, Western Australia Marketing consultant 3 Mathew Lockett 32 Melbourne, Victoria Plumber Fraser Island, Queensland Broke up before final decision Separated Alycia Galbraith 29 Adelaide, South Australia Student 4 Jo McPharlin 39 Adelaide, South Australia Single mother Singapore Broke up before final decision Separated Sean Donnelly 39 Adelaide, South Australia Pub manager 5 Davina Rankin 26 Brisbane, Queensland Personal trainer/bikini model Cook Islands Broke up before final decision Separated Ryan Gallagher 29 Sydney, New South Wales Tradesman 6 Charlene Perera 33 Melbourne, Victoria Brand manager Tasmania Yes Separated Patrick Miller 34 Melbourne, Victoria Operations manager 7 Melissa Walsh 53 Mornington Peninsula, Victoria Journalist New Zealand Yes Separated John Robertson 54 Melbourne, Victoria Business owner 8 Troy Delmege 35 Sydney, New South Wales IT accounts manager Broome, Western Australia No Currently together Ashley Irvin 28 Brisbane, Queensland Flight attendant 9 Gabrielle Bartlett 44 Sydney, New South Wales Marketing coordinator/plus-size model Samoa Broke up before final decision Separated Nasser Sultan 50 Sydney, New South Wales Fitness instructor 10 Justin Fischer 41 Sydney, New South Wales Entrepreneur Vanuatu Broke up before final decision Separated Carly Bowyer 32 Melbourne, Victoria Marketing manager 11 Sean Thomsen 34 Perth, Western Australia Railway technician New Zealand Broke up before final decision Separated Blair Rachael 31 Sydney, New South Wales Executive assistant\n\nSarah & Telv [ edit ]\n\nAs of the fifth commitment ceremony they were still together but are now separated.\n\nDean & Tracey [ edit ]\n\nIn the first commitment ceremony, Dean Wells chose to leave (which blindsided Tracey Wells), while Tracey decided to stay, meaning they had to stay another week. When they had a second week he stepped up, but at the same time he started a secret flirtationship with Davina. At the dinner party, Dean hooked up with Davina, and at the end of the night Dean and Tracey decided to be intimate. Dean confessed he had a thing with Davina and wanted to make it work with Tracey. As of the fifth commitment ceremony, they are still together. When it came to the vow renewal, Dean said \"yes\" and said that he was falling in love with Tracey, but a bomb was dropped when Tracey said that she could not get past the betrayal and hurt during the first two weeks of the experiment. She ultimately said \"no\", leaving Dean gobsmacked at the 'altar'.\n\nMat & Alycia [ edit ]\n\nThey left the experiment between the first and second commitment ceremonies.\n\nJo & Sean D [ edit ]\n\nJo and Sean met in the second episode of the weddings and from the start, Sean was not very interested. When the first commitment ceremony came about Jo decided to stay while Sean decided to leave so they had to stay. Even though Jo tried Sean did not communicate. As of the second commitment, they have both decided to leave.\n\nDavina & Ryan [ edit ]\n\nBetween the first and second commitment ceremonies, Davina started a secret flirtationship with Dean. At the dinner party, Davina hooked up with Dean, leading her to write \"leave\" at the second commitment ceremony. Ryan had written \"stay\", so the couple had to stay another week. As of the third commitment ceremony Davina and Ryan have called it quits after the shock of Davina's cheating scandal.\n\nCharlene & Patrick [ edit ]\n\nAt their final decision they said they would stay together. In March 2018, the couple announced they had split up.[41]\n\nMelissa & John [ edit ]\n\nAs of the fifth commitment ceremony they were still in the experiment. At the Dinner Party, Melissa had to leave early due to her daughter being in labour, and as of the Commitment Ceremony there was still no baby so John was flying solo. From the fifth commitment ceremony they were still together and Melissa's daughter has welcomed a baby into the world. Sadly, the couple announced they had split up in March 2018.[42]\n\nTroy & Ashley [ edit ]\n\nAs of the fifth commitment ceremony they were still in the experiment. However at the altar both Ashley and Troy said the relationship was not working out. A few weeks after the experiment he entered into a relationship with Carly who originally married Justin, but now have broken up. Troy and Ashley revealed that they are back together.\n\nGabrielle & Nasser [ edit ]\n\nAs of the third commitment ceremony, Gabrielle decided to leave due to a lack of intimacy past the friend stage. Nasser decided to stay, and they came to an impasse at the end meaning that Nasser had a week to turn around. On the wife home stay, Gabrielle rented an apartment so she would not bring a strange man around her daughter. On the first night the bed broke and Nasser wanted to leave, but he stayed until they got into an argument and he left refusing to meet Gabrielle's friends who were on their way over for drinks and a chat. They finally left in the fifth ceremony, they were at peace with everything that went on.\n\nJustin & Carly [ edit ]\n\nAs of the second commitment ceremony Carly decided to leave whereas Justin decided to stay. They had to stay for another week. As of the third commitment ceremony, they have decided to stay even though they only spent three days at the home stay. After the blow up at the dinner party, Carly got fed up with Justin's lack of trying. They have decided to split up. A few weeks after the experiment she entered into a relationship with Troy who originally married Ashley.\n\nSean T & Blair [ edit ]\n\nThey both chose to stay at the second commitment ceremony, but during the groom's home stay, Sean revealed he had no feelings for Blair. He chose to leave at the third commitment ceremony, while Blair wanted to stay. Although obligated to work it out over the next week, Sean refused to go on Blair's home stay, essentially ending their relationship. Sean was in a relationship with Tracey who was in the experiment with Dean. But it was announced they had broken up in mid 2018.\n\nSeason 6 (2019) [ edit ]\n\nUnlike previous seasons, all couples were wed on the same week. They met in a series of dinner parties and weekly re-commitment ceremonies, and were only permitted to leave the experiment if both were present and consented to do so. If one partner chose to stay, and the other chose to leave, the couple were required to stay behind for another week. They would then sent be off on their honeymoon, before moving in together in a hotel room for 2 weeks.\n\nIn a series first, the couple were permitted to spend time apart as the men and women spent a night together. They were then set off in groups to Gold Coast, testing each couple's bond. Unlike in previous seasons of the show, 2 new couples wed and began appearing on the program midway through the original experiment.\n\nIn the first episode, two couples (Jules & Cameron, Cyrell & Nic) met and wed in Sydney. In the second episode, two more couples (Jessika & Mick, Melissa & Dino) met and wed in Byron Bay and Hawkesbury River. In the third episode, two more couples (Heidi & Mike, Ning & Mark) met and wed in Byron Bay and Melbourne. In the fifth episode, two more couples (Lauren & Matthew, Elizabeth & Sam) met and wed in Byron Bay and Hawkesbury River. In the sixth episode, the last two couples (Ines & Bronson, Martha & Michael) met and wed in Byron Bay and Melbourne. In th eighteenth episode, two new couples (Susie & Billy, Tamara & Dan) met and wed in Sydney.\n\nThe \"experts\" had to decide on a controversial request from Dan and Jess. The couple asked to stay in the experiment as another couple by leaving their \"spouses\" from the initial phases of the experiment. Controversy surrounded the \"experts\" which allowed the couple to stay in the experiment, even though there was evidence and admission that they were cheating on their spouses. An online petition garnered thousands of votes to have the show cancelled.[43]\n\nCeremony History [ edit ]\n\nEpisode: 9 13 17 21 25 29 33 40 Ceremony: 1 2 3 4 5 6 7 Final\n\nDecision Jules Stay Stay Stay Stay Stay Stay Stay Yes Cameron Stay Stay Stay Stay Stay Stay Stay Yes Mike Stay Stay Stay Stay Stay Stay Stay Yes Heidi Stay Stay Stay Stay Stay Stay Stay Yes Ning Stay Leave Stay Stay Stay Stay Leave Yes Mark Stay Stay Stay Stay Stay Stay Stay No Martha Stay Stay Stay Stay Stay Stay Stay Yes Michael Stay Stay Stay Stay Stay Stay Stay Yes Jessika Stay Stay Stay Stay Stay Stay Leave Yes Dan Not in\n\nExperiment Stay Stay Stay N/A Yes Tamara Stay Stay Stay N/A Left Mick Stay Stay Stay Leave Leave Leave Leave Left Susie Not in\n\nExperiment Stay Stay Leave Left Billy Stay Leave Leave Cyrell Stay Stay Stay Stay Stay Leave Left Nic Stay Stay Stay Leave Stay Leave Melissa Stay Stay Stay Leave Left Dino Stay Stay Stay Leave Elizabeth Stay absent Leave Left Sam Leave Stay Leave Ines Leave Stay Leave Left Bronson Stay Stay Leave Lauren Stay Leave Left Matthew Stay Leave Notes none 1 none 2 none Left none Lauren & Matthew Ines & Bronson Melissa & Dino none Cyrell & Nic Mick Ning & Mark Elizebeth & Sam Susie & Billy Tamara\n\nThis couple elected to leave the experiment during commitment ceremony.\n\nCouple Profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Jules Robinson 36 Sydney, New South Wales Business owner New Zealand Yes Currently married Cameron Merchant 34 Sydney, New South Wales Former pro cricketer 2 Nic Jovanović 27 Newcastle, New South Wales Electrician New Zealand Broke up before final decision Separated Cyrell Paule 29 Sydney, New South Wales Healthcare consultant 3 Jessika Power 27 Perth, Western Australia Administration officer Palm Cove, Queensland Broke up before final decision Separated Mick Gould 31 Gympie, Queensland Plasterer/farmer 4 Melissa Lucarelli 38 Sydney, New South Wales Talent agent Fiji Broke up before final decision Separated Dino Hira 34 Perth, Western Australia Meditation facilitator 5 Mike Gunner 44 Brisbane, Queensland Electrician Whitsundays, Queensland Yes Separated Heidi Latcham 38 Sunshine Coast, Queensland Radio announcer 6 Ning Surasiang 32 Townsville, Queensland Hairdresser Bangkok, Thailand No Separated Mark Scrivens 42 Melbourne, Victoria Ex-army 7 Sam Ball 26 Sydney, New South Wales Tradie N/A Broke up before final decision Separated Elizabeth Sobinoff 27 Newcastle, New South Wales Store manager 8 Lauren Huntriss 31 Sydney, New South Wales Makeup artist McLaren Vale, South Australia Broke up before final decision Separated Matthew Bennett 29 Brisbane, Queensland Videographer 9 Ines Bašić 28 Brisbane, Queensland Legal assistant Port Douglas, Queensland Broke up before final decision Separated Bronson Norrish 34 Perth, Western Australia Entrepreneur 10 Martha Kalifatidis 31 Sydney, New South Wales Makeup artist Samoa Yes Currently Together Michael Brunelli 29 Melbourne, Victoria Teacher 11 Susie Bradley 25 Jimboomba, Queensland Aged care nurse Shoalhaven, New South Wales Broke up before final decision Separated Billy Vincent 28 Lennox Head, New South Wales Barista 12 Dan Webb 35 Gold Coast, Queensland Car broker Hunter Valley, New South Wales Broke up before final decision Separated Tamara Joy 29 Melbourne, Victoria Administrator 13 Jessika Power 27 Perth, Western Australia Administration officer N/A Yes Separated Dan Webb 35 Gold Coast, Queensland Car broker\n\nRelationships Summary [ edit ]\n\nCameron & Jules\n\nJules commented that one of the things she loves best about Cam is that he compliments her and knows how to respond to every situation. During their reception, just before the first dance, the sound system stopped working. Cameron started dancing without any music, lightening the mood, with other wedding guests even joining in on the silent disco dance. During their Honeymoon in New Zealand, Jules sat Cam down for a serious conversation. For Jules having a family and children is a very important want and need in her life, and discovering that having kids is also of importance for Cameron made her very emotional. They were the only couple that are in a stable and loving relationship throughout the experiment. However, due to the spillover from Jess and Dan's affair affecting the couple, they both considered leaving the experiment early, because they already committed to each other, and Cameron accepting Jules' offer to move in with her as soon as the experiment ends. At the Final Vows, Cam proposed to Jules, she said yes and they are planning a legal wedding mid 2019. They were legally married in 2019.In April 2020, the couple announced they are expecting their first child.[44]\n\n\n\nNic & Cyrell\n\nNic & Cyrell wed in episode 1 and have stayed together despite the ups and down since the third commitment ceremony. During the week Cyrell had a physical altercation with Martha, over a rumour that Nic had felt Jessika up under the table at the dinner party. This resulted in Cyrell and Nic spending the rest of the week in separate apartments. Together, they came together at the dinner party when Jessika pulled Nic aside to tell him that she found him attractive, this is met with rejection from Nic and he went back and sat with Cyrell. During the commitment ceremony, Cyrell again apologised for her behaviour towards Martha, but Nic decided to leave. Ultimately, Cyrell decided to stay so they are obliged to be together for at least another week. However, after Nic's shortened homestay with Cyrell, due to her brother kicking Nic out, and Cyrell blowing Jess' affair with Dan in the open to save Mick, they ultimately left the experiment during the 6th Commitment Ceremony, but on good terms. By the time of the final session, Cyrell was dating Eden Dally, runner up of Love Island Australia.[45]\n\n\n\nJessika & Mick\n\nJessika Power & Mick wed in episode 2 and have been together all the way until the current commitment ceremony, despite Jessika's flirting and kissing other men, and her lack of interest towards Mick. In the most recent episodes she has decided to stay in the experiment, much to the chagrin of Mick, in order to spend more time with Dan. He was also trapped because the \"Two Leaves set you free\" rule no longer applies. After the 6th ceremony, however, because Mick and Tamara no longer have the desire to stay in the experiment at all, he was granted early exit, while Jessika and Dan re-enter as a newly formed couple.\n\n\n\nDino & Melissa\n\nDino and Melissa have very different personalities. Particularly at the beginning, they had trouble communicating, often feeling as if they were each speaking different languages. Their relationship grew stronger during their trip in Gold Coast, however Dino admitted to recording Melissa's private conversation with her sister which caused a rift in the relationship. They both decided to leave the experiment after the phone issue came up.\n\nMark & Ning\n\nThis couple put barriers up as they have either been through something major previously or haven't had a strong intimate relationship prior. So they both needed their walls to be broken down in order for any sort of affection & trust to form. Ning also finds Mark's application of commando style of talking when they were in a gym disrespectful because Ning is not a customer, and is never a fan of exercising. However, both decided to stay in the 2nd re-commitment ceremony, and the \"experts\" put ultimatums to Ning that she can no longer threaten to leave, or pre-pack her bags during the week, which, at first, saved the relationship. However, they had little to no intimacy and when Jessika said that Mark would hang out with other girls at the end of the experiment, which saw Ning inconsolable and the walls back up. At the Final Vows, Ning saw that there was a future with Mark, but Mark saw otherwise, stating he \"Haven't found it with you\", which saw her shocked and saddened.\n\n\n\nMike & Heidi\n\nHeidi likes to talk about things in depth with Mike, who had previously never been in love. Both are confident people and they have a strong physical connection. However, Mike's tendency to give advice to people makes Heidi, who dwells on issues and has a needy personality, extremely uncomfortable. This came to a head at the third dinner party. John made Heidi attempt to provide advice for her hypothetical friend for role reversal, which helped them stay in the experiment. While the \"experts\" constantly criticize Heidi for sabotaging the relationship, Mike's selfish tendencies are mostly left unresolved. It came to a head in the final week, when Mike took Heidi on a talk sailboat again, when Heidi is not only prone to seasickness, but is also petrified of heights. But at the Final Vows, while they commit to each other, they have broken up by the time they were at reunion.\n\n\n\nSam & Elizabeth\n\nSam skipped out on the honeymoon and Elizabeth went missing for a period thereafter. The couple does not communicate well. Sam has always been upfront about having no attraction to Elizabeth whatsoever. While Elizabeth keeps cutting off Sam mid-sentence and seemingly starting arguments, Sam has barely any patience left and has been exhibiting a strange attitude in which he calls her crazy. Sam, who battled with chicken pox, found out after the fact that Elizabeth has been unwell and stayed in a hospital for week 2, while he only stayed on for the sake of fostering a relationship with Ines. They ended up having a secret affair that was exposed by events the rest of the group witnessed. Sam continued to lie about the extent of the relationship until the end of the experiment for them. Since Sam cannot commit to Ines, their affair was also over.\n\n\n\nLauren & Matthew\n\nMatthew began the experiment as the show's inexperienced virgin. Lauren felt a lot of responsibility to give Matthew a good experience. Ultimately, Lauren wanted Matthew to be physically more passionate and sexually adventurous with her. He didn't feel the urge to be a dominant partner in the bedroom, and concluded to himself that it must be because he is not attracted to Lauren. The couple received no counselling on the matter and their marriage deteriorated dramatically within a day. They were the first couple of the season to leave. It is later revealed on Morning Show that he has found a new girlfriend who shares more of his values.[46] This coincided with NZ airing of the episode when he broke up with Lauren.[47]\n\n\n\nBronson & Ines\n\nInes didn't seem attracted to Bronson from the beginning, although Bronson was patient and giving her time to build a relationship. It became clear they were not getting along, so the \"experts\" put them in separate rooms. Ines apparently was attracted to Sam, and professed to being attracted to him. She said she stayed in the experiment merely to stay close to Sam. Ines then pursued an affair with Sam, and spent the night with him while Elizabeth was away due to an unspecified illness. Bronson was left completely in the dark until Sam blew the cover wide open at the third commitment ceremony. Ines continued to lie about the affair until the end of the experiment, which upset Cyrell enough to confront her. On 26 March 2019, it was revealed that Ines Bašić was sent to court for drink driving and has been charged.[48]\n\n\n\nMichael & Martha\n\nMartha had uprooted and started her career in Bondi, Sydney, when she was originally bred in Melbourne. Her guarded attitude also made it difficult for the relationship with Michael to progress. Michael's good-guy image initially threw Martha off as being as disingenuous as her personality. And throughout the whole experiment, Martha has also helped Jess stray knowing that it helps her camera time. When they returned to Michael's school, where he teaches PE, she realizes that he is a genuinely nice person. At the week before Final Vow, Martha's reluctance to return to Melbourne eventually convinced Michael to also address the logistical and her attitude issues and not commit to the relationship, but he eventually recommitted and is willing to move to Bondi.\n\n\n\nSusie & Billy\n\nOne of two “intruder” couples, Susie & Billy met & wed in Sydney in episode 18. Susie is a solo mother of Hungarian descent, but her disapproval of Billy's sensitive and gentlemanly ways, turned him into a victim of bullying. Though they chose to stay after the first week, the issue remains unresolved in their second week, when the couple returns to Billy's hometown. It still wasn't resolved a week later, which saw Billy walk out on her in the second day of the wife's homestay, where he walked out on his lunch with her friends. These events was enough for both of them to leave the experiment at the 6th Commitment Ceremony. Susie later revealed on Instagram that she is in a relationship with Todd Carney.\n\n\n\nDan & Tamara\n\nOne of two “intruder” couples, Dan & Tamara met and wed in Sydney in episode 18. Dan is a single father, and Tamara lost her mother. Their honeymoon coincided with the three-year anniversary of her mother's passing. At a recent dinner party, Dan was hit on by Jessika, and they engaged in kissing and deciding to stay in the experiment in order to spend more time together.\n\n\n\nDan & Jessika\n\n\n\nDan's grand entrance into the experiment as an intruder caught the eye of Jessika, the \"wife\" of contestant Mick Gould. Dan reciprocated his feelings for Jess and their feelings blossomed. Over the following weeks, Jess and Dan rendezvoused numerous times, including sneaking away for brief periods of time at the Dinner parties, to exchange their feelings and a passionate kiss. Days before the week 8 commitment ceremony, Dan told Jess that they needed to tell the group how they felt. The commitment ceremony saw Mick Gould devastated, not because of the pair becoming an item, but because of the betrayal, mistrust and a blatant waste of his time. Tamara, Dan's \"wife\" also expressed her feelings for the situation, explaining that even though she felt up until this point that her and Dan were friends, she was shattered that he wasn't honest with her from the start.\n\n\n\nDan and Jessika requested that they be allowed to stay in the experiment by re-entering as a couple; and with much deliberation of the \"experts\" and expressed dismay of the other contestants, were allowed to stay, with expert John Aitken advising the pair that they should spend the following week really seriously investigating whether their blossoming relationship will work in the real world.\n\n\n\nDespite their shared interests and physical attraction, their biggest obstacle, other than opinions of other couples and their respective families (families of the couples have a shared lunch in the couples' apartments), is the distance between them outside the experiment, as Dan (Gold Coast, QLD, same state as Mick (Gympie, QLD) and Jessika (Perth, WA) are from opposite ends of Australia. By the time they were at the reunion, Jess has already moved to Gold Coast. However, the night after the reunion dinner party, Dan found out about Jess and Nic's secret meeting. They have since separated.\n\nSeason 7 (2020) [ edit ]\n\nIn the first episode, the first two couples (Poppy & Luke, Cathy & Josh) met and wed in Bilpin and Wyong Creek. In the second episode, another two couples (Natasha & Mikey, Amanda & Tash) met and wed in Stanwell Tops and Melbourne. In the third episode, another two couples (Hayley & David, Vanessa & Chris) met and wed in Werribee and Sydney. In the fifth episode, two more couples (Connie & Jonethen, Aleks & Ivan) met and wed in Melbourne and Sydney. In the sixth episode, the last two couples (Mishel & Steve, Stacey & Michael) met and wed in Weribee and Melbourne. In the eighteenth episode, two new couples (Elizabeth & Seb, KC & Drew) met and wed in Sydney and Central Coast.\n\nCeremony History [ edit ]\n\nEpisode: 9 13 17 21 25 28 33 Ceremony: 1 2 3 4 5 6 Final\n\nDecision Stacey Stay Stay Leave Stay Stay Stay Yes Michael Stay Stay Stay Stay Stay Stay Yes Connie Stay Stay Leave Stay Stay Stay No Jonethen Stay Stay Stay Leave Leave Leave No Mishel Stay Leave Stay Stay Stay Stay No Steve Stay Stay Stay Leave Stay Stay Yes Elizabeth Not in\n\nExperiment Stay Stay Stay Yes Seb Stay Stay Stay Yes KC Not in\n\nExperiment Stay Stay Stay Yes Drew Stay Stay Stay Yes Cathy Stay Stay Stay Stay Leave Left Josh Stay Stay Stay Stay Leave Aleks Stay Stay Stay Stay Left Ivan Stay Stay Stay Stay Hayley Stay Stay Stay Ejected David Stay Stay Leave Natasha Stay Stay Leave Left Mikey Stay Leave Leave Vanessa Stay Stay Left Chris Stay Stay Amanda Stay Leave Left Tash Stay Leave Poppy Stay Left Luke Stay Notes none 1 2, 3 4 5 none Ejected none Hayley & David none Left none Poppy & Luke Vanessa & Chris none Aleks & Ivan none Connie & Jonethen Amanda & Tash Natasha & Mikey Cathy & Josh Mishel & Steve\n\nThis couple left the experiment outside of commitment ceremony. This couple elected to leave the experiment during commitment ceremony.\n\nCouple Profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Poppy Jennings 38 Wollongong, New South Wales Photographer Hunter Valley, New South Wales Broke up before final decision Separated Luke Eglin 38 Melbourne, Victoria Maintenance supervisor (FIFO) 2 Josh Pihlak 28 Newcastle, New South Wales Operator/truck driver Daylesford, Victoria Broke up before final decision Separated Cathy Evans 26 Sydney, New South Wales Logistics investigator 3 Amanda Micallef 34 Melbourne, Victoria Strength coach Daydream Island, Whitsundays Broke up before final decision Separated Tash Herz 31 Adelaide, South Australia Bartender 4 Natasha Spencer 26 Sydney, New South Wales Financial analyst Snowy Mountains, New South Wales Broke up before final decision Separated Mikey Pembroke 28 Sydney, New South Wales Operations manager 5 Hayley Vernon 32 Melbourne, Victoria Finance broker Singapore Ejected from experiment Separated David Cannon 31 Melbourne, Victoria Truck driver 6 Vanessa Romito 31 Perth, Western Australia Pharmacy manager Hervey Bay, Queensland Broke up before final decision Separated Chris Nicholls 37 Adelaide, South Australia Correctional youth worker 7 Connie Crayden 27 Melbourne, Victoria Student Broome, Western Australia No Separated Jonethen Musulin 27 Gold Coast, Queensland Construction mining (FIFO) 8 Ivan Sarakula 30 Sydney, New South Wales Real estate agent Gold Coast, Queensland Left before final decision Separated[49] Aleks Markovic 26 Perth, Western Australia Real estate agent 9 Mishel Meshes 48 Brisbane, Queensland Teacher Queenstown, New Zealand No Separated Steve Burley 52 Melbourne, Victoria Barber shop owner 10 Stacey Hampton 25 Adelaide, South Australia Law graduate Fiji Yes Separated Michael Goonan 28 Adelaide, South Australia Company director 11 Elizabeth Sobinoff 28 Newcastle, New South Wales Returning MAFS Bride Port Macquarie, New South Wales Yes Currently Together Seb Guilhaus 31 Adelaide, South Australia Personal trainer 12 KC Osborne 31 Cronulla, New South Wales Professional dancer Terrigal, New South Wales Yes Separated Drew Brauer 31 Cairns, Queensland Musician/charity founder\n\nRelationships Summary [ edit ]\n\nPoppy & Luke\n\n\n\nPoppy and Luke seemed to have a nice start to the marriage though it seems that Poppy still missed her twin boys and so she left the experiment the day that all the couples moved into apartments together. This was before the first commitment ceremony and the first dinner party. Although some evidence has come out that Poppy may not have been happy with the editing and the way that they have both been portrayed.\n\n\n\nJosh & Cathy\n\n\n\nIt seemed that Josh and Cathy might have been the \"IT' couple of the season, the first few weeks the couple went from strength to strength, though that seemed to end after a dinner party when Cathy was being frank with Josh about her jealousy (to do with him talking with Hayley), though she said that it was irrational, he decided that if she had trust issues then he might as well write Leave. Though they seemed to get over it, this seemed to be a difference in the next few weeks, especially after Josh threw Cathy under the bus with his mum during the \"Meet the Parents week\" and again during the \"Groom’s homestay\".\n\n\n\nAmanda & Tash\n\nAmanda & Tash are the first female same-sex couple on the series since gay marriage was recognised in Australia. After some initial chemistry at the wedding, Tash realised that she had moved too fast and tried to put on the brakes, much to the chagrin of Amanda. After the honeymoon, the girls moved into an apartment and immediately they had an argument about Tash's lack of intimacy. Tash moved into a different apartment and went into the dinner party separately from Amanda, but it seemed that they were mending the relationship when they both decided to stay in the first commitment ceremony. They have both since aired their differences and decided to go their separate ways by leaving at the second commitment ceremony.\n\n\n\nNatasha & Mikey\n\n\n\nNatasha and Mikey seemed to have fun during Intimacy Week, though a comment that Natasha said to Michael at the dinner party involving Mikey offended him and for the next commitment ceremony, Mikey wrote leave. Natasha wrote stay which meant that they had another week to try to rebuild their relationship. At the end of the week the couple decided to leave the experiment as friends, the \"experts\" also seemed to commend the couple on the grown-up decision that they had made.\n\n\n\nHayley & David\n\n\n\nHayley and David seemed to have a rocky start during the honeymoon, but it all came to a head at the first commitment ceremony, when they yelled and screamed on the couch, though it seems during intimacy week that they decided to follow the \"experts\"’ comments about moving forward and letting go of the past. It seems that they managed to go from zero to 100. After the decent week that they had, there was an incident where Hayley went out with Michael, Chris and Vanessa, between Michael and Hayley that David found out about later that night. To get revenge, he took Hayley's toothbrush and used it to clean the toilet (while filming it) and sent it to one of the boys.[50][51] They have since left after the \"experts\" vetoed Hayley's stay saying that they are \"not in the main point of the experiment\".\n\n\n\nVanessa & Chris\n\n\n\nVanessa is very self-conscious of her skin due to her acne. Chris is very laid-back and chill. Although the pair cruised through the first two weeks of the experiment, they ran into some problems. Vanessa felt like Chris was not attracted to her as he showed her no affection. When their parents and friends came to visit the pair, Vanessa realized she could no longer stay in the experiment with someone who didn't give her what she wanted, so she left the experiment, making Chris have to leave, too. Chris later said in a confessional that he was attracted to Vanessa. It was rumoured that the pair were kicked off the experiment due to Vanessa threatening Nine Network over the working conditions in the show as well as Vanessa's mental status. Neither rumour has been confirmed or denied.\n\n\n\nConnie & Jonethen\n\n\n\nConnie and Jonethen has a shy start to the honeymoon, both physically attracted to each other but both hesitant to finally make the first kiss a reality.\n\nAfter moving in together, Connie develops a problem with Jonethen's mobile phone and Instagram usage. She chose to implement a ‘no phones rule’ between them during Intimacy week to try and curb his usage.\n\nThe couple begin to have some communication issues, where Jonethen begins to give Connie mixed signals of his feelings towards her. Jonethen says that he is ‘not attracted to Connie but finds her attractive’, and that she ticks a lot of boxes “on paper” to him.\n\nConnie chooses to ‘leave’ as a result, but Jonethen desires to ‘stay’, thinking the stay at home weeks will help get some feelings moving.\n\nJonethen has since said ‘leave’ three times in a row in the last weeks of the experiment and Connie continues to stay, with a glimmer of hope.\n\n\n\nAleks & Ivan\n\n\n\nIvan and Aleks seemed to go from strength to strength, but it seemed all too much after it came out that she had dinner with another person outside of the experiment. It seems that the gentleman was the owner of the restaurant that Aleks went to with a girlfriend. They both left the dinner party early and slept in separate rooms. It seems that they exited the experiment before the next commitment ceremony, without saying goodbye to everyone. At the reunion dinner party, both stated that they were together despite the fact that they had broken up. During their final talk with the experts, they said that they loved each other and couldn't live without each other. After the episode air, Aleks took to Instagram to state that her and Aleks had amicably broken up sometime in February.\n\n\n\nMishel & Steve\n\n\n\nMishel and Steve seemed to have one of the best honeymoons of the lot, though it seems the relationship fell short during the move in for Intimacy Week. During the dinner party, Steve seemed to show his true colours when he spent the entire end of the night shutting down Mishel, to which others of the group came to her defence. During the commitment ceremony, Mishel decided to write leave while Steve decided to stay. The \"experts\" have told them that they need to be more intimate with each other, but the end of the dinner parties they seemed like they were going to write leave but, they have both decided to stay.\n\n\n\nStacey & Michael\n\n\n\nStacey and Michael got off to a rocky start on their wedding day since Stacey stated she wasn't attracted to Michael physically. She was cold to him all evening until she learned Michael was wealthy. During their honeymoon, Michael went out for drinks late at night and left Stacey alone. When morning came, Michael had left to go for a run with the guys he had gone for drinks with. This led to a fight between the two that was then resolved and the two were intimate for the first time. A couple of weeks later, there was a cheating scandal between Michael and Hayley. Hayley said that the two had kissed and that there were witnesses to this. The witnesses, Chris and Vanessa, had left the experiment before the allegations came out, so this debacle was not easily resolved. Everyone seemed to believe Hayley since she seemed to be feeling guilty about what had transpired. Stacey, however, refused to believe Hayley because there was no proof of it happening. Michael said that he does not remember kissing Hayley, but then apologized to Stacey as he was not 100% sure of what had happened that night. In the next week, the two had rekindled again and had even told one another they loved each other. The two were becoming closer and closer as the weeks went on. At the guys' reunion party, Ivan had stated that he knew something that could break the two up, but was going to refrain from saying anything as it was not his truth to tell. At the final commitment ceremony, where every participant of the season was present, Vanessa told everyone that Mikey (her then-\"husband\") and Stacey had a one-night-stand. Stacey seemed shocked by the allegations and began stating that they were not true. Mikey then went on to bring proof of messages that the two had shared which lightly alluded to the two coupling up. These allegations were backed up by Aleks and Ivan since the one-night-stand had happened at their apartment. Stacey was visibly shocked at the allegations and said that Mikey had to be obsessed with her because she had not hooked up with him. Michael then told the camera that if she had cheated and told the truth then he could forgive her, but if she was lying, then he could not. The two are now broken up, seemingly from Stacey's cheating allegation. Micheal and KC are officially in a relationship after filming of the MAFS reunion.\n\nElizabeth & Seb\n\n\n\nElizabeth is back again for another season of MAFS. This season, she is paired up with Seb. The couple is very attracted and intimate towards one another. However, it seems that Liz's parents think that Seb lacks career direction and ambition as he had quit two university degrees in their second year and hadn't chosen a set career path. As a result, they fear that Seb cannot support Liz financially. Liz's high regard for her parents’ opinions cause her to remain hopeful that they will begin approving of Seb, fearing she couldn't live with a partner her parents disapproved of.\n\nDespite this, they are still intimate with each other and enjoy each other's company.\n\nKC & Drew\n\n\n\nThere seems to be some early disdain but they managed to turn a leaf, and they have decided to restart the relationship to see if they can get off on the right foot with each other. KC and Micheal are officially in a relationship after filming of the MAFS reunion.\n\n\n\nViewership [ edit ]\n\nSeason ratings [ edit ]\n\nSeason Episodes Originally aired Preliminary Consolidated Season premiere Season finale Average viewers Average rank Average viewers Average rank 1 6 18 May 2015 22 June 2015 1.115 #4 1.195 #3 2 7 4 April 2016 27 April 2016 0.915 #7 0.999 #6 3 8 29 August 2016 13 September 2016 0.880 #7 0.970 #5 4 29 30 January 2017 3 April 2017 1.081 #3 1.186 #2 5 32 29 January 2018 21 March 2018 1.223 #1 1.328 #1 6 41 28 January 2019 8 April 2019 1.323 #1 1.432 #1 7 36 3 February 2020 5 April 2020\n\nSeason 1 (2015) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 18 May 2015 1,134,000 5 65,000 2 1,199,000 [52][53] 2 Episode 2 25 May 2015 1,103,000 4 77,000 2 1,180,000 [54][55] 3 Episode 3 1 June 2015 1,116,000 3 84,000 3 1,200,000 [56][57] 4 Episode 4 8 June 2015 971,000 7 99,000 6 1,070,000 [58][59] 5 Episode 5 15 June 2015 1,079,000 3 85,000 2 1,164,000 [60][61] 6 Episode 6 22 June 2015 1,290,000 1 71,000 1 1,361,000 [62][63]\n\nSeason 2 (2016) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 4 April 2016 771,000 13 86,000 9 857,000 [64][65] 2 Episode 2 5 April 2016 905,000 6 91,000 5 996,000 [66][67] 3 Episode 3 11 April 2016 874,000 8 62,000 7 936,000 [68][69] 4 Episode 4 12 April 2016 880,000 8 85,000 6 965,000 [70][71] 5 Episode 5 18 April 2016 899,000 6 122,000 7 1,021,000 [72][73] 6 Episode 6 19 April 2016 831,000 9 93,000 8 924,000 [74][75] 7 Finale 27 April 2016 1,048,000 4 66,000 2 1,114,000 [76][77] 7 Finale - Follow Up 27 April 2016 1,110,000 1 66,000 1 1,176,000 [76][77]\n\nSeason 3 (2016) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 29 August 2016 805,000 11 74,000 7 879,000 [78][79] 2 Episode 2 30 August 2016 810,000 7 60,000 7 870,000 [80][81] 3 Episode 3 31 August 2016 788,000 9 79,000 7 867,000 [82][83] 4 Episode 4 5 September 2016 843,000 8 97,000 6 940,000 [84][85] 5 Episode 5 6 September 2016 919,000 5 93,000 4 1,012,000 [86][87] 6 Episode 6 7 September 2016 974,000 2 117,000 1 1,091,000 [88][89] 7 Episode 7 12 September 2016 814,000 9 100,000 8 914,000 [90][91] 8 Episode 8 13 September 2016 1,083,000 3 101,000 1 1,184,000 [92][93]\n\nSeason 4 (2017) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 30 January 2017 820,000 10 84,000 9 904,000 [94][95] 2 Episode 2 31 January 2017 927,000 5 79,000 5 1,006,000 [96][97] 3 Episode 3 1 February 2017 824,000 6 75,000 5 899,000 [98][99] 4 Episode 4 5 February 2017 909,000 4 90,000 4 999,000 [100][101] 5 Episode 5 6 February 2017 893,000 6 100,000 6 993,000 [102][103] 6 Episode 6 7 February 2017 920,000 6 96,000 2 1,016,000 [104][105] 7 Episode 7 8 February 2017 905,000 6 112,000 3 1,017,000 [106][107] 8 Episode 8 12 February 2017 1,064,000 3 103,000 2 1,167,000 [108][109] 9 Episode 9 13 February 2017 1,107,000 2 108,000 2 1,215,000 [110][111] 10 Episode 10 14 February 2017 1,024,000 1 119,000 2 1,143,000 [112][113] 11 Episode 11 20 February 2017 1,096,000 2 96,000 2 1,192,000 [114][115] 12 Episode 12 21 February 2017 1,062,000 2 152,000 2 1,214,000 [116][117] 13 Episode 13 26 February 2017 1,113,000 1 129,000 1 1,242,000 [118][119] 14 Episode 14 27 February 2017 1,101,000 2 123,000 1 1,224,000 [120][121] 15 Episode 15 28 February 2017 1,092,000 1 144,000 1 1,236,000 [122][123] 16 Episode 16 5 March 2017 1,170,000 1 86,000 1 1,256,000 [124][125] 17 Episode 17 6 March 2017 1,099,000 1 101,000 1 1,200,000 [126][127] 18 Episode 18 7 March 2017 1,122,000 1 117,000 1 1,239,000 [128][129] 19 Episode 19 12 March 2017 1,160,000 1 91,000 1 1,251,000 [130][131] 20 Episode 20 13 March 2017 1,060,000 1 103,000 1 1,163,000 [132][133] 21 Episode 21 14 March 2017 1,148,000 1 104,000 1 1,252,000 [134][135] 22 Episode 22 19 March 2017 1,190,000 1 102,000 1 1,292,000 [136][137] 23 Episode 23 20 March 2017 1,239,000 1 108,000 1 1,347,000 [138][139] 24 Episode 24 21 March 2017 1,194,000 1 93,000 1 1,287,000 [140][141] 25 Episode 25 26 March 2017 1,157,000 1 72,000 1 1,229,000 [142][143] 26 Episode 26 27 March 2017 1,163,000 2 137,000 2 1,300,000 [144][145] 27 Episode 27 28 March 2017 1,034,000 5 112,000 2 1,146,000 [146][147] 28 Finale - Part 1 2 April 2017 1,379,000 1 98,000 1 1,477,000 [148][149] 29 Finale - Part 2 3 April 2017 1,389,000 1 107,000 1 1,496,000 [150][151]\n\nSeason 5 (2018) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 29 January 2018 912,000 7 102,000 5 1,014,000 [152][153] 2 Episode 2 30 January 2018 907,000 5 101,000 4 1,008,000 [154][155] 3 Episode 3 31 January 2018 929,000 4 81,000 2 1,010,000 [156][157] 4 Episode 4 1 February 2018 995,000 1 96,000 1 1,091,000 [158][159] 5 Episode 5 4 February 2018 835,000 5 102,000 4 937,000 [160][161] 6 Episode 6 5 February 2018 879,000 6 101,000 4 978,000 [162][163] 7 Episode 7 6 February 2018 899,000 7 130,000 3 1,029,000 [164][165] 8 Episode 8 8 February 2018 938,000 1 124,000 1 1,062,000 [166][167] 9 Episode 9 11 February 2018 1,163,000 1 76,000 2 1,239,000 [168][169] 10 Episode 10 12 February 2018 1,158,000 1 89,000 2 1,247,000 [170][171] 11 Episode 11 13 February 2018 1,057,000 1 91,000 2 1,148,000 [172][173] 12 Episode 12 14 February 2018 1,133,000 1 107,000 1 1,240,000 [174][175] 13 Episode 13 18 February 2018 1,351,000 1 101,000 1 1,452,000 [176][177] 14 Episode 14 19 February 2018 1,296,000 1 104,000 1 1,400,000 [178][179] 15 Episode 15 20 February 2018 1,233,000 1 104,000 1 1,337,000 [180][181] 16 Episode 16 21 February 2018 1,341,000 1 132,000 1 1,473,000 [182][183] 17 Episode 17 25 February 2018 1,536,000 1 92,000 1 1,628,000 [184][185] 18 Episode 18 26 February 2018 1,325,000 1 107,000 1 1,432,000 [186][187] 19 Episode 19 27 February 2018 1,253,000 1 102,000 1 1,355,000 [188][189] 20 Episode 20 28 February 2018 1,315,000 1 127,000 1 1,442,000 [190][191] 21 Episode 21 4 March 2018 1,535,000 1 108,000 1 1,643,000 [192][193] 22 Episode 22 5 March 2018 1,271,000 1 98,000 1 1,369,000 [194][195] 23 Episode 23 6 March 2018 1,267,000 1 119,000 1 1,386,000 [196][197] 24 Episode 24 7 March 2018 1,260,000 1 112,000 1 1,372,000 [198][199] 25 Episode 25 11 March 2018 1,342,000 1 107,000 1 1,429,000 [200][201] 26 Episode 26 12 March 2018 1,256,000 1 102,000 1 1,358,000 [202][203] 27 Episode 27 13 March 2018 1,230,000 1 103,000 1 1,333,000 [204][205] 28 Episode 28 14 March 2018 1,188,000 1 132,000 1 1,320,000 [206][207] 29 Episode 29 18 March 2018 1,446,000 1 76,000 1 1,522,000 [208][209] 30 Episode 30 19 March 2018 1,525,000 1 78,000 1 1,603,000 [210][211] 31 Finale - Part 1 20 March 2018 1,623,000 1 127,000 1 1,750,000 [212][213] 32 Finale - Part 2 21 March 2018 1,753,000 1 136,000 1 1,889,000 [214][215]\n\nSeason 6 (2019) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 28 January 2019 1,003,000 2 144,000 1 1,147,000 [216][217] 2 Episode 2 29 January 2019 955,000 2 107,000 1 1,062,000 [218][219] 3 Episode 3 30 January 2019 1,027,000 1 115,000 1 1,142,000 [220][221] 4 Episode 4 31 January 2019 1,001,000 1 96,000 1 1,097,000 [222][223] 5 Episode 5 3 February 2019 1,088,000 1 78,000 1 1,166,000 [224][225] 6 Episode 6 4 February 2019 1,117,000 1 136,000 1 1,253,000 [226][227] 7 Episode 7 5 February 2019 1,167,000 1 146,000 1 1,313,000 [228][229] 8 Episode 8 6 February 2019 1,282,000 1 145,000 1 1,427,000 [230][231] 9 Episode 9 10 February 2019 1,263,000 1 107,000 1 1,370,000 [232][233] 10 Episode 10 11 February 2019 1,298,000 1 117,000 1 1,415,000 [234][235] 11 Episode 11 12 February 2019 1,183,000 1 109,000 1 1,292,000 [236][237] 12 Episode 12 13 February 2019 1,290,000 1 142,000 1 1,432,000 [238][239] 13 Episode 13 17 February 2019 1,291,000 1 105,000 1 1,395,000 [240][241] 14 Episode 14 18 February 2019 1,205,000 1 91,000 1 1,299,000 [242][243] 15 Episode 15 19 February 2019 1,349,000 1 116,000 1 1,463,000 [244][245] 16 Episode 16 20 February 2019 1,329,000 1 119,000 1 1,447,000 [246][247] 17 Episode 17 24 February 2019 1,659,000 1 136,000 1 1,796,000 [248][249] 18 Episode 18 25 February 2019 1,293,000 1 103,000 1 1,400,000 [250][251] 19 Episode 19 26 February 2019 1,261,000 1 120,000 1 1,380,000 [252][253] 20 Episode 20 27 February 2019 1,277,000 1 147,000 1 1,421,000 [254][255] 21 Episode 21 3 March 2019 1,451,000 1 92,000 1 1,543,000 [256][257] 22 Episode 22 4 March 2019 1,293,000 1 93,000 1 1,386,000 [258][259] 23 Episode 23 5 March 2019 1,282,000 1 108,000 1 1,390,000 [260][261] 24 Episode 24 6 March 2019 1,301,000 1 118,000 1 1,419,000 [262][263] 25 Episode 25 10 March 2019 1,281,000 1 101,000 1 1,382,000 [264][265] 26 Episode 26 11 March 2019 1,360,000 1 88,000 1 1,448,000 [266][267] 27 Episode 27 12 March 2019 1,245,000 1 82,000 1 1,327,000 [268][269] 28 Episode 28 13 March 2019 1,407,000 1 105,000 1 1,512,000 [270][271] 29 Episode 29 17 March 2019 1,476,000 1 109,000 1 1,585,000 [272][273] 30 Episode 30 18 March 2019 1,351,000 1 106,000 1 1,457,000 [274][275] 31 Episode 31 19 March 2019 1,306,000 1 112,000 1 1,418,000 [276][277] 32 Episode 32 20 March 2019 1,454,000 1 118,000 1 1,572,000 [278][279] 33 Episode 33 24 March 2019 1,685,000 1 96,000 1 1,781,000 [280][281] 34 Episode 34 25 March 2019 1,315,000 1 81,000 1 1,396,000 [282][283] 35 Episode 35 26 March 2019 1,225,000 1 95,000 1 1,320,000 [284][285] 36 Episode 36 27 March 2019 1,374,000 1 138,000 1 1,512,000 [286][287] 37 Episode 37 31 March 2019 1,485,000 1 74,000 1 1,559,000 [288][289] 38 Episode 38 1 April 2019 1,407,000 1 73,000 1 1,480,000 [290][291] 39 Episode 39 2 April 2019 1,388,000 1 84,000 1 1,472,000 [292][293] 40 Final - Part 1 7 April 2019 1,858,000 1 85,000 1 1,943,000 [294][295]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 41 Final - Part 2 8 April 2019 1,968,000 1 112,000 1 2,080,000 [296][297]\n\nSeason 7 (2020) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 3 February 2020 1,154,000 1 139,000 1 1,293,000 [298][299] 2 Episode 2 4 February 2020 1,067,000 1 124,000 1 1,191,000 [300][301] 3 Episode 3 5 February 2020 1,014,000 1 144,000 1 1,158,000 [302][303] 4 Episode 4 6 February 2020 992,000 2 174,000 1 1,166,000 [304][305] 5 Episode 5 9 February 2020 1,091,000 1 103,000 1 1,194,000 [306][307] 6 Episode 6 10 February 2020 1,140,000 1 102,000 1 1,242,000 [308][309] 7 Episode 7 11 February 2020 1,109,000 1 132,000 1 1,241,000 [310][311] 8 Episode 8 12 February 2020 1,178,000 1 152,000 1 1,330,000 [312][313] 9 Episode 9 16 February 2019 1,103,000 1 120,000 1 1,223,000 [314][315] 10 Episode 10 17 February 2020 1,091,000 1 136,000 1 1,227,000 [316][317] 11 Episode 11 18 February 2020 1,005,000 1 112,000 1 1,117,000 [318][319] 12 Episode 12 19 February 2020 1,058,000 1 147,000 1 1,205,000 [320][321] 13 Episode 13 23 February 2020 1,200,000 1 104,000 1 1,304,000 [322][323] 14 Episode 14 24 February 2020 1,027,000 1 116,000 1 1,143,000 [324][325] 15 Episode 15 25 February 2020 1,020,000 1 135,000 1 1,155,000 [326][327] 16 Episode 16 26 February 2020 1,128,000 1 175,000 1 1,303,000 [328][329] 17 Episode 17 1 March 2020 1,184,000 1 106,000 1 1,290,000 [330][331] 18 Episode 18 2 March 2020 1,087,000 1 113,000 1 1,200,000 [332][333] 19 Episode 19 3 March 2020 987,000 1 112,000 1 1,099,000 [334][335] 20 Episode 20 4 March 2020 1,100,000 1 136,000 1 1,236,000 [336][337] 21 Episode 21 8 March 2020 976,000 1 110,000 1 1,086,000 [338][339] 22 Episode 22 9 March 2020 1,030,000 1 102,000 1 1,132,000 [340][341] 23 Episode 23 10 March 2020 950,000 2 112,000 1 1,062,000 [342][343] 24 Episode 24 11 March 2020 1,047,000 1 137,000 1 1,177,000 [344][345] 25 Episode 25 15 March 2020 1,115,000 1 93,000 1 1,208,000 [346][347] 26 Episode 26 16 March 2020 1,046,000 4 94,000 1 1,140,000 [348][349] 27 Episode 27 17 March 2020 1,070,000 2 92,000 1 1,162,000 [350][351] 28 Episode 28 18 March 2020 1,077,000 2 104,000 1 1,181,000 [352][353] 29 Episode 29 22 March 2020 1,154,000 3 73,000 3 1,227,000 [354][355] 30 Episode 30 23 March 2020 1,124,000 5 88,000 2 1,212,000 [356][357] 31 Episode 31 24 March 2020 1,075,000 5 67,000 4 1,142,000 [358][359] 32 Episode 32 25 March 2020 1,206,000 5 107,000 1 1,313,000 [360][361] 33 Episode 33 29 March 2020 1,161,000 3 63,000 3 1,224,000 [362][363] 34 Episode 34 30 March 2020 1,122,000 5 54,000 5 1,176,000 [364][365] 35 Final - Part 1 31 March 2020 1,317,000 1 115,000 1 1,432,000 [366][367] 36 Final - Part 2 5 April 2020 1,478,000 1 76,000 1 1,554,000 [368][369]\n\nControversy and legality [ edit ]\n\nBefore the first season went to air, an online petition calling for the series to be axed attracted over 15,000 signatures.[370]\n\nThere was also criticism that, unlike the original Danish series, such marriages would not be legal under Australian law. Channel 9 admitted that participants would not actually marry. A spokesman said \"In order to comply with the Australian Marriage Act (1961) which requires one month and one day notification, a marriage in law was not conducted. Each participant embarked on a commitment ceremony with a wedding celebrant with all due intention to commit fully to this union for the duration of the experiment. At the end of the experiment, they are given the option to continue with the relationship or go their separate ways\".[370]\n\nSecond season participant Simone Lee Brennan described the program as \"never [being] portrayed to its full authenticity,\" suggesting the man she had been paired with, Xavier Forsberg, had been recruited by producers and was seeking a sports-presenting role, rather than an applicant also looking for a relationship.[371]\n\nIn the sixth season, the \"experts\" had to decide on a controversial request from Jessika Power to stay in the experiment with Dan Webb. The couple asked to stay in the experiment as another couple by leaving their \"spouses\" from the initial phases of the experiment. Controversy surrounded the \"experts\" who allowed the couple to stay in the experiment, even though there was evidence and admission that they were cheating on their spouses. An online petition garnered thousands of votes to have the show cancelled.[43]\n\nInternational [ edit ]\n\nBroadcasters [ edit ]\n\nIn Belgium the show is broadcast as Blind getrouwd - Australia and runs every weekday on a Flemish channel called Vitaya.\n\nIn Spain, the show is broadcast as Casados a ciegas and runs every weekday from 6:15 pm for three hours each day on TEN.[372]\n\nIn New Zealand, the show is broadcast on Three and screens Sunday 7pm - 8.30pm, Monday 7.30 - 9.05pm, Tuesday 7.30pm - 9.05pm and Wednesday 7.30pm - 9.05pm. Married at First Sight Australia Season 6 began screening in New Zealand on 3 February 2019. Season 7 began screening on 9 February 2020.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "title": "Married at First Sight (Australian TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}