{"url": "https://www.inquisitr.com/4379879/todd-and-julie-chrisley-reveal-miscarriage-during-appearance-on-hollywood-medium-with-tyler-henry/", "text": "Julie Chrisley is best known as Todd Chrisley’s wife. The two star on the popular USA network show, Chrisley Knows Best. They have put their family out in the public eye, and their struggles have been heavily documented. From the fall out with Todd’s son Kyle Chrisley to the near-fatal accident Savannah had earlier this year, there isn’t anything they haven’t shown. While there are parts of their lives that remain private, there is so much more shown.\n\nLast night, Julie Chrisley appeared on Hollywood Medium with Tyler Henry. It was something she wanted to do despite Todd Chrisley’s reservations. He spoke out about how his faith has kept him away from stuff like this, but Julie insisted she wanted to try it. Against his better judgment, he stood by his wife and sat next to her on the couch as Tyler connected to the people in their lives. According to E! Online, Julie and Todd Chrisley were shocked by a connection mentioned by the Hollywood Medium star. Tyler asked them about a miscarriage or stillborn child that would be on the other side with Todd’s father. Both confirmed that they had lost a child, but had never told anyone. In fact, Julie found out the baby would have been a little girl. The emotions from the Chrisleys were chilling because it was apparent it was real for them.\n\nJust another day doing each other and pissing off haters... A post shared by Todd Chrisley (@toddchrisley) on Jun 26, 2017 at 3:50pm PDT\n\nFans have given Julie Chrisley some push back because of her decision to see Tyler Henry. There were a lot of people who challenged her because she is a Christian woman. While the Chrisley family is never shy about what they believe and Todd Chrisley told Julie how he felt before the reading, she chose to go ahead with it anyway. If she hadn’t gotten the reading, there might not have been peace for her. Aside from the miscarriage revelation, Todd Chrisley’s dad came through. He is someone who has been mentioned a lot on Chrisley Knows Best. While he has been gone for some years, the fact that Tyler knew small details about him blew Todd’s mind.\n\nSo looking forward to this weekend with this group of family , @collinscromie so glad you love us as much as we love you , @sherrybradshaw we can catch up on all the trashy heifers we need to pray for @marciahydrick we can plot their demise , @savannahchrisley you can fill us all in on your new career of Late night entertainment and @juliechrisley you can stick close to me so I don't catch a case . A post shared by Todd Chrisley (@toddchrisley) on May 24, 2017 at 1:00am PDT\n\nThe reading with the Hollywood Medium was healing for both Julie and Todd Chrisley. Julie’s brother coming through, Todd’s dad making his presence known, and the miscarriage were all things the couple needed to get acknowledgments about. By the end of the show, Todd Chrisley admitted he believed in Tyler Henry, and Julie Chrisley knew her decision to do this was the right one.\n\n[Featured Image by Frazer Harrison/Getty Images]", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/529a41685950fba4e7b9458e95b938a2?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/07/Todd-and-Julie-Chrisley.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Tiffany Bailey"], "canonical_link": "https://www.inquisitr.com/4379879/todd-and-julie-chrisley-reveal-miscarriage-during-appearance-on-hollywood-medium-with-tyler-henry/", "title": "Todd And Julie Chrisley Reveal Miscarriage During Appearance On ‘Hollywood Medium with Tyler Henry’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}