{"url": "https://www.elle.com/beauty/a20141335/kelly-rowland-beauty-secrets/", "text": "Kelly Rowland–Grammy-winning singer, author, mom, and all-around superstar–made our dreams come true when she appeared in the Destiny's Child reunion during Beyoncé's historic Coachella shows last month. A lot of preparation went into her performance, starting months before, and leading right up until showtime. We caught up with Rowland at the launch for Schick's new Intuition f.a.b. razor and she gave us all the details on how she got ready for that unforgettable set. She also dished on her go-to beauty products, loving laser treatments, and her self-care advice to expecting moms.\n\nIn the past you've said you're a beauty hoarder, so if you had to kind of edit down–\n\n—I didn't say hoarder. I probably said whore. Beauty whore!\n\nIf you just chose a few products what would they be? Like favorite must-haves.\n\nOne would definitely be Shani Darden's Retinol Reform. Another one would be iS Clinical face wash, because I believe in washing your face. I believe in skincare above anything. A sunscreen. iS Clinical has a great sunscreen. Jessica Alba has this awesome [Honest Beauty] Magic Balm for your eyes. It's clear. It's awesome. It's perfect for summertime. Pat McGrath has these beautiful colors in her eye palettes. Stunning for summer. She just gave me [a palette] through my makeup artist, Sheika Daley. And I'm in love with it.\n\nTell us about your Coachella beauty look. Did it change from week one to week two?\n\nIt did change week-to-week. The first week, where we had the rhinestone fatigue camo on—so, so crazy—was a smokier look and a little bit more sultry. It was fun. The next week was glow, glow, glow. I told Sheika I really wanted to glow. And she glowed me right on out. I loved it.\n\nDestiny’s Child Coachella 2018. Beyonce.com\n\nIn terms of hair removal and body prep when you're wearing like a bodysuit or a tiny outfit, how do you get ready for a show?\n\nI didn't know my legs were so fuzzy because I was tied down in so much rehearsal. I swear to you [the ] was what I used before I went on stage. I was rushing and we were in trailers. If you've ever been to Coachella you've seen that. So, I'm in there just rushing, shaving my legs, and I was safe. And put the lotion on my legs, bronzer, and out.\n\nWhat products do you use for that?\n\nThere's this one product called Gleam. It's really awesome. I use that or .\n\nPerforming on stage takes so much energy and stamina. What does your current fitness routine look like?\n\nPilates, boxing, and weights. That's it.\n\nHave there been any like interesting or unusual beauty services that you've tried recently?\n\nI go to this place in L.A. called Beauty Park. And there's an incredible woman there. Her name is Nurse Jamie. She's amazing. She has all these cool lasers that tighten, brighten, lift, and remove and it's like my favorite new thing. It's probably the biggest beauty splurge I've ever had. It's a big one but it's so worth it.\n\nYou wrote a whole and have a chapter on hair and skin. What advice do you have for pregnant women or new moms in terms of caring for themselves?\n\nYou have to take care of your body when you're pregnant with your baby. I think that a part of taking care of your body is taking care of your baby. Eat the foods that you're supposed to eat for yourself and for the baby. Enjoy resting your feet. Enjoy putting them up. Enjoy giving yourself a facial. Enjoy a night out with friends. Enjoy your mocktails. When I was pregnant, I went out with friends still, not going like too crazy like in clubs in stuff–but I did do that once! I allow myself to have fun. I allow myself to feel beautiful. I have pictures on my phone where I kept taking pictures of my body. And I felt so beautiful pregnant.\n\nAfter you have the baby you've got to take care of yourself, too. We forget about that. You're so wrapped up in being pregnant but you have to remember after you have that baby, you have to take care of yourself and that's internal, external, mental, physical, emotional. You must take care of yourself. You only get one you. And I think that that's so important. That's a lesson I had to learn after I had my son.\n\nThis interview has been edited and condensed.\n\nShop Kelly Rowland's Beauty Essentials Pat McGrath Mothership III Eyeshadow Palette in Subversive, $125; sephora.com SHOP\n\nScott Barnes Body Bling, $42; amazon.com Gleam By Melanie Mills Body Radiance, $34; walmart.com SHOP\n\nSchick Intuition f.a.b. Razor, $10; walmart.com SHOP\n\niS Clinical Extreme Protect SPF 30, $74; dermstore.com SHOP\n\nHonest Beauty Magic Balm, $18; honestbeauty.com SHOP iS Clinical Cleansing Complex, $42; dermstore.com SHOP Resurface by Shani Darden Retinol Reform Peel, $95; shanidarden.com SHOP", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/16/15/2560x1280/landscape-1460388390-elle-kellyrowland.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["India Pougher", "Elle.Com Fellow", "I Am An Editorial Fellow At Elle.Com."], "canonical_link": "https://www.elle.com/beauty/a20141335/kelly-rowland-beauty-secrets/", "title": "Kelly Rowland Beauty Products", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Kelly Rowland Shaved Her Legs Just Minutes Before Hitting the Beychella Stage", "description": "The singer talks Beychella, her beauty-musthaves, and learning self-care.", "url": "https://www.elle.com/beauty/a20141335/kelly-rowland-beauty-secrets/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2019-10-24 03:18:07", "published_time": "2018-05-07 03:30:00", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Kelly Rowland Beauty Routine - Kelly Rowland Beauty Products", "description": "Kelly Rowland–mom, author, and Grammy-winning superstar–made our dreams come true with a Destiny's Child reunion during Beyoncé's historic Coachella shows last month.", "keywords": "kelly rowland, kelly rowland beauty, kelly rowland beauty secrets, kelly rowland skincare, kelly rowland body, kelly rowland fitness, kelly rowland makeup", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty", "sailthru.date": "2018-05-07T15:30:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-918345032-1525705229.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Kelly Rowland Shaved Her Legs Just Minutes Before Hitting the Beychella Stage", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525635000.0, "source": "https://www.elle.com", "summary": ""}