{"url": "https://www.rollingstone.com/music/music-news/quincy-jones-awarded-9-42-million-in-royalties-suit-with-michael-jacksons-estate-113207/", "text": "Quincy Jones has been awarded $9.42 million ($9,423,695) after a trial that ended with a Los Angeles jury finding in the producer’s favor in a royalties dispute with Michael Jackson’s estate, Variety reports.\n\nThe lawsuit, which Jones filed in 2013, stemmed from Jones’ claim that he was owed royalties for a series of projects that were released after Jackson died, including the music used in two Cirque du Soleil productions and music featured in the This Is It concert film. Jones said he was owed $30 million.\n\nLast week, Jones took the witness stand and claimed he was “cheated out of a lot of money” by the Jackson estate.\n\nDuring the two-week trial, lawyers debated over interpreting the contract language that determined how Jones’ royalties should be computed, particularly the contracts from Off the Wall, Thriller and Bad. Attorneys for Jones argued that those contracts entitled Jones to royalties from the posthumous This is It along with proceeds from the two Cirque du Soleil shows. Meanwhile, Howard Weitzman, who represented the Jackson estate, argued that Jackson made the major contributions to the sound of each song.\n\n“While the jury denied Quincy Jones $21 million – or more than two-thirds of what he demanded — from The Estate of Michael Jackson, we still believe that giving him millions of dollars that he has no right to receive under his contracts is wrong,” Weitzman and Zia Modabber, attorneys for The Estate of Michael Jackson, said in a statement. “This would reinterpret the legal language in, and effectively rewrite, contracts that Mr. Jones lived under for more than three decades, admitted he never read, referred to as ‘contract, montract,’ and told the jurors he didn’t ‘give a damn’ about. Any amount above and beyond what is called for in his contracts is too much and unfair to Michael’s heirs. Although Mr. Jones is portraying this is a victory for artists’ rights, the real artist is Michael Jackson and it is his money Mr. Jones is seeking.”\n\nFollowing the verdict, Jones said in a statement via Variety, “As an artist, maintaining the vision and integrity of one’s creation is of paramount importance. I, along with the team I assembled with Michael, took great care and purpose in creating these albums, and it has always given me a great sense of pride and comfort that three decades after they were originally recorded, these songs are still being played in every corner of the world.\n\n“This lawsuit was never about Michael, it was about protecting the integrity of the work we all did in the recording studio and the legacy of what we created,” he continued. ” Although this judgement is not the full amount that I was seeking, I am very grateful that the jury decided in our favor in this matter. I view it not only as a victory for myself personally, but for artists’ rights overall.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-666023238-3072253b-702e-446b-a14c-3919a60ba84e.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fquincy-jones-awarded-9-42-million-in-royalties-suit-with-michael-jacksons-estate-113207%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=113207", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-666023238-3072253b-702e-446b-a14c-3919a60ba84e.jpg", "keywords": [], "authors": ["Althea Legaspi", "Althea Legaspi'S Most Recent Stories", "Watch Beyonce S Surprise Performance Of Disney S", "When You Wish Upon A Star", "Kehlani Finds Solace In Backyard For Self-Directed", "Everybody Business", "Kelly Clarkson Touts Resilience In Uplifting New Song", "I Dare You", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/quincy-jones-awarded-9-42-million-in-royalties-suit-with-michael-jacksons-estate-113207/", "title": "Quincy Jones Awarded $9.42 Million in Royalties Suit", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Quincy Jones has been awarded $9.42 million in his lawsuit over royalties with Michael Jackson's estate.", "news_keywords": "Michael Jackson, Quincy Jones", "og": {"type": "article", "title": "Quincy Jones Awarded $9.42 Million in Royalties Suit", "url": "https://www.rollingstone.com/music/music-news/quincy-jones-awarded-9-42-million-in-royalties-suit-with-michael-jacksons-estate-113207/", "description": "“This lawsuit was never about Michael, it was about protecting the integrity of the work we all did,” Jones said", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-666023238-3072253b-702e-446b-a14c-3919a60ba84e.jpg", "width": 1024, "height": 694, "alt": "Quincy Jones"}, "locale": "en_US"}, "article": {"published_time": "2017-07-27T02:10:00+00:00", "modified_time": "2018-06-25T13:59:09+00:00"}, "twitter": {"text": {"title": "Quincy Jones Awarded $9.42 Million in Royalties Suit With Michael Jackson's Estate"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-666023238-3072253b-702e-446b-a14c-3919a60ba84e.jpg?w=1024", "alt": "Quincy Jones"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Quincy Jones Awarded $9.42 Million in Royalties Suit With Michael Jackson’s Estate", "description": "Quincy Jones has been awarded $9.42 million in his lawsuit over royalties with Michael Jackson's estate."}, "generator": "WordPress 5.4", "author": "Althea Legaspi", "content_type": "Article", "post_id": 113207, "title": "Quincy Jones Awarded $9.42 Million in Royalties Suit With Michael Jackson's Estate", "published_at": "2017-07-27 02:10:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-666023238-3072253b-702e-446b-a14c-3919a60ba84e.jpg?w=1024", "comment_count": 0, "tags": "Quincy Jones", "topics": "Music News", "body": "Quincy Jones has been awarded $9.42 million ($9,423,695) after a trial that ended with a Los Angeles jury finding in the producer's favor in a royalties dispute with Michael Jackson's estate, Variety reports. The lawsuit, which Jones filed in 2013, stemmed from Jones' claim that he was owed royalties for a series of projects that were released after Jackson died, including the music used in two Cirque du Soleil productions and music featured in the This Is It concert film. Jones said he was owed $30 million.Last week, Jones took the witness stand and claimed he was \"cheated out of a lot of money\" by the Jackson estate.During the two-week trial, lawyers debated over interpreting the contract language that determined how Jones' royalties should be computed, particularly the contracts from Off the Wall, Thriller and Bad. Attorneys for Jones argued that those contracts entitled Jones to royalties from the posthumous This is It along with proceeds from the two Cirque du Soleil shows. Meanwhile, Howard Weitzman, who represented the Jackson estate, argued that Jackson made the major contributions to the sound of each song. \"While the jury denied Quincy Jones $21 million – or more than two-thirds of what he demanded -- from The Estate of Michael Jackson, we still believe that giving him millions of dollars that he has no right to receive under his contracts is wrong,\" Weitzman and Zia Modabber, attorneys for The Estate of Michael Jackson, said in a statement. \"This would  reinterpret the legal language in, and effectively rewrite, contracts that Mr. Jones  lived under for more than three decades, admitted he never read, referred to as 'contract, montract,' and told the jurors he didn't 'give a damn' about. Any amount above and beyond what is called for in his contracts is too much and unfair to Michael’s heirs. Although Mr. Jones is portraying this is a victory for artists’ rights, the real artist is Michael Jackson and it is his money Mr. Jones is seeking.\"Following the verdict, Jones said in a statement via Variety, “As an artist, maintaining the vision and integrity of one’s creation is of paramount importance. I, along with the team I assembled with Michael, took great care and purpose in creating these albums, and it has always given me a great sense of pride and comfort that three decades after they were originally recorded, these songs are still being played in every corner of the world.\"This lawsuit was never about Michael, it was about protecting the integrity of the work we all did in the recording studio and the legacy of what we created,\" he continued. \" Although this judgement is not the full amount that I was seeking, I am very grateful that the jury decided in our favor in this matter. I view it not only as a victory for myself personally, but for artists’ rights overall.”", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1501121400.0, "source": "https://www.rollingstone.com", "summary": ""}