{"url": "www.mercurynews.com/2018/06/28/scarlett-johansson-blasts-ex-scientologists-claim-she-auditioned-to-be-tom-cruises-next-wife/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nIn 2004, the Church of Scientology embarked on a top-secret project to find a new wife for Tom Cruise after his divorce from Nicole Kidman and the end of his relationship to actress Penelope Cruise, according to a report by Vanity Fair.\n\nThe project involved an elaborate auditioning process in which actresses were brought in to try out for a film, then asked a series of questions that included: “What do you think of Tom Cruise?”\n\nIn an interview Wednesday, a former Scientology member, who said he served on Cruise’s Scientology security detail, claims that one of the actresses who auditioned to be Cruise’s “second dynamic” was Scarlett Johansson.\n\nWhile appearing on NBC’s “Megyn Kelly Today” on Wednesday, Brendan Tighe, who was born into the organization but left in 2011, said he inadvertently came across reports of women who auditioned to be in a relationship with the “Mission Impossible” actor — and one was Johansson.\n\nThe reports, by Cruise’s celebrity “handler” Tommy Davis, were mistakenly sent to Tighe’s printer, he said.\n\n“The only name I remember was Scarlett Johansson,” Tighe told Kelly. “It was right there in the report.”\n\nIn a statement to the Hollywood Reporter, Johansson, 33, vehemently denied Tighe’s assertion.\n\n“The very idea of any person auditioning to be in a relationship is so demeaning,” the “Avengers” actress said. “I refuse for anyone to spread the idea that I lack the integrity to choose my own relationships. Only a man aka Brendan Tighe would come up with a crazy story like that.”\n\nBut the 2012 Vanity Fair report confirms the essence of Tighe’s assertion. The story said that Cruise had attempted to entice several of beautiful, well-known women to accept his devotion to Scientology — and Johansson was one of them.\n\nFilm industry reports from 2005 also questioned why Johansson had been dropped from co-starring with Cruise in “Mission: Impossible III.”\n\nThe actress told the media at the time that she had been attached to Cruise’s film, but said “scheduling conflicts” came up. She wanted to work with Woody Allen on his 2006 film “Scoop,” after working with Allen on his critically acclaimed “Match Point.”\n\n“When you have a big production like (“Mission: Impossible”), they can’t move stuff around that easily,” she said in an interview. “I wanted to work with Woody so, unfortunately, that was a casualty, I guess.”\n\nBut another report from 2005 suggests that there were other conflicts as well, and they had to do with Cruise’s personal interests in Johannson. Today.com, citing a report from RadarMagazine.com, said Cruise invited Johannson to the Scientology center where he showed her literature about joining his controversial self-styled religious organization.\n\n“After two hours of proselytizing, Cruise opened a door to reveal a second room full of upper-level Scientologists who had been waiting to dine with the pair,” RadarMagazine.com reported. At that point, “the cool-headed ingénue politely excused herself,” the magazine said.\n\nIn his interview with Kelly, Tighe said he was certain he saw Johansson’s name in one of the reports from Tommy Davis.\n\nThe other thing he said about the supposed audition of Johansson is that “it didn’t go well” because she wasn’t interested in a relationship with Cruise.\n\nAs a result, another actress and known Scientology member Erika Christensen “had to disconnect from Johansson because (the audition) didn’t go well,” Tighe said. “That was in that report.”\n\nScientology also issued a response to Tighe’s claim regarding his association with Cruise, 55. Karin Pouw, from the Church of Scientology International, told Kelly: “Brendan Tighe was a Church of Scientology Flag Service Organization security guard/night watchman from 2002 to 2009. The ‘access’ he boasts of having was largely limited to viewing security cameras from a guard booth. He was removed from that position for dereliction of duty.”\n\nTighe disputed Scientology’s record of his service with the organization, saying it wasn’t “even remotely” true. He said he was on night duty only from 2002 to 2004, then worked a day shift. He also said he wasn’t removed from the job. “I got fed up with the job and walked away,” he told Kelly.\n\nIn another portion of the interview, Tighe said that Cruise and another high-profile Scientology member John Travolta didn’t get along. That’s because Travolta, whom he called “a very nice guy,” was annoyed that Cruise surpassed him in the church’s hierarchy.\n\n“They would keep as far apart from each other as possible,” Tighe said. “They could be in the same building and pass each other in the hall and give each other the cold shoulder. Honestly, it was quite jarring.”\n\nTighe said the tension between the two A-list stars became especially apparently after the organization recognized Cruise as its most dedicated member by giving him with its Freedom Medal of Valor award in 2008. Before that, Travolta was known as the top disseminator of information about Scientology to the general public. But with the award, “Cruise bumped him out of that spot,” Tighe said.\n\nTighe told Kelly he has documentation to back up his claims about Cruise and Scientology.\n\nHe also told Kelly that he owes his shiny white teeth to Cruise. “During those years, we had to get our teeth whitened,” he said. “If we had anything to do with his service, we had to be seen by a dentist and undergo a full dental program.”\n\nAs for the reported audition process for actresses to date Cruise, Vanity Fair reported in 2012 that the organization selected Nazanin Boniadi, an Iranian-born, London-raised actress to develop a relationship with the actor. Boniadi and Cruise dated from November 2004 until January 2005.\n\nFor their first date, Boniadi was flown to New York where she and Cruise and Boniadi went to dinner at Nobu with an entourage of Scientology aides, then to the skating rink at Rockefeller Center, which was otherwise closed to the public. The two stayed at future President Donald Trump’s Trump Tower, where Cruise and his entourage rented an entire floor. But they didn’t have sex that night.\n\nBoniadi felt she was being as though she was being set up for an arranged marriage with Cruise.\n\nCruise purportedly told her, “I’ve never felt this way before.” Their first month together was “bliss,” Boniadi told Vanity Fair. But eventually, she displeased Cruise because she was overwhelmed by the intensity of his affections, including his penchant for public displays, according to Vanity Fair. She also ran afoul of Scientology leader David Miscavige, a close Cruise friend, because she couldn’t keep up with his rapid speaking style while entertaining him at Cruise’s home in Telluride.\n\nCruise and Holmes began dating in April 2005 and married in November 2006 after their daughter Suri was born. They divorced in 2012, reportedly because Holmes didn’t want their daughter raised in the Church of Scientology.\n\nThis story has been updated to include additional details from reports from Vanity Fair, Today.com and RadarMagazine.com.", "images": ["https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2018/06/Scarlett_Johansson_09.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/09/scientologycruise2.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/05/kidman_11.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2018/05/travolta_05.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2016/08/20120709__peoplemag1.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2017/03/scarlett_2.jpg?w=1024&h=737", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/03/scarlett_2.jpg?w=1024&h=737", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/06/28/scarlett-johansson-blasts-ex-scientologists-claim-she-auditioned-to-be-tom-cruises-next-wife/", "title": "Tom Cruise’s Scientology wife search? Reports have long named Scarlett Johannson as a target", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Scarlett Johansson blasted an ex-Scientologist's claim that she was among actresses the Church arranged to audition to be in a relationship with Tom Cruise.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Tom Cruise’s Scientology wife search? Reports have long named Scarlett Johannson as a target", "url": "https://www.mercurynews.com/2018/06/28/scarlett-johansson-blasts-ex-scientologists-claim-she-auditioned-to-be-tom-cruises-next-wife/", "description": "The “Avengers” star is blasting another new claim regarding herself and Tom Cruise: That she was part of a 2004 auditioning process to become his next “second dynamic.”", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/03/scarlett_2.jpg?w=1024&h=737", "width": 1024, "height": 737}, "locale": "en_US"}, "article": {"published_time": "2018-06-28T14:01:36+00:00", "modified_time": "2018-06-29T13:29:16+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Tom Cruise’s Scientology wife search? Reports have long named Scarlett Johannson as a target"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/03/scarlett_2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1530115200.0, "source": "http://www.mercurynews.com", "summary": ""}