{"url": "https://en.wikipedia.org/wiki/Christopher_Boykin", "text": "Christopher \"Big Black\" Boykin (January 13, 1972 – May 9, 2017) was an American television personality and musician best known for his role on the MTV reality television series Rob & Big, in which he co-starred with professional skateboarder Rob Dyrdek from 2006 to 2008.\n\nEarly life [ edit ]\n\nBoykin was born on January 13, 1972 in the Southern US town of Raleigh, Mississippi.[1] He served in the United States Navy.[2]\n\nTelevision career [ edit ]\n\nIn a skit for DC Shoes, professional skateboarder Rob Dyrdek hired Boykin to be his bodyguard and to protect him from security guards.[3] From November 2006 to April 2008, he and Dyrdek starred in the reality television series Rob & Big on MTV.\n\nIn a 2006 episode of Rob & Big, Dyrdek and Boykin visit the studios of game developer EA Black Box in Vancouver to do motion capture for a video game in which they were to become characters. The game, Skate, was published in 2007. Boykin and Dyrdek also appeared in the 2009 sequel, Skate 2. In 2007, Boykin launched a clothing brand, Big Black, to market T-shirts and hats that bore his catchphrase, \"Do Work\".[1] In the show's 2008 season, Boykin set two Guinness world records: one for peeling and eating three bananas in one minute, and another for eating five powdered doughnuts in two minutes, 45 seconds.[4] Boykin left Rob & Big after the third season, since he was starting a family. MTV premiered Rob Dyrdek's Fantasy Factory in February 2009, less than a year after the final episode of Rob & Big. Boykin joined the cast in 2011, and remained until the show's final episode in 2015. He also appeared on three episodes of Dyrdek's show Ridiculousness, which premiered in 2011. Guest appearances on the MTV series Guy Code and Snack Off (2014) are among his other TV appearances.[5]\n\nFinal years [ edit ]\n\nBoykin married Shannon Turley in 2008;[6] although the couple divorced in 2009, they were living together shortly before Boykin's death, due to his worsening health. Their daughter, Isis, was nine years old when Boykin died in May 2017.[7]\n\nBoykin had a defibrillator implant for his heart. In early May 2017, he was hospitalized in Plano, Texas, and was placed on a heart monitor.[7] On May 9, his heart stopped; staff spent 30 minutes trying to revive him. He was pronounced dead at 4:00 p.m.CDT.[8] Although initial reports did not mention an official cause,[2][9] Boykin's heart failure was the result of a heart attack.[10][11]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Big_Black_-_E3_Expo_2010_-_June_17%2C_2010_-_Los_Angeles_%28cropped%29.jpg/220px-Big_Black_-_E3_Expo_2010_-_June_17%2C_2010_-_Los_Angeles_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/3e/Big_Black_-_E3_Expo_2010_-_June_17%2C_2010_-_Los_Angeles_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Big_Black_-_E3_Expo_2010_-_June_17%2C_2010_-_Los_Angeles_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Christopher_Boykin", "title": "Christopher Boykin", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Big_Black_-_E3_Expo_2010_-_June_17%2C_2010_-_Los_Angeles_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}