{"url": "https://www.thehollywoodgossip.com/2017/12/stassi-schroeder-i-starve-myself-to-stay-thin/", "text": "There's certainly been no shortage of drama thus far on Vanderpump Rules Season 6.\n\nIn fact, the conflicts and controversies are so plentiful that they're spilling off the screen and overflowing into our tabloids and Twitter timelines.\n\nJust this morning, we learned that Faith Stowers faked being pregnant with Jax Taylor's baby in order to land a spot on the show.\n\nNow, the afternoon is keeping pace with some old-fashioned, skinny-shamming, joke-missing outrage centering around an interview Stassi Schroeder gave to Daily Mail Australia.\n\nYes, Stassi is currently Down Under, delivering her caustic wit to the land of Vegemite and giant spiders that will eat your face while you sleep.\n\nAsked how she maintains her trim figure despite a schedule that seems pretty well packed with work and social obligations, Stassi had this to say:\n\n\"I'm really lazy,\" she told the outlet.\n\n\"I stay thin by trying to starve myself for the most part, if I'm being honest. When I'm home in Los Angeles, it's like one meal a day.\"\n\nStassi added, \"But when I go out of town or on work trips, it's breakfast, lunch and dinner.\"\n\nNow, this is an object lesson in the danger of print interviews.\n\nIf Stassi had tearfully confessed that she starves herself, the Mail would've said so.\n\nAs it is, they didn't describe her inflection at all, so we think it's safe to say that Stassi wasn't actually opening up to a group of Aussie strangers about her eating disorder, but was instead simply joking.\n\nSure enough, Stassi recently cleared things up on social media, tweeting:\n\n\"Mmm. There was an element of sarcasm while I was doing that interview,\" along with several food emojis.\n\nSadly, emojis for ranch dressing and fried goat cheese balls don't exist yet.\n\nOf course, her diet is far from the most dramatic element of Stassi's life these days.\n\nOn last night's episode of Vanderpump, viewers finally got to meet her longtime on-again, off-again boyfriend, Patrick Meagher.\n\nBecause people on the internet are easily confused, the appearance sparked rumors that Stassi and Patrick are back together.\n\nAs far as we know, that's not true, which is a good thing, as dude is a chronic mansplainer and he looks like Riff Raff.\n\nGet you a man that looks like Khal Drogo and knows how to mix up a top-notch strawberry margarita, girl!\n\nWatch Vanderpump Rules online to get caught up on what's already been one hell of a drama-packed season.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Z5xOdgrM--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511657091/stassi-schroeder-in-black.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Z5xOdgrM--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511657091/stassi-schroeder-in-black.jpg", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/12/stassi-schroeder-i-starve-myself-to-stay-thin/", "title": "Stassi Schroeder: I Starve Myself to Stay Thin!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/12/stassi-schroeder-i-starve-myself-to-stay-thin/", "title": "Stassi Schroeder: I Starve Myself to Stay Thin!", "description": "Did Stassi Schroeder open up about having an eating disorder? No, but that's what several lame tabloids would have you believe.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--0G0arVHi--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1426587991/stassi-is-always-right.gif", "type": "image/gif", "width": 500, "height": 280}}, "article": {"published_time": "2017-12-12T15:04:04-05:00", "modified_time": "2017-12-12T15:07:38-05:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Stassi Schroeder: I Starve Myself to Stay Thin!", "description": "Did Stassi Schroeder open up about having an eating disorder? No, but that's what several lame tabloids would have you believe.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--Z5xOdgrM--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1511657091/stassi-schroeder-in-black.jpg"}}, "description": "Did Stassi Schroeder open up about having an eating disorder? No, but that's what several lame tabloids would have you believe."}, "movies": [], "publish_date": 1513109044.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}