{"url": "https://www.independent.co.uk/life-style/fashion/star-print-galaxy-fashion-style-autumn-winter-2018-chanel-dior-marks-and-spencer-a8140796.html", "text": "Astrological motifs and space-inspired references have dominated both on and off the runway this season, as designers and the style savvy looked to the skies for their next fashion fix.\n\nIt’s official, stars are the new stripes.\n\nOn the high street, fashion bloggers went wild for Marks and Spencer’s Constellation midi dress, which sold out almost instantly – and when it was restocked at the end of October, it sold rapidly at a rate of one every 90 seconds.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nElsewhere, brands such as Reformation and Rixo London quickly became a firm favourite among the style set after plastering everything from cocktail dresses and skirts to swimwear in the pentagonal symbol.\n\nIf that wasn’t enough, with Star Wars fever gripping the world you can probably guess the pattern used on the Monse dress that actress Daisy Ridley wore to the premier of the latest movie in the franchise, Star Wars: The Last Jedi. That’s right, strapless and sequined all-over, the epic frock came covered in galactic glittering stars.\n\nOf course, like most trends it may come as no coincidence that intergalactic motifs were first spotted on the runways of the Autumn Winter 2017 fashion shows.\n\nChanel staged its show around a double C-branded spacecraft that even had a mock liftoff, as well as astronaut prints, sparkly lunar boots and metallic space blankets.\n\nDior’s Maria Grazia Chiuri also explored constellations as an extension of her couture collection, with evening gowns emblazoned with phases of the moon, golden colours and cosmic elements scattered on sweaters.\n\nA trend that proves entirely wearable in real life, if the thought of donning spacecraft-inspired garb is all a bit too Rebel Alliance for your liking, then there’s always jewellery.\n\nInstead, star spangle your accessories with zodiac trinkets from Astley Clarke, twinkling jewels from Diane Kordas – or, if you’re on a budget, high street stores such as Topshop and Accessorize promise to light up your complexion.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/03/23/ms-constellation-print-midi-dress.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/03/23/ms-constellation-print-midi-dress.jpg", "keywords": [], "authors": ["Sarah Young"], "canonical_link": "https://www.independent.co.uk/life-style/fashion/star-print-galaxy-fashion-style-autumn-winter-2018-chanel-dior-marks-and-spencer-a8140796.html", "title": "Seeing stars: Intergalactic style is here to stay for 2018", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/life-style/fashion/star-print-galaxy-fashion-style-autumn-winter-2018-chanel-dior-marks-and-spencer-a8140796.html", "title": "Intergalactic style is here to stay for 2018", "updated_time": "2018-01-08T06:51:02+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/03/23/ms-constellation-print-midi-dress.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8140796"}, "description": "Astrological motifs and space-inspired references have dominated both on and off the runway this season, as designers and the style savvy looked to the skies for their next fashion fix. It’s official, stars are the new stripes. On the high street, fashion bloggers went wild for Marks and Spencer’s Constellation midi dress, which sold out almost instantly – and when it was", "keywords": "fashion and style, Chanel, Dior, Marks And Spencer, Fashion, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "fashion and style", "published_time": "2018-01-07T15:05:15+00:00", "modified_time": "2018-01-08T06:51:02+00:00", "section": "Fashion", "author_name": "Sarah Young", "content_type": "story", "word_count": 365, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 5}, "twitter": {"title": "Intergalactic style is here to stay for 2018", "description": "Astrological motifs and space-inspired references have dominated both on and off the runway this season, as designers and the style savvy looked to the skies for their next fashion fix. It’s", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1515337515.0, "source": "https://www.independent.co.uk", "summary": ""}