{"url": "http://www.mtv.com/news/3030959/katy-perry-best-moments-vmas/", "text": "Kevin Mazur/WireImage\n\nSome of our earliest — and most memorable — glimpses of Katy Perry are from the MTV Video Music Awards, and a closer look at her rise reveals that some of her biggest accomplishments are woven into the fabric of an awards show as bold and unpredictable as she is.\n\n2007 would prove to be a pivotal year for Perry: She'd signed a deal with Capitol Records, who would release her debut album, One of the Boys, the following year. Perry's ability to package provocative lyrics into refreshing, radio-friendly pop was undeniable. Her breakout single \"I Kissed A Girl\" not only helped fuel her growing fame, it landed her on the red carpet of the 2008 VMAs, hanging out with Miley Cyrus and Taylor Swift. She managed to score an invite to perform two songs at the ceremony itself too.\n\nSoon-to-be-Katy Cats were still getting to know the beauty with the big, blue eyes, but the 2008 VMAs were huge for Perry: It was a major performance before a massive audience, and captured the kind of televised attention that would follow Perry from that point forward. But it was also the beginning of Perry’s long, involved history with the MTV awards show, one that often coincided with personal and professional milestones. To celebrate her grand return and her gig hosting the whole shebang on August 27, here's a look back at her major moments — and how it all comes back to the VMAs.\n\n2008: Katy Perry Kissed A Girl And [Everyone] Liked It After palling around with Swift and Cyrus on the red carpet, Perry joined Travis Barker and DJ AM onstage at the VMAs to tackle two formidable tracks. First, she tried her hand at Madonna’s “Like A Virgin,” which Madge performed on the VMA stage back in 1984. Perry updated it for a 2008 audience thanks to her cheeky \"Like A [Jonas]\" tweaks. She followed that up with “I Kissed A Girl,” and in the accompanying clip, Perry, walks off-stage after the performance, cracks up at host Russell Brand’s praise of her single and his newfound (and X-rated) appreciation for cherry chapstick. She’s all smiles, and for good reason: In addition to the performance, “I Kissed A Girl” earned Perry nominations in a number of categories, including Best New Artist and Best Female Video, and she was just thrilled to be joining the ranks of Rihanna and Britney Spears. In a backstage interview, Perry was bowled over — and grateful — for the consideration in the Best Female Video category, especially. \"It’s a very challenging VMA!\" she said. \"I’m very honored to have anybody like my song and nominate me for a chance to win. I think the challenge is tough, but I always put up a good fight, and if I don’t win, that’s okay! I’m new at this game! I might win in the future.” Might? If she only knew ...\n\n2009: She Will Rock You Kevin Mazur/WireImage What do Queen, Kanye West, one of the most notorious moments in VMA history, “Empire State of Mind,” and a diamond ring have in common? They’re all tied up in the 2009 VMAs — a night that changed the course of Perry’s life. The success of One of the Guys and her Best Female Video nomination for her \"Hot n Cold\" video gave Perry a major bump, as far as her involvement with the show was concerned: She kicked things off on the main stage for the show-opener, which featured her belting out Queen’s “We Will Rock You” alongside Joe Perry of Aerosmith. Brand — who made his appearance at the tail-end of the song — and Perry hit it off at rehearsal, sparking a romance that would lead to a proposal just a few months later on New Year’s Eve. Before she walked into Radio City Music Hall that night, Perry joked around with Adrienne Bailon about how she was “trying to snag a man” (and went so far as to say she was eyeballing Robert Pattinson). And hey! She did. The reverberations of the 2009 VMAs extended beyond Perry’s personal life, too. To close the show, Jay Z and Alicia Keys brought the crowd at Radio City to their feet with “Empire State of Mind,” and that track would go on to inspire Perry to write “California Gurls,” which would serve as the first single of her next album. Though it wasn’t necessarily that specific performance that would eventually bring Perry, Snoop, and some crazy cans of whip cream together for one of her most eye-catching videos, the spiritual connection between the two songs is strong — so it’s perfect that her next hit after this particular VMAs is so closely tied to its grand finale.\n\n2010: Just Dream-y Chris Polk/Getty Images By the time she strolled into Los Angeles’ Nokia Theatre on September 12 for the VMAs, Perry was completely and totally consumed by her sophomore full-length, Teenage Dream — and so was the rest of the country. Teenage Dream came out just three weeks before the VMAs on August 24, and as such, she had a low-key year at the VMAs, by her standards: She presented the Best Male Video award alongside Nicki Minaj, and her candy-coated \"California Gurls\" video earned nominations in two categories.\n\n2011: Baby, You're A Firework — In Formalwear Jeff Kravitz / Steve Granitz If 2010 was chill, 2011 had none of it, as this was Perry's record-breaking year on multiple levels. Perry was the most-nominated artist, with 10 nods to her name thanks to videos for Teenage Dream’s title track; “Firework”; “E.T.,” her collaboration with West; “Teenage Dream”; and “Last Friday Night (T.G.I.F.).” She’d go on to take home the top honor of the evening, Video of the Year, for “Firework,” and the Best Collaboration and Best Visual Effects awards for “E.T.\" Beyond the VMAs, Perry — and Teenage Dream — thrived. In the year following its release, five Teenage Dream tracks would hit No. 1 on the Billboard Hot 100, a record previously held only by Michael Jackson, and thus Perry became the first female artist to earn that distinction in the history of the chart. Perry also had her first major animated feature debut when The Smurfs hit theaters that summer and audiences realized that the voice of Smurfette sounded a little too familiar. If we had to pick one word to sum up Perry's VMA spoils, commercial triumphs, and every other accolade she collected in 2011? It'd be incendiary. You know, kind of like a firework.\n\n2012: The Pre-Prism Calm Jason LaVeris/FilmMagic By this point, Perry was a seasoned VMA vet, a singer still reaping the rewards of the oh-so-successful Teenage Dream, and a gal whose appearances at the VMAs were just as regular as the hits she was putting out. Perry was a nominee at the 2012 VMAs — \"Wide Awake\" scored a Moon Person (then still known as a Moonman) for Best Art Direction, and nods for Video of the Year, Best Female Video, and Best Visual effects — as well as a presenter. Perry had the honor of giving One Direction their first VMA win, as she presented the guys — well, the boys, really, because look at those baby faces! — with the Best Pop Video prize for \"What Makes You Beautiful.\" Beyond the VMAs, 2012 saw the end of Teenage Dream's album cycle, and a slow-down in Perry's world as a result. She kicked off her year with a performance of \"Firework\" at the Grammy Awards, and she and Brand settled their divorce just a month before the VMAs that July.\n\n2013: We Heard Her Roar Gary Gershoff/WireImage The VMAs ventured to Brooklyn, New York, for the first time in 2013 — and Perry performed beneath the borough's most recognizable landmark for one knockout of a grand finale. Perry was still over a month out from the release of Prism, her fourth studio album, by the time of the ceremony, but first single \"Roar\" saw its release just a couple of weeks before the VMAs, which made it a perfect choice for an epic closer. In a ceremony full of extremely memorable performances, Perry's stood out as historic in that she quite literally broke new ground: She took \"Roar\" to a boxing ring by the foot of the Brooklyn Bridge, and duked it out with the tune that would become one of her biggest — and most motivational — smashes with its iconic arches looming above her. As she did with Teenage Dream, Perry used the VMAs as the unofficial launchpad for the next chapter of her career — and \"Roar\" made for an energetic, uplifting ascent into her Prism period.\n\n2014: Reign of the \"Dark Horse\" Kevin Mazur/MTV1415/WireImage From start to finish, Perry's night out at the 2014 VMAs was that of a winner. She and her date, Riff Raff, showed up in matching, head-to-toe denim ensembles that were a modern update on a red carpet look Spears and Justin Timberlake rendered legendary in 2001. She spent most of the show hanging out with Sam Smith and Cyrus, but took a break from posing for the occasional selfie with her friends to make her way to the mic for her acceptance speech. The winning visual? The insane vid for her collaboration with Juicy J, \"Dark Horse,\" which had Perry trying on Cleopatra's look for size while putting her own surrealistic spin on that timeless, jet black bob and eyeliner. \"Dark Horse\" gave Perry her sixth Best Female Video nomination and her fifth VMA win, and would go on to be crowned the top song of 2014 on a ton of year-end lists, including Billboard's Top 40 chart.\n\n2017: To Be Witnessed Perry may have come at us like a dark horse in 2014, but now – months out from the release of Witness, her latest album, and with a handful of 2017 nominations — could this year be her most intense yet at the VMAs? We'll just have to wait and see, but one thing's for sure: She's familiar with the territory, and she knows how to make the VMAs a night to remember.\n\nThe 2017 VMAs touch down at the Forum in Inglewood, California, on Sunday, August 27 at 8 p.m. ET/PT. See the full list of nominees here and vote for Best New Artist now!", "images": ["https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/GettyImages-104033944-1503001750.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/GettyImages-151418338-1502988234.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/katy_perry_2011_video_music_awards-1502989508.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/GettyImages-454112640-1-1503011099.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?width=385&height=217&quality=.05&format=jpg", "https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/GettyImages-177739963-1503007254.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2017/08/GettyImages-90718325-1502995997.jpg?quality=.8&height=1&width=1", "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?quality=0.8&format=jpg&width=1440&height=810&.jpg"], "top_img": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?quality=0.8&format=jpg&width=1440&height=810&.jpg", "keywords": [], "authors": ["Hilary Hughes"], "canonical_link": "http://www.mtv.com/news/3030959/katy-perry-best-moments-vmas/", "title": "Katy Perry's Most Unforgettable VMA Moments, From Red Carpets To 'Roar'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "HandheldFriendly": "true", "MobileOptimized": 320, "reporting": {"beacon_url": "http://mb.mtv.com/data/collect/v1/mb.gif", "call_config": "{\"omniture\":{\"pageName\":\"/news/3030959/katy-perry-best-moments-vmas/\",\"channel\":\"news\",\"events\":\"event16, event18\",\"prop1\":\"Katy Perry\",\"prop8\":\"none\",\"prop9\":\"\",\"prop11\":\"\",\"prop12\":\"Music\",\"prop14\":\"Pop\",\"prop15\":\"no-franchise\",\"prop18\":\"Katy Perry's Most Unforgettable VMA Moments, From Red Carpets To 'Roar' [Music]\",\"prop19\":\"08.22.2017\",\"prop20\":\"Hilary Hughes\",\"prop21\":\"ALLTRAFFIC:MTV\",\"prop28\":\"News article\",\"prop38\":\"mtv.com\",\"prop44\":\"vma\",\"prop55\":\"news:News\",\"prop65\":\"News Article\",\"eVar6\":\"none\",\"eVar9\":\"/news/3030959/katy-perry-best-moments-vmas/\",\"eVar10\":\"ALLTRAFFIC:MTV\",\"eVar68\":\"no-franchise\",\"hier1\":\"/news/3030959/katy-perry-best-moments-vmas/\"}}"}, "og": {"site_name": "MTV News", "image": {"identifier": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?quality=0.8&format=jpg&width=1440&height=810&.jpg", "width": 1440, "height": 810}, "author": "Hilary Hughes", "type": "article", "description": "She's performed, presented, walked out a winner — and she's got plenty of stories that start with VMA", "title": "Katy Perry's Most Unforgettable VMA Moments, From Red Carpets To 'Roar'", "url": "http://www.mtv.com/news/3030959/katy-perry-best-moments-vmas/"}, "ao": {"mgid": "mgid:wordpress:post:articles.mtv.com:3030959"}, "thumbnail": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?quality=0.8&format=jpg&width=1440&height=810&.jpg", "twitter": {"image": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:245065?quality=0.8&format=jpg&width=500&height=375", "card": "summary_large_image", "description": "She's performed, presented, walked out a winner — and she's got plenty of stories that start with VMA", "title": "Katy Perry's Most Unforgettable VMA Moments, From Red Carpets To 'Roar'", "url": "http://www.mtv.com/news/3030959/katy-perry-best-moments-vmas/"}, "author": "Hilary Hughes", "article": {"author": "http://www.twitter.com/hilmonstah"}, "fb": {"app_id": 122150691493, "admins": "unset"}, "asset_url": "http://www.mtv.com/news", "expression": "shownav", "description": "She's performed, presented, walked out a winner — and she's got plenty of stories that start with VMA"}, "movies": [], "publish_date": null, "source": "http://www.mtv.com", "summary": ""}