{"url": "closeronline.co.uk/celebrity/news/celebrity-conspiracy-theories-kate-middleton-urrogate-pregnancy-marilyn-monroe-o/", "text": "From Beyonce's fake baby bump to Marilyn Monroe's murder, we've taken a look back over the most enduring celebrity conspiracy theories of all time. Read on for more...\n\nKate Middleton did NOT give birth to a baby girl\n\nYeah, you read that right; some people out there have convinced themselves that the Duchess of Cambridge gave birth to Princess Charlotte via a surrogate mother.\n\nWhy? Well, for no real reason other than the fact that she looked so good when she appeared outside the Lindo Wing of London's St Mary's Hospital with Princess Charlotte on 2nd May 2015.\n\nOne conspiracy theorist, who was quoted in a Russian newspaper, said: “It was a surrogate mother who gave birth but not her. Kate must have been wearing a fake belly showing to the people that she was pregnant. Another added to the Komsomolskaya Pravda: “She did not give birth, I am sure. There is no special maternal look in her eyes - this natural thing is not visible.”\n\nThis theory is, quite obviously, nonsense; the Duchess of Cambridge was just lucky enough to have a team of stylists on hand after Princess Charlotte’s arrival – hence the amazing hair, makeup, and coordinating mother-and-baby ensemble.\n\nAnd the thing about the eyes? Utterly bizarre; all you need to do is look at Kate to see just how much she loves her little girl.\n\nBeyonce is actually Solange's mum\n\nApparently Beyoncé wasn’t actually born in 1981; yup, someone who claims to work for the Department of Health in Texas supposedly unearthed her birth certificate and claims it has her birth date as 1974.\n\nGabrielle Union, who was born in 1972, also famously said that she and Queen B were BFFs when they were teenagers - again suggesting that she's a tad older than she says she is.\n\nCue people claiming that Beyonce got pregnant at around 12 or 13-years-old, had a baby girl, and her family covered it up by pretending Solange was actually Matthew and Tina's daughter.\n\nCOULD IT BE?!?!\n\nProbably not; it sounds too much like an EastEnders storyline to us. Also, y'know, there are pictures and videos of them together as children. Children who are THE SAME AGE.\n\nNicolas Cage is a vampire\n\nThere's a photo of a man from the Civil War circulating the interweb, and, yes, it looks a lot like Nicolas Cage.\n\nThis has led people to claim that (it pains us to write this) the actor is, in fact, a vampire - and he reinvents himself every 75 years or so. facepalm\n\nBrittany Murphy was murdered by the government\n\nBrittany Murphy died on 20th December 2009 at the age of 32 after suffering a reported cardiac arrest. At the time of her death, the Los Angeles coroner said he believed the cause of death \"appears to be natural\", later stating that it was an accident spurred by medications she was taking to combat pneumonia and an iron deficiency.\n\nBut, when her husband, Simon Monjack, died five months later, in similar circumstances to Brittany, her father grew suspicious. Angelo Betolotti obtained hair, blood and tissue samples for independent testing - and they have reportedly revealed the presence of ten separate heavy metals in Brittany's system.\n\nAt the time of her death, Brittany reportedly displayed all the symptoms of heavy metal poisoning, including headaches, dizziness, abdominal cramps, coughing, sweating, disorientation, wheezing, congestion and pneumonia.\n\nIn a recent interview with Fleur De Lis Film Studios, Brittany's father claimed that his daughter was under surveillance after speaking out in support of Julia Davis, a government whistleblower: \"They were, in fact, under surveillance, including helicopters. Their telephones were wiretapped.\n\n“Vicious rumours, spread by tabloids, unfairly smeared Brittany’s reputation. My daughter was neither anorexic nor a drug junkie, as they repeatedly implied. \"Brittany and Simon were ridiculed […] when they complained of being under surveillance and in fear for their lives. I will not rest until the truth about these tragic events is told. There will be justice for Brittany.”\n\nDo you think there is more to her death than meets the eye?\n\nTom Cruise hired Katie Holmes to be his wife\n\nAs far-fetched as it sounds, plenty of people out there believe that Tom Cruise approached several young Hollywood stars (including Scarlett Johansson) with an offer of a five-year marriage contract.\n\nIn exchange for marrying Cruise, the bride would receive a career boost and cash, plus a bonus if she gave birth to a child. For Tom, the marriage would provide him with a child, rehabilitate his increasingly eccentric public image, and finally quash all of those pesky gay rumors.\n\nHowever sources close to the couple (whom are now divorced) have poured water on the rumours, insisting Cruise was \"completely in love with Katie\".\n\nPlus there's the fact that Katie demanded sole custody of daughter Suri in her divorce filing; surely any pre-existing contract between her and Cruise would have prevented her from doing any such thing?\n\nJames Hewitt is Prince Harry's real dad\n\nHmm. Basically, James Hewitt claimed he had an affair with Princess Diana from 1986 - 1991, and, as he looks a lot like Harry, a lot of people have said he MUST be the prince's real dad.\n\nHarry, being the jokester he is, has never taken the reports seriously - and has even cracked a joke about it. During a visit to Bacon’s College in South East London with William and Kate in July 2012, a young boy shouted across the football field to Wills: “Are you two brothers?”\n\nQuick-witted Harry instantly replied: “We’re not sure.” Oh Hazzer, we love you so.\n\nMarilyn Monroe was murdered\n\nMarilyn Monroe's death remains a mystery, even today, although there is a LOT of evidence to suggest that she was murdered. And we don't say things like that lightly...\n\nWhile empty pill bottles were found in her room, the room contained no means to wash the pills down (there was no glass and the water was turned off). T\n\nhe pathologist, Dr. Thomas Noguchi, could find no trace of capsules, powder or the typical discolouration caused by Nembutal in Monroe's stomach or intestines, indicating that the drugs that killed her had not been swallowed. T\n\nhe time of death and witness statements do not match up, phone records have suspiciously gone missing and police claim that Marilyn's housekeeper had changed the sheets - was even washing sheets - when they arrived.\n\nBut if it wasn't suicide, who killed her?\n\nIn October 2006, under the Freedom of Information Act, the FBI released thousands of classified documents, including a three-page report about Marilyn Monroe.\n\nIt detailed Marilyn's affairs with John F. Kennedy, claiming that he had promised to divorce his wife and marry her. But, when Marilyn found out he had no intention of doing so, she threatened to go public with their affair. W\n\nhen you add the contents of this file to the MANY discrepancies in the evidence surrounding Marilyn's death, you can see why so many conspiracy theorists are adamant that Marilyn was murdered.\n\nKhloe Kardashian's dad is OJ Simpson\n\nKhloe Kardashian's stepmother famously claimed that the reality star is not Robert Kardashian's biological daughter.\n\nAnd, in 2013, OJ Simpson's manager has added fuel to the flames, stating that Khloe \"could be OJ's kid\".\n\n\"It's all going to come out sooner or later,\" Norman Pardo told In Touch Weekly in a new interview about her paternity.\n\nOJ, who’s currently serving a 9-to 33-year sentence in a Nevada prison for kidnapping and armed robbery, hasn't denied that Khloé could be his daughter. “Whenever I bring it up, he giggles.”\n\nKris and O.J. were close friends before Robert, an attorney, successfully defended the NFL star against charges he’d murdered his wife, Nicole Brown Simpson, who was also one of Kris’ dearest friends.\n\n“They all took their vacations together. There was a lot of partying going on back then.\"\n\nWe doubt Khloe will be too perturbed by the claims.\n\nIn fact, she resisted having a DNA test last year, telling Kris Jenner in her typically blunt and hilarious manner: “My dad is Robert Kardashian. My other dad is Bruce Jenner. \"If you f**ked other people during the same time, and you do not know, go on Maury. Like, I don’t care!”\n\nPippa Middleton wore a fake bum to the royal wedding\n\nIt's not so much a hit below the belt as it is a hit below the skirt, is it?\n\nYup, Mr Bern, a Knight of the Order of Grimaldi in Monaco and an expert on etiquette, claimed last year that the bum which enchanted the world was, in fact, a false.\n\nHe said: “But of course she had a false bottom. I repeat it,she had a false bottom. “You take her away from that and she has normal buttocks. It was an optical illusion.\n\n“She knew there were a billion people watching. It was the moment to show it.”\n\nSounds a pretty bum theory to us - Pippa's shapely derriere couldn't possibly have been faked!\n\nMichael Jackson was chemically castrated\n\nMichael Jackson had a truly amazing voice - but some have claimed that his ability to reach those high notes was all down to chemical castration.\n\nAlain Branchereau, a professor of vascular surgery, insisted that MJ used the synthetic anti-male hormone drug Cyproterone as a cure for his acne.\n\nHe said: \"When he was 12, Michael Jackson had acne. We know this, he spoke about it himself as a tragedy.\n\n\"What I think could have happened is that his people suggested this miracle treatment.\"\n\nHe explained that the drug \"blocks puberty, the voice can't mature,\" stops bodily hair and the larynx from growing, and affects the bones, leaving the body with a slight frame and a large chest. When the treatment is finished, the patient \"keeps a child's larynx all his life in a man's body.\"\n\nWe will never have proof as to whether or not this is true, but the rumour makes us feel desperately sad.\n\nPaul McCartney died in a car crash- and was replaced by a lookalike\n\nYeah, you heard us.\n\nA lot of obsessive Beatles fans are CONVINCED that Sir Paul is an impostor and that the real deal was decapitated and burnt to a crisp in a car crash.\n\nHmm.\n\nBecause of all the buckets of money the Beatles contributed to England's tax coffers, their continued success was vital to the financial health of the nation. So the British government, in cahoots with the surviving members of the Beatles, conspired to cover-up Paul's death.\n\nApparently the evidence we need to believe this theory can be found on the cover of the Beatles' last album, Abbey Road.\n\nWhich was, apparently, a way for the other Beatles to confess and alleviate their guilt over the whole body swap thing. The image shows the fab four crossing the road, with Lennon in white (the preacher), Starr in black (the undertaker), \"McCartney\" in a suit and barefoot (the corpse) and Harrison in blue jeans and work shirt (the grave digger).\n\nPaul is out of step with the other boys, suggesting he's not an original bug. Sir Paul, in an interview with Life, has since explained that \"On Abbey Road we were wearing our ordinary clothes. I was walking barefoot because it was a hot day. The Volkswagen just happened to be parked there.\"\n\nBut the theorists refuse to believe him. Well, they wouldn't, would they? NOBODY BELIEVES FAKE PAUL!\n\nBeyonce faked her pregnancy\n\nForget the Solange theory; remember how everyone decided that Beyonce faked her pregnancy? Yeah.\n\nIt was all based on a moment when Queen Bee sat down for an interview with Molly Meldrum in Australia and her pregnant belly appeared to… well, deflate.\n\nIn a strange way.\n\nAnd she was spotted pulling an \"oops\" face just after it happened, if you believe the extremely slowed-down versions of the moment on YouTube.\n\nWhatever.\n\nWe label this one SERIOUSLY far-fetched, but, to all the disbelievers out there, it's safe to say that Bey is a pretty awesome mum to Blue Ivy. Surrogate or not.\n\nMiley Cyrus died in 2010 and was replaced by a lookalike\n\nYup, just like Paul McCartney. Duh!\n\nApparently Miley's body was found in the desert way back in 2010 and was replaced by another Disney star, who got plastic surgery to look like her.\n\nYou can check out all of the (very flimsy and ludicrous) 'evidence' for the far-fetched theory here\n\nWhat do you think?\n\nElvis Presley faked his own death\n\nElvis may have left the building, but plenty of people are still debating over which route he took.\n\nYup, there's a persistent belief that \"the King\" did NOT die in 1977, he simply faked his own death.\n\nSigh.\n\nElvis was, according to theorists, a prisoner of his own fame. He couldn't go anywhere without being recognised and was forced to experiment with wigs and glasses in a bid to go about his everyday life undetected.\n\nBut things got… well, they got too much. He decided to fake his death, say goodbye to Elvis Presley and live out his last years in peace and solitude.\n\nApparently Elvis, much like Shakespeare's Romeo, knew which drugs he could self-administer to create a deathlike state. His extensive experience with the martial arts and yoga was such that he could slow his heart rate and breathing in order to feign death.\n\nAnd he was no stranger to using a fake name; government documents report that Elvis used the name John Burrows as an alias when he wanted to travel incognito.\n\nThrow in hundreds of rumoured sightings, a seriously speedy funeral (it happened ONE DAY after the King checked out), a mysterious black helicopter floating around Graceland, an elderly man named Jesse who was snapped hanging out with Lisa Marie's son (his grandson) and a rumoured wax body double in the open casket and you have a recipe for a good ol' fashioned conspiracy theory. A\n\nlthough we have a feeling a lot of people were so desperate to believe this theory that they couldn't help but find \"evidence\" to support it.\n\nWhatever. Long live the King, we guess!\n\nKeanu Reeves is immortal\n\nIf you want to see the proof for this theory, it's here - but we can summarise it for you.\n\nBasically, Keanu Reeves looks young. His face has barely a wrinkle upon it since he burst onto our screens way back when - and, after someone found a portrait of Charlemagne, little minds started working in overtime.\n\nThey write: \"Aside from the striking resemblance, the account of the death of Charlemagne rise suspicion.\n\n\"First of all he crowned his son just before dying (just like he knew he was going to 'die') secondly his burial was rushed during cold weather this is a clear hint that they needed to bury a body to not rise any suspicion.\"\n\nThey then go on to find a number of people throughout history who look an awful lot like Keanu Reeves (in the sense that they are also humans with dark hair and eyes), and insist this is proof the actor has 'everlasting life'. This is why, they say, he is so generous in his charitable donations; he has plenty of money leftover from his long old life.\n\nWe dispute this theory, naturally; anyone else think Keanu just uses a really good moisturiser?\n\nKurt Cobain was murdered\n\nThe Nirvana singer was found dead at his home in Seattle on April 8, 1994.\n\nIt seemed an open and shut case; the singer - who had disappeared from a drug rehabilitation clinic - had, according to his wife, Courtney Love, been suicidal and a suicide note was found.\n\nThe initial police report stated that Cobain had been found with a shotgun across his chest and an autopsy ruled that he had died by a single gunshot wound to the head and that he had taken a large amount of heroin.\n\nHowever, Tom Grant, a private investigator hired by Love to find Cobain after he disappeared from the clinic, believed that the singer was murdered.\n\nHe claimed that the amount of heroin in Cobain's bloodstream would have made it impossible for him to have put a gun to his head and pulled the trigger. Grant insists an unknown assassin administered the drug and then shot Cobain.\n\nBut what about that suicide note?\n\nWell, Grant believed that the supposed \"suicide\" note was actually a letter announcing Kurt's plans to leave Courtney Love and the music business and that references to suicide had been added later.\n\nBut who would have wanted Kurt dead? We just don't buy this one.\n\nJohn Lennon was killed by the US government\n\nThe former Beatle was shot dead outside the Dakota building in New York where he lived by Mark David Chapman on December 8, 1980. Chapman was jailed for murder and is still in prison.\n\nCase closed, right? Wrong.\n\nObviously.\n\nConspiracy theories, unable to let it go, have claimed that Chapman was programmed by US government agents to kill Lennon - and that they used the novel Catcher in the Rye as a signal to go ahead with the operation.\n\nBut why on earth would the government want to kill John Lennon? It just doesn't make any sense.\n\nBruce Lee kicked his way out of his coffin\n\nMartial arts legend Bruce Lee was pronounced dead at the tender age of 32, due to swelling of the brain.\n\nBut, being so young and healthy, people immediately became sceptical.\n\nAnd, after Bruce's coffin lid had to be replaced, many assumed he'd kicked it off and escaped to live a better life.\n\nWhere?\n\nIn Brussels.\n\nHey, don't blame us - we don't come up with these ideas!\n\nNorth West is the antichrist\n\nKim Kardashian and Kanye West welcomed their first child into the world on June 15, 2013 - quite a bit earlier than her original due date.\n\nThis could have been down to Kim's pre-eclampsia, but that, for many people, was too logical a suggestion. Instead, they've decided it's because North West is the antichrist.\n\nYup, you read that right; the antichrist.\n\nIt has been suggested that Kim Kardashian and Kanye West were desperate to have their child on 15th June, 2013.\n\nThat’s 15/6/2013 in numeric form.\n\nCheck it out: (1+5)=6, 6, 2+0+1+3=6Ergo, 6/15/2013 = 666 - the number of the devil.\n\nSIGH - someone spent a lot of time trying to make those numbers work.\n\nPoor little Nori, eh?\n\nTupac is alive and well and living in Cuba\n\nTupac tragically died on 13th September 1996, after being shot as he rode in a car driven by Death Row Records chairman \"Suge\" Knight near the Las Vegas strip in September 1996. But plenty of his fans refuse to believe it.\n\nWhy? Well, there's the fact he was cremated the day after his death - there's no body for fans to dig up and examine as 'proof.\n\nThe rest of their 'evidence' is pretty shady.\n\nApparently Tupac staged his own death and fled to Cuba to live out his years in peace with his godmother Assata Shakur.\n\nFollowing an Eminem reference to Pac’s Cuban refuge and the addition of Pac’s godmother to the F.B.I.’s most wanted list, threads began to pop up on forums alluding that he would return from Cuba in 2014.\n\nPlus there's the hologram performance, which some conspiracy theorists have decided was actually the real Tupac.\n\nAnd there's all those 'sightings' of Tupac around the world, lurking in the backgrounds of photographs and videos.\n\nHmm. We're not convinced - are you?\n\nBuddy Holly escaped the Bermuda Triangle\n\nBuddy Holly is a bit of a mystery, mainly because his death is connected to the ultra-mysterious Bermuda Triangle.\n\nYup, we swear it; the singer’s plane disappeared somewhere over that eerie stretch of water - and now plenty of YouTubers have claimed he's alive and well and living in Ganamede.\n\nHmm. As long as his music continues to be played, he can live on wherever, surely?\n\nJohn F. Kennedy was assassinated by the CIA\n\nEveryone has a theory on who killed JFK but, for most, the idea that the CIA was behind the assassination of the president is just too… well, too hard to disprove.\n\nFirst, the facts: On 22nd November 1963, President Kennedy was riding in a motorcade in Dallas, Texas, when he was shot and killed.\n\nRoughly one hour later, Lee Harvey Oswald was arrested for Kennedy's murder; however, Oswald was not in custody long before he was shot and killed by Jack Ruby.\n\nNext, the conspiracy theory: Most theorists do not believe Oswald was responsible for Kennedy's murder, while those that do believe he had help - after all, he was firing an ancient rifle from VERY far away.\n\nAnd hitting a small moving target from such a distance, in wind, would be difficult.\n\nFootage of the event taken by Abraham Zapruder supported the growing belief that at least four shots were fired - not the three that the Warren Commission claimed. The moments of impact recorded on the film also suggested that at least one of the shots came from a completely different direction to those supposedly fired by Oswald - evidence backed up by testimony of several eye witnesses.\n\nMany believed that several shots were fired by gunmen hiding behind a picket fence on a grassy knoll overlooking the plaza.\n\nThere is an enduring theory that the CIA, furious over rumours that JFK was about to \"splinter the CIA into a thousand peaces\", staged the assassination.\n\nAnd, whether the shots were fired by the \"three tramps\" spotted at the scene of the crime, the agent who fired wildly in JFK's direction from the car behind or a lone sniper on the grassy knoll, it goes without saying that this is a theory that won't be going away any time soon.\n\nTom Cruise, Katie Holmes, Suri & Scientology\n\nSpeaking in her explosive new exposé “Troublemaker: Surviving Hollywood and Scientology”, Leah Remini has claimed that Tom Cruise and Katie Holmes left their daughter Suri (at the time 7 months old) to cry on a bathroom floor at their wedding.\n\nAfter five minutes of listening to Suri’s cries, Leah claims she went to check on the baby and found Cruise’s sister, his assistant and another woman staring at her as though she was ‘L Ron Hubbard incarnate’, a rebirth of the religion’s founder.\n\nThe actress claims that she finally convinced the women in the bathroom to pick up the crying baby and give her a bottle of warm milk.\n\nThe Church of Scientology, which released a response to Remini on its website, stated of her claims about the wedding: \"Every claim Ms. Remini has made is not only untrue, but ridiculous and stupid. She is just trying to latch onto a prominent celebrity for her own publicity.", "images": ["http://closeronline.co.uk/static/assets/pinterest.svg", "http://closeronline.co.uk/static/assets/facebook.svg", "http://closeronline.co.uk/static/assets/twitter.svg", "https://cdn.onebauer.media/one/lifestyle-images/celebrity/569e4bbb375e84fc0cc675c2/Screen Shot 2016-04-07 at 09.59.38.png?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill"], "top_img": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/569e4bbb375e84fc0cc675c2/Screen Shot 2016-04-07 at 09.59.38.png?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "keywords": [], "authors": ["Kayleigh Dray"], "canonical_link": "https://closeronline.co.uk/celebrity/news/celebrity-conspiracy-theories-kate-middleton-urrogate-pregnancy-marilyn-monroe-o/", "title": "Celebrity conspiracy theories: Kate Middleton's 'surrogate pregnancy' to Marilyn Monroe's overdose", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "og": {"site_name": "Closer", "type": "website", "url": "https://closeronline.co.uk/celebrity/news/celebrity-conspiracy-theories-kate-middleton-urrogate-pregnancy-marilyn-monroe-o/", "description": "From murders and lookalikes, to fake baby bumps and chemical castrations, which of these celebrity conspiracy theories do you believe?", "title": "Celebrity conspiracy theories: Kate Middleton's 'surrogate pregnancy' to Marilyn Monroe's overdose", "locale": "en_GB", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/569e4bbb375e84fc0cc675c2/Screen Shot 2016-04-07 at 09.59.38.png?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "width": 960, "height": 540, "type": "image/jpeg"}}, "twitter": {"title": "Celebrity conspiracy theories: Kate Middleton's 'surrogate pregnancy' to Marilyn Monroe's overdose", "description": "From murders and lookalikes, to fake baby bumps and chemical castrations, which of these celebrity conspiracy theories do you believe?", "card": "summary_large_image", "site": "@CloserOnline", "creator": "@CloserOnline", "image": {"identifier": "https://cdn.onebauer.media/one/lifestyle-images/celebrity/569e4bbb375e84fc0cc675c2/Screen Shot 2016-04-07 at 09.59.38.png?format=jpg&quality=80&width=960&height=540&ratio=16-9&resize=aspectfill", "alt": "Celebrity conspiracy theories"}}, "description": "From murders and lookalikes, to fake baby bumps and chemical castrations, which of these celebrity conspiracy theories do you believe?", "next-head-count": 38}, "movies": [], "publish_date": null, "source": "http://closeronline.co.uk", "summary": ""}