{"url": "www.thecut.com/2018/05/sarah-jessica-parker-on-sex-and-the-city.html", "text": "This article originally appeared in the May 12, 2008 issue of New York Magazine. We’re republishing it here in celebration of Sex and the City’s twentieth anniversary next week.\n\nWe’re on the corner of West 10th and Hudson Streets when the young woman appears.\n\n“Excuse me,” she says. “I’m your biggest fan.”\n\nThe girl is stylish, faintly mod, with enormous fringed pinwheels for eyes. She’s speaking very quickly in a British accent and rifling through her handbag for something I can’t quite see.\n\n“I love your eyelashes,” says Sarah Jessica Parker.\n\n“Thank you!” says Pinwheels, digging deeper. “I have a denim brand. It’s British. And I would absolutely die if I could give you a pair.”\n\n“Well, you don’t have to,” says Parker. “You just tell me the name, I’ll find them, you don’t have to give me anything —” But her fan has indeed produced from her handbag an entire pair of designer jeans, crosshatched on the rear pockets. She is literally pressing them into Parker’s hand, which is trying to press them back. “Oh, my,” says Parker in astonishment. “You just, you just happen to have them in your bag?”\n\n“I was meant to see you. What size are you?”\n\nParker tries hard to say no, as politely as possible. “I don’t like to take anything from a new designer, because you need to sell them,” she explains — “They’re at Intermix!” interjects the British designer — “Oh, good, I can go there, I can find them on my own. Don’t give them away. Give them to people that need them. Don’t give them away to me.”\n\n“I love you and would absolutely die if —”\n\n“I will. I’m happy to purchase them! And much good luck to you.”\n\n“Thank you. Bye.”\n\n“You’re welcome. Nice to meet you. Bye,” Parker says and turns toward me with an arched eyebrow. “All types! Wonderful types here in the city.”\n\nWe begin to cross the intersection toward Gourmet Garage, where Parker is planning to pick up some pork chops for dinner. She shops there all the time, she tells me. She worries about her son being such a picky eater, since she and Matthew Broderick love good food: They used to have a regular post-theater Sunday dinner date across the street, at a French restaurant that burned down a few years back. But suddenly, the designer has returned. And this time she won’t take no for an answer. She forces the jeans into Parker’s hand and begs: “It would make my whole entire world.”\n\n“Well, all right,” says Parker finally, giving in, the jeans dangling from her hands like a fish from a hook. “Thank you very much. Don’t get hit —” Because Sarah Jessica Parker’s biggest fan is already running away from us, back into the traffic streaming down Seventh, her hair flying behind her, yelling out a final passionate “I love you!”\n\nCynthia Nixon, Sarah Jessica Parker, Kim Cattrall, and Kristin Davis on the set of Sex and the City: The Movie, October 2007. Photo: James Devaney/WireImage\n\nIt is a famous fact about Sarah Jessica Parker that she is a good girl. She objects to things that are “vulgar.” She uses phrases like “a bee in my bonnet.” She is reflexively prim and has been that way since her teen years —“although prim is not a good word; modest,” clarifies Cynthia Nixon, her co-star on Sex and the City, who got to know Parker when the two were 13, filming a movie of the week in Nashville, back when rolling down a hill outside their hotel seemed like the best fun in the world. (In Nixon’s memory, the actress was a conservative dresser but a master accessorizer: “She would take a different ribbon every day and braid it into her hair.”)\n\nBut Parker, now 43, is also a person who knows how to steer her own ship. We meet just after a photo shoot she’s doing in the East Village, in a studio that used to be a gay bathhouse. Parker runs downstairs, having changed from her stilettos into silver flats, and she is so hostesslike, so obliging, it’s almost indecent — full of compliments, her head tilted, touching me on the knee, offering me a drink, literally running off theatrically when she has to go pee. It’s a type of friendliness that might seem over-the-top if it weren’t so disarming. She’s tiny, with enormous blue eyes. She looks her age, but then, so do I.\n\nThe last time we’d met, four years ago, it was in a trailer outside Silvercup Studios, where Parker was worrying out loud about Sex and the City’s final episode, parsing the future of Carrie Bradshaw as if she were a real person — could she please her single-girl fans and be happy “on her own terms”? That question seemed to apply to Parker as well. The show she was ending (and it had been her choice, both as star and as executive producer) had transformed her at 35 from a quietly famous person into the sort of celebrity who is as much brand as actress, a fashion magnet who tugs strangers down the street, convinced that Parker will make their entire world.\n\nAnd truth be told, even as they were filming those last scenes in Paris, Parker and her collaborator, writer-director Michael Patrick King, were kicking around a movie concept. King’s original pitch sounds like a palate cleanser intended to follow the hype surrounding the series finale — it was a light, summery, Bob Hope–style road movie, with the girls following separate paths. “Then the deals weren’t happening,” King tells me. “And the money people didn’t believe in it.”\n\nParker’s co-star Kim Cattrall reportedly scuttled the project, wanting more money and creative control. “If I had thought it was any of my business at the time,” Parker tells me carefully, “what I would have said is, ‘Isn’t it okay for Kim to think that the money wasn’t right?’” (She also drily notes, “Perhaps she was some kind of emotional psychic, because this why we made a better movie.”)\n\nCattrall herself sounds somewhat humbled when I speak to her, less the sassy promoter of sex manuals and more the actress who recently turned 50. “Having this fantastic character that I love and enjoy playing, it has a dark side,” she says as cabs honk in the background. “Not just because people don’t think of you for anything else. But people get out of touch with you as a person — and you can get out of touch with you as well.” The show’s final season was a painful one: She’d lost her job, her marriage was falling apart, and her father was diagnosed with dementia. Though she’s clearly still rankled by aspects of the series’ aftermath (“Oh God, you’re going to make me cry,” she says when I complain how little Sam shows up in the edited reruns), she sounds guardedly thrilled, if there is such a thing, to be back to “this phenomenon.”\n\nIn any case, by 2006, when Parker revived the film, Cattrall cut a deal. In the interim, Parker had made her own gestures toward breaking away from her iconic character, releasing a few critical misfires like The Family Stone and Failure to Launch (though the latter was a hit). But she’d also begun to pursue a parallel career, monetizing her Carrie-based status as a fashion icon with ads for the Gap (from which she was peremptorily dumped for Joss Stone) and producing the fragrances Lovely and Covet and the inexpensive clothes line Bitten. Meanwhile, in the ensuing years, the Sex and the City phenomenon had only grown, with those bubble-gum-pink DVD sets bringing in both international viewers and the “cocoa time” women (in King’s phrase) who found the bowdlerized reruns comfort fare. This time, the money people could believe.\n\nAnd Parker had an intuition that time was running out: “It had this shelf life.” The resulting film, which opens May 30, is no summery lark. Instead, it has a surprisingly serious tone, exploring questions of forgiveness in long-term relationships. (Reader, I cried.) The trademark elements are all there — rat-a-tat dialogue, sex scenes, and unsettlingly orgasmic excitement upon access to designer goods — but the mood is bittersweet. When the story begins, Carrie and Big have been together for ten years, and the melodrama of their off-and-on dynamic has faded. “She would probably long for that earlier type of heartbreak versus what she experiences this time around,” Parker says, dishing cryptic tidbits that are sure to be ruined when the movie gets spoiled online. “The disappointment and the loss is so painful because they’re grown-ups now, and it just changes, as we all know.”\n\nOf course, for any longtime fan of the series — and I am one — the movie also has a significant level of terror attached to it. The series consisted of arch, neatly structured half-hours. If it didn’t succeed, a two-hour film could feel more like Godzilla in heels, stomping cluelessly back into the meatpacking district. My boss summarized his response to the trailer as: “This is the worst idea ever” and “God, I can’t wait to see this.” And there is the question of whether these characters can age without seeming ridiculous, whether the film’s Manhattan will seem dated in this recessionary age, whether it’s all so very 2004.\n\nMichael Patrick King has an answer for that question. “If you want to see them at 38, doing a variety of come jokes, it’s available on DVD.”\n\nFrom left: Parker and Brooke Shields at Sardi’s, 1979; Parker circa 1983; Matthew Broderick and Parker circa 1993. Photo: Getty Images\n\n“I don’t know if you do this with your husband,” Parker says. “But say one of us is walking down the street, I’ll call him and say, ‘You know, the laundromat is closed!’ And he’ll say, ‘What?’ I’ll be like, ‘The laundromat at 11th and West 4th Street is closed!’ ”\n\nParker and Broderick keep a running count of these changes, a mutual mourning for the transformation of their neighborhood into a luxe, tree-lined shopping mall. She knows this sounds absurd coming from her, that people blame Sex and the City for the ruination of the West Village; even Broderick says, “That’s your fault!” when he sees a thong poking up from low-slung jeans, and her close friend John Benjamin Hickey, an actor, longs for the days before “those girls on buses.” Parker clarifies that she doesn’t want to sound like Madonna bemoaning what’s happened to New York: It’s not that there’s no “creative energy” in the air, it’s simply been priced out of this particular borough.\n\nStill, she says, her New York, like that of many New Yorkers, is one that is no longer quite there. “You know, when I arrived in the city in 1976, New York was financially a wreck,” she remembers. “But to me it’s the New York that Matthew and I literally try to find every day of our lives. It was the best place in the world. It was literature. It promised everything. And for someone who loved food and smells and stimulation, who was rocked to sleep by the sound of taxis — well, there’s just so much money now, and the city is so affluent, and all the colors, all the shops, the look of a street from block to block is just terribly absent of distinguishing coffee shops, bodegas. All of that stuff that made it possible to live in New York is gone.” Even Brooklyn is “very chic” now, she adds. “I guess there are places in Queens that are affordable.”\n\nShe recommends that I watch Jill Clayburgh in An Unmarried Woman, which she calls an earlier version of Sex and the City, set in a far rawer seventies Manhattan. (It is: Netflix it; I recommend it.) She also brings up an 1891 novel called New Grub Street, by George Gissing. “There’s this protagonist, this leading character who is really battling art versus commerce,” she explains, sipping on a dark-green health drink. “All of his friends are having enormous success serializing their books, and he’s really reluctant to be that person, but he knows in order to survive — literally in order to survive, because those times were so freaking bleak — that he’s, like, this crucible. And, I believe, there was a girl in his life who wants the finer things, and there is the great story.”\n\nBroderick recommended the book to her. The two share an interest in Victorian literature; their 5-year-old son, James Wilkie, is named after Matthew’s father and Wilkie Collins, author of The Moonstone, one of the couple’s favorite books. And in fact, Broderick’s influence on Parker rises into almost every conversation we have. Parker is clearly fascinated by her husband: his values, his style, his mind. In her portrait, he’s at once an old fogey and a computer geek, a pessimist and a guide to life — the very opposite of a bullshit artist, a kind of lie detector in a world of fluff. As a parent, she’s the more traditional of the two, she says, the one who is (like her mother was) concerned with etiquette, the “primary caretaker.” Yet Matthew “has this soft, porous part of him that is more transparent to me since we’ve had a son. I think it’s just who he has become.”\n\nShe can be hilariously unguarded about saying things that, when taken out of context, might seem absurdly suggestive. For instance, when I talk about my husband, who like Broderick is a science geek and a gadget-hound, she suggests that we should set them up as friends. “Matthew doesn’t have enough friends,” she tells me, sounding very mother-hennish and adding that Matthew has mostly gay friends in New York. Because this is such a crazy thing to say to a reporter — surely she knows that the higher her star has risen, the more the gossips insist her marriage must be a fake — I decide that this means that Matthew is definitely not gay.\n\n“He’s very bright,” she tells me. “He’s very dry, and he’s a contrarian, because he enjoys it. And he’s not soft, and he basically turns out to be a very good judge of character, and it just wasn’t his nature prior to having a child to be — he’s kind of immune to anything that even stank of being treacly or insipid.” Broderick’s mother, a writer and painter who died in 2003, was the same way, she adds. “It really was anathema. They just had an allergy to it.”\n\nThe couple have led oddly parallel lives. As teens, they played iconic whiz kids: Ferris Bueller and Square Pegs’ Patty Green. Both are half-Jewish, from theater families with actor dads. But whereas Broderick is a native New Yorker, a graduate of Walden raised in the Village in an intellectual, slightly intimidating clan, Parker arrived in an overcrowded red VW van from Cincinnati — a poor kid with seven siblings who hovered on the border between theater gypsy and welfare case. Her family camped out on Roosevelt Island for a time: “It was meant to be a Utopia,” she says. (“It was slightly like a penal colony,” recalls her brother Pippin, a playwright and director.) But it was Woody Allen’s “rarefied and special” Manhattan Parker was seeking, a fantasy she had picked up from a mother who kept up her subscriptions to New York periodicals even when they were living in the Midwest.\n\nThough they were both on Broadway in the early eighties — Broderick in Neil Simon’s memoir trilogy and Parker in Annie (where the 15-year-old rose from ensemble to star) — they never met. “Which I’m happy about,” Parker says. “He was in a stage of his life where he was dating the obvious girl, like he should have been, like it’s a developmental stage.” (Later, she adds, she “dabbled in my own textbook scenarios” — by which I imagine she must mean Robert Downey, Jr., with whom she lived for seven years, moving in when she was 19.)\n\nThat Sarah Jessica was, despite her newcomer status, a very New York type: the ethnic girl nerd with crazy hair, a schnoz, big eighties glasses.\n\nShe regarded herself as “an outsider,” recalls Pip. “Not popular, she didn’t perceive herself as in the most popular clique. And she was working a lot.” On Square Pegs, she struck many viewers as a potential role model — a cuddlier variant of Barbra Streisand, a smart chick who was appealing in a way that it was hard to imagine as a mainstream taste. The fate of Square Pegs seemed to prove it: The show was canceled after one season.\n\nBut even then she had the future in mind. “She’ll tell you she’s shy, but she also has a very clear image of what she wants,” notes her brother Timothy Britten Parker, an actor. “I think once she moved to New York, Sarah realized what was available to her in her life: the possibilities. She saw that she could break out of — we certainly didn’t have a lot when we moved to New York! It enabled her to meet people from all over the world, in all different professions. It propelled her.”\n\nSo I go home and read New Grub Street. I can see why Parker recommended it: It’s a nasty little fable about a culture in which art is so reflexively commodified that it kills artists, a lament for the fact that in a market-based economy, fear of poverty turns everyone into a deal-maker. “Art must be practiced as a trade, at all events in one’s time,” states the girl who wants finer things, Amy, to the tortured one-hit novelist she married, who can’t bring himself to write another book because he can’t compromise. “This is the age of trade. Of course if one refuses to be of one’s time, and yet hasn’t the means to live independently, what can result but breakdown and wretchedness?”\n\nI feel very ashamed,” says Parker. “I feel like I’m the town trollop. And I feel cheapened, like I’m cheapening the school, like I’m bringing dirt, like I’m bad for the neighborhood.\n\nIt reminded me of my first reaction to Sex and the City, which I hated on sight: Those women seemed so brittle and scary, batting their eyelashes at the finance hounds I thought were such bores. That was before I watched a few more episodes, perhaps three. And suddenly I was hooked, enthralled! With each season, I loved the show more; the scariness I’d sensed, the anxiety and the anger, was still there, but so was a sweet fantasy of female friendship. The characters were archetypes and real people at once, a neat trick. As a single woman in my thirties, I was grateful for it all: Wouldn’t you rather have your family fear for your life as a glamour-grotesque than pity it as a Cathy cartoon?\n\nThe series’ glossy surfaces were deeply romantic about New York, but its staying power was its ability to tolerate ambiguity; Carrie, Miranda, Charlotte, and Samantha got knocked down as often as they triumphed. (King describes this as the cream-pie factor: “The minute Miranda said, ‘Blah blah blah, I’m so smart’ — cream pie.”) And despite the gobbling consumerism of its characters, the show had unsettling insights into women and money: the way bodies function as currency, the degree to which a woman alone can be truly autonomous or free, the marriage hunt as negotiation disguised as romance. The value of a single woman, in other words: something that degrades or stays steady.\n\nBut if the original Carrie, avatar of Observer writer Candace Bushnell, was a cold-eyed urban anthropologist, a modern sister to New Grub Street’s bitchy observer Jasper Milvain, Parker transformed her. She made Carrie both likable and maddening, funny in a screwball way. She was also more than a little flaky, a bit self-centered, but in a way that surely rings true for many women in New York. Her friends owned; she rented. Her credit cards ran out, and she was astonished to find that a man she slept with left $100 bills on her bedside. She had the self-image of a freewheeling bohemian, but she lived like a wealthy woman, gliding along on fashionable freebies, rent control, and a not-always-appealing faith in soul mates. It was precisely the kind of thing that in a different kind of narrative might be a tragedy.\n\nThree days later, Parker and I meet to take a walk through her neighborhood. As we turn onto West 12th Street, she bends down and plucks a washer off the sidewalk. “I find so many things in the streets, and my husband makes fun of me because there’s almost not one walk I’ve taken in New York City where I haven’t found a coin. Something of value. Once I found a big metal N.”\n\nIt’s one of those damp days when Manhattan seems to flip straight from January to August. We head toward Bleecker Playground, passing three teen girls who do a New York triple take: confirmation — feigned indifference — giggling. I’d wondered if Parker would prefer to skirt this notorious strip, the wormhole that marks the intersection between the series and its social side effects. Yet here we are, headed toward the most famous stop on the Sex and the City bus tour, Magnolia Bakery, with its eternal cluster of proto-Carries craving red-velvet cake.\n\nHilariously, the line doesn’t even glance up as its goddess passes by the Biography Bookshop. She’s wearing humongous sunglasses and a floppy slate-blue bodysuit made of chambray. We gamely try to have a conversation about the ways the neighborhood has changed: the Marc Jacobs effect; Broderick’s theory that Christopher Street’s “nasty shops” won’t disappear (although she adds that she “doesn’t patronize them”); Parker’s worries that a friend who owns a framing shop will get priced out. We discuss her first apartment, on Greenwich between Charles and Perry, when she rented from the infamous West Village landlord Bill Gottlieb (“He slept on a mattress made of my checks!”).\n\nBut every ten feet or so, there’s a fan: a young actress who calls her “the big meet”; the manager of Mulberry, who offers her a gift bag.\n\nThere are also people Parker actually knows, like a local mother who fills her in on her daughter’s recent tonsillectomy, and her longtime friend Eric Hughes, who gabs with us about real estate.\n\n“They’re always, always kind,” Parker emphasizes about her fans. “And I think to see me on the streets of New York, in a place that they might imagine the character would be — it makes people feel good.”\n\nIt’s the paparazzi that rankle her, this “culture of thuggery” that makes her “long for the Ron Galella days.” She knows how it sounds to complain, that people don’t like to hear this from stars: She understands that if you kvetch about things like receiving that creepy Maxim magazine “unsexiest woman” award, it stimulates the tabloids to repeat the slam. It was a subject that was dealt with several times on Sex and the City, in which Carrie had a penis scrawled on her bus poster and took a pratfall on a fashion runway — not to mention that strange opening sequence, in which she grins at her own image passing by only to get dirty water splashed onto her white tutu.\n\nBut Parker can’t help it. Some of these changes are very recent, certainly the willingness of photographers to shove her son’s schoolmates out of the way to get a picture of him. As a result, James Wilkie has begun to cover his face even during family photos. This idea that children are fair game has appeared “over the last four years, even more so the last 24 months,” she says. “Now we just kind of eat it. It’s like empty calories. It’s shit. And it’s so base.” Earlier, she’d told me, “I feel very ashamed, I feel like I’m like a — the town trollop. It makes me feel ashamed of my work. And I’m not. But I’m attached to this culture now in a way that, it’s kind of vulgar. And I feel cheapened. And I feel like I’m cheapening the school, like I’m bringing dirt, like I’m bad for the neighborhood.”\n\nWhen we turn the corner, she waves hi to the guy in the flower shop, whom she’s known for years.\n\nParker uses language like this a lot: “base,” “vulgar,” “the town trollop.” Perhaps it’s a way of setting herself apart from a generation of panty-free starlets. Maybe it’s the Matthew influence. It certainly seems linked to Parker’s ambivalent relationship with her sex-columnist character, who, she emphasizes, was never naked (true; has any other character worn so many bras to bed?), did not use profanity, wasn’t a slut but a romantic. (Kim Cattrall seems to be the last person waving the flag of third-wave sexual rebellion that the series championed early on: “Loose woman, hussy, slut, nympho — now it’s a cougar,” she says with a sigh.)\n\nBut then, Parker has an anxiety about purity in general, ever more so as she’s become as much businesswoman as performer. In the theater, there’s no product placement. It was her job as executive producer, though, to be aware of the marketing deals that financed Sex and the City, with brands from Apple to Manolo Blahnik to Absolut vodka integrated so seamlessly that unless you had the legal contracts on your desk, or were doing some kind of abstract comparison in your head (how would you feel if Jonathan Lethem cut a deal with Kodak?), you would have had to concentrate hard to notice at all.\n\nNow Parker does have those contracts on her desk. “It’s an eye-opener,” she says. “I do understand that it’s a necessity.” And then there’s her own brand, of which she says she tries to be “unconsciously conscious.” Ten years ago, she says, actors who created products were a rare breed, like Liz Taylor. Today it’s common, either as a covert layer of income — doing commercials in Asia, like George Clooney — or an open one. Parker’s solution is to be almost religiously involved in product development, creating her own perfumes and insisting on a democratic ethic for her clothing line, which runs up to size 22, “so I don’t feel it’s vulgar. So I don’t feel it’s just arbitrary or mercenary.”\n\nStill, she lies in bed and worries. “There are those actors who don’t do it. And some that wish they could. And some who never will. It’s like nudity.” She recalls a conversation back when she was considering doing the Garnier ads she eventually signed up for, “and I thought, I can’t do that, it’s not part of being an actor, and this one actor I really, really respected, we were talking about endorsements, and he said, ‘At least you’re not doing hair care.’ I thought, Oh, thank God. I would have been so ashamed.” She was reassured when a playwright she respects told her there was “no taint” to taking the deal.\n\nKim Cattrall seems to be the last person waving the flag of sexual rebellion that the series championed: “Loose woman, hussy, slut, nympho — now it’s a cougar,” she says with a sigh.\n\nThere’s a case to be made that if she has marketed her own personality — funny, effusive, motherly, girlish — as a brand, as what her friend John Benjamin Hickey jokingly calls “SJP Inc.,” this is a smart move.\n\nShe has taken other roles, some of them playing against her own likability, but there’s no guarantee she can break through again. Like a single woman in an earlier age or a blocked artist in Victorian London, an actress growing older can easily find that her world is shrinking. That will never happen to Parker, who has made certain to seize control of her own larger-than-life image.\n\nStill, I can’t help but wonder if a little more shamelessness might not be a good thing for her — a bit more direct ownership of the culture of appetite her show so famously celebrated. One night I watch Parker on Conan, her hair scraped into a tight ponytail, talking seriously (or anxiously; the two combine) about how she hates the subject of sex or even thinking about it, how she avoids anything “ribald, salty, cheeky.” Conan teases her for sounding like an eighteenth-century preacher. It’s a little depressing, since I’ve been watching Jill Clayburgh pirouette in her panties (“so sexy and raw,” marveled Parker) and enjoying clips of the younger Parker on YouTube, flirting with David Letterman. In those clips, she seems spontaneous, urbane, smart-assed — a sassy perfect girlfriend. She reminds me, in fact, of Carrie Bradshaw.\n\n“Who will we meet next?” asks Parker playfully. “This is Mister Rogers’ Neighborhood.” And when we turn the corner to walk toward Hudson, a handsome man with close-cropped hair appears.\n\n“Oh, it’s Officer Smith!” she says. (Not his real name.)\n\n“Listen, I have a message to you from my sister,” says Smith. “To tell these Maxim people to go to hell, okay?”\n\n“You tell your sister thank you,” she replies, with deadpan emphasis.\n\n“You should mail them pictures of when you were in — what was your first thing you were ever in on television?” Officer Smith asks.\n\n(“Square Pegs?” I suggest nonsensically.) “My favorite, the first thing I ever saw you in” — and he turns to me and adds, “and then you’re going to be able to tell that I’m a homo” — “when you wore the short dress to the Oscars? Mail them a picture of that.”\n\nShe didn’t know Officer Smith was gay, it turns out. “Because you have a strong not-gay vibe, too.”\n\n“Yeah, it’s the whole cop thing.”\n\nWe take off down the street, and Parker begins to tell me how she and the cop had met, a story that’s off the record — until suddenly he appears again, to suggest another hot outfit she should send to Maxim: the silver one she wore on Sex and the City when she saw Big in front of the Plaza, that great scene where she compares their romance to The Way We Were. “That could have turned me straight,” he says.\n\n“Would you mind telling Emily that story?” she asks.\n\nSo he tells me. He had signed up for the qualifying exam to be a cop in Suffolk County. He’d be a fool to turn it down, he knew: On Long Island, he could make twice the salary — a living wage at last. Then the night before the test, he watched the episode of Sex and the City titled “Splat,” the one where Kristen Johnston, playing a party girl who has aged out of her own social world, falls out the window at a fancy New York cocktail party. It’s a fairly devastating episode, the moment in the final season where Carrie seems to take an anxious look at her options and decide it’s simply too chilly to be alone in this world, at her age, as a woman; it’s the one where she decides that it’s better to believe in the fairy tale and head off with the wealthy artist who will support her in Paris, lending her one kind of freedom. The trade-off will be worth it.\n\nBut that’s not what Smith recalls about the episode. Instead, he remembers “that beautiful scene where it had just snowed. And I was like, ‘I can’t take this test, because I have to stay’ — that’s how much I love New York. Of course I had to tell my mom and everybody that I took it. But I couldn’t take it, because I cannot leave here. It’s hindering me from getting promoted, because if you get promoted, you have to leave the borough. And I can’t leave lower Manhattan. I can’t go to the Bronx. I would kill myself.”\n\nParker and I are sitting in the back of her Town Car, across the street from her building. She left her keys in the door that morning, when she was blocked in by the paparazzi, and now she’s locked out.\n\n“Shite. I can’t believe this. It’s kind of funny,” she says, BlackBerrying like crazy. “Who else has freaking keys? And where’s my poor, sweet, overworked assistant who is not picking up?”\n\nIt’s a Manhattan survivalist scenario, I joke — trapped in a Town Car with nothing but Gourmet Garage.\n\n“Isn’t it glamorous? Do you want a potato chip?” She offers me both Classic Lays and barbecue. “Do you want any, sir?” she asks the driver.\n\nAs we wait for someone to show up and let her in, she looks dreamily out onto the street. “In the summer, when the weather is perfectly perfect, I will do nothing but sit on that stoop. I will make all my calls on that stoop, return all my e-mails. There is nothing more wonderful than the stoop. A stoop is really — is heaven.”\n\nWe talk about her life as a child, when her family was constantly on the move, from Cincinnati to the Wellington Hotel in midtown to Roosevelt Island to New Jersey. Did she have any rituals to make a new place feel like a home? I ask.\n\n“There was nothing of value to bring with us. Nothing — it was a chance to start over and actually leave it all behind and start fresh. It wasn’t scarring. Honestly, it was like, ‘Oh, this could be good. We could start again. We could have a clean house for at least three weeks before it all goes to pot.’ ”\n\nA New York City that lost its financial bearings might not be an entirely bad thing, she says. “I’m very careful about how I say this. I don’t think being below the poverty line is good for anybody. And I don’t think barely clinging to it is good or healthy, especially for children. But there were things that I know I learned because of my circumstances, which were not Dickensian by any stretch, but there was no disposable income, there was no ‘What should we do with this extra $200?’ It was, ‘How can we disguise the lack of money?’ ”\n\nShe worries about what her son will learn growing up rich.\n\nEven now, she says, “We use the word earn. You’ve got to earn things. And he’ll say, like, ‘One day, when I’m older’ — and I’ll say, ‘You know, you have $42 in your piggy bank. That is yours to do with what you want. And one day, you’ll work hard, and hopefully you’ll find work that is good and fun.’ ”\n\nAs the street gets darker — her friend Eric Hughes is on his way over with the keys — we talk about the series again, the heightened Manhattan moment that it captured. “It’s like a Jeff Koons piece,” she says, munching a chip. “He takes a diamond ring, and he just blows it up. That’s what the show did. It highlighted the best angle of the Chrysler Building, the shiniest part of it — and those parts of the city seemed like they were for the rarefied few. A life that isn’t really how anybody lives. Even people who do love shoes, they don’t have the time like that to be with their friends. That was the thing that struck me more than anything about the show as the most unrealistic, the time they all had.”\n\nAs for Carrie, Parker rejects entirely my theory that she had any attraction, conscious or unconscious, to Big (or Aleks or Aidan, for that matter) because of his money. Carrie wasn’t like that! she says. Charlotte was, but Carrie wasn’t. Hey, she dated Berger, didn’t she? “I really don’t think that money was a criteria. It never would have occurred to her to take money from a man.”\n\nIn the modern version of New Grub Street, Parker seems to be both characters: the artist who longs to be good and pure and the pragmatic girl he marries, the one who knows that the world doesn’t work that way. She’s a disciplined businesswoman whose iconic role is the flightiest freelancer who ever lived. And if this sometimes makes her feel a bit conflicted, a mite defensive, cognitive dissonance on two legs? Well, we’re talking about a woman who has a proven ability to walk in heels.", "images": ["https://pyxis.nymag.com/v1/imgs/bb5/68c/d5c253cb3bcbad8a3f68277174493b554d-25-sarah-jessica-parker2.2x.h600.w512.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker-3a.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker2.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker-2.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker2.w1200.h630.jpg", "keywords": [], "authors": ["Emily Nussbaum", "Andrew Eccles August", "Photograph By"], "canonical_link": "https://nymag.com/movies/profiles/46660/", "title": "Sarah Jessica Parker Would Like a Few Words With Carrie Bradshaw", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Sarah Jessica Parker Would Like a Few Words With Carrie Bradshaw", "url": "https://www.thecut.com/2018/05/sarah-jessica-parker-on-sex-and-the-city.html", "description": "Revisiting New York’s 2008 profile of the Sex and the City star.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker2.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Sarah Jessica Parker Would Like a Word With Carrie Bradshaw", "description": "Revisiting New York’s 2008 profile of the Sex and the City star.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/25/25-sarah-jessica-parker2.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2018-05-30T09:00:01.171-04:00", "tag": "sarah jessica parker, sex and the city, hbo, culture, from the archives, profile", "publisher": "https://www.facebook.com/cut"}, "description": "Revisiting Emily Nussbaum’s 2008 New York Magazine profile of Sex and the City star Sarah Jessica Parker.", "sailthru.tags": "sarah jessica parker, sex and the city, hbo, culture, from the archives, profile", "author": "Emily Nussbaum", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1527685201.171, "source": "http://www.thecut.com", "summary": ""}