{"url": "http://collider.com/nick-blood-interview-agents-of-shield-season-5/", "text": "On the ABC series Marvel’s Agents of S.H.I.E.L.D., Fitz (Iain De Caestecker) is on a mission to find his teammates, who mysteriously vanished without a trace. And with the surprising help of Lance Hunter (Nick Blood), nothing will stop Fitz from the incredible journey he’ll have to take, in order to succeed in that mission.\n\nDuring a 1-on-1 phone interview with Collider, actor Nick Blood gave us all the details on what went into Episode 505, entitled “Rewind.” In this first half of the chat, we talked about how and when he found out that he’d be returning, his reaction to learning about where the other characters were, what it was like to step onto the set again, what he most enjoys about the Fitz-Hunter dynamic, and the fun moments they had shooting in an RV.\n\nCollider: I really enjoyed seeing you back on Agents of S.H.I.E.L.D. and this is such a fun episode!\n\nNICK BLOOD: It was a lot of fun to shoot, as well.\n\nHow far in advance did you get told that you’d be returning?\n\nBLOOD: We’d talked about it for awhile, and how it would be nice seeing everybody again. And then, sometime in the summer, (executive producer) Maurissa [Tancharoen] got in touch. In typical Marvel fashion, they don’t say too much. They told me, and I found out from Iain [De Caestecker], as well, that it was pretty much just gonna be me and him, the whole episode. So, I was like, “Yeah, cool! I’m in!”\n\nWhen you found out where everybody else was, what was your reaction?\n\nBLOOD: With all the Marvel stuff, you go, “What’s going on? What happened?!” I wasn’t up to date on the show, so I was trying to piece it all together. I was just like, “All right, cool. They’ve been abducted. That’s all I need to know.”\n\nHow did it feel to be on set again? Did it feel different, having been away from this character for a bit, especially without the rest of the cast there?\n\nBLOOD: I’ve spent a lot of time between London and L.A., so I’ve caught up with people, on a regular but infrequent basis. A big thing was getting to hang out with all the crew again ‘cause they’re just such a joy to work with. It was brilliant catching up with those guys. Me and Iain hang out, all the time, anyways. We’re probably sick of the sight of each other. No. We had a lot of fun and really enjoyed working together. It was a shame that it wasn’t with all the rest of the gang. That would have been fun. But, it was nice to catch up with people.\n\nAfter the Most Wanted spin-off series didn’t move ahead, did you ever think that you might not get to return to Lance Hunter?\n\nBLOOD: I guess so, yeah. As an actor, you’re used to doing stuff, and then moving on to something else and leaving it where it is. That’s part of the fun of the job. It’s always different. At the same time, it was a treat to return and have a bit of fun. I didn’t get to shoot a great deal with Iain when I was in the show before, so that new dynamic was nice.\n\nWhat did you most enjoy about having Hunter and Fitz team up together for this, and getting to play that bond and dynamic?\n\nBLOOD: It was just fun getting to hang out with my mate, the whole time. We’re really close, off set. We’re very close friends, so we were both excited to get the opportunity to spend a whole episode working together. It was nice to explore that friendship and dynamic, on screen.\n\nDid you have any particularly fun moments, in this episode?\n\nBLOOD: One day, catering served up tacos, mid-afternoon. That was a really fun day. I love tacos! No. Driving the RV was a lot of fun, but I think less fun for the camera crew that were in the back when I nearly toppled it over. I’m not the greatest driver, and putting an old RV in my hands is a risk. We had fun, pretty much every day, just messing around. Getting paid to hang out with your friends is not bad. They gave us a lot of fun stuff to do with a lot of variety in it. There’s an emotional heart to it, but there’s also a lot of fun scenes between the two characters. It was definitely a fun episode to do.\n\nAgents of S.H.I.E.L.D. airs on Friday nights on ABC.", "images": ["https://cdn.collider.com/wp-content/uploads/2020/04/too-hot-to-handle-harry-francesca-thumbnail-171x160.jpg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Dark.png", "https://cdn.collider.com/wp-content/uploads/2020/04/clone-wars-season-7-episode-9-thumbnail-171x160.jpeg", "https://collider.com/wp-content/themes/collider-v3/images/close-circle-512.png", "https://cdn.collider.com/wp-content/uploads/2020/04/the-last-kids-on-earth-netflix-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-agents-of-shield-slice-600x200.jpg", "https://cdn.collider.com/wp-content/uploads/2017/12/agents-of-shield-nick-blood-400x600.jpg", "https://cdn.collider.com/wp-content/uploads/2020/04/nick-wolfhard-thumbnail-171x160.jpeg", "https://www.facebook.com/tr?id=1628636477376373&ev=PageView&noscript=1", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Light.png", "https://cdn.collider.com/wp-content/uploads/2020/02/bosch-titus-welliver-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-lance-hunter.jpg", "https://cdn.collider.com/wp-content/uploads/2017/12/agents-of-shield-iain-de-caestecker-400x600.jpg"], "top_img": "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-lance-hunter.jpg", "keywords": [], "authors": ["Christina Radish"], "canonical_link": "https://collider.com/nick-blood-interview-agents-of-shield-season-5/", "title": "Nick Blood on Returning to ‘Agents of S.H.I.E.L.D.’ and the Fitz/Hunter Dynamic", "meta_data": {"msapplication-square70x70logo": "/smalltile.png", "msapplication-square150x150logo": "/mediumtile.png", "msapplication-wide310x150logo": "/widetile.png", "msapplication-square310x310logo": "/largetile.png", "description": "Nick Blood teases his return as Lance Hunter on an all-new episode of 'Agents of S.H.I.E.L.D.', the Fitz/Hunter dynamic, and what it was like to be back on set.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Nick Blood on Returning to 'Agents of S.H.I.E.L.D.' and the Fitz/Hunter Dynamic", "description": "Nick Blood teases his return as Lance Hunter on an all-new episode of 'Agents of S.H.I.E.L.D.', the Fitz/Hunter dynamic, and what it was like to be back on set.", "url": "https://collider.com/nick-blood-interview-agents-of-shield-season-5/", "site_name": "Collider", "updated_time": "2019-09-24T22:00:48+00:00", "image": {"identifier": "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-lance-hunter.jpg", "secure_url": "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-lance-hunter.jpg", "width": 1100, "height": 733}}, "article": {"publisher": "https://www.facebook.com/colliderdotcom", "author": "https://www.facebook.com/christinaradish", "tag": "Nick Blood", "section": "Entertainment", "published_time": "2017-12-22T15:24:51+00:00", "modified_time": "2019-09-24T22:00:48+00:00"}, "fb": {"app_id": 190932086012, "pages": 160246414365}, "twitter": {"card": "summary_large_image", "description": "Nick Blood teases his return as Lance Hunter on an all-new episode of 'Agents of S.H.I.E.L.D.', the Fitz/Hunter dynamic, and what it was like to be back on set.", "title": "Nick Blood on Returning to Agents of SHIELD", "site": "@collidernews", "image": "https://cdn.collider.com/wp-content/uploads/2017/12/nick-blood-lance-hunter.jpg", "creator": "@christinaradish"}, "generator": "WordPress 5.3.2", "ia": {"markup_url": "https://collider.com/nick-blood-interview-agents-of-shield-season-5/?ia_markup=1"}, "msvalidate.01": "F97A06145E9767C313B356E7E5B833F3", "viewport": "width=device-width", "google-site-verification": "rtgRWlKYqmg2IwU4e9PBjtt31jXoTjotyW6iJbyqdyc", "verify-v1": "ag44RccQF3Xr4VqGQnxB+TOx8+rCP4SHaCwwGAtuWzc="}, "movies": [], "publish_date": 1513956291.0, "source": "http://collider.com", "summary": ""}