{"url": "https://en.wikipedia.org/wiki/Despacito", "text": "2017 single by Luis Fonsi featuring Daddy Yankee\n\n\"Despacito\" ( American Spanish: [despa'sito]; transl. \"Slowly\") is a song by Puerto Rican singer Luis Fonsi featuring Puerto Rican rapper Daddy Yankee from Fonsi's 2019 studio album Vida.[1][2] On January 12, 2017, Universal Music Latin released \"Despacito\" and its music video, which shows both artists performing the song in La Perla neighborhood of Old San Juan, Puerto Rico and the local bar La Factoría. The song was written by Fonsi, Erika Ender, and Daddy Yankee, and was produced by Mauricio Rengifo and Andrés Torres. A remix version featuring Canadian singer Justin Bieber was released on April 17, 2017, which helped to improve the song's chart performance in numerous countries, including various number-one positions. \"Despacito\" has been widely credited by music journalists as being instrumental in popularizing Spanish-language pop music in the mainstream market again. The worldwide increase of Latin pop music consumption from 2017 onwards has been referred to as \"the 'Despacito' effect.\"\n\nIt is a reggaeton and Latin pop song composed in common time with lyrics about having a sexual relationship, performed in a smooth and romantic way. Commercially, the song topped the charts of 47 countries and reached the top 10 of six others, making it both Fonsi's and Daddy Yankee's most successful single to date. In the United States, it became the first song primarily in Spanish to top the Billboard Hot 100 since \"Macarena\" (Bayside Boys Mix) in 1996, subsequently tying the longest-reigning number one on the Billboard Hot 100 at the time with 16 weeks, as well as becoming the longest-running number-one on the Hot Latin Songs chart with 56 weeks. It also became the first Latin song to receive a diamond certification by the Recording Industry Association of America. Internationally, it broke the record for most weeks at number one in Switzerland and Germany and became the longest-reigning foreign language number-one in the United Kingdom. In August 2017, the official music video for \"Despacito\" became the most-viewed YouTube video of all time after receiving its three billionth view. It became the first video on the site to reach the milestones of three, four, five, and six billion views.\n\nUpon its release, \"Despacito\" received generally favorable reviews from music critics, who praised the fusion between Latin and urban rhythms, its catchiness, and its text painting. It has received Latin Grammy Awards for Record of the Year, Song of the Year, Best Urban Fusion/Performance, and Best Short Form Music Video at the 18th Latin Grammy Awards. The remix version has received three Grammy Awards nominations for Record of the Year, Song of the Year, and Best Pop Duo/Group Performance at the 60th Grammy Awards. \"Despacito\" has been also ranked among the best Latin songs of all-time and the best songs of 2017 by various publications, which referred to it as one of the most successful Spanish-language tracks in pop music history.\n\nBackground\n\npictured) co-wrote \"Despacito\" with Luis Fonsi. Panamanian singer and songwriter Erika Ender ) co-wrote \"Despacito\" with Luis Fonsi.\n\nAfter two years without releasing new music, Luis Fonsi wanted to create \"a fun track that had that Latin feel with a melody that I feel very comfortable singing and that will make people just dance.\"[3][4] The lyrics were born in late 2015 in Fonsi's house after he expressed his desire to record a \"swinging song\" for his new album.[5] Brazilian-Panamanian singer and songwriter Erika Ender, a Latin Grammy Award-winner, went to Luis Fonsi's house in Miami, who said to her that he woke up mulling about \"writing a song called 'Despacito'.\"[6][7] Fonsi sang the lines \"Vamos a hacerlo en una playa en Puerto Rico\", Ender replied \"Hasta que las olas griten 'Ay Bendito'\" and then they began to build the song.[7] The Puerto Rico line was moved to the end of the song in order to not sound \"so regional\" and they started writing a story.[7] Fonsi co-wrote the song on a Gibson Emmylou Harris guitar.[8]\n\nFonsi originally composed \"Despacito\" as a cumbia and pop song with lyrics written as a ballad, but began to consider giving it an \"urban injection\" and contacted reggaeton artist Daddy Yankee, who agreed to collaborate on the song after Fonsi played him the demo.[4][9] Prior to collaborating on \"Despacito\", Fonsi and Daddy Yankee had worked together on \"Una Oportunidad\", released digitally in 2010.[10] Daddy Yankee improvised his verse while thinking about his father playing bongos at his house, citing that as \"percussion attacks,\" and wrote the post-chorus or hook.[11][12][13] They recorded the song at Noisematch Studios in Miami, United States in 2016.[14][15] It was produced by Mauricio Rengifo and Andrés Torres; the former is known as a member of Colombian pop duo Cali & El Dandee and the latter is known for previously working with David Bisbal, Thalía, and Ricky Martin, among various Latin acts.[16][17][18] It was mixed by American engineer Jaycen Joshua at Larrabee Sound Studios in North Hollywood, Los Angeles, United States.[19]\n\nOriginally, Luis Fonsi focused on other songs of his album after making the demo of \"Despacito\".[20] Andrés Torres said that the track \"kept getting postponed\" because \"there was always some issue with [it].\"[21] After showing the demo to his producers, they and Fonsi decided to focus on \"Despacito\" and leave the other works aside.[20] Sometime in October or November 2016, Fonsi called Miami-based Noisematch Studios' CEO Alex Campos in order to record the track there, where he had worked his 2012 song \"Nunca Digas Siempre\" with Spanish singer Merche.[22] Campos stated that the first recording session consisted on \"working mostly the music,\" including the Puerto Rican cuatro.[23] Daddy Yankee's vocals were recorded on the second day of work. He asked for a Shure SM58 and recorded his verse and the post-chorus in a corner of the studio's control room.[24]\n\nLuis Fonsi stated that both Daddy Yankee and he were surprised after hearing the final song because it sounded \"powerful, fresh and different.\"[20] Luis Fonsi said that he does not consider it a reggaeton song but feels that \"it does have a reggaeton energy and an subtle urban beat.\"[4] He also affirmed that Daddy Yankee's work was a plus to the song because \"it needed that explosion that only he can bring to the table.\"[4] Mauricio Rengifo expressed that the song \"really took 100 percent shape the day Yankee recorded.\"[21] Ender stated that the track \"went through several arrangements\" until Fonsi got \"exactly the arrangement he wanted.\"[7]\n\nFonsi stated that he made \"Despacito\" a danceable song because \"Latinos are known for being happy people\" and that he feels the need of happy music.[25] He added that the \"urban feel\" in the song's rhythm is the type that \"Latinos breathe in and out\" and that it is \"a synonym of party.\"[25] According to him, \"Despacito\" is a very melodic song that can adapt well to many other music genres.[25] In an interview with Billboard magazine in April 2017, Erika Ender stated that the track \"made a special connection\" and that the collaboration with Daddy Yankee was \"a great idea.\"[5] She also said that because of the sensual nature of the song, they \"needed to be responsible with a good lyric\" and that her approach to writing for Fonsi was \"to take care of how to say things with a good taste.\"[5] During the 2017 Billboard Latin Music Conference, American singer and songwriter Nicky Jam revealed that the original version of \"Despacito\" featured him instead of Daddy Yankee, but had to decline due to the song's release interfering with the launch of his album Fénix.[21][26][27]\n\nJustin Bieber remix version\n\nThree months after the release of the original version, Canadian singer Justin Bieber wanted to record a remix after seeing how people reacted to the song in a Colombian nightclub during a tour in South America.[28][29] The following day, Luis Fonsi received a phone call from Universal Latin about the remix and authorized the label to send the track to Bieber.[30] On April 11, 2017, Bieber's manager Scooter Braun contacted his vocal producer Josh Gudwin, who was preparing to go on a short holiday to the Caribbean until April 17, to work on the song.[31] He flew from Los Angeles to Bogota and recorded Justin Bieber's vocals in Estudios Audiovisión after American songwriter Jason Boyd sent his lyrics and melody outlines.[31]\n\nJustin Bieber sang in Spanish for the first time in his career with the help of Colombian musician and Latin Grammy Award-nominee Juan Felipe Samper.[32][33][34] After recording the beginning of the song, Bieber approached Samper in order to receive coaching with his Spanish pronunciation, which he wanted to be perfect.[34] He stated that what cost Justin Bieber the most was the 'ere' (ɾ) sound in words like \"laberinto\" (labyrinth), \"paredes\" (walls) and \"manuscrito\" (manuscript).[34] Samper wrote the lyrics of the song phonetically to ease Bieber's pronunciation, which was \"perfectly\" achieved in two hours.[34]\n\nJosh Gudwin used a Neumann U47 microphone, a Neve 1081 microphone preamplifier and a Tube-Tech CL1B compressor for the four-hour recording session, and sent Bieber's vocal tracks to Australian sound engineer Chris \"Tek\" O'Ryan for vocal tuning.[31] Gudwin completed re-arranging the song and started to mix it while waiting during a five-hour lay-over at Miami International Airport.[31] He concluded the production of the remix version in Parrot Cay, Turks and Caicos Islands with the mixing of Luis Fonsi's English-language vocals, whose lyrics were written by American songwriter Marty James.[31] The entire process until the release date took six days.[31] Mauricio Rengifo stated that Justin Bieber \"approached reggaeton in a very different way\" and that \"the melody he does at the beginning is not reggaeton at all but it fits beautifully.\"[35]\n\nIn June 2017, English musician Ed Sheeran revealed that he wanted to record a remix version of the song but Justin Bieber \"advantaged him.\"[36][37] He also stated that he likes reggaeton music, saying that it has a \"good rhythm\" and that \"everyone enjoys it.\"[37]\n\nComposition\n\n\"Despacito\" is a reggaeton[38][39] and Latin pop[40][41] song composed in common time (4\n\n4 time) with a length of three minutes and forty-seven seconds and written in the key of B minor with a tempo of 89 beats per minute and a common chord progression of Bm—G—D—A.[42] The vocals span from F# 4 to A 5 .[43] Its implicit lyrics are about having a sexual relationship in a smooth and romantic way, making heavy use of allegories.[44][45] However, Luis Fonsi expressed that some lines are free for interpretation.[46][47]\n\n\"Despacito\" A 22-second sample of \"Despacito\" featuring part of the chorus. Problems playing this file? See media help.\n\nMauricio Rengifo and Andrés Torres produced \"Despacito\" using Pro Tools and its final mix consisted of 47 tracks.[35] Rengifo said that \"an interesting thing about this song is that it breaks a lot of rules\" and that they \"usually do not take one minute to get to the chorus, but when it works, it works.\"[35] The song begins with a Puerto Rican cuatro played by Christian Nieves, which is accompanied by an acoustic guitar played by Andrés Torres when Luis Fonsi starts performing.[35][48] Rengifo stated that the guitar \"was actually played, but then [they] chopped it and made it really digital.\"[35] The producers decided to record a cuatro because they wanted \"to feel very Puerto Rican and ethnic\" and that it \"gives the song a really unique character.\"[35] Nieves played salsa-influenced melodies during the chorus and the hook, which contains vocal samples and \"old school pop\" effects based on American producer Dr. Luke.[35] Percussion instruments guache and güira were synchronized with a hi hat in order to highlight the track's cumbia influences.[35] The song uses the side-chaining production technique in order to make the chorus \"more prominent,\" silencing the music as the kick drum hits.[49] It also makes heavy use of text painting when the music is slowed down as the word \"despacito\" (slowly) is performed at the beginning of every chorus.[49] Its percussion consists of guache, cowbell, timbales, güira, and sequenced drum patterns.[35]\n\nThe remix featuring Justin Bieber maintained the original rhythms and Luis Fonsi translated some lines to English, singing a verse in Spanglish, while Daddy Yankee's verses were kept from the original version.[32] It has a length of three minutes and forty-eight seconds. For the beginning of the song, Josh Gudwin adjusted the levels of some of the instrumental tracks and arranged and muted parts of the original vocals in order to have more space for Bieber.[31] The final mix consisted of 67 tracks.[31]\n\nRelease and reception\n\n\"Despacito\" was made available for digital download on January 13, 2017 by Universal Music Latin. It was released physically on April 30, 2017 in Europe as a 2-track single including the original and pop version. Some music publications believed the single's success was influenced by a trend of combining Latin pop and urban music after the release of singles by Nicky Jam, Thalia, Enrique Iglesias, Carlos Vives, Ricky Martin and Shakira.[50] Fonsi considered the trend to be \"the new pop\", and Ender said of it, \"everyone is making this type of fusions.\"[3][5] Luis Fonsi also stated that two weeks after the release of the song and its music video he started receiving calls from \"people who normally don't call, people who only call when something different is going on.\" He got calls from Ricky Martin, Juan Luis Guerra, Marc Anthony and other artists telling him that the track was a \"home run.\"[51]\n\nThe song was well received from music critics. Doris Irizarry of AXS praised the fusion between \"Latin sensual rhythms\" and urban music, describing it as \"masterful.\"[52] Sebastian Wernke-Schmiesing of Dance-Charts electronic journal stated that \"a simple 4/4 time, Spanish guitar sounds, a crisp bass, and the excellent vocals by Luis Fonsi and [Daddy Yankee] were enough to get a hit single from the start.\"[53] He added that \"'Despacito' has the magic it takes to reach the world\" and that \"works both on the dancefloors and on the radio.\"[53] Buddy Iahn of The Music Universe described it as an \"infectious tune\" and expressed that its music video became very popular because it is \"great music performed by two of the biggest stars in the Latin music business.\"[54] Diana Marti of E! News said that \"it is almost impossible not to dance to it.\"[55] Caroline Soriano of Enstars magazine described the song's beat as \"quite sexy and catchy\" and defined the lyrics as \"captivating.\"[56] Brittany Spanos of Rolling Stone magazine described it as alluring, sexy and catchy.[14] Leila Cobo of Billboard expressed that \"Despacito\" is \"a great pop song\", highlighting the \"undeniable immediate catchiness\" of the pre-chorus and the chorus.[57] Cobo also stated that it \"is a clever blend of romantic Latin pop with a reggaeton beat, subtly naughty lyrics, a rapper's contemporary edge and an irresistible chorus that can be applied to so many situations.\"[58]\n\nRobert Joffred of Medium's culture blog That Good You Need stated in his review that the song has \"something very interesting happening\" and that it can be classified as a Latin-American song because of its composition and characteristics.[49] He highlighted the use of a steel-string guitar to play flamenco-style melodies instead of a nylon-string guitar, on which flamenco is usually played, representing \"a modern take on a historical musical style.\"[49] Joffred also stated that what makes \"Despacito\" a \"great song\" is that it \"throws decades of tradition to the wind in a very subtle way\" because of the presence of \"swung rhythms\" when the word \"Despacito\" is sung at the beginning of the chorus.[49] He referred to the text painting as \"pretty genius.\"[49] Petra Rivera-Rideau, author of Remixing Reggaetón: The Cultural Politics of Race in Puerto Rico (2015), said that \"what's great about 'Despacito' is that it shows reggaeton never really went away\" and that the song's success \"makes her really excited to see what's going to happen next.\"[59] Raisa Bruner of Time magazine described the single as \"an infectious Latin melody amped up with reggaeton grooves and an irresistible dance tune.\"[60]\n\nSpanish record producer Nahúm García stated that \"the way the rhythm breaks before the chorus is genius,\" referring to the first time Luis Fonsi performs the word \"Despacito\".[61] He explained that \"the brain realizes that there has been a rare breakdown and it catches its eye\",[61] and claimed that this \"trick\" in particular is not very common \"and much less in pop music.\"[61] García concluded stating that the song \"is very well made.\"[61] James Kellaris, composer and professor at the University of Cincinnati's business school,[62] expressed that \"'Despacito' contains earworm elements\" for being \"cheerful, simple, repetitive and having a sticky rhythm.\"[61] Joshua Barrie of Irish Mirror gave a negative opinion about the lyrics after being translated to English, referring to them as \"quite rude and a bit creepy\" and stating that \"some people might find them offensive.\"[63] Christian Koch of The Culture Trip also referred to the lyrics as \"creepy.\"[64] On the other hand, an editor of Spanish music website Jenesaispop stated that \"the melody is very good, the lyrics are sexy without being vulgar and above all its structure is interesting.\"[65] Felix Contreras of National Public Radio praised the writing, arrangement and performances, describing them as \"one of a kind.\"[66] Derrick Rossignol of Uproxx described it as \"the perfect mix of everything pop fans want: it's acoustic and sexy, but with a fun beat, and it gives the feeling that you are listening to something new.\"[67]\n\nThe remix version featuring Justin Bieber was released on April 17, 2017 by Universal Music Latin, Republic Records, Def Jam Recordings, RBMG and School Boy Records.[68] It is the first collaboration between Luis Fonsi and Daddy Yankee with Bieber. The remix's official audio video garnered 20 million views on YouTube on its first 24 hours, making it the third-highest debut for a music-related video in 2017 as of September.[69] Hilton Dresden of Out magazine described it as \"unexpected and delightful\" and that \"Justin Bieber singing in Spanish is a highly sexual experience,\" defining the results of the collaboration as legendary.[70] Caroline Soriano of Ernstars magazine stated that Bieber's voice \"sounds appealing with the song,\" whose remix version make it sound \"a little bit better.\"[56] Latina's Daniela Galvez described Bieber singing in Spanish as \"amazing.\"[71]\n\nMike Senior of Sound on Sound gave a negative review of the remix's mixing by wondering the reasons of its polarity inversion regarding the original version, in which \"the kick sound feels appreciably punchier and the bass feels much warmer, while the stereo image is wider and more open-sounding.\"[72] He also noted that Daddy Yankee's \"melodic rapping seems appreciably quieter in the remix,\" while Justin Bieber's voice sounds louder.[72] As to the original version, Senior wrote that the producers did not waste the potential of the hook line \"Despacito\" and referred to its first appearance as a \"masterstroke\" because \"it puts the brakes on just enough to heighten the anticipation of the downbeat, but not so much that you totally lose the sense of rhythmic momentum during the hiatus.\"[72]\n\nAccolades\n\n\"Despacito\" has received various awards and nominations following its commercial success. In 2017, the original version won three awards at the 18th Latin Grammy Awards including Record of the Year, Song of the Year and Best Short Form Music Video, while the remix version won Best Urban Fusion/Performance.[73] It won Collaboration of the Year and Favorite Pop/Rock Song and was nominated for Video of the Year at the 45th American Music Awards.[74] The Latin Songwriters Hall of Fame recognized it as the Song of the Year at its 5th La Musa Awards.[75] The song has also won two Teen Choice Awards,[76] two Premios Juventud,[77] and an NRJ Music Award,[78] and was nominated for three Latin American Music Awards,[79] an MTV Europe Music Award,[80] and an MTV Video Music Award during that year.[81]\n\nIn 2018, the remix version received three nominations for Record of the Year, Song of the Year, and Best Pop Duo/Group Performance at the 60th Grammy Awards.[82] Due to the track's successful chart performance in the United States, the remix received six Billboard Latin Music Awards, including Hot Latin Song of the Year, and five Billboard Music Awards, including Top Hot 100 Song.[83] It has also received an ASCAP Latin Music Award for Song of the Year by the American Society of Composers, Authors and Publishers at the 26th ASCAP Latin Music Awards.[84][85] Erika Ender became the youngest person to be inducted into the Latin Songwriters Hall of Fame and the first female Latin artist to garner a Grammy Award for Song of the Year nomination.[75][30] At the 5th iHeartRadio Music Awards, both versions were nominated for three awards each, with the original receiving one award.[86]\n\nThe song has also appeared on the top 10 of several year-end and best of all-time lists. Billboard's critics ranked the original version the fourth best song overall and the best Latin song of 2017, as well as the fifth best Latin song of all-time, referring to it as \"one of the biggest hits in Latin music history\" and \"one of the biggest singles of all-time.\"[88][89][90] Rolling Stone selected it as the seventh best song of 2017, stating that it became \"your suburban grandmother's favorite Spanish-language song since 'La Bamba'.\"[91] Rolling Stone Argentina ranked it the sixth best song of the year and described its formula as an \"unappealable pop solidity that leaves no escape.\"[92] Time magazine ranked it the third best song of 2017, closing a brief review by stating that \"in a year where xenophobia reared its head worldwide, it inspires hope that the charts were dominated by such a universal, multicultural hit.\"[60] It was also ranked the third and 14th best international song of the year by Rockdelux and Rolling Stone Brazil, respectively.[93][94]\n\nThe remix version alone was ranked the 29th and 38th best song of 2017 by Noise magazine and Spin, respectively; the latter stating that \"it managed to transcend genre, time, space, and even personal taste in a way that was unprecedented.\"[95][96] It was also ranked the 20th and 21st best song of the year by PopSugar and The New York Times, respectively.[97][98] National Public Radio's critics selected it as the 51st best song of 2017, describing it as a \"damn good song\" and adding that \"writing a hit that will be remembered by millions is hard enough, but one remembered by billions?\"[66] The remix was also ranked the 44th and 46th best song of the year by The Village Voice and Uproxx, respectively.[99][67] The Guardian included it among the 100 best tracks of the year.[100] Luis Fonsi and Daddy Yankee were selected as the \"Stars of the Year\" by People en Español in November 2017.[101]\n\nRolling Stone's critics ranked the track 91st in its \"100 Greatest Songs of the Century So Far\" list in June 2018.[102] The magazine also included it in its \"50 Greatest Latin Pop Songs\" list in July 2018, describing it as \"the undeniable all-time champion of Latin pop\" and \"one of the most successful hits in pop music history.\"[103] Billboard selected it among the best Latin summer songs of all-time in August 2018, referring to the track as a \"classic.\"[104] In 2019, Billboard included \"Despacito\" among the 100 songs that defined the 2010s decade.[105]\n\nThe song was inducted to the 2019 edition of the Guinness World Records for achieving seven milestones: most weeks at number one on Billboard's Hot Latin Songs chart, most-viewed and most-liked video online, most-viewed music video online, most-viewed music video on YouTube for a duet, first YouTube video to receive five billion views, and most-streamed song worldwide.[106][107]\n\nControversies\n\nIn July 2017, officials from the Government of Malaysia reported that \"Despacito\" was being banned from airing on government-owned broadcast stations as a result of public complaints.[108] Government ministers said that the song was considered un-Islamic and that its lyrics were \"not suitable to be heard.\"[108]\n\nCommercial performance\n\nUnited States\n\nIn the United States, the single debuted at number two on Billboard's multi-metric Hot Latin Songs chart on February 4, 2017, becoming Fonsi's highest-charting single since June 13, 2009, when \"Aquí Estoy Yo\" peaked at the top position.[109][110] \"Despacito\" also became Fonsi's and Daddy Yankee's first number-one single on the US Latin Digital Songs chart after selling 11,000 downloads on the week ending February 4, 2017.[109][111] It was Daddy Yankee's highest debut ever on the Hot Latin Songs chart, in which he marked his 48th career entry.[109] \"Despacito\" reached number one on the US Hot Latin Songs chart on February 18, 2017 and remained there for 35 consecutive weeks until October 14, 2017.[68][112] In 2018, it returned to number one in three different runs for 17 consecutive weeks from January 6 to April 28 and for other four non-consecutive weeks between August 4 and September 1, totaling 56 non-consecutive weeks.[68][113][114][115] It is the longest-reigning number-one on the Hot Latin Songs chart, surpassing the 41 weeks of \"Bailando\" by Enrique Iglesias featuring Descemer Bueno and Gente de Zona, achieved between May 2014 to February 2015, on the issue dated February 17, 2018.[116][117][118] \"Despacito\" left the Hot Latin Songs chart on March 9, 2019 after 110 consecutive weeks, becoming the list's second longest-charting title, due to a recurrent rule that removes songs that rank below number five after 52 weeks.[119][120][121][122] The track has never ranked below the top five of Hot Latin Songs during the entirety of its run.[68][123][124] After falling to recurrent status, \"Despacito\" has topped the Hot Latin Songs Recurrents chart for 21 weeks since the issue dated March 9, 2019.[125] It has also topped the US Latin Digital Songs and Latin Streaming Songs charts for 69 and 59 non-consecutive weeks, respectively, and is the second longest-running number-one on both lists.[126][127][128]\n\nOn the US Billboard Hot 100 chart, the single debuted at number 88 on February 4, 2017, becoming Fonsi's third entry on that chart and Daddy Yankee's seventh.[129][130] It subsequently peaked at number 44 on April 15, 2017 before the release of the remix version featuring Justin Bieber.[131][132] Four weeks after the remix's release, \"Despacito\" reached number one on the Hot 100 for the week ending May 27, 2017, becoming both Fonsi and Daddy Yankee's first number one on the chart, and Bieber's fifth.[133] It has topped the Hot 100 for 16 consecutive weeks, tying with \"One Sweet Day\" by Mariah Carey and Boyz II Men as the longest-leading number-one single in the chart's history at the time, before being surpassed by \"Old Town Road\" by Lil Nas X featuring Billy Ray Cyrus on the week ending August 3, 2019.[134][135][136] It also became the first mostly-Spanish-language song to lead the all-genre US Digital Songs chart after selling 86,000 downloads on the week ending May 13, 2017.[137] On the issue dated July 22, 2017, it became the first non-primarily-English-language song to top the all-format Radio Songs and Mainstream Top 40 charts.[138] On October 21, 2017, \"Despacito\" and \"Mi Gente\" by J Balvin and Willy William featuring Beyoncé marked the first time that two non-primarily-English-language songs chart within the top 10 of the Billboard Hot 100 simultaneously since the list's inception in August 1958.[139] The song disappeared from the Hot 100 on the week ending January 27, 2018 after a chart run of 52 weeks due to a Billboard recurrent rule that removes titles that rank below position 25 after that number of weeks.[123][140] It has topped the US Hot 100 Recurrents list for three weeks and has charted for 51 non-consecutive weeks from to January 27, 2018 to March 9, 2019.[141] It also became the longest-reigning number-one on the US Digital Songs and Streaming Songs charts with 17 and 16 weeks, respectively.[135][142]\n\n\"Despacito\" was the best-selling and most-streamed single of 2017 in the United States, with 2,692,000 downloads sold and 1,322,799,000 video and audio streams, adding up a combined total of 6,663,000 sales plus track-equivalent audio streams.[143][144] It was also the sixth most-played song of 2017, with 608,000 spins across US radio stations and an audience of 3,076,935,000.[144] It was the second best-performing song of 2017 on the Billboard Hot 100 and the best-performing on the Hot Latin Songs chart.[145][146] In 2018, it was the best-selling and most-streamed Latin song of the first half of the year, with 246,000 downloads sold and 308,980,000 audio and video streams from December 29, 2017 to June 28, 2018, as well as the best-performing single on Hot Latin Songs for the second year in a row.[147][148] In 2019, it was the fifth best-selling and second most-streamed Spanish-language song of the first half of the year, with 45,000 downloads sold and 254,075,000 streams from January 4 to June 20, 2019.[149]\n\nIn the United States, the single sold 2,983,000 downloads as of June 20, 2019[a] and received a 13× platinum certification by the Recording Industry Association of America (RIAA) on January 6, 2020 for units of over 13 million sales plus track-equivalent streams, making it the highest-certified single of all-time in the United States.[150][151][152][153] It became the first Latin and 18th overall single to receive a diamond certification by the RIAA.[154][155][156] In August 2018, Billboard ranked it the 33rd best-performing single of all-time on the Hot 100.[157] The following month, \"Despacito\" was ranked the best-performing track of all-time on Hot Latin Songs since the list's inception in 1986.[158] On Billboard's decade-end charts of the 2010s, \"Despacito\" was the ninth best-performing single of the decade on the Hot 100 and was ranked at number two and number eight on the Streaming Songs and Digital Songs charts, respectively.[159][160][161] It was also the best-performing track on the Hot Latin Songs chart.[162]\n\nInternational\n\nInternationally, the original version topped the charts of Argentina, Austria, Belgium, Bolivia, Bulgaria, Chile, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Ecuador, Germany, Greece, Guatemala, Hungary, India, Ireland, Israel, Italy, Lebanon, Mexico, the Netherlands, Panama, Paraguay, Peru, the Philippines, Poland, Portugal, Russia, Slovakia, Slovenia, Spain, Switzerland, Uruguay, and Venezuela. Combined chart entries for the original and the remix version featuring Justin Bieber topped the charts of Australia, Canada, Luxembourg, Scotland, Sweden, and the United Kingdom. In total, \"Despacito\" has topped the charts of 47 countries.[163][164] The song spent 26 weeks at number one in Spain,[165] 20 in Switzerland,[166] 18 in France, Luxembourg, and Portugal,[167][168][169] 17 in Denmark and Germany,[170][171] 16 in Canada and Sweden,[172][173] 15 in Belgium (Wallonia) and Ireland,[174][175] 14 in Greece and Italy,[176][177][178] 13 in Australia and Belgium (Flanders),[179][180] 12 in Finland,[181] 11 in the United Kingdom,[182] and 10 in the Netherlands.[183] In Latin America, it broke the record for most simultaneous number-ones on Monitor Latino's charts with 11 on the issue dated April 2, 2017.[184][185]\n\nAcross Europe, the song was certified 13× platinum by the Swedish Recording Industry Association (GLF)[186] and the Spanish Music Producers (PROMUSICAE),[187] diamond by the Syndicat National de l'Édition Phonographique (SNEP)[188] and the Federazione Industria Musicale Italiana (FIMI),[189] quadruple platinum by the Belgian Entertainment Association (BEA),[190] the Danish International Federation of the Phonographic Industry (IFPI),[191] the British Phonographic Industry (BPI)[192] and the Bundesverband Musikindustrie (BVMI).[193] It was also certified platinum by the Swiss International Federation of the Phonographic Industry (IFPI),[194] and gold by the Austrian International Federation of the Phonographic Industry (IFPI).[195] It also received a diamond certification by the Music Canada[196] and a quintuple platinum certification by the Australian Recording Industry Association (ARIA).[197] In Latin America, \"Despacito\" was certified sextuple diamond by the Pro-Música Brasil (PMB)[198] and fivefold diamond and quadruple platinum by the Mexican Association of Producers of Phonograms and Videograms (AMPROFON).[199] The remix version alone topped the charts of Finland, Malaysia, New Zealand, Norway and Poland, and reached the top 10 in Mexico and Spain. It was certified platinum by the Recorded Music NZ (RMNZ),[200] the Pro-Música Brasil (PMB),[198] and gold by the Bundesverband Musikindustrie (BVMI).[201]\n\nIn the United Kingdom, \"Despacito\" was the second best-selling and most-streamed song of the year, with 2.3 million combined sales.[202][203] It was also the best-selling single of 2017 in Canada, with more than 300,000 digital sales.[204] It was the best-performing song of 2017 in Argentina, Austria, Bolivia, Chile, Colombia, Ecuador, Guatemala, Israel, Italy, Mexico, Panama, Paraguay, Peru, Spain, Uruguay, and Venezuela. It was the second best-performing song of 2017 in Australia, Belgium, Canada, Denmark, Dominican Republic, Germany, the Netherlands, New Zealand, Switzerland, Sweden, and the United Kingdom. In Latin America, it was the most-played radio song of 2017, with 580,450 spins between the 18 countries Monitor Latino measure, as well as the best-performing foreign song of the year in Brazil.[205][206] According to the International Federation of the Phonographic Industry, \"Despacito\" was the second best-selling digital single of 2017 worldwide, with 24.3 million sales plus track-equivalent streams, an amount that decreased to 11.8 million during 2018, making it the sixth best-selling song of that year.[207][208]\n\n\"Despacito\" became the world's most-streamed song of all-time in July 2017, with 4.6 billion streams between the original and remix version, surpassing Justin Bieber's \"Sorry\".[209] It was streamed 7.5 billion times as of April 2018.[163] In February 2018, the remix version became the first Latin and eight overall song to surpass one billion streams on Spotify.[210][211] In June 2019, the original version became the first completely-Spanish-language and non-English song to reach the milestone of one billion streams on Spotify.[212] In the United Kingdom, it became the longest-reigning foreign language number-one, surpassing The Manhattan Transfer's three weeks achieved in 1977 with their single \"Chanson D'Amour\".[182][213] It is also the 30th best-selling single in the country with 1,900,599 combined sales (566,425 digital sales and 1,334,174 streaming-equivalent sales) as of September 19, 2017.[214] It also became the song with most weeks at number one in Switzerland and Germany.[215]\n\nImpact\n\nLatin music\n\nThe success of the song and its remix version led Daddy Yankee to become the most listened-to artist worldwide on the streaming service Spotify on July 9, 2017, being the first Latin artist to do so.[216][217][218] He later became the fifth most listened-to male artist and the sixth overall of 2017 on Spotify.[219] In June 2017, \"Despacito\" was cited by Billboard's Leila Cobo as the song that renewed interest in the Latin music market from recording labels in the United States.[220] Julyssa Lopez of The Washington Post stated that the successes of \"Despacito\" and J Balvin's \"Mi Gente\" is \"the beginning of a new Latin crossover era.\"[221] Stephanie Ho of Genius website wrote that \"the successes of 'Despacito' and 'Mi Gente' could point to the beginning of a successful wave for Spanish-language music in the US.\"[222] Ho also stated that \"as 'Despacito' proves, fans don't need to understand the language in order to enjoy the music\", referring to the worldwide success of the song, including various non-Spanish-speaking countries.[222]\n\nIn October 2017, Xander Zellner of Billboard credited the influence of the single's commercial success for the Latin music domination in the US mainstream market during 2017, as 11 primarily-Spanish-language songs have debuted on the Hot 100 as of October 21, compared to two in 2016 and five in 2015.[139] American songwriter Desmond Child and Cuban musician Rudy Pérez, founders of the Latin Songwriters Hall of Fame, expressed that \"not since Ricky Martin's 'Livin' La Vida Loca' has there been a song in any genre that has had the global impact of 'Despacito', changing the course of pop music forever and ushering in an explosive new era of unlimited opportunities for all Latin music creators.\"[75] In December 2017, Lars Brandle of Billboard related the success of \"Despacito\" with the increase of Latin music's global popularity, as six out of the 10 most-viewed YouTube music videos in 2017 were for songs performed in Spanish by Latin artists. Brandle referred to it as \"the 'Despacito' effect.\"[223] Jeff Benjamin of Billboard stated that the success of the song represented that \"English is no longer a requirement for mainstream U.S. success.\"[224]\n\nIn December 2017, British Official Charts Company recognized \"Despacito\" as the song that \"helped Latin pop crossover to the mainstream once again\" and highlighted that \"Little Mix, Matt Terry, Demi Lovato and Camila Cabello all released Latin inspired songs this year.\"[225] Writing for Nielsen's 2017 Music Year-End Report, Erin Crawford stated that \"Despacito\" had \"a halo effect on several other Latin hits ripe for crossover success, most notably J Balvin & Willy William's 'Mi Gente,' which catapulted to the top of the Hot Latin Songs chart after Beyoncé made a 'Despacito'-esque cameo on the song in September to help raise proceeds for families affected by Hurricane Maria.\"[144] In June 2018, Rolling Stone magazine stated that the song \"hastened a massive historical turn in American music, demonstrating the mainstream viability of Spanish-language pop.\"[102] In July 2018, John Ochoa of Rolling Stone stated that \"the resulting so-called 'Despacito effect' has advanced a wave of subsequent Spanish-language hits and mainstream crossovers, from the Latin trap explosion to J Balvin's reggaeton globalization.\"[103] In August 2018, Billboard affirmed that the song's influence has impacted other Latin crossovers, including \"Mi Gente\".[226]\n\nThe Recording Industry Association of America reported in April 2018 that Latin music revenues grew 37% in 2017, \"driven primarily by music streaming,\" whose revenue increased 84% compared to 2016.[227] The International Federation of the Phonographic Industry (IFPI) reported that revenue in Latin America grew 17.7% in 2017, \"driven largely by a 48.9% increase in streaming revenues that helped offset a 41.5% decline in physical revenue.\"[207] \"Despacito\" has been described by the IFPI as \"a game-changing hit from Latin America to the world\" and declared it \"the song of 2017.\"[207] IFPI's chief executive Frances Moore described the song as a \"global smash hit\" and related its success with \"the broadening appeal of Latin music.\"[207] In July 2018, Billboard reported that Latin music's consumption in the United States increased 15% between the first half of 2016 and the first half of 2018, directly relating it with the success of \"Despacito\" during 2017.[228] In 2018, eight out of the 10 most-viewed YouTube music videos of the year were for songs performed in Spanish.[229] The Canadian Broadcasting Corporation referred to the worldwide increase of Latin pop music consumption in 2018 as \"the 'Despacito' effect.\"[230]\n\nIn June 2019, Sony/ATV Music Publishing President Jorge Mejía stated that \"Despacito\" marked a \"before and after\" in the global consumption of Latin music.[231] Before the song's success, Sony \"had a big Latin single roughly every two years,\" a situation that reverted into an \"avalanche of Latin songs around the world.\"[231] In November 2019, Billboard's Leila Cobo wrote that \"it wasn't only that no other Latin song, in history, had had that level of success, it also outdid everything that came in its wake\".[232] In December 2019, Andrew Unterberger of Billboard stated that \"2017 was the year that Latin pop took over the United States\" due to the song and its quick impact on J Balvin's and Willy William's \"Mi Gente\", Camila Cabello's \"Havana\", and the chart performance of acts including Maluma, Ozuna and Bad Bunny, who achieved their biggest hits in the country.[233]\n\nEconomic impact\n\nIn July 2017, it was reported that tourist interest in Puerto Rico increased by 45% since the worldwide success of the song.[234][235] Tour operators cite the song's music video for increasing interest in locations such as Club La Factoría and La Perla district in Old San Juan, which were featured in the video.[236]\n\nMusic video\n\nBackground\n\n2006 Miss Universe Zuleyka Rivera co-starred in the music video.\n\nThe music video for \"Despacito\" was directed by Puerto Rican director Carlos Pérez and produced by Joanna Egozcue and Roxy Quiñones.[237] Filming took place in December 2016 in La Perla neighborhood and the popular bar La Factoría in San Juan, Puerto Rico.[237] Carlos Pérez had previously worked with Luis Fonsi on \"Corazón en la Maleta\" (2014) and also with Daddy Yankee on clips including \"Gasolina\" (2004), \"Rompe\" (2005), \"Gangsta Zone\" (2006), \"Descontrol\" (2010), and \"Ven Conmigo\" (2011), among others.[238] Puerto Rican cinematographer Thomas Marvel and Puerto Rican stylist Yasiri Castro have also worked on the music video.[239]\n\nWanting Carlos Pérez to direct the clip, Luis Fonsi reached him the song and wanted to make \"something special.\" According to Fonsi, Pérez was impressed with the track after listening to it, and showed interest in the project.[51] Fonsi then called 2006 Miss Universe Zuleyka Rivera, wanting her to represent \"the Latina powerful woman.\" She called him back 10 minutes later and replied that it was \"the best song she had ever heard.\"[51]\n\nFonsi stated that the music video celebrates Latin American culture, saying that movement, dancing and rhythm are \"engraved into his bones.\" He also affirms that part of the song's success was the reception of the fans, capturing the best of Fonsi's romantic ballad and danceable facets.[25] Carlos Perez stated that the clip \"directly supports the vibe of the song\" and that it \"is a video that has soul to it.\"[240] Jorge Muñíz Ortíz of EFE stated that the music video \"highlights some of the main cultural and folkloric symbols of Puerto Rico\" by showing its \"splendid beaches, the colorful landscape of La Perla, the rattle of the Puerto Rican cuatro and the barrels of the autochthonous genre of bomba, even Zuleyka Rivera's hips movement, and a pair of men enjoying a game of dominoes.\"[9]\n\nOn April 10, 2018, Luis Fonsi's YouTube Vevo account was hacked by an anonymous group, who removed the music video for \"Despacito\" from his channel for hours before becoming available again.[241] BBC News reported that clips from more than a dozen Vevo channels, including those of Drake, Taylor Swift, Selena Gomez and Shakira, were also affected.[242] The hackers stated that \"the act was not malicious, but just in good fun.\"[242]\n\nSynopsis\n\nThe video shows both artists performing the song while participating on different parties on the island, featuring model Zuleyka Rivera.[243] The clip starts with shots of La Perla's coast during daylight while showing Zuleyka Rivera arriving at the shanty town on foot. Luis Fonsi and Daddy Yankee perform the song in a street while elders are playing dominos, a child is getting his hair cut, two people are talking while listening to the radio, and couples are dancing in the background. The video intercalates with shots of Fonsi and Daddy Yankee singing in front of a car with people sitting on it and dancing next to it. As Daddy Yankee is finishing his verse, Zuleyka Rivera enters La Factoría bar while the artists are performing and dancing alongside other people, and men are playing bomba drums.[9] Fonsi proceeds to dance with Rivera as the song ends. The outro consists of Luis Fonsi and Daddy Yankee singing the hook a cappella with the people at the bar.[9]\n\nPerformance and accolades\n\n[244] Video views on YouTube grew virally, and peaked about 28 weeks after video was posted. [244] Cumulative views of the YouTube video exhibit a slower, though stable, growth rate after its first year.\n\nThe official music video on YouTube was released on Fonsi's channel on January 12, 2017[109][245] and amassed one billion views in 97 days,[246] becoming the second-fastest video on the site to reach the milestone behind the music video for Adele's \"Hello\".[247] The video received two billion views in 154 days, surpassing Justin Bieber's record of 394 days with the music video for his song \"Sorry\" to become the fastest video on the site to reach the milestone.[248] The video became the first on YouTube to receive three, four, five, and six billion views on August 4, 2017; October 11, 2017; April 5, 2018; and February 24, 2019, respectively (dates are based on UTC).[249][250][251][252] It has received over 6.7 billion views as of April 8, 2020[245] and has been the most viewed video on the site since August 4, 2017, when it surpassed the music video for \"See You Again\" by Wiz Khalifa featuring Charlie Puth.[253] It is also the site's most-liked video, with over 36 million likes as of January 15, 2020.[254] On Vevo, the music video received 5.14 million views in its first 24 hours of release, which the website reported as being the most for a Spanish-language video's first day on its platform, surpassing J Balvin's record with the music video for his song \"Bobo\".[109]\n\nThe music video received a Latin Grammy Award for Best Short Form Music Video at the 18th Latin Grammy Awards and a Billboard Music Award for Top Streaming Song (Video) at the 25th Billboard Music Awards, and was nominated for an American Music Award for Video of the Year at the 45th American Music Awards.[73][74][87]\n\nLive performances\n\nThe first stage performance of \"Despacito\" was by Daddy Yankee solo in Merida, Mexico on February 27, 2017, while Fonsi performed the pop version on the L Festival on March 18, 2017 at the Pico Rivera Sports Arena in Pico Rivera, California.[255][256] Justin Bieber performed the remix version in Puerto Rico on April 18, 2017 on his Purpose World Tour with Luis Fonsi as guest.[257] Luis Fonsi and Daddy Yankee performed \"Despacito\" live together for the first time at the 2017 Billboard Latin Music Awards on April 27, 2017.[258] They performed together again on The Voice season 12 finals featuring contestant Mark Isaiah on May 23, 2017.[259] On June 12, 2017, Luis Fonsi performed solo on American talk show Conan in his first late-night television appearance in the United States.[260]\n\nJustin Bieber was not able to sing the song during live performances, and was caught replacing portions of the lyrics with the word \"blah\" and nonsensical ramblings during one performance in a much publicized incident.[261][262] Fonsi has defended him for not knowing the lyrics, saying he has to be given \"a little bit of a pass\" because Spanish is not Bieber's main language.[263]\n\nDaddy Yankee included the song on the setlist for his Tamo En Vivo Europe Tour, which lasted from June 2 to July 9, 2017.[264][265] Fonsi also included \"Despacito\" on his Love + Dance World Tour, which began on July 1, 2017 and concluded on July 26, 2018.[266] On September 14, 2017, Luis Fonsi performed the single on American talk show The Ellen DeGeneres Show.[267] Erika Ender also performed an acoustic version of the song during a Billboard session on September 18, 2017 in order to promote her album Tatuajes.[268] On November 16, 2017, Luis Fonsi performed the song featuring Puerto Rican musician Victor Manuelle, Colombian band Bomba Estéreo, and American disc jockey Diplo at the 18th Latin Grammy Awards.[269] Erika Ender and Brazilian singer-songwriter Roberto Carlos performed an acoustic version featuring drummers and dancers from Beija-Flor Samba school in Brazil on November 29, 2017.[270][271]\n\nOn January 28, 2018, Luis Fonsi and Daddy Yankee performed the song at the 60th Grammy Awards on the Madison Square Garden, becoming the 12th and 13th Latin artists to perform at the Grammy Awards.[272][273] Luis Fonsi performed it at the 59th Viña del Mar International Song Festival on February 21, 2018.[274] Four days later, he performed an orchestral version with the Teatro Colón Orchestra at the Teatro Colón in Buenos Aires, Argentina.[275] On January 30, 2019, Luis Fonsi and American television host Jimmy Fallon performed the song with changed random lyrics on The Tonight Show Starring Jimmy Fallon.[276]\n\nOther remixes and cover versions\n\nThe first two official remixes for \"Despacito\" were released on March 17, 2017: a solo pop version by Fonsi and a salsa version featuring vocals by Puerto Rican musician Victor Manuelle.[277] On May 5, 2017, two other remixes were released: an electronic dance version produced by American trio Major Lazer and Colombian DJ MOSKA and an urban version remixed by Colombian producer Sky.[278] A Portuguese-language version written by Erika Ender and performed by Luis Fonsi featuring Brazilian singer Israel Novaes was released on July 14, 2017.[279][280] A banda version by Luis Fonsi with Mexican group La Bandononona Clave Nueva De Max Peraza was released on September 1, 2017. In March 2017, Luis Fonsi expressed his desire to perform an acoustic version of the song.[25]\n\nA Spanish/Mandarin version by Luis Fonsi and Singaporean singer-songwriter JJ Lin was released on January 26, 2018 in order to introduce \"Despacito\" in China, since the original version was not released in the country.[281] It was produced by The Swaggernautz, a production duo composed by Singaporean producer Tat Tong and American singer and producer Jovany Javier, and was co-written, mixed, and engineered by Harry Chang, who also provided backing vocals.[281] Work on the song started in July 2017, with the process being derailed at multiple points as consequence of consecutive hurricanes in the Caribbean.[281]\n\nDominican musician Antony Santos released a merengue version featuring American rapper Mark B on June 26, 2017.[282][283] Filipina actress and singer Kristel Fulgar published an acoustic version of the remix on June 30, 2017.[284] Croatian-based duo 2Cellos, composed by musicians Luka Šulić and Stjepan Hauser, released a classical crossover version on July 19, 2017.[285] In August 2017, a cover by Zambian musician DJ Britain featuring his compatriot K-Star titled \"Dizz Pa Nchito\" was released with lyrics in Bemba, Nyanja and English in order to improve the popularity of Latin American Spanish music in the country.[286] Norwegian musician Leo Moracchioli released a metal version on July 20, 2017, which peaked at number 35 on the Hungarian Single Top 40 chart on August 10, 2017 [287]; as of March 2020 this version had 17 million views on YouTube. Hungarian pianist Peter Bence, holder of the world record for most piano key hits in one minute according to the Guinness World Records, published a piano version of the song on July 26, 2017.[288] American musical collective group Postmodern Jukebox released a \"Broadway style cover\" of the remix version on September 28, 2017.[289]\n\nPolitical uses\n\nThe song has also been used, with altered lyrics, for political purposes. It has been used in Argentina by various politicians for their respective TV advertisements for the 2017 midterm elections.[290] The melody of the song was also used by Argentine scientists to protest against President Mauricio Macri and by feminists as an initiative to convoke people to a concentration about violence against women.[291][292] Venezuelan President Nicolás Maduro used it to call for voting in the controversial Constitutional Assembly election.[293] Luis Fonsi, Daddy Yankee and Erika Ender showed their displeasure with the unauthorized use of the song for political purposes in Venezuela, criticizing Maduro's government use of the song as propaganda.[294][295][296] Fonsi said that he was never consulted or have he authorized the use of the song for political ends, \"less so in the context of the deplorable situation affecting a country that I love so much as Venezuela.\"[297] He also stated that his music is \"for all of those that want to listen to it and enjoy it, not to use it as propaganda that tries to manipulate the will of the people that are crying out for their freedom and a better future.\"[297] Despite the criticism by the songwriters, President Maduro continued to use the remix promoting the election, using it during a cadena.[298] On August 16, 2017, English television host James Corden remixed the song to comment on American President Donald Trump during his talk show The Late Late Show with James Corden.[299]\n\nAppearances in other media\n\nFollowing the song's worldwide success, \"Despacito\" was featured on various types of media, including television shows, films and YouTube videos.[300] A Spanglish parody titled \"El Patito\" (The Rubber Duckie) by American children's television show Sesame Street was published on August 21, 2017.[301][302] The song was featured on a TV commercial by Spotify and Chilean retail multinational Falabella starring Ciro Priello, Fabio Balsamo, and Gianluca Fru, three Italian comedians who gained notoriety through a viral parody video about \"Despacito\" on YouTube.[303][304] It was also included on Ubisoft's dance video game Just Dance 2018.[305] Luis Fonsi and Daddy Yankee had a brief appearance in the video YouTube Rewind: The Shape of 2017, which celebrates \"the videos, people, music and memes that made 2017.\"[306] In 2018, the song became the basis of several viral memes, including one about Amazon's Alexa playing the song to help someone cure their depression, and another about a sequel being released titled \"Despacito 2\".[307][308] During the 2018 Winter Olympics, the song was used by three separate teams (China's Xinyu Liu and Shiyue Wang, South Korea's Alexander Gamelin and Yura Min, and Poland's Maksym Spodyriev and Natalia Kaliszek) as the soundtrack for their ice dance performances.[309] It was also featured in the Netflix film Ibiza (2018).[310]\n\nFormats and track listings\n\nCredits and personnel\n\nCharts\n\nCertifications\n\nRelease history\n\nRegion Date Format Version Label Ref. United States January 13, 2017 Digital download Original Universal Latin Italy February 3, 2017 Contemporary hit radio [485] United States March 17, 2017 Digital download Pop version Salsa version Europe March 31, 2017 CD single Original\n\nPop version United States April 17, 2017 Digital download Justin Bieber remix Universal Latin\n\nRepublic\n\nDef Jam\n\nRBMG\n\nSchool Boy Europe Italy April 21, 2017 Contemporary hit radio Justin Bieber remix [486] United States May 5, 2017 Digital download Major Lazer and MOSKA remix Universal Latin Urban version July 14, 2017 Portuguese version September 1, 2017 Banda version January 26, 2018 Mandarin version\n\nSee also\n\nNotes\n\na b [143][147][149][150] Nielsen SoundScan did not provide data from June 29, 2018 to January 3, 2019. Nielsen SoundScan reported that \"Despacito\" sold 2,692,000 downloads in the tracking period of December 30, 2016 through December 28, 2017, 246,000 downloads in the tracking period of December 29, 2017 through June 28, 2018, and 45,000 downloads in the tracking period of January 4, 2019 through June 20, 2019, adding up a total of 2,983,000 downloads sold.Nielsen SoundScan did not provide data from June 29, 2018 to January 3, 2019. ^ Chart peaks in Australia, Canada, Luxembourg, the Netherlands, the Philippines, Scotland, Sweden, the United Kingdom, and the US Hot 100 measure combined data between the original and the Justin Bieber remix version. a b c Most of these year-end charts measure combined data between the original and the Justin Bieber remix version.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png/220px-Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/2017_Despacito_weekly_views.png/268px-2017_Despacito_weekly_views.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/2017_Despacito_cumulative_views.png/266px-2017_Despacito_cumulative_views.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Wiktionary-logo-en-v2.svg/40px-Wiktionary-logo-en-v2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/97/Luis_Fonsi_Feat._Justin_Bieber_%26_Daddy_Yankee_-_Despacito_Remix_%28Official_Single_Cover%29.png/220px-Luis_Fonsi_Feat._Justin_Bieber_%26_Daddy_Yankee_-_Despacito_Remix_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Erika_Ender_picby_Raymond_Collazo.jpg/170px-Erika_Ender_picby_Raymond_Collazo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Zuleyka_Rivera_Mexico_2_%28cropped%29.jpg/170px-Zuleyka_Rivera_Mexico_2_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Despacito", "title": "Despacito", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}