{"url": "http://time.com/5019182/george-hw-bush-groping-allegation/", "text": "Roslyn Corrigan was sixteen years old when she got a chance to meet George H.W. Bush, excited to be introduced to a former president having grown up dreaming of going into politics.\n\nBut Corrigan was crushed by her encounter: Bush, then 79 years old, groped her buttocks at a November 2003 event in The Woodlands, Texas, office of the Central Intelligence Agency where Corrigan’s father gathered with fellow intelligence officers and family members to meet Bush, Corrigan said. Corrigan is the sixth woman since Oct. 24 to accuse Bush publicly of grabbing her buttocks without consent.\n\n“My initial reaction was absolute horror. I was really, really confused,” Corrigan told TIME, speaking publicly for the first time about the encounter. “The first thing I did was look at my mom and, while he was still standing there, I didn’t say anything. What does a teenager say to the ex-president of the United States? Like, ‘Hey dude, you shouldn’t have touched me like that?’”\n\nRoslyn Corrigan (L), former president George H.W. Bush (C) and Sari Young (R) at the November 2003 event where Corrigan says Bush groped her. Courtesy Corrigan Family\n\nCorrigan said the incident happened while she was being photographed standing next to Bush. Five other women have made similar claims against Bush in recent weeks. Seven people, including family members and friends, confirmed to TIME that they had been told about alleged groping by Bush of Corrigan prior to the other recent allegations.\n\n“George Bush simply does not have it in his heart to knowingly cause anyone harm or distress, and he again apologizes to anyone he may have offended during a photo op,” Bush spokesperson Jim McGrath said in a statement to TIME. Previously, McGrath said Bush “has patted women’s rears in what he intended to be a good-natured manner,” additionally attributing the act to his diminished height after being confined to a wheelchair since 2012. Bush was standing upright in 2003 when he met Corrigan.\n\nCorrigan said that to this day, some of the responses she gets to her story are dismissive but she said she feels emboldened to speak out after seeing other women come forward, and hopes more will do so after hearing her account.\n\n“I don’t know, maybe it never really hit people that I was a child at the time and that goes beyond a guy being inappropriate in the workplace to a peer or somebody in his age range,” she said. “I was a child.”\n\nCorrigan, who had heard Bush give a speech at a conference held at the George Bush Presidential Library at Texas A&M University earlier in November 2003, asked her father, Steve A. Young, if she could leave early from her classes at The Woodlands High School and join him at the planned visit by Bush. After Bush addressed the CIA gathering, which included agency personnel and their family members, Corrigan had the opportunity to take a photograph with Bush, alongside her mother, Sari Young.\n\nRyan Trapani, a spokesperson for the CIA, declined multiple requests for comment regarding Young’s employment and Corrigan’s allegation against Bush.\n\n“As soon as the picture was being snapped on the one-two-three he dropped his hands from my waist down to my buttocks and gave it a nice, ripe squeeze, which would account for the fact that in the photograph my mouth is hanging wide open,” Corrigan said. “I was like, ‘Oh my goodness, what just happened?'”\n\nRoslyn Corrigan in 2017 Courtesy of the Corrigan Family\n\nHer mother, Sari, said Corrigan told her about the encounter as soon as Bush stepped away.\n\n“When he left, my daughter Rozi said, ‘He grabbed me on the rear end.’ And I said, ‘What, what?'” Sari said. “And she said, ‘Yes, he grabbed me when they were taking the picture. He grabbed me on my butt.’ And I was like, ‘Oh my god, are you kidding me?’\n\n“I was really, really upset — she was very upset, she was really, really mad,” she added. Sari said she would have tried to take action “had it been just some Joe Blow or something. I’d probably chase him down and yell at him.”\n\n“But, you know, it’s the president. What are you supposed to do?” she said in a Oct. 28 interview. “And you’ve got your husband’s job that could be in jeopardy. I mean, you just didn’t then. You should—you should have always spoken up, always—but we didn’t.”\n\nWithin the next few days, Corrigan told her childhood friend Chelsea Wellman about the alleged groping as well, Wellman told TIME on Oct. 27.\n\nChristopher Yarbrough, who was married to Corrigan from 2010 until their divorce the following year, said on Oct. 27 he learned about the incident about a month after they started dating in 2005. One day, the two were going through scrapbooks at Sari’s house, he said, when they flipped to a page revealing the photo with Bush. He said that Corrigan then told him about the encounter with the former president.\n\nTristan Voskuhl, who went to Sam Houston State University with Corrigan, said Corrigan first told her about the incident in 2006 when they were 19 years old. Bob Unseld, a family friend, said Sari first told him of the incident in 2013. “She didn’t say it just once. She told me this several times that he had done this to Rozi. It made her very mad.” Paul Weins, Unseld’s husband, also said he heard Sari’s account of the incident in 2013.\n\nBush, who from January 1976 to January 1977 served as the CIA’s director of Central Intelligence—the former title of the agency’s highest-ranking position—is one of a number of prominent figures to be accused of sexual assault since news of alleged past assaults committed by Harvey Weinstein broke early last month.\n\nActress Heather Lind was the first to openly accuse Bush of groping her while they posed for a photo during a promotional tour for her AMC series Turn: Washington’s Spies in 2013.\n\n“He didn’t shake my hand. He touched me from behind from his wheelchair with his wife Barbara Bush by his side,” Lind wrote in a now-deleted Instagram post on Oct. 24.\n\nOn Oct. 25, New York-based actress Jordana Grolnick told Deadspin Bush groped her in August 2016 at a Maine theater where she was performing. She said that Bush came backstage with Barbara during the intermission of the play, The Hunchback of Notre Dame, and gathered with the cast for a photo.\n\nOn Oct. 26, best-selling author Christina Baker Kline wrote in Slate that Bush groped her during an April 2014 photo op at a Barbara Bush Foundation for Family Literacy fundraiser in Houston.\n\nAmanda Staples, a former Maine Senate candidate said in a private Instagram post on Oct. 26 that Bush groped her in 2006, the Portland Press Herald reported.\n\nLiz Allen, a retired Erie Times-News journalist, said in an Oct. 26 Facebook post that Bush touched her from behind at a local business association event while taking a photograph with the former president in Erie, Pa. in 2004.\n\nBush’s spokesperson, McGrath, declined a separate request from TIME to comment on Staples and Allen’s allegations, which they said occurred when the former president was standing up.\n\nCorrigan said that Bush’s response to Lind and Grolnick’s allegations, which cited his use of a wheelchair, bothers her because the “excuse for his senile, old man antics… is not true.”\n\nShe said that recently, she was listening to an episode of a podcast hosted by Ben Shapiro called “Is Everything Sexual Assault Now?” Allegations against Bush were discussed on the show.\n\n“When I heard that was the reason, like, ‘Oh, he’s just an old man and he doesn’t know any better and he’s just being harmless and playful and it’s just where his arm falls… I just burst into uncontrollable sobbing,” Corrigan said. “I just couldn’t sit with that. I can’t. I cannot sit with that. I can’t sleep anymore, because that’s not true, and it’s not an excuse.”\n\nOn Nov. 1, former first lady Laura Bush, wife of George W. Bush, told CNN that the alleged incidents against her father-in-law were “very innocent.”\n\n“I’m just sad that we’ve come to this,” Laura Bush told the network. “That was something that was very, very innocent that he’s been accused of. But I know he would feel terrible.”\n\nCorrigan said she doesn’t see it that way.\n\n“It completely floored me. I was actually there to be taken seriously, and I wasn’t,” she said. “I thought, he’s a career politician, almost 80 years old or something like that, if anybody’s going to take me a little bit seriously or at least try to pretend he’s interested in what I have to say, it would be this guy. And he didn’t. All he did was grab my butt.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/10/george-h-w-bush.jpg?quality=85&w=572", "https://api.time.com/wp-content/uploads/2017/11/roslyn-corrigan-george-bush-2.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/04/george-hw-bush-leaves-hospital.jpg?quality=85&w=591", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Aric Jenkins"], "canonical_link": "https://time.com/5019182/george-hw-bush-groping-allegation/", "title": "Sixth Woman Says George H.W. Bush Groped Her When She Was 16", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "george hw bush, george hw bush 2017, george hw bush allegations, george hw bush sexual assault, george hw bush groping, george bush sr, president george hw bush, roslyn corrigan, heather lind", "news_keywords": "george hw bush, george hw bush 2017, george hw bush allegations, george hw bush sexual assault, george hw bush groping, george bush sr, president george hw bush, roslyn corrigan, heather lind", "description": "Rosyln Corrigan says former president George H.W. Bush groped her in 2003, the sixth woman to make an allegation like this", "og": {"title": "‘I Was a Child.’ Woman Says George H.W. Bush Groped Her When She Was 16", "type": "article", "site_name": "Time", "url": "https://time.com/5019182/george-hw-bush-groping-allegation/", "description": "The alleged incident happened in 2003, while the woman was photographed standing next to the former president", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5019182/george-hw-bush-groping-allegation/", "description": "Rosyln Corrigan says former president George H.W. Bush groped her in 2003, the sixth woman to make an allegation like this", "media": "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5019182/george-hw-bush-groping-allegation/", "title": "‘I Was a Child.’ Woman Says George H.W. Bush Groped Her When She Was 16", "description": "The alleged incident happened in 2003, while the woman was photographed standing next to the former president", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/george-bush-senior.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}