{"url": "www.chatelaine.com/living/entertainment/meghan-amal-angelina-feud/", "text": "The rumour: Meghan Markle is caught in a feud between Amal Clooney and Angelina Jolie\n\nRoyal Wedding Fashion: The Good, The Bad And The Bloody Awful!Where you heard it: New Idea magazine\n\nThe report: Amal’s presence at the Greatest Event of Our Lifetime last month was pretty flashy (you don’t wear head-to-toe canary to fade into the wallpaper, after all), and according to this Australian tabloid, Angelina Jolie could barely contain her “fierce” jealousy watching her rival bask in the royal spotlight. This is — according to New Idea’s unnamed source — part of a larger “battle brewing between Angelina Jolie and Amal Clooney, with both stars desperate to befriend [Markle].” Which is pretty awesome considering that less than two years ago, MM was about a thousand ranks below either woman on the celebrity power ladder (and they say the British class system doesn’t allow for upward mobility). But is it true?\n\nThe smell test: Eau de stinky kippers wafts intensely around this story, which doesn’t even bother to explain why Jolie might have hoped to score a wedding invite. (If she has ever met Meghan Markle before, the Internet doesn’t know about it.) Is it plausible that Angelina is interested in meeting with the newly powerful Duchess of Sussex to discuss their shared passions for human rights and social justice? Well sure, but that’s hardly evidence of a feud. As for the alleged friction between Angie and Amal, that (probably false) narrative has been around for a while now, stemming from the fact that Brad Pitt got George in the divorce.\n\nThe rumour: Protestors will greet the Queen and Meghan Markle on their first royal overnight trip\n\nWhere you heard it: The Express\n\nThe report: First of all, can we just discuss the fact that Meghan and the Queen are going on their first ever sleepover so soon? People magazine has reported that Her Majesty wants to take a “steadying hand” with her new granddaughter-in-law to ensure the dignity of the monarchy remains intact, but isn’t it also possible that they unlikely duo are new BFFs who can’t get enough of hanging out and talking about their dogs? Anyway — back to the protest. According to The Express, a group that calls itself the Scrap Mersey Tolls has changed the date of a previously scheduled demonstration in Cheshire in order to coincide with the royal visit on June 14th. The reason for the protest is the plan to implement tolls on the new Mersey Gateway Bridge, which Her Majesty is there to open. (Awkwaaaaaaard).\n\nThe smell test: A post on the Scrap Mersey Tolls Facebook page proves that this story is legit, if a little overblown, given that so far only six people have confirmed they will be attending the protest (two others are “interested”). At best a bit of a bloody nuisance, perhaps, but nothing that Thelma and Louise The Queen and The Duchess of Sussex can’t handle.\n\nThe rumour: Meghan Markle has sparked a freckle tattoo trend\n\nSubscribe To Our Newsletters — And Get All Our Royal Coverage Straight To Your InboxWhere you heard it: Elle UK\n\nThe report: The “Meghan Markle Effect” has thus far been used to describe MM’s considerable influence on all things fashion, style and messy bun. And now it appears the Duchess’s signature sun spots are on the “things to covet” list, so much so that semi-permanent freckle tattoos are a hot new beauty treatment.\n\nThe smell test: There is no question that freckled faces have a powerful ambassador in the newest royal, who has made a point of rejecting any attempts to airbrush her natural complexion. Semi-permanent tattooing may sound a bit extreme, but hey, so are a lot of the over-the-top beauty trends we hear about these days (semen facials, anyone?). The Elle story quotes an interview with an American tattoo artist (and “tattoo freckle pro”) who says she has been “crazy busy” keeping up with demand following the royal wedding. Note that the whole process takes only an hour, and lasts up to three years, which is either a pro or a con depending on how quickly you wish you had just bought a brown eyeliner and created fake freckles DIY-style.\n\nThe rumour: Meghan and Harry want kids “right away”\n\nWhere you heard it: Us Weekly\n\nThe report: First comes love, then comes royal wedding, then comes … well, you know where this is going. Sighting “multiple sources,” Us reports that Meghan’s biological clock has been ticking loudly since the wedding. “She and Harry want to start a family right away — and she’ll start trying as soon as she can,” says one source, with the others making similar assertions. (One adds that MM’s mom, Doria Ragland, expects to be a grandma by this time next year.)\n\nThe smell test: Isn’t this kind of a non-story story? As we royal rumour watchers are well aware, both the Duke and Duchess have been vocal about their desire to start a family, so it’s not like there was any big question mark. That, plus the fact that Meghan turns 37 in a couple of months, make the quick focus on family planning more of a foregone conclusion than a gossipy reveal. As for whether Doria will be a granny by next summer — that’s really more of a matter for Mother Nature. (The only woman we can think of who may be more powerful than Her Majesty.)", "images": ["https://www.chatelaine.com/wp-content/themes/chatelaine.com/assets/images/logo.png", "https://www.chatelaine.com/wp-content/uploads/2017/11/meghan-markle-prince-harry-relationship-timeline-2.jpg", "https://www.chatelaine.com/wp-content/plugins/rdm-daac-notice/public/images/close.png", "https://www.chatelaine.com/wp-content/uploads/2018/05/Amal-clooney-george-meghan-markle-prince-harry-wedding.jpg", "https://www.chatelaine.com/wp-content/uploads/2018/06/Amal-Clooney-Meghan-Markle-Angelina-Jolie-12.00.25-PM.jpg", "https://www.chatelaine.com/wp-content/uploads/2018/06/amal-meghan-angelina-social.jpeg", "https://www.chatelaine.com/wp-content/plugins/rdm-daac-notice/public/images/info.png"], "top_img": "https://www.chatelaine.com/wp-content/uploads/2018/06/amal-meghan-angelina-social.jpeg", "keywords": [], "authors": ["Courtney Shea"], "canonical_link": "https://www.chatelaine.com/living/entertainment/meghan-amal-angelina-feud/", "title": "Is Meghan Markle At The Centre Of A Feud Between Amal Clooney And Angelina Jolie?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"Is Meghan Markle At The Centre Of A Feud Between Amal Clooney And Angelina Jolie?\",\"url\":\"https:\\/\\/www.chatelaine.com\\/living\\/entertainment\\/meghan-amal-angelina-feud\\/\",\"pub_date\":\"2018-06-07 13:24:14\",\"mod_date\":\"2018-06-07 13:52:13\",\"type\":\"post\",\"post_id\":\"512951\",\"author_id\":\"696252\",\"author_name\":\"Carley Fortune\",\"author_display_name\":\"Carley Fortune\",\"tags\":[\"Angelina Jolie\",\"Editor&#039;s Picks\",\"entertainment\",\"Meghan Markle\",\"Royals\"],\"categories\":[\"Entertainment\",\"Facebook Instant Articles\"],\"image\":\"https:\\/\\/www.chatelaine.com\\/wp-content\\/uploads\\/2018\\/06\\/Amal-Clooney-Meghan-Markle-Angelina-Jolie-12.00.25-PM.jpg\",\"image_alt\":\"Amal Clooney, Meghan Markle and Angelina Jolie. Markle is said to be at the centre of a feud between Angelina and Amal\"}", "description": "Amal Clooney's presence at Meghan and Harry's wedding was pretty flashy, and according to one tabloid, Angelina Jolie could barely contain her “fierce” jealousy.", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Is Meghan Markle At The Centre Of A Feud Between Amal Clooney And Angelina Jolie?", "description": "Each week, we apply our smell test to the new batch of royal rumours to tell you what’s true and what stinks worse than rotten kippers.", "url": "https://www.chatelaine.com/living/entertainment/meghan-amal-angelina-feud/", "site_name": "Chatelaine", "updated_time": "2018-06-07T13:52:13-04:00", "image": "https://www.chatelaine.com/wp-content/uploads/2018/06/amal-meghan-angelina-social.jpeg"}, "article": {"tag": "Royals", "section": "Entertainment", "published_time": "2018-06-07T13:24:14-04:00", "modified_time": "2018-06-07T13:52:13-04:00"}, "twitter": {"card": "summary_large_image", "description": "Each week, we apply our smell test to the new batch of royal rumours to tell you what’s true and what stinks worse than rotten kippers.", "title": "Is Meghan Markle At The Centre Of A Feud Between Amal Clooney And Angelina Jolie?", "site": "@chatelaine", "image": "https://www.chatelaine.com/wp-content/uploads/2018/06/amal-meghan-angelina-social.jpeg", "creator": "@chatelaine"}, "generator": "WordPress 4.9.13"}, "movies": [], "publish_date": 1528392254.0, "source": "http://www.chatelaine.com", "summary": ""}