{"url": "www.inquisitr.com/4808152/kendall-jenner-envious-of-kims-modeling-gigs-thinks-sis-is-stealing-limelight-from-her-radar-reports/", "text": "Kendall Jenner is not happy that her older sister, Kim Kardashian West, is getting major modeling jobs these days. For her, Kim is too old for this type of gig so she wants her sibling to leave modeling to her.\n\nRadar Online reported that a rivalry is brewing between the Keeping Up With the Kardashians stars as the younger one of the two siblings appeared to be jealous of her older sister’s current works in modeling. Allegedly, Kendall Jenner and Kim Kardashian are clashing over the latter’s sudden wave of Vogue bookings.\n\nKim has recently been chosen to be on the cover of Vogue India, and this made Kendall furious. In the Kardashian family, it is Kendall who dominates the modeling world, so it upsets her that Kim is now getting major projects in the same field.\n\nThe 22-year-old KUWTK star and model also criticized her sister Kim for appearing on the magazine cover. For Kendall, her older sibling should not take on more modeling jobs because “She’s way too old to be landing huge magazine covers.”\n\nIn any case, Radar Online claimed that a source close to Kendall revealed that the model is bitter because she was jealous.\n\n“Kendall was super jealous over Kim’s latest gigs because she feels like Kim is totally stealing her thunder,” the source supposedly said.”\n\nKendall Jenner 'furious with Kim Kardashian' as modelling rivalries spill into sisters' relationship https://t.co/niZFdwty3d pic.twitter.com/mcewJm16K2 — madiandjaden (@madiandjaden_) March 1, 2018\n\nMoreover, it was said that Jenner does not really understand why people are still very fascinated with her sister. In the modeling industry, she has always been told how pretty she is so it appears that Kendall just feels threaten with her sister working in the same field where she is one of the best.\n\nThe insider further added that Kendall’s jealousy is ruining her relationship with Kim. She shared that the situation is just driving the siblings apart since tension is building up between them.\n\nIncidentally, it seems that it is not just Kendall who does not want to see Kim Kardashian on magazine covers again. Vogue India faced an overwhelming backlash after it chose the 37-year-old reality star to be on its March 2018 cover.\n\nAs per Page Six, negative comments poured in as many readers think that the magazine should have featured South Asian personalities instead of someone from a famous celebrity clan from the U.S. Plus, it should be noted that Kim is of Armenian descent.", "images": ["https://secure.gravatar.com/avatar/329bcbbc5fd80bf67f4838b2b54abeb2?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/03/Kendall-Jenner-.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Louise Bonquin"], "canonical_link": "https://www.inquisitr.com/4808152/kendall-jenner-envious-of-kims-modeling-gigs-thinks-sis-is-stealing-limelight-from-her-radar-reports/", "title": "Kendall Jenner Envious Of Kim’s Modeling Gigs, Thinks Sis Is Stealing Limelight From Her, ‘Radar’ Reports", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}