{"url": "http://www.vulture.com/2017/04/dear-white-people-trump-scandal-parody.html", "text": "Logan Browning plays Samantha White in Dear White People. Photo: Netflix\n\nDear White People, the new Netflix series being released on Friday, was not created for this moment. Its creative team couldn’t have even known that this moment would be this moment, since they wrapped production on Election Day. The fact that the show rings so true is a testament to the writers’ satire muscles, or outright clairvoyance.\n\nThe show is based on filmmaker Justin Simien’s critically acclaimed 2014 movie of the same name, which was a send-up of Obama-era post-racialism. The Netflix series takes place after that bubble has burst, and the presence of lingering bigotry is presented without plausible deniability. The central question to the show, then, is how to balance being a person and being a member of the resistance: Can you watch Scandal with your friends (and white boyfriend) when there are protests to plan?\n\nThat idea is at the heart of the first episode, which contains one of the show’s absolute funniest scenes — one where the main characters gather to watch Defamation, Dear White People’s hilarious Scandal spoof. On this week’s Good One, Vulture’s podcast about jokes and the people who write them, we talked with Simien about that scene, with the conversation also getting into why he couldn’t maintain the film’s level of satire for an entire TV series and his reaction to the renewed backlash to the show’s title.\n\nListen to the episode and read an edited transcript of our discussion below. Tune in to Good One every Monday on iTunes, or wherever you get your podcasts.\n\nIn the first episode, the main characters gather to watch Defamation, a Scandal parody. I think a good place to start is: How do you feel about Scandal?\n\nHonestly, I think her shows are great. Shonda [Rhimes] knows what they are. I call them kitchen-sink entertainment because they give you every possible thing that could possibly happen. If you’re a black person of a certain age, you’ve absolutely been to that viewing party. It’s just so ingrained in my experience as a young black guy, but it’s one of those cultural experiences that hadn’t yet been shown on a television show.\n\nWhat was so funny about it for me, as a person who wasn’t watching week to week, is just how caught up everybody was in it. The show is a lot of fun, but watching people watch the show, that was the gag. That was the aspect of young black culture I thought would be a fun place to set our characters, who are dealing with interracial relationships. Scandal and even How to Get Away With Murder, they’re popular among black women, but the interracial aspect of it is pretty controversial.\n\nIronically, it sounds like you felt how the white character Gabe feels in the scene, which is, What are all these people watching?I’ve been the guy in the room like, “Wait, so, who is that?” I always get the death stares from my friends who are like, “Justin, this is not the night to revoke your black card. You have to support this show and us watching it.” I’m in no way, shape, or form mad at Scandal because it serves a need that black people have when we watch things. Speaking for myself, as a black person, I love digging deeply into a series and thinking about its intricacies, but I also love talking to my television and saying, “Girl, don’t go in there.” We really are celebrating it because our characters love Defamation. Some of them love to hate-watch it, but either way, people love it.\n\nMaybe the most iconic scene in your movie is when the characters criticize the types of movies Hollywood makes for black people. Then, in the first episode of your TV show, you have them being like, “This is exactly what I want to see.” Was that intentional?\n\nNot in that way. Both were attempts to capture what the conversation is at the moment. Honestly, a lot of black audiences are feeling suspicious but optimistic. I’m not going to say we’ve reached a mountaintop, but there’s certainly more films and television about interesting, nuanced black characters than there’s ever been in my lifetime. That conversation of, like, “Why is the only thing playing at the movie theater Madea Goes Wherever She’s Going?” isn’t the same. I couldn’t have foreseen Moonlight and Get Out and Insecure and the timing of where our show fits in the Zeitgeist. It just occurred to me that this is a funny thing.\n\nThere’s a lot of collaboration required on a TV show, but every creator has a different relationship with a writing staff. Going from the film to the show, how did you work with others?\n\nIt was a learning process for everyone to not only get inside my head, but for me to also communicate how I make decisions. Dear White People has a very specific aesthetic and set of characters. We came into the room and I had the first season fleshed out and knew the beats of all the episodes, but I’m one person and I wanted a bunch of different points of view in the room. I needed female voices and white people and black folks that didn’t agree with me on things. Defamation was one of those things, however, where I just wrote it. It was very clear to me what that scene needed to be. As a director, replicating that network-TV slick, shoot-through-glass, every shot’s moving style was so fun. We were being so honest about this thing that we all laugh at, and that we all know is a part of our lives.\n\nObviously, it’s an elevated tone outside of an already elevated existence. How did you instruct the actors to perform?\n\nWithin the world of Defamation, I have to say the actors came in on point. The great thing is the actors who play the president and Olive Bishop [DWP’s version of Olivia Pope] are good actors, so they are playing something real. The performance style is just so over the top. It’s fun when you’re in the director’s chair and all you have to do is push people further. Pulling someone back and finding nuance where there isn’t, that’s hard work. But being more insane is just really fun. There’s no craft there. It’s just, “Do more of that! Scream at him!”\n\nThe character I found most fascinating in the scene is Reggie. Would you talk about his role?\n\nWe don’t know their history at the beginning of the show, but there’s this girl that Reggie has his eye on. She has been egging him on in a way. She suddenly shows up with a white dude, and they’re watching a show about a girl who’ll do anything for the white president. We always try to figure out how to make it personal as well as political, so Reggie says, “Oh, see, this is why the revolution dies, because we’re in here watching TV.” That’s what he says, but what he’s feeling is the subtext of the scene: That’s the dude. That’s reason she’s not with me. His corny ass? We were looking for that tension between what the characters say and what they mean, not just because it’s good writing, but because that’s what the show is about. Who we say we are versus who we are. We’re satirizing a time in this country where a lot of us are at odds about how to involve ourselves in some political or activist kind of process, but also be honorable to all of our other identities. Like, Do I always have to be woke and speak to something, or can I just be in love? When can I turn it off?\n\nSeeing that parody or homage made me think about the tone of Dear White People the show versus Dear White People the film. Is it possible that satire on television is harder to maintain?\n\nI see the show as a five-hour movie you’re watching in slices. We start with Sam, who is very much a part of black culture at Winchester. Then we move to Lionel, who is very much trying to penetrate black culture at Winchester. There are certainly episodes where what we’re satirizing becomes very clear, but I wanted to get under your skin. I wanted these characters to sink in, and for you to care about them before things get real.\n\nI recognized pretty early on is that this wouldn’t be a hard, satirical show. Veep is probably my favorite satire on the air. It’s such hard satire, it’s harder to care about them. For Veep, that’s not a problem because they’re all irredeemable people who are lucking their way into running the country. But with these guys, you have to spend time with them in a way that they’re not just caricatures or archetypes. So, yeah, it was a conscious effort to have a lighter touch episode to episode, but think of it as a whole piece. There is a thing that we’re satirizing, but we’re taking our time getting to it. Otherwise, I just think it might be grating.\n\nIn the Defamation scene, Gabe says about the blackface party, “I can’t believe this happens in 2017.” Although you stopped shooting right on Election Day, you were aware that there was a shift in terms of how white Americans acknowledge the existence of blatant racism. What was your journey with this version of this TV show in regards to how the country shifted?\n\nWe didn’t know what was coming politically, but it seems as if we did. It just speaks to the fact that racism has just always been there. Racism is baked into a system, and that system existed before Donald Trump was elected president. It will exist after he is impeached, replaced, or whatever happens to him. It will continue to exist because we have not really begun to transform the societal underpinnings that happen as a result of slavery. We were just trying to be honest about that and it just so happens that the world unfortunately proved us really right in a lot of ways. We shot the last scene of the last episode as the results were coming in, as everyone was realizing what was about to happen. It really was a shock to us that the show was and is sort of a commentary on that.\n\nThe show takes place in the aftermath of what happens in the movie, but many of the roles are played by new actors. I know you’re a sci-fi fan, so I want to put it in these terms: How do you think about these two different universes?\n\nI do have some very sci-fi ideas about how both universes exist, and how Troy is in both of them. I’ve thought about it, and if we go that long, I just might get to put those things in the story. As a sci-fi nerd, my favorite part of Star Trek: The Next Generation is when you get to the later seasons and they feel free enough to not make them just about Picard and Riker. You see people on the ship that you’ve literally never seen before, who apparently have been working there for years. It’s so fun because you see this universe you love from all these different characters’ points of view. We’re even having that right now with the superhero movies. It’s like, is it always the most satisfying thing that the movies line up perfectly, and this movie feels like a commercial for the next one? Or is the Fox model better, where the characters look the same but nothing that happened before really has anything to do with this movie? I chose the latter for this show.\n\nIn the broad generalization of superhero and sci-fi movies, is there a story you would like to tell?\n\nYeah, for sure. I’m definitely more of a Star Trek guy. I love Star Wars, but Star Trek is what I grew up on. I’ve never given up the dream of wanting to tell a story in the Marvel universe, because the X-Men were my first sagas. The Dark Phoenix saga was the first time I was like caught up in something bigger than myself as a child. I’m not even gonna just go the Storm route, I want to tell an X-Men story, full-on, 100 percent. That was the first time I encountered an idea where it was a metaphor for something else, but it was also this really soapy character drama. A lot of that is in my show and in my work, probably for a reason.\n\nWhen the show’s teaser came out, people were outraged by the title in a very predictable way. It seems like it worked exactly as planned: Their reaction was the exact reaction represented by the show, with everyone revealing their true selves. How was it seeing that happen?\n\nIt was bizarre, because the volume of vitriol was exponentially larger. I contemplated this in a Medium piece — why isn’t Stephen Colbert getting this because of his “Hey, White People” [segment on The Late Show]? “Hey, White People” is certainly reaching a lot more people than my little indie movie ever did, so why I am the target? Well, I’m a black liberal that these people have deemed an easy target. For me, it was actually very validating. There are still people to this day who ask me, “Wait, blackface parties are a thing?” I’m like, “Yes, just go online.” It was interesting to have people see that level of vitriol for the first time.\n\nThat was good for the series, frankly, but it awakened me to an entire subculture that I didn’t understand before. Brigading, fake accounts, how these people manipulate YouTube likes and dislike ratios, and how they harass people on Twitter. As a storyteller, that’s my favorite thing about Dear White People: As people show their asses along the way, I get to incorporate it into the show. The lengths people go to falsely amplify their voices are fascinating to me. Especially because it’s coming from parts of society where there’s perceived oppression, but there’s no statistical or proven oppression. They’re using these tactics as if they’re in the midst of a civil-rights situation where they’re fighting for their lives. As a student of humanity, I can’t help but be deeply fascinated and amused by it. Once you realize, All 12 of these people on my timeline are probably the same two guys, then it becomes funny. I’m at home petting my cat and hoping I get a second season, and these motherfuckers are launching attacks online. I can’t wait to put all of that into season two.", "images": ["https://pyxis.nymag.com/v1/imgs/df0/d6d/e467dbb78cfcbec5a0d6a0f8ab9977d969-25-dear-white-people-good-one.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/04/25/25-dear-white-people-good-one.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/df0/d6d/e467dbb78cfcbec5a0d6a0f8ab9977d969-25-dear-white-people-good-one.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Jesse David Fox"], "canonical_link": "https://www.vulture.com/2017/04/dear-white-people-trump-scandal-parody.html", "title": "The Story Behind Dear White People’s Perfect Scandal Parody", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Story Behind Dear White People’s Perfect Scandal Parody", "url": "https://www.vulture.com/2017/04/dear-white-people-trump-scandal-parody.html", "description": "Dear White People creator Justin Simien talks about loving Shonda Rhimes, writing satire, and his show’s timeliness.", "image": "https://pyxis.nymag.com/v1/imgs/df0/d6d/e467dbb78cfcbec5a0d6a0f8ab9977d969-25-dear-white-people-good-one.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The Story Behind Dear White People’s Perfect Scandal Parody", "description": "Dear White People creator Justin Simien talks about loving Shonda Rhimes, writing satire, and his show’s timeliness.", "image": "https://pyxis.nymag.com/v1/imgs/df0/d6d/e467dbb78cfcbec5a0d6a0f8ab9977d969-25-dear-white-people-good-one.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@JesseDavidFox", "site": "@vulture"}, "article": {"published_time": "2017-04-27T14:00:00.000-04:00", "tag": "good one podcast, dear white people, justin simien, satire, scandal, tv", "publisher": "https://www.facebook.com/Vulture"}, "description": "Justin Simien talks about his new Netflix show, ‘Dear White People’, on a new episode of the comedy podcast Good One.", "sailthru.tags": "good one podcast, dear white people, justin simien, satire, scandal, tv", "author": "Jesse David Fox", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1493316000.0, "source": "http://www.vulture.com", "summary": ""}