{"url": "https://www.billboard.com/articles/news/cover-story/6835305/zayn-malik-solo-career-one-direction-new-music", "text": "COVER STORY Zayn Malik Speaks Out in Revealing Billboard Cover Story: 'I'm Not Censoring Myself Anymore'\n\nIn 2015, Zayn Malik abruptly quit One Direction, broke off a fairy-tale pop-star engagement and overdid the hair dye. Now, as he wraps up his long-simmering creative statement, the boy band outlier aims to prove that he has been his own man all along.\n\nZayn Malik is standing in a dimly lit studio, spliff hanging from his lips and whiskey tumbler in hand.\n\n“My fans are giving me shit every day,” he says. “Like, ‘Where the f--- is your music? You’ve been at it for months. Give us something.’ ” It’s around 9 p.m. the Monday after Thanksgiving, and the 22-year-old is indeed about to give up something, though not to his adoring public -- they’ll have to wait for a solo album due early this spring on RCA. The four others here at Los Angeles’ Record Plant are part of Malik’s team, and even they seem surprised at how little the slinky, propulsive music he plays has to do with anything recorded by One Direction, the band he abruptly left eight months ago, setting off a convulsion of online lament including accusations of treason and upsetting hashtags like #CuttingForZayn. In fact, the beat of shadowy, au courant R&B track “She” drives so hard that Malik, grooving intensely, sloshes liquor onto his arm. He quickly grabs a tissue and self-consciously dabs his wrist.\n\nSee Zayn Malik's Sexy, Brooding Billboard Cover Shoot\n\nIf Malik’s goal in leaving One Direction was to escape the kind of superfame attainable only by boy bands with obsessed, social media-armed admirers, he has failed. From the moment he quit -- Wednesday, March 25, 2015 at 6:30 a.m. ET -- the singer pegged as the group’s quiet and mysterious one saw his every move dissected across countless platforms. The most retweeted message of 2015? Bandmate Harry Styles wishing him “love” when Malik announced his exit. The second? Malik calling the first 1D song without him “sick” (in a good way).\n\nTo devotees of 1D -- which by March had sold 6.5 million albums in the United States (according to Nielsen Music), amassed 224 million YouTube views and, on its 2014 tour, grossed $290 million (according to Billboard Boxscore) -- the only thing more fascinating than the boys are their relationships to one another. (A small library’s worth of soft- and hardcore fan fiction attests to that.) It’s a bond that Malik himself can’t break, although he gently distances himself from his former colleagues -- and less gently, their music. “I genuinely enjoyed [the band] and did whatever I could to be myself within that, but it’s just not where I sit as a musician,” he says. “The other boys’ taste was generally indie rock. It’s good music, but I don’t f--- with it. That was never cool where I was from.”\n\nIn 1D, Malik was known as the “Bradford Bad Boy” for his working-class hometown. And indeed, there’s little outwardly posh or precious about him. You can hear the North of England in his speech, where “other boys” becomes “uvah boyce.” His hair juts off of his head at a near-perfect 45 degrees, but since going solo he has shaved it once and changed the color five times (it’s gray today). Tattoos pour from his snug black tee, which, like his tight blue jeans and matte black boots, bears no logos. No amount of ink, hair dye or facial scruff -- today, he’s what you might call inadvertently bearded -- can obscure the glow of his innate gorgeousness.\n\nZayn Malik's One Direction: A Look Back at the Singer's Road to Going Solo\n\nIn other words, Malik looks every bit the hipster heartthrob. And judging from his music, he’s poised to impress the dominant music geeks of the day, who care less about guitar-slingers than artful practitioners of beats and atmosphere, like Drake and The Weeknd. Finely wrought details stand out: the sour synth of “BeFour,” a sweep of strings in “It’s You,” the whip-crack snare of “Wrong.”\n\n\"It doesn’t feel like choreographed pop,\" says RCA chairman/CEO Peter Edge. \"It's widely rumored that Harry is working on a record and that's probably the other one there'll be some anticipation for,\" he adds (noting that he doesn’t know what Styles, who is on a different label than Malik, might be planning). \"When Zayn was in the band, he had all these songs he was writing, and plans to do his own music. It just feels like maybe he's further along than the others.\" Malik’s voice gives each song its center. It’s a pleasantly rough thing, intimate and warm, but capable of striking falsettos. His bandmate Liam Payne “would always give me credit in terms of vocal ability,” says Malik modestly.\n\nZayn Malik Manager Sarah Stennett Wants to 'Make Sure Nobody Gets in the Way of Him Becoming an Important Artist'\n\nThose pipes fit the man, who combines an easy-going sincerity with flashes of ambition. As his manager Sarah Stennett puts it, he’s “incredibly sensitive, but also very alpha.” Private but not shy, Malik is more or less the “normal 22-year-old” he said he wanted to be in his farewell from the band -- frank, easily moved to laughter, occasionally impatient, frequently stoned -- but more of a striver than a dreamer.\n\nHe has gone to unusual lengths in pursuit of his muse, for one. “We went camping for a week in the Angeles Forest -- set up a generator and a tent so we could track in the woods,” says producer James “Malay” Ho (who has become Malik’s main collaborator, Malay believes, due to his Grammy-winning work on Frank Ocean’s Channel Orange). “It was the complete opposite of what he’d been doing. We had the gas grill, BB guns, bows and arrows. It was a shittin’-in-the-woods-type thing.”\n\nLooking ahead to his debut LP -- and the much-fretted-over hiatus that 1D intends to begin in March -- Malik downplays any rivalry between himself and his old mates. “There are no sides to pick,” he says. “We’re not going head-to-head.”\n\nStill, Malik’s not sure he’ll have “four friends for life,” as he wrote when he quit. “The truth of it is,” he says carefully, “you can think one thing about a situation and the total opposite can happen. I had every intention of remaining friends with everybody, but I guess certain phone numbers have changed and I haven’t received calls from a lot of people. I’ve reached out to a few of them and not got a reply. Certain people have pride issues, but it’s stuff you overcome in time.”\n\nIn November 2014, Malik missed a One Direction concert and interview with NBC’s Today in Florida, officially due to a stomach bug. (Matt Lauer prompted an online backlash by mentioning “rumors of substance abuse” by Malik, which Malik promptly denied.) Four months later, he cried onstage in Hong Kong. The next day he left the tour due to “stress,” and the following week he was gone for good. Meanwhile, his two-year engagement to Little Mix’s Perrie Edwards also seemed to be splintering. There were photos of Malik holding hands with another woman in Thailand days before the show in China. By August, he had broken that off, too.\n\nAfter all that, Malik knew what he had to do. “I went home,” he says. “I seen my mum, who cooked me some great food. I ate for three weeks because I’d lost so much weight in the band. I seen my sisters and put my dad’s sheepskin on -- I walked around and everyone thought I was him. Nobody bothered me. It was good for my soul to be back in Bradford.”\n\nThe Year in Zayn Malik's Changing Hair\n\nMalik was born in 1993, the second of four children, the rest girls. His birth name, Zain Javadd Malik, means “beautiful, generous king” in Arabic. His father, Yaser, is British Pakistani, and raised his son on a diet of Usher, R. Kelly, 2Pac, Biggie and classic reggae like Gregory Isaacs. His mother, Trisha Malik (nee Brannan), is Irish-English but adopted her husband’s Muslim faith and worked for a time as a halal chef at a local elementary school.\n\nThe family rented an apartment in the Victorian row houses of Bradford’s East Bowling district. Malik has said he didn’t fit in at his first two schools because of his mixed heritage. Still, he was precocious: He joined choir at 8 or 9 in order to meet girls and discovered he loved to sing. He also took the lead in school plays -- most famously, thanks to YouTube, Danny Zuko in Tong High’s production of Grease.\n\nMalik’s old teachers have told the media he was “a model student,” but he’s not so sure: “I was a different person then,” he says. “I was 17 and like, ‘F--- the world!’ I thought I was 2Pac and I’m really not.” He laughs, but he almost missed his 2010 tryout for The X Factor, where 1D would take shape, because he wanted to sleep in.\n\nMalik auditioned with Mario’s “Let Me Love You” only to be eliminated during the show’s boot camp stage -- he seemed nervous, initially refusing to do choreography. But X Factor creator/judge Simon Cowell paired him with four other washouts who didn’t much care for dancing either -- Styles, Payne, Niall Horan and Louis Tomlinson -- creating a sort of ’N Sync spliced with pub-band DNA.\n\nZayn Malik Says One Direction's Music Was 'Generic As F***,' Simon Cowell Calls Him 'Rude'\n\nOne Direction finished third, but its obvious talent and puckish chemistry paid dividends. Its 2011 album Up All Night was the first debut by a British band to bow at No. 1 on the Billboard 200. The act has made an LP a year since and toured aggressively in between -- in June, Forbes put the group’s annual earnings at $130 million. In 2015, Cowell admitted that the group was “100 percent overworked.” Stennett calls her client’s old job “grueling” and compares it to being in the army. As Malik himself says, “It was like a f---ing machine going constantly.”\n\n“We weren’t allowed to say certain things, or word [lyrics] the way we would want to,\" says Malik. “I’d sit and wonder, ‘If the fans knew how it worked, what would they think?’ My argument was: People are more intelligent than that. They want to hear what’s real, so why don’t we write some stuff that we’re actually going through?”\n\nWhat’s unique about Malik’s fame, even in the context of 1D’s rabid following, is that Malik is Muslim in an increasingly hostile Western culture. He declines to discuss his faith, and it’s easy to understand why. When he tweeted “#FreePalestine” in 2014, he was bombarded with hate and at least one death threat. Web trolls suggest vile conspiracy theories, like the infamous “Boy Band Jihad” essay by extreme right-wing pundit Debbie Schlussel. He even has been broadsided by left-leaning institutions like The Huffington Post (which illustrated a tweet about ISIS and Western culture using his photo) and Bill Maher (who compared him, in a joke, to one of the Boston bombers).\n\nMalik may “feel a lot for his heritage,” says Fariha Roisin, author of a recent Matter article about Malik’s bicultural status. “But he isn’t defined by his otherness and hasn’t whitewashed himself, either. Islamophobia affects the way we view ourselves -- there’s a fear of being open about who you are. He has experienced persecution whenever he has said anything political, so what do you do in that situation? You remove yourself.” After four years of being the person of color in 1D -- where, he has acknowledged, the dark and mysterious role was partly foisted upon him -- Malik seems content to do as he pleases and let people make of that what they will. If he has a life strategy these days, he says, it’s “just trust your instincts, and keep your friends close.”\n\nIn September 2015, Malik moved to Los Angeles, where “there’s not a lot of negative energy going around.” Before he did anything else with his Bel Air “bungalow,” he began recording in the unfurnished rooms -- “with the sliding-glass doors open and the microphone in the backyard, underneath the stars,” recalls Malay. And then he started decorating. “I like to graffiti my house,” says Malik. “The garden goes up three stories into the mountain. There are these walls that look white from one side, but when you walk up the stairs, the inside is all graffiti. I painted ‘Fresh Prince’ on one.”\n\nAt home, he likes to cook the way his mother taught him. “I have about six of her signature dishes down, and I’ll pull them out for the ladies when I need to.” Malik has been spotted with model Gigi Hadid, and while he maintained in November that they’re “just good friends,” by late December they had posted a selfie of themselves snuggling. He knows what he’s looking for in a relationship: “I need a challenge. Also, I like girls that are a bit chunky in certain areas -- the nice areas. I like a fuller woman. I enjoy an intellectual conversation as well, where someone can construct a sentence beyond what hair and makeup they’re wearing, and talk about something political or about the world. I like an opinion.”\n\nFor all the female attention he absorbs and brooding sensitivity he projects, Malik remains, in many ways, an average bro. At one point, I say, “I’m sure your fans tell you stories. Have you learned anything from the girls who admire you about the challenges they face particular to women?” Not really, it turns out. From his vantage, the mechanics of fame are simple: “I was raised by a lot of women, so there’s nothing any fan girl could’ve ever taught me about any woman,” he says. “I fully understood every person who’d come and see the band, because I have crazy aunties and crazy sisters who would fan-girl over actors. If people can’t have something, they want it.”\n\nStill, Malik has a new gratitude for his fans, and more patience when it comes to stuff like posing for photos. “It’s a bit different now because they’re there for just me,” he says. “I can’t jump in a car and be like, ‘Yeah! Just take a picture with one of them boys.’ I want to do it now.”\n\nIn general, Malik is thankful for the newfound control over his life. He might eventually install “an obstacle course or skate park” at his house (he once fell off a ramp skateboarding with Justin Bieber and broke his ankle). But for now, “I base the day around whatever I’m feeling at that point,” he says. Back at his English country home, “I might write. I might paint. I might have a barbecue. I might chill in the tepee.” A good day in Los Angeles starts with guerrilla home decor -- “I’m doing a collage wall with Polaroids, drawings, paintings and all kinds of crazy stuff” -- and includes some casual dining (he names Fat Sal’s, the Hollywood deli co-owned by Jerry Ferrara, Entourage’s Turtle) and ends up in the smoky room where he now sits, lit by red string lights and glowing monitors.\n\n“I’ll come down here and record maybe seven songs a night,” he says from the far side of a mixing board, eyes getting more slit-like as the night progresses. “That’s because I’m enjoying what I’m doing. I’m not censoring myself anymore, so I’m not tired. I love it.” When he gets frustrated or angry, he hits the studio instead of a punching bag or doing “some bullshit where I’m drunk, tagging ‘F--- this life’ on a wall” (as he did at home in England). He even smokes pot with a degree of ambition -- Malik only burns sativa (the more energizing, cerebral strain of marijuana), because it’s “creative weed.”\n\nZayn Malik Isn't Trying to Top One Direction With New Music: 'I Don't Need You to Buy It on a Mass Scale'\n\nWhen it comes to Made in the A.M., the fifth and perhaps final 1D album, recorded without him and released about two weeks before our talk, Malik admits he hasn’t even heard it. “Nah,” he says. “I’ll be honest. I thought the first single was quite cool. I heard the second single and” -- he screws up his face -- “yeah, I didn’t buy the album.”\n\nAsked what he accomplished as a member of the group, and he offers an inscrutable, possibly ironic answer: “Status. The capability to restrain certain things I would want to do. I also learned it’s good to keep friends. Because you don’t know when you’re going to make new ones, so you should probably just keep the old ones.”\n\nMalik is much clearer on what he has discovered about himself since going solo: “I’m incredibly disciplined. I realized I can push myself through situations I might not necessarily want to do, but can overcome by being in the moment. No matter what, I can smile and do whatever I got to do.” And then he does smile, flashing a small, not entirely un-boy-band-like grin.\n\nThis is an updated version of the cover story that originally appeared in the Jan. 16 issue of Billboard.", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/media/zayn-malik-bb1-2016-billboard-01-650-compressed.jpg", "https://static.billboard.com/files/media/zayn-malik-cover-bb1-2016-billboard-1500.jpg", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?5483f7d85ab28d1d2c44"], "top_img": "https://static.billboard.com/files/media/zayn-malik-bb1-2016-billboard-01-650-compressed.jpg", "keywords": [], "authors": ["Chris Martins"], "canonical_link": "https://www.billboard.com/articles/news/cover-story/6835305/zayn-malik-solo-career-one-direction-new-music", "title": "Zayn Malik Speaks Out in Revealing Billboard Cover Story: 'I'm Not Censoring Myself Anymore'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2016-01-27T18:53:44-05:00", "published_time": "2016-01-07T09:06:00-05:00"}, "description": "In 2015, Zayn Malik abruptly quit One Direction, broke off a fairy-tale pop-star engagement and overdid the hair dye. Now, as he wraps up his long-simmering creative statement, the boy band outlier aims to prove that he has been his own man all along.", "og": {"description": "In 2015, Zayn Malik abruptly quit One Direction, broke off a fairy-tale pop-star engagement and overdid the hair dye. Now, as he wraps up his long-simmering creative statement, the boy band outlier aims to prove that he has been his own man all along.", "image": {"identifier": "https://static.billboard.com/files/media/zayn-malik-bb1-2016-billboard-01-650-compressed.jpg", "height": 430, "width": 650}, "title": "Zayn Malik on Going Solo, One Direction and Not Censoring Himself | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/cover-story/6835305/zayn-malik-solo-career-one-direction-new-music", "site_name": "Billboard"}, "title": "Zayn Malik Speaks Out in Revealing Billboard Cover Story: 'I'm Not Censoring Myself Anymore'", "twitter": {"card": "summary_large_image", "description": "In 2015, Zayn Malik abruptly quit One Direction, broke off a fairy-tale pop-star engagement and overdid the hair dye. Now, as he wraps up his long-simmering creative statement, the boy band outlier aims to prove that he has been his own man all along.", "image": "https://static.billboard.com/files/media/zayn-malik-bb1-2016-billboard-01-650-compressed.jpg", "title": "Zayn Malik Speaks Out in Revealing Billboard Cover Story: 'I'm Not Censoring Myself Anymore'", "site": "@billboard"}}, "movies": [], "publish_date": 1452175560.0, "source": "https://www.billboard.com", "summary": ""}