{"url": "https://www.thesun.co.uk/tvandshowbiz/3588956/devastated-nick-and-aaron-carter-ask-for-privacy-to-grieve-after-their-father-robert-dies-suddenly-aged-65/", "text": "BACKSTREET Boys star Nick Carter and his brother Aaron have been left devastated after their dad Robert died on Tuesday.\n\nThe 37-year-old boy-bander admitted in 2015 he had been estranged from parents Bob and Jane for close to a decade, but still shared his sadness at his dad's sudden passing.\n\n6 Aaron Carter shared a touching tribute to his dad on Twitter Credit: TWITTER\n\n6 The singer later followed up with another favourite photo on his Instagram account Credit: Instagram\n\nHe tweeted: \"I am heartbroken to share the news that our father, Robert, passed away last night.\n\n\"While we learn more about the cause of death, and begin the grieving process, we ask that our privacy be respected at this difficult time.\"\n\nAaron, 29, had a much better relationship with his parents, and paid two touching tributes to his dad on social media.\n\nAlong with a photo of him with 65-year-old Bob, Aaron Tweeted: \"My heart is Completly (sic) shattered I'm in shock and I loved my dad so much. DADDY I Love You. This is the last pic I have my dad.\"\n\n6 Nick Carter has been estranged from his parents for many years but still paid tribute Credit: Twitter\n\nAaron then followed up with an Instagram post that read: \"My heart is broken, We are so hurt we lost you poppa way too soon. You were never human to me, you were always my real life super hero.\"\n\nTMZ report that sources close to Robert believe he suffered a heart attack, and that he had \"complained of chest pains and had twitching in his arm before he went to bed and never woke up\".\n\n6 Aaron claims that this is the last photo of him with Robert, who has died age 65 Credit: TWITTER\n\nThe site reports: \"We're told he was working a lot around the house and was out in the hot Florida sun when the chest pains started.\"\n\nNick made the admission about the poor relationship between him and his parents in the 2015 Backstreets Boy documentary Show 'Em What You're Made Of.\n\nHe said \"I haven't seen them in maybe seven or eight years.\"\n\nIt is not known what triggered their feud, but Nick has painted a picture of a very scary childhood in previous interviews and his autobiography.\n\nHe continued: \"It was a house full of fear for me. We would be little kids and we would hear mom and dad screaming at each other.\n\nMOST READ IN TV & SHOWBIZ GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre MAN'S BEST FRIEND Paul O'Grady reveals new puppy Nancy after announcing death of older dog TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent\n\n\"They'd constantly be drinking and fighting and we'd hear guns go out the window shooting. Not shooting at each other.\n\n\"They always fought over money.\"\n\nHe also told Dr. Phil that finding fame at a young age and being the family breadwinner caused friction.\n\nNick explained: \"It was just the way my household was with my father: he was a dominating personality.\n\n\"He led by fear... I believe you should lead with love.\n\n6 Aaron with dad Robert and mum Jane when he was a teen pop star Credit: Getty Images\n\n\"I always had a lot of pressure when it came to my siblings. I became the father... I was making more money that my father did at the age of 14 or 15. I became the provider.\"\n\nNick and Aaron have three sisters, Angel, Bobbie and Leslie - who died from a suspected drugs overdose in 2012.\n\nNick refused to attend the 25-year-old's funeral, claiming at the time that his family \"complicates\" things, and later admitting that his family blamed her for his death.\n\n6 Nick on stage with the Backstreet Boys Credit: AP:Associated Press\n\nIt is not known if Aaron is still estranged from his mum after he accused her of stealing from him when he was a teen star in a bombshell 2005 interview.\n\nSpeaking to US show 20/20 he said: \"Every show we did, we would probably make about maybe $40,000, $50,000 a show. And it was all gone.\"\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.8 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2017/05/af-composite-carter.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/05/af-composite-carter.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Emma Gritt"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/3588956/devastated-nick-and-aaron-carter-ask-for-privacy-to-grieve-after-their-father-robert-dies-suddenly-aged-65/", "title": "Devastated Nick and Aaron Carter ask for privacy to grieve after their father Robert dies suddenly aged 65", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Devastated Nick and Aaron Carter ask for privacy to grieve after their dad Robert dies", "url": "https://www.thesun.co.uk/tvandshowbiz/3588956/devastated-nick-and-aaron-carter-ask-for-privacy-to-grieve-after-their-father-robert-dies-suddenly-aged-65/", "description": "BACKSTREET Boys star Nick Carter and his brother Aaron have been left devastated after their dad Robert died on Tuesday. The 37-year-old boy-bander admitted in 2015 he had been estranged from paren…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/05/af-composite-carter.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Nick on stage with the Backstreet Boys"}, "locale": "en_GB"}, "article": {"published_time": "2017-05-18T00:06:32+00:00", "modified_time": "2017-07-16T14:10:42+00:00", "publisher": 161385360554578, "tag": "Aaron Carter", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Backstreet Boys star hasn't spoken to his parents for nearly ten years", "twitter": {"text": {"title": "Devastated Nick and Aaron Carter ask for privacy to grieve after their father Robert dies suddenly aged 65"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "I LOVE YOU DADDY", "headline": "Devastated Backstreet Boys star Nick Carter and bro Aaron ask for privacy as dad dies suddenly at 65", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/05/af-composite-carter.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/05/af-composite-carter.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 3588956, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1495065992.0, "source": "https://www.thesun.co.uk", "summary": ""}