{"url": "https://web.archive.org/web/20100201043706/http://www.whitehouse.gov:80/the-press-office/remarks-president-gop-house-issues-conference", "text": "The White House Office of the Press Secretary\n\nRemarks by the President at GOP House Issues Conference\n\nRenaissance Baltimore Harborplace Hotel, Baltimore, Maryland\n\n12:10 P.M. EST\n\nTHE PRESIDENT: Thank you. Thank you very much. Thank you. Please, everybody be seated. Thank you. Thank you, John, for the gracious introduction. To Mike and Eric, thank you for hosting me. Thank you to all of you for receiving me. It is wonderful to be here. I want to also acknowledge Mark Strand, president of the Congressional Institute. To all the family members who are here and who have to put up with us for an elective office each and every day, thank you, because I know that's tough. (Applause.)\n\nI very much am appreciative of not only the tone of your introduction, John, but also the invitation that you extended to me. You know what they say, \"Keep your friends close, but visit the Republican Caucus every few months.\" (Laughter.)\n\nPart of the reason I accepted your invitation to come here was because I wanted to speak with all of you, and not just to all of you. So I'm looking forward to taking your questions and having a real conversation in a few moments. And I hope that the conversation we begin here doesn't end here; that we can continue our dialogue in the days ahead. It's important to me that we do so. It's important to you, I think, that we do so. But most importantly, it's important to the American people that we do so.\n\nI've said this before, but I'm a big believer not just in the value of a loyal opposition, but in its necessity. Having differences of opinion, having a real debate about matters of domestic policy and national security -- and that's not something that's only good for our country, it's absolutely essential. It's only through the process of disagreement and debate that bad ideas get tossed out and good ideas get refined and made better. And that kind of vigorous back and forth -- that imperfect but well-founded process, messy as it often is -- is at the heart of our democracy. That's what makes us the greatest nation in the world.\n\nSo, yes, I want you to challenge my ideas, and I guarantee you that after reading this I may challenge a few of yours. (Laughter.) I want you to stand up for your beliefs, and knowing this caucus, I have no doubt that you will. I want us to have a constructive debate. The only thing I don't want -- and here I am listening to the American people, and I think they don't want either -- is for Washington to continue being so Washington-like. I know folks, when we're in town there, spend a lot of time reading the polls and looking at focus groups and interpreting which party has the upper hand in November and in 2012 and so on and so on and so on. That's their obsession.\n\nAnd I'm not a pundit. I'm just a President, so take it for what it's worth. But I don't believe that the American people want us to focus on our job security. They want us to focus on their job security. (Applause.) I don't think they want more gridlock. I don't think they want more partisanship. I don't think they want more obstruction. They didn't send us to Washington to fight each other in some sort of political steel-cage match to see who comes out alive. That's not what they want. They sent us to Washington to work together, to get things done, and to solve the problems that they're grappling with every single day.\n\nAnd I think your constituents would want to know that despite the fact it doesn't get a lot of attention, you and I have actually worked together on a number of occasions. There have been times where we've acted in a bipartisan fashion. And I want to thank you and your Democratic colleagues for reaching across the aisle. There has been, for example, broad support for putting in the troops necessary in Afghanistan to deny al Qaeda safe haven, to break the Taliban's momentum, and to train Afghan security forces. There's been broad support for disrupting, dismantling, and defeating al Qaeda. And I know that we're all united in our admiration of our troops. (Applause.)\n\nSo it may be useful for the international audience right now to understand -- and certainly for our enemies to have no doubt -- whatever divisions and differences may exist in Washington, the United States of America stands as one to defend our country. (Applause.)\n\nIt's that same spirit of bipartisanship that made it possible for me to sign a defense contracting reform bill that was cosponsored by Senator McCain and members of Congress here today. We've stood together on behalf of our nation's veterans. Together we passed the largest increase in the VA's budget in more than 30 years and supported essential veterans' health care reforms to provide better access and medical care for those who serve in uniform.\n\nSome of you also joined Democrats in supporting a Credit Card Bill of Rights and in extending unemployment compensation to Americans who are out of work. Some of you joined us in stopping tobacco companies from targeting kids, expanding opportunities for young people to serve our country, and helping responsible homeowners stay in their homes.\n\nSo we have a track record of working together. It is possible. But, as John, you mentioned, on some very big things, we've seen party-line votes that, I'm just going to be honest, were disappointing. Let's start with our efforts to jumpstart the economy last winter, when we were losing 700,000 jobs a month. Our financial system teetered on the brink of collapse and the threat of a second Great Depression loomed large. I didn't understand then, and I still don't understand, why we got opposition in this caucus for almost $300 billion in badly needed tax cuts for the American people, or COBRA coverage to help Americans who've lost jobs in this recession to keep the health insurance that they desperately needed, or opposition to putting Americans to work laying broadband and rebuilding roads and bridges and breaking ground on new construction projects.\n\nThere was an interesting headline in CNN today: \"Americans disapprove of stimulus, but like every policy in it.\" And there was a poll that showed that if you broke it down into its component parts, 80 percent approved of the tax cuts, 80 percent approved of the infrastructure, 80 percent approved of the assistance to the unemployed.\n\nWell, that's what the Recovery Act was. And let's face it, some of you have been at the ribbon-cuttings for some of these important projects in your communities. Now, I understand some of you had some philosophical differences perhaps on the just the concept of government spending, but, as I recall, opposition was declared before we had a chance to actually meet and exchange ideas. And I saw that as a missed opportunity.\n\nNow, I am happy to report this morning that we saw another sign that our economy is moving in the right direction. The latest GDP numbers show that our economy is growing by almost 6 percent -- that's the most since 2003. To put that in perspective, this time last year, we weren't seeing positive job growth; we were seeing the economy shrink by about 6 percent.\n\nSo you've seen a 12 percent reversal during the course of this year. This turnaround is the biggest in nearly three decades -- and it didn't happen by accident. It happened -- as economists, conservative and liberal, will attest -- because of some of the steps that we took.\n\nAnd by the way, you mentioned a Web site out here, John -- if you want to look at what's going on, on the Recovery Act, you can look on recovery.gov -- a Web site, by the way, that was Eric Cantor's idea.\n\nNow, here's the point. These are serious times, and what's required by all of us -- Democrats and Republicans -- is to do what's right for our country, even if it's not always what's best for our politics. I know it may be heresy to say this, but there are things more important than good poll numbers. And on this no one can accuse me of not living by my principles. (Laughter.) A middle class that's back on its feet, an economy that lifts everybody up, an America that's ascendant in the world -- that's more important than winning an election. Our future shouldn't be shaped by what's best for our politics; our politics should be shaped by what's best for our future.\n\nBut no matter what's happened in the past, the important thing for all of us is to move forward together. We have some issues right in front of us on which I believe we should agree, because as successful as we've been in spurring new economic growth, everybody understands that job growth has been lagging. Some of that's predictable. Every economist will say jobs are a lagging indicator, but that's no consolation for the folks who are out there suffering right now. And since 7 million Americans have lost their jobs in this recession, we've got to do everything we can to accelerate it.\n\nSo, today, in line with what I stated at the State of the Union, I've proposed a new jobs tax credit for small business. And here's how it would work. Employers would get a tax credit of up to $5,000 for every employee they add in 2010. They'd get a tax break for increases in wages, as well. So, if you raise wages for employees making under $100,000, we'd refund part of your payroll tax for every dollar you increase those wages faster than inflation. It's a simple concept. It's easy to understand. It would cut taxes for more than 1 million small businesses.\n\nSo I hope you join me. Let's get this done. I want to eliminate the capital gains tax for small business investment, and take some of the bailout money the Wall Street banks have returned and use it to help community banks start lending to small businesses again. So join me. I am confident that we can do this together for the American people. And there's nothing in that proposal that runs contrary to the ideological predispositions of this caucus. The question is: What's going to keep us from getting this done?\n\nI've proposed a modest fee on the nation's largest banks and financial institutions to fully recover for taxpayers' money that they provided to the financial sector when it was teetering on the brink of collapse. And it's designed to discourage them from taking reckless risks in the future. If you listen to the American people, John, they'll tell you they want their money back. Let's do this together, Republicans and Democrats.\n\nI propose that we close tax loopholes that reward companies for shipping American jobs overseas, and instead give companies greater incentive to create jobs right here at home -- right here at home. Surely, that's something that we can do together, Republicans and Democrats.\n\nWe know that we've got a major fiscal challenge in reining in deficits that have been growing for a decade, and threaten our future. That's why I've proposed a three-year freeze in discretionary spending other than what we need for national security. That's something we should do together that's consistent with a lot of the talk both in Democratic caucuses and Republican caucuses. We can't blink when it's time to actually do the job.\n\nAt this point, we know that the budget surpluses of the '90s occurred in part because of the pay-as-you-go law, which said that, well, you should pay as you go and live within our means, just like families do every day. Twenty-four of you voted for that, and I appreciate it. And we were able to pass it in the Senate yesterday.\n\nBut the idea of a bipartisan fiscal commission to confront the deficits in the long term died in the Senate the other day. So I'm going to establish such a commission by executive order and I hope that you participate, fully and genuinely, in that effort, because if we're going to actually deal with our deficit and debt, everybody here knows that we're going to have to do it together, Republican and Democrat. No single party is going to make the tough choices involved on its own. It's going to require all of us doing what's right for the American people.\n\nAnd as I said in the State of the Union speech, there's not just a deficit of dollars in Washington, there is a deficit of trust. So I hope you'll support my proposal to make all congressional earmarks public before they come to a vote. And let's require lobbyists who exercise such influence to publicly disclose all their contacts on behalf of their clients, whether they are contacts with my administration or contacts with Congress. Let's do the people's business in the bright light of day, together, Republicans and Democrats.\n\nI know how bitter and contentious the issue of health insurance reform has become. And I will eagerly look at the ideas and better solutions on the health care front. If anyone here truly believes our health insurance system is working well for people, I respect your right to say so, but I just don't agree. And neither would millions of Americans with preexisting conditions who can't get coverage today or find out that they lose their insurance just as they're getting seriously ill. That's exactly when you need insurance. And for too many people, they're not getting it. I don't think a system is working when small businesses are gouged and 15,000 Americans are losing coverage every single day; when premiums have doubled and out-of-pocket costs have exploded and they're poised to do so again.\n\nI mean, to be fair, the status quo is working for the insurance industry, but it's not working for the American people. It's not working for our federal budget. It needs to change.\n\nThis is a big problem, and all of us are called on to solve it. And that's why, from the start, I sought out and supported ideas from Republicans. I even talked about an issue that has been a holy grail for a lot of you, which was tort reform, and said that I'd be willing to work together as part of a comprehensive package to deal with it. I just didn't get a lot of nibbles.\n\nCreating a high-risk pool for uninsured folks with preexisting conditions, that wasn't my idea, it was Senator McCain's. And I supported it, and it got incorporated into our approach. Allowing insurance companies to sell coverage across state lines to add choice and competition and bring down costs for businesses and consumers -- that's an idea that some of you I suspect included in this better solutions; that's an idea that was incorporated into our package. And I support it, provided that we do it hand in hand with broader reforms that protect benefits and protect patients and protect the American people.\n\nA number of you have suggested creating pools where self-employed and small businesses could buy insurance. That was a good idea. I embraced it. Some of you supported efforts to provide insurance to children and let kids remain covered on their parents' insurance until they're 25 or 26. I supported that. That's part of our package. I supported a number of other ideas, from incentivizing wellness to creating an affordable catastrophic insurance option for young people that came from Republicans like Mike Enzi and Olympia Snowe in the Senate, and I'm sure from some of you as well. So when you say I ought to be willing to accept Republican ideas on health care, let's be clear: I have.\n\nBipartisanship -- not for its own sake but to solve problems -- that's what our constituents, the American people, need from us right now. All of us then have a choice to make. We have to choose whether we're going to be politicians first or partners for progress; whether we're going to put success at the polls ahead of the lasting success we can achieve together for America. Just think about it for a while. We don't have to put it up for a vote today.\n\nLet me close by saying this. I was not elected by Democrats or Republicans, but by the American people. That's especially true because the fastest growing group of Americans are independents. That should tell us both something. I'm ready and eager to work with anyone who is willing to proceed in a spirit of goodwill. But understand, if we can't break free from partisan gridlock, if we can't move past a politics of \"no,\" if resistance supplants constructive debate, I still have to meet my responsibilities as President. I've got to act for the greater good –- because that, too, is a commitment that I have made. And that's -- that, too, is what the American people sent me to Washington to do.\n\nSo I am optimistic. I know many of you individually. And the irony, I think, of our political climate right now is that, compared to other countries, the differences between the two major parties on most issues is not as big as it's represented. But we've gotten caught up in the political game in a way that's just not healthy. It's dividing our country in ways that are preventing us from meeting the challenges of the 21st century. I'm hopeful that the conversation we have today can help reverse that.\n\nSo thank you very much. Thank you, John. (Applause.) Now I'd like to open it up for questions.\n\nCONGRESSMAN PENCE: The President has agreed to take questions and members would be encouraged to raise your hand while you remain in your seat. (Laughter.) The chair will take the prerogative to make the first remarks.\n\nMr. President, welcome back to the House Republican Conference.\n\nTHE PRESIDENT: Thank you.\n\nCONGRESSMAN PENCE: [Off microphone.] We are pleased to have you return. (Inaudible) a year ago -- House Republicans said then we would make you two promises. Number one, that most of the people in this room and their families would pray for you and your beautiful family just about every day for the next four years. And I want to assure you we're keeping that promise.\n\nTHE PRESIDENT: I appreciate that.\n\nCONGRESSMAN PENCE: [off microphone] Number two, our pledge to you, Mr. President, was that door is always open. And we hope the (inaudible) of our invitation that we (inaudible).\n\nMr. President, several of us in this conference yesterday on the way into Baltimore stopped by the Salvation Army homeless facility here in Baltimore. I met a little boy, an African American boy, in the 8th grade, named David Carter, Jr. When he heard that I would be seeing you today his eyes lit up like I had never seen. And I told him that if he wrote you a letter I'd give it to you, and I have.\n\nBut I had a conversation with little David, Jr. and David, Sr. His family has been struggling with the economy.\n\n[On microphone.] His dad said words to me, Mr. President, that I'll never forget. About my age and he said -- he said, Congressman, it's not like it was when we were coming up. He said, there's just no jobs.\n\nNow, last year about the time you met with us, unemployment was 7.5 percent in this country. Your administration, and your party in Congress, told us that we'd have to borrow more than $700 billion to pay for a so-called stimulus bill. It was a piecemeal list of projects and boutique tax cuts, all of which was -- we were told -- had to be passed or unemployment would go to 8 percent, as your administration said. Well, unemployment is 10 percent now, as you well know, Mr. President; here in Baltimore it's considerably higher.\n\nNow, Republicans offered a stimulus bill at the same time. It cost half as much as the Democratic proposal in Congress, and using your economic analyst models, it would have created twice the jobs at half the cost. It essentially was across-the-board tax relief, Mr. President.\n\nNow we know you've come to Baltimore today and you've raised this tax credit, which was last promoted by President Jimmy Carter. But the first question I would pose to you, very respectfully, Mr. President, is would you be willing to consider embracing -- in the name of little David Carter, Jr. and his dad, in the name of every struggling family in this country -- the kind of across-the-board tax relief that Republicans have advocated, that President Kennedy advocated, that President Reagan advocated and that has always been the means of stimulating broad-based economic growth?\n\nTHE PRESIDENT: Well, there was a lot packed into that question. (Laughter.) First of all, let me say I already promised that I'll be writing back to that young man and his family, and I appreciate you passing on the letter.\n\nQ Thank you.\n\nTHE PRESIDENT: But let's talk about just the jobs environment generally. You're absolutely right that when I was sworn in the hope was that unemployment would remain around 8 [percent], or in the 8 percent range. That was just based on the estimates made by both conservative and liberal economists, because at that point not all the data had trickled in.\n\nWe had lost 650,000 jobs in December. I'm assuming you're not faulting my policies for that. We had lost, it turns out, 700,000 jobs in January, the month I was sworn in. I'm assuming it wasn't my administration's policies that accounted for that. We lost another 650,000 jobs the subsequent month, before any of my policies had gone into effect. So I'm assuming that wasn't as a consequence of our policies; that doesn't reflect the failure of the Recovery Act. The point being that what ended up happening was that the job losses from this recession proved to be much more severe -- in the first quarter of last year going into the second quarter of last year -- than anybody anticipated.\n\nSo I mean, I think we can score political points on the basis of the fact that we underestimated how severe the job losses were going to be. But those job losses took place before any stimulus, whether it was the ones that you guys have proposed or the ones that we proposed, could have ever taken into effect. Now, that's just the fact, Mike, and I don't think anybody would dispute that. You could not find an economist who would dispute that.\n\nNow, at the same time, as I mentioned, most economists -- Republican and Democrat, liberal and conservative -- would say that had it not been for the stimulus package that we passed, things would be much worse. Now, they didn't fill a 7 million hole in the number of people who were unemployed. They probably account for about 2 million, which means we still have 5 million folks in there that we've still got to deal with. That's a lot of people.\n\nThe package that we put together at the beginning of the year, the truth is, should have reflected -- and I believe reflected what most of you would say are common sense things. This notion that this was a radical package is just not true. A third of them were tax cuts, and they weren't -- when you say they were \"boutique\" tax cuts, Mike, 95 percent of working Americans got tax cuts, small businesses got tax cuts, large businesses got help in terms of their depreciation schedules. I mean, it was a pretty conventional list of tax cuts. A third of it was stabilizing state budgets.\n\nThere is not a single person in here who, had it not been for what was in the stimulus package, wouldn't be going home to more teachers laid off, more firefighters laid off, more cops laid off. A big chunk of it was unemployment insurance and COBRA, just making sure that people had some floor beneath them, and, by the way, making sure that there was enough money in their pockets that businesses had some customers.\n\nYou take those two things out, that accounts for the majority of the stimulus package. Are there people in this room who think that was a bad idea? A portion of it was dealing with the AMT, the alternative minimum tax -- not a proposal of mine; that's not a consequence of my policies that we have a tax system where we keep on putting off a potential tax hike that is embedded in the budget that we have to fix each year. That cost about $70 billion.\n\nAnd then the last portion of it was infrastructure which, as I said, a lot of you have gone to appear at ribbon-cuttings for the same projects that you voted against.\n\nNow, I say all this not to re-litigate the past, but it's simply to state that the component parts of the Recovery Act are consistent with what many of you say are important things to do -- rebuilding our infrastructure, tax cuts for families and businesses, and making sure that we were providing states and individuals some support when the roof was caving in.\n\nAnd the notion that I would somehow resist doing something that cost half as much but would produce twice as many jobs -- why would I resist that? I wouldn't. I mean, that's my point, is that -- I am not an ideologue. I'm not. It doesn't make sense if somebody could tell me you could do this cheaper and get increased results that I wouldn't say, great. The problem is, I couldn't find credible economists who would back up the claims that you just made.\n\nNow, we can -- here's what I know going forward, though. I mean, we're talking -- we were talking about the past. We can talk about this going forward. I have looked at every idea out there in terms of accelerating job growth to match the economic growth that's already taken place. The jobs credit that I'm discussing right now is one that a lot of people think would be the most cost-effective way for encouraging people to pick up their hiring.\n\nThere may be other ideas that you guys have; I am happy to look at them and I'm happy to embrace them. I suspect I will embrace some of them. Some of them I've already embraced.\n\nBut the question I think we're going to have to ask ourselves is, as we move forward, are we going to be examining each of these issues based on what's good for the country, what the evidence tells us, or are we going to be trying to position ourselves so that come November we're able to say, \"The other party, it's their fault.\" If we take the latter approach then we're probably not going to get much agreement. If we take the former, I suspect there's going to be a lot of overlap. All right?\n\nQ Mr. President, will you consider supporting across-the-board tax relief, as President Kennedy did?\n\nTHE PRESIDENT: Here's what I'm going to do, Mike. What I'm going to do is I'm going to take a look at what you guys are proposing. And the reason I say this, before you say, \"Okay,\" I think is important to know -- what you may consider across-the-board tax cuts could be, for example, greater tax cuts for people who are making a billion dollars. I may not agree to a tax cut for Warren Buffet. You may be calling for an across-the-board tax cut for the banking industry right now. I may not agree to that.\n\nSo I think that we've got to look at what specific proposals you're putting forward, and -- this is the last point I'll make -- if you're calling for just across-the-board tax cuts, and then on the other hand saying that we're somehow going to balance our budget, I'm going to want to take a look at your math and see how that works, because the issue of deficit and debt is another area where there has been a tendency for some inconsistent statements. How's that? All right?\n\nCONGRESSMAN RYAN: Thank you. Mr. President, first off, thanks for agreeing to accept our invitation here. It is a real pleasure and honor to have you with us here today.\n\nTHE PRESIDENT: Good to see you. Is this your crew right here, by the way?\n\nCONGRESSMAN RYAN: It is. This is my daughter Liza, my son Charlie and Sam, and this is my wife Janna.\n\n\n\nTHE PRESIDENT: Hey, guys.\n\nCONGRESSMAN RYAN: Say hi, everybody. (Laughter.) I serve as a ranking member of the budget committee, so I'm going to talk a little budget if you don't mind. The spending bills that you've signed into law, the domestic discretionary spending has been increased by 84 percent. You now want to freeze spending at this elevated beginning next year. This means that total spending in your budget would grow at 3/100ths of 1 percent less than otherwise. I would simply submit that we could do more and start now.\n\nYou've also said that you want to take a scalpel to the budget and go through it line by line. We want to give you that scalpel. I have a proposal with my home state senator, Russ Feingold, bipartisan proposal, to create a constitutional version of the line-item veto. (Applause.) Problem is, we can't even get a vote on the proposal.\n\nSo my question is, why not start freezing spending now, and would you support a line-item veto in helping us get a vote on it in the House?\n\nTHE PRESIDENT: Let me respond to the two specific questions, but I want to just push back a little bit on the underlying premise about us increasing spending by 84 percent.\n\nNow, look, I talked to Peter Orszag right before I came here, because I suspected I'd be hearing this -- I'd be hearing this argument. The fact of the matter is, is that most of the increases in this year's budget, this past year's budget, were not as a consequence of policies that we initiated but instead were built in as a consequence of the automatic stabilizers that kick in because of this enormous recession.\n\nSo the increase in the budget for this past year was actually predicted before I was even sworn into office and had initiated any policies. Whoever was in there, Paul -- and I don't think you'll dispute that -- whoever was in there would have seen those same increases because of, on the one hand, huge drops in revenue, but at the same time people were hurting and needed help. And a lot of these things happened automatically.\n\nNow, the reason that I'm not proposing the discretionary freeze take into effect this year -- we prepared a budget for 2010, it's now going forward -- is, again, I am just listening to the consensus among people who know the economy best. And what they will say is that if you either increase taxes or significantly lowered spending when the economy remains somewhat fragile, that that would have a destimulative effect and potentially you'd see a lot of folks losing business, more folks potentially losing jobs. That would be a mistake when the economy has not fully taken off. That's why I've proposed to do it for the next fiscal year. So that's point number two.\n\nWith respect to the line-item veto, I actually -- I think there's not a President out there that wouldn't love to have it. And I think that this is an area where we can have a serious conversation. I know it is a bipartisan proposal by you and Russ Feingold. I don't like being held up with big bills that have stuff in them that are wasteful but I've got to sign because it's a defense authorization bill and I've got to make sure that our troops are getting the funding that they need.\n\nI will tell you, I would love for Congress itself to show discipline on both sides of the aisle. I think one thing that you have to acknowledge, Paul, because you study this stuff and take it pretty seriously, that the earmarks problem is not unique to one party and you end up getting a lot of pushback when you start going after specific projects of any one of you in your districts, because wasteful spending is usually spent somehow outside of your district. Have you noticed that? The spending in your district tends to seem pretty sensible.\n\nSo I would love to see more restraint within Congress. I'd like to work on the earmarks reforms that I mentioned in terms of putting earmarks online, because I think sunshine is the best disinfectant. But I am willing to have a serious conversation on the line-item veto issue.\n\nCONGRESSMAN RYAN: I'd like to walk you through that, because we have a version we think is constitutional.\n\nTHE PRESIDENT: Let me take a look at it.\n\nCONGRESSMAN RYAN: I would simply say that automatic stabilizer spending is mandatory spending. The discretionary spending, the bills that Congress signs that you sign into law, that has increased 84 percent.\n\nTHE PRESIDENT: We'll have a longer debate on the budget numbers, all right?\n\nCONGRESSMAN PENCE: Shelley Moore Capito, West Virginia.\n\nCONGRESSWOMAN CAPITO: Thank you, Mr. President, for joining us here today. As you said in the State of the Union address on Wednesday, jobs and the economy are number one. And I think everyone in this room, certainly I, agree with you on that.\n\nI represent the state of West Virginia. We're resource-rich. We have a lot of coal and a lot of natural gas. But our -- my miners and the folks who are working and those who are unemployed are very concerned about some of your policies in these areas: cap and trade, an aggressive EPA, and the looming prospect of higher taxes. In our minds, these are job-killing policies. So I'm asking you if you would be willing to re-look at some of these policies, with a high unemployment and the unsure economy that we have now, to assure West Virginians that you're listening.\n\nTHE PRESIDENT: Look, I listen all the time, including to your governor, who's somebody who I enjoyed working with a lot before the campaign and now that I'm President. And I know that West Virginia struggles with unemployment, and I know how important coal is to West Virginia and a lot of the natural resources there. That's part of the reason why I've said that we need a comprehensive energy policy that sets us up for a long-term future.\n\nFor example, nobody has been a bigger promoter of clean coal technology than I am. Testament to that, I ended up being in a whole bunch of advertisements that you guys saw all the time about investing in ways for us to burn coal more cleanly.\n\nI've said that I'm a promoter of nuclear energy, something that I think over the last three decades has been subject to a lot of partisan wrangling and ideological wrangling. I don't think it makes sense. I think that that has to be part of our energy mix. I've said that I am supportive -- and I said this two nights ago at the State of the Union -- that I am in favor of increased production.\n\nSo if you look at the ideas that this caucus has, again with respect to energy, I'm for a lot of what you said you are for.\n\nThe one thing that I've also said, though, and here we have a serious disagreement and my hope is we can work through these disagreements -- there's going to be an effort on the Senate side to do so on a bipartisan basis -- is that we have to plan for the future.\n\nAnd the future is that clean energy -- cleaner forms of energy are going to be increasingly important, because even if folks are still skeptical in some cases about climate change in our politics and in Congress, the world is not skeptical about it. If we're going to be after some of these big markets, they're going to be looking to see, is the United States the one that's developing clean coal technology? Is the United States developing our natural gas resources in the most effective way? Is the United States the one that is going to lead in electric cars? Because if we're not leading, those other countries are going to be leading.\n\nSo what I want to do is work with West Virginia to figure out how we can seize that future. But to do that, that means there's going to have to be some transition. We can't operate the coal industry in the United States as if we're still in the 1920s or the 1930s or the 1950s. We've got to be thinking what does that industry look like in the next hundred years. And it's going to be different. And that means there's going to be some transition. And that's where I think a well-thought-through policy of incentivizing the new while recognizing that there's going to be a transition process -- and we're not just suddenly putting the old out of business right away -- that has to be something that both Republicans and Democrats should be able to embrace.\n\nCONGRESSMAN PENCE: Jason Chaffetz, Utah.\n\nCONGRESSMAN CHAFFETZ: Thank you, Mr. President. It's truly an honor.\n\nTHE PRESIDENT: Great to be here.\n\nCONGRESSMAN CHAFFETZ: And I appreciate you being here.\n\nI'm one of 22 House freshmen. We didn't create this mess, but we are here to help clean it up. You talked a lot about this deficit of trust. There's some things that have happened that I would appreciate your perspective on, because I can look you in the eye and tell you we have not been obstructionists. Democrats have the House and Senate and the presidency. And when you stood up before the American people multiple times and said you would broadcast the health care debates on C-SPAN, you didn't. And I was disappointed, and I think a lot of Americans were disappointed.\n\nYou said you weren't going to allow lobbyists in the senior-most positions within your administration, and yet you did. I applauded you when you said it -- and disappointed when you didn't.\n\nYou said you'd go line by line through the health care debate -- or through the health care bill. And there were six of us, including Dr. Phil Roe, who sent you a letter and said, \"We would like to take you up on the offer; we'd like to come.\" We never heard a letter, we never got a call. We were never involved in any of those discussions.\n\nAnd when you said in the House of Representatives that you were going to tackle earmarks -- in fact, you didn't want to have any earmarks in any of your bills -- I jumped up out of my seat and applauded you. But it didn't happen.\n\nMore importantly, I want to talk about moving forward, but if we could address --\n\nTHE PRESIDENT: Well, how about --\n\nCONGRESSMAN CHAFFETZ: -- I would certainly appreciate it.\n\nTHE PRESIDENT: That was a long list, so -- (laughter) -- let me respond.\n\nLook, the truth of the matter is that if you look at the health care process -- just over the course of the year -- overwhelmingly the majority of it actually was on C-SPAN, because it was taking place in congressional hearings in which you guys were participating. I mean, how many committees were there that helped to shape this bill? Countless hearings took place.\n\nNow, I kicked it off, by the way, with a meeting with many of you, including your key leadership. What is true, there's no doubt about it, is that once it got through the committee process and there were now a series of meetings taking place all over the Capitol trying to figure out how to get the thing together -- that was a messy process. And I take responsibility for not having structured it in a way where it was all taking place in one place that could be filmed. How to do that logistically would not have been as easy as it sounds, because you're shuttling back and forth between the House, the Senate, different offices, et cetera, different legislators. But I think it's a legitimate criticism. So on that one, I take responsibility.\n\nWith respect to earmarks, we didn't have earmarks in the Recovery Act. We didn't get a lot of credit for it, but there were no earmarks in that. I was confronted at the beginning of my term with an omnibus package that did have a lot of earmarks from Republicans and Democrats, and a lot of people in this chamber. And the question was whether I was going to have a big budget fight, at a time when I was still trying to figure out whether or not the financial system was melting down and we had to make a whole bunch of emergency decisions about the economy. So what I said was let's keep them to a minimum, but I couldn't excise them all.\n\nNow, the challenge I guess I would have for you as a freshman, is what are you doing inside your caucus to make sure that I'm not the only guy who is responsible for this stuff, so that we're working together, because this is going to be a process?\n\nWhen we talk about earmarks, I think all of us are willing to acknowledge that some of them are perfectly defensible, good projects; it's just they haven't gone through the regular appropriations process in the full light of day. So one place to start is to make sure that they are at least transparent, that everybody knows what's there before we move forward.\n\nIn terms of lobbyists, I can stand here unequivocally and say that there has not been an administration who was tougher on making sure that lobbyists weren't participating in the administration than any administration that's come before us.\n\nNow, what we did was, if there were lobbyists who were on boards and commissions that were carryovers and their term hadn't been completed, we didn't kick them off. We simply said that moving forward any time a new slot opens, they're being replaced.\n\nSo we've actually been very consistent in making sure that we are eliminating the impact of lobbyists, day in, day out, on how this administration operates. There have been a handful of waivers where somebody is highly skilled -- for example, a doctor who ran Tobacco-Free Kids technically is a registered lobbyist; on the other end, has more experience than anybody in figuring out how kids don't get hooked on cigarettes.\n\nSo there have been a couple of instances like that, but generally we've been very consistent on that front.\n\nCONGRESSMAN PENCE: Marsha Blackburn, Tennessee.\n\nCONGRESSMAN BLACKBURN: Thank you, Mr. President, and thank you for acknowledging that we have ideas on health care because, indeed, we do have ideas, we have plans, we have over 50 bills, we have lots of amendments that would bring health care ideas to the forefront. We would -- we've got plans to lower cost, to change purchasing models, address medical liability, insurance accountability, chronic and preexisting conditions, and access to affordable care for those with those conditions, insurance portability, expanded access -- but not doing it with creating more government, more bureaucracy, and more cost for the American taxpayer.\n\nAnd we look forward to sharing those ideas with you. We want to work with you on health reform and making certain that we do it in an affordable, cost-effective way that is going to reduce bureaucracy, reduce government interference, and reduce costs to individuals and to taxpayers. And if those good ideas aren't making it to you, maybe it's the House Democrat leadership that is an impediment instead of a conduit.\n\nBut we're concerned also that there are some lessons learned from public option health care plans that maybe are not being heeded. And certainly in my state of Tennessee, we were the test case for public option health care in 1994, and our Democrat government has even cautioned that maybe our experiences there would provide some lessons learned that should be heeded, and would provide guidance for us to go forward. And as you said, what we should be doing is tossing old ideas out, bad ideas out, and moving forward in refining good ideas. And certainly we would welcome that opportunity.\n\nSo my question to you is, when will we look forward to starting anew and sitting down with you to put all of these ideas on the table, to look at these lessons learned, to benefit from that experience, and to produce a product that is going to reduce government interference, reduce cost, and be fair to the American taxpayer? (Applause.)\n\nTHE PRESIDENT: Actually, I've gotten many of your ideas. I've taken a look at them, even before I was handed this. Some of the ideas we have embraced in our package. Some of them are embraced with caveats. So let me give you an example.\n\nI think one of the proposals that has been focused on by the Republicans as a way to reduce costs is allowing insurance companies to sell across state lines. We actually include that as part of our approach. But the caveat is, we've got to do so with some minimum standards, because otherwise what happens is that you could have insurance companies circumvent a whole bunch of state regulations about basic benefits or what have you, making sure that a woman is able to get mammograms as part of preventive care, for example. Part of what could happen is insurance companies could go into states and cherry-pick and just get those who are healthiest and leave behind those who are least healthy, which would raise everybody's premiums who weren't healthy, right?\n\nSo it's not that many of these ideas aren't workable, but we have to refine them to make sure that they don't just end up worsening the situation for folks rather than making it better.\n\nNow, what I said at the State of the Union is what I still believe: If you can show me -- and if I get confirmation from health care experts, people who know the system and how it works, including doctors and nurses -- ways of reducing people's premiums; covering those who do not have insurance; making it more affordable for small businesses; having insurance reforms that ensure people have insurance even when they've got preexisting conditions, that their coverage is not dropped just because they're sick, that young people right out of college or as they're entering in the workforce can still get health insurance -- if those component parts are things that you care about and want to do, I'm game. And I've got -- and I've got a lot of these ideas.\n\nThe last thing I will say, though -- let me say this about health care and the health care debate, because I think it also bears on a whole lot of other issues. If you look at the package that we've presented -- and there's some stray cats and dogs that got in there that we were eliminating, we were in the process of eliminating. For example, we said from the start that it was going to be important for us to be consistent in saying to people if you can have your -- if you want to keep the health insurance you got, you can keep it, that you're not going to have anybody getting in between you and your doctor in your decision making. And I think that some of the provisions that got snuck in might have violated that pledge.\n\nAnd so we were in the process of scrubbing this and making sure that it's tight. But at its core, if you look at the basic proposal that we've put forward: it has an exchange so that businesses and the self-employed can buy into a pool and can get bargaining power the same way big companies do; the insurance reforms that I've already discussed, making sure that there's choice and competition for those who don't have health insurance. The component parts of this thing are pretty similar to what Howard Baker, Bob Dole, and Tom Daschle proposed at the beginning of this debate last year.\n\nNow, you may not agree with Bob Dole and Howard Baker, and, certainly you don't agree with Tom Daschle on much, but that's not a radical bunch. But if you were to listen to the debate and, frankly, how some of you went after this bill, you'd think that this thing was some Bolshevik plot. No, I mean, that's how you guys -- (applause) -- that's how you guys presented it.\n\nAnd so I'm thinking to myself, well, how is it that a plan that is pretty centrist -- no, look, I mean, I'm just saying, I know you guys disagree, but if you look at the facts of this bill, most independent observers would say this is actually what many Republicans -- is similar to what many Republicans proposed to Bill Clinton when he was doing his debate on health care.\n\nSo all I'm saying is, we've got to close the gap a little bit between the rhetoric and the reality. I'm not suggesting that we're going to agree on everything, whether it's on health care or energy or what have you, but if the way these issues are being presented by the Republicans is that this is some wild-eyed plot to impose huge government in every aspect of our lives, what happens is you guys then don't have a lot of room to negotiate with me.\n\nI mean, the fact of the matter is, is that many of you, if you voted with the administration on something, are politically vulnerable in your own base, in your own party. You've given yourselves very little room to work in a bipartisan fashion because what you've been telling your constituents is, this guy is doing all kinds of crazy stuff that's going to destroy America.\n\nAnd I would just say that we have to think about tone. It's not just on your side, by the way -- it's on our side, as well. This is part of what's happened in our politics, where we demonize the other side so much that when it comes to actually getting things done, it becomes tough to do.\n\nMike.\n\nCONGRESSMAN PENCE: Dr. Tom Price from Georgia, and then we'll have one more after that if your time permits, Mr. President.\n\nTHE PRESIDENT: You know, I'm having fun. (Laughter.)\n\nCONGRESSMAN PENCE: Okay.\n\nTHE PRESIDENT: This is great. (Applause.)\n\nCONGRESSMAN PENCE: So are we.\n\nCONGRESSMAN PRICE: Mr. President, thank you. I want to stick on the general topic of health care, but ask a very specific question. You have repeatedly said, most recently at the State of the Union, that Republicans have offered no ideas and no solutions. In spite of the fact --\n\nTHE PRESIDENT: I don't think I said that. What I said was, within the context of health care -- I remember that speech pretty well, it was only two days ago -- (laughter) -- I said I welcome ideas that you might provide. I didn't say that you haven't provided ideas. I said I welcome those ideas that you'll provide.\n\nCONGRESSMAN PRICE: Mr. President, multiple times, from your administration, there have come statements that Republicans have no ideas and no solutions. In spite of the fact that we've offered, as demonstrated today, positive solutions to all of the challenges we face, including energy and the economy and health care, specifically in the area of health care -- this bill, H.R.3400, that has more co-sponsors than any health care bill in the House, is a bill that would provide health coverage for all Americans; would correct the significant insurance challenges of affordability and preexisting; would solve the lawsuit abuse issue, which isn't addressed significantly in the other proposals that went through the House and the Senate; would write into law that medical decisions are made between patients and families and doctors; and does all of that without raising taxes by a penny.\n\nBut my specific question is, what should we tell our constituents who know that Republicans have offered positive solutions to the challenges that Americans face and yet continue to hear out of the administration that we've offered nothing?\n\nTHE PRESIDENT: Tom, look, I have to say that on the -- let's just take the health care debate. And it's probably not constructive for us to try to debate a particular bill -- this isn't the venue to do it. But if you say, \"We can offer coverage for all Americans, and it won't cost a penny,\" that's just not true. You can't structure a bill where suddenly 30 million people have coverage, and it costs nothing. If --\n\nCONGRESSMAN PRICE: Mr. President, can I -- and I understand that we're not interested in debating this bill, but what should we tell our constituents who know that we've offered these solutions and yet hear from the administration that we have offered nothing.\n\nTHE PRESIDENT: Let me -- I'm using this as a specific example, so let me answer your question. You asked a question; I want to answer it.\n\nIt's not enough if you say, for example, that we've offered a health care plan and I look up -- this is just under the section that you've just provided me, or the book that you just provided me -- summary of GOP health care reform bill: The GOP plan will lower health care premiums for American families and small businesses, addressing America's number-one priority for health reform. I mean, that's an idea that we all embrace. But specifically it's got to work. I mean, there's got to be a mechanism in these plans that I can go to an independent health care expert and say, is this something that will actually work, or is it boilerplate?\n\nIf I'm told, for example, that the solution to dealing with health care costs is tort reform, something that I've said I am willing to work with you on, but the CBO or other experts say to me, at best, this could reduce health care costs relative to where they're growing by a couple of percentage points, or save $5 billion a year, that's what we can score it at, and it will not bend the cost curve long term or reduce premiums significantly -- then you can't make the claim that that's the only thing that we have to do. If we're going to do multi-state insurance so that people can go across state lines, I've got to be able to go to an independent health care expert, Republican or Democrat, who can tell me that this won't result in cherry-picking of the healthiest going to some and the least healthy being worse off.\n\nSo I am absolutely committed to working with you on these issues, but it can't just be political assertions that aren't substantiated when it comes to the actual details of policy. Because otherwise, we're going to be selling the American people a bill of goods. I mean, the easiest thing for me to do on the health care debate would have been to tell people that what you're going to get is guaranteed health insurance, lower your costs, all the insurance reforms; we're going to lower the costs of Medicare and Medicaid and it won't cost anybody anything. That's great politics, it's just not true.\n\nSo there's got to be some test of realism in any of these proposals, mine included. I've got to hold myself accountable, and guaranteed the American people will hold themselves -- will hold me accountable if what I'm selling doesn't actually deliver.\n\nCONGRESSMAN PRICE: Mr. President, a point of clarification, what's in the Better Solutions book are all the legislative proposals that were offered --\n\nTHE PRESIDENT: I understand that. I've actually read your bills.\n\nCONGRESSMAN PRICE: -- throughout 2009.\n\nTHE PRESIDENT: I understand.\n\nCONGRESSMAN PRICE: And so, rest assured the summary document you received is backed up by precisely the kind of detailed legislation that Speaker Pelosi and your administration have been busy ignoring for 12 months.\n\nTHE PRESIDENT: Well, Mike -- well, hold on, hold on a second. No, no, no, no. Hold on a second, guys. (Applause.)\n\nYou know, Mike, I've read your legislation. I mean, I take a look at this stuff -- and the good ideas we take. But here's -- here's the thing -- here's the thing that I guess all of us have to be mindful of, it can't be all or nothing, one way or the other. And what I mean by that is this: If we put together a stimulus package in which a third of it are tax cuts that normally you guys would support, and support for states and the unemployed, and helping people stay on COBRA that your governors certainly would support -- Democrat or a Republican; and then you've got some infrastructure, and maybe there's some things in there that you don’t like in terms of infrastructure, or you think the bill should have been $500 billion instead of $700 billion or there's this provision or that provision that you don't like. If there's uniform opposition because the Republican caucus doesn't get 100 percent or 80 percent of what you want, then it's going to be hard to get a deal done. That's because that's not how democracy works.\n\nSo my hope would be that we can look at some of these component parts of what we're doing and maybe we break some of them up on different policy issues. So if the good congressman from Utah has a particular issue on lobbying reform that he wants to work with us on, we may not able to agree on a comprehensive package on everything but there may be some component parts that we can work on.\n\nYou may not support our overall jobs package, but if you look at the tax credit that we're proposing for small businesses right now, it is consistent with a lot of what you guys have said in the past. And just the fact that it's my administration that's proposing it shouldn't prevent you from supporting it. That's my point.\n\nCONGRESSMAN PENCE: Thank you, Mr. President. Peter Roskam from the great state of Illinois.\n\nTHE PRESIDENT: Oh, Peter is an old friend of mine.\n\nCONGRESSMAN ROSKAM: Hey, Mr. President.\n\nTHE PRESIDENT: Peter and I have had many debates.\n\nCONGRESMAN ROSKAM: Well, this won't be one. Mr. President, I heard echoes today of the state senator that I served with in Springfield and there was an attribute and a characteristic that you had that I think served you well there. You took on some very controversial subjects -- death penalty reform -- you and I --\n\nTHE PRESIDENT: Sure. We worked on it together.\n\nCONGRESSMAN ROSKAM: -- negotiated on. You took on ethics reform. You took on some big things. One of the keys was you rolled your sleeves up, you worked with the other party, and ultimately you were able to make the deal. Now, here's an observation.\n\nOver the past year, in my view, that attribute hasn't been in full bloom. And by that I mean, you've gotten this subtext of House Republicans that sincerely want to come and be a part of this national conversation toward solutions, but they've really been stiff-armed by Speaker Pelosi. Now, I know you're not in charge of that chamber, but there really is this dynamic of, frankly, being shut out. When John Boehner and Eric Cantor presented last February to you some substantive job creation, our stimulus alternative, the attack machine began to marginalize Eric -- and we can all look at the articles -- as \"Mr. No,\" and there was this pretty dark story, ultimately, that wasn't productive and wasn't within this sort of framework that you're articulating today.\n\nSo here's the question. Moving forward, I think all of us want to hit the reset button on 2009. How do we move forward? And on the job creation piece in particular, you mentioned Colombia, you mentioned Panama, you mentioned South Korea. Are you willing to work with us, for example, to make sure those FTAs get called, that's no-cost job creation? And ultimately, as you're interacting with world leaders, that's got to put more arrows in your quiver, and that's a very, very powerful tool for us. But the obstacle is, frankly, the politics within the Democratic caucus?\n\nTHE PRESIDENT: Well, first of all, Peter and I did work together effectively on a whole host of issues. One of our former colleagues is right now running for governor, on the Republican side, in Illinois. In the Republican primary, of course, they're running ads of him saying nice things about me. Poor guy. (Laughter.)\n\nAlthough that's one of the points that I made earlier. I mean, we've got to be careful about what we say about each other sometimes, because it boxes us in in ways that makes it difficult for us to work together, because our constituents start believing us. They don't know sometimes this is just politics what you guys -- or folks on my side do sometimes.\n\nSo just a tone of civility instead of slash and burn would be helpful. The problem we have sometimes is a media that responds only to slash-and-burn-style politics. You don't get a lot of credit if I say, \"You know, I think Paul Ryan is a pretty sincere guy and has a beautiful family.\" Nobody is going to run that in the newspapers.\n\nQ (Inaudible.) (Laughter.)\n\nTHE PRESIDENT: And by the way, in case he's going to get a Republican challenge, I didn't mean it. (Laughter.) Don't want to hurt you, man. (Laughter.)\n\nBut on the specifics, I think both sides can take some blame for a sour climate on Capitol Hill. What I can do maybe to help is to try to bring Republican and Democratic leadership together on a more regular basis with me. That's, I think, a failure on my part, is to try to foster better communications even if there's disagreement. And I will try to see if we can do more of that this year. That's on the sort of the general issue.\n\nOn the specific issue of trade, you're right, there are conflicts within and fissures within the Democratic Party. I suspect there are probably going to be some fissures within the Republican Party, as well. I mean, you know, if you went to some of your constituencies, they'd be pretty suspicious about it, new trade agreements, because the suspicion is somehow they're all one way.\n\nSo part of what we've been trying to do is to make sure that we're getting the enforcement side of this tight, make sure that if we've got a trade agreement with China or other countries, that they are abiding with it -- they're not stealing our intellectual property or making sure that their non-tariff barriers are lowered even as ours are opened up. And my hope is, is that we can move forward with some of these trade agreements having built some confidence -- not just among particular constituency groups, but among the American people -- that trade is going to be reciprocal; that it's not just going to be a one-way street.\n\nYou are absolutely right though, Peter, when you say, for example, South Korea is a great ally of ours. I mean, when I visited there, there is no country that is more committed to friendship on a whole range of fronts than South Korea. What is also true is that the European Union is about to sign a trade agreement with South Korea, which means right at the moment when they start opening up their markets, the Europeans might get in there before we do.\n\nSo we've got to make sure that we seize these opportunities. I will be talking more about trade this year. It's going to have to be trade that combines opening their markets with an enforcement mechanism, as well as just opening up our markets. I think that's something that all of us would agree on. Let's see if we can execute it over the next several years. All right, is that it?\n\nCONGRESSMAN PENCE: Jeb Hensarling, Texas. And that will be it, Mr. President.\n\nTHE PRESIDENT: Jim [sic] is going to wrap things up?\n\nCONGRESSMAN PENCE: Yes, sir.\n\nTHE PRESIDENT: All right.\n\nCONGRESSMAN HENSARLING: Jeb, Mr. President.\n\nTHE PRESIDENT: How are you?\n\nCONGRESSMAN HENSARLING: I'm doing well. Mr. President, a year ago I had an opportunity to speak to you about the national debt. And something that you and I have in common is we both have small children.\n\nTHE PRESIDENT: Absolutely.\n\nCONGRESSMAN HENSARLING: And I left that conversation really feeling your sincere commitment to ensuring that our children, our nation's children, do not inherit an unconscionable debt. We know that under current law, that government -- the cost of government is due to grow from 20 percent of our economy to 40 percent of our economy, right about the time our children are leaving college and getting that first job.\n\nMr. President, shortly after that conversation a year ago, the Republicans proposed a budget that ensured that government did not grow beyond the historical standard of 20 percent of GDP. It was a budget that actually froze immediately non-defense discretionary spending. It spent $5 trillion less than ultimately what was enacted into law, and unfortunately, I believe that budget was ignored. And since that budget was ignored, what were the old annual deficits under Republicans have now become the monthly deficits under Democrats. The national debt has increased 30 percent.\n\nNow, Mr. President, I know you believe -- and I understand the argument, and I respect the view that the spending is necessary due to the recession; many of us believe, frankly, it's part of the problem, not part of the solution. But I understand and I respect your view. But this is what I don't understand, Mr. President. After that discussion, your administration proposed a budget that would triple the national debt over the next 10 years -- surely you don't believe 10 years from now we will still be mired in this recession -- and propose new entitlement spending and move the cost of government to almost 24.5 percent of the economy.\n\nNow, very soon, Mr. President, you're due to submit a new budget. And my question is --\n\nTHE PRESIDENT: Jeb, I know there's a question in there somewhere, because you're making a whole bunch of assertions, half of which I disagree with, and I'm having to sit here listening to them. At some point I know you're going to let me answer. All right.\n\nCONGRESSMAN HENSARLING: That's the question. You are soon to submit a new budget, Mr. President. Will that new budget, like your old budget, triple the national debt and continue to take us down the path of increasing the cost of government to almost 25 percent of our economy? That's the question, Mr. President.\n\nTHE PRESIDENT: Jeb, with all due respect, I've just got to take this last question as an example of how it's very hard to have the kind of bipartisan work that we're going to do, because the whole question was structured as a talking point for running a campaign.\n\nNow, look, let's talk about the budget once again, because I'll go through it with you line by line. The fact of the matter is, is that when we came into office, the deficit was $1.3 trillion. -- $1.3 [trillion.] So when you say that suddenly I've got a monthly budget that is higher than the -- a monthly deficit that's higher than the annual deficit left by the Republicans, that's factually just not true, and you know it's not true.\n\nAnd what is true is that we came in already with a $1.3 trillion deficit before I had passed any law. What is true is we came in with $8 trillion worth of debt over the next decade -- had nothing to do with anything that we had done. It had to do with the fact that in 2000 when there was a budget surplus of $200 billion, you had a Republican administration and a Republican Congress, and we had two tax cuts that weren't paid for.\n\nYou had a prescription drug plan -- the biggest entitlement plan, by the way, in several decades -- that was passed without it being paid for. You had two wars that were done through supplementals. And then you had $3 trillion projected because of the lost revenue of this recession. That's $8 trillion.\n\nNow, we increased it by a trillion dollars because of the spending that we had to make on the stimulus. I am happy to have any independent fact-checker out there take a look at your presentation versus mine in terms of the accuracy of what I just said.\n\nNow, going forward, here's the deal. I think, Paul, for example, head of the budget committee, has looked at the budget and has made a serious proposal. I've read it. I can tell you what's in it. And there are some ideas in there that I would agree with, but there are some ideas that we should have a healthy debate about because I don't agree with them.\n\nThe major driver of our long-term liabilities, everybody here knows, is Medicare and Medicaid and our health care spending. Nothing comes close. Social Security we could probably fix the same way Tip O'Neill and Ronald Reagan sat down together and they could figure something out. That is manageable. Medicare and Medicaid -- massive problem down the road. That's where -- that's going to be what our children have to worry about.\n\nNow, Paul's approach -- and I want to be careful not simplifying this, because I know you've got a lot of detail in your plan -- but if I understand it correctly, would say we're going to provide vouchers of some sort for current Medicare recipients at the current level --\n\nCONGRESSMAN RYAN: No.\n\nTHE PRESIDENT: No?\n\nCONGRESSMAN RYAN: People 55 and above --\n\nTHE PRESIDENT: Fifty-five and -- well, no, I understand. I mean, there's a grandfathering in, but just for future beneficiaries, right? That's why I said I didn't want to -- I want to make sure that I'm not being unfair to your proposal, but I just want to point out that I've read it. And the basic idea would be that at some point we hold Medicare cost per recipient constant as a way of making sure that that doesn't go way out of whack, and I'm sure there are some details that --\n\nCONGRESSMAN RYAN: We drew it as a blend of inflation and health inflation, the point of our plan is -- because Medicare, as you know, is a $38 trillion unfunded liability -- it has to be reform for younger generations because it won't exist because it's going bankrupt. And the premise of our idea is, look, why not give people the same kind of health care plan we here have in Congress? That's the kind of reform we're proposing for Medicare. (Applause.)\n\nTHE PRESIDENT: No, I understand. Right, right. Well, look, as I said before, this is an entirely legitimate proposal. The problem is twofold: One is that depending on how it's structured, if recipients are suddenly getting a plan that has their reimbursement rates going like this, but health care costs are still going up like that, then over time the way we're saving money is essentially by capping what they're getting relative to their costs.\n\nNow, I just want to point out -- and this brings me to the second problem -- when we made a very modest proposal as part of our package, our health care reform package, to eliminate the subsidies going to insurance companies for Medicare Advantage, we were attacked across the board, by many on your aisle, for slashing Medicare. You remember? We're going to start cutting benefits for seniors. That was the story that was perpetrated out there -- scared the dickens out of a lot of seniors.\n\nNo, no, but here's my point. If the main question is going to be what do we do about Medicare costs, any proposal that Paul makes will be painted, factually, from the perspective of those who disagree with it, as cutting benefits over the long term. Paul, I don't think you disagree with that, that there is a political vulnerability to doing anything that tinkers with Medicare. And that's probably the biggest savings that are obtained through Paul's plan.\n\nAnd I raise that not because we shouldn't have a series discussion about it. I raise that because we're not going to be able to do anything about any of these entitlements if what we do is characterized, whatever proposals are put out there, as, well, you know, that's -- the other party is being irresponsible; the other party is trying to hurt our senior citizens; that the other party is doing X, Y, Z.\n\nThat's why I say if we're going to frame these debates in ways that allow us to solve them, then we can't start off by figuring out, A, who's to blame; B, how can we make the American people afraid of the other side. And unfortunately, that's how our politics works right now. And that's how a lot of our discussion works. That's how we start off -- every time somebody speaks in Congress, the first thing they do, they stand up and all the talking points -- I see Frank Luntz up here sitting in the front. He's already polled it, and he said, you know, the way you're really going to -- I've done a focus group and the way we're going to really box in Obama on this one or make Pelosi look bad on that one -- I know, I like Frank, we've had conversations between Frank and I. But that's how we operate. It's all tactics, and it's not solving problems.\n\nAnd so the question is, at what point can we have a serious conversation about Medicare and its long-term liability, or a serious question about -- a serious conversation about Social Security, or a serious conversation about budget and debt in which we're not simply trying to position ourselves politically. That's what I'm committed to doing. We won't agree all the time in getting it done, but I'm committed to doing it.\n\nCONGRESSMAN PENCE: Take one more?\n\nTHE PRESIDENT: You know, I've already gone over time. But I'll be happy to take your question, Congressman, offline. You can give me a call. All right, thank you, everybody. God bless you. God bless the United States of America. Thank you, everybody. (Applause.)\n\nEND 1:32 P.M. EST\n\n", "images": ["https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/sites/default/files/imagecache/related_video_thumbnail/audio-video/video_thumbnail/P012910PS-0437-2.jpg", "https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/sites/default/themes/whitehouse/img/clear.gif", "https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/sites/default/themes/whitehouse/img/sftr-whgov.gif", "https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/sites/default/themes/whitehouse/favicon.ico", "https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/files/images/haiti/help_for_haiti_272x100.jpg"], "top_img": "https://web.archive.org/web/20100201043706im_/http://www.whitehouse.gov/sites/default/themes/whitehouse/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Remarks by the President at GOP House Issues Conference", "meta_data": {"description": "WhiteHouse.gov is the official web site for the White House and President Barack Obama, the 44th President of the United States. This site is a source for information about the President, White House news and policies, White House history, and the federal government.", "keywords": "President, Barack Obama, White House, United States of America, 44th President, White House history, President Obama, Barck, Barek, Barak, Barrack, Barrak, Obma, Barack"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}