{"url": "https://www.vulture.com/2018/06/queer-eye-recap-season-2-episode-5.html", "text": "Queer Eye Sky’s the Limit Season 2 Episode 5 Editor’s Rating 5 stars * * * * * « Previous Next » Photo: Courtesy of Netflix\n\nI know that Queer Eye is always going to make me cry, but when this episode started, I didn’t think that I was going to be this shocked. I wasn’t sure what I was watching, but I knew it was riveting. I knew that it had the potential to change the entire series as we’ve known it so far. Yes, at the beginning of the episode, Karamo was not wearing a satin bomber jacket. It was actually a knit. Like a sweater. Sure, it still zipped up the front so it wasn’t so far from his usual uniform, but still. I didn’t quite know what to do with myself.\n\nWhile that shocked me, the real shock was watching this episode’s makeover subject, Skyler, getting his top surgery. We see Skyler wake up and look down at his chest, which used to have breasts, and see it flat and masculine as he always wanted it to be and his face erupts with emotion. It was really and truly moving way to begin the episode.\n\nThe other shocking thing is that redheads are bad with anesthesia. Who knew this was a real thing? I certainly didn’t. It’s such a shame that Skyler not only had to spend $8,000 of his own money to have the surgery, but will now face thousands of dollars of medical bills because of the complications just from being a redhead.\n\nAs hard as being a ginge is, being trans is even harder. Many people know the struggle of being transgender in our society, but what really struck me about this episode was how even the silly everyday things that so many of us take for granted can be triggering for a trans person. I never would have thought that getting a suit tailored would lead to an emotional breakdown for Skyler because he felt uncomfortable with someone all up in his pants business. Or the fact that some bitch at the DMV could cause such emotional pain. I mean, we’ve all felt existential dread at the DMV, but this is a whole different level for Skyler.\n\nI must say that trans people really are heroes. The strength it takes for them to be themselves every day is so hard, but they continue to soldier on when there is still so little support for them. It’s absolutely astonishing and brave. That said, it doesn’t mean that some of them don’t have truly awful style. Sorry, Skyler.\n\nSkyler dresses in poorly fitting basketball jerseys, silly novelty hats, and the worst shoes I have ever seen on someone who isn’t named Mario Batali. He’s just so happy to be a boy that he’s dressing like a 19-year-old at a third-tier state school. His house is decorated like one too, with the raised bed and all of his crap underneath it. He tells us that he had to leave his parents’ house at 17 after he came out to them, and it’s like he’s living in this arrested ideal adolescence that he never got to enjoy.\n\nMaybe I should cut him a bit more slack, but this guy has a couch that is literally called the “cat pee couch.” The only thing worse is all of the rainbow-flag Pride paraphernalia around the house. Ugh, I am a proud homosexual, but I hate that stupid rainbow flag. There is no way that you can make it look not tacky. No matter what you do with it, it still looks like a tourist in Key West wearing a fanny pack while on a break from a Princess Cruise. The rainbow flag and the fact that Christina Aguilera isn’t a bigger star are the twin scourges of the queer community.\n\nBecause this is a very different episode, we didn’t even get that much of a makeover. Instead, we mostly heard about Skyler’s story. And that was fine with me because, girl, did I sob. I sobbed when he got a license that says he is male, I sobbed when he tried on the first suit that really fit him well, and I sobbed when he got up onstage at his “coming-out party” and started stripping for the crowd and showing off the body he was so proud of.\n\nI loved that Tan wanted Skyler to look good in a suit because, he’s right, every man’s body looks more masculine with some good tailoring. It was really sweet that he brought in his friend whose suiting company works a lot with the trans community and has a few easy tricks to make their suits fit their bodies more comfortably. However, I am pissed at Tan. How the hell does he not know who Todrick Hall is? Has he not watched Drag Race? The only thing I hate more than the rainbow flag is people who say, “We’re going to take your gay card away,” but I feel like Tan shouldn’t be allowed to film any more of these episodes at least until he’s watched All Stars 2.\n\nAlso, as soon as Skyler kept going on about his love of the YouTube star and Drag Race fixture, I thought, “If we leave this episode without a guest appearance from Mx. Hall, then these queens did not do their job.” Thankfully, they did not disappoint and Todrick showed up on Skyler’s doorstep for a teary tête-à-tête. It would have been very easy for Skyler to just fan out about Toddy’s videos and singles, but instead I was really touched by what he said about how Todrick really showed him how he can blend the feminine and masculine energies together to make something that is totally unique and wonderful. There are plenty out there who scoff at YouTube celebrities, but that is the power of the medium is harnessed correctly. (Speaking of harnessed correctly, I wouldn’t mind seeing Todrick Hall in a harness, if he’s taking requests for his next video.)\n\nMeanwhile, Bobby got rid of the cat pee couch and made Skyler’s room look like a rec room at St. Jude’s Children’s Hospital, but even that was a vast improvement. Antoni showed Skyler how to make poke and I will not make fun of Antoni in this recap because it was all so moving and lovely. Yes, I made this oath during an episode where he wears guyliner, so basically I’m deducting this recap on my taxes as a charitable donation.\n\nJonathan had the hardest job of all: He had to convince Skyler to trim his signature beard, which is what he thinks makes his face look the most masculine. But Jonathan was right, his bright-red beard was a bit too manicured, so it actually made his face look more feminine rather than the opposite. When Jonathan gave Skyler a haircut and a beard trim, he not only looked butcher but he also looked younger, which is a good look on anyone. Let’s face it: Being trans is hard enough, so the least that the Fab Five can do is give a trans man a good beard and rid his house of all of that ugly rainbow.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/06/14/recaps/14-queer-eye-205.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/a33/dd9/1c079d8c666b805e6363b460d07dda452a-14-queer-eye-205.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/a33/dd9/1c079d8c666b805e6363b460d07dda452a-14-queer-eye-205.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Brian Moylan"], "canonical_link": "https://www.vulture.com/2018/06/queer-eye-recap-season-2-episode-5.html", "title": "Queer Eye Recap: Man of the Hour", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Queer Eye Recap: Man of the Hour", "url": "https://www.vulture.com/2018/06/queer-eye-recap-season-2-episode-5.html", "description": "The Fab Five make over a trans man who’s trying to look his best (and who really needs to lose the “cat pee couch”).", "image": "https://pyxis.nymag.com/v1/imgs/a33/dd9/1c079d8c666b805e6363b460d07dda452a-14-queer-eye-205.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Queer Eye Recap: Man of the Hour", "description": "The Fab Five make over a trans man who’s trying to look his best (and who really needs to lose the “cat pee couch”).", "image": "https://pyxis.nymag.com/v1/imgs/a33/dd9/1c079d8c666b805e6363b460d07dda452a-14-queer-eye-205.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-06-20T15:38:50.600Z", "tag": "tv, tv recaps, overnights, recaps, queer eye, queer eye for the straight guy, queer eye season 2", "publisher": "https://www.facebook.com/Vulture"}, "description": "The Fab Five make over a trans man who’s trying to look his best (and who really needs to lose the “cat pee couch”). A recap of Queer Eye Season 2 Episode 5: ‘Sky’s the Limit’", "sailthru.tags": "tv, tv recaps, overnights, recaps, queer eye, queer eye for the straight guy, queer eye season 2", "author": "Brian Moylan", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1529509130.6, "source": "https://www.vulture.com", "summary": ""}