{"url": "https://www.washingtonpost.com/news/soloish/wp/2018/03/08/the-bachelor-finale-fallout-continues-3-takeaways-from-aries-defensive-press-tour/", "text": "So, as is tradition, the final “Bachelor” couple has to embark on ABC talk show appearances after the finale — and for Arie, it has naturally turned pretty defensive. By Thursday, even Becca — just named the newest Bachelorette — was halfheartedly defending him during an interview with “Good Morning America.”\n\n“He had to do what he had to do. And I don’t fault him for that,” Becca said, in response to whether she felt “ambushed” by the breakup. “I would want him to follow his heart and not to feel trapped in a relationship with me. At the end of the day, if it had to happen, then it had to happen.”\n\nAD\n\nAD\n\nHere are three takeaways from Arie’s press tour:\n\nArie has multiple explanations for breaking up with Becca on camera.\n\nViewers were stunned on Monday night upon seeing the footage of Becca, who thought she was arriving at a house in Los Angeles to spend a romantic weekend with Arie. Instead, he had brought along a camera crew to film as he called off their engagement because he was still in love with Lauren.\n\nArie was roasted on social media for this decision — while the producers probably encouraged it, they swear the cameras were Arie’s choice — and some of our country’s top TV personalities were equally confused.\n\n“There’s a lot of backlash from a lot of people,” Michael Strahan said Wednesday on “Good Morning America,” reading tweets from former “Bachelor” contestants who thought the show went too far. “Why was the decision made to film this? It probably could have been done — I think a lot of people felt — in a more quiet way.”\n\nAD\n\nAD\n\n“I really wanted everyone to know that this was on me, this was my fault. And I felt like filming that would let people know that. That if there were any questions on the breakup, those would be squashed if they saw the breakup,” Arie explained. “And I wanted her that opportunity — honestly, I wanted her the opportunity to be the potential Bachelorette.”\n\nThat reasoning was similar to Arie’s thinking that he shared during the finale, about how he wanted to be fully transparent. But essentially saying he was doing a good thing because he knew it would help Becca be named the Bachelorette? Apparently, he thinks he did her a favor.\n\nOn Wednesday’s “Live with Kelly and Ryan,” Kelly Ripa called Arie “shady” and said the choice to air the extended breakup was “excessively cruel.”\n\nAD\n\n“Why break up with Becca like you did on camera and why 40 minutes of us seeing her in so much pain?” Ryan Seacrest asked.\n\nAD\n\nArie emphasized that although he wanted to film the breakup, he didn’t decide to air the whole thing — that was the producers’ call.\n\n“Through every breakup there’s always questions of what went wrong. And I knew if we did it on camera that I could take ownership of it and that it was completely my fault and my doing. I thought that was important,” Arie said, echoing his earlier answer. “And the whole thing started on camera, and I wanted the story to be told all the way to the end.”\n\nAh, so he also wanted to do it for continuity’s sake. Good to know.\n\nAD\n\nArie wants everyone to know he’s fine with the backlash.\n\nSocial media users have not been kind. “Are you worried about how people are going to react to your relationship with Lauren?” Michael Strahan asked on “GMA.”\n\n“I think that, you know, you’d love to have the support from people online, but what really matters is our relationship, our family, our friends, and they’re all on board,” Arie said.\n\nAD\n\nLauren repeated this idea when she joined Arie later in the interview, and Strahan asked again about how they’re handling the haters.\n\n“If either of us is struggling, we come to each other and try to make light of any kind of hate we get. Just kind of joke around,” she said.\n\nAD\n\n“I think we try to turn it around and try to poke fun at things. Some things are kind of funny,” Arie said, noting that he and Lauren “didn’t get the best edit” on the show. “As long as we have each other, we’ll be okay.”\n\nArie and Lauren have already started planning the wedding.\n\nAt least, that’s what they told Jimmy Kimmel on Tuesday night. Kimmel was shocked when he asked them a question about whether Arie changes his mind a lot when he’s out at dinner, and Lauren responded that they’ve never actually been to dinner before.\n\nAD\n\n“You haven’t been to a restaurant together? Oh, you should definitely get married right away,” Kimmel deadpanned.\n\nArie and Lauren also cuddled through every interview, with lots of public displays of affection. They told Ripa and Seacrest that they’re headed out of the country on vacation, and when they get back, they’re going to pack up Lauren’s belongings in Virginia and drive to Phoenix, where they’ll live together. In other words, this disastrous situation was worth it, because they’re soul mates.\n\nAD\n\n“I know it’s difficult for a lot of people to swallow, but I’m happy. And it took a long, hard road to get here,” Arie said. “But I’m really solid in my relationship, and we have been together since January and it’s going really well. And I knew this was going to be a tough week for me.”\n\nRead more:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RBR4LTORGAYIBOWLHXIDATOZOI.jpg&w=150", "https://www.washingtonpost.com/resizer/Syrm8IhFDisTR0fje9-UIpaLwVs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RBR4LTORGAYIBOWLHXIDATOZOI.jpg"], "top_img": "https://www.washingtonpost.com/resizer/Syrm8IhFDisTR0fje9-UIpaLwVs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RBR4LTORGAYIBOWLHXIDATOZOI.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/soloish/wp/2018/03/08/the-bachelor-finale-fallout-continues-3-takeaways-from-aries-defensive-press-tour/", "title": "‘The Bachelor’ finale fallout continues: 3 takeaways from Arie’s defensive press tour", "meta_data": {"description": "Arie tried to explain why he wanted to film his breakup, as Kelly Ripa called showing the footage an “excessively cruel” act.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/soloish/wp/2018/03/08/the-bachelor-finale-fallout-continues-3-takeaways-from-aries-defensive-press-tour/", "image": "https://www.washingtonpost.com/resizer/Syrm8IhFDisTR0fje9-UIpaLwVs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RBR4LTORGAYIBOWLHXIDATOZOI.jpg", "title": "Analysis | ‘The Bachelor’ finale fallout continues: 3 takeaways from Arie’s defensive press tour", "description": "Arie tried to explain why he wanted to film his breakup, as Kelly Ripa called showing the footage an “excessively cruel” act."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | ‘The Bachelor’ finale fallout continues: 3 takeaways from Arie’s defensive press tour", "description": "Arie tried to explain why he wanted to film his breakup, as Kelly Ripa called showing the footage an “excessively cruel” act."}, "last_updated_date": "2019-03-31T17:19:23.952Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": ["https://www.youtube.com/embed/6VHG8Jl6s-g?feature=oembed", "https://www.youtube.com/embed/VeXoFFxxUyc?feature=oembed", "https://www.youtube.com/embed/EP-JkkXhBqM?feature=oembed"], "publish_date": 1520438400.0, "source": "https://www.washingtonpost.com", "summary": ""}