{"url": "www.mercurynews.com/2017/10/14/is-george-clooney-complicit-e-r-actress-says-he-helped-silence-her-sexual-harassment-charges/", "text": "George Clooney once again this week found himself having to issue a statement denying he helped enable perpetrators of sexual assault in Hollywood after an actress said he helped “blacklist” her after she complained about rampant sexual harassment on the set of “E.R.”\n\nIn a series of tweets over the week, Vanessa Marquez called “B.S.” on Clooney’s statements of concern about the female victims of workplace harassment and assault in the wake of reports that the actor’s former collaborator Harvey Weinstein abused multiple A-list actresses and other women for decades.\n\nMarquez said Clooney “helped blacklist” her when she spoke up about about abusive behavior on the set of “E.R.,” the hit NBC medical drama that catapulted Clooney to movie stardom in the 1990s.\n\nThe actress, who played Nurse Wendy Goldman on the first three seasons of the show, first took to Twitter to retweet an article in which Clooney spoke out against Harvey Weinstein. She said he’s full of “B.S.”\n\n“Clooney helped blacklist me when I spoke up abt harassment on ER,” she tweeted in response to the article.\n\nShe added that the message on the set, perhaps emphasized by Clooney himself, is that women “who don’t play the game” will lose their careers.\n\nhttps://twitter.com/vanessathought/status/917640021452058624?ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Fwww.eonline.com%2Fnews%2F886978%2Fgeorge-clooney-addresses-former-er-co-star-vanessa-marquez-s-sexual-harassment-accusations\n\nShe also retweeted one of her own posts from earlier this year in which she leveled other accusations. In the tweet, she claimed she was “racially and sexually harassed on set daily.”\n\nShe specifically accused actor Eriq La Salle and a crew member of being “p—sy grabbers” and said racial abuse about her Mexican heritage came from “Anthony, Noah, Julianna,” referring to cast members Anthony Edwards, Noah Wyle, and Julianna Margulies.\n\nMarquez said she complained to executive producer John Wells, whose first concern was over whether Clooney, the biggest break-out star of the series, hurt her.\n\n“Wells was the boss&I 1st reported it to him.His 1st question:Did George do something to u,” she tweeted.\n\nMarquez said that her complaints led her to be blacklisted. Since leaving the show in 1997, she has only appeared in a handful of short films and TV movies, according to her IMDb page. In 2005, she discussed her shopping addiction on the A&E reality show “Intervention,” the New York Post said.\n\nMarquez’ claims continued to keep Clooney’s name in the news over his professional association with Weinstein. But he’s not the only A-list male star to face backlash over the Weinstein controversy. Matt Damon and Ben Affleck have also been ensnared in the scandal to varying degrees, with Affleck himself having to fend off allegations from women on social media that he groped him.\n\nSince initially speaking out against Weinstein earlier in the week, Damon and Affleck have mostly kept silent.\n\nBut Clooney decided to address Marquez’ claims on Friday. In a statement to E! News, he denied he played any role in Marquez being shut out of further work on “E.R.” but said he believed her story that this happened to her.\n\n“I had no idea Vanessa was blacklisted. I take her at her word,” Clooney said.\n\n“I was not a writer or a producer or a director on that show,” he continued. “I had nothing to do with casting. I was an actor and only an actor. If she was told I was involved in any decision about her career then she was lied to. The fact that I couldn’t affect her career is only surpassed by the fact that I wouldn’t.”\n\nClooney’s statement in regards to Marquez came several days after he gave an extensive interview to The Daily Beast to address questions about whether he knew about the allegations involving Weinstein. Clooney has worked closely with Weinstein on several films and has credited the once powerful producer for helping him kick-start his film career.\n\n“It’s indefensible. That’s the only word you can start with,” Clooney said in the interview about the reports that Weinstein raped and otherwise abused multiple women. “Harvey’s admitted to it, and it’s indefensible.”\n\nClooney said he was aware that Weinstein liked to hit on pretty, young women but never knew that he took things with women to the level of harassment or assault.\n\n“I’ve known Harvey for twenty years,” he said. “We’ve had dinners, we’ve been on location together, we’ve had arguments. But I can tell you that I’ve never seen any of this behavior—ever.”\n\nIn the interview, Clooney also condemned the culture of silence around workplace harassment.\n\n“This is a big problem in our society, that people in power are taking advantage of people not in power—particularly powerful men with young women,” he said, mentioning that the downfall of other powerful men like Bill Cosby or Roger Ailes seems to have spurred evolving attitudes on this issue.\n\n“We’re all going to have to be more diligent about it and look for any warning signs,” he said. “Before, people weren’t paying enough attention to it. Now we have to. This is the moment to start scaring people like this into not acting this way anymore.”\n\nThis interview prompted Marquez’ tweet this week calling B.S. on Clooney. She also wasn’t pleased with Clooney’s statement later in the week, denying her blacklisting allegations.\n\nShe tweeted: “You lie!”\n\nhttps://twitter.com/vanessathought/status/919008059422253067", "images": ["https://www.mercurynews.com/wp-content/uploads/2017/08/07clooney1.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "http://thumbnail.newsinc.com/33097298.sf.jpg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/08/07clooney1.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/10/14/is-george-clooney-complicit-e-r-actress-says-he-helped-silence-her-sexual-harassment-charges/", "title": "Is George Clooney complicit? ‘E.R.’ actress’ says he helped silence her sexual harassment claims", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "A former 'ER' actress says George Clooney helped 'blacklist' her from the hit 1990s medical drama after she spoke up about sexual harassment on the set.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Is George Clooney complicit? ‘E.R.’ actress’ says he helped silence her sexual harassment claims", "url": "https://www.mercurynews.com/2017/10/14/is-george-clooney-complicit-e-r-actress-says-he-helped-silence-her-sexual-harassment-charges/", "description": "Former ‘ER’ actress Vanessa Marquez says George Clooney helped ‘blacklist’ her from the hit 1990s medical drama after she spoke up about sexual harassment on the set.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/08/07clooney1.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2017-10-14T15:45:19+00:00", "modified_time": "2017-10-15T13:07:16+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Is George Clooney complicit? ‘E.R.’ actress’ says he helped silence her sexual harassment claims"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/08/07clooney1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1507910400.0, "source": "http://www.mercurynews.com", "summary": ""}