{"url": "https://www.hollywoodreporter.com/live-feed/supernatural-season-13-premiere-explained-1048340", "text": "\"The feeling of sadness and the feeling of loss, that doesn't go away,\" executive producer Brad Buckner said about this season's darker tone.\n\n[Warning: The following story contains spoilers from Thursday's Supernatural season 13 premiere.]\n\nThirteen years in, Supernatural is changing up its formula.\n\nThe CW's longest-running series following demon-hunting brothers Sam (Jared Padalecki) and Dean Winchester (Jensen Ackles) has always been known for its high-stakes, far-reaching adventures, whether it's killing monsters, getting stuck in battles between Heaven and Hell or literally saving God (Rob Benedict) and the world. But the season 13 premiere pumped the brakes on the big action, instead focusing on the brothers' reactions to losing their mother Mary (Samantha Smith), their best friend/angel ally Castiel (Misha Collins) and demon frenemy Crowley (Mark Sheppard), all in one fell swoop. The end result was an hour that felt entirely unlike anything Supernatural has done before, with a feeling of profound loss and hopelessness permeating both the characters and the story, breathing new life into the old series.\n\nAs Sam and Dean tracked down Jack (Alexander Calvert), the son of Lucifer (Mark Pellegrino), while trying to repress their emotions, an overwhelming sense of sadness created a unique character study in what made each of the brothers so different. By the end of the hour, Dean lost all hope, breaking down and punching a wall until his knuckles bled as his prayers to God fell on deaf ears. On the flip side, Sam tried to think of literally anything they could do to fix what had been irrevocably broken, whether that meant figuring out a way to get their mother back or if it just meant saving the son of Satan and helping him find the good inside of him.\n\nExecutive producers Brad Buckner and Eugenie Ross-Leming theorize that this exploration of what makes the brothers different on a fundamental level as they deal with grief and the loss of hope is why the premiere (and subsequently the entire season) will stand out from past Supernatural seasons.\n\n\"The feeling of the first episode is a little different from our usual whiz-bang storytelling with lots of effects,\" Buckner told THR along with a small group of reporters. \"The feeling of sadness and the feeling of loss, that doesn't go away. We don't bounce back from it right away. To take our time and explore how you work your way out of that is an interesting thing for us.\"\n\nEugenie-Ross said that because it's the 13th season, the producers had to figure out a way to go deeper with the brothers and the journey they've been on for more than a decade. Things had gotten too comfortable, which is why the premiere had \"a reflective quality to it.\" And although viewers know that Castiel is coming back and their mother is alive (albeit trapped in an alternate Hell world with Lucifer himself), Sam and Dean don't.\n\n\"It influences particularly Dean's state of mind,\" Buckner said. \"Both the guys have had to rebound from stuff over and over and just shake it off and go on with the family business, and this overwhelming loss at the start of the season is something that Dean just can't dig his way out of.\"\n\nLosing essentially every ally they have signals a deep psychological shift in Dean that has only been explored in small doses before, like with his alcoholism and eschewing any kind of real romantic connection. \"It's another nail in the coffin about the loss of hope,\" Eugenie-Ross said. \"He has to come up with a reason to have purpose. Every battle he feels like he's swimming backwards. You just feel that there is this growing hopelessness and futility to his existence, that could lead to certain kind of nihilism. For him, it's a personal loss but it's also a cosmic loss of what's the point of being here when you scream at the wilderness and get nothing back.\"\n\nDean has always been a deeply flawed character, shooting first and asking questions later, but Sam has always been able to balance his older brother out. Padalecki explained that's because Sam believes he's good with \"everything that's happened, all the wrong roads he's taken.\" However, the divide between how they each handle loss and defeat has never been wider than it is now, and that will \"lead to conflict\" between the brothers.\n\n\"Sam still has this optimism, this hope,\" Padalecki said. \"Whereas Dean, especially in this episode, he's concerned that he is not, everything's going wrong. Sam takes the optimistic route and Dean is nihilistic and pessimistic. Sam sometimes creates his own carrot on the stick to go after. The way he grieves seems to be, 'I'm going to try to focus on this.'\"\n\nWhile \"Sam is forced to be put in the position of being the cheerleader because profound grief can create such inertia,\" according to Buckner, \"[Dean] needs a big piece of hope, he just needs some indication, some little light at the end of the tunnel to show that it's not all as dark as he thinks it is. He just has no lifelines left at this point.\"\n\nThat's definitely not a good place to be when tasked with the responsibility of raising Lucifer's all-powerful son.\n\nSupernatural airs Thursdays at 8 p.m. on The CW.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/09/qd3ii-x2.jpeg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/10/sn1301a_0112r2_copy_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/10/sn1301a_0112r2_copy_-_h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/10/sn1301a_0112r2_copy_-_h_2017.jpg", "keywords": [], "authors": ["Sydney Bucksbaum", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/supernatural-season-13-premiere-explained-1048340", "title": "How the 'Supernatural' Premiere Sets Up a Different Season 13", "meta_data": {"viewport": "width=device-width", "description": "\"The feeling of sadness and the feeling of loss, that doesn't go away,\" executive producer Brad Buckner said about this season's darker tone.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/supernatural-season-13-premiere-explained-1048340", "domain": "https://www.hollywoodreporter.com/", "title": "How the 'Supernatural' Premiere Sets Up a Different Season 13", "description": "\"The feeling of sadness and the feeling of loss, that doesn't go away,\" executive producer Brad Buckner said about this season's darker tone.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/10/sn1301a_0112r2_copy_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "How the 'Supernatural' Premiere Sets Up a Different Season 13", "description": "\"The feeling of sadness and the feeling of loss, that doesn't go away,\" executive producer Brad Buckner said about this season's darker tone.", "url": "https://www.hollywoodreporter.com/live-feed/supernatural-season-13-premiere-explained-1048340", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/10/sn1301a_0112r2_copy_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "How the 'Supernatural' Premiere Sets Up a Different Season 13", "sailthru.description": "\"The feeling of sadness and the feeling of loss, that doesn't go away,\" executive producer Brad Buckner said about this season's darker tone.", "sailthru.author": "Sydney Bucksbaum", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-10-12 18:00:00", "sailthru.tags": "Live Feed, Television, Jared Padalecki, Supernatural, autoplay"}, "movies": [], "publish_date": 1507802400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}