{"url": "https://www.cheatsheet.com/entertainment/a-look-inside-each-of-kim-kardashians-three-marriages.html/", "text": "It’s hard to imagine Kim Kardashian being married to anyone but Kanye West. However, she’s been married not just once, but twice before him. Each marriage for Kardashian has been completely different from the other, and they help us see how much she and West are truly meant to be together. Here’s an inside look at each of Kardashian’s three marriages.\n\nDamon Thomas\n\nLeft: Kim Kardashian | Dimitrios Kambouris/Getty Images for Tiffany & Co., Right: Damon Thomas | Frazer Harrison/Getty Images Left: Kim Kardashian | Dimitrios Kambouris/Getty Images for Tiffany & Co., Right: Damon Thomas | Frazer Harrison/Getty Images\n\nMost people don’t even realize Kardashian was ever married to music producer Damon Thomas. They wed in 2000, when Kardashian was just 19 years old (and Thomas was 29). While they separated in 2003 and were officially divorced in 2004, it wasn’t revealed until 2010 just how tumultuous their marriage really was.\n\nIn their divorce papers, Kardashian detailed how controlling and abusive he had been to her. “Damon decided what we would do and when we would do it,” she wrote. “He was very much the ‘king of the castle.’”\n\nKardashian also claimed he was the one to pressure her into her first plastic surgeries to make her “perfect.” Things got even worse, however, as Kardashian became the victim of domestic violence. The Daily Mail reported, “Thomas would punch her in the face, slam her against walls and throw her across the room, leaving her bruised and battered.”\n\nThomas has since denied these allegations, but the words he’s used to describe his ex-wife certainly didn’t help his case. He told In Touch magazine, “Kim is obsessed with fame. She can’t write or sing or dance, so she does harmful things in order to validate herself in the media. That’s a fame-whore to me.”\n\nKris Humphries\n\nKim Kardashian and Kris Humphries | Pascal Le Segretain/Getty Images Kim Kardashian and Kris Humphries | Pascal Le Segretain/Getty Images\n\nIt’s safe to say Kardashian’s marriage to Kris Humphries was over before it began. They started dating in 2010, and by 2011, they were engaged. Humphries proposed to Kardashian with a whopping 20.5 carat ring (and the whole thing was filmed for Keeping Up With the Kardashians). So, of course, Kardashian said yes. They tied the knot in August 2011 — but it didn’t take long for Kardashian to realize she’d made a mistake.\n\nApparently, she realized their relationship was doomed on their honeymoon. During an appearance on Watch What Happens Live with Andy Cohen, Kardashian got totally candid about her 72-day marriage. An audience member asked the reality star which was her least-favorite of Keeping Up With the Kardashians spin-offs.\n\nKardashian didn’t hesitate to answer: “When Kourtney and I did New York because I was in that awful cry face with that last marriage I had. That whole situation was just really hard for me.”\n\n“At the time I just thought, ‘Holy sh*t, I’m 30 years old — I better get this together,” she explained. “I better get married. I think a lot of girls do go through that, where they freak out thinking they’re getting old and all their friends are having kids. So, it was more of that situation. But I knew on the honeymoon it wasn’t going to work out.”\n\nKanye West\n\nKim Kardashian and Kanye West | Kim Kardashian and Kanye West | PeopleStyle via Twitter\n\nIt was a long road for Kardashian to end up with Kanye West, but it seems like they were destined to be together eventually. They started dating in 2012, but they first met way back in 2003 and had been friends since. Even if West was smitten with Kardashian for years, it’s best that they only started dating when they did.\n\nKardashian admitted, “I think I had to go through that [breakup with Kris] to figure out what I wanted. After my breakup, I was feeling really low and down and he said, ‘Just come to Paris and see my fashion show.’”\n\nThey got married in 2014, and have since become parents of three to North, Saint, and Chicago. Although divorce rumors have popped up a few times over the years, they keep proving to be a perfect match for each other.", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png", "https://www.cheatsheet.com/wp-content/uploads/2018/08/GettyImages-114874799-1024x682.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/03/kim-kanye-7.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/a-look-inside-each-of-kim-kardashians-three-marriages.html/", "title": "A Look Inside Each of Kim Kardashian’s Three Marriages", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/a-look-inside-each-of-kim-kardashians-three-marriages.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "It’s hard to imagine Kim Kardashian being married to anyone but Kanye West. However, she’s been married not just once, but twice before him.", "og": {"locale": "en_US", "type": "article", "title": "A Look Inside Each of Kim Kardashian's Three Marriages", "description": "It’s hard to imagine Kim Kardashian being married to anyone but Kanye West. However, she’s been married not just once, but twice before him.", "url": "https://www.cheatsheet.com/entertainment/a-look-inside-each-of-kim-kardashians-three-marriages.html/", "site_name": "Showbiz Cheat Sheet", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Kim Kardashian", "section": "Entertainment", "published_time": "2018-10-26T13:58:39-04:00"}, "twitter": {"card": "summary_large_image", "description": "It’s hard to imagine Kim Kardashian being married to anyone but Kanye West. However, she’s been married not just once, but twice before him.", "title": "A Look Inside Each of Kim Kardashian's Three Marriages", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Kim-Kardashian-and-Damon-Thomas-2.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1540576719.0, "source": "https://www.cheatsheet.com", "summary": ""}