{"url": "https://www.elle.com/fashion/a16811985/fifty-shades-freed-wedding-dress-monique-lhuillier/", "text": "Fifty Shades Freed wastes zero time—the final installment of the films based on E.L. James' (dominant) boy meets (virginal) girl story dives right in to the nuptials of Christian Grey (played by Jamie Dornan) and Anastasia Steele (Dakota Johnson). When we meet Ana this time around, she's wearing her wedding dress: a lace-and-tulle confection that cascades to the ground in an elegant train.\n\nThe woman responsible for the memorable dress is Monique Lhuillier, who also designed the silver slip dress Ana wore to the masquerade ball in the second film, Fifty Shades Darker. We talked to Lhuillier over the phone about whether we can get our hands on Ana's dress (yes), how long it takes to make (a really long time), and what underwear one wears under such a body-skimming garment (thongs!).\n\nUniversal Pictures\n\nWhat was your starting point with the wedding dress?\n\nI wanted to make sure it was iconic and very memorable, because once it's in a film it lives forever. So I wanted to create something traditional but with a modern twist, and really make sure it encompassed Anastasia's personality. I also wanted it to have the aesthetic of my collections, knowing the reason they came to me was showcasing my design aesthetic through the character.\n\nHow much attention do you pay to current trends when you are designing for a film?\n\nI was fortunate to be given freedom with this dress—[apart from basic details like] she's getting married in the scene, she likes long sleeves. But they were open to any ideas. So I sketched three options and chose fabrics and presented it to them—they came back with the selection and that's how we ultimately landed on that dress.\n\nWill people be able to buy this dress?\n\nYes, eventually. Right now it doesn't exist in the collection, but it 's something that we're open to once there's a demand for it.\n\nUniversal\n\nHow long did it take to make?\n\nIt was quite a short turnaround—I would say from concept to the actual dress, maybe three months. The reason being that we had just finished the last details for the grey/silver dress, and they said, We'd love for you to do the wedding dress. So as I was finishing one, that was when the other task came. They filmed the movies back to back, so I had more time with the first dress than I did with the wedding dress.\n\nHow stressful!\n\nBut the thing is, that's what I do best. I have a factory here in Los Angeles, and we do everything from scratch here in-house. That's the beauty of it, I can make things quickly.\n\nHow long would it usually take to have a custom Monique Lhuillier dress made?\n\nIf you walked into my store and ordered something off the rack, it takes us six months to do that. When I work one-on-one with a client and design a custom dress from sketch to final fittings, we ask for 11 months.\n\nDakota Johnson (as Ana) wears Monique Lhuillier in Fifty Shades Darker Universal Pictures\n\nDakota Johnson said that she had some fittings for the dress. How did that go? Did she have any input?\n\nEven going back to the first dress, it was an open dialog the entire time. We'd say, \"Let's raise the neckline a little bit for the grey dress, because [Ana] is more demure. We didn't want it to be too sexy. So we customized each look and each feeling at the beginning and tweak it as we went along.\n\nThe point of view for the [Darker] dress was a man selecting the dress for her, so it was more sleek and modern. We added the cape because we wanted more drama and movement when she walked into the masquerade ball. The wedding dress was more from her point of view—selecting the dress of her dreams, reflecting what her personal style is, so we did less tweaking to that. Once the design was selected, we were just perfecting the fit. The design didn't change because it was clear from the start what we wanted to do.\n\nWhat's the connection between your own collections and this wedding dress?\n\nMy dresses are always very feminine, elegant, modern. They're also traditional with a modern twist. Fabrications change, but you can usually tell a dress is a Monique dress when you see it. Usually my wedding dresses, I push and make them a little more fantasy, because this is when you can do that and shine. My ready to wear collections are a little more pared back. They're more fashion and a little more forward.\n\nUniversal Pictures\n\nThe wedding dress has an illusion back and clings closely to Ana's figure—honestly, what kind of underwear can you wear underneath?\n\nThe reason I loved how this dress turned out is because it's very sensual and elegant, but it doesn't show too much. It leaves a lot to the imagination. The lace is very refined; it's cut close to the body, and I scooped the back and used a sheer lace overlay so you get the illusion of seeing more than you are. You can easily wear something like the with that and it'll work beautifully. No lines. I also paired the dress with a very elegant cathedral length veil, which is voluminous and has a lot of lace appliqués. I thought the balance of the grandiose veil with the slimmer silhouette of the gown was beautiful.\n\nWhat fabrics did you use?\n\nMostly it's a chantilly lace from France. It's very lightweight and delicate, and it's something I use in most of my collections. It's a signature fabric of mine.\n\nIt continues down into the train, too.\n\nWe hand-appliquéd a border all around the hemline, and that's lined with silk chiffon and a lot of sheer tulle. So there's a lot of structure in the dress, but you don't see it. It clings in the right places. My dresses are all very light—even if they are very designed in the construction, it's really complex. And whenever you pick up the dress, it's very light and airy.\n\nUniversal Pictures\n\nHow long does it take to put something like this on, with all those buttons and such a close cut of the body? Is it difficult to get dressed?\n\nIt's not difficult—you just need a little help, that's all.\n\nYou also designed some of the wedding looks for other characters, like Christian's mother Grace (Marcia Gay Harden) and Ana's friend Kate (Eloise Mumford). Can you tell me a bit about those outfits?\n\nThose dresses were not designed specifically for them—they were in the line already. The costume designer chose them and called me and said, \"I think you'll be so happy that it didn't just end with the wedding dress...these other characters are also wearing Monique.\" I was like, Oh my God, it's a Monique wedding! It's incredible. So I'm actually curious to see what they all end up with. I know they are wearing them, but I don't know which pieces they're wearing.\n\nIt'll be a nice surprise for you when you see the film.\n\nYes. I couldn't be happier with how it turned out. Two months before I got the call, I said, You know what? I'm ready to do a film. I'm ready to do something that's on the big screen that lives forever. I've had dresses in films but they've all been purchased from my stores, I didn't really get that involved. I just put it out there. And it's a good one!\n\nFifty Shades Freed is in theaters now.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.335xh;0,0.0171xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.335xh;0,0.0171xh&resize=1200:*", "keywords": [], "authors": ["Estelle Tang", "Senior Editor", "Estelle Tang Is The Former Senior Editor Of Elle.Com."], "canonical_link": "https://www.elle.com/fashion/a16811985/fifty-shades-freed-wedding-dress-monique-lhuillier/", "title": "Fifty Shades Freed Wedding Dress Interview Monique Lhuillier", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "It Took 3 Months to Make the 'Fifty Shades Freed' Wedding Dress", "description": "But Monique Lhuillier says it usually takes almost a year.", "url": "https://www.elle.com/fashion/a16811985/fifty-shades-freed-wedding-dress-monique-lhuillier/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.335xh;0,0.0171xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2019-10-24 03:25:52", "published_time": "2018-02-09 08:15:00", "section": "Fashion", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.335xh;0,0.0171xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Fifty Shades Freed Wedding Dress Interview Monique Lhuillier - Where to Buy Monique Lhuillier Fifty Shades Dress", "description": "Monique Lhuillier got the call to make a dress for Fifty Shades Darker—and ended up making the wedding dress for Fifty Shades Freed, too. We talked to her about the process, the design, and whether you can get Ana's frock for yourself.", "keywords": "fifty shades freed, monique lhuillier, fifty shades wedding, fifty shades wedding dress, fifty shades freed wedding dress, anastasia steele wedding dress, ana steele wedding dress, fifty shades freed costumes, monique lhuillier wedding dress", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.668xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Fashion,fashion,monique lhuillier,Fifty Shades Freed", "sailthru.date": "2018-02-09T20:15:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.335xh;0,0.0171xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/fifty-shades-freed-wedding-dress-dakota-johnson-jpg-1518203695.jpg?crop=1.00xw:0.668xh;0,0", "sailthru.socialtitle": "It Took 3 Months to Make the 'Fifty Shades Freed' Wedding Dress", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1518135300.0, "source": "https://www.elle.com", "summary": ""}