{"url": "https://www.themarysue.com/supergirl-s3-ep6-midvale/", "text": "Supergirl this week is a beautiful respite from the heaviness of previous episodes this season as Kara takes Alex back home to Midvale for a few days, to get away from the memories of Maggie in National City and begin to heal from her break-up. And without acknowledging it, perhaps Kara is there to do some healing from Mon-El, too. The episode is mostly a flashback to Young Kara and Young Alex during the time when they really and truly became sisters. Welcome to Season 3, Episode 6, “Midvale.”\n\n**THIS IS A RECAP – SPOILERS ARE PART OF THE TERRITORY.**\n\nS3, EP. 6 – THE RECAP\n\nThe episode opens with Kara and Alex driving to Eliza’s. “Welcome home,” Kara announces, as they drive into Midvale. Alex looks miserable. When they arrive at their childhood home, Eliza greets them with hugs, but Alex sulks and goes into the house without saying a word.\n\nLater, Kara is out on the porch drinking coffee when Eliza comes to join her. Kara says that she brought Alex here hoping to help her feel better, and Eliza agrees it might be good for her, saying that Alex needs to “lean into” her pain, rather than pretend it doesn’t exist. Then Eliza turns to Kara and her miserable year that has most recently taken Mon-El away from her. Eliza thinks that Kara constantly punishes herself for daring to have feelings and be weak sometimes, but Kara says that she’s “accepting the fact that I’m human,” and that she has to “walk away from certain…vulnerabilities,” meaning romantic relationships, among other things. Eliza urges Kara to remember to let herself heal, too. Kara insists she’s fine.\n\nUpstairs, Alex is drinking something much stronger than coffee in their childhood bedroom when Kara joins her. Kara tries to get her to talk about her feelings, and Alex calls Kara on her hypocrisy, saying that she’s asking Alex to talk now when she herself spent six months being closed off whenever Alex tried to help her. This leads to a fight, and the sisters go to bed angry.\n\nFLASHBACK TO “TEN YEARS AGO.” Young Alex (Olivia Nikkanen) and Young Kara wake up for school and race to the bedroom door. Kara lets Alex go out the door first, but then uses her super-speed to get to the bathroom first. Alex pounds on the door as Eliza calls them down to breakfast. In their high school years, Kara and Alex were not close. As they sit down to breakfast with Eliza, Kara resents that she has to go to school, while Alex resents Kara’s existence.\n\nAt school, Young Alex and Young Kara sit in history class, and Young Kara is bored and not paying attention. Their teacher, Mr. Bernard, calls on Kara to ask her who the General of the Continental Army was. “Isaiah Washington?” she guesses. Alex corrects her with the right answer: George Washington. Alex then goes on to give Mr. Bernard extra information, totally showing off to rub Kara’s nose in it. Later, in gym class, Kara excels and shows off on rope climbing for Alex’s benefit.\n\nLater, at lunch, Kara overhears two students talking about Superman in the lunch line and starts to geek out about him. The kids think that she and Superman are weirdos, Superman for wearing his underwear outside of his tights. The kids start belittling Kara, but Alex shows up and tells them to leave her alone. But when Kara thanks her, Alex coldly tells her she only did it because Kara was holding up the line.\n\nThe girls sit at separate tables during lunch. Alex sits with a table full of friends. Kara sits alone. A boy named Kenny walks in, and it’s clear he’s not one of the popular kids. A football player bullies him, and it’s all Kara can do not to use her powers to rain holy hell on him. Instead, she calms herself and calls Kenny over to sit with her after Alex rudely brushes him off. However, it becomes clear that he prefers talking to Kara. He asks her to go out with him that night, and she agrees.\n\nKara meets him to go stargazing, and he allows her to look through his telescope, which he’s ingeniously connected to his laptop, where he has a program that takes pictures from the telescope and uploads them directly to the hard drive. Kara is impressed. Kenny starts talking about his suspicions about what life might be like on other worlds out in space. Kara answers knowingly, saying that she “thinks” it’s probably just other people and families looking out at the stars asking the same questions. Kenny leans in for a kiss, and it looks like they might, but Kara gets nervous and stops. When Kenny says “I’m glad you’re my friend,” Kara agrees.\n\nKara is late coming home from her night out with Kenny, and as she sneaks into her bedroom, Alex flips on the light, demanding to know where she’s been. Kara doesn’t think it’s any of Alex’s business, but Alex is pissed because she knows that she’ll be the one who gets in trouble if Kara gets into trouble. Then it all comes out. Alex is pissed because when Kara arrived, she lost her father and had her whole world turned upside down. “Now, all I have is you,” Alex seethes. “And you’re not worth it.”\n\nThe next morning at school, Kara picks up police chatter with her super-hearing. The body of a 17-year-old boy has been found in the woods. She immediately thinks of Kenny and races to the crime scene. She sees Kenny’s body and screams as the police on the scene, including a Sheriff Collins, confirm that Kenny’s been killed, and that she can’t stay at an active crime scene.\n\nThe following day at school, Kenny’s locker is covered in “loving” messages and hearts from students, and Kara stands in front of the display, completely resentful of the hypocrisy. None of these kids knew him, and many of them bullied or made fun of him, and yet now that he’s dead, there’s this outpouring. Kara remembers the telescope, the photos on the laptop…and the football player that bullied Kenny.\n\nKara marches into the boys’ locker room to confront the football player. She suspects that Kenny had something on him in one of the photos on his laptop, and thinks that the football player hurt Kenny in order to keep the secret. When she twists the football player’s arm for answers, he squeals that he’s smoked pot, and that Kenny knew, but that when Kenny was killed, he was home and his mother can vouch for him. Furious, Kara storms out.\n\nKara visits Kenny’s parents to offer her condolences, and the police are there questioning his parents to see if Kenny had any enemies they knew about. When Kara arrives, Sargent Collins tries to have her leave, but she enters a conversation with Kenny’s parents. His mother tells Kara that he always said such nice things about her. She then asks Kara about Kenny’s telescope, which has gone missing and was his favorite thing. Kenny’s dad bitterly says that it doesn’t matter, because Kenny won’t be needing it anymore. Kara promises to find it for them. However, as Sargent Collins walks her to the door, he warns her off such a dangerous case. She agrees to stop her search. Heh.\n\nCut to Kara in the woods looking for the telescope when she’s startled by movement behind her. It’s Alex. When Kara asks her why she’s there, she reveals that Kenny used to tutor her in calculus, but kept it a secret, because he knew that Alex was embarrassed by it. Still, they too were friends, even if only in secret, and she came here to be closer to him. Kara tells Alex she’s looking for the telescope, and knows that this is the last place where he had it, but it’s not here. Alex encourages her to use her X-ray vision to find the laptop, and it occurs to Kara that perhaps Kenny had managed to take photos of something he wasn’t supposed to see, and maybe that’s what got him killed. Kara finds the laptop, and Alex says they need to get it home right away to find more evidence. She’s already a budding detective.\n\nBack at home, Kara mentions that Clark has a friend named Chloe (whassup Smallville reference!) who might be able to access the encrypted photo files off the drive. They send those files to Chloe, but there are still plenty of photos that are already viewable. In addition to photos of stars, they come across a photo of Alex’s friend Josie in a car in a romantic embrace with their history teacher, Mr. Bernard!\n\nThe next day, Alex confronts Josie about her relationship with Mr. Bernard, reminding her that what he’s doing is statutory rape, but Josie isn’t having it. She’s in love with him, says they’re in love with each other, and says that there’s only ten years between them, and that in five years no one will even bat an eyelash at the age difference. Alex tells her that Mr. Bernard may have killed Kenny to keep their relationship secret, and that that’s more important than keeping her secret. Josie is pissed and storms off, demanding that Alex not tell anyone.\n\nAlex and Kara walk home from school together (for the first time ever), talking about the case, when suddenly a car appears out of nowhere and tries to run them off the road. They would’ve been killed were it not for the fact that Kara can fly and she and Alex were able to not fall off a rocky ledge. When Eliza and the police come to get them later, Alex tells Eliza that it was Mr. Bernard, because Josie must’ve told him about the fact that Alex knows about their relationship and suspects him in Kenny’s death.\n\nAt home, Eliza orders Alex to go do her homework while she talks to Kara. She reprimands Kara, telling her to drop this, because it’s not up to her to have to save Alex, and that the thing she can do to help both Alex and herself stay safest is to not use her powers. But, since Kara might not listen to her, she’s invited over reinforcements: FBI Agent Noel Neil (Erica Durance), who looks an awful lot like Alura. Kara is shocked at first, thinking her mother has somehow appeared, but Agent Neil says that she has “one of those faces.” She warns Kara that she needs to not use her powers anymore, that she’s too young and needs to be “normal” right now, not worrying about being a hero. Kara is frustrated and insists that she’s not human, and never asked for these powers, but what good are they if she can’t use them to help others. She says that Earth will never be home to her. Still, Agent Neil manages to calm her down, and Kara agrees that she won’t use her powers anymore. When Agent Neil gets in her car to leave, we see that it was J’onn who’d shapeshifted into Alura-as-FBI-agent to guide Kara properly.\n\nThe next day, Josie confronts Alex for having gone to the authorities with information about her relationship with Mr. Bernard. Not only is Josie’s dad (rightfully!) pissed, but the police arrested Mr. Bernard yesterday afternoon. Turns out, Josie was with him when she and Kara were walking home from school, meaning it wasn’t him who ran them off the road! So…who was it?\n\nAlex hurries home to tell Kara the new information, and is determined to find out who Kenny’s killer is. Kara, however, is done. She’s finally decided to hang up her powers, knowing that no matter what they do, Kenny will still be gone. Alex is disappointed in Kara, but remains determined and, ever the budding detective, goes off to find someone who’ll help her.\n\nAlex finds Sargent Collins at a sports event and tells him that it wasn’t Mr. Bernard who ran them off the road. She also tells him about the laptop that she and Kara found, and that they’re in the process of getting the photos off of it, sure that Kenny’s killer is in one of the photos. Sargent Collins asks her to follow him somewhere more quiet so they can continue to talk.\n\nMeanwhile, Kara receives the files from Chloe, and among the photos is one of Sargent Collins involved in a drug deal! Uh-oh…\n\nNow alone in the stadium with Alex, Collins asks her what she knows about what’s on the laptop as Alex starts to get antsy about suddenly being alone with him. Suddenly Kara calls, and Alex answers her phone. Kara tells her about Collins, and Alex tries to play it off like it was a casual call, but Collins pulls a gun on her. He knows what’s up. He walks her deeper into the stadium basement, but not before calling the last number Alex dialed to see who it was, confirming that the call came from Kara at home, and hanging up the call.\n\nKara debates for, like, a milisecond as to whether she should use her powers to save Alex. She of course goes to save Alex. As she’s flying there, Collins explains why he felt entitled to sell drugs (which, in a nice change of pace, came over the border…from Canada!). Alex is way braver than he’s expecting, and she keeps talking tough. Collins says that no one can hear her, but in a stunning display of faith Alex says that there’s someone who can hear her, and who’s coming. Kara bursts through the wall, stops Collins, and saves Alex.\n\nThe next day at school, Alex tries to talk to Josie, but Josie ignores her. Alex’s friends disperse, and so Alex sits with Kara who, as usual, was alone. “So, we found out the douche quarterback was smoking pot, caught a predator, and solved a murder,” Alex says. “We’re doing pretty well this week. And everybody hates us.” Kara mentions that there was one photo that Chloe pulled out of the files, but sent a hard copy of from Kenny’s laptop: a photo of Kara in flight. He knew about her powers. He liked her, all of her, and kept her secret to himself. Kara regrets not kissing him. Alex asks Kara if she wants to hang out later, and Kara agrees. Alex apologizes for being so hard on her. “I’ve never had a sister,” she says. “I promise I’ll get better at it.”\n\nLater at home, Eliza gives them a delivery from Kenny’s mother. They found the telescope and thought the girls should have it. Reconciled, and better friends and sisters for this shared experienced, the girls go to bed. END FLASHBACK.\n\nAdult Alex wakes up in her childhood bed and goes downstairs to find Kara on the porch with Kenny’s telescope, which is still set up there. They talk about the Kenny situation, and how it was then that Alex realized what she and Kara could do together. Alex is glad that Kara brought her here, and Kara apologizes for having been closed-off about how she was dealing with her Mon-El feelings. She says that she’s never felt at home on Earth, and that maybe she never will, but “I feel at home when I’m with you.” They make up.\n\nAt the end of the weekend, they head back to National City with Eliza-packed snacks and with Alex driving, because Kara is apparently a crappy driver, and if anything happens to J’onn’s car, he’ll kill them. As they drive away, Alex turns on some music, and they both sing along to “Sweet Escape.”\n\nS3, EP. 6 – THE REVIEW\n\nThis is one of my favorite episodes of the show ever, and it’s in large part due to the absolutely perfect casting of Young Alex and Young Kara. This episode was entirely dependent on those young actresses carrying the episode, and they did. Olivia Nikkanen was a revelation as Young Alex, and was a spot-on young Chyler Leigh not just looks-wise, but vocally. A couple of times, I closed my eyes and it sounded like I was listening to Leigh in the part. Nikkanen is also a strong actress in her own right, and struck an amazing balance between Alex’s rage, her vulnerability, her determination in solving the case, and her ultimate loneliness and need to let Kara in.\n\nIzabela Vidovic was a perfect Kara, but whereas Nikkanen was a strong Alex vocally, Vidovic’s strengths as Kara were more in her mannerisms and physicality. She embodied a young Supergirl perfectly, and also brought the right balance of sweetness and bitterness to a teenage Kara Danvers. The girls had amazing chemistry with each other, too, and were a pleasure to watch.\n\nAgain, the episode was a welcome respite from the intense episodes that preceded it this season. It kind of felt like a Veronica Mars episode, which I mean as a total compliment. All the teen characters were nuanced and written with a huge amount of respect. Kara and Kenny’s relationship read immediately within a couple of lines of dialogue, which is hugely important as whether we’re invested in Kara caring about his death is dependent on the viewer buying their feelings for each other. Ivan Mok’s Kenny was a geeky sweetheart with depth, and the idea of that lost potential, of Kara never having kissed or dated him, was really sad.\n\nI’ve also gotta big up the fact that Kara’s romantic interest was a handsome Asian kid. It’s all-too-rare for Asian men in particular to be cast as romantic leads, so it was nice to see the show cast this way for Kara. And speaking of inclusion, I noticed that Midvale has a lot of PoCs living in it. For example, see the cafeteria photo above. Kara is surrounded by PoC in that scene, and while there are plenty of white people in Midvale as you might expect, I noticed that there was a strong effort made to ensure that the background actors weren’t completely lily-white.\n\nAs for the adult side of the episode, I always love watching Melissa Benoist and Chyler Leigh have scenes together, as they have created such a beautiful, multi-faceted relationship for Kara and Alex over the past three seasons. I was happy that the characters were given the opportunity to, as Eliza said, “lean into” their painful feelings and recognize when they were being closed off.\n\nI loved that “Midvale” was an episode entirely devoted to the moment in time that the Danvers sisters actually became the Danvers sisters, and it makes so much sense that this episode happened after both Kara and Alex have lost their significant others. “Midvale” reminds us that romantic relationships will come and go for these two, but the OTP of this show will always be Kara and Alex. They are the true love story of Supergirl.\n\nDid you enjoy this glimpse into Kara and Alex’s childhood? Were you into “Midvale?” Let’s chat about it in the comments below!\n\nSupergirl airs Mondays at 8PM ET/PT on The CW.\n\n(image: Robert Falconer/The CW)\n\nWant more stories like this? Become a subscriber and support the site!\n\n—The Mary Sue has a strict comment policy that forbids, but is not limited to, personal insults toward anyone, hate speech, and trolling.—\n\nHave a tip we should know? tips@themarysue.com", "images": ["https://www.themarysue.com/wp-content/uploads/2017/11/Supergirl-S3-Ep-6-5.jpg", "https://am21.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-3-650x433.jpg", "https://am24.mediaite.com/tms/cnt/themes/m2019-tms/images/network/ambotv-logo.svg", "https://am22.mediaite.com/tms/cnt/uploads/2020/02/SPG513b_0004r-432x243.jpg", "https://secure.gravatar.com/avatar/d55bb62ffc7adc16ed11210c13a3727f?s=192&d=mm&r=pg", "https://am22.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-5-650x433.jpg", "http://pixel.quantserve.com/pixel/p-41YeEX_ui4Qms.gif", "https://am21.mediaite.com/tms/cnt/themes/m2019-tms/images/promo-gossip.jpg?v=1", "https://am23.mediaite.com/tms/cnt/uploads/2020/04/bro-thor-endgame-288x162.jpg", "https://am23.mediaite.com/tms/cnt/uploads/2019/11/iris-and-lois-crisis-432x243.jpg", "https://am23.mediaite.com/tms/cnt/uploads/2019/11/melissa-benoist-432x243.jpg", "https://am24.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-6-650x433.jpg", "https://am22.mediaite.com/tms/cnt/themes/m2019-tms/images/network/tms-logo.svg", "https://am23.mediaite.com/tms/cnt/uploads/2020/04/steak-umms-coronavirus-twitter-tweets-432x243.jpg", "https://am24.mediaite.com/tms/cnt/uploads/2020/02/SPG513b_0224r-432x243.jpg", "https://am23.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-14-650x433.jpg", "https://am24.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-1-650x433.jpg", "data:image/png;base64, iVBORw0KGgoAAAANSUhEUgAAADoAAAAUCAMAAADrw95cAAAA1VBMVEWwNyywOC3puLD+/v67Jw+DRT+Jh4a5KRKBRD+9hnzIkIbLy8vRmY9wPTf+MjD+pqT+srD+w8H+zsyNVUuOTkg+PDqQUEuSUk2VU06VXFOZVlOoqaqurq6zfHFtPDW6KBGGSUOGTUSPT0qKUEjS0tLT0c/z9vT69/R1PzmaV1ONUUqNU0r+EA+BgYF+fn6ESEGUU06kYFylYV2ART2hYVuTWFGITkZQLSybV1ObWVWdZVyqcWjZ19Xw8PCtdWuKSkWxa2eKTEa0dW20s7KBSkCMSkaMTUfAtLxEAAAAA3RSTlO9vb3TS7ZZAAAA5ElEQVR4XqXUhYrDQBQF0Enui3uq7u6y7v7/n9QmKTRDWbqZvQx3wsDhQYzJTCOBtA6QkWAkpolSjRuq56/eO/d/tWm6ef34/hqNRWjxjWi92wrQu9tqDLLRdql88/Dy+VhZlUttOg+OhTM6tQvqEFGGasGe/krj5inl6vDmAYK5h3ruOgEAojpdgeIFnjYB3w0Ruj7QTE2KSKqS5ukMp8zSFLhEdROo9Z/7NcDU+al0gZJjwFosFxYMh781AFfxOU9J6TUGT4NGTyHK/kpMuj/dCVEWKhzWEpXafz51WRL7wUjyHmbmHRgO5t96AAAAAElFTkSuQmCC", "http://b.scorecardresearch.com/p?c1=2&c2=9304643&cv=2.0&cj=1", "https://am22.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-16-650x433.jpg", "https://am22.mediaite.com/tms/cnt/uploads/2020/04/chosen-ones-giveaway-300x600-1.png", "https://am24.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-15-650x431.jpg", "https://am22.mediaite.com/tms/cnt/uploads/2020/01/super-but-not-natural-432x243.jpg", "https://am23.mediaite.com/tms/cnt/themes/m2019-tms/images/network/lnc-logo.svg", "https://am23.mediaite.com/tms/cnt/uploads/2014/08/Jaime-Outlander-320x240.jpeg", "https://am24.mediaite.com/tms/cnt/uploads/2019/10/riverdale-season-premiere-KJ-apa-432x243.jpg", "https://am23.mediaite.com/tms/cnt/uploads/2020/04/steak-umms-coronavirus-twitter-tweets-288x162.jpg", "https://am21.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-12-650x464.jpg", "https://am21.mediaite.com/tms/cnt/uploads/2020/04/MarySue-Sponsored_b-288x162.jpg", "https://am23.mediaite.com/tms/cnt/uploads/2019/01/Zendaya-288x162.jpg", "https://am24.mediaite.com/tms/cnt/uploads/2017/11/Supergirl-S3-Ep-6-13-571x800.jpg", "https://am21.mediaite.com/tms/cnt/themes/m2019-tms/images/network/mediaite-logo.svg"], "top_img": "https://www.themarysue.com/wp-content/uploads/2017/11/Supergirl-S3-Ep-6-5.jpg", "keywords": [], "authors": ["For More Info", "Go Here", "Https", "Teresajusino.Com", "To Support My Other Endeavors", "Http", "Patreon.Com Teampomonok"], "canonical_link": "https://www.themarysue.com/supergirl-s3-ep6-midvale/", "title": "Supergirl Recap: The Danvers Sisters Go Back to “Midvale”", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.5, minimum-scale=1.0", "fb": {"pages": "https://www.facebook.com/themarysue"}, "date": "2017-11-14T09:23:23-05:00", "og": {"title": "Supergirl Recap: The Danvers Sisters Go Back to “Midvale”", "image": "https://www.themarysue.com/wp-content/uploads/2017/11/Supergirl-S3-Ep-6-5.jpg"}, "description": "Welcome to Season 3, Episode 6, \"Midvale.\"", "keywords": "chyler leigh,erica durance,ivan mok,melissa benoist,olivia nikkanen,supergirl (tv show),the cw", "generator": "WordPress 2020.16", "twitter": {"card": "summary_large_image", "site": "@themarysue", "creator": "@@teresajusino", "title": "Supergirl Recap: The Danvers Sisters Go Back to \"Midvale\"", "description": "Supergirl this week is a beautiful respite from the heaviness of previous episodes this season as Kara takes Alex back home to Midvale. Welcome to Season 3, Episode 6.", "image": "https://www.themarysue.com/wp-content/uploads/2017/11/Supergirl-S3-Ep-6-5.jpg"}, "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": null, "source": "https://www.themarysue.com", "summary": ""}