{"url": "https://en.wikipedia.org/wiki/Southern_Charm", "text": "Southern Charm is an American reality television series that debuted on March 3, 2014 on Bravo.[1][2] The series chronicles the personal and professional lives of seven socialites who reside in Charleston, South Carolina. The show focuses on the Southern culture and political history of the area, and has featured local historical places like Lewisfield Plantation and the Mikell House.[3] The series originally focused on Craig Conover, Cameran Eubanks, Jenna King, Thomas Ravenel, Shep Rose and Whitney Sudler-Smith. The series currently focuses on Conover, Eubanks, Rose, Kathryn Calhoun Dennis, Austen Kroll, Chelsea Meissner, Naomie Olindo and Eliza Limehouse. Of the original charmers, King left after the first season, Sudler-Smith departed after the third, and Ravenel left after the fifth. The remaining charmers joined in later seasons, Calhoun Dennis in the second, Olindo in the third, Kroll in the fourth, Meissner in the fifth, and Limehouse in the sixth. Past charmers include: Landon Clements (seasons 2-4).\n\nOn July 14, 2014, Southern Charm was renewed for a second season,[4] which premiered on March 16, 2015.[5] The third season premiered on April 4, 2016. The fourth season was announced on February 16, 2017 and premiered on April 3.[6]\n\nIn February 2018, Bravo announced the fifth season and it premiered on April 5, 2018.[7] In August 2018, Ravenel announced his departure from the show after five seasons due to sexual assault allegations against him, as well as claiming that the show \"took advantage of him.\"[8] Bravo confirmed his departure in September 2018 after Ravenel was arrested and charged with assault and battery.[9] The sixth season premiered on May 15, 2019, with Eubanks, Rose, Conover, Dennis, Kroll, and Meissner all returning, with both Naomie Olindo and Eliza Limehouse added to the main cast.[10]\n\nCast members [ edit ]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 10 March 3, 2014 ( ) May 5, 2014 ( 2014-05-05 ) 2 12 March 16, 2015 ( ) May 25, 2015 ( 2015-05-25 ) 3 14 April 4, 2016 ( ) July 5, 2016 ( 2016-07-05 ) 4 15 April 3, 2017 ( ) July 17, 2017 ( 2017-07-17 ) 5 17 April 5, 2018 ( ) July 30, 2018 ( 2018-07-30 ) 6 16 May 15, 2019 ( ) August 28, 2019 ( 2019-08-28 ) 7 TBA ( ) ( )\n\nOn October 27, 2016, Bravo ordered a spin-off series to Southern Charm, titled Southern Charm Savannah. The series follows the same premise as its predecessor series but is set in Savannah, Georgia.[11] The series is produced by Haymaker Production and Aaron Rothman, Irad Eyal, Sara Nichols, Luke Neslage and Jessica Chesler, Jason Weinberg, Bryan Kestner and Whitney Sudler-Smith serve as the series' executive producers.[12] The series premiered on May 8, 2017.[13]\n\nIn April 2017, Bravo announced it was ordering two spin-offs, Southern Charm New Orleans and RelationShep.[14] RelationShep premiered on December 4, 2017, and followed the Southern Charm cast member as he looked for love.[15] Southern Charm New Orleans premiered on April 15, 2018[16] and its second season premiered on June 2, 2019.[17]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Southern_Charm", "title": "Southern Charm", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}