{"url": "https://www.thewrap.com/seal-team-valor-the-brave-military-dramas/", "text": "There seemed to be a theme at the 2017 Television Critics Association (TCA) summer press tour and it had to do with dusty vehicles and camouflage.\n\nThree military dramas will be hitting broadcast networks this fall: “The Brave” on NBC, “Valor” on the CW and “SEAL Team” on CBS. That’s not even taking into account the number of military shows already on TV, including long-running procedurals like “NCIS” and the post-apocalyptic “The Last Ship” on TNT. Other shows, like “The Night Shift” and the upcoming “S.W.A.T.” aren’t directly about the military, but feature characters with service pasts or with direct connections to combat scenarios.\n\nShowrunners and other execs said that the move wasn’t in response to current events and a possible resurgence in American pride; it was more of a coincidence. And it wasn’t until the TCAs that they noticed how their shows compared to each other.\n\nThe executive producers, showrunners and casts still made their cases to press, attempting to separate their show from the pack. While they are similar on the surface — and have comparable distinctive traits — there are some slight differences. But is it enough? Below, we’ve broken down the three dramas to see if first impressions are enough to provide uniqueness.\n\nAlso Read: CW 2017-18 Schedule: 'Jane The Virgin' Banished to Fridays, 'Valor' Will Follow 'Supergirl'\n\n“VALOR”\n\n“Valor” is the CW’s first military drama. Compared to “SEAL Team” and “The Brave,” it’s also specifically female-driven, character-focused and plays to more soapy sensibilities.\n\nWhile the conflicts of the pilot episode revolve around a botched mission and what exactly went wrong, protagonist Nora (played by Christina Ochoa) is dealing with the consequences of her PTSD, going back to flying after a month away and her growing dependence on prescription drugs. Meanwhile, her colleague Gallo (played by Matt Barr) is in a relationship with another woman who works on the base, but isn’t allowed to interact with her.\n\nKyle Jarrow, writer and executive producer on “Valor,” said he was inspired to create a military show because his brother served in the 173rd Airborne, which meant he got a closer look at how that kind of lifestyle affected people.\n\n“Folks in the military, like my brother, like these characters, are human beings. They are sleeping with people…. They’re cheating on people. They’re struggling with questions of personal morality and personal choices, just like we all do,” Jarrow explained. “It felt really important to dramatize that in telling a full story of what it’s like to be someone in the military.”\n\nBecause it’s on the CW, the scope is much smaller than on the other military shows. The pilot episode takes place almost entirely on the base and in the homes of the characters involved.\n\nAlso Read: CBS Sets Fall Premiere Dates for 2017-18 Schedule\n\n“SEAL TEAM”\n\nSo, is “Valor” the military drama of the season? You could say that, but “SEAL Team” also promises that viewers can expect more character-driven stories instead of just simply military raids or narratives. If anything, it’s not about the military at all, according to executive producers.\n\n“I don’t think our show is about the military. I think it’s about the people who do this work rather than about the work itself in some way,” EP Benjamin Cavell said.\n\nStar David Boreanaz agreed, calling it more of a “workplace show” that happens to involve special ops.\n\n“What’s interesting is the character that’s involved in the workplace show and how he deals with that specifically and, when he comes home, how he deals with his own inner turmoils and how he deals with his personal life,” Boreanaz, who plays Jason Hayes, leader of the Tier One team, explained to reporters.\n\nTo get at the heart of those characters, the “SEAL Team” execs stressed how much they utilized military consultants on the show.\n\n“We’ve had the real people who do this work in this project from the beginning, not from after we wrote a script and we called them as tech advisers,” Cavell said. “Their involvement predates that, and the DNA of this show is about the authenticity of the real stories of the people that we’re making it about — and I couldn’t be prouder of it.”\n\nRegardless of character work, the show does follow the Navy’s most elite special ops force, so there is some focus on current events, like the battle with the Islamic State. In a first look uploaded by CBS, the team is shown strategizing about a mission, going into a foreign country, and then going about attempting to succeed.\n\nIt’s unclear if this will play into our current political climate in any way, or if it’ll address the ethics and problems that go along with invading foreign lands and dealing with other people, specifically when they’re of a different religion, race or culture. The EPs promise, though, that “SEAL Team” isn’t all-American.\n\n“We want to have a diversity in our storytelling, and we don’t want to be a chest-pumping show,” said co-showrunner Ed Redlich. “Again, it’s the American military, and they go on, and they do stories. But, again, it’s how creatively and artistically you choose to tell a story.”\n\nAlso Read: NBC Shakes Up Fall Schedule: 'This Is Us' Back to Tuesdays, 'Chicago Fire' Moves to Thursdays\n\n“THE BRAVE”\n\nThen there’s “The Brave,” which also promises that it’ll be more about the people than the military set pieces. Execs say that it’ll stand out due its more gender-balanced and diverse cast. The main, eight-member list includes three women and four people of color.\n\n“I think what really drew us to join this project was the strength of women, the female characters in the show, not just out in the field, but in the DIA,” said co-showrunner Chris Ord.\n\nIn this one, the characters are what the execs call “realistic.”\n\n“I am really interested in resiliency as a characteristic of human beings. And so I’ve been a fan about reading about special forces operators for years, and I wanted to see them portrayed in a way that I felt was realistic,” said series creator Dean Georgaris.\n\nWhat separates “The Brave” from the pack is that, although it follows an elite special-ops military team, NBC describes it as a group of “elite undercover military heroes.” Characters are involved with intelligence work, sniping and other more discreet lines of combat. The focus is less on all-out warfare and more on espionage.\n\n“This isn’t your typical straightforward military show,” said actor Demetrius Grosse. “The thing that makes the show unique and special is that you see the behind-the-scenes things that you normally wouldn’t associate with military: espionage, code switching, deep cover kind of stuff.”", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/uploads/2017/08/Fall-TV-Shows.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/laura-bush-michelle-obama-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/white-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2016/11/crossoverfeature-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/04/bill-cosby-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2017/03/game-of-thrones-sex-scenes-gendry-melisandre-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/03/GettyImages-52741361-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2016/03/jimmy-fallon-donald-trump--160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/Dwayne-Johnson-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif", "https://www.thewrap.com/wp-content/uploads/2017/05/cbs-white-male-shows-160x105.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "keywords": [], "authors": ["Carli Velocci", "Tony Maglio", "Ryan Gajewski", "Daniel Goldblatt", "Rosemary Rossi", "Trey Williams"], "canonical_link": "https://www.thewrap.com/seal-team-valor-the-brave-military-dramas/", "title": "‘SEAL Team,’ ‘Valor,’ ‘The Brave': What Separates Network TV’s New Military Dramas?", "meta_data": {"parsely-title": "‘SEAL Team,’ ‘Valor,’ ‘The Brave': What Separates Network TV’s New Military Dramas?", "parsely-link": "https://www.thewrap.com/seal-team-valor-the-brave-military-dramas/", "parsely-type": "post", "parsely-pub-date": "2017-08-27T14:56:54-07:00", "parsely-section": "tv", "parsely-author": "Carli Velocci", "parsely-tags": "cbs, cw, cw_network, fall-preview, military-drama, nbc, seal-team, the-brave, valor", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "Three military dramas will be hitting broadcast networks this fall: \"The Brave\" on NBC,\" \"Valor\" on the CW and \"SEAL Team\" on CBS.", "news_keywords": "cbs, cw, cw network, fall preview, military drama, nbc, seal team, the brave, valor", "original-source": "https://www.thewrap.com/seal-team-valor-the-brave-military-dramas/", "og": {"locale": "en_US", "type": "article", "title": "'SEAL Team,' 'Valor,' 'The Brave': What Separates Network TV's New Military Dramas?", "description": "Three military dramas will be hitting broadcast networks this fall: \"The Brave\" on NBC,\" \"Valor\" on the CW and \"SEAL Team\" on CBS.", "url": "https://www.thewrap.com/seal-team-valor-the-brave-military-dramas/", "site_name": "TheWrap", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "valor", "section": "TV", "published_time": "2017-08-27T21:56:54-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "Three military dramas will be hitting broadcast networks this fall: \"The Brave\" on NBC,\" \"Valor\" on the CW and \"SEAL Team\" on CBS.", "title": "'SEAL Team,' 'Valor,' 'The Brave': What Separates Network TV's New Military Dramas?", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "creator": "@velocciraptor"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘SEAL Team,’ ‘Valor,’ ‘The Brave': What Separates Network TV’s New Military Dramas?", "sailthru.date": "2017-08-27T21:56:54+00:00", "sailthru.author": "Carli Velocci", "sailthru.tags": "cbs,nbc,cw,cw network,seal team,fall preview,valor,the brave", "sailthru.category": "tv", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed.png", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/08/military-dramas-hed-150x150.png", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": ["https://www.youtube.com/embed/8dqzih8hI1U", "https://www.youtube.com/embed/wKMPAOGIA7I", "https://www.youtube.com/embed/_09dg6TlM-s"], "publish_date": 1503896214.0, "source": "https://www.thewrap.com", "summary": ""}