{"url": "https://heightline.com/simone-alexandra-johnson-wiki-height-age/", "text": "Simone Alexandra Johnson is a model and the eldest daughter to Dywane Johnson; father, the famous ring wrestler known as the rock, who switched into the movie industry in 1999 and Dany Garcia; mother, a film producer, talent manager, business person and philanthropist.\n\nSimone Alexandra Johnson Wiki, Age\n\nSimone was born on August 14, 2001, in Davie, Florida United state but it was not long before her parents Dwayne Johnson and Dany Garcia got a divorce in 2008 after being together for 10 years.\n\nShe has tried within her power to keep her profile low despite being the daughter of a wrestler and movie star and the only means she uses to get to the world about herself is through social media platforms especially on her Instagram page where has over 189 thousand followers. Her captions on most of her pictures tell how amazingly she has moulded herself into becoming a strong woman. More so, her dad once made a post on his Instagram page about how he believed women are as strong as hell.\n\nDwyane Johnson is not the only wrestler in Simone’s lineage, her grandpa and great-grandfather are wrestlers and they have all derived their stage names from adding the ‘Rock’ to it.\n\nSimone welcomed a baby sister Jasmine Johnson with her stepmom Lauren Hashiann, Jasmine was born in the month of December 16, 2015\n\nSee Also: Dany Garcia Wiki, Bio, Relationship With Dwayne Johnson, Age, Net Worth\n\nSimone Alexandra Johnson’s Height and Body Stats\n\nAs a typical American, Simone has golden brown eyes and dark hair; she is 5’10 ft tall and she models for IMG models. On November 15, 2017, the Hollywood Foreign Press Association named Simone Alexandra Johnson the Golden Globe Ambassador for the 75th Golden Globe Awards. The newly renamed Ambassador position was previously called the “Miss Golden Globe” where basically her function is to present awards and escort presenters on and off the stage as well as presents some awards herself.\n\nDwyane Johnson once publicly announced how he has not approved of Simone dating just yet, in his own words, he boldly said he would choke anyone who comes around her with that intention. However, on Simone’s part, she has put full concentration on her career and studies not having time for side attractions despite her many followers on social media platforms.\n\nSimone noted in an interview that she intends to pursue a business degree in college and embark on a career in sports entertainment after which she would then like to transit to talent management just like her parents, obviously indicating how much she looks up to her parents as role models.\n\nSimone Alexandra’s Relationship with Dwayne Johnson\n\nMost people thought Dwayne Johnson’s bond with his daughter Simone would be shaky when his divorce from her mother was finalised, however, the bond only got stronger and she is often seen as her father’s alibi. It has also been said that Simone can be hilarious because she even uses father’s lines on him ‘can you smell what the rock is cooking’.\n\nThe random statement of girls being closer to their fathers rather than their mothers is expressively displayed in Simone’s life. Dwyane Johnson has severally displayed affection for his daughter Simone not only in the private aspect of her life also in public.\n\nHe has been his daughter’s inspiration and role model as she really wants to follow his footsteps when she gets older. She has also picked interest in being a WWE superstar in the nearest future. If she finally accomplishes this dream, she would be the fourth generation in her lineage that belong to the wrestling world.\n\nSee Also: Dwayne Johnson’s Height, Weight And Body Measurements\n\nDwayne Johnson Daddy Duties\n\nDwyane Johnson has proven in many ways that he is a great and super dad to his daughters and he never fails to show how proud he is of them. He let Simone follow him to all his super duper occasions and events. At the age of 15, Simone has amazingly walked down a lot of red carpet occasions while her father proudly showed her off. One of the trendy news Hollywood gave about Simone in 2017 was derived at the People’s Choice Award 2017 where Simone turned heads at the red carpet in an elegant black dress and her father Johnson gave her a gentle amazing kiss on the cheek before he accepted his award.\n\nIt is quite beautiful how Simone has not wasted the opportunities rendered by her parents into modelling her to be an amazing young woman. Considering the rumour of her Father Johnson planning to run for elections in 2020 we would expect an amazing first daughter.", "images": ["https://heightline.com/wp-content/uploads/20190617170853f7-01fe-66c8-8451-7a1b6c56aced.jpg", "https://heightline.com/wp-content/uploads/logo_heightline.png", "https://heightline.com/wp-content/uploads/Dwayne-Johnson.png", "https://heightline.com/wp-content/uploads/Linda-Nwadigwe-150x150.jpg", "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson-696x392.jpg", "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson.jpg"], "top_img": "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson.jpg", "keywords": [], "authors": ["Linda Nwadigwe"], "canonical_link": "https://heightline.com/simone-alexandra-johnson-wiki-height-age/", "title": "Simone Alexandra Johnson Wiki, Height, Relationship With Dwayne", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Simone Alexandra Johnson is a model and the daughter of star actor and former wrestler Dwayne Johnson and film producer Dany Garcia", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Simone Alexandra Johnson Wiki, Height, Relationship With Dwayne", "description": "Simone Alexandra Johnson is a model and the daughter of star actor and former wrestler Dwayne Johnson and film producer Dany Garcia", "url": "https://heightline.com/simone-alexandra-johnson-wiki-height-age/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People", "updated_time": "2018-01-19T12:30:21+00:00", "image": {"identifier": "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson.jpg", "secure_url": "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson.jpg", "width": 1280, "height": 720}}, "article": {"author": "https://web.facebook.com/lindachris35", "tag": "Linda", "section": "Celebrities", "published_time": "2017-12-28T11:14:00+00:00", "modified_time": "2018-01-19T12:30:21+00:00"}, "twitter": {"card": "summary", "description": "Simone Alexandra Johnson is a model and the daughter of star actor and former wrestler Dwayne Johnson and film producer Dany Garcia", "title": "Simone Alexandra Johnson Wiki, Height, Relationship With Dwayne", "image": "https://heightline.com/wp-content/uploads/Simone-Alexandra-Johnson.jpg"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1514459640.0, "source": "https://heightline.com", "summary": ""}