{"url": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(U.S._season_26)", "text": "Season twenty-six of Dancing with the Stars, titled Dancing with the Stars: Athletes, premiered on April 30, 2018, on the ABC network. The four-week season, the shortest ever, features a cast of current and former athletes.[1] This is the first season where more than one couple is eliminated each week.\n\nOn May 21, 2018, Olympic figure skater Adam Rippon and Jenna Johnson were announced the winners, marking the first win for Johnson. Rippon is the first openly gay winner. NFL player Josh Norman, with Sharna Burgess, and former Olympic figure skater Tonya Harding, with Sasha Farber, were both announced as runners-up.[2]\n\nCast [ edit ]\n\nCouples [ edit ]\n\nThe professional dancers were announced on April 12, 2018.[3] The eight professionals returning from last season are Lindsay Arnold, Alan Bersten, Sharna Burgess, Witney Carson, Artem Chigvintsev, Keo Motsepe, Gleb Savchenko, and Emma Slater. The two remaining professional dancers were both in the troupe last season, and have previously been professional dancers on the show: Sasha Farber (last competed in season 24) and Jenna Johnson (last competed in season 23). The five professionals from last season that are not returning are Cheryl Burke, Mark Ballas, Maksim Chmerkovskiy, Peta Murgatroyd, and Valentin Chmerkovskiy.\n\nThe cast was announced on April 13 on Good Morning America.[4]\n\nCelebrity Notability (known for) Professional partner Status Ref. Olympic snowboarder Eliminated 1st\n\non April 30, 2018 [5] Former MLB outfielder Former NBA center Eliminated 3rd\n\non May 7, 2018 [6] Notre Dame women's basketball player Former Olympic softball pitcher Eliminated 5th\n\non May 14, 2018 [7] Olympic luger Olympic figure skater Alan Bersten Former Olympic figure skater Runner-up\n\non May 21, 2018 [8] NFL cornerback Runner-up\n\non May 21, 2018 Olympic figure skater Winner\n\non May 21, 2018\n\nHosts and judges [ edit ]\n\nTom Bergeron and Erin Andrews returned as hosts, while Carrie Ann Inaba, Len Goodman, and Bruno Tonioli returned as judges.[9] On May 7, season 24 champion Rashad Jennings returned as a guest judge.[6] On May 14, season 24 runner-up David Ross returned as a guest judge.[7]\n\nDance troupe [ edit ]\n\nThe dance troupe for season 26 consists of season 25 troupe members Artur Adamski, Brandon Armstrong, Hayley Erbert, and Britt Stewart. Additionally, professional dancer Morgan Larson, who performed on the Dancing with the Stars: Light Up the Night tour, joined the troupe for season 26.\n\nScoring charts [ edit ]\n\nCouple Place 1 2 3 4 Adam & Jenna 1 24 37 + 37 = 74 39 + 2 = 41 30 + 28 = 58 Josh & Sharna 2 24 30+ 33 =63 36+ 2 =38 27+ 30 =57 Tonya & Sasha 2 23 33+ 33 =66 33+ 2 =35 26 + 30 = 56 Jennie & Keo 4 21 26 + 37 =63 29 Chris & Witney 21 33+ 33 =66 33 Mirai & Alan 23 37 + 37 = 74 35 Kareem & Lindsay 7 17 26 + 33 = 59 Arike & Gleb 20 33+ 37 =70 Jamie & Artem 9 19 Johnny & Emma 18\n\nRed numbers Indicates the lowest score for each week. Green numbers Indicates the highest score for each week. The returning couple that was the last to be called safe. The couple was eliminated that week. The winning couple. the runner-up couple the third place couple\n\nAverage chart [ edit ]\n\nThis table only counts dances scored on a 30-point scale (scores by guest judges and points awarded in the dance-offs are excluded).\n\nRank by\n\naverage Place Couple Total\n\npoints Number\n\nof dances Average 1 1 Adam & Jenna 166 6 27.7 2 2 Josh & Sharna 155 25.8 4 Mirai & Alan 103 4 4 2 Tonya & Sasha 151 6 25.2 5 7 Arike & Gleb 71 3 23.7 6 4 Chris & Witney 94 4 23.5 7 Jennie & Keo 88 22.0 8 7 Kareem & Lindsay 60 3 20.0 9 9 Jamie & Artem 19 1 19.0 10 Johnny & Emma 18 18.0\n\nHighest and lowest scoring performances [ edit ]\n\nThe best and worst performances in each dance according to the judges' 30-point scale (scores by guest judges are excluded) are as follows:\n\nCouples' highest and lowest scoring dances [ edit ]\n\nScores are based upon a potential 30-point maximum (team dances and scores by guest judges are excluded).\n\nCouple Highest scoring dance(s) Lowest scoring dance(s) Adam & Jenna Jazz (30) Cha-cha-cha (24) Josh & Sharna Freestyle (30) Paso doble (23) Tonya & Sasha Freestyle (30) Foxtrot (23) Jennie & Keo Foxtrot & Viennese waltz (21) Cha-cha-cha (19) Chris & Witney Viennese waltz (25) Salsa (21) Mirai & Alan Foxtrot (27) Salsa (23) Kareem & Lindsay Salsa (19) Cha-cha-cha (17) Arike & Gleb Foxtrot (24) Salsa (20) Jamie & Artem Viennese waltz (19) — Johnny & Emma Foxtrot (18) —\n\nWeekly scores [ edit ]\n\nIndividual judges' scores in the charts below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Len Goodman, Bruno Tonioli.\n\nWeek 1: First Dances [ edit ]\n\nThe couples danced the cha-cha-cha, foxtrot, salsa or Viennese waltz.\n\nFor the first time in the show's history, viewers were able to vote for the couples live online so that the results of the vote could be used to determine the first two eliminees that same evening.\n\nRunning order\n\nWeek 2: Team Dance Week [ edit ]\n\nIndividual judges' scores in the charts below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Rashad Jennings, Len Goodman, Bruno Tonioli.\n\nThe couples performed one unlearned dance and a team dance celebrating an iconic decade in sports. Paso doble and quickstep are introduced.\n\nRunning order\n\nWeek 3: MVP Night (Semifinals) [ edit ]\n\nIndividual judges' scores in the charts below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, David Ross, Len Goodman, Bruno Tonioli.\n\nThe couples performed one unlearned dance dedicated to the \"MVP\" in their lives, and participated in \"ballroom battle\" dance-offs for extra points. Former contestants were brought in to mentor the couples for the ballroom battles. Nastia Liukin mentored Jennie & Keo and Tonya & Sasha. Meryl Davis, season 18 champion, mentored Adam & Jenna and Mirai & Alan. Von Miller mentored Chris & Witney and Josh & Sharna. Contemporary, jive and rumba are introduced.\n\nRunning order\n\nWeek 4: Finals [ edit ]\n\nThe final three couples performed one unlearned dance inspired by their journey on the show and a freestyle. Jazz is introduced.\n\nRunning order\n\nDance chart [ edit ]\n\nThe celebrities and professional partners danced one of these routines for each corresponding week:\n\nWeek 1: Cha-cha-cha, foxtrot, salsa, or Viennese waltz (First Dances)\n\nWeek 2: One unlearned dance and team dances\n\nWeek 3: One unlearned dance and ballroom battles (MVP Night; Semifinals)\n\nWeek 4: One unlearned dance and freestyle (Finals)\n\nCouple 1 2 3 4 Adam & Jenna Cha-cha-cha Quickstep Freestyle\n\n(Team 1970s Football) Contemporary Jive Jazz Freestyle Josh & Sharna Cha-cha-cha Paso doble Freestyle\n\n(Team 1950s Tennis) Contemporary Salsa Foxtrot Freestyle Tonya & Sasha Foxtrot Quickstep Freestyle\n\n(Team 1950s Tennis) Rumba Cha-cha-cha Viennese waltz Freestyle Jennie & Keo Foxtrot Cha-cha-cha Freestyle\n\n(Team 1970s Football) Viennese waltz Cha-cha-cha Chris & Witney Salsa Viennese waltz Freestyle\n\n(Team 1950s Tennis) Foxtrot Salsa Mirai & Alan Salsa Foxtrot Freestyle\n\n(Team 1970s Football) Quickstep Jive Kareem & Lindsay Cha-cha-cha Salsa Freestyle\n\n(Team 1950s Tennis) Arike & Gleb Salsa Foxtrot Freestyle\n\n(Team 1970s Football) Jamie & Artem Viennese waltz Johnny & Emma Foxtrot\n\nHighest scoring dance Lowest scoring dance Gained bonus points for winning this dance-off Gained no bonus points for losing this dance-off\n\nRatings [ edit ]\n\nNo. Title Air date Rating/share\n\n(18–49) Viewers\n\n(millions) 1 \"Week 1: Premiere\" April 30, 2018 1.1/5 8.48[14] 2 \"Week 2\" May 7, 2018 1.0/4 7.73[15] 3 \"Week 3: MVP Night (Semifinals)\" May 14, 2018 1.0/4 7.68[16] 4 \"Week 4: The Finals\" May 21, 2018 1.1/5 8.77[17]", "images": ["https://upload.wikimedia.org/wikipedia/en/8/84/Dwts_athletes.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/84/Dwts_athletes.jpg/220px-Dwts_athletes.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/84/Dwts_athletes.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(American_season_26)", "title": "Dancing with the Stars (American season 26)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/84/Dwts_athletes.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}