{"url": "https://en.wikipedia.org/wiki/Mr._Big_(Sex_and_the_City)", "text": "John James \"Mr. Big\" Preston is a recurring character in the HBO series Sex and the City, portrayed by Chris Noth. He is the primary on-and-off love interest of the series' protagonist, Carrie Bradshaw, who usually simply refers to him as \"Big\".\n\nAccording to accounts in the press, the Mr. Big character was based on publishing executive Ron Galotti, former publisher of GQ and Talk. Bushnell told New York Magazine in 2004, \"He was one of those New York guys with a big personality—you just notice him as soon as he walks in the room,\" and \"I called him Mr. Big because he was like a big man on campus.\"[1] Big appeared in Comcast's list of TV's Most Intriguing Characters.[2]\n\nPilot episode [ edit ]\n\n\"Big\" appears in the first episode of Sex and the City as a very attractive stranger who helps Carrie pick up the contents of her purse (notably cosmetics and condoms) after she is accidentally bumped by a stranger on the streets of Manhattan. The nickname \"Big\" refers to his status as a \"major tycoon, major dreamboat, and majorly out of [Carrie's] league,\" according to the show's dialogue. (His real name is not revealed to viewers until the final episode of the series; in a running joke, whenever Carrie is about to introduce Mr. Big to another character onscreen, she is interrupted before she can say his name. When Carrie and her friend Samantha bump into Big at a nightclub, Samantha tries to hit on him, but he tactfully declines. In the first few episodes, he and Carrie frequently bump into one another, until finally Big suggests the two of them should \"bump into one another on purpose\". Carrie agrees and thus begins their on-again-off-again relationship. Big calls Carrie by the nickname \"Kid\". When Carrie asks Big if he has ever been in love, he replies, \"Ab-so-fucking-lutely\".\n\nStory arc [ edit ]\n\nCarrie eventually falls in love with Big, despite his fear of commitment. His reserved communication on relationship issues and Carrie's coping with the ambiguity are frequent plot devices. Carrie repeatedly returns to the relationship even though he is clearly emotionally unavailable to her and unable to meet her needs. It appears Mr. Big was emotionally crippled by a series of failed relationships. He has a tendency to take major emotional steps in the relationship more slowly than Carrie, which is depicted as a result of emotional unavailability. Carrie's interpretation of Mr. Big's inner turmoil as unreachable distance often creates larger issues because of her misplaced feelings of unworthiness, and due to her propensity for not communicating truthfully until too late, results in a lot of painful misunderstandings. Carrie can be un-empathetic and often issues ultimatums (i.e. first break-up), and Big can't shed his ingrained emotional pessimism to fully embrace Carrie as a partner. They break up repeatedly, over the course of two years for those reasons, before Big marries a twenty-six-year-old socialite and Ralph Lauren employee named Natasha (Bridget Moynahan) after dating her for only five months. This hurts Carrie, as she wonders why he could take steps with Natasha that he refused to take with Carrie. It becomes obvious later that Mr. Big had simply skipped many of the important emotional steps before marriage, many of which he had definitely, if slowly, taken with Carrie. Ironically this creates the problems of distance and unavailability between Big and Natasha, which Carrie had so feared in their own relationship.\n\nWithin seven months of his marriage, he begins to chafe at his matrimonial bonds and pines for Carrie; he initiates an affair with her. Carrie, who is in a committed relationship (with Aidan Shaw) at the time, feels guilty but continues to see Big. The affair continues until Natasha comes home unexpectedly and discovers Carrie fleeing—half dressed—from the marital apartment. Natasha trips and breaks her tooth while chasing after Carrie, who ends up taking Natasha to the emergency room. As a result, Carrie ends the affair. Carrie later finds out that Big and Natasha have divorced.\n\nBig and Carrie eventually become close friends. He relocates to Napa Valley, and they are able to discuss their other ongoing relationships with each other. But their sexual chemistry always remains just below the surface, and their friendship never remains strictly platonic. After reading Carrie's book, Big begins to understand how much he has hurt her, and he empathizes further when a famous actress he is dating treats him in a fashion similar to the way Big has treated Carrie: at arm's length, eschewing true intimacy. The relationship between Big and the celebrity is certainly a parallel between Carrie/Big, except that the celebrity refuses physical intimacy one-sidedly, ignoring Big's overtures except when it suits her, whereas Carrie/Big's problems were almost completely emotional and arguably two-sided. The experience ends up allowing Big to finally get past his inner pain. Big grows as an emotional being, changing and evolving as the series progresses, moving past innate pain to suit Carrie's needs better, ostensibly becoming a \"better man.\"\n\nBig seems to have no real friends, at least in New York. He is rarely shown with other males, and when he is, they are usually credited as colleagues or acquaintances. In one scene he is shown at a New Year's Eve party alone, eating while the celebration goes on around him, but seems to feel comfortable with the situation.\n\nSeries finale [ edit ]\n\nThe series finale, \"An American Girl in Paris\", ties together the loose ends of Carrie and Big's relationship and concludes their long, unconventional courtship. Absent for most of season six, Big suddenly reappears in Carrie's life near the end of the season, once again at the wrong time. At this point, Carrie has grown tired and frustrated with Big's inconsistency and angrily rebuffs him, but also realizes her behavior towards him has often pushed him away. However, Big is desperate to win Carrie back. The season finale depicts his attempt to reunite with her.\n\nThe series finale takes place over two episodes in which Carrie moves to Paris with her current boyfriend, Russian artist Aleksandr Petrovsky (played by Mikhail Baryshnikov). In the first half of the finale, \"An American Girl in Paris Part Une\", Big shows up outside Carrie's apartment in New York after she fails to return his phone calls. She is on her way to her last dinner with the girls before departing for Paris. Big attempts to invite Carrie to dinner and drinks in order to apologize for the way he treated her, only to be turned down. Carrie explains that she is moving to Paris with a man she's in a relationship with. Big asks Carrie when she was going to tell him that she was moving to Paris, a reference to the time earlier in their relationship when Big moved to Napa and almost didn't tell Carrie. Big teases her about moving to Paris with a Russian and then tries to tell her that she's \"The One\". Carrie loses her temper and tells Big that she is tired of having him interrupt her life and ruin her happiness for the past six years. Then she rushes off to meet her friends for dinner, leaving Big alone and confused on the street.\n\nWhen Charlotte stops by Carrie's apartment one day, she hears Big leaving a message on Carrie's answering machine, asking her for one last chance. Charlotte picks up and invites him to meet with her, Miranda, and Samantha. At a restaurant, he asks them if they think Carrie really is happy and if he has any shot of winning her back. After much deliberation, with Carrie's current situation and her history with Big in the forefront of their minds, Miranda tells him to \"go get our girl\". Mr. Big then does not appear again until the second installment of the finale, \"An American Girl in Paris Part Deux\".\n\nMeanwhile, Carrie is distraught and unhappy in her relationship with Aleksandr. She passes Big in his limo on the street in Paris while looking for a cab, but neither of them see each other. Big appears to be searching for Carrie, but the limo rides on and Carrie continues on her way.\n\nBig reappears in Carrie's hotel lobby at just the right moment, as Carrie is squatting down, tearfully gathering up stray diamonds from her broken necklace. She is waiting for a new hotel room, as she just walked out on Aleksandr after a big fight. Big comes through the door and as Carrie looks up and sees him, she begins to cry. She explains that everything is a mess and Paris isn't what she thought it would be. Then she tells Big that Alexandr slapped her during an argument (though it was an accident when he turned around too fast and she was standing behind him). Big becomes protective and immediately begins climbing the stairs to Aleksandr's room to reprimand him (or as he puts it, \"kick some Russian ass\"). In a desperate attempt to stop him, Carrie trips him and they both fall to the floor, laughing hysterically. They give up seeking out Petrovsky and take a romantic stroll in Paris. He finally tells her she's the one and she asks him to take her home to New York. They arrive at Carrie's apartment late at night and she asks him if he wants to come up. He answers with a memorable line he used in the first episode (\"abso-fucking-lutely\"), which reminds the audience that he is still, in fact, the confident, sexy Big that Carrie has been in love with from day one.\n\nHis real name, John, is finally revealed on Carrie's cell phone caller ID after she returns to the city and he calls to tell her he is closing the sale of his Napa estate and returning to New York. Executive producer Michael Patrick King has stated that by never revealing his real name, Big remained \"always slightly out of reach\" for Carrie, and this plot device is maintained throughout the entire run of the series. Although we see his name in that final shot, Michael Patrick King makes a point (in the DVD commentary) that we never hear it spoken in the series.\n\nFeature films [ edit ]\n\nSex and the City: The Movie [ edit ]\n\nFour years later, Carrie and Big decide to marry, after Carrie brings it up when she starts to feel anxious about her relationship's status. She has just returned from an auction of jewelry from the collection of a woman (who was the long-time girlfriend of a wealthy man) who was abruptly dumped and thrown out of the apartment she'd shared with him for many years. The cautionary tale worries Carrie, so Big proposes in order for Carrie to have legal rights to the fabulous penthouse they are purchasing together. However, their plans for a simple wedding balloon out of control after Vogue decides to feature her in a wedding gown in the magazine. The twice-divorced Big feels it has degenerated into a \"circus\", with hundreds of guests, unwanted publicity, and a tremendous designer wedding gown taking over the original plan for a small, private ceremony. An ill-thought comment from the just-separated and upset Miranda rattles him further. Just before the ceremony Big gives in to cold feet and takes off, but rethinks the decision minutes later and rushes back. He intercepts Carrie as she is leaving the ceremony. A broken-hearted and humiliated Carrie attacks him with her bouquet, shrieking \"I knew you would do this!\" He repeatedly attempts to apologize and explain then and after, but Carrie ignores his letters and emails, and they spend months apart (close to a year) with no contact whatsoever.\n\nWhen Carrie hires an assistant, Louise, she instructs her to \"put Big in a place where she never has to hear from him again.\" So Louise creates a folder in Carrie's e-mail that is password protected and Big's many e-mails are saved in the secret folder. Charlotte later gives birth to a baby—her water breaking while she is yelling at Big for breaking Carrie's heart. Big takes her to the hospital and stays until the baby is born, hoping to run into Carrie. When Carrie arrives at the hospital, they tell her the tale. Harry reveals that Big begged her to call him, and that he's written her many letters. Puzzled, Carrie goes home and scours her mail, realizing that his e-mails are in Louise's secret folder. She guesses the password and finds that Big has re-written numerous love letters by poets, and one from himself promising to love her forever. Carrie's assistant reminds her that she left a pair of never-worn Manolo Blahnik shoes in the penthouse that she and Big owned, and that the locks will be changed for the new owners that day. Carrie rushes over to the penthouse to find Big there, holding her shoes. She runs into his arms as she can no longer deny her still very strong love for him. Carrie narrates, \"It wasn't logic; it was love,\" and the two quietly marry at New York City Hall, celebrating afterward at a diner with their friends.\n\nSex and the City 2 [ edit ]\n\nCarrie always wants to go out, while Mr. Big would prefer to stay home and watch television some evenings. After Carrie returns to her old apartment to work on an assignment and their reunion is particularly sweet, Big proposes to be separated for two days in the week, with one of them staying in Carrie's old apartment, which she has always kept. Carrie agrees, despite misgivings and questioning by Charlotte.\n\nIn Abu Dhabi, Carrie runs into her former love Aidan. Carrie and Aidan dated twice. They broke up the first time because Carrie and Big had an affair. They broke up a second time because Aidan still couldn't trust her after all that time due to her affair with Big, and after Aidan proposes, marriage doesn't sit well with Carrie, so the two break off their engagement. Aidan is now married with three boys and is in Abu Dhabi on business. The two agree to meet for dinner, despite warnings from Charlotte, who feels that Carrie is \"playing with fire\". Aidan and Carrie kiss before Carrie breaks away and runs to her hotel. Distraught about what to do, she eventually calls Big to confess to the kiss. He becomes distant and won't return her phone calls.\n\nWhen Carrie returns to New York, the apartment is empty and she sits all day waiting for Big to come home. He finally returns that evening with her \"punishment\": Carrie must wear a black diamond ring to remind herself that she is married. The two reconcile and kiss. The film concludes with a montage of scenes from the girls' lives - Big and Carrie have successfully combined their desires and interests, and the two are content as their married life has grown past the \"Terrible Twos\".\n\nSeries appearances [ edit ]\n\n\"Sex and the City\" (June 6, 1998) \"Models and Mortals\" (June 14, 1998) \"Valley of the Twenty-Something Guys\" (June 28, 1998) \"Secret Sex\" (July 12, 1998) \"The Monogamists\" (July 19, 1998) \"Three's a Crowd\" (July 26, 1998) \"The Turtle and the Hare\" (August 2, 1998) \"The Drought\" (August 16, 1998) \"Oh Come All Ye Faithful\" (August 23, 1998) \"Take Me Out to the Ball Game\" (June 6, 1999) \"The Awful Truth\" (June 13, 1999) \"Four Women and a Funeral\" (July 4, 1999) \"The Cheating Curve\" (July 11, 1999) \"The Chicken Dance\" (July 18, 1999) \"The Man, the Myth, the Viagra\" (July 25, 1999) \"Old Dogs, New Dicks\" (August 1, 1999) \"The Caste System\" (August 8, 1999) \"Evolution\" (August 15, 1999) \"La Douleur Exquise!\" (August 22, 1999) \"Twenty-Something Girls vs. Thirty-Something Women\" (September 26, 1999) \"Ex and the City\" (October 3, 1999) \"Drama Queens\" (July 23, 2000) \"The Big Time\" (July 30, 2000) \"Easy Come, Easy Go\" (August 6, 2000) \"All or Nothing\" (August 13, 2000) \"Running with Scissors\" (August 20, 2000) \"Cock-a-Doodle-Do\" (October 15, 2000) \"The Agony and the Ex-tacy\" (June 3, 2001) \"Defining Moments\" (June 10, 2001) \"Sex and the Country\" (July 22, 2001) \"Belles of the Balls\" (July 29, 2001) \"Just Say Yes\" (August 12, 2001) \"Ring a Ding Ding\" (January 27, 2002) \"I Heart NY\" (February 10, 2002) \"The Big Journey\" (September 1, 2002) \"The Perfect Present\" (July 6, 2003) \"Hop, Skip, and a Week\" (July 27, 2003) \"The Domino Effect\" (September 7, 2003) \"The Cold War\" (February 1, 2004) \"An American Girl in Paris: Part Une\" (February 15, 2004) \"An American Girl in Paris: Part Deux\" (February 22, 2004)\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mr._Big_(Sex_and_the_City)", "title": "Mr. Big (Sex and the City)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}