{"url": "www.hellomagazine.com/celebrities/2018073060693/brad-pitt-net-worth/", "text": "What is Brad Pitt's net worth? The answer may surprise you! Find out how much the actor is worth\n\nBrad Pitt is one of Hollywood's most famous and well-loved actors, so it comes as no surprise that he has earned an incredible fortune throughout his successful career. With accolades ranging from an Oscar to the title of Sexiest Man Alive, the star is a true all-rounder in Tinseltown. So, exactly how much has the father-of-six amassed so far in his career? We take a look at his ventures in acting, producing, and brand endorsements, all of which have contributed to his fortune.\n\nBrad Pitt's Net Worth\n\nBrad Pitt has an estimated net worth of £239million, according to Celebrity Net Worth. According to Forbes, one of Brad's highest earning years was between 2015 and 2016, where he earned £24million.\n\nBrad began acting in 1987, at the age of 23\n\nBrad Pitt's acting career\n\nBrad was born in Shawnee, Oklahoma, and went on to study journalism and advertising at the University of Missouri. But weeks before graduating, Brad dropped out to pursue acting in L.A. His first gig in Hollywood was dressing up in a chicken suit at El Pollo Loco restaurant on Sunset Boulevard!\n\nBrad kicked off his acting career in 1987 with appearances in the primetime US soap opera Dallas, as well as police drama 21 Jump Street. A year later, at the age of 24, Brad landed his first lead role in a film, starring as Rick, a young man with a rare skin condition, in The Dark Side of the Sun.\n\nBut it wasn't until 1991, when Brad landed his breakout role in adventure movie Thelma and Louise, that he became a recognisable face on the Hollywood scene. On his way to becoming the acting icon he is today, Brad has starred in countless blockbuster movies, including The Ocean's Trilogy, Fight Club, The Curious Case of Benjamin Button and Troy. Throughout his long-standing career, Brad has worked on some incredibly high-earning films. The Ocean's trilogy offered a reported salary of £7.6million to its stars, who also included George Clooney and Matt Damon. The third instalment, Ocean's Thirteen, grossed £237million.\n\nBrad starred in Ocean's Eleven alongside Matt Damon and George Clooney\n\nBrad's highest grossing film was World War Z (2013), which earned him an estimated £10.6million and made a total of £383million at the box office. Brad's successful films have seen him bring home an Oscar – as a producer for Best Picture 12 Years a Slave in 2014 – a Golden Globe, an Emmy, a BAFTA and a SAG Award. Mr and Mrs Smith, the film on which he met his second wife, Angelina Jolie, grossed £364 million.\n\nBrad Pitt's work in film producing\n\nIn 2001, with his acting career going from strength to strength, Brad turned his hand to film production by setting up his own company – Plan B Entertainment. He co-founded the business with Jennifer Aniston, his wife at the time, and the late producer Brad Grey. Plan B Entertainment produced three Oscar-winning films: The Departed, 12 Years a Slave and Moonlight, as well as other popular flicks: Eat, Pray, Love, Kick-Ass and Charlie and the Chocolate Factory. When Brad and Jennifer divorced in 2005, Brad became the sole owner of the company, and Brad Grey became the CEO of Paramount Pictures.\n\nAs of 2017, Plan B is thought to have a net worth of £77,846.\n\nMarriage and divorce from Jennifer Aniston\n\nBrad and Friends star Jennifer Aniston met in 1998 after being set up by their agents, and made their red carpet debut as a couple at the 1999 Emmy Awards. The pair married in 2000, but five years later, Jennifer filed for divorce in 2005. It was reported that the couple reached a £45million settlement, with Jen claiming £22million, and Brad taking £23.6million. Whilst Jennifer kept their Beverly Hills mansion, Brad ended up with full control over Plan B Entertainment.\n\nBrad and Jennifer make their public debut as a couple in 1999\n\nMarriage and divorce from Angelina Jolie\n\nBrad met actress Angelina Jolie on the set of Mr and Mrs Smith in 2005, causing a considerable stir in Hollywood due to his marriage to Jennifer Aniston at the time, although the pair claim that they didn't get together until Brad officially split from Jen. The pair soon became Hollywood's power couple and married in 2014 at Chateau Miraval the £45million French mansion Brad had bought with Angelina in 2008. 'Brangelina', as they became known, had a combined net worth of £304million ($400million) according to reports.\n\nBrad and Angelina married in 2014\n\nHowever, the pair split in 2016 after a reported incident on a private plane, which was thought to have involved their eldest son, Maddox. At the time, Angelina, 43, released a statement confirming that they had split for the \"health of the family\". Angelina reportedly did not request spousal support.\n\nDespite their split, the pair have kept Chateau Miraval as an investment. The mansion is complete with a vineyard which produces Miraval Rosé – another source of income for the Jolie-Pitts. Last year, Brad opened up about his split in an interview with GQ Style, saying: \"You've got a cliché: 'If you love someone, set them free.' Now I know what it means, by feeling it. It means to love without ownership. It means expecting nothing in return.\"\n\nMORE: Angelina Jolie says 'I don't enjoy being single' in rare interview after split with Brad Pitt\n\nBrad Pitt's children\n\nBrad has six children, three adopted and three biological, who he shares with ex-wife, Angelina. Their eldest son, 16-year-old Maddox, was adopted from Cambodia when he was seven-months-old, while their eldest daughter, Zahara, was adopted from Ethiopia in 2005. They adopted their fourth child, Pax Thien, from Vietnam in 2003.\n\nBrad and Angelina share six children together\n\nBrad and Angelina welcomed their first biological child– Shiloh Nouvel – in Namibia in 2006. The photos of their newborn baby daughter were sold for an estimated £5.6million, and the couple donated with proceeds to UNICEF. On 12 July 2008, Angelina gave birth to twins, Knox and Vivienne. The pictures jointly sold for £10.4million – the most expensive celebrity photos in history. The proceeds were given to the Jolie-Pitt Foundation, the pair's joint charity which supports causes close to their hearts.\n\nBrad is joined on the red carpet by Pax, Shiloh and Maddox\n\nRELATED: Angelina Jolie ordered by court to give children more time with ex-husband Brad Pitt\n\nBrand endorsements\n\nBeing one of the most recognisable faces on the planet, Brad has naturally taken on several lucrative brand deals. In 2012, he became the first man to represent the women's perfume brand Chanel No. 5. The luxurious label reportedly paid him £5.3million. He also raked in £2.9million for starring in one TV advert for beer brand Heineken, which aired during the 2005 Super Bowl final.\n\nDespite his dabbles in American advertising, Brad is a huge name in Asia, having starred in countless campaigns. He starred in a short film named The Audition to advertise Studio City Casino in Macau, China. Brad appeared alongside Robert De Niro, Leonardo DiCaprio in the short film, which was directed by Oscar-winning director Martin Scorsese. The stars were allegedly paid £9.9million each for the advertisement.\n\nHe has also been the face of Japanese denim brand Edwin Jeans, and featured in campaigns for Honda, a Japanese car brand. Brad was the face of car company Cadillac in China, receiving a £1.9million pay check for adverts that were aired in China only.\n\nCharity work\n\nUsing his famous status for good, Brad has worked hard to put resources and time into championing many charitable causes, ranging from AIDS & HIV, to children's rights and adoption. In 2001, Brad took part in the America: A Tribute to Heroes charity telethon in aid of the victims of 9/11. According to tax records, Brad and Angelina donated more than £6million to charity in 2006. As well as the Jolie-Pitt Foundation, Brad founded the Make It Right Foundation in 2007, during the aftermath of Hurricane Katrina. Make It Right is a not-for-profit organisation devoted to funding and building new houses in New Orleans to help rebuild the lives of the communities devastated by the natural disaster. Brad also supports the ONE Campaign, an organisation that fights against AIDS and poverty in the developing world.", "images": ["https://www.facebook.com/tr?id=1728383620790976&ev=PageView&noscript=1", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-69/ocean-eleven-z.jpg", "https://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-60/brad-pitt-t.jpg", "https://www.himgs.com/css/hello/img/logo.png", "http://www.hellomagazine.com/celebrities/2018073060693/brad-pitt-net-worth/\n            https:/www.facebook.com/tr?ev=6015416512498&cd[value]=0.00&cd[currency]=USD&noscript=1", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-63/brad-z.jpg", "https://pixel.33across.com/ps/?pid=1157&cgn=17916&seg=47780", "https://www.facebook.com/tr?id=858230647564408&ev=PageView&noscript=1", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-67/children-z.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035866&cs_ucfr=1&cv=2.0&cj=1", "https://certify.alexametrics.com/atrk.gif?account=HS7uq1SZw320l9", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-64/bradjen-z.jpg", "http://trc.taboola.com/1115066/log/3/unip?en=page_view", "http://www.himgs.com/css/hello/img/logo.png", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-60/brad-pitt-t.jpg?filter=w600", "https://www.hellomagazine.com/imagenes/comunes/1.gif?resize=5px:3px", "http://www.himgs.com/imagenes/hello/common/subs-button-3.jpg", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-66/pax-shiloh-maddox-z.jpg", "http://www.himgs.com/imagenes/hello/common/hello-2008.png?v2", "http://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-68/brad-and-ang-z.jpg"], "top_img": "https://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-60/brad-pitt-t.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.hellomagazine.com/celebrities/2018073060693/brad-pitt-net-worth/", "title": "What is Brad Pitt's net worth? The answer may surprise you!", "meta_data": {"plantilla": "Plantilla de noticias (plantilla-noticias.html)", "title": "What is Brad Pitt's net worth? The answer may surprise you!", "description": "HELLO! takes a look at how Hollywood's top actor earns his fortune.", "keywords": "Brad Pitt", "dc.title": "What is Brad Pitt's net worth? The answer may surprise you!", "distribution": "global", "viewport": "width=device-width, initial-scale=1, maximum-scale=3, user-scalable=yes", "news_keywords": "Brad Pitt", "og": {"title": "What is Brad Pitt's net worth? The answer may surprise you!", "description": "HELLO! takes a look at how Hollywood's top actor earns his fortune.", "image": "https://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-60/brad-pitt-t.jpg", "updated_time": "2019-06-18T12:04:53+01:00", "url": "https://www.hellomagazine.com/celebrities/2018073060693/brad-pitt-net-worth/", "type": "article", "site_name": "HELLO!"}, "fb": {"admins": 89982930077}, "article": {"published_time": "2018-07-30T14:04:44+00:00", "modified_time": "2019-06-18T12:04:53+00:00"}, "twitter": {"card": "summary_large_image", "site": "@hellomag", "creator": "@hellomag", "url": "https://www.hellomagazine.com/celebrities/2018073060693/brad-pitt-net-worth/", "title": "What is Brad Pitt's net worth? The answer may surprise you!", "description": "HELLO! takes a look at how Hollywood's top actor earns his fortune..", "image": "https://www.hellomagazine.com/imagenes/celebrities/2018073060693/brad-pitt-net-worth/0-248-60/brad-pitt-t.jpg"}, "hmn": "true", "botify-site-verification": "rAorMmkbfzd6yOwJ3PITFmdyCjOzGLug"}, "movies": [], "publish_date": 1532959484.0, "source": "http://www.hellomagazine.com", "summary": ""}