{"url": "https://www.udiscovermusic.com/stories/the-young-female-pop-stars-ruling-the-music-world/", "text": "The pop world has always been a fickle one and now with the domination of streaming, pop stars (especially female pop stars) have to be extremely savvy and adaptable to compete with the majority of rappers and DJs that have seeped into the pop charts.\n\nIt’s impossible to ignore the female heavy-hitters of Taylor Swift, Beyoncé, Rihanna, Adele, Katy Perry and Lady Gaga, whose towering influence makes headlines even when there’s no music to promote, but who are the next generation of players to create a new pop narrative? From former child stars to internet sensations to singer-songwriters, these young female pop stars may have diverse trajectories, but they’re all finding success on their own terms.\n\nListen to female trailblazers across all genres on the ‘Women To The Front’ playlist on Apple Music and Spotify.\n\n﻿\n\nBillie Eilish\n\nIf you haven’t heard of Billie Eilish, she’ll be inescapable by the time you finish reading this. The 17-year-old songwriter has already amassed a sizeable and rabid fanbase after self-releasing her breakout single, ‘Ocean Eyes’, back in 2016, and her star has only continued to rise. Despite her delicate voice, Eilish writes the kind of ominous pop music that speaks directly to Generation Z, who appreciate her unflinching honestly.\n\nSince landing a major-label contract, Eilish released her 2017 EP, Don’t Smile at Me, which included her breakout singles ‘Bellyache’ and the Vince Staples collaborative track ‘&burn’, produced by her brother and co-writer Finneas O’Connell. Delving into subjects like desire and betrayal is not your usual teen-pop fare, but Eilish is not your average pop star. Her No.1, record-breaking debut album When We All Fall Asleep, Where Do We Go?, made her household name and one of the biggest pop stars in the world.\n\n﻿\n\nAlessia Cara\n\nLike so many singers of her generation, the 20 year-old Canadian artist got her start singing precocious covers of hit songs on Youtube before signing with Def Jam and releasing her debut single ‘Here’, a catchy ode to introverts who hate parties. It was the perfect single, with Cara’s personal sentiments that rang true to insecure teenagers everywhere set to a downtempo beat and the seductive strings of ‘Ike’s Rap II’ by Isaac Hayes. The single was a slow burn, released without fanfare and later topping every critic’s list by the end of 2015, with the rest of her album Know-It-All being solidified by the two subsequent singles, ‘Wild Things’ and the self-affirming anthem ‘Scars to Your Beautiful’.\n\nTapping into the desire for more socially-conscious pop, Cara took it one step further when she appeared on rapper Logic’s track ‘1-800-273-8255’ along with pop-R&B star Khalid, which is titled after the number for the National Suicide Prevention Lifeline. Now on her sophomore effort The Pains Of Growing, the 21 year-old has matured from ingénue to confident singer-songwriter.\n\nAs the singers of today continue to shift further away from the power belters of the 90s and late 2000s, Cara is part of the new breed of pop stars, who position themselves as outsiders, filter their confessional lyrics through slick productions and don’t paint themselves into a genre corner.\n\n﻿\n\nSelena Gomez\n\nAnother progeny of the Disney star-marking machine, Selena Gomez was part of the wave of child stars turned pop singers along with Demi Lovato, Jonas Brothers, Miley Cyrus and the Nickelodeon star turned pop sensation Ariana Grande. Even at 25 years young, she’s a veteran of the industry and was named Billboard‘s Woman of the Year in 2017.\n\nWhile initially starting out with a band, it wasn’t until her 2013 solo debut Stars Dance, where she made the complete transition from bubbly teen to mature female artist who invited the world to ‘Come & Get It’ on her Bollywood-inflected track. While most of her rebellious moments were saved for her acting roles, she’s taken a promising creative turn on her light-hearted, insanely-catchy, ‘Bad Liar’ that samples The Talking Heads ‘Psycho Killer’ and her dance-pop collaborations with Kygo on ‘It Aint Me’ and more recently with the producer Marshmello on her single, ‘Wolves’. While her dance hits continue, Gomez reminded us of her knack for earnest pop with ‘Back To You’ off the soundtrack for the teen drama she executive produces, 13 Reasons Why. Then after a hiatus, Gomez returned in full force, with the stunning balled ‘Lose You To Love Me’, followed by the infectious dance-pop track ‘Look At Her Now’. With her second solo album on the horizon, Gomez is ready to reign the pop charts again.\n\nCharli XCX\n\nThe British singer-songwriter may not be as big of a household name as others on this list but she’s been penning some of the biggest hits for the past decade since signing a record deal at 16. Ever since creating the killer hook to 2012’s biggest pop breakthrough, Icona Pop’s ‘I Love It’, she’s written for Gwen Stefani, Iggy Azalea, Selena Gomez, Rihanna as well as saving a few for herself on ‘Boom Clap’ and more recently the music-video trope satire, ‘Boys’, where she turns the camera’s gaze on the boy candy of today. Her early album True Romance remains a pristine example of alternative-pop and Charli continues to be one of pop’s greatest characters, with her critically-acclaimed new album Charli, the alt.pop star is proving she’s much more than just the chorus from Iggy Azalea’s ‘Fancy’.\n\n﻿\n\nHailee Steinfeld\n\nAnother actress-turned-singer, Steinfeld had an Oscar nomination under her belt by the age of 14 before gaining attention for her singing skills in the movie Pitch Perfect 2. She made her recording debut with an acoustic duet with beloved teen crooner Shawn Mendes on his hit ‘Stitches’, before releasing her EP, Haiz , featuring the lead single, ‘Love Myself’, an infectious female empowerment anthem that’s been interpreted as this generation’s Divinyls ‘I Touch Myself’.\n\nLike Cara, Gomez and Charli, Steinfeld collaborated with the DJ-producer du jour, Zedd for her platinum hit ‘’Starving’, proving she was the master of both acoustic-pop and the dance floor fare. With a penchant for dance-pop and empowering lyrics, Steinfeld penned the single ‘Most Girls’, a catchy feel-good hit with tropical house flavour that’s slated for her forthcoming full-length debut. Having proven her prowess with a pen, the 20-year old also signed a publishing deal with Warner and contributed the single ‘Afterlife’ to the Apple TV original series Dickinson, which she also stars in, proving herself to be a triple-threat.\n\nCarly Rae Jepsen\n\nEven if you don’t have your finger on the pop pulse, you would’ve heard this Canadian singer-songwriter’s debut hit ‘Call Me Maybe’, which went on to become a viral sensation and recently surpassed the one billion views mark on Youtube. Following up what has been dubbed “the greatest pop song of our generation’, Jepsen decided to take a different route and craft an 80s-inspired synthpop record called E•MO•TION, recruiting masters of the genre Sia and Dev Hynes of Blood Orange.\n\nThe album became a cult hit, attracting a more indie-pop loving adult audience than the younger Youtube audience that kick-started her career. Jepsen wrote much of the lyrics, building upon her favourite theme of unrequited love, a pattern that even inspired a manifesto. On her fourth studio album Dedicated, Jepsen expands her scope with big songs, big production, and even bigger feelings.\n\n﻿\n\nAriana Grande\n\nLike many talents on this list, the pathway to stardom for Ariana Grande was paved in teen television. But unlike say Miley Cyrus, her emancipation from children’s entertainment was a subtle one, allowing her to attract older audiences without alienating her original fans. With her signature ponytail and oversized sweatshirts engulfing her tiny frame, she may look younger than her 25 years, but she has evolved into a mature female artist, who’s fully in control of expressing her desires and has a powerhouse voice that’s led to her mini Mariah Carey characterizations. Like Carey, she’s collaborated with many hip-hop artists to create chart gold, from her debut ‘The Way’ with Mac Miller to ‘Side To Side’ with Nicki Minaj.\n\nA pop star in the Spotify era, she was the first artist to score a UK No 1, once streaming started being accounted for. Grande’s voice is the perfect instrument to reinterpret a retro-pop sound but her genre-fluidity doesn’t stop there, from her EDM-assisted hit ‘Break Free’ with (you guessed it, Zedd) to provocative R&B on ‘Dangerous Woman’. Certainly more political than your average pop star, Grande is full of surprises and became an unlikely hero in the wake of the Manchester concert bombings, pulling together a last-minute large-scale concert for her devoted fanbase.\n\nGrande made her triumphant return with the record-smashing Sweetener, which she released in August 2018 notched her third No. 1 album. With the help of producers Max Martin and Pharrell Williams, Grande was able to push the boundaries of the pop formula, with trap-influenced songs to dance-pop and soulful R&B, making it her best album yet and returning female-driven pop back to the charts. And if that wasn’t enough, she quickly followed it up with another No.1 album, thank u, next in less than one year, proving her biggest pop rival is only herself.\n\n﻿\n\nDemi Lovato\n\nIt’s strange to think of these omnipresent pop stars as young fresh talent when they’ve been in our eyes and ears since they were kids. Having come up alongside Selena Gomez in the Disney-pop-star producing machine, Demi Lovato’s career started out with a bang, when her debut Don’t Forget debuted at No. 2 on the US Billboard 200 in 2008. Since then, she’s released five successive chart-topping albums, but her ascension was not without struggle. Straddled with the responsibility of maintaining a more squeaky-clean image than someone who didn’t climb the Disney ladder, Lovato has always been a very open and vocal about her sobriety, mental health and other issues, helping to remove the stigma from such sensitive topics.\n\nWhile most of pop continues to succumb to more skeletal arrangements, trap-inspired instrumentation and downsized vocals, Lovato has always been unabashedly a bold and brassy vocalist with an unshakable confidence that shines through, as evidenced on her latest top ten hit, ‘Sorry Not Sorry’ off her album, Tell Me You Love Me.\n\n﻿\n\nLorde\n\nIt’s hard to even put Lorde on a list when she seems to be operating on her own playing field. When she mysteriously appeared on the scene with her seismic debut Pure Heroine as a seemingly fully formed artist at the age of 16, people called foul. Were there secret songwriters, was she lying about her age? Conspiracies abound. But that’s what happens who you upend the entire pop game.\n\nWhen she returned four years later with her sophomore album Melodrama, she chose not to try and replicate her success but instead wrote a confessional concept record about excess, relationships and the hang-ups of entering adulthood. Even with her Top 40 ranking, she remains a serious singer-songwriter at heart, who manages to fit poetical lyrics into radio-ready fare. And with Lorde taking the helm on songwriting and more producing duties, does this Kiwi phenom mark the end of paint-by-number pop?\n\n﻿\n\nHalsey\n\nLike Lorde, Halsey is very much a pop-star of the Internet age. Without the platform of a Disney or other traditional star-making machine, the young girl from New Jersey had amassed a huge following on Youtube by the age of 18. After self-releasing her own music, she was signed by Astralwerks in 2014 and put out her debut EP Room 93, quickly followed by her platinum debut Badlands in 2015. Halsey’s smoky alto was the perfect fit for the kind of brooding electro-pop that spoke to young fans who’d grown tired of typical radio fare.\n\nBut, it wasn’t until 2016 when she sang on The Chainsmokers ubiquitous hit ‘Closer’ that her career was launched into the stratosphere. The certified Diamond hit earned her a Grammy nomination, and is the third most streamed song in Spotify history.\n\nWith two platinum solo records to her name – Badlands and its 2017 follow-up Hopeless Fountain Kingdom, the singer has been selling out stadiums all over the world. Along with the other pop phenoms on this list, her vocality on both on women’s rights and LGBTQ+ issues has influenced both her musical output and her devoted fanbase.\n\nWhile much of her work has relied on concepts and characters, the singer has revealed a more personal side with the breakup anthem ‘Without Me, which already broke the Top 20 of the Billboard Hot 100, setting the stage for a new chapter of her career and third studio album, Maniac.\n\nLooking for more? Discover Riot Girls: The Female Musicians Who Changed The World.", "images": ["https://www.udiscovermusic.com/wp-content/uploads/2015/12/UD-Logo-Placeholder-1000x600-1-400x240.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/04/The-Cranberries-Zombie-song-video-still-1000-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/10/Taylor-Swift-1989-album-cover-web-optimised-820-354x354.jpg", "https://media.udiscovermusic.com/img/trans.gif", "https://media.udiscovermusic.com/img/social-share-buttons/flipboard-flip-logo-site.png", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Lionel-Richie-Baxter-PR-promo-2019-copy-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/07/Florence-And-The-Machine-Lungs-album-cover-820-354x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2017/04/Extras-1-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/12/Taylor-Swift-2019-Lover-Press-Shot-02-Valheria-Rocha1000-CREDIT-400x240.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Tori-Amos-Des-Willie-copy-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2016/12/Rolling-Stones-00s-press-shot-web-optimised-1000-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2016/12/Rolling-Stones-00s-press-shot-web-optimised-1000-400x240.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Lionel-Richie-Baxter-PR-promo-2019-copy-590x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/04/Elliott-Smith-Figure-8-album-cover-820-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/09/Amy-Winehouse-Back-To-Black-press-photo-Alex-Lake-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/04/Cranberries-Andy-Earl-copy-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/04/Ulimate-Peggy-Lee-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/09/The-Cure-2019-Hyde-Park-approved-press-shot-CREDIT-Andy-Vella-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Rihanna-Talk-That-Talk-album-cover-820-354x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Female-Pop-Prodigies.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/03/1000x600_self-isolation-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/03/1000x600_self-isolation-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/03/1000x600_zoom_album_c-590x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/03/1000x600_self-isolation-400x240.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.udiscovermusic.com/wp-content/uploads/2018/09/Amy-Winehouse-Back-To-Black-press-photo-Alex-Lake-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/04/Quarantine-Covers-Part-1-Artwork-354x354.jpg", "https://c.statcounter.com/9834979/0/e193fbcd/1/", "https://www.udiscovermusic.com/wp-content/uploads/2016/12/Rolling-Stones-00s-press-shot-web-optimised-1000-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/02/16316-Harrison-Family-optimised-web-1000-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/12/Taylor-Swift-2019-Lover-Press-Shot-02-Valheria-Rocha1000-CREDIT-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/12/Taylor-Swift-2019-Lover-Press-Shot-02-Valheria-Rocha1000-CREDIT-590x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2015/12/UD-Logo-Placeholder-1000x600-1-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Tori-Amos-Des-Willie-copy-590x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Tori-Amos-Des-Willie-copy-400x240.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/07/ABBA-Dancing-Queen-Single-artwork-web-optimised-820-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/01/uDiscover-top-site-250-logo.png", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Tori-Amos-Des-Willie-copy-285x285.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Lionel-Richie-Baxter-PR-promo-2019-copy-400x240.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/03/Genesis_03-March-20200026Final-CREDIT-Patrick-Balls_Martin-Griffin-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/02/16316-Harrison-Family-optimised-web-1000-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/07/ABBA-Dancing-Queen-Single-artwork-web-optimised-820-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2019/04/Rolling-Stones-Tour-Of-The-Americas-75-web-optimised-1000-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2016/12/Rolling-Stones-00s-press-shot-web-optimised-1000-590x354.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/01/uDiscover-footer-site-logo-400.png", "https://www.udiscovermusic.com/wp-content/uploads/2019/09/The-Cure-2019-Hyde-Park-approved-press-shot-CREDIT-Andy-Vella-80x80.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2020/02/abba-live-at-wembley-3lp.jpg", "https://www.udiscovermusic.com/wp-content/uploads/2018/01/uDiscover-top-site-450-logo.png"], "top_img": "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Female-Pop-Prodigies.jpg", "keywords": [], "authors": ["Udiscover Team"], "canonical_link": "https://www.udiscovermusic.com/stories/the-young-female-pop-stars-ruling-the-music-world/", "title": "The Young Female Pop Stars Taking The World By Storm", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "description": "From former child stars to internet sensations, these young female pop stars are the next generation of players to create a new pop narrative.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "The Young Female Pop Stars Taking The World By Storm | uDiscover", "description": "From former child stars to internet sensations, these young female pop stars are the next generation of players to create a new pop narrative.", "url": "https://www.udiscovermusic.com/stories/the-young-female-pop-stars-ruling-the-music-world/", "site_name": "uDiscover Music", "updated_time": "2020-03-07T00:01:38+00:00", "image": {"identifier": "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Female-Pop-Prodigies.jpg", "secure_url": "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Female-Pop-Prodigies.jpg", "width": 1000, "height": 600}}, "article": {"publisher": "https://www.facebook.com/Udiscovermusic", "tag": "Women's History Month", "section": "Features", "published_time": "2019-11-24T23:56:57+00:00", "modified_time": "2020-03-07T00:01:38+00:00"}, "twitter": {"card": "summary_large_image", "description": "From former child stars to internet sensations, these young female pop stars are the next generation of players to create a new pop narrative.", "title": "The Young Female Pop Stars Taking The World By Storm | uDiscover", "site": "@udiscovermusic", "image": "https://www.udiscovermusic.com/wp-content/uploads/2019/11/Female-Pop-Prodigies.jpg", "creator": "@udiscovermusic"}, "generator": "WordPress 5.3.2", "fb": {"pages": 368022879920906}, "ia": {"markup_url": "https://www.udiscovermusic.com/stories/the-young-female-pop-stars-ruling-the-music-world/?ia_markup=1"}, "google-site-verification": "CHKcPCaJcE0Xj4UKQdByARuviewbn_1aT85-A3--3o0", "ahrefs-site-verification": "3dbf495d0ce61a33e503f3ef186e4bc7f052d9a77331938103de61f5ef77da29", "p": {"domain_verify": "8a41312d8ac74ecb82510fd752be2656"}, "msvalidate.01": "5551681B63EA0E9746A8A38A10BBC101"}, "movies": ["https://www.youtube.com/embed/EgBJmlPo8Xw?rel=0", "https://www.youtube.com/embed/yrcZdxN7z-U?rel=0", "https://www.youtube.com/embed/zlJDTxahav0?rel=0", "https://www.youtube.com/embed/mPRy1B4t5YA?rel=0", "https://www.youtube.com/embed/pFp05alGLow?rel=0", "https://www.youtube.com/embed/NY1RsDpRmIU?rel=0", "https://www.youtube.com/embed/FflfOb4BWCU?rel=0", "https://www.youtube.com/embed/jW3aJ-3SEVU?rel=0", "https://www.youtube.com/embed/J0DjcsK_-HY?rel=0", "https://www.youtube.com/embed/rPgaYeq9NvI?rel=0"], "publish_date": 1574639817.0, "source": "https://www.udiscovermusic.com", "summary": ""}