{"url": "www.inquisitr.com/5029595/jennifer-aniston-moving-to-nyc-where-ex-justin-theroux-resides-to-film-new-apple-series/", "text": "Jennifer Aniston could have some awkward run-ins in her near future.\n\nWhile she and Justin Theroux split after two and a half years of marriage and seven years together, the couple seems to have done a pretty good job at avoiding each other at Hollywood events. But, with Jen moving to the Big Apple this coming Fall, she and Justin may see each other at one point or another.\n\nAccording to Radar Online, Aniston is packing her bags and moving to New York City this coming October to film her upcoming, unnamed TV show for Apple alongside Reese Witherspoon. An insider close to Jen shares that since the actress has lived in New York two times before, she should be able to avoid awkward run-ins with Justin, but then again, you just never know.\n\nFilming is expected to begin on October 1 and will continue through the end of the year. And while it may possibly put her slightly out of her comfort zone to be living so close to her ex, the source says that there’s no way that Jen will back out now.\n\n“She’s actually been involved in the project for almost two years behind the scenes – before her divorce. Back then she was thinking it would bring her closer to Justin, but now it’s taken on a whole new turn by placing her in Justin’s stomping ground.”\n\nJennifer Aniston, Justin Theroux NOT Getting Back Together, Despite Claim Romance Isn't \"Over\" https://t.co/XjITkHBtrE pic.twitter.com/qpfeVnWWOP — Gossip Cop (@GossipCop) August 11, 2018\n\nJen’s upcoming role is said to possibly put her back on the map like her role of Rachel Green did on Friends.\n\n“The positive is Jen is the star of this show and will get top billing over Reese, who plans to commute from L.A.,” the source dished. “This is really going to be a Jen-heavy series about a morning TV show and is going to need her working every day on it.”\n\nJennifer is currently over in Italy, filming her upcoming Netflix movie Murder Mystery, alongside Adam Sandler. As the Inquisitr shared a few weeks ago, Jennifer has been keeping plenty busy filming, but in between takes, she recently took the opportunity to relax and catch some rays in Portofino.\n\nPhotos show the incredibly fit actress leaving little to the imagination in a barely-there, bright blue bikini that showed off her toned abs and legs. The 49-year-old wore her hair back in a ponytail as she sported a big pair of sunglasses and some ear buds. Jen could also be seen getting food delivered to her chair and cooling down with a few icy beverages.\n\nObviously, Jennifer’s body is rocking and right now — so is her career.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/08/Jennifer-Aniston-moving-to-NYC-.jpg", "https://secure.gravatar.com/avatar/54254827fab5e9de95f128cf1f4d78a5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Kathryn Cook"], "canonical_link": "https://www.inquisitr.com/5029595/jennifer-aniston-moving-to-nyc-where-ex-justin-theroux-resides-to-film-new-apple-series/", "title": "Jennifer Aniston Moving To NYC, Where Ex Justin Theroux Resides, To Film New Apple Series", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}