{"url": "https://en.wikipedia.org/wiki/Bobbi_Kristina_Brown", "text": "American television personality\n\nBobbi Kristina Brown (March 4, 1993 – July 26, 2015) was an American reality television personality, media personality, and singer. She was the daughter of singers Whitney Houston and Bobby Brown. Her parents' fame kept Bobbi Kristina in the public eye, including her appearances on the reality show Being Bobby Brown. Brown was 14 when her parents divorced and Houston gained custody.[1] When Houston died in February 2012, Brown was the sole beneficiary of her mother's estate.\n\nThat October, Brown caused controversy within both of her parents' families when she announced her engagement to Nick Gordon, a man she previously considered her \"big brother\". When the couple announced they were married, her father's lawyer released a statement disputing the report.\n\nIn January 2015, Brown was found unconscious in a filled bathtub in her home. After being in a coma for nearly six months, Brown died from lobar pneumonia on July 26, 2015.[2] Gordon, who was later found guilty by a civil court in Brown's death and ordered to pay 36 million dollars to her estate, died in Florida on January 1, 2020, from an accidental heroin overdose.[3][4][5][6][7][8]\n\nEarly life [ edit ]\n\nBobbi Kristina Brown was born on March 4, 1993, in Livingston, New Jersey, to singers Whitney Houston and Bobby Brown.[9] Brown's family includes maternal grandmother Cissy Houston of The Drinkard Singers. Her mother's cousins are Dee Dee Warwick; Dionne Warwick, mother of Damon Elliott;[10] and Leontyne Price.[11] Her uncle is Gary Garland, her mother's half-brother.[10] Through her father, Brown had six half-siblings: Landon, La'Princia, Robert \"Bobby\" Jr., Cassius,[12] Bodhi,[13] and Estelle. Her godmother was gospel singer CeCe Winans.[14]\n\nBrown's childhood was characterized by the media as difficult because of her parents' drug problems, the presence of paparazzi, and domestic violence issues.[15] She was brought into the spotlight at age one in 1994, when her mother accepted an American Music Award while holding her onstage. Her vocals were featured in her mother's 1998 song \"My Love Is Your Love,\" for her album of the same title. When her mother brought her to the recording studio and held her up to the microphone, she said \"Sing, mommy,\" which can be heard during the first verse of the song. She can be heard saying \"Clap your hands!\" at the end of the track. Brown was featured in her mother's 2003 Christmas album titled One Wish: The Holiday Album in her mother's version of \"The Little Drummer Boy\". When Brown's parents divorced in 2007, her mother was awarded custody, and her father received visitation rights.[16][17]\n\nAdult life [ edit ]\n\nBrown's mother died at age 48 in a hotel bathtub in 2012 from what was later ruled an accidental drowning with heart disease and cocaine use listed as contributing factors.[18] Brown was described as \"inconsolable\" and a few days later was admitted to Cedars-Sinai Medical Center in Los Angeles; according to a family friend, Brown was \"overwhelmed\".[19][20] The month after Whitney Houston's death, in March 2012, Brown said that she felt her mother's spirit, and Brown expressed her intent to carry on her mother's legacy by doing the \"singing thing,\" along with starting a career as an actor and dancer.[21]\n\nIn accordance with her mother's will, Brown was the beneficiary of Houston's entire estate including clothing, jewelry, cars, personal effects, and furniture.[22] The will also provided for Brown to receive trust fund payments in installments until she reached age 30, after which time she was to receive the remainder of Houston's $115-million estate.[23] After her mother's death, Brown was taken care of by her aunt Marion Garland-Houston and her husband Gary Garland.[citation needed]\n\nIn October 2012, Brown announced her engagement to a close family friend, Nick Gordon, who had come to live in the Houston household when he was 12 years old and who was later found liable for her death.[24] The announcement caused controversy within the family;[25][a] before making their romantic involvement known, Brown had referred to him as her \"big brother\".[27] Brown's grandmother, Cissy Houston, had called the relationship \"incestuous\" when they were initially dating; however, Brown said the couple received her grandmother's blessing prior to their engagement.[29] In early 2014, Brown and Gordon announced they had married on January 9 of that year.[30] Bobby Brown's lawyer said in a statement in early 2015, \"Bobbi Kristina is not and has never been married.\"[16]\n\nBrown called Angela Bassett a \"bitch\" after the director cast another woman as her mother in the biographical movie Whitney based on Houston's life. Bassett stated that she did not cast Brown \"for a number of reasons...she's not an actress, and acting is a craft.\"[31] Brown later apologized to Bassett on Twitter after generating controversy among fans.[32]\n\nThroughout her teenage and adult years, Brown was the focus of tabloids and gossip columns, including stories about her purported drug use, her weight loss, and her relationships with family members.[33][34][35]\n\nComa and death [ edit ]\n\nOn January 31, 2015, Gordon and a friend found Brown face down in a bathtub in her home in Alpharetta, Georgia.[36] They began CPR until emergency medical services personnel arrived. According to a police spokesperson, Brown was alive and breathing after being transported to North Fulton Hospital in Roswell, Georgia.[20] At first, they found no evidence to indicate the incident was caused by drugs or alcohol, but this later was disputed.[37] Doctors placed Brown in an induced coma after determining her brain function was \"significantly diminished\", and her family was told meaningful recovery would be \"a miracle\".[38]\n\nOn February 2, Brown was moved to Emory University Hospital, where she remained in a coma and on a medical ventilator. Her family said Brown had briefly opened her eyes, but a medical expert commented \"blinking her eyes doesn't mean she's out of the woods.\"[39]\n\nDespite media reports stating Brown was brain dead and had been taken off life support, her family denied the claims on February 5 after having asked for privacy earlier in the week.[40] In late February, she was briefly taken out of the coma, but it was reinduced after she suffered seizures.[41]\n\nDuring a radio interview on March 25, 2015, Brown's grandmother, Cissy Houston said Brown's condition remained the same and that there was \"still not a great deal of hope. We're praying.\"[42] Brown was moved to an Atlanta rehabilitation facility in March 2015.[43] After Bobby Brown told concertgoers in April that his daughter was \"awake\", Cissy released a statement saying her granddaughter was no longer in a coma, but remained unresponsive. Doctors said Brown had \"global and irreversible brain damage\".[44]\n\nIn June 2015, Bobby Brown arranged to have his daughter flown to Chicago to be seen by specialists, only to be told that nothing could be done.[45] She was flown back to Atlanta, and moved to Peachtree Christian Hospice in Duluth, Georgia on June 24.[46] Her aunt, Marion Garland (Houston), stated that Bobbi Kristina's condition had continued to deteriorate.[47]\n\nBrown died in hospice care on July 26, 2015, at the age of 22. The initial autopsy found no \"obvious underlying cause of death and no significant injuries\", and the Fulton County Medical Examiner's office said more tests were forthcoming.[48] A statement released by the family thanked \"everyone for their tremendous amount of love and support during these last few months\".[36] Several prominent celebrities offered their condolences, including Chris Brown,[49] Oprah Winfrey,[50] and Whitney Houston protegées Brandy and Monica. Funeral services were held August 1, 2015, at St. James United Methodist Church in Alpharetta, Georgia.[51] Brown was buried two days later between her mother and maternal grandfather at Fairview Cemetery in Westfield, New Jersey.[52]\n\nAutopsy report [ edit ]\n\nThe Fulton County Medical Examiner's office announced on September 25, 2015, that it had \"classified the cause and manner of Bobbi Kristina Brown's death\", while citing a Superior Court order that prevented the office from releasing any details to the public. The findings were provided to the Fulton County District Attorney and to Roswell Police.[53]\n\nOn March 3, 2016, Fulton County Superior Court Judge Henry Newkirk granted a motion, requested by local media, to unseal the autopsy report on Brown's death.[54] In doing so, the judge noted that \"13 months have gone by, and I don't think there is any thing particularly earth shattering in the report...Privacy interest does not exist to the deceased.\"[55]\n\nThe Medical Examiner's office stated it would release the report upon official receipt of the granted motion,[55] and gave an initial statement on March 3, 2016. The office indicated that it used both medical records and police investigative files to arrive at a determination. As to the cause of death, the Medical Examiner said that cannabis and alcohol were found in the body, along with a prescription medication used for anxiety and sedation. It found the \"underlying cause\" of death as \"immersion associated with drug intoxication\".[56] However, the manner of death could not be ascertained. The summary statement read \"Death was clearly not due to natural causes, but the medical examiner was not able to determine whether death was due to intentional or accidental causes, and therefore classified the manner of death as undetermined.\"[56]\n\nMusic [ edit ]\n\nBrown speaks and sings on some of her mother's recordings and televised performances, as well as on a television show after her mother's death.\n\nTelevision [ edit ]\n\nNotes [ edit ]\n\n^ [26] In April 2014, Marion \"Pat\" Garland (Houston)—Whitney's sister-in-law to her half brother, Gary Garland—was granted a one-year restraining order against Assailant after claiming he had sent threatening photographs and messages.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/6/6b/Bobbi_Kristina_Brown.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Bobbi_Kristina_Brown.JPG/220px-Bobbi_Kristina_Brown.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Bobbi_Kristina_Brown.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bobbi_Kristina_Brown", "title": "Bobbi Kristina Brown", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Bobbi_Kristina_Brown.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}