{"url": "https://en.wikipedia.org/wiki/Larry_Nassar", "text": "American serial child sexual abuser and former physician\n\nLawrence Gerard Nassar (born August 16, 1963) is a convicted American serial child molester, who was formerly a USA Gymnastics national team doctor and osteopathic physician at Michigan State University. Nassar's cumulative sexual assault crimes were the basis of the USA Gymnastics sex abuse scandal, in which he was accused, beginning in 2015, of assaulting at least 250 young women and girls, dating back to 1992.[2] His victims included numerous Olympic and United States women's national gymnastics team gymnasts,[3] and he has admitted to 10 of those accusations.\n\nIn July 2017, Nassar was sentenced to 60 years in federal prison after pleading guilty to child pornography charges. On January 24, 2018, Nassar was sentenced to 175 years in a Michigan state prison after pleading guilty to seven counts of sexual assault of minors.[4][5] On February 5, 2018, he was sentenced to an additional 40 to 125 years in prison after pleading guilty to an additional three counts of sexual assault.[6] His state prison sentences are to run consecutively with his federal sentence, all but assuring that he will die in prison.[7][5]\n\nPersonal life\n\nNassar was born on August 16, 1963 in Farmington Hills, Michigan, to Fred Nassar (1925–2000) and Mary Nassar (1924–2019),[8] who are both of Lebanese descent.[9] At age 15 in 1978, he began working as a student athletic trainer for the women's gymnastics team at North Farmington High School, on the recommendation of his older brother Mike, who was an athletic trainer at the school. Nassar graduated from North Farmington High School in 1981.[10][11] He studied kinesiology at the University of Michigan, where he earned his undergraduate degree in 1985.[11] During this time, he worked for the university's football and track and field teams.[12]\n\nHe married Stephanie Lynn Anderson on October 19, 1996 at St. John's Catholic Church in East Lansing. They have two daughters and a son.[10] The couple separated after he was arrested on suspicion of sex crimes. Stephanie Nassar was granted a divorce from her estranged husband in July 2017 and got full custody of their three children.[13][14]\n\nAt the time of his arrest in December 2016, Nassar lived in Holt, Michigan.[10] Despite having been publicly charged with sex crimes, Nassar ran for the Holt School Board in 2016, and received 21% of the vote.[12]\n\nMedical career\n\nIn 1986, Nassar began working as an athletic trainer for the USA Gymnastics national team.[12] In 1993, he graduated from the Michigan State University College of Osteopathic Medicine as a Doctor of Osteopathic Medicine. He completed his residency training in family practice at St. Lawrence Hospital. In 1997, Nassar completed a fellowship in sports medicine.[12]\n\nThat year he began working as an assistant professor at MSU's Department of Family and Community Medicine in the College of Medicine. He earned $100,000 annually.[10] Nassar is listed as a co-author on at least six research papers on the treatment of gymnastics injuries.[15] He began working as a team doctor at Holt High School in 1996.[12]\n\nGymnastics career\n\nIn 1988, Nassar began working with John Geddert at Twistars, a gymnastics training club.[12] He served as the national medical coordinator for USA Gymnastics from 1996 until 2014.[12]\n\nSexual assault accusations and convictions\n\nAccusations\n\nWhile some gymnasts have said they complained in the 1990s about Nassar's behavior, it was not until 2015 that USA Gymnastics took action against him. The organization cut ties with Nassar \"after learning of athlete concerns.\" In September 2016, The Indianapolis Star reported that Rachael Denhollander and another former gymnast had accused Nassar of sexual abuse.[16] He was fired by Michigan State on September 20, after having been reassigned from clinical and teaching duties a month earlier.[17]\n\nIn February 2017, three former gymnasts: Jeanette Antolin, Jessica Howard and Jamie Dantzscher, gave an interview with 60 Minutes in which they said that Nassar had sexually abused them. They also alleged that the \"emotionally abusive environment\" at the national team training camps run by Béla and Márta Károlyi, at the Karolyi Ranch near Huntsville, Texas, gave Nassar an opportunity to take advantage of the gymnasts and made them afraid to speak up about the abuse.[18] Rachael Denhollander, one of the first women to publicly accuse Nassar,[19] said in court in May 2017 that Nassar had sexually abused her on five doctor's visits in 2000 when she was 15 years old.[20]\n\nOlympic gold medalist McKayla Maroney, using the #MeToo hashtag on Twitter, said that Nassar had repeatedly molested her from 2008, when she was 13 years old, until she retired from the sport eight years later in 2016.[21] Maroney subsequently filed a lawsuit against Nassar, Michigan State University, the United States Olympic Committee and USA Gymnastics.[22] The lawsuit accused USA Gymnastics of covering up the sexual abuse by paying Maroney $1.25 million settlement that required her to sign a non-disclosure agreement. Maroney's attorney John Manly called Nassar a \"pedophile doctor\".[23]\n\nDuring a 60 Minutes interview, Olympic gold medalist Aly Raisman said that Nassar had also sexually abused her.[24] Raisman said that Nassar molested her when she was 15 years old.[25] Gabby Douglas sent a tweet saying that \"dressing in a provocative/sexual way incites the wrong crowd.\"[26] She was criticized for it by fellow Olympic teammate Simone Biles and others, who interpreted the tweet as criticism of Raisman and \"victim-shaming\".[25] Douglas later apologized for the tweet,[27] and said she was also a victim of Nassar's abuse.[28]\n\nFormer national team member Maggie Nichols said that Nassar abused her, and that he \"groomed\" her by connecting with her on Facebook and complimenting her appearance on numerous occasions.[3] According to court filings and interviews, Nichols and her coach Sarah Jantzi reported Nassar to USA Gymnastics officials on June 17, 2015 after the coach overheard Nichols and another gymnast talking about Nassar's behavior.[29] Biles came forward shortly after with accounts that she too had been sexually abused by Nassar.[30] Jordyn Wieber made an impact statement at Nassar's court sentencing in which she also accused Nassar of sexually abusing her during her time at USA Gymnastics and talked of its effects.[31][32]\n\nConvictions\n\nIn November 2016, Nassar was indicted on state charges of sexual assault of a child from 1998 to 2005. The crimes allegedly began when the victim was six years old.[33] He was charged with 22 counts of first-degree criminal sexual conduct with minors: fifteen in Ingham County and seven in neighboring Eaton County. The allegations asserted that Nassar had molested seven girls under the guise that he was providing legitimate medical treatment at his home and at a clinic on the MSU campus.[34]\n\nNassar was arrested in December 2016 after the FBI found more than 37,000 images of child pornography and a video of Nassar molesting underage girls.[35] On April 6, 2017, his medical license was revoked for three years.[36]\n\nOn July 11, 2017, Nassar pleaded guilty to receiving child pornography in 2004, possession of pornographic images of children dating from 2004 to 2016, and tampering with evidence by destroying and concealing the images. On December 7, 2017, Judge Janet T. Neff sentenced Nassar to 60 years in federal prison.[7] If he survives that sentence, he will be on supervised release for the rest of his life.[7]\n\nOn November 22, 2017, Nassar pleaded guilty in Ingham County Circuit Court to seven counts of first-degree criminal sexual conduct with minors under the age of sixteen. He admitted to molesting seven girls, three of whom were under the age of thirteen. On November 29, he pleaded guilty to an additional three counts of first-degree criminal sexual conduct in Eaton County.[37] As of January 18, 2018, 135 women had accused Nassar of sexual assault while he worked for USA Gymnastics and Michigan State University.[38] During the following week, the number rose to 150.[39] In a lawsuit that was filed in April 2017, a woman claimed that Nassar had sexually assaulted her while he was still in medical school in 1992.[2]\n\nOn January 24, 2018, Judge Rosemarie Aquilina sentenced Nassar to 40 to 175 years in prison for the sexual assault of minors.[4] Aquillina allowed Nassar's accusers to present extended victim impact statements and dismissed objections raised to this ruling by Nassar.[38] During the sentencing, the judge informed Nassar that he had missed numerous chances to receive treatment for his sexual urges, as Nassar had been aware of these urges himself from a young age. She also said that there were likely dozens of additional victims who had not come forward, and made it clear that Nassar will never be free again.[5]\n\nNassar was practicing without a Texas medical license while he worked at the Karolyi Ranch in Huntsville. According to McKayla Maroney, this was where Nassar molested young women for more than 15 years. Practicing medicine without a license in Texas is a third-degree felony, although it is rarely prosecuted.[40] On January 31, 2018, a Michigan judge said that at least as many as 265 girls had accused him of sexual misconduct.[41]\n\nOn February 5, 2018, Judge Janice Cunningham sentenced Nassar to 40 to 125 years in prison for the three counts of criminal sexual assault to which he had pleaded in November.[42] Nassar apologized for his years of abuse, saying that the strong effects that his victims' statements had on him \"pales in comparison\" to the suffering he inflicted on them. Despite this, Cunningham stated that Nassar was still in \"denial\" about the \"devastating impact\" of his crimes.[6]\n\nThe Eaton County sentence will run concurrently with the Ingham County sentence. Nassar's state sentences will begin upon completion of his federal child pornography sentence. Neff ordered any sentences imposed at the state level to run consecutively with the federal sentence.[7][5][42] As a result, Nassar will serve a minimum of 100 years in prison, as each individual sentence will be enough by itself to ensure that he will die in prison.[6]\n\nNassar was transferred to the United States Penitentiary in Tucson, Arizona in February 2018.[43] Earlier, he was transferred from Eaton county jail to the federal detention center at FCI Milan near Milan, Michigan. In August 2018, The Detroit News reported that Nassar was transferred to the Federal Transfer Center in Oklahoma City, Oklahoma. According to his lawyers, Nassar was assaulted almost as soon as he was placed in the general population at USP Tucson, and an investigation subsequently determined that Nassar could not be safely held at Tucson.[44] As a result, he was moved to the United States Penitentiary, Coleman in Florida.[45] His earliest possible release date from federal custody is March 23, 2069. If he is still alive at this point, he will be 105 years old and will be immediately transferred to a Michigan state prison to serve out his state sentences.\n\nAftermath\n\nFollowing Nassar's conviction, more than 150 federal and state lawsuits have been filed against him, Michigan State University, the US Olympic Committee, USA Gymnastics, and the Twistars Gymnastics Club.[46] The entire 18-member board of USA Gymnastics, including Steve Penny, tendered their resignations. MSU President Lou Anna Simon and MSU Director of Athletics Mark Hollis have both resigned, and other MSU officials are also under scrutiny.[47]\n\nNassar's crimes committed at MSU and USA Gymnastics have drawn comparisons to coach Jerry Sandusky's sexual abuse crimes at Penn State University.[48] In both of these cases, mistakes were made when institutional authorities \"turned the other way\" or tried to hide the activities of a child molester instead of immediately contacting law enforcement.[49][50]\n\nMichigan Attorney General Bill Schuette promised a full investigation into how Nassar was able to abuse young women for decades while working at the state's university.[51] MSU agreed to pay $500 million to 332 alleged victims of Nassar, settling lawsuits filed by the victims. This was the largest amount of money in history settled by a university for a sexual abuse case.[52] On Christmas Eve 2019, Schuette's successor - Dana Nessel - announced she was suspending the investigation.[53]\n\nOn July 18, 2018, more than 140 survivors of Nassar's abuse appeared on stage together at the Microsoft Theater in Los Angeles, California to receive the Arthur Ashe Award for Courage at the 2018 ESPY Awards ceremony. Gymnasts Sara Klein and Aly Raisman and softball player Tiffany Thomas Lopez accepted on the survivors’ behalf and served as spokeswomen. Klein identified herself as Nassar's first victim 30 years before.[54][55] They credited lead detective Andrea Munford of the Michigan State Police, former assistant Attorney General Angela Povilaitis, and Judge Rosemarie Aquilina of the 30th circuit court in Ingham County, Michigan for their work. Aquilina also attended the ceremony. Singer MILCK performed her song \"Quiet”,[56] written from her own experience of sexual abuse.[57]\n\nIn late July 2018, it was reported that Nassar was seeking a new sentencing hearing due to concerns of perceived bias by Judge Aquilina,[58] but his request was later denied by Eaton County Judge Janice Cunningham.[59]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/74/Larry_Nassar.jpg/220px-Larry_Nassar.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Larry_Nassar", "title": "Larry Nassar", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}