{"url": "https://www.newstatesman.com/culture/tv-radio/2016/01/serial-making-murderer-can-true-crime-entertainment-ever-be-ethical", "text": "In her book The Journalist and the Murderer , Janet Malcolm wrote something that shocked and angered people. In her eyes, the objective analysis of evidence to determine a person’s guilt or innocence is an utterly futile endeavour. “It is like looking for proof or disproof of the existence of God in a flower,” she wrote. “It all depends on how you read the evidence. If you start out with a presumption of his guilt, you read the documents one way, and another way if you presume his innocence. The material does not ‘speak for itself’.”\n\nThe same goes for reading people: the presumption of guilt will load the person’s words, tone, expressions and actions with strangeness and darkness, the presumption of innocence will vindicate them. Objectivity is impossible.\n\nIt’s also boring.\n\nI am no bystander in the wave of true crime dramas that have crashed into popular culture in recent times: from Sarah Koenig’s Serial podcast, to Andrew Jarecki’s HBO series The Jinx, and now, Laura Ricciardi and Moira Demos’s Netflix show Making A Murderer. I have prayed for Adnan Syed’s innocence, I have sworn my certainty of Robert Durst’s burping guilt, I have taped a picture of Dean Strang inside the locker of my heart. I love these shows for their strangeness, for their sheer spectacle, and for the thrill each time new and crazier evidence comes to light, confirming my insightful suspicions.\n\nThe makers of Serial, The Jinx, and Making a Murderer would all declare their purposes were twofold: to make an entertaining programme, and to find the truth. If finding the truth necessitates remaining objective, I’m not sure to what extent these aims are compatible.\n\nReal life crime stories have long been treated as entertainment: from eighteenth-century tabloids to In Cold Blood to The Thin Blue Line. Take, for example, the early twentieth century magazine, True Detective, which splashed sensational stories across its covers like “The Riddle of Oregon’s Dismembered Brunette”, and spawned giants of the genre like Dashiell Hammett, Jim Thompson, and Ann Rule. Serial, The Jinx and Making a Murderer do show how far the genre has developed since then, but they also share some key similarities. They all concern the violent deaths of beautiful young women, they all suggest that the police were incompetent in securing justice for that woman’s death, and they all invite the audience to retrace the gory details of her killing (perhaps in order to “save” her by ensuring her real killer is punished).\n\nThis is just one of the immediate ways in which true crime can be ethically tricky. Do we want to know every gory detail of these crimes because we care about the victim, or because it excites us? Do we crane our necks at grieving parents for our own entertainment? Is it inherently unethical to treat real lives as spectacle? Aside from general distastefulness, what practical impact does taking evidence out of the courtroom, and into the laps of a potentially limitless audience, have over a case? What are the benefits, and the dangers, of deciding that the law is wrong? These questions are easily asked, and difficult to answer.\n\nIf, as Malcolm argues, our reading of a case is utterly dependent on our own presumptions, what do true crime programmes presume? Overtly or not, the ultimate goal of these programmes is to set out to contradict the current narrative surrounding these cases. On the latest series of Serial, Sarah Koenig says, “I don’t think the state’s story is the correct story.” That’s a provocative, rebellious, exciting statement. The most interesting conclusions is not, “We can never know for certain, and on balance, we agree with what the state decided at the time.” For better or worse, these programmes do begin with a presumption before they read the evidence, and the presumption is that the dominant narrative is wrong.\n\nAs its title suggests, Making a Murderer is in many ways a story about storytelling: it argues that the state, and contemporary media, fabricated the character of “Steven Avery, the Murderer” because the story was irresistible. It argues that the prosecution, newspapers and television networks manipulated the jury (many potential jurors said at the time they were unfit for court because they were already certain of Avery’s guilt) by offering them a shocking story of kidnap, rape, and murder. Their theory, that Avery was framed by police, is perhaps as shocking in its own way: it’s a tale of systematic deception and incompetence; lies, betrayal, injustice. Like Serial and The Jinx, it has to pose a more interesting alternative to an already interesting story (Serial posits that Hae Min Lee’s real killer still walks free, The Jinx that power, money and shrewdness enabled a violent serial killer to evade capture). Also like Serial and The Jinx, it’s an artistically rendered show, which ensures its subjectivity.\n\nThe makers of these programmes have all been accused of threatening their objectivity by becoming too close with their subjects. A large part of true crime’s appeal is the level of access it brings the viewer: they should be able to offer a more intimate and comprehensive portrait of their subjects than the courts. Koening and Jarecki in particular structure their stories around their own personal interactions with friends, family and, most importantly, their subjects themselves. Koenig said her relationship with Syed is “Definitely [...] weird and hard to define. It’s a personal relationship. It’s not truly professional.” Jarecki’s ultimate opinion of Durst changes when he (Durst) stops answering his calls. When these personal relationships eat significantly into the narrative, they command unusual power over audience’s final judgements.\n\nSo, too, has each programme been criticised for manipulating the evidence, or leaving out problematic pieces of information that dilute its narrative. Serial failed to include diary extracts that portay Adnan Syed (the man imprisoned for murder) as abusive to his girlfriend, the case’s victim, Hae Min Lee. The Jinx changed up the order of events. Making a Murderer did not disclose that Steven Avery called Teresa Halbach on the day she died, using a feature to disguise his number.\n\nThese programmes have also all been criticised for taking the law into their own hands – the argument being that they could jeopardise ongoing or potential future investigations. The makers of The Jinx, for example, used a key piece of evidence – a handwriting sample from the murderer that matched Robert Durst’s (pictured above) – in their show’s dramatic reveal. As they buried this lead for the sake of suspense, they didn’t give it to authorities, but held onto it for months in order to present it to Durst on camera. Durst was then arrested the evening the finale aired.\n\nThis, of course, has direct repercussions for the police, but more indirect ones too. By moving the power to assess guilt and innocence into the hands of the general public who sit outside of juries, audiences are encouraged to sleuth for their own information. After Serial aired, listeners poured over the private diary entries of a dead woman searching for clues of their own, posting conspiracy theories all over the internet. The same goes for other programmes. Steven Avery’s defence lawyers Jerry Buting and Dean Strang say, “There are people all over the world who are really picking this case apart now. Maybe someone who saw something or has kept a secret for 10 years will come forward. And judges read online news sources just like everybody else.” While potentially invasive, this is, then, a democratisation of the criminal justice system. But will that mean fewer Steven Averys in future, or more? Right now, it feels like the world is united in Avery’s defence, but Making of a Murderer seeks to demonstrate that Avery’s first false conviction was in part a result of prejudiced members of the public having undue influence over the state. If audiences are so swayed by these show’s subjective narratives, how truly democratic can this be?\n\nOne of the main themes Making a Murderer revisits again and again is the vulnerability of the Avery family. In Avery’s own words, “Poor people lose... poor people lose all the time.” “They didn’t dress like everybody else, they didn’t have education like everybody else... the Avery family didn’t fit in to the community,” explains one of Avery’s first lawyers. “Penny Beerntsen [the victim from Avery’s first conviction] was everything Stephen wasn’t.” Strang describes Steven Avery’s nephew Brendan – a key witness in his second conviction – as “a learning-disabled 16-year-old who’s not equipped to face the trouble in which he finds himself.” Here, then, are individuals who are easily taken advantage of, especially by authority figures with power, resources, and an agenda.\n\nThe journalist, too, is a figure of authority with power, resources, and an agenda. Why wouldn’t someone who feels that they have been wronged or humiliated want to believe that the journalist is the answer to their prayers, the person who could set the world to rights? In that case, what does it mean to take the lives of ordinary, vulnerable people, and turn them into entertainment for a potentially limitless audience? Could it rescue them, and others like them? Could it be another way for them to have their lives “taken away”?\n\nThroughout the series, Brendan’s particular narrative is one of a young man who is not allowed to tell his own story for himself. He gives an initial statement saying he saw Steven for parts of that day, and nothing of note occurred. Investigators are suspicious, and bring him in for more questioning. “We know there’s some things you left out, and we know there’s some things that weren’t quite correct,” they insist. “We really need you to be honest this time.” An interview with a confessions expert is shown, who says “When they say to Brendan, ‘Be honest,’ what they sort of mean is... ‘Don’t tell us that, tell us something else.’” Brendan assents to leading questions from officers (Wiegert and Fassbender). When he is asked to give details himself, his suggestions are delivered like a student grasping for the plot details of a book they haven’t read, to an exasperated literature teacher.\n\nWiegert: Come on. Something with the head. Brendan? What else did you guys do? Come on.\n\nFassbender: What he made you do, Brendan. We know he made you do something else.\n\nWiegert: What was it? What was it?\n\nFassbender: We have the evidence, Brendan. We just need you to... to be honest with us.\n\nBrendan: ... That he cut off her hair.\n\nWiegert: He cut off her hair? OK. What else?\n\nFassbender: What else was done to her head?\n\nBrendan: ... That he punched her.\n\nWiegert: What else?\n\nFassbender: It’s extremely, extremely important you tell us this for us to believe you.\n\nWiegert: Come on, Brendan. What else?\n\nFassbender: We know. We just need you to tell us.\n\nBrendan: That’s all I can remember.\n\nWiegert: All right, I’m just gonna come out and ask you. Who shot her in the head?\n\nBrendan: He did.\n\nWiegert: Why didn’t you tell us that?\n\nBrendan: ’Cause I couldn’t think of it.\n\nHe later tells his mother on the phone that he was “guessing”, explaining, “that’s what I do with my homework, too”. When Brendan tries to give a third statement contradicting this one (and confirming his first: that nothing of note happened), he is told “I want you to testify against Steven Avery and tell the truth. And this is how I can help you. But I can’t help you with those words that you wrote down. Those words, I can’t help you at all.” Brendan is not given ownership over his own narrative.\n\nArguably, by pointing this out, the producers of Making a Murderer are rescuing Brendan, offering him an alternative. Brendan looks better in their story, the one where he’s an impressionable young man who didn’t commit any violent crimes, rather than an impressionable young man who did. But it’s naive to assume that because it’s more positive, it’s any more his. Brendan is ill-equipped to defend himself to police, so does it follow that he is more equipped to handle the level of scrutiny that comes with being on an internationally-followed documentary series? We might hear Brendan’s voice and see his words on paper, but, arguably, he has even less power to assert himself here than he does in police custody.\n\nThe programme rightly asserts that it’s unethical to treat vulnerable young people like pliable evidence, moulding their stories to support your case. How far, in any sense, can Making a Murderer be considered guilty of doing the same?\n\nMaking a Murderer, The Jinx, Serial and the rest all play with using dramatic conventions to vitalise journalistic storytelling. That means that, to a degree, they turn their subjects into characters. Malcolm writes that perhaps the key difference between fictional characters and tangible, breathing humans is that the former “are drawn with much broader and blunter strokes, are much simpler, more generic (or, as they used to say, mythic) creatures than real people, and their preternatural vividness derives from their unambiguous fixity and consistency”. Real people, then, due to their nuance, their complexity, their ambiguity, and their capacity for change, make, for the most part, fairly dull comparisons. That means that when looking for their protagonist, true crime writers search for “people of a certain rare, exhibitionistic, self-fabulising nature, who have already done the work on themselves that the novelist does on his imaginary characters – who, in short, present themselves as ready-made literary figures.”\n\nThis is how we get Adnan the falsely imprisoned model minority, Robert Durst the bitter little rich boy with delusions of grandeur, and Steven Avery the everyman trampled by the system: twice.\n\nWhen people become characters, objectivity is sidelined, and subjectivity rules. This is what allowed audience members to pronounce themselves not #TeamEdward or #TeamJacob, but #TeamAdnan on social media, or to see Avery’s defence team as more morally unblemished than Atticus Finch. It’s what caused someone convincingly purporting to be Hae Min Lee’s brother on Reddit to insist “TO ME ITS REAL LIFE. To you listeners, its [sic] another murder mystery, crime drama, another episode of CSI. You weren’t there to see your mom crying every night [...] I pray that you don’t have to go through what we went through and have your story blasted to 5mil listeners.” It’s what caused an outcry at the end of Serial’s first season when it failed to offer a crime drama-style closing revelation: even journalists like Mike Pesca on the Slate metapodcast, were frustrated. “Don’t let this,” he said, “wind up being a contemplation on the nature of truth.” And it’s what convinces people so utterly that their own take on each story is the right one.\n\nIn Making a Murderer, Dean Strang states, “Most of what ails our criminal justice system lies in unwarranted certitude on the part of police officers and prosecutors and defence lawyers and judges and jurors that they are getting it right. That they are simply right. Just a tragic lack of humility in everyone who participates in our criminal justice system.” Arguably, these programmes are extending the problem to those who don’t participate at all.\n\nI wish I could handle these questions with Janet Malcolm’s fire and certainty, and insist that “every journalist who is not too stupid or too full of himself to notice what is going on knows that what he does is morally indefensible”, that these programmes have only “deepened my consciousness of the canker that lies at the heart of the rose of journalism”. Despite myself, I’m glad that The Jinx was made, not just because I devoured it, but because I think Robert Durst probably did it, and I’m glad he was arrested. If he is found guilty, shouldn’t we be grateful? I’m glad that Making a Murderer was made too, because I think law enforcement needs to be more intensely scrutinised, and whether the framing narrative proves to be true or not, the programme reveals the officers at its core to be, at the very least, worryingly incompetent.\n\nI still believe that true crime can be sceptical, revealing, and challenging in way that is productive, not just titillating. But as with any artistic genre, it is doomed to remain subjective and impressionistic, and can be inaccurate and misleading. Audiences therefore have a responsibility to treat every new story as an artefact to be examined, analysed, and interrogated from a number of angles. It cannot be allowed to speak for itself.\n\nNow listen to Anna discussing this on the NS pop culture podcast:", "images": ["https://www.facebook.com/tr?ev=6025943409225&cd[value]=0.00&cd[currency]=GBP&noscript=1", "https://www.newstatesman.com/sites/default/files/styles/most_popular_homesectiontrending_264_198/public/blogs_2020/04/gettyimages-83160983.jpg?itok=Nsc45Qv7&c=042fb6f82f9337cd00f2cb6c0e706fa7", "https://www.newstatesman.com/sites/all/themes/creative-responsive-theme/images/nsnetworks.png", "https://www.facebook.com/tr?ev=6032031760848&cd[value]=0.00&cd[currency]=GBP&noscript=1", "https://www.newstatesman.com/sites/default/files/styles/most_popular_homesectiontrending_264_198/public/blogs_2020/04/gettyimages-803999638.jpg?itok=v5LJPLvC&c=203d454905210c0479e97bbd562370d1", "https://www.newstatesman.com/sites/default/files/styles/magazine-cover-thumb/public/magazinecovers/2020_14_spring_special_med.jpg?itok=rbo6JJvO", "http://www.newstatesman.com/sites/default/files/styles/large/public/robert_durst_handwriting.jpg?itok=93ASBYxz", "https://www.newstatesman.com/sites/default/files/styles/homesection_image/public/blogs_2016/01/mam.jpg?itok=4z7Xjwcf", "https://www.newstatesman.com/sites/default/files/ns_book_offer_feb_18.jpg", "http://www.newstatesman.com/sites/default/files/styles/large/public/avery.jpg?itok=mlO0VYPb", "https://www.newstatesman.com/sites/default/files/anna_leszkiewicz_resized.jpg", "https://www.newstatesman.com/sites/all/modules/paywall/assets/img/private-modal.png", "https://newstatesman.com/sites/all/themes/creative-responsive-theme/images/newstatesman_logo@2x.png", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/975790991/?value=0&guid=ON&script=0", "https://www.newstatesman.com/sites/default/files/styles/nodeimage/public/blogs_2016/01/mam.jpg?itok=-PFS_8VP", "https://t.co/i/adsct?txn_id=ntow3&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://www.newstatesman.com/sites/default/files/styles/large/public/ns-ga.jpeg?itok=soqxWQNh", "https://www.newstatesman.com/sites/default/files/styles/thumb_360_203/public/blogs_2020/04/mc.jpg?itok=GDyAtbb3", "https://www.newstatesman.com/sites/all/themes/creative-responsive-theme/images/newstatesman_logo@2x.png", "https://www.newstatesman.com/sites/default/files/styles/most_popular_homesectiontrending_264_198/public/blogs_2020/04/gettyimages-1209936647.jpg?itok=K4PAExSq", "https://www.newstatesman.com/sites/default/files/styles/thumb_360_203/public/blogs_2020/04/gettyimages-1145713456.jpg?itok=vcaHGIg5", "https://www.newstatesman.com/sites/default/files/styles/most_popular_homesectiontrending_264_198/public/Longreads_2020/04/gettyimages-1208384077.jpg?itok=ptYDAnHW&c=d6cac1e4cba3d73bffadcc7221a19ee7", "https://www.newstatesman.com/sites/default/files/styles/thumb_360_203/public/blogs_2020/04/quiz.jpg?itok=LWDf1xZC", "https://www.newstatesman.com/sites/default/files/styles/trending_264_198/public/blogs_2020/03/shutterstock_heart_monitor_liverpool.jpg?itok=7Z50AShk&c=0b31f36b14f1af1115d3279da7204d07", "https://analytics.twitter.com/i/adsct?txn_id=ntow3&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "http://ir-uk.amazon-adsystem.com/e/ir?t=newstatesmanc-21&l=as2&o=2&a=1847085342", "https://www.facebook.com/tr?id=526380280843209&ev=PixelInitialized", "http://www.newstatesman.com/sites/default/files/styles/large/public/true_detective_1.jpg?itok=Wk8YVuxH"], "top_img": "https://www.newstatesman.com/sites/default/files/styles/homesection_image/public/blogs_2016/01/mam.jpg?itok=4z7Xjwcf", "keywords": [], "authors": ["Thomas Bird", "Jim Weatherall", "Helen Duckworth", "Simon Maskell"], "canonical_link": "https://www.newstatesman.com/culture/tv-radio/2016/01/serial-making-murderer-can-true-crime-entertainment-ever-be-ethical", "title": "From Serial to Making a Murderer: can true crime as entertainment ever be ethical?", "meta_data": {"og": {"image": "https://www.newstatesman.com/sites/default/files/styles/homesection_image/public/blogs_2016/01/mam.jpg?itok=4z7Xjwcf", "type": "article", "url": "https://www.newstatesman.com/culture/tv-radio/2016/01/serial-making-murderer-can-true-crime-entertainment-ever-be-ethical", "title": "From Serial to Making a Murderer: can true crime as entertainment ever be ethical?", "description": "In her book The Journalist and the Murderer, Janet Malcolm wrote something that shocked and angered people. In her eyes, the objective analysis of evidence to determine a person’s guilt or innocence is an utterly futile endeavour. “It is like looking for proof or disproof of the existence of God in a flower,” she wrote. “It all depends on how you read the evidence. If you start out with a presumption of his guilt, you read the documents one way, and another way if you presume his innocence. The material does not ‘speak for itself’.” The same goes for reading people: the presumption of guilt will load the person’s words, tone, expressions and actions with strangeness and darkness, the presumption of innocence will vindicate them. Objectivity is impossible. It’s also boring. I am no bystander in the wave of true crime dramas that have crashed into popular culture in recent times: from Sarah Koenig’s Serial podcast, to Andrew Jarecki’s HBO series The Jinx, and now, Laura Ricciardi and Moira Demos’s Netflix show Making A Murderer. I have prayed for Adnan Syed’s innocence, I have sworn my certainty of Robert Durst’s burping guilt, I have taped a picture of Dean Strang inside the locker of my heart. I love these shows for their strangeness, for their sheer spectacle, and for the thrill each time new and crazier evidence comes to light, confirming my insightful suspicions. The makers of Serial, The Jinx, and Making a Murderer would all declare their purposes were twofold: to make an entertaining programme, and to find the truth. If finding the truth necessitates remaining objective, I’m not sure to what extent these aims are compatible. Real life crime stories have long been treated as entertainment: from eighteenth-century tabloids to In Cold Blood to The Thin Blue Line. Take, for example, the early twentieth century magazine, True Detective, which splashed sensational stories across its covers like “The Riddle of Oregon’s Dismembered Brunette”, and spawned giants of the genre like Dashiell Hammett, Jim Thompson, and Ann Rule. Serial, The Jinx and Making a Murderer do show how far the genre has developed since then, but they also share some key similarities. They all concern the violent deaths of beautiful young women, they all suggest that the police were incompetent in securing justice for that woman’s death, and they all invite the audience to retrace the gory details of her killing (perhaps in order to “save” her by ensuring her real killer is punished).  This is just one of the immediate ways in which true crime can be ethically tricky. Do we want to know every gory detail of these crimes because we care about the victim, or because it excites us? Do we crane our necks at grieving parents for our own entertainment? Is it inherently unethical to treat real lives as spectacle? Aside from general distastefulness, what practical impact does taking evidence out of the courtroom, and into the laps of a potentially limitless audience, have over a case? What are the benefits, and the dangers, of deciding that the law is wrong? These questions are easily asked, and difficult to answer. If, as Malcolm argues, our reading of a case is utterly dependent on our own presumptions, what do true crime programmes presume? Overtly or not, the ultimate goal of these programmes is to set out to contradict the current narrative surrounding these cases. On the latest series of Serial, Sarah Koenig says, “I don’t think the state’s story is the correct story.” That’s a provocative, rebellious, exciting statement. The most interesting conclusions is not, “We can never know for certain, and on balance, we agree with what the state decided at the time.” For better or worse, these programmes do begin with a presumption before they read the evidence, and the presumption is that the dominant narrative is wrong. As its title suggests, Making a Murderer is in many ways a story about storytelling: it argues that the state, and contemporary media, fabricated the character of “Steven Avery, the Murderer” because the story was irresistible. It argues that the prosecution, newspapers and television networks manipulated the jury (many potential jurors said at the time they were unfit for court because they were already certain of Avery’s guilt) by offering them a shocking story of kidnap, rape, and murder. Their theory, that Avery was framed by police, is perhaps as shocking in its own way: it’s a tale of systematic deception and incompetence; lies, betrayal, injustice. Like Serial and The Jinx, it has to pose a more interesting alternative to an already interesting story (Serial posits that Hae Min Lee’s real killer still walks free, The Jinx that power, money and shrewdness enabled a violent serial killer to evade capture). Also like Serial and The Jinx, it’s an artistically rendered show, which ensures its subjectivity. The makers of these programmes have all been accused of threatening their objectivity by becoming too close with their subjects. A large part of true crime’s appeal is the level of access it brings the viewer: they should be able to offer a more intimate and comprehensive portrait of their subjects than the courts. Koening and Jarecki in particular structure their stories around their own personal interactions with friends, family and, most importantly, their subjects themselves. Koenig said her relationship with Syed is “Definitely [...] weird and hard to define. It’s a personal relationship. It’s not truly professional.” Jarecki’s ultimate opinion of Durst changes when he (Durst) stops answering his calls. When these personal relationships eat significantly into the narrative, they command unusual power over audience’s final judgements.  So, too, has each programme been criticised for manipulating the evidence, or leaving out problematic pieces of information that dilute its narrative. Serial failed to include diary extracts that portay Adnan Syed (the man imprisoned for murder) as abusive to his girlfriend, the case’s victim, Hae Min Lee. The Jinx changed up the order of events. Making a Murderer did not disclose that Steven Avery called Teresa Halbach on the day she died, using a feature to disguise his number. These programmes have also all been criticised for taking the law into their own hands – the argument being that they could jeopardise ongoing or potential future investigations. The makers of The Jinx, for example, used a key piece of evidence – a handwriting sample from the murderer that matched Robert Durst’s (pictured above) – in their show’s dramatic reveal. As they buried this lead for the sake of suspense, they didn’t give it to authorities, but held onto it for months in order to present it to Durst on camera. Durst was then arrested the evening the finale aired. This, of course, has direct repercussions for the police, but more indirect ones too. By moving the power to assess guilt and innocence into the hands of the general public who sit outside of juries, audiences are encouraged to sleuth for their own information. After Serial aired, listeners poured over the private diary entries of a dead woman searching for clues of their own, posting conspiracy theories all over the internet. The same goes for other programmes. Steven Avery’s defence lawyers Jerry Buting and Dean Strang say, “There are people all over the world who are really picking this case apart now. Maybe someone who saw something or has kept a secret for 10 years will come forward. And judges read online news sources just like everybody else.” While potentially invasive, this is, then, a democratisation of the criminal justice system. But will that mean fewer Steven Averys in future, or more? Right now, it feels like the world is united in Avery’s defence, but Making of a Murderer seeks to demonstrate that Avery’s first false conviction was in part a result of prejudiced members of the public having undue influence over the state. If audiences are so swayed by these show’s subjective narratives, how truly democratic can this be?  One of the main themes Making a Murderer revisits again and again is the vulnerability of the Avery family. In Avery’s own words, “Poor people lose... poor people lose all the time.” “They didn’t dress like everybody else, they didn’t have education like everybody else... the Avery family didn’t fit in to the community,” explains one of Avery’s first lawyers. “Penny Beerntsen [the victim from Avery’s first conviction] was everything Stephen wasn’t.” Strang describes Steven Avery’s nephew Brendan – a key witness in his second conviction – as “a learning-disabled 16-year-old who’s not equipped to face the trouble in which he finds himself.” Here, then, are individuals who are easily taken advantage of, especially by authority figures with power, resources, and an agenda. The journalist, too, is a figure of authority with power, resources, and an agenda. Why wouldn’t someone who feels that they have been wronged or humiliated want to believe that the journalist is the answer to their prayers, the person who could set the world to rights? In that case, what does it mean to take the lives of ordinary, vulnerable people, and turn them into entertainment for a potentially limitless audience? Could it rescue them, and others like them? Could it be another way for them to have their lives “taken away”? Throughout the series, Brendan’s particular narrative is one of a young man who is not allowed to tell his own story for himself. He gives an initial statement saying he saw Steven for parts of that day, and nothing of note occurred. Investigators are suspicious, and bring him in for more questioning. “We know there’s some things you left out, and we know there’s some things that weren’t quite correct,” they insist. “We really need you to be honest this time.” An interview with a confessions expert is shown, who says “When they say to Brendan, ‘Be honest,’ what they sort of mean is... ‘Don’t tell us that, tell us something else.’” Brendan assents to leading questions from officers (Wiegert and Fassbender). When he is asked to give details himself, his suggestions are delivered like a student grasping for the plot details of a book they haven’t read, to an exasperated literature teacher. Wiegert: Come on. Something with the head. Brendan? What else did you guys do? Come on. Fassbender: What he made you do, Brendan. We know he made you do something else. Wiegert: What was it? What was it? Fassbender: We have the evidence, Brendan. We just need you to... to be honest with us. Brendan: ... That he cut off her hair. Wiegert: He cut off her hair? OK. What else? Fassbender: What else was done to her head? Brendan: ... That he punched her. Wiegert: What else? Fassbender: It’s extremely, extremely important you tell us this for us to believe you. Wiegert: Come on, Brendan. What else? Fassbender: We know. We just need you to tell us. Brendan: That’s all I can remember. Wiegert: All right, I’m just gonna come out and ask you. Who shot her in the head? Brendan: He did. Wiegert: Why didn’t you tell us that? Brendan: ’Cause I couldn’t think of it. He later tells his mother on the phone that he was “guessing”, explaining, “that’s what I do with my homework, too”. When Brendan tries to give a third statement contradicting this one (and confirming his first: that nothing of note happened), he is told “I want you to testify against Steven Avery and tell the truth. And this is how I can help you. But I can’t help you with those words that you wrote down. Those words, I can’t help you at all.” Brendan is not given ownership over his own narrative. Arguably, by pointing this out, the producers of Making a Murderer are rescuing Brendan, offering him an alternative. Brendan looks better in their story, the one where he’s an impressionable young man who didn’t commit any violent crimes, rather than an impressionable young man who did. But it’s naive to assume that because it’s more positive, it’s any more his. Brendan is ill-equipped to defend himself to police, so does it follow that he is more equipped to handle the level of scrutiny that comes with being on an internationally-followed documentary series? We might hear Brendan’s voice and see his words on paper, but, arguably, he has even less power to assert himself here than he does in police custody. The programme rightly asserts that it’s unethical to treat vulnerable young people like pliable evidence, moulding their stories to support your case. How far, in any sense, can Making a Murderer be considered guilty of doing the same? Making a Murderer, The Jinx, Serial and the rest all play with using dramatic conventions to vitalise journalistic storytelling. That means that, to a degree, they turn their subjects into characters. Malcolm writes that perhaps the key difference between fictional characters and tangible, breathing humans is that the former “are drawn with much broader and blunter strokes, are much simpler, more generic (or, as they used to say, mythic) creatures than real people, and their preternatural vividness derives from their unambiguous fixity and consistency”. Real people, then, due to their nuance, their complexity, their ambiguity, and their capacity for change, make, for the most part, fairly dull comparisons. That means that when looking for their protagonist, true crime writers search for “people of a certain rare, exhibitionistic, self-fabulising nature, who have already done the work on themselves that the novelist does on his imaginary characters – who, in short, present themselves as ready-made literary figures.” This is how we get Adnan the falsely imprisoned model minority, Robert Durst the bitter little rich boy with delusions of grandeur, and Steven Avery the everyman trampled by the system: twice. When people become characters, objectivity is sidelined, and subjectivity rules. This is what allowed audience members to pronounce themselves not #TeamEdward or #TeamJacob, but #TeamAdnan on social media, or to see Avery’s defence team as more morally unblemished than Atticus Finch. It’s what caused someone convincingly purporting to be Hae Min Lee’s brother on Reddit to insist “TO ME ITS REAL LIFE. To you listeners, its [sic] another murder mystery, crime drama, another episode of CSI. You weren’t there to see your mom crying every night [...] I pray that you don’t have to go through what we went through and have your story blasted to 5mil listeners.” It’s what caused an outcry at the end of Serial’s first season when it failed to offer a crime drama-style closing revelation: even journalists like Mike Pesca on the Slate metapodcast, were frustrated. “Don’t let this,” he said, “wind up being a contemplation on the nature of truth.” And it’s what convinces people so utterly that their own take on each story is the right one. In Making a Murderer, Dean Strang states, “Most of what ails our criminal justice system lies in unwarranted certitude on the part of police officers and prosecutors and defence lawyers and judges and jurors that they are getting it right. That they are simply right. Just a tragic lack of humility in everyone who participates in our criminal justice system.” Arguably, these programmes are extending the problem to those who don’t participate at all. I wish I could handle these questions with Janet Malcolm’s fire and certainty, and insist that “every journalist who is not too stupid or too full of himself to notice what is going on knows that what he does is morally indefensible”, that these programmes have only “deepened my consciousness of the canker that lies at the heart of the rose of journalism”. Despite myself, I’m glad that The Jinx was made, not just because I devoured it, but because I think Robert Durst probably did it, and I’m glad he was arrested. If he is found guilty, shouldn’t we be grateful? I’m glad that Making a Murderer was made too, because I think law enforcement needs to be more intensely scrutinised, and whether the framing narrative proves to be true or not, the programme reveals the officers at its core to be, at the very least, worryingly incompetent. I still believe that true crime can be sceptical, revealing, and challenging in way that is productive, not just titillating. But as with any artistic genre, it is doomed to remain subjective and impressionistic, and can be inaccurate and misleading. Audiences therefore have a responsibility to treat every new story as an artefact to be examined, analysed, and interrogated from a number of angles. It cannot be allowed to speak for itself. Now listen to Anna discussing this on the NS pop culture podcast:"}, "viewport": "width=device-width", "description": "Real life crime stories have long been treated as entertainment, but with the rise of global phenomenons like Serial and Making a Murderer, the line between investigation and titillation is more blurred than ever.", "abstract": "Real life crime stories have long been treated as entertainment, but with the rise of global phenomenons like Serial and Making a Murderer, the line between investigation and titillation is more blurred than ever.", "keywords": "New Statesman magazine, International Politics, British Politics, Britain, UK, Tony Blair, Gordon Brown, Geoffrey Robinson, David Cameron, Sir Menzies Campbell, Labour, Conservative, Liberal Democrat, UK Politics, House of Commons, House of Lords, Legislation, politics magazine", "robots": "follow, index", "news_keywords": "New Statesman magazine, International Politics, British Politics, Britain, UK, Tony Blair, Gordon Brown, Geoffrey Robinson, David Cameron, Sir Menzies Campbell, Labour, Conservative, Liberal Democrat, UK Politics, House of Commons, House of Lords, Legislation, politics magazin", "generator": "Drupal 7 (http://drupal.org)", "rights": "New Statesman Ltd", "fb": {"pages": 100959719644}, "twitter": {"card": "summary_large_image", "site": "@NewStatesman", "creator": {"identifier": "@NewStatesman", "id": 19906615}, "url": "https://www.newstatesman.com/culture/tv-radio/2016/01/serial-making-murderer-can-true-crime-entertainment-ever-be-ethical", "description": "Real life crime stories have long been treated as entertainment, but with the rise of global phenomenons like Serial and Making a Murderer, the line between investigation and titillation is more"}, "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff", "google-site-verification": "GfOJMinBD7e8A_EFHIWacMNjU-AM1WaPrpnAVzwr7-4", "DCSext.WebsiteName": "www.newstatesman.com"}, "movies": [], "publish_date": null, "source": "https://www.newstatesman.com", "summary": ""}