{"url": "https://ftw.usatoday.com/2018/08/kristin-cavallari-tells-jay-cutler-im-with-you-because-i-love-you-not-because-i-need-you", "text": "On the season finale of Very Cavallari (tears), Kristin is very nervous about the opening of the Uncommon James store. Her mom came in to support her and there’s a nice champagne toast with just the staff, and, for a few minutes everything looks like it’s going fine.\n\nBut then, an hour before the launch party, there’s a problem already: The catering isn’t there!\n\nSo, Kristin and her very freaked out store manager, Brittainy, gets in touch with the caterer – Chef Laura. Poor Chef Laura, who I hope is someone that E! hired and isn’t a real person because she will probably never get hired by anyone who saw this show, informs Brittainy that she thought the launch was tomorrow and starts also freaking out.\n\n“I’m going to make this happen,” she promises. “It’s not what I would normally do but I will (expletive) make it happen.”\n\nKristin drops an f bomb.\n\n“We’re just going to roll with the punches,” she says later, much more calmly.\n\nAnother note in defense of Chef Laura: Since Kristin’s staff has been proven to be not really great at what they do sometimes, it is totally possible someone told poor Chef Laura the wrong date.\n\nAlso, Kristin makes a good point: “People remember the alcohol, they don’t remember the food.”\n\nWhich, it turns out, is good because social media manager Shannon declares the sushi is from the grocery store. “It’s ratchet,” she declares.\n\nThe rest of the launch party goes fine and Jay Cutler appears finally in the scene as a very supportive husband. Kristin thanks him in her speech for being a “super dad” and giving her time to get her store off the ground, a dream she says she’s had for seven years.\n\nThe next day the Uncommon James homegoods line launches online. Kristin reads the newsletter and immediately notices that Shannon messed up the link – again. “Drop the hammer on some people,” Cutler advises after Kristin’s short rant about Shannon always messing up.\n\nThen, Kristin notices that the shipping price is wrong. “I’m actually losing money on that,” she says, understandably freaking out. Cutler, somehow knowing that one of Kristin’s employees messed up the shipping weights, asks who was in charge of that.\n\n“I’d shut down the homegoods until you guys have it figured it out,” he advises. “Go in there and tell them you’re taking it out of people’s paychecks.”\n\nThis, by the way, is not something you can actually do unless you play in the NFL and get fined for something, though his point is good because these people seem really bad at their jobs.\n\nKristin heads into the store and starts crying in the car after Brittainy can’t figure out what went wrong with the shipping. Once she gets to the store Brittainy says she fixed the website and Shannon says she didn’t include the link into the newsletter because she didn’t know the link. This is the actual worst excuse, which pretty understandably sets Kristin off.\n\n“This is my whole (expletive) world right now and it got (expletive) this morning,” she said.\n\nShannon then continues into a worse explanation of how she got the newsletter link wrong. “I was drunk on tequila and set an alarm at 2 a.m. to post that so it would be right with Central Time and all of the times,” she says, which is worse. Who tells their boss they were super drunk so then had to get up in the middle of the night instead of doing work at a normal hour and sober?\n\nLuckily, the sales end up going pretty well and Kristin ends up smiling by the end of the first day. Cutler advises just suspending someone next time they mess up that badly and offers to fill in as social media editor.\n\n“I wouldn’t have a store if it wasn’t for Instagram,” Kristin explains, which probably isn’t wrong.\n\nKristin later talks with Shannon and Brittainy about their futures. Brittainy, she says, is a good manager who had too much on her plate but showed excellent skills by fixing her giant mistake this week very quickly. Shannon, on the other hand, asks for more responsibilities which Kristin shuts down pretty quickly.\n\nThey then try to explain how they’re cool despite Kristin always yelling at Shannon and Shannon being pretty inept.\n\nThe episode winds down with Kristin and Cutler riding in a car. Kristin asks Cutler an important question: “What are your sunglasses?”\n\n“Awesome,” he replies.\n\n“Are they?” she asks, knowing that they’re not.\n\nThen, they talk about future plans – which includes her one day getting an apartment closer to the store in Nashville. She says she’ll buy it with her own money after Cutler says he doesn’t like that idea.\n\n“You have your money,” he says. “But then all of my money is our money.”\n\n“That’s how it should be,” she replies. “The girl should have her own stash. No girl should stay in a relationship because the guy is supporting her. I’m with you because I love you not because I need you.”\n\n“That’s good to hear,” Cutler says.", "images": ["https://usatftw.files.wordpress.com/2015/11/logo-ftw.png", "https://usatftw.files.wordpress.com/2020/04/zabit.jpg?w=34&h=20&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://usatftw.files.wordpress.com/2017/08/c02_kristin_29_46525433-e1502128880418.jpg?w=1000&h=600&crop=1", "https://usatftw.files.wordpress.com/2015/11/logo-usat-bar.png", "https://usatftw.files.wordpress.com/2020/04/butler.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2018/07/usp-nfl_-new-england-patriots-at-miami-dolphins_95970057-e1531144289161.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2015/11/ftw-icon-section-head.png", "https://usatftw.files.wordpress.com/2017/08/c02_kristin_29_46525433-e1502128880418.jpg?w=1024&h=576&crop=1", "https://usatftw.files.wordpress.com/2020/04/lamartrump.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2020/01/tuatagovailoa.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2020/04/warriors.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2020/04/libertyno1.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/08/cutler.jpg?w=100&h=52#038;h=521", "https://usatftw.files.wordpress.com/2018/07/455101536_72969818-e1530624017887.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2013/12/writer.jpg?w=48&h=48&crop=1", "https://usatftw.files.wordpress.com/2020/04/screen-shot-2020-04-18-at-5.44.02-pm.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/08/cutler.jpg?w=1000&h=521", "https://usatftw.files.wordpress.com/2020/04/fifa.png?w=34&h=20&crop=1"], "top_img": "https://usatftw.files.wordpress.com/2017/08/c02_kristin_29_46525433-e1502128880418.jpg?w=1024&h=576&crop=1", "keywords": [], "authors": ["Nina Mandell", "Nick Schwartz", "August"], "canonical_link": "https://ftw.usatoday.com/2018/08/kristin-cavallari-tells-jay-cutler-im-with-you-because-i-love-you-not-because-i-need-you", "title": "Kristin Cavallari tells Jay Cutler: 'I'm with you because I love you not because I need you.'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The season finale of the show aired on Sunday.", "keywords": "nfl, jay cutler, kristin cavallari, very cavallari", "fb": {"app_id": 451360081611296, "admins": 1651440013}, "google-site-verification": "no3A69hVM5ut63_reMWqC5VegUmDtCMsgeO4Wh_iBY8", "msvalidate.01": "6C7AFE373C691E833D6444FFA7F6E8A2", "generator": "WordPress.com", "og": {"type": "article", "title": "Kristin Cavallari tells Jay Cutler: 'I'm with you because I love you not because I need you.'", "url": "https://ftw.usatoday.com/2018/08/kristin-cavallari-tells-jay-cutler-im-with-you-because-i-love-you-not-because-i-need-you", "description": "A very dramatic season finale.", "site_name": "For The Win", "image": {"identifier": "https://usatftw.files.wordpress.com/2017/08/c02_kristin_29_46525433-e1502128880418.jpg?w=1024&h=576&crop=1", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-08-27T14:02:25+00:00", "modified_time": "2018-08-31T04:56:00+00:00", "publisher": "https://www.facebook.com/usatodayftw", "author": "https://www.facebook.com/ninamandell1"}, "twitter": {"creator": "@ForTheWin", "site": "@forthewin", "text": {"title": "Kristin Cavallari tells Jay Cutler: 'I'm with you because I love you not because I need you.'"}, "image": "https://usatftw.files.wordpress.com/2017/08/c02_kristin_29_46525433-e1502128880418.jpg?w=640", "card": "summary_large_image"}, "gdpr": "false", "sop-property": "581b62d42a2cc300124a6a6e", "application-name": "For The Win", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "What fans are talking about.", "msapplication-task": "name=Subscribe;action-uri=https://ftw.usatoday.com/feed;icon-uri=https://secure.gravatar.com/blavatar/2ef498b87825ac1e90fb08b478c63932?s=16"}, "movies": [], "publish_date": 1535378545.0, "source": "https://ftw.usatoday.com", "summary": ""}