{"url": "https://web.archive.org/web/20080820021901/http://en.wikipedia.org:80/wiki/Stassi_Schroeder", "text": "From Wikipedia, the free encyclopedia\n\nQueen Bees is a new reality TV series on The N, and is produced by Endemol USA that brings a group of teen \"queen bees\" together to live under one roof.\n\nOverview\n\nUnknowingly, seven \"queen bees\" are nominated by close friends and family to participate in a life-changing experiment in an effort to counter their mean girl behavior. Helping them with their journey are Dr. Michelle R. Callahan (The Tyra Banks Show) and Yoanna House (America's Next Top Model). In the end, the girl with the most dramatic change wins a $25,000 cash prize.\n\nAt the end of each week, the girls' progress is recorded on a Progress Report for all to see. Each girl is tracked with gold stars, each star being earned as positive reinforcement. The girl with the least progress at the end of the week is put on notice and threatened with expulsion. If a girl fails to change at all, she is sent home.\n\nIn the house, there are two special rooms: the \"Secret Room\" and the Conference Room. The Conference Room is a special room used for weekly group therapy session and one-on-one sessions with Dr. Michelle. The \"Secret Room\" was a room built unknowingly for the girls to view her nomination video one by one.\n\nThis time the mean girls... get stung.\n\nThe Girls\n\nAll quotes are directly from Trailer 3 of the series.\n\nProgress Report\n\nQueen Bee Progress Report Notes Rank Camille Leader weeks 1, 6, 7 1st Gisbelle Leader weeks 3, 4, 5, 6 2nd Stassi 3rd Michelle On notice week 3 4th Shavon On notice week 2 and 7 5th\n\nOff the Progress Reoprt\n\nQueen Bee Progress Report Notes Rank Kiana On notice weeks 1 and 6, Eliminated Week 7 6th Brittany Leader week 2, On notice week 4, Eliminated week 5 7th\n\nEpisodes\n\nEp# Title Original Air Date Production Code 1 \"Appearance\" July 11, 2008 101 Seven girls are sent to LA by their closest friends and family in an effort to change her mean girl ways. The girls are asked to prepare for a short-notice beauty pageant, but little did they know that they are to be judged by three blind people. The girls attend their first group session with Dr. Michelle, and in the first Progress Report, the girls all earn one star for accepting to change and some of the girls earn extra stars for their behavior amongst the other girls, but Kiana loses hers and is threatened with expulsion. 2 \"Teasing\" July 18, 2008 102 Since teasing people comes easily to the girls, the girls were asked to point out the flaws of each of their housemates. Each girl was asked to use the comments to prepare a one-minute routine for a Stand-Up comedy challenge and poke fun at themselves. Kiana was invited to a secret room and shown a video of her best friend explaining as to why she nominated Kiana and that their friendship was hanging by a thread. In the second Progress Report, Shavon's overconfidence causes her to lose the star she earned. 3 \"Judgment\" July 25, 2008 103 Each girl is asked to describe a housemate to a sketch artist in a closed session. Understanding that it is difficult to explain features without being judgmental, the girls are told they are to attend a \"Dark Party\" and meet eligible boys and select one based on personality alone. Gisbelle was invited to the secret room and shown a video of her long-time boyfriend who threatened their relationship if she didn't change her ways. In the third Progress Report, Michelle was put on notice because she ignored the rules of the Dark Party. 4 \"Power\" August 1, 2008 104 The girls' were given different tasks and had the power to either do it themselves or pass it on to another girl. Later, the girls were forced to vote someone out of the house, the majority voting for Shavon. When Shavon returns during the Progress Report, it is revealed that the eviction was only an exercise. Brittany was invited to the secret room and shown a video of a friend who explained as to why she was nominated to change her ways. At the fourth Progress Report, Brittany is put on notice for not focusing on the message of her video. 5 \"Self-Centeredness\" August 8, 2008 105 The girls were each given a box of supplies to help them prepare for an upcoming talent show, with a grand prize of 1,000 dollars. Little did they know that they were to teach their talent to an elder person who, in turn, performs in the talent show. Later, Michelle gets invited to the secret room and was shown a video of her mother who explained that \"[she] didn't raise her to act this way\", devastating Michelle. At the fifth Progress Report, Dr. Michelle concludes that Brittany has given up on the process and eliminates her from the competition. 6 \"Jealousy\" August 15, 2008 106 Camille is asked to go to the Secret Room to find a video message from her fiancé. Later, The girls compete to find the most Queen Bee eggs, which contain a number of seconds inside each. Whoever has the most seconds gets that amount of time to talk on the phone with anyone, and have lunch at the beach. Afterward, Shavon is asked to come to the Secret Room. Later, The girls have to create a billboard for the show. This later turns into a tough decision when only three get to appear on it. After the 6th progress report, Kiana is back on notice. 7 \"Gossip\" August 18, 2008 107 Stassi is the last girl to be sent to the secret room, and she recieves a video message from her mom. Shavon, Michelle, and Stassi, which were the three girls who got to be on The Queen Bee Billboard, are the housemates that get to be interviewed by the world-famous gossip blogger Perez Hilton. After their Q and A, they must face the consequences when the entire house gets to read his provocative article on the internet. This episode was accidentally aired when a showing of the episode \"Jealousy\" was meant to show. 8 \"Finale\" August 29, 2008 108 The Bees final challenge takes place when they must volunteer at a teen center.\n\nSee Also\n\nReferences", "images": ["https://web.archive.org/web/20080820021901im_/http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Padlock-silver-medium.svg/20px-Padlock-silver-medium.svg.png", "https://web.archive.org/web/20080820021901im_/http://upload.wikimedia.org/wikipedia/en/thumb/9/93/Queenbees.jpg/200px-Queenbees.jpg", "https://web.archive.org/web/20080820021901im_/http://en.wikipedia.org/skins-1.5/common/images/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20080820021901im_/http://en.wikipedia.org/images/wikimedia-button.png", "https://web.archive.org/web/20080820021901im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20080820021901im_/http://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://web.archive.org/web/20080820021901im_/http://upload.wikimedia.org/wikipedia/en/thumb/5/57/1_Gold_Star.jpg/25px-1_Gold_Star.jpg"], "top_img": "https://web.archive.org/web/20080820021901im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Queen Bees (TV series)", "meta_data": {"generator": "MediaWiki 1.14alpha", "keywords": "Queen Bees (TV series),Protection policy,2008,America's Next Top Model,August 1,August 15,August 18,August 29,August 8,Brooklyn,California"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}