{"url": "www.latimes.com/entertainment/tv/la-et-st-big-little-lies-feature-20170216-story.html", "text": "She had learned not to get excited. Australian author Liane Moriarty had gone through the process of having a book optioned for a movie or TV series before and had endured the realities of it getting lost in Hollywood development purgatory.\n\nMoriarty, though, had never done business with Reese Witherspoon and Nicole Kidman.\n\n“When I met with Nicole, she was like, ‘No, no, no. If we option it, get excited. We don’t option things just for the sake of it. We don’t have time for that,’ ” Moriarty said by phone when recalling her midmorning coffee meeting with Kidman in a Sydney suburb about 18 months ago.\n\n“She kept her word.”\n\nAdvertisement\n\nMoriarty’s 2014 bestseller “Big Little Lies” is now a seven-episode limited series on HBO. And it boasts the Oscar-winning actresses as leads and executive producers.\n\nIt continues in the HBO tradition of drawing marquee feature film stars to the small screen. And it serves as a bit of an antidote to the premium network’s recent tent-pole attraction, “Westworld,” and the unusual religious drama “The Young Pope.”\n\n“Not since ‘Big Love’ have we had a drama that is this female-centric,” said Casey Bloys, HBO’s president of programming. “The issues they get into on the show are things people deal with in life, and it was nice to have this framework to put these stories forward.”\n\nLaura Dern, left, Reese Witherspoon and Shailene Woodley in a scene from HBO’s all-star adaptation of the bestseller “Big Little Lies.” (Hilary Bronwyn Gayle / HBO)\n\nAdvertisement\n\nThe drama, which debuts Sunday, features five women — Laura Dern, Shailene Woodley and Zoë Kravitz, in addition to Witherspoon and Kidman — as mothers of first-graders in a wealthy Northern California community. It’s a setting that lends itself to social satire, replete with fake smiles and a heavy helping of passive aggressiveness in the battle for power and status. There’s even a murder mystery that stitches the story together.\n\nBut underneath the melodrama and moments of acerbic humor are women dealing with private angst, running the gamut of adultery, divorce, volatile marriages, sexual assault and the stresses of motherhood. Beneath all that too is a sense of sisterhood when intense situations call for it.\n\n“It really delved into a lot of issues that women are dealing with daily that we don’t often see on-screen in this way,” Witherspoon, 40, said on a recent weekday in Pasadena. “And it’s not black and white. These aren’t women who are good or bad. We wanted to show the rainbow of the female experience, which I think is sort of absent in Hollywood in a lot of ways.”\n\nKidman affirmed the dearth of nuanced roles for women and said it was symptomatic of a larger systemic issue.\n\nAdvertisement\n\n“We need great roles,” the 49-year-old actress said. “Our stories are relevant; people do want to hear them. But our stories often get brushed off. Seeing five women front a project is not common — and it shouldn’t be that way.”\n\nWe wanted to show the rainbow of the female experience, which I think is sort of absent in Hollywood in a lot of ways. Reese Witherspoon, who stars in and executive produced the new HBO series “Big Little Lies”\n\nIn recent years, Witherspoon and Kidman have been proponents of female-driven projects that redefine how women are portrayed through their respective production companies.\n\nWitherspoon’s Pacific Standard, which she co-founded with Bruna Papandrea in 2012, has been behind such female-led movies as “Wild,” “Gone Girl” and “Hot Pursuit.” Kidman’s Blossom Films has spearheaded such films as the low-budget drama “Rabbit Hole,” the romantic comedy “Monte Carlo” and the family drama “The Family Fang.”\n\nAdvertisement\n\n“These women are trailblazers,” Woodley, 25, said of her costars. “They made ‘Big Little Lies’ because they were sick of reading scripts that didn’t honor women and womanhood. That has been really inspirational for me. I kind of joke now, like, ‘If I don’t start a production company soon, man, I’m going to be throwing away all this beauty I’ve been given in the form of learning from Reese and Nicole.’”\n\n“Big Little Lies” went from book club page-turner to star-studded TV series all because Witherspoon and Kidman had been looking for a project on which to collaborate. The actresses knew each other through Papandrea, who had known Kidman since the two were teenagers.\n\nIf I don’t start a production company soon, man, I’m going to be throwing away all this beauty I’ve been given in the form of learning from Reese and Nicole. Shailene Woodley, who stars in the new HBO limited series “Big Little Lies”\n\nWitherspoon and Papandrea were sent a copy of Moriarty’s novel, and it wasn’t long before the latter called Kidman. The actress read it that day in one sitting.\n\nAdvertisement\n\nIt just so happened that Kidman was leaving the next day for Australia, and while there, she met Moriarty for that coffee.\n\n“We chatted about our kids, we talked about the book,” Kidman said. “I didn’t have to make this big sales pitch. We were just two women talking. And I just told her we would get it made. And then Reese and I set out on our mission.”\n\nThat mission included finding the project’s writer and director. Witherspoon said consideration had been given to carrying over the project’s female-empowered sensibility behind the scenes. Kidman had asked Moriarty at their initial meeting if she wanted to write the screenplay; the author declined.\n\nCircumstances and familiarity ultimately resulted in the selection of veteran TV scribe David E. Kelly to write the script and Witherspoon’s “Wild” director, Jean-Marc Vallée, to bring it to life on the screen.\n\nAdvertisement\n\nDirector Jean-Marc Vallee, left, and writer-producer David E. Kelley of the upcoming HBO series “Big Little Lies.” (Allen J. Schaben / Los Angeles Times)\n\nKelley, 60, had just been signed to CAA, which reps both actresses along with their producing banners, so he was proposed as a possible candidate for the job. But it was his knack for balancing drama with humor, more than a business connection, that closed the deal.\n\n“The thing is, [David] is so deft,” Witherspoon said. “He wrote the scenes for Nicole so beautifully — he understood the complexity of her character’s experience, but he also writes hysterical comedic dialogue for my character. To find somebody who does that very well is threading a needle.”\n\nKelley said the biggest challenge of the miniseries was servicing all the characters. In addition to the women, the drama stars Alexander Skarsgård, Adam Scott and James Tupper.\n\nAdvertisement\n\n“It’s incumbent upon us to get to know these people in order for the stories to be as rich as they can be,” Kelley said. “That was the biggest challenge, a lot of spinning plates. But the architecture of the book was so sure-footed — that made my job easier.”\n\nThe architecture of the book was so sure-footed -- that made my job easier. David E. Kelley, who adapted the 2014 bestseller “Big Little Lies” for TV\n\nVallée, meanwhile, had been tapped to direct the first episode almost since the project’s inception. But with a series, it’s common for each episode to have a different director. Witherspoon said they had approached — and were close to signing — two female directors for other episodes, but ultimately asked Vallée to do the whole series for the sake of continuity.\n\n“It’s a marathon,” said Vallée. The 53-year-old director is gearing up next to shoot all the episodes of HBO’s upcoming Amy Adams drama, “Sharp Objects.” “I learned how to train mentally, emotionally and physically, because you’ve got to be Superman. It was basically shooting a very long feature film.”\n\nAdvertisement\n\nThe director was central in bringing the cast together, encouraging the actors to get to know each other outside of work. Witherspoon said they’d often go out to dinner or socialize at her house on the weekends.\n\n“Everyone was able to connect,” Kravitz said of the bonding sessions. “With Reese and Nicole also being producers, they spent a lot of time with us and were very warm and really wanted our opinion.”\n\nThe conversations were less about finding their characters, Kidman said, and more about how to shift the female narrative.\n\n“There was enormous love and loyalty and friendship,” she said. “And I think you’ll find that’s the greatest thing about the series.”\n\nAdvertisement\n\nThe most-read Entertainment stories this hour »\n\nTimes staff writer Sarah Rodman contributed to this report.\n\nyvonne.villarreal@latimes.com\n\nTwitter: @villarrealy", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/0cb4947/2147483647/strip/true/crop/1200x630+0+85/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/2df89a3/2147483647/strip/true/crop/1200x800+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/3e2816d/2147483647/strip/true/crop/1125x1125+438+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc5%2Fc3%2Fdd6da73a5de5664c61900a2aac00%2Fimg-535dc6c5-turbine-la-bio-yvonne-villarreal", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/ebf4c17/2147483647/strip/true/crop/2048x1151+0+0/resize/840x472!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7b%2F35%2F4470f15898e38afe40f9d11e7f38%2Fla-1487189669-5nu1533710-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/cef4cf2/2147483647/strip/true/crop/2048x1151+0+0/resize/840x472!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F22%2F14%2F49feac7a8abe7c523d9c21963f15%2Fla-1487189727-zv24oz3lb5-snap-photo"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/0cb4947/2147483647/strip/true/crop/1200x630+0+85/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "keywords": [], "authors": ["Staff Writer", "Yvonne Villarreal Covers Television For The Los Angeles Times."], "canonical_link": "https://www.latimes.com/entertainment/tv/la-et-st-big-little-lies-feature-20170216-story.html", "title": "Nicole Kidman and Reese Witherspoon on bringing the female-driven ‘Big Little Lies’ to life", "meta_data": {"og": {"title": "Nicole Kidman and Reese Witherspoon on bringing the female-driven 'Big Little Lies' to life", "url": "https://www.latimes.com/entertainment/tv/la-et-st-big-little-lies-feature-20170216-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/0cb4947/2147483647/strip/true/crop/1200x630+0+85/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "url": "https://ca-times.brightspotcdn.com/dims4/default/0cb4947/2147483647/strip/true/crop/1200x630+0+85/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "Nicole Kidman, Reese Witherspoon and the stars of HBO's newest drama talk 'Big Little Lies'"}, "description": "She had learned not to get excited.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/yvonne-villarreal", "content_tier": "metered", "published_time": "2017-02-16T11:00:00", "opinion": "false", "section": "Television"}, "twitter": {"card": "summary_large_image", "creator": "@villarrealy", "description": "She had learned not to get excited.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/9f2886f/2147483647/strip/true/crop/1200x675+0+63/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fd7%2F50d8fd4c303e4a842a4f16b5abbd%2Fla-1487198993-fhm6vxnrtn-snap-photo", "alt": "Nicole Kidman, Reese Witherspoon and the stars of HBO's newest drama talk 'Big Little Lies'"}, "site": "@latimes", "title": "Nicole Kidman and Reese Witherspoon on bringing the female-driven 'Big Little Lies' to life"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimesent"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "Nicole Kidman, Reese Witherspoon and the stars of HBO's newest drama talk \"Big Little Lies.\"", "keywords": "Zoe Kravitz,Big Little Lies, Reese Witherspoon, Shailene Woodley, Laura Dern, David E. Kelley, HBO, Nicole Kidman", "brightspot.contentId": "00000169-0cb7-dbbe-a16f-4ef7c54b0000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1487174400.0, "source": "http://www.latimes.com", "summary": ""}