{"url": "https://www.townandcountrymag.com/society/tradition/a15173197/prince-harry-meghan-markle-lifetime-movie/", "text": "It was only a matter of time. Lifetime is adapting Prince Harry and Meghan Markle's romance into a made-for-TV movie called Harry & Meghan: The Royal Love Story. Here's everything we know about the film, which is sure to be appointment viewing.\n\nThe trailers are here, and they're a little scandalous.\n\nIn the 20-second teaser above, we see not only Lifetime's take on Prince Harry's proposal and the couple's romantic vacation in Botswana, but we also catch a glimpse of them in bed.\n\nA second, longer trailer shows their first date, and a candid conversation between Harry and his sister-in-law about his relationship. Watch it above.\n\nLifetime just released a behind-the-scenes look at the film.\n\nThe clip below also gives a sneak peek of how the movie will take on not only Prince Harry's party boy past but also how it will touch on Meghan's biracial identity.\n\nIt will premiere a week before the royal wedding.\n\nLifetime's film will debut Sunday, May 13 at 8 p.m. ET/PT, a nice lead in to the Prince Harry and Meghan Markle's wedding date on May 19. Menhaj Huda of The Royals will direct; the script was written by Scarlett Lacey.\n\nThe film's star Parisa Fitz-Henley is a big fan of the woman she plays.\n\nParisa Fitz-Henley, who plays Markle in the film, posted an update about filming on March 12.\n\n\"We are on our way to film the last scene of the last day of Harry & Meghan: A Royal Romance,\" she says in the video. \"It's a really special scene, and I'm really looking forward to sharing it with you and sharing the entire movie with you. It's been such a labor of love for everyone involved, and we hope you love it too.\"\n\n\n\nIn the caption of the post, she wrote, \"I got to take a look inside the life of a woman and a relationship I quickly came to admire and claim as inspirations...So many thanks for all the wonderful encouragement! It’s been lovely to catch some of the collateral love being deservedly showered upon the real Harry & Meghan.\"\n\n\n\nShe also gave a shoutout to her Prince Harry, Murray Fraser, who plays the ginger royal in the film.\n\nA still from the Lifetime film. Lifetime\n\nThe royal family is reportedly aware of the film, and they're less than pleased about the sex scene.\n\n“What I’ve heard is that they’re seriously worried about the sex scene,” director Menhaj Huda told Vanity Fair. He heard it from his wife's best friend who is \"dating the press secretary of the palace.\"\n\nBut producer Merideth Finn doesn't seem to mind. “Let them worry,” she said. \"People have sex.\"\n\nThe Plot\n\nOn January 14, the network announced their plans a film which will dramatize the couple's love story \"from the moment they met after being set up by friends, through their initial courtship when they were able to keep their romance under wraps, and ultimately the intense global media attention surrounding their relationship and Meghan’s life as a divorced American actress,\" per Deadline.\n\n\n\nThe Cast\n\nLifetime recently released three new cast photos, giving us a peek at the actors and actresses playing the Duke and Duchess of Cambridge, Prince George, Princess Charlotte, Queen Elizabeth, and...Princess Diana (meaning yes, the late Princess will somehow appear in the movie).\n\n\n\nDuchess Kate will be played by Laura Mitchell, while Australian actor Burgess Abernethy has been cast as Prince William. The littlest royals, Prince George and Princess Charlotte, will be portrayed by Preston Karwat and Briella Weintraub. See their family photo here:\n\nMichael Courtney / Lifetime\n\nMaggie Sullivun will play Queen Elizabeth, seen here drinking tea in character:\n\nMichael Courtney / Lifetime\n\nAnd Princess Diana will be portrayed by Bonnie Soper.\n\nMichael Courtney / Lifetime\n\nKeep in mind, Meghan & Harry's predecessor, William & Kate: The Movie, helped launch the careers of such actresses as Louise Linton, wife of treasury secretary Steven Mnuchin.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-duchess-of-sussex-and-prince-harry-duke-of-sussex-news-photo-1045629990-1539612189.jpg?crop=1.00xw:0.422xh;0,0.0526xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghanmarkleprinceharryweddingday-1526736389.jpg?crop=1xw:0.7496339677891655xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=1.00xw:0.969xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960057698-1526732670.jpg?crop=1.00xw:0.752xh;0,0.139xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=1.00xw:0.969xh;0,0&resize=1200:*", "keywords": [], "authors": ["Caroline Hallemann", "Senior Digital News Editor", "As The Senior Digital News Editor For Town", "Country", "Caroline Hallemann Covers Everything The British Royal Family To The Latest Episodes Of Outlander", "Killing Eve", "The Crown."], "canonical_link": "https://www.townandcountrymag.com/society/tradition/a15173197/prince-harry-meghan-markle-lifetime-movie/", "title": "'Harry & Meghan: A Royal Romance' News, Casting & Air Date", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "The Royal Family is Aware of Lifetime's 'Harry & Meghan: A Royal Romance'", "description": "There's one scene they're particularly concerned about.", "url": "https://www.townandcountrymag.com/society/tradition/a15173197/prince-harry-meghan-markle-lifetime-movie/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=1.00xw:0.969xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-05-11 10:13:29", "published_time": "2018-05-04 06:50:00", "section": "Heritage", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=1.00xw:0.969xh;0,0&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "'Harry & Meghan: A Royal Romance' News, Casting & Air Date - Details on Lifetime's Meghan and Harry Movie", "description": "Lifetime is making a movie about Prince Harry and Meghan Markle's relationship. Here's everything we know about the cast and premiere date.", "keywords": "meghan and harry, prince harry and meghan markle, prince harry meghan markle lifetime movie, lifetime movie, lifetime meghan and harry, Harry & Meghan: The Royal Love Story, meghan markle prince harry love story", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=0.521xw:1.00xh;0.385xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society,tradition", "sailthru.date": "2018-05-04T18:50:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=1.00xw:0.969xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/behind-the-scenes-meghan-markle-lifetime-movie-1525377191.png?crop=0.521xw:1.00xh;0.385xw,0", "sailthru.socialtitle": "The Royal Family is Aware of Lifetime's 'Harry & Meghan: A Royal Romance'", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525387800.0, "source": "https://www.townandcountrymag.com", "summary": ""}