{"url": "https://www.datalounge.com/thread/11791911-kristen-stewart-cheats-on-robert-pattinson-with-married-director-sources", "text": "Kristen Stewart's Cheating Apology: PR Insider Weighs In\n\nToday, on the heels of an impending US Weekly cover story revealing a scandalous affair with her married \"Snow White and the Huntsman\" director Rupert Sanders, Kristen Stewart issued a revelatory apology exclusively to People, in which she publicly professed her love for boyfriend Robert Pattinson for the first time. Sanders responded with an equally candid statement to People, wherein he apologized for the pain caused to his wife (model Liberty Ross) and their two young children.\n\nWe couldn't help but wonder: What could cause this drop of bombshells? We enlisted the help of an entertainment PR contact, who shed some light on Wednesday's highly unorthodox turn of events.\n\nSo this is all pretty crazy, huh?\n\nIt smacks of being forced to do it -- did she come clean to Rob and he insisted she publicly apologize? Did Sanders' wife insist that they both publicly apologize? This is the sort of thing famous people generally don't acknowledge unless there's a divorce involved.\n\nThere are scans of the US Weekly story online now. What do you think of the photos?\n\nWhy don't people just get hotel rooms like they used to?\n\nAnd this is really the first time Kristen has officially admitted she and Rob are a couple.\n\nI think that's part of the mystery -- why is she acknowledging it now?\n\nSo what's your take on both Stewart and Sanders' statements to People?\n\nWhat's interesting is that neither statement goes for the traditional \"This is a very difficult and personal time and I ask everyone to respect my family's privacy.\" This feels like something she may have conceivably written herself. Those statements are always worked over by a team of people. What everyone is calling out is what's accurate -- that it's strangely authentic-sounding.\n\nSo why make any statement at all, authentic or otherwise?\n\nPresumably, Us Weekly wouldn't kill the story, as I can only assume they tried to do. People is a safe place. They ran her statement with the barest of facts, and no editorializing on the nature of the affair. It also helps set them up as the ones to talk to her as the scandal unfolds.\n\nDo you think there's something additional that'll unfold from this? Perhaps, a pregnancy?\n\nOh God, I hope not. I'm sure it adds fuel to the fire for those who assumed that Kristen was Rob's beard for the past several years. If she's been acting as his beard, this is an easy way to break them up around the time that the [\"Twilight\"] franchise ends. People have said that from the beginning.\n\nIt's doubly shocking because everyone has presumed that Rob and Kristen have been dating for the past four years, but they've never officially acknowledged it until what happened today.\n\nI believe they've just started to tentatively talk about their relationship publicly. Which is why it smacks of something like, \"If you want to stay with me, you need to publicly apologize.\" The bottom line is that it feels like high school drama.\n\nDo you think Stewart's PR team is botching things with this?\n\nOne could argue that Kristen Stewart has showed more emotion and likeability in the past 24 hours than she has in years. I think it's calculated to make her look sympathetic in the wake of cheating on her long-term boyfriend, but other than that, I still think someone is making her publicly apologize.\n\nWhat about that, \"I love him, I love him\" line? Kind of dramatic, no?\n\nAbsolutely. It's that detail that makes people think it's actually from her, and not just a stock apology.\n\nSo under what circumstances does issuing a public apology like this -- so frank and seemingly heartfelt -- make sense?\n\nThere doesn't seem to be any reason for her to be this candid. Which is why I suspect it was a condition of saving everyone's relationships. It's as though my high school boyfriend cheated on me, begged my forgiveness, and I made him stand up on the cafeteria table and admit to everyone that he had been an asshole, you know?", "images": ["https://www.datalounge.com/dl-logo-large.png", "https://www.datalounge.com/images/dl-default-og.png", "https://www.datalounge.com/dl-header-logo@2x.png"], "top_img": "https://www.datalounge.com/images/dl-default-og.png", "keywords": [], "authors": [], "canonical_link": "https://www.datalounge.com/thread/11791911-kristen-stewart-cheats-on-robert-pattinson-with-married-director-sources", "title": "Kristen Stewart Cheats on Robert Pattinson with Married Director: Sources", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "mobile-web-app-capable": "yes", "description": "Woah....The relationship between Kristen Stewart and Robert Pattinson has been rocked by the revelation that the actress had a brief fling with a married director, sources tell PEOPLE.\"Kristen is ...", "og": {"title": "Kristen Stewart Cheats on Robert Pattinson with Married Director: Sources", "description": "Woah....The relationship between Kristen Stewart and Robert Pattinson has been rocked by the revelation that the actress had a brief fling with a married director, sources tell PEOPLE.\"Kristen is ...", "image": "https://www.datalounge.com/images/dl-default-og.png", "url": "https://www.datalounge.com/thread/11791911-kristen-stewart-cheats-on-robert-pattinson-with-married-director-sources", "site_name": "the DataLounge", "type": "article"}, "twitter": {"card": "summary", "site": "@dataloungecom", "title": "Kristen Stewart Cheats on Robert Pattinson with Married Director: Sources", "description": "Woah....The relationship between Kristen Stewart and Robert Pattinson has been rocked by the revelation that the actress had a brief fling with a married director, sources tell PEOPLE.\"Kristen is ...", "image": "https://www.datalounge.com/images/dl-default-og.png", "url": "https://www.datalounge.com/thread/11791911-kristen-stewart-cheats-on-robert-pattinson-with-married-director-sources"}, "keywords": "Gay, Celebrity, Gossip, Politics,Health, Gay Celebrity Gossip, Gay Politics, Gay News, Gay Rights, Gay Photos, Gay Videos, Gossip, Outing, Gay Health, Gay Travel", "verify-v1": "BX9Pdb2NnYXeSP1F5BSIEbUlawBNymSrTHxSWUU+8sc=", "google-site-verification": "NNjWv0tmsFNiYM689KnWubBH6Ti7yUMZHUlrnf4j31Y", "robots": "noarchive", "msvalidate.01": "E44CC853FE310C2B28DF52573ABA8146"}, "movies": [], "publish_date": null, "source": "https://www.datalounge.com", "summary": ""}