{"url": "https://variety.com/2018/tv/news/fuller-house-season-4-premiere-date-netflix-1203014850/", "text": "In Tuesday’s roundup, Netflix sets the “Fuller House” Season 4 premiere date, and Hulu announces the leads for its adapted series, “Looking for Alaska.”\n\nDATES\n\nNetflix’s “Fuller House” will return for Season 4 on Dec. 14. It was previously announced in January that the reboot was renewed for a fourth season. The show is a continuation of the 1990s ABC series “Full House,” and features veterinarian D.J. Tanner-Fuller (Candace Cameron-Bure), D.J.’s younger sister/aspiring musician Stephanie Tanner (Jodie Sweetin), and D.J.’s lifelong best friend/fellow single mother Kimmy Gibbler (Andrea Barber) moving in together to raise Kimmy’s daughter and D.J.’s three boys. “Fuller House” is executive produced by Bob Boyett and produced by Miller-Boyett Productions in association with Warner Horizon Television for Netflix.\n\nRENEWALS\n\nNetflix has renewed the animated comedy series “Paradise PD” for Season 2. Created by Waco O’Guin and Roger Black (“Brickleberry”), the show premiered Aug. 31 and followed inept cops in a small-town police department. Marc Provissiero of Provissiero-Odenkirk Entertainment executive produces, with Bento Box Entertainment producing for Netflix.\n\nUSA Network has announced the pickup of a the seventh season of its reality docuseries “Chrisley Knows Best,” and greenlit a 16-episode spinoff, “Growing Up Chrisley.” Both set to air in 2019, the spinoff will center on Chase and Savannah Chrisley as they road trip from Nashville to Los Angeles and attempt to break out on their own in the big city. Season 7 will continue to follow Todd Chrisley and his family throughout its 26-episode order.\n\nCASTING\n\nHulu announced the leads for its upcoming eight-episode limited series “Looking for Alaska.” The adaption of John Green’s young adult novel will star Kristine Froseth (“Sierra Burgess is a Loser”) as Alaska Young and Charlie Plummer (“Lean on Pete”) as Miles Halter. The story centers on Miles’ journey of falling in love with the mysterious Alaska, and following her unexpected death, trying to uncover the truth behind what really happened. The series is from Paramount Television, with Josh Schwartz writing the pilot and serving as executive producer and showrunner. Fake Empire’s Stephanie Savage will executive produce with Jessica Tuchinsky, Mark Waters, Green, and Marty Bowen and Isaac Klausner of Temple Hill. Fake Empire exec Lis Rowinski will co-executive produce.\n\nJason Flemyng (“The Curious Case of Benjamin Button”) has joined the cast in the series regular role of villain Lord Harwood in the upcoming Epix drama series “Pennyworth.” The 10-episode, one-hour drama series is based on DC characters and follows Bruce Wayne’s legendary butler, Alfred Pennyworth (Jack Bannon), in his younger years when he worked with the man who would become Wayne’s father. Lord Harwood has the appearance and education of an upper class Englishman, but underneath the charm is his sadistic, cruel nature. The series is currently in production at Warner Bros. Studios Leavesden, in the UK.\n\nDEVELOPMENT\n\nIFC unveiled five new original comedies in development: “Almost Asian,” executive produced by Margaret Cho, chronicles the life of a mixed-race millennial; “Annika Erotica” follows a young pastor harboring a secret passion for writing erotic novels; the adventure comedy “Art Thieves” is about self-proclaimed Robin Hoods of the art world; “Beth,” focuses on a happily-agoraphobic man’s uneasy journey back to the outside world; and the satirical and politically provocative sketch comedy “The Middle Passage.” The projects join the previously announced series in development “How to Rig an Election” and “NGO.”\n\nYouTube has ordered a presentation for a new animated series, “Dumb People Town.” The half-hour show is based on the podcast created by Randy Sklar, Jason Sklar, and Daniel Van Kirk. It focuses on a family in a Florida town struggling with the most important question of our times: “Is it better to be dumb and happy? Or smart and miserable?” The series will be written by and executive produced by Randy and Jason Sklar, Daniel Van Kirk and Julius Sharpe (“Family Guy”). Will Arnett and Marc Forman will executive produce through Electric Avenue along with Peter Principato and Joel Zadak through Artists First. The project is distributed by Sony Pictures Television.\n\nDEALS\n\nPremiere Entertainment Group has acquired the rights to the made-for-television movie, “Shadow Wolves.” The action film stars Thomas Gibson (“Criminal Minds”), Cody Walker (“Furious 7”), Louise Lombard (“CSI: Crime Scene Investigation”), and Graham Greene (“Dances With Wolves”). It follows the Shadow Wolves, an elite unit of highly trained Native Americans who must stop ISIS terrorists sneaking into the U.S. When Colonel Branson (Gibson), head of a secret division of the NSA, sends his best agent (Walker) to help them, his presence could bring the Shadow Wolves closer together or break them apart. The movie is the first big action role for Walker, the brother of late actor Paul Walker. It is written and directed by McKay Daines, who also produces alongside executive producers Steven Marrs, Tom Reeve, Michael G. Corrigan, and Courtney Hazlett.\n\nEXECUTIVES\n\nAlex Katz (“World of Dance,” “The Biggest Loser”) is set to lead the newly established No Other Way Productions along with post-production producer Mandy Novak (“World of Dance”). Katz and Novak will focus on providing post-production and editorial services to meet the needs of networks, streaming services, and cable channels. They will also have a separate production arm focusing on development and production of original content for scripted, unscripted, and digital projects.\n\nRATINGS\n\nNBC’s “A Very Wicked Halloween Special” put up so-so numbers in the Monday overnight ratings. Airing at 10, the special drew a 1.0 rating in adults 18-49 and 4 million viewers. That was good enough to finish second in its timeslot in the key demo but third in total viewers.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Ffuller-house-season-4-premiere-date-netflix-1203014850%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1203014850&comment_count=1", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2017/08/fuller-house.jpg?w=1000", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/08/fuller-house.jpg?w=1000", "keywords": [], "authors": ["Rachel Yang"], "canonical_link": "https://variety.com/2018/tv/news/fuller-house-season-4-premiere-date-netflix-1203014850/", "title": "TV News Roundup: Netflix Reveals ‘Fuller House’ Season 4 Premiere Date", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "In Tuesday's roundup, Netflix sets the \"Fuller House\" Season 4 premiere date, and Hulu announces the leads for \"Looking for Alaska.\"", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1203014850, "author": "Rachel Yang", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-10-30T15:24:34"}, "pmc-tag": "Fuller House,Looking for Alaska", "title": "TV News Roundup: Netflix Reveals ‘Fuller House’ Season 4 Premiere Date", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "TV News Roundup: Netflix Reveals ‘Fuller House’ Season 4 Premiere Date", "url": "https://variety.com/2018/tv/news/fuller-house-season-4-premiere-date-netflix-1203014850/", "description": "In Tuesday’s roundup, Netflix sets the “Fuller House” Season 4 premiere date, and Hulu announces the leads for its adapted series, “Looking for Alaska.” DATES Netflix&…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/fuller-house.jpg?w=1000", "width": 1000, "height": 667, "alt": "Fuller House"}, "locale": "en_US"}, "article": {"published_time": "2018-10-30T22:24:34+00:00", "modified_time": "2018-10-30T22:24:34+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "TV News Roundup: Netflix Reveals ‘Fuller House’ Season 4 Premiere Date"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/08/fuller-house.jpg?w=1000", "alt": "Fuller House"}, "card": "summary_large_image", "title": "TV News Roundup: Netflix Reveals ‘Fuller House’ Season 4 Premiere Date", "description": "In Tuesday's roundup, Netflix sets the \"Fuller House\" Season 4 premiere date, and Hulu announces the leads for \"Looking for Alaska.\""}, "author": "Rachel Yang", "content_type": "Article", "post_id": 1203014850, "title": "TV News Roundup: Netflix Reveals 'Fuller House' Season 4 Premiere Date", "published_at": "2018-10-30 15:24:34", "image": "https://pmcvariety.files.wordpress.com/2017/08/fuller-house.jpg?w=1000", "comment_count": 1, "tags": "Looking for Alaska", "topics": "News", "appeared_in_print": "No", "body": "In Tuesday's roundup, Netflix sets the \"Fuller House\" Season 4 premiere date, and Hulu announces the leads for its adapted series, \"Looking for Alaska.\"\r\n\r\nDATES \r\n\r\nNetflix's \"Fuller House\" will return for Season 4 on Dec. 14. It was previously announced in January that the reboot was renewed for a fourth season. The show is a continuation of the 1990s ABC series “Full House,” and features veterinarian D.J. Tanner-Fuller (Candace Cameron-Bure), D.J.’s younger sister/aspiring musician Stephanie Tanner (Jodie Sweetin), and D.J.’s lifelong best friend/fellow single mother Kimmy Gibbler (Andrea Barber) moving in together to raise Kimmy's daughter and D.J.'s three boys. “Fuller House” is executive produced by Bob Boyett and produced by Miller-Boyett Productions in association with Warner Horizon Television for Netflix.\r\n\r\nRENEWALS \r\n\r\nNetflix has renewed the animated comedy series \"Paradise PD\" for Season 2. Created by Waco O'Guin and Roger Black (\"Brickleberry\"), the show premiered Aug. 31 and followed inept cops in a small-town police department. Marc Provissiero of Provissiero-Odenkirk Entertainment executive produces, with Bento Box Entertainment producing for Netflix.\r\n\r\nUSA Network has announced the pickup of a the seventh season of its reality docuseries \"Chrisley Knows Best,\" and greenlit a 16-episode spinoff, \"Growing Up Chrisley.\" Both set to air in 2019, the spinoff will center on Chase and Savannah Chrisley as they road trip from Nashville to Los Angeles and attempt to break out on their own in the big city. Season 7 will continue to follow Todd Chrisley and his family throughout its 26-episode order.\r\n\r\nCASTING\r\n\r\nHulu announced the leads for its upcoming eight-episode limited series \"Looking for Alaska.\" The adaption of John Green's young adult novel will star Kristine Froseth (\"Sierra Burgess is a Loser\") as Alaska Young and Charlie Plummer (\"Lean on Pete\") as Miles Halter. The story centers on Miles' journey of falling in love with the mysterious Alaska, and following her unexpected death, trying to uncover the truth behind what really happened. The series is from Paramount Television, with Josh Schwartz writing the pilot and serving as executive producer and showrunner. Fake Empire's Stephanie Savage will executive produce with Jessica Tuchinsky, Mark Waters, Green, and Marty Bowen and Isaac Klausner of Temple Hill. Fake Empire exec Lis Rowinski will co-executive produce.\r\n\r\nJason Flemyng (\"The Curious Case of Benjamin Button\") has joined the cast in the series regular role of villain Lord Harwood in the upcoming Epix drama series \"Pennyworth.\" The 10-episode, one-hour drama series is based on DC characters and follows Bruce Wayne’s legendary butler, Alfred Pennyworth (Jack Bannon), in his younger years when he worked with the man who would become Wayne's father. Lord Harwood has the appearance and education of an upper class Englishman, but underneath the charm is his sadistic, cruel nature. The series is currently in production at Warner Bros. Studios Leavesden, in the UK.\r\n\r\nDEVELOPMENT\r\n\r\nIFC unveiled five new original comedies in development: \"Almost Asian,\" executive produced by Margaret Cho, chronicles the life of a mixed-race millennial; \"Annika Erotica\" follows a young pastor harboring a secret passion for writing erotic novels; the adventure comedy \"Art Thieves\" is about self-proclaimed Robin Hoods of the art world; \"Beth,\" focuses on a happily-agoraphobic man's uneasy journey back to the outside world; and the satirical and politically provocative sketch comedy \"The Middle Passage.\" The projects join the previously announced series in development \"How to Rig an Election\" and \"NGO.\"\r\n\r\nYouTube has ordered a presentation for a new animated series, \"Dumb People Town.\" The half-hour show is based on the podcast created by Randy Sklar, Jason Sklar, and Daniel Van Kirk. It focuses on a family in a Florida town struggling with the most important question of our times: \"Is it better to be dumb and happy? Or smart and miserable?\" The series will be written by and executive produced by Randy and Jason Sklar, Daniel Van Kirk and Julius Sharpe (\"Family Guy\"). Will Arnett and Marc Forman will executive produce through Electric Avenue along with Peter Principato and Joel Zadak through Artists First. The project is distributed by Sony Pictures Television.\r\n\r\nDEALS\r\n\r\nPremiere Entertainment Group has acquired the rights to the made-for-television movie, \"Shadow Wolves.\" The action film stars Thomas Gibson (\"Criminal Minds\"), Cody Walker (\"Furious 7\"), Louise Lombard (\"CSI: Crime Scene Investigation\"), and Graham Greene (\"Dances With Wolves\"). It follows the Shadow Wolves, an elite unit of highly trained Native Americans who must stop ISIS terrorists sneaking into the U.S. When Colonel Branson (Gibson), head of a secret division of the NSA, sends his best agent (Walker) to help them, his presence could bring the Shadow Wolves closer together or break them apart. The movie is the first big action role for Walker, the brother of late actor Paul Walker. It is written and directed by McKay Daines, who also produces alongside executive producers Steven Marrs, Tom Reeve, Michael G. Corrigan, and Courtney Hazlett.\r\n\r\nEXECUTIVES\r\n\r\nAlex Katz (\"World of Dance,\" \"The Biggest Loser\") is set to lead the newly established No Other Way Productions along with post-production producer Mandy Novak (\"World of Dance\"). Katz and Novak will focus on providing post-production and editorial services to meet the needs of networks, streaming services, and cable channels. They will also have a separate production arm focusing on development and production of original content for scripted, unscripted, and digital projects.\r\n\r\nRATINGS\r\n\r\nNBC's \"A Very Wicked Halloween Special\" put up so-so numbers in the Monday overnight ratings. Airing at 10, the special drew a 1.0 rating in adults 18-49 and 4 million viewers. That was good enough to finish second in its timeslot in the key demo but third in total viewers.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1540938274.0, "source": "https://variety.com", "summary": ""}