{"url": "https://en.wikipedia.org/wiki/Wedding_of_Prince_Harry_and_Meghan_Markle", "text": "Wedding of British royal Prince Harry to Meghan Markle\n\nThe wedding of Prince Harry and Meghan Markle was held on 19 May 2018 in St George's Chapel at Windsor Castle in the United Kingdom. The groom, Prince Harry, is a member of the British royal family; the bride, Meghan Markle, is American and previously worked as an actress.[note 1] On the morning of the wedding, Prince Harry's grandmother, Queen Elizabeth II, conferred upon him the titles of Duke of Sussex, Earl of Dumbarton and Baron Kilkeel.\n\nOn her marriage, Markle became Duchess of Sussex,[1] Countess of Dumbarton[2] and Baroness Kilkeel.[3] The Archbishop of Canterbury, Justin Welby, officiated at the wedding using the standard Anglican church service for Holy Matrimony published in Common Worship, the liturgical text of the Church of England.[4][5] The traditional ceremony was noted for the inclusion of African American culture.[6]\n\nAnnouncement of engagement [ edit ]\n\nPrince Harry is the second son of Charles, Prince of Wales, and Diana, Princess of Wales. He and Meghan Markle, an American actress best known for her role in the Canadian-American legal-drama television series Suits, began their relationship in 2016 after having met in July of that year.[7] The relationship was officially acknowledged on 8 November 2016, when a statement was released from the royal family's communications secretary addressing the \"wave of abuse and harassment\" directed toward Markle.[8]\n\nHarry and Meghan attending church on Christmas Day, 2017\n\nOn 27 November 2017, Clarence House announced that Prince Harry would marry Markle in the spring of 2018.[9] They were engaged earlier the same month in London, with the Prince giving Markle a bespoke engagement ring made by Cleave and Company, the court jewellers and medalists to the Queen, consisting of a large central diamond from Botswana, with two smaller diamonds from his mother's jewellery collection.[10][note 2] At the same time, it was announced that they would live at Nottingham Cottage in the grounds of Kensington Palace following their marriage.[13]\n\nThe Queen and the Duke of Edinburgh expressed their delight at the news, while congratulations came in from various political leaders, including the British Prime Minister, Theresa May, and the Leader of the Opposition, Jeremy Corbyn. After the announcement, the couple gave an exclusive interview to Mishal Husain of BBC News.[13]\n\nDuring the public announcement of the engagement at Kensington Palace's Sunken Gardens, Markle wore a bottle knee-length emerald green dress with bow detailing at the cinched waist by Italian label P.A.R.O.S.H and a white trench coat by Canadian brand Line the Label.[14][15] Hours after the announcement, the website of Line the Label crashed down due to the number of people who were trying to order the coat.[10][16]\n\nMarkle is the second American[note 3] and the first person of mixed race heritage to marry into the British royal family.[17] The engagement announcement prompted much comment about the possible social significance of Markle becoming a proudly mixed-race royal.[18][19][20][21][22]\n\nUnder the terms of the Succession to the Crown Act 2013, the first six persons in the line of succession require the Sovereign's consent in order to marry. Harry was fifth in line at the time of his engagement.[23] The Queen's consent was declared to the Privy Council of the United Kingdom on 14 March 2018.[24][25]\n\nAlthough Markle attended a private Catholic school in her early years, she is not Roman Catholic.[26] On 6 March 2018, she was baptised and confirmed into the Church of England by the Archbishop of Canterbury Justin Welby at St. James's Palace.[27] Although Markle was divorced, the Anglican Church has permitted marriage to divorced persons with a living former spouse since 2002.[28][29] After the engagement, Markle began the years-long process of becoming a British citizen.[30] She will retain her U.S. citizenship during the process,[31] but Kensington Palace have indicated that the decision on whether she will retain dual nationality has not yet been made.[30] Retaining U.S. citizenship is expected to create tax complications.[32] The couple was invited to celebrate Christmas 2017 with the royal family at the Queen's Sandringham estate.[33] The official engagement photographs were taken by Alexi Lubomirski (a former assistant to Mario Testino) at Frogmore House, and were issued by Kensington Palace on 21 December 2017.[34]\n\nTo mark the wedding of Harry and Meghan, the Royal Mint produced an official UK £5 coin, showing the couple in profile.[35] In May, a set of commemorative postage stamps, featuring the couple's official engagement photographs, was issued by Royal Mail.[36]\n\nWedding [ edit ]\n\nPlanning [ edit ]\n\nPreparation for wedding of Prince Harry and Meghan Markle\n\nUnlike the wedding of Prince William and Catherine Middleton, the wedding day of Prince Harry and Meghan Markle was not declared a bank holiday.[37] The wedding was on the same date as the FA Cup Final, which Prince Harry's brother William normally attends in his role as President of the Football Association.[38] Holding the royal wedding on a weekend is a break with the royal tradition of having weddings on a weekday.[39] On 12 February 2018, Kensington Palace announced that the ceremony would commence at 12:00 Midday BST.\n\nVenue [ edit ]\n\nThe wedding took place on Saturday, 19 May 2018, at St George's Chapel, Windsor.[40] The chapel had previously been the venue for the weddings of Prince Harry's uncle, the Earl of Wessex, as well as that of his cousin, Peter Phillips, and for the blessing of the marriage of the Prince of Wales and the Duchess of Cornwall, Harry's stepmother.[41] Later that same year it would host the wedding of his cousin Princess Eugenie to Jack Brooksbank.\n\nCost [ edit ]\n\nThe royal family announced that they would pay for the wedding.[42] The costs for the cake, the florist, and the catering had been estimated to be £50,000, £110,000, and £286,000 respectively,[43] and the overall cost was expected to be around £32 million.[44] The security costs were expected to be lower than those of the 2011 wedding of the Duke and Duchess of Cambridge.[45] By the end of May, it was estimated that the security costs were \"between £2 million and £4 million\". The police and crime commissioner could also apply for special funding if the costs were to exceed 1% of the Thames Valley Police force's annual budget, but at the time the cost was \"well below the £4 million required to make a claim\".[46] The Royal Borough of Windsor and Maidenhead reportedly spent £2.6 million on cleaning the town and roads.[45] It was predicted that the wedding would trigger a tourism boom and boost the economy by up to £500 million.[47]\n\nWedding attire [ edit ]\n\nThe wedding invitations specified a dress code for men of \"Dress Uniform, Morning Coat or Lounge Suit\"; for women, \"Day Dress and Hat\".[48]\n\nBride and bridesmaids [ edit ]\n\nThe wedding dress was designed by the British designer Clare Waight Keller under the aegis of the fashion house Givenchy.[49] It was made of \"double-bonded silk cady cushioned by an underskirt in triple silk organza\" and had a boat neckline, long sleeves and sweeping train.[50][51] The silk veil was 16 feet (4.9 m) long and was embroidered with 55 flowers, representing the 53 countries of the Commonwealth,[50][52] as well as Wintersweet, which grows in front of Nottingham Cottage, where she and Harry live, and the California Poppy, the state flower of California.[53] It was secured by a diamond bandeau tiara, made in 1932 for Queen Mary and lent to Markle by Queen Elizabeth II.[50][54] The centre brooch had been a wedding gift from the County of Lincoln in 1893. The tiara is a platinum band, made up of eleven sections, a detachable centre brooch with interlaced opals and diamonds.[55] The shoes were also from Givenchy, and had a pointed couture design.[50]\n\nOther ensembles worn by the bride included white gold and diamond earrings and bracelet made by Cartier.[50][54][56] Markle's hair was rolled up with \"face-framing fringe tucked behind her ears\",[57] and was done by Serge Normant.[58] Dior make-up artist Daniel Martin did Markle's makeup for the occasion.[57][59] The look was described as \"a soft brown eyeshadow\" with minimal makeup on the face.[57] Her nails were painted in a \"neutral pink-y beige\" for the ceremony.[60] The bride's bouquet, designed by Philippa Craddock, contained \"forget-me-nots, scented sweet peas, lily of the valley, astilbe, jasmine and astrantia, and sprigs of myrtle\".[50] The flowers were chosen by the groom who handpicked forget-me-nots in honour of his late mother Diana, Princess of Wales.[50][61]\n\nAfter the wedding the bridal bouquet was placed on the Tomb of the Unknown Warrior at Westminster Abbey, following royal tradition that began with the Queen Mother.[62] For the customary bridal themes of \"Something old, something new, something borrowed, something blue\", Markle had her dress and veil (the \"new\"), the Queen's tiara (the \"borrowed\"), sprigs of myrtle taken from \"a plant grown from the myrtle used in the Queen's wedding bouquet\" and a piece of fabric from Diana, Princess of Wales's wedding dress (the \"old\"), and finally a piece of fabric from the dress she wore on their first date stitched in the veil (the \"blue\").[63][64][65] The young bridesmaids also wore high-waisted silk dresses designed by Clare Waight Keller which had puff sleeves.[66]\n\nGroom, best man and page boys [ edit ]\n\nPrince Harry and the Duke of Cambridge wore the frock coat uniform of the Blues and Royals (Royal Horse Guards and 1st Dragoons) in which both were commissioned,[note 4] and Prince Harry served for 10 years, including in combat in Afghanistan.[67] The uniforms were made by Dege & Skinner, gentleman's tailors and uniform makers, of Savile Row, London.[68][69] The groom asked for and received the Queen's permission to keep his beard, as beards are only permitted under exceptional circumstances in the British Army.[67] Prince Harry wore the rank of major with the star of the Royal Victorian Order, of which he is a Knight Commander, along with the ribbons of the Royal Victorian Order, Operational Service Medal for Afghanistan, Queen Elizabeth II Golden Jubilee Medal and Queen Elizabeth II Diamond Jubilee Medal, and Army Air Corps wings.[70]\n\nPrince William, also with the rank of major, had EIIR cyphers on his shoulder straps and gold aiguillettes on his right shoulder (indicating his position as an aide-de-camp to the Queen), and wore the star of the Order of the Garter, the ribbons of the two jubilee medals, and his RAF wings.[68][71] The pageboys wore uniforms by Dege & Skinner that resembled the uniform of the Blues and Royals worn by the groom and best man. Each page boy had his initials on the shoulders in place of rank badges.[68]\n\nWedding party [ edit ]\n\nOn 26 April 2018, Kensington Palace announced that Prince Harry had selected his older brother, Prince William, Duke of Cambridge, as his best man.[72][73] There was initially no confirmation as to whether Prince William would miss the FA Cup Final, which he would normally attend in his role as President of The Football Association, or if he would be able to attend both the wedding and the football. A statement from Kensington Palace that the timing of the wedding would not clash with the match was released in December 2017.[74] However, it was confirmed in March that the Duke would not be attending the final that day.[75]\n\nThere were suggestions that the bride's friend Jessica Mulroney, daughter-in-law of former Canadian Prime Minister Brian Mulroney, would be her maid of honour.[76][77] In early May 2018, there was confirmation that there would be no maid of honour, and that the bridesmaids and page boys would all be children.[78] A total of ten bridesmaids and page boys were chosen, with the bride and groom each selecting five: two of Markle's godchildren, seven-year old Rylan Litt and her six-year-old sister Remi, as well as Brian, John and Ivy Mulroney, the three children of her friend Jessica Mulroney, were chosen by the bride, while Prince Harry's nephew and niece, Prince George and Princess Charlotte of Cambridge, as well as his godchildren Florence van Cutsem, Zalie Warren and Jasper Dyer, were selected by the groom.[79][80]\n\nOn 18 May 2018, Kensington Palace announced Prince Charles would accompany Markle down the aisle, after she confirmed her father, Thomas Markle Sr., would not be attending the wedding due to his recent heart surgery.[81][82] The bride spent the night before the wedding at Cliveden House along with her mother, while the groom stayed at Coworth Park Hotel with his brother.[83][84] Markle made her way to the church accompanied by her mother.[85]\n\nApproximately 250 members of the British Armed Forces were involved in the wedding, the majority coming from units that have a connection with Prince Harry:[86]\n\nWedding service [ edit ]\n\nThe wedding service was conducted according to the Christian liturgy for Holy Matrimony as set out in Common Worship of the Church of England, mother Church of the Anglican Communion.[5]\n\nFrom 8.00 am, the public started to arrive at the grounds of Windsor Castle. The main congregation and the guests[89] all started to arrive at the chapel at 9.30 am, followed by members of the Royal Family. The Queen and the Duke of Edinburgh were the last members of the Royal Family to depart for the ceremony, as is tradition, arriving at the chapel at 11.52 am.[90] Shortly after, Markle arrived with the party of junior attendants. She proceeded down the aisle followed by the attendants, where the Prince of Wales met her to escort her through the quire of the chapel. He accompanied her to the altar, where Prince Harry was standing.[91][92]\n\nPrince Harry's maternal aunt, Baroness Fellowes, read a scripture lesson from The Song of Solomon in the Christian Bible. The Dean of Windsor, David Conner, conducted the service with the Archbishop of Canterbury, Justin Welby, performing the marriage ceremony. The sermon was delivered by The Most Reverend Michael Curry, presiding bishop and primate of the Episcopal Church (the American member church of the Anglican Communion).[93][94] Curry's 14-minute address, which quoted Martin Luther King Jr., emphasised the redemptive property of love.[95][96] Chaplain to the Queen The Reverend Prebendary Rose Hudson-Wilkin and Coptic Orthodox Archbishop of London Anba Angaelos offered the prayers.[97]\n\nThe marriage vows were those published in Common Worship, and included the promise to \"to love and to cherish\" each other.[98] This was sealed by the exchange of rings.[98] The wedding rings were created by Cleave and Company, with Markle's ring being fashioned out of Welsh gold and the Prince's ring made of platinum.[99] After the signing of the registers, Harry and Markle together with the guests sang the national anthem. The couple paused briefly to bow and curtsey to the Queen before walking down the aisle.[100] They were followed in procession by other members of the bridal party, and their families.[98] The couple shared a kiss on the steps outside the chapel.[101]\n\nOrder of Service [ edit ]\n\nWorks are performed by the Choir of St. George's Chapel and/or the wedding's orchestra, unless otherwise stated\n\nMusic [ edit ]\n\nHymns sung at the wedding included Lord of All Hopefulness and Guide Me, O Thou Great Redeemer.[102] Prince Harry was seen wiping away a tear during the congregational singing of the latter, which was a favourite of his mother, Diana, Princess of Wales, and was sung at her funeral in 1997;[103] it was also the opening hymn to William's wedding in 2011.\n\nTwo choirs, an orchestra, the chapel organ and fanfare trumpeters provided music for the service. The orchestra was made up of musicians from the BBC National Orchestra of Wales, the English Chamber Orchestra and the Philharmonia Orchestra. In addition to the Choir of St George's Chapel, the Kingdom Choir, a gospel group led by Karen Gibson, sang \"Stand By Me\" in what was described as \"an incredible and powerful moment\", as the couple were sitting down.[104] The State Trumpeters of the Household Cavalry, who played a fanfare, included Kate Sandford, the first female state trumpeter at a British royal wedding.[105] The music was under the overall direction of James Vivian, the chapel's Organist and Director of Music; and the orchestra was conducted by Christopher Warren-Green.[106][107]\n\nThe bride walked down the aisle to \"Eternal source of light divine\" (from the Ode for the Birthday of Queen Anne) by Handel, sung by soprano Elin Manahan Thomas, with the trumpet obbligato performed by David Blackadder.[108] Other music during the service included the motet \"If Ye Love Me\" by Thomas Tallis; the song \"Stand by Me\" by Jerry Leiber, Mike Stoller and Ben E. King, arranged for choir by Mark Delisser; and \"The Lord bless you and keep you\" by John Rutter. During the signing of the register, 19-year-old cellist Sheku Kanneh-Mason and the orchestra played Sicilienne attributed to Maria Theresia von Paradis, Fauré's Après un rêve, and an arrangement for cello and orchestra of Schubert's Ave Maria. For the procession, the musicians performed the Allegro from the Symphony No. 1 in B-flat major by William Boyce and \"This Little Light of Mine\" by Etta James, Jester Hairston and Harry Dixon Loes.[109]\n\nFamily celebrations [ edit ]\n\nSt George's Hall, Windsor Castle Frogmore House\n\nFollowing the ceremony, there was a carriage procession through Windsor. Two receptions were held; the first, for those attending the ceremony, was hosted by the Queen and took place in St George's Hall after the carriage procession. Singer Elton John performed for the guests, and the groom and the Prince of Wales each gave a speech.[67] A second reception at Frogmore House, for family and close friends and hosted by the Prince of Wales, occurred later in the day.[93] Harry drove his new wife to the reception at Frogmore in a silver blue Jaguar E-Type Concept Zero, with left-hand drive.\n\nFor the evening reception, the Duchess of Sussex wore a halter-neck, open back dress by Stella McCartney and an emerald cut Aquamarine ring formerly belonging to Diana, Princess of Wales.[110][111] George Northwood was her hairstylist for the private party.[111] In a break with tradition, the bride made a speech at the event.[67] The Duke of Cambridge also gave a best man's speech. DJ Idris Elba and The Atlantic Soul Orchestra performed at the event.[112][113][114] The event ended with small fireworks displayed above Frogmore House.[115]\n\nThe wedding cake was a layered lemon and elderflower cake and decorated with peonies in shades of white and cream.[116] The cake designer Claire Ptak, based in London, was chosen in March 2018.[117]\n\nThree official wedding photos were released. They were taken by photographer Alexi Lubomirski at Windsor Castle following the ceremony.[118]\n\nGuests [ edit ]\n\nIn April 2018, it was announced that an \"official list\" of domestic and international political leaders was not required for the wedding and that Prime Minister Theresa May, Leader of the Opposition Jeremy Corbyn, and other leaders would not attend the ceremony. President of the United States Donald Trump and former president Barack Obama were also not invited.[119] This was in contrast to the wedding of Prince Harry's elder brother, which had a large number of such guests due to his position as a future monarch.[120] The decision not to invite political leaders to the wedding was taken in part because of the limitations of the venue, and also took into account Prince Harry's position as sixth in line to the throne.[120] The only politician invited was the former Prime Minister Sir John Major as he previously was \"a special guardian on legal matters to Princes William and Harry after the death of their mother\".[67]\n\nWith a smaller ceremony and reception at St George's Hall, the guest list included approximately 600 people, most of whom have a \"direct relationship\" with the couple.[121] Also, 200 close friends of the couple were invited to attend the evening reception at Frogmore House.[122] Approximately 1,200 members of the public were invited to greet the couple outside the chapel in the grounds of Windsor Castle.[121] The invitees outside the chapel were \"people from charities, Windsor Castle community members, people from the royal households and the Crown Estate, and local school children\".[123]\n\nSarah, Duchess of York, the former wife of Prince Andrew, was invited to the wedding even though she had not been invited to the weddings of Prince William and Catherine Middleton in 2011, Peter Phillips and Autumn Kelly in 2008, or Zara Phillips and Mike Tindall in 2011. However, she was not invited to the evening reception at Frogmore House hosted by Prince Charles and was reportedly \"deeply upset\" by her omission.[124]\n\nAmongst the non-royal guests were Markle's Suits co-stars Patrick J. Adams (with wife Troian Bellisario), Gabriel Macht (with wife Jacinda Barrett), Sarah Rafferty, Rick Hoffman, Gina Torres and Abigail Spencer, actors George Clooney (with wife Amal Clooney), Idris Elba and Tom Hardy, actresses Oprah Winfrey, Priyanka Chopra and Carey Mulligan (with husband Marcus Mumford), television host James Corden, tennis player Serena Williams (with husband Alexis Ohanian), David and Victoria Beckham, musicians Sir Elton John (with husband David Furnish), James Blunt, Joss Stone, and rugby players Jonny Wilkinson and James Haskell. Meghan's close friend, stylist Jessica Mulroney (with husband Ben Mulroney) and Harry's ex-girlfriends Cressida Bonas and Chelsy Davy were also in attendance. Other guests were members of the Middleton family.[125][126][127][128][129]\n\nThe only foreign royal guests at the wedding were Prince Harry's friend Prince Seeiso of Lesotho, with whom he co-founded, after the death of both of their mothers, the Sentebale foundation to help AIDS-stricken orphans in Lesotho, and his wife Princess Mabereng.[130]\n\nGifts for guests [ edit ]\n\nThe 2,640 members of the public invited to Windsor Castle for the wedding were gifted gift bags to commemorate the event. The bag had the initials of the couple, date and venue location printed on the exterior. Inside was an order of service booklet for the wedding, a gold chocolate coin, a bottle of water, a fridge magnet, a 20% off voucher for the Windsor Castle gift shop and a tube of handbag shortbread.[131]\n\nCharitable donations [ edit ]\n\nIn April 2018, the couple requested that, rather than sending wedding gifts, people should make a donation to one of seven charitable organisations, none of which they had a formal association with:[132][133]\n\nCHIVA (Children's HIV Association): The small charity supports more than 1,000 young people living with HIV in the UK and Ireland.\n\nCrisis: The national homeless body works with thousands of people a year to help rebuild their lives.\n\nThe Myna Mahila Foundation: The organisation, based in Mumbai, helps empower women through offering stable employment and breaking cultural taboos around menstrual hygiene. Myna Mahila also teaches women life skills such as maths, English and self-defence.\n\nScotty's Little Soldiers: The charity supports children who have lost a parent while serving in the British Armed Forces.\n\nStreetGames: The organisation uses sport to help young people and communities become healthier and safer.\n\nSurfers Against Sewage: The national marine conservation body works to protect oceans, beaches, waves and wildlife.\n\nThe Wilderness Foundation UK: Vulnerable teenagers from urban communities are taught about the great outdoors and rural employment opportunities.\n\nCoverage [ edit ]\n\nPeople watching the wedding at the official residence of the UK Ambassador to Italy, in Rome\n\nPeak viewing figures of 27.7 million were reported in the UK.[134] About 29 million were reported to have watched in the United States, up from the 23 million Americans who watched the wedding of Prince William and Catherine Middleton.[135] The global audience was estimated to be in the hundreds of millions.[136]\n\nCoverage of the royal wedding in the UK was shown on BBC One, ITV, Sky News, CNN (International) and E! (Europe) [137] The wedding was also streamed live online on YouTube via the British Monarchy's official The Royal Channel.[138] Huw Edwards hosted coverage for BBC TV with Desert Island Discs host Kirsty Young and BBC Radio 2 DJ Dermot O'Leary. The BBC Radio coverage was co-hosted by Chris Evans and Scarlett Moffatt.[139] Phillip Schofield and Julie Etchingham hosted coverage for ITV.[140] Kay Burley, Anna Botting and Alastair Bruce, among others, hosted coverage for Sky.[141]\n\nCBC broadcast the wedding in Canada with Adrienne Arsenault and retired broadcaster Peter Mansbridge presented live coverage that was simulcast on CBC Television, CBC Radio One and CBC News Network.[142] TVNZ screened it in New Zealand along with SBS and Nine in Australia.[137][143] The wedding received 4 million views in Australia.[144]\n\nIn Fiji, Fiji Television broadcast the event via BBC with coverage starting from 8:30 pm FJT on 19 May and finishing at 12:30 am on 20 May, when it switched back to normal programming.\n\nIn the United States coverage aired on CBS, NBC, ABC, E!, PBS, BBC America, TLC, FOX, and HBO.[145] CBS's coverage began at 4 a.m. EDT with CBS Presents \"The Royal Wedding\"[146] and Gayle King provided commentary during the broadcast. ABC began its coverage at 5 a.m. EDT with a special edition of Good Morning America.[147] NBC aired the ceremony at 4:30 a.m. EDT with a special edition of The Today Show.[148] The pay subscription network HBO hosted a live broadcast titled \"The Royal Wedding Live with Cord and Tish!\" starting at 7:30 a.m. EDT.[149] The parody hosts were Cord Hosenbeck and Tish Cattigan, the alter egos of former Saturday Night Live actors Will Ferrell and Molly Shannon. BBC America provided a live simulcast of BBC One's coverage, albeit with limited commercial breaks.[150]\n\nThe wedding was also aired on the Republic of Ireland's national broadcaster RTÉ.[151]\n\nComments in a \"posh\" British accent by a self-claimed British expert on some media turned out to be by an American, Thomas Mace-Archer-Mills.[152]\n\nIn April 2020, it was announced that $112,000 in profits from the BBC broadcast of the Duke and Duchess's wedding would be donated to Feeding Britain amidst the 2020 coronavirus pandemic in the United Kingdom.[153]\n\nTitles [ edit ]\n\nTraditionally, royal princes have been awarded peerages prior to their marriages; this occurred with both of Prince Harry's uncles, the Duke of York and the Earl of Wessex, as well as his elder brother, the Duke of Cambridge.[154] Hours before the wedding, Prince Harry was granted the titles Duke of Sussex, Earl of Dumbarton, and Baron Kilkeel, and Markle assumed the style \"Her Royal Highness The Duchess of Sussex\" upon marriage.[1]\n\nReactions [ edit ]\n\nBritish reactions to a mixed-race American marrying into the British royal family ( Voice of America\n\nThe wedding was widely reported as being significant for its departure from tradition typically associated with the royal family and for its inclusion of African-American culture in the service.[155][156][157][158][159] It was described as a \"landmark for African Americans\", for Black British, black and mixed-race women, and for the royal family itself.[160][161][162][163] Other reports cited more limited impact, including that \"Markle being biracial as opposed to African American impeded black people embracing her as one of their own\".[164][165]\n\nThe wedding, particularly Markle's choice of dress, as well as the cake and flowers, influenced the choices of other British brides for their weddings.[166]\n\nHoneymoon [ edit ]\n\nThe couple did not leave for their honeymoon the day after their marriage, and were both scheduled to carry out public engagements in the week after the wedding.[167] The location of the honeymoon has been kept secret, although the press speculated that they might be headed to locations such as Namibia, Rwanda, and Botswana.[168][169][170]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg/240px-Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg/1200px-Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Frogmore_House_16-08-2014_front.jpg/214px-Frogmore_House_16-08-2014_front.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Windsor_Castle_-_St_George%27s_Hall.jpg/190px-Windsor_Castle_-_St_George%27s_Hall.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Royal_wedding_celebrations_in_Rome.jpg/220px-Royal_wedding_celebrations_in_Rome.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/St._Georges_Chapel%2C_Windsor_Castle_%282%29.jpg/220px-St._Georges_Chapel%2C_Windsor_Castle_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/How_Do_Brits_Feel_About_a_Mixed_Race_American_Marrying_into_British_Royal_Family.webm/220px--How_Do_Brits_Feel_About_a_Mixed_Race_American_Marrying_into_British_Royal_Family.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg/120px-Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Coat_of_arms_of_Meghan%2C_Duchess_of_Sussex.svg/120px-Coat_of_arms_of_Meghan%2C_Duchess_of_Sussex.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Crown_of_Saint_Edward.svg/32px-Crown_of_Saint_Edward.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Prince_Harry_and_Meghan_Markle.jpg/220px-Prince_Harry_and_Meghan_Markle.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Cavalry_Trooping_the_Colour%2C_16th_June_2007.jpg/170px-Cavalry_Trooping_the_Colour%2C_16th_June_2007.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Huge_Security_Operation_Under_Way_as_Britain_Prepares_For_Royal_Wedding.webm/220px--Huge_Security_Operation_Under_Way_as_Britain_Prepares_For_Royal_Wedding.webm.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg/1200px-Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wedding_of_Prince_Harry_and_Meghan_Markle", "title": "Wedding of Prince Harry and Meghan Markle", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg/1200px-Combined_Coat_of_Arms_of_Harry_and_Meghan%2C_the_Duke_and_Duchess_of_Sussex.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}