{"url": "www.newidea.com.au/brad-pitt-wins-custody-battle-angelina-jolie", "text": "Ex-flames Brad and Ange have been working together for the better part of 18 months to reach an agreement on the custody of their six children - Maddox, 16, Pax, 14, Zahara, 13, Shiloh, 11, and 9-year-old twins Knox and Vivienne - and according to Life & Style, the former couple have managed to come to an agreement.\n\nThe publication's report reveals Brad was left 'devastated' when Ange told him she had planned to take their children to London with her for five months while she filmed Maleficent 2.\n\n'Even though Brad knows Angelina has custody and he has visitation, he felt it was a major breach in their agreement,' a family friend spilled to the publication. 'He was livid.'\n\nLife & Style claim Brad then waged a war on his ex-wife, and that he came out on top!\n\nThe friend tells, 'To keep him from contesting her London move, she promised Brad that he can spend longer periods of time with the kids before and after the trip.'\n\n'When he found out he was getting more time with them, Brad cried tears of joy,' the friend adds.\n\nThe Hollywood actor has since been spending much more time with his six children, something he considers a 'major victory.'\n\nLife & Style reveal the kids are 'ecstatic' to be spending more time with their dad.\n\nFriends close to the pair also reveal that although the kids love Ange, they 'always wanted to be with their Dad more.'\n\nGetting sober and being in therapy has only made Brad's bond with his children stronger, the publication adds.\n\n'He really feels he's turned a negative into a positive by getting more time with the kids,' says the family friend. 'He's never going to let them get too far away again.'\n\nFriends close to the star also revealed to PEOPLE that he is 'more like the old happy and charming Brad,'\n\nAccording to the publication, the actor is in good spirits as he slowly begins to make his way back into the spotlight.\n\nBrad is yet to respond to Life & Style's report.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/media/25697/brad-and-ange-pre.jpg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/25697/brad-and-ange-pre.jpg", "keywords": [], "authors": ["Georgia Mars", "Georgia Mars Is A Digital Content Editor At New Idea Magazine. As A Self-Professed Celeb Expert", "Georgia Claims To Know Everything About Everyone", "When She'S Not Digging Deep For The Next Big Celebrity Scoop", "You Can Find Georgia Catching Up On The Latest Reality Tv."], "canonical_link": "https://www.newidea.com.au/brad-pitt-wins-custody-battle-angelina-jolie", "title": "Brad Pitt's custody victory over Angelina Jolie", "meta_data": {"language": "en-us", "description": "After a bitter two year battle, Brad Pitt has won the custody battle for his six children with ex-wife Angelina Jolie, Life & Style reports.", "news_keywords": "Brad Pitt, Angelina Jolie, Brad Pitt and Angelina Jolie, Brad and Ange, Brangelina, Brad Pitt Angelina Jolie custody, Brad Pitt Angelina Jolie kids, Maddox Chivan Jolie Pitt, Shiloh Nouvel Jolie Pitt, Pax Thien Jolie Pitt, Vivienne Marcheline Jolie Pitt, Knox Leon Jolie Pitt, Zahara Marley Jolie Pitt, Brad Pitt custody, Angelina Jolie xustody, celebrity divorce, celebrity custody", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/brad-pitt-wins-custody-battle-angelina-jolie", "title": "Brad Pitt's custody victory over Angelina Jolie", "description": "After a bitter two year battle, Brad Pitt has won the custody battle for his six children with ex-wife Angelina Jolie, Life & Style reports.", "image": {"identifier": "http://www.newidea.com.au/media/25697/brad-and-ange-pre.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "US REPORT: Brad Pitt wins custody battle over ex-wife Angelina Jolie", "description": "After a bitter two year battle, Brad Pitt has won the custody battle for his six children with ex-wife Angelina Jolie, Life & Style reports.", "image": "http://www.newidea.com.au/media/25697/brad-and-ange-pre.jpg", "url": "https://www.newidea.com.au/brad-pitt-wins-custody-battle-angelina-jolie"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1523497372.294, "source": "http://www.newidea.com.au", "summary": ""}