{"url": "www.newidea.com.au/camilla-parker-bowles-angelina-jolie-plot-kate-middleton", "text": "Getty\n\nA palace source explosively told New Idea, ‘Camilla has welcomed the actress into the royal fold.'\n\nAdding, ‘Ange couldn’t be happier – she’s passionate about her charity work and has wanted to be close to the royal family for years.\n\n'So meeting Camilla and having her work so hard to align her with royal causes has been amazing – they’ve become incredibly close since Ange moved to the UK, and she can’t believe how close to the royals she’s become.'\n\nAlthough Angelina is loving the royal attention, Camilla's intentions are reportedly much more sinister.\n\nMany believe this is all part of Camilla’s plot to rattle Meghan and Kate, knowing the A-list Hollywood star will cause all sorts of drama and jealousy.\n\n‘Camilla has never felt Kate and Meghan were suitable for the royal family – not regal enough and not from the right breeding. In Camilla’s day, only women of aristocratic blood married into the royal family – so seeing “Commoner Kate” and soap actress Meghan marry their way in has incensed her.\n\n‘She likes to cause trouble for them, and bringing in Angelina is just another way to ruffle a few feathers,’ the source adds.\n\nAccording to the source Kate is devastated over Camilla and Ange’s meetings and really feels like they are betraying her.\n\n'She’s seen them growing closer and closer and it’s really left her unsettled because she knows how conniving Camilla can be. Kate knows the pair are capable of anything, and has been told by several palace aides to watch Camilla and Ange closely,’ the insider spills.\n\nGetty\n\nShockingly, Ian Halperin, author of Brangelina: The Untold Story Of Brad Pitt And Angelina Jolie, accuses the Maleficent actress of wanting to 'infiltrate' the royal family.\n\nIn the book, Ian claimed that Angelina studied Princess Diana in ‘minute detail’ and has always wanted to continue the work of the late princess. He even claimed one friend suggested Angelina had a ‘secret ambition to marry into the royal family’, and alleged ‘Prince Andrew is on her radar’.\n\n‘She’s a woman with an agenda. She wants to leave the US and work in the UK. She wants to get in the House of Lords, she has a non-profit foundation there. She has her sights set on England,’ Ian told the Daily Star.\n\nRelated: Camilla and Angelina's shock plot exposed\n\nRelated: Camilla attacks Meghan\n\nRelated: Camilla's $12 million tell-all rocks the Queen and Prince Charles", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/29994/kate-and-meghan-plot.jpg", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/29994/kate-and-meghan-plot.jpg", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/camilla-parker-bowles-angelina-jolie-plot-kate-middleton", "title": "Camilla Parker-Bowles and Angelina Jolie plot against Kate Middleton and Meghan Markle", "meta_data": {"language": "en-us", "description": "As Angelina Jolie spends more time in London, the Hollywood actress has teamed up with Camilla, Duchess of Cornwall, to rattle Meghan Markle and Kate Middleton.", "news_keywords": "Angelina Jolie, Camilla Parker Bowles, Kate Middleton, Meghan Markle, royal scandals, latest royal scandals, royal plots, royal family, royal family news, latest royal family news, the royal family, the royals, latest royals news, royal family latest, royals angelina jolie, london, angelina london, camilla and angelina, kate and meghan, kate and meghan feud, kate and meghan friendship, kate and meghan secret plot, secret plots, royal news", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/camilla-parker-bowles-angelina-jolie-plot-kate-middleton", "title": "Camilla Parker-Bowles and Angelina Jolie plot against Kate Middleton and Meghan Markle", "description": "As Angelina Jolie spends more time in London, the Hollywood actress has teamed up with Camilla, Duchess of Cornwall, to rattle Meghan Markle and Kate Middleton.", "image": {"identifier": "http://www.newidea.com.au/media/29994/kate-and-meghan-plot.jpg", "width": 1500, "height": 1000}}, "twitter": {"title": "Camilla Parker-Bowles and Angelina Jolie plot against Kate Middleton and Meghan Markle", "description": "As Angelina Jolie spends more time in London, the Hollywood actress has teamed up with Camilla, Duchess of Cornwall, to rattle Meghan Markle and Kate Middleton.", "image": "http://www.newidea.com.au/media/29994/kate-and-meghan-plot.jpg", "url": "https://www.newidea.com.au/camilla-parker-bowles-angelina-jolie-plot-kate-middleton"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1531277457.92, "source": "http://www.newidea.com.au", "summary": ""}