{"url": "https://www.hollywoodreporter.com/news/russell-simmons-brett-ratner-accused-teaming-up-engage-sexual-misconduct-1059839", "text": "The L.A. Times reveals new allegations of sexual harassment and assault against the producer-director and music mogul, who are longtime friends.\n\nRussell Simmons and Brett Ratner have been accused of teaming up to allegedly sexually harass and assault women, according to a new report in the Los Angeles Times.\n\nThe Times — which, on Nov. 1, first reported that six women, including Olivia Munn and Natasha Henstridge, claim that Ratner sexually harassed and assaulted them — reported Sunday on new allegations against Ratner and revealed that longtime friend Russell Simmons allegedly engaged in inappropriate behavior with the director and producer.\n\nOne woman, Keri Claussen Khalighi, claims that when she was a 17-year-old fashion model she met Ratner, then an up-and-coming music video director and protege of Simmons, the music mogul who co-founded Def Jam Recordings, and Simmons at a casting call. After dinner one night in 1991, they took her back to Simmons' apartment, ostensibly to show her a music video they had been working on, she told the Times.\n\nBut Simmons quickly began making aggressive sexual advances and tore off her clothes, Khalighi told the Times.\n\n“I looked over at Brett and said ‘help me’ and I'll never forget the look on his face,” she told the newspaper. “In that moment, the realization fell on me that they were in it together.”\n\nKhalighi said that Simmons then tried to force her to have intercourse, which she \"fought … wildly.\" He coerced her to perform oral sex, though, she said, and she \"acquiesced.\" While taking a shower, she says, Simmons walked up behind her and briefly penetrated her without her consent. She jerked away and then he left, she says, saying of the experience, \"it hurt so much.\"\n\nSimmons strongly disputed Khalighi's account in a statement claiming, “Everything that happened between us 26 years ago was completely consensual and with Keri’s full participation.\"\n\nKhalighi said that she saw Simmons at the Soho House in West Hollywood last year, where he approached her and delivered a \"really touching, remorseful apology\" for his behavior. Simmons' attorney, Brad D. Rose, meanwhile, says the apology was in the “context for the embarrassment and upheaval the weekend caused her\" connected to her “infidelity.” She disputes that account.\n\nIn a statement to the Times, Simmons said Khalighi’s claim “does a disservice to those who have been true victims of sexual harassment.”\n\n“Let me be crystal clear and very direct. Abusing women in any way, shape or form violates the very core of my being,” he said in statements obtained by the Times and The Hollywood Reporter.\n\nIn a statement received by THR, Simmons added, \"I completely and unequivocally deny the horrendous allegations of non-consensual sex against me with every fiber of my being.\"\n\nRatner, meanwhile, via his attorney Martin Singer, has disputed the accounts of sexual misconduct he's faced from at least 10 other women, including the six women the Times identified in its Nov. 1 story and the four additional women who accused Ratner of sexual misconduct in Sunday's Times story. Singer said of the incident with Khalighi that Ratner has \"no recollection\" of her asking him for help and didn't see her \"protest.\"\n\nKhalighi said she told at least three people of her encounter with Ratner and Simmons, all of whom corroborated her story to the Times. Simmons' attorney provided a signed statement from Simmons' former assistant Anthony \"Mac\" McNair who said he saw Khalighi go to Simmons' bedroom \"on her own volition and without any coercion or undue influence.” McNair, who couldn't be reached by the Times, also said the group went to a nightclub later that evening and that he saw Khalighi at Simmons' house the next day. Simmons' attorney also provided two additional anonymous statements from people saying Khalighi didn't show any signs of distress that weekend. Khalighi said she didn't see anyone but Ratner and Simmons at Simmons' apartment and didn't recall being there the next day.\n\nKhalighi said she reached out to Simmons after the Times posted its Nov. 1 story about Ratner and said she was considering telling her story. He called her and they spoke for 27 minutes, phone records reviewed by the Times reveal. She said during that call he didn't deny any of her claims but apologized and mentioned that he's the father of two daughters.\n\nKhalighi also said she discussed the 1991 run-in with Ratner when she saw him one night in Los Angeles 15 years ago.\n\n\"He listened and he un-defensively acknowledged the truth of what had happened,” Khalighi told the Times. “He said he was young and stupid and blinded by Russell's sway over him.”\n\n“They are publicly denying these allegations, which implies that the women who come forward are liars,” Khalighi added to the newspaper. “So I'm coming out because what I've experienced privately is not matching what they are saying publicly and hypocrisy to me is repugnant and it's time for the truth to come out.”\n\nThe Sunday story in the Times includes more allegations against Ratner, which Times reporter Amy Kaufman had said the paper was investigating in the wake of its Nov. 1 report claiming he harassed and assaulted at least six women.\n\nSeveral women claimed that Ratner's friends, including Simmons and director James Toback, who has been accused of sexual misconduct by hundreds of women, enabled inappropriate behavior within the group, the Times reports. After the initial Times report about Ratner, Warner Bros. severed ties with the filmmaker.\n\nFormer aspiring model Tanya Reid told the Times that Ratner and Simmons aggressively pursued her in 1994 when she was working the front desk at a Miami hotel where Ratner and Simmons were staying while the former was filming a music video.\n\nReid said both men called the front desk repeatedly asking to speak to her and, at one point, asking her to come upstairs, \"so Brett could hold me down and he could [perform oral sex],” she said, according to the Times.\n\nOne day, Ratner asked her if she'd like to be in his video, so she gave him her phone number, and a couple of days later he stopped by her apartment, a few blocks from the hotel. They sat down on her living room sofa and he exposed himself, put her hand on his crotch and asked for oral sex, she alleges.\n\nReid, who was an 18-year-old virgin, asked if they could just kiss but he used his hand to push her head to her groin and she eventually gave in, she said. He left right after and she never heard from him again.\n\nRatner, through Singer, told the Times that he didn't remember Reid or the incident and Simmons, in his own statement, said he didn't recall the phone conversation with Reid when she was working the front desk. After telling two people about her experience, Reid packed up and moved home, giving up her dream of becoming a model.\n\nModel and actress Jaymee Ong, whose credits include the TV shows Entourage and Las Vegas, said she was invited to a Halloween party at Ratner's house after she met him in 2001 but when she and two friends arrived, there were no other partygoers.\n\nRatner asked Ong to come to his bedroom and once they got there, he locked the door and began groping her, despite her protests, she said.\n\n“I was saying, ‘No, stop, I don’t want to,’” she said. “And he took his pants off and he was trying to grab my hand and put it on him [saying], ‘Just touch it, just touch it, come on.’”\n\nWhen she refused, Ratner masturbated and ejaculated. Ong left and immediately recounted the experience to her friends.\n\nArguably the most high-profile woman in the latest batch of Ratner accusers is actress Sarah Shahi, who has starred on the TV shows Life and Person of Interest.\n\nShahi said that on the set of Rush Hour 3, Ratner, who directed the film, on multiple occasions approached her from behind, thrust his groin against her and made graphic sexual comments. She tried to shun his advances.\n\n\"Each time, I'd get really loud and say, 'Why are your hands on me? Don't you need to go set up a shot?'\" Shahi told the Times. The actress told casting director Michelle Lewitt Kehl about the experience shortly after it occurred, with Kehl confirming Shahi's account, and Shahi claims other actors, including star Jackie Chan, witnessed the encounters. Chan did not respond to the Times' requests for comment.\n\nProducer Shelly Clippard also told the Times that Ratner made sexually explicit comments to her on a transatlantic flight in 2004.\n\nRatner, who has long had a playboy image, has directed and produced numerous movies. His directing credits include all three Rush Hour films, the Dwayne Johnson-starrer Hercules, X-Men: The Last Stand, Tower Heist and a plethora of music videos for Mariah Carey and Jessica Simpson. He produced both Horrible Bosses films and Rules Don't Apply and executive produced the Jersey Boys film, Black Mass, The Revenant, War Dogs and The Lego Ninjago Movie. On the TV front, Ratner served as an executive producer on the Rush Hour series and Prison Break.\n\nOn Sunday, Terry Crews, who has publicly claimed that now-suspended WME agent Adam Venit sexually assaulted him, tweeted a photo of an email that Simmons sent him about his own claim against Venit. In the email, sent Nov. 3, Simmons writes, \"Did he ever apologize Give the agent a pass ask that he be reinstated.\" Crews tagged Simmons' Twitter handle and, in all caps, wrote, \"No one gets a pass.\"\n\nMessage Russell Simmons sent to me regarding my sexual assault case against Adam Venit of @WME:\n\n\n\nDear @UncleRUSH——\n\nNO ONE GETS A PASS pic.twitter.com/DmEvqWVxkc — terrycrews (@terrycrews) November 19, 2017\n\nSimmons has his All Def Comedy stand-up series coming up on HBO starting Dec. 1 and the network still plans to air the six episodes as planned. \"The show is a platform for promising new artists and we want them to have the opportunity to showcase their talent to a national audience,\" said HBO in a statement on Tuesday.\n\nSimmons' full statement, obtained by THR, follows.\n\nAs a long-time social activist, I have applauded the strength of the brave men and women who have spoken out over the past month and made their voices heard regarding sexual assault and harassment. I am a supporter of the #MeToo campaign and the victims who were previously terrified to stand up and speak out against sexual misconduct. I completely and unequivocally deny the horrendous allegations of non-consensual sex against me with every fiber of my being.\n\n\n\nI know Keri Claussen Khalighi and remember the weekend in 1991 that she has referenced. Everything that happened between us 26 years ago was completely consensual and with Keri’s full participation. We spent time in my apartment over a period of two days and one night, as well as at some public places including Nell's Nightclub. Much of the time we were in the presence of other acquaintances. I'm deeply saddened and truly shocked to learn of Keri's assertions as to what happened over the course of that weekend.\n\n\n\nLet me be crystal clear and very direct. Abusing women in any way shape or form violates the very core of my being. I have always spoken out regarding my life experiences, women's issues and the need to bring a faster and more decisive shift in the collective consciousness that will help bring about true women's equality. More than anything, I want my daughters to live in a more equal world and a world where they will not become victims of sexual harassment.\n\n\n\nThe LA Times article also references an allegation by Ms. Tanya Reid. I mean no disrespect to her at all when I say I honestly do not recall my telephone conversation with a hotel front desk clerk from over a quarter-century ago.\n\nNov. 21, 10 a.m. Updated with HBO statement on Simmons' All Def Comedy.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2016/02/russellsimmons2015.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2016/02/russellsimmons2015.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2016/02/russellsimmons2015.jpg", "keywords": [], "authors": ["Hilary Lewis", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/russell-simmons-brett-ratner-accused-teaming-up-engage-sexual-misconduct-1059839", "title": "Russell Simmons and Brett Ratner Accused of Teaming Up to Engage in Sexual Misconduct", "meta_data": {"viewport": "width=device-width", "description": "The L.A. Times reveals new allegations of sexual harassment and assault against the producer-director and music mogul, who are longtime friends.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/russell-simmons-brett-ratner-accused-teaming-up-engage-sexual-misconduct-1059839", "domain": "https://www.hollywoodreporter.com/", "title": "Russell Simmons and Brett Ratner Accused of Teaming Up to Engage in Sexual Misconduct", "description": "The L.A. Times reveals new allegations of sexual harassment and assault against the producer-director and music mogul, who are longtime friends.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2016/02/russellsimmons2015.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Russell Simmons and Brett Ratner Accused of Teaming Up to Engage in Sexual Misconduct", "description": "The L.A. Times reveals new allegations of sexual harassment and assault against the producer-director and music mogul, who are longtime friends.", "url": "https://www.hollywoodreporter.com/news/russell-simmons-brett-ratner-accused-teaming-up-engage-sexual-misconduct-1059839", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2016/02/russellsimmons2015.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Russell Simmons and Brett Ratner Accused of Teaming Up to Engage in Sexual Misconduct", "sailthru.description": "The L.A. Times reveals new allegations of sexual harassment and assault against the producer-director and music mogul, who are longtime friends.", "sailthru.author": "Hilary Lewis", "sailthru.vertical": "Movies", "sailthru.date": "2017-11-19 09:19:18", "sailthru.tags": "Movies,Music,Brett Ratner,Russell Simmons,Sarah Shahi,Harassment in Hollywood,nsfs"}, "movies": [], "publish_date": 1511054358.0, "source": "https://www.hollywoodreporter.com", "summary": ""}