{"url": "https://metro.co.uk/2018/10/10/when-is-pippa-middleton-due-to-give-birth-to-first-child-with-james-matthews-8024431/", "text": "Pippa Middleton is sporting a big baby bump – but when is she due? (Picture: Backgrid)\n\nPippa Middleton is due to give birth to her and husband James Matthews’ first child together.\n\nThe younger sister of Kate Middleton, Duchess of Cambridge, has been spotted out and about in London on a number of occasions lately, sporting her large baby bump.\n\nPippa and James’ baby will not only have James’ brother Spencer Matthews and his wife Vogue Williams’ son Theodore Fredrick Michael as a cousin, but the unborn child will also have Prince George, Princess Charlotte and Prince Louis as cousins.\n\nThe new arrival will also be the first niece or nephew for both William and Kate, as neither William’s brother Prince Harry or Kate’s brother James Middleton have children.\n\nPippa Middleton is seen leaving a private members’ gym in Kensington in London this week (Picture: BACKGRID)\n\nThe heavily-pregnant sister of Kate Middleton will be giving Prince George, Princess Charlotte and Prince Louis their first cousin (Picture: BACKGRID)\n\nPippa confirmed she is pregnant with her first in June, ending months of speculation, revealing the happy news in her Waitrose magazine column.\n\nAdvertisement\n\nAdvertisement\n\nOpening up about the first three months of her pregnancy, she admitted she’d not suffered the same bad morning sickness her sister had with Prince George, Princess Charlotte and Prince Louis.\n\n‘I was lucky to pass the 12 week scan without suffering from morning sickness,’ she wrote.\n\nPippa Middleton and James Matthews smile after their wedding at St Mark’s Church in Englefield, England Saturday, May 20, 2017 (Picture: PA)\n\nPippa Middleton, centre and James Matthews smile, after their wedding at St Mark’s Church in Englefield with Kate, Duchess of Cambridge, beside them (Picture: PA)\n\n‘That meant I was able to carry on as normal. This being my first pregnancy, I had so many questions I felt were still unanswered.’\n\nPippa also admitted she has had to tone down her exercise regime since falling pregnant too.\n\nShe added: ‘I’ve noticed my body change and weight increase – but through effective exercise and sports I feel that it’s being strengthened to support a healthy pregnancy, birth and recovery.’\n\nIt was first reported that Pippa was expecting her first child in April, with reports at the time claiming she’d had her three-month scan that month and started telling friends and family.\n\nWith that in mind, it would mean she is due this month, so she could go into labour any day now.\n\nWriting in her Waitrose Kitchen magazine column, Pippa revealed she has turned to meditation to help her mental well-being in her final stages of pregnancy.\n\nJames Matthews and Pippa Middleton seen arriving at Wimbledon for Men’s Semi Final Day on July 12, 2018 in London, England. (Picture: Neil Mockford/GC Images)\n\nPippa and James are preparing to become parents (Picture: David M Benett/Dave Benett/Getty Images)\n\nShe wrote: ‘As the final month nears and the bump grows prouder each day, movement is certainly getting more awkward.\n\nAdvertisement\n\nAdvertisement\n\n‘The transformations to my body that are taking place as it prepares for childbirth have meant that the sound sleeps and the baby bubble effect have gone. Reality is finally kicking in.’\n\nDescribing her meditation practice, she added: ‘I was skeptical at first, but after practicing this discipline for the past month I have noticed a huge difference in my mental wellbeing and sense of clarity.\n\n‘I signed up to a beginners’ meditation class recently to master the tools essential for performing it effectively.\n\n‘This involved learning to meditate twice daily, ideally for 20 minutes, chanting a mantra, while sitting upright, eyes closed and focused. Our teacher stressed that we should ensure we always make time for this because there’s always an excuse not to.\n\n‘It’s a good idea to take some well-being time for mummy-to-be now and, most importantly, for the future.’\n\nKate ‘could not have been more delighted’, The Sun On Sunday had reported at the time of the news first emerging.\n\nKate and William were said to be ‘delighted’ by the news (Picture: Getty)\n\nKate gave birth to her and Prince William’s third child, Prince Louis, on 23 April this year. They already have Prince George, five, and Princess Charlotte, three.\n\nJust like Kate, Pippa is reportedly planning on giving birth in the Lindo Wing of St. Mary’s Hospital when the time comes.\n\nPippa and James are no doubt ready and waiting to become parents now, having enjoyed an idyllic babymoon – the last holiday parents go on before their baby arrives – in Tuscany, Italy.\n\nThe pair are understood to have stayed at the five-star Il Pellicano Hotel, which is in the Porto Ercole cove.\n\nAdvertisement\n\nThe happy couple’s news came weeks after former Made In Chelsea star Spencer Matthews, 30, and his 32-year-old wife, model Vogue Williams, confirmed they were expecting their first child.\n\nSpencer and Vogue will be Pippa and James’ baby’s Uncle and Aunt (Picture: Vogue Williams/Instagram)\n\nSpencer and Vogue married in June this year, revealing wedding photos of their special day, which was an intimate ceremony in front of close friends and family in Matthews’ family’s Glen Affric estate in Scotland, this week.\n\nThey welcomed their first child on Wednesday 5 September, confirming the news on their social media pages.\n\nSpencer shared a photo of his hand and their baby son’s hand, writing: ‘This morning at 3:55am, we welcomed our son into a quiet London hospital… He is beautiful and healthy. We feel truly blessed. Couldn’t be more proud of @voguewilliams ❤️.’\n\nVogue shared a similar photo of her hand with their baby’s, captioning it: ‘This morning at 3:55am, we welcomed our son into a quiet London hospital… He is beautiful and healthy. We feel truly blessed ?.’\n\nSpencer and Vogue’s son will be cousins with Pippa and James’ child.\n\nMORE: Why Pippa Middleton will inherit the title of Lady despite not being in the Royal Family like sister Kate Middleton\n\nMORE: Spencer Matthews flashes wedding ring proving he’s well and truly off the market", "images": ["https://d17fy28x8ov4h8.cloudfront.net/190x/images/a/ASOSLogo_9.png", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/g/groupon_9.png", "https://i2.wp.com/metro.co.uk/wp-content/uploads/2018/09/sec_32038392-9421.jpg?quality=90&strip=all&zoom=1&resize=644%2C337&ssl=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/a/AO_9.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png", "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e15349319449876.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6034964&cv=2.0&cj=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/n/nord_logo_square_1x_9.png", "https://d17fy28x8ov4h8.cloudfront.net/210x/images/a/adidas_logo_BD1_9.png"], "top_img": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e15349319449876.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "keywords": [], "authors": ["Amy Duncan"], "canonical_link": "https://metro.co.uk/2018/10/10/when-is-pippa-middleton-due-to-give-birth-to-first-child-with-james-matthews-8024431/", "title": "When is Pippa Middleton's baby due as she prepares to give birth?", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "robots": "max-image-preview:large", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e1534931944987.jpg?quality=90&strip=all&crop=0px%2C9px%2C1567px%2C823px&resize=1200%2C630"}, "title": "When is Pippa Middleton due to give birth to first child?", "description": "Pippa Middleton and James Matthews' baby will be Kate and William's first niece or nephew.", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Pippa Middleton is due to give birth to her and husband James Matthews' first child together. The younger sister of Kate Middleton, Duchess of Cambridge, has been spotted out and...", "news_keywords": "pippa middleton pregnancy, meghan markle, kate middleton, pippa middleton baby, pippa middleton wedding, spencer matthews, pippa middleton wedding dress, pippa middleton husband, when is pippa middleton due, pippa middleton due date", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "generator": "WordPress 5.4", "fb": {"pages": "117118184990145,427889824264313", "app_id": 176908729004638}, "ia": {"markup_url": "https://metro.co.uk/2018/10/10/when-is-pippa-middleton-due-to-give-birth-to-first-child-with-james-matthews-8024431/?ia_markup=1"}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2018-10-10 12:38:10", "sailthru.title": "When is Pippa Middleton due to give birth to first child with James Matthews?", "sailthru.tags": "kate middleton duchess of cambridge, pippa middleton, prince harry, royal family, social media", "sailthru.description": "Pippa Middleton and James Matthews' baby will be Kate and William's first niece or nephew.", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e1534931944987.jpg?quality=90&strip=all&crop=266px%2C0px%2C989px%2C989px&resize=150%2C150", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e1534931944987.jpg?quality=90&strip=all&crop=266px%2C0px%2C989px%2C989px&resize=150%2C150&w=50", "og": {"locale": "en_GB", "title": "When is Pippa Middleton due to give birth to first child?", "type": "article", "url": "https://metro.co.uk/2018/10/10/when-is-pippa-middleton-due-to-give-birth-to-first-child-with-james-matthews-8024431/", "description": "Pippa Middleton and James Matthews' baby will be Kate and William's first niece or nephew.", "site_name": "Metro", "image": {"identifier": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e15349319449876.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "secure_url": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/08/gettyimages-963062558-e15349319449876.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "News", "tag": "Social Media", "published_time": "2018-10-10T12:38:10+0000", "modified_time": "2019-12-13T09:28:28+0000"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1539100800.0, "source": "https://metro.co.uk", "summary": ""}