{"url": "https://thefrisky.com/how-did-maddox-become-angelina-jolies-aide/", "text": "During the making of the movie Lara Croft: Tomb Raider, Angelina visited Cambodia for the first time. The second time she went there was on a UNHCR field trip. Soon after that, in 2001, Angelina went back to Cambodia, this time with Billy Bob Thornton, who was her husband at the time, and that is when they saw Maddox Jolie-Pitt in an orphanage in Battambang. Soon afterward they started the adoption process. In the spring of 2002, the actress took Maddox, who was only 7 months old, from the orphanage.\n\nAngelina was thinking of adopting a child for a while but didn’t want to take any action before she made sure what did Loung Ung think about the whole situation. She and Loung Ung became friends shortly after the actress came across her memoir First They Killed My Father, and she wanted to know what is Loung’s opinion of her adopting a Cambodian baby.\n\n“I asked her as a Cambodian orphan if she would be offended for somebody like me, an outsider, [to do that], or if that would be a nice thing,” the actress shared with Vanity Fair‘s September issue. ‘’Loung, of course, was thrilled by the proposal.\n\n“Angie was maternal to everybody around her, not just children, but adults included. I wanted her to adopt me. I was orphaned when I was 8 years old, and so I think, when you’ve gone through experiences like that, there’s always a part of you that craves to have full parent figures in your life,” the author said.\n\nIf Loung had said otherwise, Angelina says it “might have changed” her mind. As she was looking around the orphanage, she recalled: “I didn’t feel a connection with any of them. They said, ‘There’s one more baby.’’’ As soon as she locked eyes with Maddox, she remembers ‘’I cried and cried.’’\n\nDuring that time, the actress was a resident in her house in Cambodia. In 2003, Angelina started a project that is now known as the Maddox Jolie-Pitt Foundation, which is concentrating primarily on the Asian country’s environmental conservation, education, health, and infrastructure.\n\nIn the following years, Angelina found Brad Pitt, and together they have had five more children. Besides her acting career, Angelina finds happiness in working as a filmmaker and being a U.N. ambassador.\n\nMaddox, who is now a teenager, is going after his mother. He wanted, with Angelina’s help, to let the whole world know Loung’s story. “He was the one who said, ‘It’s time to do it,'” she shared with the magazine. Maddox put faith in his mother to proceed with historical horror justice, and now its time for Angelina to put the faith in her son to help her during the filming. As soon as Maddox said he will take part in this, it came to her mind that he will be “watching horrors that his countrymen did to each other. [So] he had to be ready.”\n\nPax Jolie-Pitt took part as a still photographer, during which time the rest of the Jolie-Pitt kids were on set every day.\n\nIt was time for Angelina and Loung to start planning the scenario, and Maddox helped them by looking into some of the drafts they made, analyzing them and then giving them his thoughts on how certain aspect of the scenario should develop. The actress gave it to Netflix, and Ted Sarandos, the chief creative officer, fell in love with it immediately. “In the room, she created a visual experience of what this film could be. The film is in many ways about the death of beauty, about the way the Khmer Rouge had killed all things beautiful, the color itself, which becomes part of the joy of life,” Ted said. “That’s what hooked me more than anything.”\n\nAlongside with the Cambodian moviemaker, said that the only way she will proceed with the making of this movie is if the Cambodian residents don’t have a problem with them doing it. “In a country like Cambodia, respect is very much elevated—respect for each other, respect for the culture, respect for the history, respect for the elders,” Loung shared with Vanity Fair. “Angie walks in Cambodia with this respect.” Cambodians gave their support, and the country administered the usage of certain locations and allowed them to use 500 soldiers from its corps.\n\n“It’s not a poetic thing to say—[this film] was made by the country,” told the actress; around 3,500 citizens participated in the movie. “There wasn’t a person who was working on the movie who didn’t have a personal connection. They weren’t coming to do a job. They were walking in the exodus for the people whom they had lost in their family, and it was out of respect for them that they were going to re-create it…It completed something for them.”\n\nWhile in the making of the movie, everybody was looking at Maddox, they all knew who he and his mom were. “It was a way for him to walk in the steps that most likely his birth parents walked,” said Angelina, who didn’t know how Maddox was going to take everything that was happening to him, and around him. She was exceptionally happy when one day Maddox asked for her permission to stay the night in his house with his friends. By ‘his house’ he meant the house Angelina bought back in 2002. “I hadn’t heard him refer to it that way. You can’t push it. You can’t say, ‘Isn’t this great?’ You just have to kind of keep bringing them there, putting it in front of them and hope that they find the pride and find the comfort.”\n\nWhile Maddox was Angelina’s fidus Achates on set, that is not what is happening back home, not since Angelina is going through a custody battle with Brad Pitt. “I do not want my children to be worried about me. I think it’s very important to cry in the shower and not in front of them,” she reveals to Vanity Fair. “They need to know that everything’s going to be all right even when you’re not sure it is.”\n\nEven though her first boy has burdened himself with a lot more things than an average teenage boy has, with taking care of his younger siblings, he doesn’t have that big of a desire to became an adult yet. “I’m conscious that the boys are teenage boys, and maybe they’d rather be watching TV with their friends, and they’ve been to Africa, and they may not be as excited as the little ones,” she commented, regarding their travels. “But they don’t really challenge me. They just kind of sit on the edge of my bed and say, ‘What are we going to do there?'” And she takes them on all these amusing things they could do, for example, sandboarding. ‘’Either way, they know that it’s important, and they know that mom thinks that it’s going to be important when they’re older.”\n\nVia Eonline", "images": ["https://thefrisky.com/wp-content/uploads/2018/10/angelina-jolie-first.jpg", "https://thefrisky.com/wp-content/uploads/2018/10/angelina-jolie.jpg", "https://thefrisky.com/wp-content/themes/soledad/images/penci2-holder.png", "https://thefrisky.com/wp-content/uploads/2018/10/How-did-Maddox-become-Angelina-Jolie’s-aide-scaled.jpg", "https://thefrisky.com/wp-content/uploads/2018/10/angelina-jolie-aide.jpg", "https://thefrisky.com/wp-content/uploads/2018/10/Cool-Profile-Pictures-150x150.jpg", "https://thefrisky.com/wp-content/themes/soledad/images/penci-holder.png", "https://thefrisky.com/wp-content/uploads/2019/12/The-Frisky-Logo.png"], "top_img": "https://thefrisky.com/wp-content/uploads/2018/10/How-did-Maddox-become-Angelina-Jolie’s-aide-scaled.jpg", "keywords": [], "authors": ["Wendy Stokes"], "canonical_link": "https://thefrisky.com/how-did-maddox-become-angelina-jolies-aide/", "title": "How did Maddox become Angelina Jolie’s aide?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "During the making of the movie Lara Croft: Tomb Raider, Angelina visited Cambodia for the first time. The second time she went there was on a UNHCR field trip. Soon after that, in 2001", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "How did Maddox become Angelina Jolie’s aide? - The Frisky", "description": "During the making of the movie Lara Croft: Tomb Raider, Angelina visited Cambodia for the first time. The second time she went there was on a UNHCR field trip. Soon after that, in 2001", "url": "https://thefrisky.com/how-did-maddox-become-angelina-jolies-aide/", "site_name": "The Frisky", "image": {"identifier": "https://thefrisky.com/wp-content/uploads/2018/10/How-did-Maddox-become-Angelina-Jolie’s-aide-scaled.jpg", "secure_url": "https://thefrisky.com/wp-content/uploads/2018/10/How-did-Maddox-become-Angelina-Jolie’s-aide-scaled.jpg", "width": 768, "height": 569}}, "article": {"tag": "Right-Hand Man", "section": "Celebs", "published_time": "2018-10-15T16:16:57+00:00"}, "twitter": {"card": "summary_large_image", "description": "During the making of the movie Lara Croft: Tomb Raider, Angelina visited Cambodia for the first time. The second time she went there was on a UNHCR field trip. Soon after that, in 2001", "title": "How did Maddox become Angelina Jolie’s aide? - The Frisky", "image": "https://thefrisky.com/wp-content/uploads/2018/10/How-did-Maddox-become-Angelina-Jolie’s-aide-scaled.jpg"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1539620217.0, "source": "https://thefrisky.com", "summary": ""}