{"url": "www.cheatsheet.com/health-fitness/crazy-reason-behind-kate-middleton-and-the-queens-royal-feud.html/", "text": "You can’t please everyone when you’ve been a monarch for several decades — not even your own family. So it’s no shock that Queen Elizabeth has had her fair share of tiffs with other members of the royal family during her tenure wearing the crown. Still, a feud with daughter-in-law Kate Middleton? That one seems a little difficult to believe. Nevertheless, as most in-law situations go, the two haven’t always been on perfect terms. Here is the crazy reason the queen and the Duchess of Cambridge haven’t always gotten along.\n\nBut for starters, keep this in mind …\n\nIs there really drama behind the smiles? | Chris Jackson/Getty Images Is there really drama behind the smiles? | Chris Jackson/Getty Images\n\nThe tabloids go into a frenzy over any rumor that the royals are fighting with each other. Heck, they’re already trying to claim that Meghan Markle and Camilla Parker-Bowles are at odds — and Meghan hasn’t even married into the family yet! So, like with all reports of bickering, a feud between Her Majesty and Duchess Catherine could be a lot of hot air.\n\nNext: All that being said …\n\nThe Duchess has had her fair share of feuds\n\nKate and Beatrice don’t get along. | Chris Jackson/Getty Images Kate and Beatrice don’t get along. | Chris Jackson/Getty Images\n\nIt has been documented, however, that Duchess Catherine hasn’t always gotten along with her in-laws in the past. Plenty of reports have surfaced claiming that Kate and Camilla were at odds because Camilla tried to keep her from marrying Prince William. And it has never been a secret that Kate doesn’t get along with her cousin-in-law, Princess Beatrice.\n\nNext: And what about HRH?\n\nThe queen’s most notorious feuds?\n\nPrincess Margaret and Queen Elizabeth haven’t always gotten along. | Fox Photos/Getty Images Princess Margaret and Queen Elizabeth haven’t always gotten along. | Fox Photos/Getty Images\n\nRumors of royal feuds with Queen Elizabeth go back for years. There was bickering with her sister, Princess Margaret when the queen refused her sister’s proposal to marry a divorced man. Then there was the years-long feud she had with Princess Diana. She even reportedly fought with Prince Charles when he needed support after Princess Diana’s death and was met with a cold shoulder.\n\nNext: When did the alleged beef with Kate start?\n\nThe first of the rumors\n\nWas the queen feuding with Kate before her wedding? | Dave Thompson/AFP/Getty Images Was the queen feuding with Kate before her wedding? | Dave Thompson/AFP/Getty Images\n\nAgain, much of this is hearsay. But rumors of a royal feud between Queen Elizabeth and her granddaughter-in-law started around the time of the royal wedding in 2011. There were claims that the queen didn’t like all the attention that Kate was getting, or how much money she spent on fancy clothes. Over the years, the two women have spent more time together because the duchess has taken on more royal duties — especially since Prince Phillip retired. It’s more likely that the two are just spending a lot of time together, and not necessarily arguing all the time.\n\nNext: What the rags are saying now.\n\nLatest feud news?\n\nWilliam and Kate are expecting their third child. | William and Kate are expecting their third child. | Kensington Palace via Instagram\n\nThe latest of the “feud news” came in October of 2017, shortly after it was revealed that the Duke and Duchess of Cambridge were expecting their third child. Kate had to take a step back from her public duties because of severe sickness from her pregnancy and reportedly wants to maintain a more private role after the child is born. This decision to step away from royal duties reportedly didn’t sit well with the queen.\n\nNext: While this is mostly a rumor …\n\nWhy this could be true\n\nKate has taken on a high-profile role in recent years. | Paul Edwards-WPA Pool/Getty Images Kate has taken on a high-profile role in recent years. | Paul Edwards-WPA Pool/Getty Images\n\nVarious publications have tried to dispel this rumored feud. However, there could potentially be some truth to it. As previously mentioned, Kate Middleton has taken on a lot of royal responsibilities since becoming a royal, and she accepted more duties over recent years. The decision to step back from her responsibilities could have potentially rubbed Her Majesty the wrong way.\n\nNext: Something to consider if the feud is for real.\n\nWould this affect the succession line?\n\nCould this feud make Charles king? | Chris Jackson/Getty Images Could this feud make Charles king? | Chris Jackson/Getty Images\n\nThere is a lot of speculation as to whether Queen Elizabeth will abdicate the throne this year — and who will succeed in her place. Although rules stipulate that the crown would without a doubt be passed to Prince Charles, there is still speculation as to whether the family will make room for Prince William to be king. If this is the case, would that cause tension within the family if the king’s wife has taken on a lesser role? With most this feuding being rumored, it’s still difficult to say.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/01/Kate-William-Marriage-Rings.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Princess-Margaret-and-Queen-Elizabeth.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Princess-Beatrie.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-865758798.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-138950117.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/royal-family-christmas-card-2015.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg", "keywords": [], "authors": ["Chelena Goldman"], "canonical_link": "https://www.cheatsheet.com/health-fitness/crazy-reason-behind-kate-middleton-and-the-queens-royal-feud.html/", "title": "The Crazy Reason Behind Kate Middleton and the Queen’s Royal Feud", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/crazy-reason-behind-kate-middleton-and-the-queens-royal-feud.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Did you know that Queen Elizabeth and Kate Middleton haven't always gotten along? The crazy reason behind their mysterious feud.", "og": {"locale": "en_US", "type": "article", "title": "The Crazy Reason Behind Kate Middleton and the Queen’s Royal Feud", "description": "Did you know that Queen Elizabeth and Kate Middleton haven't always gotten along? The crazy reason behind their mysterious feud.", "url": "https://www.cheatsheet.com/health-fitness/crazy-reason-behind-kate-middleton-and-the-queens-royal-feud.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-04T16:20:07-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "royal family", "section": "Health & Fitness", "published_time": "2018-06-04T16:20:00-04:00", "modified_time": "2018-06-04T16:20:07-04:00"}, "twitter": {"card": "summary_large_image", "description": "Did you know that Queen Elizabeth and Kate Middleton haven't always gotten along? The crazy reason behind their mysterious feud.", "title": "The Crazy Reason Behind Kate Middleton and the Queen’s Royal Feud", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528143600.0, "source": "http://www.cheatsheet.com", "summary": ""}