{"url": "screencrush.com/boondock-saints-tv-series-norman-reedus/", "text": "The Boondock Saints moved a few inches (and a few hundred dollars) closer to resurrection with news of a fan-funded Origins TV series, though it seemed questionable stars Norman Reedus or Sean Patrick Flanery would participate. Now, The Boondock Saints: Origins addresses whether the original stars have any involvement, including on a film sequel.\n\nIt was just over a week ago that The Boondock Saints writer-director Troy Duffy launched a fan campaign to fund his new Origins series, aiming for a March 2018 premiere. Reedus and Flanery were also at one time eyed to produce alongside the original 1999 film’s producer Don Carmody. That said, with regard to current participation in either Origins or a third film, a website FAQ now downplays expectations:\n\nSimilar to how the Batman franchise has multiple versions and iterations of the caped crusader, if the 1st and 2nd film were the equivalent of Tim Burton’s version of Batman with Michael Keaton, The Boondock Saints: Origins will be its own stand-alone reboot of the franchise. The Christopher Nolan with Christian Bale version, if you will pardon the analogy. Norman and Sean absolutely will be back for the 3rd film and are aware of this television reboot of the brand. And who knows… maybe they pop by from time to time in the TV Series. Sometimes, good things do come on small(er) screens.\n\nAnother section also clarified that “we are still going to be making the 3rd film for you too, but only after we get the tv series up and running,” while GossipCop reportedly got a bleak assessment from Reedus’ representation:\n\nTroy Duffy put out this video and did not speak or consult with us in advance. We want to make it clear to the fans that Norman is NOT creatively involved or collaborating on this project.\n\nOuch. In any case, you can watch the announcement video and original film trailer for yourself below.", "images": ["http://townsquare.media/site/442/files/2018/04/screencrush-high-rez.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1", "https://townsquare.media/site/442/files/2017/05/boondock-origins-reedus-pic.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"], "top_img": "https://townsquare.media/site/442/files/2017/05/boondock-origins-reedus-pic.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Kevin Fitzpatrick"], "canonical_link": "https://screencrush.com/boondock-saints-tv-series-norman-reedus/", "title": "'Boondock Saints' TV Series on Norman Reedus Appearance", "meta_data": {"description": "The proposed 'Boondock Saints: Origins' TV series reveals whether Norman Reedus and Sean Patrick Flanery might participate, including on a film sequel.", "keywords": "boondock saints origins, boondock saints tv series, boondock saints origins norman reedus, boondock saints tv series norman reedus, boondock saints 3 update", "fb": {"app_id": 234630989968140, "admins": 100002025987268, "pages": 335338213173624}, "og": {"title": "'Boondock Saints' TV Series on Norman Reedus Appearance", "description": "The proposed 'Boondock Saints: Origins' TV series reveals whether Norman Reedus and Sean Patrick Flanery might participate, including on a film sequel.", "url": "https://screencrush.com/boondock-saints-tv-series-norman-reedus/", "site_name": "ScreenCrush", "type": "article", "image": "https://townsquare.media/site/442/files/2017/05/boondock-origins-reedus-pic.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@screencrushnews"}, "sailthru.description": "The proposed 'Boondock Saints: Origins' TV series reveals whether Norman Reedus and Sean Patrick Flanery might participate, including on a film sequel.", "sailthru.date": "2017-05-05 17:20:19", "sailthru.title": "‘Boondock Saints’ TV Series Addresses Potential Norman Reedus Role", "sailthru.tags": "tsmsite-screencrush, tsmmarket-national, tsmtype-national, norman-reedus, the-boondock-saints, troy-duffy, tv-news", "sailthru.author": "kevinfitzpatrick", "sailthru.image.full": "https://townsquare.media/site/442/files/2017/05/boondock-origins-reedus-pic.jpg", "sailthru.image.thumb": "https://townsquare.media/site/442/files/2017/05/boondock-origins-reedus-pic.jpg", "google-site-verification": "ZkT5x9myPNlJvv3U8MJxIJGMwC4o_kkVGLWSPtMAwEY", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1493976019.0, "source": "http://screencrush.com", "summary": ""}