{"url": "https://www.cheatsheet.com/entertainment/heres-why-fans-turned-on-katy-perry.html/", "text": "Katy Perry is undeniably one of the most famous women in the world. She’s built a successful career as a singer, actress, TV judge, and spokeswoman. But, like any other celebrity, she’s also weathered her fair share of controversies. And some fans’ feelings for Perry have turned from hot to cold as a result of all her tabloid ups and downs.\n\nHere are all the reasons fans have tuned Perry out, including the mean dig she took at another pop princess (who isn’t Taylor Swift) (page 7).\n\n7. Perry kissed a boy (did he like it?)\n\nThis wasn’t exactly appropriate behavior. | This wasn’t exactly appropriate behavior. | American Idol via YouTube\n\nABC knew what it was doing when it signed Perry on as a judge for its American Idol reboot. After all, she’s good at generating headlines, good or bad, and shows like AI live or die on their buzz. They probably weren’t expecting the singer to be accused of sexual harassment before the series even went to live shows.\n\nBut after she kissed 19-year-old contestant Benjamin Glaze, she faced considerable backlash for her behavior. Glaze told The New York Times he wasn’t exactly thrilled that Perry kissed him. But he also made it clear, in an interview with the Washington Post, that he didn’t feel as though Perry harassed him.\n\nBut some fans were turned off by Perry’s aggressive behavior toward him and the other contestants she’s flirted with — especially given the current national conversation about sexual harassment.\n\nNext: Perry’s attempt at getting deep felt pretty shallow for some fans.\n\n6. (Not so) purposeful pop\n\nSometimes it seems like her performances are more about the gimmick than the message. | John Gurzinski/Getty Images Sometimes it seems like her performances are more about the gimmick than the message. | John Gurzinski/Getty Images\n\nFor a while, it seemed like Perry was incapable of writing a song that wasn’t a hit. But in 2017, she released her new album, Witness. And with it, ushered in an era of what she called, to the annoyance of many, “purposeful pop.”\n\nFans may have bought the album. But they didn’t buy the message: Perry faced considerable backlash for over-selling the purpose of her new music. As Vox explained,\n\nThis disconnect between Perry’s perception of her career and album — or at least how she chose to hype them — and those of fans and critics seems to be at the root of the Perry backlash. Katy Perry proclaimed herself a warrior for political change and purposeful social action, but then didn’t deliver on that.\n\nIn other words, Perry talked a big game about making her music matter but did very little to actually create anything meaningful.\n\nNext: Her attempts to up her hip factor backfired.\n\n5. Perry lost her cool (and some fans in the process)\n\nPerry can definitely appear as though she’s trying too hard. | Mark Metcalfe/Getty Images Perry can definitely appear as though she’s trying too hard. | Mark Metcalfe/Getty Images\n\nPart of what made fans so skeptical about Perry’s foray into “purposeful” pop was the content of her songs on Witness. But they also took issue when her attempts to play it cool wound up making her look tacky.\n\nIn May 2017, she performed “Bon Appetit” with Migos on Saturday Night Live. From her awkward dance moves to her obvious attempts to attract hip hop fans, the performance was across-the-board cringeworthy.\n\nIt was just one example of Perry trying a bit too hard to win people over. And for some fans, it was the last straw.\n\nNext: Perry’s longtime feud with a rival is too much for some fans.\n\n4. Swift vs. Perry\n\nIt’s the feud that never ends. | Larry Busacca/Getty Images It’s the feud that never ends. | Larry Busacca/Getty Images\n\nPerry isn’t the first musician to feud with a fellow songstress, and she won’t be the last. But the drawn-out cattiness of her longtime fight with Taylor Swift has left many fans with a bad taste in their mouth.\n\nFor some, it’s Perry’s behavior in the whole ordeal. From allegedly convincing Swift’s backup dancers to join her crew or shading Swift any chance she gets online, Perry hasn’t appeared particularly mature as events have unfolded.\n\nFor others, it’s just the fact that such a big deal has been made about the antagonistic relationship between the two pop stars. But for her part, Perry definitely hasn’t done much to quiet speculation about their falling out.\n\nNext: Some accuse Perry of profiting off of the drama.\n\n3. Perry vs. Swift\n\nSwift parodied Perry in this video from her latest album, so now it’s Perry’s turn. | Swift parodied Perry in this video from her latest album, so now it’s Perry’s turn. | TaylorSwiftVEVO via YouTube\n\nFans were already tired of Perry and Swift’s seemingly never-ending battle of passive-aggressive callouts. So some were ready to throw in the towel when Perry released “Swish Swish” in 2017. It included obvious allusions to her tiff with Swift, and some found it to be in poor taste.\n\nOf course, some could argue Swift started the battle of the diss tracks when she released “Bad Blood” in 2014. But there’s something to be said for taking the high road.\n\nNext: Perry lost fans when she made this tone-deaf fashion statement.\n\n2. Her appreciation of other cultures is problematic\n\nHer 2013 American Music Awards costume caused an uproar. | Kevin Winter/Getty Images Her 2013 American Music Awards costume caused an uproar. | Kevin Winter/Getty Images\n\nPerry has found herself in hot water more than once due to her tendency toward cultural appropriation. Fans took her to task for dressing as a geisha in 2013 and for wearing her hair in cornrows for her 2014 music video, “This is How We Do.”\n\nThe singer apologized for both incidents in a 2017 interview. And she admitted that both led her to reconsider how she approaches her public image.\n\nSome fans commended her ability to admit her mistakes and work to do better. But others found her apology empty.\n\nNext: Swift isn’t the only celebrity that Perry has shaded.\n\n1. Perry has a history of putting her foot in her mouth\n\nShe might need a new publicist. | Kevork Djansezian/Getty Images She might need a new publicist. | Kevork Djansezian/Getty Images\n\nNo celebrity is ever going to say the right thing all the time. But Perry’s history of saying the exact wrong thing, time and again, has definitely made an impact on her public image.\n\nShe’s joked about Britney Spears’ mental health. She’s made racially insensitive comments about Barack Obama. And, despite her vocal support for the LGBTQ+ community, she’s also made some homophobic moves over the years.\n\nEach of these missteps has earned her some side-eyes. But viewed together, as a symptom of her lack of savvy, they’ve left some fans unable to love the singer unconditionally.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/10/katy-perry-taylor-swift.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/06/KatyPerrypink.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png", "https://www.cheatsheet.com/wp-content/uploads/2017/06/KatyPerryballotdress-1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/katy-Perry-and-Taylor-Swift.png?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2014/11/Katy-Perry.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/06/KatyPerry-1.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png", "keywords": [], "authors": ["Katherine Webb"], "canonical_link": "https://www.cheatsheet.com/entertainment/heres-why-fans-turned-on-katy-perry.html/", "title": "Here’s Why Fans Turned on Katy Perry", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/heres-why-fans-turned-on-katy-perry.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Katy Perry is one of the most popular singers in the world, but from her feud with Taylor Swift to her behavior on American Idol, she's lost some fans.", "og": {"locale": "en_US", "type": "article", "title": "Here's Why Fans Turned on Katy Perry", "description": "Katy Perry is one of the most popular singers in the world, but from her feud with Taylor Swift to her behavior on American Idol, she's lost some fans.", "url": "https://www.cheatsheet.com/entertainment/heres-why-fans-turned-on-katy-perry.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-23T19:39:18-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Katy Perry", "section": "Entertainment", "published_time": "2018-05-23T19:35:00-04:00", "modified_time": "2018-05-23T19:39:18-04:00"}, "twitter": {"card": "summary_large_image", "description": "Katy Perry is one of the most popular singers in the world, but from her feud with Taylor Swift to her behavior on American Idol, she's lost some fans.", "title": "Here's Why Fans Turned on Katy Perry", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/03/Katy-Perry-being-kissed-by-singer.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1527118500.0, "source": "https://www.cheatsheet.com", "summary": ""}