{"url": "https://www.today.com/popculture/stranger-things-mandy-moore-surprises-snubs-emmy-nominations-t113830", "text": "The 69th annual Primetime Emmy Award nominations were announced Thursday morning and, as always, this year's list was filled with a few shocking snubs — and some happy surprises.\n\nNow, like clockwork, it's time to give our unsolicited feedback to the Academy of Television Arts and Sciences on this year's choices. Ready?\n\nFormer \"Gilmore Girls\" co-stars Milo Ventimiglia and Alexis Bledel find their new shows facing off in the best drama category. NBC, Hulu\n\n'This Is Us' and more thrills and surprises\n\n\"This Is Us\" scored big in its debut year with Milo Ventimiglia (Jack) and his TV son Sterling K. Brown (Randall) both nabbing best actor nods, and their co-star Chrissy Metz (Kate) earning a best supporting actress nomination.\n\nSterling K. Brown and Chrissy Metz in a scene from NBC's \"This Is Us.\" The co-stars were both nominated for Emmys. NBC\n\nBut can anyone explain why Metz is considered a supporting actress while Brown, who plays her brother on the show, is a lead?\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha\n\nAlso nominated from the cast: Ron Cephas Jones (William) for supporting actor, which means Brown and both of his TV dads are up for Emmys this year — something the actor had a ball with on Twitter.\n\nMe and my two dads are going to the emmys! Thank you @TelevisionAcad for honoring us all (& my sister! ) #ThisIsUs pic.twitter.com/8ahak1fjqJ — Sterling K Brown (@sterlingkb1) July 13, 2017\n\nThe series itself scored 11 nominations, including one for best drama. One show it faces off against? Hulu's chilling \"The Handmaid's Tale\" starring Alexis Bledel. Call us \"Gilmore Girls\" fanatics (we call ourselves that), but isn't it fun to see Rory and Jess compete in the same category?\n\n\"Saturday Night Live\" scored an impressive 22 nominations, with guest stars Alec Baldwin and Melissa McCarthy earning individual nods. NBC\n\n\"Saturday Night Live\" helped \"Westworld\" lead the nomination pack with 22 nods each. What a joy to see longtime comedy staple \"SNL\" recognized for a gut-bustingly funny season of edgy political satire. The show's A-list guest stars, Alec Baldwin and Melissa McCarthy, both earned their own nominations, too.\n\nNetflix's sci-fi hit \"Stranger Things\" scored 18 nominations including best drama and solo nods for stars Millie Bobby Brown and Shannon Purser, left. Netflix\n\nMore happy surprises: Netflix's \"Stranger Things\" nabbed 18 nominations its debut year, including a best drama nod and solo nominations for talented Millie Bobby Brown (Eleven) for best supporting actress and Shannon Purser (our beloved Barb!) for guest actress.\n\nWow. I am so incredibly honored. Thank you so much. Congratulations to all the other incredible nominees. @TheEmmys — Shannon Purser (@shannonpurser) July 13, 2017\n\nThe late, great Carrie Fisher earned a nod for her guest role on \"Catastrophe,\" and both Samantha Bee's trenchant \"Full Frontal\" and Stephen Colbert's \"The Late Show,\" earned first-time nominations for best variety talk series.\n\nWe were also thrilled to see two zany favorites — Billy Eichner's \"Billy On The Street\" and \"Martha & Snoop’s Potluck Dinner Party\" — nab first-time noms.\n\nNow, the snubs that upset us\n\nFans were shocked to learn \"This Is Us\" star Mandy Moore was shut out of the best actress in a drama category. NBC\n\nAcademy folks, how in the world could you leave out Mandy Moore?! The \"This Is Us\" actress consistently delivered week after week in the show's stellar debut season. While Moore handled the news like a champ, this is, we think, Emmy's most shocking snub.\n\nMore Emmy snubs: Winona Ryder, Lena Dunham and Sarah Jessica Parker. HBO, Netflix\n\nWe were also sad to see the fabulous Sarah Jessica Parker looked over for her terrific work on HBO's freshman comedy \"Divorce.\" Same goes for Winona Ryder, who deserved recognition for her spellbinding performance on \"Stranger Things.\" And no love for Lena Dunham in the final, excellent season of her acclaimed HBO show \"Girls\"?\n\nSpeaking of HBO, not one nomination for \"Game of Thrones\"? Well, chalk that up to a technicality. The beloved HBO dragon drama (and best drama winner for the past two years) was ineligible because of its late start date — a fate that also sidelined \"Orphan Black.\"\n\nFormer co-stars Samira Wiley (\"The Handmaid's Tale\") and Uzo Aduba (\"Orange Is The New Black\") will compete in the best actress in a drama category. Netflix\n\nThe absence of \"Orange Is the New Black\" in the best drama category for the second year in a row is downright criminal. At least fans will get to see Uzo Aduba face off against former co-star Samira Wiley (\"The Handmaid's Tale\") for best dramatic actress.\n\nAnd neither Jimmy Fallon nor Seth Meyers (both on NBC, TODAY's parent company) was given a nod in the best variety talk show category.\n\nStill, the full nomination list has us excited. Who will take home the coveted statue this year? Tune in to the 69th Annual Primetime Emmy Awards with host Stephen Colbert September 17 on CBS to find out.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1200x630_center.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1200x630_center.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.today.com/popculture/stranger-things-mandy-moore-surprises-snubs-emmy-nominations-t113830", "title": "From 'Stranger Things' to Mandy Moore, surprises and snubs from the Emmy nominations", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/popculture/stranger-things-mandy-moore-surprises-snubs-emmy-nominations-t113830", "title": "No love for Mandy Moore? See the surprises and snubs from the Emmy nominations", "description": "It's time to give our unsolicited feedback to the Academy of Television Arts and Sciences on this year's choices.", "image": {"identifier": "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1200x630_center.jpg", "secure_url": "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1024x512_center.jpg", "title": "No love for Mandy Moore? See the surprises and snubs from the Emmy nominations", "description": "It's time to give our unsolicited feedback to the Academy of Television Arts and Sciences on this year's choices.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "It's time to give our unsolicited feedback to the Academy of Television Arts and Sciences on this year's choices.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media4.s-nbcnews.com/j/newscms/2017_28/1228543/emmy-snubs-surprises-mandy-moore_-today-170713-tease_a00eff08362b6a1a053b0d70ab6fa8a4.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1499975340.0, "source": "https://www.today.com", "summary": ""}