{"url": "http://www.motherjones.com/politics/2012/09/secret-video-romney-private-fundraiser", "text": "During a private fundraiser earlier this year, Republican presidential candidate Mitt Romney told a small group of wealthy contributors what he truly thinks of all the voters who support President Barack Obama. He dismissed these Americans as freeloaders who pay no taxes, who don’t assume responsibility for their lives, and who think government should take care of them. Fielding a question from a donor about how he could triumph in November, Romney replied:\n\nThere are 47 percent of the people who will vote for the president no matter what. All right, there are 47 percent who are with him, who are dependent upon government, who believe that they are victims, who believe the government has a responsibility to care for them, who believe that they are entitled to health care, to food, to housing, to you-name-it. That that’s an entitlement. And the government should give it to them. And they will vote for this president no matter what…These are people who pay no income tax.\n\nRomney went on: “[M]y job is is not to worry about those people. I’ll never convince them they should take personal responsibility and care for their lives.”\n\nMother Jones has obtained video of Romney at this intimate fundraiser—where he candidly discussed his campaign strategy and foreign policy ideas in stark terms he does not use in public—and has confirmed its authenticity. To protect the confidential source who provided the video, we have blurred some of the image, and we will not identify the date or location of the event, which occurred after Romney had clinched the Republican presidential nomination. [UPDATE: We can now report that this fundraiser was held at the Boca Raton home of controversial private equity manager Marc Leder on May 17, and we’ve removed the blurring from the video. See the original blurred videos here.]\n\nHere is Romney expressing his disdain for Americans who back the president:\n\nAt the dinner, Romney often stuck to familiar talking points. But there were moments when he went beyond the familiar campaign lines. Describing his family background, he quipped about his father, “Had he been born of Mexican parents, I’d have a better shot of winning this.” Contending that he is a self-made millionaire who earned his own fortune, Romney insisted, “I have inherited nothing.” He remarked, “There is a perception, ‘Oh, we were born with a silver spoon, he never had to earn anything and so forth.’ Frankly, I was born with a silver spoon, which is the greatest gift you can have: which is to get born in America.”\n\nRomney told the contributors that “women are open to supporting me,” but that “we are having a much harder time with Hispanic voters, and if the Hispanic voting bloc becomes as committed to the Democrats as the African American voting block has in the past, why, we’re in trouble as a party and, I think, as a nation.” When one attendee asked how this group could help Romney sell himself to others, he answered, “Frankly, what I need you to do is to raise millions of dollars.” He added, “The fact that I’m either tied or close to the president…that’s very interesting.”\n\nAsked why he wouldn’t go full-throttle and assail Obama as corrupt, Romney explained the internal thinking of his campaign and revealed that he and his aides, in response to focus-group studies conducted by his consultants, were hesitant to hammer the president too hard out of fear of alienating independents who voted for Obama in 2008:\n\nWe speak with voters across the country about their perceptions. Those people I told you—the 5 to 6 or 7 percent that we have to bring onto our side—they all voted for Barack Obama four years ago. So, and by the way, when you say to them, “Do you think Barack Obama is a failure?” they overwhelmingly say no. They like him. But when you say, “Are you disappointed that his policies haven’t worked?” they say yes. And because they voted for him, they don’t want to be told that they were wrong, that he’s a bad guy, that he did bad things, that he’s corrupt. Those people that we have to get, they want to believe they did the right thing, but he just wasn’t up to the task. They love the phrase that he’s “over his head.” But if we’re—but we, but you see, you and I, we spend our day with Republicans. We spend our days with people who agree with us. And these people are people who voted for him and don’t agree with us. And so the things that animate us are not the things that animate them. And the best success I have at speaking with those people is saying, you know, the president has been a disappointment. He told you he’d keep unemployment below 8 percent. Hasn’t been below eight percent since. Fifty percent of kids coming out of school can’t get a job. Fifty percent. Fifty percent of the kids in high school in our 50 largest cities won’t graduate from high school. What’re they gonna do? These are the kinds of things that I can say to that audience that they nod their head and say, “Yeah, I think you’re right.” What he’s going to do, by the way, is try and vilify me as someone who’s been successful, or who’s, you know, closed businesses or laid people off, and is an evil bad guy. And that may work.\n\n(Note: Obama did not promise his policies would keep unemployment under 8 percent, and 50 percent of college graduates are not unemployed.)\n\nTo assure the donors that he and his campaign knew what they were doing, Romney boasted about the consultants he had retained, emphasizing that several had worked for Israeli Prime Minister Benjamin Netanyahu:\n\nI have a very good team of extraordinarily experienced, highly successful consultants, a couple of people in particular who have done races around the world. I didn’t realize it. These guys in the US—the Karl Rove equivalents—they do races all over the world: in Armenia, in Africa, in Israel. I mean, they work for Bibi Netanyahu in his race. So they do these races and they see which ads work, and which processes work best, and we have ideas about what we do over the course of the campaign. I’d tell them to you, but I’d have to shoot you.\n\nWhen one donor said he was disappointed that Romney wasn’t attacking Obama with sufficient intellectual firepower, Romney groused that the campaign trail was no place for high-minded and detail-oriented arguments:\n\nWell, I wrote a book that lays out my view for what has to happen in the country, and people who are fascinated by policy will read the book. We have a website that lays out white papers on a whole series of issues that I care about. I have to tell you, I don’t think this will have a significant impact on my electability. I wish it did. I think our ads will have a much bigger impact. I think the debates will have a big impact…My dad used to say, “Being right early is not good in politics.” And in a setting like this, a highly intellectual subject—discussion on a whole series of important topics typically doesn’t win elections. And there are, there are, there are—for instance, this president won because of “hope and change.”\n\nRomney, who spoke confidently throughout the event and seemed quite at ease with the well-heeled group, insisted that his election in and of itself would lead to economic growth and that the markets would react favorably if his chances seemed good in the fall:\n\nThey’ll probably be looking at what the polls are saying. If it looks like I’m going to win, the markets will be happy. If it looks like the president’s going to win, the markets should not be terribly happy. It depends of course which markets you’re talking about, which types of commodities and so forth, but my own view is that if we win on November 6th, there will be a great deal of optimism about the future of this country. We’ll see capital come back and we’ll see—without actually doing anything—we’ll actually get a boost in the economy. If the president gets reelected, I don’t know what will happen. I can—I can never predict what the markets will do. Sometimes it does the exact opposite of what I would have expected. But my own view is that if we get a “Taxageddon,” as they call it, January 1st, with this president, and with a Congress that can’t work together, it’s—it really is frightening.\n\nAdvertise on MotherJones.com\n\nAt the dinner, Romney also said that the campaign purposefully was using Ann Romney “sparingly…so that people don’t get tired of her.” And he noted that he had turned down an invitation from Saturday Night Live because such an appearance “has the potential of looking slapstick and not presidential.”\n\nHere was Romney raw and unplugged—sort of unscripted. With this crowd of fellow millionaires, he apparently felt free to utter what he really believes and would never dare say out in the open. He displayed a high degree of disgust for nearly half of his fellow citizens, lumping all Obama voters into a mass of shiftless moochers who don’t contribute much, if anything, to society, and he indicated that he viewed the election as a battle between strivers (such as himself and the donors before him) and parasitic free-riders who lack character, fortitude, and initiative. Yet Romney explained to his patrons that he could not speak such harsh words about Obama in public, lest he insult those independent voters who sided with Obama in 2008 and whom he desperately needs in this election. These were sentiments not to be shared with the voters; it was inside information, available only to the select few who had paid for the privilege of experiencing the real Romney.\n\nALSO READ: More from the secret Romney video. (Romney tells his donors he doesn’t believe in a two-state solution for the Israeli-Palestinian conflict, that resolving this conflict is “almost unthinkable,” and that he would merely “kick the ball down the field.”)\n\nVideo production: James West, Adam Serwer, Dana Liebelson, and Erika Eichelberger\n\nResearch assistance: James Carter\n\nThis story originally contained versions of the videos that were blurred out. You can find those videos, in the order they appear in this post, here, here, here, here, and here.", "images": ["https://www.motherjones.com/wp-content/uploads/2020/02/20200128_twitch_2000.png?w=990", "https://www.motherjones.com/wp-content/uploads/2020/04/20200416_5-hands-texture_2000.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/2019/11/MJ_JanFeb2020_rgb300_451.jpg?w=575", "https://www.motherjones.com/wp-content/mu-plugins/vip-helpers/images/vip-powered-light-small.png", "https://www.motherjones.com/wp-content/uploads/2020/04/GettyImages-177019536_CROPPED.jpg?w=990", "http://www.motherjones.com/wp-content/themes/motherjones/img/the-mother-jones-podcast-logo-615-615.png?w=200", "https://www.motherjones.com/wp-content/uploads/mitt_handshake_0.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/2020/04/detroit-bus-covid-041620.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/full-video-part-2_still.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/new-master.jpg?w=1200&h=630&crop=1", "https://www.motherjones.com/wp-content/uploads/2020/04/AP_20107658942465-1.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/2020/01/mojocover_ma20_2400x3150.jpg?w=575", "https://www.motherjones.com/wp-content/uploads/2020/04/GettyImages-147079739.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/2019/09/mojocover_nd19_2400x3150.jpg?w=575", "https://www.motherjones.com/wp-content/uploads/2020/04/GettyImages-1219237832-1.jpg?w=807", "https://www.motherjones.com/wp-content/uploads/koch_bros_composite2.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/romney-marc-leder425.jpg?w=990", "https://www.motherjones.com/wp-content/themes/motherjones/img/topic-banners/dark-money-642-60.png", "https://www.motherjones.com/wp-content/uploads/2020/04/caputo-house-testimony.jpg?w=990", "https://www.motherjones.com/wp-content/uploads/2017/06/corndavid-web.jpg?w=60"], "top_img": "https://www.motherjones.com/wp-content/uploads/new-master.jpg?w=1200&h=630&crop=1", "keywords": [], "authors": ["David Corn", "Dave Gilson", "Tim Murphy", "Brad Friedman", "Ali Breland", "Becky Z. Dernbach", "Camille Squires", "Molly Schwartz", "Edwin Rios", "Sinduja Rangarajan"], "canonical_link": "https://www.motherjones.com/politics/2012/09/secret-video-romney-private-fundraiser/", "title": "SECRET VIDEO: Romney Tells Millionaire Donors What He REALLY Thinks of Obama Voters", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "Vszdhhc4evgm_TsXnyu3OflD21DCmCMnElpbSe18Jmg", "generator": "WordPress 5.4", "fb": {"pages": 111917028836008, "admins": "13301307,670317733,1198876232,38509772,106892,2907757,306289,602422192,4101301,513450539"}, "sailthru.date": "2012-09-17 20:00:58", "sailthru.title": "SECRET VIDEO: Romney Tells Millionaire Donors What He REALLY Thinks of Obama Voters", "sailthru.tags": ",Dark Money,Elections,Mitt Romney,Video,Politics,", "sailthru.description": "When he doesn't know a camera's rolling, the GOP candidate shows his disdain for half of America.", "sailthru.image.full": "https://www.motherjones.com/wp-content/uploads/new-master.jpg", "sailthru.image.thumb": "https://www.motherjones.com/wp-content/uploads/new-master.jpg?w=50", "og": {"url": "https://www.motherjones.com/politics/2012/09/secret-video-romney-private-fundraiser/", "type": "article", "title": "SECRET VIDEO: Romney Tells Millionaire Donors What He REALLY Thinks of Obama Voters", "description": "When he doesn't know a camera's rolling, the GOP candidate shows his disdain for half of America.", "image": "https://www.motherjones.com/wp-content/uploads/new-master.jpg?w=1200&h=630&crop=1", "site_name": "Mother Jones"}, "article": {"published": "2012-09-17T20:00:58-04:00", "modified": "2019-07-31T12:23:44-04:00", "section": "Politics", "tag": "Video", "author": "David Corn"}, "twitter": {"url": "https://www.motherjones.com/politics/2012/09/secret-video-romney-private-fundraiser/", "site": "@Motherjones", "card": "summary_large_image", "dnt": "on"}, "wordcount": 1816, "msapplication-TileImage": "https://www.motherjones.com/wp-content/uploads/2017/09/cropped-favicon-512x512.png?w=270"}, "movies": ["https://www.youtube.com/embed/MU9V6eOFO38", "https://www.youtube.com/embed/sjET1LGw5vM", "https://www.youtube.com/embed/X8g3ZqTqKs4", "https://www.youtube.com/embed/LkPBNi7D1hA", "https://www.youtube.com/embed/v5iazS-hjv0"], "publish_date": 1347883258.0, "source": "http://www.motherjones.com", "summary": ""}