{"url": "https://www.hollywoodreporter.com/features/dustin-hoffman-sexually-harassed-me-i-was-17-guest-column-1053466", "text": "The author, who slapped away the star's butt grabs and laughed off his vulgar language on the set of 1985 TV film 'Death of a Salesman,' still feels conflicted: \"I loved the attention. Until I didn't.\"\n\nThis is a story I've told so often I'm sometimes surprised when someone I know hasn't heard it. It begins, \"Dustin Hoffman sexually harassed me when I was 17.\" Then I give the details: When I was a senior in high school in New York City, interning as a production assistant on the set of the Death of a Salesman TV film, he asked me to give him a foot massage my first day on set; I did. He was openly flirtatious, he grabbed my ass, he talked about sex to me and in front of me. One morning I went to his dressing room to take his breakfast order; he looked at me and grinned, taking his time. Then he said, \"I'll have a hard-boiled egg … and a soft-boiled clitoris.\" His entourage burst out laughing. I left, speechless. Then I went to the bathroom and cried.\n\nThe first several times I told this story, I left out the soft-boiled clitoris. When I finally started including it, my voice sometimes broke. But it got easier. When I spoke to a reporter recently and she told me she would have to track down people from the set to verify my account, I felt queasy. What would they say? I could only imagine them shaking their heads: \"She didn't seem too bothered by it then. She sure laughed a lot.\"\n\nThere was so much I loved about being on set — taking John Malkovich's lunch orders and falling more deeply in love every time he spoke to me or said my name; bonding with the crew as we worked 16-hour days; hearing Arthur Miller say my first two names because they sounded like a word game, and that amused him; dancing the polka with Charles Durning, who made every room he entered a happier place. And yes, I loved the attention from Dustin Hoffman. Until I didn't.\n\nDuring my five weeks on set, I detailed my days and mailed dispatches to my sister in London after making copies for myself. Recently, I reread them for the first time in several years.\n\n*Some names have been changed\n\n•••\n\nWEEK ONE\n\nJanuary 21, 1985 During lunch I had to put some chairs in Dustin Hoffman's room. When I went in, he was with Elizabeth* [another production assistant], his daughter Jenna, his stand-in Cassandra (who was giving him a foot massage) and his assistant Frankie.\n\n\"Why don't you join our little party?\"\n\n\"I haven't finished my lunch.\"\n\n\"So go get your lunch.\"\n\nSo I did. Cassandra was rubbing his feet and he said, \"Ah, this goes right to my brain. You know, every time you touch your foot, it goes to a different part of your body. Right now, Cas is at my right kidney.\"\n\nJenna said, \"Good, press harder!\"\n\nWhen Cassandra had gone, he asked me to massage his foot. I said, \"I'm only good at necks.\"\n\nHe said, \"So pretend it's a neck.\"\n\nElizabeth and I were discussing why he is so nice to us. One reason is because he likes girls. Jenna is in eighth grade. Another is probably because he gets tired of all the kissy-assy people.\n\nJanuary 23, 1985 Today, Dustin entertained me, Elizabeth, John Malkovich, Stephen Lang and Arthur Miller with an enlightening discussion on breasts. Needless to say, I felt quite inadequate throughout the whole thing. He said, \"I don't like them when they're tan, because then they look like part of the body.\" Stephen said, \"Which they're not.\" Dustin is a great storyteller.\n\n•••\n\nWEEK TWO\n\nJanuary 28, 1985 Dustin said to me today, \"So, did you have sex over the weekend like I told you?\"\n\n\"No.\"\n\n\"What is this, celibate weekends?\"\n\n\"Next weekend, OK?\"\n\n\"No, I'm talking about last weekend. You sure you didn't?\"\n\n\"Yes.\" I was cracking up.\n\n\"Smile if you're lying.\"\n\nJanuary 31, 1985 Today, I realized some things about this business that scare me. First of all, Dustin's a lech. I'm completely disillusioned. After Tootsie, I thought I wanted to marry him.\n\nElizabeth asked him what he wanted for lunch and he said, \"Your left breast.\"\n\n\"You're disgusting.\"\n\n\"OK, your right breast.\"\n\n\"You pig.\" She walked away.\n\nPam* [office assistant] said, \"If [producer] Bob Colesberry had heard that, she would have been gone in a second.\" I know Dustin would never let that happen, but it's still scary.\n\nToday, when I was walking Dustin to his limo, he felt my ass four times. I hit him each time, hard, and told him he was a dirty old man. He took off his hat and pointed to his head (shaved for the part) and said, \"No, I'm a dirty young man, I have a full head of hair.\" So would Bob have fired me if he'd seen me hit Dustin?\n\nI'll go out in the snow at 10 a.m. to get Kate [Reid] an anchovy pizza, and I'll order lunch from three different places so she can entertain her friends with champagne and caviar, but I'm not going to let Dustin have his hands all over me. And I think it sucks if Bob Colesberry expects me to.\n\nFebruary 4, 1985 Today this business got scarier. Or at least less appealing. This morning when I asked Dustin what he wanted for breakfast, he said something that beat even his lows. It was worse than anything anyone has ever said to me on the street. It was so gross I couldn't say anything. I just turned around and walked out.\n\nThen later I tried to get into a serious conversation with Frankie about why Dustin is like that. I don't know how Dustin knew what we were talking about, but he shouted, \"Anna! Are you badmouthing me? Anna! Get over here, Anna!\" The whole crew was cracking up, and I ducked behind a set.\n\nLater, I was delivering lunches when John, Stephen and Dustin came down the hall and he shouted, \"Anna! So you think I'm a sexist pig, huh? Anna!\" The whole fucking studio heard him. So I told him that I didn't appreciate his wandering hands or his comments. He apologized and said he would stop.\n\nAfter that he was so nice to me I was shocked. We talked about Ironweed (always a good conversation starter — \"So, have you read Ironweed?\"). Between takes he kept passing me bubble gum. Suddenly a piece would come flying out of nowhere, and then I'd see him smiling. When I was walking up the stairs carrying a box of Cokes, he rushed up and grabbed it for me. I guess he felt really bad. He was like he is around his wife — Mr. Paternity.\n\nBut the bad news is Brenda* [my supervisor] said it's too bad it became an issue. Hell, I didn't make it an issue. He did. She said that for the sake of the production we have to sacrifice some of our values and just let it roll over our heads. She said we should try to have a sense of humor and just giggle and slap his hands or something. But that's when I feel the cheapest, like, \"Oh, she really likes it.\"\n\nI laugh at most things because I don't want to appear hard-nosed, but sometimes I just can't. You know? Most of this deference is directly because of my sex. I find that hard to deal with. I hope it's over now. Who knows, maybe Dustin respects me because of what I said.\n\nFebruary 8, 1985 Warren Beatty came to the studio yesterday. I was standing in the best place possible [to watch filming]. So he and Bob Colesberry stood next to me for 45 minutes. He smiled and I introduced myself. He looked good, but a bit gray.\n\nDustin said to me afterward, \"So Anna, I get Warren tonight, you get him Tuesday?\" Today he said, \"You might as well have undressed yourself. You were saying, 'Fuck me, fuck me, Warren.' \"\n\n•••\n\nWEEK FOUR\n\nFebruary 14, 1985 Dustin gave all the girls in the studio a key ring with a little heart that says, \"Love, Willy.\" Of course, I'll flaunt it when I go to school.\n\n•••\n\nWEEK FIVE\n\nFebruary 20, 1985 No one is 100 percent good or bad. Dustin's a pig, but I like him a lot.\n\n•••\n\nI have so many reactions reading these letters and looking at photos from that time. The novel Ironweed as a conversation starter! God bless that glorious, pretentious kid.\n\nMostly though, my heart aches. It aches for the teenager who was so thrilled to join a movie star's party that she gave him a foot rub even though she didn't want to, even though she tried to protest she wasn't good at it. My heart aches for the awkward virgin with the bad hair who had only been kissed three times in her life, laughing as the man her father's age talked about breasts and sex. I want to weep that she found this charming.\n\nI want to hug her for having the guts to tell him to stop, even though her voice shook. Because she was so proud of herself. But I wonder what her reaction would have been if she'd wanted to join the film business — if the internship hadn't been a fun way to get out of classes her last semester of high school? Would she have swallowed her humiliation and ditched her college plans to accept his offer of a job on Ishtar? As it was, this was a lark, and damn if she was going to let a few shitty encounters get in the way of the most exciting experience of her life. She was going to flaunt the keychain he gave her and take pictures with every actor she could get her hands on.\n\nLast, I wish I could tell her: That pressure you're always feeling to lighten up, laugh at things, not be hard-nosed? That's never going to go away. But one day, when you're in your 40s, you're going to realize just how good it feels to finally say \"Fuck you\" to everyone who would have you dampen your anger. Your rage is going to fly, and it's going to feel good.\n\nThe rage does feel good, momentarily. But it's not the whole story, as I knew then. Yes, he was gross. But he could also be sweet and wanted me to like him. Which I did.\n\nWhenever I talk about this, I sense that my listeners want a victim and a villain. And I wish my feelings were as clear as theirs. I would be more comfortable if I felt nothing but revulsion for a man who had power over me and abused it.\n\nBut I still like watching him onscreen. I owned the VHS of Tootsie for a long time and watched it over and over in my 20s and 30s, even as I remembered telling him how disappointed I was, that I expected better of him after that movie. Not long ago I watched All the President's Men for the first time in years and then texted my sister: Is it weird that I find him kind of sexy in this after what he did?\n\nHe wasn't the first to make me think my physical presence was the best I had to offer. My freshman year in high school, there were a couple of older guys I liked who would sandwich me in the hallway between classes, running their hands over my hips and ass, saying, \"We decided it was time to molest Anna.\" I would have rather been the girlfriend of one of them, but if it was a choice between being molested or being ignored, I chose their hands on me.\n\nWhen I was a sophomore, I wanted to take a writing class taught by Frank McCourt, who had not yet published Angela's Ashes but was a celebrity among the students. When I approached him, he put his arm around me and said, \"You are good-looking. I can feast my tired eyes on you.\" I would have rather been my friend whose essay he liked so much he helped her get it published in The New York Times, but I was grateful to get into his class. By the time Dustin Hoffman asked me to give him a foot rub, I'd learned to reconcile mild humiliation with desire for attention or access.\n\nA year and a half after Death of a Salesman, I would meet another, much older married actor who, like Dustin, alternately charmed and repelled me. Unlike Dustin, he was in it for the long game. It took him weeks to kiss the top of my head and eight months to invite me to his apartment to take a nap. People use the term grooming to describe what sexual predators do with children so they can reap the benefits, but what if they groom us so other men can reap the benefits? Did the older guys in high school pave the way for Dustin Hoffman who paved the way for the other actor who paved the way for all the other older men I've known were bad news but whom I've been drawn to anyway? At 49, I understand what Dustin Hoffman did as it fits into the larger pattern of what women experience in Hollywood and everywhere. He was a predator, I was a child, and this was sexual harassment. As to how it fits into my own pattern, I imagine I'll be figuring that out for years to come.\n\nEditor's Note: Contacted by The Hollywood Reporter, Hoffman responded, \"I have the utmost respect for women and feel terrible that anything I might have done could have put her in an uncomfortable situation. I am sorry. It is not reflective of who I am.\"\n\nHunter is an L.A.-based writer. She's currently working on a memoir, Anyone Who Comes Close: A Year of Tinder, Divorce, and Love in the Age of the Internet. Follow her on Twitter @annaghunter and read more of her writing on Medium @annagrahamhunter.\n\nThis story first appeared in the Nov. 1 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.\n\nProducers Stephanie Allain, Krista Vernoff and Sue Naegle discuss harassment in Hollywood:", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/11/hoffman_hunter.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/11/hoffman_hunter.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/11/hoffman_hunter.jpg", "keywords": [], "authors": ["Anna Graham Hunter"], "canonical_link": "https://www.hollywoodreporter.com/features/dustin-hoffman-sexually-harassed-me-i-was-17-guest-column-1053466", "title": "Dustin Hoffman Sexually Harassed Me When I Was 17 (Guest Column)", "meta_data": {"viewport": "width=device-width", "description": "The author, who slapped away the star's butt grabs and laughed off his vulgar language on the set of 1985 TV film 'Death of a Salesman,' still feels conflicted: \"I loved the attention. Until I didn't.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/dustin-hoffman-sexually-harassed-me-i-was-17-guest-column-1053466", "domain": "https://www.hollywoodreporter.com/", "title": "Dustin Hoffman Sexually Harassed Me When I Was 17 (Guest Column)", "description": "The author, who slapped away the star's butt grabs and laughed off his vulgar language on the set of 1985 TV film 'Death of a Salesman,' still feels conflicted: \"I loved the attention. Until I didn't.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/11/hoffman_hunter.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Dustin Hoffman Sexually Harassed Me When I Was 17 (Guest Column)", "description": "The author, who slapped away the star's butt grabs and laughed off his vulgar language on the set of 1985 TV film 'Death of a Salesman,' still feels conflicted: \"I loved the attention. Until I didn't.\"", "url": "https://www.hollywoodreporter.com/features/dustin-hoffman-sexually-harassed-me-i-was-17-guest-column-1053466", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/11/hoffman_hunter.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Dustin Hoffman Sexually Harassed Me When I Was 17 (Guest Column)", "sailthru.description": "The author, who slapped away the star's butt grabs and laughed off his vulgar language on the set of 1985 TV film 'Death of a Salesman,' still feels conflicted: \"I loved the attention. Until I didn't.\"", "sailthru.author": "Anna Graham Hunter", "sailthru.vertical": "Culture", "sailthru.date": "2017-11-01 06:00:00", "sailthru.tags": "Culture,Dustin Hoffman,autoplay,nsfs"}, "movies": [], "publish_date": 1509487200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}