{"url": "plasticsurgerylove.com/plastic-surgery-real-reason-keith-urban-never-gets-old/", "text": "Keith Lionel Urban was born on October 26th, 1967. He is a New Zealand Australian country music singer. He is also a songwriter, musician, record producer, and TV show judge. Keith released his self-titled debut album. The next year (1992) he moved to the United States. Then Urban released his 2nd album titled Golden Road (2002). And in 2005 this album was certified as triple platinum, it means that more than 3 000 000 copies were sold. You may also know Keith Urban as a judge in the twelveth season of American Idol and in the final season along with his wife Nicole Kidman. Since he is one of the hottest singers around, Keith Urban plastic surgery became a common topic to discuss among his fans and haters.\n\nDid Keith Urban undergo plastic surgery after his cocaine addiction?\n\nUrban was suffering from several ups and downs during his early years. It led him to using the cocaine and he became addicted to it.\n\nHe was struggling with the addiction for years since he decided to leave the habit in 1998. He got some treatment in the care center in Nashville.\n\nSo using drugs has effected on Keith’s looks. All of the years of having drug problems including cocaine, ecstasy and alcohol addiction would have done enormous damage to Keith’s skin. He didn’t look young and fresh anymore but now we see that his face totally changed. There were:\n\nlaugh lines and wrinkles around his cheek and jaw area;\n\nvisible lines on his forehead;\n\nheavy eye bags.\n\nDr. Anthony Youn (Detroit plastic surgeon) has told an Australia Magazine that it was obvious Urban had face fillers injected into his cheeks. That’s how he has gotten rounder and fuller look on his contour.\n\nNicole Kidman urging Keith Urban to get plastic surgery?\n\nLife changed for Keith Urban when he met his future wife, Nicole Kidman. He met the American-born Australian actress at the Hollywood event in Los Angeles and they started dating. After a year public learned about them getting married.\n\nAnd now, when they are both 50, according to the gossip magazine, “Nicole wants Keith to try Botox with her to halt wrinkles”. But some close sources say that Keith himself tries to encourage his wife to “embrace their aging”. We don’t know the truth about the situation but this couple does look like wax figures. Just take a look at the picture of them together:\n\nKeith Urban plastic surgery rumours\n\nSome people say that the singer looks too good for a 50 y.o. man, so he is certainly having some kinds of procedures to maintain his young look. To say the truth, it sounds fair that he has undergone a facelift and that is constantly using Botox to get rid off emotional lines and facial wrinkles. Most celebrities use Botox injections in their 40s and 50s. And among the male famous personalities, both facelift and Botox injections are quite common.\n\nIf you need an example, you can read an article about Brad Pitt’s cosmetic and plastic surgeries ⇒ “Brad Pitt before and after plastic surgery”.\n\nCelebrity watchers also believe that Keith Urban’s plastic surgeries include:\n\nProcedure Why would Keith Urban need it? Dental work It’s obvious that singer has gotten the cosmetic dental work. He had terrible teeth before and now his smile is perfect. Nose job (Rhinoplasty) Keith appears to have a slightly crooked nose. It’s been shifted to his right side so singer would probably want to enhance his nose looks. Cheek fillers Keith’s face started to look unhealthy and we could see sunken cheeks. Then his facial features suddenly changed. Jaw implants Again, he may have enhanced the look of his lantern jaws. Eyelid surgery (Blepharoplasty) One of the most noticeable signs of aging is drooping eyelids. Facelift Keith’s skin should be sagging in his 50s and after getting cocaine but his face now looks better than a few years ago. Botox injections Since Keith’s facial wrinkles and lines in the corner of his eyes disappear and come up again once in a while, people believe he is the Botox user.\n\nKeith Urban’s evidential facelift\n\nFacelift mainly tightens the facial skin. Singer’s face doesn’t reflect his age. There is no sagging skin in his 50s. Keith might have also undergone jaw implantation and cheek fillers or implants. But those are invasive procedures so it’s doubtful he would go for it. However, his cheeks look plump and his jaws appear to be more defined. But this can be due to an effect of his new hairstyle or a weight gain.\n\nKeith Urban’s Botox injections\n\nIt’s enough to compare Keith’s recent and latest photos to see that his face looks tight and smooth compared to early pics. His facial wrinkles couldn’t disappear by themselves so that means that emotional lines have been removed by using Botox. In some photos, he looks much younger and his facial skin looks too smooth and flawless for a man who is already 50.\n\nKeith Urban’s admitted dental work\n\nUrban’s dental work includes:\n\nfilling up the gap between his teeth;\n\nveneers (artificial teeth cover);\n\nwhitening of teeth.\n\nSinger doesn’t even need to admit that some work has been done. He got used to having unattractive teeth since he started singing in public. There are tons of pictures of him with the bad looking smile. This is because he has always had some bad teeth problems since he was young. We can clearly see that he didn’t have the straightest set of teeth. The singer had the gap in between his front teeth for a while into his career but his dentist finally fixed it. So that is how he has gotten that perfect smile now.\n\nDid Keith Urban have a nose job?\n\nAs you can see, Keith has the whole package to become famous and loved by the public, so there are no reasons why he would want to change his nose. He got used to having a slightly crooked nose so if he changed anything it would be noticeable. Keith would like to straighten this up but nothing has ever changed.\n\nThe final word about Keith Urban Plastic surgery\n\nThere were some clear signs suggesting that Keith might have some kinds of plastic and/or cosmetic surgeries done throughout his career. He is a country music idol so his fans want him to look perfect. The singer has never admitted making friends with the scalpel. But we should remember a history of substance abuse, so it’s impossible to preserve such a fresh look without getting the help of the plastic surgeon.\n\nKeith Urban is 50 y.o. so if he has really undergone some procedures to maintain his looks, we’ve got to admit that his plastic surgeon is professional and has done a great job. Keith looks better now than 20 years ago and there are no signs of plastic surgery like scars. In some pictures, he looks younger than his wife even though they are the same age!", "images": ["https://plasticsurgerylove.com/wp-content/uploads/2018/02/g_32dc165753e08e2087e74a9eea456595_8_800x600-300x225.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/before-after-300x225.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/botox1-300x158.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/nose-job-1-300x213.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/cheek-fillers-1-300x212.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/keith-urban4.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/teeth-300x147.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/then-and-now1-300x194.jpg", "https://secure.gravatar.com/avatar/6f95da2272a4b1ef0532376bdf154502?s=80&d=mm&r=g", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/then-and-now-1-300x206.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/facelift-1-300x187.jpg", "https://plasticsurgerylove.com/wp-content/uploads/2018/02/botox-6-300x200.jpg"], "top_img": "https://plasticsurgerylove.com/wp-content/uploads/2018/02/keith-urban4.jpg", "keywords": [], "authors": ["View All Posts Amina S.", "Amina S."], "canonical_link": "https://plasticsurgerylove.com/plastic-surgery-real-reason-keith-urban-never-gets-old/", "title": "Keith Urban plastic surgery: facelift, Botox, dental work, possible nose job", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Keith Urban plastic surgery: Did Keith Urban undergo plastic surgery after his cocaine addiction? Nicole Kidman urging Keith Urban to get plastic surgery? Keith Urban plastic surgery rumours: dental work, nose job (rhinoplasty), cheek fillers, jaw implants, eyelid surgery (blepharoplasty), facelift, Botox injections.", "og": {"locale": "en_US", "type": "article", "title": "Keith Urban plastic surgery: facelift, Botox, dental work, possible nose job", "description": "Keith Urban plastic surgery: Did Keith Urban undergo plastic surgery after his cocaine addiction? Nicole Kidman urging Keith Urban to get plastic surgery? Keith Urban plastic surgery rumours: dental work, nose job (rhinoplasty), cheek fillers, jaw implants, eyelid surgery (blepharoplasty), facelift, Botox injections.", "url": "https://plasticsurgerylove.com/plastic-surgery-real-reason-keith-urban-never-gets-old/", "site_name": "Celebrity Plastic Surgery Love", "updated_time": "2018-09-24T15:15:04+00:00", "image": {"identifier": "https://plasticsurgerylove.com/wp-content/uploads/2018/02/keith-urban4.jpg", "secure_url": "https://plasticsurgerylove.com/wp-content/uploads/2018/02/keith-urban4.jpg", "width": 1248, "height": 720, "alt": "Keith Urban plastic surgery"}}, "article": {"tag": "rumours", "section": "Face lifting", "published_time": "2018-02-28T03:58:35+00:00", "modified_time": "2018-09-24T15:15:04+00:00"}, "twitter": {"card": "summary_large_image", "description": "Keith Urban plastic surgery: Did Keith Urban undergo plastic surgery after his cocaine addiction? Nicole Kidman urging Keith Urban to get plastic surgery? Keith Urban plastic surgery rumours: dental work, nose job (rhinoplasty), cheek fillers, jaw implants, eyelid surgery (blepharoplasty), facelift, Botox injections.", "title": "Keith Urban plastic surgery: facelift, Botox, dental work, possible nose job", "image": "https://plasticsurgerylove.com/wp-content/uploads/2018/02/keith-urban4.jpg"}, "generator": "WordPress 4.9.13", "msapplication-TileImage": "https://plasticsurgerylove.com/wp-content/uploads/2018/09/if_38_110995.png"}, "movies": [], "publish_date": 1519790315.0, "source": "http://plasticsurgerylove.com", "summary": ""}