{"url": "en.wikipedia.org/wiki/The_X_Factor_(UK_series_5)", "text": "The X Factor is a British television music competition to find new singing talent. The fifth series was broadcast on ITV from 16 August 2008 until 13 December 2008. Dermot O'Leary returned to present the main show on ITV, while Fearne Cotton was replaced by Holly Willoughby as presenter of spin-off show The Xtra Factor on ITV2. Simon Cowell, Louis Walsh, and Dannii Minogue returned to the judging panel. Sharon Osbourne left after four series and was replaced by Cheryl Cole. The series was won by Alexandra Burke, with Cole emerging as the winning mentor. Auditions in front of producers were held in April and May, with callbacks in front of the judges in June. The number of applicants for series 5 reached an all-time high with a reported 182,000[1] people auditioning. A number of well-established music acts from around the world, such as Beyoncé, Mariah Carey, Britney Spears, Girls Aloud, Take That, Il Divo, and series 3 winner Leona Lewis, performed during the live stages of the show.\n\nBurke's prize, as winner, was a £1 million recording contract with Syco Music (a subsidiary of Sony BMG). Her debut single, \"Hallelujah\", written by Leonard Cohen, was released for digital download on 14 December 2008, with the physical format following on 17 December. It was later announced that her single had become the fastest-selling X Factor single at that time.\n\nIt was during auditions for the fifth series of the show that viewers were introduced to two teenagers: 15-year-old Jade Thirlwall, who in series eight would form one quarter of the winning act that year, Little Mix, and 14-year-old Liam Payne, who would become a member of boy band One Direction, formed in the seventh series.\n\nJudges, presenters and other personnel [ edit ]\n\nIn February 2008, it was reported that Sharon Osbourne would not return as a judge for series 5.[2] On 6 June, six days before filming was due to begin at the London auditions, ITV announced Osbourne's departure from the show.[3][4] Media speculation over the reasons for Osbourne's departure alluded to rising tensions between her and fellow judge Dannii Minogue, as well as disputes over pay.[4] When interviewed by Chris Moyles on BBC Radio 1, Osbourne said that it was \"the best four years of [her] life\" but felt that it was \"time to move on.\"[5]\n\nMuch media coverage and speculation surrounded the question of who would replace Osbourne. Spice Girls singer Mel B said on 16 September 2008 in an interview for New! Magazine that she, among others, was approached by Cowell as a possible replacement.[6] However, on 10 June 2008, four days after Osbourne's departure, ITV confirmed that Girls Aloud singer Cheryl Cole was the new judge and Osbourne's replacement for series 5. Minogue praised the new judge, saying, \"She's very knowledgeable about music and I think she's going to bring a new side to the show.\"[7] Cowell is reported by Minogue to feel that Cole's voiced opinions are something \"which he loves\".[7]\n\nDermot O'Leary returned to present the main ITV show, choosing to leave other projects, including his ongoing role as the host of Big Brother's Little Brother, to concentrate on The X Factor.[8] The Xtra Factor presenter Fearne Cotton left after series 4, having presented for only one series, to be replaced by Holly Willoughby.[9] Brian Friedman returned as choreographer and performance coach (billed as \"Creative Director\"), along with Yvie Burnett as vocal coach.\n\nSelection process [ edit ]\n\nAuditions [ edit ]\n\nBirmingham Manchester\n\nLondon\n\nCardiff\n\nGlasgow Cities that auditions were held in.\n\nA reported \"record-breaking\" 182,000 applied for series 5,[1][10] with filming for auditions in front of judges taking place in June/July 2008. Auditions were held in the cities of London, Birmingham, Manchester, Cardiff, and Glasgow.[11]\n\nDue to her commitments with Australia's Got Talent, Minogue was absent from some of the auditions in Birmingham and Cardiff but was not replaced.\n\nBootcamp [ edit ]\n\nAs in series 4, all four judges worked together at the bootcamp stage of the competition. This took place at indigO 2 at The O 2 in Greenwich, London on 4 August 2008, and was televised in two episodes on 27 and 28 September 2008.[12][13] Contestants are said to have stayed in a nearby hotel in Blackheath.[13]\n\nDuring bootcamp, around 150 acts were whittled down to 24 who advanced to the next round, six in each category. After completion of bootcamp, the judges were told the category that they were to mentor. Cowell was given the Boys, Walsh the Groups, Minogue the Over 25s, and Cole the Girls.\n\nJudges' houses [ edit ]\n\nThis round was filmed in late August and early September and was broadcast over two shows on 4 and 5 October. As in previous years, the judges welcomed the six acts from their selected category to their \"homes\".[14] Each act had one chance to impress their mentor who, along with a guest judge, had the task of selecting which three acts were to go through to the live shows and which three would be eliminated. For her guest judge, Minogue chose former Spice Girls member and Emma Bunton, Cole chose her fellow Girls Aloud member Kimberly Walsh, Cowell chose singer Sinitta, and Walsh chose Shane Filan from Westlife.\n\nFinalists [ edit ]\n\nKey:\n\n– Winner – Runner-up – Third place\n\nLive shows [ edit ]\n\nThe live shows began on 11 October 2008 and continued through to the finale on 13 December 2008. An added twist for this series, confirmed on the first live show, was that acts in the bottom-two showdown sang a new song of their own choosing, rather than repeating the song they performed in the first part of the show.\n\nMusical guests [ edit ]\n\nLeon Jackson performed on the first live show, promoting his second single \"Don't Call This Love\". Girls Aloud performed their new single \"The Promise\" on the second show on 18 October. Will Young performed his new song \"Grace\" on 1 November. Mariah Carey appeared on 8 November and performed her new single \"I Stay in Love\", plus a special version of \"Hero\" with 11 of the finalists (Diana Vickers was ill with laryngitis so could not perform). Leona Lewis appeared the week after and performed her new single \"Run\". Take That performed on 22 November show, as did series 4 third-place act Same Difference, who performed their debut single, and series 4 runner-up Rhydian Roberts, who sang a track from his debut album.[15] On 29 November show, Britney Spears performed her new single \"Womanizer\".\n\nBoyzone, Westlife, and Beyoncé were guests on the final show where they duetted with the finalists, with Knowles performing \"Listen\" with Alexandra Burke. Knowles also performed \"If I Were a Boy\".\n\nResults summary [ edit ]\n\nColour key\n\n– Contestant was in the bottom two and had to sing again in the final showdown – Contestant received the fewest public votes and was immediately eliminated (no final showdown) – Contestant received the most public votes – Contestant was given a \"Bye Week\" and automatically advanced to the following week\n\nWeekly results per act[16] Act Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Week 7 Quarter-Final Semi-Final Final First Vote Second Vote Alexandra Burke 6th\n\n7.20% 7th\n\n7.15% 6th\n\n8.83% 6th\n\n8.82% 2nd\n\n18.35% 4th\n\n13.31% 4th\n\n14.97% 1st\n\n24.53% 2nd\n\n31.04% 1st\n\n44.02% Winner\n\n58.34% JLS 7th\n\n5.03% 3rd\n\n9.21% 4th\n\n10.81% 2nd\n\n17.00% 4th\n\n13.26% 5th\n\n9.91% 5th\n\n11.75% 2nd\n\n24.34% 1st\n\n35.03% 2nd\n\n30.65% Runner-up\n\n41.66% Eoghan Quigg 1st\n\n21.19% 1st\n\n26.77% 1st\n\n20.73% 1st\n\n19.81% 1st\n\n27.39% 2nd\n\n19.56% 1st\n\n31.79% 3rd\n\n19.58% 3rd\n\n21.14% 3rd\n\n25.33% Eliminated\n\n(final) Diana Vickers 4th\n\n7.35% 2nd\n\n16.24% 2nd\n\n15.13% 3rd\n\n15.24% Bye Week 1st\n\n31.30% 2nd\n\n18.94% 4th\n\n16.32% 4th\n\n12.79% Eliminated\n\n(semi-final) Ruth Lorenzo 10th\n\n3.47% 10th\n\n2.95% 5th\n\n8.93% 5th\n\n10.25% 7th\n\n6.94% 3rd\n\n13.91% 3rd\n\n16.07% 5th\n\n15.23% Eliminated\n\n(quarter-final) Rachel Hylton 8th\n\n4.77% 8th\n\n5.01% 3rd\n\n12.21% 9th\n\n3.81% 5th\n\n10.39% 7th\n\n4.48% 6th\n\n6.48% Eliminated\n\n(week 7) Daniel Evans 5th\n\n7.21% 6th\n\n8.23% 9th\n\n5.94% 4th\n\n10.83% 3rd\n\n13.77% 6th\n\n7.53% Eliminated\n\n(week 6) Laura White 3rd\n\n16.99% 4th\n\n8.99% 7th\n\n7.53% 7th\n\n7.38% 6th\n\n9.90% Eliminated\n\n(week 5) Austin Drage 9th\n\n3.63% 5th\n\n8.98% 8th\n\n6.22% 8th\n\n6.86% Eliminated\n\n(week 4) Scott Bruton 2nd\n\n19.48% 9th\n\n4.17% 10th\n\n3.67% Eliminated\n\n(week 3) Girlband 11th\n\n2.17% 11th\n\n2.30% Eliminated\n\n(week 2) Bad Lashes 12th\n\n1.51% Eliminated\n\n(week 1) Final Showdown Bad Lashes,\n\nGirlband Girlband,\n\nLorenzo Bruton,\n\nEvans Drage,\n\nHylton Lorenzo,\n\nWhite Evans,\n\nHylton Hylton,\n\nJLS No final showdown or judges' votes: results were based on public votes alone Walsh’s vote to eliminate Bad Lashes Lorenzo Bruton Drage White Evans Hylton Minogue’s vote to eliminate Girlband Girlband Bruton Drage White N/A JLS Cole’s vote to eliminate Girlband Girlband Bruton Drage Lorenzo Evans Hylton Cowell’s vote to eliminate Bad Lashes Lorenzo Evans Hylton White Evans Hylton Eliminated Bad Lashes\n\n2 of 4 votes\n\nDeadlock Girlband\n\n2 of 4 votes\n\nDeadlock Scott Bruton\n\n3 of 4 votes\n\nMajority Austin Drage\n\n3 of 4 votes\n\nMajority Laura White\n\n3 of 4 votes\n\nMajority Daniel Evans\n\n3 of 3 votes\n\nMajority Rachel Hylton\n\n3 of 4 votes\n\nMajority Ruth Lorenzo\n\n15.23%\n\nto save Diana Vickers\n\n12.79%\n\nto save Eoghan Quigg\n\n25.33%\n\nto save JLS\n\n41.66%\n\nto win\n\nThe total number of votes cast for the entire series was 16,469,064.[citation needed]\n\n^1 Due to illness, Diana Vickers did not perform during week 5 and automatically advanced to week 6.\n\n^2 Minogue was not required to vote as there was already a majority.\n\nLive show details [ edit ]\n\nWeek 1 (11 October) [ edit ]\n\nJudges' votes to eliminate\n\nCowell: Bad Lashes – gave no reason but described both acts as \"shocking\".\n\nCole: Girlband – gave no reason.\n\nMinogue: Girlband – gave no reason.\n\nWalsh: Bad Lashes – unable to decide between two of his own acts so chose to take it to deadlock.\n\nWith the acts in the bottom two receiving two votes each, the result went to deadlock and reverted to the earlier public vote. Bad Lashes were eliminated as the act with the fewest public votes.\n\nWeek 2 (18 October) [ edit ]\n\nJudges' votes to eliminate\n\nWalsh: Ruth Lorenzo – backed his own act, Girlband.\n\nMinogue: Girlband – backed her own act, Ruth Lorenzo\n\nCole: Girlband – based on the final showdown performances.\n\nCowell: Ruth Lorenzo – decided to take it to deadlock as he wanted to give Girlband a second chance whereas he felt Lorenzo did not \"play to her strengths\".\n\nWith the acts in the bottom two receiving two votes each, the result went to deadlock and reverted to the earlier public vote. Girlband were eliminated as the act with the fewest public votes. During the show, a mistake was made in one of the overlays and Lorenzo's number was briefly displayed incorrectly, meaning any calls to that number would not have registered a vote. After the show, viewers complained that they had dialled this incorrect number and could not get through to vote for Lorenzo, but ITV insisted the issue should not have made any difference to the overall result as Lorenzo received more votes than Girlband and advanced to the third week after the result went to deadlock.[17]\n\nWeek 3 (25 October) [ edit ]\n\nJudges' votes to eliminate\n\nCowell: Daniel Evans – backed his own act, Scott Bruton.\n\nMinogue: Scott Bruton – backed her own act, Daniel Evans, though stated he sang the best in the sing off.\n\nCole: Scott Bruton – said that she felt the \"belief and passion\" in Evans' performance.\n\nWalsh: Scott Bruton – commented that Evans \"sang every word like he meant it\".\n\nWeek 4 (1 November) [ edit ]\n\nJudges' votes to eliminate\n\nCowell: Rachel Hylton – backed his own act, Austin Drage.\n\nMinogue: Austin Drage – backed her own act, Rachel Hylton.\n\nCole: Austin Drage – stated she was prepared to give Hylton a \"moment to shine\".\n\nWalsh: Austin Drage – said Hylton had more to give to the competition and was more of a \"raw talent\".\n\nWeek 5 (8 November) [ edit ]\n\n^1 Due to illness, Diana Vickers did not perform and automatically advanced to the following week. She was due to perform fifth and would have performed \"Always Be My Baby\".\n\nJudges' votes to eliminate\n\nCowell: Laura White – gave no reason but commented that both acts \"were not the worst singers of the night\".\n\nMinogue: Laura White – backed her own act, Ruth Lorenzo.\n\nCole: Ruth Lorenzo – backed her own act, Laura White.\n\nWalsh: Laura White – commented that Lorenzo was \"more of a fighter\".\n\nWeek 6 (15 November) [ edit ]\n\nJudges' votes to eliminate\n\nWalsh: Daniel Evans – gave no reason.\n\nCole: Daniel Evans – stated that she had seen a spark back from Hylton this week.\n\nCowell: Daniel Evans – gave no reason though commented that Hylton \"threw it away\" with her last performance and that he would have liked to see her perform with more passion.\n\nMinogue was not required to vote as there was already a majority and did not say how she would have voted as both acts were in her category.\n\nWeek 7 (22 November) [ edit ]\n\nJudges' votes to eliminate\n\nWalsh: Rachel Hylton – backed his own act, JLS.\n\nCole: Rachel Hylton – said JLS would go further in the competition though stated that it had been the best Hylton had sung since the auditions.\n\nMinogue: JLS – backed her own act, Rachel Hylton.\n\nCowell: Rachel Hylton – stated that this was Hylton's third time in the bottom two and that JLS shouldn't have been in the final showdown.\n\nJLS had previously been rehearsing to sing \"Rule the World\", with the approval of their mentor, Walsh. Contrary to this, Minogue, who had higher priority in the judges' song-selection rota, selected the song for her artist Hylton to sing. This led to an on-screen argument between Minogue and Walsh.[18]\n\nWeek 8: Quarter-Final (29 November) [ edit ]\n\nThe quarter-final did not feature a final showdown and instead the act with the fewest public votes, Ruth Lorenzo, was automatically eliminated.\n\nWeek 9: Semi-Final (6 December) [ edit ]\n\nThe semi-final did not feature a final showdown and instead the act with the fewest public votes, Diana Vickers, was automatically eliminated.\n\nWeek 10: Final (13 December) [ edit ]\n\nCharity single [ edit ]\n\nThe twelve finalists together recorded a cover version of Mariah Carey's 1993 hit \"Hero\" in support of the Help for Heroes charity.[19] The single was available for download from 25 October 2008, after the finalists performed the song live on that night's show. It was released in stores on 27 October, and Simon Cowell predicted it \"will go straight to the top of the charts\".[20] In the first week of its release it went straight to number 1 and sold 313,244 copies, more than the rest of the top ten combined.[21]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nViewing figures for series 5 were, at the time of airing, the highest ever for any X Factor series, about 20% up on the previous series.[22] This, however, was beaten by the sixth series the following year.\n\nThe first show of the series had the highest launch audience for any series, peaking at over 12 million viewers.[23] The entire Auditions phase officially averaged 9.9m, a rise of 1.2m over the previous series.\n\nThe Bootcamp episodes performed well in the ratings; although the Saturday episode was beaten for the first time by Strictly Come Dancing,[24] the Sunday episode restored the balance.[25] The Saturday Judges' houses episode had the highest audience since the opening show, and the Sunday episode had a lower rating but still exceeded that of Strictly Come Dancing.[26] The entire bootcamp and judges' houses phase officially averaged 9.8m, a rise of 2.5m over the previous series.\n\nThe live shows pulled in very strong audiences, often rating as the most watched programme of the week.[27] The final was the second most watched television programme of 2008 with 14.06m viewers.[28]\n\nSeries 5 of The X Factor officially averaged 10.5m, at the time becoming the most watched British talent series of the 21st century.\n\nEpisode Air date Official ITV1 rating[29] Weekly rank[29] Share Auditions 1 16 August 10.78 1 48.2%[30] Auditions 2 23 August 10.10 1 45.4%[31] Auditions 3 30 August 8.80 2 43.5%[32] Auditions 4 6 September 9.57 1 42.8%[33] Auditions 5 13 September 9.96 1 43.2%[34] Auditions 6 20 September 10.01 1 41.7%[35] Bootcamp 1 27 September 8.94 4 36.0%[36] Bootcamp 2 28 September 9.47 1 38.1%[37] Judges' houses 1 4 October 10.84 1 40.5%[38] Judges' houses 2 5 October 10.11 3 42.7%[39] Live show 1 11 October 11.09 1 44.1%[40] Results 1 9.05 7 40.8%[40] Live show 2 18 October 10.21 3 38.5%[41] Results 2 9.13 9 39.7%[41] Live show 3 25 October 10.37 2 39.7%[42] Results 3 8.89 10 38.0%[42] Live show 4 1 November 11.65 1 43.3%[43] Results 4 9.72 6 37.6%[43] Live show 5 8 November 10.72 2 42.6%[44] Results 5 9.46 7 35.6%[44] Live show 6 15 November 11.28 1 43.5%[45] Results 6 10.62 2 42.9%[45] Live show 7 22 November 11.77 1 43.2%[46] Results 7 9.98 6 41.1%[46] Live show 8 29 November 12.67 1 46.0%[47] Results 8 11.41 2 50.0%[47] Semi-final 6 December 10.30 3 39.1%[48] Semi-final results 10.60 2 39.6%[48] Final performances 13 December 13.77 2 50.3%[49] Final results 14.06 1 54.4%[49] Series average 2008 10.51 1 42.4%", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Cheryl_Cole_Cannes_2014.jpg/138px-Cheryl_Cole_Cannes_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Red_pog.svg/8px-Red_pog.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/United_Kingdom_adm_location_map.svg/200px-United_Kingdom_adm_location_map.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Alexandra_Burke_All_Night_Long_Tour.jpg/1200px-Alexandra_Burke_All_Night_Long_Tour.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Dannii_Minogue_arrives_at_the_58th_Annual_Logie_Awards_at_Crown_Palladium_%2826904220225%29_cropped.jpg/140px-Dannii_Minogue_arrives_at_the_58th_Annual_Logie_Awards_at_Crown_Palladium_%2826904220225%29_cropped.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Louis_Walsh2009July.jpg/113px-Louis_Walsh2009July.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Simon_Cowell_in_December_2011.jpg/141px-Simon_Cowell_in_December_2011.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Alexandra_Burke_All_Night_Long_Tour.jpg/200px-Alexandra_Burke_All_Night_Long_Tour.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Alexandra_Burke_All_Night_Long_Tour.jpg/1200px-Alexandra_Burke_All_Night_Long_Tour.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_X_Factor_(British_series_5)", "title": "The X Factor (British series 5)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Alexandra_Burke_All_Night_Long_Tour.jpg/1200px-Alexandra_Burke_All_Night_Long_Tour.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}