{"url": "https://www.usatoday.com/story/life/tv/2018/02/27/oscars-2018-jimmy-kimmel-secretly-hoping-another-oscars-envelope-gate/375195002/", "text": "Jimmy Kimmel is ready for his second stint hosting the Oscars Sunday on ABC (8 ET/5 PT), and he hopes for a repeat performance of last year’s Envelopegate, in which Warren Beatty and Faye Dunaway announced the wrong film as best picture.\n\nDespite painstaking efforts by the Academy of Motion Picture Arts and Sciences and its accountant to avoid another debacle, “I want it to happen again,” Kimmel jokes in an interview. Especially because no one blamed him for it, “nor should they have.”\n\nMore:Oscars 2018: There won't be another envelope flub. They promise. Really!\n\nBut Beatty appears in a playful new promo with Kimmel, raising the question of whether Oscar producers will have a little fun with the notorious gaffe on Sunday’s live broadcast. Is Beatty booked to return? “I do not know,” Kimmel claims, suspiciously. “It’s outside of my area of responsibility.”\n\nMore:Warren Beatty and Faye Dunaway's return to the 2018 Oscars will be the ultimate Hollywood ending\n\nKimmel won’t say much about his emcee plans, but he volunteers which of the nine best-picture nominees is the ripest for joke material.\n\nLeading contender “The Shape of Water is about a woman who has sex with a sea monster. So probably that one — that’s got to be right at the top. That’s something we haven’t seen in the movies before, certainly not in an Oscar-nominated movie. I haven’t done the research, but I’m pretty sure that’s true.”\n\nHe says he has watched all of the nominated films, “and I hope that the audience has also watched them.\" But last year, he felt he'd seen \"a lot more of the movies than the crowd at the Oscars,\" and \"it’s hard to do a joke if people don’t know what the reference is.\"\n\nAnd if the Hollywood crowd hasn’t seen them, does a field of contenders with few box office hits bode poorly for Oscars ratings? The show sunk to a near-record low 32.9 million viewers last year when Moonlight (domestic box office: $27.9 million) aced out La La Land after that infamous envelope mix-up. “I don’t concern myself with those sorts of things,” except on Jimmy Kimmel Live, he says. “I worry about my ratings.”\n\nThe hardest part, he says, is whittling down \"thousands\" of jokes from his writers without being able to test them in front of an audience. \"Some of the hosts who are stand-up comics will go to comedy clubs, but I’m too paranoid someone is going to have a video camera and is going to tape them and ruin the whole deal. I prefer to just roll the dice.”\n\nSince his last Oscars stint, Kimmel made headlines speaking out emotionally about the health care debate as his son, Billy, went through surgeries to correct a birth defect.\n\nMore:Joined by his son Billy, an emotional Jimmy Kimmel makes the case for CHIP\n\nMore:Jimmy Kimmel pleads with Trump to 'do something' about gun control in moving monologue\n\nIn essence, he became the political conscience of a generation and inspired rivals, including John Oliver. \"That is a label that I did not give myself, nor do I agree with it,\" he says. \"But it feels weird. It's not really gratifying. I wish I didn’t have to talk about any of this stuff,\" even if \"it does make me feel good to hear people say thank you for speaking about this. I hope it actually is having some positive impact.\"\n\nMore:How Jimmy Kimmel inspired John Oliver to share his own son's health scare\n\nHe’s also not the first awards-show host to tackle the Me Too moment, but he’ll “approach it as I approach every subject, with a tremendous amount of class and dignity,” he says, laughing. “It will definitely be part of the show. How big a part I’m not sure, because I’m still digging through a mound of material.”\n\nBut does he worry about blowback, tackling a touchy subject while hosting what's typically the largest TV event outside the Super Bowl? “Everything everyone says gets attacked at all times. This is our new reality,” he says. “I see a future of great silence.” Otherwise, “you carry on, and you have to realize what sometimes seems like an uproar is really four people tweeting. You also have to acknowledge that almost every subject is going to upset someone.” He adds he’s convinced the producers of Peter Rabbit did not expect to be targeted for mocking a food allergy.\n\nAnd Kimmel won’t commit to repeating as host, if he’s asked.\n\n“I’m going to focus on this year, and we’ll see what happens after that,” he says. “What you really want is to get to the point where you’re just taken for granted and resented.”", "images": ["https://www.gannett-cdn.com/-mm-/0dc37a4205fb6b98090f86891ddc7831e45fc844/c=0-139-2062-1304/local/-/media/2018/02/26/USATODAY/USATODAY/636552356092917734-145621-0339c.jpg?width=2062&height=1165&fit=crop&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5739352308001_5739169691001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/0dc37a4205fb6b98090f86891ddc7831e45fc844/c=0-139-2062-1304/local/-/media/2018/02/26/USATODAY/USATODAY/636552356092917734-145621-0339c.jpg?width=2062&height=1165&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/02/27/oscars-2018-jimmy-kimmel-secretly-hoping-another-oscars-envelope-gate/375195002/", "title": "Oscars 2018: Jimmy Kimmel is secretly hoping for another 'Envelopegate'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Oscars 2018: Jimmy Kimmel is secretly hoping for another 'Envelopegate'", "description": "Jimmy Kimmel hosts his second Oscars ceremony; will there be a repeat after Warren Beatty named the wrong film as best picture in 2017?", "url": "https://www.usatoday.com/story/life/tv/2018/02/27/oscars-2018-jimmy-kimmel-secretly-hoping-another-oscars-envelope-gate/375195002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/0dc37a4205fb6b98090f86891ddc7831e45fc844/c=0-139-2062-1304/local/-/media/2018/02/26/USATODAY/USATODAY/636552356092917734-145621-0339c.jpg?width=2062&height=1165&fit=crop&format=pjpg&auto=webp", "width": 2062, "height": 1165}, "type": "article"}, "article": {"author": "Gary Levin", "content_tier": "free", "opinion": "false"}, "description": "Jimmy Kimmel hosts his second Oscars ceremony; will there be a repeat after Warren Beatty named the wrong film as best picture in 2017?", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/0dc37a4205fb6b98090f86891ddc7831e45fc844/c=0-139-2062-1304/local/-/media/2018/02/26/USATODAY/USATODAY/636552356092917734-145621-0339c.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Oscars 2018: Jimmy Kimmel is secretly hoping for another 'Envelopegate'", "description": "Jimmy Kimmel hosts his second Oscars ceremony; will there be a repeat after Warren Beatty named the wrong film as best picture in 2017?"}}, "movies": [], "publish_date": 1519660800.0, "source": "https://www.usatoday.com", "summary": ""}