{"url": "https://www.complex.com/style/2018/01/best-style-moments-from-the-2018-grammys", "text": "\"Music's biggest night\" is all about showcasing the boldest and brightest talent in the business, but one of the most exciting events of the night happens before the awards ceremony even begins.\n\nThe 2018 Grammy Awards red carpet was sizzling with memorable looks from some of the hottest artists on the scene right now. Dazzling gowns, custom-made pieces, and flashy style statements were all center-stage, and this year, a special nod to the #Time'sUp Movement was also showcased in the form of classic white rose corsages.\n\nWith televised coverage of celebrity arrivals, fans have a chance to see their faves don the red carpet in some of the most jaw-dropping looks regardless of whether or not they managed to snatch the W in their category. Here are some of the best style moments from the 2018 Grammys.\n\nLil Uzi Vert\n\nUzi showed up to the red carpet rocking quite the eye-catching fit. His iced-out goth look consisted of a Balenciaga hoodie, Tripp NYC pants, Off-White x Nike Air Force 1 for MoMa kicks and socks, and accessorized with a Skoloct x undercover bag.\n\nDonald Glover\n\nGlover showed up flexing a pristine, white Ermenegildo Zegna Couture suit. The versatile artist was nominated for a total of five awards, gave a standout performance of \"Terrible,\" and ended up taking home the Grammy for Best Traditional R&B Performance for \"Redbone.\"\n\nJaden Smith\n\nJaden Smith brought street style to the red carpet with one-of-a-kind pieces. He wore a custom C2H4 X MSFTS jacket adorned with the word \"Vision\" and stylized to fit the aesthetic of his debut album, along with custom G-Star Raw jeans, and SS18 Louis Vuitton sneakers.\n\nDJ Khaled and Asahd\n\nDJ Khaled decided to go for the most heart-warming look of the night by hitting the red carpet wearing matching custom red velvet suit from 5001 Flavors Clothing Co. with his son Asahd. Asahd also rocked Gucci sneakers.\n\nJay Z\n\nHov kept it classy, as per usual, and rolled up to MSG in head-to-toe Tom Ford. Jay was nominated in a grand total of eight different categories last night but was beat out by artists like Kendrick and Bruno Mars. This year might not have added any more Grammys to Jay's collection, but with his stunning wife Beyoncé and adorably chic daughter Blue at his side, we'd hardly call it a losing night for him.\n\nSZA\n\nThe most-nominated female artist of the night had our jaws literally on the ground with her gorgeous Versace gown. The gown's bodice had sparkling, intricate details and the flowing, gauzy sleeves and hem perfectly enhances SZA's naturally ethereal presence. She accessorized the gown with classic, understated Chopard jewelry.\n\nTyler, the Creator\n\nTyler made one of the boldest fashion statements at this year's Grammys. He hit the red carpet wearing an eccentric fit that consisted of a Louis Vuitton scarf, Golf Wang tee, a baby blue Supreme coat, and a pair of Converse sneakers. He also saw Beyoncé's hat game, and raised it one white, furry Ushanka hat, which somehow pulled together the whole fit masterfully. Added points for the dyed leopard-print hair he was sporting underneath, too.\n\nDRAM\n\nDRAM rolled up to the red carpet looking as bright-eyed and jovial as ever. The rapper wasn't up for any Grammys this year, but that didn't stop him from being all smiles as usual as he rocked an eye-catching purple Gucci suit. We were kind of hoping he'd bring his best buddy, (his goldendoodle, Idnit) along with him, but there's always next time.\n\nCardi B\n\nCardi B is just a regular degular girl from the Bronx, who now happens to be a Grammy-nominated artist. She stepped onto the red carpet wearing an extravagant Ashi Studio gown, which, along with her pre-party dress, reportedly took over 150 hours to create.\n\nBig Sean\n\nBig Sean was looking exceptionally stylish, rocking a Ferragamo suit from their SS18 collection, paired with a SS17 coat from the fashion house.\n\nLana Del Rey\n\nLana Del Rey, who was up for Best Pop Vocal Album, stepped onto the red carpet looking angelic wearing a flowing, custom Gucci gown accented with crystal stars. The vampy songstress enhanced her heavenly look with a sparkling halo of stars as well, which many quickly compared to Hedy Lamarr's headpiece from the 1941 Ziegfeld Girl​.\n\nKendrick Lamar\n\nKing Kendrick made slight work of securing another round of awards this year, and his pre-show attire was just as impressive. He stepped onto the scene looking lavish in Saint Laurent, and later gave an explosive performance decked out in Raf Simons and Craig Green.\n\nBeyoncé\n\nBey is always known to steal the night with her glamorous and conversation-starting looks. This year, she went for something more subtle, yet equally as stunning, and wore a black velvet Nicolas Jebran dress with thigh-high slits, a wide-brimmed hat, and Alain Milki Le Matin shades. According to the designer, her fit drew inspiration from the Black Panther movement, giving the look that extra Beyoncé touch of nuance.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://images.complex.com/complex/images/c_fill,dpr_auto,f_auto,q_90,w_1400/fl_lossy,pg_1/l2y9mkh0hibngazysrej/jay-z-beyonce-grammys", "https://images.complex.com/complex/image/upload/v1580766573/FFFFFF-1_cyvbjp.png", "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/l2y9mkh0hibngazysrej/jay-z-beyonce-grammys"], "top_img": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/l2y9mkh0hibngazysrej/jay-z-beyonce-grammys", "keywords": [], "authors": ["Nora-Grayce Orosz"], "canonical_link": "https://www.complex.com/style/2018/01/best-style-moments-from-the-2018-grammys", "title": "Best Style Moments From the 2018 Grammys", "meta_data": {"google-site-verification": "ICK39wBGvCQQMHpEUykVHWF8Ox_0MME-_qxe6ixFUik", "theme-color": "#000000", "description": "This year's Grammy Awards had some of the most eye-catching red carpet styles.", "og": {"type": "website", "title": "Best Style Moments From the 2018 Grammys", "description": "This year's Grammy Awards had some of the most eye-catching red carpet styles.", "url": "https://www.complex.com/style/2018/01/best-style-moments-from-the-2018-grammys", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/l2y9mkh0hibngazysrej/jay-z-beyonce-grammys", "site_name": "Complex"}, "fb": {"app_id": 310521533114641, "pages": 117696581735620}, "twitter": {"card": "summary_large_image", "title": "Best Style Moments From the 2018 Grammys", "description": "This year's Grammy Awards had some of the most eye-catching red carpet styles.", "url": "https://www.complex.com/style/2018/01/best-style-moments-from-the-2018-grammys", "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,h_300,q_auto,w_600/fl_lossy,pg_1/l2y9mkh0hibngazysrej/jay-z-beyonce-grammys", "site": {"id": 13049362}}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}