{"url": "https://www.latimes.com/entertainment/herocomplex/la-et-hc-izombie-finale-david-anders-20150604-story.html", "text": "After 12 episodes of brain-eating and mystery-solving, the first season of The CW’s “iZombie” is ending with tonight’s finale, “Blaine’s World.”\n\nUnlike the show’s undead heroine Olivia “Liv” Moore, who procures her cerebral sustenance by landing a job in the morgue and uses her zombie powers to solve murder cases, her nemesis Blaine DeBeers embraces his newfound zombie powers, infects rich and powerful people and sets up a black-market brains takeout service, demanding money and favors in exchange for gourmet medulla and cerebellum.\n\nIf Liv (Rose McIver) calls to mind the likes of feisty protagonists Veronica Mars or Buffy, then Blaine (David Anders) takes a page from Spike, the leather-clad fan-favorite vampire from Joss Whedon’s hit series. Blaine enjoys being a bad guy and makes it look cool.\n\n“He’s Johnny Rotting,” said Anders in a phone conversation ahead of the finale. “He’s a bit of a rocker zombie, isn’t he?”\n\nAdvertisement\n\nFor Anders, Blaine is the latest role in a long line of bad guys that began with the J.J. Abrams “Alias,” in which he portrayed the ruthless criminal Julian Sark. Since then, he has played villainous characters in “Heroes,” “The Vampire Diaries” and “Once Upon a Time.” Hero Complex chatted with Anders about Blaine’s influences, “iZombie’s” success and what’s next for his character.\n\nWhat drew you to the role initially?\n\nWhat drew me to the role was the humor of it. They were calling it a zom-com-rom-dram, and I’d never seen anything or read anything like it. And of course I knew of [series co-creator] Rob Thomas from his years of “Veronica Mars’ and “Party Down,” and I know he’s very adept at humor. And for most of my career, I hadn’t been allowed to do humor. And that pilot script was a real page turner, and I was laughing the whole way, and there were some cringe-worthy moments. But yeah, overall, it was the funny.\n\nI feel like we strike a good balance between the drama and the gore and the comedy. It’s such a fun thing to play with.\n\nAdvertisement\n\nAt WonderCon, you talked about how it was a role that really had you chewing the scenery.\n\nPer Mr. T, Rob Thomas’s instructions, I was told to chew as much scenery as possible, brains included. It’s a lot of fun to be told to go further. It’s always better to go too far than too little, because you can always bring it back a little bit. In the character breakdown, they said they had an idea for Blaine to be like James Spader in “Pretty in Pink,” and when I read it, I was like, “He sounds a little more like Spader from ‘Less Than Zero.’” So I tried to find the balance between “Pink” and “Zero,” and I hope I bring an element of Spader to it, because that’s what Rob wanted, but at this point, I think, I’ve made it my own.\n\nDo you ever feel silly playing such an arch character?\n\nSure, there’s a lot of mustache-twirling. But this character is as close to me as I’ve probably ever played, oddly, crazily enough. Because I think they really write to our strengths so well. They got to know us, and they write for us, within the confines of the characters. I feel like I’m a sweet guy. I’m my mother’s son. I’m not as nefarious as Blaine, but I am a little cocky.\n\nAdvertisement\n\nHe’s kind of like a rock star zombie.\n\nRight, right, he’s Johnny Rotting. That was cool as we put together the wardrobe and you get into the makeup and dye the hair and you start to move a little different. He’s a bit of a rocker zombie, isn’t he?\n\nSo you don’t have to wear a wig like Rose does.\n\nSadly, no. She has a lot of trouble with the wig -- it’s itchy, it moves on her, it can cause her a lot of torment. But I have to go into the salon every month, once a month, to get my roots dyed. And while it looks great for the character, it’s become a poor life choice, because my hair, when it’s dyed, it starts coming out in droves. It starts snowing on my head sometimes. So we’re trying to come up with solutions. My manager contacted James Marsters’ manager, because he played Spike for so many years, dying his hair, and James Marsters said to use Sweet’N Low in the mixture. We’re trying to come up with answers, but I do have to suffer through the bleach.\n\nAdvertisement\n\nDo you have a sense of your character’s trajectory? Do you think he’s going to have a multiple-seasons-long arc?\n\nThrough this season, it’s all going to come to a head by the finale between Liv and Blaine. But the fans? The fans are really calling out for that Spike-and-Buffy relationship, the love-and-hate type thing that they had through that wonderful series. So hopefully in season 2 they can explore that. I think they’re going to have to work together. Much to Liv’s chagrin she’ll have to work with Blaine, because he has done nothing but terrible so far.\n\nHe has a fun posse working for him now.\n\nYeah, the “zarmy,” the zombie army. They’re some big cats, and they do wonderful work. They play dumb so well. It’s just fun to work with them. Aleks [Paunovic], who plays Julien, is fantastic. And the others, even the ones i’ve already killed off, are so fun to play with.\n\nAdvertisement\n\nDo you think Blaine’s going to meet his match?\n\nHe kind of walks around like he doesn’t believe there are consequences. I think that comes with his new zombie powers. And as long as he keeps avoiding head shots, he will continue walking around like the cock of the walk.\n\nWhat do you think would make him happiest? When will Blaine be happy?\n\nI don’t know. I think the sky’s the limit. I don’t think he will ever be content. He wants to become King Zombie of Seattle. Maybe he’ll run for mayor, haha. Maybe expanding his business outside Seattle.\n\nAdvertisement\n\nIs there a role that prepared you for this one?\n\nOh sure. You look at the canon of my work, and I’ve played nothing but heavies. There’s a lot of Sark in there from “Alias,” there’s a lot of Adam Monroe from “Heroes.” A few episodes ago, [Liv] had a gun trained on [Blaine], and he ended up killing Lowell [Bradley James]? That episode we tried to round out Blaine’s character a little bit, talking about how he loved Nirvana and growing up and stuff like that. It humanized him, if you will.\n\nWould you ever want to play a good guy?\n\nSure, I’d like to play the protagonist, but it is more fun playing the bad guy. Though what else do I have to compare it to? That’s all I know. I blame J.J. Abrams for my career trajectory. I blame and thank him, because he gave me my start, but he made me a bad guy for life. I was 20 years old when I got that part, and I’m 34. i have a lot of time to play good guys. I have a lot of time yet. We’re just getting started.\n\nAdvertisement\n\nWhat’s the dynamic like on set?\n\nThe dynamic is really amazing. Me and the rest of the cast, we get along so well. We’re thick as thieves. We’re always hanging out and laughing on set and then off set we’re always together. Every show I’ve ever done, I’ve had amazing TV families. And I thought “Alias” was going to ruin it for me because I thought I would never find another family as great as that. But every single job I’ve ever had, I’ve just had a blast and loved everybody at work, for the most part, haha. The dynamic is light and it’s funny. We can laugh up until “action,” and then do our work between “action” and “cut,” and then continue laughing.\n\nYou’ve been on lots of hit shows, shows that really took off and garnered obsessive fan followings. Is there a sense when you’re in it that this is one of those shows that’s really special, or that this is a show that people are going to be really loyal to?\n\nIn the past, I was lucky to hitch my wagon to already-successful shows in “Alias” and “Heroes” and “Vampire Diaries.” This has been the first job that I’ve gotten on the ground floor. It’s the first pilot that I’ve tested my way onto, amazingly. The feeling with this was it was something special, absolutely, we thought this was very different and refreshing. But we shot the whole season before a single episode aired, so we didn’t know. We shot the whole thing, and after we wrapped, we were a month away from the pilot airing. We heard great things from down here in L.A., from the studio from Warner Bros. and from CW that they love it, they love all the dailies, they love all the cuts. And we believed them and just had to keep our heads down and keep doing what we were doing. Luckily, to this point, it’s turned out well. I think that people are liking it, and hopefully we can build that audience and keep on going for 22 seasons.\n\nAdvertisement\n\nFull-on zombie mode on Twitter: @NoeleneClark", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/7638d9b/2147483647/strip/true/crop/1152x1152+448+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2d%2Ff8%2Ff5a0d09806a082fad64613607d36%2Fimg-535dc8ee-turbine-la-bio-noelene-clark", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/5abbaf7/2147483647/strip/true/crop/2048x1075+0+146/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/fdc7ab9/2147483647/strip/true/crop/2048x1367+0+0/resize/840x561!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/5abbaf7/2147483647/strip/true/crop/2048x1075+0+146/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004", "keywords": [], "authors": ["Noelene Clark Previously Covered Superheroes", "Spaceships", "Dragons For The Los Angeles Times", "Pop Culture Website Hero Complex."], "canonical_link": "https://www.latimes.com/entertainment/herocomplex/la-et-hc-izombie-finale-david-anders-20150604-story.html", "title": "Q&A: ‘iZombie’: David Anders says villain Blaine is part-Spike, part-James Spader", "meta_data": {"og": {"title": "Q&A: 'iZombie': David Anders says villain Blaine is part-Spike, part-James Spader", "url": "https://www.latimes.com/entertainment/herocomplex/la-et-hc-izombie-finale-david-anders-20150604-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/5abbaf7/2147483647/strip/true/crop/2048x1075+0+146/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004", "url": "https://ca-times.brightspotcdn.com/dims4/default/5abbaf7/2147483647/strip/true/crop/2048x1075+0+146/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "'iZombie'"}, "description": "After 12 episodes of brain-eating and mystery-solving, the first season of The CW's \"iZombie\" is ending with tonight's finale, \"Blaine's World.\"", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/noelene-clark", "content_tier": "metered", "published_time": "2015-06-09T14:00:00", "opinion": "false", "section": "Entertainment & Arts", "tag": "Hero Complex"}, "twitter": {"card": "summary_large_image", "description": "After 12 episodes of brain-eating and mystery-solving, the first season of The CW's \"iZombie\" is ending with tonight's finale, \"Blaine's World.\"", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/5fafa4b/2147483647/strip/true/crop/2048x1152+0+108/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F7c%2Fb16e14389f45b00ab74170d9a835%2Fla-et-hc-izombie-actor-david-anders-pictures-2-004", "alt": "'iZombie'"}, "site": "@latimes", "title": "Q&A: 'iZombie': David Anders says villain Blaine is part-Spike, part-James Spader"}, "fb": {"app_id": 119932621434123, "pages": 5863113009}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "After 12 episodes of brain-eating and mystery-solving, the first season of The CW's \"iZombie\" is ending with tonight's finale, \"Blaine's World.\"", "brightspot.contentId": "00000169-0c8c-dbbe-a16f-4eeca0390000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1433347200.0, "source": "https://www.latimes.com", "summary": ""}