{"url": "https://web.archive.org/web/20100827015529/http://news.yahoo.com:80/s/ap/20100825/ap_on_re_us/us_nyc_mosque", "text": "NEW YORK – The planned mosque and Islamic center blocks from ground zero got a new boost Wednesday from a coalition of supporters that includes families of Sept. 11 victims.\n\nNew York Neighbors for American Values rallied for the first time at a municipal building near ground zero.\n\n\"I lost a 23-year-old son, a paramedic who gave his life saving Americans and their values,\" Talat Hamdani said, and supporting the Islamic center and mosque \"has nothing to do with religion. It has to do with standing up for our human rights, including freedom of religion.\"\n\nAmong the nearly 2,800 people killed when the World Trade Center was attacked in 2001 were more than 30 Muslims, she noted.\n\nOpponents of the Islamic center project argue it's insensitive to the families and memories of Sept. 11 victims to build a mosque so close. Supporters cite freedom of religion.\n\nThe new coalition was started by members of 40 civic and religious organizations that \"spontaneously called each other, because we had the feeling that something very negative was happening,\" said Susan Lerner, executive director of the New York office of the watchdog group Common Cause.\n\nThe controversy was triggered by \"irresponsible politicians\" using it as an election issue, she said. Names mentioned at the rally included former House Speaker Newt Gingrich, a Republican, and the highest-ranking Democrat in the Senate, Majority Leader Harry Reid.\n\nGingrich has suggested that building the mosque near ground zero is akin to putting a Nazi sign \"next to the Holocaust Museum.\" Reid has broken ranks with President Barack Obama by saying he thinks the mosque should be built elsewhere.\n\nCoalition members are now contacting officials, asking them to support the project as a reflection of religious freedom and diversity, and the rejection of \"crude stereotypes meant to frighten and divide us.\"\n\nThey plan a candlelight vigil near ground zero on Sept. 10, the eve of the ninth Sept. 11 anniversary.\n\n\"This is not just about Muslims; this is about who we are as Americans,\" said Lerner, adding that to oppose the Islamic center is \"a slippery slope. There will always be people who are offended standing next to people who are different from others.\"\n\nRabbi Arthur Waskow, director of New York's Shalom Center, said the project will show the world a form of Islam that espouses peace — not the Islam of the terrorists.\n\n\"It is right; it is wise to build it,\" he told hundreds of people gathered under the arches of Manhattan's Municipal Building, a short walk from ground zero.\n\nSeveral coalition members noted that the mosque site's developer, Sharif el-Gamal, modeled it after the Jewish Community Center on Manhattan's Upper West Side. It serves anyone who wishes to participate, they said, and so will the Muslim center near ground zero.", "images": ["https://web.archive.org/web/20100827015529im_/http://d.yimg.com/a/p/fox/20100826/videolthumb.fd47650e4725d091aef6ee61b25fb652.jpg?x=50&y=50&xc=91&yc=1&wc=230&hc=230&q=85&sig=c_Jxl0oAE.8V2LtVw2AgYA--", "https://web.archive.org/web/20100827015529im_/http://d.yimg.com/a/p/ap/20100826/videolthumb.2e9ec65e0013d97d7c772cd22e44af11.jpg?x=213&y=160&xc=1&yc=1&wc=399&hc=300&q=85&sig=pXnU8uF_N4pWlrd3wU8e.g--", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/i/us/nws/2008/news/us/assets/common/images/transparent.png", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/d/3c/d3cab07660067747d0ab663b9bc81cee.jpeg", "https://web.archive.org/web/20100827015529im_/http://d.yimg.com/a/p/rids/20100730/t/r2408591151.jpg?x=50&y=50&xc=21&yc=1&wc=90&hc=90&q=85&sig=_F5FiY_tcxB3TkP5ThwYYg--", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/4/01/401702d9ecd807cfa12311aff91b0755.jpeg", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/7/de/7de72c56a70de8f8c126fe16996341ef.jpeg", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/2/ed/2ed2bc5cd613c950b9d43c6da65ab7b2.jpeg", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/6/78/6788a9371d0e746a758c98541bdd187f.jpeg", "https://web.archive.org/web/20100827015529im_/http://d.yimg.com/a/p/ap/20100825/capt.a15668c55b3f460d99a22c904839eb48-a15668c55b3f460d99a22c904839eb48-0.jpg?x=213&y=140&xc=1&yc=1&wc=408&hc=268&q=85&sig=ygmFcm_79BdRisfh9IP80A--", "https://web.archive.org/web/20100827015529im_/http://d.yimg.com/a/p/fox/20100826/videolthumb.6972754579762cab46af50efd3a5de0d.jpg?x=50&y=50&xc=91&yc=1&wc=230&hc=230&q=85&sig=ELy4Mua3dnywXLtfR8Jt.g--", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/3/34/334fd3ae2d8ebf0655f15fca6345148f.jpeg", "https://web.archive.org/web/20100827015529im_/http://l.yimg.com/a/p/us/news/editorial/8/f0/8f0e0c4a96dbdbbc1893953a3611789a.jpeg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20100827015529/http://news.yahoo.com/s/ap/20100825/ap_on_re_us/us_nyc_mosque", "title": "9/11 families, others rally in favor of NYC mosque", "meta_data": {"fb": {"admins": 125098020842728}, "description": "The planned mosque and Islamic center blocks from ground zero got a new boost Wednesday from a coalition of supporters that includes families of Sept. 11 victims.", "keywords": "U.S. National,AP"}, "movies": [], "publish_date": 1282665600.0, "source": "https://web.archive.org", "summary": ""}