{"url": "https://www.independent.co.uk/arts-entertainment/films/news/frozen-2-release-date-sequel-return-cinemas-film-movie-launch-a7702461.html", "text": "Disney has issued release dates for a slew of major films including Frozen 2, the sequel to the barnstorming first instalment which is the highest-grossing animated movie of all time.\n\n27 November, 2019 is when it is scheduled to open in cinemas, exactly six years after Frozen bowed.\n\nThe long wait between films is, in part, down to Disney desperately wanting the sequel to live up to the hype.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n\"As with Pixar, when we do a sequel, it is because the filmmakers who created the original have created an idea that is so good that it's worthy of these characters,\" executive producer John Lasseter said in 2015, adding that the directors of Frozen had \"come up with a great idea for a sequel and you will be hearing a lot more about it, and we're taking you back to Arendelle.\"\n\nCo-director Chris Buck acknowledged how much is riding on the sequel, commenting: \"How do we live up to the phenomenon of the first one? There's a lot of pressure. And we'll put that on ourselves too; we'll be very demanding about how good this one has to be.\"\n\nKristen Bell meanwhile, the voice of Anna, has said that the script for Frozen 2 \"exudes quality\".\n\nFrozen is currently the ninth highest-grossing film of all time, having peaked at number five.\n\nDisney's full release schedule:\n\n2017 films\n\n5/5/17 GUARDIANS OF THE GALAXY VOL. 2 (3D)\n\n5/26/17 PIRATES OF THE CARIBBEAN: DEAD MEN TELL NO TALES (3D)\n\n6/16/17 CARS 3 (3D)\n\n11/3/17 THOR: RAGNAROK (3D)\n\nWed 11/22/17 COCO (3D)\n\n12/15/17 STAR WARS: THE LAST JEDI (3D)\n\n2018 films\n\n2/16/18 BLACK PANTHER (3D)\n\n3/9/18 A WRINKLE IN TIME (3D)\n\n4/6/18 MAGIC CAMP\n\n5/4/18 AVENGERS: INFINITY WAR (3D)\n\n5/25/18 UNTITLED HAN SOLO STAR WARS ANTHOLOGY FILM (3D)\n\n6/15/18 THE INCREDIBLES 2 (3D)\n\n7/6/18 ANT-MAN AND THE WASP (3D)\n\n8/3/18 UNTITLED DISNEY FAIRY TALE (Live Action)\n\n11/2/18 MULAN (Live Action) (3D)\n\nWed 11/21/18 RALPH BREAKS THE INTERNET: WRECK-IT RALPH 2 (3D)\n\nTues 12/25/18 MARY POPPINS RETURNS\n\nShape Created with Sketch. Which recent movies will become classics? Show all 21 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Which recent movies will become classics? 1/21 Birdman - Undoubtedly Alejandro G. Iñárritu’s masterpiece will surely be remembered for years to come - fiercely original in its concept, brave in its single take(esque) format and the perfect satire of a very specific and bizarre era of cinema we find ourselves in. What perhaps was so astonishing about this Best Picture Oscar winner was that in spite of its experimental format and lofty intentions, it still also managed to be hugely entertaining, and is eminently rewatchable. - Christopher Hooton Fox Searchlight Pictures 2/21 There Will Be Blood - Potentially Inherent Vice feels like it’s been forgotten already, The Master was great but too weighty for some, but There Will Be Blood is the Paul Thomas Anderson film that comes up time and time again in pub film conversations, whether they’re between cinephiles or more casual fans. A blank yet brutal indictment of lucre, Daniel Day Lewis gave one of his best ever performances as oil man Daniel Plainview, and Jonny Greenwood’s fearsome score is still being performed live several years after its release. But mainly, “I DRINK YOUR MILKSHAKE! I DRINK IT UP!” - CH 3/21 Avatar - Probably not It’s undeniable that James Cameron’s gargantuan blockbuster Avatar will find its place in the cinematic history books. With a worldwide gross of over 2.7 billion, it’s currently the highest earning film of all time - even Star Wars' The Force Awakens return couldn't topple it. But will it actually be remembered fondly? Its ground-breaking special effects already betray the first signs of aging, and though its use of 3D was revolutionary at the time, it’s now so pedestrian as to be found in a Glee concert movie. What is there to revere then? The patronising narrative re-hash of the plot to Dances With Wolves? Or the bit where two cat-aliens had sex by plugging their hair braids into each other? - Clarisse Loughrey 4/21 Whiplash - Within its own genre at least Whiplash was perhaps the most buzzy, \"have you seen it yet?\" film of 2014, and winning major Oscars off a budget of $3.3 million was no mean feat. Damien Chazelle managed to make a film about drumming absolutely edge-of-your-seat stuff, and succeeded by not patronising his audience - trusting that even if they didn’t understand the music theory detail, they would still be able to revel in it. Unfortunately, it might just be too small a film to be remembered as a ‘classic’, but will certainly be circling the top of ‘best movies about music’ lists for some years to come. - CH 5/21 Skyfall – Depends who’s Bond next Best Bond of all time? Skyfall’s slick, true, but its status as an icon seems heavily premature. We’re still clinging onto the Craig era, and it’s hard to argue that Skyfall doesn’t do the same; trading its entire dramatic tension on the premise that we’ve long been deeply attached to this grizzled Bond and equally grizzled M. In Silva’s personal vendetta, or in the neat metaphors of Skyfall Lodge’s crumbling exteriors and Bond’s crumbling interiors of a post-Vesper Lynd world; it’s only once the franchise has moved on to new pastures that we’ll truly start to see whether Skyfall can go the distance. Doesn’t help that Spectre was a bit of a disappointment, though. -CL 6/21 Mad Max: Fury Road - A gutsy yes Yes, it’s a madly confident move to already claim Fury Road’s going to a bonafide classic within its first year of release, but Fury Road is a mad movie. 36 years after its original incarnation, George Miller returned to the wasteland to conjure the greatest adrenaline hit of the cinematic decade. Breathlessly edited, hued with the colours of dust and dirt and rage; packed to the brim with practical stunt work unseen in the digital age. Plus, it’s a film that actively dismantles the patriarchy through a gun-slinging, metal-armed Charlize Theron. If it’s not remembered as one of the greatest blockbusters of its time, it’ll certainly be remembered as one of the gutsiest. - CL 7/21 The Great Beauty - No, but it damn well should be It won the Best Foreign Language Film Oscar in 2014, but this Paolo Sorrentino masterpiece is still unknown to most. It centres on a group of aging intellectuals partying on rooftops across Rome to Eurodance, and within this frame of superficiality it manages staggering profundity. The dialogue is rich, the cinematography sumptuous, and if Fellini is considered classic, this fellow Italian’s work certainly should be too. - CH 8/21 Little Miss Sunshine - Within its own genre, yes The ‘Sundance Effect’ has unfortunately developed a near plague of insufferable, self-conscious mawkishness over the years. Misfit boys finding new meaning to their existence in the arms of pink-haired manic pixie dream girls; sun-dappled bike rides as the latest band to feature a ukulele solo play softly in the distance. Some have indeed come off this false and cloying (Zach Braff’s Garden State), others smarter and keener (last year’s Me and Earl and the Dying Girl); but as the fires of kook devour all in sight, there will always remain one film left standing in the ashes: Jonathan Dayton and Valerie Faris’ Little Miss Sunshine. One scene that guarantees its elevation above the rabble sees teenager Dwayne (Paul Dano) realise he’s colour-blind, and thus will never be able to achieve his dream of becoming a jet fighter. Dano’s meltdown here is so raw, and so positively tragic, that it’ll be a hard job to ever forget that epic f-bomb as the years pass. - CL 9/21 Lost in Translation - I'll still be watching it in my 80s at least Really a perfect movie. The casting couldn't have been better and Sofia Coppola conveys the choking feeling of an overly air-conditioned hotel room like no-one else. So many of the shots were beautiful in their simplicity. Bill Murray making a nice crisp, clean golf shot before walking off down the course. The flower arranging scene. Bill lightly grabbing Scarlett Johansson's foot and this subtly serving as the film's 'kiss'. It's the unconventional romance at the heart of the film that makes it so great, though, which is as much about companionship as physical and emotional love. - CH 10/21 Crash - Hahahahahahahahaha Seriously, how did it win that Oscar? Even the director doesn't know. - CH 11/21 Pan’s Labyrinth - Absolutely Guillermo del Toro dreams on celluloid; he’s a weaver of fairy tales in an age where innocence is presumed dead. It’s through innocence, through innocent eyes, that we witness the darkest excesses of human nature in a way that so exposes the incomprehensibility of evil committed in the pursuit of power. Through young Ophelia’s perspective we watch the horrors of Franco’s Spanish regime play out, the barbaric cruelty of her stepfather Captain Vidal; she fears not the horned faun who lives in the labyrinth when it’s so clear her own patriarchal figurehead is the true monster. And though its finale may be heart-breaking, del Toro still allows innocence a certain victory. Victory through Ophelia’s eyes, those pure and hungry enough to see beyond the borders of her bleak reality to find an escape from the seemingly unstoppable monstrosities of adulthood. - CL Warner Bros. 12/21 I’m Still Here - When everyone realises its genius Initially admonished for being exploitative of Joaquin Phoenix’s ‘condition’, it was astonishing that, when this Casey Affleck-directed mockumentary was revealed to be a hoax, most critics didn’t give it a second review, and those who did still disliked it. In hindsight this was so much more than a prank. Phoenix stayed in character as a failed actor turned hip-hop artist for months on end. This dedication wasn’t for nothing either (unlikely say, DiCaprio in The Revenant), I’m Still Here is actually a very funny, moving and subtly satirical film, and definitely original. - CH 13/21 Boyhood - I doubt it While it too was an unprecedented piece of cinema, Boyhood for me faded from the memory very quickly. Dismissing this film as essentially a ‘puberty timelapse’ might be a little harsh, but the set-up did ultimately come off gimmicky and as a coming of age story it failed to resonate. Admirable, but not a ‘classic’ - CH Universal Pictures 14/21 The Social Network - Yes I was less than thrilled at the prospect of a movie about Facebook, but then pleasantly surprised upon watching it. A holy production trinity of David Fincher (director), Aaron Sorkin (screenwriter) and Trent Reznor (score) told a story that changed all of our lives with such panache. Texting, the internet, social media etc are so prosaic that many authors and filmmakers disingenuously leave them out of their stories, but here they were central and yet still the film was engrossing, stylish and human. - CH 15/21 Django Unchained - Hell yeah/hell maybe Swiping its titular character’s name from a 1966 Spaghetti Western directed by Sergio Corbucci, Tarantino utilised his trademark flair for ultra-violence and nihilistic humour to create the perfect meeting point between revisionism and classicism. Django channeled brutality in the name of righteous fury, allowing the freedom fighting slaves of a pre-Civil War Deep South their own legendary cowboy of the John Wayne or Clint Eastwood type. - CL 16/21 The Tree of Life - A few people will kid themselves it’s classic Terrence Malick’s experimental drama couldn’t really have been more ambitious or tried to chip away at a bigger chunk of existence. As such, it was automatically lauded by many who didn’t really know what to make of it, but looking back, was it worthy of the praise? The Brad-Pitt-is-a-family-man-in-the-50s plot strand was actually pretty unremarkable, and were it not for the brazenness of the extended shots of the universe being formed I doubt it would have made top ten lists the way it did. - CH 17/21 Her - Yes, as a historical document Films depicting the future remain fascinating decades later because they show, in retrospect, how we wanted the world to progress and what developments we simply couldn’t have conceived. As such Her will definitely still be getting talked about in years to come, whether or not we do indeed end up falling in love with our computers. (Also see: Ex Machina) - CH 18/21 Any of the space movies? Maybe Interstellar We seem to get a big budget space movie annually these days, and while none of them really have the creativity of Kubrick’s 2001: A Space Odyssey, Interstellar stands a chance of staying atop VOD libraries. Gravity and The Martian, while technically brilliant, were pretty forgettable, and don’t get me started on Sunshine. Interstellar was very impressive though, and if a Christopher Nolan film’s going to stand out I’d rather it be this one than… - CH 19/21 Inception - Please no Yes, it’s insanely watchable and the plot zips along nicely, but seriously, can we stop pretending people falling backwards off chairs and out of camp, alpine sub-dream worlds amounts to anything more than an overly convoluted, albeit pretty, action movie? - CH 20/21 The Wolf of Wall Street - Not compared to Scorsese’s earlier work If there’s a burden of the artistic revolutionary, it’s that revolution is only ever momentary in its form; Martin Scorsese made his mark back in 1973 with Mean Streets, and it’s one that’s been difficult to paint over in the 43 years which have since passed. The Wolf of Wall Street faults itself only in being pure Scorsese; it’s a film which trades purely in the breathless, macho style already so entrenched in cinematic culture. Essentially, Scorsese’s own genre-defining genius has doomed to obscurity any latter work which dares to fold into the director’s own natural form of expression; it’s made derivative any work which doesn’t actively rebel against what he’s been most celebrated for. A tough reality, but a reality nonetheless. - CL Paramount Pictures 21/21 Nymphomaniac - Maybe if Part II hadn’t happened Even the truest of arthouse directors are culpable for the whims of Hollywood franchises. Yes, with his dual Nymphomaniac films, Lars von Trier managed to ruin the potential classic of his career by needlessly stretching his narrative across two films; churning out the NC-17 answer to Peter Jackson’s Hobbit trilogy in the process. Strip Nymphomaniac of the controversy and media hysteria surrounding its use of pornographic actors in its sex scenes; and there’s a torn, throbbing soul at its centre. For all its salaciousness, von Trier’s exploration of the crippling effects of shame society burdens those, especially its women, who dare seek sexual pleasure is genuinely haunting. That’s in Part I, however; by the time Joe’s life story sees her grow from Stacy Martin into Charlotte Gainsbourg, von Trier’s epic dissolves into the bang of a drum in continuous, endless cycles. She’s horny and sad; we got it, Lars. - CL 1/21 Birdman - Undoubtedly Alejandro G. Iñárritu’s masterpiece will surely be remembered for years to come - fiercely original in its concept, brave in its single take(esque) format and the perfect satire of a very specific and bizarre era of cinema we find ourselves in. What perhaps was so astonishing about this Best Picture Oscar winner was that in spite of its experimental format and lofty intentions, it still also managed to be hugely entertaining, and is eminently rewatchable. - Christopher Hooton Fox Searchlight Pictures 2/21 There Will Be Blood - Potentially Inherent Vice feels like it’s been forgotten already, The Master was great but too weighty for some, but There Will Be Blood is the Paul Thomas Anderson film that comes up time and time again in pub film conversations, whether they’re between cinephiles or more casual fans. A blank yet brutal indictment of lucre, Daniel Day Lewis gave one of his best ever performances as oil man Daniel Plainview, and Jonny Greenwood’s fearsome score is still being performed live several years after its release. But mainly, “I DRINK YOUR MILKSHAKE! I DRINK IT UP!” - CH 3/21 Avatar - Probably not It’s undeniable that James Cameron’s gargantuan blockbuster Avatar will find its place in the cinematic history books. With a worldwide gross of over 2.7 billion, it’s currently the highest earning film of all time - even Star Wars' The Force Awakens return couldn't topple it. But will it actually be remembered fondly? Its ground-breaking special effects already betray the first signs of aging, and though its use of 3D was revolutionary at the time, it’s now so pedestrian as to be found in a Glee concert movie. What is there to revere then? The patronising narrative re-hash of the plot to Dances With Wolves? Or the bit where two cat-aliens had sex by plugging their hair braids into each other? - Clarisse Loughrey 4/21 Whiplash - Within its own genre at least Whiplash was perhaps the most buzzy, \"have you seen it yet?\" film of 2014, and winning major Oscars off a budget of $3.3 million was no mean feat. Damien Chazelle managed to make a film about drumming absolutely edge-of-your-seat stuff, and succeeded by not patronising his audience - trusting that even if they didn’t understand the music theory detail, they would still be able to revel in it. Unfortunately, it might just be too small a film to be remembered as a ‘classic’, but will certainly be circling the top of ‘best movies about music’ lists for some years to come. - CH 5/21 Skyfall – Depends who’s Bond next Best Bond of all time? Skyfall’s slick, true, but its status as an icon seems heavily premature. We’re still clinging onto the Craig era, and it’s hard to argue that Skyfall doesn’t do the same; trading its entire dramatic tension on the premise that we’ve long been deeply attached to this grizzled Bond and equally grizzled M. In Silva’s personal vendetta, or in the neat metaphors of Skyfall Lodge’s crumbling exteriors and Bond’s crumbling interiors of a post-Vesper Lynd world; it’s only once the franchise has moved on to new pastures that we’ll truly start to see whether Skyfall can go the distance. Doesn’t help that Spectre was a bit of a disappointment, though. -CL 6/21 Mad Max: Fury Road - A gutsy yes Yes, it’s a madly confident move to already claim Fury Road’s going to a bonafide classic within its first year of release, but Fury Road is a mad movie. 36 years after its original incarnation, George Miller returned to the wasteland to conjure the greatest adrenaline hit of the cinematic decade. Breathlessly edited, hued with the colours of dust and dirt and rage; packed to the brim with practical stunt work unseen in the digital age. Plus, it’s a film that actively dismantles the patriarchy through a gun-slinging, metal-armed Charlize Theron. If it’s not remembered as one of the greatest blockbusters of its time, it’ll certainly be remembered as one of the gutsiest. - CL 7/21 The Great Beauty - No, but it damn well should be It won the Best Foreign Language Film Oscar in 2014, but this Paolo Sorrentino masterpiece is still unknown to most. It centres on a group of aging intellectuals partying on rooftops across Rome to Eurodance, and within this frame of superficiality it manages staggering profundity. The dialogue is rich, the cinematography sumptuous, and if Fellini is considered classic, this fellow Italian’s work certainly should be too. - CH 8/21 Little Miss Sunshine - Within its own genre, yes The ‘Sundance Effect’ has unfortunately developed a near plague of insufferable, self-conscious mawkishness over the years. Misfit boys finding new meaning to their existence in the arms of pink-haired manic pixie dream girls; sun-dappled bike rides as the latest band to feature a ukulele solo play softly in the distance. Some have indeed come off this false and cloying (Zach Braff’s Garden State), others smarter and keener (last year’s Me and Earl and the Dying Girl); but as the fires of kook devour all in sight, there will always remain one film left standing in the ashes: Jonathan Dayton and Valerie Faris’ Little Miss Sunshine. One scene that guarantees its elevation above the rabble sees teenager Dwayne (Paul Dano) realise he’s colour-blind, and thus will never be able to achieve his dream of becoming a jet fighter. Dano’s meltdown here is so raw, and so positively tragic, that it’ll be a hard job to ever forget that epic f-bomb as the years pass. - CL 9/21 Lost in Translation - I'll still be watching it in my 80s at least Really a perfect movie. The casting couldn't have been better and Sofia Coppola conveys the choking feeling of an overly air-conditioned hotel room like no-one else. So many of the shots were beautiful in their simplicity. Bill Murray making a nice crisp, clean golf shot before walking off down the course. The flower arranging scene. Bill lightly grabbing Scarlett Johansson's foot and this subtly serving as the film's 'kiss'. It's the unconventional romance at the heart of the film that makes it so great, though, which is as much about companionship as physical and emotional love. - CH 10/21 Crash - Hahahahahahahahaha Seriously, how did it win that Oscar? Even the director doesn't know. - CH 11/21 Pan’s Labyrinth - Absolutely Guillermo del Toro dreams on celluloid; he’s a weaver of fairy tales in an age where innocence is presumed dead. It’s through innocence, through innocent eyes, that we witness the darkest excesses of human nature in a way that so exposes the incomprehensibility of evil committed in the pursuit of power. Through young Ophelia’s perspective we watch the horrors of Franco’s Spanish regime play out, the barbaric cruelty of her stepfather Captain Vidal; she fears not the horned faun who lives in the labyrinth when it’s so clear her own patriarchal figurehead is the true monster. And though its finale may be heart-breaking, del Toro still allows innocence a certain victory. Victory through Ophelia’s eyes, those pure and hungry enough to see beyond the borders of her bleak reality to find an escape from the seemingly unstoppable monstrosities of adulthood. - CL Warner Bros. 12/21 I’m Still Here - When everyone realises its genius Initially admonished for being exploitative of Joaquin Phoenix’s ‘condition’, it was astonishing that, when this Casey Affleck-directed mockumentary was revealed to be a hoax, most critics didn’t give it a second review, and those who did still disliked it. In hindsight this was so much more than a prank. Phoenix stayed in character as a failed actor turned hip-hop artist for months on end. This dedication wasn’t for nothing either (unlikely say, DiCaprio in The Revenant), I’m Still Here is actually a very funny, moving and subtly satirical film, and definitely original. - CH 13/21 Boyhood - I doubt it While it too was an unprecedented piece of cinema, Boyhood for me faded from the memory very quickly. Dismissing this film as essentially a ‘puberty timelapse’ might be a little harsh, but the set-up did ultimately come off gimmicky and as a coming of age story it failed to resonate. Admirable, but not a ‘classic’ - CH Universal Pictures 14/21 The Social Network - Yes I was less than thrilled at the prospect of a movie about Facebook, but then pleasantly surprised upon watching it. A holy production trinity of David Fincher (director), Aaron Sorkin (screenwriter) and Trent Reznor (score) told a story that changed all of our lives with such panache. Texting, the internet, social media etc are so prosaic that many authors and filmmakers disingenuously leave them out of their stories, but here they were central and yet still the film was engrossing, stylish and human. - CH 15/21 Django Unchained - Hell yeah/hell maybe Swiping its titular character’s name from a 1966 Spaghetti Western directed by Sergio Corbucci, Tarantino utilised his trademark flair for ultra-violence and nihilistic humour to create the perfect meeting point between revisionism and classicism. Django channeled brutality in the name of righteous fury, allowing the freedom fighting slaves of a pre-Civil War Deep South their own legendary cowboy of the John Wayne or Clint Eastwood type. - CL 16/21 The Tree of Life - A few people will kid themselves it’s classic Terrence Malick’s experimental drama couldn’t really have been more ambitious or tried to chip away at a bigger chunk of existence. As such, it was automatically lauded by many who didn’t really know what to make of it, but looking back, was it worthy of the praise? The Brad-Pitt-is-a-family-man-in-the-50s plot strand was actually pretty unremarkable, and were it not for the brazenness of the extended shots of the universe being formed I doubt it would have made top ten lists the way it did. - CH 17/21 Her - Yes, as a historical document Films depicting the future remain fascinating decades later because they show, in retrospect, how we wanted the world to progress and what developments we simply couldn’t have conceived. As such Her will definitely still be getting talked about in years to come, whether or not we do indeed end up falling in love with our computers. (Also see: Ex Machina) - CH 18/21 Any of the space movies? Maybe Interstellar We seem to get a big budget space movie annually these days, and while none of them really have the creativity of Kubrick’s 2001: A Space Odyssey, Interstellar stands a chance of staying atop VOD libraries. Gravity and The Martian, while technically brilliant, were pretty forgettable, and don’t get me started on Sunshine. Interstellar was very impressive though, and if a Christopher Nolan film’s going to stand out I’d rather it be this one than… - CH 19/21 Inception - Please no Yes, it’s insanely watchable and the plot zips along nicely, but seriously, can we stop pretending people falling backwards off chairs and out of camp, alpine sub-dream worlds amounts to anything more than an overly convoluted, albeit pretty, action movie? - CH 20/21 The Wolf of Wall Street - Not compared to Scorsese’s earlier work If there’s a burden of the artistic revolutionary, it’s that revolution is only ever momentary in its form; Martin Scorsese made his mark back in 1973 with Mean Streets, and it’s one that’s been difficult to paint over in the 43 years which have since passed. The Wolf of Wall Street faults itself only in being pure Scorsese; it’s a film which trades purely in the breathless, macho style already so entrenched in cinematic culture. Essentially, Scorsese’s own genre-defining genius has doomed to obscurity any latter work which dares to fold into the director’s own natural form of expression; it’s made derivative any work which doesn’t actively rebel against what he’s been most celebrated for. A tough reality, but a reality nonetheless. - CL Paramount Pictures 21/21 Nymphomaniac - Maybe if Part II hadn’t happened Even the truest of arthouse directors are culpable for the whims of Hollywood franchises. Yes, with his dual Nymphomaniac films, Lars von Trier managed to ruin the potential classic of his career by needlessly stretching his narrative across two films; churning out the NC-17 answer to Peter Jackson’s Hobbit trilogy in the process. Strip Nymphomaniac of the controversy and media hysteria surrounding its use of pornographic actors in its sex scenes; and there’s a torn, throbbing soul at its centre. For all its salaciousness, von Trier’s exploration of the crippling effects of shame society burdens those, especially its women, who dare seek sexual pleasure is genuinely haunting. That’s in Part I, however; by the time Joe’s life story sees her grow from Stacy Martin into Charlotte Gainsbourg, von Trier’s epic dissolves into the bang of a drum in continuous, endless cycles. She’s horny and sad; we got it, Lars. - CL\n\n2019 films\n\n3/8/19 CAPTAIN MARVEL (3D)\n\n3/29/19 UNTITLED DISNEY FAIRY TALE (Live Action)\n\n4/12/19 UNTITLED DISNEYTOON STUDIOS\n\n5/3/19 UNTITLED AVENGERS (3D)\n\n5/24/19 STAR WARS: EPISODE IX (3D)\n\n6/21/19 TOY STORY 4 (3D)\n\n7/19/19 THE LION KING (Live Action) (3D)\n\n8/9/19 UNTITLED DISNEY LIVE ACTION\n\n11/8/19 UNTITLED DISNEY FAIRY TALE (Live Action)\n\nWed 11/27/19 FROZEN 2 (3D)\n\n12/20/19 UNTITLED DISNEY FAIRY TALE (Live Action)\n\n2020 films\n\n3/13/20 UNTITLED PIXAR ANIMATION (3D)\n\n4/3/20 UNTITLED DISNEY LIVE ACTION\n\n5/1/20 UNTITLED MARVEL (3D)\n\n6/19/20 UNTITLED PIXAR ANIMATION (3D)\n\n7/10/20 UNTITLED INDIANA JONES\n\n8/7/20 UNTITLED MARVEL (3D)\n\n11/6/20 UNTITLED MARVEL (3D)\n\nWed 11/25/20 GIGANTIC (3D)\n\n2021 films\n\n3/12/21 UNTITLED DISNEY LIVE ACTION\n\n6/18/21 UNTITLED PIXAR ANIMATION (3D)\n\nWed 11/24/21 UNTITLED DISNEY ANIMATION (3D)", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/26/08/frozen2.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/26/08/frozen2.jpg", "keywords": [], "authors": ["Christopher Hooton"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/news/frozen-2-release-date-sequel-return-cinemas-film-movie-launch-a7702461.html", "title": "Frozen 2 release date: Disney sets a day for highly-anticipated sequel", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/films/news/frozen-2-release-date-sequel-return-cinemas-film-movie-launch-a7702461.html", "title": "Frozen 2 finally has a release date", "description": "Kristen Bell will reprise the role of Princess Anna", "updated_time": "2017-04-26T08:56:07+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/04/26/08/frozen2.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7702461"}, "description": "Disney has issued release dates for a slew of major films including Frozen 2, the sequel to the barnstorming first instalment which is the highest-grossing animated movie of all time. 27 November, 2019 is when it is scheduled to open in cinemas, exactly six years after Frozen bowed.", "keywords": "Frozen 2, Frozen, Disney, News, Film, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Frozen 2", "published_time": "2017-04-26T08:46:00+01:00", "modified_time": "2017-04-26T08:56:07+01:00", "section": "News", "author_name": "Christopher Hooton", "content_type": "story", "word_count": 403, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 4, "external_link_count": 0}, "twitter": {"title": "Frozen 2 finally has a release date", "description": "Disney has issued release dates for a slew of major films including Frozen 2, the sequel to the barnstorming first instalment which is the highest-grossing animated movie of all time. 27 November,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1493192760.0, "source": "https://www.independent.co.uk", "summary": ""}