{"url": "www.thecut.com/2018/04/equal-pay-day-celebrities-hollywood.html", "text": "Photo: Getty Images\n\nWe’ve come a long way from Patricia Arquette’s 2015 Oscars speech to now. Since that watershed moment — when Arquette addressed the wage gap on live TV, in front of the entire industry — actors and actresses have continued to speak out about pay inequality in Hollywood and around the country, to draw attention to the pay gaps that affect women everywhere. Their conversations expand to include discussions on race in the negotiating room, including men in salary conversations, and hard-won advice on how to ask for a raise.\n\n2015: The Year of the Sony Hack and Patricia Arquette’s Milestone Speech\n\n\n\n\n\nActress Patricia Arquette accepts the award for Best Actress in a Supporting Role for ‘Boyhood’ onstage during the 87th Annual Academy Awards at Dolby Theatre on February 22, 2015 in Hollywood, California. Photo: Kevin Winter/Getty Images\n\nPatricia Arquette, February 2015: “It’s our time to have wage equality once and for all.”\n\nAfter stepping onstage to receive the Best Supporting Actress award for her role in Boyhood, Arquette’s three-minute speech permanently shifted pay inequality into the media’s limelight, invigorating female actresses to speak up on the issue over the course of the year.\n\n“To every woman who gave birth to every taxpayer and citizen of this nation, we have fought for everybody else’s equal rights,” Arquette said in her speech. “It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”\n\nThe subsequent outpouring of criticism and support alike prompted Arquette to publish an op-ed in The Hollywood Reporter at the end of the year, titled “What Happened After My Oscar Speech on Pay Inequality,” in which she detailed her mistakes in the speech, such as not distinguishing women of color in the discussion, and outlined her hopes for the future.\n\nKerry Washington, April 2015, The #Ask4More Campaign: “When we step up for ourselves, we create opportunity.”\n\nIn honor of Equal Pay Day, Washington tweeted an image of herself with the caption “Equal pay for Equal Work” and Levo’s #Ask4more campaign, an initiative that encourages women to request higher salaries and end the gender wage gap.\n\nJudy Greer, May 2015: “I am terrified to be deemed ‘difficult.’”\n\nEmboldened by Arquette’s Oscars speech and the ensuing media attention on the wage gap in Hollywood, Greer published her own op-ed in Glamour, motivating other women in the industry to speak up.\n\n“I was raised to never talk about money, so I never ask for more. I am terrified to be deemed ‘difficult,’ and I don’t think I’m the only woman with that fear. I may not be able to single-handedly fix the pay gap, but I can open my stepdaughter’s eyes to it. I can encourage her to negotiate, ask questions, and stand up for herself. I can remind myself to try that too.”\n\nNicki Minaj, May 2015: “Do your research.”\n\nIn an intimate interview with Cosmo, the rapper discussed all things sex, power, and, of course, money, stressing how she’s never held back in any category. “Women are uncomfortable talking about money. I know it’s taboo to discuss it at work. But you need to know what people around you are making. Otherwise, you’re not going to know what you’re worth. You have to ask questions. Do your research. I’ve always been pretty competitive in terms of my pay.”\n\nFrances McDormand, winner of the Best Actress award for ‘Three Billboards Outside Ebbing, Missouri’ poses during the 90th Annual Academy Awards on March 4, 2018 in Hollywood, California. Photo: Steve Granitz/WireImage\n\nFrances McDormand, May 2015: “We’ve never been paid commensurately.”\n\nWell before her “inclusion rider” speech, McDormand delivered honest and blunt jabs at the industry’s treatment of some of its highest-paid actresses, who McDormand claimed still probably only get paid a fraction of what their male equivalents do. She went on to discuss her salary for her role in Transformers 3. “I’m glad I did that film and I’m proud that I finally got paid what I was told I was worth by the industry,” she said at the Cannes Film Festival’s Women in Motion panel. “But that is nothing. That is a tenth of what most males my age, with my experience and my reputation as a film actor, make. We’ve never been paid commensurately and that has to change.”\n\nCharlize Theron, May 2015: “They did not fight it.”\n\nEarlier in the year, Theron had successfully negotiated a pay raise to match that of co-star Chris Hemsworth in the upcoming sequel for Snow White and the Huntsman. “I have to give them credit because once I asked, they said yes,” she told Elle U.K. in a cover story. “They did not fight it. And maybe that’s the message: that we just need to put our foot down. If you’re doing the same job, you should be compensated and treated in the same way.”\n\nAmanda Seyfried, July 2015: He was “pretty even in status.”\n\nFollowing in Jennifer Lawrence’s and Charlize Theron’s footsteps, Seyfried told the Sunday Times about the wage discrepancy on the set of one of her films, where a male co-star whom she described as “pretty even in status” with her was making exactly ten times more than she was.\n\n“I think people think that just because I’m easygoing and game to do things I’ll just take as little as they offer,” she said. “It’s not about how much you get; it’s about how fair it is.”\n\nNominee for Best Supporting Actress in ‘American Hustle’ Jennifer Lawrence poses on the red carpet at the 86th Academy Awards on March 2nd, 2014 in Hollywood, California. Photo: FREDERIC J. BROWN/AFP/Getty Images\n\nJennifer Lawrence, October 2015: The Lenny Letter\n\nIn November 2014, the Sony hack leaks made international news as confidential emails, company secrets, and, yes, individual salaries were publicly disclosed. Lawrence, alongside Amy Adams and Natalie Portman, was among those who discovered their pay had been significantly lower than their male counterparts’ in Oscar-nominated films. This prompted Lawrence to write an essay in Lena Dunham’s Lenny Letter on the wage disparity, titled “Why Do I Make Less Than My Male Co-stars?” Lawrence drew praise and criticism alike for her willingness to speak out.\n\n“I didn’t want to seem ‘difficult’ or ‘spoiled,’” she wrote. “At the time, that seemed like a fine idea, until I saw the payroll on the Internet and realized every man I was working with definitely didn’t worry about being ‘difficult’ or ‘spoiled.’”\n\nBradley Cooper, October 2015: “There’s a double standard.”\n\nAs Lawrence’s recurring co-star and longtime friend, Bradley Cooper gave Entertainment Tonight an interview the same day J.Law’s Lenny Letter was published, rallying in her support. “There’s a double standard in the whole world. This is just one aspect. Anytime there’s a place where a voice can come out and be outspoken — something Sienna (Miller) did, or Jennifer (Lawrence) — that’s great. … I think it is making a difference.”\n\nSalma Hayek, October 2015: “This is a problem that is in every single industry.”\n\nAn honoree at Variety’s Power of Women luncheon alongside Beyoncé and Gucci, for her work with the Chime for Change women’s empowerment project, Hayek gave an emotional, rousing speech on the sexism women faced in the industry, praising Patricia Arquette’s Oscars speech for addressing pay disparity in Hollywood.\n\n“This is a problem that is in every single industry. If you have the same capacities and you are doing the same job, it is criminal not to pay the same salary. We are such an economical power, women in the country. We represent such a strong part of the audience that they cannot ignore us anymore.”\n\nGwyneth Paltrow, October 2015: “Your salary is a way to quantify what you’re worth.”\n\nWhen it came to being honest about her thoughts on male co-star Robert Downey Jr.’s paycheck for Iron Man, Gwyneth Paltrow didn’t hold back during an interview with Variety. “Look, nobody is worth the money that Robert Downey Jr. is worth, but if I told you the disparity you would probably be surprised,” she said. “Your salary is a way to quantify what you’re worth. If men are being paid a lot more for doing the same thing, it feels shitty.”\n\nSharon Stone, November 2015: “No one wanted to pay me.”\n\nHer performance in 1992’s Basic Instinct made her a household name, but Stone didn’t reap many of the financial benefits that can come with fame. At the Celebration of Hope event during Miami Fashion Week, she gave a speech to the audience. “No one wanted to pay me. I remember sitting in my kitchen with my manager and just crying and saying: ‘I’m not going to work until I get paid.’ I still got paid so much less than any men.”\n\nSandra Bullock, November 2015: “Why is it that no one is standing up and saying you can’t say that about a woman?”\n\nFor Variety’s cover story on income disparity, Bullock depicted the wage-gap issue as part of the holistic and fundamentally flawed way women in Hollywood are perceived. “I keep saying, “Why is it that no one is standing up and saying you can’t say that about a woman?” … We’re going to walk down the red carpet, I’m going to be asked about my dress and my hair while the man standing next to me will be asked about his performance and political issues. Once we start shifting how we perceive women and stop thinking about them as ‘less than,’ the pay disparity will take care of itself.”\n\nCarey Mulligan, November 2015: “She has an enormous platform.”\n\nThe actress defended Jennifer Lawrence’s outspoken stance and advocacy for equal pay within the industry after the Sony-hack leaks, telling Deadline: “The discrepancy is inherently unfair and she has an enormous platform to speak out against it. Men in Hollywood look up to her because she is powerful. She’s using that platform to correct something that isn’t right. It’s a long-overdue conversation and it’s admirable what she has done.”\n\nKathy Griffin, November 2015: “It was an all-out brawl.”\n\nGriffin is a veteran in the art of negotiating salaries, but that doesn’t mean her feats came easily. During her breakout role in NBC’s 1996 Suddenly Susan, Griffin discovered she made nearly four times less than a male co-star. After her own agents repeatedly dismissed her, she went directly to Warner Bros. TV chief Peter Roth and demanded a raise. “It was an all-out brawl,” she told Variety. “I got a raise, but I still didn’t make equal to what the guys were making.”\n\nTen years later, an Emmy-winning Griffin had twice the confidence to ask NBC co-chairman Ben Silverman for a pay hike for her part on the Bravo reality series My Life on the D-List. “I’ve been doing this shit on my own forever,” she said in the Variety interview. “I’ve never been paid what the guys get. Ever. It’s not getting better for me.”\n\nToni Colette, November 2015: “Money is genderless.”\n\nOn HuffPost Live, joined by actresses Jennifer Lawrence, Jessica Chastain, and Amanda Seyfried, Toni Colette didn’t hold back when commenting on the wage disparity in Hollywood. “It’s a fucking sexist industry. I don’t understand why genitalia makes a difference. Creativity is creativity. Creativity is genderless. Money is genderless.”\n\nCate Blanchett, December 2015: “The industry has the same conversation every year.”\n\nFollowing her Oscars acceptance speech for her role in Blue Jasmine, Blanchett became a figurehead for the feminist movement in Hollywood that aimed to put women in leading cinematographic roles. When asked about pay equality, however, Blanchett believed there was all talk and no walk. “It just feels like the industry has the same conversation every year, it’s a fabulous conversation, but we’ll be back here like Groundhog Day next year having the same fucking symposium,” she told GQ. “It just has to shift.”\n\nElection Year 2016: A Hamilton Rap, Race in the Negotiating Room, and the House of Cards Controversy\n\nChris Rock, January 2016: “If she was black, she’d really have something to complain about.”\n\nSpeaking to The New Yorker about Leslie Jones’s road to success, Chris Rock, who met Jones in the late ’80s when the two were comics on the road, reintroduced the racial dynamics of pay equality for women. “Black women have the hardest gig in show business. You hear Jennifer Lawrence complaining about getting paid less because she’s a woman — if she was black, she’d really have something to complain about.”\n\nViola Davis attends PaleyLive NY: ‘How To Get Away With Murder’ at The Paley Center for Media on November 12, 2015 in New York City. Photo: Jamie McCarthy/Getty Images\n\nViola Davis, February 2016: “The struggle for us as women of color is just to be seen the same as our white female counterparts.”\n\nIn a Q&A with Mashable, Davis broached the equal-pay subject through the lens of African-American women. Stressing the different playing fields between white and black women, Davis emphasized the additional hurdles that women of color face regarding the wage gap.\n\n“The struggle for us as women of color is just to be seen the same as our white female counterparts. Forget the men! We’re not even in that realm yet. It’s like talking to someone who lives in poverty! ‘You don’t want that Bentley?’ They’re like ‘Shoot, I’m just trying to get bus fare money.’”\n\nLin Manuel-Miranda, March 2016: “Yo, it’s Lin.”\n\nThe Hamilton writer, director, producer, and actor rapped while actress and ambassador to the U.N. Emma Watson beatboxed in a promotional video for the HeForShe Campaign founded by U.N. women, filmed around International Women’s Day of that year.\n\n“Yo, it’s Lin and I have to laugh, how can we not be equal, we’re like half. Like women are half of the people on Earth. And yes they should’ve been equal since birth. That means all day, every day, equal pay, every way.”\n\nRobin Wright, May 2016: “I was like, ‘You better pay me or I’m going to go public.’”\n\nTaking a page from Claire Underwood’s handbook, Robin Wright told Netflix she’d go public if they did not pay her as much as co-star Kevin Spacey for her role in House of Cards. “There are very few films or TV shows where the male, the patriarch, and the matriarch are equal,” she said in a human rights discussion at the Rockefeller Foundation. “And they are in House of Cards. Claire Underwood’s character was more popular than [Frank’s] for a period of time, so I capitalized on it. I was like, ‘You better pay me or I’m going to go public.’ And they did.’”\n\nAmy Adams, November 2016: “I don’t want to be a headline anymore.”\n\nDuring one of The Hollywood Reporter’s recurring roundtable series, actresses Amy Adams, Taraji P. Henson, Natalie Portman, Emma Stone, Annette Bening, Naomie Harris, and Isabelle Huppert discussed a number of topics regarding women in the entertainment industry. When asked about equal pay, Adams sought to redirect the question.\n\n“We are always put on the chopping block to put our opinion out there. I’m like, “Why don’t you ask [the producers] and then have their statements be the headlines in the press? I don’t want to be a headline anymore about pay equality.”\n\nWilliam H. Macy with Emmy Rossum, December 2016: “It’s unconscionable.”\n\nWhen Emmy Rossum joined the cast of Shameless in 2011, she had no intentions of being paid as much as the veteran, Oscar-nominated actor William H. Macy. However, as the show’s popularity grew exponentially, so did Rossum’s presence and importance to the plot line, prompting her to ask for equal pay. Both Rossum and Macy spoke about the subject at a panel at the Vulture Festival. “As the time went on, the leadership role started to feel somewhat shared,” Rossum said. “I just felt that I love the show, I love everyone in it, I want to keep doing it, but I just wanted it to feel right.”\n\nMacy wholeheartedly supported and agreed with Rossum’s sentiments, giving his own opinion on the matter. “It’s unconscionable they would pay a woman less for the same job,” Macy said at the panel. “It’s show biz’s job to get us for as cheaply as they can — and our job to say no.” That same month, it was confirmed Rossum would receive equal pay going forward.\n\n2017: Oprah Winfrey’s Power Move, Emma Stone on Men, and E!’s Wage Gap Scandal\n\nNatalie Portman, January 2017: “I knew and I went along with it.”\n\nIn an interview for Marie Claire’s cover, Portman revealed she was paid three times less than her male co-star, Ashton Kutcher, for the hit rom-com No Strings Attached. “I knew and I went along with it because there’s this thing with ‘quotes’ in Hollywood… His [quote] was three times higher than mine so they said he should get three times more. I wasn’t as pissed as I should have been. The disparity is crazy.”\n\nPriyanka Chopra, May 2017: “I’m still used to being paid a lot less than the boys.”\n\nThe actress got her big break as the lead in the hit series Quantico, and was to star in the highly anticipated reboot of Baywatch, when she told Glamour about her refusal to be typecast as the exotic Indian female character, and the struggles that came with being a woman in the male-dominated industry.\n\n“I was told that female actors are replaceable in films because they just stand behind a guy anyway. I’m still used to being paid — like most actresses around the world — a lot less than the boys. We’re told we’re too provocative or that being sexy is our strength, which it can be, and it is, but that’s not the only thing we have.”\n\nEmma Stone, July 2017: “I’ve needed my male co-stars to take a pay cut.”\n\nStone spoke to Out magazine about her portrayal of Billie Jean King in Battle of the Sexes, a film about the most-watched televised sporting event of all time, between King and Bobby Riggs. In the film, King struggles with her own sexuality as her husband urges her to fight for equal pay. Stone reflected on the ongoing realities of the situation in her personal career, and as an actress in Hollywood at large.\n\n“I’ve needed my male co-stars to take a pay cut so that I may have parity with them. And that’s something they do for me because they feel it’s what’s right and fair. That’s something that’s also not discussed, necessarily — that our getting equal pay is going to require people to selflessly say, ‘That’s what’s fair.’”\n\nOprah Winfrey attends the European Premiere of ‘A Wrinkle In Time’ at BFI IMAX on March 13, 2018 in London, England Photo: Mike Marsland/Mike Marsland/WireImage\n\nOprah Winfrey, August 2017: “I will not work unless they get paid.”\n\nIn an interview with Time magazine, Oprah revealed the barriers she faced when trying to get her female producers on The Oprah Winfrey Show higher salaries to match the show’s growing success. “I went to my boss at the time and I said ‘Everybody needs a raise,’ And he said, ‘Why?’ He actually said to me, ‘They’re only girls. They’re a bunch of girls — what do they need more money for?’ I go, ‘Well, either they’re going to get raises, or I’m going to sit down.’ I will not work unless they get paid.’”\n\nWinfrey’s determination forced the owners to increase here female colleagues’ salaries. She paid them out of her own pocket while waiting for her request to be processed and finalized.\n\nCatt Sadler, December 2017, E!’s wage gap scandal: “How can I remain silent?”\n\nFollowing the discovery that her E! co-host Jason Kennedy had been making nearly twice her salary despite similar work histories, Catt Sadler attempted to negotiate a raise that more closely resembled Kennedy’s yearly wage. After her team’s requests were repeatedly denied, Sadler decided to leave the network, releasing a statement on her personal website to explain her decision.\n\n“Know your worth. How can I operate with integrity and stay on at E if they’re not willing to pay me the same as him? Or at least come close? How can I accept an offer that shows they do not value my contributions and paralleled dedication all these years? How can I not echo the actions of my heroes and stand for what is right no matter what the cost? How can I remain silent when my rights under the law have been violated?”\n\n2018: The Harvey Weinstein Reckoning, #MeToo, and Time’s Up\n\n(L-R) Reese Witherspoon, Eva Longoria, Salma Hayek and Ashley Judd arrives at the 75th Annual Golden Globe Awards at The Beverly Hilton Hotel on January 7, 2018 in Beverly Hills, California. Photo: Steve Granitz/WireImage\n\nThe 2018 Golden Globes: Time’s Up Stands With Catt Sadler\n\nGiven the then-recent blow to E!’s reputation following Catt Sadler’s departure, many celebrities weren’t thrilled to have it aired at the 2018 Golden Globes, particularly people dedicated to the #TimesUp and #MeToo movements, with all attendees dressed in black as a sign of respect and of dissent against the industry’s long-prevailing sexist standards. As a result, many female actresses took to social media or, while speaking with an E! host on the red carpet, called out the network in a show of support for Sadler and the equal pay movement. Here are the women who spoke on camera:\n\nAmy Schumer on Instagram: “If you’re on the carpet tonight or at home post in support and ask @eentertainment what happened? We thought you would be for pay equality and say #imwithcattsad.”\n\nEva Longoria to E! News’ Ryan Seacrest, standing between Nicole Kidman and Reese Witherspoon: “We’re here for Time’s Up, we support gender equity and equal pay, and we hope that E! follows that lead with Catt as well. We stand with you, Catt.”\n\nDebra Messing to E! News’ Giuliana Ransic: “I was so shocked to hear that E! doesn’t believe in paying their female co-hosts the same as their male co-hosts. We want people to start having this conversation that women are just as valuable as men.”\n\nLaura Dern to Seacrest: “We need the powers that be, and all the industries, and all the networks, and E!, to help us with closing this pay gender gap.”\n\nSarah Jessica Parker to Seacrest: “Equality, parity, and safe work environments for men and women across all industries are key; I know it’s affected your network.”\n\nMichelle Williams, January 2018, All the Money in the World Controversy: “Today isn’t about me.”\n\nWilliams learned she made less than one percent of what her co-star Mark Wahlberg made for All the Money in the World’s reshoots, following Kevin Spacey’s dismissal amid multiple sexual misconduct allegations. Wahlberg earned $1.5 million for the scenes collectively, while she received $80 per day, resulting in about $1,000 total. Williams was overcome with support by the community of women rallying around Time’s Up. Wahlberg announced he would donate his $1.5 million to the Times Up Legal Defense Fund, and Williams made a statement of her own.\n\n“Today isn’t about me, my fellow actresses stood by me and stood up for me, my activist friends taught me to use my voice, and the most powerful men in charge, they listened and they acted,” she said.\n\nEllen Pompeo, January 2018: “I’m not going to let a guy drive me out of my own house.”\n\nOpening up about her fight for equal pay behind the scenes of Grey’s Anatomy, Pompeo told The Hollywood Reporter about the importance of power leverage and ultimatums when it comes to negotiating. “At one point, I asked for $5,000 more than [Patrick Dempsey] just on principle, because the show is Grey’s Anatomy and I’m Meredith Grey. They wouldn’t give it to me. And I could have walked away, so why didn’t I? You feel conflicted but then you figure, ‘I’m not going to let a guy drive me out of my own house.’”\n\nAfter 14 seasons, she signed a deal in late 2017 that made her the highest-paid actress on a television drama, with a paycheck of $575,000 per episode. “Decide what you think you’re worth and then ask for what you think you’re worth,” she said. “Nobody’s just going to give it to you.”\n\nActors Octavia Spencer (L) and Jessica Chastain attend The 75th Annual Golden Globe Awards at The Beverly Hilton Hotel on January 7, 2018 in Beverly Hills, California. Photo: Frazer Harrison/Getty Images\n\nOctavia Spencer with Jessica Chastain and Jada Pinkett-Smith, January 2018: “We gotta bring women of color to the table.”\n\nOctavia Spencer reintroduced intersectionality to the wage-gap conversation, an element that several black female actresses have stressed as crucial to the discussion in the past. At the Sundance Film Festival’s Women Breaking Barriers panel, Spencer recalled a personal conversation with her friend and future co-star in an unnamed film, Jessica Chastain, in which she highlighted the struggles that African-American women face in the context of equal pay. “I said, ‘Here’s the thing, women of color on that spectrum, we make far less than white women,’” Spencer told the Hollywood Foreign Press at the panel. “So, if we’re gonna have that conversation about pay equity, we gotta bring the women of color to the table.” Spencer got emotional when she recounted that Chastain, who went quiet at her unawareness of this second disparity, decided to take action and get Spencer five times her salary.\n\nJada Pinkett-Smith, who will co-star alongside both women in a holiday comedy currently in production, sang Chastain’s praises for raising her and Spencer’s wages. “It’s nice to go out and march, we can do that. It’s nice to wear black at the Golden Globes,” she said. “But what are we doing behind closed doors? And I got to give our sister Jessica Chastain her props.”\n\nJessica Chastain, a longtime outspoken advocate for gender equality and taking on strong female roles (in Zero Dark Thirty, Miss Sloane, and most recently, Molly’s Game) said in an interview with Variety a year earlier, “I’m not taking jobs anymore where I’m getting paid a quarter of what the male co-star is being paid. I’m not allowing that in my life.”\n\nEmily Blunt, February 2018: “‘Making an aggressive deal’ [is] a positive.”\n\nIn Vanity Fair’s cover story, Blunt revealed her assertive approach to negotiating her salary for any role, by virtue of the growing pressure and public relations risks faced by current-day producers. “Especially in this new climate, I think that it’s O.K. to reclaim the words ‘making an aggressive deal’ as a positive. Usually people are making so much money off your back that it comes down to a sort of justice thing for me. I make it a point to not be too concerned with ‘I hope they think I’m a team player.’”\n\nSienna Miller, March 2018: Turning down a role was “difficult and lonely.”\n\nIn an interview with The Guardian at the UN Annual Meeting on Gender Equality, the actress shared her story of having to turn down a powerful Broadway role because she was offered less than half of what the male co-star would receive. “The decision to turn down this particular role was difficult and lonely,” she said. “I was forced to choose between making a concession on my self-worth and dignity and a role that I was in love with.”\n\nClaire Foy, March 2018: “I’m not surprised.”\n\nThe queen of The Crown made international headlines as one of the show’s producers accidentally revealed that Foy, the main protagonist of the series, was paid less than her male co-star Matt Smith, who plays Prince Phillip in a supporting role. “I’m not [surprised about the interest in the story] in the sense that it was a female-led drama,” Foy told Entertainment Weekly. “I’m not surprised that people saw [the story] and went, ‘Oh, that’s a bit odd.’”\n\nAlicia Keys, April 2018: “We have to infiltrate our industries. Period.”\n\nIn Variety’s annual Power of Women NY issue, Alicia Keys spoke about the no-makeup movement she inspired and gender parity. “Until we’re in those rooms as equally as men are, it can’t shift. We have to infiltrate our industries. Period. We have to. That alone will shift the power balance.”\n\nRead the Cut’s guides to how to ask for a raise and what to do when a male co-worker is making more than you.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/equal-pay-lede.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/oprah.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/jennifer-lawrence.nocrop.w710.h2147483647.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/equal-pay-lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/witherspoon-longoria-hayek-judd.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/viola-davis.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/patricia-arquette.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/frances-mcdormand.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/octavia-spencer-jessica-chastain.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/equal-pay-lede.w1200.h630.jpg", "keywords": [], "authors": ["Melania Hidalgo"], "canonical_link": "https://www.thecut.com/2018/04/equal-pay-day-celebrities-hollywood.html", "title": "All the Celebrities Who Have Spoken Out About Equal Pay in Hollywood", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "All the Celebrities Who Have Spoken Out About Equal Pay in Hollywood", "url": "https://www.thecut.com/2018/04/equal-pay-day-celebrities-hollywood.html", "description": "A timeline.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/equal-pay-lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "All the Celebrities Who Have Spoken Out About Equal Pay", "description": "A timeline.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/10/equal-pay/equal-pay-lede.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2018-04-10T13:16:14.071-04:00", "tag": "equal pay day, lists, culture, celebrity", "publisher": "https://www.facebook.com/cut"}, "description": "In honor of Equal Pay Day, the Cut presents a timeline of actors and actresses who have spoken up about their fight for equal pay.", "sailthru.tags": "equal pay day, lists, culture, celebrity", "author": "Melania Hidalgo", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1523380574.071, "source": "http://www.thecut.com", "summary": ""}