{"url": "www.nationalenquirer.com/photos/celine-dion-plastic-surgery-disaster-claims/", "text": "Celine Dion has reportedly undergone celebrity plastic surgery, including some extreme facial fixes that pals and a medical expert say have backfired badly. As a result, they claim, the diva is now looking “terrible” and totally different from just a year ago. The 50-year-old star underwent the makeovers in an attempt to turn a new page in her life since her hubby of 21 years, manager René Angélil, died of cancer in 2016 at 73. “She totally lost her looks,” said one shocked source, “and is unrecognizable. The word is she went under the knife to try and give herself a fresh start. But whatever she’s done, it clearly hasn’t turned out very well!”\n\nCeline Dion’s Plastic Surgery Disaster 1 of 3 Close gallery 1 of 3 Boston plastic surgeon Dr. Dave David, who hasn’t treated the songstress, notes the changes are so drastic, he “wouldn’t recognize her now” — adding: “She looks terrible, haggard and homely!” He believes that Celine has had a nose job, Botox in the upper lip, fillers in her cheeks and under the eyes, and had her eyebrows thinned and lightened. Photo credit: Mega 2 of 3 “She got rid of the gummy smile,” added Dr. David. “Her teeth look better. The shape of her eyebrow looks like there was Botox there. Before, she had a fat, rounded face, now she has a chiseled chin. She looks like a completely different person.” It seems to be a notable change from 2017, when Celine admitted she was open to facial fixes — saying: “I’m still looking through the magazines to find the miracle things I can inject in myself.” Photo credit: Getty/MEGA 3 of 3 Her reps, however, are insisting that Celine hasn’t had new dental work, a nose job or Botox — and looks the same as always! But the insider dished, “Getting cosmetic procedures were a way to make her feel more youthful and confident so she can start over. It’s really sad, because it’s backfired and ended in total disaster. She must be terrified she’ll never find love again!” Photo credit: Mega Share this: Click to share on Twitter (Opens in new window)\n\nClick to share on Facebook (Opens in new window)\n\nBoston plastic surgeon Dr. Dave David, who hasn’t treated the songstress, notes the changes are so drastic, he “wouldn’t recognize her now” — adding: “She looks terrible, haggard and homely!” He believes that Celine has had a nose job, Botox in the upper lip, fillers in her cheeks and under the eyes, and had her eyebrows thinned and lightened. Photo credit: Mega “She got rid of the gummy smile,” added Dr. David. “Her teeth look better. The shape of her eyebrow looks like there was Botox there. Before, she had a fat, rounded face, now she has a chiseled chin. She looks like a completely different person.” It seems to be a notable change from 2017, when Celine admitted she was open to facial fixes — saying: “I’m still looking through the magazines to find the miracle things I can inject in myself.” Photo credit: Getty/MEGA Her reps, however, are insisting that Celine hasn’t had new dental work, a nose job or Botox — and looks the same as always! But the insider dished, “Getting cosmetic procedures were a way to make her feel more youthful and confident so she can start over. It’s really sad, because it’s backfired and ended in total disaster. She must be terrified she’ll never find love again!” Photo credit: Mega", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs=", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered-green.svg", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered.svg", "https://secure.gravatar.com/avatar/04f082eec183205c28a957949c1a0389?s=64&d=identicon&r=g", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?fit=1200%2C788&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2020/02/Hot-pics-feb-2020-jlo-shakira-n.jpg?resize=300%2C194&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?resize=540%2C400&ssl=1", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/nationalenquirer-logo.svg", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?resize=408%2C229&ssl=1"], "top_img": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?fit=1200%2C788&ssl=1", "keywords": [], "authors": ["National Enquirer Staff"], "canonical_link": "https://www.nationalenquirer.com/photos/celine-dion-plastic-surgery-disaster-claims/", "title": "Celine Dion’s Plastic Surgery Disaster", "meta_data": {"viewport": "width=device-width, user-scalable=0", "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/images/favicon/mstile-144x144.png", "msapplication-config": "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/favicon/browserconfig.xml", "theme-color": "#ffffff", "google-site-verification": "kONM_PqGX8Za53dFcExSTIIPZxxN_S4QtvDlONzzdA0", "description": "Celine Dion has reportedly undergone extreme facial fixes that pals and a medical expert say have backfired badly — with shocking photos showing her looking “terrible” and totally different from just a year ago!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "news_keywords": "celine dion", "generator": "WordPress 5.3.2", "og": {"type": "article", "title": "Celine Dion's Plastic Surgery Disaster", "url": "https://www.nationalenquirer.com/photos/celine-dion-plastic-surgery-disaster-claims/", "description": "Celine Dion has reportedly undergone celebrity plastic surgery, including some extreme facial fixes that pals and a medical expert say have backfired badly. As a result, they claim, the diva is now...", "site_name": "National Enquirer", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?fit=1200%2C788&ssl=1"}, "article": {"published_time": "2018-07-27T17:51:44+00:00", "modified_time": "2018-09-28T13:47:54+00:00", "author": "https://www.nationalenquirer.com/author/nestaff/"}, "fb": {"app_id": 953902771314199}, "twitter": {"card": "summary_large_image", "title": "Celine Dion's Plastic Surgery Disaster", "description": "Celine Dion has reportedly undergone celebrity plastic surgery, including some extreme facial fixes that pals and a medical expert say have backfired badly. As a result, they claim, the diva is now lo...", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/07/celine-dion-plastic-surgery-disaster-claims-1.jpg?fit=1200%2C788&ssl=1"}}, "movies": [], "publish_date": 1532713904.0, "source": "http://www.nationalenquirer.com", "summary": ""}