{"url": "https://web.archive.org/web/20170511061027/http://www.csicop.org:80/specialarticles/show/anatomy_of_a_reading", "text": "Forbes columnist Steven Salzberg and author-investigator Joe Nickell will each be awarded the 2012 Robert P. Balles Prize in Critical Thinking, to be presented by the Committee for Skeptical Inquiry at the CFI Summit in October.\n\nAnatomy of a Reading\n\nMay 3, 2017\n\nIt’s been just over a year since E! Network brought psychic Tyler Henry to our attention, touting him as the real deal on the reality show “Hollywood Medium.” I’ve written about him a few times, here, here, here, here and here. Now it has been announced that Tyler Henry has been given a third season, to be broadcast in May 2017. E! has also announced that Henry has a new batch of celebrities to read, including ex-CNN “victims’ rights” lawyer Nancy Grace, who frankly should know better than to support a grief vampire like Henry. That will be another article for another day; it is never ending.\n\nTyler Henry mostly reads celebrities. Usually ones who are hosted on the E! Network. The main dialog throughout the “Hollywood Medium” series is that Henry does not know who these celebrities are when he reads for them. That could possibly have been true at the beginning of 2016 when he was first starting out, but the claim is getting a bit old now that he is often in the entertainment news along with these same celebs he’s reading for. Of course he knows who they are! It’s not like he’s living in an isolated room with no Internet or TV access. I don’t know how much longer they are going to be able to keep saying he knows no celebrities. Maybe they have a new angle this season?\n\nPast shows portray Henry as a naïve young man who is genuine and adorable, and never knows anyone he reads. In fact, they go to a lot of trouble to include footage of him talking about how he did not know each person beforehand. I think Shakespeare’s “The lady doth protest too much, methinks” applies here. If Henry is aware of the person beforehand, then what he is doing is called a hot-read, and is a popular method psychics use to get information from “the other side,” when really the information came from a Google search.\n\nI’ve seen a lot of criticism of Tyler Henry, and I might be alone in thinking that what is going on with his readings has nothing to do with Google and everything to do with cold-reading. Of course, this is just my opinion after having been involved in investigating psychics for years and watching a lot of Henry’s readings, but I think that I have some good evidence to support my claim.\n\nE! Network uploaded a YouTube video of Henry giving a fan a reading that has been viewed 266,418 times. There are 1,519 likes and 101 dislikes, along with 763 comments. Some of the comments are from the sitter, Jamie Horn, who says about her reading “It was amazing and emotional!” Yes, I bet it was. Horn won the reading from a Facebook contest. It was an all-expense paid trip, and even more importantly her father came through in the reading and said he was not worried about her at all. That must have been exhilarating.\n\nHorn insists in the YouTube comments that only the promotion company knew who she was. How this promotion company works with the person they are promoting is unknown, however it makes sense that they want to get the best possible video out of it for … promotion, obviously.\n\nHot-reading through Twitter, Instagram, Facebook, and any social media site is always a possibility. Mediums have been finding out information that “no one could have known” ever since people have been claiming that they are in communication with the dead. How hard is it to look at someone’s Facebook page to glean a bit of “assurance,” just in case the spirits are a bit groggy?\n\nIn this specific reading with Jamie Horn, I don’t think there is any hot-reading going on. Instead what I think is that, with a close look at the actual reading, we can see that there are almost no specific hits, some very general statements and lots of leading the sitter to giving up the information themselves. Information that Henry just regurgitates back to the sitter as if he knew it all along. Statements like “Who was David?” “David was my brother” Henry smiles and nods, “Yes, that is what he is saying, he is your brother.”\n\nAs Horn said in her comments, “It was amazing and emotional!”; it truly is. She does not have the ability at that moment to pause, back up, and really think about what he is saying. She isn’t even able to ask questions or take notes. We have that ability. I can sit here at my desk and watch and rewatch sections of the video repeatedly. I can look at her expressions and body language and take notes all the way through. I can sit here smugly with the luxury of knowing how this is done and ridicule Horn for being so gullible. Really, though, that smugness does not sit well with me. It is disquieting to watch another human being led through an emotional roller-coaster ride, having her memories of her family rewritten by this grief vampire. It is ugly to watch as he brings her to tears over and over again. She is not stupid; she is just uninformed. Possibly she was raised thinking this is normal. If mediums could really communicate with the dead, why do we have so many missing persons and unsolved crimes?\n\nI don’t know if you are familiar with the Columbo TV movie series. One of my favorite episodes was loosely based on the relationship between Uri Geller and James Randi, called “Columbo Goes to the Guillotine.” It was released in 1989 and deals with a remote viewer (the Geller character) trying to get himself hired by the U.S. Government. The stunt that was pulled off by the remote viewer was amazing, and Columbo had no idea how it was done. He then meets a young magician and after explaining it to the kid, asks how he thought it was done. The kid says that he did not know how, but the way to figure it out was to always remember “it is a trick. Once you start with that premise, you can eventually work it out.”\n\nSo here I am, about to break down this reading in detail. Well actually not in detail here, only a few hardcore readers will want to read the minutia of detail that goes on behind the scenes. For those few people, I have a link to my notes located HERE. For everyone else, let’s break down the reading broadly so you can see what I see. The simplest solution is that this is a trick, so keep that in mind and the solution will become obvious.\n\nThe reading given to Horn can be summed up, for the sake of brevity, into three sections: First Impressions, The Reading, and Platitudes.\n\nFirst Impressions: He knows nothing but what he can see, smell, and observe of her body language. Her age, ethnicity, accent, jewelry, style, and so much more go into how to approach this woman. Henry has been doing this for only a year or so; he is picking up the skill as he goes. As he does more of these readings, he will get better.\n\nThe first thing Henry does is set up the parameters for the reading. He tells her that 80 percent of the time she will hopefully understand the reading, and 20 percent will be something she will have to think about or ask family about later. I guess he is feeling pretty confident that he will be accurate 100 percent of the time. I love it when numbers are used; it gives us something to use for evaluation.\n\nHenry starts by offering two talkative women and an older man. He is watching Horn’s body language, and she clearly wants to hear from the older man. Henry steers in that direction.\n\nThe older man has a sense of humor, is a sweet guy, does not tell long funny stories but little funny ones, likes to have fun, focuses on the moment, and does not want the family to focus on his health issues. And that is all. No mention of how this older man knows Horn, no names, no cause of death or anything specific about a year of birth/death or mentions Horn’s mother, siblings or, well … much of anything.\n\nBut Horn jumps on it, giving positive feedback, and is all smiles. Henry then, apparently stumped about what to do next, asks her for details about this person and their death.\n\nThis man, who Henry has now learned is Horn’s father, wants to acknowledge a Bob, Bobby or Robert. Horn explains that her husband’s name is Robert. Sounds like a hit, right? I’m sure Horn will spin it unknowingly that way. She probably thinks her father reached out to her husband Robert. But Henry did not say the older man was her father, he learned that when Horn said so. And Henry did not say that Robert was her husband; he was throwing out names and she claimed it. How common is a name like Robert? According to Social Security databases, Robert has been in the top five most popular male names in America for decades. Adding Bob and Bobby as well as saying “who is … ,“ and not stating if this is a living person or someone on the other side, or a pet or what have you, really ups the odds that Horn is going to supply a hit for the name.\n\nNext is a series of complete misses. Horn did not react to any of these statements other than with a “maybe” statement. Henry did not feel like she gives him a strong response so he moves on after each of these.\n\nHe is seeing a mining shaft … someone lives in a mining town … old wood not in use any more … somebody lived near an abandoned mining shaft … or an abandoned well … something in the dirt or the ground.\n\nHorses, “he’s having me bring up the horses … a female … was bucked off a horse or kicked off a horse … a childhood incident … I’m seeing Idaho … or going more in that direction.” Horn had already told Henry she was raised in Idaho, so this isn’t a hit.\n\n“Do you know anyone with any Lynn connections?”\n\nA child on the other side that did not live a full life. “Doesn’t look like the kind of situation where the child is kind of really born in the traditional sense and this is a loss that would have been traumatic to a woman … If someone suffered a miscarriage, a stillborn, or had a child that was birthed and died shortly after ... SIDS.”\n\nHorn reacts positively to the SIDS reference. Sounds like Henry got it right, what a hit! Wrong, what is left to throw out there? I suppose if Horn had not reacted to the SIDS comment, then Henry could have kept going by suggesting a child that died after its first birthday, or died young after its second birthday, its third birthday, before it was a teenager. I guess at any time Henry could also have moved on to something else if he didn’t feel confident about where he was going with this. Oddly, Henry never mentions if it was a baby boy or girl, and no names. Not of his first wife or the baby, or anyone that would be associated with the child.\n\n“Older female … who passed away of … feminine based cancer … Pat or Patricia … keep in mind breast or susceptibility to breast cancer or … female cancers … Pat, Patty, Patricia?”\n\n“Older lady … she's having to bring up these rings … someone might have taken a piece of jewelry and then altered it into a different piece of jewelry.”\n\nA woman comes through with mental decline; she is really independent and hated that she lost her mental abilities near the end. She was “experiencing some personality kind of stuff and a bit of a change … given a medication that makes them different … didn't die of Alzheimer's or dementia ... Forgetting.”\n\n“Who had the stroke and then survived?”\n\n“Who is Ellen or Helen … getting a very strong E sounding female name … unless I have the sides switched … or Elaine.”\n\n“The teacher thing”\n\nThe next long exchange was more of the same, with Henry giving general questions and Horn trying very hard to make sense of them and claim them as family members.\n\nHer father is “having me bring up the younger female in the family ... I don’t know the exact relation he would be to her ... a living family member ... going through a time of transition ... he’s watching over her.\" Then Henry gives a list of things for Horn to try to hit on. Watching her body language, she is struggling to make sense of it. “Going to college ... a decision to move ... a big shift or a big situation in their personal life ... a time of transition ... concerns over her ... struggling emotionally ... going through a rough patch.” And he \"can’t establish the age range of this person.\" Henry finally asks Horn \"who would be the youngest female within your family or anyone that you could think of as like fitting that bill? ... someone he would view like a daughter or like a granddaughter?\"\n\nHorn answers \"my niece, Nicki ... possibly\" Henry asks how old is Nicki. She replies \"thirty-five, but she has a daughter that’s twenty-one that’s going to college.\" This would be his great-granddaughter. A quick calculation shows that her mother would have been about fourteen when the child was born, so keep that in mind with these next statements from Henry. Great-grandpa was a father figure to this female who is independent and needs help from the family; she is not getting the help she needs; he asks \"is the father involved in this girl's life?\" Horn replies \"not really.\"\n\nNow that Henry is on surer ground with this storyline; he says that great-great-grandpa acknowledged that the girl's father isn't in her life. The girl (still unnamed) is going through an academic as well as a residential shift ... she will go to school with one major and then shift it ... it will happen; it may have already happened ... Great-grandpa is joking about her love life, telling her to not to get to serious with anyone.\n\nSo this younger female is both independent and not independent at the same time. She is in college and experiencing an academic shift. She is going to change her major, or maybe already has. Her father isn't a part of her life. Remember, her mother was about fourteen when the child was born, so maybe not a strong relationship with her father? How vague is all this? Why doesn't Great-grandpa give this child some real advice, maybe tell her what major she should go for? What career is she going to have later on?\n\nWhy doesn't he know her name? Tell her the name of the person she will fall in love with? Steer her away from bad decisions, bad people ... didn't he say he was watching over her? That isn't creepy at all, is it?\n\nThis next exchange took Henry a while to get through. If you are just watching the video once, you might think they are amazing hits. But once you watch the reading more than once and take notes, you will see that nothing but what appears to be cold-reading is happening. When Horn tells Henry information, Henry repeats it back saying “yes, that is what I’m hearing” statements.\n\nOne is a woman who was not ready to die yet. This is something that Henry stays on for a very long time. In her YouTube comments, Horn says that this was really convincing, as he heard from her sister and answered a lot of questions about her death. Pay really close attention to what Henry really says. I think when I break it down you will see that he says almost nothing about the questions of her death, and didn't even know it was her sister until she tells him.\n\n\"A female who … is dying too soon.\" Horn smiles and said \"yes.\" Henry says she did not die in her 80s or 90s. She is very unhappy because she thinks she died too soon. Henry thinks he is on the right track, and Horn agrees. She was too young to die, and she was not ready to go. Horn keeps agreeing with this. Henry says that this woman was looking forward to the upcoming year and to family. She had a career and things to look forward to. Horn says, \"You’re right on.\"\n\nHenry asks \"Do you know if she was looking forward to anything specifically ... coming up that you can recall?\" Horn replies, \"I'm not sure. I will say things were going really well for her.\" Henry says that he is seeing money signs, like a promotion at work. Horn agrees. She felt secure in her life, and that more security was coming. She did not want to go.\n\n\"She is having me refer to being alone ... she had just talked to someone right before she had passed.\" All through this exchange Henry keeps repeating that she wasn't ready to die yet and that he keeps getting messages that are \"so weird\" and then Henry said that he is going \"to get to the bottom of this.\" Horn keeps smiling and agreeing.\n\nThen Henry starts saying again that she was alone, it was quick, and she was at home. And that she apologizes for the discovery. Horn acknowledges again, but Henry really does not know where to go with this so he changes tactics. He brings in two children, a boy and a girl. We do not know if this is the first time we are hearing about these children, as there are forty minutes missing from this reading and we are nearing the end, so possibly in the missing minutes he discovers that Horn has two children, a boy and girl.\n\nThe woman, who did not want to go yet, wants to acknowledge two kids that are not her kids but \"like her kids.\" Then after Horn says \"yes,\" Henry says these are nieces or nephews. And then there will be a third child. Horn looks really confused at this point; it seems that the two children are Horn's own kids, and as she is in her 50s, it is pretty unlikely that she is going to be having a third child. But she smiles, and Henry moves on.\n\nThe woman now says that she was not awake or aware when she passed. Then a house alarm is going off—\"keep it in mind.\" No idea what that was about, but Horn laughs and agrees to keep it in mind. The woman \"is having me refer to a female J name.\" Horn says, \"that is me.\"\n\nThe woman keeps talking about being alone, being at home, and wanting to stay at home. She was not conscious when she passed and did not know why she passed.\n\nLet’s pause here for a minute before we continue with this woman who did not want to die yet. What do we know? Well it seems to be Horn's sister and she died alone at home, in her sleep. She does not know how she died; some kind of mystery, even Horn does not know what happened. Oddly her sister does not know her own name or Jamie's name—just that it starts with a J, and she also doesn’t know her niece’s or nephew's names. Not her city, year, street name, career, or anything. Zilch. It's almost like he is just making this up. Sounds like a woman that died in her sleep and no one knows why. She talked to someone before she died, but what does that mean? A phone call, the doorman, a neighbor, someone at work ... and \"before\" means what? An hour? A day? It means whatever Horn wants it to mean. I've just re-listened to this exchange again; he does NOT mention a phone call. He clearly says, \"She had just talked to someone right before she had passed.\" Horn and the YouTube commenters keep insinuating that Henry said she was talking to someone on the phone ... nope!\n\nFinally, Henry gives up and asks Horn \"where ultimately did she actually pass away?\" Horn explains that her sister left the house at 1 a.m. in the rain, wearing all black and walked about a mile from the house. She crossed the street, and was hit and killed instantly by a car. The family does not know where she was going, but the autopsy showed that she had been drinking.\n\nHenry agrees with all of this, and said that it was not a suicide but he feels a lot of \"emotional up[s] and down[s].\"\n\nHenry mentions “they’re having me talk about the Bill connection again. So, Bill was who now?” Horn replies that Bill was her father’s brother. Apparently about forty minutes are missing from the reading, and this was something that happened during that edit. If it were amazing, then the editors would have left it in.\n\n“There’s also an acknowledgement of a Tom … connected to Bill … it could even be a middle name.”\n\nAnd now to the platitudes. Key the feel-good music. I’m not kidding that when you watch Henry’s show “Hollywood Medium,” they play music to tell you when to tear up and get that aww feel-good moment. Her father talks about how when he was dying he did not want a “tube,” and how happy he is for his daughter. He never worries about her and knows that she will be fine. He is at peace, he loves her, and everything is fine.\n\nI want to mention that Tyler Henry was going to become a hospice nurse before he got picked up by E! Network. He would know all about how people near the end of their life have tubes in their noses and mouths and how uncomfortable it is. I remember him telling Jodie Sweetin about how her grandmother hated the tubes also, and wanted them removed. I wonder how common that is, but it sounds impressively detailed to a sitter who is looking to believe in what is being said.\n\nWhat was missing might be as important as what was said. Henry missed anything that could be considered specific. He never knew anyone’s names, careers, years of death or birth, hobbies, nothing. Everything he threw out was general, and he expected Horn to come up with the answers; who had a stroke, what is it about horses, the teacher thing, wedding rings, and altered jewelry. These are statements that will fit pretty much anyone if you are general enough. The names he mentioned are all common names (see the Social Security Database for popular names): Robert, Bob, Bobby, Tom, Ellen, Helen, Elaine, Pat, Patty, Patricia, and Lynn.\n\nLiving family members are being waved at by dead family members, but there’s nothing like “Sara is doing so well in school, I watch her play the piano in church and am so proud of her good grades.” Nothing like that at all.\n\nAs far as his stats are concerned, it’s really difficult to say how many things he got wrong. Do we count every time he mentions something? Bob, Bobby, and Robert—is that three wrong or just one? How can you even measure a statement with no specificity?\n\nWhat Henry did get right was that Horn wanted to hear from an older male. He eventually got her to tell him that it was her father, and the details of his death. The father acknowledged a younger female that is in college, and eventually he told Horn that he was happy for her. The other thing that Horn believes Henry was correct on was that he reached her sister and answered questions about her death. But we now know that isn’t true at all. He reached a woman who was not ready to die, and then he extracted the rest of the details from Horn herself.\n\nIt’s all very sad. The released reading was forty minutes long. Horn said the entire reading was eighty minutes long, and I believe her. The editors of this video have every incentive to leave in the very best parts of the reading, the best of the best. I can imagine how tedious the missing parts must be. Psychic expert Mark Edward often says, “The real magic happens in the editing room.”\n\nI’m sure that this detailed breakdown is unlikely to convince anyone who wasn’t already convinced that psychics can’t really communicate with the dead. But what I hope it does do is prove that, in this case, Tyler Henry does not need to know anything about the sitter beforehand to provide a believable reading. Horn and other Henry supporters, according to the comments on YouTube, are 100 percent behind this reading, calling it “fabulous” and Henry “the real thing.” To people like myself, who are interested in the methods of psychic mediums, this video (and all the other readings I’ve seen Henry perform) convince me that the statements made are equivalent to a person performing a cold-read.\n\nIf I had to score this reading, I would give Tyler Henry a big fat zero.\n\nThank you to Doug Dean for help with the transcripts; Mark Honeychurch and Stuart Jones for the editing and proofreading. Mark Edward for his expertise and support, and to the Chamberboys YouTube channel for bringing this video to my attention.", "images": ["https://web.archive.org/web/20170511061027im_/http://www.csicop.org/img/email-button.png", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy.JPG", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/img/subscribesi.png", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy3.png", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy4.png", "https://web.archive.org/web/20170511061027im_/http://www.centerforinquiry.net/images/member_photos/photo_78594.jpg", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/img/csi-logo-new.png", "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/img/csi-donate-today.png"], "top_img": "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy.JPG", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170511061027/http://www.csicop.org/specialarticles/show/anatomy_of_a_reading", "title": "Anatomy of a Reading", "meta_data": {"revised": 2009, "title": "Anatomy of a Reading - CSI", "description": "Ive seen a lot of criticism of Tyler Henry, and I might be alone in thinking that what is going on with his readings has nothing to do with Google and everything to do with cold-reading.", "google-site-verification": "CECWrLNmS2I5Dsw0UQuTkeTsxg8DjJQnrhgKSuZdCdw", "og": {"url": "https://web.archive.org/web/20170511061027/http://www.csicop.org/specialarticles/show/anatomy_of_a_reading", "image": {"identifier": "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy.JPG", "width": 355, "height": 200}, "title": "Anatomy of a Reading - CSI", "description": "I’ve seen a lot of criticism of Tyler Henry, and I might be alone in thinking that what is going on with his readings has nothing to do with Google and everything to do with cold-reading."}, "twitter": {"card": "photo", "site": "@SkeptInquiry", "title": "Anatomy of a Reading - CSI", "description": "I’ve seen a lot of criticism of Tyler Henry, and I might be alone in thinking that what is going on with his readings has nothing to do with Google and everything to do with cold-reading.", "image": "https://web.archive.org/web/20170511061027im_/http://www.csicop.org/uploads/images/si/Anatomy.JPG"}}, "movies": ["https://web.archive.org/web/20170511061027if_/https://www.youtube.com/embed/rRfLCXuYuk8"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}