{"url": "https://web.archive.org/web/20170804191403/http://www.forbes.com/sites/insertcoin/2017/08/04/game-of-thrones-episode-4-leaks-online-but-the-hbo-hack-isnt-to-blame/", "text": "HBO\n\nHBO has been scrambling to figure out what exactly was pilfered in the massive 1.5 TB security breach late last month, and now they have a new headache on their hands.\n\nAn early copy of this Sunday’s Game of Thrones episode, The Spoils of War, has leaked online. But amazingly, according to The Verge, the leak actually has nothing to do with the hack, and is instead the fault of a distribution partner who let the episode slip online. While the hackers have published a script outline for this episode online, they have yet to release any actual episodes, including this one. It’s still unclear whether they have stolen episodes in their possession (they had full episodes of a few other HBO shows like Insecure and Ballers), or whether that was not something they were able to be lifted in the breach.\n\nYou will not find any spoilers for this episode here because I have not watched the leaked episode nor am I seeking out any information about what it contains. I would recommend that no one actually watch it, not just for ethical reasons, but because the episode has been uploaded in absolutely garbage quality, only 360p, and many that have watched it say they wish they’d just waited two more days.\n\nHBO has been battling Game of Thrones leaks ever since the first four episodes of season five leaked online two years ago. After that, they didn’t give out any press screeners for season six, yet one of those episodes leaked anyway, that time due to an HBO subsidiary screwing up.\n\nHBO\n\nGame of Thrones continues to be the most pirated show on television every single year, something that HBO has worn as a point of pride in the past, yet they have also seem to want to fight back against pirates more than ever as of late. Traditional piracy, downloading episodes after they air, is an issue to be sure, but it’s not as damaging as leaks like these have the potential to be. Spoilers will no doubt be circulating on the internet for the next 60 hours or so, which means you should be careful on social media and in comment threads.\n\nIn the grand scheme of things, this could have been worse. Given the size of that recent hack, it’s fortunate that full, high-quality Thrones episodes haven’t been leaked online, and I have to believe that either hackers don’t have them, or they’re holding out for ransom (though supposedly no demands were given). This HBO hack goes beyond potential spoilers however, and into more serious territory like financial and employee information. They’ll have their hands full cleaning this up for a long time.\n\nUntil then, avoid the leaks, avoid the spoilers, avoid watching any video in 360p ever. The Spoils of War airs this Sunday at 9 PM ET.\n\nFollow me on Twitter and on Facebook. Pick up my sci-fi novel series, The Earthborn Trilogy, which is now in print, online and on audiobook.", "images": ["https://web.archive.org/web/20170804202114im_/https://2.gravatar.com/avatar/eb9deeb63c91b1c16548f2f1e1348a86?s=62&d=mm&r=g", "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war1-thrones.jpg?width=960", "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war1-thrones.jpg", "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war2-thrones.jpg?width=960"], "top_img": "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war1-thrones.jpg", "keywords": [], "authors": ["Paul Tassi"], "canonical_link": "https://web.archive.org/web/20170804202114/https://www.forbes.com/sites/insertcoin/2017/08/04/game-of-thrones-episode-4-leaks-online-but-the-hbo-hack-isnt-to-blame/", "title": "'Game of Thrones' Episode 4 Leaks Online, But The HBO Hack Isn't To Blame", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "'Game of Thrones' Episode 4 Leaks Online, But The HBO Hack Isn't To Blame", "image": "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war1-thrones.jpg", "updated_time": "2017-08-04T11:52:29-04:00", "url": "https://web.archive.org/web/20170804202114/https://www.forbes.com/sites/insertcoin/2017/08/04/game-of-thrones-episode-4-leaks-online-but-the-hbo-hack-isnt-to-blame/", "description": "This week's episode of Game of Thrones, The Spoils of War, has leaked online, but amazingly the HBO hack has nothing to do with it.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "'Game of Thrones' Episode 4 Leaks Online, But The HBO Hack Isn't To Blame", "description": "This week's episode of Game of Thrones, The Spoils of War, has leaked online, but amazingly the HBO hack has nothing to do with it.", "image": "https://web.archive.org/web/20170804202114im_/https://blogs-images.forbes.com/insertcoin/files/2017/08/spoils-of-war1-thrones.jpg", "creator": "@insertcoin"}, "description": "This week's episode of Game of Thrones, The Spoils of War, has leaked online, but amazingly the HBO hack has nothing to do with it.", "author": "Paul Tassi", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Paul Tassi", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/1174-35594", "published": "2017-08-04", "modified": "2017-08-04"}}, "movies": [], "publish_date": 1501776000.0, "source": "https://web.archive.org", "summary": ""}