{"url": "people.com/movies/channing-tatum-jenna-dewan-split-nearly-nine-years-marriage/", "text": "Channing Tatum and Jenna Dewan Tatum are separating after nearly nine years of marriage.\n\nThe former couple announced the split in a joint statement exclusive to PEOPLE:\n\nGet push notifications with news, features and more.\n\n“Hey world!\n\nSo…We have something we would like to share.\n\nFirst off, it feels odd that we have to share this kind of thing with everyone, but it’s a consequence of the lives we’ve chosen to lead, which we also happen to be deeply grateful for. We’re living in an incredible moment in time, but it’s also a time where truth can easily get distorted into “alternative facts” 😉 So we want to share the truth so you know that if you didn’t read it here then it’s most certainly fiction.\n\nWe have lovingly chosen to separate as a couple. We fell deeply in love so many years ago and have had a magical journey together. Absolutely nothing has changed about how much we love one another, but love is a beautiful adventure that is taking us on different paths for now. There are no secrets nor salacious events at the root of our decision — just two best-friends realizing it’s time to take some space and help each other live the most joyous, fulfilled lives as possible. We are still a family and will always be loving dedicated parents to Everly. We won’t be commenting beyond this, and we thank you all in advance for respecting our family’s privacy. Sending lots of love to everyone, Chan&Jenna.”\n\nThe actors, both 37, have one child together — daughter Everly — who will turn 5 in May.\n\nThe couple most recently attended the Kids’ Choice Awards together where Tatum hit the stage to promote his new animated movie Smallfoot.\n\nThey first met on the set of their 2006 movie Step Up and began dating shortly after before tying the knot in 2009.\n\nImage zoom Channing Tatum and Jenna Dewan have split. The last attended a red carpet together in November (pictured) Greg Doherty/Getty\n\nBuzz about a split began when Dewan Tatum attended the annual Vanity Fair Oscars after-party solo, but she told ET at the bash that Tatum was on daddy duty and “so happy to have a night off.”\n\nAnd in mid-March the former couple shared sweet snaps from a face painting session with their daughter. “When you fall asleep around a toddler,” Dewan Tatum captioned a silly shot of Tatum before sharing a solo selfie of her own look.\n\nWant to keep up on the latest from PEOPLE? Sign\n\nup for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nImage zoom Channing Tatum and Jenna Dewan Tatum Channing Tatum/Instagram\n\nIn February, the actress opened up to Health about the perception that she and Tatum had a “perfect life,” saying instead that they worked hard to keep their relationship going.\n\n“When people say you guys have such a perfect life, I want to scream and tell them no one’s perfect,” she said. “I think there are such things as great fits. It is a great fit as long as you are growing together, and I think up until this point we’ve really grown together. Even if one starts to grow, the other catches up and vice versa.”\n\nImage zoom Dave Benett/WireImage\n\nDewan Tatum said while they always made sure to make time for one another, they still had days where they didn’t get along.\n\n“But I think a couple needs to be conscious and to want to do the work and be willing to look at the parts of you that need work. Both of us have been pretty aware and willing to do that,” she continued. “We’ve always had the same values. But we’re not perfect! Are you kidding? We fight like other couples, we disagree about things, we have days where we don’t really like each other.”\n\nRELATED VIDEO: Channing Tatum & Jenna Dewan ‘Have Lovingly Chosen to Separate’ After Nearly 9 Years of Marriage\n\nIn December, Tatum wished his wife a happy birthday with a heartfelt Instagram post.\n\n“This creature is one more year beautiful. The transformation she invoked this year has been something they only write about in books of fairytale and magic. Your strength and grace ever-evolving,” he wrote. “By doing so you make everything around you grow- everything. And I am so very grateful for your lessons. Happy life day my love.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1351&h=707&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmagic-mike-6-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fchanning-tatum.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fchanning-tatum.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fchanning-tatum2.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1351&h=707&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmagic-mike-6-2000.jpg", "keywords": [], "authors": ["Kara Warner", "Julie Jordan"], "canonical_link": "https://people.com/movies/channing-tatum-jenna-dewan-split-nearly-nine-years-marriage/", "title": "Channing Tatum and Jenna Dewan Split After 9 Years of Marriage", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Channing Tatum,Couples,Exclusive,Jenna Dewan,Movie Celebrities,Movie News,News", "news_keywords": "Channing Tatum,Couples,Exclusive,Jenna Dewan,Movie Celebrities,Movie News,News", "description": "The couple first met on the set of their 2006 movie Step Up, and began dating shortly after", "og": {"title": "Channing Tatum and Jenna Dewan Split After Nearly 9 Years of Marriage", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/channing-tatum-jenna-dewan-split-nearly-nine-years-marriage/", "description": "Channing Tatum and Jenna Dewan Tatum are separating after nearly nine years of marriage. The former couple announced the split in a joint statement exclusive&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1351&h=707&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmagic-mike-6-2000.jpg", "width": 1351, "height": 707}}, "pinterest": {"url": "https://people.com/movies/channing-tatum-jenna-dewan-split-nearly-nine-years-marriage/", "description": "The couple first met on the set of their 2006 movie Step Up, and began dating shortly after", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmagic-mike-6-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/channing-tatum-jenna-dewan-split-nearly-nine-years-marriage/", "title": "Channing Tatum and Jenna Dewan Split After Nearly 9 Years of Marriage", "description": "The couple first met on the set of their 2006 movie Step Up, and began dating shortly after", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1351&h=707&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmagic-mike-6-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}