{"url": "https://en.wikipedia.org/wiki/CMT_Music_Awards", "text": "CMT Music Awards Awarded for Achievements in country music videos voted on by fans Location Nashville, Tennessee Country United States Presented by Various First awarded 1967 (as Music City News Awards) Website www .cmt .com /cmt-music-awards /\n\nThe CMT Music Awards is a fan-voted awards show for country music videos and television performances. The awards ceremony is held every year in Nashville, Tennessee, and broadcast live on CMT. Voting takes place on CMT's website, CMT.com.\n\nHistory [ edit ]\n\nBeginning in 1967, the Music City News Awards were presented yearly by the now-defunct Music City News magazine. In 1988, The Nashville Network (TNN) began a fan-voted awards show dubbed the Viewers' Choice Awards to help the network celebrate its fifth anniversary. In 1990, the two awards shows merged to become the TNN/Music City News Country Awards.\n\nThe TNN contract with Music City News ended in 1999, and the magazine ceased publication shortly thereafter. Country Weekly became the presenting sponsor of the awards show in 2000, and the show was known as Country Weekly presents the TNN Music Awards. In 2001, as TNN began to phase out its association with country music, the decision was made to shift the awards show to sister network CMT. The 2001 show was simulcast on both networks and was called the TNN/CMT Country Weekly Music Awards. When the show moved permanently to CMT, Country Weekly ended its brief association with the production. During this era, viewers voted for the nominees by telephone or mail in traditional categories such as \"Entertainer of the Year,\" \"Male/Female Artist of the Year,\" \"Song of the Year,\" etc. Most of the categories mirrored those on the CMA Awards and ACM Awards, except all awards were fan-voted[citation needed].\n\nThe awards show was completely retooled in 2002 to become the CMT Flameworthy Video Music Awards, named for the network's branding concept at the time for its most popular videos (\"flameworthy\" based on the concept of concert lighter waving to ask for the playing of a popular song, rather than the meaning of Internet flaming most associated with the term today). The show became more production-based, rather than awards-based, and was modeled after sister network MTV's Video Music Awards. In the process, the traditional awards were shifted to specifically honor the music videos of country artists. The \"Flameworthy\" name was coined by program development vice president Kaye Zusmann.[1]\n\nThe show included several non-traditional categories highlighting especially funny, sexy, and patriotic videos; however, these categories were phased out over the years.[2] The show further differentiated itself from the CMA Awards and ACM Awards by showcasing bluegrass performers such as Alison Krauss and Earl Scruggs.[1]\n\nIn 2003, the show was moved to April but returned to June in 2009 to coincide with the CMA Music Festival (the renamed \"Fan Fair\") and the influx of tourists to Nashville as well as capitalize on a time when many of the artists would already be in Nashville at once.\n\nThe name of the show was changed to CMT Music Awards in 2005, although the format remained largely the same as in previous years.[3]\n\nFrom 2009 to 2014, the CMT Music Awards featured a live band led by John Bohlinger[citation needed].\n\nMajor awards [ edit ]\n\nSpecial/Discontinued awards [ edit ]\n\nAll of the traditional categories awarded during the TNN/Music City News/Country Weekly era were discontinued following the 2001 show when the production was moved to CMT and retooled to honor music videos.\n\nSeveral categories were removed after only one year, including the Love Your Country Video (2002), LOL (Laugh Out Loud) Video (2002), Fashion Plate Video (2002), Special Achievement (2003), Cocky Video (2003), Cameo of the Year (2004), Comedy Video (2008), Tearjerker Video (2008), and Supporting Character of the Year (2008). The Most Inspiring Video Award was presented only two years (2004–05).\n\nIn 2004, the Johnny Cash Visionary Award was introduced to honor innovation and vision in creating music (a similar award, \"Video Visionary\", was presented in 2002). Reba McEntire was the first recipient of the award.[4][5] It was discontinued after 2007.\n\nThe Hottest Video of the Year award was discontinued after 2006 (and was split into Male/Female categories in 2003 alone). It honored videos featuring especially sexy performances by the artists or supporting cast.\n\nIn 2007, the Wide Open Country Video Award (named for the CMT Pure Country video block of the same name) was introduced to recognize music not normally played on country radio. Jack Ingram's \"Love You\" was the first recipient.[6] It was discontinued after 2009.\n\nIn 2009, the CMT Performance of the Year (to honor a CMT-exclusive performance by an artist or a collaboration) and Nationwide Is On Your Side awards (to honor an up-and-coming artist/group) were introduced. The Nationwide award is awarded off-camera, but the recipient offers a brief (taped) acceptance as the broadcast cuts to a commercial break.\n\nWinning records [ edit ]\n\nCarrie Underwood is the most awarded artist overall in CMT Music Awards' history (2005-present), with 20 wins. [7]\n\nBy category [ edit ]\n\nVideo of the Year: Carrie Underwood; seven wins [8]\n\nMale Video of the Year: Kenny Chesney; five wins [9]\n\nFemale Video of the Year: Carrie Underwood; seven wins [8]\n\nCollaborative Video of the Year: Carrie Underwood and Brad Paisley (tie); three wins each [8]\n\nCMT Performance of the Year: Carrie Underwood, Luke Bryan and Jason Aldean (tie); two wins each[8]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/CMT_Music_Awards", "title": "CMT Music Awards", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}