{"url": "en.wikipedia.org/wiki/Stay_with_Me_(Sam_Smith_song)", "text": "\"Stay with Me\" is a song by English singer Sam Smith from their debut studio album In the Lonely Hour (2014). It was released in the United States on 14 April 2014 and in the United Kingdom on 18 May 2014. \"Stay with Me\" is a gospel-inspired ballad that details the protagonist pleading with their one-night stand not to leave them.[1] The song was written by Smith, James Napier, and William Phillips, with the late Tom Petty and Jeff Lynne later receiving co-writer credits due to the song's noted melodic similarity to Petty's single \"I Won't Back Down\".\n\nThe song has become Smith's most successful single to date, peaking at number one in the UK Singles Chart (becoming their third chart-topper there, second as a solo artist), topping the charts in Canada and New Zealand, and reaching number two on the US Billboard Hot 100. It has also reached top 10 status in over twelve countries worldwide. At the 57th Annual Grammy Awards ceremony, Darkchild's version of \"Stay with Me\" won two Grammy Awards for Record of the Year and Song of the Year.[2][3]\n\nBackground [ edit ]\n\nIn an interview with NME, Sam Smith said that the song was written in a studio in Old Street with James Napier (Jimmy Napes) and William Phillips (also known as \"Tourist\").[4] Phillips started playing with three chords on the piano, and Napier quickly provided a drum pattern, and according to Sam Smith, \"the song just flowed out of us so naturally,\" and the song was written in 30 to 40 minutes. After finishing the song, Smith started to layer their vocals about 20 times, singing in different parts of the studio and harmonizing. The result sounded like a gospel choir, but all from Smith's own voice, and this demo was then used in the released song.[4][5]\n\nAccording to Smith, \"the song is about the moment in the morning after a one night stand, where the person you are with leaves your house, and you are left by yourself, and it's just a second, where you are just like: 'I wish, I wish'. You don't even love them, you don't really fancy them that much, it's just nice to have someone in the bed next to you.\"[4] The song won the Grammy Awards for Record of the Year and Song of the Year, and in their acceptance speech for winning the Record of the Year, Smith said that \"I want to thank the man who this record is about who I fell in love with last year. Thank you so much for breaking my heart because you got me four Grammys.\"[6]\n\nOn 25 March 2014, the song was played for the first time on Zane Lowe's BBC Radio 1 show at 7:30 pm.[7][8][9] On 29 March, they performed the song live on Saturday Night Live in the United States. On 16 May, they performed the song on The Graham Norton Show. In June, they returned to the United States as part of their tour where they performed the song on Good Morning America, at the Apollo Theater in New York with Mary J. Blige, and David Letterman.\n\nAgreement with Tom Petty and Jeff Lynne [ edit ]\n\nIn January 2015, it was revealed that a settlement had been reached with Tom Petty's publishing company to add Petty and Jeff Lynne as co-writers, and that they would receive a 12.5% songwriting credit. Petty's publisher contacted Smith's team after it noticed a likeness between \"Stay with Me\" and the melody of Petty's 1989 song \"I Won't Back Down\".[10] Petty clarified that he did not believe Smith plagiarized him, saying \"All my years of songwriting have shown me these things can happen. Most times you catch it before it gets out the studio door but in this case it got by. Sam's people were very understanding of our predicament and we easily came to an agreement.\"[11] According to Smith, they had never heard \"I Won't Back Down\" before they wrote \"Stay with Me\",[12][13] but they acknowledged the similarity after listening to the song, and said that the likeness was \"a complete coincidence\".[14][15] Petty and Lynne, however, were not eligible for a Grammy as the Recording Academy considered \"Stay with Me\" to have been interpolated from \"I Won't Back Down\" by Napier, Phillips and Smith; instead Petty and Lynne would be given certificates to honor their contribution to the work, as is usual for writers of sampled or interpolated work.[16]\n\nComposition [ edit ]\n\n\"Stay with Me\" A 17-second sample of \"Stay with Me\" by Sam Smith, where the chorus is heard. Problems playing this file? See media help.\n\n\"Stay with Me\" was written by Smith, James Napier, William Phillips, with additional credits to Tom Petty and Jeff Lynne. According to the sheet music published at Musicnotes.com by Sony/ATV Music Publishing, the song is set in the key of C major in common time with a tempo of 84 beats per minute. Smith's vocals span two octaves from E 3 to E 5 while the song follows a chord progression of Am 7 –F–C.[17] According to Erine Keane of Salon, \"Stay with Me\" combines a \"contemporary drumbeat\", blue-eyed soul singing, and a refrain sung in a gospel style,[18] while Stereogum's Tom Breihan called it \"a soft-focus piano-soul ballad\".[19]\n\nCritical reception [ edit ]\n\n\"Stay with Me\" received generally positive reviews from music critics. Amy Davidson from Digital Spy called the song an \"emotional crescendo\" and said the chorus was \"slightly over-sentimental\" and felt that their \"soulful voice\" made the singer left in \"defeat by fleeting fling\". She gave the song four out of five stars.[20] Joe Gross from Rolling Stone gave the song a mixed review, awarding it three of five stars.[21] Isabel Pearson of Nouse gave the song a positive review during her album review, calling the song a \"euphoric, slow building love-song that's raw and undeniably one of the best tracks on this album.\"[22] Sarah Milton of The Upcoming lauded the song, calling it \"electrifying with its blunt honesty and exquisite gospel influence.\"[23]\n\nIn July 2014, Billboard listed \"Stay with Me\" as one of the \"10 Best Songs of 2014 (so far)\" saying that the song is \"a fragile ballad that finds its backbone when a gospel choir assists the British singer on the harrowing chorus.\"[24] Variance Magazine named the song its 2014 Song of Summer.[25] The song was placed at number twelve on Rolling Stone's 50 Best Songs of 2014 list.[26] In January 2015, \"Stay with Me\" was ranked at number 15 on The Village Voice's annual year-end Pazz & Jop critics' poll.\n\nCommercial performance [ edit ]\n\nIn the UK Singles Chart it debuted at number 1, making it Smith's third number one. The song became the eighth best-selling song of 2014 in the UK,[27] and the seventh overall when streaming is included.[28] On the Billboard Hot 100, the song peaked at number 2 for two weeks, making it Smith's first top ten song in the US as a lead artist and their highest charting single to date. It was held off from the top spot by MAGIC!'s \"Rude.\" As of the week of 2 May 2015, \"Stay with Me\" has spent 21 weeks in the top ten and 54 weeks on the Hot 100. The song was the tenth best-selling song of 2014 in the United States with 3.34 million copies sold in that year.[29] As of June 2015, The song has sold 4.1 million copies in the US.[30] In Canada, \"Stay with Me\" topped the Canadian Hot 100 for seven consecutive weeks. In Australia, the song debuted at number 22 on the ARIA Singles Chart on the chart dated 5 May 2014 and later peaked at number 5 on the chart date 16 June 2014.[31] The song also reached top 10 status in over twelve countries worldwide, becoming Smith's most successful single to date.\n\nMusic video [ edit ]\n\nA music video to accompany the release of \"Stay with Me\" was first released onto YouTube on 27 March 2014 at a total length of three minutes and twenty-nine seconds.[32] The video shows Smith coming out of a house and walking down a street in De Beauvoir Town, London, sitting in a room performing the song, and performing the song in a church with a choir. It was directed by Jamie Thraves.[33] \"Stay with Me\" received nominations at the MTV Video Music Awards for Best Male Video and Artist to Watch.[34] As of September 2019, the video has received over 1.0 billion views.\n\nCover versions [ edit ]\n\nIn June 2014, Ed Sheeran covered \"Stay with Me\" at BBC Radio 1's Live Lounge. He explained his choice saying \"It's my favorite song of the last year. I think it's an instant classic.\"[35] Florence and the Machine covered it at the Orange Warsaw Festival.[36] In July, Vin Diesel sang it during an interview with Capital FM.[37] In August, Chris Brown posted a video on Instagram in which he sings the song with lyric changes.[38] Eventual winner Josh Kaufman covered the song for his top 12 performance on the sixth season of The Voice US. Reigan Derry performed the song for \"Top 10 Hits\" themed week on the sixth series of The X Factor Australia, and her performance debuted at number 20 on the ARIA Singles Chart.[39] In September 2014, FKA twigs also covered it at BBC Radio 1's Live Lounge.[40] Also in September, Charli XCX covered it at Live 95.5's Bing Lounge.[41] Luke James also covered the song, which appeared on his 2014 self-titled album.[42] Kelly Clarkson covered the song at her free concert in honor of the new Microsoft store at the SouthPark Mall in Charlotte, North Carolina.[43] Singer Patti LaBelle performed it in November 2014 on her concert tour.[44] Romain Virgo did a reggae cover.[45] In September 2017, Pink covered \"Stay with Me\" at BBC Radio 1's Live Lounge.\n\nIn November 2017, American country singer Coffey Anderson released it as part of his Sad Love Songs series accompanied by a music video directed by Terry W.[46]\n\nThe song is sampled in the track \"Freak\" from Avicii's posthumous album Tim, which it was released on 6 June 2019.[47]\n\nLive performances [ edit ]\n\nMedia usage [ edit ]\n\nThe song is featured in the television shows Mistresses, Girlfriends' Guide to Divorce, Bad Education, and The Mindy Project.\n\nActor Marlon Wayans lip synced this song on the show Lip Sync Battle.\n\nThe song is played in the emotional scene where Mary, Queen of Scots (Adelaide Kane) and a dying Francis II of France (Toby Regbo) dance together in the television show Reign.\n\nIn the 2016 animated film Sing, Johnny (voiced by Taron Egerton) sings this song as his audition for the singing competition.\n\nThe song is also used as the background music for the Inspiron 17 5000 commercial, with Liev Schreiber and Chris Pratt.\n\nFormats and track listings [ edit ]\n\nCD single \"Stay with Me\" – 2:52 \"Stay with Me\" (Radio Mix) – 2:53 Digital download (Darkchild Version)[50] \"Stay with Me\" (Darkchild Version) featuring Mary J. Blige – 2:53 \"Stay with Me\" (Darkchild Version) – 2:54 Digital download (EP)[51] \"Stay with Me\"(Soul Clap Mix) – 5:02 \"Stay with Me\" (Darkchild Version) – 2:54 \"Stay with Me\" (Shy FX Remix) – 3:32 \"Stay with Me\" (Wilfred Giroux Remix) – 4:39 Rainer + Grimm Remix single \"Stay with Me\" (Rainer + Grimm Remix) – 3:34\n\nCharts [ edit ]\n\nCertifications and sales [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/7/73/Sam_Smith_Stay_with_Me.png", "http://upload.wikimedia.org/wikipedia/en/thumb/7/73/Sam_Smith_Stay_with_Me.png/220px-Sam_Smith_Stay_with_Me.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/73/Sam_Smith_Stay_with_Me.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Stay_with_Me_(Sam_Smith_song)", "title": "Stay with Me (Sam Smith song)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/73/Sam_Smith_Stay_with_Me.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}