{"url": "www.newyorker.com/culture/culture-desk/matt-lauers-firing-and-nbcs-theatre-of-accountability", "text": "If, on Wednesday morning, you had risen early enough and rejoined the torrid, infinite march that is Twitter, you might have first learned of NBC’s termination of its morning-news lodestar, Matt Lauer, through neutral channels. At 6:52 A.M., the Times’s media columnist, Jim Rutenberg, tweeted, “BREAK: NBC Matt Lauer fired, inappropriate workplace behavior . . . story to come.” But, at 7 A.M., the “Today in New York” warmup ended, the friendly corporate bells chimed, and the “Today” show, as it has since 1952, started. The minutes in between were a chasm.\n\nStills of Lauer—bespectacled and reviewing notes in one, professorially inquisitive in another—crossed the screen as the voice of his co-anchor, Savannah Guthrie, announced the breaking news that Lauer’s employment had been terminated overnight, after an employee had come forward on Monday “reporting behavior in violation of our company’s standards.” Guthrie’s voice trembled as the camera captured the tableau—Guthrie and her guest co-anchor, Hoda Kotb, palpably sombre, the Popsicle-orange “Today” show logo floating between them. Guthrie clasped Kotb’s hand. She read the entirety of a statement from the NBC News chairman, Andrew Lack, which was composed in the corporate “we”: “we” had reason to believe that the employee’s complaint wasn’t an isolated incident; “we were deeply saddened by this turn of events”; “we will face it together as a news organization—and do it in as transparent a manner as we can.” Then Guthrie and Kotb offered their personal expressions of shock and dismay. Lauer had been loved by so many; “we” loved him. “As I’m sure you can imagine, we are devastated,” Guthrie said. “We’re trying to process it and make sense of it, and it’ll take some time for that,” Kotb said. Expressions of disorientation not dissimilar from expressions of mourning continued for the rest of the show. As Rebecca Traister wrote earlier this month, a “powerful white man losing a job is a death.”\n\nWe have witnessed a theatre of accountability insidiously refine itself, quite quickly, in the past few months. Louis C.K.’s statement, for example, following the exposé in the Times of his sexual harassment of female comics, was not as passionate as, but was more coherent than, Harvey Weinstein’s ramblings about Jay-Z and the gun lobby. The opportunistic finesse of Kevin Spacey’s coming-out certainly tripped some social alarms, but he nonetheless garnered some sympathy. Power brokers like the Pixar animation baron John Lasseter have even scooped long-labored-over articles by preëmpting them altogether. (Lasseter is taking a six-month leave of absence.) No display was savvier than NBC’s orchestration on Wednesday.\n\nThe “Today” show’s artful transposition of grief where there would naturally be scrutiny continued into the 10 A.M. slot, in which the veteran host Kathie Lee Gifford spoke of how much she, too, loved Lauer and how sad she was. It continued on this morning’s program, with Guthrie and Kotb again at the helm. Not since Bill Cosby—or Bill O’Reilly, depending on one’s television diet—has the scourge of sexual assault so acutely infiltrated the righteous perimeter of the American home. (President Trump, also affiliated with NBC and accused of assaulting women, never quite depended on a family-man image.) The influence of a behind-the-scenes figure like Weinstein can feel diffuse, removed from our everyday cultural consumption; Lauer was, and is, synonymous with the family feel of “Today.” Part of this comes from the network’s bloated investment in Lauer—he reportedly earns between twenty million and twenty-five million dollars a year. (In 2014, a source told Page Six that the company chartered helicopter rides for Lauer from his Hamptons compound to its Rockefeller Center studios at his request.) When, in 1996, Lauer wrested the anchor chair from Bryant Gumbel, gossip magazines swooned over his geometric jaw and feathery hair; twenty years later, he was transforming comfortably into a smug but wise paternal figure. His tenure at the “Today” show was the longest in its history. Now instances of Lauer’s public pettiness toward women seem like the exertions of a holistically awful campaign. In 2012, he admonished the actress Anne Hathaway for photographs that the paparazzi had taken of her exiting a car. “Seen a lot of you lately,” he said. And, famously, Lauer was an architect of “Operation Bambi,” a plan that succeeded in getting his former co-anchor Ann Curry fired from the show that same year. (“ ‘Chemistry,’ in television history, generally means the man does not want to work with the woman,” Curry said, according to Brian Stelter’s insider anatomy, “Top of the Morning: Inside the Cutthroat World of Morning TV.”) On her final show, Curry wept and Lauer pretended to soothe her. His interview of Hillary Clinton last year was intrusive and aggressive when compared with his handling of Trump. How a man thinks of women dictates how he works with them.\n\nThe stakes with Lauer, as with Charlie Rose, who was fired from both CBS and PBS last week, for sexual harassment, threaten the geniality and social integrity that are the trade of the morning-show apparatus. And so it is no surprise that, to convey something like moral mooring to a vastly female audience, the networks rely on women anchors to break the public fall. An ether of remorse already fogs the perception of Lauer’s ousting, though Lauer waited a day to issue a statement and in it said, “Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed.” It seems likely that, at least when it comes to the fact of Lauer’s firing, Guthrie had truly been caught off guard. The company, however, wasn’t; reporters at Variety and the Times had spent months investigating claims against Lauer. Guthrie’s vulnerable pose conferred an unearned armament to a company that had employed a reckless man for two decades. The woman anchor’s surprise becomes the network’s surprise; her sorrow, its sorrow. “How do you reconcile your love for someone with the revelation that they behaved badly?” Guthrie asked, her eyes glassy. For her, and for Gayle King, who asked a similar question when reporting on her co-host Rose’s transgressions last week, on CBS, the question of loyalty may be relevant. (It was Lauer who lobbied for Guthrie’s co-anchorship, in 2012, following the success of “Operation Bambi.”) But neither love nor loyalty nor sadness excuses NBC, the company that passed on its own employee’s reportage of Weinstein’s abuse of women. The Variety report on Lauer, published on Wednesday afternoon, included accounts of harassment from three unnamed women. It showed an emboldened player whose harmful wiles were accommodated by the network around him. The news mediates the news.\n\nOne detail from Ramin Setoodeh and Elizabeth Wagmeister’s reporting in Variety mentions a contraption, apparently common in the offices of executives of his stature, that in this context sounds like something used by a villain from a Bond film. The installation of a button under Lauer’s desk made it possible for him to lock himself, and anyone else who might have been invited into his office, inside, without getting up from his seat. The Times reported that NBC on Wednesday had received at least two more complaints from employees about Lauer’s behavior. One woman told the Times that Lauer locked her in his office in 2001: “She said the anchor then stepped out from behind his desk, pulled down her pants, bent her over a chair and had intercourse with her.” She passed out and was taken to a nurse by Lauer’s assistant. Reading the article, I wondered who had seen that commotion, and I thought about the lock, an instrument of security turned into an instrument of violence.", "images": ["https://media.newyorker.com/photos/596fbd91a28215791910e1f3/1:1/w_270%2Cc_limit/st-felix-doreen_avatar.png", "https://media.newyorker.com/photos/5a183c335c93520d44916535/4:3/w_480%2Cc_limit/Shatz-Tariq-Ramadan.jpg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/master/w_2560%2Cc_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "https://media.newyorker.com/photos/5a1c9013486ee46c3e0419ca/4:3/w_480%2Cc_limit/DeRogatis-Why-Not-R-Kelly.jpg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo.f1893bac6dafe13d6d5bad671a5bee2345efa44d.svg", "https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_thescene.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1510947354/thenewyorker_the-backstory-ronan-farrow-tk-tk.jpg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header.6e34c81346bc43475ffd572e6c2eb3e125927148.svg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/16:9/w_1280,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg"], "top_img": "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/16:9/w_1280,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "keywords": [], "authors": ["Doreen St. Félix", "Doreen St. Féli", "Jim Derogati", "Adam Shat"], "canonical_link": "https://www.newyorker.com/culture/culture-desk/matt-lauers-firing-and-nbcs-theatre-of-accountability", "title": "Matt Lauer’s Firing and NBC’s Theatre of Accountability", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Doreen St. Félix", "copyright": "Copyright (c) Condé Nast 2020", "description": "Doreen St. Félix writes about the way in which the “Today” show, on NBC, talked about the firing of Matt Lauer.", "id": "5a201167fc02d4395ac400c5", "keywords": "culture desk,matt lauer,today show,nbc,harvey weinstein", "news_keywords": "culture desk,matt lauer,today show,nbc,harvey weinstein", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a201167fc02d4395ac400c5", "parsely-metadata": "{\"description\":\"Doreen St. Félix writes about the way in which the “Today” show, on NBC, talked about the firing of Matt Lauer.\",\"image-16-9\":\"https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/16:9/w_1000,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/1:1/w_1000,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg\"}", "og": {"description": "The network’s announcement of the “Today” host’s dismissal was a savvy display of moral maneuvering.", "image": "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/16:9/w_1280,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "site_name": "The New Yorker", "title": "Matt Lauer’s Firing and NBC’s Theatre of Accountability", "type": "article", "url": "https://www.newyorker.com/culture/culture-desk/matt-lauers-firing-and-nbcs-theatre-of-accountability"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "The network’s announcement of the “Today” host’s dismissal was a savvy display of moral maneuvering.", "domain": "https://www.newyorker.com", "image": {"src": "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/16:9/w_1280,c_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg?mbid=social_retweet"}, "site": "@NewYorker", "title": "Matt Lauer’s Firing and NBC’s Theatre of Accountability"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.newyorker.com", "summary": ""}