{"url": "https://www.mercurynews.com/2017/11/27/meghan-markle-penned-powerful-essay-on-embracing-her-biracial-identity/", "text": "With their announcement that they are going to marry, Prince Harry and Meghan Markle are making history in several ways.\n\nFor one thing, Markle, 36, isn’t the daughter of a grand aristocratic family, nor is she even British. Rather, she’s an American TV actress and a divorcee.\n\nIn this way, the Los Angeles-reared Markle will be the first American whose marriage to a member of the royal family will be embraced by the “firm,” as the family calls itself. Her situation in 2017 isn’t at all scandalous, unlike that of King Edward VIII, who was forced to abdicate the throne in 1936 in order to marry the twice-divorced American socialite Wallis Simpson.\n\nHowever, Markle’s situation with Harry could be seen as controversial. What is also certainly groundbreaking about the upcoming marriage is that Markle is a woman of color. Her father is white, and her mother is black.\n\nThe idea of a member of the British royal family marrying someone who is biracial set off a range of responses on social media. Not surprisingly, the internet racists had lots of offensive things to say, according to Rawstory.\n\nBut mostly there was celebration, according to Refinery29. The celebration came from people who said, among other things, that it was time for someone to shake up Britain’s class system, which has long been accused of elitist and racist ways.\n\nhttps://twitter.com/eveewing/status/935155617051955201\n\nWE GOT ONE IN THE PALACE, Y’ALL! pic.twitter.com/ijYqJZqmIq — lauren warren (@iamlaurenp) November 27, 2017\n\nActually, Markle’s biracial identity hasn’t been a subject the media has talked about much over the past few months. Part of the reason for the lack of discussion could stem from the unfortunate way the British press addressed her background soon after it became known that she was dating Harry, the Huffington Post said.\n\nA Daily Mail columnist speculated on the “exotic DNA” Markle would bring to the royal family tree and described her mother as “a dreadlocked African-American lady from the wrong side of the tracks.”\n\nOther tabloids used terms like “gangsta” and referred to the “crime-plagued” Los Angeles neighborhood Markle grew up in.\n\nActually, Markle is a “valley girl,” who grew up in a comfortable leafy suburb of Los Angeles’ San Fernando Valley. She’s also a graduate of Northwestern University, one of America’s top colleges.\n\nIt could be that the media heeded Harry’s rare public condemnation of the tabloids writing pieces with “racial undertones” about his girlfriend, or of reporters harassing her and her family.\n\nThen again, Markle herself may have diffused tensions by writing openly herself about the challenges of being biracial.\n\nIn December 2016, she penned a poignant essay for Elle UK. In the essay, she said she’s been asked to explain her racial heritage nearly every day of her life, from the time she was a little girl to when she was auditioning for roles in movies and on TV in the “label-driven” entertainment industry.\n\nMarkle said her parents met in the 1970s. Her father worked as a lighting designer for a TV soap opera, and her mother eventually became a yoga teacher.\n\nWhile the neighborhood they raised her in was comfortable, it wasn’t diverse, she said. So her family stood out: “And there was my mom, caramel in complexion with her light-skinned baby in tow, being asked where my mother was since they assumed she was the nanny.”\n\nOne of the challenges of being biracial is that society wants to categorize people as one thing or the other — either white or black, she said.\n\nShe felt this push most acutely in seventh grade when she was asked to fill out a census document that asked her to indicate her ethnicity. But her only choices were white, black, Hispanic or Asian.\n\n“You could only choose one, but that would be to choose one parent over the other – and one half of myself over the other,” she wrote.\n\nWhen she told her father that night about her dilemma, he calmly, but with visible anger, told her, “If that happens again, you draw your own box.”\n\nMarkle added that she has been with her mother when she was called the N-word, notably when she was home on break from college. As they were a driving away from a concert, another motorist yelled the slur at her mother.\n\n“My skin rushed with heat as I looked to my mom,” she wrote. “Her eyes welling with hateful tears, I could only breathe out a whisper of words, so hushed they were barely audible: ‘It’s OK, Mommy.’ ”\n\nMarkle said she found that being “ethnically ambiguous” brought disadvantages when she was auditioning for parts in TV and in films. She often found she wasn’t “enough” for certain roles: “I wasn’t black enough for the black roles and I wasn’t white enough for the white ones.”\n\nSo she was grateful for the role of Rachel Zane in the TV legal drama “Suits” because the producers were looking for an actress who could pull off being a beautiful woman with a fine legal mind — regardless of race.\n\n“In making a choice like that, the ‘Suits’ producers helped shift the way pop culture defines beauty,” she said.\n\nMarkle said she was even more delighted in Season 2 when the producers cast Wendell Pierce, a dark-skinned African-American actor, to play the part of Rachel’s father. Pierce, by the way, issued congratulations to Markle on news of her engagement:\n\nCongratulations to my TV daughter Meghan Markle and Prince Harry on the news of their wedding engagement. Harry you have her TV Father’s blessing. Robert Zane approves @Suits_USA — Wendell Pierce (@WendellPierce) November 27, 2017\n\nNearly a year before she became engaged to the fifth in line to the British throne, Markle said in her essay that she would continue to live by her father’s words: She would draw her own box and voice her pride in being a mixed-race woman.\n\n“While my mixed heritage may have created a gray area surrounding my self-identification, keeping me with a foot on both sides of the fence, I have come to embrace that,” she wrote.", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2017/03/meghanmarkle131.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2017/11/markle2.jpg?w=1024&h=856", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/11/markle10.jpg?w=620&crop=0%2C0px%2C100%2C9999px", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/11/markle2.jpg?w=1024&h=856", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/11/27/meghan-markle-penned-powerful-essay-on-embracing-her-biracial-identity/", "title": "Meghan Markle penned powerful essay on embracing her biracial identity", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "With their marriage, Meghan Markle and Prince Harry are making history in a number of ways, including the fact that Markle is biracial.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Meghan Markle penned powerful essay on embracing her biracial identity", "url": "https://www.mercurynews.com/2017/11/27/meghan-markle-penned-powerful-essay-on-embracing-her-biracial-identity/", "description": "With their marriage, Meghan Markle and Prince Harry are making history in a number of ways, including the fact that Markle is biracial.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/11/markle2.jpg?w=1024&h=856", "width": 1024, "height": 856}, "locale": "en_US"}, "article": {"published_time": "2017-11-27T19:18:15+00:00", "modified_time": "2017-11-28T12:38:01+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Meghan Markle penned powerful essay on embracing her biracial identity"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/11/markle2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1511712000.0, "source": "https://www.mercurynews.com", "summary": ""}