{"url": "https://web.archive.org/web/20121222121141/http://www.pbs.org/newshour/bb/politics/july-dec12/shieldsgerson_12-21.html", "text": "JUDY WOODRUFF: And now to the analysis of Shields and Gerson. That's syndicated columnist Mark Shields and Washington Post columnist Michael Gerson.\n\nDavid Brooks is off tonight.\n\nGentlemen, it's good to have you with us.\n\nMARK SHIELDS: Good to be with you.\n\nJUDY WOODRUFF: So, Mark, the fiscal cliff, it's still with us. It's still out there. The president made a last-minute statement late this afternoon. Where does everything stand?\n\nMARK SHIELDS: Nobody knows, Judy.\n\nRELATED INFORMATION The very best from our political pundits, NewsHour regulars Mark Shields and David Brooks.\n\nWhat happened last night in the Republican Caucus is precedent-shattering. I mean, it really is, that John Boehner could not get a majority of his own caucus to support what had become the Republican position, endorsed not simply by him, but by Republican Whip Kevin McCarthy and Republican Majority Leader Eric Cantor.\n\nAnd it's a real problem. I think it puts at risk Boehner's own leadership and his ability to deliver Republicans. It weakens the bargaining position for Republicans in the final negotiations. But I don't know how much closer we are, because I think it strengthens the liberals in the Democratic Caucus, which is going to make it tougher for the Republicans to accept it, because a weakened Republican means a strengthened, emboldened Democratic liberal group.\n\nAnd I just think that there's too many moving parts at this point to say, this is what is going to happen.\n\nJUDY WOODRUFF: Do you -- what do you -- can it get done, Michael? I mean, it's. . .\n\nMICHAEL GERSON: Well, I generally agree with Mark.\n\nAnd today was supposed to be the end of the world. I think it feels like it for Boehner. This is a case where he ended up with 40 to 50 members of his caucus that wouldn't support anything on this.\n\nMICHAEL GERSON: And they were to the right of Grover Norquist. Norquist was open to the Plan B.\n\nJUDY WOODRUFF: Because he had endorsed Plan B.\n\nMICHAEL GERSON: Right, exactly. So, they want to go off the cliff flags flying. It marginalized Boehner and the Republicans in future negotiations, and raised a question of whether anyone can get a governing majority in the House of Representatives when it comes to the budget.\n\nThose are really serious matters. Now, it does go to the Senate, where Harry Reid and McConnell can try to come to some, you know, functional surrender for Republicans on rates, and kick the can on a lot of other issues, and see if that can pass in the next 10 days.\n\nBut that still would pass -- have to pass the House. And so I think the chances of backing off, off the cliff are higher than they ever have been.\n\nJUDY WOODRUFF: You know, I listened to some of these recalcitrant House Republicans today, Mark. And they were saying, I was not going to vote for a tax increase, when my constituents would never have gone along with that.\n\nMARK SHIELDS: Well, I think there's two realities, here, Judy.\n\nFirst of all, there's a lot of Republicans, and more than a few Democrats, who are terrified of one thing. That's being primaried, a primary opponent who is going to run on your right if you are a Republican, on your left if you are a Democrat. But it's really become a problem for Republicans, because this has been an article of faith that -- said before it is since 1990 that any Republican in the House or the Senate has voted for a tax increase on Capitol Hill, any Republican.\n\nNow, of the 241 Republicans now in the House, 212 of them have come to the Congress since 1990. So, they have never voted for a tax increase. They don't know anybody who has voted for a tax increase. And they were being asked to vote for a tax increase for a tactical advantage on a piece of legislation that they knew the president, A., would veto, B., wouldn't pass the Senate.\n\nJUDY WOODRUFF: Only on people earning over a million.\n\nMARK SHIELDS: A million dollars, but they were going to give up their virginity, their political virginity, and risk a primary challenge -- that is how they saw it -- by doing this.\n\nWhat they failed to address is the reality that, when you are the -- part of the governing party in any institution, the House, the Senate, anyplace else, you have a responsibility to make sure that you can govern. And what they did was, they robbed the Republicans, that 40 to 50. They robbed the Republicans of that -- that sense of leadership, of governability, and robbed them, I think, and reduced the brand of the Republican Party even more.\n\nJUDY WOODRUFF: Is it a fundamental disagreement over what governing is?\n\nMICHAEL GERSON: Yes, I think that that is part of it.\n\nI think what they couldn't answer is how they are going to get a better result. . .\n\nMARK SHIELDS: That's right.\n\nMICHAEL GERSON: . . . after you -- when you go over the cliff, or later on in these negotiations, because they're not. This actually undermines their negotiating power and position, which -- because it is a foolish position to be in.\n\nBut it does -- it raises some really big issues. I mean, one of them here is that we now have a president and a speaker who both wanted a deal, OK? By every account, they wanted a deal. They tried it twice. And they couldn't make it happen.\n\nNow, they -- and I don't think they can make it happen. It's a serious kind of governing challenge right now. If you look, we have got a short-term political crisis. We have a long-term fiscal crisis. And we're providing no confidence whatsoever that we can approach those things as a government in a mature way.\n\nWe look increasingly like we have the dysfunction, the governmental dysfunction of Europe, without the excuse of being separate countries. And, you know, I think it's a serious challenge to America's standing in the world, that -- the views of credit markets. And Washington is not taking that yet with sufficiency seriously -- seriousness.\n\nMARK SHIELDS: Yes.\n\nI would just add, and not in a partisan way, but the 213 -- 215-209 vote last night in the House before the whole thing came apart, which was that -- to not take the sequestration funds out of defense, but to take them out of domestic spending, was a party-line vote; 209 Democrats stuck on that. Not a single one broke.\n\nAnd I think -- I think you are seeing far more unity in the Democratic ranks than you are in the Republican ranks right now. I agree it is a governmental problem. If the whole thing comes to a grinding halt and we see it reflected in the financial markets and the stock market and elsewhere, then it's a governmental problem. It's not simply a Democratic advantage, a Republican advantage.\n\nBut, right now, the real fault lines are in the Republican Caucus.\n\nJUDY WOODRUFF: Well, we don't -- sounds like neither one -- none of us knows where this is headed.\n\nSo let's move to another subject.\n\nMichael, the president today named John Kerry to be secretary of state. It had been widely believed he wanted to choose the U.N. ambassador, Susan Rice.\n\nJohn Kerry -- what do you make of the choice?\n\nMICHAEL GERSON: Well, it's a -- I think, a safe choice and a good choice. I mean, this is a man who has had three decades on the Foreign Relations Committee, former presidential candidate, would have immediate standing on the global stage, similar to Hillary Clinton, in this kind of job.\n\nHe's also been a troubleshooter for the president in some key ways, under the radar screen. When South Sudan was separating from the North, and it looked like those negotiations were breaking down, Kerry came in and really made a difference there. So, I think that, I mean, he looks good after the Rice nomination. He is a less controversial nominee.\n\nHe has a lot of respect among his colleagues in the Senate. And so I think that the president -- you know, it was not -- not particularly a hard choice.\n\nJUDY WOODRUFF: Mark?\n\nMARK SHIELDS: I think James Mann and David Ignatius put it very well, I mean, that he is -- he is experienced, probably unmatched in experience. He does bring considerable stature, on a first-name basis with many of the people around the world with whom he will be dealing. He has done, as David pointed out, back-channel missions for the president, whether it's dealing with Hamas, Afghanistan, Pakistan.\n\nAnd he is eminently confirmable. That's in the Senate. There is no question about it. And it opens up a possibility of a Republican seat in Massachusetts. So, Republicans are cheered by that.\n\n(LAUGHTER)\n\nJUDY WOODRUFF: And, just quickly, before we leave that, there was a -- and this -- we heard this mentioned earlier, that some -- there is still conversation about whether the president is going to name, may name Chuck Hagel, former Republican senator, to be secretary of defense.\n\nA lot of criticism has risen up. Outside groups are saying they are going to defeat him if he's named. What is going on there?\n\nMARK SHIELDS: Yes.\n\nWell, I mean, certainly, Chuck Hagel has been subjected to withering criticism for his lack of constant or at least unswerving support of every Israeli administration. That has been a central part. There are people who have personal issues with Chuck Hagel.\n\nI personally think, A., he's close to the president. He was close to the president when the president was in the Senate. And I think he brings to it credentials that are sadly lacking in this administration. I mean, this is somebody who has spilled blood, shed blood for his own country, spilled blood for his country, faced combat, chose to go to Vietnam.\n\nHe had orders to go to Germany as an enlisted man. He insisted on going to Vietnam, where he faced serious combat. I just think -- I think he brings to it the first Vietnam veteran to be secretary of defense and the only enlisted man ever to be Secretary of Defense. I think those are credentials that are needed.\n\nJUDY WOODRUFF: Any thoughts on that?\n\nMICHAEL GERSON: I think that, sometimes, people say these trial balloons are a sign of presidential weakness if they don't go up.\n\nThey're not really. They're actually a smart way for a president to gauge this. I think the opposition to Hagel is growing. I think it is rooted in disagreements, not just about Israel, but about defense cuts, but about his views on Iran, which are significantly to the left of president, and because he has -- he doesn't have a lot of respect of former colleagues here, which are already coming out, and many of them in opposition.\n\nI think it's an unlikely nomination.\n\nJUDY WOODRUFF: Let me turn you both to the gun control discussion.\n\nWe heard from the head of the NRA, Mark, today, Wayne LaPierre, who is advocating putting an armed guard in every school. The president has launched a task force this week. Where do you see this headed?\n\nMARK SHIELDS: I mean, to call Wayne LaPierre and the NRA have a tin ear, I think is an understatement. I mean, they seem to be almost whining about criticism of their position, that it somehow was rooted in the press bias or elected officials who have gun-free school zones.\n\nYou know, Judy, the reality is -- and it's a terrible reality -- since Robert Kennedy died in the Ambassador Hotel on June 4, 1968, more Americans have died from gunfire than died in all the -- all the wars, all the wars of this country's history, from the Revolutionary through the Civil War, World War I, World War II, in those 43 years.\n\nWe have half the guns that are in the world are in the United States. I mean, guns are a problem. And I think they still have to be confronted.\n\nJUDY WOODRUFF: Something like 280 million guns.\n\nMICHAEL GERSON: Yes. And we're not going to get rid of all those guns. That's not going to happen. The question is. . .\n\nMARK SHIELDS: Well, we could do -- we could do Daniel Patrick Moynihan, and tax ammunition.\n\nMICHAEL GERSON: Well, yes.\n\nI think that there -- but there are a series of reasonable measures we could take, even going back to what we were doing in the 1990s, when it comes to ammunition, and magazine size, and assault -- certain types of semiautomatic weapons.\n\nYou should be able to make that case. We have swung so far in this debate in the libertarian direction, that those are fairly minimal burdens on anyone's rights when it comes to this that might have a marginal positive in fact -- impact on gun violence.\n\nBut any solution is also going have to deal with mental health issues. Security in schools, I don't think it's practical to put armed people in tens of thousands of schools. But security in schools, as well as reasonable gun controls, we're going to have to do a bunch of things in this area.\n\nJUDY WOODRUFF: Sobering topic, and we will be coming back to it.\n\nMichael Gerson, Mark Shields, thank you both.\n\nMARK SHIELDS: Thank you, Judy. Thank you.\n\nJUDY WOODRUFF: And Merry Christmas.\n\nMICHAEL GERSON: Merry Christmas.\n\nMARK SHIELDS: Merry Christmas to you. Thank you.", "images": ["https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/home/title-mw-video.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-search-2.gif", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/obamabiden_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://ad.doubleclick.net/ad/n6735.PBS/news_general_NewsHour;tile=1;sz=300x250;ord=123456789", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-recent-programs-2.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-subscribe-2.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/btn_watchfull.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/guns_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/sponsors/logo_knight.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/mw-video-next-arrow.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-topics-2.gif", "https://web.archive.org/web/20121222121141im_/http://b.scorecardresearch.com/p?c1=2&c2=3005420&cv=2.0&cj=1", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/shared/pbs-promote.png", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/home/title-world.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/shared/hdr_related.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/shared/hdr_links_extra.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/home/title-footer-topics.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/btn_more.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/sponsors/box/viking.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/shared/hdr_links_headlines.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/hdr_friday_segs.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/damascus_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/bork_1_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-video-2.gif", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/lieberman_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/18/markwarner_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary/idc/political_wrap.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/logo-pbs-newshour.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-teacher-resources-2.gif", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/benghazi1_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/btn_listenfull.jpg", "https://web.archive.org/web/20121222121141im_/http://pixel.quantserve.com/pixel/p-5do3OH0wrSfK6.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/otn/friday.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/header/btn-rundown-2.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/icon-playback-options.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/icons/mw-video-previous-arrow.gif", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/primary2/shared/video_correspondents.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/21/shieldsgerson2_homepage_square_thumbnail.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/sponsors/box/bnsf.jpg", "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/19/newswrap_video_small.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/sponsors/box/cpb.jpg", "https://web.archive.org/web/20121222121141im_/http://www.pbs.org/newshour/images/sponsors/box/viewers2.gif"], "top_img": "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/21/shieldsgerson2_homepage_square_thumbnail.jpg", "keywords": [], "authors": ["Pbs Newshour"], "canonical_link": "", "title": "Shields and Gerson on Cabinet Noms, Gun Laws, Boehner's Leadership | PBS NewsHour | Dec. 21, 2012", "meta_data": {"title": "Shields and Gerson on Cabinet Noms, Gun Laws, Boehner's Leadership | PBS NewsHour | Dec. 21, 2012", "description": "Syndicated columnist Mark Shields and Washington Post columnist Michael Gerson discuss the week's top political news with Judy Woodruff, including the president's second-string Secretary of State John Kerry, House Speaker John Boehner's fledgling following and the NRA press conference.", "keywords": "Mark Shields, David Brooks, Michael Gerson, fiscal cliff, John Kerry, Obama, Newtown, gun legislation, Congress, North America, Politics, Shields and Brooks, NewsHour, PBS", "news_keywords": "Mark Shields, David Brooks, Michael Gerson, fiscal cliff, John Kerry, Obama, Newtown, gun legislation, Congress, North America, Politics, Shields and Brooks, NewsHour, PBS", "date": "2012-12-21T18:32:00-05:00", "author": "PBS NewsHour", "copyright": "Copyright 2012 PBS NewsHour", "robots": "all", "og": {"title": "Shields and Gerson on Cabinet Noms, Gun Laws, Boehner's Leadership | PBS NewsHour | Dec. 21, 2012", "description": "Syndicated columnist Mark Shields and Washington Post columnist Michael Gerson discuss the week's top political news with Judy Woodruff, including the president's second-string Secretary of State John Kerry, House Speaker John Boehner's fledgling following and the NRA press conference.", "image": "https://web.archive.org/web/20121222121141im_/http://newshour.s3.amazonaws.com:80/photos/2012/12/21/shieldsgerson2_homepage_square_thumbnail.jpg"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}