{"url": "https://en.wikipedia.org/wiki/Kym_Herjavec", "text": "Kym Herjavec (née Johnson; born 4 August 1976) is an Australian professional ballroom dancer and television performer who appeared in the first three seasons of the Australian version of Dancing with the Stars as a professional dancer, before moving to the U.S. version of the franchise from 2006 to 2015. Johnson returned as a professional to the U.S. series in 2017 for its 24th season. She also served as a judge on the Australian version of the show from 2013 to 2015. She is the wife of Robert Herjavec.\n\nDance biography [ edit ]\n\nJohnson began dancing at the age of three. She began ballroom dancing at 13 years of age.[1] In 1998, she and her partner, Lithuanian Tomas Atkocevicius, placed second at the Australian Dancesport Championships in the Open Amateur Modern Ballroom.[2] They also were finalists as the U.K. Ballroom Championships at Blackpool. She retired from competitive ballroom dance in 2001, but continued dancing on stage.\n\nSince 2001, she has appeared in a number of events and films, including:\n\nBurn the Floor, a touring ballroom dance production.\n\nPerforming at Elton John's 50th birthday party.\n\nTelevision appearances [ edit ]\n\nIn Australia [ edit ]\n\nJohnson's first major television appearance was as a professional on Dancing with the Stars, a televised ballroom dance competition.\n\nShe appeared on Seasons 1-3 of Dancing with the Stars in Australia in 2004 and 2005. In Season 2, she and her partner, television presenter Tom Williams were the winning couple; they both then performed in the Champion of Champion series. Johnson also made a cameo during the 4th Australian series Dancing with the Stars Grand Final, performing with musician Alex Lloyd.\n\nIn early 2006, she appeared on the Australian program Australian Celebrity Survivor: Vanuatu on behalf of the Merry Makers. She was the first one voted out of her Moso tribe and the game. She received all 6 votes, 5 from her tribemates and her own vote. Johnson is one of the few Survivor contestants worldwide to vote herself out of the game, as self-voting is generally against the rules in most editions.\n\nIn 2013 Johnson appeared on The Celebrity Apprentice Australia (season 3) but got fired on the fourth week as the losing project manager.[3]\n\nIn 2013, Johnson became a judge on the Australian version of Dancing with the Stars.\n\nDancing with the Stars Australia results:\n\nSeason Partner Place 1 Justin Melvey 3rd 2 Tom Williams 1st 3 Michael Caton 9th\n\nIn the United States [ edit ]\n\nLater the same year (2006), Johnson appeared on season 3 of the US Dancing with the Stars, partnering with talk show icon Jerry Springer. They proved to be popular and were the 7th couple sent off. During the series Johnson wrote a Behind the Scenes' Diary for OK! Magazine Australia.\n\nJohnson later continued to tour America with the Dancing with the Stars Tour, but was unable to perform in every show due to an arm injury.\n\nJohnson returned to the ballroom on 19 March for Season 4, this time partnered with member of N'Sync Joey Fatone. She became the runner-up professional dancer of this season.[4] After the completion of Dancing with the Stars, Johnson and Joey Fatone celebrated by going on the inaugural Mediterranean cruise for the Disney Cruise Line. The two performed for the ship's guests on 2 June 2007. Billionaire Mark Cuban was her Season 5 Partner. They were voted off in the fifth week. In season 6 she competed with magician Penn Jillette, but they were the first voted off in the Double-Elimination in the second week. Johnson competed on season 7 partnered with former NFL Player Warren Sapp. They finished in second place behind Brooke Burke and Derek Hough. This was Johnson's second time being the professional runner-up.\n\nJohnson returned to the ballroom for Season 8, and she was paired with actor David Alan Grier. They were eliminated in the fifth week of competition on 7 April 2009.\n\nFor Season 9, Johnson was paired with Donny Osmond. Osmond and Johnson were crowned the champions on 24 November 2009, making Johnson the only dance professional to have won the title in two different countries. During this season, Johnson wrote a behind-the-scenes blog of her experiences for www.okmagazine.com.\n\nIn Season 11 Johnson was partnered with actor David Hasselhoff. Hasselhoff and Johnson were the first to be eliminated, making it the second time she was eliminated in the first round including the double elimination in Season 6 and the fourth professional dancer to come in last place more than once after Alec Mazo, Edyta Sliwinska & Jonathan Roberts.\n\nAlong with Maksim Chmerkovskiy and Ashly DelGrosso-Costa, Johnson appears in the DVD Dancing With The Stars: Cardio Dance.\n\nFor season 12 of DWTS, Johnson partnered with professional athlete Hines Ward. During rehearsal after Episode 19, Johnson suffered a neck injury, and reported that she was \"shaken up\" but would be all right. The couple performed the dance as scheduled, and went on to win the season on 24 May 2011.\n\nFor season 13, Johnson was partnered with actor and producer David Arquette. They were voted off in the seventh week of the competition and came in 6th place.\n\nIn Season 14, Johnson was partnered with Jaleel White. They were the sixth couple to be eliminated, finishing in 7th place.\n\nFor Season 15, She danced with her Season 4 partner Joey Fatone. They were the second couple to be eliminated, finishing in 12th place. During week eight, she returned to perform a trio Salsa with Emmitt Smith and Cheryl Burke. The trio earned a 30 from the judges.\n\nFor Season 16, she partnered with General Hospital star Ingo Rademacher. They made it to the semi-finals, but were eliminated, landing them in fifth place.\n\nIt was announced on 11 February 2015, that Johnson would return to the United States as a professional dancer on the 20th season of Dancing with the Stars.[5] She was paired with Shark Tank star and her future husband Robert Herjavec. They were the seventh couple to be eliminated, finishing in 6th place.\n\nIt was announced on 27 February 2017, that Johnson would return as a pro on 24th season of Dancing with the Stars. She is partnered with actor and retired professional wrestler Mr. T. They were eliminated in Week 4, and finished in 10th place\n\nDancing with the Stars (U.S.) results [ edit ]\n\nDancing with the Stars Performances [ edit ]\n\n(Season 3) With Jerry Springer -average: 20.8 [ edit ]\n\n(Season 4) With Joey Fatone -average: 27.5 [ edit ]\n\n(Season 5) With Mark Cuban -average: 20.4 [ edit ]\n\n(Season 6) With Penn Jillette -average: 16.5 [ edit ]\n\nWeek # Dance/Song Judges' score Result Inaba Goodman Tonioli 1 Cha Cha Cha/ \"Fool In Love\" 5 6 5 No Elimination 2 Quickstep/ \"Man With the Hex\" 6 6 5 Eliminated\n\n(Season 7) With Warren Sapp -average: 24.8 [ edit ]\n\nScore was awarded by stand in judge Michael Flatley.\n\n(Season 8) With David Alan Grier -average: 20.8 [ edit ]\n\n(Season 9) With Donny Osmond -average: 25.5 [ edit ]\n\nScore was awarded by stand in judge Baz Luhrmann.\n\n(Season 11) With David Hasselhoff -average: 15 [ edit ]\n\nWeek # Dance/Song Judges' score Result Inaba Goodman Tonioli 1 Cha Cha Cha/ \"Sex Bomb\" 5 5 5 Eliminated\n\n(Season 12) With Hines Ward -average: 26.73 [ edit ]\n\n(Season 13) With David Arquette -average: 22.3 [ edit ]\n\n(Season 14) With Jaleel White -average: 24.9 [ edit ]\n\n(Season 15) With Joey Fatone -average: 21.5 [ edit ]\n\n(Season 16) With Ingo Rademacher -average 22.7 [ edit ]\n\n(Season 20) with Robert Herjavec - average: 30.3 [ edit ]\n\n(Season 24) with Mr. T - average: 23.5 [ edit ]\n\n5678 Fitness [ edit ]\n\nIn October 2015, Johnson announced that she would be releasing her first fitness DVD, 5678 Fitness, and a book entitled The 5678 Diet, in January 2016.[6]\n\n5678 Fitness is a full-length at home fitness program based on cardio-Latin dance, combining high energy dance routines with a total body workout.[7] In conjunction with the launch of her personal fitness and lifestyle brand, Kym Johnson shares her life lessons, nutrition and exercise plans, and entertainment style through anecdotes, recipes, and contributions from her celebrity dance partners in her first book The 5678 Diet.[8]\n\nPersonal life [ edit ]\n\nJohnson was previously engaged to Australian cricket player Shane Watson.[9]\n\nIn September 2015, Johnson confirmed that she and her Dancing with the Stars season 20 partner, businessman Robert Herjavec, were in a relationship.[10] On February 27, 2016, the couple became engaged.[11] She and Herjavec married on July 31, 2016 in Los Angeles, and she has since changed her last name.[12] Herjavec gave birth to the couple's twins: son, Hudson Robert Herjavec, and daughter, Haven Mae Herjavec, on April 23, 2018 at 7:44am and 7:45am.[13]", "images": ["https://upload.wikimedia.org/wikipedia/commons/f/f4/Kymjohnson.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Kymjohnson.jpg/220px-Kymjohnson.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Kymjohnson.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kym_Herjavec", "title": "Kym Herjavec", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Kymjohnson.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}