{"url": "https://www.hollywoodreporter.com/news/isla-fisher-releases-mock-psa-remind-she-is-not-amy-adams-1046456", "text": "The actress talked about the confusion on 'Jimmy Kimmel Live!'\n\nWhen visiting Jimmy Kimmel Live! on Thursday, Isla Fisher talked about how fans constantly confuse her with actress Amy Adams. Fisher admitted that she usually tries to correct people, but that she sometimes goes along with the assumption.\n\nFor instance, she almost got caught in a lie at the Vanity Fair Oscars afterparty. \"The crowd parted and there was Lady Gaga and she’s heading right toward me and she says, ‘Thank you. Your performance in American Hustle, Amy….’” The actress is a big fan of the singer and didn’t want to tell her the truth, so she went along with her presumed identity as Amy Adams. “So I just gracefully thanked her and bowed my head.” As she continued to fall deeper into the lie, her true identity was almost exposed. “I look over her shoulder and there’s Amy Adams walking into the party.” She quickly created a diversion by pointing to Adams and saying, “There’s Isla Fisher. She’s not even nominated for anything. What’s she doing here?”\n\nThe actress also recalled a time when a mother and her children spotted Fisher at IKEA and requested that she sing “That’s How You Know,” a song Adams performs in Enchanted. “I’m tone-deaf,” Fisher prefaced before singing a few lines from the song to Kimmel. After hearing Fisher’s rendition, the woman “backed away realizing that I was clearly not Amy Adams.”\n\nIn order to avoid any more confusion, Fisher brought a PSA to explain the differences between the two actresses. “I feel as though I should, this evening, set the record straight,” she said while introducing the clip.\n\nThe PSA opens with Fisher standing in front of a white backdrop with a piano playing in the background. “Hello. I’m Isla Fisher and I’d like to clear something up,” she began. “I am not Amy Adams. Amy Adams and I are completely different people.”\n\nFisher first explained that she and Amy Adams have different hair colors. “Amy Adams has auburn red [hair]. My hair is light auburn red,” she said. She then pointed out that they have had different roles. “Amy Adams played Susan in Nocturnal Animals. I played Laura in Nocturnal Animals.”\n\nThe actress also explained that they have different accomplishments. “Amy Adams has five Oscar nominations,” she said. “I am a member of SAG.”\n\nAnd Fisher joked that she and Adams might also be confused for another redheaded actress. “Amy Adams played Maya in Zero Dark Thirty. Oh wait, no. That was Jessica Chastain,” she said. “OK, maybe it’s a little hard to tell us apart,” Fisher admitted. “But the point is when you come up to any of us and say ‘I love you in Arrival,’ it hurts because we weren’t in Arrival.”\n\nFisher concluded the PSA by stating, “We have totally different names, hence we are totally different people.” She also wanted to remind everyone that she’s “not Wendy from the hamburger commercials.”", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2017/10/isla_fisher_is_not_amy_adams-_screen_shot_0.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/10/isla_fisher_is_not_amy_adams-_screen_shot_0.jpg", "keywords": [], "authors": ["Katherine Schaffstall", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/isla-fisher-releases-mock-psa-remind-she-is-not-amy-adams-1046456", "title": "Isla Fisher Releases Mock PSA to Remind Everyone That She Is Not Amy Adams", "meta_data": {"viewport": "width=device-width", "description": "The actress talked about the confusion on 'Jimmy Kimmel Live!'", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/isla-fisher-releases-mock-psa-remind-she-is-not-amy-adams-1046456", "domain": "https://www.hollywoodreporter.com/", "title": "Isla Fisher Releases Mock PSA to Remind Everyone That She Is Not Amy Adams", "description": "The actress talked about the confusion on 'Jimmy Kimmel Live!'", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/10/isla_fisher_is_not_amy_adams-_screen_shot_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Isla Fisher Releases Mock PSA to Remind Everyone That She Is Not Amy Adams", "description": "The actress talked about the confusion on 'Jimmy Kimmel Live!'", "url": "https://www.hollywoodreporter.com/news/isla-fisher-releases-mock-psa-remind-she-is-not-amy-adams-1046456", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/10/isla_fisher_is_not_amy_adams-_screen_shot_0.jpg", "width": 928, "height": 523, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Isla Fisher Releases Mock PSA to Remind Everyone That She Is Not Amy Adams", "sailthru.description": "The actress talked about the confusion on 'Jimmy Kimmel Live!'", "sailthru.author": "Katherine Schaffstall", "sailthru.vertical": "Television", "sailthru.date": "2017-10-06 09:28:21", "sailthru.tags": "Movies,Television,Amy Adams,Isla Fisher,Jimmy Kimmel,Jimmy Kimmel Live!,Late-Night TV"}, "movies": [], "publish_date": 1507253301.0, "source": "https://www.hollywoodreporter.com", "summary": ""}