{"url": "https://en.wikipedia.org/wiki/Dawson_Leery", "text": "Dawson Wade Leery is the central character from the WB television drama Dawson's Creek, portrayed by James Van Der Beek, and appeared in 122 episodes and in a cameo in Scary Movie (2000).\n\nFictional biography [ edit ]\n\nBackground [ edit ]\n\nDawson is the first child and only son of Mitch Leery and his college sweetheart, Gail Leery. He was born on March 14, 1983. His three best friends are Joey Potter, the girl across the creek, whom he considers his soulmate, Pacey Witter, Capeside High's class clown, and Jen Lindley, the new girl in town. Dawson is joined by a sister, Lily, who is born when he is 18.\n\nSeason 1 [ edit ]\n\nAn eternal optimist (at least originally), Dawson believes in the good old fashioned values of romance and honesty, and he also believes that you can find all of life's answers in a Steven Spielberg film. He was a keen filmmaker and made several low cost and amateur films, which were entered into film festivals across the country, and in some festivals his films won top prize. He and long-time friend Joey Potter spend much of their time together, often sleeping in Dawson's bed together. However, their relationship complicates as they age and especially with the arrival of New York exile Jen Lindley, who moves in next door to Dawson. He enters into his first relationship with her, but after her ex visits, she dumps him, insisting she needs time for herself.\n\nAfter this, a series of events causes him to see lifelong friend Joey in a whole new light. First, his wise-cracking best friend Pacey Witter asks for Dawson's permission to ask Joey out. Dawson responds jealously. Later, he sees Joey looking sophisticated and mature for a Beauty Pageant, which opens his eyes to her beauty. Finally, he joins Joey on a birthday visit to her father in prison and tells Mike Potter all about the daughter he doesn't know. While Joey wrestles with the idea of spending a year in France, Dawson realizes that he can no longer hold back his romantic feelings towards her. The season ends with Dawson and Joey kissing in front of his bedroom window.\n\nSeason 2 [ edit ]\n\nAlthough initially Dawson and Joey have smooth sailing, newcomer Jack McPhee comes to town and develops feelings for Joey, eventually kissing her. The kiss confuses Joey, who is struggling to find a passion in life. She dumps Dawson in an effort to find herself, but ends up quickly dating Jack. This sends Dawson back into the arms of Jen, who has been flirting with her old rebellious ways, and helps Dawson cut loose. All along, Dawson mopes over the loss of Joey, even making a movie recounting their breakup.\n\nWhen Joey's relationship with Jack crumbles due to the revelation that he is homosexual, she comes literally crying to Dawson. For his sixteenth birthday, Dawson feels depressed that he hasn't grown and wasn't able to keep Joey, so he gets drunk with Andie McPhee. This results in him insulting nearly all of his friends, including Pacey, of whom Dawson is envious for his newly together life. Soon Dawson and Joey end up back together. However, their reconciliation is short-lived, as Dawson soon learns that Joey's father, who has gotten paroled from jail, is selling drugs again. Dawson urges Joey to wear a wire to bust her father. After this, Joey vows that she will never forgive Dawson for the position he put her in.\n\nSeason 3 [ edit ]\n\nAfter a summer spent with his mom in Philadelphia, Dawson returns to Capeside still reeling from his split with Joey. On the bus ride home, he meets Eve, a mysterious, blonde femme fatale that seems intent upon luring Dawson with her sex appeal. After make out scenes in the janitor's closet and in front of the entire school at a pep rally, Eve convinces Dawson to go for a ride in his dad's boat. He does, but wrecks it on the way in and is told he must pay $3,000 to repair the damage to the dock he crashed into. Pacey then convinces Dawson to throw a stripper party at his parents' house to earn the money to pay for the dock. Although they successfully gather enough money, Mitch catches everyone leaving the house and Dawson knows he's in trouble.\n\nIn the meantime, Dawson finds Eve snooping around in Grams's house one night. Before he had realized that it was Eve he had called the police and it is Deputy Doug that turns up on the scene. He brushes it off afterwards, not wanting to get Eve in trouble. He later discovers an old photograph of a blonde lady in the house-boat that Eve has been living in, which he takes. Doug informs Dawson that the boat belongs to an elderly couple.\n\nWhen Eve later comes for the photo he insists that Eve tell the truth. Eve reveals that she is adopted and that the woman in the picture is her biological mother and that she is searching for her. While helping Grams at her house, Dawson notices the same woman in a picture sitting on a nightstand. He asks who the woman is and Grams reveals that it's her daughter, Helen, Jen's mother. Dawson decides against telling Jen of his discovery. However, when Jen's mother visits her mother and her daughter at Thanksgiving Dawson confronts her, pretty much forcing her to tell Jen herself.\n\nWhen Dawson, Pacey and Joey join Jack and his ex-girlfriend Kate at a party hosted by Matt Caufield, the entire group, except Joey, gets drunk. Dawson, fighting to have a life separate from Joey's, nearly kisses Kate. When Pacey's brother, Deputy Doug busts the party after finding Pacey lying in a tree, the group all end up spending the remainder of the evening behind bars. While Dawson tells Joey that she cannot be his keeper, Jack confesses to Kate that he's gay. Meanwhile, Mitch turns from friend to parent, and as a result of having to bail his son out of jail, enlists Dawson to help out at his mother's new restaurant.\n\nAfter meeting a rival film-maker, Dawson realizes that he has let his desire to become a director overtake his life, and he decides to give it up for a period of time. He takes down all the posters in his room, and tries to cultivate other interests. During this tumultuous time, he realizes that the only thing in his life that has ever made sense is Joey, and determines to win her back.\n\nLittle does he know, however, that Joey and Pacey have been growing closer and eventually embark on a secret romance. When he discovers their relationship, Dawson reacts with anger, and cuts Pacey out of his life. He is more determined than ever to win Joey back. Joey and Dawson go together to the Prom, but when Dawson sees Joey sharing a dance with Pacey, he is enraged and demands Joey choose. Eventually he realizes that Joey wants to be with Pacey, and gives her his blessing. She leaves him on the pier, sobbing.\n\nBetween Season 3 & 4 Pacey and Joey spend a romantic yet tame summer on his newly renovated sailboat.\n\nSeason 4 [ edit ]\n\nDawson discovered in the previous season that his best friend, Pacey, has feelings for Joey. After saving Pacey and Jen from a storm at sea, Dawson is forced to white wash a fence for old-time film director A.I. Brooks, as punishment for putting a hole in his boat which Dawson was forced to take to rescue Pacey and Jen. Eventually, Mr. Brooks warms to Dawson and lets him film a documentary on him when he tells Dawson that he is dying of cancer.\n\nIn the meantime, he is confronted with the idea of Pacey and Joey as a couple. While they experiment with sex during the class ski trip, Dawson must make a life-or-death decision about Mr. Brooks when he's admitted to the hospital in a coma involving his terminal illness and has requested that Dawson be the one to take him off life support. Dawson chooses to let him go. When Dawson asks Joey if she slept with Pacey during the ski trip, she lies, telling him that nothing happened.\n\nDuring this season, Dawson strikes up a romance with Gretchen, Pacey's 21-year-old sister, who has arrived back to Capeside to take a break from college, or so everyone thinks, but she later reveals that she is there to recuperate from a miscarriage that took place during her previous semester. The baby's father was her ex-boyfriend, pig-headed Nick, whom Pacey admired at first. During the Leery Christmas Party, Dawson and Gretchen share a kiss, which ignites old feelings from his pre-teen years when he had a crush on her.\n\nAfter his sister Lily's birth in May 2001, Dawson and Gretchen part ways and she returns to college, and he graduates from high school and heads off to USC to pursue his dream of becoming a film maker.\n\nSeason 5 [ edit ]\n\nAfter graduating, he studied film at Southern California, but soon dropped out and moved to Boston to be with his friends and to be with Joey. Before Dawson can even get his parents approval for moving to Boston his father Mitch Leery is tragically killed in a car accident. This changes everything for Dawson. At first he blames himself but then he goes on to blame Joey and that puts all romantic possibilities for them out of the picture. Instead Dawson is reunited with his old girlfriend, Jen Lindley.\n\nDuring their trip to the Hookset Film Festival in New Hampshire, Dawson loses his virginity to Jen. It is at this festival that Dawson wins first prize for his documentary about A.I. Brooks. There, Dawson meets Oliver Churchkirk, an aspiring film director from Boston Bay College who fancies himself the best in the business. After being asked to read his script, Dawson agrees to direct Oliver's first major film. He casts Joey's bubbly roommate Audrey Liddell as the female lead, and Oliver casts himself as heartbreaker, Gage. After several flubbed lines and mistakes, Dawson concludes that Oliver is not the right person for the role. He then asks Jen to bring in her cheating ex-boyfriend, Charlie Todd, to play the part. Charlie agrees when Jen tells him that he gets \"to make out with a really hot girl.\"\n\nIn the meantime, while Dawson and Oliver journey to New Jersey for a meeting with a film agent, the rest of the gang takes to the beaches of Florida for spring break; Pacey is hit on by Norwegian singer Marion Raven while working on his relationship with Audrey, while as Dawson later discovers, Joey embarks on a spring fling with Charlie Todd. Following his heart, Dawson hijacks the car with Oliver and drives down to Florida to tell Joey that he loves her. To Dawson's disappointment, Pacey tells him that Joey is with Charlie.\n\nWhen their film is finished, Dawson learns that Oliver set up to have the film screened by cast, crew and friends. When Dawson finally agrees, he discovers that Oliver also invited a film critic, Amy Lloyd, who writes for The Boston Weekly. Dawson, not knowing who she is, stumbles upon Amy in the midst of a nasty break-up and tells her that she is a \"sentimental drama queen with really crappy taste in movies.\" Angry, Amy leaves, unwilling to review the movie. In order to get her back to the auditorium, Dawson makes out with Amy at a local coffee shop in order to prevent her ex-boyfriend from seeing her; it turns out the man she was trying to avoid was not her ex-boyfriend. After running into Amy at a movie theatre in Boston, Dawson spends the night at Amy's house and the two have sex. He spends the remainder of the next day with her as well.\n\nAfter a misunderstanding with Joey, Dawson heads to the airport to fly to Los Angeles. Joey confronts him about the way things ended between them just days prior. The two kiss goodbye and Dawson departs for California.\n\nSeason 6 [ edit ]\n\nAfter not talking all summer, Dawson has a one-night stand with Joey. The next morning Dawson receives a call from his girlfriend in L.A. leading him and Joey to fight. Dawson returns to California.\n\nAfter breaking things off with Joey, Dawson reunites with Hollywood actress, Natasha; she is presumed to be a few years his senior. In the meantime, when Joey shows up to deliver food to the movie set at which Dawson works, Natasha, drunk and angry, explodes on Joey; subsequently, the director, Todd Carr, fires Dawson. Realizing she made a mistake, Natasha helps Dawson get his job back.\n\nDawson pays a visit to Audrey in rehab, earning her dish duty for the night, after stalking one-time film director Toni Stark. He returns to L.A. only to discover that Todd, his new mentor and friend, is in disagreements with the film company that is paying him to make the movie, \"Wicked Dead\". While Todd quickly decides to discard Natasha from the leading role, Dawson convinces him otherwise. Dawson directs the re-shoots of the movie, but even so, the movie flops, going to straight to cable TV.\n\nAfter realizing they have tickets for the wrong night of a No Doubt Concert in Worcester, Natasha uses her \"assets\" to get herself and Dawson admittance into the venue. When this fails, Dawson shows off his newly-won $600, hoping someone will trade tickets with him. However, this only attracts an on-duty police officer who takes the duo to a nearby station. They are let go with a warning from the authorities.\n\nAfter a few months and some white lies, Dawson assumes that Natasha is having an affair with Todd. But his worries turn out to be all for nothing when two reveal their affair is a scam, and they were simply messing with Dawson. Natasha and Dawson reunite and he brings her to Capeside for Christmas. Knowing that she cheated on him with a fellow actor (Max Winter), Dawson questions Natasha's intentions, to which she becomes angry. Realizing that he's not in love with Natasha, he breaks up with her, and the two part on good terms as Natasha returns to Hollywood.\n\nMeanwhile, Dawson's relationship with Pacey is better than it has been since the triangle began in the third season. Trusting Pacey to make his film savings grow, Dawson puts all the money he earned into a stock Pacey recommends. However, the stock falls through and both Dawson and Pacey are left with nothing. As a result, the two, once again, vow to no longer be friends. Joey, who is always caught in the middle, tries her best to reunite her friends. Pacey gives Dawson all the money he'd collected (but not all that was owed). Dawson concedes that there may be hope for the two of them.\n\nWith Audrey playing the role of Ms. Jacobs, Harley as Joey and her boyfriend Patrick as the girl-crazed 15-year-old Pacey, Dawson, with Joey's and Todd's help, begins filming his life story, adapted for the big screen.\n\nSeries finale [ edit ]\n\nIn 2008, Dawson is the executive producer and chief writer of the television program The Creek, a self-referential coming-of-age teen drama based on his adolescence in Capeside. While a young blonde boy portrays Dawson himself under the name \"Colby\", his two best friends appear as the neurotic \"Sam\" and heartbreaker \"Petey.\" Returning to Capeside, Dawson learns that Jen is dying. Dawson helps Jen leave a video message for her young daughter Amy, and he and Joey reconcile their past agreeing that they are meant to be best friends and nothing more.\n\nKevin Williamson discussed the original ending of Dawson's Creek, stating the pairing was meant to be Joey and Dawson, but the two showed to be better as friends. The series ends with Dawson in his office who receives a call from Pacey and Joey, congratulating him on the season finale episode of The Creek. Dawson tells them that he's going to meet with somebody tomorrow, whom Pacey and Joey are able to guess is Steven Spielberg, Dawson's idol.\n\nNotable relationships [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/9/93/DawsonLeery.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/DawsonLeery.jpg/200px-DawsonLeery.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/93/DawsonLeery.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dawson_Leery", "title": "Dawson Leery", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/9/93/DawsonLeery.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}