{"url": "https://people.com/tv/luann-de-lesseps-checks-back-into-rehab/", "text": "Luann de Lesseps has checked herself back into rehab.\n\nThe 53-year-old Real Housewives of New York City star is seeking help for the second time after attending an alcohol treatment program in the winter, PEOPLE exclusively confirms.\n\nGet push notifications with news, features and more.\n\nThe reality star has only authorized costar Bethenny Frankel to speak on her behalf.\n\n“This weekend, Luann was surrounded by her girlfriends and decided — with their support — that in light of recent circumstances, it is the healthiest choice for her not to attend Tuesday’s reunion taping so that she can continue in her healing process,” Frankel tells PEOPLE. “Luann is now surrounded by a core group of people who truly have her best interests at heart and who are working to make sure she gets the help she needs.”\n\n“Bravo has been very supportive of Luann during this time. It’s a brave and honest decision by her, and everyone is rallying around her and wants the best for her,” Frankel explains.\n\nBravo confirmed that she is not taping the season 10 reunion.\n\n“Bravo supports Luann’s decision to focus on her health,” the network said in a statement to PEOPLE. “She is part of the Bravo family and we continue to stand by her as she copes with this challenging situation. At this time, we hope everyone will respect her privacy.”\n\nFrankel explains that de Lesseps made the decision because she wants to look to the future.\n\nRecently, de Lesseps had enjoyed a string of sold-out cabaret performances — #CountessAndFriends at New York City’s Feinstein’s/54 Below — for which she received glowing reviews.\n\n“Luann loves doing the cabaret,” Frankel says about the reality star, whose goal is to return to the stage as soon as possible. “She’s taking the necessary steps to get better so that the show can go on.”\n\nHer decision to return to rehab comes days after news broke that her first husband, Alexandre de Lesseps, her daughter, Victoria de Lesseps, and son, Noel de Lesseps, filed a lawsuit against her over an $8 million house sale. According to court documents obtained by The Blast, she breached a stipulation of settlement in her divorce by failing to create a trust “for the benefit of her two children.”\n\n“Recent additional family stress was a catalyst to her taking a break,” Frankel says.\n\nDe Lesseps’ first trip to rehab occurred after her headline-making arrest in December.\n\nShe was arrested in the early morning hours of Dec. 24 and released on her own recognizance that same day after allegedly attacking a police officer in Palm Beach.\n\nShe was charged with and pleaded not guilty to disorderly intoxication, battery on an officer/firefighter/EMT, resisting arrest with violence and threatening a public servant, according to the Palm Beach County Sheriff’s Office. (She’s since pleaded not guilty and rejected a plea deal in February.)\n\nThe reality star had been discovered trespassing in a hotel room with an unidentified man, according to a police report. The pair had allegedly entered the wrong room at the Colony Hotel in Palm Beach and refused to leave. Police say de Lesseps slammed a door and kicked at least one officer. She also allegedly told the police, “I’m going to kill you all.”\n\nImage zoom LuAnn de Lesseps Rob Kim/WireImage for Life & Style\n\nAfter her arrest, de Lesseps — who had gotten married to ex-husband Tom D’Agostino in Palm Beach on last New Year’s Eve before their divorce seven months later — released a statement, saying, “This was my first time in Palm Beach since my wedding, and being here brought up long-buried emotions. I want to offer my sincere apologies to anyone I might have offended with my behavior. I am committed to a transformative and hopeful 2018.”\n\n“After the events … in Palm Beach, I am truly embarrassed,” de Lesseps said in a statement to PEOPLE as she checked herself into treatment. “I have decided to seek professional guidance and will be voluntarily checking into an alcohol treatment center. I intend to turn this unfortunate incident into a positive life-changing event. Once again, I sincerely apologize for my actions. I have the greatest respect for police officers and the job they do. My actions alleged in the police report do not reflect my core values and my law-abiding character.”\n\n“I am so grateful for the love and support that I am receiving from my family, friends and loyal supporters,” she continued.\n\n— with Jodi Guglielmi and Natalie Stone", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1373&h=719&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1373&h=719&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/luann-de-lesseps-checks-back-into-rehab/", "title": "Luann de Lesseps Checks Into Rehab, Will Miss RHONY Reunion", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,Luann de Lesseps,News,Real Housewives,Real Housewives of New York City,TV", "news_keywords": "Exclusive,Luann de Lesseps,News,Real Housewives,Real Housewives of New York City,TV", "description": "Luann de Lesseps is seeking help for the second time after attending an alcohol treatment facility in the winter", "og": {"title": "Luann de Lesseps Checks Back Into Rehab: It's the 'Healthiest Choice,' Bethenny Frankel Says", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/luann-de-lesseps-checks-back-into-rehab/", "description": "Luann de Lesseps&nbsp;has checked herself back into rehab. The 53-year-old Real Housewives of New York City star is seeking help for the second time after&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1373&h=719&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg", "width": 1373, "height": 719}}, "pinterest": {"url": "https://people.com/tv/luann-de-lesseps-checks-back-into-rehab/", "description": "Luann de Lesseps is seeking help for the second time after attending an alcohol treatment facility in the winter", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/luann-de-lesseps-checks-back-into-rehab/", "title": "Luann de Lesseps Checks Back Into Rehab: It's the 'Healthiest Choice,' Bethenny Frankel Says", "description": "Luann de Lesseps is seeking help for the second time after attending an alcohol treatment facility in the winter", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1373&h=719&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fluann-de-lesseps-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}