{"url": "https://en.wikipedia.org/wiki/Daenerys_Targaryen", "text": "\"Mother of Dragons\" redirects here. For the Chinese deity, see Longmu\n\nCharacter in A Song of Ice and Fire\n\nDaenerys Targaryen is a fictional character in George R. R. Martin's A Song of Ice and Fire series of novels, as well as the television adaptation, Game of Thrones, in which she is portrayed by English actress Emilia Clarke. In the novels, she is a prominent point of view character. She is one of the most popular characters in the series, and The New York Times cites her as one of the author's finest creations.[2][3]\n\nIntroduced in 1996's A Game of Thrones, Daenerys is one of the last surviving members (along with her older brother, Viserys) of House Targaryen, who, until fourteen years before the events of the first novel, had ruled Westeros from the Iron Throne for nearly three hundred years prior to being ousted. She subsequently appeared in A Clash of Kings (1998) and A Storm of Swords (2000). Daenerys was one of a few prominent characters not included in 2005's A Feast for Crows, but returned in the next novel A Dance with Dragons (2011).[4][5]\n\nIn the story, Daenerys is a young woman in her early teens living in Essos. Knowing no other life than one of exile, she remains dependent on her abusive older brother, Viserys. She is forced to marry Dothraki horselord Khal Drogo in exchange for an army for Viserys, who wishes to return to Westeros and recapture the Iron Throne. Her brother loses the ability to control her as Daenerys finds herself adapting to life with the khalasar. Her character emerges as strong, confident and courageous. She becomes the heir of the Targaryen dynasty after her brother's murder and plans to reclaim the Iron Throne herself, seeing it as her birthright. A pregnant Daenerys loses her husband and child, but soon helps to hatch three dragons from their eggs. The dragons regard her as their mother, providing her with a tactical advantage and prestige. Over time, she struggles to maintain control of her dragons. She also acquires an army with which she conquers the cities of Yunkai, Astapor and Meereen, determined to end slavery and injustice there. Despite her strong moral compass, she is capable of dealing ruthlessly with her enemies, particularly the slave masters. She establishes herself as a powerful and relentless ruler.\n\nWell-received by critics and fans alike, Clarke's portrayal of Daenerys in the HBO series has garnered Primetime Emmy Award nominations for Outstanding Lead Actress in a Drama Series in 2019 and Outstanding Supporting Actress in a Drama Series in 2013, 2015, and 2016. She has also earned many other nominations and accolades for her portrayal.\n\nCharacter description [ edit ]\n\nDaenerys Targaryen is the daughter of King Aerys II Targaryen (also referred to as \"The Mad King\") and his sister-wife Queen Rhaella, and is one of the last survivors of House Targaryen. She serves as the third-person narrator of 31 chapters from A Game of Thrones, A Clash of Kings, A Storm of Swords, and A Dance with Dragons. This makes her the fourth most prominent narrative voice in the series behind Tyrion Lannister, Jon Snow, and Arya Stark, respectively.\n\nBackground [ edit ]\n\nThirteen years before the events of the series (16 years in the television series), after her father and eldest brother Rhaegar were killed during Robert's Rebellion, Daenerys was born in the midst of a great storm, earning her the nickname \"Stormborn\". Rhaella died in childbirth, and Daenerys and her older brother Viserys were whisked away to Braavos by the Master of Arms of the Red Keep, Ser Willem Darry. Darry died when Daenerys was five years old, and she and Viserys spent the following years wandering the Free Cities. By the beginning of A Game of Thrones, Daenerys and her brother have been a guest of Illyrio Mopatis' in Pentos for half a year. Game of Thrones creators D. B. Weiss and David Benioff described Daenerys as a combination of Joan of Arc, Lawrence of Arabia, and Napoleon.[8]\n\nAppearance and personality [ edit ]\n\nDaenerys is most often described as uncommonly beautiful, with long, pale silver-gold hair and eyes like amethysts. She is slender and pale, although taller than some of her female ancestors. Tales of Daenerys' beauty are numerous, and throughout the novels she encounters countless suitors who seek her hand in marriage, sometimes to gain control of her three dragons. She is fluent in the Common Tongue of Westeros as well as in High Valyrian and bastard Valyrian, which she speaks with a Tyroshi accent. Over the course of the first three novels she becomes fluent in the Dothraki language as well as Ghiscari, spoken by the slave cities in Essos.\n\nDaenerys grew up in constant fear of being discovered and killed by agents of the Usurper King, Robert Baratheon, and was frequently abused by her older brother Viserys, which led to her developing a fearful, submissive, and furtive nature. However, over the course of the narrative Daenerys comes to find her inner strength and courage and emerges as a natural leader who is adored by her people. She is often described as honorable and compassionate, if somewhat naïve, although she can be harsh and vengeful against those who seek to harm her or her followers.\n\nDaenerys was first illustrated by Paul Youll on the cover of the July 1996 issue of Asimov's Science Fiction, which contained a Daenerys excerpt from A Game of Thrones entitled \"Blood of the Dragon\".\n\nPolitical leadership [ edit ]\n\nThe leadership of Daenerys Targaryen has been analysed and assessed using political science. Writing in The Conversation, Professor Toby James described how her leadership in series eight shows many obvious similarities in the imagery to that seen in 1940s European fascism.[9] The decision to raze King's Landing also showed an immoral form of leadership. However, her broader lurch towards using fear as a way to achieve her objectives, which might themselves be morally principled, reflected the deep struggle that all political leaders face when they want to deliver both conscientious and cunning leadership.\n\nStorylines [ edit ]\n\nCoat of arms of House Targaryen\n\nA Game of Thrones [ edit ]\n\nIn A Game of Thrones (1996), Daenerys is sold off by her brother Viserys and Illyrio Mopatis to marry Khal Drogo, a Dothraki warlord, in exchange for an army for Viserys. At that time, Daenerys befriends Jorah Mormont, an exiled Westerosi knight, and is given three petrified dragon eggs as a wedding gift. Although she is initially terrified of Drogo, Daenerys' and his marriage turns out to be a happy one, and Daenerys grows to love him and to take to Dothraki customs, finding strength and determination for the first time. This leads her to stand up to Viserys' attempts to bully her into coercing Drogo. After Drogo kills Viserys by pouring molten gold over his head for threatening his wife, Daenerys sees herself as the heir to the Targaryen dynasty, and responsible for reclaiming the throne for her family. Shortly thereafter, Drogo is wounded in a fight, and the cut festers. With Drogo ill, his warriors mutiny and abandon him. In desperation, Daenerys recruits an enslaved Lhazareen priestess, Mirri Maz Duur, to save Drogo with blood magic. However, despite being saved by Daenerys from being raped by the tribe's warriors, the priestess betrays her trust, and the magic ritual leads to Daenerys' unborn child being stillborn and leaves Drogo in a catatonic state. Daenerys does not want her husband to suffer any longer and euthanizes him with a pillow. She burns the priestess in Drogo's funeral pyre and climbs into the flames with her three dragon eggs. When the pyre dies out the following morning, Daenerys emerges alive and unburnt from the ashes with three hatched dragons.\n\nA Clash of Kings [ edit ]\n\nLeading the remnants of Drogo's khalasar through the Red Waste, Daenerys arrives in the city of Qarth. There, she begins appealing to the rulers of the city for aid in reclaiming the Iron Throne and meets little success. She eventually accepts an invitation from a group of warlocks to discover her future. At the warlocks' temple, the House of the Undying, Daenerys drinks a magical potion and enters the temple. Inside, she sees several visions and manages to resist the temptations. When she enters the final hall and meets the real Undyings, she is told prophecies about her destiny as the \"child of three\" who will experience \"three fires must you light\", \"three mounts must you ride\", and \"three treasons will you know\"; they also tell her she is the \"daughter of death\", the \"slayer of lies\", and the \"bride of fire\". When the Undyings attack Daenerys and intend to hold her prisoner, her dragon Drogon kills them and burns down the whole temple, allowing Daenerys to escape. Before departing Qarth, Daenerys is nearly assassinated with a venomous manticore but is saved by Arstan Whitebeard, who is sent by Illyrio Morpatis, along with the eunuch ex-gladiator called Strong Belwas and three ships to take Daenerys back to Pentos.\n\nA Storm of Swords [ edit ]\n\nSeeking an army, Daenerys sails to Astapor in Slaver's Bay to purchase an army of The Unsullied slave soldiers, in exchange for a dragon, but she betrays the slavers and uses the Unsullied to sack the city. She later conquers the city of Yunkai and gains the service of Daario Naharis, who commands a large mercenary company. As she marches on Meereen, Daenerys learns that one of her companions is actually Barristan Selmy, a knight of Robert the Usurper's Kingsguard, and that Jorah had spied on her earlier. Disgusted, she sends the pair on a suicide mission to capture Meereen. When the mission is successful, Barristan asks to be forgiven for his deception, but Jorah refuses to ask forgiveness, so Daenerys banishes him. Unwilling to abandon the slaves she freed, fearing they would return to bondage, Dany decides to stay in Meereen.\n\nA Dance with Dragons [ edit ]\n\nThroughout A Dance with Dragons (2011), Daenerys struggles to maintain order in the city in the face of growing unrest as well as the chaos she left behind in the other cities she conquered. Furthermore, Yunkai has rebelled and is gathering forces to besiege Meereen. When Drogon kills a child, Daenerys feels compelled to chain her dragons Rhaegal and Viserion, but Drogon escapes. Her advisers suggest she marry Hizdahr zo Loraq to bring peace, and she agrees, although she takes Daario as a lover. Hizdahr successfully negotiates an end to the violence, so she marries him. At her wedding feast, the blood and noise of the fighting pits attract Drogon, who is immediately attacked. Daenerys's attempt to control her dragon fails initially, but she eventually flies off with him. After several days in Drogon's lair, she falls ill after eating some berries and begins to hallucinate. She is later found by Khal Jhaqo, formerly a captain of her Khalasar who betrayed her late husband.\n\nFamily tree of House Targaryen [ edit ]\n\nTV adaptation [ edit ]\n\nCasting and development [ edit ]\n\nGame of Thrones A blue, scale-covered dress worn by Daenerys in the TV series\n\nMartin said that the character was aged in the television series because of child pornography regulations.[10] Tamzin Merchant played Daenerys in the original pilot, but the first episode was re-shot with Emilia Clarke in the role.[11] Weiss and Benioff said, \"Emilia was the only person we saw—and we saw hundreds—who could carry the full range that Daenerys required\".[8] Clarke, in reflection of the character's evolution in the television series, stated: \"Throughout the season she's had an insane transformation from someone who barely even spoke and timidly did everything her brother said into a mother of dragons and a queen of armies and a killer of slave masters. She's a very Joan of Arc-style character.\"[12] Clarke said she accepts acting nude if \"a nude scene forwards a story or is shot in a way that adds insight into characters\".[13] She added that \"sometimes explicit scenes are required and make sense for the characters/story, as they do in Westeros\" and that she can discuss with a director how to make a gratuitously nude scene more subtle.[13] Clarke, however, has used a body double in past background non-nude appearances, particularly Rosie Mac in season 5.[13]\n\nIn October 2014, Clarke and several other key cast members, all contracted for six seasons of the series, renegotiated their deals to include a potential seventh season and salary increases for seasons five, six, and seven.[14][15] The Hollywood Reporter called the raises \"huge\", noting that the deal would make the performers \"among the highest-paid actors on cable TV\".[14] Deadline Hollywood put the number for season five at \"close to $300,000 an episode\" for each actor,[15] and The Hollywood Reporter wrote in June 2016 that the performers would each be paid \"upward of $500,000 per episode\" for seasons seven and the potential eight.[16] In 2017, Clarke became one of the highest paid actors on television and earned £2 million per episode for the show.[17][18]\n\nStorylines [ edit ]\n\nSeason 1 [ edit ]\n\nDaenerys Targaryen is introduced as the exiled princess of the Targaryen dynasty. She and her brother Viserys were smuggled to Essos during the end of Robert's Rebellion. For most of her life, she has been under the care of Viserys, whom she fears, as he is abusive to her whenever she displeases him. Viserys marries Daenerys to the powerful Dothraki warlord Khal Drogo in exchange for his military support in an invasion of Westeros, making Daenerys a Khaleesi, a queen of the Dothraki. During the wedding, exiled knight Ser Jorah Mormont pledges his loyalty to Daenerys, and her benefactor Illyrio Mopatis gifts her three petrified dragon eggs. Daenerys is initially afraid of her new husband but after learning the Dothraki language, she begins to understand Drogo and genuinely falls in love with him upon getting to know him. She learns the ways of the Dothraki, strengthening her relationship with her khalasar. She later becomes pregnant with her son by Drogo, who is prophesied by the Dothraki to be the \"Stallion Who Mounts the World\". Viserys grows jealous of Daenerys's popularity and becomes infuriated with Drogo's lack of urgency in launching an invasion, prompting him to threaten to cut Daenerys's unborn son from her womb. Drogo responds by killing Viserys with molten gold, to which Daenerys declares that he was no dragon, because fire cannot kill a dragon.\n\nAfter an unsuccessful assassination attempt on behalf of Robert Baratheon, Drogo vows to Daenerys that he will conquer the Seven Kingdoms for her and their unborn son. However, during their journey, Drogo becomes comatose due to an infected wound incurred during a fight with one of his men. Daenerys is forced to seek the help of healer Mirri Maz Duur to save his life using blood magic. Mirri tricks Daenerys by using her unborn son's life as a sacrifice to heal Drogo but leave him in a permanent catatonic state, forcing Daenerys to end her husband's life. Daenerys punishes Mirri by having her tied to Drogo's funeral pyre. She also lays the three dragon eggs onto Drogo's body and steps into the fire herself. At daybreak, after the fire is burned down, Daenerys emerges with three baby dragons, whom she names Drogon, Rhaegal, and Viserion.\n\nSeason 2 [ edit ]\n\nDaenerys and the remnants of Drogo's khalasar wander the Red Waste before being accepted into the city of Qarth. She is hosted by merchant Xaro Xhoan Daxos, a member of Qarth's ruling council the Thirteen. Daenerys tries to appeal to the Thirteen to support her invasion of Westeros, without success. She returns to Xaro's manse to find half of her men and servants killed and her dragons gone. Meeting with the Thirteen again to ask for their help in retrieving her dragons, the warlock Pyat Pree claims responsibility and declares that her dragons are being kept in his temple, the House of the Undying. Daenerys travels to the temple, but Pree's magic separates her from Jorah and leaves her chained with her dragon. Daenerys orders her dragons to immolate Pree. Daenerys then confronts Xaro, who had conspired with Pree and Daenerys's servant Doreah to seize control of Qarth. Daenerys has Xaro and Doreah sealed in Xaro's vault and has her remaining loyalists raid his manse, using the funds to buy a ship.\n\nSeason 3 [ edit ]\n\nDaenerys travels to Astapor, a city in Slaver's Bay. As she arrives, the warlocks of Qarth attempt to assassinate her, but are thwarted by Ser Barristan Selmy, who was Kingsguard to Aerys Targaryen; Daenerys accepts him into her service. Daenerys negotiates with Astapori slaver Kraznys mo Nakloz to purchase an army of Unsullied, elite eunuch soldiers, in exchange for Drogon, also obtaining the services of Kraznys's translator Missandei. Upon the completion of the transaction, she has Drogon burn Kraznys alive and orders the Unsullied to sack the city, kill Astapor's masters and free its slaves. Daenerys and her army march on the neighbouring slave city of Yunkai, who hire the sellsword company the Second Sons to defend the city. The commanders of the Second Sons order their lieutenant, Daario Naharis, to kill Daenerys; however, he is smitten by her beauty and instead brings her the heads of his superiors, pledging the Second Sons' allegiance. Daario, Jorah, and the Unsullied commander Grey Worm infiltrate Yunkai, opening the gates for the Targaryen army to conquer the city. Daenerys is received by Yunkai's freed slaves, who hail her as their \"mhysa\" (mother).\n\nSeason 4 [ edit ]\n\nDaenerys marches on the last city in Slaver's Bay, Meereen, and seizes control of the city by instigating a slave revolt. She decides to execute 163 Meereenese masters as \"justice\" for 163 slave children crucified on the road to Meereen. After becoming aware that her council in Astapor has been overthrown and that Yunkai has reverted to slavery, Daenerys decides to stay in Meereen to practice ruling. She also begins a sexual relationship with Daario. After discovering that Jorah was previously spying on her on House Baratheon's behalf, she is enraged and orders him exiled from the city. Daenerys is later horrified to discover that Drogon has killed a farmer's child; although Drogon is unable to be captured, she has Rhaegal and Viserion locked up in Meereen's catacombs.\n\nSeason 5 [ edit ]\n\nDaenerys faces a new threat to her rule in the form of the Sons of the Harpy, a resistance movement made of agitated former masters. Her popularity with the freedmen also begins to wane after she publicly executes one of her councillors, Mossador, for killing a captive Son. After the Sons kill Ser Barristan, Daenerys decides that she will attempt to restore peace by reopening Meereen's fighting pits and taking the Meereenese noble Hizdhar zo Loraq as her husband. While attending a gladiator demonstration, she is confronted by Jorah, who has brought her the fugitive Tyrion Lannister to appease her. Daenerys accepts Tyrion onto her council, but orders Jorah exiled again. At the reopening of the fighting pits, Jorah saves Daenerys's life by killing a Son of the Harpy trying to assassinate her. The Sons then launch a massive attack, killing Hizdhar and many other Meereenese noblemen and freedmen. As the Sons corner Daenerys and her councillors, Drogon appears and kills or scares off most of the Sons. The Unsullied begin to overwhelm the Sons and the Sons throw spears at Drogon, prompting Daenerys to fly away on Drogon. Drogon eventually leaves her in the Dothraki Sea, where she is captured by a khalasar.\n\nSeason 6 [ edit ]\n\nDaenerys is taken to Khal Moro, the leader of the Dothraki horde. Learning that she is the widow of Khal Drogo, Moro tells her she must live out her days among the widows of the Dosh Khaleen in Vaes Dothrak. Once there, Daenerys is told that she is to be judged by the khals for defying tradition and going out into the world following Drogo's death. During the meeting with the khals, Daenerys declares that only she has enough ambition to lead the Dothraki; when the outraged khals threaten to gang-rape her, Daenerys sets fire to the temple, killing everyone inside but emerging unscathed. Awed, the Dothraki accept her as their Khaleesi. After discovering that Jorah, who had followed her to Vaes Dothrak with Daario, is infected with the terminal disease greyscale, Daenerys orders him to find a cure and return to her services, before marching on Meereen with Drogon, Daario, and the Dothraki.\n\nDaenerys returns to Meereen to find it under siege by the joint fleets of Yunkai, Astapor, and Volantis, who have reneged on an agreement with Tyrion to free their slaves and are trying to reclaim the city. Daenerys deploys all three of her dragons, burning most of the slaver fleet and seizing the ships that survive. The slavers agree to surrender. Soon after, Theon and Yara Greyjoy arrive to offer the Iron Fleet in exchange for Daenerys giving the Iron Islands their independence and installing Yara as queen of the Iron Islands over their uncle Euron Greyjoy, who had been planning to marry Daenerys. Daenerys agrees to Theon and Yara's alliance. Varys, meanwhile, secures the support of Ellaria Sand and Olenna Tyrell, who have lost family members to the Lannisters and want vengeance. Daenerys leaves Daario and the Second Sons in Meereen to keep the peace, names Tyrion Lannister as Hand of the Queen, and sets sail for Westeros at last.[19]\n\nSeason 7 [ edit ]\n\nDaenerys arrives at the island fortress of Dragonstone, the ancient Targaryen stronghold once held by the late Stannis Baratheon, and finds it abandoned. She sends the Unsullied to take Casterly Rock, and Yara Greyjoy's fleet, along with ships from Dorne, to blockade King's Landing. The Lannister forces, however, have left Casterly Rock and seized Highgarden and its wealth, and Euron overcomes his niece Yara's ships. In an effort to gain allies, Daenerys summons the newly named King in the North, Jon Snow, to pledge his fealty to her. Jon refuses, insisting that the White Walkers and their wight army present a threat to all of humanity. Receiving word of Highgarden's fall, Daenerys leads Drogon and the Dothraki to decimate the Lannister caravan. Drogon is injured by a ballista designed specifically to wound dragons, but Daenerys is victorious. The remaining forces submit to her after she commands the dragon to roast a resistant Randyll and Dickon Tarly alive.\n\nJon and a cured Jorah lead an expedition beyond the Wall to capture a wight, which they will use to convince Cersei Lannister, the self-declared Queen of Westeros, that the threat is real. They are saved from the army of the dead by Daenerys and her dragons, but the Night King kills Viserion with an ice spear, devastating Daenerys. Daenerys vows to Jon that she will help fight the White Walkers, and Jon pledges allegiance to her as his queen. The pair and their retainers bring a wight to King's Landing to convince Cersei of the threat beyond the Wall. Cersei ultimately agrees to a truce and to aid in the fight against the undead army, while secretly plotting to betray them. Jon and Daenerys finally succumb to their growing feelings for each other, falling in love, and have sex. Neither of them is aware they are related by blood or that the Night King has revived Viserion as a wight, and the Night King breaches the Wall with dragonfire.\n\nSeason 8 [ edit ]\n\nDaenerys and Jon arrive at Winterfell along with the Unsullied, Dothraki, Drogon, and Rhaegal. Bran Stark reveals to Daenerys that the Night King has resurrected Viserion and that the Wall has fallen. The Northerners are angry that Jon has pledged his allegiance to Daenerys and Sansa Stark questions how they will feed her armies and dragons. Daenerys and Jon's bond continues to grow when they later ride her dragons. Jaime Lannister arrives and reveals that Cersei has lied about sending her army to aid them against the White Walkers. Daenerys opts to execute Jaime for killing her father, but is overruled by Sansa and Jon after Brienne of Tarth vouches for him. Jon learns the truth of his parentage and reveals to a stunned Daenerys that he is the son of her brother Rhaegar and Lyanna Stark. Daenerys realizes that this makes Jon the true heir to House Targaryen but they are interrupted by the arrival of the White Walkers.\n\nRiding Drogon and Rhaegal, Daenerys and Jon await the Night King's arrival, but the Dothraki are quickly overrun by the dead and Daenerys abandons their position to strafe the onslaught of wights. In the resulting battle, Drogon is attacked by wights and Daenerys is dismounted. Jorah arrives to protect her from the dead and Daenerys uses a discarded dragonglass blade to defend herself until the Night King is destroyed by Arya Stark. However, Jorah is mortally wounded and dies in Daenerys' arms as she cries. After the battle, Daenerys fears people may prefer Jon as king over her when he receives praise from the wildlings. She begs Jon to not reveal his true parentage but he tells her he must tell his sisters. Jon swears Sansa and Arya to secrecy, having renounced his claim for Daenerys', but Sansa tells Tyrion, who in turn tells Varys.\n\nDaenerys flies to Dragonstone with her naval fleet in tow, while Jon marches south with her armies. She is ambushed by Euron Greyjoy and his Iron Fleet, who kill Rhaegal, destroy Daenerys' fleet, and take Missandei captive. Daenerys and her advisors travel to King's Landing to negotiate Cersei's surrender and Missandei's release, but Cersei has Gregor Clegane behead Missandei in front of Daenerys. Tyrion reveals to Daenerys that Varys is trying to seat Jon on the Iron Throne, and she executes Varys via dragonfire for his treachery. Alone with Jon later, Daenerys attempts to kiss him but he pulls away due to their blood relation. Daenerys resigns herself to relying on fear to assert herself.\n\nAs Daenerys' army makes camp, Jaime is spotted trying to infiltrate King's Landing and imprisoned, but Tyrion defies Daenerys to release him and have him rescue Cersei. Before the battle, Tyrion pleads with Daenerys to spare the inhabitants of King's Landing if they ring the bells to declare surrender. When Daenerys burns the Iron Fleet and the city's defenses, the Lannister soldiers and city surrender, but Daenerys proceeds to burn down much of King's Landing, killing countless civilians. Cersei and Jaime are also killed when the Red Keep collapses on them. Addressing her army in the aftermath, Daenerys declares that she will use her might to \"liberate\" the entire world. She accuses Tyrion of treason for releasing his brother and has him arrested when he publicly resigns as hand. Arya and Tyrion warn Jon that Daenerys will view his Targaryen heritage as a threat to her rule while Tyrion warns that Jon's sisters will not bend the knee to her now. Tyrion tells Jon that despite Jon's feelings for Daenerys, it is his duty to kill her for being the people's greatest threat. Jon attempts to reason with Daenerys, but when she continues to assert that her actions are necessary to establish a good world, a conflicted Jon fatally stabs her. She dies in his arms as he weeps. Drogon arrives shortly after and melts the Iron Throne before departing Westeros with Daenerys' body, grieving.\n\nBran Stark is later elected king; he sends Jon back to the Night's Watch to appease Daenerys' supporters.\n\nReception [ edit ]\n\nGeneral [ edit ]\n\nGame of Thrones.[20] Emilia Clarke was relatively unknown before her role as Daenerys in\n\nDaenerys is one of the most popular characters of the book series, together with Tyrion Lannister and Jon Snow.[3] The New York Times called Daenerys one of Martin's \"finest creations\".[2] Rolling Stone ranked her No. 1 on a list of \"Top 40 Game of Thrones Characters\", calling her story a \"non-stop confrontation with complex ideas about sex, war, gender, race, politics and morality\".[20] Matthew Gilbert of The Boston Globe called her scenes \"mesmerizing\".[21] Salon's Andrew Leonard, in his review of A Dance with Dragons, called Daenerys one of the series' three strongest characters and bemoaned her lack of inclusion in A Feast for Crows.[5] The website Mashable recognized her as one of the five most popular characters on the series,[22] while The Daily Beast referred to her as the \"closest thing the series has to a protagonist\".[23]\n\nEmilia Clarke's acting performance, as she closed Daenerys's arc in the first episode from a frightened girl to an empowered woman, was widely praised. Gilbert said: \"Clarke doesn't have a lot of emotional variety to work with as Daenerys, aside from fierce determination, and yet she is riveting.\"[21] In her review for \"A Golden Crown,\" Emily VanDerWerff of The A.V. Club commented on the difficulty of adapting such an evolution from page to screen, but concluded that \"Clarke [...] more than seal[s] the deal here.[24] IGN's Matt Fowler also praised Clarke and noted that Daenerys's choice to watch Viserys die was \"powerful\" and an important shift in her character.[25] Time's reviewer James Poniewozik complimented Daenerys's storyline,[26] while other reviewers complimented Clarke's acting.[27][28] Clarke's performance and the character's final scene, in \"Baelor\", was praised,[29] and the final scene of the season received widespread acclaim.\n\nKate Arthur of the website BuzzFeed criticized the character's story line in the television show's second season, stating that she was too \"weak-seeming\". However, Arthur praised the character's \"purpose coupled with humanity and even some humor\" during the third season, opining that Clarke was \"eating the screen alive as a result\".[30] Nate Hopper of Esquire magazine, when speaking of the television series, argued that the character did not face enough conflict, characterizing her conquering of cities as \"cut and dried\", stating, \"She needs to be emancipated from her own easy, comfortable, mundane victory.\"[31]\n\nDaenerys's victories over ruthless male characters transformed her into a symbol of feminism.[32][33] \"Khaleesi,\" one of her many aliases, became shorthand for \"a strong, empowered woman,\" her face was used for political protest signs, and many fans named their daughters after her.[33][34] Analyzing her feminist appeal, Tanya Ghahremani of Bustle stated that she evolved from a meek girl, rising \"from being an unwilling wife to the leader of a nomadic warrior group, to being the leader of said group and a whole ton of men who gladly laid down their life to serve in her army.\"[32] Gaby Del Valle of Vox said that so many people see themselves in Daenerys because her story subverts the hero's journey. \"Daenerys was the show's clear underdog,\" said Del Valle, adding that while the other women on the show began as fairly one-dimensional, \"Daenerys was dynamic and her struggle was compelling.\" Citing an essay by Rikke Schubart, a film scholar and professor from the University of Southern Denmark, Del Valle stated Schubart explained that Daenerys \"embarks on an archetypal hero's journey with a twist\" because \"instead of learning to humble herself, as heroes usually do, Dany has to learn to assert herself in a universe dominated by men.\" As a result, \"she combines emotions and elements that are stereotypically gendered male and female (male pride, a male dragonslayer, a damsel in distress) and then claims agency for herself and others.\"[33]\n\nVillain arc [ edit ]\n\nThe decision to turn Daenerys from a hero into a villain, a route that had long been a fan theory, was controversial.[35][36] Alex Abad-Santos of Vox stated, \"The implication that Daenerys Targaryen is going mad is the greatest fraud Game of Thrones has ever perpetrated.\" He argued that it is \"essentially a bait-and-switch\" because, for seven seasons, the audience has seen Daenerys as a good and moral person determined to abolish slavery and create a more just society, and that the show suddenly characterizing her as unwilling to listen to her advisors contrasts the various times she sought and heeded their counsel, including when she decided against flying to King's Landing to burn down the Red Keep and when she chose to \"defend the North against the Army of the Dead.\"[37] Eliana Dockterman of Time echoed these sentiments, opining that because Daenerys and Jon \"proved the most popular heroes to cheer for — not only because they cheated death but because they spent time with those who weren't like them and learned to understand them,\" turning Daenerys into the villain in the last few episodes feels like \"an unearned turn in the story\".[38]\n\nMost critics found the villainous turn, which was realized after Daenerys needlessly murdered thousands of innocents by burning down King's Landing, rushed and therefore unearned.[39][40] Calling Daenerys his favorite character and the arc emotionally draining, Mike Hogan of Vanity Fair said that although the show had been clear that Daenerys has a temper, \"we have seen her balance that violence with mercy, kindness, and above all shrewdness. We have spent years watching her grow from a helpless girl into a seasoned leader who has been through a lot.\" He added that turning Daenerys into a villain \"after a run of bad luck that was admittedly pretty bad\" made no sense.[41] Dockterman added that \"yes, Daenerys has used fire and her dragons to enact vengeance and punishment before, but up until season 7, everyone she burned was either evil or an enemy\"[42] and \"there's an additional layer of latent sexism to be analyzed here too: Cersei and Daenerys are two power hungry women, literally evil queens in fairytale parlance\" while \"men like Theon and Jaime have been redeemed; Jon Snow looks to be the obvious choice for a selfless king.\"[38] She said that \"in just a few episodes, [Daenerys] quickly transformed from a woman who has prided herself on saving the downtrodden to one who burns the innocent.\"[43] Critics felt that the villain arc could have worked via a strong message that power corrupts everyone, but that the show needed to lay better groundwork for it.[39][42][44]\n\nOther reviewers welcomed the villain arc.[39] Vox's Andrew Prokop said that Daenerys \"may well have been the series' ultimate villain all along\" and that the show and George R. R. Martin's A Song of Ice and Fire novels had foreshadowed this.[35] He said that \"Daenerys has long been capable of great compassion — and great violence\" and that \"the great power her dragons give her\" enables the latter. He pointed to Daenerys being \"angered by the Meereenese nobles' crucifixion of slave children\" and ordering \"an equivalent number of captured nobles crucified,\" and addressed other instances of her cruelty, such as when she burned Samwell Tarly's father and brother to death when they refused to kneel for her. He said that, in one of Martin's books, Daenerys \"implies that her only fear is herself. She's afraid of what she might do.\" Prokop, however, agreed with the complaints that the twist was poorly executed.[35] James Hibberd of Entertainment Weekly also pointed to signs that Daenerys was always destined to be a villain, such as her vision in the House of the Undying where she walked through the Red Keep and saw white ash (then thought of as snow) falling into the throne room. He questioned: \"Did we already think Dany was capable of [burning thousands of innocents]? Or were we in denial about her murderous ways? Did we really think somebody who crucified 163 people because she assumed they were all responsible for killing slaves was a good person?\" Acknowledging that the show had perhaps been \"a bit tricky in playing her murderous moments as heroic\" and that the turn was therefore shocking, he said that Daenerys always chose extreme violence when very upset. Hibberd felt that the show tested Daenerys's character, \"and in doing so, the thing that [the show] is actually pushing is a debate about Dany's morality, bringing that question into the foreground of the show after letting it sit quietly in the background for so long.\"[45]\n\nRose Moore of Screen Rant stated that \"having Daenerys turn into the villain [fits perfectly]\" within the series, where Targaryens \"have a tendency to madness\" and that it creates \"a beautiful villain origin story.\"[36] Moore reasoned that having Daenerys go from an exiled innocent to Queen and savior of her people to a villain shows \"how her grand ideas of freedom weren't enough to make her a hero\" and that \"how an obsession with power, and a determination that she is 'right' in believing that the Throne is hers, is enough to take her from Mother to Dictator.\" To Moore, there exists a \"wonderful symmetry to hav[ing] the death of the Mad King set the events of Game of Thrones in motion, only to be wrapped up by the ascension and death of a Mad Queen.\"[36] Prokop also felt that the series could not end \"with a triumphant Daenerys Targaryen heroically taking the Iron Throne\" because \"it wouldn't be Game of Thrones\".[46]\n\nFans generally attributed the change in Daenerys's arc to the writers throwing away her character development, with many criticizing it as character assassination.[40][47] HuffPost's Elyse Wanshel said, \"It was an upsetting turn for a strong and sympathetic female character whom many believed would emerge as the series' hero.\"[48] Emily VanDerWerff of Vox quoted writer Sady Doyle stating, \"Women who expected Daenerys to become a benevolent feminist ruler, to break the wheel and end the cycle of oppression, were not stupid; they were following basic story logic.\"[49] VanDerWerff said that \"many people have related to Dany deeply, seeing in her an avatar of feminine power they hadn't seen elsewhere in pop culture when the show debuted in 2011. [...] HBO's marketing has more than leaned into this in the past, playing up the aspects of the story that made Dany feel like a 'chosen one' figure.\" She said that after Daenerys's vicious or vindictive actions, the show \"would return to the idea of her fundamental principles, her desire to right wrongs and break wheels. Why wouldn't people come to heavily identify with that character?\"[49]\n\nRecognition and awards [ edit ]\n\nFrom the beginning, Clarke's performance has been acclaimed by critics. She received an EWwy Award for Best Supporting Actress in a Drama in 2011,[50] as well as a Scream Award for Breakout Performance by a Female. She also earned a Gracie Allen Award for Outstanding Female Rising Star in a Drama Series or Special in 2012,[51] and a SFX Award for Best Actress in 2013.[52]\n\nClarke received Primetime Emmy Award nominations for Outstanding Supporting Actress in a Drama Series in 2013, 2015, and 2016.[53][54][55] She was also nominated for a Critics' Choice Television Award for Best Supporting Actress in a Drama Series for the role in 2013 and 2016.[56][57] Other nominations include the Golden Nymph Award for Outstanding Actress in a Drama Series in 2012,[58] the Satellite Award for Best Supporting Actress in a Series, Miniseries or Television Film in 2013, the People's Choice Award for Favorite Sci-Fi/Fantasy TV Actress in 2014, 2016 and 2017,[59][60] the Saturn Award for Best Supporting Actress on Television in 2015,[61] the Gold Derby TV Award for Best Drama Supporting Actress in 2013 and 2014,[62][63] and the MTV Movie & TV Award for Best Actor In A Show in 2017.[64] IGN also nominated Clarke for Best TV Actress in 2011.[65]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/A_Song_of_Ice_and_Fire_arms_of_House_Targaryen_black_scroll.png/150px-A_Song_of_Ice_and_Fire_arms_of_House_Targaryen_black_scroll.png", "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Game_of_Thrones_Oslo_exhibition_2014_-_Daenerys%27s_blue_dress.jpg/100px-Game_of_Thrones_Oslo_exhibition_2014_-_Daenerys%27s_blue_dress.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg/220px-Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Emilia_Clarke_by_Gage_Skidmore_2_%28cropped%29.jpg/170px-Emilia_Clarke_by_Gage_Skidmore_2_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Daenerys_Targaryen", "title": "Daenerys Targaryen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}