{"url": "comicbook.com/dc/2017/08/19/wonder-woman-2-cast-charlize-theron/", "text": "Charlize Theron just might be entering the world of Wonder Woman after all.\n\nAfter scheduling issues made the actress turn down a role in the DC Extended Universe film, it appears that she's very open to appearing in Wonder Woman 2. During a panel at last month's San Diego Comic-Con, Theron addressed the possibility of reuniting with Wonder Woman director Patty Jenkins - who previously teamed up with the actress in Monster.\n\n\"Look I would love to work with her again.\" Theron revealed. \"I had such an incredible time. I trusted her from the first time I met her. That’s a big thing for an actor, to be able to trust your director that way and she just never disappointed. She’s incredible so to see her have this moment, I just feel incredibly happy for her.\" Considering the success of 2003's Monster - which earned Theron a Best Actress Oscar - a reunion between the two in Wonder Woman 2 feels like a no-brainer. While nothing is currently confirmed, Jenkins appears to agree, judging by a letter Theron was given at the SDCC panel.\n\n\"Getting to work with Charlize and what we did together will always be remembered as a great high point of my life.\" Jenkins explained. \"She’s a tremendous person, talent, artist, and actor, but also a wonderful and incredibly unique spirit who brings that dynamism to every part she plays. She’s hard, yet soft, tough, yet yielding. It was a wonderful and rare gift and I can’t wait to work with my friend again one day.\" Ultimately, time will tell if Theron is officially cast in Wonder Woman 2. But it's definitely worth noting that both she and Jenkins are on board with the idea.\n\nWonder Woman has an 86.52 ComicBook.com Composite Score and a 4.33 out of 5 ComicBook.com User Rating, making it the fourth-highest ranked comic book movie of all time among ComicBook.com readers. Let us know what you think of Wonder Woman by giving the movie your own personal ComicBook.com User Rating below. In Wonder Woman, before she was Wonder Woman (Gal Gadot), she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, Diana meets an American pilot (Chris Pine) who tells her about the massive conflict that's raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting alongside men in a war to end all wars, she finally discovers her full powers and true destiny.\n\n[h/t: Refinery29]", "images": ["https://media.comicbook.com/2017/08/charlize-theron-wonder-woman-1015998-640x320.jpg", "http://asset.comicbook.com/img/comicbook/comicbook-logo-1a.png", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png", "https://media.comicbook.com/2016/09/wonderwomanvert-197884.jpg"], "top_img": "https://media.comicbook.com/2017/08/charlize-theron-wonder-woman-1015998-640x320.jpg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/dc/2017/08/19/wonder-woman-2-cast-charlize-theron/", "title": "Could Charlize Theron Get A Role In 'Wonder Woman 2'?", "meta_data": {"description": "Charlize Theron just might be entering the world of Wonder Woman after all.After scheduling issues made the actress turn down a role in the DC Extended Universe film, it appears that she's very open to appearing in Wonder Woman 2. During a panel at last month's San Diego Comic-Con, Theron [...]", "keywords": "Charlize Theron,Wonder Woman,Patty Jenkins,SDCC 2017", "news_keywords": "Charlize Theron,Wonder Woman,Patty Jenkins,SDCC 2017", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Could Charlize Theron Get A Role In 'Wonder Woman 2'?", "description": "Charlize Theron just might be entering the world of Wonder Woman after all.After scheduling [...]", "image": "https://media.comicbook.com/2017/08/charlize-theron-wonder-woman-1015998-640x320.jpg"}, "og": {"title": "Could Charlize Theron Get A Role In 'Wonder Woman 2'?", "type": "article", "url": "https://comicbook.com/dc/2017/08/19/wonder-woman-2-cast-charlize-theron/", "image": {"identifier": "https://media.comicbook.com/2017/08/charlize-theron-wonder-woman-1015998-640x320.jpg", "width": 640, "height": 320}, "site_name": "DC", "description": "Charlize Theron just might be entering the world of Wonder Woman after all.After scheduling [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1503072000.0, "source": "http://comicbook.com", "summary": ""}