{"url": "https://people.com/tv/nene-leakes-slams-kim-zolciak-biermann-brielle-biermann-racist/", "text": "NeNe Leakes is slamming Real Housewives of Atlanta costar Kim Zolciak-Biermann‘s daughter Brielle Biermann over claims of “prejudice” after the mother-daughter pair visited Leakes’ home and allegedly found cockroaches.\n\nOn Thursday, Leakes, 49, shared her response to an old video that showed the 20-year-old Don’t Be Tardy reality star in her bathroom with what appeared to be black bugs.\n\nGet push notifications with news, features and more.\n\n“On the way back to the A, I fell asleep thinking about how imma live in my ROACH infested brand new home,” Leakes captioned a selfie during a flight back from a trip to Barcelona, Spain, with the cryptic hashtag #pottymouthtrashychildren as well as #jealousprejudicebitch and #blackpeopleneedtostopsupportingtheprejudice.\n\nImage zoom David Crotty/Patrick McMullan via Getty; Charles Sykes/Bravo/NBCU Photo Bank via Getty\n\nIn addition, Leakes shared the recently resurfaced video of Brielle on her own Instagram account, this time bringing up Kylie Jenner‘s name.\n\n“@briellebiermann We don’t have roaches! If you found 1, u brought it with u or it fell outta yo funky p—-! Please know I will get You all the way together when you start f—ing with me and mine!” Leakes wrote in the comments section.\n\n“Go somewhere and let the air outta those fake lips, fake titties and fake ass because you will never be @kylejenner Yo trashy mama should have taught you better! My home is Brand New but you guys were so jealous of it, you couldn’t even give a compliment. You had to stoop so low and be so disgusting #racisttrash,” she concluded.\n\nA rep for Bravo had no comment.\n\nImage zoom Instagram\n\nAlso on Thursday, Brielle responded in the comment section of her own Instagram post after a follower accused her of calling Leakes a “black roach.”\n\n“I’m not calling BLACK people roaches! I found a roach in NENEs home! not calling her a roach dumb f—. doesn’t matter if you’re black, white, hispanic, asian etc you can still have roaches in ur house if u don’t f—ing clean ur s—!!! #callorkinpls,” the eldest Biermann child wrote.\n\nImage zoom Instagram\n\nThen, Leakes responded in the comments of a separate Instagram account, calling the Biermann duo “racists.”\n\n“Kim & her daughter oops whole family are racists! What her daughter did at my home, (which she nor kim were invited to so be clear abt that as well) was pure disgusting, racist, learned behavior etc,” Leakes wrote, adding, “children are NOT off limits when you allow your child to talk to adults any kind of way, post disrespectful things on social media and so on. Kim is a calculating bio polar racist with a horrible mouth, who uses black folks for her come up.”\n\nZolciak-Biermann, 39, told her side of the story to defend Brielle, saying RHOA fans and viewers will soon see the bug incident play out on the upcoming season.\n\n“First off that video is a combination of 2 videos! I COMBINED THEM! Brielle posted the first video on snap unaware of the large bug in front of her when she was kneeling down .. until her DM’s blew up! She removed the video immediately!! I was filming as an INVITED guest at @neneleakes for RHOA!! Brielle was invited as well!” the mother of six wrote on Instagram.\n\n“Brielle went to the bathroom and saw several bugs and had sent ME the video on snap and NO ONE ELSE!!! We ARE filming a show, remember that, (RHOA) and Nene released this video herself! No one has EVER seen this video but RHOA! Nobody would have ever seen this video! Nene has said and done some things that are absolutely disgusting, however I will take the high road as you will see it on the show soon enough, but you WILL NOT make it seem as though my daughter did ANYTHING wrong! She never posted this video nor would she! As you see here I myself was not willing to send the video just for ratings for RHOA. END OF STORY,” Zolciak-Biermann concluded.\n\nIn a follow-up post, Zolciak-Biermann wrote a lengthy statement.\n\n“It’s so sad and offensive that someone can stoop so low as to call someone a racist just because they are mad. Everyone in my life knows that I am far from racist and unfortunately NeNe Leaks has tried for the last 10 years to paint that picture because that’s her last resort. (It’s convenient that I’m not racist when we are getting along.),” she said.\n\n“In a day and age where racism is very much alive and people are actually dying because of real racists, it’s heartbreaking that NeNe would cry wolf like this only because she’s upset. I think everyone including Nene needs to spend some time uplifting people insted of tearing them down. Nene should be embracing love instead of making up lies. There is absolutely no credibility to anything that she has said. I will NOT stand for these slanderous comments!”\n\nhttps://www.instagram.com/p/BZ4uXGLHKH9/?taken-by=neneleakes\n\nLater, Leakes retorted Zolciak-Biermann’s post with another statement of her own.\n\n“Kim Zolciak is the one that sent the video to Cynthia, Sheree, Marlo, Porsha and Kandi while we were filming in Spain. Now she has the nerve to make a pitty post! No one from Kim’s household was invited to my white party. Kim came as Sheree’s plus 1. She is a huge lier,” Leakes wrote.\n\n“All this season I have done nothing but try an be kind to her even when she said disrespectful things to me and broke glasses in my home. I STILL continue to be kind to her but this calculated video that was shot in my home during a time when we had no problems shows how low she will really go! Then she turns around an try to get the fans on her side of this s— #trash.”\n\nImage zoom\n\nThe drama escalated yet again after fellow RHOA cast member Kenya Moore also commented on the Leakes-Biermann feud.\n\n“@neneleakes I totally agree with you about that devil,” Moore said in her repost of Leakes’ airplane selfie, along with the hashtags #sheisabadperson #youliedabouthavingcancer #likemotherlikedaughter #youpimpedyourdaughter #youbroughtyourkidsintothis #closeyourlegstomarriedmen.”\n\nOn Thursday’s episode of Watch What Happens Live with Andy Cohen, which was pre-recorded, Zolciak-Biermann had nice things to say about Leakes.\n\n“I love [NeNe] always will, we started together so,” she said before news of their feud went public, later adding: “NeNe, Kim and Shereé [Whitfield] have a major connection. There was a lot of drama there.”\n\nThe Real Housewives of Atlanta premieres Nov. 5 (8 p.m. ET) on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Freal-housewives-kim-nene-1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Freal-housewives-kim-nene-3-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Freal-housewives-kim-nene-31-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/tv/nene-leakes-slams-kim-zolciak-biermann-brielle-biermann-racist/", "title": "NeNe Leakes Slams Kim Zolciak-Biermann Over Daughter's Snapchat Video, Calls RHOA Costar 'Racist'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brielle Biermann,Kim Zolciak Biermann,NeNe Leakes,News,Real Housewives,Real Housewives of Atlanta,TV", "news_keywords": "Brielle Biermann,Kim Zolciak Biermann,NeNe Leakes,News,Real Housewives,Real Housewives of Atlanta,TV", "description": "NeNe Leakes and Brielle Biermann feuded over claims of “prejudice” after the 20-year-old visited Leakes' home and allegedly found cockroaches", "og": {"title": "NeNe Leakes Slams Kim Zolciak-Biermann Over Daughter's Snapchat Video, Calls RHOA Costar 'Racist'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/nene-leakes-slams-kim-zolciak-biermann-brielle-biermann-racist/", "description": "NeNe Leakes is slamming Real Housewives of Atlanta costar&nbsp;Kim Zolciak-Biermann‘s daughter Brielle Biermann&nbsp;over claims of “prejudice” after the mother-daughter pair visited Leakes’ home and allegedly&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/tv/nene-leakes-slams-kim-zolciak-biermann-brielle-biermann-racist/", "description": "NeNe Leakes and Brielle Biermann feuded over claims of “prejudice” after the 20-year-old visited Leakes' home and allegedly found cockroaches", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/nene-leakes-slams-kim-zolciak-biermann-brielle-biermann-racist/", "title": "NeNe Leakes Slams Kim Zolciak-Biermann Over Daughter's Snapchat Video, Calls RHOA Costar 'Racist'", "description": "NeNe Leakes and Brielle Biermann feuded over claims of “prejudice” after the 20-year-old visited Leakes' home and allegedly found cockroaches", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}