{"url": "https://www.independent.co.uk/arts-entertainment/john-oliver-dustin-hoffman-sexual-harassment-why-confront-allegations-last-week-hbo-a8207951.html", "text": "John Oliver has revealed why decided to confront Dustin Hoffman with the allegations against him in a December interview.\n\nThe Last Week Tonight host and actor entered a heated debate during a Tribeca Institute 20th anniversary panel and screening of 1997 film Wag the Dog, during which Hoffman vehemently defended his behaviour and accused Oliver of “making a very quick judgement”.\n\nOliver has now opened up about the incident, revealing that he believed, “the first person that he talked to (publicly) was going to have to ask him questions about it. Unfortunately, that was me.” He said that the discussion continued for so long because he thought Hoffman’s answers “were pretty bad”.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n“I wanted to try and get him to a point of self-reflection and to try and get something out of the conversation, but that didn’t happen,” he added.\n\nDuring the panel, Oliver first breached the subject by stating: “This is something we’re going to have to talk about because... it’s hanging in the air.” The host was referencing allegations that he sexually harassed Anna Graham-Hunter as a 17-year-old production assistant on the set of his 1985 TV film Death of a Salesman.\n\nAudience members – including The Washington Post journalist Steve Zeitchik – were said to be “visibly shocked” by the interaction, in which Oliver expressed disappointment in Hoffman’s original apology in which he claimed the behaviour is not reflective of who he is.\n\n“It’s that part of the response to this stuff that pisses me off,” Oliver stated. “It is reflective of who you were. You’ve given no evidence to show that it didn’t happen. There was a period of time when you were a creeper around women. It feels like a cop-out to say, ‘Well, this isn’t me.’ Do you understand how that feels like a dismissal?”\n\n“Do you believe this stuff you read?” Hoffman asked to which Oliver replied he did “...because there’s no point in [an accuser] lying.” Hoffman returned, “Well, there’s a point in her not bringing it up for 40 years.”\n\nHoffman spent the remainder of the Q&A attempting to contextualise his behaviour, words which were continually combatted by Oliver who later expressed why he couldn’t stay silent.\n\n“I can’t leave certain things unaddressed,” he reportedly told the audience. “That leads to me at home later tonight hating myself, asking, ‘Why the f*ck didn’t I say something? No one stands up to powerful men.’”\n\nA second allegation of sexual harassment was made against Hoffman by producer Wendy Riss Gatsiounis who alleges that, as a playwright in 1991, a meeting with the actor and Tootsie screenwriter Murray Schisgal turned unprofessional following inappropriate remarks.\n\nFollow Independent Culture on Facebook for all the latest on Film, TV, Music, and more.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/09/john-oliver-0.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/09/john-oliver-0.jpg", "keywords": [], "authors": ["Clarisse Loughrey"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/john-oliver-dustin-hoffman-sexual-harassment-why-confront-allegations-last-week-hbo-a8207951.html", "title": "John Oliver explains why he confronted Dustin Hoffman over sexual harassment allegations", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/john-oliver-dustin-hoffman-sexual-harassment-why-confront-allegations-last-week-hbo-a8207951.html", "title": "John Oliver explains why he confronted Dustin Hoffman over sexual harassment allegations", "description": "'I wanted to try and get him to a point of self-reflection and to try and get something out of the conversation, but that didn’t happen'", "updated_time": "2018-02-13T09:14:02+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/09/john-oliver-0.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5668655759001_5668648777001.mp4?pubId=624246174001&videoId=5668648777001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8207951"}, "description": "John Oliver has revealed why decided to confront Dustin Hoffman with the allegations against him in a December interview.", "keywords": "John Oliver, Dustin Hoffman, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "John Oliver", "published_time": "2018-02-13T08:29:00+00:00", "modified_time": "2018-02-13T09:14:02+00:00", "section": "Culture", "subsection": "Video", "author_name": "Clarisse Loughrey", "content_type": "story", "word_count": 508, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 8, "external_link_count": 1}, "twitter": {"title": "John Oliver explains why he confronted Dustin Hoffman over sexual ha…", "description": "John Oliver has revealed why decided to confront Dustin Hoffman with the allegations against him in a December interview.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1518510540.0, "source": "https://www.independent.co.uk", "summary": ""}