{"url": "https://people.com/tv/kate-gosselin-star-dating-series/", "text": "Kate Gosselin is ready to get back into the dating scene.\n\nIt’s been a little more than eight years since the mother of eight’s divorce from Jon Gosselin was finalized in December 2009, and now, the Kate Plus 8 star is ready to give love another chance.\n\nGet push notifications with news, features and more.\n\nPEOPLE can exclusively reveal that Gosselin, 43, will star in new TLC series Kate Plus Date, which will document the reality star on her dating journey.\n\n“I’m nervous, I’m excited, and I’m forcing myself to do this,” Gosselin, who was married to ex-husband Jon for 10 years, tells PEOPLE about the upcoming docuseries.\n\nIn fall 2019, her two eldest children — twins Mady and Cara, both 17 — will go off to college, leaving Gosselin at home with 13-year-old sextuplets Aaden, Joel, Alexis, Hannah and Leah. (Collin is enrolled in a program away from home to help him reach his full potential.)\n\n“As we’re talking about Mady and Cara going off to college which is becoming more and more of a reality, it’s gonna happen, it almost became like a worry for them, too, like ‘Mommy, you’re gonna be all alone soon,’ ” shares Gosselin. “But it was very apparent, now that they’re older and talking about dating and how they’re all gonna get married someday … it became apparent: they want someone for me. They want me to have somebody in my life.”\n\nImage zoom Larsen & Talbert\n\nIn a moment of reflection, Gosselin says she “started picturing myself sitting in a rocking chair, knitting, and words like ‘old maid’ and ‘spinster’ started to come to mind, and I realized that no, I don’t want that to be my fate.”\n\n“I stopped focusing on myself — I used to be a runner, and all of these things sort of fell by the wayside, and I sort of forgot about the dating thing,” she says. “It’s never really fit into my life.”\n\nThough Gosselin admits her life is “very complicated,” she won’t allow that to hold her back from the possibility of finding happily ever after.\n\n“If I’m going to date someone, I can’t just go out on a date — it’s creepy to me to think of just going out somewhere with some stranger, and so I actually feel like doing it like this is the best and safest way for me to go on a date — a camera crew will be there! I’ll be safe!” she says. “And the person will have been vetted by a matchmaker.”\n\nFor Gosselin, having her dating life documented for cameras is safer — and far less intimidating — than going online.\n\n“I won’t be just doing some scary online thing,” she says. “I mean, online dating, seriously — I put my profile in there and people will know who it is within 90 seconds. No, this is probably the safest way for me to date, let’s be honest.”\n\nWATCH: Story Behind the Story: A Lesson Kate Gosselin Had to Learn the Hard Way\n\nAs for what Gosselin is looking for in a match, she’s “not sure,” but remains “open: whoever they match me with, I’m game.”\n\n“I do want someone with a set career, who is confident. A grown-up with their own life, their own agenda, who knows who they are. If someone travels for work, that would be great, because I’m used to being on my own and being self-sufficient,” she shares.\n\nShe doesn’t want anyone she has “to care of,” but rather desires a man who is “self-sufficient, who won’t suffocate me.”\n\nThe TLC personality asserts that the lucky guy she could one day introduce to her kids “won’t be my kids’ dad,” but rather “would love my kids to have a mutual friendship and respect with this guy and for him to be someone they can ask for advice. It would be great for my kids to have someone they can feel like is a real friend.”\n\nMost importantly, Gosselin says her perfect match “must love dogs.”\n\n“That is such a deal-breaker,” says Gosselin, who frequently shares photos of her furry family members on social media. “People disappoint you, but your dogs never will.”\n\nKate Plus Date is coming to TLC this fall.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fkate-gosselin.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F01%2Fkate-gosselin-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fkate-gosselin.jpg", "keywords": [], "authors": ["Kate Coyne", "Natalie Stone"], "canonical_link": "https://people.com/tv/kate-gosselin-star-dating-series/", "title": "Kate Gosselin to Star in New TLC Dating Series", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,Kate Gosselin,News,TV", "news_keywords": "Exclusive,Kate Gosselin,News,TV", "description": "\"I’m nervous, I’m excited, and I’m forcing myself to do this,\" Kate Gosselin tells PEOPLE about starring in her own dating series", "og": {"title": "Kate Plus Date! Kate Gosselin to Star in New Series Documenting Her Love Life: 'My Kids Want Someone for Me'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kate-gosselin-star-dating-series/", "description": "Kate Gosselin is ready to get back into the dating scene. It’s been a little more than eight years since the mother of eight’s divorce&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fkate-gosselin.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/kate-gosselin-star-dating-series/", "description": "\"I’m nervous, I’m excited, and I’m forcing myself to do this,\" Kate Gosselin tells PEOPLE about starring in her own dating series", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fkate-gosselin.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kate-gosselin-star-dating-series/", "title": "Kate Plus Date! Kate Gosselin to Star in New Series Documenting Her Love Life: 'My Kids Want Someone for Me'", "description": "\"I’m nervous, I’m excited, and I’m forcing myself to do this,\" Kate Gosselin tells PEOPLE about starring in her own dating series", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F06%2Fkate-gosselin.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}