{"url": "www.inquisitr.com/4746609/today-hosts-hint-at-rumored-feud-hoda-kotb-savannah-guthrie-megyn-kelly-trade-mean-girl-jabs-on-air/", "text": "When NBC named Hoda Kotb to replace Matt Lauer after sexual misconduct allegations caused his speedy exit, the network made history. Hoda and Savannah Guthrie became the first all-female co-anchor team in the 65-year history of the Today show.\n\nBut while enthusiasm for Kotb’s promotion resulted in public congratulations from her colleagues and media industry peers, rumors soared of a nasty feud taking place when the Today show cameras were turned off. The feud initially involved Hoda’s co-host for the wine-sipping hour of the Today show, Kathie Lee Gifford.\n\nWhen Gifford was absent from the show, fans speculated that she was jealous of Kotb’s promotion, and some thought Kathie Lee would quit. There were also reports that Hoda feels she has become “too big” for her gig with Gifford and is ready to quit as well, as the Inquisitr reported.\n\nMegyn Kelly Jabs At Hoda Kotb During Today Show\n\nIn addition to the alleged feud between Kotb and Kathie Lee, there are rumors of a new battle in the Today show newsroom. That rumored feud involves Hoda, her co-anchor Savannah Guthrie, and Megyn Kelly, along with the producers, an NBC News insider told Page Six.\n\n“The atmosphere is so bad around Megyn Kelly at Today that producers of the 7-to-9 a.m. slot, hosted by Savannah Guthrie and Hoda Kotb, are openly sniping at her.”\n\nIn the wake of Lauer’s exit and Hoda’s promotion, Megyn follows Kotb and Guthrie in the Today show’s 9 a.m. time slot. Kelly saved her congratulations for the broadcast, but Megyn’s supposed congratulatory remark to Hoda was seen as a “Mean Girls” type of jab.\n\nHoda Kotb and Savannah Guthrie made history as the \"Today\" show's first female co-anchors in more than 60 years. Featured image credit: Craig Ruttle AP Images\n\n“We talked recently about how, 10 years ago, your life was very different,” said Kelly on air to Kotb. “You were going through a dark period.”\n\nStaffers assumed that Megyn was talking about Hoda’s breast cancer diagnosis and subsequent surgery. But rather than explain that to viewers, Kelly probed Kotb, asking if Hoda ever took time to contemplate her life and think “holy moly.”\n\nNBC News Staffers Shocked By Nasty On-Air Exchange\n\nWhen Megyn mentioned Hoda’s “dark period” without explaining it to viewers, NBC News staff members in the control room were horrified, said the insider.\n\n“Everybody in the control room gasped when Megyn brought up Hoda’s ‘dark period,’ because many viewers likely won’t know exactly what she was referring to. That comment was awkward, mean-spirited. It really stung.”\n\nBecause Kotb and Guthrie have their own production team and staff while Kelly has a separate group of employees, the feud reportedly has divided the newsroom. After Megyn threw shade at Hoda, Kotb and her team fought back. As a result, the source revealed that the atmosphere for the staff as well as co-anchors has become increasingly “bad.”\n\nHoda Kotb & Savannah Guthrie Fight Back At Megyn Kelly\n\nIn the wake of Kelly’s broadcast comment about Hoda’s “dark period,” Kotb’s and Guthrie’s production team found a way to retaliate. Savannah and Hoda mocked Megyn’s infamously awkward exchange with entertainment industry legend Jane Fonda. Team Kotb’s producers even turned to Twitter to post a link to the jab.\n\nJane Fonda had quite the response to Lily Tomlin's facelift comment pic.twitter.com/2qUUxReqiy — TODAY (@TODAYshow) January 16, 2018\n\nWhen Megyn interviewed Fonda, she asked about plastic surgery. Wrong question. Jane skillfully shut down Kelly by lecturing her, informing her that it was “the wrong time and place to ask that question.”\n\nHoda and Savannah made it clear that they remembered and treasured Fonda’s clap-back at Megyn. When Fonda showed up during Kotb’s and Guthrie’s Today show time slot with her buddy Lily Tomlin, Hoda asked how long their friendship had lasted.\n\n“Fifty years — a long time,” said Jane.\n\nTomlin teased that the two had become acquainted prior to her “first face-lift.” Fonda had the perfect response.\n\n“‘Who are you? Megyn Kelly?’ joked Jane Fonda.”\n\nGuthrie and Kotb couldn’t stop laughing, while responses to the tweeted clip from Team Hoda showed that viewers were in on the jab at Kelly.\n\n“OMG I just peed laughing at your avi!! ROFLMFAO good one!”\n\nAs for what might happen next, look for Megyn Kelly to be faced with additional changes at Today, predicted Radar Online. Challenged by bad ratings, some producers reportedly want to change Kelly’s time slot and move up Hoda’s and Kathie Lee’s hour.\n\nIn addition, with Kotb and Guthrie headed to the Olympics to broadcast the Today show live, both Gifford and Kelly are likely to be affected. Kathie Lee will be co-hosting without Hoda, while Radar Online pointed out that Megyn will remain in New York with “no hour to host at all.”", "images": ["https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/01/Megyn-Kelly-Savannah-Guthrie-Hoda-Kotb.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/01/Today-Savannah-Guthrie-Hoda-Kotb.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4746609/today-hosts-hint-at-rumored-feud-hoda-kotb-savannah-guthrie-megyn-kelly-trade-mean-girl-jabs-on-air/", "title": "‘Today’ Hosts Hint At Rumored Feud: Hoda Kotb, Savannah Guthrie, Megyn Kelly Trade ‘Mean Girl’ Jabs On Air", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}