{"url": "https://www.popbuzz.com/tv-film/news/the-perfectionists-release-date-cast-plot-trailer/", "text": "\"The Perfectionists\": Release Date, Cast, Plot, Trailer And Everything You Need To Know\n\nBy Katie Louise-Smith\n\nHere's everything we know about the Pretty Little Liars spin-off, \"The Perfectionists\".\n\nWhen Pretty Little Liars ended after 160 episodes on June 27, 2017, the fandom was heartbroken. How are we gonna live without knowing what happens to our favourite liars?! Thankfully, it was announced a few months later that a spin-off called The Perfectionists, adapted and produced by PLL show-runner I. Marlene King and based on the novel of the same name, would be making it's way to TV with Rosewood's very own Alison DiLaurentis and Mona Vanderwaal - and the fandom cannot wait.\n\nThe latest news? When it was announced that Sasha Pieterse would be reprising the role of Alison in the spin-off, many were left wondering why she moved across the country without fianceé Emily and the twins. King has now confirmed that we will find out why Allison moved away at some point during the first season. “You learn in the pilot why Alison is there, and what’s going on with her and Emily,” she shared with TVLine.\n\n“We left her very happy with Emily and the twins, so to justify why she would leave that behind to come to Beacon Heights was worthy of much more conversation.”\n\nA 10-episode season has been picked up by Freeform and the cast, including stars from Disney's The Descendants, Gossip Girl and The Walking Dead, has now been announced. Filming is due to begin in March and the show should be arriving on our screens at some point in 2019.\n\nFreeform have also shared the first trailer for the series and you can watch it below:\n\nWhen will The Perfectionists be released?\n\nThere is currently no official release date for The Perfectionists just yet but Sofia Carson confirmed in an interview that the show would be airing at some point in 2019.\n\nIn January, showrunner I. Marlene King revealed to ETOnline that \"the script is written and we're in the process of rewriting it just to fine tune it perfectly.\" They were also reportedly scouting and locking down locations in the Pacific Northwest of the US, where the new town of Beacon Heights will be set. On February 27th, the cast attended their first table read with production due to begin the following week.\n\nAnd so it begins... #plltheperfectionists A post shared by Sasha Pieterse (@sashapieterse27) onFeb 26, 2018 at 12:50pm PST\n\nWhere can I watch The Perfectionists?\n\nThe Perfectionists has now officially been picked up by Freeform for a 10-episode season so it will be available to watch on the same network as Pretty Little Liars.\n\nFreeform\n\nWho will be in the cast?\n\nSofia Carson (The Descendants) has been cast as Ava, a blogger and coder who strives to be a fashion icon and one of the series' main protagonists. She'll be joining Sasha Pieterse and Janel Parrish who will be reprising their roles as Alison DiLaurentis and Mona Vanderwaal from Pretty Little Liars.\n\nSydney Park, who fans of The Walking Dead will know as Cyndie, will be playing the role of Caitlin. Caitlin is described as smart, driven and someone who thrives under pressure. She's the perfect daughter of two perfect mothers who has set her sights on following in her mother’s Senatorial footsteps.\n\nAlso joining the cast is Gossip Girl legend Kelly Rutherford (Lily Van Der Woodsen) as Claire Hotchkiss, the mother of the murdered Nolan Hotchkiss. She, along with her husband, founded Hotchkiss Industries and Beacon Heights University. She believes “perfection is attainable and is the person who pulls the strings behind the scenes to get what she wants.”\n\nNewcomer Eli Brown will play Dylan, a talented cellist who’s “deeply committed to his two passions, his music and his boyfriend Andrew.” And General Hospital's Hayley Erin has been cast in a \"mysterious, unnamed role.\"\n\nSasha Pieterse and Janel Parrish will also be reprising their roles from Pretty Little Liars.\n\nThe three remaining protagonists in the story (Mackenzie, Julie and Parker) are all still yet to be cast. Fans have been sharing their dream casting for the roles online with AnnaSophia Robb, Jane Levy, McKaley Miller and Moon Ga Young emerging as fan favourites for the roles.\n\nSo far, no other casting details have been announced.\n\nvia giphy.com\n\nWill there be any Pretty Little Liars characters in the cast? Will Shay Mitchell return as Emily?\n\nAs we said, Mona and Alison will be featured in the series. According to Sasha Pieterse, Alison is the main character on the show but whether or not Emily will appear in the spin-off remains to be seen. Shay Mitchell revealed that she had spoken to I. Marlene King about bringing Emily (and their babies) back together with Ali but added that scheduling difficulties might make it a little complicated.\n\n“At the end of the day, regardless of whether I’m on it or not, I will 100-percent support the show and be a fan of it myself,\" she told TV Line.\n\nKing has revealed that there will be plenty of PLL characters popping up on the show from time to time. The jury is still out on Troian Bellisario's Spencer and Ashley Benson's Hanna but it's been confirmed that Lucy Hale will not be making an appearance, presumably because she'll be working on her brand new show, Life Sentence.\n\nFreeform\n\nWhat will happen in The Perfectionists? Will the show pick up from where Pretty Little Liars left off?\n\nThe synopsis for the pilot episode of the series reads: \"Everything about the town of Beacon Heights seems perfect, from their top-tier college to their overachieving residents. But nothing in Beacon Heights is as it appears to be. The stress of needing to be perfect leads to the town's first murder. Behind every Perfectionist is a secret, a lie and a needed alibi.\"\n\nThe series will be set in a new fictional town of Beacon Heights, instead of Rosewood but according to King, the tone of the show is very similar to PLL.\n\n\"There is a big mystery, and there is a murder, and there are some characters who are a fractured group at the beginning of our story, and through a murder they become friends,\" King told TVLine. \"We're meeting four new characters who are Perfectionists — and one of them won't make it to the end of the pilot.\"\n\n\n\nFreeform\n\nIs The Perfectionists based on a book?\n\nYes. The show will be based on 'The Perfectionists' (2014) and 'The Good Girls' (2015), both written by Sarah Shepard.\n\nThe stories follow the lives of Ava, Caitlin, Mackenzie, Julie and Parker who believe they have absolutely nothing in common (other than striving to be perfect), until they discover that they all hate the same guy, Nolan Hotchkiss, who's betrayed each of them before. They jokingly plan to kill him but when he turns up dead and murdered in the EXACT way they had described earlier, they all become prime suspects.\n\nThe books aren't actually connected to Pretty Little Liars in any way but King plans to incorporate the story into the PLL universe, which means the original source material won't be followed as closely.\n\nKing also plans to focus on more of the major male characters in the books by making them part of the main group. And of course, she will be intertwining PLL's Alison and Mona into the storylines. How they fit into the series' main mystery remains a... well, mystery.\n\n\n\nFreeform\n\nWill there be a time jump from the Liars finale to the start of The Perfectionists?\n\nSo far, no time jump has been revealed by King but don't be surprised if there is one.\n\nFreeform", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAHoAAABBCAYAAAAe5LCKAAAAoklEQVR4Ae3QMQEAAADCoPVPbQZ/iEBhwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwMA9MHwpAAE4XV0CAAAAAElFTkSuQmCC", "https://s-media-cache-ak0.pinimg.com/originals/60/46/36/604636224365c557e92be134f9cf5038.gif", "https://thumbs.gfycat.com/UltimateVacantElephantseal-max-1mb.gif", "https://media.giphy.com/media/8JZQoHIRmaP16/giphy.gif", "https://media.giphy.com/media/pAJQJEU6bPo5i/giphy.gif", "https://assets.popbuzz.com/2015/43/katie-louise-smith-1445859996-author-index-0.jpg", "https://vignette.wikia.nocookie.net/prettylittleliars/images/6/61/Mona-3-mona-vanderwaal-32004330-500-299.gif/revision/latest?cb=20130316204809", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABkAQMAAABKLAcXAAAABGdBTUEAALGPC/xhBQAAAANQTFRF2NjY5QlMowAAABNJREFUGBljGAWjYBSMglFAVwAABXgAAdxFAhsAAAAASUVORK5CYII=", "https://assets.popbuzz.com/2018/04/the-perfectionists-pretty-little-liars-spin-off-1517328506-list-handheld-0.png", "http://cdn6.gurl.com/wp-content/uploads/2014/08/aria-squint.gif"], "top_img": "https://assets.popbuzz.com/2018/04/the-perfectionists-pretty-little-liars-spin-off-1517328506-list-handheld-0.png", "keywords": [], "authors": ["Katie Louise-Smith"], "canonical_link": "https://www.popbuzz.com/tv-film/news/the-perfectionists-release-date-cast-plot-trailer/", "title": "\"The Perfectionists\": Release Date, Cast, Plot, Trailer And Everything You Need To Know", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "pubdate": "2018-06-07T14:12:08", "modified": "2018-06-07T14:12:11", "parsely-type": "post", "description": "Freeform has just announced that Gossip Girl's Kelly Rutherford, The Walking Dead's Sydney Park, and newcomer Eli Brown will be joining the cast of The Perfectionists alongside Sofia Carson, Janel Parrish and Sasha Pieterse. Here is everything you need to know about the highly anticipated 'Pretty Little Liars' spin-off TV show, from returning PLL characters, to the release date and trailers.", "keywords": "the perfectionists, pretty little liars the perfectionists, pll, pll the perfectionists, sofia carson, freeform, sasha pieterse, janel parrish, kelly rutherford, sydney park", "parsely-link": "https://www.popbuzz.com/tv-film/news/the-perfectionists-release-date-cast-plot-trailer/", "parsely-section": "/tv-film/news/", "parsely-title": "\"The Perfectionists\": Release Date, Cast, Plot, Trailer And Everything You Need To Know", "parsely-author": "Katie Louise-Smith", "parsely-image-url": "https://assets.popbuzz.com/2018/04/the-perfectionists-pretty-little-liars-spin-off-1517328506-list-handheld-0.png", "parsely-post-id": 10052, "parsely-pub-date": "2018-06-07T14:12:08", "og": {"url": "https://www.popbuzz.com/tv-film/news/the-perfectionists-release-date-cast-plot-trailer/", "site_name": "PopBuzz", "domain": "www.popbuzz.com", "title": "\"The Perfectionists\": Release Date, Cast, Plot, Trailer And Everything You Need To Know", "image": {"identifier": "https://assets.popbuzz.com/2018/04/the-perfectionists-pretty-little-liars-spin-off-1517328506-list-handheld-0.png", "height": 360, "width": 640}, "description": "Freeform has just announced that Gossip Girl's Kelly Rutherford, The Walking Dead's Sydney Park, and newcomer Eli Brown will be joining the cast of The Perfectionists alongside Sofia Carson, Janel Parrish and Sasha Pieterse. Here is everything you need to know about the highly anticipated 'Pretty Little Liars' spin-off TV show, from returning PLL characters, to the release date and trailers.", "type": "article"}, "twitter": {"site": "@popbuzz", "url": "https://www.popbuzz.com/tv-film/news/the-perfectionists-release-date-cast-plot-trailer/", "title": "\"The Perfectionists\": Release Date, Cast, Plot, Trailer And Everything You Need To Know", "image": "https://assets.popbuzz.com/2018/04/the-perfectionists-pretty-little-liars-spin-off-1517328506-list-handheld-0.png", "card": "summary_large_image", "description": "Freeform has just announced that Gossip Girl's Kelly Rutherford, The Walking Dead's Sydney Park, and newcomer Eli Brown will be joining the cast of The Perfectionists alongside Sofia Carson, Janel Parrish and Sasha Pieterse. Here is everything you need to know about the highly anticipated 'Pretty Little Liars' spin-off TV show, from returning PLL characters, to the release date and trailers."}, "sailthru.tags": "tv-film, news, the-perfectionists-release-date-cast-plot-trailer", "sailthru.date": "2018-06-07 14:12:08", "fb": {"admins": "627792841,551351399,716836285,1547481361,837890453,661531116", "app_id": 1590232324531551, "page_id": 1488952944702289, "pages": 1488952944702289}}, "movies": [], "publish_date": 1528351928.0, "source": "https://www.popbuzz.com", "summary": ""}