{"url": "i.stuff.co.nz/life-style/fashion/106509869/kendall-jenner-angers-modelling-community-refers-to-working-models-as-those-girls", "text": "\n\nKendall Jenner's condescending comments about being \"super selective\" picking runway shows to walk isn't sitting well with the modelling community.\n\nDuring an interview with Love magazine, the 22-year-old reality star said she \"was never one of those girls who would do like 30 shows a season or whatever the (expletive) those girls do\".\n\nJenner, the highest paid supermodel in 2017, said she has other things to do: \"More power to 'em. But I had a million jobs, not only catwalks but everything else.\"\n\nAfter Love posted an excerpt of the interview on Instagram on Friday, the comments section blew up with some of \"those girls\" hitting back.\n\nANTONY JONES/GETTY IMAGES Kendall Jenner's comments about being 'super selective' about the runway shows she walks in haven't gone down well.\n\nREAD MORE:\n\n* Pepsi backlash hits Kendall Jenner and Parris Goebel, 'traumatised' stars lay low\n\n* Kendall Jenner's huge, fake snake tattoo\n\n* Kendall Jenner covers Vogue's September issue\n\nModel Ginta Lapina shared a screenshot of Jenner's quote with her take: \"We all are hard working and worked hard to be where we are. Nothing was given to us,\" she wrote.\n\nLapina also posted an Instagram story of herself during a shoot, writing \"I gotta work\" with the hashtag #ImNotKardashian.\n\nModel Peyton Knight added her own hashtag, #EndThePrivilege, over Jenner's image in her Instagram story.\n\n\"This kinda disrespect towards other models who have NO NAME for themselves walking into the industry is disgusting,\" she wrote. \"We don't get to 'choose' which shows to do.\"\n\nRussian model Daria Strokous responded, \" 'Whatever the (expletive) those girls do' is do their very best to make their way up AND try to make some money so that they can provide for themselves and their families,\" she shared on her Instagram Story.\n\nShe added: \"Oh, and it's 70 shows a season by the way.\"\n\nSports Illustrated swimsuit model Vita Sidorkina-Morabito said she had \"no words\" in a comment under Love's post\n\nMale model Xavier Serrano followed suit in the comment section, calling Jenner's interview disrespectful. \"How you even dare to say that!\" he wrote on Instagram. \"Disrespect to all the models that we have to build our own way in the industry! (99% of us).\"\n\nGETTY IMAGES Jenner says she scaled back on modelling duties because she was 'on the verge of a mental breakdown'.\n\nIn her own comment, German model Antonia Wesseloh acknowledged everyone is entitled to their own opinion, but wished Jenner would \"be more down to Earth or at least know what her career is made of and be grateful at least\".\n\nOn Monday, Jenner's rep Ina Treciokas said the quote was \"not what she meant\".\n\n\"The quote was taken out of context,\" Treciokas said in a statement. \"The point was that it's their path and 'the more power to them'. She admires their hard work and dedication. It's an accomplishment.\"\n\nJenner herself addressed the controversy in a series of tweets, saying she was \"misrepresented\" in the interview.\n\nI was misrepresented in a recent interview over the wknd & it’s important to clarify the meaning. It was intended to be entirely complimentary but unfortunately, my words were twisted & taken out of context.I want to be clear. The respect that I have for my peers is immeasurable! — Kendall (@KendallJenner) August 21, 2018\n\nI get to experience first hand their tireless commitment, their work ethic, the endless days, the lack of sleep, separation from family and friends, stress of traveling, the toll on physical and mental health, yet they still make it all look effortless and beautiful. — Kendall (@KendallJenner) August 21, 2018\n\nI’m inspired by so many of these people i have had the good fortune to work alongside! There’s no way i could EVER hate on that ❤️ i want everyone to win. SLAY ALWAYS. — Kendall (@KendallJenner) August 21, 2018\n\nCultivate kindness today and always. — Kendall (@KendallJenner) August 21, 2018\n\nDuring the interview, the Keeping up with the Kardashians star said she scaled back on her modelling duties because she was \"overwhelmed\" and \"on the verge of a mental breakdown\".\n\n- USA Today", "images": ["https://static3.stuff.co.nz/kendall-0dc83ad5.jpg", "https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript", "https://resources.stuff.co.nz/content/dam/images/1/r/e/v/u/2/image.related.StuffLandscapeSixteenByNine.1420x800.1revjh.png/1534987022183.jpg"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/r/e/v/u/2/image.related.StuffLandscapeSixteenByNine.1420x800.1revjh.png/1534987022183.jpg", "keywords": [], "authors": ["Cydney Henderson"], "canonical_link": "https://www.stuff.co.nz/life-style/fashion/106509869/kendall-jenner-angers-modelling-community-refers-to-working-models-as-those-girls", "title": "Kendall Jenner angers modelling community, refers to working models as 'those girls'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "Model faces backlash after saying she was \"never one of those girls who would do like 30 shows a season\".", "og": {"description": "Model faces backlash after saying she was \"never one of those girls who would do like 30 shows a season\".", "title": "Kendall Jenner angers modelling community, refers to working models as 'those girls'", "url": "https://www.stuff.co.nz/life-style/fashion/106509869/kendall-jenner-angers-modelling-community-refers-to-working-models-as-those-girls", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/r/e/v/u/2/image.related.StuffLandscapeSixteenByNine.1420x800.1revjh.png/1534987022183.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "http://i.stuff.co.nz", "summary": ""}