{"url": "collider.com/anne-hathaway-and-kate-hudson-interview-bride-wars/", "text": "prefix = o ns = \"urn:schemas-microsoft-com:office:office\" /\n\n\n\nWritten by Steve ‘Frosty’ Weintraub\n\n\n\nOpening this Friday is 20th Century Fox’s comedy “Bride Wars”. The movie stars Anne Hathaway and Kate Hudson as two best friends that have planned every aspect of their weddings since childhood. After they both get engaged and work out their wedding plans, a few problems arise….after all…it’s a movie called “Bride Wars”. Anyway, what follows is two best friends that decide to go to war over their dreams. Here’s the official synopsis:\n\nLiv (Kate Hudson) and Emma (Anne Hathaway) are best friends who since childhood have planned every detail of their respective weddings. At the top of their bridal “must have” list: a ceremony at prefix = st1 ns = \"urn:schemas-microsoft-com:office:smarttags\" / New York ‘s ultimate bridal destination, the Plaza Hotel.\n\n\n\nNow, at age 26, they’re both about to get married; they’re about to realize their dreams; and they’re about to live happily ever after.\n\n\n\nOr maybe not…\n\n\n\nWhen a clerical error causes a clash in wedding dates – they’re now to be married on the same date! – Liv, Emma and their lifelong friendship are put to the ultimate test. Liv, a successful lawyer who is used to getting what she wants, including the perfect job and the perfect man, won’t settle for anything less than the perfect wedding she has dreamed of for years. Emma, a schoolteacher who has always been good at taking care of others, but not so much in looking after herself, discovers her inner Bridezilla and comes out swinging when her own dream wedding is imperiled.\n\n\n\nNow, the two best friends who’d do anything for each other, find themselves in a no-holds-barred, take-no-prisoners struggle that threatens to erupt into all-out war.\n\nAnyhow, recently I attended a press conference with the two stars and they each talked about making the movie and a lot more. As always, you can either read the transcript or listen to the audio by clicking here. Again, “Bride Wars” opens this Friday at theaters everywhere.\n\nQuestion: What did you guys do physically to get ready for this movie?\n\n\n\nKate: We didn’t eat for weeks. [Laughs] Well, I’m always doing something. I’m either dancing or doing pilates or biking or running. I’m quite active.\n\n\n\nAnne: Yes you are! [Laughs]\n\n\n\nKate: So, for this movie, we were actually doing a lot of drinking.\n\n\n\nAnne: Yes, we did. We developed beer biceps.\n\nQ: Drink any tequila?\n\n\n\nAnne: Kate, forever and always.\n\n\n\nKate: I’m a tequila girl. We like our champagne, though, too.\n\n\n\nAnne: We do. Kate’s amazing. Kate’s inspiring, in terms of all of the physical activity that she engages in. We would have script meetings and she would be stretching. I’d be like, “Yeah, I’m going to touch my toes next year. It will be fine.” And so, I work out with a trainer in New York.\n\n\n\nKate: You worked out pretty hard, though.\n\n\n\nAnne: I did. Well, I really wanted Emma to appear like an ex-ballerina. I wanted everything to be tight and proper and sinewy, so I really watched what I ate. Just the usual stuff. Whatever the character needed, that’s what we did.\n\nQ: The guys you have in the movie were gung-ho to just have a double wedding, but you wouldn’t have had a movie, if that happened. In your real lives, if the situation were similar, would you have just had a double wedding?\n\n\n\nKate: Yeah. I would have thought it would be more fun, it would be a bigger party, and there would be a bigger ballroom. In real life, I probably would have been like, “I don’t even know if I want to get married. Go ahead.” But, then again, there’s that little part of you that’s like, “No, it’s my one day!”\n\n\n\nAnne: And, I think you would also want your friend to have that day as well. You want it for yourself, but you’re also like, “I don’t want to be diluted in my joy for you.” I wouldn’t have a double wedding. Economically, absolutely, it’s fantastic. But, psychologically, I think you’d always be kinda pissed.\n\n\n\nKate: It would be kinda weird if one of the groom’s vows were better.\n\n\n\nAnne: The competition would be horrible.\n\n\n\nKate: If Fletcher’s vows were better than Daniel’s vows, that would feel weird.\n\n\n\nAnne: Fletcher’s vows would never be better than Daniel’s vows. [Laughs]\n\n\n\nKate: You’d be like, “Oh, that kinda sucked!”\n\n\n\nAnne: Maybe you would read too much into it. I think a double wedding would cause you to analyze it too closely and read too much into it. You’d have an immediate comparison. That being said, if anybody here has had a double wedding, I’m sure it was lovely.\n\nQ: What are your plans for this holiday season? Particularly given the economic state we’re in, what sort of gifts will you be giving?\n\n\n\nAnne: I’m doing a lot of research right now on cool gifts for under $50. The Real Simple magazine has an amazing gift guide right now. You have to see it. It’s so good. It makes me feel like a successful human being, when I actually do some of the stuff in that magazine. [Laughs]\n\n\n\nKate: The crafts, like the card making?\n\n\n\nAnne: One year for Christmas, I actually made everybody ribbon board.\n\n\n\nKate: Are you serious? That’s a good idea!\n\n\n\nAnne: I made it, but it was terrible. I couldn’t find the bunting, so it didn’t actually work with any cards. I just included a little bag of festive thumbtacks. [Laughs]\n\n\n\nKate: That’s really funny!\n\n\n\nAnne: I’m a willful crafter, but I’m kind of a C student when it comes to crafts. Like everyone, I’m going to be making a lot of gifts. My family has a price cap on things. We always give money to the Heifer Project, so I think we’re going to be focusing on that.\n\n\n\nKate: I’m still shopping. [Laughs] It’s funny because it’s a really weird time. I think everybody’s feeling it. In terms of the holidays, Christmas has always been a big holiday for our family. We’ve always been pretty crafty anyway. We all knit. The girls knit. I’m going to be in Colorado . We’re going to ski, like we always do. My son is skiing now. He started last year. He started his school, and it was the same school I went to when I was his age. I went in to pick him up from it, and I brought my skis. I went in a little early ‘cause I wanted to go out there with my skis and maybe play with him a little, and I thought he’d be on the little bunny hill. I said, “Where’s Ryder?” and I started panicking a little bit because I couldn’t see him anywhere. And, the person came over and said, “Well, actually he’s up on the mountain,” and I went, “Up on the mountain?” [Laughs] So, I went over to the base of the mountain, I’m standing there in my skis, and I look up and, all of a sudden, I see this little kid in camouflage and I’m like, “No.” [Laughs] He was just zooming down the mountain, and I started to cry. I grew up skiing, and then to see my kid ski, there’s a freedom in it. There’s a freedom in that, that you recognize in them, and a confidence that your kids start to get when they do things like that. That was a big little moment. So now, he’s going to be a terror, so the helmet is on and I’m going to put those rubber things on the bottom of his skis, so that he doesn’t go too fast. [Laughs]\n\nQ: How old is he?\n\n\n\nKate: He’s going to be 5 in January. It’s crazy!\n\nQ: Earlier this year, you referred to this film as Estrogen Land , with Get Smart being Testosterone-ville. How is the weather in Estrogen Land , and how does that vibe on set inform characters for you?\n\n\n\nAnne: The weather in Estrogen Land usually inspires a very cozy feel. Precipitation is unexpected, but constant. Anyway, I’m not going anywhere with that. It was delightful. I’m really not a girly girl, in the slightest. I found my best girlfriends a little bit later on in life. My best friends growing up were my brothers, and I always had a lot of guy friends, particularly gay men. So, for me to actually be around women all the time and give into the shoe love, [was new for me]. I always judged myself and was like, “Oh, that’s frivolous!” And now, I’m just like, “No, there’s nothing wrong with it.” Kate turned me on to Net-a-Porter.com, and I was just looking at it between takes. I was just like, “Yeah, I really do like clothes.” So, it was great to realize that I’m still myself, but I can be girly as well. It’s been a nice little stay.\n\n\n\nKate: You didn’t learn that in The Princess Diaries?\n\n\n\nAnne: No. I fought it, all the way.\n\n\n\nKate: That’s the girliest movie of all time. Every little girl wants to be a girl because of that movie.\n\n\n\nAnne: I never wanted to be a princess, so I was focused on my character’s psychological torture, at that time. She had to accept an identity that she wasn’t ready for. I missed the point. [Laughs] It’s actually been really nice to be in this movie and be around such strong female energy and to find that so liberating. When I grew up, I had this idea that I would be defined by a way that I’d be uncomfortable with, and I’ve actually been made much better because of it. I’m much stronger and more open and more loving and more compassionate. This movie was really good for me, in that way.\n\n\n\nKate: It was an interesting time for all of us. Especially in the age we’re both in, you’re going through so many transitions and, for some reason, being around women, you become empowered by your girlfriends and by other women that you learn from, which is what the movie is about, having those friendships. Poor Gary Winick. He was the one man. It was all girls. The producers and executives were all females, and the stars of the movie. He was just surrounded by the ladies. And, when you get a lot of girls in a room, watch out. It’s a powerful energy. And, this movie felt really good for that. We were all going through these amazing coming out parties. It was really interesting. It was fun.\n\nQ: Can you talk about the bachelorette party scene and the dance-off?\n\n\n\nAnne: All good comedy is painful and horrifying to actually do. But, I felt very protected by my character’s drunkenness, so I knew that, if it didn’t quite turn out the way that I’d hoped, [that it would be okay] because I did project onto it. I really wanted to be a good dancer, but I am not a good dancer. Watching the movie is hard for me because I’m just like, “I’m trying really hard, and I just look silly and drunk.” [Laughs] But, on the day, it was just hysterical. It was fun. The fact of the matter is that we had a great cast to work with and, that day, we had a lot of background artists in that scene and everybody was really into it and was giving so much. It just felt fun. My favorite part of the scene got cut out of the movie. At the end of it, I run up to Officer Not-Your-Husband and I did a handstand at his feet and wrapped my legs around his head and then pulled myself up, and then he grabbed my butt and I opened my legs wide into a V, and I say, “Book me!” Doing that, take after take after take, felt so good. This movie did stretch some of my boundaries.\n\n\n\nKate: I was so scared when you were doing that. I was so terrified that you were going to go right over his head.\n\n\n\nAnne: And, I nailed it every time!\n\n\n\nKate: I was sitting there going, “She’s going to wipe out. I can’t watch this!” [Laughs] But, she did it, and she never did.\n\n\n\nAnne: Kate has great faith in my physical abilities.\n\nQ: Will they put that on the DVD?\n\n\n\nKate: There’s a lot that should be on this DVD. We had a lot of good outtakes on this movie. We also have some behind-the-scenes footage that we did, that’s kind of funny. The DVD extras should be rated R. [Laughs]\n\n\n\nAnne: When we made the movie, we never knew where we wanted the humor to be, so we did raunchy versions of jokes. I think very few of the raunchy ones wound up in the movie, and probably for the best.\n\n\n\nKate: The DVD will be really funny.\n\nQ: A lot of people will enjoy this movie, but some people may feel that it perpetuates the negative Bridezilla stereotype. What would you say to those people?\n\n\n\nAnne: When I got the script, that was what I anticipated, and I was really sensitive to that. I just thought, “There’s no point in making a movie that is reductive to women, in the whole process.” So, I was so happy, when I read the script, that the movie takes the tact that the Bridezilla thing doesn’t have a lot to do, in our movie, with actually getting what you want and being the center of attention. That’s the myth that plays into, at least, my character’s consciousness. But, what it actually does is bring her to a new place of freedom, where she’s admitting to herself that she wants more for herself and she wants better for herself. And, that leads her to make an incredibly difficult, but ultimately wonderful decision to take control of her life and be more present and be more demanding and to set boundaries with people and to be stronger and more confident. So, to those people that believe we perpetuate a stereotype, I say, “Come to see the film. If you disagree with us, I will answer the strongly worded letter that I’m sure you will write.” But, we were super-sensitive to that, in the beginning. Kate and I are both strong women that want to do everything we can to make sure that every woman feels strong, so we would never do anything that would set women back.\n\n\n\nKate: As producer of the film, in developing this, when it came as a pitch, it was like, “Wow, I can’t believe this movie hasn’t really been made.” The more I thought about it, I realized it’s because it’s so easy to pit women against each other and get carried away with the cattiness and the pettiness of the stereotypes of how women handle lots of situations. For me, I looked at it as a challenge. I thought, “Wait a minute. This is such a great thing for women to be able to make fun of themselves.” We are a little guilty of going a little crazy sometimes and getting stressed out, and I think women are great at being self-deprecating and making fun of themselves, but we don’t get the opportunities, as a female comedian, to do that, that often. There aren’t really that many female-driven comedies. So, in developing it, I felt that there was a way to try to make a movie that is appealing to all ages of women, that doesn’t leave anybody out and, at the end of this wild, funny thing that we can all relate to a little bit or feel is a little bit accessible, is about friendship and honoring your friends and the importance of having those people in your life. None of these things matter, if you don’t have your girls. That was the trick. That was really hard, and we really worked hard on that, especially Gary, who I have to say did such a great job of making this movie have that real emotional undertone that took me by surprise, the first time I saw the first cut. That was the one thing I was most concerned with. And, it really did make me go, “Okay, I want to go call my girlfriends.” That’s why we made the movie. I hope women will appreciate that.\n\n\n\nQ: Kate, what makes Daniel a keeper for Liv, and what’s the perfect guy for you?\n\n\n\nKate: I don’t know yet. I don’t know what the perfect guy is yet. I do know that I like honest guys. That always gets me going. I like guys who are really up-front and just are who they are. They’re hard to find.\n\n\n\nAnne: Yes, they are. [Laughs]\n\n\n\nKate: What I liked about the guys in this movie, and what I liked about the relationships that we both have, which are so different, is that it [was unexpected]. Liv would be the expected one to be divorced in two years, whereas Emma would probably be the one who people would think would have this long, lasting relationship, and go through the worst possible times and just still be married. So, we liked playing that Liv actually found somebody who could deal with her and knew how to handle her. And, Emma needed the person in her life who allowed her to look at herself and go, “You know what? I need something else and something different.”\n\n\n\n\n\nAnne: Because Liv knows exactly what she wants and who she is, she needed to find someone who found her adorable. He probably prefers her when she’s being herself and happy, but also finds her messiness when she’s stressed out great, and he gets it and accepts it. Because Emma is, in some ways, having a latent rebellion, she needs someone who is going to want her to be happy above all, and wants her to explore every part of herself, and is willing to accept whatever she finds. And, they each do find that, in their own way. The sad thing about Emma is that Emma is that person that marries for keeps. Once she got married, she would have stayed married through anything. That’s kind of sad because she really would have been unhappy with Fletcher.\n\n\n\nKate: If this movie is successful and we thought about doing another one, we talked about how much fun we would have, thinking about where our characters go. [Laughs]\n\ncontinued on page 2 ——–>\n\n||SPLIT||\n\n\n\nQ: Would it be Child Wars?\n\n\n\nKate: Totally! It would be Baby Wars. It would be great! We could go so many different ways with Emma.\n\n\n\nAnne: We really could. [Laughs]\n\n\n\nKate: That would be so fun!\n\nQ: Why is there so much emphasis placed on a woman getting married? Do you think there’s too much emphasis?\n\n\n\nKate: We love love. We love relationships. I would never be cynical about people wanting that day and being excited about that day. I think there’s a reason for it. It’s your day to present yourself to your man, to throw this party that’s about wanting to spend the rest of your life with somebody, and bringing everybody together. The idea of the ceremony is great. The reality of the ceremony becomes stressful. I think the emphasis on marriage will always be important for people, no matter what kind of marriage they choose, whether it’s getting hitched on the top of the Himalayas with just the two of them, or having a 300-person wedding. I feel like people always want that ceremony. When we all sit around and have coffee or drinks, the first thing we talk about is kids, and then we talk about our relationships and love and loss, and drama in love. It’s such a big topic for us. So, I think celebrating it will always be something that people will emphasize.\n\nAnne: To be perfectly honest, I don’t know. [Laughs] I don’t know because I don’t, personally, feel any pressure to get married. I don’t feel it from my family, I don’t feel it from my friends and I don’t feel it from within, so I don’t really know how to answer that question. But, I’m not everyone. I don’t know if there is a pressure on women to get married, or if it’s something that women put on themselves, or if it’s the way things have been done and we’re not yet in a new moment where things have transitioned into people accepting that anything goes and you can do whatever you want. I think there is something to be said about living the happiest life possible, but the only way that you can live a happy life, specific to yourself, is if you are yourself. And, if you’re the sort of person that never wants to get married, never get married. Who cares. And, if you’re the sort of person that really loves the idea of being committed to someone and having that piece of paper that says that you are committed to someone, and celebrating with either a huge party or a quiet party, go for it. Just be yourself. The important thing to note, though, is moreso than whether or not women feel pressure to get married, I think we need to work on making it possible for everyone in America to get married.\n\nQ: When crossed, are women meaner to each other than men?\n\n\n\nAnne: I love that everybody thinks we have all these answers. [Laughs]\n\n\n\nKate: I don’t know because I grew up with all boys, and so did Anne.\n\n\n\nAnne: It’s hard to say.\n\n\n\nKate: You know what, yeah. I think so. Because women are a little bit more complicated, I think women can really hit you where it hurts.\n\nQ: With a knife or a gun?\n\n\n\nKate: No, that’s men. Men go right for the shins, whereas I think women can be more hurtful because we’re more emotional. But, I don’t know.\n\n\n\nAnne: Being mean is awful. I do believe that female friends can be worse to each other than male friends, simply because, for whatever reason, women have a stronger emotional language. We’re encouraged more to use that. Kate and I know things about each other that I don’t know about my male co-stars and, if Kate and I were to turn on each other, because I know how to celebrate her, I would also know how to bring her down, and she would know the same for me. When you give that trust to someone, that is what you’re doing.\n\n\n\nKate: It’s so true! We talk. Girls talk about everything.\n\n\n\nAnne: We talk about what we’re feeling about deep things. Maybe they’re not even particularly deep, in the grand scheme of things, but they’re things that matter to us. So, when you give someone that power, you’re showing them where your buttons are. If you pick wrong, and someone turns around and short-circuits those buttons, I think it hurts more.\n\n\n\nKate: When you go through relationships, all of a sudden, you realize, “God, boys don’t have anybody to talk to. That must really be horrible.” They just don’t talk about their feelings with each other. They talk to their girlfriends. My guy friends call me and they’re like girls. They’re like, “Hey, can you talk?,” and I’m like, “Yeah, sure!,” and they’re like, “I’m having problems with my girlfriend.” They talk to their girls, but they don’t talk to boys about it. They really don’t. My brothers talk to me, but they don’t talk to their friends.\n\nQ: Can you talk about working with Candice Bergen, who has played some pretty strong female characters, in her career?\n\n\n\nAnne: We were just totally in awe of her. I would look at her and get emotional. I kept just wanting to thank her for so much. And, she’s still so fabulous. She’s so quick. When I get shy around people, especially around people that I deeply respect, like Candice and some of the other actresses that I’m privileged enough to work with, my instinct is to hang back and just observe them. Just watching her and the way she takes in the environment and the way she plays with a line, she could clearly just relax and enjoy the ride and be herself, and that would be enough, but she really cares. She would show up every day and explore. To see that kind of passion in someone, of any age, was inspiring, but particularly to see someone, like Candice Bergen, who is such a powerful woman, and means so much to so many women, like us, was really cool.\n\nQ: Is there a particular moment on this that stands out for you?\n\n\n\nKate: Probably when we were so tired and we were on the floor with our torn up wedding dresses. That’s my favorite shot in the movie. We were lying there, looking at each other, and we were there for hours. At one point, we were on our sides and we were just talking, lying on the floor. That was probably my most memorable moment because you don’t get to work with girls, this closely, very often. It’s always with a guy.\n\n\n\nAnne: One of the things that I’m just so excited about with this film is that, so often in films that we’ve been in, there’s the main character and then there’s the quirky best friend that you never really get to know, who comes in with the great one-liner. To have two complex female characters, who are best friends, at the center of a movie, I haven’t really seen that before. So, anytime we were in those scenes where we got to go deeper, and there wasn’t that formula in place in the script, I was feeling something new, as an actress, for the first time, because I have never been in a situation like that. And, Kate was just there, every time, listening and going deeper with me. There wasn’t one specific moment. There were so many. Just to get to return to those scenes, again and again and again, it shouldn’t be rare, but it really is. I remember that, and I’m really appreciative of it.\n\n\n\nKate: We did the end at like four in the morning, for the wedding scene where we’re both crying. It was so late and I remember, as a producer, they’re like, “Can we get to you last?,” and you’re like, “Sure, we can do that scene last.” I did that whole scene at 4:30 or five in the morning, after being up all day. We were doing it and I was at that place where I was like, “Okay, I could go right to sleep, right now. I could just curl up and go to bed.” Our characters had been fighting that day and doing so much stuff, and we did the scene. I was in it and I was getting a little teary-eyed, and I looked at Annie and she was getting teary-eyed, and I was like, “I love being girls!” [Laughs] We were right there for each other, and that’s what the movie is about. There were a lot of good moments. Annie is the best because she’ll be like, “I have this idea!,” and I’d be like, “Okay, what?,” and she’d say this idea and then be like, “Okay, it was a really bad idea!”\n\n\n\nAnne: I’d be like, “There is something good in there. Let’s pick it apart.”\n\n\n\nKate: Annie is the first one to do that. It was so great! It was so funny.\n\n\n\nQ: What did you relate to, and what didn’t you relate to in the script?\n\n\n\nAnne: I’ve never really thought about my wedding. So, I think part of the reason why I was drawn to the script was because here was a girl that I had no relationship to. I didn’t understand that concept of identifying with yourself as a bride, before it had occurred to you to identify with yourself as a woman, as far as the bride specific thing. But, I did know what it was like because I thought of myself, I guess, as an actress. I really wanted that when I was a kid. And so, I developed that, and assumed that I would develop as a person aside from that, and that didn’t happen. It’s taken a lot of work to figure out who I am and what I want, aside from what it is that I’ve put in my head, and to be here in reality and not just living the dream that I wanted, and accepting that things are different and far more interesting than they were when I thought of them when I was 8, and just accept that. That was wonderful. I identified with that kind of desire in my character — that process, and the hunger for that process. And then, [I understood] the female friendship. It’s beautiful, powerful and scary to mean so much to someone. It’s so fun, but also so much responsibility, in the best possible way. I was so happy because, in the script, and I hope I’m not speaking out of turn by revealing this, but we didn’t figure out that ending until just before. We always knew that there was a piece missing, and we couldn’t quite figure it out. We were just talking, and Kate told a story, and we all burst into tears because the point of the story was that, as much fun as marriage hopefully is, and as much as we all want to find that one person that fulfills us, and not exactly have the fairy tale, but be able to rely on that person, you can’t. It’s a sad, sad, sad fact, but whatever happens in your life, in the great moments, the bad moments and the unexpected moments, there’s always going to be someone there, refilling your wine glass, giving you a shoulder to cry on, picking you up and celebrating with you, and that’s your girlfriend. We didn’t find that message in the movie until much, much, much later. And then, as soon as we did, it all made sense. That’s what I related to fully, and that’s when I fully, fully, fully gave in to it.\n\nQ: Do you mean that scene where you come back from Hawaii ?\n\n\n\nAnne: No, the final monologue about how weddings are great and the dream is great, and it’s so much fun, but don’t . . .\n\n\n\nKate: Conceptually, that’s what it was. But, when we sat down, we were talking about trying to fix the end of the movie. We all sat around, and I told this story about my mother. Basically, my brother was getting married, and we had this bridal shower for my sister-in-law, and my mom made this speech, and she said, “I want all the girls to look around the room and, even if you don’t know each other, even if you’re just getting to know each other, or even if it’s your sister, I want you to remember one thing: trust me. Men, they come and go. They always will. Hopefully, they stay. But, it’s the girl that’s sitting next to you, or the girl that’s sitting across from you, that’s going to get you through everything.” My mom is filled with all these little wisdoms like that. That’s really important — that idea of not losing sight, no matter where you go in your life with men, because women give a lot to men. We love relationships. We thrive in them, as we should. But, sometimes, you lose sight of the girls that are there for you, all the time, which we shouldn’t hold against any of our friends. I have a girlfriend right now, who’s off and running with somebody, but we’re always there [for each other]. When she’s ready to pick up the phone and go, “I don’t know what to do,” we’re all there. And, that’s what the movie’s about. And so, when we sat around and talked about that, that’s where we came up with that end, because it’s hard to tie these types of movies together and have something that makes you feel something emotional, and that makes all the other crazy stuff worth it.\n\nQ: Kate, what did you or didn’t you relate to, with your character?\n\n\n\nKate: I feel like, just creatively, I’m constantly watching other people. I have so many friends that are all so different, and all things are different to other people. So, I could relate to a lot, whether it’s me that’s like that, or my best girlfriend. I’m so not like Liv, so I based the whole hair thing after my one girlfriend, who is in the hair salon like two times a week. She won’t dip her foot in water because her hair might get frizzy. That, to me, is Liv. I can’t relate to that, but I can because I know somebody who’s like that, and it cracks me up. But, in terms of weddings and stuff, I can relate to it because I like to dress up, I like to have a party, I like to throw parties, I like to bring people together. Look, everybody has their own opinion, as to the sanctity of marriage or what it is they believe. I come from two parents who aren’t married. Well, I come from one parent who ended up not marrying my other parent. I come from a complicated household! So, it’s a little unconventional, how I see marriage, but I can relate to it. I got married, and it was great! It was a blast. Everybody should do it! [Laughs]\n\nQ: Would you get married again?\n\n\n\nKate: You know, possibly. I don’t know. If it’s right. If it’s important to everybody. But, I don’t know. I don’t know who the guy would be yet. It would all depend on what kind of relationship that is, you know?\n\nQ: Congratulations to Anne Hathaway on getting named Best Actress by the National Board of Review for Rachel Getting Married. How do you feel about all that?\n\n\n\nAnne: As I’m sure you can imagine, it’s hugely overwhelming. I’m delighted, but it doesn’t seem real. It seems to be an embarrassment of riches that I supposed I have to learn to get comfortable with.\n\nQ: Anne, can you talk about your role in Alice in Wonderland?\n\n\n\nAnne: I play the White Queen in it, and I think that’s all that I need to say.", "images": ["https://cdn.collider.com/wp-content/uploads/2020/03/devs-alex-garland-thumbnail-171x160.jpeg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Dark.png", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__3_.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__1_.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_poster.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__5_.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__2_.jpg", "https://cdn.collider.com/wp-content/uploads/2020/04/armageddon-ben-affleck-liv-tyler-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2020/01/justice-league-dark-thumbnail-171x160.jpeg", "https://collider.com/wp-content/themes/collider-v3/images/close-circle-512.png", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__4_.jpg", "https://www.facebook.com/tr?id=1628636477376373&ev=PageView&noscript=1", "https://cdn.collider.com/wp-content/uploads/2019/09/peacock-thumbnail-171x160.jpg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Light.png", "https://collider.com/images/collider-logo.png", "https://cdn.collider.com/wp-content/uploads/2019/11/mad-max-fury-road-charlize-theron-thumbnail-171x160.jpg", "https://collider.com/uploads/imageGallery/Bride_Wars/anne_hathaway_and_kate_hudson_bride_wars_movie_image__6_.jpg"], "top_img": "https://collider.com/images/collider-logo.png", "keywords": [], "authors": ["Steve 'Frosty' Weintraub"], "canonical_link": "https://collider.com/anne-hathaway-and-kate-hudson-interview-bride-wars/", "title": "Anne Hathaway and Kate Hudson Interview – BRIDE WARS", "meta_data": {"msapplication-square70x70logo": "/smalltile.png", "msapplication-square150x150logo": "/mediumtile.png", "msapplication-wide310x150logo": "/widetile.png", "msapplication-square310x310logo": "/largetile.png", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Anne Hathaway and Kate Hudson Interview – BRIDE WARS", "description": "Written by Steve ‘Frosty’ Weintraub Opening this Friday is 20th Century Fox’s comedy “Bride Wars”. The movie stars Anne Hathaway and Kate Hudson as two best friends that have planned every aspect of their weddings since childhood. After they both …", "url": "https://collider.com/anne-hathaway-and-kate-hudson-interview-bride-wars/", "site_name": "Collider", "image": {"identifier": "https://collider.com/images/collider-logo.png", "secure_url": "https://collider.com/images/collider-logo.png"}}, "article": {"publisher": "https://www.facebook.com/colliderdotcom", "section": "News", "published_time": "2009-01-05T08:00:00+00:00"}, "fb": {"app_id": 190932086012, "pages": 160246414365}, "twitter": {"card": "summary_large_image", "description": "Written by Steve ‘Frosty’ Weintraub Opening this Friday is 20th Century Fox’s comedy “Bride Wars”. The movie stars Anne Hathaway and Kate Hudson as two best friends that have planned every aspect of their weddings since childhood. After they both …", "title": "Anne Hathaway and Kate Hudson Interview – BRIDE WARS | Collider", "site": "@collidernews", "image": "https://collider.com/images/collider-logo.png", "creator": "@colliderfrosty"}, "generator": "WordPress 5.3.2", "ia": {"markup_url": "https://collider.com/anne-hathaway-and-kate-hudson-interview-bride-wars/?ia_markup=1"}, "msvalidate.01": "F97A06145E9767C313B356E7E5B833F3", "viewport": "width=device-width", "google-site-verification": "rtgRWlKYqmg2IwU4e9PBjtt31jXoTjotyW6iJbyqdyc", "verify-v1": "ag44RccQF3Xr4VqGQnxB+TOx8+rCP4SHaCwwGAtuWzc="}, "movies": [], "publish_date": 1231142400.0, "source": "http://collider.com", "summary": ""}