{"url": "https://www.popbuzz.com/tv-film/news/sabrina-netflix-release-date-cast-trailers/", "text": "\"The Chilling Adventures Of Sabrina\": Release Date, Cast, Trailers And Everything You Need To Know\n\nBy Katie Louise Smith\n\nAll the latest information about the cast, storyline, theories and trailers.\n\nIt's official! Sabrina the Teenage Witch is back at it again and this time, she's going DARK. Netflix has ordered two ten-episode seasons of the stand-alone Riverdale companion show which will be based on the Archie Comics graphic novel The Chilling Adventures Of Sabrina.\n\nIt looks like we'll be diving head first into the supernatural aesthetics of Greendale because the entire series will be dropping on Netflix on October 26th - just in time for Halloween. The cast has been announced, with Mad Men actress Kiernan Shipka playing our favourite teenage witch and now, the very first trailer for the show has dropped and it looks TERRIFYING.\n\nPicture: @kiernanshipka via Instagram/The CW\n\nProduction began on The Chilling Adventures of Sabrina earlier this year in Vancouver with Shipka and Ross Lynch stepping into the roles of Sabrina and her boyfriend Harvey - and they look perfect! (Dare we say... Greendale's version of Bughead?!)\n\nWell, it’s out there. A 1st look at Harvey and Sabrina from the “Chilling Adventures of #Sabrina.” ADORBS, right? pic.twitter.com/9n8cznpv2c — RobertoAguirreSacasa (@WriterRAS) April 4, 2018\n\nHere's everything you need to know about the new show, from the Netflix release date to who's playing who in the cast...\n\nWhen will The Chilling Adventures Of Sabrina be released?\n\nSabrina will drop on Netflix on Friday October 26th 2018 - just in time for Halloween weekend.\n\nTime for CAOS. Oct 26. pic.twitter.com/uLgXFMLX0t — Chilling Adventures of Sabrina (@sabrinanetflix) July 29, 2018\n\nWhat network will the show be on?\n\nThe Chilling Adventures of Sabrina will now air on Netflix. The CW, which is the same network that airs Riverdale, were previously attached to the project.\n\nWho will play Sabrina on the show?\n\nKiernan Shipka, who you'll probably know as the iconic Sally Draper in Mad Men and most recently as Bette Davis' daughter B.D. in Ryan Murphy's FEUD: Betty And Joan, will be playing the teenage witch.\n\nRumours had been swirling around for months about who would take on the lead role as the iconic blonde witch. Dove Cameron remained fan favourite and recent rumours suggested that newly-blonde Selena Gomez was one of the front-runners for the role.\n\nWho will play Sabrina's boyfriend, Harvey Kinkle on the show?\n\nDisney Channel's Ross Lynch will play the role of Harvey, Sabrina's human boyfriend. His character has been described as \"the prince charming of a dark fairy tale, the son of a coal miner, a dreamboat and a dreamer, completely unaware of the dark forces conspiring to keep him and Sabrina apart.\"\n\nA post shared by Ross Lynch (@ross_lynch) on Jan 14, 2018 at 11:36am PST\n\nWho else has been cast in Sabrina?\n\nThe roles of the iconic Aunt Hilda and Aunt Zelda will be played by Lucy Davis (Wonder Woman, The Office UK) and Miranda Otto (Lord Of The Rings).\n\nNewcomer Chance Perdomo has been cast as Sabrina's English warlock cousin Ambrose Spellman. Ambrose, who is one of Sabrina's partners in crime, is described as witty, puckish and pan-sexual. This will be Perdomo's first US television role.\n\nMichelle Gomez, who you'll recognise from Doctor Who, will also be joining the cast as Sabrina's favourite teacher Mary Wardell who ends up being possessed and manipulating Sabrina into all sorts of trouble.\n\nActress Jaz Sinclair will play the role of Rosalind Walker, Sabrina's best friend. You may recognise Jaz from The Vampire Diaries, Easy, and Paper Towns. Jaz will also appear in the 2018 horror thriller Slender Man.\n\nRosalind Walker is the outspoken daughter of Greendale's minister. She attends Baxter high with Sabrina and will make up one half of what is sure to be a dynamic duo.\n\nHow many seasons will there be?\n\nThanks to the huge success of Riverdale on both The CW and on Netflix, the streaming service have already signed up for TWO SEASONS of the show.\n\nHow many episodes will there be?\n\nThere will be 10 episodes in each season, which means we're already guaranteed 20 episodes of the show so far.\n\nWhat are the episode title names?\n\nAs we know from Riverdale, each episode is named after a film or book that loosely mirrors the storyline of the episode. Judging by the first picture of the the script for episode one, it looks like Sabrina will be following suit. The first episode will be titled 'October Country' which is also the name of a collection of short macabre stories by Ray Bradbury. And by the sounds of it, Sabrina is going to be VERY macabre in tone.\n\nGotta catch up to #Riverdale… A long way to go, but the PATH OF NIGHT begins here… pic.twitter.com/9g0JJjrhjv — RobertoAguirreSacasa (@WriterRAS) January 24, 2018\n\nWhat will happen in the show?\n\nFirst things first, The Chilling Adventures Of Sabrina will be a far cry from the cute and quirky Melissa Joan Hart series you probably obsessed over as a kid. Show-runner Roberto Aguirre-Sacasa will be relying heavily on the dark and twisty comic book series to bring the TV show to life.\n\nAccording to Deadline, this series will see Sabrina \"wrestling to reconcile her dual nature — half-witch, half-mortal — while standing against the evil forces that threaten her, her family and the daylight world humans inhabit.\" It will be created by the same team who worked on Riverdale so you can expect there to a familiar tone - but scarier.\n\nYou can read the first page of the script right here.\n\nvia GIPHY\n\nWill Sabrina be on Riverdale?\n\nSo far, there are no plans to include Sabrina on Riverdale. Instead of a backdoor pilot within the show, Sabrina will be getting her OWN pilot episode. The show will not be a \"spin-off\" of Riverdale either, it'll be a stand alone show.\n\nThat's not to say Riverdale will stop alluding to Sabrina and making witchy references though. They still both kind of exist in the same world. Greendale is still on the other side of Sweetwater River and characters in the show have already visited the town. As far as we know, Riverdale will remain untouched by ~magic~.\n\nBut whether or not characters from the show will crossover and interact with each is yet to be confirmed by RAS. The fact that Sabrina will air exclusively on Netflix, as opposed to The CW like Riverdale, might also have an effect on whether or not Sabrina will EVER appear in Riverdale at all. It's not unheard of though. So there's still hope, for those of you that want it.\n\nIn an interview with Vulture, Lili Reinhart appeared to confirm that Sabrina will not exist within the same universe as Riverdale, and that Betty will never make appearance on the Netflix show.\n\n\"I think Betty’s solely in the Riverdale world and it doesn’t make sense for a crossover. That’s why the decision was ultimately made to move to Netflix — to make these Riverdale and Sabrina shows completely separate universes.\"\n\nAnd there you have it.\n\nIs there a trailer for Sabrina yet?\n\nYes! And it looks amazing.", "images": ["https://images.popbuzz.com/images/12419?width=641&crop=16_9&signature=WLJk2YvmKPpQzujhyJMZDXPJkag=", "https://images.popbuzz.com/images/12419?crop=16_9&width=660&relax=1&signature=e86q33zR3SYGArFJQiqILYJEcaI=", "https://images.popbuzz.com/images/71502?crop=1_1&width=200&signature=nMEjx4um-Uxy4mxCf2w_-dv4frQ=", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABkAQMAAABKLAcXAAAABGdBTUEAALGPC/xhBQAAAANQTFRF2NjY5QlMowAAABNJREFUGBljGAWjYBSMglFAVwAABXgAAdxFAhsAAAAASUVORK5CYII="], "top_img": "https://images.popbuzz.com/images/12419?width=641&crop=16_9&signature=WLJk2YvmKPpQzujhyJMZDXPJkag=", "keywords": [], "authors": ["Katie Louise-Smith", "Katie Louise Smith"], "canonical_link": "https://www.popbuzz.com/tv-film/news/sabrina-netflix-release-date-cast-trailers/", "title": "\"The Chilling Adventures Of Sabrina\": Release Date, Cast, Trailers And Everything You Need To Know", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "pubdate": "2018-10-25T23:35:17", "modified": "2018-10-25T23:36:04", "parsely-type": "post", "keywords": "chilling, adventures, release, date, latest, information, trailers, cast, storyline, theories, sabrina, radio", "parsely-author": "Katie Louise Smith", "description": "Disney Channel's Ross Lynch has just been cast as Harvey in Netflix's Sabrina reboot opposite Mad Men's Kiernan Shipka. Here's everything you need to know about the series, including the release date, trailers and the rest of the cast.", "parsely-link": "https://www.popbuzz.com/tv-film/news/sabrina-netflix-release-date-cast-trailers/", "parsely-section": "/tv-film/news/", "parsely-title": "\"The Chilling Adventures Of Sabrina\": Release Date, Cast, Trailers And Everything You Need To Know", "parsely-post-id": 9664, "parsely-pub-date": "2018-10-25T23:35:17+01:00", "parsely-image-url": "https://images.popbuzz.com/images/12419?width=641&crop=16_9&signature=WLJk2YvmKPpQzujhyJMZDXPJkag=", "og": {"url": "https://www.popbuzz.com/tv-film/news/sabrina-netflix-release-date-cast-trailers/", "site_name": "PopBuzz", "domain": "www.popbuzz.com", "title": "\"The Chilling Adventures Of Sabrina\": Release Date, Cast, Trailers And Everything You Need To Know", "image": {"identifier": "https://images.popbuzz.com/images/12419?width=641&crop=16_9&signature=WLJk2YvmKPpQzujhyJMZDXPJkag=", "height": 361, "width": 641}, "description": "Disney Channel's Ross Lynch has just been cast as Harvey in Netflix's Sabrina reboot opposite Mad Men's Kiernan Shipka. Here's everything you need to know about the series, including the release date, trailers and the rest of the cast.", "type": "article"}, "twitter": {"site": "@popbuzz", "url": "https://www.popbuzz.com/tv-film/news/sabrina-netflix-release-date-cast-trailers/", "title": "\"The Chilling Adventures Of Sabrina\": Release Date, Cast, Trailers And Everything You Need To Know", "card": "summary_large_image", "image": "https://images.popbuzz.com/images/12419?width=641&crop=16_9&signature=WLJk2YvmKPpQzujhyJMZDXPJkag=", "description": "Disney Channel's Ross Lynch has just been cast as Harvey in Netflix's Sabrina reboot opposite Mad Men's Kiernan Shipka. Here's everything you need to know about the series, including the release date, trailers and the rest of the cast."}, "sailthru.tags": "tv-film, news, sabrina-netflix-release-date-cast-trailers", "sailthru.date": "2018-10-25 23:35:17+01:00", "fb": {"admins": "627792841,551351399,716836285,1547481361,837890453,661531116", "app_id": 1590232324531551, "page_id": 1488952944702289, "pages": 1488952944702289}}, "movies": [], "publish_date": 1540506917.0, "source": "https://www.popbuzz.com", "summary": ""}