{"url": "https://web.archive.org/web/20080108202709/https://www.mittromney.com/News/Press-Releases/Ad_Remember", "text": "Romney For President Launches New Television Ad, \"Remember\"\n\nEmail this Page To:\n\nMultiple addresses seperated by commas From:\n\nSubject:\n\nMessage :\n\n\n\nFOR IMMEDIATE RELEASE\n\nCONTACT: Kevin Madden (857) 288-6390\n\nBoston, MA – Today, Romney for President launched its newest television ad, \"Remember.\" The ad highlights the people of New Hampshire discussing the issues that important to them – lowering tax burdens, securing our borders and changing Washington. While rightly honored as a true patriot, Senator McCain has opposed tax relief, supported amnesty and is too much of a Washington insider to change Washington. On the issues important to New Hampshire Republicans, Senator McCain has taken the wrong approach.\n\n\n\nThe ad will begin airing today as part of the campaign's rotation in New Hampshire. Script and viewing links are below.\n\n\n\nScript For \"Remember\" (TV:30):\n\n\n\nGOVERNOR MITT ROMNEY: \"I'm Mitt Romney and I approved this message.\"\n\n\n\nBOB DUFFY: \"I believe John McCain's war record is outstanding.\"\n\n\n\nMARIE PALING: \"He's a true patriot and has served his country long and well.\"\n\n\n\nBOB DUFFY: \"However, his record in the US Senate leaves a lot to be desired.\"\n\n\n\nGENE BOIS: \"John McCain has been one of those Republicans that have been wrong on tax cuts.\"\n\n\n\nRAY BRUN: \"Opposing tax cuts that would have helped our family, supporting amnesty for illegal immigrants, taking jobs away from Americans.\"\n\n\n\nCOLLETT HILL: \"He wrote the amnesty bill that America rejected.\"\n\n\n\nBOB DEGANGE: \"He's not really listened to the American people.\"\n\n\n\nMARIE PALING: \"He's had his chance in Washington to make things better.\"\n\n\n\nTo watch \"Remember,\" please see: http://tv.mittromney.com/?showid=728539\n\n\n\nAD FACTS: Script For \"Remember\" (TV:30):\n\n\n\nGOVERNOR MITT ROMNEY: \"I'm Mitt Romney and I approved this message.\" BOB DUFFY: \"I believe John McCain's war record is outstanding.\" MARIE PALING: \"He's a true patriot and has served his country long and well.\" BOB DUFFY: \"However, his record in the US Senate leaves a lot to be desired.\" GENE BOIS: \"John McCain has been one of those Republicans that have been wrong on tax cuts.\"\n\n- In 2001, Senator McCain Was One Of Only Two Republicans To Vote Against The $1.35 Trillion Tax Cut. The bill lowered marginal rates, eliminated the marriage penalty, and doubled the child tax credit. (H.R. 1836, CQ Vote #170: Adopted 58-33: R 46-2; D 12-31; I 0-0, 5/26/01, McCain Voted Nay) - In 2003, Senator McCain Was One Of Only Three Republicans To Vote Against The $350 Billion Tax Cut. The comprehensive bill lowered taxes by $350 billion over 11 years – including increasing the child tax credit and eliminated the marriage penalty. (H.R. 2, CQ Vote #179: Passed 51-49: R 48-3; D 3-45; I 0-1, 5/15/03, McCain Voted Nay; H.R. 2, CQ Vote #196: Adopted 50-50: R 48-3; D 2-46; I 0-1, 5/23/03, McCain Voted Nay) - National Review: \"John McCain is not as conservative as Romney. He sponsored and still champions a campaign-finance law that impinged on fundamental rights of political speech; he voted against the Bush tax cuts; he supported this year's amnesty bill, although he now says he understands the need to control the border before doing anything else.\" (Editorial, \"Romney for President,\" National Review, 12/11/07)\n\nRAY BRUN: \"Opposing tax cuts that would have helped our family, supporting amnesty for illegal immigrants, taking jobs away from Americans.\" COLLETT HILL: \"He wrote the amnesty bill that America rejected.\" BOB DEGANGE: \"He's not really listened to the American people.\" MARIE PALING: \"He's had his chance in Washington to make things better.\"\n\n- McCain Joined Ted Kennedy (D-MA) \"To Sponsor A Liberal Immigration Reform Bill.\" \"[McCain has] come into conflict with his fellow Republicans by joining with the senator Ted Kennedy to sponsor a liberal immigration reform bill that would allow illegal aliens to eventually become legal American citizens.\" (Jacob Weisberg, Op-Ed, \"Awaiting The Return Of The Bull Moose,\" The Financial Times, 4/13/06)\n\n\n\n- Senator McCain's 2006 Immigration Plan Would Allow 11 Million Illegals To Remain In The U.S. \"The McCain plan – which is being put forward in the U.S. House by Arizona GOP Congressmen Jeff Flake and Jim Kolbe – allows the 11 million illegal immigrants already in the U.S. to stay in the country if they apply for legal status and pay a $2,000 fine.\" (Mike Sunnucks, \"Napolitano, Hayworth Criticize Bush On Illegal Immigration,\" The Phoenix Business Journal, 2/1/06) - Union Leader Editorial: McCain-Kennedy Proposal \"Would Encourage Border Jumping.\" \"Sens. John McCain and Ted Kennedy have a bill that, surprise, includes a generous guest worker program that would encourage border jumping. Illegals who register would have to pay a fine and taxes, but they would get to stay here and apply for permanent residency. That sure beats waiting at the border and hoping to be let in.\" (Editorial, \"Turnstile Security,\" The [Manchester, NH] Union Leader, 3/27/06) - Former House Speaker Newt Gingrich Said McCain-Kennedy \"Actually Provides For Amnesty.\" NEWT GINGRICH: \"However, the bill you mentioned – the Kennedy McCain bill – actually provides for amnesty. And it provides for amnesty for millions of people whose first act in the U.S. was to break the law. I think amnesty is profoundly wrong. I think it sends exactly the wrong signal.\" (Fox News' \"The Big Story,\" 3/20/06) - Mark Krikorian: \"The McCain/Kennedy Amnesty Bill Has Been Unveiled, And It's The Same Hoax We've Fallen For Before.\" \"The McCain/Kennedy amnesty bill has been unveiled, and it's the same hoax we've fallen for before. Like the telemarketer who bilks a widow and then comes back in a different guise to charge a fee to 'help' her get the original money back, the anti-borders crowd created today's immigration crisis and is now offering as a solution the very policies that got us in this mess in the first place.\" (Mark Krikorian, \"Fool Me Twice, Shame On Me,\" National Review, 5/13/05) - Columnist Charles Krauthammer: 2007 Immigration Bill Supported By Sen. McCain Was \"Amnesty\" And \"Vacuous Nonsense.\" \"The immigration compromise being debated in Congress does improve our criteria for selecting legal immigrants. Unfortunately, its inadequacies in dealing with illegal immigration – specifically, in ensuring that 10 years from now we will not have a new cohort of 12 million demanding amnesty -- completely swamp the good done on legal immigration. ... The amnesty is triggered upon presidential certification that these bureaucratic benchmarks are met – regardless of what is actually happening at the border. What vacuous nonsense.\" (Charles Krauthmammer, Op-Ed, \"One Short Amendment,\" The Washington Post, 5/25/07) - Brian Darling, Heritage Foundation: \"It's Clear To Any Reasonable Person That This Is Amnesty.\" \"'It's clear to any reasonable person that this is amnesty,' said Brian Darling, director of Senate relations for the Heritage Foundation, a conservative think tank. 'It's forgiving individuals for being present in the country illegally and working in the country illegally as recently as five months ago.' That, he said, could come back to haunt McCain.\" (Christi Parsons, \"GOP Foes Trade Fire On Immigration,\" Chicago Tribune, 6/5/07)\n\nTo watch \"Remember,\" please see: http://tv.mittromney.com/?showid=728539", "images": ["https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/bg/bg_logo_small.gif", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/btn/btnEmailFriend.gif", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/btn/btnClose.gif", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/spacer.gif", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/favicon.ico", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/btn/btnGo.gif", "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/img/clear.gif"], "top_img": "https://web.archive.org/web/20080108202709im_/https://www.mittromney.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Romney For President Launches New Television Ad, \"Remember\"", "meta_data": {"description": "On Thursday, January 3, Romney for President launched its newest television ad,", "keywords": "romney, mccain, television, ad, remember, new, hampshire"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}