{"url": "ohnotheydidnt.livejournal.com/109965933.html", "text": "If this is the intelligence private schools churn out, I think we're better off without them tbh\n\n\n\nAlso having watched this more, her smile is so fucking grating. I've never seen a more shit-eating grin.\n\n\n\nEdited at 2018-03-12 06:41 am (UTC)\n\nReply\n\nThread\n\nLink\n\nmte\n\n\n\nRich people don't send their kids to private school for education, they send them to keep their kids away from the poor kids. It's another form of segregation. Wouldn't want their kids to have some fucking empathy.\n\n\n\nIf rich kids had to go to school with poor kids you bet those schools would get funded in a heartbeat.\n\n\n\n\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nmte... i once heard this ~progressive~ super left guy once say that he wants to send his daughter to a private school so she'd network and socialize with the \"right people\". wtf.\n\n\n\naside from the snobbishness i don't get how people can justify the cost, like you can literally just send your kids to school for free lol, that money can go towards so much other stuff.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nThey don't care about education in private schools either, tbh. Rich kids will get into good colleges no matter what.\n\n\n\nIt's just the Republican way to look at any social program/invaluable need and say, \"Now how can we make this into a business so we can make even more fucking money?\"\n\n\n\nSmall government= we want to run everything like a business. \"Invest\" in what makes them money, close up what doesn't, people's lives be damned.\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nI went to a private school and I really hate to say it, but their holier than thou mentality is common. I've had classmates who think they are better educated just bc they went to our school and I hate it. I detest any of those claims saying that we're smarter and I lose so much respect for anyone who says anything similar.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nI hate Betsy Devos so much. It makes me feel ugly, the amount of hate I have for her.\n\n\n\nThis whole fucking charting school thing & her talking about individual investment. Is their idea of a functioning society one where they screen every student to decide who is worthy of investment?\n\n\n\n\n\nEdited at 2018-03-12 06:14 am (UTC)\n\nReply\n\nThread\n\nLink\n\nYou know it is. And the first thing they'll check is \"White + American heritage goes back at least three generations.\" After that it's average income of their household.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nRepublicans are disgusting or willfully ignorant at this point. I'm done with them.\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nBetsy Devos's parents are both immigrants though\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nIt's not even about investment in students, it's about who are your parents, are they wealthy WASPs? If not, you're not allowed, even if you're a freaking genius. Their criteria is much like that of Harvard and other ivy leagues, have a familial connection? Congratulations, if not, prepare to work your ass off and probably be denied on the basis that you \"probably couldn't afford it\".\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nI don't feel ugly about hating her or anyone in 45's administration or most Republicans, TBH. It's what they deserve. No one should. They're heartless assholes who don't care about anyone but themselves.\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nSmh. I’m surprised she even makes onto school campuses.\n\nReply\n\nThread\n\nLink\n\nShe's just so damn stupid and literally the worst.\n\nReply\n\nThread\n\nLink\n\ni never thought i had this kind of hate in me. like, i literally hate donald trump. and this betsy interview was just ... it was sarah palin and katie couric all over again. just a complete and total mess. and don't get me started on that rally the other night. the fucking audacity of these assholes.\n\nReply\n\nThread\n\nLink\n\nSame here. I've disliked politicians in the past, but since 2016 it's just been this complete hatred I never knew I could feel.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nOmg. Queen Lesley not letting DeVos's incompetence slide and exposing her for the ignorant asshole she is!\n\n\n\nThe reason the Stormy Daniels thing is a big deal is because it could legitimately be a problem with campaign finance. I don't care about Trump fucking a porn star. That's not gonna get him impeached. But improperly using campaign funds or failing to disclose donations.... now that could be a big fucking deal.\n\n\n\nEdited at 2018-03-12 06:24 am (UTC)\n\nReply\n\nThread\n\nLink\n\ni'm excited for this stormy daniels interview but i'm so jaded that i truly don't believe anything will come out of it - no matter how corrupt the entire situation is.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nSame\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nfrom your lips to god's ears.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nI wouldn't hold your breath for anything Stormy might add to the conversation to be damning against Trump, there are piles of damning, way worse evidence against him and his entire family and nothing has been done about it. We can hope that Mueller is playing some sort of long ended chess game, but I'm ready for Trump and his entire cabinet out yesterday and I just have to accept that he'll finish his first term and then we'll have to deal with Ivanka running in another election cycle or two.\n\n\n\nBetsy on the other hand, Congress APPROVED her, that's how horrific our entire system is. They KNEW she was unqualified but they didn't care, it suited their agenda and they're perfectly fine having someone who knows ABSOLUTELY NOTHING about education be the SECRETARY OF EDUCATION.\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nYikes at her not being prepared for the interview. I bet someone on her team got yelled at after this lol\n\nReply\n\nThread\n\nLink\n\nHow can there be so many dumb people.\n\nReply\n\nThread\n\nLink\n\nwhat i really can't get my head around is how many people wear it like a badge of honour? Shit, you dumb... that's not something to be proud of\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nDon't I fucking know it! \"I never read haha\" \"I don't care about [essential part of society]\", well wow woohoo, please get out of our society as well.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nOne of my biggest pet peeves is people who wear ignorance as a badge of honour as if it somehow makes them \"down to Earth\" and \"relatable\".\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nI think about how ignorant and narrow-minded I was prior to moving away from Oklahoma and I just cringe. Literally cringe.\n\n\n\nI feel like a lot of the people who wear their ignorance as a badge of honor are also ones who grew up poor and actually did fight their way to stability - not even wealth, just stability - by working their asses off at a time when working your way to the top was more possible than it is now. They did it without a college education so obviously college is just a scam and a waste, right?? And flat-out refuse to see that a) the world doesn't work that way anymore, b) education is vital now, and c) THEY ALSO GOT REALLY FRUCKING LUCKY\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nMy friend and I were talking about this last week. She thinks that as more and more people (POC, women, WOC, those from low income backgrounds) are getting educated, for some people, education is becoming less and less valued. I might take it a step further and suggest it's because they want to show they're better than the groups I just named. They've rebranded willful ignorance as not being manipulated by the media, speaking from the heart, whatever.\n\n\n\nIt's ridic but it wouldn't surprise me.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nI live in an area right now that's very..... poorly educated and proud of that. I've got about 15 months left here but between the proud ignorance, Fox News fucking everywhere, and lack of employment (especially for outsiders).... My depression its back at full force and I just don't know what to do. I've never lived in an area this stupid before.\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nGod wants them to have many babies\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nHonestly she could have gone in harder and finished her. Fuck etiquette and just end her. It's what she deserves.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nLesley was pretty icy in this interview. Almost gritting her teeth.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nIdk who Adam H. Johnson is but from that one tweet alone, it seems I may have to start stanning him.\n\n\n\nAlso, DeVoss remains an idiot, what else is there to say? She’s a fucking entitled asshole who bought herself that position. When trump gets impeached, do we get to throw her out?\n\nReply\n\nThread\n\nLink\n\n\n\n\n\nI remember people stanning Joe Kennedy and then I saw this...\n\nHere’s Massachusetts Democratic Rep. Joe Kennedy criticizing marijuana decriminalization because it makes it harder for police to search cars. https://t.co/vCHhOFkinp pic.twitter.com/Mpkoi28uLQ — Christopher Ingraham (@_cingraham) March 10, 2018\n\n\n\nAdam has been good for awhile. It's so important for people remember that there are democrats that need to be called out for their bullshit.I remember people stanning Joe Kennedy and then I saw this...\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\noh my god...\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\noh hell no\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nnot just this cracker loser, but establishment dems are backing people like dan lipinski (who is a misogynist homophobe who got his seat from his father) just so they don't have to move left\n\n\n\nthis party is embarrassing from the top down\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nOh for fuck's sake...\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nyikesss\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nThis shit hurt me. This interview was worse than the Sarah Palin one where she couldn't name a single fucking newspaper.\n\nReply\n\nThread\n\nLink\n\n\n\n\n\nwow i forgot about that. it feels like it's been 84 years since this shit started.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nits crazy to think that interview helped tanked mccains presidential bid but today it would be news that lasted less than a day and everyone would move on\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\na+ on including the johnson tweet\n\n\n\nall of the oprah stuff is just more boring \"heal thyselves\" pablum that pretends things like capitalism or inequality don't exist. if she actually wanted to help people, she'd advocate for socialism that would remove a lot of stress on poor people or even just some kind of harm-reduction program (ie, good educational institutions, free access to therapists) instead of some vague \"love\" that presupposes those kids' trauma as inevitable. but that'd go against her brand of useless self-help and threaten her and her friends' wealth\n\n\n\nmilwaukee in particular has a hard time budgeting for schools and is very racially segregated. talk about those and the failure of local governance (city and state) for decades to fix those issues, not the symptoms\n\nReply\n\nThread\n\nLink\n\nWhen I saw that Adam was included I was like hell yes.\n\n\n\nYour comment is spot on as usual.\n\n\n\nThat self-help shit is played out. That school choice bullshit these con artist try to push is a way to segregate the students and steal public funds from already underfunded schools.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nYeah, self-help can only go so far when your government is actively working to crush anyone who's not a wealthy white man (exception: a very few hand-picked women and POC, to make said government look inclusive and supportive)\n\n\n\nDeVos is only a couple letters away from DeVil and that's fitting.\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\n\n\n\n\nThis also reminds me that democrats have enabled a lot of this bullshit happening today. When people reminisce about the Clinton years I remember this clip...\n\n\n\nhow did this work out exactly pic.twitter.com/ViDQ1PuGWj — 🌐 IPM 💯🏧💍🌈🚀🚩 (@IPM_Tweets) March 5, 2018\n\n\n\nWealthy people are never gonna do things out of the kindness of their hearts. We shouldn't wait for them to end inequality. And democrats should stop helping the republicans make that inequality worse. We need real progressives in government to push real change.This also reminds me that democrats have enabled a lot of this bullshit happening today. When people reminisce about the Clinton years I remember this clip...\n\nReply\n\nParent\n\nThread\n\nExpand\n\nLink\n\nto promote socialism she would have to admit that the wealth she amasked was possible because the people on the bottom are not being paid a livable wage i.e. it’s never going to happen\n\nReply\n\nParent\n\nThread\n\n\n\nLink\n\nWaaaay too embarrassing to watch.\n\nReply\n\nThread\n\nLink\n\nI love it when Adam goes off\n\nReply\n\nThread\n\nLink\n\nDamn all my Adam Johnson lovers showing up in this post. This is my shit. I love it.\n\nReply\n\nParent\n\nThread\n\n\n\nLink", "images": ["https://l-userpic.livejournal.com/105071076/13820587", "https://l-userpic.livejournal.com/111603557/10118583", "https://l-userpic.livejournal.com/128173725/14281965", "https://sb.scorecardresearch.com/p?c1=2&c2=10463284&cv=2.0&cj=1", "https://l-stat.livejournal.net/img/community.gif?v=556?v=397.3", "https://l-stat.livejournal.net/img/userinfo_v8.svg?v=17080?v=397.3", "https://l-userpic.livejournal.com/126334082/37165482", "https://l-files.livejournal.net/og_image/3616053/429554?v=1520837967", "https://l-userpic.livejournal.com/85136020/3616053", "https://l-userpic.livejournal.com/122385336/29062071", "https://l-userpic.livejournal.com/125953119/10190288", "https://l-userpic.livejournal.com/128195373/63162603", "https://l-stat.livejournal.net/img/user_ontd.gif?v=15718?v=397.3", "https://l-userpic.livejournal.com/128793610/71133922", "https://l-userpic.livejournal.com/112744815/12866505", "https://l-userpic.livejournal.com/94534076/113422", "https://l-userpic.livejournal.com/128950163/48376281", "https://l-userpic.livejournal.com/127780302/74323296", "https://l-userpic.livejournal.com/124401249/15392935", "https://l-userpic.livejournal.com/95315511/3174921", "https://l-userpic.livejournal.com/129269360/3714552", "https://l-userpic.livejournal.com/128003406/19473835", "http://awaps.yandex.ru/0/9999/001001.gif?subsection=0", "https://l-userpic.livejournal.com/129008065/85334686", "http://counter.rambler.ru/top100.cnt?pid=1111412", "https://l-userpic.livejournal.com/128187934/3589086", "https://media.giphy.com/media/fXmpRvTWqIWbK/giphy.gif", "https://www.livejournal.com/img/schemius/print-logo.png?v=49361", "https://l-userpic.livejournal.com/128258350/15328770", "https://l-userpic.livejournal.com/128237328/76629127", "https://l-userpic.livejournal.com/127654135/81886940", "https://l-userpic.livejournal.com/128195785/1297014", "https://l-userpic.livejournal.com/47651452/3222388", "https://l-stat.livejournal.net/img/user_ontd.gif?v=397.3", "https://l-userpic.livejournal.com/124223941/47406135", "https://xc3.services.livejournal.com/ljcounter/?d=srv:kr-ws32,r:0,j:3616053,p:63162603,uri:%22%2F109965933.html%22,vig:0,v:1,extra:ADctNQPDyOsGjfJt", "https://l-userpic.livejournal.com/129328850/81438922", "https://media.giphy.com/media/8ZeZDX6bZMgBoNtadr/giphy.gif", "https://l-userpic.livejournal.com/127186245/1415049", "https://l-userpic.livejournal.com/127100334/5699514", "https://l-userpic.livejournal.com/125324715/76678754", "https://l-userpic.livejournal.com/93771337/4546638", "https://l-userpic.livejournal.com/97561385/531687", "https://l-userpic.livejournal.com/107758475/13167016", "https://l-userpic.livejournal.com/128249016/13799161", "https://l-stat.livejournal.net/img/icons/twitter-16.png?v=29916?v=397.3", "https://l-userpic.livejournal.com/128161562/1297014", "https://l-userpic.livejournal.com/67064908/4528478", "https://l-userpic.livejournal.com/129361497/77345602", "https://l-userpic.livejournal.com/125310751/63502057", "https://l-userpic.livejournal.com/124808644/7726236", "http://mc.yandex.ru/watch/27737346", "https://l-userpic.livejournal.com/128584893/6343746", "http://www.tns-counter.ru/V13a****sup_ru/ru/UTF-8/tmsec=lj_noncyr/", "https://l-userpic.livejournal.com/126528372/17089913", "https://l-userpic.livejournal.com/75095411/3823357"], "top_img": "https://l-files.livejournal.net/og_image/3616053/429554?v=1520837967", "keywords": [], "authors": [], "canonical_link": "https://ohnotheydidnt.livejournal.com/109965933.html", "title": "Celebrities React to Secretary of Education Betsy DeVos Not Knowing Anything About Education", "meta_data": {"description": "Sec. of Education Betsy DeVos struggles to answer fairly basic questions on school performance on 60 Minutes pic.twitter.com/lFVq3USwUW  Axios (@axios) March 12, 2018  In an interview with Lesley Stahl for 60 Minutes, Betsy DeVos fumbled her way through answering questions before the…", "og": {"description": "Sec. of Education Betsy DeVos struggles to answer fairly basic questions on school performance on 60 Minutes pic.twitter.com/lFVq3USwUW  Axios (@axios) March 12, 2018  In an interview with Lesley Stahl for 60 Minutes, Betsy DeVos fumbled her way through answering questions before the…", "image": "https://l-files.livejournal.net/og_image/3616053/429554?v=1520837967", "title": "Celebrities React to Secretary of Education Betsy DeVos Not Knowing Anything About Education", "type": "article", "url": "https://ohnotheydidnt.livejournal.com/109965933.html"}, "twitter": {"app": {"id": {"ipad": 383091547, "iphone": 383091547}, "name": {"ipad": "LiveJournal", "iphone": "LiveJournal"}, "url": {"ipad": "ljs://ohnotheydidnt.livejournal.com/109965933.html", "iphone": "ljs://ohnotheydidnt.livejournal.com/109965933.html"}}, "card": "summary_large_image", "description": "Sec. of Education Betsy DeVos struggles to answer fairly basic questions on school performance on 60 Minutes pic.twitter.com/lFVq3USwUW  Axios (@axios) March 12, 2018  In an interview with Lesley Stahl for 60 Minutes, Betsy DeVos fumbled her way through answering questions before the…", "image": {"src": "https://l-files.livejournal.net/og_image/3616053/429554?v=1520837967"}, "site": "@livejournal", "title": "Celebrities React to Secretary of Education Betsy DeVos Not Knowing Anything About Education"}, "article": {"tag": "politics"}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1", "google-site-verification": "qaPPclkOuLJgg9--FU4bY33001RKyrCb50eAnzluWU4", "keywords": "american idol, beyonce, british celebrities, britney spears, candids, casting / auditions, cd and dvd releases, celebrity blogs and twitters, charity, concert / tour dates, death, disney / nick, fashion, film, film trailer / stills, glee, gossip girl, harry potter, hilary duff, interview, jon and kate, jonas brothers, kardashian, lady gaga, late night talk show, legal / lawsuit, lindsay lohan, list, lost, magazine covers and articles, michael jackson / jackson family, miley cyrus, models, music / musician, music video, nobody, photo shoot, ratings / charts, reality show, reality show - mtv, reality show celebrity, red carpet and event, rihanna, soap opera, sports athletes, television, television promo / stills, true blood, twilight, zac efron"}, "movies": [], "publish_date": null, "source": "http://ohnotheydidnt.livejournal.com", "summary": ""}