{"url": "https://greysanatomy.fandom.com/wiki/The_End_is_the_Beginning_is_the_End", "text": "“ The big day is here. The day you're gonna hear the news, the test result. Is the biopsy malignant or benign? Am I gonna live or die? You just want to know even if the news is scary because then you can move on. Whatever that means. They say ignorance is bliss because once you know about the tumor or the prognosis, you can’t go back. Will you be strong or will you fall apart? It's hard to predict, so don’t worry about it. Enjoy the time you have before the news comes. Yep, ignorance is bliss. ” — Meredith Grey\n\nThe End is the Beginning is the End is the eleventh episode of the ninth season and the 183rd overall episode of Grey's Anatomy.\n\nContents show]\n\nShort Summary Edit\n\nMeredith, Derek, Cristina, and Arizona receive big news regarding the plane crash lawsuit, Richard avoids Catherine's romantic advances and Jackson takes on one of Mark Sloan's old patients. Meanwhile, Derek begins recovery on his hand.\n\nFull Summary Edit\n\nDerek and Meredith are cuddling in bed. \"It's a big day,\" Derek says, and Meredith says she's excited about it. He asks when she's going to tell Cristina's she's pregnant, as meant it is the last day of her first trimester, while Meredith was talking about the plane crash lawsuit: the judge may have a decision about whether or not the hospital is at fault for the crash or not. He thinks that'll still take some more months. He tells her to enjoy the fact that it's the last day of her first trimester, and advises her to tell Cristina.\n\nAt Alex's house, Owen enters the kitchen with coffee. Someone with long, dark brown curly hair is looking in the cabinets and he grabs her from behind, thinking it's Cristina. As he grabs her, we see it's Jo, who gasps as she hears his voice and she turns around. He walks backwards, saying he thought she was Cristina, grabs the coffees and walks out of the kitchen. In her bedroom, Cristina laughs when he tells her what happened. Down in the kitchen, Jo tells Alex what happened while she was looking for a glass. She also says that she had to sleep on the living room floor, because he doesn't have any furniture. \"Being your friend is basically ruining my life,\" she says. She tells him to get a couch, while he shows her he doesn't a glass, as he just drinks the water straight from the faucet.\n\nAt the hospital, Jackson gives Richard cookies Catherine baked for him, and he also reads the message she sent with them. She's worried about him, as he doesn't return any of his calls. Richard doesn't want the cookies, and gives them back to Jackson, who says he'll put them in the lounge where everybody can enjoy them.\n\nOwen meets Derek in the elevator, and he tells him that he heard that there may be a judgment, and he adds that he hopes it'll work out for them. \"No you don't,\" Derek says, as this would mean that the hospital is negligent and that Owen did something wrong. \"Which you did,\" Derek says. Owen says that he's glad that Derek finally puts it out in the open, and as he leaves the elevator, he tells that he meant what he said.\n\nAlex and Cristina are in the lounge, where they talk about what happened this morning. Alex assures her that Jo is not his girlfriend, while Cristina reminds him that Owen is not her husband anymore. Jackson comes in with his mother's cookies and he tells them that she is worried about Richard. Alex and Cristina think he's doing fine considering his wife died a month ago, but Jackson is worried too, as Richard isn't operating.\n\nJo tells the other interns about the kitchen incident, and they want a detailed version. Jackson comes in the locker room to get Leah for his surgery. Shane is on Derek's service, and he thinks Derek may really be operating again today. As he leaves, Jo says that she's with Cristina, and Heather is with Meredith. Stephanie has no one, so she asks Jackson if she can tag along with him, and he allows her too. They leave the room together, and in the hallway, they both think it was a good move to keep their thing a secret. As Leah walks up to them, they pretend as if they had been talking about the case.\n\nDerek meets Callie in a conference room, where she's putting a ping pong net onto the table, and she tells him that he'll be playing ping pong for 8 hours to practice his hand. He asks with whom he'll be playing, when Shane walks in.\n\nIn the ambulance bay, the paramedics present the patients to Bailey. The wife fell onto her husband when she slipped off the dance pole that was installed in their bedroom for their anniversary.\n\nCristina walks around with the box of cookies, and she stops at the desk where April and Meredith are working. She tells Meredith about Jackson's mother's worries over Richard, and April heard Jackson's name so she asks her about Jackson. Cristina asks if she'll pounding over Jackson, and April asks if he's seeing someone. \"Jackson is like a cookie. People wanna lose weight, they don't eat the cookie. Then they get so hung about not having the cookie, that there whole life is about the cookie,\" Cristina says. April says her life is not about the cookie, and she walks away. Meredith asks Cristina about Owen, but Cristina says that all she knows is that the sex is even better now. \"Unless there's something you wanna tell me,\" Cristina says, but Meredith replies there's nothing she can think of. Cristina walks away, when Meredith gets a call. She looks at the screens and yells Cristina's name.\n\nShane and Derek are playing ping pong, while Derek's phone keeps on ringing. Arizona comes in and tells him to answer his phone, but Derek says they're in the middle of a game. \"Not anymore,\" Arizona says as she grabs the ping pong ball. She informs him that the lawyer wants them to meet at the court house.\n\nAt the court house, Callie, dressed in scrubs, is running down the hallway. She enters the court room, where the trial just ended. \"Was it bad?\" she asks when she sees her co-workers' face, but Meredith shakes her head. Arizona tells her that they won, and Meredith and Derek inform her that the hospital was found negligent because the charter company's history of mechanical problems was publically known. Callie asks about the award. \"He's giving us 15 million dollars,\" Arizona says, and Callie is amazed. \"Each,\" Arizona clarifies.\n\nThe doctors' rep tells the doctors that the hospital's insurance company will hand them a big check soon. The doctors all get ready for getting back to the hospital, but Callie wants them to come together at dinner to celebrate winning the case.\n\nIn the ER, Bailey is examining the pole dancer wife. She fell off the pole while doing the Sexy Flexy move. Seeing the bruise, Bailey comments that she must've fall on a hard surface. \"I landed on my husband. There was nothing hard about him,\" the wife says.\n\nBailey enters the trauma room where April is starting to examine the pole dancer's husband. She informs April on what happened and orders April to look for internal injuries while she's getting a CT. As Bailey leaves, the man notices the look on April's face and says that's how he felt when his wife started her act.\n\nCristina, Derek, and Meredith are standing in the elevator and thinking about things they could buy with their money, including houses with yards as big as football fields and football teams to play on them. \"More money, more problems,\" Cristina says. Alex is standing in the back, and obviously jealous. He says he wishes he had been on the plane as he gets off the elevator.\n\nJackson is explaining James's condition to Leah and Stephanie. James is aware that his face looks weird, but his parents don't want him to say things like that. Jackson shows the two interns photos taken after each of the times Mark had operated on James. The parents worshipped Sloan, but they assure Jackson they trust him as he was Sloan's guy. Jackson then says he wants to follow a different approach than Sloan planned to and lets Stephanie explain it. The father asks why Sloan didn't plan the procedure, and Jackson starts explaining until Arizona comes in late. The mother informs her that Jackson is explaining the new plan.\n\nOutside the room, Arizona and Jackson are discussing James's case. Jackson insists his plan will give James a much more normal appearance, but Arizona points out Mark knew James way longer than Jackson does. Jackson says plastic surgery is not her area of expertise, but invites her to let him talk her through his thought process. \"Are you kidding me?\" she asks. He gives her a persistent look.\n\nMeredith, Derek, and Cristina arrive at the nurses station in the main hall. They're all not ready for Callie's dinner. Heather comes over with a patient's chart and tells Meredith that the patient assured her that she's not pregnant, but Meredith says that people who say that always turn out to be pregnant. Meredith says she'll come with Heather and tells her she can take point. \"You know, there really is a problem with people claiming not to be pregnant when they really are,\" Cristina tells Derek, who then realizes she knows about Meredith's pregnancy. Cristina is sure Meredith knows that she knows. \"She'll tell me when she's ready to be happy about it,\" Cristina says and then congratulates him.\n\nMeredith and Heather arrive at Taylor's bed and Heather tells Taylor she's not pregnant. Taylor's mother finds this obvious and while saying that Taylor knows not to bring boys home and focus on her studies, Taylor starts putting her hair into her mouth. The mother tells her to get her hair out of her mouth and answers every question Heather asks Taylor. As Heather lifts Taylor's shirt, there's a visible mass. The mother interferes again, so Meredith takes her away to give Heather a chance to properly examine Taylor. \"That was awesome,\" Taylor says, and Meredith comes back to tell Heather that she needs to be concerned with her patient, not the parents.\n\nDerek and Shane are still playing ping pong while Jackson is thinking out loud about James's case. Derek is supporting Mark, as he operated together with him on James for the first time. Jackson says James's appearance will be improved by 5 to 10%, but Derek asks at what cost. The procedure is riskier, more complicated and demands a longer recovery. He advises Jackson to stick with Mark's plan.\n\nCristina meets Owen for a consult, when he sees Jo is walking towards them. He starts feeling awkward, but Jo is on Cristina's service, and Cristina tells him to relax. Jo gives Cristina the labs she did, and Owen starts apologizing, saying her hair really looks like Cristina's from behind. Jo says it's an understable mistake. Cristina finds the labs weird and orders another test. Jo walks away, and Cristina says she told him to relax, not make things worse. She then asks him to grab her.\n\nCristina and Owen are sitting on a bed in on-call room, kissing. He is relieved about the lawsuit, while it hasn't really sunk in for her yet. She asks him to come to this thing with her. It depends on the thing, and Cristina reveals it's a survivor's dinner. It could be fun if he comes with her, but Owen says Derek doesn't want him there, as he still blames Owen about what happened. Cristina tells him not to play martyr, but Owen seems to agree with Derek. Cristina wants to say something mean about Derek, but Owen shuts her up by kissing her and asks her to leave the plane crash and the past outside of the moment. \"Just you and me,\" he says, and they get undressed.\n\nMeredith meets Richard in his \"hall of horrors\", as Adele used to call it. There are bottles with all things he removed from patients throughout his career. He's cataloging everything, as medical waste will come to take everything away. Meredith asks him to scrub in with her on the case of the girl with the mass, but he declines the offer. She admits she's worried about him, as he hasn't been operated, but he assures her she doesn't have to be. He just wants to be left alone. He asks him to just let him do what he's doing, which she does.\n\nJackson meets Arizona and wants to talk about her calling Shepherd on him, but she wanted an opinion of a respected colleague. Callie interrupts with a question about tonight's sitter, but Arizona tells her the dinner still feels weird. Callie has two babysitter options, as the sitter they usually have can't come. Arizona tells her not to get the new sitter and Callie leaves. Arizona then compares Jackson with the new babysitter and that she trusts the other babysitter, which would be Mark, more. Jackson doesn't want to insulted again and interrupts her speech about Mark's investment in James's case to tell her that he'll be doing it Mark's way. She thanks him and apologizes for having insulted him.\n\nBailey tells Sheila that a rib punctured her husband's lung when she landed on him. They need to operate, but he'll be okay. Callie brings by a pillow to make Sheila's ride to radiology more comfortable. About the scan, Sheila wants to know if it's okay if she has metal on her \"cookie\". They don't understand, so Sheila lifts the blanket. She bedazzled her vagina, which is called vajazzling. Callie enthusiastically recognizes a butterfly, but she stops when Bailey gives her a look.\n\nDerek and Shane are still playing ping pong. Shepherd won again, but he suspects Shane is letting him win. Shane is, he doesn't want to offend by Derek by winning because Derek is a competitive guy. Derek says all neurosurgeons are, and he thought Shane has all what it takes to be one. Shane realizes that Derek is goating him. Shane still is a little hesitant, as he thinks Derek will never want to see him again if Shane wins, which wouldn't be helpful on Shane's quest to become him. Derek thinks this is creepy and he convinces Shane to put up a real game by promising to put in a good word for him by Dr. Ramsey, so Shane can assist her tomorrow. Shane then plays the ball, scoring a point.\n\nRichard is talking with a nurse as he suddenly sees Catherine standing in front of him. She in town to operate, but for now she made lunch reservations for them as she had to see him. Richard walks away, but Catherine stops him by saying that she's worried because Jackson told her he's not operating. She's worried he's not eating and sleeping enough. He yells she's not his wife. His wife died while he was carrying on with her. He purposefully didn't answer her calls. Meredith comes over and hears what he's saying. He doesn't want her there and asks him to be excused, as he and Meredith have a surgery. Catherine is visibly hurt by his words.\n\nJo and Alex are watching the ping-pong tournament when she asks him what her sleeping arrangements will now be instead of the floor. Alex says he's waiting for Cristina to save and furnish the place. Jo gives him a look but he defends himself saying the plan is genius. Alex cheers on Derek and rhetorts to Jo that her 'friend is choking'. Jo suggests they make the game more interesting and offers they bet $100 on each player. Though neither of them have the money, they agree. Callie walks over asking who's winning and the two doctors banter as to which one is doing better. Shepherd scores past Shane and Callie giggles saying that that's her 'wrist in there'. Shane then scores past Shepherd and Jo smugly requests $500, to Alex's dismay.\n\nCallie goes inside insisting they take a break so she can examine Derek's wrist. Both refuse and continue playing, aggresively. Callie reminds them that this 'is not Wimbleton but a hospital conference table being used to strengthen muscles so you can operate'. Both are enamored in the game and ignoring what she is saying. On her way out, she reminds Derek to respond to her email about the dinner and to come even if he doesn't want to, because if he comes everybody else will too.\n\nJo asks Alex what dinner Callie is referring to and he informs her about the judgment and consolation money. Jo congratulates Cristina on her reward and asks if she'll be using any of it to furnish the house. Cristina says she doesn't need to since it's not her house. Jo gives Alex a look, reiterating his previous comment on his plan being genius.\n\nCristina walks into the conference room and asks Shane for the paddle. She begins playing Shepherd and tells him he needs to forgive Owen because he's holding a grudge. \"You're making it sound like he stole my lunch out of the refrigerator\" Derek says cooly. Cristina says that they won the case and they need to move on, and let Owen move on too. Derek reminds her that Owen put them on the plane. Cristina reminds him that he too once was Chief and he had a lot of difficult decisions to make at a time, and he needs to forgive Owen. Derek angrily scores past Cristina telling her it's not that easy. She says she knows but to forgive him anyway, as she drops the paddle and leaves the room. Shane and Derek resume their game.\n\nCristina tells Jo to get back to work. As she leaves, Jo reminds Alex about the $500 and to let her know how it goes.\n\nJames and his girlfriend are sitting in the pre-op room as Jackson walks in. The girlfriend gives him a kiss and tells him he'll do great and she'll see him after volleyball practice the next day. When she leaves, James makes a comment to Jackson saying he knows his girlfriend's hot and he's wondering how he got a girl like that. Jackson disagrees at first but then admits he's curious. James tells him that Sloane's calling him weird wasn't him being mean but reminding him that surgery was only going to get him so far. He was never going to look completely normal so he had to develop some moves to attract the women. Jackson laughs saying Sloane gave him a couple tips saying getting women was Sloane's specialty. James says that Sloane told him his moves would never work for him and that he had to come up with his own. James says he 'blinds them with his amazing personality and that they don't even notice the face.' Jackson comments that it's working and James said he does okay but not being weird-looking would be good too. He tells Jackson there's no pressure, and Jackson tells him he'll see what he can do about it. The doctors come in to wheel him to the OR.\n\nBailey is operating on Sheila's husband and commenting that she doesn't understand what happened to good old fashioned sex, without all the embellishments like vajazzling. Bailey asks April if men bedazzle their penises and she says she really doesn't want to think about it. Bailey tells somebody to look it up and Leah quickly goes on her phone. Bailey continues saying it's foolish and idiotic. She stares at April and asks her if she's ever vajazzled herself. April looks up uncomfortably and glares at her. Bailey remembers that Jesus isn't a fan of 'the vajazzle'. She asks Bokhee if she did and she walks away neither confirming nor denying.\n\nMeredith asks Webber if it feels good to be back in the OR as they operate on Taylor. Webber tells her to focus on the patient. When cutting into the stomach they pull out a giant hair ball due to her eating her own hair. Heather comments that she used to eat dirt. Meredith and Webber look at her in shock and she assures them that she hasn't in years. Webber and Meredith share a look.\n\nA crowd has gathered to watch Shane and Derek play ping-pong. Alex walks over and Jo tells him he made it right in time to lose since it's the final point. Alex is sure that Shepherd will win. Jo extends her hand offering 'double or nothing' and the two shake on it, after calling him scared. Jo and Alex get even more competitive urging on their teammates. After a heated round, Shane scores past Shepherd, resulting in a loud cheer from Jo. Shepherd asks for another game but Shane says he won fair and square. Shane begins to act like he's talking to a friend, demanding Shepherd to let him scrub in on an operation. He quickly catches himself and apologizes thanking him for the game but he wants to go operate. Shepherd starts another game with his dominant hand. Jo is celebrating in the hallway and following Alex to the cash machine doing a victory dance.\n\nMeredith walks in to the Hall of Horrors with the hairball in a jar. She places it on a shelf saying it's too cool to allow it to go to medical waste. She asks Webber how he's going to get rid of all the stuff. He says that while she sees scissors and other stuff, he sees a Thanksgiving he didn't take off to be with Adele in London. The teratoma kept him from their anniversary. He says that even though he's proud of saving it, it only reminds him of his failure. Webber changes the topic by saying Meredith must be happy with the money and asks her what she's planning on doing with the money. She says it's blood money. Lexie is dead. Webber assures her it's a good thing and asks if she hasn't suffered enough. She asks him the same.\n\nSheila is waiting in the hallway for confirmation about her X-rays. Callie tells her it's just a bruised tailbone and that she can go home now. April says that her husband will be in the hospital only for a couple of days. Bailey tells her no driving or sexual activity for at least a month. Sheila is saddened by this, as Bailey hands her the bedazzled gems. Bailey snaps telling her to stay off the pole. Sheila tells her that she just got back from her honeymoon but to talk to her after 45 years of marriage and raising three kids. You get tired and you want to give up, but she doesn't want to do that. At least she's trying. Callie apologizes for Bailey saying she didn't mean to judge. Sheila starts to cry saying that the worst part is that he looked embarrassed for her and that that hurts more than a bruised tailbone. She survived 45 years of marriage and is it so bad that she wants to celebrate her anniversary with a little sex? The doctors assure her that it is not.\n\nJackson is informing the interns that he will instruct them how to prep for this surgery. Arizona runs in, upset that he reverted back to his idea instead of Mark's original. Jackson assures her that he spoke to the parents and the plastics attending but Arizona tells him that Mark had an idea for a reason. Jackson says he knows that but Mark is no longer here and he needs to do what he thinks is best. Jackson prepares James for surgery, while Arizona looks in disagreement.\n\nCallie tells Bailey that maybe Sheila's husband couldn't get an erection anymore which is why he looked embarrassed. Bailey disagrees saying maybe he was just embarrassed for her. Callie tells her that they're sweet and that of all people Bailey should understand an older couple with a healthy sex life. Bailey says she does appreciate them but she only had sex once on her honeymoon. Ben wanted to have sex on the beach and not in the hotel suite. Bailey says she got sand in her \"cookie\" afterwards. They went to the doctor only to find out she had a vaginal infection and there were sand flea bites on her \"butak\" and that it would become very itchy, and he was right. Bailey says that her honeymoon consisted of an infection and itching so she is not a big fan of the beach or the pole or anywhere. Callie starts laughing hysterically and Bailey storms away, as Callie continues to laugh.\n\nAt a restaurant, Callie asks the quiet group how everybody's dinner is. Everybody comments that it's good and continues eating. Derek asks Arizona how James' surgery went and she tells him that Jackson went against her wishes and chose the 5 hour surgery. A waiter comes over with a bottle of champagne and Callie approves it. Callie says she wants to make a toast: Arizona stood for five hours on her prosthetic leg, Derek played ping-pong with his disabled hand for 5 hours. Cristina is caught texting but then admits she is sexting Owen. Callie jokes saying Mark would've loved that since sex was the thing Mark loved the most. Callie comments that they're all having it or trying to have it, and the group looks around awkwardly. She says that they're trying. Trying to move on which is progress. It feels weird, sad, and wrong, but it also feels exciting. She starts to cry saying she misses Mark and Lexie and is heartbroken that they're not here today but she's grateful that all of them are. And that she's going to celebrate that. The waiter offers to pour Meredith champagne but she denies the offer twice and tells Callie that she's pregnant. The group rejoices and they celebrate, sharing congratulations and laughing.\n\nCatherine is sitting alone drinking a glass of wine, looking sad. Richard walks up behind her and says he should've been there for Adele and she says she knows. He says he failed her when she needed him the most and that he can't breathe. Catherine tells him he can breathe and that he shouldn't have to do it alone. She just wants to hold his hand. She reaches for his hand and he allows her to take it.\n\nJackson is telling James and his family that the surgery went great, and that from now on he'll just be another pretty face. James' mother thanks him and he says that Sloane did most of it and he just finished it up for them. James offers Jackson a high five and they exchange one as Leah and Stephanie look on. Stephanie says that Jackson told her James might not even need another major surgery. Leah asks if Jackson told her that while holding her breasts and Stephanie becomes defensive. Leah says Stephanie called her a skank for sleeping with Karev and now she's doing the same thing. Stephanie asks how Leah knew and she said she didn't, until now.\n\nHeather is telling Taylor that she needs to learn to stand up for herself and that even though it won't be easy she can do it. Taylor smiles. Taylor's mom comes in saying she heard it was a hair ball. Heather tells her that it's a disorder that can be treated through therapy. Taylor's mom says she won't be going to therapy and that she will stop on her own just like she stopped eating carbs. Taylor snaps at her mom saying that this is not like eating carbs and that this is a medical condition and that she will be taking her to a therapist. Her mom is stunned to silence, as Taylor tears up smiling at Heather.\n\nJackson walks over to April who is filling out charts. He tells her that he's sleeping with Stephanie and wanted to tell her himself so she didn't hear about it elsewhere. April, visibly upset, says okay, not being able to look him in the eye. She tears up as she tells him she misses him and that they used to be friends and now they're not. Jackson tells her they can still be friends. She tells him that in that moment she's thinking of kissing him, so no she is not ready to just be friends. He asks her if she's sure and she tells him that she is. She thanks him for telling her himself and walks away.\n\nApril walks into Sheila's husbands room and tells him medically Sheila is doing fine but that she wants to have sex with him. She asks if his equipment is working and he says yes, and she tells him to use it because they are married. And if she were married she would be doing it all day long, she says as she looks out the window at Jackson. She urges him to do it and leaves the room.\n\nJo is walking Alex into the living room with her hands over his eyes and reveals that he bought him a couch. He says that it's such a girlfriend thing. She tells him the polite thing to do would be to say thank you. He tells her they won't be having sex and she said she doesn't want to because he's like a brother to her. She walks over to the couch and he joins her, taking a beer. He says that he's never been friends with a girl he didn't want to do it with, except for Meredith who probably wanted him at some point. Jo calls him a douche and tells him to drink, as they clink bottles.\n\nBack at the restuarant, the girls are lauging while Derek is on the phone with Owen telling him to come over here. Owen says he cant and Derek tells him it's not his fault and he knows that. They're moving forward. Owen again says no, and Derek hands the phone to Cristina. She says she doesn't know what they are but she's drunk and happy and wants him to come and be drunk and happy with her and that the bathroom doors lock. Derek tells him to come over and have somebody else finish up his work. Owen tells him another time and Derek hangs up, understanding the situation. Meredith's voice narrates saying that 'ignorance is bliss. because once you know about the tumor or the prognosis, you can't go back\"\n\nOwen shuts the phone and goes back to the conference room for a meeting with the board. They continue saying that the insurance company found a loophole, that no more than 2 attendings are allowed on a medi plane, and that Doctor Robbins set it all off, and the company will not pay. The hospital has to pay and end up going bankrupt. The hospital will have to close it's doors.\n\nThe episode closes with the gang taking a happy picture and Meredith narrating saying \" Will you be strong? Or will you fall apart? It's hard to predict. So don't worry about it. Enjoy the time before the news comes.\n\nYup. Ignorance is bliss.\"\n\nCast Edit\n\nMeredith Grey\n\nCristina Yang\n\nAlex Karev\n\nMiranda Bailey\n\nRichard Webber\n\nCallie Torres\n\nOwen Hunt\n\nArizona Robbins\n\nApril Kepner\n\nJackson Avery\n\nDerek Shepherd\n\nCatherine Avery\n\nSheila Olsen\n\nRoberta Thompson\n\nJo Wilson\n\nShane Ross\n\nMrs. Lanz\n\nHeather Brooks\n\nStephanie Edwards\n\nDoctor's Rep\n\nLeah Murphy\n\nJames Leggett\n\nLeonard Olsen\n\nDana Leggett\n\nPhil Leggett\n\nParamedic Nicole\n\nNurse Gloria\n\nTaylor Lanz\n\nSuper Hot Girlfriend 1 of 29\n\nMain Cast Edit\n\nGuest Stars Edit\n\nMedical Notes Edit\n\nDiagnosis:\n\nTreatment: Rehab\n\n\n\nCallie had Derek play ping pong in order to rehab his hand.\n\nDiagnosis: Crush injury Punctured diaphragm\n\n\n\nTreatment: Surgery\n\n\n\nLeonard, 67, came in with crush injuries from his wife falling on him. He had surgery to fix the injuries.\n\nDiagnosis: Bruised tailbone\n\n\n\nTreatment:\n\nSheila, after falling on her husband, was left with just a bruised tailbone, so she was sent home.\n\nDiagnosis: Crouzon Syndrome\n\n\n\nTreatment: Monobloc advancement\n\n\n\nJames, 16, was a past patient of Mark Sloan who came in for surgery. Jackson planned a more radical surgery than Mark had chosen. At Arizona and Derek's recommendation that he go with the more conservative approach, he initially backed off, but after a chat with James, he went back to his more radical plan, with Arizona watching him the whole time.\n\nDiagnosis: Bezoar Trichotillomania\n\n\n\nTreatment: Extraction\n\n\n\nTaylor, 19, was in the ER with abdominal pain. Scans revealed a mass that was revealed in surgery to be a bezoar caused by the patient eating her own hair.\n\nDiagnosis: Swallowed objects\n\n\n\nTreatment: Surgical extraction\n\n\n\nRon swallowed a bunch of pennies and then a year later, swallowed some scissors. Both had to be surgically removed.\n\nRamsey's Patient Edit\n\nDiagnosis: Chiari malformation\n\n\n\nTreatment: Chiari decompression\n\n\n\nDerek offered to put in a good word for Shane to scrub in with Ramsey on a Chiari decompression if Shane won that game.\n\nDiagnosis: Infection Sand flea bites\n\n\n\nDoctors:\n\nTreatment:\n\nOn her honeymoon, Bailey contracted an infection and also received some sand flea bites after having sex on the beach.\n\nMusic Edit\n\nSong Performer Scene \"Stompa\" Serena Ryder Meredith and Derek talk about Meredith's pregnancy and the plane crash lawsuit.\n\nOwen grabs Jo, thinking she was Cristina.\n\nCristina laughs when Owen tells her the story.\n\nJo tells it to Alex. \"Disaster\" The Mynabirds Alex, Jo, Cristina and Callie watch Derek and Shane play ping-pong.\n\nCallie wants to check on Derek's wrist, but he and Shane are getting really competitive. \"What It's Worth\" The Engineers feat. Mark Peters Richard and Catherine Avery talk about Adele's death over dinner.\n\nJackson checks on his patient.\n\nLeah finds out Stephanie has slept with Jackson.\n\nHeather s patient steps up to her mother.\n\nJackson tells April he slept with Stephanie. \"Shine On Everything\" Left Hand Smoke Jo bought Alex a couch, on which they drink a beer.\n\nDerek calls Owen and tells him he forgives him.\n\nCristina and Derek try to convince Owen to come have a drink with them.\n\nOwen learns that the assurance isn't gonna pay and that hospital will have to, making it go bankrupt.\n\n\"Stompa\" - Serena Ryder \"Disaster\" - The Mynabirds \"What It's Worth\" - The Engineers feat. Mark Peters \"Shine On Everything\" - Left Hand Smoke\n\nNotes and Trivia Edit\n\nGrey's Anatomy 9x11 Promo \"The End Is the Beginning Is the End\" (HD)\n\nThis episode's title originated from the song The End is the Beginning is the End , originally sung by Smashing Pumpkins .\n\n, originally sung by . This episode scored 8.80 million viewers.\n\nThis is the first episode written by Joan Rater on her own. The previous 14 episodes she wrote were co-written with Tony Phelan.\n\nThis episode was originally titled Judgment Day .\n\n. The blouse Catherine was wearing on this episode was the same blouse Callie wore on \"If/Then\".\n\nThe hairball prop was made out of doll hair and plastic.\n\nGoof In the scene where Meredith reveals her pregnancy, Callie seems very surprised. This is odd because she already found out from Heather in \"Love Turns You Upside Down\".\n\nGallery Edit\n\nEpisode Stills Edit\n\nBehind the Scenes Edit\n\nQuotes Edit\n\nMeredith: We could buy a house. Derek: We have a house. Meredith: We could buy another house. Derek: We could buy five houses. Cristina: We could buy five houses with yards as big as football fields. Meredith: We could buy the team to play on the football field. Cristina: Who would play against them? Derek: Well, we'd buy another team. Meredith: I just wanted a house. Cristina: Mo' money, mo' problems. Alex: I should've been on that damn plane.\n\nCristina: Yeah, you know, that really is a problem, people claiming not to be pregnant when they really are. Derek: You know? Cristina: Of course I know. Her boobs got huge about two weeks ago, and she's eating everything in sight. Derek: But she didn't tell you? Cristina: No, but... she knows I know. Derek: So you know she knows that you know? Cristina: Mm-hmm. She'll tell me when she's ready to be happy about it. Congratulations.\n\nCristina: I heard your girlfriend did a little panty dance in the kitchen this morning. Alex: She's not my girlfriend. Look, I know it's weird. She's hot and she's always around, but I don't even think of her like that. It'd be like you and I sleeping together. Cristina: Ew. I'm trying to eat my breakfast. Alex: Did you hear your husband accidentally copped a feel? Cristina: Mmhmm. Yeah. Oh, and he's not my husband. That's why he's sneaking in at the crack of crack. Alex: You are a messed up broad. Jackson: Dr. Webber rejected my mother's cookies. Alex: That sounds dirty. Jackson: She's worried about him. She wants me to assess his mood. She think he's depressed. Cristina: Well, his wife died a month ago. Isn't he supposed to be depressed? Jackson: Of course, but, like, normal depressed or too depressed? Cristina: I mean, he's fine. He's back at work. Jackson: Nah, but he's not operating. Alex: Maybe you should hold him. Jackson: And I'm done. Enjoy the cookies.\n\nCristina: Are you still pining over Jackson? April: No. God. No. Why? Is he seeing someone? Cristina: April, April... Jackson is like a cookie. People want to lose weight, they don't eat the cookie. But then they get so hung up on not having the cookie that their whole life is about the cookie. April: My whole life is not about the cookie. (walks off and takes a cookie) Meredith: Is your whole life about the cookie? Cristina: What do you mean? Meredith: You and Owen, are you guys a thing again or... Cristina: I don't know. All I know is, having sex with a man who used to be your husband is way more fun than when he is your husband.\n\nCatherine: Richard, Jackson told me you're not operating. I'm worried about you. You look thin. Are you eating? Are you sleeping? Richard: Look, you're not my wife. So you don't get to... My wife died. While I was carrying on with another woman, my wife died, Catherine. So what I'm eating and how I'm sleeping is not your concern. I haven't returned your calls because I don't want to go to lunch. I don't want cookies. I don't want you here.\n\nBailey: Whatever happened to just regular old sex, without poles or vaginas dressed up in rhinestone? When did just plain old 'get naked' become boring? And I suppose men do it, too, bedazzle their penis? April: I'm really trying not to think about. Bailey: Somebody look that up. Nurse: On it. Bailey: Just foolish. Idiotic. Kepner, you ever vajazzled yourself? Oh, right. Jesus isn't a fan of the vajazzle.\n\nHeather: I used to eat dirt. I haven't in years.\n\nRichard: You know what I see when I look at the scissors Ron Newsome swallowed? I see the Thanksgiving that I didn't take off so I didn't join Adele in London. The teratoma kept me from our anniversary party. Black tie. She planned the whole thing. I got there in time for dessert. All this stuff that I saved, that I'm so proud of... just reminds me of my failures. So... you must be happy about the judgment? What are you gonna do with all that money? Meredith: Oh, it's blood money. My sister's dead. It's... Richard: Meredith, it's a good thing. Haven't you suffered enough? Meredith: Haven't you?\n\nCallie: You just got back from your honeymoon. I'd think you of all people would appreciate an older couple with a healthy sex life. Bailey: No, I do appreciate a healthy sex life. It's just... Okay, look, I had sex once on my honeymoon. One time, the very first night. We arrived in the Bahamas, and my husband wanted to have sex not in our well-appointed suite, but on the beach. So off to the beach we went, where we had sex, and I got said up in my... cookie. Callie: Ew. Bailey: Yes, a vagina full of sand that gave me a bad, bad infection, requiring a trip to the local doctor, who confirmed the infection and also diagnosed a few sand flea bites on my buttock. Yeah, his word, buttock. He also went on to say that my buttock would become very itchy, and he was right. So a painful infection and an itchy buttock are what I had on my honeymoon. So, no, no, I am not a fan of the beach or the pole or anywhere at this point. I am a fan of a bed.\n\nCallie: And wanted to keep on playing 'cause his wrist wasn't sore. What are you doing? Cristina: Oh, sorry. I'm just, uh, quick texting Owen. Meredith: Sexting. Callie: No, she's... She's trying is what she's doing. Yeah. You just divorce the guy, and here you are texting him. Cristina: Mer's right. I'm sexting. Callie: Oh, well, even better. Mark would've loved that. (laughs) Sex was the thing he loved more than anything else. And we're all having it, so that's-- Arizona: Well, um... Callie: Well, we're trying. Don't you see that? We're all trying. We're trying to move on, which is progress. And it feels weird... and sad and wrong, but it also feels exciting. I miss Mark... And Lexie. And I'm... heartbroken that they're not here tonight. I'm heartbroken, but... I'm also grateful... that all of you are. And I'm gonna celebrate that. And we are gonna toast. Come on. Toast. Pick up your glasses and toast. Meredith: Oh, no, thank you. Callie: Yes, she's having champagne. Grey, we're all having champagne. Meredith: No, I can't. Callie: Just try. Try. Come on. Just try. Is it too much to ask you to try? Meredith: I can't because I'm pregnant. And I'm happy, so let's celebrate.\n\nRichard: I should've been there, Catherine. Catherine: I know. Richard: I failed her. When she needed me the most, I failed her. Catherine: Richard... Richard: No, I... I feel like I can't grieve. Like I lost the right to grieve when I started seeing you. Catherine: But you are grieving, baby. And you shouldn't have to do it alone.\n\nLeah: You made fun of me for sleeping with Karev. Called me a skank, make this whole 'I don't want to be like Leah' thing, and now you're sleeping with the boss. Stephanie: How'd you know? Leah: Oh, well, I didn't. Now I do.\n\nRoberta: The insurance company found a loophole. Apparently there's a rule that no more than two attendings are allowed on a medi plane. So when Dr. Robbins took Dr. Karev's place on the flight... Anyway, they say, they aren't gonna pay. Owen: So, who pays? Roberta: We do. The hospital. Owen: We don't have that kind of reserve. Roberta: No, we don't. Owen: So? Roberta: We go bankrupt. The hospital closes it's doors.\n\nSee Also Edit", "images": ["https://vignette.wikia.nocookie.net/greysanatomy/images/5/52/%22Stompa%22_-_Serena_Ryder/revision/latest/scale-to-width-down/248?cb=20150510175642", "https://vignette.wikia.nocookie.net/hildatheseries/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190914140704", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/25/GA-911-02.jpg/revision/latest/scale-to-width-down/209?cb=20130719083713", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/e8/9x11-19.jpg/revision/latest/scale-to-width-down/209?cb=20130719083202", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/ef/9x11-24.jpg/revision/latest/scale-to-width-down/185?cb=20130719084956", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190621202210", "https://slot1-images.wikia.nocookie.net/__cb1586963839864/common/skins/common/images/magnify-clip.png", "https://vignette.wikia.nocookie.net/greysanatomy/images/f/fd/9x11-28.jpg/revision/latest/scale-to-width-down/209?cb=20130719084208", "https://vignette.wikia.nocookie.net/greysanatomy/images/4/40/9x11-12.jpg/revision/latest/scale-to-width-down/185?cb=20130719085455", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/a7/9x11-29.jpg/revision/latest/scale-to-width-down/204?cb=20130719084356", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b7/9x11-5.jpg/revision/latest/scale-to-width-down/209?cb=20130719085217", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/10/9x11-8.jpg/revision/latest/scale-to-width-down/185?cb=20130719085239", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/87/9x11BTS3.jpg/revision/latest/scale-to-width-down/209?cb=20130717194214", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/17/%22Shine_On_Everything%22_-_Left_Hand_Smoke/revision/latest/scale-to-width-down/248?cb=20150510175708", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b1/9x11BTS1.jpg/revision/latest/scale-to-width-down/209?cb=20130717194200", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/29/9x11BTS4.jpg/revision/latest/scale-to-width-down/185?cb=20130717194223", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/70/9x11-18.jpg/revision/latest/scale-to-width-down/203?cb=20130719083840", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/33/9x11BTS2.jpg/revision/latest/scale-to-width-down/209?cb=20130717194207", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/ad/9x11-16.jpg/revision/latest/scale-to-width-down/209?cb=20130719083745", "https://vignette.wikia.nocookie.net/greysanatomy/images/f/f9/%22Disaster%22_-_The_Mynabirds/revision/latest/scale-to-width-down/248?cb=20130620185238", "https://vignette.wikia.nocookie.net/greysanatomy/images/c/c4/9x11-13.jpg/revision/latest/scale-to-width-down/185?cb=20130719085508", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/29/9x11-27.jpg/revision/latest/scale-to-width-down/209?cb=20130719084448", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/b4/9x11-10.jpg/revision/latest/scale-to-width-down/209?cb=20130719085433", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/a3/9x11-17.jpg/revision/latest/scale-to-width-down/209?cb=20130719084514", "https://vignette.wikia.nocookie.net/greysanatomy/images/4/41/9x11-23.jpg/revision/latest/scale-to-width-down/185?cb=20130719084923", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/54/9x11-22.jpg/revision/latest/scale-to-width-down/185?cb=20130719084619", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/5e/9x11-6.jpg/revision/latest/scale-to-width-down/185?cb=20130719085224", "https://vignette.wikia.nocookie.net/greysanatomy/images/1/19/9x11-1.jpg/revision/latest/scale-to-width-down/209?cb=20130719085052", "https://vignette.wikia.nocookie.net/greysanatomy/images/4/4b/9x11-14.jpg/revision/latest/scale-to-width-down/185?cb=20130719085514", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/5a/9x11-15.jpg/revision/latest/scale-to-width-down/185?cb=20130719085527", "https://vignette.wikia.nocookie.net/greysanatomy/images/4/4e/9x11-9.jpg/revision/latest/scale-to-width-down/209?cb=20130719085421", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/25/GA-911-02.jpg/revision/latest?cb=20130719083713", "https://vignette.wikia.nocookie.net/karlacamilacabello/images/b/b6/Spotlight.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200211045312", "https://vignette.wikia.nocookie.net/greysanatomy/images/b/be/9x11-25.jpg/revision/latest/scale-to-width-down/209?cb=20130719084024", "https://vignette.wikia.nocookie.net/greysanatomy/images/6/65/9x11-21.jpg/revision/latest/scale-to-width-down/185?cb=20130719084843", "https://vignette.wikia.nocookie.net/greysanatomy/images/a/ad/9x11-4.jpg/revision/latest/scale-to-width-down/185?cb=20130719085139", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/33/9x11-7.jpg/revision/latest/scale-to-width-down/209?cb=20130719085231", "https://vignette.wikia.nocookie.net/greysanatomy/images/3/33/9x11-20.jpg/revision/latest/scale-to-width-down/185?cb=20130719084724", "https://vignette.wikia.nocookie.net/greysanatomy/images/e/ea/%22What_It%27s_Worth%22_-_The_Engineers_feat._Mark_Peters/revision/latest/scale-to-width-down/248?cb=20130620185343", "https://vignette.wikia.nocookie.net/greysanatomy/images/6/66/9x11-2.jpg/revision/latest/scale-to-width-down/209?cb=20130719085059", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/7c/9x11-11.jpg/revision/latest/scale-to-width-down/209?cb=20130719085443", "https://vignette.wikia.nocookie.net/greysanatomy/images/2/25/GA-911-02.jpg/revision/latest/scale-to-width-down/350?cb=20130719083713", "https://vignette.wikia.nocookie.net/greysanatomy/images/8/80/9x11-26.jpg/revision/latest/scale-to-width-down/209?cb=20130719084318", "https://vignette.wikia.nocookie.net/greysanatomy/images/7/77/9X11-3.jpg/revision/latest/scale-to-width-down/209?cb=20130719085129", "https://vignette.wikia.nocookie.net/greysanatomy/images/5/53/Grey%27s_Anatomy_9x11_Promo_%22The_End_Is_the_Beginning_Is_the_End%22_%28HD%29/revision/latest/scale-to-width-down/300?cb=20131116182707"], "top_img": "https://vignette.wikia.nocookie.net/greysanatomy/images/2/25/GA-911-02.jpg/revision/latest?cb=20130719083713", "keywords": [], "authors": [], "canonical_link": "https://greysanatomy.fandom.com/wiki/The_End_is_the_Beginning_is_the_End", "title": "The End is the Beginning is the End", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Grey's Anatomy Universe Wiki,greysanatomy,The End is the Beginning is the End,Things We Said Today,Joan Rater,Cherie Nowlan,Walking on a Dream,Meredith Grey,Season 9 (Grey's Anatomy),Grey's Anatomy,Derek Shepherd,Cristina Yang,Arizona Robbins", "description": "The End is the Beginning is the End is the eleventh episode of the ninth season and the 183rd overall episode of Grey's Anatomy. Meredith, Derek, Cristina, and Arizona receive big news regarding the plane crash lawsuit, Richard avoids Catherine's romantic advances and Jackson takes on one of...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://greysanatomy.fandom.com/wiki/The_End_is_the_Beginning_is_the_End", "title": "The End is the Beginning is the End | Grey's Anatomy Universe Wiki...", "description": "The End is the Beginning is the End is the eleventh episode of the ninth season and the 183rd overall episode of Grey's Anatomy. Meredith, Derek, Cristina, and Arizona receive big news regarding..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Grey's Anatomy Universe Wiki", "title": "The End is the Beginning is the End", "description": "The End is the Beginning is the End is the eleventh episode of the ninth season and the 183rd overall episode of Grey's Anatomy. Meredith, Derek, Cristina, and Arizona receive big news regarding the plane crash lawsuit, Richard avoids Catherine's romantic advances and Jackson takes on one of Mark Sloan's old patients. Meanwhile, Derek begins recovery on his hand.", "url": "https://greysanatomy.fandom.com/wiki/The_End_is_the_Beginning_is_the_End", "image": "https://vignette.wikia.nocookie.net/greysanatomy/images/2/25/GA-911-02.jpg/revision/latest?cb=20130719083713"}, "apple-itunes-app": "app-id=1002364550, app-arguments=https://greysanatomy.fandom.com/wiki/The_End_is_the_Beginning_is_the_End"}, "movies": [], "publish_date": null, "source": "https://greysanatomy.fandom.com", "summary": ""}