{"url": "https://people.com/celebrity/bachelor-ben-higgins-lauren-bushnell-split/", "text": "Ben Higgins and Lauren Bushnell have called it quits.\n\n“It is with heavy hearts that we announce our decision to go our separate ways,” they tell PEOPLE in an exclusive statement. “We feel fortunate for the time we had together, and will remain friends with much love and respect for one another. We wish nothing but the best for each other, and ask for your support and understanding at this time.”\n\nGet push notifications with news, features and more.\n\nThe couple met on Higgins’ season of The Bachelor, which premiered in January 2016. Higgins, 29, ultimately offered his final rose and proposed to Bushnell, 27 — but not without a little controversy after he famously told both finalists — Bushnell and JoJo Fletcher — that he loved them during the Fantasy Suites episode.\n\nNevertheless, the two did their best to overcome their issues together and Bushnell moved to Higgins’ hometown of Denver shortly after going public with their engagement following the season finale, which aired in March.\n\nOf Higgins declaration of love to both women, Bushnell told PEOPLE exclusively at the time that “post-filming was more of an emotional roller coaster than the actual show.”\n\n“I fall more in love with Ben every day and it’s hard to separate what happened long ago and my current feelings,” she said. “It’s confusing. It does wear on me.”\n\n“It hurts,” she added. “It’s like, why did I have to go through that hurt? It’s already a few months of confusion and tears and then to have to deal with it again. It’s hard.”\n\nHiggins, meanwhile, told PEOPLE he couldn’t apologize “for being honest or expressing what I thought was the best thing to express at the time.”\n\n“Don’t get us wrong. Throughout this whole show airing and conversations we’ve had about decisions and life, it hasn’t always been easy,” he continued. “But it’s added a whole new level to our relationship. And [the show ultimately] led me to this woman who I love deeply. She’s the only woman I’ll love from now on.”\n\nFROM PEN: Christina and Tarek El Moussa’s Divorce Has Not Stopped Their Business Relationship\n\nSix months later, Higgins and Bushnell returned to the small screen for one season of their Freeform reality show Ben and Lauren: Happily Ever After?\n\nAhead of the premiere, the two revealed exclusively to PEOPLE in October that they were undergoing couples counseling at their church: “We’re not the perfect couple,” Higgins said. “Far from it! But we are trying really hard and we love each other a lot.”\n\n“There are so many weird elements to being in a relationship after The Bachelor,” said Bushnell. “We’ve gotten in arguments like any other couple, but about some things that other couples wouldn’t have to fight about, like the fact that we met when he was dating other women. You can say that’s what I signed up for, but it’s still real life and it’s still hard.”\n\nAnd overcoming trust issues that lingered after the Fletcher drama wasn’t easy, either.\n\n“For a long time, I was really angry for being blindsided,” said Bushnell. “And that resentment and anger affected our relationship much longer than it should have.”\n\nUltimately, the two always maintained they were “not in any rush” to tie the knot.\n\n“We’re both ready to get married, but we haven’t set a date because we want to make sure we’re not doing it for anyone but ourselves,” said Bushnell.\n\n“We just want to do it on our own terms,” added Higgins. “I just want to look over at Lauren and know that she is completely filled with joy in that moment. … Love is what life is all about.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fben-lauren-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fben-lauren-1.jpg", "keywords": [], "authors": ["Christina Dugan", "Aurelie Corinthios"], "canonical_link": "https://people.com/celebrity/bachelor-ben-higgins-lauren-bushnell-split/", "title": "Ben Higgins and Lauren Bushnell Split: Bachelor Couple Breaks Off Engagement", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ben Higgins,Breakups,Couples,Exclusive,Lauren Bushnell,News,The Bachelor,TV", "news_keywords": "Ben Higgins,Breakups,Couples,Exclusive,Lauren Bushnell,News,The Bachelor,TV", "description": "Higgins and Bushnell got engaged on the season 20 finale of The Bachelor in March 2016", "og": {"title": "Ben Higgins and Lauren Bushnell Split: Bachelor Couple Breaks Off Engagement", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/bachelor-ben-higgins-lauren-bushnell-split/", "description": "Ben Higgins and Lauren Bushnell have called it quits. “It is with heavy hearts that we announce our decision to go our separate ways,” they&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fben-lauren-1.jpg", "width": 1800, "height": 942}}, "pinterest": {"url": "https://people.com/celebrity/bachelor-ben-higgins-lauren-bushnell-split/", "description": "Higgins and Bushnell got engaged on the season 20 finale of The Bachelor in March 2016", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fben-lauren-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/bachelor-ben-higgins-lauren-bushnell-split/", "title": "Ben Higgins and Lauren Bushnell Split: Bachelor Couple Breaks Off Engagement", "description": "Higgins and Bushnell got engaged on the season 20 finale of The Bachelor in March 2016", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fben-lauren-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}