{"url": "https://www.romper.com/p/why-did-ben-higgins-lauren-bushnell-break-up-the-bachelor-couple-join-the-ranks-of-those-who-didnt-make-it-8212751", "text": "The Bachelor Winter Games kicks off during the 2018 PyeongChang Winter Olympics and the franchise's first winter sports-themed spinoff promises lots of chalet make-outs, ski hill wipeouts, and, well, crying. Among The Bachelor/Bachelorette alums competing for Team USA is Ben Higgins, who proposed to Lauren Bushnell at the end of his season in 2015. And since all contestants on Winter Games are single and purportedly ready to mingle, viewers may be wondering: why did Ben Higgins and Lauren Bushnell break up? Despite landing the very first Bachelor couple spinoff series, Ben and Lauren: Happily Ever After?, on Freeform, Ben and Lauren didn't do well under the pressure of the spotlight.\n\nAfter the March 2015 finale of Ben's season, Lauren, who worked as a flight attendant, moved to Denver to be with him. Their Freeform series premiered six months later, but Lauren eventually admitted that it took her months to get over the surprise of Ben also telling JoJo Fletcher that he loved her during Fantasy Suites, which Lauren didn't learn about until watching the season finale in real time with everyone else.\n\n\"Post-filming was more of an emotional roller coaster than the actual show,\" Lauren told People. \"For a long time, I was really angry for being blindsided. And that resentment and anger affected our relationship much longer than it should have.\"\n\nBob Levey/Getty Images Entertainment/Getty Images\n\nIt's understandably tough to go through weeks of your engagement not knowing that the guy who proposed to you also professed his love to someone else the same week. Ben also cited the onslaught of outside pressure on their relationship as a reason for its failure. According to E! News, Ben said during an On Air With Ryan Seacrest interview:\n\nI think there's a lot of pressure coming on this show. I've told any Bachelor/Bachelorette that came after me, just try to stay yourself but it's really difficult. You have a lot of people looking over your shoulder. There's a ton of criticism and judgment no matter what you do — good or bad — or if you have the most pure heart or not. People are going to take it the wrong way and honestly, Lauren and I both agreed it does pull on you a lot and it isn't exactly healthy for a foundation for a relationship.\n\nDespite attending couple's counseling together at Ben's church, they just couldn't make it work and split up in May of 2017.\n\nBachelor Nation on ABC on YouTube\n\nIt definitely seems a little soon for Ben to be getting back in the saddle on another Bachelor franchise show, especially after openly admitting that this particular setup for a relationship isn't healthy for him. Interestingly, just before he and Lauren broke up, Ben landed a gig hosting an iHeart Radio show with Ashley Iaconetti, sparking rumors that the pair might be romantically interested in each other. (Ben quickly put those rumors to bed, for what it's worth.) But Ashley is a fellow contestant on The Bachelor Winter Games, so could they possibly be a couple the show expects us to root for?\n\nBen was also something of a baby Bachelor, stepping into the role at just 26 years old. It's possible that he'll have an easier time now, at a comparatively older and wiser 29. We do find him sobbing in one clip during the trailer, so maybe he really does find love (and heartbreak) yet again.\n\nThe four-episode special airs Tuesdays and Thursdays during the Olympics, in addition to Arie Luyendyk Jr.'s regularly scheduled episodes of The Bachelor.\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.romper.com/uploads/getty/2018/2/13/bfbadd3a-e993-4294-961b-26c939cca21a-getty-526745504.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/cb6437c7-ee86-4c0e-adde-5e1d1e122838-screen-shot-2020-04-16-at-111001-am.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/16/2f761a69-d2b0-4c45-9d35-44f6e18e5a5d-workin-moms.PNG?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/2/13/18996b55-1091-4716-bf84-fe79a541e433-getty-609998992.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/2/13/18996b55-1091-4716-bf84-fe79a541e433-getty-609998992.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/38c22f04-cb0f-4840-9f0a-72fb7ed63faa-screen-shot-2020-04-16-at-95314-am.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/2/13/18996b55-1091-4716-bf84-fe79a541e433-getty-609998992.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/why-did-ben-higgins-lauren-bushnell-break-up-the-bachelor-couple-join-the-ranks-of-those-who-didnt-make-it-8212751", "title": "Why Did Ben Higgins & Lauren Bushnell Break Up? 'The Bachelor' Couple Join The Ranks Of Those Who Didn't Make It", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/why-did-ben-higgins-lauren-bushnell-break-up-the-bachelor-couple-join-the-ranks-of-those-who-didnt-make-it-8212751", "type": "article", "title": "Here's Why Things Didn't Work Out Between Ben Higgins & Lauren Bushnell On 'The Bachelor'", "description": "The Bachelor Winter Games kicks off during the 2018 PyeongChang Winter Olympics and the franchise's first winter sports-themed spinoff promises lots of chalet make-outs, ski hill wipeouts, and, well, crying. Among The Bachelor/Bachelorette alums…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/2/13/18996b55-1091-4716-bf84-fe79a541e433-getty-609998992.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "The Bachelor Winter Games kicks off during the 2018 PyeongChang Winter Olympics and the franchise's first winter sports-themed spinoff promises lots of chalet make-outs, ski hill wipeouts, and, well, crying. Among The Bachelor/Bachelorette alums…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}