{"url": "https://scandal.fandom.com/wiki/Scandal_Press", "text": "Scandal press\n\n\n\n\n\n\n\nThe cast and Crew of Scandal often give interviews with the Newspapers and Magazines to promote the series. We've collected some available videos of these interviews for your viewing pleasure!\n\n2013\n\n(26/04/12) Tony Goldwyn - Collider\n\nHow did you originally come to be a part of this show? Was it something that Shonda Rhimes approached you about because of your previous working relationship?\n\n\"Yeah, I think so. I just got a call that she was interested in me doing this. I love Shonda and have so much respect for her, and really love the creative process of working for her, as a director. Then, when I heard Kerry Washington was involved – and I’ve just been so impressed with her work, in everything she’s done, and know her socially and admire her a lot – the combination of Shonda and Kerry was overwhelming. And then, when she said she wanted me to play the President of the United States, I thought, “With Shonda Rhimes writing, that’s going to be an interesting president.” It sounded like a good bet to say yes to.\"\n\nWhen you got a chance to read the pilot, what was your first reaction to the story and character and the way that it was written?\n\n\"Well, I really loved the final scene in the Oval Office between Fitz and Olivia because I knew that there was going to be so much more to this than what it appeared to be. I’m always perversely attracted to characters that seem one thing, but are ultimately revealed as another, and I knew, the way Shonda writes, that that’s how it would turn out. In a different writer’s hands, it actually would have made me nervous because I would have thought, “Oh, god, I’m going to be the philandering president, and that’s the role,” which is fine, but not necessarily something you want to be doing forever, in a television series. But, with Shonda, I knew that all of her characters are always full of contrasts and surprises, and she described to me what her intentions were for Fitz, as the show went on. I just found putting a character in a moral quandary like that really great. When you see the rest of the first season, Fitz is just full of surprises, which makes it really exciting, as an actor.\"\n\nAdd an image\n\n2014\n\n(09/18/14) Tony Goldwyn - Vulture\n\nWhat are the top three rides on the Olivia and Fitz emotional roller coaster? Their relationship is interesting, but obviously complicated.\n\n\"Did you say the top three rides on the Olivia and Fitz emotional roller coaster? [Laughs.] I guess I feel like Liv and Fitz are the victims of circumstance. Their situation is impossible. I think from Fitz’s perspective, it’s absolutely a sustainable relationship if Olivia would just accept that and commit, but for various reasons, she runs for the hills every time that comes to pass.\"\n\nDo you think their relationship is sustainable?\n\n\"This is one of those relationships that seems like an addiction to chaos. But I can’t play this character and think that, because every time Fitz and Olivia are in each other’s orbit there’s this unavoidable magnetic pull between them, and that’s just the way it is. I put a lot of stock in their attraction being way beyond a sexual attraction, and it’s a pretty rare thing.\"\n\nAdd an image\n\n\n\n\n\n(11/21/14) Tony Goldwyn - TV Guide\n\nShe's gone again! Where in the world is Olivia Pope?\n\n\"Your guess is as good as mine. I don't think she's on an island. That's the good and bad news, but I don't know. ... It's definitely all hands on deck to find her [when the show returns], but I can't tell you where we leave here. That's a really great surprise.\"\n\nWhat are Andrew's terms? Declare war on West Angola and he'll return Olivia? It can't be that black and white.\n\nGoldwyn: That's what he says: \"If we go to war...\" There's obviously some right-wing Republican plot to take down Fitz and support Andrew. And he's accomplished what he did with some major power players. I have no idea who's behind Andrew. I'm speaking as an audience member here because I honestly don't know. A man who is vice president couldn't do this on his own. The whole scene was kind of a shock to me. I was kind of shocked actually at how dark Andrew went. I did not see that coming. Obviously I have my issues with Andrew, but I was very surprised that he turned out to be part of something so Machiavellian.\n\nWould Fitz really declare war just to get Olivia back? She really would be Helen of Troy then.\n\nGoldwyn: That's a really tough call. Fitz was already considering going to war. He doesn't know yet that Quinn and Huck discovered that the whole bombing was faked. As far as he knows, we were still attacked on our own soil. He might. I think it would go against everything in his being to declare war. If it is an unnecessary war, that's a real Sophie's Choice. If what Andrew says it's true and he'd get Olivia back, that's a tough one. ... It depends on how much danger Olivia is in. I honestly don't know how far he'd go. Olivia's life is at stake. But do you sacrifice the person you love for the benefit of the greater good? That's the territory we're headed into in the second half of the season. It's this very big, impossible choice. It's going to get even messier as if it's not messy now.\n\nAdd an image\n\n2015\n\n(01/28/15) Scott Foley - TV Guide\n\nScott Foley has the same question you do: Why the hell did it take Jake so long to get that blanket?\n\n\"So long! Man, he went back, I think he had to take his clothes off. He got the stuff. I think it took him 20 seconds, maybe 30. That's a long time. You'd think he'd hurry it up.\"\n\nWhen Scandal returns Thursday (10/9c, ABC), viewers will see exactly how the ninja-like kidnapping went down from Olivia's perspective and, as previously reported, we'll also find out who took her -- someone we haven't yet met. Though Andrew and Liz are behind Liv's abduction, the conspiracy will expand beyond their West Angola war scheme.\n\n\"This gets much more complicated. Without telling you what happens, it takes a turn that even Andrew could never have expected, I've been in this business a long time, I've read a bunch of scripts ... and these writers have a way of putting my jaw on the floor. I'm constantly amazed, not just by how much story they're able to cram into every episode, but by the way in which they do it -- the boundaries that they push and everything. I did not see this coming. It's not necessarily shocking, but it's a very smart play. I think that's what makes the show legitimate. There's a lot of things we do where you're like, 'Oh, that's just ridiculous.' But then you realize, 'Oh, my God, that makes sense!'\"\n\nAdd an image\n\n\n\n\n\n(01/29/15) Lyn Paolo - ET Online\n\n→ Read the full interview at ET Online Interview with Lyn Paolo January 29, 2015\n\nWho or what is your inspiration for dressing Olivia Pope?\n\n\"Gosh there were so many variables early on in the process of creating the image of OP, but honestly the words that Shonda Rhimes put on the page ARE the real inspiration for Olivia.\"\n\nDo you base any of Olivia's wardrobe on her mood or what's happening on the show?\n\nAbsolutely. The challenge now is not to foreshadow events too soon within the story as our Gladiators have become so good at spotting what the costumes are reflecting ... If Mellie is in green they instantly assume there is going to be a scene with Fitz and Olivia, or if Olivia is in something dark our fans start tweeting with a lot of OMG's.\n\nAdd an image\n\n\n\n\n\n(02/13/15) Portia de Rossi - The Wall Street Journal\n\nYou’ve said before that you were a huge fan of the show before being cast. What’s the experience like being on the show as a fan?\n\n\"I have to remember sometimes to not be a fan and be a supportive and present cast member, or guest cast, I should say. I really do kind of wake myself up out of this TV stupor that we all get when we watch our favorite shows. And then I’m like, “Oh, God! I’m working!” So it’s pretty surreal and pretty exciting and I’ve been a part of the show for the entire season and it still hasn’t worn off. It’s just as exciting as the first episode for me. I feel pretty lucky.\"\n\nHer nickname is Lizzie Bear. Do you have a personal back story for how that name came about?\n\nI think it was to suggest familiarity between her and Cyrus. They had a past and a history. In my first episode he explains that RNC chair people come and go so quickly, he can’t remember their names so he made a nickname for me, which of course annoys me to no end. I think it made their relationship a lot more colorful, his nickname for me. I don’t know if that comes through, but I just love that character [of Cyrus] so much. Jeff Perry, I love him so much that I like to think he and Lizzie actually really admire each other and truly like each other deep down. I just can’t help but enjoy every scene that I’m in with him. I find that I can revel in it. I’m sure that comes across. I hope that translates that we have a lot of mutual respect and a lot of history.\"\n\nAdd an image\n\n\n\n\n\n(02/19/15) Portia de Rossi - Elle Magazine\n\nIt must be fun to do press where you just get to talk about Scandal\n\n\"It really is! And I'm so glad to talk about it because I don't get to talk to Ellen or my friends about it as I'm shooting it. At least it's nice to talk in a general sense now. That's the worst part of this job, actually—you want to tell your spouse and your friends what's going on at work and when they're fans of the shows and they'd love to know, it's hard to not say anything.\"\n\nThat image of your back after your character got tortured was so horrifying\n\n\"It really was, wasn't it? We've seen Huck torture people in the past, but just seeing the result of the torture was somehow just as squeamish as seeing him actually do it. It was horrible even reading it on the page because the stage direction said it was a wound made by a cheese grater. That's a level of sick we haven't really seen from Huck in the past. But it was sure fun though. That whole storyline has been really fun to play.\n\nIs everything fun to say to Olivia Pope?\n\nIt is! Because Kerry [Washington] is such an amazing actress and she's so fun to work with. I love doing scenes with her.\"\n\nAdd an image\n\n\n\n\n\n(03/04/15) Bellamy Young - TV Guide\n\nFive months ago, Scandal's Mellie was Smelly Mellie -- inconsolably grieving her son, living in robes and Uggs, subsiding on fried chicken and vodka, and serving some 1970s realness. Now? She might be the next president of the United States.\n\n\n\n\"I never could've imagined when the season started that we would go down this path, that's the glory of Shonda Rhimes and our wonderful writers. But I think we needed her [grieving]. It was honest in a way she's never been. She usually put protocol above everything. I think that was a real breakthrough moment for her. She was just honest. I think that allowed her to go on the balcony and tell Fitz, 'I wanna be president of the United States. I wanna run the world.' That sort of honesty couldn't have happened without being forged in that horrible pain and fire\"\n\nNow that he's started his second term, Young says it's time for Mellie to plot her future -- not the least of which because her part-time evil lover, VP Andrew Nichols, told her two weeks ago that if he can't be POTUS, he'll see to it that she can't either. But that only spurred Mellie to recruit Elizabeth North to recruit Huck to drug Andrew, inducing a stroke.\n\n\"The thing with Andrew just shows what she's capable of,\" Young says. \"She sees the next move on her chess board and embraces it. She feels she's paid her dues, is able and is certainly willing and definitely ready in her own mind. She has always been doing the right thing, being the partner to the person in charge and waiting for her moment to come after his term, and she can have her political life. She's trying to get Fitz to be the partner to her as she's always been to him, which in her mind is a fair request. I think that's definitely a very familiar thought to women. It's a visceral truth to millions of women out there. I've tacitly put in my time by your side and I thought the agreement was now it would be my turn. It doesn't always turn out that way, but sometimes it does. I think Mellie is hoping it does.\"\n\nAdd an image\n\n\n\n\n\n(05/13/15) Bellamy Young - Hollywood Reporter\n\nBut what does Rowan want with the first lady, who was revealed to be Operation Foxtail?\n\n\"He wants her to be a pawn in his enormous and ever-growing army because Rowan's currency is power and once he has Mellie in his pocket, he has both access and ability in ways he hasn't had before, which you wouldn't think,\" Young tells The Hollywood Reporter. \"You'd think he has all he needs, but he's a 'more is more' kind of guy.\"\n\nThe actress — whose character was originally only supposed to be in a handful of episodes in season one before Shonda Rhimes fully developed her — sees Mellie's story as apropos of politics.\n\n\"Mellie's a little lamb wandering into the slaughterhouse, like skipping merrily and chatting on the phone,\" Young says with a laugh. \"She has no idea what she's getting herself into. This is such an apt metaphor because politics is so often like that. You really don't know who you are getting in bed with and you're just happy to have the currency to move forward with your political life — but all at what cost?\"\n\nAdd an image\n\n\n\n\n\n(05/14/15) Portia de Rossi - Hollywood Reporter\n\nWorth noting: The actress, whose credits include ABC's Better Off Ted and Netflix's Arrested Development revival, was a Scandal super-fan with wife Ellen DeGeneres before joining the series.\n\n\"I think Elizabeth's end game is that she wants what is best for her country, she is a patriot. She is careful. She really cares about her party, keeping her party together and she believes that she's doing the right thing. That's what makes her such a complex character — she genuinely believes that even if she has to play a little dirty, it's worth it for the end goal, for the overall betterment of the country.\"\n\nAdd an image\n\n\n\n\n\n(05/14/15) Portia de Rossi - TV Line\n\nIn an exclusive interview with TVLine, the actress justifies her character’s brazen power play, reveals the surprising way she found out about the season-ending twist and shares how she went about breaking the news to real-life wife (and self-proclaimed Scandal spoilerphobe) Ellen DeGeneres.\n\nTVLINE | Congrats on the promotion, on screen and off.\n\nNew. Chief. Of. Staff. Bitches.\n\nTVLINE | Ha!\n\nIt’s so exciting to finally talk about the finale because I haven’t been able to tell anybody anything\n\nTVLINE | How long have you known that Liz would be the new Chief of Staff? Not long. We got the [first] draft [of the finale script] and it wasn’t in there. I think it was in the second or third [batch] of revisions. So it was only three days before I shot it that I knew what was going to happen. And it’s funny because when the rest of the cast read it they came up to me one-by-one and were like, “Oh my God, this is so incredible for you!” I was in the makeup [room] with Darby [Stanchfield] and she turned my chair around and said, “I have to look you in the eyes to talk about this with you. How great does it feel that you’re the new Chief of Staff?”\n\nAdd an image\n\n\n\n\n\n(08/18/15) Bellamy Young - TV Line\n\nReflecting on the quicksilver series of unfortunate events that found her ambitious alter ego getting ejected from the White House she called home.\n\n“That season finale pulled the rug out from under everyone, so I think everybody was pretty happy that we were starting back immediately after and getting to go into those moments” versus gloss over them via a time jump, says the actress. “It was a relief.”\n\n“If she didn’t love him (Fitz), that would be the better plan, She hates herself for loving him, but she loves him! Oh, her life would be so much simpler if she didn’t! But she does.”\n\nAdd an image\n\n\n\n\n\n(08/19/15) Joe Morton - The Root\n\nTR: So let’s talk Daddy Pope. How did that come about?\n\n\"I was in [Los Angeles] for pilot season, and I had not yet seen Scandal. I knew about Kerry Washington and knew about the show but hadn’t seen it. Sat down with my computer and was watching it on Netflix. Loved it. Loved everything about it. Loved the writing, the directing, the way it’s shot, loved the dialogue. I loved Jeff Perry [Cyrus Beene] because he had all these wonderful monologues, and I literally thought, “I wonder if there’s a way that I can find my way onto this show. But before I had an opportunity to even talk to my agents or my manager about it, I got a call from my agents actually saying we just got a call from ABC: “They’re interested in you coming on in a recurring role on Scandal.” One of the producers called me and said, “Yes, we would love for you to come on, but if you do, there is a secret that you have to keep, and you can’t tell anyone.” And he went on to explain that the secret was that at the end of the second season, the very last script, the very last two lines of the script, would reveal me as Olivia’s father. And I said I’d do it, and so the secret was that I was going to be revealed, and no one else knew. Kerry did not know. Some of the other directors did not know.\"\n\nAdd an image\n\n\n\n\n\n(11/05/15) TV Line - Joshua Malina\n\nTVLINE | Are David and Elizabeth Scandal‘s next great super couple?\n\nI don’t know if they qualify as a super couple. [Laughs] I don’t think we will replace ‘Olitiz’ in the hearts of viewers worldwide. They’re more along the lines of strange bedfellows.\n\n'TVLINE | When and how did you find out that these two characters were going to hook up?\n\nAlthough I guess she was essentially just warning Portia. [Laughs] “You’re going to have to kiss Josh, and you’re going to need a couple of weeks to process this and prepare yourself.”\n\nAdd an image\n\n2016\n\n(10/03/16) Entertainment Weekly - Lyn Paolo\n\nEntertainment Weekly: I’ve always loved how Olivia’s wardrobe is a reflection of what she’s thinking and feeling, which is why I was so intrigued by all the color we’ve been seeing since the midseason break.\n\nFor the longest time, I was saying to Kerry in the room, “Gosh, if only we had a reason for her to be different.” What could be traumatic enough? Finding out that her mother was alive didn’t do it, being kidnapped didn’t do it, her PTSD, everything she’s struggling with — and it was great because Shonda [Rhimes] reached out to me towards the end of the season and said to me, “So, something is going to happen here [and] the audience is probably not going to be madly in love with us for a while. But it’s going to be big, and how should we reflect that?” And I brought her a bunch of images of these bright, vibrant oranges and reds and I did another board that was mid-colors and another one that was what we do now, sort of like, these are where we could go, and she said, “I want you to go for it.”\n\nAdd an image\n\n\n\n\n\n(05/12/16) Variety - Lyn Paolo\n\nSo, I’m a huge fan of Scandal. But before we get to that, would you be able to explain the difference between a costume designer and a wardrobe stylist?\n\nI’m a huge fan of Scandal too! So, I’ve done both—and I still do both. When you’re a stylist and you’re styling a still shoot or a client, you’re interpreting what would look best on them and helping them to find their way forward to present an exterior of that person. To present an image. And I love that because you’re often dealing with really high fashion people.\n\nSince working on Scandal, what’s been your most favorite costume design moment?\n\nOh boy, that’s almost impossible to answer! Well I love the first episode of this season because it was so challenging. We had a royal family in that and the princess and there were so many layers to that story—there always is with Shonda. Being English, it was fun to do all the research on all the royal families around the world\n\nI noticed—and I could be wrong—but it seems like Olivia is wearing more red this season?\n\nYeah well we made the transition in the mid-season break this year. Because Olivia is basically suffering from PTSD and is walking away from the man she loves—is leaving Fitz—and is just becoming stronger, Shonda and Kerry and I were talking for a long time about making a change in the Olivia Pope palette. But we all felt strongly that there had to be a reason for the change, and the Christmas episode, where she walks out of the West Wing and decides to be her own person, [was a pivotal moment].\n\nAdd an image\n\n2017\n\n(04/13/17) Tony Goldwyn Reveals 3 Reasons Why 'Scandal' Cast Is So Damn Great\n\nDuring an interview with TooFab for the series' 100th episode, the actor revealed the secret to the cast's success -- attributing a big part to the leadership of their captain, Kerry Washington.\n\nReason No. 1 \"No. 1 it's the culture that Shonda and Betsy have created with our show. I think in Shondaland in general, it is a family environment. There’s an understanding culturally that with a healthy familial environment where there's interpersonal relationships and respect for all, it creates a better creative and working environment. That sort of culture that’s something that’s understood and maybe more simply put: a no assholes policy. That’s something that from the very start was just clear.\"\n\nAdd an image\n\n\n\n\n\n(04/20/17) Portia De Rossi, Shonda Rhimes React to Major Death - Variety\n\nPortia De Rossi’s character Elizabeth North was killed off in Thursday night’s episode. The actress made the decision to depart the show.\n\n“I am incredibly grateful for my time here at Scandal, I will miss playing Elizabeth North but I’ve made the decision to focus on a business opportunity. Shonda, Betsy and the cast have been incredibly supportive of my decision. I will always love my Scandal family. I’ll be watching!”\n\nCreator Shonda Rhimes added\n\n“I have been a fan of Portia’s for years and it was an honor to have her join our Scandal family. Portia infused Liz North with a smart powerful vulnerable soul while also making the humor sing — and that brought all of us in the writers room a lot of joy. If I could keep her forever, I would — but kidnapping is illegal. Besides, I am incredibly impressed with the vision she has for her creative future. I wish her all the best.”\n\nAdd an image\n\n\n\n\n\n(05/16/17) 'Scandal': Why ABC (and Shonda Rhimes) Decided Season 7 Was the End\n\nChanning Dungey, entertainment president at ABC, noted that Rhimes always envisioned seven seasons for the fast-paced Washington, D.C.-set soap'\n\n\"I had conversions with Shonda Rhimes where she has had for a while a sense of how she wanted the story to end, she said, 'Look, I really feel like season seven is where I want to wrap up this story, because I always prefer to end a show where you're feeling on top as opposed to letting things fizzle out. I do think that audiences, especially fans and Gladiators, who are as loyal to Scandal as they have been, are going to want the story to end in the way that Shonda intended to, that was a decision she felt really good about, and we support wholeheartedly.\"\n\nShonda Rhimes on Scandal's final season\n\n\"Deciding how to end a show is easy, deciding when to finish is quite simple when the end date is years away. But actually going through with it? Actually standing up to say: 'This is it?' Not so much. So, next year we are going all out. Leaving nothing on the table. Creating this world in celebration. We are going to handle the end the way we like to handle the important things in our Scandal family: all together, white hats on, Gladiators running full speed over a cliff.\"\n\nAdd an image\n\n(05/19/17) Bellamy Young on Olivia Pope's Big Move - Yahoo!\n\nWere you worried going into the finale that Mellie was going to die?\n\n\"Always! Every table read, everyone’s terrified! I never for a second took for granted that Mellie would get to be president. I don’t take for granted that I’ll be president when we come back for next season! In Shondaland, you just never know. What I do know, and what we all do know, is that we’re grateful for that. Surprise is possibly the greatest gift of the job. And we trust our writers, so whatever they think up is always so brilliant and shocking and relevant and galvanizing.\"\n\nHow did you react to the news that Season 7 is Scandal‘s last season?\n\nOh, you know, we’re gutted, because we really are a family. Even in our time apart on hiatuses, we’re bereft. To think of not going on an adventure that’s deeply wonderful all the time every day — it’s just gutting. But we’ve always known that Shonda [Rhimes] knows where it ends. We could feel it was getting to be that time. I don’t think anyone was shocked, just sad. But we know how lucky we are to have one more year. We’re going to find out where it all ends. Season 7 is going to be epic and unimaginably crazy. We’re going to go out on a high, in style.\"\n\nAdd an image\n\n\n\n\n\n(10/05/17) Scandal Cast on Scandal's Final Season - E! News\n\nForget the power struggle in Washington. When Scandal returns for its seventh and final season, that fight will give way to something much bigger: The fight for Olivia Pope's soul.\n\n\"Where we meet Olivia this season, she's 100 days into Mellie's presidency and she's kind of in the place she always dreamed of being. It's beyond her wildest dreams, she's Chief of Staff to the President and she's the head of B613. So we get to see how well she navigates all that power because, you know, power doesn't change you, but it does reveal who you really are.\" Kerry Washington\n\n\"I think it's a real existential year for Olivia Pope, trying to figure out if her soul is for the good or if it is for the evil, we'll see how that battle goes.\" Bellamy Young\n\nAdd an image\n\n\n\n\n\n(11/20/17) Lyn Paolo Hopes Olivia Pope's Fashion Has Empowered Women - Life & Style\n\n\"I hope her fashion has empowered women to dress the way they want to dress in the world and not the way we're told we should dress,\" Lyn told Life & Style exclusively. \"I hope she has inspired people, women and men, to find their own self in their clothing, and not just conform. Because, you know, I have people who write to me and say, 'I dressed like Olivia and got the job.' I hope there's a group of young women out there who are more considered in how they dress going out into the world.\"\n\nAdd an image\n\n2018\n\n(03/09/18) Kerry Washington takes the director's chair on 'Scandal' - LA Times\n\nWhen mega producer Shonda Rhimes— such a proponent of saying \"yes\" to new experiences that she wrote a book on it — asks if you want to direct one of the final episodes of a groundbreaking TV series, there's really only one suitable answer.\n\n\"I used to never watch anything that I was in, I could barely watch through my fingers. But I've had to build the muscle of being able to watch myself — and see where improvements could be made.\" (For extra measure, Washington said she leaned on the show's cinematographer, Oliver Bokelberg, and — on days when she was acting in a lot of scenes — her acting coach.)\"", "images": ["https://vignette.wikia.nocookie.net/scandal/images/6/62/7x10_-_Kerry_Washington_and_Crew_01.jpg/revision/latest/scale-to-width-down/600?cb=20180127020233", "https://vignette.wikia.nocookie.net/scandal/images/7/70/Lyn_Paolo_-_Milk_Studios_BTS.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20160708081521", "https://vignette.wikia.nocookie.net/scandal/images/b/ba/4x17_-_Elizabeth_North_03.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150318145106", "https://vignette.wikia.nocookie.net/scandal/images/e/ee/2015_LA_Times_-_Portia_de_Rossi_1.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150522130202", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/scandal/images/0/01/4x21_-_Elizabeth_North_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20180410025346", "https://vignette.wikia.nocookie.net/scandal/images/1/1e/1x01_-_Tony_Goldwyn_01.jpg/revision/latest?cb=20110915063902", "https://vignette.wikia.nocookie.net/scandal/images/1/18/4x22_-_Rowan_03.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20161222140026", "https://vignette.wikia.nocookie.net/scandal/images/6/6e/4x11_-_Jake_Ballard_03.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150304214108", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://vignette.wikia.nocookie.net/scandal/images/5/5b/4x09_-_Rowan_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20180418122503", "https://vignette.wikia.nocookie.net/scandal/images/0/02/1x01_-_Fitz_Grant_and_Olivia_Pope_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20110915035106", "https://vignette.wikia.nocookie.net/xavier-riddle-and-the-secret-museum/images/9/97/N2losLW-asset-kids-mezzanine1-16x9-N70Tdc3.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190910004306", "https://vignette.wikia.nocookie.net/scandal/images/0/0a/Lyn_Paolo.jpg/revision/latest/zoom-crop/width/320/height/320?cb=20150404150717", "https://vignette.wikia.nocookie.net/scandal/images/7/70/7x01_-_Cyruse_Beene_and_Mellie_Grant_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170918201743", "https://vignette.wikia.nocookie.net/scandal/images/5/56/2014_The_Limited_Launch_-_Lyn_and_Kerry_2.jpg/revision/latest/top-crop/width/320/height/320?cb=20151214144315", "https://vignette.wikia.nocookie.net/scandal/images/4/4c/4x11_-_Jake_Ballard_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150206193603", "https://vignette.wikia.nocookie.net/scandal/images/7/7b/Lyn_Paolo_-_Costume_Designer.png/revision/latest/zoom-crop/width/320/height/320?cb=20150404150706", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://vignette.wikia.nocookie.net/scandal/images/c/c0/6x11_-_Elizabeth_North_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170527215152", "https://vignette.wikia.nocookie.net/scandal/images/7/7e/4x22_-_Fitz_and_Olivia_06.png/revision/latest/zoom-crop/width/480/height/480?cb=20150612164710", "https://vignette.wikia.nocookie.net/scandal/images/3/33/2017_Vulture_Festival_Portraits_-_Tony_Goldwyn_01.jpg/revision/latest/top-crop/width/480/height/480?cb=20171120185113", "https://vignette.wikia.nocookie.net/scandal/images/8/89/Wiki-wordmark.png/revision/latest?cb=20171022220545", "https://vignette.wikia.nocookie.net/scandal/images/e/e4/7x11_-_Olivia_Pope_06.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20180210054558", "https://vignette.wikia.nocookie.net/scandal/images/6/60/7x01_-_Oval_Office_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170918201746", "https://vignette.wikia.nocookie.net/scandal/images/6/61/2014_Academy_Awards_-_Portia_and_Ellen_03.jpg/revision/latest/top-crop/width/480/height/480?cb=20150222160113", "https://vignette.wikia.nocookie.net/scandal/images/c/c5/4x09_-_Olivia_Pope_and_Jake_Ballard_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20141120193231", "https://vignette.wikia.nocookie.net/scandal/images/9/9d/4x14_-_Mellie_Grant_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150218193557", "https://vignette.wikia.nocookie.net/scandal/images/6/62/7x01_-_Mellie_Grant_and_Olivia_Pope_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170930042428", "https://vignette.wikia.nocookie.net/scandal/images/9/9b/4x01_-_Elizabeth_North_01.jpg/revision/latest/top-crop/width/480/height/480?cb=20141105230405", "https://vignette.wikia.nocookie.net/scandal/images/4/4c/4x14_-_Mellie_Grant_and_Susan_Ross_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150218193559", "https://vignette.wikia.nocookie.net/scandal/images/d/df/5x07_-_David_Rosen_and_Lizzie_Bear.png/revision/latest/zoom-crop/width/480/height/480?cb=20151107150131", "https://vignette.wikia.nocookie.net/scandal/images/7/72/2015_Style_Makers_Awards_-_Kerry_and_Lyn.jpg/revision/latest/top-crop/width/320/height/320?cb=20151214144316", "https://vignette.wikia.nocookie.net/scandal/images/2/24/6x16_Olivia_Pope.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170519153109", "https://vignette.wikia.nocookie.net/scandal/images/f/f2/Lyn_Paolo_-_Kerry_Washington_Closet.jpg/revision/latest/zoom-crop/width/320/height/320?cb=20150406103707", "https://vignette.wikia.nocookie.net/scandal/images/d/d5/Lyn_and_Scandal_Cast.jpg/revision/latest/zoom-crop/width/320/height/320?cb=20151214144316", "https://vignette.wikia.nocookie.net/scandal/images/e/e9/4x21_-_Mellie_Grant_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150416230632", "https://vignette.wikia.nocookie.net/scandal/images/a/ad/4x21_-_Mellie_Grant_05.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150416230632", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/scandal/images/0/08/2017_Vulture_Festival_-_Tony_Goldwyn_03.jpg/revision/latest/top-crop/width/480/height/480?cb=20171120112253", "https://vignette.wikia.nocookie.net/scandal/images/e/ed/Scandal_Season_One_-_Promo_01.jpeg/revision/latest?cb=20120830235131", "https://vignette.wikia.nocookie.net/scandal/images/a/aa/5x15_-_Olivia_Pope_01.jpg/revision/latest/top-crop/width/480/height/480?cb=20160311200558", "https://vignette.wikia.nocookie.net/scandal/images/6/64/4x17_-_Olivia_Pope_and_Elizabeth_North_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150329135853", "https://vignette.wikia.nocookie.net/scandal/images/4/46/6x11_-_Elizabeth_North_and_Mellie_Grant_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170430104156", "https://vignette.wikia.nocookie.net/scandal/images/4/41/2014_Academy_Awards_-_Portia_and_Ellen_02.jpeg/revision/latest/top-crop/width/480/height/480?cb=20141213135711", "https://vignette.wikia.nocookie.net/scandal/images/9/9c/4x21_-_Mellie_Grant_06.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150416230633", "https://vignette.wikia.nocookie.net/scandal/images/4/45/5x07_-_DizzieBear_05.png/revision/latest/zoom-crop/width/480/height/480?cb=20160117002106", "https://vignette.wikia.nocookie.net/scandal/images/8/89/Olivia_Pope_Sketch_-_Milk_Studios_BTS.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20160712084714", "https://vignette.wikia.nocookie.net/scandal/images/7/73/4x09_-_Kerry-Scott-Tony_on_Set_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20150306095740", "https://vignette.wikia.nocookie.net/scandal/images/7/73/5x10_-_Olivia_Pope_02.jpg/revision/latest/top-crop/width/480/height/480?cb=20160126233504", "https://vignette.wikia.nocookie.net/scandal/images/8/85/6x16_Mellie_Grant_4.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20170520022942", "https://vignette.wikia.nocookie.net/scandal/images/1/1e/1x01_-_Tony_Goldwyn_01.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20110915063902", "https://vignette.wikia.nocookie.net/scandal/images/e/e9/4x01_-_Cyrus_Beene_and_Elizabeth_North_02.jpg/revision/latest/zoom-crop/width/480/height/480?cb=20141114010056"], "top_img": "https://vignette.wikia.nocookie.net/scandal/images/1/1e/1x01_-_Tony_Goldwyn_01.jpg/revision/latest?cb=20110915063902", "keywords": [], "authors": [], "canonical_link": "https://scandal.fandom.com/wiki/Scandal_Press_Interviews", "title": "Scandal Press Interviews", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Scandal Wiki,scandal,Scandal Press Interviews,Scandal", "description": "The cast and Crew of Scandal often give interviews with the Newspapers and Magazines to promote the series. We've collected some available videos of these interviews for your viewing pleasure! How did you originally come to be a part of this show? Was it something that Shonda Rhimes approached...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://scandal.fandom.com/wiki/Scandal_Press_Interviews", "title": "Scandal Press Interviews | Scandal Wiki | Fandom", "description": "The cast and Crew of Scandal often give interviews with the Newspapers and Magazines to promote the series. We've collected some available videos of these interviews for your viewing pleasure! How..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Scandal Wiki", "title": "Scandal Press Interviews", "description": "The cast and Crew of Scandal often give interviews with the Newspapers and Magazines to promote the series. We've collected some available videos of these interviews for your viewing pleasure! How did you originally come to be a part of this show? Was it something that Shonda Rhimes approached you about because of your previous working relationship? \"Yeah, I think so. I just got a call that she was interested in me doing this. I love Shonda and have so much respect for her, and really love...", "url": "https://scandal.fandom.com/wiki/Scandal_Press_Interviews", "image": "https://vignette.wikia.nocookie.net/scandal/images/1/1e/1x01_-_Tony_Goldwyn_01.jpg/revision/latest?cb=20110915063902"}, "apple-itunes-app": "app-id=963580252, app-arguments=https://scandal.fandom.com/wiki/Scandal_Press_Interviews"}, "movies": [], "publish_date": null, "source": "https://scandal.fandom.com", "summary": ""}