{"url": "movieweb.com/jim-carrey-robin-williams-feud-details/", "text": "Jim Carrey has responded to a new report that says he and the late Robin Williams were engaged in a \"bitter feud.\" The original report seems to stem from a new biography about Williams that was written by New York Times journalist Dave Itzkoff. In Itzkoff's book, it's touched on that the late comedian felt threatened by Carrey's success in the 1990s. To make matters worse, Robin Williams was reportedly upset that Jim Carrey took over on the role of the Riddler in 1995's Batman Forever after he turned the role down.\n\nThe report in question comes from Radar Online, which isn't always 100 percent accurate in all of its reporting. Jim Carrey has made a statement calling the entire report fabricated and made up after a tiny blurb was mentioned in Dave Itzkoff's biography. Carrey acknowledges that there might have been some insecurity on the part of Williams, but there was absolutely no feud. Carrey explains.\n\n\"RadarOnline is completely off base and creating a feud that didn't exist. Robin may have expressed insecurity about me and my rise to success but I have never had anything but the greatest respect for him and his genius. He was also always respectful to me in person. He called me Maestro and I called him Billy the Kid. Let's get it straight. There's no feud if one side isn't aware of it.\"\n\nIn addition to his statement on the so-called feud with Robin Williams, Jim Carrey took a break from painting the Trump administration and shared a new painting that he did of the late comedian on social media. The painting is done in Carrey's unique style and features Robin Williams with a radiating golden glow around him. Carrey continued to heap praise on Williams in the caption of the photo. He says.\n\n\"Robin Williams' mind was a quantum computer. He was the fastest gun in the West. I loved, respected and admired his brilliance - always.\"\n\nThis August will be the fourth anniversary of Robin Williams' death. Williams committed suicide on August 14th. The comedian was diagnosed with diffuse Lewy body dementia, which reportedly caused him to lose some of the energy that he was best known for. Williams was misdiagnosed with Parkinson's disease, suffered paranoia, hallucinations, and blank moments at the end of his life. In addition, he didn't feel like he could be funny anymore, according to Itzkoff's biography.\n\nAs for Jim Carrey, he's mostly been focusing on painting as a way of social protest after being cleared in the death of his girlfriend. Carrey is a harsh critic of President Trump and creates very unflattering pieces of artwork that portray the president and his administration. While it could be said that he may be in a feud with Trump, he was never in a \"bitter feud\" with the late great Robin Williams. You can read the rest of Carrey's comments on Williams at Gossip Cop.\n\nRobin Williams’ mind was a quantum computer. He was the fastest gun in the West. I loved, respected and admired his brilliance — always. pic.twitter.com/h1zTNS4Hg0 — Jim Carrey (@JimCarrey) May 17, 2018", "images": ["https://cdn3.movieweb.com/i/article/7ri9HVm9iuFB3q3gXBw0TdVsDcik7k/1200:100/Jim-Carrey-Robin-Williams-Feud-Details.jpg", "https://cdn3.movieweb.com/i/author/xOPw7WWJQayBqpBi49Vki5rZ4ri0kb/60:70/Kevin-Burwick.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17091571&cv=2.0&cj=1", "https://certify.alexametrics.com/atrk.gif?account=4fQco1IWNa10zK"], "top_img": "https://cdn3.movieweb.com/i/article/7ri9HVm9iuFB3q3gXBw0TdVsDcik7k/1200:100/Jim-Carrey-Robin-Williams-Feud-Details.jpg", "keywords": [], "authors": ["Kevin Burwick", "Writer For Movieweb Since Enjoys Playing Catan When Not Writing About Superheroes", "Star Wars."], "canonical_link": "https://movieweb.com/jim-carrey-robin-williams-feud-details/", "title": "Jim Carrey Reveals Truth Behind Robin Williams Feud", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Jim Carrey finally opens up about his relationship with late comedian Robin Williams.", "fb": {"app_id": 357878074202}, "robots": "max-image-preview:large", "og": {"title": "Jim Carrey Reveals Truth Behind Robin Williams Feud", "type": "article", "image": "https://cdn3.movieweb.com/i/article/7ri9HVm9iuFB3q3gXBw0TdVsDcik7k/1200:100/Jim-Carrey-Robin-Williams-Feud-Details.jpg", "url": "https://movieweb.com/jim-carrey-robin-williams-feud-details/", "description": "Jim Carrey finally opens up about his relationship with late comedian Robin Williams.", "site_name": "Movieweb"}, "article": {"published_time": "2018-05-26T14:25:02-07:00", "section": "Movie News"}, "twitter": {"card": "summary_large_image", "site": "@movieweb", "creator": "@PantherInCrime", "title": "Jim Carrey Reveals Truth Behind Robin Williams Feud", "description": "Jim Carrey finally opens up about his relationship with late comedian Robin Williams.", "image": {"identifier": "https://cdn3.movieweb.com/i/article/7ri9HVm9iuFB3q3gXBw0TdVsDcik7k/1200:100/Jim-Carrey-Robin-Williams-Feud-Details.jpg", "alt": "Jim Carrey Reveals Truth Behind Robin Williams Feud"}, "url": "https://movieweb.com/jim-carrey-robin-williams-feud-details/"}}, "movies": [], "publish_date": 1527369902.0, "source": "http://movieweb.com", "summary": ""}