{"url": "https://www.seventeen.com/beauty/makeup-skincare/a19874370/best-waterproof-makeup-tested/", "text": "Nothing’s worse than looking in the mirror on a hot summer day and realizing you have “raccoon eyes” because your eyeliner started running. Sweat, rain and humidity can quickly turn the makeup look you slayed this morning into something that looks straight out of a horror movie. But sweat doesn’t have to mean sacrifice. You can still beat your face even if you’re expecting the humidity to hit 100. Just invest in some quality, waterproof makeup products that will preserve your look all day long. Even the best waterproof makeup tends to feel a lot heavier than normal makeup, but that doesn’t mean it’s necessarily bad for your skin, according to Dr. Marisa Garshick, a NYC-based board-certified dermatologist at MDCS Dermatology and Clinical Associate Professor of Dermatology at Cornell. “[Waterproof makeup] certainly has a role for people who need it for specific reasons, as long as it is properly removed at the end of each day.”\n\nBut Dr. Garshick also says that if your skin is prone to breakouts, the key is finding waterproof makeup that’s non-comedogenic, since it’s less likely to clog your pores. “In general, waterproof makeup can be considered heavier than traditional makeup and it is because some products contain ingredients that are designed to keep water away, such as waxes or silicones, and these can sometimes lead to irritation or further breakouts of the skin.” She advises investing in products that contain acrylates copolymer, isododecane and very small amounts of silicone.\n\nDr. Garshick says that you can even wear waterproof makeup to workout. “Although it is recommended to remove makeup prior to a sweaty workout to minimize pores from getting clogged, [non-comedogenic makeup] shouldn't clog the pores, even if being worn while getting hot and sweaty.”\n\nIt can be hard to break through the noise and find products that really work, but this might help. Beauty Smartie Maria Gomez tested out some waterproof makeup products, which by the way, are all pretty affordable and can be found at your local drugstore.\n\nSure, a bunch of makeup products out there claim to be waterproof, water-resistant or long-wearing, but can they actually do what they say? You'll have to find out in the video below, and make sure to watch until the very end to see what happens when Maria dunks her entire face into a bowl of water!\n\n1. Milani Conceal + Perfect 2-in-1 Foundation + Concealer\n\nUlta Beauty\n\n\n\n\n\nThis product claims to be long-wearing, water-resistant, and sweat-proof. For this video, Maria applied the foundation to the back of her hand and then used her fingers to apply it all over her face. (If you want to check out a life-changing hack on how to apply liquid foundation with your fingers, check this out.)\n\n\"I’m pretty impressed with the coverage. It went on super smooth, My skin still feels pretty bare. It feels like I almost have nothing on, which I mean I love especially during the summer and spring time,\" Maria said.\n\n2. NYX Gotcha Covered Concealer\n\nNYX Professional Makeup\n\nSHOP NOW\n\nThis product claims to be waterproof and full coverage. Maria dabbed the product onto her ring finger and only applied a small amount to her under eye area. Unfortunately, the concealer did add some shine to her face. \"It did add a little bit of shine. I’m not sure how I feel about it because it kind of accentuates every little ridge in my face, but it is full coverage, so I will give it that.\"\n\n3. Essence All About Matt! Fixing Compact Powder Waterproof\n\nUlta Beauty\n\nAccording to Maria, this powder did a great job of removing some of the shine on her face. However, it did leave a little bit of a white cast. (Hey, no product is perfect, right?!)\n\n4. Rimmel Natural Bronzer\n\nRimmel London\n\nSHOP NOW\n\n\n\nHeads up, Maria noticed there aren't too many waterproof bronzers out there, but she did manage to score this super affordable option! (Now, if you're still not sure exactly where to apply bronzer, head over to this helpful tutorial.)\n\nAs it turns out, not only is this product low-cost, but it also works really well. According to Maria, it's very blendable. \"I’m actually pretty content with how it blended out and applied on the face. I definitely do see myself reaching for this maybe during the spring or summer when I’m going out with some friends and just want a little bit of a sun-kissed glow.\"\n\n5. NYX Proof It! Waterproof Eyeshadow Primer\n\nNYX Professional Makeup\n\nSHOP NOW\n\n\n\nYep, apparently a product like this exists! This product claims that it can work well with any type of eyeshadow and make it budge-proof. It's an interesting concept, but Maria did note it felt a little different than other eye primers. “It feels a little weird– almost feels a little sticky when compared to normal non-waterproof eyeshadow primers,\" she said.\n\nWhether or not it really works is up for debate. After Maria got her face wet, there was some eye product on her towel. However, the eye makeup left on her face looked pretty flawless.\n\n6. Maybelline Eyestudio Color Tattoo Concentrated Crayon\n\nUlta Beauty\n\n\n\n\n\nNext, Maria applied this \"color tattoo\" to add a champagne color to her lids. After blending it out with her fingers, Maria realized that she absolutely loved the color! But, the lids still felt kind of sticky...\n\n7. Maybelline Eyestudio Lasting Drama Gel Eyeliner\n\nMaybelline New York\n\n\n\n\n\nTo create a class winged line on her upper lashes, Maria used Maybelline's gel liner.\n\n8. Rimmel Scandleyes Waterproof Kohl Kajal Eyeliner\n\nCVS Pharmacy\n\n\n\n\n\nOn her lower waterline, Maria applied this waterproof eyeliner. After applying both eye products, Maria decided that they worked really well and glided on very smoothly. \"I do really, really love them. They glided on super, super nicely and they were really creamy,\" she said.\n\n9. Maybelline TattooStudio Waterproof Eyebrow Gel\n\nTarget\n\n\n\n\n\nThis product claims to be so powerful that it can last up to two days! Crazy, right?! Well, Maria says she loves its texture, so let's hope it really lasts that long. \"I actually really like this eye brow gel. It deposited a little pigment, nothing too drastic, so it still looks pretty natural and it has a little bit of a gel-like texture, so my brows are staying in place.\"\n\n\n\nAs for the waterproof test, this gel definitely passed. Even after Maria dunked her face in water, the pigment did not move.\n\n10. L'Oreal Voluminous Lash Paradise Waterproof Mascara\n\nUlta Beauty\n\nSHOP NOW\n\n\n\nReal talk, Maria said she's absolutely obsessed with this mascara. \"I used to think that waterproof mascara was clumpy and it looked like spidery lashes, but this mascara did not give me that effect whatsoever. I added two coats and it gave me the right amount of length and definition,\" she said.\n\n11. NYX Liquid Suede Cream Lipstick\n\nNYX Professional Makeup\n\nSHOP NOW\n\n\n\nMaria tried out this lipstick in the shade \"Soft-Spoken,\" which according to Ulta Beauty is a fan fave.“It goes on super creamy, it’s really pigmented and it doesn’t dry down completely matte,\" Maria said.\n\nDr. Garshick says that the key to avoiding skin irritation is properly removing your waterproof makeup by using products like micellar water or makeup remover towelettes. “[Micellar water] is a gentle cleansing option that uses micelles, which are small oil molecules, that help to lift off makeup, oil and dirt off the skin without requiring significant rubbing or extra irritation to the skin.\" She also advises to avoid excessive rubbing when using makeup remover towelettes. Check out some of her product recommendations below.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=1.00xw:0.891xh;0,0.109xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=1.00xw:0.891xh;0,0.109xh&resize=1200:*", "keywords": [], "authors": ["Victoria Rodriguez", "Jasmine Gomez", "Editorial Assistant", "Jasmine Gomez Is The Editorial Assistant At Women S Health", "Covers Health", "Fitness", "Sex", "Culture", "Cool Products."], "canonical_link": "https://www.seventeen.com/beauty/makeup-skincare/a19874370/best-waterproof-makeup-tested/", "title": "11 Waterproof Makeup Products You Have to Try", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "11 Waterproof Makeup Products You Have to Try", "description": "Plus, watch Beauty Smartie Maria Gomez dunk her face into a tub of water.", "url": "https://www.seventeen.com/beauty/makeup-skincare/a19874370/best-waterproof-makeup-tested/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=1.00xw:0.891xh;0,0.109xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2019-09-10 03:28:01", "published_time": "2019-08-01 09:45:00", "section": "Makeup & Skin Care", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=1.00xw:0.891xh;0,0.109xh&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "11 Best Waterproof Makeup Products Tested - Waterproof Mascara and Foundation", "description": "Beauty Smartie Maria Gomez tested out some waterproof makeup products, which by the way, are all pretty affordable and can be found at your local drugstore.", "keywords": "waterproof makeup, best waterproof makeup, waterproof eyeliner, waterproof mascara, waterproof foundation, best waterproof makeup products", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=0.564xw:1.00xh;0.183xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty,makeup-skincare", "sailthru.date": "2019-08-01T21:45:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=1.00xw:0.891xh;0,0.109xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beauty-smarties-waterproof-makeup-1524253694.jpg?crop=0.564xw:1.00xh;0.183xw,0", "sailthru.socialtitle": "11 Waterproof Makeup Products You Have to Try", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1564623900.0, "source": "https://www.seventeen.com", "summary": ""}