{"url": "https://www.nbcsandiego.com/entertainment/entertainment-news/Tarantino-Breaks-Silence-After-Uma-Shares-Crash-Footage-472871903.html", "text": "Quentin Tarantino is revealing new details about what happened on and off the \"Kill Bill\" set.\n\nIn a new interview, the Hollywood director spoke out about Uma Thurman's experiences working on the movie and reveals he was aware that the actress was going to come forward and share serious allegations with the New York Times.\n\n\"I knew that the piece was happening. Uma and I had talked about it, for a long period of time, deciding how she was going to do it. She wanted clarity on what happened in that car crash, after all these years. She asked, could I get her the footage? I had to find it, 15 years later,\" he shared with Deadline. \"I didn't think we were going to be able to find it. It was clear and it showed the crash and the aftermath. I was very happy to get it to Uma.\"\n\nWhen speaking to the NYT, Thurman recalled being injured in a \"Kill Bill\" car stunt, which she said the director pressured her to perform herself. She said she was left with a \"permanently damaged neck\" and \"screwed-up knees.\"\n\nJoin the Movement: Click here to donate to the Time's Up Legal Defense Fund\n\nOn Monday afternoon, Thurman shared the video on Instagram to her 743,000 followers. \"The circumstances of this event were negligent to the point of criminality. I do not believe though with malicious intent,\" she captioned the post. \"Quentin Tarantino, was deeply regretful and remains remorseful about this sorry event, and gave me the footage years later so I could expose it and let it see the light of day, regardless of it most likely being an event for which justice will never be possible.\"\n\nThurman added, \"He also did so with full knowledge it could cause him personal harm, and I am proud of him for doing the right thing and for his courage.\"\n\nDuring his lengthy interview with Deadline, Tarantino admitted that the car crash \"is one of the biggest regrets of my life.\"\n\nUma Thurman's Best Roles\n\n\"I figured that eventually [the video clip] would be used whenever she had her big piece. Also, there was an element of closure. She had been denied it, from Harvey Weinstein, being able to even see the footage. I wanted to deliver it to her, so she could look at it,\" Tarantino explained. \"So she could see it and help her with her memory of the incident.\"\n\nE! News has reached out to Weinstein's team for comment about Tarantino's latest interview. When Thurman first posted her Instagram with the footage from \"Kill Bill,\" his spokesperson released a statement denying her allegations that there was a \"cover up\" involved.\n\n\"Harvey has tremendous affection for Uma Thurman nevertheless he denies these allegations. He did not give instructions to destroy the vehicle or orchestrate a cover-up and this is the first time he has learned that Ms. Thurman had any issues regarding the handling of her accident. In fact, she continued working with Mr. Weinstein on three more films, including 'The War with Grandpa' which was scheduled to be released this year,\" the statement read. \"Ms. Thurman has reported in the past that that Mr. Weinstein personally came on set during the filming of the scene where she was being buried alive, concerned with her well-being, he demanded that they reconfigure the shot to her approval so that she felt more comfortable.\"\n\nThe statement continued, \"We understand that members of the production team have stated to individuals in the media that Mr. Weinstein had nothing to do with the aftermath of the crash. Mr. Weinstein wishes Ms. Thurman would have spoken to him at the time to express her concerns and would like for her to provide any additional details so that he can assist in closing and repairing this chapter of her life. Once again, he is remorseful and regrets making a pass at her in England.\"\n\nEvery Star Who Has Spoken Out Against Harvey Weinstein Amid His Sexual Harassment Allegations\n\nOne of the biggest headlines that came out of Thurman's interview with the NYT is when the publication details an allegation that in \"Kill Bill,\" Tarantino allegedly spit in her face in the scene where Michael Madsen is seen on screen doing it and choking her with a chain in the scene where a teenager named Gogo is on screen doing it.\n\nUma Thurman Says Harvey Weinstein Assaulted Her Years Ago, He Denies It\n\nWhen asked about the portion of the piece, Tarantino offered his perspective.\n\n\"Let me address that. According to Uma...You notice there are not quotes around that. Uma didn't share that with [the NYT author] Maureen Dowd. Maureen Dowd interviewed other people on the set who mentioned it to her. If you notice, all that choking and spitting stuff is not in quotes from Uma. It's part of Maureen Dowd's prose. For some reason there is a lot of hay being made out of this. Which I don't understand, at all. You've seen movies where somebody spits in somebody's face?\" he explained. \"Well, that's what this was. A scene where somebody spits in somebody's face. I can explain why I did exactly what I did, but my question is, what's the f--king problem?\"\n\nHe continued, \"I asked Uma. I said, I think I need to do it. I'll only do it twice, at the most, three times. But I can't have you laying here, getting spit on, again and again and again, because somebody else is messing it up by missing. It is hard to spit on people, as it turns out.\"\n\nTarantino is quick to admit that the crash in particular had an effect on his relationship with Uma for many years. While they still communicated, the director said a \"trust was broken\" after the incident.\n\n\"Me and Uma had our issues about the crash. She blamed me for the crash and she had a right to blame me for the crash. I didn't mean to do it. I talked her into getting in the car, I assured her the road was safe. And it wasn't. The car might even have been dubious too even if I didn't know that then. We had our issues about it,\" he shared. \"We weren't estranged. But we were over each other for a couple of years.\"\n\nHe added, \"We have a long complicated history. We have been dealing with it for 22 years. We're both one of the closest people in each other's lives.\"", "images": ["https://media.nbcsandiego.com/2019/09/San_Diego_On_Light@3x-1.png?fit=381%2C120", "https://media.nbcsandiego.com/2019/09/San_Diego_On_Dark@3x-2.png?fit=381%2C120", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcsandiego.com/2019/09/goodnews2-apr17.jpg?resize=850%2C478", "https://media.nbcsandiego.com/2019/09/killquentin.jpg?resize=850%2C478", "https://media.nbcsandiego.com/2019/09/GettyImages-1219262470.jpg?crop=0px%2C12px%2C1024px%2C576px&resize=850%2C478"], "top_img": "https://media.nbcsandiego.com/2019/09/killquentin.jpg?resize=850%2C478", "keywords": [], "authors": ["Mike Vulpo"], "canonical_link": "http://www.eonline.com/news/911852/quentin-tarantino-breaks-silence-after-uma-thurman-shares-kill-bill-crash-footage", "title": "Quentin Tarantino Breaks Silence After Uma Thurman Shares ‘Kill Bill’ Crash Footage", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "og": {"site_name": "NBC 7 San Diego", "type": "article", "description": "When speaking to the NYT, Thurman recalled being injured in a “Kill Bill” car stunt, which she said the director pressured her to perform herself. She said she was left with a “permanently damaged neck” and “screwed-up knees.”", "title": "Quentin Tarantino Breaks Silence After Uma Thurman Shares ‘Kill Bill’ Crash Footage", "url": "https://www.nbcsandiego.com/news/national-international/tarantino-breaks-silence-after-uma-shares-crash-footage/2044231/", "image": "https://media.nbcsandiego.com/2019/09/killquentin.jpg?resize=850%2C478"}, "google-site-verification": "IEReflDAGG9alRk9BZvi1yyXoUkp8VVr2tQDgwleG2k", "fb": {"app_id": 96971132149}, "twitter": {"site": "@nbcsandiego", "creator": "@nbcsandiego", "description": "When speaking to the NYT, Thurman recalled being injured in a “Kill Bill” car stunt, which she said the director pressured her to perform herself. She said she was left with a “permanently damaged neck” and “screwed-up knees.”", "title": "Quentin Tarantino Breaks Silence After Uma Thurman Shares ‘Kill Bill’ Crash Footage", "url": "https://www.nbcsandiego.com/news/national-international/tarantino-breaks-silence-after-uma-shares-crash-footage/2044231/", "image": "https://media.nbcsandiego.com/2019/09/killquentin.jpg?resize=850%2C478"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/NBCSanDiego"}, "description": "When speaking to the NYT, Thurman recalled being injured in a “Kill Bill” car stunt, which she said the director pressured her to perform herself. She said...", "keywords": "Quentin Tarantino, Uma Thurman, Every Star Who Has Spoken Out Against Harvey Weinstein, director, Kill Bill, set, vehicle, piece, New York Times, details, actress, author, car crash, DEADLINE, Harvey Weinstein, Instagram, Mike Vulpo, Quentin Tarantino, spokesperson, The New York Times", "sailthru.title": "Quentin Tarantino Breaks Silence After Uma Thurman Shares ‘Kill Bill’ Crash Footage", "sailthru.description": "When speaking to the NYT, Thurman recalled being injured in a “Kill Bill” car stunt, which she said the director pressured her to perform herself. She said...", "sailthru.tags": "Quentin Tarantino, Uma Thurman, Every Star Who Has Spoken Out Against Harvey Weinstein, director, Kill Bill, set, vehicle, piece, New York Times, details, actress, author, car crash, DEADLINE, Harvey Weinstein, Instagram, Mike Vulpo, Quentin Tarantino, spokesperson, The New York Times", "sailthru.type": "article", "sailthru.date": "2018-02-05T22:01:12+00:00", "msapplication-TileImage": "https://media.nbcsandiego.com/2019/09/cropped-NBC_San-Diego.png?fit=270%2C270"}, "movies": [], "publish_date": 1517868072.0, "source": "https://www.nbcsandiego.com", "summary": ""}