{"url": "https://web.archive.org/web/20171004185422/http://www.hyperactivz.com:80/expensive-celebrity-plastic-surgeries-safe", "text": "ADVERTISEMENT Nicole Kidman Nicole Kidman has never admitted to having any surgery more extensive than Botox injections, and even those she says she didn’t like. Her words were “sometimes you have to find out if the grass is greener on the other side for yourself.” There are still rumors about her having other work done, including facial fillers and a rhinoplasty, leading to fans berating her on Twitter for “ruining herself.” Nicole Kidman hasn’t confirmed or denied having more work done.\n\nBlake Lively Blake Lively made her name in TV show Gossip Girl as Serene Van Der Woodsen, but the gossip on Blake was that she was unhappy with her face before she got surgery to make some changes. She enhanced her facial features with a rhinoplasty, as well as an eyelid touch up and some surgery to rid herself of her freckles. She is now married to Ryan Reynolds and the pair are known as one of Hollywood’s most loved up couples, and have a couple of kids too.\n\nDenise Richards Denise Richards is a television actress who you probably recognise immediately from shows like Married with Children or Saved by the Bell. She even had her own reality TV show. She is happily married to Charlie Sheen, and enjoys a successful career. At the tender age of 19, she decided to have a breast augmentation to try to improve her looks for Hollywood and Television, but unfortunately, she was given breasts far too large for her frame. She had the procedure repeated twice, and is now happy with the results.\n\nTrista Sutter Reality TV star Trista Sutter is known for shows like Survivor, Big Brother, and both the Bachelor and Bachelorette. She even found love on television! But she was never happy with her looks. She was featured in Life and Style as well as US magazine at age 40 when she decided to go under the knife for the first time. She has had her eyelids lifted and reconstructed, as well as a breast augmentation surgery. She now says that plastic surgery helped her love her body.\n\nTom Jones Tom Jones might be the longest still performing heartthrob for middle aged women everywhere! He has been swinging those hips since the 60’s, and is still touring with his catchy songs and moves. To stay hot in this industry though doesn’t come cheaply. He is now in his seventies and has had plenty of work done, including face lifts, dental work, and alternations to his eyelids and his nose. We wonder whether he will retire from the stage any time soon, or keep pushing back those hands of time with the help of more surgery?\n\nJocelyn Wildenstein Known as ‘Catwoman’, the word on the street is that Jocelyn Wildenstein has done a lot of her extensive plastic surgery for her late husband, who er… “liked cats.” She shows no sign of slowing down, even saying she would have plastic surgery into her nineties if she felt she wanted work done. Her many many surgeries and the strange puffy look she now has a result has led to the somewhat cruel nickname, The Bride of Wildenstein. Yikes!\n\nKim Novak\n\nNovak was famous back in the day, for her movies in the 50’s and 60’s which included Vertigo, and The Man with the Golden Arm. She was seen as quite the beauty, and had her pick of Hollywood. The work dried up later in the 60’s, and in 1991, she announced her official retirement. No one would have recognised her when she stepped out at the 2014 Oscars after having cheek implants, a brow lift, and some Botox injections too. Grow old gracefully Kim, that’s what we say. Novak was famous back in the day, for her movies in the 50’s and 60’s which included Vertigo, and The Man with the Golden Arm. She was seen as quite the beauty, and had her pick of Hollywood. The work dried up later in the 60’s, and in 1991, she announced her official retirement. No one would have recognised her when she stepped out at the 2014 Oscars after having cheek implants, a brow lift, and some Botox injections too. Grow old gracefully Kim, that’s what we say.\n\nCourtney Love Courtney has had a number of looks over the years, from dark short messy hair with punk clothes, to long flowing blonde locks and red carpet gowns. But that doesn’t stop us from noticing the work she’s had done to her face and body too. The wife of the late rock star Kurt Kobain has had a nose job, as well as lip fillers, and a breast augmentation too. She hasn’t gone overboard on the cosmetic surgery, and therefore her bill hasn’t sky rocketed too high either.\n\nMichael Jackson Probably the most famous person of all time to alter themselves through plastic surgery, Michael Jackson began having work done at an early age, and never really stopped. While the first rhinoplasty he had was after breaking his nose, he then went on to have several more for cosmetic purposes, including having his nose completely rebuilt at one point. He was also famous for surgically altering his skin to be almost completely white.\n\nKourtney Kardashian The Kardashians are taking up a fair percentage of our list, and Kourtney is no different from the rest of her clan. She had her breast augmentation when she was in college, but she wasn’t altogether happy with the results. She actually said that she wishes she hadn’t had it done, and thinks she will have to get them redone to look more natural at some point. She also agreed that surgery is an extreme first step, and she might look into lasers as an alternative method to make any future changes to her face or body.\n\nSuzanne Somers Many women get plastic surgery in the hopes of regaining some of their lost youth, especially if they were known to be a bit of a babe ‘back in the day’, and since lost some of their fame and fortune. Perhaps that’s what was going through Suzanne Somers mind when she embarked on $9,000 worth of surgery. She has had work completed on her face and neck, as well as her breasts, lips and jaw, and she certainly looks different!\n\nClay Aiken Remember when we all thought Clay was going to be the next American Idol? Unfortunately he didn’t quite make that top spot, but his singing career didn’t suffer anyway. He went under the knife for a medical reason, which he says was to do with TMJ. He needed to have his jaw reconstructed, so while he was in surgery, he decided to get the surgeon to remove some fat from his chin and neck. Well, why not? He looks pretty much the same since his surgery, and we’re glad the medical issue has been resolved easily for him.\n\nNadya Suleman Probably the strangest reason for being well-known, Nadya Suleman is better known as the Octomom, as she had eight babies, at once! She has come under fire for making money out of her kids, including modelling, TV documentaries and other media events. Some of her money has gone to her plastic surgeries, which include lip injections, nose jobs, and unsurprisingly- vaginal rejuvenation! Some say she is trying to model her look after Angelina Jolie.\n\nClare Danes Clare Danes has always said she is pretty open to plastic surgery, and as a woman in the public eye, we’re not surprised. The pressure to keep looking young and deny the signs of ageing can be immense for anyone, let alone one of the most famous actresses in Hollywood. Many people believe Clare has already slipped under the knife for treatments such as lip fillers, an eye lift, and even facial implants. One thing’s for sure, she looks absolutely beautiful, and a lot younger than her 38 years!\n\nVictoria Beckham Victoria Beckham has a love hate relationship with plastic surgery, and has clearly had a few bits and pieces done and then removed too over the years. She is outspoken about her breast augmentation, expressing regret for getting them done, saying it came from a place of insecurity. She even says to women, “don’t mess with your boobs, just celebrate what you’ve got.” Rumors about other facial surgeries such as nose jobs have never been confirmed by VB.\n\nJohn Travolta It’s not just the women who feel the push of Hollywood to keep their youthful looks. John Travolta has been in the public eye for decades, famous for movies from Saturday Night Fever, to Pulp Fiction and The People vs OJ Simpson. But his fans have called out his so-called ‘frozen face’ and clear hair transplants. As well as Botox, many believe Travolta has had a facelift, but all the rumors have been staunchly denied by him. The photos appear to speak for themselves.\n\nAshlee Simpson To some people, Ashlee is simply the younger sister of Jessica Simpson, but she also has a great career in her own right, as a famous singer and a reality TV star who had her own show on MTV. She always felt like the less attractive sister, and she even says she used to look at celebs in magazines and think she could never look like them. Her cosmetic surgery includes a rhinoplasty, as well as some other work which she says she thought seriously about for a long time before taking the plunge with.\n\nTori Spelling Tori Spelling is famous for her work as an actress, in television shows like Beverley Hills as well as in movies like the blockbuster hit Scary Movie. She has admitted to having some work done, and also to having some regrets about her breast augmentation. She wanted to spread awareness that any work to your breasts can cause problems with breastfeeding your children, and that if she had known that originally, she never would have had the work done. Something important to bear in mind for anyone having surgery.\n\nNicole Richie Nicole Richie is a fan of cosmetic surgery, and thinks of it as a similar kind of experience to make up or fake tanning. She is quoted as saying “Why grow old gracefully when you have the technology to prevent it?” She has also become famous for having what celebs call the Mini Boob Job, where she gets breast implants, but goes for the natural look over a large amount of cleavage. Nicole has reportedly had a rhinoplasty as well. If she doesn’t change her mind, we can expect to see a lot more surgery from her in the future.\n\nDiana Agron A role model for many teenage girls due to her part in hit show, Glee as Quinn Fabray, we love how calmly and quietly Diana went about getting her nose fixed after a collision with friends when out dancing the night away, left it broken. She had the confidence to say she wanted to make the change, but hasn’t taken it too far with countless procedures or alternations, just had the break set and fixed, and is just as gorgeous as ever.\n\nEllen Pompeo The Grey’s Anatomy star has been on the show since its first episode, and so she is no stranger to having a camera close in on her every imperfection. But she remains just as beautiful nearly 15 years later as she ever did in season one. Could plastic surgery be the reason? Experts suggest she may have had a face lift or a neck lift, as she has hardly any lines around her jaw and neck, incredible for her age. Her eyes have aged naturally, so she is definitely a star who has shied away from Botox.\n\nHeather Locklear Heather Locklear is one of those celebrities who has a lot of strings to her bow, as an actress and also a model. However, you probably immediately think of the famous men she has been associated with when you hear her name, from Tommy Lee Jones to Richie Samborra. Considering how much surgery she has had done, she hasn’t racked up a very expensive bill, and she doesn’t look dramatically different either. She has gone under the knife for a nose job, a boob job, a cheek implants procedure and a face lift, as well as Botox injections.\n\nLil’ Kim Lil’ Kim might be the most shocking transformation on our list so far, and she did all of this when she was on her hiatus from her musical career, which means the public didn’t have a chance to get used to any gradual changes to her appearance. She bleached her skin a few shades lighter, as well as paying for liposuction, lip implants, a rhinoplasty, and breast augmentation too. What a dramatic transformation, and public opinion has not been kind to her about the results.\n\nDavid Gest It probably won’t surprise you to learn that David Gest was good friends with another plastic surgery enthusiast, Michael Jackson! He was also married to Liza Minelli, so the natural look was clearly not something he saw a lot of. Many say Gest got addicted to surgery for a time, as he had many facelifts, an eyebrow lift and Botox, as well as surgery to his chin to give him a stronger jaw. He has said that he regrets the lengths he went to, and it even cost him more money than he could afford.\n\nJanice Dickinson According to some news sources, Janice’s son Nathan has begged her not to do any more plastic surgery. She is not one of cosmetic surgery’s success stories, and is in fact often used on lists of nightmare plastic surgery gone wrong! She even featured on TV show Botched, where they showed how wrongly her nose jobs have gone. Her dramatic transformation has taken place slowly over the years, and she has told the media that she won’t be having any more trips under the knife.\n\nNeNe Leakes Best known as NeNe, Linnethia Leakes is a reality TV star, made famous from the Real Housewives of Atlanta. The show made her famous, and since then she has been on TV shows like Glee, as well as being chosen as a judge on the show Fashion Police. She isn’t ashamed to say that she has had her fair share of plastic surgery, including a breast list and a breast reduction, as well as at least one nose job and some liposuction. We think she looks gorgeous!\n\nLa Toya Jackson Just like her famous brother, La Toya Jackson is known for her plastic surgery, giving her an unrecognisable and yet similar to MJ kind of look. She has had an eyebrow lift, at least one rhinoplasty, and a breast augmentation as well. Despite the extensive surgery, her career never really took off, and she isn’t very well known for her singing or as a musical artist. Rather, she is remembered for posing in Playboy in the 80’s, and being Michael and Janet’s less popular sister. Oh dear.\n\nKelly Rowland It can’t be easy being in the shadow of Queen Bey herself, and Kelly Rowland must know that better than anyone after her years in Destiny’s Child. She has since had some success herself in her singing career, and is a stunning woman by anyone’s standards. She told the media that she originally wanted to get her breasts enlarged at age 18, but both her mom and Beyonce’s told her to give it some time, and not rush the decision. A decade later, she finally made the plunge.\n\nDonatella Versace Fashion designers are known for wanting to look their best at all times, and Donatella Versace is no different. Unfortunately, many of her cosmetic surgeries appear to have had unwanted effects, including a facelift which cannot have gone as planned, and many injections which have taken away any sign of movement in much of her face. She has been called a human waxwork by the press, and laughs it off saying “I am not a fan of the natural look.” We can certainly see that!\n\nNikki Cox It’s clear from the photos alone that Nikki Cox has had lip augmentation and fillers, as her mouth is literally double the size that it was! The procedure includes putting chemicals into her lips with a needle, which makes them look fleshier and much larger. She has also had breast implants, and Botox. Nikki actually denies all of this surgery, as well as the claims that her drastic changes in looks have killed her career and made her a less desirable celebrity.\n\nVivica Fox Vivica Fox made a name for herself on television soap opera, Days of Our Lives. She has also been in several movies and TV shows, notable on Dancing with the Stars in the third season. Her plastic surgery has got more extreme over time, with Vivica paying for small changes such as Botox and lip injections, as well as a facelift, and both breast and jaw implants. She’s also known for her past relationships, one being rapper, 50 cent!\n\nLara Flynn Boyle If you’re a fan of cult show, Twin Peaks, you’ll immediately know who this is, and otherwise you might not. But Lara Flynn Boyle has reportedly been worried about acting roles going to younger women, and keeping up with the necessary beauty of Hollywood, which could perhaps explain her drastic plastic surgery. Her procedures have includes facial fillers, brow lifts, lip augmentation and a possible rhinoplasty, but unfortunately, it hasn’t had the effect she was hoping for.\n\nKathy Griffin This is another famous face who is probably trying to keep the years at bay. Kathy is known as both a comedian and an actress, and yet her own laughter lines get less and less visible as the years go on. She has had a number of procedures on her eyebrows, breasts, nose and eyes, as well as chemical peels and Botox to keep her looking young. We think she looks beautiful, and hasn’t overdone it like a lot of other older females in the public eye.\n\nHolly Madison One of the last people you would imagine being insecure about her looks is a Playmate! But on the contrary, Holly says her time living in the Playboy Mansion is what led to her self esteem issues, and what encouraged her to get surgery to make some changes. “I was comparing myself to the other girls … You have to look a certain way at the mansion. Plastic surgery made it easier for me to get things I wanted in my career. Without it, I wouldn’t be where I am today.” Holly has no regrets, and we think she looks beautiful.\n\nBarbie Girl Her real name is Valeria Lukyanova, and she claims she has only had her breasts changed to look more like her icon, Barbie. But looking at her waist, her facial features and her overall image, we find that hard to believe. She is 38 years old, and has been quoted as saying she believes her look inspires other people to improve their appearance, as there is “always room for perfection”. Since high school she has been trying to emulate the doll, and with surgery, she has achieved it!\n\nTom Cruise Tom Cruise came to the Bafta’s in 2016, and the world exploded with rumors that he had done something drastic to his face. One witty Twitter follower tweeted “Looks like Tom Cruise has just been on a Mission Impossible type mission to steal all the world’s Botox supply for\n\nhis face.” Ouch! Others compared the puffy face to bee stings. If this was a surgical enhancement, it’s safe to say that no one thinks it’s a good one.\n\nMickey Rourke Most of our big spenders on cosmetic surgery are not male, but Mickey Rourke is certainly an exception. The vast majority of his work has been to his face, including a rumoured six face lifts, and a nose alteration at some point too. For many, he is still the heartthrob that he was back in his boxing days, while others believe he has taken the surgery route one too many times to still look handsome against other men in Hollywood.\n\nMichael Douglas Famous Actor Michael Douglas has always been open about the facelift he got before he married Catherine Zeta Jones in 2000. His own version of wedding day nerves, we suppose. He seems to time his cosmetic surgeries with big events in his life, as the word was that he has facial augmentation just weeks before his new baby was born in 2003. The family are certainly beautiful, whether they owe their good looks to surgery or just what they were born with!\n\nAnna Faris The rumors with Anna Faris are not substantiated, and Anna does not admit to having any work done to her face. But experts suggest she might have had an eye lift, or facial fillers, as well as lip plumping tools such as collagen or implants. She has admitted to trying injections, but her Botox phase seems to be over now. More recent photos seem to show she has had a nose job, but this has never been confirmed. We think she looks beautiful!\n\nPete Burns The late Pete Burns was known for his ever changing and sometimes androgynous appearance which he was happy to admit was down to a lot of cosmetic surgeries over his short life. Amongst other procedures, he had lip fillers, cheek implants and nose jobs. Not a particularly popular look, he still managed to find someone to accuse of copying his style, another famous androgynous icon- Boy George! Pete died in 2016 of a sudden heart attack.\n\nRoseanne Barr Most famous for her comedy and acting, Roseanne is also a writer and producer. She became famous in her role in the hit TV sitcom, Roseanne. After this, she might have struggled to find other work due to the image conscious world she was working in, and perhaps that led to her forking out a small fortune on some serious cosmetic surgery. Rather than change her facial features, her surgery has focused on weight loss, from tummy tucks to gastric band surgery.\n\nCaitlyn Jenner A different kind of cosmetic surgery altogether, the former Bruce Jenner made his family forever famous when he decided to become Caitlyn. His surgeries were extensive and included a full sex change, costing a neat $60,000. Amongst these surgeries was his facial feminization procedure, something which took over 10 hours to complete, and removed the masculine set of his jaw and other features, helping him look more womanly.\n\nBarry Manilow Some of Barry Manilow’s many surgeries are due to an accident which he had in 2003, he walked into a wall and was left in need of some facial reconfiguration and dental work. He admits to having a lower and upper face lift to help fix the damage caused by this accident, but many plastic surgeons who are experts on the topic suspect he also had a nose job and has had Botox injections too. He has also had some other medical plastic surgery, like having cysts or tumors removed, which while expensive- we wouldn’t call cosmetic.\n\nKris Jenner When your daughter is getting married, we all push the boat out a little, perhaps flashing the cash at an expensive new outfit we might only wear the once, or lavishing gifts on family and friends who have come for the big day. But not many of us indulge in over $70,000 worth of plastic surgery and then air it on television during an episode of Keeping up with the Kardashians. But when Kim tied, the knot that’s exactly what Kris did, with breast enhancements, nose jobs (plural) facial fillers, laser surgery and more.\n\nAdele The singer with the world’s biggest voice lost a whole lot of weight and looked considerably smaller at one point in her career. While the official party line is that it was down to throat surgery which stopped her eating for some time, the rumors that she had liposuction have never really gone away. She also seems to have had some work done on her nose, with a much smaller tip and bridge than in older photos. A powerful role model to women everywhere, we love her no matter what!\n\nChristopher Maloney Chris was a contestant on popular talent show The X Factor in 2012, and unfortunately, some hateful viewers made his life hell while he competed. He received correspondence of all kinds on social media and offline too, even going as far as death threats because he was supposedly not good looking, and had a large nose. Chris’s self esteem couldn’t recover, and he bought two nose jobs, an eye lift, teeth veneers and even hair transplants to make himself feel more classically handsome. Although he’s happy with his looks now, he doesn’t recommend that kind of drastic action to others.\n\nBrad Pitt Even Hollywood’s hottest hunks have insecurities, and supposedly, Brad Pitt was always conscious of his ears. While they look pretty perfect to us, he is told to have had surgery to have them pinned back, making them less obtrusive on his head. While many celebs opt for nose jobs, this wasn’t something Brad ever thought of, as it was his ears which left him feeling worried. He is growing old gracefully, with signs of greying hair and wrinkles around his eyes only increasing his charm.\n\nRumer Willis Rumer might be the offspring of the most famous celebrity couple of all time, as her parents are Demi Moore and Bruce Willis. You can see that she naturally got their good looks, but she seems to be following her mother’s footsteps at a young age, and has already chalked up quite a hefty bill for her cosmetic surgeries, including jawline reconstructive surgery and a rhinoplasty. She has also had some Botox and lip injections done, as you can see by her transformation.\n\nDemi Moore In recent years, Demi has ‘fessed up to the media about going under the knife in her efforts to stay youthful. She has had facelifts, breast implants, liposuction and at least one nose job. All of that work appears to be doing its job, as she certainly does not look like a woman in her fifties! She was known for her relationship with younger man Ashton Kutcher, which may have given her another reason to stay looking young.\n\nRyan Gosling There are probably few women who could resist the charms of My Ryan Gosling, but did you know that he likely had a rhinoplasty before his career took off? In the photos here, you can see that the bridge of his nose is now much straighter, and his whole face looks a lot more classically handsome as a result. The star, known for movies like The Notebook is now regularly placed amongst Hollywood’s sexiest male actors.\n\nCher Love her or hate her, Cher has been in the spotlight her entire life, with hits spanning over half a century. Her most famous song might be with her late Husband, the iconic I got you Babe which is still a classic. She was also known as an actress and a model, an area where lots of celebrities choose to have enhancements done. Cher’s include eyelid alterations, nose jobs and chest augmentations, too. She’s also had plenty of Botox injections to keep her skin looking smooth.\n\nHeidi Montag The former reality TV star got famous by appearing in The Hills with her boyfriend, now husband, Spencer Pratt. The couple were loved and hated far and wide, and Heidi got a ton of grief for her decisions to go under the knife. She says that she was so deeply insecure that she once had ten procedures done in one day! She regularly speaks out about her regrets about how much money she blew on her previous lifestyle, as well as her LA plastic surgery obsession.\n\nKenny Rogers Kenny Rogers is most famous for his country music, and is a crooner who probably most of our parents would swoon at the name of. But after some botched plastic surgery, including an eyelid lift which did not come out as planned, he spoke out against plastic surgery. “I’m not happy about it” he said, “it drives me crazy!” His looks certainly changed before and after, and many people would say not for the better.\n\nRenee Zellweger Renee is known for making some changes to her face and body, for example slimming down and then bulking up for her role as Bridget Jones in the popular movie franchise. But when she stepped out in 2014 onto the red carpet, her fans said she was ‘unrecognisable’. Renee has always denied plastic surgery rumors, saying that she was simply preoccupied that day, making her look different. She says that “a woman only gets more interesting as she gets older”.\n\nCourtney Cox The Friends star has had tons of speculation about what plastic surgery she has had over the years, while she is 53 years old, she could easily pass for a woman in her thirties. She has never confirmed rumors of a nose job or any work to her face, but she has spoken out about going overboard with facial fillers and Botox injections. She has since had them all dissolved, and says “I feel better because I look like myself. I think that I now look more like the person that I was. I hope I do.”\n\nSharon Osbourne Being married to Ozzy Osbourne means that life is always under media scrutiny, and Sharon wanted to make sure she didn’t leave looking her absolute best up to chance. However, she has now publicly said she would not want to go under the knife ever again, and that she’s actually worried about how much she relied on it in the past. “There’s not much I haven’t had tweaked, stretched, peeled, lasered, veneered, enhanced or removed altogether.”\n\nRobert Pattinson The twilight heartthrob wasn’t always as in demand as he currently is, and the rumors are that Robert got himself a rhinoplasty when he couldn’t get into modelling as a teen. Some people also say that Pattinson used cheek implants to fill out his face better for the Hollywood scene. Consistently voted as one of the sexiest men alive, Roberts surgery clearly hasn’t done his popularity any harm, so if the rumors are true-he is probably pretty pleased with his choice.\n\nIggy Azalea Iggy Azalea is an Australian rapper best known for her rivalry in the charts with superstar Nicki Minaj. She has striking blonde looks, but decided to go for a breast augmentation to give herself a larger chest. She appeared on the Ellen show, with an empowering message for anyone considering plastic surgery. “There was nothing wrong with me. I think it’s a personal choice and anybody, man or woman, they should be able to make an informed decision, and if you want to change something, then that’s up to you.”\n\nAmanda Bynes Can we make a guess that this young celebrity is one to watch for overdoing her plastic surgery in later life? Amanda Bynes has spoken out about her much she loves plastic surgery, telling her fans she has had a couple of nose jobs to fix what she calls the webbing between her eyes. She has also had a boob job, and some other work done too. Some say she already has made a negative and dramatic transformation from what she looked like as a child star. She recently said on Twitter, “I plan on having surgery on my whole face, straight up.”\n\nMegan Fox Her first shot at stardom came from her role as the lead female in Transformers, but since then she has taken the world, and Hollywood by a storm. She has been rumored to have had two nose jobs, as well as a breast augmentation surgery, cheek implants, and both lip fillers and Botox, too. All of this cost her a neat $8,000, and she was already known as one of the movie world’s sexiest women before she even changed one thing!\n\nPamela Anderson You might think of Pamela Anderson as one of the most sought after women in the world, someone who the women want to look like, and the men want to get close to in any way possible! But Pamela has struggled to keep in the public eye as she’s grown older, and used some of her hard earned Baywatch cash to pay for breast implants and facial tightening procedures which keep her looking young. Her boob jobs are now one of the most famous things about her.\n\nJoan Rivers The late Joan Rivers was arguably one of the best comedians of all time, and unfortunately she passed away in 2014. It is likely that none of the female comedians of today would be where they are without her legacy. Her plastic surgery was something she was known for, having a shocking 739 procedures over her lifetime, which might be the record amongst our celebrities! She continued having surgery well into her golden years, and her career also stayed strong throughout.\n\nJennifer Aniston While Jen has never confirmed going under the knife, experts have speculated that she has had two nose jobs and a facelift in the past two decades, to keep her looking so young. Some people put her youthful looks down to an extensive skincare and beauty regimen which might have cost her as much as $1.5 million, when you consider the treatments she is vocal about enjoying, such as her famous laser and ultrasound ‘no scalpel’ facials which she has as much as once per month. Her eyebrows alone are rumored to cost $900 per year.\n\nDolly Parton Whether you’re a fan of growing old gracefully, or using science to keep the sands of time trickling slowly, you have to admire Dolly Parton. The country singer has been in the limelight for over half a century, and is now in her seventies, still going strong! Her procedures over the years have caused some to say that she looks terrible, but that’s for you to decide. She’s spent money on a nose job, facial fillers, a lip lift, neck lift, brow lift and eyelid lift over the years.\n\nBritney Spears As someone who has been in the public limelight for two decades, its surprising there aren’t more rumors about Britney having plastic surgery. She has always maintained that she doesn’t want to go under the knife, and actually, she looks like she is doing a pretty great job of naturally ageing. She does admit to having what she calls ‘fun stuff’ done, which includes lip fillers and facials. Many celebs learn to regret their lip work, but hers always seems pretty natural looking.\n\nKylie Jenner OK! Magazine have reported that all of Kylie Jenner’s surgeries might have cost her as much as two million dollars, and may also be in an attempt to look more like Kim Kardashian! Kylie has only publicly admitted to her lip fillers, allegedly decided on, after a date said to her he didn’t think she would be any good at kissing! The rumors are that she’s also had breast implants, Botox, and several other procedures, despite her claims that she has not.\n\nKim Kardashian It’s not surprising to find any of the Kardashians on this list, and TV personality, model and reality TV star Kim has certainly made some changes to her appearance since she stepped out into the public limelight. She has spent over $15,000 on her new look, which includes a nose job, liposuction, and both breast and buttock implants. She’s now best known for her high profile marriage to Kanye West, and their two kids, North and Saint.\n\nNicki Minaj Nicki Minaj is a role model for a lot of young black women, as well as a huge celebrity. Her signature look is not exactly natural however. In fact, she’s had over $11,000 worth of work to get to where she is today. This includes skin bleaching, buttock implants, and a nose job, or rhinoplasty. She is known for her quirky and fun outfits which include dying her hair or wearing wigs, and always displaying her own brand of confidence.\n\nTara Reid Tara made her debut in the hit comedy series, American Pie, and has been a Hollywood beauty ever since. She is a good reminder that plastic surgery doesn’t always go as planned, and needed to have the damages corrected from her own breast augmentation and tummy tuck that she had when she was younger. In 2009, she was featured in Playboy magazine and said that the damage to the skin on her torso from those surgeries was now corrected entirely.\n\nMeg Ryan While it might not be the most expensive transformation on our list, many were shocked by Meg Ryan’s cosmetic enhancements, and felt she had gone overboard, making her lips too big and her face look like plastic. Especially as she is known as such a ‘fresh-faced’ and natural looking actress, the change was startling for many. She has had quite a few procedures, including neck lifts and many facial fillings, supposedly to keep herself looking young.\n\nLindsay Lohan The speculations over the years about the cosmetic surgery that the Mean Girls star has had have been pretty wild. Boob jobs, nose jobs, facial implants, you name it she’s supposedly had it. But Lindsay has never confirmed any rumors, even denying that she has had Botox to keep her looks young. She did tell her Instagram fans that she has tried out Caci, which is a treatment which uses electrical currents in the facial muscles to keep them smooth.", "images": ["https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15085825/trista-sutter.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081355/nicole-kidman.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15093301/tori-spelling.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10084310/kylie-jenner.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093540/kenny-rogers.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15082233/chris-maloney.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082510/David-Gest.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19092922/ryan-gosling.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093203/Anna-Faris.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093021/Adele.jpg", "https://web.archive.org/web/20171004185422im_/http://www.hyperactivz.com/wp-content/themes/hyperaktivz/images/logo.png", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083634/roseanne-barr.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15091104/iggy-azalea.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19094056/lindsay-lohan.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082552/janice-dickinson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15094700/britney-spears.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093437/Nikki-Cox.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093628/robert-pattinson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082327/kim-kardashian.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15083648/la-toya-jackson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19094229/john-travolta.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15092900/clay-aiken.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083552/pete-burns.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083710/caitlyn-jenner.jpg", "https://web.archive.org/web/20171004185422im_/http://b.scorecardresearch.com/p?c1=2&c2=20535424&cv=2.0&cj=1", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15083126/jennifer-aniston.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083100/donatella-versace.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15100355/amanda-bynes.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15090227/kim-novak.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093341/tom-cruise.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083241/vivica-fox.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/26100353/plasticintro.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15093800/nicole-richie.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15095042/kourtney-kardashian.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082026/nadya-suleman.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19092821/Brad-Pitt.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10084346/jocelyn-wildenstein.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083337/lara-flynn-boyle.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10084225/michael-jackson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15084402/heather-locklear.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15085055/denise-richards.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19094343/ellen-pompeo.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093113/michael-douglas.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081845/Nicki-Minaj.png", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082656/nene-leakes.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083419/kathy-griffin.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15095709/tom-jones.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081947/meg-ryan.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19094514/clare-danes.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/10/02134508/aj-e1506951921845.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15092301/ashlee-simpson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10084129/heidi-montag.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081746/pamela-anderson.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083922/sharon-osbourne.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15091936/holly-madison.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081453/blake-lively.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082131/Victoria-Beckham.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10084035/cher.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082243/Diana-Agron.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083958/demi-moore.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093935/renee-zellweger.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083808/Joan-Rivers.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081537/Megan-Fox.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15081202/barry-manilow.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15090706/courtney-love.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083503/mickey-rourke.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083022/dolly-parton.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082934/kelly-rowland.png", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081659/tara-reid.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093841/courtney-cox.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10082429/Lil-kim.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10081623/Suzanne-Somers.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/15081703/kris-jenner.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/19093250/barbie-girl.jpg", "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/10083844/rumer-willis.jpg"], "top_img": "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/26100353/plasticintro.jpg", "keywords": [], "authors": ["Lilah Olsher", "Matthew Jacobson", "Lauren Fazackarley", "Jamie Carlton"], "canonical_link": "https://web.archive.org/web/20171004185422/http://www.hyperactivz.com/expensive-celebrity-plastic-surgeries-safe", "title": "The World's Most Expensive Celebrity Plastic Surgeries", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Many celebrities are known for going under the knife to make changes to their bodies or faces. Who has spent the most on surgery, and was it worth the cost?", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "The World's Most Expensive Celebrity Plastic Surgeries", "description": "Many celebrities are known for going under the knife to make changes to their bodies or faces. Who has spent the most on surgery, and was it worth the cost?", "url": "https://web.archive.org/web/20171004185422/http://www.hyperactivz.com/expensive-celebrity-plastic-surgeries-safe", "site_name": "HyperActivz", "updated_time": "2017-10-04T09:03:57+00:00", "image": {"identifier": "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/26100353/plasticintro.jpg", "width": 2400, "height": 1600}}, "article": {"tag": "Safe", "section": "Celebrity", "published_time": "2017-10-02T11:16:01+00:00", "modified_time": "2017-10-04T09:03:57+00:00"}, "twitter": {"card": "summary", "description": "Many celebrities are known for going under the knife to make changes to their bodies or faces. Who has spent the most on surgery, and was it worth the cost?", "title": "The World's Most Expensive Celebrity Plastic Surgeries", "image": "https://web.archive.org/web/20171004185422im_/http://d1nnx3nhddxmeh.cloudfront.net/wp-content/uploads/2017/09/26100353/plasticintro.jpg"}, "generator": "WordPress 4.5.10"}, "movies": [], "publish_date": 1506942961.0, "source": "https://web.archive.org", "summary": ""}