{"url": "https://en.wikipedia.org/wiki/Ben_Platt_(actor)", "text": "American actor\n\nBenjamin Schiff Platt (born September 24, 1993)[1] is an American actor, singer, and songwriter. He began his career in theater as a child and has appeared in Broadway productions of The Music Man (2002), The Book of Mormon (2012–2013), and Dear Evan Hansen (2015–2017), receiving multiple accolades for his performance as the title character in the latter, including the 2017 Tony Award for Best Actor in a Musical.[2][3] Platt's film credits include roles in Pitch Perfect (2012), Pitch Perfect 2 (2015), and Ricki and the Flash (2015). He currently stars in the Netflix TV show The Politician, for which he was nominated for the Golden Globe Award for Best Actor – Television Series Musical or Comedy in 2019.\n\nPlatt signed with Atlantic Records in 2017 and released his debut studio album, Sing to Me Instead, in March 2019.\n\nEarly life and education [ edit ]\n\nPlatt was born in Los Angeles, the fourth of five children of Julie (née Beren) and Marc Platt. His father is a film, television, and theater producer whose credits include Legally Blonde, Into The Woods, La La Land, Mary Poppins Returns, and the musical Wicked.[4] He and his family are Jewish.[5][6][7]\n\nHe attended the Adderley School for Performing Arts in Pacific Palisades, performing in productions like Bye Bye Birdie and Into the Woods. Platt attended Harvard-Westlake School in Los Angeles, graduating in 2011. He then enrolled at Columbia University in New York but dropped out after six weeks to fulfill his contract with The Book of Mormon. During his time at Columbia, he was a member of the campus a cappella musical group Nonsequitur.[4][8]\n\nCareer [ edit ]\n\n2002–2014: Early stage work and The Book of Mormon [ edit ]\n\nAt 9 years old, Platt played Winthrop Paroo in The Music Man at the Hollywood Bowl alongside Kristin Chenoweth.[9] At 11, he appeared in a brief national tour of Caroline, or Change, by Jeanine Tesori and Tony Kushner. At 17, he played Jean Valjean in Kidz Theater's production of Les Misérables. His other early roles include the role of Claude Bukowski in Columbia University's production of Hair: The American Tribal Love-Rock Musical.[10] He has also collaborated on a workshop of Alice by Heart, by Duncan Sheik and Steven Sater, a new take on Alice in Wonderland.\n\nIn 2012, Platt was cast as Elder Arnold Cunningham in the Chicago production of The Book of Mormon. The show premiered at the Bank of America Theatre on December 19, 2012, after a week of previews.[11] The production was well received and closed on October 6, 2013.[12] Critics lauded Platt's performance, calling him a \"true revelation in this brand new Chicago production...He really leans into this part, throwing himself out there with the abandonment of youth\".[13] Platt later reprised his role as Elder Cunningham on Broadway at the Eugene O'Neill Theatre from January 7, 2014 to January 6, 2015.[14]\n\n2015–2017: Film career and Dear Evan Hansen [ edit ]\n\nIn 2012, Platt had a supporting role in the musical comedy Pitch Perfect, loosely based on the non-fiction book Pitch Perfect: The Quest for Collegiate A Cappella Glory. Platt played the magic-loving Benji Applebaum, alongside an ensemble cast comprising Anna Kendrick, Skylar Astin, Rebel Wilson, Adam DeVine, Anna Camp, and Brittany Snow. The film emerged as a major commercial success and received mostly positive reviews from critics. He was subsequently nominated at a Teen Choice Awards in the category Choice Movie: Male Scene Stealer for his work.[15] In 2015, Platt reprised his role as Benji Applebaum in the sequel, Pitch Perfect 2. He has since made film appearances in Ricki and the Flash and Billy Lynn's Long Halftime Walk.\n\nPlatt became attached to Pasek and Paul's then Untitled P&P Project in 2014, participating in early read-throughs and workshops.[16] By 2015, the musical, titled Dear Evan Hansen, had begun production in Washington, D.C. at the Arena Stage with Platt originating the titular role. The show premiered on July 9, 2015 and closed August 23, 2015.[17] The overwhelming positive reception toward the production and Platt's performance resulted in the show being transferred to Off-Broadway.[18]\n\nIn 2016, Platt once again originated the role of Evan Hansen at Second Stage Theatre. Platt and the cast played a month of previews, beginning on March 26, 2016, before premiering on May 1, 2016. The limited engagement sold out its entire run with Platt playing his last performance on May 26, 2016.[19][20][21]\n\nBen Platt in 2017\n\nIn December 2016, Platt originated the title role in Dear Evan Hansen on Broadway at the Music Box Theatre. Critics hailed his work, calling it \"historic\" and \"one of the greatest leading male performances ever seen in a musical\".[22][23][24] For his performance, Platt won numerous awards including the Tony Award for Best Actor in a Musical. Platt played his final performance on November 19, 2017.[25]\n\nOn November 29, 2018, it was announced that Universal Pictures and Platt's father, Marc Platt, secured the film rights to the musical.[26][27]\n\n2017–present: Music and The Politician [ edit ]\n\nIn 2017, Platt signed a record deal with Atlantic Records.[28] On January 28, 2018, he performed Leonard Bernstein's \"Somewhere\" live at the 60th Annual Grammy Awards accompanied by Justin Goldner and Adele Stein and arranged by Alex Lacamoire.[29][30]\n\nOn March 19, 2018, Platt and Hamilton creator Lin-Manuel Miranda released \"Found/Tonight\", a mashup of the Hamilton song \"The Story of Tonight\" and the Dear Evan Hansen song \"You Will Be Found\".[31] Platt donated a portion of the proceeds to support the March for Our Lives anti-gun-violence initiative, and also performed on stage with Miranda at the rally in Washington, D.C. on March 24, 2018.[32][33][34] Platt starred opposite Damian Lewis, Nina Dobrev, and Mena Massoud in the Rob Ford historical fiction thriller Run This Town.[35] The casting of Platt caused minor controversy, over allegations that the filmmakers were appropriating the story of female reporter Robyn Doolittle.[36]\n\nIn January 2019, Platt announced that his debut studio album Sing to Me Instead was scheduled for release on March 29, 2019. It was made available for pre-order, along with the songs \"Bad Habit\" and \"Ease My Mind\" a few days later. Following the release of his debut album, Platt embarked on his first North American tour in May 2019.[37][38] The tour ended on September 29, 2019 at Radio City Music Hall in New York City, in which the concert there was taped for release on Netflix on an unconfirmed date.[39] Platt released a new single \"Rain\" on August 23, 2019, followed by a music video on September 10, 2019.[40]\n\nOn August 29, 2019, it was announced that Platt would be starring in Richard Linklater's film adaptation of Merrily We Roll Along alongside Beanie Feldstein and Blake Jenner. The project is set to be shot over the course of twenty years, with principal photography of the first sequence of the film having already been completed prior to the announcement.[41]\n\nPlatt currently stars as Payton Hobart on the Netflix comedy-drama series The Politician.[42] Platt's casting was announced in March 2018,[43] and the series premiered on September 27, 2019.[44] He received a Golden Globe Award nomination for Best Actor – Television Series Musical or Comedy for his performance in the series' first season.[45]\n\nPersonal life [ edit ]\n\nPlatt is openly gay; he came out to his family when he was twelve years old, and publicly in 2019, through the music video for his song \"Ease My Mind\".[46]\n\nTheatre credits [ edit ]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nDiscography [ edit ]\n\nStudio albums [ edit ]\n\nSoundtrack and cast albums [ edit ]\n\nSingles [ edit ]\n\nTitle Year Peak chart positions Album US\n\n[60] US Digital\n\n[61] US Dance\n\n[62] \"Waving Through a Window\" 2017 — — 1 Dear Evan Hansen\n\n(Original Broadway Cast Recording) \"Found / Tonight\"\n\n(with Lin-Manuel Miranda 2018 49 1 — non-album single \"Bad Habit\" 2019 — — — Sing to Me Instead \"Grow as We Go\" — — — \"Rain\" — — — non-album single\n\nPromotional singles [ edit ]\n\nTitle Year Album \"Ease My Mind\" 2019 Sing to Me Instead \"Grow as We Go\" \"Temporary Love\"\n\nTours [ edit ]\n\nSing to Me Instead Tour (2019)\n\nAwards and nominations [ edit ]\n\nDear Evan Hansen cast member Platt and fellowcast member Rachel Bay Jones with their Tony Awards\n\nPlatt was nominated for an Outer Critics Circle Award, a Drama League Distinguished Performance Award, and won[63] the Obie Award[64] for Distinguished Performance by an Actor and Lucille Lortel Award for Outstanding Lead Actor in a Musical for Dear Evan Hansen's Off-Broadway run in 2016.[65]\n\nOn May 19, 2017, at the 83rd annual Drama League Awards, it was announced that Platt had won the organization's Distinguished Performance Award. This award, which recognizes a performance on the New York stage in the past year, can only be won once in a performer's career. In winning, at the age of 23, for his work in Dear Evan Hansen, Platt became the youngest winner in the award's history.[66] On June 11, at the 71st Tony Awards, Platt won the Tony Award for Best Actor in a Musical being the youngest actor to win this award solo.[67]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Ben_Platt_%26_Rachel_Bay_Jones_with_their_Tony_Awards.jpg/220px-Ben_Platt_%26_Rachel_Bay_Jones_with_their_Tony_Awards.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/BenPlattInAnElevator.jpg/220px-BenPlattInAnElevator.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Run_This_Town_cast_-_Ben_Platt_%2833463322408%29_%28cropped%29.jpg/220px-Run_This_Town_cast_-_Ben_Platt_%2833463322408%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/1/10/Run_This_Town_cast_-_Ben_Platt_%2833463322408%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/10/Run_This_Town_cast_-_Ben_Platt_%2833463322408%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ben_Platt", "title": "Ben Platt", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/1/10/Run_This_Town_cast_-_Ben_Platt_%2833463322408%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}