{"url": "https://web.archive.org/web/20080226201453/http://ap.google.com:80/article/ALeqM5isOFwdbq0tsqatW6vJpkDRTI1gMgD8V0T1JO0", "text": "Democratic presidential hopeful Sen. Barack Obama, D-Ill., looks on as he walks along his tour of the National Gypsum plant Sunday, Feb. 24, 2008, in Lorain, Ohio. (AP Photo/Rick Bowmer)\n\nObama Hits Clinton on NAFTA Support\n\nLORAIN, Ohio (AP) — Barack Obama accused Democratic presidential rival Hillary Rodham Clinton on Sunday of trying to walk away from a long record of support for NAFTA, the free trade agreement that he said has cost 50,000 jobs in Ohio, site of next week's primary.\n\nAt the same time, he said attempts to repeal the trade deal \"would probably result in more job losses than job gains in the United States.\"\n\nOne day after Clinton angrily accused him of distorting her record on the North American Free Trade Agreement in mass mailings, the Illinois senator was eager to rekindle the long-distance debate, using passages from the former first lady's book as well as her own words.\n\n\"Ten years after NAFTA passed, Senator Clinton said it was good for America,\" Obama said. \"Well, I don't think NAFTA has been good for America — and I never have.\"\n\n\"The fact is, she was saying great things about NAFTA until she started running for president,\" Obama told an audience at a factory that makes wall board, located in a working class community west of Cleveland.\n\n\"A couple years after it passed, she said NAFTA was a 'free and fair trade agreement' and that it was 'proving its worth.' And in 2004, she said, \"I think, on balance, NAFTA has been good for New York and America,\" he said.\n\nThe trade agreement has long been unpopular in the industrial Midwest, where critics blame it for lost jobs and shuttered factories, many of which once employed union workers who tend to vote Democratic.\n\nOhio and Texas both hold primaries next week, with 334 delegates combined, and former President Clinton has said publicly his wife probably needs to win both of them if she is to win the Democratic presidential nomination.\n\nVermont and Rhode Island also hold primaries on March 4, but have far fewer delegates and have not attracted nearly as much attention.\n\nOn another issue, Obama said he was not concerned that Republicans might attempt to depict him as unpatriotic if he becomes the Democratic nominee.\n\nAsked about a series of events, such as not placing his hand over his heart during the national anthem, he said, \"The way I will respond to it is with the truth. That I owe everything I am to this country.\"\n\nHe also said patriotism had more than one definition, and that Republicans had presided over a war \"in which our troops did not get the body armor they needed\" or were sent into the war zone without enough training.\n\nPolls show Clinton with a narrowing lead in Ohio, where trade has long been a sensitive issue.\n\nGiven that backdrop, the issue is the core of Obama's drive to win the Ohio primary and possibly force Clinton from the race.\n\nAt the news conference, he noted that she had said Saturday that the agreement was negotiated by President George H.W. Bush, and passed and signed into law while her husband was in the White House.\n\nHe said Clinton has \"essentially presented herself as co-president during the Clinton years. Every good thing that happened she says she was a part of and so the notion that you can selectively pick what you take credit for and then run away from what isnt politically convenient, that doesnt make sense.\"\n\nOn Saturday, Clinton called attention to her plan to fix problems with NAFTA and a commitment against any future trade deals \"unless they are positive for American workers.\"\n\nTo an audience of Boilermakers Union members and their families, Obama promised the same thing, with particular attention paid to labor and environmental concerns.\n\n\"Now, if we're honest with ourselves, we'll acknowledge that we can't stop globalization in its tracks and that some of these jobs aren't coming back,\" he said. \"But what I refuse to accept is that we have to stand idly by while workers watch their jobs get shipped overseas.\"", "images": ["https://web.archive.org/web/20080226201453im_/http://ap.google.com/hostednews/img/vertical-space.gif", "https://web.archive.org/web/20080226201453im_/http://ap.google.com/hostednews/img/google-logo-hosted.gif", "https://web.archive.org/web/20080226201453im_/http://ap.google.com/hostednews/img/ap_logo.gif?hl=en", "https://web.archive.org/web/20080226201453im_/http://ap.google.com/media/ALeqM5j4MSEz2xPnACdNkIGyGj7FFH4mTw?size=s"], "top_img": "", "keywords": [], "authors": ["David Espo"], "canonical_link": "", "title": "The Associated Press: Obama Hits Clinton on NAFTA Support", "meta_data": {"googlebot": "unavailable_after: 25-Mar-2008 13:14:32 PDT"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}