{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "text": "Raniere is the founder of NXIVM, which bills itself as a self-help and empowerment organization, but is described by authorities as a cultlike group whose members recruited women to be sex slaves, and branded their pubic regions with Raniere’s initials.\n\nAD\n\nAD\n\nThe Rochester Democrat & Chronicle said Mack was indicted “for her role in DOS, a group … that purported to be a women’s empowerment sorority. Prosecutors, however, say DOS was actually a sex-slave ring led by Raniere, with women known as ‘slaves’ who reported to ‘masters’ who ultimately reported to Raniere himself. Mack is an alleged co-conspirator, reporting directly to Raniere.”\n\nMack, 35, is alleged by prosecutors to have recruited slaves for pay, forcing the women to have sex with Raniere, and using explicit photos and damaging information to ensure their compliance.\n\nAccording to the Associated Press, prosecutors said Mack told recruits that they were joining a female mentorship group.\n\nAD\n\n“Mack and other … masters recruited … slaves by telling them that they were joining a women-only organization that would empower them and eradicate purported weaknesses the NVIVM curriculum taught were common in women,” prosecutors said.\n\nAD\n\nBut “the victims were then exploited, both sexually and for their labor to the defendants’ benefit,” said U.S. Attorney Richard P. Donoghue of the Eastern District of New York in Brooklyn.\n\nAssistant U.S. Attorney Moira Kim Penza also said in court that “under the guise of female empowerment,” Mack “starved women until they fit her co-defendant’s sexual ideal,” the AP wrote.\n\nMack starred in the CW Network series about Clark Kent’s youth in Smallville, Kan. before he became Superman, playing Clark Kent’s friend Chloe Sullivan from 2001 to 2011. She has also been in a handful of television series roles since, according to her IMDB page.\n\nAD\n\nAccording to CBS News:\n\nFormer NXIVM publicist Frank Parlato told Inside Edition that Mack is “completely enamored with Raniere and completely under his thrall.” He also said that Mack and her “Smallville” co-star, Kristin Kreuk, were used as “poster girls for normalizing the group.” Kreuk says she left NXIVM years ago and commended the women who exposed DOS.\n\nRaniere, 57, known to his followers as ‘the Vanguard’ — was living in a villa in Puerto Vallarta with several women, according to federal prosecutors, before he was apprehended in March. Mexican authorities took him into custody and delivered him to Texas; he’s now in federal custody in Brooklyn. As Raniere was taken from the villa, The Post’s Kyle Swenson wrote, citing prosecutors, the women chased after authorities in their own car at high speed.\n\nAD\n\n“In my opinion, NXIVM is one of the most extreme groups I have ever dealt with in the sense of how tightly wound it is around the leader,” cult expert Rick Ross told the Times-Union in 2012.\n\nAD\n\nThe U.S. Attorney’s Office in Brooklyn last week wrote in court documents that Rainere has “a decades-long history of abusing women and girls,” and accused him of having sex with minors.\n\nIn a statement attributed to Raniere on NXIVM’s website, he proclaimed his innocence and said he believed the justice system would prevail. He also denied affiliation with DOS, the sorority.\n\nThe Times-Union, however, wrote that “federal court records indicate emails seized from Raniere’s private messaging accounts support the conclusion that Raniere created the club, which was known as ‘Dominus Obsequious Sororium,’ which means ‘Master Over the Slave Women.’ ”\n\nAD\n\nRead more:", "images": ["https://www.washingtonpost.com/resizer/asw0f8TYsz4umjS9_plTHW2DNUU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/eb36a92f-632b-489a-aafc-7aa939f469f7.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/asw0f8TYsz4umjS9_plTHW2DNUU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "keywords": [], "authors": ["Keith Mcmillan", "General Assignment Desk"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "title": "‘Smallville’ actress Allison Mack accused of recruiting women for sex-cult leader", "meta_data": {"description": "Federal prosecutors allege that the actress was a top lieutenant to \"cult\" leader Keith Rainere, who is also indicted for sex trafficking and forced labor.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/04/20/smallville-actress-allison-mack-arrested-for-recruiting-women-for-sex-cult-leader/", "image": "https://www.washingtonpost.com/resizer/asw0f8TYsz4umjS9_plTHW2DNUU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67UREMBPLM2NDKXFY4XM4KGD4Q.jpg", "title": "‘Smallville’ actress Allison Mack accused of recruiting women for sex-cult leader", "description": "Federal prosecutors allege that the actress was a top lieutenant to \"cult\" leader Keith Rainere, who is also indicted for sex trafficking and forced labor."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘Smallville’ actress Allison Mack accused of recruiting women for sex-cult leader", "description": "Federal prosecutors allege that the actress was a top lieutenant to \"cult\" leader Keith Rainere, who is also indicted for sex trafficking and forced labor."}, "last_updated_date": "2018-04-21T15:51:21.971Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1524153600.0, "source": "https://www.washingtonpost.com", "summary": ""}