{"url": "www.elitedaily.com/p/the-kardashians-reactions-to-khloe-kardashians-baby-girl-are-so-so-cute-8514459", "text": "I don't know who is more excited about Khloé's new baby: The Kardashian family or me. (Probably the family, but it might actually be a close call.) By now you've most definitely heard that on April 12, TMZ reported Khloé Kardashian gave birth to her daughter and wow, I feel so emotional just writing that. Don't judge... Kardashian babies just bring it out in me, OK? But now that Kardashian's baby has arrived, the world is so, so happy about it, and of course, the Kardashians' reactions to Khloé Kardashian's baby make me want to cry tears of pure joy. There is too much love, you guys.\n\nUPDATE 2: Kim Kardashian also opened up about Khloé giving birth. She tweeted on April 13, \"@khloekardashian I’m so happy for you! Your baby girl is so beautiful! You are so strong, you made that look so easy! I can’t wait for our baby girls to grow up as best friends the way we are! I’m so happy I was able to return the favor of holding your leg while you pushed LOL.\" She also tweeted, \"You guys she’s so gorgeous!!!!!\"\n\nUPDATE 1: Kylie Jenner has also sent her congratulations to her big sister on the birth of her baby girl. Jenner posted a photo to Snapchat using a filter that read, \"Kongrats, Khloé! It's a girl!\"\n\nEARLIER: Before we dive into the Kardashian love-fest, let's go back to where it all began: That fateful day of Dec. 20, 2017, when Khloé Kardashian gave the world a Christmas miracle in the form of an Instagram post confirming her pregnancy.\n\nShe wrote,\n\nMy greatest dream realized! We are having a baby! I had been waiting and wondering but God had a plan all along. He knew what He was doing. I simply had to trust in Him and be patient. I still at times can't believe that our love created life! Tristan, thank you for loving me the way that you do! Thank you for treating me like a Queen! Thank you for making me feel beautiful at all stages! Tristan, most of all, Thank you for making me a MOMMY!!! You have made this experience even more magical than I could have envisioned! I will never forget how wonderful you've been to me during this time! Thank you for making me so happy my love!\n\nI will never *not* cry at this announcement, TBH.\n\nAs if she didn't do enough simply by sharing her pregnancy, she went on The Ellen DeGeneres Show and discussed potential name ideas, though at the time, she had no clue whether she was having a boy or a girl. \"I think if it's a boy I'll go with Tristan Junior,\" she said, adding, \"For a girl I don't even know where to begin. I think I'll go with a K or a T name though.\"\n\nThe video, which you can check out below, had me screaming:\n\nTheEllenShow on YouTube\n\nGod bless Khloé Kardashian.\n\nWe of course know Kardashian revealed her baby's sex on the season finale of Keeping Up With The Kardashians, telling her family and fans that she was expecting a little girl:\n\nAnd then wrote the sweetest message on Twitter, feeling very fortunate to be having a little lady. She wrote,\n\nI am now so excited my daughter will have forever best friends with Chicago and Stormi!! God is great!!! Thank you Lord for our princess\n\nFans loved seeing Kardashian's reaction about the reveal. Too sweet for words.\n\nWhen reports first came out that Kardashian gave birth, the entire world collectively screamed and cried tears of joy. Many took to Twitter to express how excited they were.\n\nBut the most excited were obviously her siblings and her mom, Kris Jenner. Jenner posted a video of Kendall Jenner repeating the word \"baby,\" that was originally posted by W Magazine. The original caption read, \"When three of your sisters give birth in under a year. Congratulations to @KhloeKardashian on welcoming another girl to the KarJenner clan.\" Jenner reposted it, writing, \"BLESSED!!!\"\n\nKourtney Kardashian also posted an Instagram to her page that showed North West, Penelope Disick, and Tracy Romulus' daughter. The caption read, \"GIRL POWER.\" This caption could be a tiny clue that Kourtney was celebrating the birth of Khloé's daughter and the sisterhood that is their family.\n\nI am seriously swooning right now.\n\nI love how all the Kardashians are so supportive of one another and so excited for all of the new arrivals in their family as of late (looking at you, Chicago West and Stormi Webster).\n\nA big congratulations to Kardashian and the whole crew!", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/7c585711-1e53-4baf-9577-fbb76da42ec5-getty-1043857742.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/4/12/148cb66c-5c20-423c-90fb-09b30826856c-getty-492406132.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/4/12/148cb66c-5c20-423c-90fb-09b30826856c-getty-492406132.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/d2334b46-c781-4bdf-bc76-ef0a9b83a320-getty-1204840126.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/3/52cc0dfc-e395-4bd8-8f35-93c931a4008a-lead-image.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/12/148cb66c-5c20-423c-90fb-09b30826856c-getty-492406132.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/the-kardashians-reactions-to-khloe-kardashians-baby-girl-are-so-so-cute-8514459", "title": "The Kardashians' Reactions To Khloe Kardashian's Baby Girl Are So, So Cute", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/the-kardashians-reactions-to-khloe-kardashians-baby-girl-are-so-so-cute-8514459", "type": "article", "title": "The Kardashians' Reactions To Khloe Kardashian Giving Birth Are So, So Cute", "description": "I don't know who is more excited about Khloé's new baby: The Kardashian family or me. (Probably the family, but it might actually be a close call.) By now you've most definitely heard that on April 12, TMZ reported Khloé Kardashian gave birth to her…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/12/148cb66c-5c20-423c-90fb-09b30826856c-getty-492406132.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "I don't know who is more excited about Khloé's new baby: The Kardashian family or me. (Probably the family, but it might actually be a close call.) By now you've most definitely heard that on April 12, TMZ reported Khloé Kardashian gave birth to her…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}