{"url": "https://www.cosmopolitan.com/entertainment/celebs/a15926860/kylie-jenner-hidden-baby-bump-photos/", "text": "By now the whole world (unless you've been living under a rock) knows that Kylie Jenner is a new mom. She gave birth to a baby girl, her first child with boyfriend Travis Scott, on February 1.\n\nAll of Twitter let out a resounding finallyyy when she revealed the news, because Kylie's pregnancy was one of the worst kept secrets of 2017 (and early 2018, too). But she still deserves major kudos for how consistently she committed to not confirming the big important baby news at every possible opportunity.\n\n\n\nThe 20-year-old is part of one of the most famous, and most followed, families in America, yet the Keeping Up With the Kardashians star was not spotted with a full-on view of her pregnant belly (aside from that one grainy paparazzi photo shot on January 25). According to many reports, she had stopped leaving her house altogether — which is definitely one (drastic) way to hide a pregnancy.\n\nKylie continued to use social media to promote her Kylie Cosmetics products in the meanwhile, though, as well as appearing in photoshoots and fashion campaigns, by coming up with some pretty creative ways of maintaining that \"is she or isn't she?\" mystery. (We now know, she was!) So from oversized t-shirts to carefully-staged camera angles, here are all the ways in which she managed to keep her baby bump under wraps.\n\nShe wore a giant t-shirt to the iHeart Radio Music Festival:\n\nGetty Images\n\nOne day after news broke that Kylie was reportedly pregnant, she was photographed at the iHeart Radio Music Festival wearing an oversized black t-shirt. The wardrobe selection was an interesting choice because, even considering the Kardashian-Jenner fam's forays into athleisure of late, Kylie usually wears tighter, glam clothing at public appearances.\n\nAnd she quickly mastered the art of optical illusions:\n\nDuring a spa day with her girlfriends, Kylie posed at the edge of a photo where a mirror frame conveniently curved right by her stomach. At this point, she would not have been too far along in her pregnancy, so a bump would not have been too hard to hide.\n\nShe continued her sweats and t-shirt trend:\n\nWhile her best friend Jordyn Woods opted for a sexy, cleavage-baring top, Kylie stuck to her laid back aesthetic on a trip to a safari. Typically this outfit choice would not be out of the norm for any other 20-year-old, but this is Kylie Jenner we're talking about.\n\nShe posed in a big button-down shirt:\n\n\"Sasha's shirt,\" Kylie wrote, referencing her photographer and friend Sasha Samsonova in an Insta shared in October. The duo have frequently paired up for photoshoots, but they are typically a lot more risqué than the shot above.\n\nShe wore a parka in warm weather:\n\nLast time we checked, it's nowhere near freezing temperatures in Los Angeles in mid-October. So what gives?!\n\nShe appeared in a video with Khloé Kardashian (but only from the chest up):\n\nBabies or not, the Kardashian-Jenner businesses must keep booming. Kylie and her also-pregnant sister Khloé teamed up for a video to promote their Kylie Cosmetics collaboration, but strategically did not show either of their stomachs. Khloé, as we now know, is also expecting her first child.\n\nShe posed in an oversized jean jacket:\n\nKylie continued the trend of wearing baggy clothing by posting this photo of herself in an oversized blue-jean jacket on November 22.\n\nAnd attended the Kardashians' holiday dinner in another big shirt:\n\nWhile the Kardashians were in their usual over-the-top holiday ensembles, Kylie wore minimal makeup and (yet another) oversized shirt to the family holiday dinner that aired during an episode of Keeping Up With the Kardashians. She also stayed relatively low-key at her mother's annual Christmas party.\n\nShe was completely MIA from the Kardashian-Jenner Christmas card:\n\nA baby bump is hard to hide in a plain white t-shirt and a pair of jeans, so Kylie opted out of appearing in her family's annual Christmas photo altogether in 2017. Unless she was behind the Christmas tree all along, who knows?!?!?\n\nInstead, she hosted an ugly sweater party on her YouTube channel:\n\nKylie and her friends played a game of \"Never Have I Ever\" on November 29 while drinking tea on her Kylie Cosmetics channel. And come on, you mean no-one thought to ask \"never have I ever been pregnant!?\" Jeez.\n\nHere's why this is a genius move: While ugly sweater parties are a time-honored tradition, they are also inevitably loose knit sweater parties, which thus conveniently hide the baby bump of any given mega-celeb looking to keep her pregnancy a secret.\n\nShe used a blanket to hide her belly in her family's Calvin Klein campaign:\n\nKylie's midriff is the only one not showing in the sisters' Calvin Klein ad campaign (thanks to blankets, more baggy denim, and at one point, Khloé). A video the sisters shared on their social media pages also show strategic camera angles were used to hide Kylie's bottom half.\n\nAlso, the sisters also played another game of \"Never Have I Ever\" together and still nobody brought up pregnancy, come on now! (Would have been a great way for Kendall to score a point, tbh.)\n\nMeanwhile, she sprinkled in a few sexy throwback pics across her social feeds to throw us all off:\n\nWhat does every girl who's put on few pounds (whether it be from pregnancy or chocolate cake) do? Recycle old photos on the 'gram, of course. In the past few months, Kylie has shared a few revealing photos, but it's evident that none of these were taken recently.\n\nShe posed for a LOVE magazine photoshoot in a turtleneck:\n\nAmong other fashion content, LOVE magazine is known for its sexy Advent calendar and barely-there photoshoots (like Kim K.'s full-frontal spread). However, Kylie's new cover for the mag is a lot more demure, with her shot close-up, softly-filtered, and styled in a chunky red turtleneck sweater and matching lip.\n\nAnd then she also posed with a baby... lamb:\n\nIn a second photo released by LOVE, Kylie posed with a baby lamb over her belly. The lamb is adorable, but not quite the baby we were hoping to see Kylie holding in her arms in a new pic.\n\nAt this rate, it looks like we will only see Kylie pregnant if and when she decides to reveal these highly sought-after photos. Or, as the tabloid rumor mill has often suggested, we'll never see her pregnant at all and then, just like that, there'll be a baby! Surprise!", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-people-report-2017-1511368356.png?crop=1.00xw:0.502xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-pregnancy-announcement-1517410358.jpg?crop=1.00xw:0.753xh;0,0.0440xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a15926860/kylie-jenner-hidden-baby-bump-photos/", "title": "All of the Genius Ways Kylie Jenner Hid Her Baby Bump", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "All of the Genius Ways Kylie Jenner Hid Her Baby Bump", "description": "A lot of oversized clothing was involved.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a15926860/kylie-jenner-hidden-baby-bump-photos/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-16 05:14:56", "published_time": "2018-02-06 03:24:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "All of the Ways Kylie Jenner Kept Her Pregnancy a Secret - 10 Times Kylie Jenner Hid Her Baby Bump", "description": "Jenner has changed her wardrobe style in recent months and also done less public appearances since the news broke that she is reportedly expecting her first child with rapper Travis Scott.", "keywords": "kylie jenner, kylie jenner pregnant, kylie jenner baby bump, kylie jenner pregnancy photos, kylie jenner pregnant photos, kylie jenner baby bump photos, kylie jenner pregnant belly, kylie kardashians pregant, kylie pregnant", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2018-02-06T15:24:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-1517424082.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "All of the Genius Ways Kylie Jenner Hid Her Baby Bump", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1517858640.0, "source": "https://www.cosmopolitan.com", "summary": ""}