{"url": "https://www.townandcountrymag.com/style/a20241776/george-clooney-amal-clooney-love-marriage-story/", "text": "A Hollywood heartthrob and confirmed bachelor falls for a brilliant, humanitarian lawyer, and eventually, the two create the picture perfect family. It's the sort of love story you'd expect to see in a filmland fairytale, and yet somehow in just five short years it's become the real life romance of Amal and George Clooney.\n\nHere's the story of how the dedicated duo met, fell in love, and built a life together.\n\nGetty Images\n\nThey met through a friend—at George's home.\n\nPeople say that true love finds its way to you, but the adage is rarely as literal as it turned out to be for George and Amal. The couple met at the actor's Lake Como home in July of 2013, when a mutual friend stopped by while en route to Cannes with Amal in tow. In an equally fateful twist, the star's parents were also visiting him at the time, so Amal was introduced to the Clooney family on the same day she met her now husband.\n\nGeorge, then 52, had cultivated a reputation as one of Hollywood's most eligible bachelors with a dating history including celebs like Kelly Preston and Stacy Keibler, but there was clearly something special about his connection with the renowned human rights lawyer. “I got a call from my agent who said, 'I met this woman who is coming to your house, who you’re going to marry,'” George said during an appearance on My Next Guest Needs No Introduction with David Letterman. “It really worked out that way.”\n\nThe two hit it off immediately, corresponding for several weeks before the romance truly blossomed. “She sent some pictures from when she was here, and we were writing each other, emailing, talking, mostly about what was going on in each other’s lives,” he told The Hollywood Reporter. “And over a period of time it became clear we were more than just friends.”\n\nGetty Images\n\nTheir first date was historic.\n\nThe duo's first official date came in October 2013 when George invited Amal, who was living in London, to come visit him at the famed Abbey Road Studios (best known as a recording home for The Beatles) while he supervised the score for his 2014 film The Monuments Men. \"That was a good first date,\" he told The Hollywood Reporter, adding: \"And pretty quickly, things escalated once I was in London.\"\n\nGetty Images\n\nAmal was almost too shocked to say 'yes' when George proposed.\n\n\"She'd had a conversation with her parents, who were like, 'What are George's intentions?' And she was saying, 'Take it easy. We've been going out for six months,'\" George explained. All the while he was preparing for the big moment.\n\nAfter months of planning—down to a playlist of music to accompany the proposal—George invited Amal to a homecooked dinner on April 28, 2014, hiding the 7-carat engagement ring inside of a lighter box that Amal used to light the candlelit table. \"I did all the stuff, got down on my knee and did all the things you're supposed to do,\" the actor said. \"I was waiting for this song, 'Why Shouldn't I?' 'Why shouldn't I take a chance when romance passes by? / Why shouldn't I know of love?' It's a really good song about why can't I be in love? And it played, and she's like, 'Holy shit!' And she just kept staring at the ring, going, 'Oh, my God.' It was 20 minutes of me on my knee, waiting for her to say yes, because she was so shocked.\"\n\nGetty Images\n\nThey married in an intimate Venetian ceremony.\n\nAfter a short engagement the couple tied the knot in September 2014, just shy of a year after their first date. \"We didn't tell anybody else that we were going to do it,\" Clooney recalled to The Hollywood Reporter, \"but eventually somebody figured it out. Oh, my God! Once people got wind of it, it became an event.\" Surrounded by family (and a few famous friends, including Clooney's long-time collaborator Matt Damon, Cindy Crawford, and fellow celebrity couple John Krasinski and Emily Blunt) the couple wed in a private ceremony at the Aman Canal Grande luxury resort in Venice, Italy.\n\nGetty Images\n\nChildren weren't part of their initial plan.\n\n“It had never been part of my DNA,” George said, explaining his stance on fatherhood. “We didn’t plan on it. We never talked about it until after we were married, which is funny. There was an assumption that we didn’t want them. And then, after the wedding, we just felt we’d gotten very lucky, both of us, and we should share whatever good luck we’ve got. It would seem self-centered to just have that belong to us.”\n\nWhen Amal became pregnant in 2016, the overjoyed couple got an additional surprise, in the form of twins. \"[The doctor performing the ultrasound] goes, 'Well, there's one.' And I said, 'Great.' And then he goes, 'And there's the second one.' And I was like, 'What?'\" Clooney told The Hollywood Reporter. \"We just sat there, staring at that piece of paper they give you, and I kept thinking there was a mistake.\" But there was no mistake; in June of 2017, one month premature, Amal gave birth to twins Ella and Alexander.\n\n\n\nGetty Images\n\nThey balance parenting with their demanding jobs.\n\nReturning to her work representing refugees in September of 2017, Amal has managed to excel at the office and as a mom. \"She is sort of this remarkable human being and now mother which is something, I suppose, you should assume she would be wonderful at as well. But, when you see it in person, it makes you feel incredibly proud and also incredibly small,\" George told Letterman.\n\nCoupled with George's creative work and the 2017 sale of his Casamigos tequila brand, the duo remain very busy, but make the time to dedicate to their children, traveling with them to some of the family's favorite spots around the globe.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=1xw:0.7488766849725412xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=1xw:0.7488766849725412xh;center,top&resize=1200:*", "keywords": [], "authors": ["Lauren Hubbard", "Lauren Hubbard Is A Freelance Writer", "Town", "Country Contributor Who Covers Beauty", "Shopping", "Entertainment", "Travel", "Home Decor", "Wine"], "canonical_link": "https://www.townandcountrymag.com/style/a20241776/george-clooney-amal-clooney-love-marriage-story/", "title": "George and Amal Clooney's Unexpected Love Story", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "George and Amal Clooney's Unexpected Love Story", "description": "The whirlwind romance has led to lasting love.", "url": "https://www.townandcountrymag.com/style/a20241776/george-clooney-amal-clooney-love-marriage-story/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=1xw:0.7488766849725412xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-05-07 06:17:37", "published_time": "2018-05-07 06:17:00", "section": "Style", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=1xw:0.7488766849725412xh;center,top&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "George and Amal Clooney's Love Story - How George Clooney and Amal Met", "description": "It's the sort of love story you'd expect to see in a filmland fairytale, and yet somehow in just five short years it's become the real life romance of Amal and George Clooney. Here's the story of how the dedicated duo met, fell in love, and built a life together.", "keywords": "Amal Clooney, George Clooney, george and amal clooney, george and amal clooney love story, george and amal clooney relationship, george and amal, george clooney and amal, george clooney wife, george clooney kids, george and amal kids, george and amal clooney wedding, george and amal clooney twins", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=0.6676666666666666xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Style,style,Amal Alamuddin,Amal Clooney,George Clooney", "sailthru.date": "2018-05-07T18:17:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=1xw:0.7488766849725412xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/tc-george-amal-romance-531017112-1525710299.jpg?crop=0.6676666666666666xw:1xh;center,top", "sailthru.socialtitle": "George and Amal Clooney's Unexpected Love Story", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525645020.0, "source": "https://www.townandcountrymag.com", "summary": ""}