{"url": "https://www.wrestlinginc.com/news/2015/07/total-divas-recap-598313/", "text": "Last week: Everyone hates Eva. This week: Everyone still hates Eva, but they're also busy with WrestleMania too.\n\nWe get another glimpse into Natalya's relationship with her troubled dad, Jim Neidhart. This is an unusually serious subject for a lightweight television show\u0097it feels a little jarring, but it's a good story to tell.\n\nNattie is looking forward to her dad being at WrestleMania when her mother comes around and breaks the news to her that he's gotten in trouble in rehab for throwing a temper tantrum and is getting kicked out. I didn't even know you could get kicked out of rehab. Nattie is heartbroken because he seemed to be doing so well. It's genuinely quite sad to see how the years of concern and stress in dealing with him have obviously taken their toll on both of them. Nattie really does seem like the parent when she deals with her dad.\n\nThen Nattie and TJ go to dinner With Bret Hart and his wife and he reminds her that her dad has to want sobriety for himself\u0097and instead of freaking out over him all the time she has to try and focus on her life. This is actually great advice. Maybe Bret could start running his own advice column?\n\n\n\nLater Nattie and Jim have a father-daughter autograph session that goes surprisingly smoothly. I have to wonder if being around wrestling again is that good an idea for the man, since it seems obvious it has too many temptations.\n\nMeanwhile, Brie has a pregnancy scare when her period is two weeks late. She's sad because she genuinely thought she might be and is disappointed. She cries a lot, but thankfully, she has water-proof mascara. She wonders if she'll ever have a baby, and Nikki comforts her. \"You're going to have a baby. It's going to happen.\" I like the idea of a \"Psychic Nikki\" gimmick.\n\nBrie and Daniel have a fertility check. I don't know where this storyline is going. Maybe it turns out they do have problems and they have to ask Nikki to be a surrogate? Or perhaps they end up adopting some mysterious child from an orphanage who turns out to be a psycho killer and/or possessed by a demon? (Note to self: stop watching so many horror movies.)\n\nLater on, Brie takes her mind her mind off of her anxieties over motherhood by trashing Eva Marie again and saying how she doesn't \"care about the business.\" She's training every day, what more do they want? For her to erect a shrine to Shawn Michaels in her living around that she prays to everyday while watching '90s Japanese wrestling tapes on a never-ending loop?\n\nBrian Kendrick encourages Eva to shake off the heat from the rest of the girls. He is great. Now I want a reality show where Bret and Brian just hang out all the time and act cool while occasionally giving sage advice to emotionally troubled wrestlers. And Paul London in a supporting role as the wacky neighbor.\n\nTrinity\u0097one of the few sane divas on this show\u0097correctly points out how unreasonable the women's hatred of Eva is and that they're all jealous. Whether or not they will pay any attention to her is another matter entirely. I really don't know what Eva is supposed to have done wrong here...other than taking the same opportunities the other girls undoubtedly wish they'd had.\n\nAlicia insists she's not jealous of Eva Marie.In the immortal words of Marsha Brady: \"Sure, Jan.\"\n\nLater, Nikki suggests the bold strategy of talking to Eva calmly and civilly as a friend instead of verbally attacking and demeaning her constantly. Brie isn't too keen.\n\nAll through this, there's a subplot where Paige has to get a WrestleMania makeover, which means buying a gown and nice shoes because she doesn't own any\u0097you know, because she's such a tomboy! Did we mention she's tomboy! Because she totally is!\u0097and getting a tan. Paige is annoyed about the latter since she loves being pale. Doesn't she know it's the law in wrestling that everyone has to be orange? Blame Hogan. Regardless, she's not happy with the end results and ends up scrubbing the whole thing off. Later on, she meets her biggest fan. The fan calls her a role model and credits her for saving her life and helping cure her eating disorder by being herself. This makes Paige realize she's happier being her own person and doesn't want to be glamorous. Nice scene but it felt a bit contrived and scripted even by this show's standards. What, she just happened to bump into this fan who reminded her to be true to herself while getting a makeover she didn't really want? Hmmmm.\n\nNext week: WrestleMania gears up and the Bella twins get even more mad at Eva, if that's possible.", "images": ["https://www.WrestlingInc.com/images/pics/paige-f11.jpg", "https://www.wrestlinginc.com/assets/ui/images/layout/winc-logo.png", "https://www.wrestlinginc.com/assets/ui/images/general/clear.gif", "https://www.wrestlinginc.com/assets/lib/counters/news.asp?newsId=598313", "https://www.wrestlinginc.com/assets/ui/images/layout/f-logo-s.png", "https://www.wrestlinginc.com/assets/ui/images/footer/google-play.png", "https://cdn.relaymedia.com/ping?url=https%3A%2F%2Fwww%2EWrestlingInc%2Ecom%2Fnews%2F2015%2F07%2Ftotal%2Ddivas%2Drecap%2D598313%2F", "https://www.wrestlinginc.com/assets/ui/images/footer/ios-app.png", "https://c.statcounter.com/256370/0//1/"], "top_img": "https://www.WrestlingInc.com/images/pics/paige-f11.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.WrestlingInc.com/news/2015/07/total-divas-recap-598313/", "title": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "title": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More", "description": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More", "keywords": "paige, wwe news, wrestling news", "image": "https://www.WrestlingInc.com/images/pics/paige-f11.jpg", "medium": "article", "article": {"published_time": "2015-07-15T00:30:19 -0400", "tag": "paige, wwe news, wrestling news"}, "og": {"type": "article", "site_name": "Wrestling Inc.", "image": "https://www.WrestlingInc.com/images/pics/paige-f11.jpg", "url": "https://www.WrestlingInc.com/news/2015/07/total-divas-recap-598313/", "title": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More - Wrestling Inc.", "description": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More"}, "fb": {"app_id": 123325808288224, "pages": 225021057526395}, "twitter": {"site": "@WrestlingINC", "url": "https://www.WrestlingInc.com/news/2015/07/total-divas-recap-598313/", "title": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More", "description": "Total Divas Recap: Nattie's Family Issues, Paige Gets A Makeover, More", "card": "summary_large_image", "image": "https://www.WrestlingInc.com/images/pics/paige-f11.jpg", "app": {"name": {"iphone": "Wrestling Inc.", "ipad": "Wrestling Inc.", "googleplay": "Wrestling Inc."}, "id": {"iphone": 1102820164, "ipad": 1102820164, "googleplay": "com.rumble.wrestlinginc"}}}, "msapplication-TileImage": "/assets/ui/images/icons/icon-144x144.png"}, "movies": ["https://www.youtube.com/embed/50yJ35kfb3g", "https://www.youtube.com/embed/J28YGMwrMXc", "https://www.youtube.com/embed/RCUjhg_pKUk", "https://www.youtube.com/embed/imEAY0MoRQQ"], "publish_date": 1436934619.0, "source": "https://www.wrestlinginc.com", "summary": ""}