{"url": "https://en.wikipedia.org/wiki/Tom_Cruise", "text": "This article is about the American actor. For other people named Tom Cruise, see Tom Cruise (disambiguation)\n\nAmerican actor and producer\n\nThomas Cruise Mapother IV (born July 3, 1962) is an American actor and producer. He has received several accolades for his work, including three Golden Globe Awards and three nominations for Academy Awards. With a net worth of $570 million as of 2020,[1] he is one of the highest-paid actors in the world.[2] In addition, his films have grossed over $4 billion in North America and over $10.1 billion worldwide,[3] making him one of the highest-grossing box office stars of all time.[4]\n\nCruise began acting in the early 1980s and made his breakthrough with leading roles in the comedy film Risky Business (1983) and action drama film Top Gun (1986). Critical acclaim came with his roles in the drama films The Color of Money (1986), Rain Man (1988), and Born on the Fourth of July (1989). For his portrayal of Ron Kovic in the latter, he won the Golden Globe Award for Best Actor – Motion Picture Drama and received a nomination for the Academy Award for Best Actor. As a leading Hollywood star in the 1990s, he starred in several commercially successful films, including the drama A Few Good Men (1992), the thriller The Firm (1993), the horror film Interview with the Vampire (1994), and the romance Jerry Maguire (1996). For his role in the latter, he won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy and received his second Academy Award nomination.\n\nCruise's performance as a motivational speaker in the drama film Magnolia (1999) earned him the Golden Globe Award for Best Supporting Actor – Motion Picture and a nomination for the Academy Award for Best Supporting Actor. As an action star, he has played Ethan Hunt in six films of the Mission: Impossible series from 1996 to 2018. He also continued to feature in several science fiction and action films, including Vanilla Sky (2001), Minority Report (2002), The Last Samurai (2003), Collateral (2004), War of the Worlds (2005), Knight and Day (2010), Jack Reacher (2012), Oblivion (2013), and Edge of Tomorrow (2014).\n\nCruise has been married to actresses Mimi Rogers, Nicole Kidman, and Katie Holmes. He has three children, two of whom were adopted during his marriage to Kidman and the other of whom is a biological daughter he had with Holmes. Cruise is an outspoken advocate for the Church of Scientology and its associated social programs, and credits it with helping him overcome dyslexia. In the 2000s, he sparked controversy with his Church-affiliated criticisms of psychiatry and anti-depressant drugs, his efforts to promote Scientology as a religion in Europe, and a leaked video interview of him promoting Scientology.\n\nEarly life\n\nCruise was born Thomas Cruise Mapother IV[5] in Syracuse, New York, on July 3, 1962, the son of special education teacher Mary Lee (née Pfeiffer; 1936–2017) and electrical engineer Thomas Cruise Mapother III (1934–1984).[6] His parents were both from Louisville, Kentucky,[7][8] and had English, German, and Irish ancestry.[9][10] One of Cruise's Irish ancestors, Patrick Russell Cruise, was born in County Dublin in 1799 and married Teresa Johnson in County Meath in 1825. They left Ireland for the U.S. that same year and settled in New York.[9][11][12][13][14] Cruise has three sisters named Lee Anne, Marian, and Cass. One of his cousins, William Mapother, is also an actor who has appeared alongside Cruise in five films.[15] Cruise grew up in near poverty and had a Catholic upbringing. He later described his father as \"a merchant of chaos\",[16] a \"bully\", and a \"coward\" who beat his children. He elaborated, \"[My father] was the kind of person where, if something goes wrong, they kick you. It was a great lesson in my life—how he'd lull you in, make you feel safe and then, bang! For me, it was like, 'There's something wrong with this guy. Don't trust him. Be careful around him.'\"[16]\n\nCruise spent part of his childhood in Canada. When his father took a job as a defense consultant with the Canadian Armed Forces, his family moved in late 1971 to Beacon Hill, Ottawa.[17] He attended the new Robert Hopkins Public School for his fourth and fifth grade education.[17][18] He first became involved in drama in fourth grade, under the tutelage of George Steinburg. He and six other boys put on an improvised play to music called IT at the Carleton Elementary School drama festival.[17] Drama organizer Val Wright, who was in the audience, later said that \"the movement and improvisation were excellent [...] it was a classic ensemble piece\".[17] In sixth grade, Cruise went to Henry Munro Middle School in Ottawa. That year, his mother left his father, taking Cruise and his sisters back to the United States.[17] In 1978, she married Jack South.[19] Cruise's father died of cancer in 1984.[20] Cruise briefly took a church scholarship and attended a Franciscan seminary in Cincinnati, Ohio; he aspired to become a priest before he became interested in acting.[21]:24–26 In total, he attended 15 schools in 14 years.[22] In his senior year of high school, he played football for the varsity team as a linebacker, but was cut from the squad after getting caught drinking beer before a game.[21]:47 He went on to star in the school's production of Guys and Dolls.[23] In 1980, he graduated from Glen Ridge High School in Glen Ridge, New Jersey.[24]\n\nCareer\n\nActing\n\nAt age 18,[25] with the blessing of his mother and stepfather, Cruise moved to New York City to pursue an acting career.[23] After working as a busboy in New York, he went to Los Angeles to try out for television roles. He signed with CAA and began acting in films.[25] He first appeared in a bit part in the 1981 film Endless Love, followed by a major supporting role as a crazed military academy student in Taps later that year. In 1983, Cruise was part of the ensemble cast of The Outsiders. That same year he appeared in All the Right Moves and Risky Business, which has been described as \"A Generation X classic, and a career-maker for Tom Cruise\",[26] and which, along with 1986's Top Gun, cemented his status as a superstar.[27] Cruise also played the male lead in the Ridley Scott film Legend, released in 1985.[28]\n\nCruise followed up Top Gun with The Color of Money, which came out the same year, and which paired him with Paul Newman. 1988 saw him star in Cocktail, which earned him a nomination for the Razzie Award for Worst Actor. Later that year he starred with Dustin Hoffman in Rain Man, which won the Academy Award for Best Film and Cruise the Kansas City Film Critics Circle Award for Best Supporting Actor. Cruise portrayed real-life paralyzed Vietnam War veteran Ron Kovic in 1989's Born on the Fourth of July, which earned him a Golden Globe Award for Best Actor - Motion Picture Drama, the Chicago Film Critics Association Award for Best Actor, the People's Choice Award for Favorite Motion Picture Actor, a nomination for BAFTA Award for Best Actor in a Leading Role, and Cruise's first Best Actor Academy Award nomination.\n\nCruise's next films were Days of Thunder (1990) and Far and Away (1992), both of which co-starred then-wife Nicole Kidman as his love interest. In 1994, Cruise starred along with Brad Pitt, Antonio Banderas and Christian Slater in Neil Jordan's Interview with the Vampire, a gothic drama/horror film that was based on Anne Rice's best-selling novel. The film was well-received, although Rice was initially quite outspoken in her criticism of Cruise having been cast in the film, as Julian Sands was her first choice. Upon seeing the film however, she paid $7,740 for a two-page ad in Daily Variety praising his performance and apologizing for her previous doubts about him.[29]\n\nIn 1996, Cruise appeared as superspy Ethan Hunt in the reboot of Mission: Impossible, which he produced. It was a box office success, although it received criticism regarding the Jim Phelps character being a villain despite being a protagonist of the original television series.[30]\n\nIn 1996, he took on the title role in Jerry Maguire, for which he earned a Golden Globe and his second nomination for an Academy Award. In 1999, Cruise costarred with Kidman in the erotic Stanley Kubrick film Eyes Wide Shut, and took a rare supporting role, as a motivational speaker, Frank T.J. Mackey, in Magnolia, for which he received another Golden Globe and nomination for an Academy Award.\n\nCruise in March 2006\n\nIn 2000, Cruise returned as Ethan Hunt in the second installment of the Mission Impossible films, Mission: Impossible 2. The film was helmed by Hong Kong director John Woo and branded with his gun fu style, and continued the series' blockbuster success at the box office, taking in almost $547M in worldwide figures. Like its predecessor, it was the highest-grossing film of the year, and had a mixed critical reception. Cruise received an MTV Movie Award for Best Male Performance for this film.\n\nHis next five films were major critical and commercial successes.[31][32] The following year Cruise starred in the romantic thriller Vanilla Sky (2001) with Cameron Diaz and Penélope Cruz. In 2002, Cruise starred in the dystopian science fiction action film Minority Report which was directed by Steven Spielberg and based on the science fiction short story by Philip K. Dick.\n\nIn 2003, he starred in Edward Zwick's period action drama The Last Samurai, for which he received a Golden Globe nomination for best actor. In 2004, Cruise received critical acclaim for his performance as Vincent in Collateral - directed by Michael Mann. In 2005, Cruise worked again with Steven Spielberg in War of the Worlds, a loose adaptation of the H. G. Wells novel of the same name, which became the fourth highest-grossing film of the year with US$591.4 million worldwide. Also in 2005, he won the People's Choice Award for Favorite Male Movie Star, and the MTV Generation Award. Cruise was nominated for seven Saturn Awards between 2002 and 2009, winning once. Nine of the ten films he starred in during the decade made over $100 million at the box office.[31]\n\nCruise in May 2014\n\nIn 2006, he returned to his role as Ethan Hunt in the third installment of the Mission Impossible film series, Mission: Impossible III. The film was more positively received by critics than the previous films in the series, and grossed nearly $400 million at the box office.[33] In 2007, Cruise took a rare supporting role for the second time in Lions for Lambs, which was a commercial disappointment. This was followed by an unrecognizable appearance as \"Les Grossman\" in the 2008 comedy Tropic Thunder with Ben Stiller, Jack Black, and Robert Downey Jr. This performance earned Cruise a Golden Globe nomination. Cruise played the central role in the historical thriller Valkyrie released on December 25, 2008 to box office success.[34]\n\nIn March 2010, Cruise completed filming the action-comedy Knight and Day, in which he re-teamed with former costar Cameron Diaz; the film was released on June 23, 2010.[35] On February 9, 2010, Cruise confirmed that he would star in Mission: Impossible – Ghost Protocol, the fourth installment in the Mission: Impossible series. The film was released in December 2011[36] to high critical acclaim[37] and box office success.[38] Unadjusted for ticket price inflation, it was Cruise's biggest commercial success to that date.[39]\n\nOn May 6, 2011, Cruise was awarded a humanitarian award from the Simon Wiesenthal Centre and Museum of Tolerance for his work as a dedicated philanthropist.[40] In mid-2011, Cruise started shooting the movie Rock of Ages, in which he played the character Stacee Jaxx. The film was released in June 2012.[41]\n\nCruise starred as Jack Reacher in the film adaptation of British author Lee Child's 2005 novel One Shot. The film was released on December 21, 2012.[42] It met with positive reviews from critics and was a box office success grossing $216,568,266 worldwide.[43][44] In 2013, he starred in the science fiction film Oblivion based on director Joseph Kosinski's graphic novel of the same name. The film met with mixed reviews and grossed $285,600,588 worldwide. It also starred Morgan Freeman and Olga Kurylenko.[45][46]\n\nAs of mid-2015 Cruise's films have grossed about $8.2 billion worldwide.[47]\n\nCruise returned as Ethan Hunt in the fifth installment of the Mission: Impossible series, Mission: Impossible – Rogue Nation, which he also produced.[48] Returning cast members included Simon Pegg as Benji and Jeremy Renner as William Brandt, with Christopher McQuarrie as director. The film earned high critical acclaim[49] and was a commercial success.[50]\n\nCruise starred in the 2017 reboot of Boris Karloff's 1932 horror movie The Mummy.[51] The new film, also titled The Mummy, was produced by Alex Kurtzman, Chris Morgan, and Sean Daniel, written by Jon Spaihts and directed by Kurtzman which received negative reviews and become flop at the box office[52][53] . In 2018, Cruise again reprised Ethan Hunt, in the sixth film in his franchise, Mission: Impossible – Fallout. The film was more positively received by critics than the previous films in the series, and grossed over $791 million at the box office.[54][55] Unadjusted for ticket price inflation, it is Cruise's biggest commercial success to date.[56]\n\nProducing\n\nCruise partnered with his former talent agent Paula Wagner to form Cruise/Wagner Productions in 1993,[57] and the company has since co-produced several of Cruise's films, the first being Mission: Impossible in 1996 which was also Cruise's first project as a producer.\n\nCruise in 2018\n\nCruise is noted as having negotiated some of the most lucrative film deals in Hollywood, and was described in 2005 by Hollywood economist Edward Jay Epstein as \"one of the most powerful – and richest – forces in Hollywood.\" Epstein argues that Cruise is one of the few producers (the others being George Lucas, Steven Spielberg and Jerry Bruckheimer) who are regarded as able to guarantee the success of a billion-dollar film franchise. Epstein also contends that the public obsession with Cruise's tabloid controversies obscures full appreciation of Cruise's exceptional commercial prowess.[58]\n\nCruise/Wagner Productions, Cruise's film production company, is said to be developing a screenplay based on Erik Larson's New York Times bestseller, The Devil in the White City about a real-life serial killer, H. H. Holmes, at Chicago's World's Columbian Exposition. Kathryn Bigelow is attached to the project to produce and helm. Meanwhile, Leonardo DiCaprio's production company, Appian Way, is also developing a film about Holmes and the World's Fair, in which DiCaprio will star.[59]\n\nCruise has produced several films in which he appeared. He produced Mission: Impossible, Without Limits, Mission: Impossible 2, The Others, Vanilla Sky and many others.[60]\n\nBreak with Paramount\n\nOn August 22, 2006, Paramount Pictures announced it was ending its 14-year relationship with Cruise. In the Wall Street Journal, chairman of Viacom (Paramount's parent company) Sumner Redstone cited the economic damage to Cruise's value as an actor and producer from his controversial public behavior and views.[61][62] Cruise/Wagner Productions responded that Paramount's announcement was a face-saving move after the production company had successfully sought alternative financing from private equity firms.[63]\n\nIndustry analysts such as Edward Jay Epstein commented that the real reason for the split was most likely Paramount's discontent over Cruise/Wagner's exceptionally large share of DVD sales from the Mission: Impossible franchise.[64][65]\n\nManagement of United Artists\n\nIn November 2006, Cruise and Paula Wagner announced that they had taken over the film studio United Artists.[57] Cruise acts as a producer and star in films for United Artists, while Wagner serves as UA's chief executive.\n\nProduction began in 2007 of Valkyrie, a thriller based on the July 20, 1944 assassination attempt against Adolf Hitler. The film was acquired in March 2007 by United Artists. On March 21, 2007, Cruise signed to play Claus von Stauffenberg, the protagonist. This project marked the second production to be greenlighted since Cruise and Wagner took control of United Artists. The first was its inaugural film, Lions for Lambs, directed by Robert Redford and starring Redford, Meryl Streep and Cruise. Lambs was released on November 9, 2007,[66] opening to unimpressive box office revenue and critical reception.\n\nIn August 2008, Wagner stepped down from her position at United Artists; she retains her stake in UA, which combined with Cruise's share amounts to 30 percent of the studio.[67]\n\nPersonal life\n\nRelationships and wealth\n\nCruise splits his time between homes in Beverly Hills, California;[68] Telluride, Colorado;[69] Clearwater, Florida;[70] Dulwich, London;[71] and East Grinstead, West Sussex.[72] He had several relationships with older women in the early-to-mid-1980s, including Rebecca De Mornay (three years his senior),[73] Patti Scialfa (nine years his senior),[74] and Cher (16 years his senior).[75]\n\nCruse married actress Mimi Rogers on May 9, 1987.[76] They divorced on February 4, 1990. Rogers introduced Cruise to Scientology.[77]\n\nCruise met his second wife, actress Nicole Kidman, on the set of their film Days of Thunder (1990). The couple married on December 24, 1990. They adopted two children: Isabella Jane (born 1992) and Connor Antony (born 1995). In February 2001, Cruise filed for divorce from Kidman while she was unknowingly pregnant. The pregnancy ended in a miscarriage. In 2007, Kidman clarified rumors of a miscarriage early in her marriage to Cruise, saying that it was wrongly reported and explaining that she had actually had an ectopic pregnancy.[78]\n\nCruise was next romantically linked with Penélope Cruz, his co-star in Vanilla Sky (2001). Their relationship ended in 2004.[79] An article in the October 2012 issue of Vanity Fair stated that several sources have said that after the breakup with Cruz, Scientologist leaders launched a secret project to find Cruise a new girlfriend. According to those sources, a series of \"auditions\" of Scientologist actresses resulted in a short-lived relationship with British-Iranian actress Nazanin Boniadi, who subsequently left Scientology.[80] Scientology and Cruise's lawyers issued strongly worded denials and threatened to sue, accusing Vanity Fair of \"shoddy journalism\" and \"religious bigotry\".[81] Journalist Roger Friedman later reported that he received an email from director and ex-Scientologist Paul Haggis confirming the story.[82][83]\n\nIn April 2005, Cruise began dating actress Katie Holmes. On April 27 that year, Cruise and Holmes—dubbed \"TomKat\" by the media—made their first public appearance together in Rome.[84] A month later, Cruise publicly declared his love for Holmes on The Oprah Winfrey Show, famously jumping up and down on Winfrey's couch during the show.[85] On October 6, 2005, Cruise and Holmes announced they were expecting a child.[86] In April 2006, their daughter Suri was born. On November 18, Holmes and Cruise were married at the 15th-century Odescalchi Castle in Bracciano, in a Scientologist ceremony attended by many Hollywood stars.[87][88] Their publicists said the couple had \"officialized\" their marriage in Los Angeles the day before the Italian ceremony.[89] There has been widespread speculation that their marriage was arranged by the Church of Scientology.[90][91] David Miscavige, the head of Scientology, served as Cruise's best man.[92] On June 29, 2012, Holmes filed for divorce from Cruise.[93][94] On July 9, the couple signed a divorce settlement worked out by their lawyers.[95] New York law requires all divorce documents remain sealed, so the exact terms of the settlement are not publicly available.[96]\n\nScientology\n\nCruise and Mimi Rogers at the 1989 Oscars\n\nCruise is an outspoken advocate for the Church of Scientology and its associated social programs. He became involved with Scientology in 1990 through his first wife, Mimi Rogers.[97] Cruise struggled with dyslexia at an early age[98] and has said that Scientology, specifically the L. Ron Hubbard Study Tech, helped him overcome dyslexia.[99]\n\nAdvocacy of Scientology\n\nIn addition to promoting various programs that introduce people to Scientology, Cruise has campaigned for Scientology to be recognized as a religion in Europe. In 2005, the Paris city council revealed that Cruise had lobbied officials Nicolas Sarkozy and Jean-Claude Gaudin. They described him as a militant spokesman for Scientology, and barred any further dealings with him.[100][101]\n\nCruise co-founded and raised donations for Downtown Medical to offer New York City 9/11 rescue workers detoxification therapy based on the works of L. Ron Hubbard. This drew criticism from the medical profession[102] and from firefighters.[103]\n\nFor such activities, Scientology leader David Miscavige created the Scientology Freedom Medal of Valor and awarded it to Cruise in late 2004.[104]\n\nCriticism of psychiatry\n\nIn January 2004, Cruise made the controversial statement \"I think psychiatry should be outlawed.\"[105] Further controversy erupted in 2005 after he openly criticized actress Brooke Shields for using the drug Paxil (paroxetine), an anti-depressant to which Shields attributes her recovery from postpartum depression after the birth of her first daughter in 2003. Cruise asserted that there is no such thing as a chemical imbalance and that psychiatry is a form of pseudoscience. Shields responded that Cruise \"should stick to saving the world from aliens and let women who are experiencing postpartum depression decide what treatment options are best for them\".[106] This led to a heated argument between Matt Lauer and Cruise on NBC's Today on June 24, 2005.[107]\n\nMedical authorities view Cruise's comments as furthering the social stigma of mental illness.[108][109] Shields herself called Cruise's comments \"a disservice to mothers everywhere.\"[110] In late August 2006, Cruise apologized in person to Shields for his comments.[111]\n\nScientology is well known for its opposition to mainstream psychiatry and the psychoactive drugs which are routinely prescribed for treatment.[104] It was reported that Cruise's anti-psychiatry actions led to a rift with director Steven Spielberg.[112] Spielberg had reportedly mentioned in Cruise's presence the name of a doctor friend who prescribed psychiatric medication. Shortly thereafter, the doctor's office was picketed by Scientologists, reportedly angering Spielberg.[113]\n\nYouTube video removal\n\nOn January 15, 2008, a video produced by the Church of Scientology featuring an interview with Cruise was posted on YouTube, showing Cruise discussing what being a Scientologist means to him.[114][115] The Church of Scientology said the video had been \"pirated and edited,\" and was taken from a three-hour video produced for members of Scientology.[115][116] YouTube removed the Cruise video from their site under threat of litigation.[117]\n\nAfter YouTube investigated this claim, they found that the video did not breach copyright law, as it is covered by the fair use clause. It was subsequently reinstated on the site, and as of April 2019, the video has achieved over 13 million views. YouTube has declined to remove it again, due to the popularity of the video, and subsequent changes to copyright policy of the Web site.[118]\n\nScientology's purported influence on Cruise\n\nIn 2013, Cruise stated that ex-wife Katie Holmes divorced him in part to protect the couple's daughter Suri from Scientology. He also said that Suri is no longer a practicing member of the church.[119]\n\nIn March 2004, his publicist of 14 years, Pat Kingsley, resigned. Cruise's next publicist was Lee Anne DeVette, Cruise's sister, who was herself a Scientologist. She served in that role until November 2005.[120] DeVette was replaced with Paul Bloch from the publicity firm Rogers and Cowan.[121] Such restructuring was seen as a move to curtail publicity of his views on Scientology, as well as the controversy surrounding his relationship with Katie Holmes.[122][123]\n\nThe 2015 documentary Going Clear: Scientology and the Prison of Belief cast a spotlight on Cruise's role in Scientology. The film alleges that Cruise used Sea Org workers as a source of free labor.[124] In the film, Cruise's former auditor Marty Rathbun claims that wife Nicole Kidman was wiretapped on Tom Cruise's suggestion (which Cruise's lawyer denies).[125][126]\n\nLegacy\n\nCruise and Katie Holmes interacting with fans in March 2006\n\nIn 2006, Premiere ranked Cruise as Hollywood's most powerful actor,[127] as Cruise came in at number 13 on the magazine's 2006 Power List, being the highest ranked actor.[128] The same year, Forbes magazine ranked him as the world's most powerful celebrity.[129] The founder of CinemaScore in 2016 cited Cruise and Leonardo DiCaprio as the \"two stars, it doesn't matter how bad the film is, they can pull [the box office] up\".[130][131]\n\nIn August 2006, Paramount cited Cruise's \"recent conduct\" as the reason they did not renew their production contract with him.[132] In addition, Marketing Evaluations reported that Cruise's Q score (a measure of the popularity of celebrities), had fallen 40 percent.[133][134]\n\nOctober 10, 2006, was declared \"Tom Cruise Day\" in Japan; the Japan Memorial Day Association said that he was awarded with a special day because he has made more trips to Japan than any other Hollywood star.[135]\n\n\"Tom Cruise Picture\"\n\nWhile reviewing Days of Thunder, film critic Roger Ebert noted the similarities between several of Cruise's 1980s films and nicknamed the formula the Tom Cruise Picture.[136] Some of Cruise's later films like A Few Good Men and The Last Samurai can also be considered to be part of this formula.\n\nWidescreenings noted that for Tom Cruise's character Daniel Kaffee in A Few Good Men,\n\n[screenwriter] Aaron Sorkin interestingly takes the opposite approach of Top Gun, where Cruise also starred as the protagonist. In Top Gun, Cruise plays Mitchell who is a 'hot shot' military underachiever who makes mistakes because he is trying to outperform his late father. Where Maverick Mitchell needs to rein in the discipline, Daniel Kaffee needs to let it go, finally see what he can do.[137]\n\nSorkin and director Rob Reiner are praised in gradually unveiling Kaffee's potential in the film.[137]\n\nLitigation\n\nDuring Cruise's marriage to Nicole Kidman, the couple endured a great deal of public speculation about their sex life and rumors that Cruise was gay. In 1998, he successfully sued the Daily Express, a British tabloid which alleged that his marriage to Kidman was a sham designed to cover up his homosexuality.[138]\n\nIn May 2001, he filed a lawsuit against gay porn actor Chad Slater. Slater had told the celebrity magazine Actustar that he had been involved in an affair with Cruise. This claim was strongly denied by Cruise,[139] and Slater was later ordered to pay $10 million to Cruise in damages after Slater declared he could not afford to defend himself against the suit and would therefore default. Cruise requested a default judgment and, in January 2003, a Los Angeles judge decided against Slater after the porn actor said that his story was false.[140][141]\n\nCruise also sued Bold Magazine publisher Michael Davis for $100 million, because Davis had alleged (though never confirmed) that he had video that would prove Cruise was gay. The suit was dropped in exchange for a public statement by Davis that the video was not of Cruise, and that Cruise was heterosexual.[142]\n\nIn 2006, Cruise sued cybersquatter Jeff Burgar to obtain control of the TomCruise.com domain name. When owned by Burgar, the domain redirected to information about Cruise on Celebrity1000.com. The decision to turn TomCruise.com over to Cruise was handed down by the World Intellectual Property Organization (WIPO) on July 5, 2006.[143]\n\nIn 2009, Michael Davis Sapir filed a suit charging that his phone had been wiretapped at Cruise's behest. That suit was dismissed by a Central Civil West court judge in Los Angeles on the grounds that the statute of limitations had expired on Sapir's claim.[144][145]\n\nIn October 2012, Cruise filed a lawsuit against In Touch and Life & Style magazines for defamation after they claimed Cruise had \"abandoned\" his six-year-old daughter.[146] During deposition, Cruise testified that due to his work load 110 days had passed without him seeing her. The suit was ultimately settled between the two parties.[147]\n\nFilmography\n\nAwards and nominations\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Tom_Cruise_in_2018_%28cropped%29.jpg/170px-Tom_Cruise_in_2018_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Tom_cruise_1989.jpg/170px-Tom_cruise_1989.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tom_Cruise_by_Gage_Skidmore_2.jpg/1200px-Tom_Cruise_by_Gage_Skidmore_2.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Flag_of_New_York.svg/24px-Flag_of_New_York.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Tom_Cruise_and_Katie_Holmes_Yahoo_2006.jpg/220px-Tom_Cruise_and_Katie_Holmes_Yahoo_2006.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Tom_Cruise_2006.jpg/170px-Tom_Cruise_2006.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tom_Cruise_by_Gage_Skidmore_2.jpg/220px-Tom_Cruise_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Flag_of_California.svg/24px-Flag_of_California.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Sf-userbox.png/21px-Sf-userbox.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Tom_Cruise_and_Mimi_Rogers.jpg/220px-Tom_Cruise_and_Mimi_Rogers.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Tom_Cruise_avp_2014_4.jpg/170px-Tom_Cruise_avp_2014_4.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Tom_Cruise_%26_Katie_Holmes_WHCAD.jpg/170px-Tom_Cruise_%26_Katie_Holmes_WHCAD.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Tom_Cruise_signature.svg/150px-Tom_Cruise_signature.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tom_Cruise_by_Gage_Skidmore_2.jpg/1200px-Tom_Cruise_by_Gage_Skidmore_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Cruise", "title": "Tom Cruise", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tom_Cruise_by_Gage_Skidmore_2.jpg/1200px-Tom_Cruise_by_Gage_Skidmore_2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}