{"url": "https://www.etonline.com/jennifer-aniston-and-justin-theroux-split-a-look-back-at-their-private-relationship-96527", "text": "After two and a half years of marriage, Jennifer Aniston and Justin Theroux are calling it quits, bringing their romantic relationship to a close nearly seven years after the two first found love.\n\nFrom their low-key engagement to their cleverly concealed wedding ceremony, the two worked hard to navigate the difficulties of living their lives in the public eye while also maintaining some semblance of privacy.\n\nHowever, the two never shied away from showering each other with love, affection and compliments, making their split all the more surprising. Now, ET is looking back at how their romance unfolded in and out of the spotlight.\n\n2007\n\nThe Stars Meet\n\nAniston was first introduced to Theroux through their mutual friend, Ben Stiller. Stiller and Theroux were co-writers of the 2008 comedy Tropic Thunder. Aniston later told PopSugar that she thought the handsome star was \"very sweet,\" but seemed \"very dark,\" explaining, \"At first you think he could be like a serial killer, but he is actually the nicest person in the world.\"\n\n2010\n\nWorking on Wanderlust\n\nWhile shooting her romantic comedy Wanderlust (released in 2012), Aniston shared scenes with Theroux, who plays a character with long hair and a shaggy beard. At the time, Theroux was in a long-term relationship with stylist Heidi Bivens, whom he'd been dating for 14 years.\n\n2011\n\nMay - Rumors Begin\n\nRumors of Theroux and Aniston's relationship begin to swirl when the pair are spotted hanging out together at The Tower Bar in the Sunset Tower Hotel in West Hollywood.\n\nJune - Coming Forward\n\nThe couple took their relationship semi-public when they appeared together at the MTV Movie Awards after party in Los Angeles. Soon after, news broke that Theroux had moved in with Aniston.\n\n2012\n\nThe Big Proposal\n\nTheroux popped the question on his 41st birthday on August 10. Speaking with Harper's Bazaar in 2017, Aniston reflected on the proposal, recalling, \"When Justin proposed he put that freaking ring on my finger, and I was like, 'Holy crap, now I’m gonna have to get manicures!'\"\n\n2015\n\nAugust 5 -- The Secret Wedding\n\nThree years after announcing their engagement, the pair tied the knot at a secret nighttime ceremony at their home in Bel Air. The wedding was disguised as a 44th birthday party for Theroux. The couple's backyard was lavishly decorated for the event, with a full bar and beautiful table centerpieces.\n\nJennifer Aniston and Justin Theroux's Cutest Moments Ever This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Jennifer Aniston and Justin Theroux's Cutest Moments Ever\n\nAmong the star-studded guests at the intimate gather were Howard Stern, Jason Bateman, Lisa Kudrow, Chelsea Handler, John Krasinski, Emily Blunt, Ellen DeGeneres and many others.\n\nSpeaking with ET in March 2017, Theroux reflected on the benefits of having a relaxed, low-key clandestine wedding ceremony, explaining, \"It's so much more special when it's just your closest friends and family and it's lovely… [we] wanted it to be a peaceful environment, you don't want it to be hectic.\"\n\nAugust 6 -- The Honeymoon\n\nThe newlyweds wasted no time when it came to jetting off to Bora Bora for their idyllic honeymoon. The pair were joined by Aniston's best friend and former Friends co-star Courteney Cox and her fiancé, Snow Patrol rocker Johnny McDaid. Aniston's Horrible Bosses co-star Jason Bateman and wife Amanda Anka also tagged along for the fun group vacay.\n\nSeptember -- Enjoying Their New Life\n\nTheroux gushed about being able to call Aniston his wife in an interview with news.com.au, sharing, \"It feels very touching. I can't remember the first time I said those words but it feels fantastic. It's a comfortable term. I was getting tired of saying fiancée. That sounds adorable for about six months and then you go, 'OK, we got to make some time for this.'\"\n\n2016\n\nFebruary 14 -- Valentine's Day in Paris\n\nThe pair headed off the to City of Light, where they spent Valentine's Day together, enjoying the view from the top of the Eiffel Tower.\n\nMarch -- Getting Real About Relationships\n\nThe celebrated actress appeared on the cover of Harper's Bazaar, and she had nothing but kind words and adoration for her husband.\n\n\"I’m lucky because Justin is the funniest person I’ve met, and we make each other laugh,\" Aniston shared. \"Laughter is one of the great keys to staying youthful.\"\n\nAniston also said that married life had been \"so normal and fun and not much different… we felt married for so long.\"\n\nTheroux also shared his take on married life with the actress. Three weeks after tying the knot, the actor told People, \"It does feel different.\"\n\n\"I'm very happy. It's nice to be able to look down and see a new piece of jewelry on my finger,\" he added.\n\nJune-July -- Pregnancy Rumors\n\nFollowing Aniston and Theroux's vacation to Eleuthera, Bahamas, tabloids began speculating that the actress was pregnant. Aniston staunchly denied the reports, and in July she penned an op-ed forThe Huffington Post, addressing the rumors.\n\n\"For the record, I am not pregnant. What I am is fed up,\" she wrote. \"I'm fed up with the sport-like scrutiny and body shaming that occurs daily under the guise of 'journalism,' the 'First Amendment' and 'celebrity news.'\"\n\n\"Every day my husband [Justin Theroux] and I are harassed by dozens of aggressive photographers staked outside our home who will go to shocking lengths to obtain any kind of photo,\" she continued. \"Even if it means endangering us or the unlucky pedestrians who happen to be nearby.\"\n\nTheroux shared his support for his wife and her powerful editorial when he took to Instagram to share a cute black-and-white snapshot of Aniston, who he called his \"woman crush Wednesday.\"\n\n\"Here's just one reason why,\" Theroux wrote, linking to Aniston's essay. \"#Gogirl.\"\n\nSeptember -- Sharing Their Key to Success\n\nWhile promoting his film The Girl on the Train, Theroux spoke with ET about the secret behind his marriage.\n\n\"We appreciate each other's sense of humor, we respect one another and we get along,\" he shared. \"I know it sounds simple but it's true!\"\n\n\n\n2017\n\nApril -- Future Co-Stars?\n\nSpeaking with ET at a press junket for the final season of his show The Leftovers, Theroux opened up about his plans for the future, including doing a lot more screenwriting.\n\nIn the past, Aniston has said that if she ever did return to TV, she'd like it to be part of a show on a premium cable network. With Aniston willing to jump onboard a scripted series, and Theroux turning his attention toward writing, the star reflected on whether or not he could see himself working with his wife on future projects.\n\n\"If the right thing came around I would definitely [write] it,\" he said. \" \"We toss around ideas occasionally, but it's got to be something I want to write and something she wants to act in, which is harder than you might thin… But yeah, it would be fantastic if we were able to do something together.\"\n\nAugust -- \"Manscaping\"\n\nIn an interview with Refinery 29, Aniston got candid about Theroux's intricate grooming habits. \"He steals my shampoo, my hair paste… whatever product I put on my face, he just does the same for him,\" she explains. \"You know, he likes to dabble. He kind of manscapes, which I actually enjoy. I enjoy a nicely manscape-d partner.\"\n\nSigns Jennifer Aniston and Justin Theroux Were Headed for a Split This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Signs Jennifer Aniston and Justin Theroux Were Headed for a Split\n\nTheroux responded to Aniston's claims while sitting down with Ellen DeGeneres the following month, admitting, \"I steal some of her products occasionally… I'm not shaving my legs or anything, but if she has a nice cream and she's washing herself with something that smells nice, I might borrow it.\"\n\nBut when it comes to whether or not he manscapes, Theroux was adamant that he likes \"to be natural… I keep it pretty natural down there. I think that's what we all do.\"\n\n2018\n\nFebruary 12 -- Birthday No Show\n\nAniston celebrated her 49th birthday with some of her closest gal pals, including Cox, in Malibu, California, but Theroux was notably absent from the festivities, which led some to speculate on why he wasn't in attendance.\n\nFebruary 15 -- The Big Split\n\nAniston and Theroux announce that they are separating in a statement released to ET.\n\n\"In an effort to reduce any further speculation, we have decided to announce our separation,\" Aniston and Theroux's statement reads. \"This decision was mutual and lovingly made at the end of last year. We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.\"\n\n\"Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly. Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative,\" the statement continues. \"Above all, we are determined to maintain the deep respect and love that we have for one another.\"\n\nRELATED CONTENT:\n\nJennifer Aniston and Justin Theroux Split After Two Years of Marriage\n\nJennifer Aniston Opens Up Like Never Before About Her Engagement and Marriage to Justin Theroux\n\nJennifer Aniston and Justin Theroux Share Glimpse Inside the L.A. Home Where They Got Married\n\nJennifer Aniston and Justin Theroux Splitting After 2 Years of Marriage This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/1280bluntjohn.jpg?h=d067a961&itok=eUNlvyAb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-09/jen_justin_664655664.jpg?h=c673cd1c&itok=zFCkyTEV"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-09/jen_justin_664655664.jpg?h=c673cd1c&itok=zFCkyTEV", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/jennifer-aniston-and-justin-theroux-split-a-look-back-at-their-private-relationship-96527", "title": "Jennifer Aniston and Justin Theroux Split: A Look Back At Their Private Relationship", "meta_data": {"article": {"opinion": "false"}, "title": "Jennifer Aniston and Justin Theroux Split: A Look Back At Their Private Relationship | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/jennifer-aniston-and-justin-theroux-split-a-look-back-at-their-private-relationship-96527", "title": "Jennifer Aniston and Justin Theroux Split: A Look Back At Their Private Relationship", "description": "ET is diving into the couple's lengthy love story and examining how their relationship unfolded in and out of the public eye.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-09/jen_justin_664655664.jpg?h=c673cd1c&itok=zFCkyTEV", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "ET is diving into the couple's lengthy love story and examining how their relationship unfolded in and out of the public eye.", "title": "Jennifer Aniston and Justin Theroux Split: A Look Back At Their Private Relationship", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/jennifer-aniston-and-justin-theroux-split-a-look-back-at-their-private-relationship-96527", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-09/jen_justin_664655664.jpg?h=c673cd1c&itok=zFCkyTEV"}, "description": "ET is diving into the couple's lengthy love story and examining how their relationship unfolded in and out of the public eye.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Jennifer Aniston, Justin Theroux, Splits, Divorce", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}