{"url": "https://medium.com/@emilymadison/ariana-grandes-makeup-artist-shares-a-megawatt-highlight-tip-2873ce7e120e", "text": "Known for her ponytail hairstyle with highlights and cat eye makeup, Ariana’s style is admired by many across the globe. What makes her stand out is the boldness with which she wears her style and how good she looks with it. The person behind this amazing of Ariana revealed some tips on television recently that could help others attain the same look. Although he started by saying he wasn’t supposed to reveal the industry’s secrets, he gave some amazing makeup tips that are not only easy but can yield awesome results when used appropriately.\n\nAccording to the makeup artist, the first step is to apply creamy eyeliner at the end of the eyebrows towards the iris but not going all the way since that can close off the eye. Although he uses black eyeliner, he advised that those who aren’t experts should use a brown color since it’s not as bold as the black one making it easier to work with. He used an extra fine eyeliner brush to draw the lines and advised people to use a brush they’re comfortable with even if they are multiple. For the shiny cat-eye, he used metal glitter eyeliner that doesn’t fall off easily yet is easily removable by a makeup remover.\n\nFor the highlights on the hairstyle, it’s better to use different colors since it gives a variety of reflections in the light making it look like a 3D. A blush on the cheek hallows ads to how great the makeup looks by creating a contour. It’s always better to choose a color that blends well with the skin tone and color as well as the hair color. He followed this by applying another highlight in circular motion using a powder brush in order to complete the 3-D look.\n\nThe products he talked about are all available from different brands but one should choose a hat quality product that doesn’t fall off easily. You should also take into consideration the fact that you’ll need to remove the makeup before you sleep thus the product should be able to come off easily. Although it doesn’t take a lot of time and the steps are easy to follow, you should take all the time you need to apply the makeup especially if you’re not used to doing your own. Always go for a product that’s perfect for your type of skin and hair to avoid any mishaps. Remember that makeup adds to your beauty so you should ensure it looks as natural as possible.", "images": ["https://miro.medium.com/max/600/1*tr0k73X4TUsXNHlOp8tWzg.jpeg", "https://miro.medium.com/fit/c/96/96/0*gov5rvLNExT5QMP9.", "https://miro.medium.com/max/1120/1*tqaGg2_ucgPuUU2Hpd-Q1g.jpeg", "https://miro.medium.com/max/60/1*tr0k73X4TUsXNHlOp8tWzg.jpeg?q=20", "https://miro.medium.com/max/1200/1*tr0k73X4TUsXNHlOp8tWzg.jpeg", "https://miro.medium.com/fit/c/160/160/0*gov5rvLNExT5QMP9.", "https://miro.medium.com/max/60/1*tqaGg2_ucgPuUU2Hpd-Q1g.jpeg?q=20"], "top_img": "https://miro.medium.com/max/600/1*tr0k73X4TUsXNHlOp8tWzg.jpeg", "keywords": [], "authors": ["Emily Madison"], "canonical_link": "https://medium.com/@emilymadison/ariana-grandes-makeup-artist-shares-a-megawatt-highlight-tip-2873ce7e120e", "title": "Ariana Grande’s Makeup Artist Shares a Megawatt Highlight Tip", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/2873ce7e120e"}}, "title": "Ariana Grande’s Makeup Artist Shares a Megawatt Highlight Tip", "site": "@Medium", "description": "Known for her ponytail hairstyle with highlights and cat eye makeup, Ariana’s style is admired by many across the globe. What makes her…", "image": {"src": "https://miro.medium.com/max/600/1*tr0k73X4TUsXNHlOp8tWzg.jpeg"}, "card": "summary_large_image", "label1": "Reading time", "data1": "3 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/2873ce7e120e"}, "android": {"package": "com.medium.reader", "url": "medium://p/2873ce7e120e", "app_name": "Medium"}, "web": {"url": "https://medium.com/@emilymadison/ariana-grandes-makeup-artist-shares-a-megawatt-highlight-tip-2873ce7e120e"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "Ariana Grande’s Makeup Artist Shares a Megawatt Highlight Tip", "description": "Known for her ponytail hairstyle with highlights and cat eye makeup, Ariana’s style is admired by many across the globe. What makes her…", "url": "https://medium.com/@emilymadison/ariana-grandes-makeup-artist-shares-a-megawatt-highlight-tip-2873ce7e120e", "image": "https://miro.medium.com/max/600/1*tr0k73X4TUsXNHlOp8tWzg.jpeg"}, "article": {"published_time": "2017-11-13T10:12:14.259Z", "author": "https://medium.com/@emilymadison"}, "title": "Ariana Grande’s Makeup Artist Shares a Megawatt Highlight Tip", "description": "Known for her ponytail hairstyle with highlights and cat eye makeup, Ariana’s style is admired by many across the globe. What makes her stand out is the boldness with which she wears her style and…", "author": "Emily Madison", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "2873ce7e120e"}, "movies": [], "publish_date": 1510567934.259, "source": "https://medium.com", "summary": ""}