{"url": "https://www.bbc.com/news/entertainment-arts-41594672", "text": "Image copyright Getty Images Image caption Harvey Weinstein, 66, has denied non-consensual sex\n\nHollywood mogul Harvey Weinstein has been found guilty of two counts in his sexual assault trial, more than two years after the first allegations against him emerged.\n\nHere is a summary of the key events that led him to court:\n\n5 October 2017\n\nThe New York Times publishes a story detailing decades of allegations of sexual harassment against Harvey Weinstein. Actresses Rose McGowan and Ashley Judd are among the women who come forward.\n\nAmong the accusations are that he forced women to massage him and watch him naked. He also promised to help advance their careers in return for sexual favours.\n\nWeinstein issues an apology acknowledging he \"has caused a lot of pain\" - but disputes allegations he harassed female employees over nearly three decades.\n\nWeinstein says he is taking a \"leave of absence\" from The Weinstein Company and is working with a therapist.\n\n8 October 2017\n\nIt is announced that Harvey Weinstein has been sacked by the board of his company, with immediate effect. They say the decision was made \"in light of new information about misconduct\".\n\n9 October 2017\n\nBritish actress Romola Garai tells the Guardian that she felt \"violated\" when Weinstein auditioned her as an 18-year-old, saying that he had answered the door to his hotel room in a bathrobe.\n\n10 October 2017\n\nAllegations from 13 more women are published in the New Yorker magazine, including three accusations of rape, which Weinstein strongly denies.\n\nActress Asia Argento and a former aspiring actress named Lucia Stoller say Weinstein forced himself on them sexually. A third woman withholds her name from the article, the result of a 10-month investigation by the magazine. Argento says the incident happened in 1997 in the south of France while Stoller, who now goes under the name Evans, says she was forced into a sexual act by the producer after going for a casting meeting in 2004.\n\nMira Sorvino, who starred in several of Weinstein's films, told the New Yorker that Weinstein sexually harassed her and tried to pressure her into a physical relationship.\n\nWeinstein's spokeswoman Sallie Hofmeister tells the publication: \"Any allegations of non-consensual sex are unequivocally denied by Mr Weinstein.\"\n\nHollywood A-listers Gwyneth Paltrow and Angelina Jolie say they were harassed by Weinstein. Paltrow says she was propositioned as a 22-year-old, while Jolie refers to a \"bad experience\" in her youth.\n\nWeinstein's wife Georgina Chapman announces she is leaving him and that her priority is her young children.\n\n11 October 2017\n\nCara Delevingne also says Weinstein made unwanted advances towards her.\n\n12 October 2017\n\nPolice are called following a \"family dispute\" at the home of Weinstein's daughter. The Los Angeles Police Department (LAPD) confirm they were called to reports of a \"disturbance\" at the house but say no crime was committed. Weinstein was not there when officers arrived.\n\nFamily Guy creator Seth MacFarlane addresses a joke he made about Weinstein's sexual conduct at the 2013 Oscar nominations, saying he decided to speak out after a co-star had been harassed by the producer.\n\nPolice in the US and UK say they are investigating specific allegations from 2004 and the 1980s. No charges are yet brought.\n\nRose McGowan says on Twitter that Weinstein raped her. Weinstein has \"unequivocally denied\" any allegations of non-consensual sex in a statement released through his publicist.\n\n13 October 2017\n\nWeinstein's former office assistant Lisa Rose says the film mogul tried to invite her to another room, mentioning a massage.\n\nThe Late, Late Show presenter James Corden makes jokes about Weinstein's alleged sexual assaults at a charity gala in Los Angeles. He later apologises on Twitter, saying he \"was not trying to make light of Harvey's inexcusable behaviour, but to shame him, the abuser, not his victims\".\n\n14 October 2017\n\nThe organisation behind the Oscars votes to expel Weinstein. The Academy of Motion Picture Arts and Sciences says: \"What's at issue here is a deeply troubling problem that has no place in our society.\"\n\nActress Alice Evans tells BBC Radio 5 Live that Weinstein made lewd comments towards her.\n\nKate Winslet reveals she deliberately did not thank Weinstein when she won her Oscar for The Reader in 2009. \"I remember being told, 'Make sure you thank Harvey if you win',\" the actress tells the Los Angeles Times. \"And I remember turning around and saying, 'No I won't'.\"\n\n15 October 2017\n\nBritish actress Lysette Anthony says Weinstein raped her at her London home in the late 1980s while another, unidentified woman says she was raped in 1992.\n\nWoody Allen says he is \"sad\" for Harvey Weinstein. He later clarifies his comments in a statement: \"When I said I felt sad for Harvey Weinstein I thought it was clear the meaning was because he is a sad, sick man.\"\n\nUK police investigate a number of sexual assault allegations involving Weinstein. The Metropolitan Police say he is accused of assaulting three women in separate incidents in London in the late 1980s, 1992, 2010, 2011 and 2015. The producer has \"unequivocally denied\" any allegations of non-consensual sex.\n\n16 October 2017\n\nScreenwriter Scott Rosenberg writes about his early days at Miramax Films, Weinstein's former company. In a Facebook post, he says that while he never heard of any rape allegations, he and many others were aware of Weinstein's \"dreadful\" behaviour.\n\nActress Lauren Holly tells a Canadian talk show about a hotel room encounter with Weinstein in the late 1990s. She says the producer showered and used the toilet in front of her before approaching her naked and requesting a massage.\n\nIn an interview on French television, Weinstein's chauffeur, Mickael Chemloul, reveals he had to drive around \"tearful aspiring actresses\" for the producer and that he would often console them after their encounters with him.\n\n17 October 2017\n\nActress Lena Headey accuses Weinstein of sexual harassing her in Los Angeles. In a series of Twitter posts, the Game of Thrones star says the mogul was \"furious\" after she resisted his advances and told her not to say anything about their encounter to her manager or agent.\n\nWeinstein resigns from the board of the company that bears his name, according to multiple reports. Weinstein still owns 22% of his company's stock.\n\n18 October 2017\n\nActor Channing Tatum halts the development of a film about child sexual abuse that he had been making with Weinstein's company.\n\nRobert Lindsay says his Hollywood film career was halted after a run-in with Weinstein, which he says led to him losing a role in Shakespeare in Love.\n\nHarvard University strips Weinstein of the Du Bois medal it gave him in 2014 for his contributions to African-American culture.\n\n19 October 2017\n\nQuentin Tarantino reveals he knew about Harvey Weinstein's alleged misconduct toward women for years. \"I knew enough to do more than I did,\" the film director tells the New York Times.\n\nActor Tom Hanks says there can be no way back for Weinstein. \"His last name... will become an identifying moniker for a state of being for which there was a before and an after,\" he tells the BBC.\n\nActress Lupita Nyong'o accuses Weinstein of harassment. Writing in the New York Times, she says she was lured to his bedroom under false pretences when she was a drama student.\n\nPolice in Los Angeles confirm they have interviewed a woman who was allegedly sexually assaulted by Harvey Weinstein in 2013.\n\nThe British Film Institute withdraws the BFI Fellowship it awarded Weinstein in 2002.\n\nA group of Weinstein Company employees write an open letter asking their employer to release them from the NDAs (non-disclosure agreements) that stop them speaking publicly about what they have experienced and witnessed.\n\n23 October 2017\n\nZelda Perkins, a British former assistant of Weinstein, tells the Financial Times she was paid £125,000 ($165,200) to keep quiet after accusing the movie mogul of sexual harassment. She says he asked her to give him massages and tried to pull her into bed, but she \"was made to feel ashamed for disclosing his behaviour\".\n\n24 October 2017\n\nGeorge Clooney and Matt Damon speak out over Weinstein, saying it is time for Hollywood to change and it is now \"the moment to believe women\".\n\nActress Brit Marling writes in The Atlantic about her experience with Harvey Weinstein in a hotel room, where he suggested they take a shower together. The OA co-creator describes being sat \"paralysed by mounting fear\", but says she managed to escape.\n\n25 October 2017\n\nA former production worker, Mimi Haleyi, alleges that she was raped by Weinstein when he forcibly performed oral sex on her in 2006.\n\nThe removal of Weinstein's CBE is believed to be being \"actively considered\" by the government's Honours Forfeiture Committee.\n\nActress Dominique Huett, who also alleges she was raped by Weinstein when he performed oral sex on her without her consent, files a negligence case against The Weinstein Company.\n\n26 October 2017\n\nNorwegian actress Natassia Malthe accuses Weinstein of raping her in a London hotel after the 2008 Bafta Awards.\n\n27 October 2017\n\nWeinstein takes legal action against his former company after his lawyer alleges The Weinstein Company has denied requests for documents to defend himself from allegations.\n\nThe Sopranos actress Annabella Sciorra accuses Weinstein of forcing himself into her apartment and raping her in the early 1990s.\n\nActress Daryl Hannah alleges that Weinstein tried to force himself into her hotel room and repeatedly sexually harassed her during the promotion of Kill Bill and its sequel.\n\n28 October 2017\n\nActress Rose McGowan claims she turned down a $1m (£760,000) offer from Harvey Weinstein in exchange for her silence.\n\nThe New York Times reports on new allegations made against Weinstein dating from the 1970s when he was a concert promoter in Buffalo, New York.\n\n30 October 2017\n\nThe Producers Guild of America bans Weinstein for life. It says the \"unprecedented\" step reflects the seriousness with which it regards reports of his \"reprehensible\" conduct\".\n\n1 November 2017\n\nA Canadian actress sues Weinstein for two alleged sexual assaults in 2000 in Toronto. The anonymous actress, identified as \"Jane Doe\", seeks a total of 14 million Canadian dollars (£8.34m).\n\n2 November 2017\n\nSpeaking to Vanity Fair, Boardwalk Empire actress Paz de la Huerta claims Weinstein raped her twice in New York in 2010.\n\n3 November 2017\n\nPolice in New York say they have \"an actual case\" against Weinstein, citing the \"credible and detailed narrative\" an unidentified woman - believed to be Paz de la Huerta - has given them.\n\n7 November 2017\n\nThe New Yorker claims Weinstein used private investigators to cover up sexual abuse claims. Asia Argento, one of his accusers, describes the report as \"terrifying\".\n\nThe Television Academy expels Weinstein from its organisation.\n\n21 November 2017\n\nJennifer Lawrence says Harvey Weinstein was never inappropriate with her but admits she had heard rumours he was \"a dog\".\n\n23 November 2017\n\nKill Bill actress Uma Thurman sends out a Thanksgiving message in which she vents anger at Weinstein \"and all [his] wicked conspirators\".\n\n28 November 2017\n\nThe first UK civil claim against Harvey Weinstein is issued in the High Court. A woman, who worked in the film industry and wishes to remain anonymous, alleges a series of sexual assaults by the film producer.\n\n1 December 2017\n\nActress Kadian Noble accuses Weinstein of luring her into a hotel room in Cannes and assaulting her in 2014. In a civil action filed in New York, she accuses Weinstein, his brother Bob and The Weinstein Company of violating US federal sex trafficking laws.\n\n14 December 2017\n\nFrida actress Salma Hayak claims that Weinstein sexually harassed and threatened her. Writing in the New York Times, she says she repeatedly refused sexual advances. In response, a spokeswoman for Weinstein disputes the account and says \"all of the sexual allegations as portrayed by Salma are not accurate\".\n\n16 December 2017\n\nThe Lord of the Rings director Peter Jackson claims he was fed \"false information\" about Mira Sorvino and Ashley Judd by Weinstein's former company Miramax, meaning they were not considered for roles. Both actresses have claimed the media mogul sexually harassed them. Weinstein denies allegations of misconduct, and of blacklisting the actresses.\n\n19 December 2017\n\nA former assistant to Harvey Weinstein says she left after a co-worker said he had tried to rape her, which he denied. Zelda Perkins claims she tried to expose his behaviour but was told by lawyers she \"didn't have a chance\".\n\nMeryl Streep defends herself against criticism from Harvey Weinstein accuser Rose McGowan after she says her \"silence is the problem\". Streep responds by saying she did not know about Weinstein's alleged behaviour when she worked with him.\n\n15 January 2018\n\nIn an interview with the BBC's Hardtalk programme, Ashley Judd says she was \"not frightened\" of Harvey Weinstein and ascribes that as the reason why the producer \"sabotaged\" her career.\n\n2 February 2018\n\nBafta formally terminates Harvey Weinstein's membership.\n\n3 February 2018\n\nActress Uma Thurman details long hinted-at allegations against Weinstein. In a New York Times article, she says Weinstein pushed her down and \"tried to expose himself\" at his hotel room in London during the 1990s, before she managed to \"wriggle away\". Weinstein's spokeswoman says the claims about an assault \"are untrue\".\n\nUK police investigating Weinstein say they are looking at allegations of sexual assault against two more women. The alleged offences, reported to police in October and November, took place in the Republic of Ireland in 1991, Westminster in 2011 and abroad in 2010, the Metropolitan Police say. These bring the number of women making accusations to the Met to nine.\n\n11 February 2018\n\nAfter a four-month investigation, New York state prosecutors announce they have filed a lawsuit against the Weinstein Company on the basis the studio failed to protect employees from his alleged harassment and abuse. His lawyer concedes Weinstein's behaviour is \"not without fault\" but says there was \"no criminality\"\n\n20 February 2018\n\nThe producer of Golden Globe-winning film My Week With Marilyn accuses Weinstein of physically attacking him. David Parfitt says Weinstein was \"in a fury\" about a test screening of the film doing so well with the audience as he wasn't happy with the final cut.\n\n28 February 2018\n\nA 10th woman reports Weinstein to British police for alleged sexual assault. The unnamed woman went to the police on 8 February to accuse the movie mogul of assaulting her in central London in the mid-1990s.\n\n20 March 2018\n\nWeinstein's former company files for bankruptcy, months after the Oscar-winning producer was accused of multiple sexual assaults.\n\n1 May 2018\n\nActress Ashley Judd sues Weinstein, claiming he damaged her career in retaliation for her rejecting his sexual advances.\n\n10 May 2018\n\nWeinstein's estranged wife gives her first interview since he was engulfed in scandal, saying she was \"never\" suspicious about his behaviour. Georgina Chapman admits she had been \"so naive\", and was \"so humiliated and so broken\" when the scandal unfolded.\n\nWeinstein's lawyer tells BBC Radio 5 Live he believes the allegations are \"legally defective or factually not supported\". Benjamin Brafman accuses \"some of the more vocal critics of Harvey Weinstein\" of \"just not telling the truth\".\n\n25 May 2018\n\nWeinstein turns himself in to New York police on sexual misconduct charges. He is charged with rape and several other counts of sexual abuse against two women.\n\n26 May 2018\n\nWeinstein is released on $1m bail. He also agrees to wear a GPS tracker and to surrender his passport.\n\nRose McGowan, who accused Mr Weinstein of rape, tells the BBC it is an \"amazing day for his survivors\".\n\n31 May 2018\n\nA grand jury in New York indicts Weinstein on charges of rape and a criminal sexual act, moving the case towards a trial. The charges relate to an alleged attack on a woman in 2013 and another woman in 2004. Neither woman is named.\n\n5 June 2018\n\nWeinstein formally pleads not guilty to rape and sexual assault charges in the New York Supreme Court. The identity of one of the women whose accusations prompted the charges is confirmed by her lawyer. Lucia Evans, a former actress, had already publicly accused Weinstein of carrying out a sexual assault in 2004.\n\n2 July 2018\n\nWeinstein faces fresh sexual assault charges in New York from a third woman, in a case dating back to 2006.\n\n9 July 2018\n\nWeinstein pleads not guilty in third sex assault case. The new charges include two counts of predatory sexual assault for allegedly forcing a woman into oral sex.\n\nSpeaking outside the courthouse, lawyer Benjamin Brafman says: \"Mr Weinstein is not a predator; he is not a rapist and I believe that when this case is over we will ultimately see him be exonerated.\"\n\n3 August 2018\n\nWeinstein seeks to dismiss the criminal case, citing dozens of \"warm\" emails they say Weinstein received from one of his accusers after an alleged rape.\n\nOther objections include a lack of detail on the timeline of an alleged assault in 2004, and the lack of advance warning from the District Attorney's office about the presentation of more serious charges.\n\n22 August 2018\n\nGerman actress Emma Loman sues Weinstein for alleged rape. Loman - understood to be a pseudonym - says Weinstein invited her to meet him in his hotel suite in Cannes in 2006 for a meeting about what was presumed to be upcoming film roles. Weinstein's lawyer says the claims are \"untrue\", adding they were seeking to have the lawsuit dismissed.\n\n18 September 2018\n\nThe Metropolitan Police says it has received a further allegation of sexual assault after an 11th woman came forward to allege she was assaulted at an \"unknown location in the early 1990s\".\n\n11 October 2018\n\nA New York judge dismisses one of the six sex assault charges after prosecutors said actress Lucia Evans had given a witness a different version of the alleged sex assault from one she had given them.\n\n1 November 2018\n\nWeinstein is accused of sexually assaulting a 16-year-old Polish model in New York and subjecting her to years of harassment and abuse, starting in 2002. The complaint by Jane Doe, as she is known in legal documents, is an update to a class action lawsuit against Weinstein, the Weinstein Company and Miramax.\n\n9 January 2019\n\nActress Ashley Judd's sexual harassment lawsuit is dismissed by a Los Angeles federal court, with the judge ruling the allegations did not fall within the scope of the statute she sued under. Her defamation claim - that Weinstein \"blackballed\" her after she refused his advances - would still be heard, the judge said.\n\n8 February 2019\n\nOscar-winning actress Juliette Binoche calls for the public censure of Weinstein to end, saying \"justice has to do its work\", adding: \"I'm trying to put my feet in his shoes. He's had enough, I think.\"\n\n24 May 2019\n\nWeinstein and his former studio's board members reach a tentative deal with women who accuse him of sexual misconduct, US media report. Lawyers say the settlement to resolve civil lawsuits and compensate alleged victims is worth about $44m (£34.7m).\n\n26 August 2019\n\nWeinstein pleads not guilty to two additional charges of predatory sexual assault. They relate to an alleged assault that took place in Manhattan in 1993 - too long ago to be prosecuted under New York state law.\n\nHis trial - which had been due to start in September - is pushed back by four months to 6 January 2020.\n\n17 September 2019\n\nWeinstein's lawyer Donna Rotunno tells CBS the evidence will exonerate the movie mogul of any criminal wrongdoing. \"I'm not here to say he was not guilty of committing sins,\" she says. \"But there's a difference between sins and crimes, and I don't think he's a rapist.\"\n\n3 October 2019\n\nWeinstein loses his bid to get his trial moved out of New York City. His lawyers say it is \"the least likely place on Earth\" where jurors can discharge their duty \"in an atmosphere free of intimidation from pressure to deliver a result that the politicians, the activists, the celebrities and the media demand\".\n\n24 October 2019\n\nRose McGowan files a lawsuit against Weinstein, his ex-lawyers and a private intelligence agency, accusing them of trying to silence her.\n\n1 November 2019\n\nFormer Harvey Weinstein assistants Rowena Chiu and Zelda Perkins give their first joint interview to BBC Newsnight. Ms Chiu says Weinstein tried to rape her, and that she wore two pairs of tights for protection. \"It at times appeared to be a sort of game where I bought time, and my two pairs of tights bought time,\" she says.\n\n11 December 2019\n\nWeinstein's bail is increased from $1m (£760,000) to $5m (£3.8m) after prosecutors claim he mishandled or disabled his electronic ankle monitor dozens of times. His lawyer said the apparent violations were caused by technical problems.\n\nThe producer attends court using a walking frame, with his lawyers saying he is due to have back surgery later in the week.\n\nA tentative settlement with accusers floated in May is said by lawyers to have been agreed by most parties. It would pay out $25m (£19m) to nearly 30 actresses and ex-employees. However, a number of plaintiffs and lawyers express anger at the terms. The deal has still to be signed off.\n\n15 December 2019\n\nWeinstein gives an interview to the New York Post saying he has overseen \"more movies directed by women and about women than any film-maker\". He added: \"I pioneered it! It all got eviscerated because of what happened. My work has been forgotten.\"\n\nIn response, a statement from 23 female accusers said: \"Harvey Weinstein is trying to gaslight society again.\"\n\n19 December 2019\n\nFormer model Kaja Sokola accuses Weinstein of sexually assaulting her when she was 16. She was anonymous in an earlier class action legal case, but has removed herself from that group and gone public in order to file her own case, saying the above settlement is not \"fair or just\". When she initially came forward in 2018, Weinstein's then lawyer described the allegations as \"preposterous\".\n\n6 January 2020\n\nThe trial process begins in New York, with a frail-looking Weinstein using a walking aid and accusers including Rose McGowan and Rosanna Arquette protesting outside the court.\n\nMeanwhile, LA County prosecutors charge Weinstein with raping one woman and sexually assaulting another in separate incidents over a two-day period in 2013.\n\n22 January 2020\n\nFollowing jury selection, the trial begins in earnest in New York with graphic prosecution statements on his alleged crimes.\n\nProsecutor Meghan Hast says he was a \"seasoned\" sexual predator, giving explicit details of allegations by three women, only two of whom are on the charge sheet.\n\nHis defence team say his actions were consensual, including in one \"loving\" relationship.\n\n23 January 2020\n\nFormer Sopranos actress Annabella Sciorra testifies that the film producer raped her at her home 25 years earlier, after having forced himself into her apartment and attacked her.\n\nFurther testimony just over a week later is heard from one-time aspiring actress Jessica Mann, who details a catalogue of abuse by the Hollywood producer, saying he once trapped her in a hotel bedroom and raped her. Three of the five charges against Mr Weinstein relate to Ms Mann.\n\n13 February 2020\n\nIn her closing arguments, Weinstein's lead attorney Donna Rotunno urges the 12 jurors to make themselves \"unpopular\" by acquitting him, insisting he had been innocent from the start.\n\nThe prosecution's case rests on whether the jury believes the accusations of six women, although the jury is considering charges related to just two: ex-actress Jessica Mann and former production assistant Mimi Haleyi, as other claims are too old to prosecute.\n\n18 February 2020\n\nWith all the evidence heard, the jury begins deliberations. Judge James Burke reminds them that to convict, they must be sure of the defendant's guilt beyond all reasonable doubt and must reach unanimous verdicts on each count. If they cannot, the judge may be forced to declare a mistrial.\n\nJudge Burke warns lead defence lawyer Donna Rotunno not to talk to the press after an opinion piece she wrote for Newsweek drew the ire of prosecutors.\n\n24 February 2020\n\nAfter five days of deliberation, the jury finds Weinstein guilty of a criminal sexual act in the first degree and third-degree rape.\n\nThe 67-year-old is convicted of sexually assaulting former production assistant Mimi Haleyi in 2006 and raping ex-actress Jessica Mann in 2013.\n\nHe is acquitted of first-degree rape and two counts of predatory sexual assault, charges that could have seen him jailed for life.\n\nThough cleared of the most serious charges made against him, the producer still faces up to 25 years in prison on the sexual assault conviction.\n\nJudge James Burke orders Weinstein to be held in custody and schedules a sentencing hearing for 11 March.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/4644/production/_98288971_harveyparty_getty.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.41594672.page&x1=[urn:bbc:cps:d0b7bce9-abc9-7c4a-965d-d40969cf96ac]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ichef.bbci.co.uk/news/320/cpsprodpb/4644/production/_98288971_harveyparty_getty.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/4644/production/_98288971_harveyparty_getty.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-41594672", "title": "Harvey Weinstein timeline: How the scandal unfolded", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Key developments in the saga surrounding the film producer.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 153637540, "og": {"title": "How the Harvey Weinstein scandal unfolded", "type": "article", "description": "Key developments in the saga surrounding the film producer.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-41594672", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/4644/production/_98288971_harveyparty_getty.jpg", "alt": "BBC News. Harvey Weinstein"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "How the Harvey Weinstein scandal unfolded", "description": "Key developments in the saga surrounding the film producer.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/4644/production/_98288971_harveyparty_getty.jpg", "alt": "Harvey Weinstein"}, "domain": "www.bbc.com"}, "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}