{"url": "www.vulture.com/2018/04/a-guide-to-celebrities-of-the-who-niverse.html", "text": "Lindsey Weber and Bobby Finger are the co-hosts of a podcast called Who? Weekly, a guide to “everything you need to know about the celebrities you don’t.”\n\nRita Ora. Blac Chyna. Colton Haynes. Zendaya. Bella Thorne. A Wholebrity (or just a “Who”) is the kind of celebrity — or “celebrity” — whose name makes many of us stop and ask: “Who?” The average celebrity-gossip connoisseur might have a difficult time matching a Wholebrity’s name to a face. But to ignore Whos, or pretend to be above them, is to miss out on the cultural conversation of the moment: We are living, increasingly, in a Who universe.\n\nThese people, the sorta famous, have always been with us. They used to be known as C-through-Z-list celebrities. But today, everything has changed. The click-seeking media cover Whos with nearly as much passion as they do those on A- and B-lists (“Thems,” as we like to call those more recognizable stars), even if the Who has no immediately discernible skills or credits to his or her name. For example, there are Explainers — take Us Weekly’s “Who Is Becca Kufrin? 5 Things to Know About the New Bachelorette,” which includes such facts as “She’s Got Beauty and Brains” and “She’s an Animal Lover.”\n\nWhos can only ever be a little bit famous; there is something charming about that, like a homespun version of celebrity. But don’t confuse Whodom with obscurity or viral fame. It takes hard work and an unslakable thirst to become a Who. Whos have been raised on celebrity culture, and they reflect its values back at us in their deep desire for fame and their performance of it.\n\nWhodom was enabled by social media: Our new, post-Facebook internet allows the fame game to be played on a weirdly level field. Stories of actors struggling to make it in Hollywood, the kind of all-or-nothing narrative you see in movies like La La Land, have been made obsolete. You can now get famous, or at least sort of famous, by creating a popular blog, YouTube channel, or Instagram account. Former cast members of reality-TV shows have been able to extend their shelf life by amassing a following on the social-media platform of their choice. And we sat there, on our phones, waiting to click through. Even the most popular stars realized they could keep in touch with their fans by creating their own highly curated social channels. Soon, those celebrities’ Instagram accounts would have more reach than the tabloid magazines they would’ve once sold their photos to. So what’s the point of negotiating for that People exclusive cover when you can just post the photos yourself, in the exact way you choose — no meddling, manipulating middlemen required?\n\nAround the turn of the decade, early adopters began to realize you didn’t even need a sex tape to embark on a career as a Who, such was the power of social media. And so press releases were ditched for posts (Olivia Munn has used Instagram Stories to clarify her relationship status twice this year), often ones involving screenshots of the iPhone’s Notes app (British Wholebrity Binky Felstead tried her best to squash a pseudo-feud with Cheryl Cole in an emoji-laced apology written in Notes and screenshotted for Instagram; Australian Who Ruby Rose once used the app to chime in on a celebrity feud that didn’t even involve her). It’s wonderful to watch the thirst of a Wholeb shine through in these moments when they “take to social media” in order to transform an easily overlooked story into something that puts them in the headlines. Kim Kardashian incited 2016’s most consequential feud when she released damning footage of Taylor Swift, not via a leak to TMZ but directly on her Snapchat. It ended up on the former’s homepage anyway, of course — because if you post it, the tabloids will come.\n\nKim Kardashian, the patron saint of Whos striving for more, though, is actually a Them. And over the past few years, Thems have become more elusive, because inaccessibility connotes power. And with Thems increasingly out of reach, tabloids have scrambled to find replacements in HGTV stars and Thems’ Instagram-famous children.\n\nOne of the fun parts of classifying celebrities this way is that a Who to you isn’t necessarily a Who to us: There is now just too much culture to consume, too many iterations of Bravo’s Housewives and Love & Hip Hop to keep track of, too many influencers selling teeth whiteners on Instagram. Our Who — let’s say Christina El Moussa — is your Them if you’re a longtime watcher of HGTV’s Flip or Flop or fan of her current boyfriend, British TV personality Ant Anstead (Who?).\n\nBut for tabloid lovers like us, there can never really be too many famous people, so we’re delighted to be living in this golden age of the microceleb. And to be a fan of a Who is to participate in a special kind of fandom: You can feel closer than ever to your idol thanks to social media and feel extra-special for connecting with someone nobody else seems to be recognizing. Loving Wholebrities is like being part of an exclusive club.\n\nWhos have found ways to monetize the intimacy they share with their followers. When celebrities like Serena Williams and Rihanna land sponsorship gigs with Nike or Dior, they know their image is in good hands. But not everybody can ink a high-end deal, so Wholebrities have to be scrappy. Flipping through full-page ads of Jennifer Aniston holding bottles of SmartWater and Aveeno in the latest issue of In Touch, you might pass “candid” photos, in the editorial pages, of a Who like Vanessa Lachey casually buying a bottle of Nature’s Bounty Hair, Skin & Nails Gummies at the drugstore. Whos take a quantity-over-quality approach, sharing innumerable sponsored posts across all their social platforms. Promoting a waist trainer (Amber Rose), teeth-whitening kit (Vanderpump Rules’ Jax Taylor), or other wellness products (ever heard of SugarBearHair gummies?) can be surprisingly lucrative if you have enough fans: Bella Thorne (17.3 million followers) claims she’s earning $65,000 per paid Instagram post and between $10,000 and $20,000 per paid Snapchat. While that’s chump change compared to the six-figure sponsorship deals commanded by Thems like Kylie Jenner, it’s still fast, easy money. Even Cardi B, now a Them, is finding it hard to leave her Wholebrity income behind, reportedly accepting $20,000 a month to continue promoting beloved affordable-clothing brand Fashion Nova on her Instagram account.\n\nWhos also have stamina. While Thems are notorious for offering “No comment” when confronted with controversy, a Who will happily reply to almost any negativity on any medium with a one-liner. When Piers Morgan retweeted a mostly nude photo of model Emily Ratajkowski, adding, “Do you want me to buy you some clothes? You look freezing,” she wrote back: “Thanks, but I don’t need clothes as much as you need press.”\n\nAfter all these years, now celebs really are “just like us.” That’s the beauty and the terrifying part about it. But maybe that’s what we’ve wanted all along: famous people who actually want our attention, who value the spotlight, and us, as much as we do.\n\nThe Ten Whos to Know\n\nThe hard-to-place names you’ll hear most often.\n\nRita Ora, Colton Haynes, and Julianne Hough.\n\nRita Ora: British singer-actress.\n\nColton Haynes: Teen Wolf alum and BFF to the more famous.\n\nJulianne Hough: Lifestyle influencer from Dancing With the Stars.\n\nHenry Cavill and Blac Chyna.\n\nHenry Cavill: He plays Superman.\n\nBlac Chyna: Instagram model turned Kardashian-family infiltrator.\n\nKaley Cuoco, Emily Ratajkowski, and Jonathan Cheban.\n\nKaley Cuoco: The Big Bang Theory’s happy-go-lucky Everywoman.\n\nEmily Ratajkowski: Model from the “Blurred Lines” video.\n\nJonathan Cheban: Entrepreneur, Kim Kardashian friend, and Instagram foodie.\n\nBella Thorne and Zendaya.\n\nBella Thorne: Wild-child former Disney Channel star.\n\nZendaya: Mononymous actress, activist, and fashion favorite.\n\nT h e K a r d a s h i a n A d j a c e n t s If this is our royal family, here are some of the members of their court. Jordyn Woods and Kylie Jenner. Photo: Courtesy of User’s Instagram Jordyn Woods: A social-media star-slash-model, a body-positivity crusader, and Kylie’s best friend. Also friends with Willow and Jaden Smith. Corey Gamble: Kris’s much-younger boyfriend; the two met when he was Justin Bieber’s tour manager. Younes Bendjima: Boyfriend of Kourtney, who finally swapped Scott Disick for a younger model. (Bendjima is also a model.) Jeff Leatham: The man responsible for the Kardashian-Jenner family’s elaborate and expensive floral arrangements and husband to fellow Who Colton Haynes. Marina Acton: A Ukrainian entrepreneur and aspiring singer who started appearing in Kim’s Instagram feed after she bought Kim and Kanye’s old mansion for double what Kimye paid for it.\n\nF a m i l i a l W h o s There’s no easier way into showbiz than through good old-fashioned nepotism. Kaia and Presley Gerber. Photo: Courtesy of User’s Instagram Kaia and Presley Gerber: Cindy Crawford’s kids have parlayed looking like their mother into modeling careers. Photo: NINA PROMMER/NINA PROMMER/PMC Austin Swift: Taylor’s brother has big Hollywood dreams, but most headlines about him still include his sister’s name. Photo: David Crotty/David Crotty/PMC Paris Jackson: Michael’s daughter has appeared on the Fox show Star and is frequently seen with her godfather, Macaulay Culkin. Photo: Sean Zanni/Patrick McMullan via Getty Image Sofia Richie: Lionel’s daughter dates Kourtney Kardashian’s ex Scott Disick. Photo: Sean Zanni/Sean Zanni/PMC Brooklyn Beckham: The son of David Beckham and Victoria is named Brooklyn and now lives in New York; he studies photography at Parsons.\n\nR e a l i t y - S h o w W h o s The form makes it easy for a Who to rise quickly — and fall quicker. Nick Viall. Photo: Courtesy of User’s Instagram Nick Viall (The Bachelor): A two-time Bachelorette runner-up who became the Bachelor of season 21. He and his winner, Vanessa, split; he was recently rumored to be dating January Jones. Robert Herjavec (Shark Tank): The Whoiest Shark competed on Dancing With the Stars and married his dance partner, Kym Johnson. Jon and Drew Scott (The Property Brothers): Tabloids love these home-rehabbing twins’ squeaky-clean image. Joseline Hernandez (Love & Hip Hop: Atlanta): She quit L&HH last year and dropped a diss track targeting fellow alum Cardi B. (She lost that battle.) She’ll soon have her own show, Joseline Takes Miami.\n\nT . H . A . M . P . S . Jason Walsh and Hilary Duff. Photo: Backgrid/CPR / BACKGRID Professional hangers-on you’ll know from their appearances on Instagram and Snapchat. To help you remember who these thirsty helpers are and what they do, we’ve created a handy acronym, T.H.A.M.P.S.: T (trainer), H (hairstylist), A (agent), M (makeup artist), P (publicist), S (stylist). Jason Walsh: Responsible for hardening some of Hollywood’s hardest hard bodies — Bradley Cooper, Matt Damon, and Hilary Duff (whom he also once dated). Simon Huck: Owner of Command PR, Huck once starred in his own reality show, The Spin Crowd. It aired for one season. Sure, his only clients seem to be the Kardashians, but isn’t that enough? Mario Dedivanovic: You can thank @makeupbymario for “contouring” — a makeup technique popularized by Kim Kardashian that involves sculpting the structure of your face. You can also take his and Kim’s makeup master class — tickets start at $500. Michael Kives: The A-list agent Kate Hudson calls “my Jerry Maguire” and for whom Katy Perry flew a banner over Century City reading KIVES IS THE BEST AGENT IN THE WORLD. Photo: David Crotty/David Crotty/PMC Jen Atkin: Known for giving the Kardashians their iconic beachy waves (the kind you can’t actually get from the beach), she then started her own brand, OUAI Haircare. Photo: David Crotty/David Crotty/PMC Brad Goreski: The Rachel Zoe Project breakout had his own spinoff series (It’s a Brad, Brad World) but perhaps gets more attention from being ever present in the Instagrams of his clients (Lea Michele, Rashida Jones, Demi Moore).\n\nT h e Y o u T u b e W h o s They’re not asking for 15 minutes of fame — they just want you to watch the 15-second autoplay ads that run before their videos. Todrick Hall and Taylor Swift. Photo: Courtesy of User’s Instagram Todrick Hall: Best pal to Taylor Swift, he’s a singer, actor, and dancer who’s been a judge on RuPaul’s Drag Race and recently starred in Broadway’s Kinky Boots and Chicago. He’s 33 but calls his fans “Toddlerz.” Trisha Paytas: A YouTube pro who does it all on-camera: sings, dances, eats, and sobs uncontrollably. Tana Mongeau: Rose to fame via her dramatic “storytime” videos, such as “I FOUGHT A GROWN ASS COUPLE IN THE AIRPORT.” Liza Koshy: The 22-year-old got her start in 2013 making comedy videos on Vine and by 2016 was interviewing Barack Obama on YouTube.\n\nW h e n a W h o H o o k s U p W i t h a T h e m We’re not saying a Who would use a relationship with a very famous person to get a little bit famous themselves — but sometimes it happens. Photo: London Ent/Splash News/London Ent/Splash News Taylor Swift and Joe Alwyn: All we know about him is that he’s blond, British, and a footnote in Swift’s Wikipedia entry. Photo: Courtesy of User’s Instagram Sam Smith and Brandon Flynn: Flynn plays a straight teen on 13 Reasons Why but has been seen making out with Smith in paparazzi shots the world round. Photo: Courtesy of User’s Instagram Britney Spears and Sam Asghari: The 25-year-old aspiring actor is seemingly as dedicated to fitness as he is to his famous girlfriend. Photo: Backgrid Emma Watson and Chord Overstreet: When they got together, headlines wondered: “Who Is Chord Overstreet?” (He was on Glee.)\n\nY o u n g W h o s These ingenués are charting their own course to grown-up stardom via social media. Millie Bobby Brown. Photo: Patrick McMullan Millie Bobby Brown, 14, plays Eleven on Stranger Things and is best friends with fellow young Who and Sia muse Maddie Ziegler. She recently announced a relationship with 15-year-old musical.ly star Jacob Sartorius. Photo: David Crotty/David Crotty/PMC Ariel Winter, 20, grew up on ABC’s Modern Family. She’s a tabloid favorite for her tiny shorts, outspoken quotes, and complicated relationship with her estranged mother. Photo: Presley Ann/Presley Ann/PMC Yara Shahidi, 18, shot to Whodom as the eldest daughter on ABC’s Black-ish. Now she plays the same character on its Freeform spinoff Grown-ish. She was recently accepted into Harvard with help from Michelle Obama, who wrote her a letter of recommendation. Photo: Presley Ann/Presley Ann/PMC KJ Apa, 20, wasn’t born with red hair, but the hunky New Zealander plays Archie Andrews on the CW’s Riverdale anyway. (Didn’t you hear? Archie got hot.)\n\nW h o m s ( B r i t i s h W h o s ) Thanks to stricter defamation laws, British tabloids tend to focus on Who-y celebrities, who are less litigious than Thems. Gemma Collins Photo: Courtesy of User’s Instagram Gemma Collins: A breakout star from The Only Way Is Essex, Gemma has since gone on to great things, like falling in a hole onstage at the Radio 1 Teen Awards. Katie “Jordan” Price and Peter Andre: The two met on I’m a Celebrity … Get Me Out of Here! and were married for four years. They once covered “A Whole New World” from Aladdin. Stephen Bear and Charlotte Crosby: After starring on Geordie Shore (the U.K.’s Jersey Shore), Crosby met Bear, an Ex on the Beach alum. They made headlines for repeatedly breaking and making up. Kem Cetinay and Amber Davies: They met on Love Island (the U.K.’s Temptation Island) and broke up 132 days later owing to hectic schedules. Ant and Dec: These comedians host Pop Idol and the Brit Awards. Chloe Green: The Topshop heiress is expecting her first child with Jeremy “Hot Felon” Meeks.\n\nI n s t a g r a m A r e a P a t h t o W h o - D o m Photo: Courtesy of User’s Instagram Jennifer Meyer is a jewelry designer (and Tobey Maguire’s ex) who gets her A-list friends to wear and tag her designs on Instagram. Her recent 40th-birthday party was attended by Courteney Cox, Jessica Alba, Gwyneth Paltrow, Demi Moore, Nicole Richie, and Kate Hudson — many of whom posted photos from the event.\n\nW h o V s . T h e m Some celebrities are on the bubble between Whodom and Themdom. Julianne Hough is a prime example: She dances with stars on ABC — but is she one herself? The case can be made either way. She’s a Them: She starred in a Nicholas Sparks movie, Safe Haven. She’s a Who: She judges an ABC reality show. She’s a Them: Her wedding received extensive coverage (and a cover!) from People magazine. She’s a Who: She’s released two full-length country albums that no one has ever heard. She’s a Them: She has famous friends … She’s a Who: … Like Nina Dobrev, a Canadian TV actress. She’s a Them: She was invited to George Clooney’s tequila brand’s Halloween party in 2013 … She’s a Who: … She showed up in blackface. She’s a Them: She won an Emmy … She’s a Who: … It was a Creative Arts Emmy.\n\nO n e W e e k i n t h e B u s y L i f e o f a W h o Tuesday. Feb. 20, 2018\n\n“Emily Ratajkowski leaves little to the imagination as she goes topless for sultry Vanity Fair cover shoot … after claiming she’s at her most comfortable while naked.” —Daily Mail Wednesday, Feb. 21\n\n“TUM-THING DIFFERENT: Belly button shaping is the latest cosmetic surgery trend … and people are keen to copy Emily Ratajkowski’s ‘hooded oval.’ ” —The Sun Thursday, Feb. 22\n\n“Zach Braff Trolls Emily Ratajkowski in the Best Way Ever After She Posts Yet Another Nude Pic” —Hollywood Life Friday, Feb. 23\n\n“Model Emily Ratajkowski: SURPRISE, I’M MARRIED!!!” —TMZ Saturday, Feb. 24\n\n“Chrissy Teigen ‘Oddly Mad’ She Wasn’t Invited to Emily Ratajkowski’s Wedding” —E! News Tuesday, Feb. 27\n\n“What Emily Ratajkowski and Sebastian Bear-McClard’s Body Language Says About Their Relationship” —Cosmopolitan Wednesday, Feb. 28\n\n“Is Newlywed Emily Ratajkowski Pregnant?” —X17\n\nThe Center of the Whoniverse: Bella Thorne\n\nPhoto: Patrick McMullan\n\n*This article appears in the April 16, 2018, issue of New York Magazine. Subscribe Now!", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/ant-dec.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/8.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/13.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/13-who-chart-2.nocrop.w1024.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Jen-Atkin.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Mario-Dedivanovic.w190.h190.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/11.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Tana-Mongeau.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/14.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/15.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Liza-Koshy.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Katie-and-Peter.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Chloe-Green.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/scotts.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Brooklyn-Beckham.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/9.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Jordyn-Woods.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Corey-Gamble.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/KJpmc.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Simon-Huck.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/trisha-Paytas.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/pmc.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/5.w710.h473.jpg", "https://pyxis.nymag.com/v1/imgs/e43/bdd/3f774c18c274e6d3d8632daac3e54ad513-who-universe-lede.2x.h600.w512.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Kem-Cetinay.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe-lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/younes-Bendjima.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Robert-Herjavec.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/4.w710.h473.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Sofia-Richiejpg.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Marina-Acton.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/6.w710.h473.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/1.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Paris-Jackson.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/12.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/3.w710.h473.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Michael-Kives-twitter.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Jeff-Leatham.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Yarapmc.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/2.w710.h473.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Joseline-Hernandez.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/7.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Julianne-Hough.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Swiftpmc.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Charlotte-Crosby.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/Goreski.w190.h190.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/16.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe/10.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe-lede.w1200.h630.jpg", "keywords": [], "authors": ["Bobfinger", "Lindsey Weber"], "canonical_link": "https://www.vulture.com/2018/04/a-guide-to-celebrities-of-the-who-niverse.html", "title": "The A-List of Z-List Celebrities", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The A-List of Z-Listers", "url": "https://www.vulture.com/2018/04/a-guide-to-celebrities-of-the-who-niverse.html", "description": "Rita Ora. Blac Chyna. Colton Haynes. Zendaya. Bella Thorne. A guide to the many, many celebrities whose names make you say … “Who?”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe-lede.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The A-List of Z-Listers", "description": "Rita Ora. Blac Chyna. Colton Haynes. Zendaya. Bella Thorne. A guide to the many, many celebrities whose names make you say … “Who?”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/04/12/magazine/who-universe-lede.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-04-15T21:00:02.078-04:00", "tag": "celebrity, vulture guides, new york magazine, the who-niverse, vulture homepage lede, fame, social media", "publisher": "https://www.facebook.com/Vulture"}, "description": "Who Weekly hosts Bobby Finger and Lindsey Weber present this guide to the Who-niveruse: the many, many celebrities whose names make you say …”Who?” Rita Ora. Blac Chyna. Colton Haynes. Zendaya. Bella Thorne, and more.", "sailthru.tags": "celebrity, vulture guides, new york magazine, the who-niverse, vulture homepage lede, fame, social media", "author": "Bobby Finger, Lindsey Weber", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1523840402.078, "source": "http://www.vulture.com", "summary": ""}