{"url": "https://www.washingtonpost.com/arts-entertainment/2018/10/03/bristol-palins-first-episode-teen-mom-og-had-very-disturbing-scene/", "text": "But their eldest daughter, Bristol, seems to love reality TV the most: She was on “Dancing With the Stars” twice and had her own Lifetime show, “Life’s a Tripp.” And starting this week, she made her debut on the seventh season premiere of “Teen Mom OG,” a spinoff of the hit show “16 and Pregnant.”\n\nBefore you ask: Yes, Bristol is 27, so not a teenager. But as she pointed out on Monday’s episode, she was once a teen mom. In fact, when she was pregnant during her mother’s vice presidential campaign, she may have been the most famous teen mom in the world. Bristol made sure to explain this to viewers: “I’m no stranger to being a young mom in the public eye.\"\n\nAD\n\nAD\n\nBristol’s story line during the premiere was a family affair, as her mother and sisters (Willow, 24, and Piper, 17) gathered in Arizona for Willow’s bachelorette party. Bristol marveled that she’s the only Palin who doesn’t live in Alaska, given that she moved to Austin after she married Dakota Meyer in 2016. She lives there with their toddler daughters, Sailor and Atlee; and her son, 9-year-old Tripp, whose father is her ex-fiance Levi Johnston.\n\nBristol and Dakota divorced this year, and their split will play out over the season. It’s already tragic: Dakota, 30, is a military veteran suffering from post-traumatic stress disorder. Bristol told viewers that Dakota’s PTSD “has been really hard on our marriage” and that “it’s been a challenge to keep our family together.”\n\nIn the beginning of the episode, Bristol explained that while she was away at the bachelorette party, Dakota took their daughters on a trip to Kentucky, his home state. “It’s the first time he's taken them by himself like this,” Bristol said.\n\nAD\n\nAD\n\n“How did he do on the flight?” Sarah asked.\n\n“He said they did good. I’m proud of him,” Bristol assured her mother. “I’m relieved that he's such a good dad that I don't have to worry.”\n\nHowever, the episode concluded with an extremely disturbing scene, as the couple had a huge fight. Amid noises of their kids playing in the background, Dakota and Bristol tried to explain their issues to two “Teen Mom” producers.\n\nBristol said she knows that Dakota suffers from PTSD, but he takes his anxiety out on her and she can’t handle it — she doesn’t want her kids to think that’s what marriage looks like. Dakota responded that he feels terrible that he’s said some awful things but that he relives his fellow servicemen dying in front of him every single day, and he wished Bristol could understand his pain.\n\nAD\n\n“I’m a punching bag for everything that he goes through internally,” Bristol said, adding that she’s never sure whether his anger is the anxiety or just him being cruel.\n\nAD\n\n\"Well, I don’t know what’s PTSD or what’s not,” Dakota said, mocking Bristol’s tone. “Are you kidding me? You wonder why I go off the rails and why it gets amplified? And all I want you to do is love me and be there for my scars.”\n\nThe whole argument was tough to watch, and MTV promised there’s more to come. On the after-show, Bristol told viewers that Dakota has “sought out treatment, and he is taking steps to try to control [his anxiety] and to better himself.” And she explained why she wanted to show her life on television once again.\n\nAD\n\n“I’ve grown up so much the last 10 years, and I think that God gave me this platform to be on this show, to open up my life and to discuss things that are going on or that I’m passionate about,” Bristol said. “If I can help or encourage others, then I think that that’s what God wanted me to do.”\n\nAD", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/Dt3Uiy17XYIpIN9Raw2JPXxh25A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SMGRFOHQWJCIRGX2YEFG2PXY4M.jpg"], "top_img": "https://www.washingtonpost.com/resizer/Dt3Uiy17XYIpIN9Raw2JPXxh25A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SMGRFOHQWJCIRGX2YEFG2PXY4M.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/arts-entertainment/2018/10/03/bristol-palins-first-episode-teen-mom-og-had-very-disturbing-scene/", "title": "Bristol Palin’s first episode of ‘Teen Mom OG’ had a very disturbing scene", "meta_data": {"description": "The MTV show chronicles Bristol's split with her husband, military veteran Dakota Meyer.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/arts-entertainment/2018/10/03/bristol-palins-first-episode-teen-mom-og-had-very-disturbing-scene/", "image": "https://www.washingtonpost.com/resizer/Dt3Uiy17XYIpIN9Raw2JPXxh25A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SMGRFOHQWJCIRGX2YEFG2PXY4M.jpg", "title": "Bristol Palin’s first episode of ‘Teen Mom OG’ had a very disturbing scene", "description": "The MTV show chronicles Bristol's split with her husband, military veteran Dakota Meyer."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Bristol Palin’s first episode of ‘Teen Mom OG’ had a very disturbing scene", "description": "The MTV show chronicles Bristol's split with her husband, military veteran Dakota Meyer."}, "last_updated_date": "2018-10-04T16:31:18.086Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1538496000.0, "source": "https://www.washingtonpost.com", "summary": ""}