{"url": "www.yourtango.com/2018312477/why-kourtney-kardashian-boyfriend-younes-bendjima-cheating-leonardo-dicaprio-girlfriend", "text": "Are the Kardashian sisters in for some double trouble?\n\nKourtney Kardashian might have a scandal of her to deal with own amidst her sister Khloe Kardashian’s cheating baby daddy drama.\n\nYounes Bendjima, 24, who has been dating the oldest of the Kardashian sisters since 2016, was seen out with another woman April 9.\n\nWhile Kourtney was with Kim on a vacation in Turks and Caicos, Younes was spotted talking and laughing with the brunette beauty, who has been identified as Leonardo DiCaprio’s girlfriend Camila Morrone, 20, according to The Daily Mail.\n\nInstagram\n\nThe two could be seen having a casual and fairly lengthy conversation in West Hollywood Monday night before hugging and going their separate ways.\n\nThe Kardashian’s Algerian hunk and DiCaprio’s much younger girlfriend, who is much closer in age to Younes, are just friends, a source told the outlet.\n\nCamila sported a bare face and black outfit with white boots while Younes was wearing a simple black tee and jeans.\n\nKourtney and her young boo seem to be very in love and post about each other all over social media. In one photo, she is sitting on Younes’ lap and dressed in nothing but Calvin Clines undergarments and a pair of unbuttoned jeans.\n\nInterestingly enough, though, The Daily Mail reports that Kourtney posted some thought-provoking quotes that may hint she and Younes are not the picture-perfect couple they seem to be.\n\n“I loved and that was a reward in itself,” she posted. The quote was credited to an Anthony Jones.\n\nLater that day Kourtney posted, “All I want is something real,” a quote from Faraway.\n\nUh-oh. Could there be trouble in paradise while Kourtney is literally in paradise?\n\nKourtney and Younes have not addressed the photos yet.\n\nInstagram\n\nThe Kardashian sisters seem to be drawn to cheaters, but hopefully, Kourtney has nothing to worry about.\n\nThe reality tv star previously had a rough on-and-off-again relationship with Scott Disick, 34, until they split up for good in 2015.\n\nThe exes had three children together, Mason 8, Penelope 5, Reign 3, whom they currently co-parent.\n\nScott and Kourtney’s relationship was bound to end badly as he cheated on her and struggled with many issues, including alcoholism.\n\nGetty Images\n\nDrama seems to follow the Kardashians and Jenners around and Scott and Kourtney’s ended relationship is no exception.\n\nScott was not exactly thrilled when he found out she was dating a younger and hotter guy. In an episode of Keeping Up With the Kardashians, Kourtney discussed how Scott was jealous of Younes and was not able to move on.\n\nThough it looks like Kourtney has found true love, some fans think the Kardashian sisters may be in for some double trouble after Younes’ “mystery woman.”\n\nThe photos of Younes out and about with Camila come as Khloe’s boyfriend and father of her unborn baby was exposed for cheating on the KUWTK star, as YourTango previously reported.\n\nInstagram\n\nTristan was caught kissing two women, including a Kardashian clone named Lani Blair, in photos leaked just days before he and Khloe prepare to welcome their first baby.\n\nA sex tape involving the Cleveland Cavalier, who left his previous girlfriend while she was pregnant, broke the Internet this week as well.\n\nNone of the Kardashian family nor Thompson has yet to comment on the cheating rumors.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/Untitledfa.jpg", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/Untitleda.jpg", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/Untitled_23_0.jpg", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BeFunky%20Collage_146.jpg?itok=Wfni38yh", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/BeFunky%20Collage_146.jpg?itok=rbGX0blT", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/453415874_0.jpg"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BeFunky%20Collage_146.jpg?itok=Wfni38yh", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018312477/why-kourtney-kardashian-boyfriend-younes-bendjima-cheating-leonardo-dicaprio-girlfriend", "title": "Why Kourtney Kardashian's 24-Year-Old Boyfriend Was Spotted Getting Cozy This Week With Leonardo DiCaprio's 20-Year-Old Model Girlfriend", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "article": {"author": "https://www.facebook.com/sarah.gangraw?ref=bookmarks", "published_time": "2018-04-11T22:30:30", "modified_time": "2018-04-11T22:30:30"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018312477/why-kourtney-kardashian-boyfriend-younes-bendjima-cheating-leonardo-dicaprio-girlfriend", "title": "Why Kourtney Kardashian's 24-Year-Old Boyfriend Was Spotted Getting Cozy This Week With Leonardo DiCaprio's 20-Year-Old Model Girlfriend", "description": "Are the Kardashian sisters in for some double trouble?", "updated_time": "2018-04-11T22:30:30", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BeFunky%20Collage_146.jpg?itok=Wfni38yh", "width": 620, "height": 309}}, "description": "Kourtney Kardashian's 24-year-old boyfriend Younes Bendjima was spotted with a mystery woman Monday night right as Khloe's baby daddy was exposed for cheating. The woman Younes Bendjima was seen with was identified as Leonardo DiCaprio's girlfriend, Camila Morrone.", "abstract": "Kourtney Kardashian might have a scandal of her to deal with own amidst Khloe’s cheating baby daddy drama.Younes Bendjima, 24, who has been dating", "keywords": "Mystery woman, seen hugging, Kourtney Kardashian's boyfriend", "robots": "follow, index, noodp, noydir", "news_keywords": "Kourtney Kardashian, Kourtney Kardashian boyfriend, Younes Bendjima Kourntey Kardashian, Younes Bendjima cheating, Camila Morrone, Kardashian Cheating", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018312477/why-kourtney-kardashian-boyfriend-younes-bendjima-cheating-leonardo-dicaprio-girlfriend", "title": "Why Kourtney Kardashian's 24-Year-Old Boyfriend Was Spotted Getting Cozy This Week With Leonardo DiCaprio's 20-Year-Old Model Girlfriend", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BeFunky%20Collage_146.jpg?itok=Wfni38yh", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/u4GoS0-R9Sg"], "publish_date": 1523457030.0, "source": "http://www.yourtango.com", "summary": ""}