{"url": "people.com/movies/leonardo-dicaprio-nina-agdal-breakup/", "text": "Leonardo DiCaprio is single once again.\n\nThe actor and his girlfriend, model Nina Agdal, have called it quits.\n\nGet push notifications with news, features and more.\n\n“They broke up a couple of days ago” according to a source close to the couple.\n\n“Nina and Leo have parted ways. It is amicable. They remain friends,” the source adds.\n\nEarlier this week, DiCaprio and pal Tobey Maguire were spotted partying at L.A. hotspots The Peppermint Club and Avenue LA. At the latter club, The Revenant star was reportedly spotted dancing with model Ella Ross, who has recently been linked to Scott Disick.\n\nOscar winner DiCaprio, 41, and Agdal, 24, were first spotted together in May 2016, and a source confirmed to PEOPLE in July that the pair were hooking up.\n\nThe two began spending more time with each other, though — from a beach day in Malibu to a yacht party in Ibiza.\n\nRELATED VIDEO: Did You See The Record Leo DiCaprio Broke on Oscars Night?\n\nThe former couple were out enjoying the warm spring weather just last month in New York City, where they were spotted locking lips by the Hudson River in downtown Manhattan.\n\n“It was a really sweet moment,” an onlooker told PEOPLE, adding that, “Nina put her arms around his neck and kissed him.”\n\nWhile they were dating, Agdal and DiCaprio seemed always to be on the go, taking several vacations together over the course of the year. They made their first weekend getaway in Montauk, New York in June 2016. The next month the duo vacationed together with friends on the private Bahamian island Over Yonder Cay.\n\nImage zoom AKM-GSI\n\nAfter enjoying a romantic beach day in Malibu, California in July, they were spotted later that month partying in Ibiza, Spain, with DiCaprio’s longtime friend Maguire and a yacht full of their closest friends.\n\nA trip to the Hamptons last August ended with a fender-bender, though a source quickly confirmed that both were “doing great” following the minor accident. In September they were seen out in N.Y.C. locking lips at Gotham Bar and Grill, where a source revealed, “They were kissing. Like, right out in the open at the table.”\n\nImage zoom Jackson Lee/Splash News Online\n\nBy last October, a source told PEOPLE that the coupled seemed “more serious.”\n\n“Leo seems very into her,” the source said. “He constantly holds her hand and kisses her. Nina seems to enjoy Leo’s company too. She acts very giddy around him. She has great energy and seems to make Leo very happy.”\n\nThe source added, “Whenever they spend time together, Leo acts very happy. For Leo, Nina seems like a breath of fresh air.”\n\nWhen DiCaprio turned 42 last November, Agdal was on hand for a special trip to French Polynesia with him and his mother, Irmelin Indenbirken, PEOPLE confirmed. And later in the month, Agdal and DiCaprio were seen spending Thanksgiving Eve together in Charleston, South Carolina.\n\nThey again fled to warmer weather in the final month of 2016, traveling to Cancun with Lukas Haas and a mystery brunette. Later in January, DiCaprio and the model reunited at Jimmy Fallon’s private Golden Globes afterparty at L.A. hot spot Delilah.\n\n“Leo was in a booth next to the deejay and basically gazing longingly into Nina’s eyes,” a partygoer told PEOPLE at the time. “At one point, she leaned into him for a cuddle. They were very relaxed together.”\n\nAfter the Oscars on Feb. 26, DiCaprio meet up with Agdal at one of Hollywood’s exclusive afterparties: a private bash hosted by Madonna and her manager. A source told PEOPLE at the time that DiCaprio and Agdal were closer than ever.\n\nImage zoom AKM-GSI; Inset: Gregg DeGuire/WireImage\n\nIn March, Agdal and DiCaprio jetted off to St. Bart’s to celebrate her 25th birthday. There, they met up with Orlando Bloom and a group of friends including tech mogul Jim Clark’s model wife, Kristy Hinze-Clark.\n\nThe group spent time together on Clark’s yacht. “They are having fun,” and insider told PEOPLE at the time.\n\nImage zoom AKM-GSI; Inset: Getty\n\nFinally, the couple was spotted attending an intimate showcase for an Australian band making its New York City debut in late March. Joined at the show by rapper Q-Tip, the trio were among a small audience at the Ludlow House to watch the band Chase Atlantic perform.\n\n“He was low-key but sweet. They hugged around the bar,” a source told PEOPLE of DiCaprio and Agdal. “He made sure she had a seat.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F03%2Fnina-agdal2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F07%2Fleonardo-dicaprio-c-1024.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F08%2Fdicaprio-agdal-435t.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F03%2Fleo-nina.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fagdal-dicaprio-2000x2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fagdal-dicaprio-2000x2000.jpg", "keywords": [], "authors": ["Liz Mcneil", "Michael Miller"], "canonical_link": "https://people.com/movies/leonardo-dicaprio-nina-agdal-breakup/", "title": "Leonardo DiCaprio and Nina Agdal Breakup", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive", "news_keywords": "Exclusive", "description": "\"Nina and leo have parted ways. It is amicable. They remain friends,\" a source close to the couple tells PEOPLE", "og": {"title": "Leonardo DiCaprio and Nina Agdal Breakup", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/leonardo-dicaprio-nina-agdal-breakup/", "description": "Leonardo DiCaprio is single once again. The actor and his girlfriend, model Nina Agdal, have called it quits. “They broke up a couple of days&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fagdal-dicaprio-2000x2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/leonardo-dicaprio-nina-agdal-breakup/", "description": "\"Nina and leo have parted ways. It is amicable. They remain friends,\" a source close to the couple tells PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fagdal-dicaprio-2000x2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/leonardo-dicaprio-nina-agdal-breakup/", "title": "Leonardo DiCaprio and Nina Agdal Breakup", "description": "\"Nina and leo have parted ways. It is amicable. They remain friends,\" a source close to the couple tells PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fagdal-dicaprio-2000x2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}