{"url": "https://people.com/tv/bachelorette-men-tell-all-lee-garrett-racist-tweets-demario-jackson-snaps/", "text": "After weeks of watching Rachel Lindsay break hearts left and right, Bachelor Nation finally got to witness all of her ex-boyfriends gather for one giant, televised reunion on Monday’s The Bachelorette: Men Tell All.\n\nThe episode touched on everything from DeMario Jackson‘s secret girlfriend to Lee Garrett‘s incredibly offensive tweets — and it was a lot to unpack in two hours. Here’s a breakdown of the 10 most important moments.\n\nGet push notifications with news, features and more.\n\nImage zoom Paul Hebert/ABC\n\n1. The questionable attire choices. All of them.\n\nDid no one tell DeMario that you’re supposed to wear a suit to these things? Or at the very least, tuck your shirt in?\n\n2. Surprise! Whaboom is still the worst.\n\nThankfully ABC only allowed him enough screen time to utter a single “whaboom.” And that was still one too many.\n\n3. DeMario didn’t do himself any favors.\n\nDeMario, DeMario, DeMario. DeMario had the opportunity to acknowledge, apologize and move on from the whole Lexi situation — or at the very least, calmly explain his side of the story — but alas, he did not. (ICYMI, DeMario is the guy who signed up for the show while still having a girlfriend back home. After he ghosted on her, she found out that he was filming and confronted him about in on camera in episode 2. Rachel promptly sent him packing.)\n\nImage zoom Paul Hebert/ABC\n\nDeMario’s rant made little sense, but bizarrely, seemed to incorporate as many pop culture references as possible. A sampling, below:\n\n“This random a— chick calls in to say that she was my girlfriend. By you guys’ logic, I’m Beyoncé‘s boyfriend. I’m dating Rihanna!”\n\n“Look, what did the Weeknd say? I’ll only call you when it’s half past five? That’s called a side chick. You can boo me, I’m keeping it real.”\n\n“She said we dated for six months, but facts are facts. Show me a picture of her and I. Are there any ocular facts that her and I dated?”\n\n“Bill Clinton had sex with Monica!”\n\nvia GIPHY\n\n4. Everyone was #TeamKenny, all the way.\n\nThe drama between Kenny and Lee this season spanned several episodes before it came to a head on an incredibly uncomfortable two-on-one date. Ultimately, neither man ended up with Rachel — but Kenny did win the loyalty of his fellow contestants.\n\n“I think it’s pretty evident if you look at it objectively that Kenny might have been the most well-liked guy in the house, and it’s hard to say the same about Lee,” said Dean. “When you have 30 people on your side against one person, it’s clear who’s in the right and who’s wrong. I will forever have Kenny’s back in that situation.”\n\nvia GIPHY\n\nWhile the underlying racial tensions between the two men were obvious to viewers throughout the season, Kenny insisted that in the moment, his beef with Lee didn’t actually feel like it was stemming from racism.\n\n“Racism feels a certain way — it’s insidious, there’s vitriol to it,” he explained. “As I was trying to make sense of it, it really just felt to me that this dude was out of his league. To me, it was very reactionary. That’s what it felt like.”\n\nBut overall, the night ended on a high note for Kenny: Host Chris Harrison surprised him by bringing out his daughter Mackenzie — and gifted the two with tickets to Disneyland.\n\nImage zoom Paul Hebert/ABC\n\n5. Lee got put on blast.\n\nFinally, it was time for Lee to face the hot seat. Visibly anxious, he started off by carefully avoiding using the word “racist” or “racism,” instead chalking up his actions on the show to his discomfort.\n\n“I’m facetious,” he said. “I make jokes when I’m uncomfortable in inappropriate times. It doesn’t always come off right, and I definitely learned that about myself.”\n\nAfter several of the men repeatedly called him out for refusing to acknowledge what was really at play here, Harrison eventually brought up the crux of the matter: several misogynistic, sexist and racist tweets written by Lee within the last year-and-a-half that were discovered a little over a week after the season premiere.\n\n“Women were meant to hang around for a few seconds these days, dogs are meant to stick around. Get a dog, boys. Get a dog,” reads one.\n\n“Guys… When is the last time you actually saw a pretty feminist? There is a reason for this,” reads another.\n\nAnd last but not least: “What’s the difference between the NAACP and the KKK? One has a sense of shame to cover their racist a— faces.”\n\n6. Lee got a history lesson.\n\n“I want you to articulate to all of us why you came on a show where the Bachelorette was an African-American woman, if on the other hand you’re tweeting about black people and groups of black people who fought and died so I can be on this stage next to you?” demanded Josiah. “People came before me so I could go to the same school as you, so I could drink from the same fountain as you, and you’re comparing them to the KKK — people who hung my ancestors.”\n\nImage zoom Paul Hebert/ABC\n\nLee responded by denouncing the tweets, insisting that he doesn’t like racism “at all.” But Anthony fired back by pointing out that Lee was still refusing to own up to what they were all trying to forgive him for.\n\n“The racism that is ingrained in your behavior to the point of invisibility is still pushing you to behave in a certain way towards Kenny, towards Eric, towards me, in a way that you don’t even recognize,” he said. “Are your actions motivated by racist thoughts that are implicitly embedded in your mentality?”\n\nFROM PEN: Rachel Lindsay on Making History as First African American (& ‘Oldest’) Bachelorette — ‘All Eyes Are on Me’\n\n7. And finally, finally, Lee acknowledged his undeniable racism.\n\nIt certainly took him a while, but Lee’s segment concluded with him finally recognizing that yes, his tweets were offensive — on many levels: “I’m sorry for saying things when I was not educated and ignorant in those subjects,” he said.\n\nThe rest of the men thanked him for his honesty, and Kenny even stood up to hug it out.\n\n8. Dean was as adorable as ever.\n\nDean is so darn cute that we’ll forgive him for that camo suit. His sit-down with Rachel was short but sweet: While he did call her out for sending him home just days after telling him she was falling in love with him, he did it in the gentlest, Dean-iest way possible — and it’s pretty clear there’s no bad blood between these two.\n\nImage zoom Paul Hebert/ABC\n\n9. Rachel handled herself like an absolute queen.\n\nIt certainly can’t be easy facing 20-some exes all at once, but Rachel breezed right through it like the queen that she is.\n\nImage zoom Paul Hebert/ABC\n\nRachel on reuniting with the men: “I missed you guys! Not all of you.”\n\nRachel on being the first black Bachelorette: “I knew it would be something to talk about, but it wasn’t something that we had to continually go on and on about. Race wasn’t an issue for me as I was going through this season.”\n\nRachel on Kenny and Lee: “I’m not in the house, so I only know what’s happening right in front of me. To sit back and see things that I’ve never seen before — it’s very enlightening. Kenny, I was disappointed in the way that you handled the Lee situation. Because Lee was Lee, I wish that you could have just realized that that was background noise and focused on the two of us.”\n\nRachel on DeMario: “Who?”\n\n10. And she didn’t waste a second telling Lee exactly how disappointing he was.\n\n“You had such an amazing opportunity to be surrounded by different people and different cultures, and you didn’t take advantage of that,” she told him. “I hope that in watching it back you realize that you were a part of something so great. But in case you didn’t, please know that you can exit stage left and meet me backstage. I’d be more than happy to give you a black history lesson and a lesson on women’s rights.”\n\nWe are not worthy.\n\nThe Bachelorette season finale airs Monday at 8 p.m. ET on ABC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-6.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-2.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/bachelorette-men-tell-all-lee-garrett-racist-tweets-demario-jackson-snaps/", "title": "Bachelorette: Lee Garrett Addresses Racist Tweets in Tense Men Tell All Special", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Chris Harrison,DeMario Jackson,News,Rachel Lindsay,Recap,The Bachelorette,TV,TV Watch", "news_keywords": "Chris Harrison,DeMario Jackson,News,Rachel Lindsay,Recap,The Bachelorette,TV,TV Watch", "description": "Here's a breakdown of the 10 most important moments from Monday's Bachelorette: Men Tell All special", "og": {"title": "Bachelorette: Lee Garrett Addresses Racist Tweets in Tense Men Tell All Special", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelorette-men-tell-all-lee-garrett-racist-tweets-demario-jackson-snaps/", "description": "After weeks of watching Rachel Lindsay break hearts left and right, Bachelor Nation&nbsp;finally got to witness all of her ex-boyfriends gather for one giant, televised&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/bachelorette-men-tell-all-lee-garrett-racist-tweets-demario-jackson-snaps/", "description": "Here's a breakdown of the 10 most important moments from Monday's Bachelorette: Men Tell All special", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelorette-men-tell-all-lee-garrett-racist-tweets-demario-jackson-snaps/", "title": "Bachelorette: Lee Garrett Addresses Racist Tweets in Tense Men Tell All Special", "description": "Here's a breakdown of the 10 most important moments from Monday's Bachelorette: Men Tell All special", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fthe-bachelorette-5.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}