{"url": "https://en.wikipedia.org/wiki/Queer_Eye_(2018_TV_series)", "text": "For the original 2003 television series on Bravo, see Queer Eye\n\nNetflix original series\n\nQueer Eye is an American Netflix original series, initially released on February 7, 2018. It is a reboot of the Bravo series of the same name, featuring a new Fab Five: Antoni Porowski, food and wine expert; Tan France, fashion expert; Karamo Brown, culture expert; Bobby Berk, design expert; and Jonathan Van Ness, grooming expert. In July 2018, the series was renewed for a third season, which was released on March 15, 2019. In June 2019, Netflix renewed the series for a fourth and fifth season. The fourth season was released on July 19, 2019. In March 2020, the series was renewed for a sixth season.\n\nMain cast [ edit ]\n\nMakeover (\"make better\") experts known collectively as the Fab Five:\n\nProduction [ edit ]\n\nCreator credit is given to David Collins. In contrast to the original series which was filmed in the New York area, seasons one and two of the reboot were filmed in Atlanta and neighboring Georgia towns. After Netflix announced that the series had been renewed for a third season,[1] local media outlets reported that the show was casting in Kansas City, Missouri.[2] Filming began in Kansas City on June 16, 2018, with the third season having premiered on March 15, 2019.[1][3]\n\nDavid Collins has said that he is interested in filming a season of Queer Eye in the Midwest, and that he would like to bring the Fab Five to his hometown, Cincinnati, Ohio: \"I'm from Cincinnati, Ohio, born and raised. I would like to go the tristate region, Ohio, Indiana, and Kentucky, because you can base in Cincinnati and go across the bridge to Kentucky and go up the interstate to Indiana. The corn-fed midwestern folk are where I'm from—and I love actually being from Ohio, it's a great place to be from.\"[4] The Fab Five later voiced fictionalized versions of themselves in adult animated series, Big Mouth.[5]\n\nRelease [ edit ]\n\nAll eight episodes of the first series were released on Netflix on February 7, 2018. Netflix's provided maturity rating is TV-14.\n\nThe series was renewed for a second season that aired on June 15, 2018.[6] Speaking to Variety, interior design expert Bobby Berk stated that season 2 was filmed at the tail end of season one.[7] The season features a new theme song by Betty Who.[8] The season includes an episode focused on a man named Skyler[9] who is transgender.[10] Other makeover heroes include a Walmart employee, a young musician, a mayor, a woman, and a man trying to graduate college.[8][9]\n\nOn June 6, 2018 it was reported that an episode was being filmed in the town of Yass, New South Wales in Australia. Yass was chosen due to the fact that \"its name matches one of the boys' favourite sayings: yaass\".[11] On June 21, 2018, the 20-minute Yass episode was released online.[12]\n\nOn June 18, 2019, the series was renewed for a fourth and fifth season.[13] The fourth season was released on July 19, 2019.[14] A four–episode special season called Queer Eye: We're in Japan! was released on November 1, 2019. This special season also features Kiko Mizuhara as the Fab Five's Tokyo tour guide and Naomi Watanabe makes a special appearance.[15] On March 11, 2020, Netflix renewed the series for a sixth season.[16]\n\nEpisodes [ edit ]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally released 1 8 February 7, 2018 ( ) 2 8 June 15, 2018 ( ) Special June 21, 2018 ( ) 3 8 March 15, 2019 ( ) 4 8 July 19, 2019 ( ) We're in Japan! 4 November 1, 2019 ( )\n\nSeason 1 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Hero Filming location Original release date 1 1 \"You Can't Fix Ugly\" Tom Dallas, Georgia February 7, 2018 ( ) Tom is a divorced 57-year-old nominated by his daughter. The team helps him prepare for a date at a car show at the end of the week. Tom has lupus, and needs special help with skin care and color choices. Bobby creates an outdoor entertainment area in the back yard. The date is successful and Tom is ready to carry forward with the changes he's implemented during the visit. 2 2 \"Saving Sasquatch\" Neal Atlanta, Georgia February 7, 2018 ( ) Neal is a 36-year-old programmer who is hosting an app release party at the end of the week. A loner, he has erected physical and emotional barriers that prevent people from getting too close. The house is covered in dog hair and gets a serious cleaning along with new furniture. Jonathan modernizes Neal's hair and beard, and Tan brings his wardrobe up to date to better suit his career. By the end of the week Neal feels more confident, is ready to socialize more, and is prepared to continue with the improvements he has learned. 3 3 \"Dega Don't\" Cory Winder, Georgia February 7, 2018 ( ) The nominee is Cory, a 36-year-old former Marine and NASCAR fan. At the start of the episode, the Fab Five are pulled over by the police. Karamo, who is driving, is particularly alarmed because of the recent violent incidents and shootings across the United States involving black people and the police. Later Karamo and Cory have a discussion about this topic and the need to build trust between good cops and civilians. Cory says at the end of the episode that that conversation was the highlight of the week for him. Bobby modifies the spaces on the main floor of Cory's house so Cory will feel more comfortable in his own home. Antoni provides nutritional advice and teaches Cory how to make an avocado-grapefruit appetizer. The family goes together to the musical Finding Neverland at the conclusion of the show. 4 4 \"To Gay or Not Too Gay\" AJ Atlanta, Georgia February 7, 2018 ( ) AJ is a 32-year-old gay civil engineer who plans to come out to his stepmother at the end of the week. He regrets having never come out to his father before he died. Karamo helps him work through his emotions regarding this topic. Antoni and AJ visit his stepmother to learn how to make tamales and to invite her to the party AJ plans on hosting. Bobby cleans and reorganizes AJ's apartment to convert it from a mancave to a functional living space. Jonathan teaches him how to edge his beard and hair. Tan helps him choose clothes with various looks, from conservative to casual to sexual. At the party at the end of the week, AJ reads his stepmother a letter he's written to his father where he explains that he's gay, and how he regrets never coming out to him. His stepmother says she will always be there for him and accepts him the way he is. 5 5 \"Camp Rules\" Bobby Marietta, Georgia February 7, 2018 ( ) Bobby is a 48-year-old father of 6 children. He holds down two jobs to support his family and has a very chaotic home life. He and his wife had a disaster wedding with no photos and no first dance. His wife nominated him for a makeover to thank him for all he does for the family. The house is extremely cluttered. Antoni struggles to organize the kitchen while Jonathan and Tan convince Bobby to make self-care more of a priority. Fab 5 Bobby talks about how the house needs to be better organized and the children need to help with chores. He starts a vegetable garden with the intention that the children will help look after it, and also creates a job board. At a potluck at the end of the week, Bobby and his wife finally get a replacement for the wedding reception that went awry the first time around. 6 6 \"The Renaissance of Remington\" Remington Atlanta, Georgia February 7, 2018 ( ) Remy is a 27 year old who lives in his grandmothers' house, which hasn't been renovated since the 70s. He often wears gym clothes and has limited cooking skills. Remy wants to learn to be more cultured, and learn how to cook for his family. 7 7 \"Below Average Joe\" Joe Norcross, Georgia February 7, 2018 ( ) Joe is a 33 year old comedian who still lives at home, and was nominated by his parents. He has recently lost a substantial amount of weight, but lacks confidence. The Fab 5 help Joe learn how to dress for his new body and present himself confidently, and move in to his parent's basement so he has a more adult space. 8 8 \"Hose Before Bros\" Jeremy Covington, Georgia February 7, 2018 ( ) Jeremy, a fireman, loves to help people and trains other firefighters. He's a prankster, but takes his job very seriously. He's married to Bonnie, and has five adopted children who are all biological siblings. The Fab 5 make over the firehouse and prepare for a fundraiser there at the end of the week.\n\nSeason 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Hero Filming location Original release date 9 1 \"God Bless Gay\" Tammye Gay, Georgia June 15, 2018 ( ) Tammye is the first woman the Fab 5 have made over. She is a married teacher who is heavily involved in the church and her community. She was also diagnosed with cancer, along with two other family members, and the Fab 5 help Tammye prepare for the community's Homecoming event at the end of the week. 10 2 \"A Decent Proposal\" William Dahlonega, Georgia June 15, 2018 ( ) 41 year old William works at Walmart and lives with his girlfriend of three years, Shannan. He is socially anxious, and lives in a house surrounded by furniture Shannan bought with her ex-husband. He is a vegetarian, loves sci-fi films, and is terrified of heartbreak. He wants the Fab 5's help to propose to Shannan. 11 3 \"Unleash the Sexy Beast\" Leo Decatur, Georgia June 15, 2018 ( ) Leo, a bartender and married father of two, was nominated by his wife Bethany because he is a 'ginormous slob'. He's attending a parent-teacher mixer at the end of the week, and wants the Fab 5's help to make a good impression and form some relationships with other parents. 12 4 \"The Handyman Can\" Jason Atlanta, Georgia June 15, 2018 ( ) Jason, a single handyman, wants to improve his life and move to Reno. The Fab 5 swoop in to take help him throw a party for his close circle of friends. 13 5 \"Sky's the Limit\" Skyler Athens, Georgia June 15, 2018 ( ) Skyler, a trans man, has just recovered from his top surgery and needs to have his legal identity reflect his true gender. The Fab 5 help him redesign his apartment and throw a celebration at his favorite bar. 14 6 \"Big Little Lies\" Arian Duluth, Georgia June 15, 2018 ( ) After running into problems with his university degree, Ari has slipped into a funk. His best friend from middle school nominates him so that the Fab 5 help him get off the couch and come clean to his family about his degree. 15 7 \"Bedazzled\" Sean Maysville, Georgia June 15, 2018 ( ) Teenage pianist Sean gets nominated by his godmother Lulu. The Fab 5 descend on his small town to give him a modern makeover and help him move out for college. 16 8 \"Make Ted Great Again\" Ted Clarkston, Georgia June 15, 2018 ( ) The unconventional mayor of \"the Ellis Island of the South\" is nominated by his girlfriend. The Fab 5 help him reorder his life so he can better perform his mayoral duties and socialize with international dignitaries.\n\nSpecial (2018) [ edit ]\n\nNo.\n\noverall Title Hero Filming location Original release date 17 \"Yass, Australia!\" George Yass, New South Wales June 21, 2018 ( ) The Fab Five visit the town of Yass, New South Wales, to make over George, a farmer in his 50s. Karamo offers advice on creating a better work-life balance so George will have more time for friends and family. Jonathan and Tan work on improving his self care and wardrobe. Bobby remodels the local bistro and Antoni creates some new menu items using local ingredients.\n\nSeason 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Hero Filming location Original release date 18 1 \"From Hunter to Huntee\" Jody Amazonia, Missouri March 15, 2019 ( ) Jody is a 49 year old farmer and prison guard nominated by her husband Chris. They both love to hunt and they both love to wear camo clothing. Chris wants to take her out for their 10th anniversary but he knows she feels uncomfortable in more formal settings. Antoni takes her to a high-end restaurant for lunch to help her acclimatise to that kind of environment. Jonathan cuts and styles her hair, as well as evens out the color. Tan helps her revamp her wardrobe and she learns how to walk in heels. At the end of the week the Fab 5 arrange a surprise visit from her family. Chris takes her on a romantic gondola ride to celebrate their anniversary. 19 2 \"Lost Boy\" Joey La Cygne, Kansas March 15, 2019 ( ) Joey is a divorced man who has recently taken a job as program director at a childrens' camp. He was nominated by his boss, who hopes Joey will learn some grooming and presentation techniques that will suit his new role better than what he is currently doing, which is nothing – not even basics like showering or brushing his teeth. Bobby gets furniture for and remodels Joey's new cabin, and Antoni teaches him a great pork barbecue dish to make at the cookout they are having at the end of the week. Karamo helps Joey reconnect with his son Isaac through an art project. 20 3 \"Jones Bar-B-Q\" Deborah/\"Little\"\n\nMary/\"Shorty\" Kansas City, Kansas March 15, 2019 ( ) The Fab 5 help the owners of Jones Barb-B-Q, Deborah (Little) and Mary (Shorty), to improve both their self confidence and their business after Izora, Deborah's daughter, nominated them. Antoni and Karamo help the sisters to get their special BBQ sauce ready for manufacturing and sale. The pair also get help with their outfits, and Deborah goes to the dentist to get her gold tooth removed which vastly helps to improve her self confidence. At the end of the week, the sisters' BBQ shop has been completely redesigned to make it more accessible for them and ready for business. 21 4 \"When Robert Met Jamie\" Robert Kansas City, Missouri March 15, 2019 ( ) Robert is an overweight man with self esteem and body image issues. He and Jamie are getting married at the end of the week and he wants to look and feel great at the wedding. The basement is a man cave disaster, and Tan is ready to discard almost all of Robert's wardrobe. Bobby and Antoni take Robert to Orange Fitness to show him that taking care of himself can help build self esteem. Karamo helps him understand how many good qualities he has, and that the only person saying bad things about him is himself. Robert is already a great cook, but Antoni demonstrates how to make healthier choices that are still delicious. Bobby remodels the master bedroom to reclaim it for the adults – one of their daughters has been using it as her room – as well as redecorating the rest of the house. At the end of the week Robert promises to stop the self-deprecating and be kinder to himself. 22 5 \"Black Girl Magic\" Jess Lawrence, Kansas March 15, 2019 ( ) Jess is a 23-year-old lesbian whose adoptive parents kicked her out of the house when she was 16 when they found out her sexual orientation. She has friends who come and go, and the house doesn't have a sense of home or of permanence. Bobby and Antoni emphasise that it's okay to make connections with people or to ask for help. Bobby sets up a reunion with Jess's biological sister, Jenise. Jonathan cuts Jess's hair to remove the treated portion, and she plans on wearing her natural curls from now on. At the end of the week she comments how supportive and accepting the Fab Five were to her, and how much she admires Karamo and looks up to him as a role model as a successful gay black person. 23 6 \"Elrod & Sons\" Rob Olathe, Kansas March 15, 2019 ( ) Rob is a single father who has put his life on hold since his wife died two years ago. He is moving into a new house and has a housewarming party planned for the end of the week. Antoni works with him on a couple of healthier meals that he could make for his children and Tan shows him how to select clothing for his children as well as himself. Bobby helps him with the last of the packing as Rob says a tearful farewell to the old house and the memories it holds. 24 7 \"Sloth to Slay\" Thomas Kansas City, Missouri March 15, 2019 ( ) Thomas is an asocial twenty one year old, living with his sister in Missouri, who spends most of his time behind a screen meaning that the majority of his friends are made through video gaming. The Fab 5 surprise him on his birthday whilst he is getting the bus to work and proceed to transform both him and his life, agreeing to transform him from a sloth (a nickname he earned in high school) to someone who 'slays'. Thomas is encouraged to knock down both literal and metaphorical walls and the Fab 5 get him to connect with a local anime group. At the end of their time together Thomas has a birthday party to let everyone see his new look and style, especially his sister Krissy. 25 8 \"Baby on Board\" Tony Lee's Summit, Missouri March 15, 2019 ( ) Tony is nominated by his girlfriend Bri. They are expecting a baby really soon and he needs help preparing himself mentally as well as cleaning up the physical space where they live. The Fab 5 discover the entire house is a mess, and they have a lot of work to do teaching Tony some organizational skills and how to overcome his procrastination. Karamo finds a teacher that shows Tony some basic baby care skills. Bobby cleans the house and redecorates to give the family a clean slate. At the end of the week Tony feels he has developed the confidence he needs to begin this next phase of his life, and knows that it is okay to ask for help. The episode ends with a surprise marriage proposal.\n\nSeason 4 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Hero Filming location Original release date 26 1 \"Without Further Ado\" Kathi Quincy, Illinois July 19, 2019 ( ) Kathi, the music director at Quincy Senior High School, is Jonathan's former music teacher. She has not changed her mullet hairstyle since the 1980s. Kathi is nominated by her assistant, Sarah, who wants Kathi to put herself first instead of last. The Fab 5 give Kathi a makeover in time for her appearance as grand marshal at the Octoberfest Parade. They also help her raise money at the annual music department fundraiser. Bobby redecorates the teachers' lounge and renames it as the \"Dooley Den\" after Kathi so that teachers would actually use the lounge. Antoni teaches Kathi's students to make Blue Deviled Potatoes which consist queso and blue potatoes as part of the fundraiser. Tan takes her shopping to upgrade her wardrobe for a more sophisticated and age-appropriate look. Jonathan chops off her mullet to give a more modern and flattering hairstyle. Karamo helps Kathi realize that she needs to do more activities outside of school. He contacts Kathi's former student, Ryan, who worked on the Broadway musical Waitress, who gives her and her husband first class plane tickets as well as free tickets to go see the musical. 27 2 \"Disabled but Not Really\" Wesley Kansas City, Missouri July 19, 2019 ( ) Wesley is a 30-year-old community activist who is also the founder of a nonprofit organization called \"Disabled But Not Really\" and a single father to a 10-year-old girl named Nevaeh which is Heaven spelled backward. His mother, Dawn, nominated him because she wants him to have more independence. Wesley became paralyzed after being shot several times when he was 24. He reveals he was a bad boy before the accident. The Fab 5 help him feel good about himself to get ready for a \"Disabled But Not Really\" fundraiser. Bobby renovates his house to make it wheelchair accessible. Tan helps him dress more professionally, but also comfortably. Karamo sets up a meeting for Wesley and Maurice, the man who shot him, so that Wesley can have a closure and move to the next chapter in his life. 28 3 \"Stoner Skates By\" John Kansas City, Missouri July 19, 2019 ( ) John is a 38-year-old single divorced father and a healthcare consultant who often works from home. He co-parents with his ex-wife Julie, who is still on good terms with him. John is nominated by his 10-year-old daughter Lucy because she wants him to act more like a parent than a child. The Fab 5's mission is to help John become the proud father for Lucy at her figure skating competition. Bobby revamps John's home to make it more grow-up and less of a frat boy's home as well as creating Lucy's own space so that she feels more at home. Antoni teaches John how to prepare almond flour pancakes for Lucy. Tan takes John to Houndstooth, a men's clothing store, to upgrade his wardrobe and give him a more mature look. Jonathan invites Olympic medalist Michelle Kwan to help Lucy perfect her landing. John opens up to Karamo about how he suffers from depression and that he doesn't really talk anyone about it. John is highly motivated at the end of the week to follow through with the further work that needs to be done to make his and Lucy's life better going forward. 29 4 \"How Wanda Got Her Groove Back\" Wanda Kansas City, Missouri July 19, 2019 ( ) 30 5 \"On Golden Kenny\" Kenny Kansas City, Kansas July 19, 2019 ( ) Kenny is a retired bachelor whose dusty home seemed stuck in the past. Nominated by his sister Kathy and her two daughters, Kenny came to embrace all of the changes to his home and appearance, showing tremendous gratitude for the work of the Fab Five. Near the end of the transformation, he announced that he had decided to name his newly adopted ASPCA rescue dog “Fab Five.” 31 6 \"A Tale of Two Cultures\" Deanna Kansas City, Missouri July 19, 2019 ( ) 32 7 \"Soldier Returns Home\" Brandonn Kansas City, Missouri July 19, 2019 ( ) 33 8 \"Farm to Able\" Matt Harrisonville, Missouri July 19, 2019 ( )\n\nWe're in Japan! (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Hero Filming location Original release date 34 1 \"Japanese Holiday\" Yoko Mitaka City, Tokyo November 1, 2019 ( ) 35 2 \"Crazy in Love\" Kan Ni-chome, Shinjuku, Tokyo November 1, 2019 ( ) 36 3 \"The Ideal Woman\" Kae Naka-ku, Yokohama November 1, 2019 ( ) 37 4 \"Bringing Sexy Back\" Makoto Tabata, Tokyo November 1, 2019 ( )\n\nReception [ edit ]\n\nOn review aggregator website Rotten Tomatoes, the first season holds an approval rating of 97% based on 32 reviews, and an average rating of 8.23/10. The website's critical consensus reads, \"Queer Eye adapts for a different era without losing its style, charm, or sense of fun, proving that the show's formula remains just as sweetly addictive even after a change in location and a new group of hosts.\"[17] On Metacritic, the season has a weighted average score of 73 out of 100, based on 9 critics, indicating \"generally favorable reviews\".[18]\n\nThe second season has an 85% approval rating on Rotten Tomatoes, based on 27 reviews, with an average rating of 8.36/10. The site's critical consensus reads, \"Earnest and endearing, Queer Eye's tear-inducing reality wiles continue to challenge social norms — and, in its best moments, the Fab Five themselves.\"[19] On Metacritic, it has a score of 79 out of 100, based on 8 critics, indicating \"generally favorable reviews\".[20]\n\nThe third season has an approval rating of 91% based on 11 reviews, with an average rating of 8/10 on Rotten Tomatoes. The website's critical consensus reads, \"Affirming and uplifting as ever, Queer Eye's third season settles into a nearly formulaic groove — thankfully the concoction continues to work like gangbusters thanks to the Fab Five's comforting Midas touch.\"[21]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/8/80/Queereyelogo2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Queereyelogo2.jpg/250px-Queereyelogo2.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/80/Queereyelogo2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Queer_Eye_(2018_TV_series)", "title": "Queer Eye (2018 TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/80/Queereyelogo2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}