{"url": "https://web.archive.org/web/20080618171108/http://www.barackobama.com:80/2008/06/15/remarks_of_senator_barack_obam_78.php", "text": "Remarks of Senator Barack Obama: Apostolic Church of God\n\nChicago, IL | June 15, 2008\n\nGood morning. It's good to be home on this Father's Day with my girls, and it's an honor to spend some time with all of you today in the house of our Lord.\n\nAt the end of the Sermon on the Mount, Jesus closes by saying, “Whoever hears these words of mine, and does them, shall be likened to a wise man who built his house upon a rock: and the rain descended, and the floods came, and the winds blew, and beat upon that house, and it fell not, for it was founded upon a rock.” [Matthew 7: 24-25]\n\nHere at Apostolic, you are blessed to worship in a house that has been founded on the rock of Jesus Christ, our Lord and Savior. But it is also built on another rock, another foundation – and that rock is Bishop Arthur Brazier. In forty-eight years, he has built this congregation from just a few hundred to more than 20,000 strong – a congregation that, because of his leadership, has braved the fierce winds and heavy rains of violence and poverty; joblessness and hopelessness. Because of his work and his ministry, there are more graduates and fewer gang members in the neighborhoods surrounding this church. There are more homes and fewer homeless. There is more community and less chaos because Bishop Brazier continued the march for justice that he began by Dr. King's side all those years ago. He is the reason this house has stood tall for half a century. And on this Father's Day, it must make him proud to know that the man now charged with keeping its foundation strong is his son and your new pastor, Reverend Byron Brazier.\n\nOf all the rocks upon which we build our lives, we are reminded today that family is the most important. And we are called to recognize and honor how critical every father is to that foundation. They are teachers and coaches. They are mentors and role models. They are examples of success and the men who constantly push us toward it.\n\nBut if we are honest with ourselves, we'll admit that what too many fathers also are is missing – missing from too many lives and too many homes. They have abandoned their responsibilities, acting like boys instead of men. And the foundations of our families are weaker because of it.\n\nYou and I know how true this is in the African-American community. We know that more than half of all black children live in single-parent households, a number that has doubled – doubled – since we were children. We know the statistics – that children who grow up without a father are five times more likely to live in poverty and commit crime; nine times more likely to drop out of schools and twenty times more likely to end up in prison. They are more likely to have behavioral problems, or run away from home, or become teenage parents themselves. And the foundations of our community are weaker because of it.\n\nHow many times in the last year has this city lost a child at the hands of another child? How many times have our hearts stopped in the middle of the night with the sound of a gunshot or a siren? How many teenagers have we seen hanging around on street corners when they should be sitting in a classroom? How many are sitting in prison when they should be working, or at least looking for a job? How many in this generation are we willing to lose to poverty or violence or addiction? How many?\n\nYes, we need more cops on the street. Yes, we need fewer guns in the hands of people who shouldn't have them. Yes, we need more money for our schools, and more outstanding teachers in the classroom, and more afterschool programs for our children. Yes, we need more jobs and more job training and more opportunity in our communities.\n\nBut we also need families to raise our children. We need fathers to realize that responsibility does not end at conception. We need them to realize that what makes you a man is not the ability to have a child – it's the courage to raise one.\n\nWe need to help all the mothers out there who are raising these kids by themselves; the mothers who drop them off at school, go to work, pick up them up in the afternoon, work another shift, get dinner, make lunches, pay the bills, fix the house, and all the other things it takes both parents to do. So many of these women are doing a heroic job, but they need support. They need another parent. Their children need another parent. That's what keeps their foundation strong. It's what keeps the foundation of our country strong.\n\nI know what it means to have an absent father, although my circumstances weren't as tough as they are for many young people today. Even though my father left us when I was two years old, and I only knew him from the letters he wrote and the stories that my family told, I was luckier than most. I grew up in Hawaii, and had two wonderful grandparents from Kansas who poured everything they had into helping my mother raise my sister and me – who worked with her to teach us about love and respect and the obligations we have to one another. I screwed up more often than I should've, but I got plenty of second chances. And even though we didn't have a lot of money, scholarships gave me the opportunity to go to some of the best schools in the country. A lot of kids don't get these chances today. There is no margin for error in their lives. So my own story is different in that way.\n\nStill, I know the toll that being a single parent took on my mother – how she struggled at times to the pay bills; to give us the things that other kids had; to play all the roles that both parents are supposed to play. And I know the toll it took on me. So I resolved many years ago that it was my obligation to break the cycle – that if I could be anything in life, I would be a good father to my girls; that if I could give them anything, I would give them that rock – that foundation – on which to build their lives. And that would be the greatest gift I could offer.\n\nI say this knowing that I have been an imperfect father – knowing that I have made mistakes and will continue to make more; wishing that I could be home for my girls and my wife more than I am right now. I say this knowing all of these things because even as we are imperfect, even as we face difficult circumstances, there are still certain lessons we must strive to live and learn as fathers – whether we are black or white; rich or poor; from the South Side or the wealthiest suburb.\n\nThe first is setting an example of excellence for our children – because if we want to set high expectations for them, we've got to set high expectations for ourselves. It's great if you have a job; it's even better if you have a college degree. It's a wonderful thing if you are married and living in a home with your children, but don't just sit in the house and watch “SportsCenter” all weekend long. That's why so many children are growing up in front of the television. As fathers and parents, we've got to spend more time with them, and help them with their homework, and replace the video game or the remote control with a book once in awhile. That's how we build that foundation.\n\nWe know that education is everything to our children's future. We know that they will no longer just compete for good jobs with children from Indiana, but children from India and China and all over the world. We know the work and the studying and the level of education that requires.\n\nYou know, sometimes I'll go to an eighth-grade graduation and there's all that pomp and circumstance and gowns and flowers. And I think to myself, it's just eighth grade. To really compete, they need to graduate high school, and then they need to graduate college, and they probably need a graduate degree too. An eighth-grade education doesn't cut it today. Let's give them a handshake and tell them to get their butts back in the library!\n\nIt's up to us – as fathers and parents – to instill this ethic of excellence in our children. It's up to us to say to our daughters, don't ever let images on TV tell you what you are worth, because I expect you to dream without limit and reach for those goals. It's up to us to tell our sons, those songs on the radio may glorify violence, but in my house we live glory to achievement, self respect, and hard work. It's up to us to set these high expectations. And that means meeting those expectations ourselves. That means setting examples of excellence in our own lives.\n\nThe second thing we need to do as fathers is pass along the value of empathy to our children. Not sympathy, but empathy – the ability to stand in somebody else's shoes; to look at the world through their eyes. Sometimes it's so easy to get caught up in “us,” that we forget about our obligations to one another. There's a culture in our society that says remembering these obligations is somehow soft – that we can't show weakness, and so therefore we can't show kindness.\n\nBut our young boys and girls see that. They see when you are ignoring or mistreating your wife. They see when you are inconsiderate at home; or when you are distant; or when you are thinking only of yourself. And so it's no surprise when we see that behavior in our schools or on our streets. That's why we pass on the values of empathy and kindness to our children by living them. We need to show our kids that you're not strong by putting other people down – you're strong by lifting them up. That's our responsibility as fathers.\n\nAnd by the way – it's a responsibility that also extends to Washington. Because if fathers are doing their part; if they're taking our responsibilities seriously to be there for their children, and set high expectations for them, and instill in them a sense of excellence and empathy, then our government should meet them halfway.\n\nWe should be making it easier for fathers who make responsible choices and harder for those who avoid them. We should get rid of the financial penalties we impose on married couples right now, and start making sure that every dime of child support goes directly to helping children instead of some bureaucrat. We should reward fathers who pay that child support with job training and job opportunities and a larger Earned Income Tax Credit that can help them pay the bills. We should expand programs where registered nurses visit expectant and new mothers and help them learn how to care for themselves before the baby is born and what to do after – programs that have helped increase father involvement, women's employment, and children's readiness for school. We should help these new families care for their children by expanding maternity and paternity leave, and we should guarantee every worker more paid sick leave so they can stay home to take care of their child without losing their income.\n\nWe should take all of these steps to build a strong foundation for our children. But we should also know that even if we do; even if we meet our obligations as fathers and parents; even if Washington does its part too, we will still face difficult challenges in our lives. There will still be days of struggle and heartache. The rains will still come and the winds will still blow.\n\nAnd that is why the final lesson we must learn as fathers is also the greatest gift we can pass on to our children – and that is the gift of hope.\n\nI'm not talking about an idle hope that's little more than blind optimism or willful ignorance of the problems we face. I'm talking about hope as that spirit inside us that insists, despite all evidence to the contrary, that something better is waiting for us if we're willing to work for it and fight for it. If we are willing to believe.\n\nI was answering questions at a town hall meeting in Wisconsin the other day and a young man raised his hand, and I figured he'd ask about college tuition or energy or maybe the war in Iraq. But instead he looked at me very seriously and he asked, “What does life mean to you?”\n\nNow, I have to admit that I wasn't quite prepared for that one. I think I stammered for a little bit, but then I stopped and gave it some thought, and I said this:\n\nWhen I was a young man, I thought life was all about me – how do I make my way in the world, and how do I become successful and how do I get the things that I want.\n\nBut now, my life revolves around my two little girls. And what I think about is what kind of world I'm leaving them. Are they living in a county where there's a huge gap between a few who are wealthy and a whole bunch of people who are struggling every day? Are they living in a county that is still divided by race? A country where, because they're girls, they don't have as much opportunity as boys do? Are they living in a country where we are hated around the world because we don't cooperate effectively with other nations? Are they living a world that is in grave danger because of what we've done to its climate?\n\nAnd what I've realized is that life doesn't count for much unless you're willing to do your small part to leave our children – all of our children – a better world. Even if it's difficult. Even if the work seems great. Even if we don't get very far in our lifetime.\n\nThat is our ultimate responsibility as fathers and parents. We try. We hope. We do what we can to build our house upon the sturdiest rock. And when the winds come, and the rains fall, and they beat upon that house, we keep faith that our Father will be there to guide us, and watch over us, and protect us, and lead His children through the darkest of storms into light of a better day. That is my prayer for all of us on this Father's Day, and that is my hope for this country in the years ahead. May God Bless you and your children. Thank you.", "images": ["https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/make_a_diff/module_mad_05.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/en_espanol.gif", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_flickr.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/factcheck_action.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_blackplanet.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_asianave.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_myspace.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_bot.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_linkedin.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/favicon.ico", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_01.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_dnc.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_youtube.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_twitter.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/module_hrc.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_glee.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/module_action.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_eventful.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_mybatanga.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_faithbase.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/make_a_diff/module_mad_02.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_facebook.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/hdr_newsandspeeches.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_eons.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/temp_flashheader.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/make_a_diff/module_mad_06.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_digg.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/module_vpc.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/make_a_diff/module_mad_04.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/make_a_diff/module_mad_01.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/nav-donate_btn.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/obamaeverywhere2/module_everywhere_migente.jpg", "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/images/baracktv_header.jpg"], "top_img": "https://web.archive.org/web/20080618171108im_/http://www.barackobama.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Change We Can Believe In", "meta_data": {"copyright": "Copyright (c) 2007 Barack Obama. All rights reserved.", "description": "Official Website of Barack Obama 2008 Presidential Campaign", "keywords": "president, senator, illinois, chicago, barack, barck, barek, obama, 2008, 08, presidential, president, campaign, election"}, "movies": [], "publish_date": 1213459200.0, "source": "https://web.archive.org", "summary": ""}