{"url": "www.inquisitr.com/3862390/angelina-jolie-rumored-to-have-canceled-tomb-raider-reboot-cameo-debunked/", "text": "Angelina Jolie isn’t dropping out of the upcoming Tomb Raider reboot. Gossip Cop summarizes a fabricated story that was in the print edition of OK!\n\n“Jolie, of course, starred in the original 2001 film and its 2003 sequel, but now [Alicia] Vikander will take over the actress’s role for a new installment. A so-called ‘source,’ however, tells OK! that Jolie made her disapproval of the choice clear, hours after Alicia was cast last spring.”\n\nOK! adds that the outlet’s “insider” says Jolie told the studio she was backing out of a planned cameo to make it seem like she’s just looking out for the franchise, but the reality is that Jolie is jealous about Alicia’s current success. However, in the same article, Gossip Cop claims the rumor is bogus.\n\n“Angelina Jolie did NOT drop out of a cameo in the upcoming Tomb Raider reboot because she’s upset about Alicia Vikander being cast as Lara Croft, despite a late and wrong tabloid report. Gossip Cop can once again debunk this claim. We’re told it’s not true,” says columnist Andrew Shuster, who adds that Gossip Cop had already busted Star for a similar story last month.\n\nThis isn’t the first fabricated story this past week about Angelina Jolie that Gossip Cop had to bust. The site noted that the cover story of Star stated that Angelina Jolie and Kate Hudson were having a “showdown” at the Golden Globes. The tabloid claims that there has been tension growing ever since Angelina Jolie found out that her ex Brad Pitt is “romancing” Kate Hudson.\n\nAngelina Jolie and Kate Hudson are not fighting. [Image by Jordan Pix/Getty Images]\n\n“There’s every chance the real drama won’t be onstage. I’ve heard that Angie is out of her mind with jealousy, and I wouldn’t be surprised if she actually seeks Kate out and angrily confronts her behind the scenes. But Kate is nothing if not feisty, and she could give Angie a real piece of her mind if she’s pushed!” an insider claims.\n\nHowever, Gossip Cop has busted this story before it has the chance to go viral.\n\n“Angelina Jolie and Kate Hudson are NOT having a ‘showdown’ at the Golden Globes, despite a tabloid cover story. Gossip Cop can bust the wholly fabricated report,” says the gossip busting maven Shari Weiss, noting that Star has fabricated stories about an alleged showdown between Angelina Jolie and Jennifer Aniston in the past — something which never happened.\n\nThere is one story that is true: Angelina Jolie has responded to Brad Pitt’s request that all their divorce documents become sealed. People has the news.\n\nAngelina Jolie has finally approved the sealing of divorce documents. [Image by Eamonn M. McCormack/Getty Images]\n\n“Angelina Jolie has agreed to Brad Pitt’s request to have divorce documents pertaining to custody sealed — but she slams him in her new court filing…While Jolie, 41, has agreed to keep documents sealed, she strongly disputes his claims that she freely publicized sensitive information — saying that he only made such accusations because he’s ‘terrified that the public will learn the truth.'”\n\nAs People notes, a source close to the situation says that it’s nice that Angelina has finally supported the sealing of the documents weeks after Pitt’s request. However, considering that both the FBI and child services thoroughly investigated the matter and cleared Pitt, the source believes Angelina’s line of attack doesn’t make much sense.\n\nHowever, somebody on Angelina Jolie’s PR team says that while Pitt may have been cleared in the investigations that he was abusive towards Maddox, his actions have hurt the children in the long term. You can bet that somebody from Brad Pitt’s PR team will be firing back with a statement soon. There is little hope Jolie and Pitt can be civil with each other for the sake of their children.\n\n[Featured Image by Milos Bicanski/Getty Images]", "images": ["https://secure.gravatar.com/avatar/97a93d1391b1fd07c8523ce129a3c562?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/angelina-jolie-kate-hudson-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/angelina-jolie-brad-pitt-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/angelina-jolie-tomb-raider.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Daryl Deino"], "canonical_link": "https://www.inquisitr.com/3862390/angelina-jolie-rumored-to-have-canceled-tomb-raider-reboot-cameo-debunked/", "title": "Angelina Jolie Has Not Canceled ‘Tomb Raider’ Reboot Cameo [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/0kYK64cDAqk?feature=oembed"], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}