{"url": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350", "text": "Menendez brothers burst into tears during emotional prison reunion after decades apart Erik and Lyle Menendez are now both in the same San Diego prison.\n\nAfter spending over 20 years separated behind bars, brothers Lyle and Erik Menendez, convicted of killing their parents after notorious trials in the 1990s, are finally being housed at the same prison -- and their reunion was an emotional one.\n\nUntil this week, the last time Lyle and Erik Menendez saw each other was Sept. 10, 1996, said Robert Rand, a journalist who has covered the case since 1989 and was a consultant for NBC's 2017 TV series on the brothers.\n\nThat day in 1996, the brothers could see each other across prison a yard but couldn't talk to each other; they had hoped to be placed in the same prison but were put in separate vans, which took them to separate facilities, Rand told ABC News.\n\nWhile in separate prisons, they couldn't talk on the phone, but they did write letters to each other and would play chess by sending moves to each other through snail mail, Rand said. And while behind bars both brothers found wives: Erik has been married for 20 years and Lyle for 14, Rand said.\n\nThis Wednesday, after decades apart, the brothers finally came face to face at R.J. Donovan Correctional Facility in San Diego.\n\nAn undated image from Google Maps shows the San Diego's R.J. Donovan Correctional Facility. Google Maps\n\nRand, who is still in touch with the Menendez family, said a family member told him that as guards led Lyle down a hallway to see Erik, Lyle \"was surprised he wasn't feeling more emotional.\"\n\nBut once the guard opened the door and Lyle saw his brother, both Lyle and Erik \"burst into tears immediately,\" Rand said.\n\nAn Oct. 31, 2016 photo provided by the California Department of Corrections and Rehabilitation shows Erik Menendez (L) and a Feb. 22, 2018 photo provided by the California Department of Corrections and Rehabilitation shows Lyle Menendez. The Menendez brothers, who were convicted of killing their parents in their Beverly Hills mansion nearly three decades ago, have been reunited in the Southern California prison San Diego's R.J. Donovan Correctional Facility. California Department of Corrections and Rehabilitation via AP, FILE\n\n\"They just hugged each other for a few minutes without saying any words to each other,\" Rand said. \"Then the prison officials let them spend an hour together in a room.\"\n\nJose and Kitty Menendez are seen here in this undated family photo. Brian Anderson\n\nTheir story began on Aug. 20, 1989, when Lyle, then 21, and Erik, then 18, opened fire on their wealthy parents inside the family’s Beverly Hills mansion, using shotguns they bought days before the murders.\n\nTheir father, Jose Menendez, a successful Cuban-American business executive, was shot point-blank in the head. Their mother, Kitty Menendez, was shot several times in her torso and face.\n\nAuthorities arrested the brothers in 1990 after their psychologist’s girlfriend went to police claiming Erik had confessed the murders to the psychologist during a session and Lyle had threatened the doctor’s life, thus voiding doctor-patient privilege.\n\nIn this file photo, brothers Erik Menendez and Lyle Menendez listen to a charge of murder conspiracy against them, Dec. 29, 1992, in Los Angeles. The brothers pled innocent to the new indictment which dropped the original charge that they killed their parents for money. The indictment was returned nearly three years after Joseph and Kitty Menendez were found slain in their home. Chris Martinez/AP, FILE\n\nAt trial, prosecutors alleged that the brothers, who lived a life of privilege, murdered their parents out of greed, hoping to get their hands on the family fortune. The defense argued the brothers’ acted in self-defense after years enduring their parents’ abuse.\n\nIn this file photo, Lyle Menendez looks back at the spectators in the courtroom during final arguments in the second murder trial of Lyle and his brother Erik in the Van Nuys section of Los Angeles, Feb. 22, 1996. For the second time in as many days, final arguments prompted a motion for mistrial based on the prosecutor's suggestion there wasn't enough evidence to show the brothers were abused by their parents. Nick Ut/AP, FILE\n\nErik Menendez gestures during lengthy testimony in Van Nuys courthouse in Los Angeles, Jan. 4, 1996, in this file photo. He and his brother Lyle are being retried for the 1989 murder of their parents in Beverly Hills, Calif. Nick Ut/AP, FILE\n\nTheir first trials ended in mistrials, but at the end of a second trial in 1996, the brothers were convicted of first-degree murder and sentenced to two consecutive life prison terms without the possibility of parole.\n\nErik, left, and Lyle Menendez are seen here as a young men in this undated family photo. Brian Anderson\n\nTheir reunion began when Lyle was transferred from Northern California's Mule Creek State Prison to San Diego's R.J. Donovan Correctional Facility in February 2018, corrections department spokeswoman Terry Thornton told ABC News.\n\nErik had been at this San Diego facility since July 2013, she said.\n\nBut when Lyle was transferred in February, they were housed in different sections so they could not interact, Thornton said. On April 4, Eric was transferred to Lyle's housing facility within that prison, and in that facility, all the inmates have the ability to interact with one another, she said.\n\nThey can now see each other every day at meals and in the exercise yard, Rand said.\n\nRand said the last few years Lyle told him that he \"missed his brother so much. And Erik had also talked about how much he missed Lyle. So this is just an overwhelming, emotional, happy moment for not only the brothers but their entire family.\"", "images": ["https://s.abcnews.com/images/US/menendez-brothers-ap-jpo-180406_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/US/menendez-brothers-ap-jpo-180406_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Emily Shapiro", "Muriel Pearson", "Lauren Effron", "April", "Min Read"], "canonical_link": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350", "title": "Menendez brothers burst into tears during emotional prison reunion after decades apart", "meta_data": {"description": "Erik and Lyle Menendez are now both in the same San Diego prison.", "keywords": "Menendez, Menendez brothers", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Menendez brothers burst into tears during emotional prison reunion after decades apart", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350", "title": "Menendez brothers burst into tears during emotional prison reunion after decades apart", "description": "Erik and Lyle Menendez are now both in the same San Diego prison.", "image": "https://s.abcnews.com/images/US/menendez-brothers-ap-jpo-180406_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-04-06T19:27:31Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,54281350", "ipad": "abcnewsipad://link/story,54281350", "googleplay": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Menendez brothers burst into tears during emotional prison reunion after decades apart", "description": "Erik and Lyle Menendez are now both in the same San Diego prison.", "url": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350", "image": {"identifier": "https://s.abcnews.com/images/US/menendez-brothers-ap-jpo-180406_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,54281350", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,54281350", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/US/menendez-brothers-burst-tears-emotional-prison-reunion-decades/story?id=54281350"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}