{"url": "https://www.womenshealthmag.com/weight-loss/a19405888/shannon-beador-weight-loss-diet/", "text": "If you've been following Shannon Beader's weight-loss journey, then you know she has tons of products she swears are responsible for helping her get THISCLOSE to her pre-weight gain number. (And if you haven't been, are you even a Real Housewives of Orange County fan?!?!)\n\nThe RHOC star put on 40 pounds because of marital issues (she and her husband are now estranged). “That stress caused me to eat more, caused me to drink more, and that’s a huge part of why I gained my weight,” she said during the season 12 premiere. When she visited a holistic specialist in a later episode, she learned that her body-fat percentage had climbed to a scary 40 percent. (The healthy range for women is between 20 and 25 percent.)\n\nShannon committed to getting healthy and dropping the pounds last year—and she's almost done losing those 40 extra pounds. Her results are pretty impressive—so much so that, if you're looking to lose weight yourself, you might be considering stealing some of her tricks.\n\nYeah, about that... Ever notice how some of Shannon's posts say #ad? That's because companies are paying her to post about their products. But some of Shannon's weight-loss pointers are legit. So how are you supposed to tell which are b.s. and which are worth cribbing?\n\nHolly Lofton, M.D., director of the medical weight-management Program at NYU Langone Health, went through Shannon's IG feed—and she definitely has some ~thoughts~.\n\n1. She Exercises for 30 Minutes A Day\n\nTry it. Lofton recommends working out for at least 150 minutes per week if you're trying to lose weight—and you'll need to actually break a sweat during those workouts if you want to see results. If you're huffing and puffing (at least some of the time—it's totally fine to mix it up with lower-intensity days), that's a sign your heart rate is in the \"aerobic\" zone, which is key for weight loss, not to mention overall health.\n\n\n\n2. She Takes Supplements\n\nSkip it. \"There's no evidence that taking vitamins and supplements increases weight-loss results,” says Lofton. Instead, she recommends getting your nutrients from a balanced diet, which is always going to be the healthier option since whole foods come packaged with other key vitamins and minerals, like fiber. Lofton's only exception is if you have an issue that prevents you from absorbing certain nutrients from food. If that's the case, your doctor should have already talked to you about a supplement routine.\n\n\n\n3. She Drinks Detox Tea\n\nNope, nope, nope. This one gets a hard pass. “I haven’t looked into the ingredients of this particular tea, but I don’t recommend teas or juices for weight loss,” says Lofton, noting that the sugar content of \"detox\" drinks can mess with weight-loss goals. Also worth noting: Your body already has systems for getting rid of toxins—and relying too heavily on fluids for nutrients can lead to electrolyte imbalances.\n\n\n\n4. She Uses a Sweat Belt\n\nSorry, but...no. \"Sweat belts cause water loss, not weight loss,\" Lofton says. So while you might see a lower number on the scale, any weight you \"lose\" will come right back when you rehydrate.\n\n\n\n5. She Does Cupping Therapy\n\nNot necessary. Cupping can help your muscles recover from a tough workout, but it probably won’t affect the number on the scale. “My understanding is that it helps with inflammation over muscle areas—not that it has weight-loss benefits,” says Lofton.\n\n\n\n6. She Has a Workout Buddy\n\n10/10 would recommend. You're more likely to sick to a healthy routine if you have a friend to support you along the way, says Lofton. (Research backs this up, btw.)\n\n\n\n7. She Drinks Meal-Replacement Shakes\n\nYou can try it...if you want. Lofton is okay with the occasional shake, so long as it contains vitamins and minerals (and not just a bunch of sugar or chemicals). A good rule of thumb is to make sure the shake contains at least 30% of your B-Complex vitamins. And while adding fruits and veggies may seem like a good idea, it can lead to weight gain if you're not careful. \"Getting more carbs than protein increases fat-storage hormones and can make you hungry sooner,” says Lofton. Make sure your shakes are protein-packed to avoid issues.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "keywords": [], "authors": ["Elana Gross"], "canonical_link": "https://www.womenshealthmag.com/weight-loss/a19405888/shannon-beador-weight-loss-diet/", "title": "Shannon Beador Shares The Tips That Helped Her Lose Almost 40 Lbs", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Women's Health", "title": "Shannon Beador Shares The Tips That Helped Her Lose Almost 40 Lbs", "description": "Day-um.", "url": "https://www.womenshealthmag.com/weight-loss/a19405888/shannon-beador-weight-loss-diet/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "modified_time": "2019-03-09 09:51:05", "published_time": "2018-03-12 10:10:00", "section": "Weight Loss", "opinion": "false"}, "twitter": {"site": "@WomensHealthMag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=1.00xw:0.752xh;0,0&resize=640:*"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "title": "Shannon Beador Weight Loss Tips - Real Housewife Star Lost Almost 40 Pounds", "description": "A weight-loss expert weighs in on all of the products and pointers that Real Housewives of Orange County star Shannon Beador says helped her lose almost 40 pounds.", "keywords": "Shannon Beador weight loss, Real Housewives Of Orange County, Shannon Beador weight, Shannon Beador workout, Shannon Beador diet, RHOC,", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=0.668xw:1.00xh;0.124xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Weight Loss,weight-loss", "sailthru.date": "2018-03-12T22:10:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=1.00xw:0.752xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180598-0472-jpg-1520891577.jpg?crop=0.668xw:1.00xh;0.124xw,0", "sailthru.socialtitle": "Shannon Beador Shares The Tips That Helped Her Lose Almost 40 Lbs", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1520820600.0, "source": "https://www.womenshealthmag.com", "summary": ""}