{"url": "https://en.wikipedia.org/wiki/Aidy_Bryant", "text": "American actress and comedian\n\nAidan Mackenzy Bryant (born May 7, 1987) is an American actress and comedian. She is known as a cast member on the late-night variety series Saturday Night Live (2012–present), beginning in season 38.[1] For her work on the series, she has been nominated for two Primetime Emmy Awards, including for Outstanding Supporting Actress in a Comedy Series.[2] Her other work includes a voice role in the animated series Danger & Eggs (2017) and a starring role in the sitcom Shrill (2019–present), the latter for which she also serves as writer and executive producer.\n\nEarly life [ edit ]\n\nBryant was born in Phoenix,[3] the daughter of Georganna (née Vinall) and Tom Bryant.[4] Her mother owns a boutique called Frances in Phoenix.[5] Bryant is of English, Irish, and German descent.[6] She has one brother.[7] She graduated from Xavier College Preparatory in 2005, where she made the morning announcements.[5] Bryant developed an interest in performing during middle school theater classes and summer camps, where she learned about improvisation.[8] Her parents took her to improv workshops at the now-defunct Arizona Jewish Theatre Company.[8]\n\nShe graduated from Columbia College in Chicago with a B.A. in 2009.[9][10] At Columbia College, she participated in the college's comedy studies program, developed by the Theatre Department and The Second City.[10]\n\nCareer [ edit ]\n\nAfter Bryant graduated from Columbia College, she toured with the musical improv group Baby Wants Candy and was approached by Second City.[8] She has performed with iO Chicago, The Second City[11] and the Annoyance Theatre. She was a writer and ensemble member for both \"Sky's the Limit, Weather Permitting\" and \"We're All In This Room Together\" on the Second City e.t.c. Stage.[9]\n\nBryant made her debut as a featured player on Saturday Night Live on September 15, 2012.[9][12][13] She was promoted to a repertory player during her second season on the show.\n\nIn 2013, Bryant appeared with a recurring role in the second season of IFC's Comedy Bang! Bang!, playing the show's segment producer.[14] Bryant also made an uncredited cameo appearance in The Amazing Spider-Man 2.[15] She has made guest appearances on programs such as Broad City, Documentary Now!, The Awesomes, and Girls. In 2016, Bryant had a recurring role as Alice in the Louis C.K. series Horace and Pete. In 2017, Bryant provided the voice of main character D.D. Danger on the animated series Danger & Eggs.[16]\n\nIn 2014, Bryant, Eli Bruggemann, Chris Kelly, Sarah Schneider, and Kate McKinnon were nominated for a Primetime Emmy Award in the category of Outstanding Original Music and Lyrics for the \"Home for the Holiday (Twin Bed)\". The music video sketch aired on December 21, 2013.[17] She won the award for Supporting Actress in a Comedy Series at the 2015 EWwy awards which honor performances that were snubbed by the Emmys.[18] In 2018, Bryant received a nomination at the 70th Primetime Emmy Awards for Outstanding Supporting Actress in a Comedy Series.[19]\n\nIn 2019, Bryant starred in the Hulu series Shrill. After Bryant became involved with Shrill, as a co-writer, co-executive producer and as the main character, there was a question of whether she would return for the 2019-20 season of Saturday Night Live.[20] As of February 11, 2019, Bryant plans to continue acting on the show.[21]\n\nRecurring characters on SNL [ edit ]\n\nOne of the students in the \"Shallon\" (Nasim Pedrad) sketches\n\nMorgan, co-host of Girlfriends Talk Show who always gets shunned or ignored by her friend Kyra (Cecily Strong) in favor of a cooler guest [5]\n\nwho always gets shunned or ignored by her friend Kyra (Cecily Strong) in favor of a cooler guest Tonker Bell, Tinker Bell's rude-mannered half-sister whose dad is a house fly\n\nOne of the actors in a dramatic High School Theater production, who attempt to make broad points about society's issues\n\nLi'l Baby Aidy, a characterization of herself in the show's all-female music videos (so called because she was the youngest [the \"baby\"] of the current female cast)\n\nMelanie, a flirtatious young teen with a romantic spark for mature gentlemen—said gentlemen being her friends' fathers\n\nAn unnamed girl who appears in porno movie scenarios and is oblivious to their sexual nature (in Hot for Teacher 8, she tried to ask her teacher, Miss Dayworth (Amy Schumer), for help on the unspecified assignment; in The Doctor Is In...My Butt 4, she thinks Dr. Rockhard (Adam Driver) is a real doctor, and in Skank Babysitter 17, she thinks her babysitter Miss Jasmine (Heidi Gardner) invited a pizza delivery man (Chance the Rapper) over for dinner).\n\nPersonal life [ edit ]\n\nThroughout her adolescence, Bryant dealt with self-esteem issues related to her weight.[20] Acting and performing improv allowed her to become more confident as a person and as an actor.[20]\n\nOn April 28, 2018, Bryant married comedian Conner O'Malley, who was a former writer on Late Night with Seth Meyers.[22] They met in 2008 as performers at the Annoyance Theatre in Chicago, and became engaged in 2016.[23]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2014 The Amazing Spider-Man 2 Statue of Liberty Lady 2014 Kids Sarah Short film 2015 Prom Queen Teacher #1 Short film 2016 Brother Nature Dana Curlman 2016 Darby Forever Darby Short film; also writer and producer 2017 The Big Sick Mary 2017 The Star Ruth (voice) 2018 I Feel Pretty Vivian\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nReferences [ edit ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Aidy_Bryant.png/220px-Aidy_Bryant.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Mike_Birbiglia_and_Aidy_Bryant.webm/220px--Mike_Birbiglia_and_Aidy_Bryant.webm.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Flag_of_Arizona.svg/24px-Flag_of_Arizona.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Aidy_Bryant.png/1200px-Aidy_Bryant.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Aidy_Bryant.png/1200px-Aidy_Bryant.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Aidy_Bryant", "title": "Aidy Bryant", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Aidy_Bryant.png/1200px-Aidy_Bryant.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}