{"url": "www.inquisitr.com/4127742/kylie-jenner-drake-to-date-after-tyga-split-kris-jenner-organizing-kuwtk-get-together/", "text": "Kylie Jenner could potentially land herself a date with Drake if momager Kris Jenner has it her way, it has been alleged.\n\nKylie, who allegedly called it quits with her on-again, off-again beau, is said to have been devastated by the split, but according to reports, things were becoming too much with the drama concerning Blac Chyna and her claims that Tyga wasn’t being faithful to the 19-year-old.\n\nKylie Jenner was allegedly concerned by some of the allegations Chyna had made regarding failed child support payments and claims that Tyga had hooked up with men that only the mother-of-two knew about, and she claims to have evidence.\n\n[Image by Monica Schipper/Getty Images]\n\nOf course, the Blac Chyna drama hasn’t been the only thing on Kylie Jenner’s mind. Reports also claimed that the lip kit businesswoman was annoyed with the supposed fact that Tyga would spend more time at the club with his friends than with her at their home in Calabasas.\n\nAs of right now, it doesn’t seem as if Kylie Jenner has any plans to get back with the “Rack City” rapper in the near future, which has led Kris to throw in her two cents, allegedly telling her daughter that she should consider the idea of dating Drake.\n\nThe “One Dance” hitmaker has become a very close friend to the Kardashians over the last couple of years, having even attended Kylie’s 17th birthday party two years ago. The family famously invited Drake over for dinner a year ago, having also attended their Christmas party in 2015.\n\nIt’s fair to say that Drake is no stranger to Kylie Jenner or her famous family.\n\nSo, it wouldn’t be much of a stretch to consider the potential chances of Kylie and Drake hooking up — at least according to Hollywood Life.\n\nThe outlet suggests that Drake and Kylie would make a perfect couple, especially with Kris Jenner under their wings, who is already said to be working her magic to make it happen. The momager reportedly believes that dating Drake is a complete upgrade from Tyga: Drizzy and Kylie Jenner are super successful and share a lot of things in common, so it’s a match made in heaven, it would seem.\n\n“Kris wants to see Kylie move on from Tyga, she thinks the drama and the constant back and forth is a waste of time,” an insider tells Hollywood Life. “She wants to see her happy and get out there and start dating.”\n\n[Image by Jason Merritt/Getty Images]\n\n“Kris thinks Kylie should give Drake a chance, she wants them to date. Kylie Jenner and Drake are friends, she’s cool with him but she’s still very wrapped up in Tyga. While Kim and Kris are in Kylie’s ear telling her to dump him, Khloe and Kourtney are telling her to make it work.”\n\nAs the source already mentions, while Kylie Jenner has more or less accepted the fact that she won’t be getting back with Tyga, she’s still hanging on the two-year relationship she shared with her 27-year-old ex-boyfriend, with a source adding that it’s not that easy for her to move on.\n\nLast year, it was even claimed, via Heat World, that Kylie Jenner had confided in her family, telling them that she was convinced she would end up marrying the “Faded” rapper in the near future, adding that she couldn’t see herself with anybody else but him.\n\nNow that allegations regarding baby mama drama and cheating affairs have come forward, Kylie Jenner has definitely had a change of heart. She doesn’t want to surround herself with people that could potentially waste her energy on something that she shouldn’t be focused on in the first place.\n\nWith business booming, Kylie Jenner’s main concern is continuing to market her brand, and while she still cares for Tyga, it seems evidently clear that their romance has officially come to an end.\n\nWhat do you think? Will Kylie Jenner end up dating Drake in the near future?\n\n[Featured Image by Jason Kempin/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/04/kylie-jenner-drake-dating-after-tyga-split.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/04/kylie-jenner-gq-girogio-armani-event.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/2146221c3bb32c670d1053a99949feba?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/04/kylie-jenner-tyga-new-york-fashion-week-attendance.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Maurice Cassidy"], "canonical_link": "https://www.inquisitr.com/4127742/kylie-jenner-drake-to-date-after-tyga-split-kris-jenner-organizing-kuwtk-get-together/", "title": "Kylie Jenner, Drake To Date After Tyga Split: Kris Jenner Organizing ‘KUWTK’ Get-Together?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}