{"url": "https://www.etonline.com/royal-wedding-countdown-meghan-markles-friends-and-family-begin-their-travels-to-london-101867", "text": "Meghan Markle and Prince Harry will be tying the knot at St. George's Chapel in one week, and ET is breaking down all the latest updates as they gear up for their May 19 nuptials.\n\nBIGGEST NEWS OF THE WEEK\n\nThe excitement is in the air, as Meghan's family and friends are starting to make their way to London. Just in time for Mother's Day, Meghan's mom, Doria Ragland, arrived in England earlier this week.\n\nA source told ET on Thursday that Meghan has \"normal last-minute nerves\" ahead of her nuptials, but is happy to have her mother by her side in the days before she says \"I do.\" According to our source, this is the first time Doria will see Meghan's dress, as Meghan just had her final fittings a week and a half ago. The Los Angeles native's father, Thomas Markle, is also expected to arrive by the weekend.\n\n\"Doria will be here to help Meghan relax in the last days before she becomes a [royal],\" the source said, adding that one of Meghan's closest pals, Jessica Mulroney, will arrive next week to \"help Meghan out with last-minute touches ahead of her big day.\"\n\nWEDDING COUNTDOWN\n\nSo, how many days until the royal wedding? Meghan and Harry will officially be tying the knot in:\n\nGetty Images\n\nROYAL RUMOR ROUNDUP\n\nThe rumor mill this week has Queen Elizabeth sneaking a peek at Meghan's wedding dress. The bride's gown is said to be hidden away in Windsor and will show it to the queen this week or possibly the next, according to US Weekly.\n\nAnother story circulating the web is that Meghan's gown -- rumored to be a custom Ralph & Russo Couture creation -- will cost approximately $135,600.\n\nMeghan Markle Wedding Dress Details! She Doesn't Want to Upstage 'Future Queen' Kate Middleton This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Meghan Markle Wedding Dress Details! She Doesn't Want to Upstage 'Future Queen' Kate Middleton\n\n\"Meghan’s dress is expected to cost hundreds of thousands of dollars,\" royal expert Melanie Bromley told Harper's Bazaar. \"It's going to be featured in the history books, so needs to stand the test of time.”\n\nThe price may seem quite high, though that doesn't compare to Kate Middleton's custom Alexander McQueen design that cost around $400,000. \"But that eye-watering price was befitting for a future queen, so it’s unlikely Meghan’s will be as expensive because it could be seen by some as being disrespectful,” Bromley added.\n\nET’s royal expert Katie Nicholl had echoed those sentiments back in March, saying, \"I think it's very unlikely that Meghan would spend more than that and in doing so try and upstage a future queen.\"\n\nOUT AND ABOUT\n\nAlthough we didn't get a real sighting from Meghan and Prince Harry this week (they're kinda busy, ya know, preparing for a royal wedding!), fans freaked out via social media when Madame Tussauds unveiled two wax figures of the bride-to-be on Wednesday.\n\nOne is located in New York City, in the Madame Tussauds' Royal Palace Experience. Meghan's likeness, dressed in a gown donated by one of real Meghan's favorite designers, Self Portrait, is perfectly placed right next to a wax replica of Harry.\n\nCindy Ord/Getty Images for Madame Tussauds\n\nA second wax figure of the former Suits star was unveiled at the museum's London location, where the statue sports a green dress and nude heels, with her hair flowing past her shoulders in a similar style.\n\nStuart C. Wilson/Getty Images\n\nAccording to Christine Haughney, Madame Tussauds' regional head of marketing for northeast, Meghan is aware that the wax figures exist. \"She has [seen photos],\" Haughney told ET. \"We hope [she approves].\"\n\nRATHER REGAL LOOKS\n\nWe already took a look back at Meghan's royal style since first being spotted with her fiance. This week, let's take a walk down memory lane and revisit the bride-to-be's fashion evolution from when she first hit the Hollywood scene back in 2009 to just before getting engaged:\n\nRelated Gallery\n\nLOL OF THE WEEK\n\nLiterally everyone is getting into the royal wedding spirit! Earlier this week, corgis dressed as Harry, Meghan and other members of the royal family took part in Lifetime's \"Corgi Court,\" celebrating Harry & Meghan: A Royal Romance, which premieres on the network on May 13.\n\nThe adorable affair was held at Herald Square in New York City on Thursday. Check out these too cute pics of the royal corgis:\n\nCraig Barritt/Getty Images for Lifetime\n\nCraig Barritt/Getty Images for Lifetime\n\nCraig Barritt/Getty Images for Lifetime\n\nSPARKLE LIKE MARKLE\n\nWhile we typically try to practice our own princess etiquette here in this section, this week, we came across an adorable home video of Meghan from 1990 that needs to be seen.\n\nBack when she was growing up in Los Angeles, the brunette beauty's playtime involved mimicking the queen and British royalty with her friends. Watch below:\n\nNEXT IN LINE\n\nWhile Kate Middleton stays home with Prince Louis, Prince William continues to represent the family at royal affairs. On Wednesday, the Duke of Cambridge opened London Bridge Station, which had been redeveloped in a five-year transformation program.\n\nAccording to Kensington Palace, William met architects involved in the project, unveiled a plaque to mark the official opening and met with the Bridges Choir.\n\nJeff Spicer - WPA Pool/Getty Images\n\nThe wedding is officially only one week away! For now, that's a wrap on this week's royals update. Let us know on Twitter (@desireemurphy_ and @lizcalvario) what other regal news you'd like us to cover in the future.\n\nIn the meantime, keep up with all of ET's coverage of the royal wedding as we count down to May 19.\n\nRELATED CONTENT:\n\nInside Meghan Markle's Healthy Lifestyle\n\nMeghan Markle's Wax Figure Unveiled at Madame Tussauds\n\nMeghan Markle Pretends to Be a Royal in 1990 Home Movie -- Watch!\n\nHow Meghan Markle Stays Fit and Fresh This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-956159226.jpg?itok=FoxkGyRG", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/meghanharry.jpg?h=827f73f4&itok=QSE_OjgD", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/z_markle_whitedress_8days.jpg?itok=dPW4CECh", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/prince_william_gettyimages-956399448.jpg?itok=4nno18LC", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-956541060.jpg?itok=f_-TewOJ", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2019-06/meghan-markle-beauty-products-1280.jpg?h=906a431d&itok=tfMLSHM-", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-956323248.jpg?itok=4NRDzByI", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=hRz_zhpQ", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-956159242.jpg?itok=pAQj6IPR", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-05/gettyimages-956159158.jpg?itok=NECNn5j3"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "keywords": [], "authors": ["Desiree Murphy", "Liz Calvario"], "canonical_link": "https://www.etonline.com/royal-wedding-countdown-meghan-markles-friends-and-family-begin-their-travels-to-london-101867", "title": "Royal Wedding Countdown: Meghan Markle's Friends and Family Begin Their Travels to London", "meta_data": {"article": {"opinion": "false"}, "title": "Royal Wedding Countdown: Meghan Markle's Friends and Family Begin Their Travels to London | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/royal-wedding-countdown-meghan-markles-friends-and-family-begin-their-travels-to-london-101867", "title": "Royal Wedding Countdown: Meghan Markle's Friends and Family Begin Their Travels to London", "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "title": "Royal Wedding Countdown: Meghan Markle's Friends and Family Begin Their Travels to London", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍ and Liz Calvario‍", "url": "https://www.etonline.com/royal-wedding-countdown-meghan-markles-friends-and-family-begin-their-travels-to-london-101867", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-04/z_22_countdown_to_royal_wedding.jpg?h=c673cd1c&itok=F39Y7aIW"}, "description": "ET breaks down all the latest updates from the couple ahead of their May 19 nuptials!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, News, Meghan Markle, Prince Harry, Royal Wedding, Royals, Kate Middleton, Prince William, Queen Elizabeth", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}