{"url": "www.vogue.co.uk/article/rihanna-coachella-2018-wardrobe-interview", "text": "When it comes to fashion, no one competes with Rihanna. Heading to Indio, California to take in Coachella this weekend, she left the flower crowns and body paint at home, showing up in looks direct from the catwalk. While the star has always had fun pushing the limits of festival dressing—who can forget last year’s epic Gucci bodysuit or the Matthew Adams Dolan deconstructed denim?—this go round proved her most daring. Pulling out transparent Y/Project, custom Chrome Hearts, and a face-covering balaclava that rendered her almost incognito, she took style risks few others would attempt—exactly what she and Fenty creative director Jahleel Weaver were going for. “Coachella should always be fun and disruptive,” shared Weaver via email. “We had such a moment last year with the Gucci crystal bodysuit and mask, so how do we top that?”\n\nUpping the ante meant entering the planning stage early. Though they started to officially brainstorm a month in advance, when Weaver and Rihanna saw a great piece during February’s fashion month, they made a mental note. Case in point: the moment the balaclava turned up at Alessandro Michele’s autumn/winter 2018 Gucci show, it was destined to be worn. “Ri and I both instantly loved it when it came down the runway,” says Weaver. “So we started to think of what’s the next opportunity to wear this? The Gucci team is so great to us and such a pleasure to work with and they made it happen.” The love at first sight rule also applied to the gauzy Y/Project creation, which came with extreme UGGs that made it an outside the box choice: “It was just so NOT Coachella that it made us love the idea even more.”\n\nMaking these unique pieces work requires styling magic and foresight, and Weaver gives credit where it’s due. “I have an amazing assistant Amir that really helps me stay organised and calm which allows me to just focus on all these crazy ideas,” he says. Though he’s mum on when we’ll see the next jaw-dropping Rihanna outfit, their partnership ensures plenty of great fashion on the horizon. “What I love about Ri is that she’s such a non-conformist, which pushes your boundaries of creativity,” says Weaver. “Nothing is off limits.”\n\nThis article was originally published on Vogue.com.", "images": ["https://media.vogue.co.uk/photos/5d5485eee598280008780b78/2:3/w_100%2cc_limit/original", "https://media.vogue.co.uk/photos/5d5485eee598280008780b78/16:9/w_1920,c_limit/original", "https://media.vogue.co.uk/photos/5e55927e5532d4000820cb5d/1:1/w_100%2cc_limit/Dior_GoRunway_ALE0011.jpg", "https://media.vogue.co.uk/photos/5e4fbc4b453c4500083b20bb/1:1/w_100%2cc_limit/31_Tods_IS5_0494.jpg"], "top_img": "https://media.vogue.co.uk/photos/5d5485eee598280008780b78/16:9/w_1920,c_limit/original", "keywords": [], "authors": [], "canonical_link": "https://www.vogue.com/article/rihanna-coachella-2018-wardrobe-interview", "title": "The Story Behind Rihanna’s Epic Coachella Wardrobe", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "og": {"locale": "en_GB", "site_name": "British Vogue", "image": {"identifier": "https://media.vogue.co.uk/photos/5d5485eee598280008780b78/16:9/w_1920,c_limit/original", "alt": "Image may contain: Rihanna, Clothing, Apparel, Human, Person, Advertisement, Collage, Poster, Tiana Benjamin, and Shorts"}, "url": "https://www.vogue.co.uk/article/rihanna-coachella-2018-wardrobe-interview", "title": "The Story Behind Rihanna’s Epic Coachella Wardrobe", "type": "article", "description": "When it comes to fashion, no one competes with Rihanna"}, "robots": "all", "fb": {"app_id": 449870811704655}, "twitter": {"card": "summary_large_image", "site": "BritishVogue", "title": "The Story Behind Rihanna’s Epic Coachella Wardrobe", "description": "When it comes to fashion, no one competes with Rihanna", "image": {"identifier": "https://media.vogue.co.uk/photos/5d5485eee598280008780b78/16:9/w_1920,c_limit/original", "alt": "Image may contain: Rihanna, Clothing, Apparel, Human, Person, Advertisement, Collage, Poster, Tiana Benjamin, and Shorts"}}, "description": "See all of Rihanna's eye-catching fashion moments from Coachella 2018"}, "movies": [], "publish_date": null, "source": "http://www.vogue.co.uk", "summary": ""}