{"url": "https://www.thisisinsider.com/13-reasons-why-every-new-season-2-plot-detail-and-casting-info-2018-3", "text": "Warning: Minor spoilers ahead for the second season of \"13 Reasons Why.\"\n\nNetflix's hit series \"13 Reasons Why\" will return with a second season on May 18. The first season of this controversial series explored the suicide of high school student Hannah Baker and the impact of her choice on a small town community.\n\nHannah left behind 13 tapes explaining the precisely how various peers and adults had impacted her life and ultimately contributed to her choice to take her own life. There will be 13 new episodes on the second season, but no more cassette tapes this time around.\n\nAccording to the season two synopsis, polaroids will take the place of cassettes. Here's the full description:\n\n\"Season 2 picks up in the aftermath of Hannah's death and the start of our characters' complicated journeys toward healing and recovery. Liberty High prepares to go on trial, but someone will stop at nothing to keep the truth surrounding Hannah’s death concealed. A series of ominous polaroids lead Clay and his classmates to uncover a sickening secret and a conspiracy to cover it up.\"\n\nINSIDER is here to reveal everything we know so far about what's in store for \"13 Reasons Why.\" Let's dive in.\n\nNew hints in the season two announcement video\n\nWhen Netflix shared a new teaser video announcing the May 18 release date, several clues about what's to come were contained inside.\n\nThe teaser showed Mr. Porter's desk with two files — one on Bryce and another on Tyler. Netflix\n\nIt looks like both Bryce and Tyler will be involved in investigations. The teaser showed us Bryce possibly drugging and assaulting another girl at a party, while a file on Tyler was sitting on the school counselor's desk.\n\nWe'll get into what this means for Tyler in a bit, but first here's more about what will happen with Bryce.\n\nA series of sexual assaults committed by athletic teams will be uncovered\n\nOn the first season, it's revealed that both Hannah and another student, Jessica, were raped by a fellow student and local sports-star named Bryce.\n\nHannah names Bryce as one of the reasons why she committed suicide, but Jessica (who is also on the tapes for other reasons) takes more time to come to terms with what happened with her. By the first season finale, Jessica had confronted her own substance abuse issues she was using as a coping mechanism for the trauma and had decided to open up to her dad about what happened to her.\n\n\"Jessica's experience continues to be a central part of season two,\" Yorkey said during a recent Netflix panel. \"We wanted to look at her recovery and what it [means] to go from being a victim of sexual of sexual assault to being a survivor and what that journey is like.\"\n\nJessica is still coming to terms with her assault. Beth Dubber/Netflix\n\n\"We said from day one of season one in our writers' room that we wanted this show to be about the way we treat girls and women in this culture, and the way we raise boys up into men,\" Yorkey said. \"In season two, we explore a storyline that has to do with an ongoing case of numerous sexual assaults that is connected to the athletic teams at Liberty High School.\"\n\nThis new case will examine \"the ways sexual assault has been perpetrated [and documented] over a number of years\" within the athletic department and Liberty High School as a whole.\n\nYorkey says the parallel between this new storyline and the real-world #MeToo movement is happenstance.\n\n\"We developed [it] many many months ago based on quite a bit of research we had done, but at the time we had these discussions about whether it was realistic to think serial sexual abuse could be kept secret by so many people for so long,\" Yorkey said. \"And then we watched events unfold in our culture that confirmed... unfortunately it is possible for severe sexual abuse at a very high and systematic level to be kept secret and for institutions to be complicit in it.\"\n\nWhich of the other high school athletes has been assaulting women? Beth Dubber/Netflix\n\nThe community might help stop Tyler's school shooting plan\n\nThe first season of \"13 Reasons Why\" ended with the implication that Tyler Down, a Liberty High student who was bullied often, was planning an attack on his fellow students with a stash of guns and bullets hidden in his room.\n\nBut according to Yorkey, the community might reach out to Tyler in the ways it failed to do with Hannah. Maybe this is why Mr. Porter has a file on Tyler sitting on his desk in the new teaser.\n\n\"One of the themes we've talked about a lot for season two is the journey from isolation to finding community, and I think Tyler suffers — especially at the end of season one — from some severe social isolation,\" Yorkey told INSIDER.\n\nTyler had photographs of all the students who he thinks wronged him. Beth Dubber/Netflix\n\n\"[Tyler is] thinking about making a tragic choice to restore to some sense of control or power,\" Yorkey said. \"And I think we'll see over the course of season two that he continued to struggle with that but that hopefully there will be a community that is able to support him in a way that maybe there wasn't for Hannah.\"\n\nFor more on how this storyline might play out, read INSIDER's full interview with Yorkey and Netflix's vice president of original series.\n\nThe Bakers' lawsuit against Hannah's school will go to trial\n\nBy the finale of the first season, Hannah Baker's parents, Olivia and Andrew, have brought a lawsuit against Liberty High School, holding it responsible for their daughter's death.\n\n\"Hannah Baker's parents suing the school district is a central story engine to the whole season,\" showrunner Brian Yorkey told INSIDER. \"This question of whether and how the school was responsible for what happened to Hannah is a really interesting one.\"\n\nHannah's parents are taking their case even further. Netflix\n\nMany of the students featured on Hannah's 13 tapes had been deposed already on the first season, but now we'll see them testify in an actual court. By the finale, Hannah's parents were finally in possession of the tapes themselves, which will surely be a key part of evidence in their case.\n\n\"As we see that all play out, we also see these kids come to court and testify and tell these stories under oath,\" Yorkey said. \"Secrets are revealed and over the course of the season people will find that their opinion on who was complicit and who wasn't, and their opinions about Hannah, will go through a series of changes. Hopefully that will be a really interesting ride.\"\n\nWhy we'll see a \"very different\" Hannah in flashbacks\n\n\"13 Reasons Why\" star Katherine Langford (Hannah) made waves last year when she said the second season will show a \"very different\" version of her character. Since Hannah was already dead by the start of the first episode, all of her appearances were flashbacks narrated by either Hannah herself (on the tapes) or memories Clay and the other students had of her.\n\n\"On season one, Hannah told her story. And in season two, the other kids get a chance to tell their stories,\" Yorkey told INSIDER. \"There's more to the story than what is on the tapes. And I think what we'll see […] will certainly complicate our understanding of who Hannah was.\"\n\nHannah's version of events might not have been entirely accurate. Netflix\n\n\"I don't think it will lessen the tragedy of her death in any ways [and] it doesn't change any of what she went through,\" Yorkey said. \"But it provides a fuller picture of what her life was and also of the kids whose stories she tells — how they saw what happened between them and Hannah and what happened in the community.\"\n\nYorkey hopes the fans of the series will understand why we might see new sides to Hannah on this coming second season.\n\n\"That's an important part of season two's storytelling and I think it will be an interesting challenge, especially for younger viewers, to understand that Hannah's story was not the definitive story.\"\n\nAs we noted, most of the flashbacks shown on the first season were portrayals of the events as Hannah was describing them on her tapes. This means we were hearing (and seeing) her side of the story.\n\n\"She's not a reliable narrator and she didn't necessarily put everything on those tapes,\" Yorkey said. \"There's always more to the story.\"\n\nDylan Minnette stars as Clay Jensen on \"13 Reasons Why.\" Beth Dubber/Netflix\n\nNew characters are joining the cast\n\nWe'll see four new students — Nina, Mackenzie, Cyrus, and Chloe — who could have connections to both Hannah and the new dramas we'll see on the second season.\n\nThen there's Jackie, whose character is described as an advocate for victims of bullying. Another new adult in the mix will be the character of Sonya, a litigator who's likely part of the Bakers' lawsuit.\n\nLastly, there's the Liberty High School baseball coach, Rick, who we're guessing will be wrapped up in the new revelation of serial sexual abuse connected to the athletic departments.\n\n(For a full rundown of the new faces you'll see on the second season, read INSIDER's report here).\n\nBryce is one of the serial sexual assaulters at Liberty High School. Beth Dubber/Netflix\n\n\"13 Reasons Why\" returns with new episodes on May 18. We'll update this post with more news as it comes in, but in the meantime read our report on the new video warning message Netflix will play before each season.", "images": ["https://i.insider.com/5ae86474bd967119008b4658?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab3db68095b1173008b45a9?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab2c1754d8bb7082d8b45ca?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab2d896095b1157008b456c?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ae8676dbd967126078b4640?width=24&format=jpeg&auto=webp", "https://www.thisisinsider.com/13-reasons-why-every-new-season-2-plot-detail-and-casting-info-2018-3?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab3db2f095b1123008b45a7?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5ae8676dbd967126078b4640?width=600&format=jpeg&auto=webp", "https://static.businessinsider.com/image/5dcb04467eece574841c1922", "https://i.insider.com/5ab3d09a095b114e008b45b2?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab3d23d095b1121008b45c1?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ab3dedb095b112b008b45af?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ae86785bd967141008b4682?width=1200&format=jpeg"], "top_img": "https://i.insider.com/5ae86785bd967141008b4682?width=1200&format=jpeg", "keywords": [], "authors": ["Kim Renfro"], "canonical_link": "https://www.insider.com/13-reasons-why-every-new-season-2-plot-detail-and-casting-info-2018-3", "title": "'13 Reasons Why' season 2 returns to Netflix soon — here's everything we know about what fans can expect", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "'13 Reasons Why' season 2 returns to Netflix soon — here's everything we know about what fans can expect", "date": "2018-05-01", "news_keywords": "13 Reasons Why, Netflix, TV, 13 Reasons Why season 2, Kim Renfro", "description": "From the air date to new cast members and storylines, INSIDER has the scoop on the second season of Netflix's \"13 Reasons Why\" from showrunner Brian Yorkey.", "author": "Kim Renfro", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Culture", "og": {"title": "'13 Reasons Why' season 2 returns to Netflix soon — here's everything we know about what fans can expect", "description": "From the air date to new cast members and storylines, INSIDER has the scoop on the second season of Netflix's \"13 Reasons Why\" from showrunner Brian Yorkey.", "type": "article", "url": "https://www.insider.com/13-reasons-why-every-new-season-2-plot-detail-and-casting-info-2018-3", "image": "https://i.insider.com/5ae86785bd967141008b4682?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "'13 Reasons Why' season 2 returns to Netflix soon — here's everything we know about what fans can expect", "sailthru.date": "2018-05-01", "sailthru.tags": "13 Reasons Why, Netflix, TV, 13 Reasons Why season 2, Kim Renfro", "sailthru.description": "From the air date to new cast members and storylines, INSIDER has the scoop on the second season of Netflix's \"13 Reasons Why\" from showrunner Brian Yorkey.", "sailthru.author": "Kim Renfro", "sailthru.verticals": "culture", "sailthru.image.full": "https://i.insider.com/5ae8676dbd967126078b4640?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5ae8676dbd967126078b4640?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "'13 Reasons Why' season 2 returns to Netflix soon — here's everything we know about what fans can expect": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 250, "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "control", "subscribe-smallest-price": "variant"}, "viking-id": "5ab3ae89095b1123008b4575", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1525104000.0, "source": "https://www.thisisinsider.com", "summary": ""}