{"url": "https://people.com/movies/sandra-bullock-afraid-harvey-weinstein-really-scared-women-spoke-out/", "text": "Sandra Bullock never had a bad experience with Harvey Weinstein, but she knew of his alleged reputation for mistreating women.\n\n“I heard about Harvey and I was afraid of him,” the Oscar winner, 53, told The Sunday Times. “I wasn’t asked to be in that world. I learnt early on to shut things off so those things didn’t come my way.”\n\nGet push notifications with news, features and more.\n\nShe added, “I only heard what Harvey wanted people to hear, and that made me so f—— angry. People would say, ‘Well, you know how she got that role? She f—– Harvey.’ I would say, ‘Shut the f— up. You don’t know that.’ Then, later, to find out that woman was brutally attacked … They didn’t sleep with Harvey. Harvey wanted you to think that.”\n\nWeinstein’s attorney Benjamin Brafman responded to the actress’s comments with a statement: “By her own admission, Harvey Weinstein never had an unpleasant interaction with Sandra Bullock. Indeed, from a review of her correspondence with Mr. Weinstein, it would appear that she had a warm pleasant relationship with him and even his daughter going back many years. Accordingly, with all due respect to Ms Bullock, it is not right for her to take unproven ‘allegations’ and republicize them in an effort to deprive Mr Weinstein of due process and possibly a fair trial that every citizen in this great country is entitled to. In America, the presumption of ‘innocence’ is supposed to have meaning. When piling on becomes the norm simply because it seems to be the politically correct or fashionable thing to do, we all lose, including Ms Bullock.”\n\n\n\nA spokesperson for Weinstein, who has been accused of sexual misconduct by over 60 women, previously told PEOPLE in a statement that “any allegations of non-consensual sex are unequivocally denied by Mr. Weinstein. Mr. Weinstein has further confirmed that there were never any acts of retaliation against any women for refusing his advances.”\n\nAfter women began speaking out about their alleged experiences with Weinstein, Bullock said she became “really, really scared” about the consequences these “brave people” might suffer for coming forward.\n\nImage zoom Sandra Bullock. Dave Benett/WireImage\n\n“I was like, ‘Oh my God, this is amazing, but f—, f—, f—, what if it doesn’t work? Please God, let it not swing the other way.’ We’re in such uncharted territory right now. I’ve seen a lot of fear and a lot of men of a certain generation not understanding,” she said.\n\n“I saw a tremendous amount of fear from men on set,” she continued, without naming any specific movie. “In the end, I said, ‘I know you’re scared, but I feel safe, so you can make some jokes now. But if you cross the line, I will f— you up.’ ”\n\nBullock said that earlier in her career she had used her humor to deflect unwanted advances. “That’s how I’ve always navigated tricky situations. That’s how I’ve survived. Because very early on in my career I had a situation on a film, which was hard. It came from a person of authority. I kept deflecting it with humor and it didn’t work. Finally, I said, ‘Please just fire me.’ ”\n\nShe did not name the person of authority or the film in question.\n\nRELATED: Movie Mogul Harvey Weinstein Surrenders to Authorities on Rape Charges\n\n“It was a lesson. After that, I tended to remove anything that could be misconstrued as sexual. I locked it down,” she explained.\n\nMeanwhile, Weinstein pleaded not guilty earlier this month to multiple sexual assault charges — including rape — brought against him in New York City. The criminal sex act charge is in connection with an alleged 2004 sexual assault on aspiring actress Lucia Evans, police sources previously confirmed to PEOPLE. (Evans has agreed to be publicly named).\n\nWeinstein is scheduled to return to court on Sept. 22 for a hearing on motions in his case, according to N.Y.C. prosecutors.\n\nHis lawyer Benjamin Brafman said in a statement last week that he was not surprised by the indictment, noting that it “does not add anything to the case we did not already know.”\n\n“Mr. Weinstein intends to … vigorously defend against these unsupported allegations that he strongly denies,” Brafman said. “We will soon formally move to dismiss the indictment and if this case actually proceeds to trial, we expect Mr. Weinstein to be acquitted.”\n\nBullock’s new film, the female-driven Ocean’s 8, is in theaters now.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1494&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1494&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg", "keywords": [], "authors": ["Mike Miller"], "canonical_link": "https://people.com/movies/sandra-bullock-afraid-harvey-weinstein-really-scared-women-spoke-out/", "title": "Sandra Bullock Was 'Afraid' of Harvey Weinstein and 'Really, Really Scared' When Women Spoke Out", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Harvey Weinstein,Movie Celebrities,Movie News,News,Sandra Bullock", "news_keywords": "Harvey Weinstein,Movie Celebrities,Movie News,News,Sandra Bullock", "description": "\"I wasn't asked to be in that world. I learnt early on to shut things off so those things didn't come my way,\" she added.", "og": {"title": "Sandra Bullock Was 'Afraid' of Harvey Weinstein and 'Really, Really Scared' When Women Spoke Out", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/sandra-bullock-afraid-harvey-weinstein-really-scared-women-spoke-out/", "description": "Sandra Bullock never had a bad experience with Harvey Weinstein, but she knew of his alleged reputation for mistreating women. “I heard about Harvey and&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1494&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg", "width": 1494, "height": 782}}, "pinterest": {"url": "https://people.com/movies/sandra-bullock-afraid-harvey-weinstein-really-scared-women-spoke-out/", "description": "\"I wasn't asked to be in that world. I learnt early on to shut things off so those things didn't come my way,\" she added.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/sandra-bullock-afraid-harvey-weinstein-really-scared-women-spoke-out/", "title": "Sandra Bullock Was 'Afraid' of Harvey Weinstein and 'Really, Really Scared' When Women Spoke Out", "description": "\"I wasn't asked to be in that world. I learnt early on to shut things off so those things didn't come my way,\" she added.", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1494&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fsandra-bullock2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}