{"url": "www.bustle.com/p/are-taylor-swift-tom-hiddleston-still-friends-it-sounds-like-their-split-was-amicable-54392", "text": "The Met Gala is a special time when every celebrity under the sun puts on a extravagant gown, looks fabulous, and talks about how fabulous their fellow celebs look, too. While I love checking out the themed fashion, there are often events outside of the clothes that make the event memorable. Remember elevatorgate? Yep, that happened after the 2014 Met Gala. At the 2016 event, Taylor Swift and Tom Hiddleston spent the night dancing together, and a summer fling followed that set the internet on fire. Now that a year has passed since that night of dancing, I wonder: Are Swift and Hiddleston still friends?\n\nBefore we get to that, let's do a quick recap of the history of their romance. According to Hiddleston, in an interview with the Press Association, he and Swift were seated at the same table during the 2016 Met Ball. She was there sans her boyfriend at the time, Calvin Harris, but asked Hiddleston for a friendly dance, which was eventually recorded and spread around the internet. About a month following the Met Gala, Harris and Swift announced their breakup. Then, in mid-June, photos of Hiddleston and Swift cuddling on a beach in Rhode Island were released and fans went wild.\n\nAfter a whirlwind summer that included travels all over the world, Hiddles and Swift broke up around Labor Day 2016, the timing which was pretty much the textbook definition of a summer romance.\n\nNow that it's been several months, what is Swift and Hiddleston's status? Based on what Hiddleston has shared about their romance, it sounds like there are fond memories and that they are still friendly, but not incredibly close, which is understandable.\n\nIn February 2017, Hiddleston opened up about Swift in a GQ profile. His first comment on her was just overwhelmingly sweet and he said,\n\n“Taylor is an amazing woman. She’s generous and kind and lovely, and we had the best time. Of course it was real.”\n\nLater in the interview he also explained that now-infamous 'I Love T.S.' tank top that he was spotted wearing during her annual Fourth of July party. Hiddleston continued on the subject of Swift,\n\n“I only know the woman I met. She’s incredible. A relationship in the limelight… A relationship always takes work. A relationship in the limelight takes work. And it’s not just the limelight. It’s everything else.\"\n\nWhile Hiddleston has sung Swift's praises post-breakup, she has kept very mum about their relationship and, well, everything. She hasn't explicitly commented on Hiddleston, so it's tough to know if they're actual friends or not. Hiddleston was spotted at an event with Ed Sheeran in early March 2017, which could hint that there is no \"bad blood\" in the friend group, considering Sheeran and Swift are very close.\n\nIt is tough to tell, but Hiddleston and Swift seem to have had an amicable breakup. I just wouldn't hang on to any hope for a reconciliation anytime soon.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/524f5e1d-2c9d-4f80-9ca8-84c34bffd783-getty-451431999.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/7f8de711-e6d7-41da-9b99-1bdb99d96a9f-getty-1187273504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/4/28/527571204.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0301616f-a32f-413e-9fef-efe48242f292-getty-537759406.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/4/28/527571204.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/2017/4/28/527571204.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/are-taylor-swift-tom-hiddleston-still-friends-it-sounds-like-their-split-was-amicable-54392", "title": "Are Taylor Swift & Tom Hiddleston Still Friends? It Sounds Like Their Split Was Amicable", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/are-taylor-swift-tom-hiddleston-still-friends-it-sounds-like-their-split-was-amicable-54392", "type": "article", "title": "Are T. Swift & T. Hiddles Still Friends These Days?", "description": "The Met Gala is a special time when every celebrity under the sun puts on a extravagant gown, looks fabulous, and talks about how fabulous their fellow celebs look, too. While I love checking out the themed fashion, there are often events outside of…", "image": {"identifier": "https://imgix.bustle.com/2017/4/28/527571204.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The Met Gala is a special time when every celebrity under the sun puts on a extravagant gown, looks fabulous, and talks about how fabulous their fellow celebs look, too. While I love checking out the themed fashion, there are often events outside of…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}