{"url": "https://www.bbc.com/news/entertainment-arts-18076207", "text": "Image caption Spears (right) has signed up as a judge on the US version of X Factor\n\nBritney Spears was the all-American pop princess who shot to superstardom in her teens before a very public breakdown. Now, her appointment as a judge on the US X Factor represents a full return to the media spotlight.\n\nThe most stark illustration of how far Britney Spears had fallen came on 16 February 2007 when, after she spent just 24 hours in a rehabilitation clinic, the paparazzi tracked her down to a Los Angeles tattoo parlour - and discovered she was completely bald.\n\nThe act of shaving her head was a clear rejection of her former persona and of her life as a pop starlet in the public gaze.\n\nHer meltdown came after eight years as the archetypal modern pop starlet - \"Miss American Dream since I was 17,\" as she put it in her 2007 single Piece of Me.\n\nImage caption Spears achieved overnight success with her debut single in 1998\n\nShe found sudden fame as the blonde girl with pigtails and a school uniform in the video of her debut single ...Baby One More Time, a massive global hit.\n\nHer first taste of the spotlight had come as one of the young cast of Disney's TV show All New Mickey Mouse Club alongside Christina Aguilera and Justin Timberlake in 1994.\n\nAfter her solo breakthrough, she became a fixture in the charts and in the gossip columns, but carefully cultivated a squeaky-clean image.\n\nShe had a three-year relationship with fellow Mouseketeer and pop star Justin Timberlake, but they split in 2002, with Timberlake's single Cry Me A River apparently an angry kiss-off to his former partner.\n\nSpears focused on her career, ditching her songwriting team to work with stars such as R Kelly and Moby on her fourth album In The Zone in 2003.\n\nShe also courted the tabloids at the 2003 MTV Awards, where she locked lips with Madonna during a risque performance of Like A Virgin.\n\nImage caption Madonna and Britney also collaborated on the single Me Against The Music\n\nBut perhaps more controversial was her union with childhood friend Jason Alexander, who she wed in a Las Vegas wedding chapel in January 2004.\n\nThe marriage was annulled after 55 hours, with Spears later explaining: \"I really wanted to see what it was like to be married.\"\n\nIn July the same year she got engaged to her backing dancer Kevin Federline, just three months after meeting him.\n\nImage caption Spears and Federline were married for just over two years\n\nThe couple tied the knot in September 2004 and the couple had two children.\n\nBut they divorced in 2006 and many fans, who had barely concealed their contempt for Federline, thought the split would mark a re-birth for Spears - whose recording career had been on hold since the marriage.\n\nIt was not to be.\n\nSpears' behaviour became more erratic and she embarked on a prolonged period of partying with other young celebrities, including heiress Paris Hilton.\n\nShortly before her divorce, Spears gave a rambling television interview, in which she tearfully proclaimed her marriage \"awesome\" and blamed the media for making her an \"emotional wreck\".\n\nThe shaved head shocked her fans and Spears went back into rehab, this time staying for a month.\n\nImage caption Spears shaved her own head with a set of clippers while onlookers watched through the window of a Los Angeles tattoo parlour\n\nWhen she attempted a live comeback, performing at the MTV Video Music Awards in 2007, she stumbled through a lip-synced performance and was universally panned.\n\nAs Green Day singer Billie Joe Armstrong put it at the time, it was like \"watching a public execution\".\n\nHer personal life was in chaos. After a 10-month custody battle, Federline won sole custody of the couple's children Sean Preston and Jayden James.\n\nImage caption The star has been criticised for lip-syncing at her concerts\n\nSpears' parenting skills were called into question when a judge in Los Angeles ordered her to undergo drug and alcohol tests twice a week.\n\nA former bodyguard claimed the singer was a danger to her children. She was charged with hit-and-run after an incident in an LA car park, and was dropped by her management company.\n\nHer parents blamed manager Sam Lutfi, whom they accused of controlling their daughter's life by drugging her and taking control of her finances. He has denied the claims.\n\nDespite the MTV incident, she continued to win musical plaudits. Her fifth album Blackout, largely created by a crack team of pop producers, was sonically adventurous and a hit with fans.\n\nThe turning point in her personal life is regarded as coming the following year, when her father Jamie took control over decisions regarding her personal life, including food, clothing and medical care and finances.\n\nRestraining orders were obtained against Lutfi and Spears' ex-boyfriend Adnan Ghalib and her former manager Larry Rudolph was reinstated.\n\nImage caption In 2011, MTV presented Spears with the Video Vanguard award, its equivalent of a lifetime achievement prize\n\nHer next album, Circus, included the track Womanizer, which became her first US number one single since ...Baby One More Time and an accompanying world tour earned $131m (£82m).\n\nDespite a private and public rehabilitation, at the end of 2010, her lawyers failed to overturn the ruling that gave her father full control over her affairs.\n\nBut this April, her fiance and former agent Jason Trawick became her joint guardian - with her father's blessing.\n\nNow 30, the X Factor deal should provide an opportunity for the star to show that she has put her troubled past behind her.", "images": ["https://ichef.bbci.co.uk/news/320/media/images/60254000/jpg/_60254079_014749779-1.jpg", "https://ichef.bbci.co.uk/news/1024/media/images/60254000/jpg/_60254079_014749779-1.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.18076207.page&x1=[urn:bbc:cps:64d53f56-4e5c-ba45-8e76-af09fb5bf68e]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]"], "top_img": "https://ichef.bbci.co.uk/news/1024/media/images/60254000/jpg/_60254079_014749779-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-18076207", "title": "Britney comes back from the brink", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "A look at the ups and downs of pop star Britney Spears' career, as she signs up as a judge on the US edition of X Factor.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "og": {"title": "Britney comes back from the brink", "type": "article", "description": "A look at the ups and downs of pop star Britney Spears' career, as she signs up as a judge on the US edition of X Factor.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-18076207", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/media/images/60254000/jpg/_60254079_014749779-1.jpg", "alt": "BBC News. Britney Spears"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Britney comes back from the brink", "description": "A look at the ups and downs of pop star Britney Spears' career, as she signs up as a judge on the US edition of X Factor.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/media/images/60254000/jpg/_60254079_014749779-1.jpg", "alt": "Britney Spears"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-18076207?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}