{"url": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-and-angelina-jolie-a-timeline-of-their-relationship-w441148/", "text": "The end of an era. Angelina Jolie Pitt and Brad Pitt have split after 12 years as a couple and two years of marriage. Relive their love story in the video above.\n\n“Angelina Jolie Pitt has filed for dissolution of the marriage,” Jolie Pitt’s rep said in a statement to Us Weekly on Tuesday, September 20. “This decision was made for the health of the family.”\n\nFrom falling in love on the Mr. and Mrs. Smith set in 2004 to Brangelina’s top-secret France wedding in 2014, see the full timeline of Pitt and Jolie Pitt’s relationship through the years.\n\n2004\n\nBrad and Angelina met while costarring as married assassins in Mr. and Mrs. Smith. Speculation started that the pair were hooking up on set, but both denied reports of a romance. At the time, Pitt was married to Jennifer Aniston, while Jolie Pitt had just finalized her divorce from Billy Bob Thornton in 2003.\n\nJanuary 2005\n\nAniston and Pitt announced their separation after five years of marriage, while rumors about Pitt and Jolie Pitt’s romantic status continued to make rounds.\n\nMarch 2005\n\nThe Friends alum officially filed for divorce from the Fight Club actor, citing “irreconcilable differences.”\n\nApril 2005\n\nUs Weekly exclusively published photos that confirmed Brangelina was official. In the famous photos from the couple’s Kenya vacation, the Troy actor played with Jolie Pitt’s son Maddox in the sand. “Maddox would hang out with Brad and followed him wherever he went. It was clear that Brad and Maddox had a close relationship — they were joking around together,” an onlooker told Us at the time. “[Brad and Angelina] wrapped their arms around each other [at the pool] and shared a long, passionate kiss.” Even after the images surfaced, both stars’ reps denied they were in a relationship.\n\nJuly 2005\n\nThe two were featured in a spread in W magazine’s July issue titled Domestic Bliss, in which they were were portrayed as a happy 1960s family with children. Apparently, the spread was Pitt’s idea and the photos were taken in March. Aniston slammed the spread in a Vanity Fair interview, saying,“There’s a sensitivity chip that’s missing.” The Office Space actress also revealed she was unaware of Pitt’s Africa vacation, saying, “The world was shocked and I was shocked.”\n\nThat same month, Jolie Pitt adopted daughter Zahara from Ethiopia.\n\nJanuary 2006\n\nA baby on the way. Jolie Pitt confirmed that she was pregnant with her first biological child with Pitt, just three months after he finalized his divorce from Aniston in October 2005. The Oscar-winning actor also filed to legally adopt Jolie’s two children, Maddox and Zahara, and the kids’ last names were changed to Jolie-Pitt.\n\nMay 2006\n\nThe Lara Croft actress welcomed her first biological child, Shiloh, with Pitt in Namibia. At a press conference she explained her decision to give birth in Africa, “When we found out we were pregnant and thinking about where we would want to go, we thought we wanted to find a place that was a beautiful place that our other children would enjoy. And they have, they’d had an amazing adventure. Also we just love this part of the world; our other daughter was born in Africa and so this is a special continent for us.”\n\nDecember 2006\n\nBrangelina make their red carpet debut as a couple at the premiere of The Good Shepherd.\n\nMarch 2007\n\nJolie Pitt traveled to Vietnam to adopt a son Pax. Since the country makes it extremely difficult for unmarried couples to adopt, Jolie Pitt applied as a single parent. Pax became part of the family with Pitt, and they legally changed his last name to Jolie-Pitt.\n\nJuly 2008\n\nA growing brood. The couple welcomed twins Knox and Vivienne in Nice, France. “It did shock us, and we jumped to six [children] quickly. But we like a challenge,” Jolie Pitt said to Entertainment Weekly.\n\nNovember 2008\n\nJolie Pitt finally admitted that sparks were flying on the Mr. and Mrs. Smith set. “Not a lot of people get to see a movie where their parents fell in love,” she told The New York Times about showing the movie to their children.\n\nApril 2012\n\nWedding bells are ringing! At long last, Pitt popped the question. The actor’s manager told the Associated Press, “Yes, it’s confirmed. It is a promise for the future and their kids are very happy. There’s no date set at this time. Brad designed the ring.” The couple had previously declared that they wouldn’t marry until gay marriage was legalized nationwide, but Pitt revealed that they changed their minds for their children’s sake.\n\nAugust 2014\n\nThey’re married! The couple secretly tied the knot at Chateau Miraval in France on August 23. The bride wore a dress and veil covered in the children’s multicolor scribbles. The kids all had special roles in the wedding: Maddox and Pax walked Jolie Pitt down the aisle, Zahara and Vivienne threw petals, and Shiloh and Knox were the ring bearers. The pair honeymooned in Malta with their kids, where they also filmed By the Sea, their first movie project together since Mr. and Mrs. Smith.\n\nNovember 2015\n\nPitt and Jolie Pitt attended several red carpet events for By the Sea. Despite playing an abusive couple in a turbulent marriage, the pair looked totally in love while promoting the film.\n\nJune 2016\n\nUs Weekly was first to report trouble in paradise. The pair disagreed over whether to sell their Chateau Miraval estate in Correns, France. Pitt wanted to hold on to the property, while Jolie wanted to sell it as she was “ramping up her efforts in the political world.”\n\nAugust 2016\n\nDespite tension, the duo celebrated their second wedding anniversary with a low-key date night at the Beverly Hills Hotel in Los Angeles, Us Weekly exclusively revealed. “It was just the two of them. They had dinner and spent the night, and that was it,” a source told Us at the time. “They want to keep the love alive.”\n\nSeptember 2016\n\nJolie Pitt filed for divorce from Pitt, citing irreconcilable differences. She requested physical custody of their six children and asked that Pitt only receive joint legal custody. She did not ask for spousal support. Find out more about what went wrong here.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/uploads/u534-us-weekly-cover-angelina-jolie-brad-pitt-maddox-zoom-53236170-fb6f-46fb-b10f-6b49d9ed7762.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-1e1a9593-5887-4780-b884-63cd35bc2f1b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/mcdmian_fe003_h_mr-and-mrs-smith-angelina-jolie-brad-pitt-zoom-7544db8a-d028-43ed-a506-e50d3fa3b9e1.jpg", "https://www.usmagazine.com/wp-content/uploads/467950672_angelina-jolie-zahara-shiloh-zoom-80343856-aa3c-49ff-9bae-78bd4bd8e5ec.jpg", "https://www.usmagazine.com/wp-content/uploads/72802479_angelina-jolie-brad-pitt-zoom-84897386-a91d-42cb-a3dd-34354889791f.jpg", "https://www.usmagazine.com/wp-content/uploads/angelina-jolie-brad-pitt-hello-magazine-cover-zoom-f2048632-725f-4b62-b208-e8c337a87d80.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-d532b9ca-5116-454f-949e-91f9a611fc26.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-1e1a9593-5887-4780-b884-63cd35bc2f1b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Megan French"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-and-angelina-jolie-a-timeline-of-their-relationship-w441148/", "title": "Brad Pitt and Angelina Jolie: A Timeline of Their Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Here’s a full timeline of Brad Pitt and Angelina’s Jolie relationship from their 'Mr. and Mrs. Smith' days to their divorce filing — relive their relationship here", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt and Angelina Jolie: A Timeline of Their Relationship", "description": "Here’s a full timeline of Brad Pitt and Angelina’s Jolie relationship from their 'Mr. and Mrs. Smith' days to their divorce filing — relive their relationship here", "url": "https://www.usmagazine.com/celebrity-news/news/brad-pitt-and-angelina-jolie-a-timeline-of-their-relationship-w441148/", "site_name": "Us Weekly", "updated_time": "2018-02-08T23:43:08+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-1e1a9593-5887-4780-b884-63cd35bc2f1b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630&ssl=1", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-1e1a9593-5887-4780-b884-63cd35bc2f1b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Video", "section": "Celebrity News", "published_time": "2016-09-20T19:41:00+00:00", "modified_time": "2018-02-08T23:43:08+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Here’s a full timeline of Brad Pitt and Angelina’s Jolie relationship from their 'Mr. and Mrs. Smith' days to their divorce filing — relive their relationship here", "title": "Brad Pitt and Angelina Jolie: A Timeline of Their Relationship", "site": "@usweekly", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/496019950_angelina-jolie-brad-pitt-zoom-1e1a9593-5887-4780-b884-63cd35bc2f1b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1474400460.0, "source": "https://www.usmagazine.com", "summary": ""}