{"url": "https://en.wikipedia.org/wiki/Pitch_Perfect_2", "text": "Pitch Perfect 2 is a 2015 American musical comedy film directed and produced by Elizabeth Banks and written by Kay Cannon. It is a sequel to the 2012 film Pitch Perfect and the second installment in the Pitch Perfect film series. The film centers on the fictional Barden University Bellas, an all-female a cappella singing group, who try to beat out a competing German musical group in a world singing championship. The film features an ensemble cast, including Anna Kendrick, Rebel Wilson, Hailee Steinfeld, Brittany Snow, Hana Mae Lee, Alexis Knapp, Ester Dean, Chrissie Fit, Kelley Jakle, Shelley Regner, Katey Sagal, and Keegan-Michael Key as well as Skylar Astin, Ben Platt, Adam DeVine, Anna Camp, John Michael Higgins, and Banks all reprising their roles.\n\nIt was released in the United States on May 15, 2015 by Universal Pictures. The film received generally positive reviews from critics and grossed over $287 million worldwide. It surpassed the total gross of the original film ($115.4 million) in five days, and also became the highest-grossing music comedy film of all-time, overtaking School of Rock ($131.3 million).[5] A sequel, Pitch Perfect 3, was released on December 22, 2017.[6][7]\n\nPlot [ edit ]\n\nThree years after winning the previous competition, the Barden Bellas are now led by senior Beca Mitchell and three-time super senior Chloe Beale. The Bellas have become ICCA champions each of these three years. However, the group gets involved in a national scandal (dubbed \"Muffgate\") when Patricia \"Fat Amy\" Hobart accidentally rips her pants in front of U.S. President Barack Obama during a performance on his birthday at the Kennedy Center, showing her genitalia to the public as she did not wear her underwear. This scandal leads to the Bellas' suspension from the ICCAs. Beca makes a deal to allow the Bellas to be reinstated, should they win the World Championship of Acappella.\n\nFreshman Emily Junk begins her college career, hoping to follow in the footsteps of her mother, Katherine, by being a Bella. Katherine tells Emily she is more than junk and that she is in fact Pitch Perfect. At orientation, she watches an Acappella performance by the Treblemakers, now led by Beca's boyfriend Jesse Swanson. Benjamin \"Benji\" Applebaum, Jesse's best friend, overhears Emily, leading to a crush on her.\n\nThe Bellas learn that Das Sound Machine (DSM), a German powerhouse group, has replaced the Bellas on their victory tour. Additionally, Beca has started an internship at a recording studio, Residual Heat, something only Jesse knows.\n\nEmily goes to the Bellas' sorority house to audition for them because of their absence from the auditions. When she sings her unfinished song \"Flashlight,\" she succeeds in joining the Bellas.\n\nAt a car show where the ICCA winners are due to perform, the Bellas scout their replacements, DSM, led by intimidating duo Pieter Krämer and Kommissar, who take delight in mocking the all-girl group. Later, the Bellas are invited to an exclusive riff-off against DSM. Also in attendance are the Treblemakers and the Tone Hangers (a group of former Treblemakers, including former Treblemakers leader Bumper Allen, whom Amy is now dating), as well as a group calling themselves the Green Bay Packers. The Bellas make it to the final two, but end up losing to DSM in the final showdown after Emily nervously sing out \"Flashlight,\" which is an original song and is not from the right category (\"90's Hip-Hop Jamz\").\n\nThe next day at the warmups, the Bellas' chances of winning end in disaster when the performance sets Cynthia Rose Adams's hair on fire by pyrotechnics. Even before then, John and Gail question the Bellas' identity. As the Bellas' stage has grown bigger, the scale of their performance grew bigger as well. Their choreography (designed by Chloe) became more complex and difficult, and they added probs and acrobatics (done by Flo) to their performance too. In order to regain harmony and sync of their voice, Chloe takes them to a retreat led by former leader Aubrey Posen. Beca starts a heated debate with Chloe over herself being the only one thinking about life beyond the Bellas and Chloe's obsession with winning Worlds.\n\nTo prove to her boss that she can produce music well, Beca offers Emily to produce \"Flashlight\" at the studio. The group realizes that they will no longer be together and may go their separate ways after graduation, and regain harmony by singing \"Cups (When I'm Gone)\" (the very song that got Beca into the Bellas in the first movie). Amy confesses that she broke up with Bumper, and the next day, she goes to apologize to Bumper by standing on a canoe and paddling across the lake to him while singing \"We Belong.\" Hurt, Bumper initially tries to turn Amy away, but as the song progresses, he forgives her, and they reconcile. At the studio, Emily and Beca present their song to Beca's boss, in which he demonstrates envy for their talent and looks forward to producing with them.\n\nThe senior Bellas graduate and they all head off to Copenhagen for the World Finals, with Jesse and Benji to cheer them on. They perform a harmonized version of \"Flashlight\" with Aubrey, Katherine, and other past Bellas joining in. The Bellas win the championship and repair their damaged legacy. As the senior Bellas leave Barden, they give Emily a belated proper initiation with Fat Amy showing her how to do the last tradition: christening the house by sliding down the staircase.\n\nIn a mid-credits scene, Bumper performs \"All of Me\" on The Voice, chooses Christina Aguilera as his coach and makes her uncomfortable when he gives her an oddly lengthy hug.\n\nCast [ edit ]\n\nThe Barden Bellas [ edit ]\n\nAdditional characters [ edit ]\n\nGreen Bay Packers players Clay Matthews, David Bakhtiari, Don Barclay, Josh Sitton and T.J. Lang play themselves in cameos. Also appearing as themselves are Snoop Dogg, Natalie Morales, Jake Tapper, Joe Scarborough, Mika Brzezinski, Jimmy Kimmel, Rosie O'Donnell, Rosie Perez, Nicolle Wallace, Jordan Rodgers, Christina Aguilera, Adam Levine, Blake Shelton and Pharrell Williams. Robin Roberts, C.J. Perry and Kether Donohue appear as Legacy Bellas during the finale. Additionally, President Barack Obama, First Lady Michelle Obama and Shonda Rhimes briefly appear via archive footage.\n\nProduction [ edit ]\n\nIn December 2012, Skylar Astin revealed that he and Rebel Wilson have had meetings with Universal Studios about the potential sequel.[8] In April 2013, it was confirmed that a sequel would be released in 2015.[9] Elizabeth Banks directed the sequel, and Kay Cannon returned as screenwriter.[10] Paul Brooks produced for Gold Circle Films with Banks and Max Handelman producing for Brownstone Productions.[10] Deke Sharon returned as vocal producer, and has a brief cameo as a German reporter.[11] As in the first movie, they ran a month of \"a cappella boot camp\" before filming.[12]\n\nCasting [ edit ]\n\nAnna Kendrick and Wilson returned to the cast early in 2014 to play the characters they originated in the first film.[13] Brittany Snow reprised her character.[14] On April 24, Chrissie Fit was added to the cast.[15] On May 1, Hailee Steinfeld was added to the cast, playing a new member of the Barden Bellas.[16] On May 5, Adam DeVine was reported to return in the film.[17] On May 14, Katey Sagal was added to the cast, playing Steinfeld's character's mother.[18] On May 29, Flula Borg was added to the cast,[19] playing the leader of Das Sound Machine.[20] It was confirmed on June 18, 2014 that Christopher Shepard was added to the cast.[21] It was confirmed on June 19, 2014 that Pentatonix would play the role of a rival group to the Barden Bellas.[22] It was later confirmed that The Filharmonic from season 4 of The Sing Off would make a cameo appearance as a rival group from the Philippines.[23] On August 24, 2014 it was announced that Penn Masala,[24] the all-male Hindi a cappella group from director Elizabeth Banks's and producer Max Handelman's alma mater The University of Pennsylvania, would be featured as a team from Southeast Asia.[25] On June 25, Birgitte Hjort Sørensen was confirmed added to the cast.[26]\n\nFilming [ edit ]\n\nOn May 21, 2014, principal photography began at Louisiana State University (LSU) campus in Baton Rouge.[27]\n\nMusic [ edit ]\n\nOn December 3, 2014, Mark Mothersbaugh was hired to compose the music for the film.[28] The official soundtrack was released on May 12, 2015.[29] The special edition soundtrack was later released on August 8, 2015.[30]\n\nThe original album debuted at number one on the Billboard 200, earning 107,000 album-equivalent units (92,000 copies of traditional sales) in the week ending May 17, 2015.[31]\n\nWeekly charts\n\nYear-end charts\n\nChart (2015) Position Australian Albums (ARIA)[44] 27 US Billboard 200[45] 52\n\nRelease [ edit ]\n\nThe film was released on May 7, 2015 in Australia and New Zealand, and May 15 in the United States and Canada.[46]\n\nMarketing [ edit ]\n\nA still from the rehearsals for the film was revealed on May 16, 2014.[47] The poster was released on November 18, 2014 and the trailer came out the following day. A second trailer was aired during Super Bowl XLIX on February 1, 2015.[48]\n\nHome media [ edit ]\n\nDirector Elizabeth Banks stated an additional performance by the Treblemakers was filmed specifically for the DVD release. Also included on the DVD will be deleted scenes.[49] On May 20, 2015, it was announced that FX Networks had acquired U.S. television broadcasting rights to the film.[50]\n\nThe Blu-ray and DVD editions of Pitch Perfect 2 were released on September 22, 2015 in the U.S.[51] with a Target-exclusive edition containing additional bonus features being released the same day.[52] Pitch Perfect 2 was released on 4K UHD Blu-Ray on March 10, 2018.[53]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nPitch Perfect 2 grossed $184.2 million in North America and $103.2 million in other territories for a worldwide total of $287.5 million, against an estimated gross production budget of $29[2][4]-31 million, and the film was offered up to $8.9 million in production incentives and write-offs by the state of Louisiana.[3] In its first five days, the film surpassed the total gross of the original ($115.4 million), and also overtook School of Rock ($131.3 million) for the highest grossing musical-comedy of all-time and the second greatest musical debut ever (behind Beauty and the Beast's $174.8 million in 2017).[5] Deadline Hollywood calculated the net profit of the film to be $139.6 million, when factoring together all expenses and revenues for the film.[54]\n\nIn the United States and Canada, Pitch Perfect 2 grossed $4.6 million from Thursday night showings and $27.8 million on its opening day, increasing the opening weekend projections from $40 million to $64 million.[55] In its opening weekend, the film grossed $69.2 million, finishing first at the box office.[56] The opening weekend gross was more than the entire North American total gross of the first film ($65 million), is the third biggest PG-13 comedy opening of all-time (behind The Simpsons Movie's $74 million in 2007 and Austin Powers in Goldmember's $73 million in 2002) and the highest grossing opening ever for a musical.[57]\n\nOutside North America, the film opened at number one in Australia and New Zealand, earning $7.6 million and $1.2 million respectively.[58]\n\nCritical response [ edit ]\n\nOn Rotten Tomatoes, the film holds an approval rating of 66% based on 211 reviews, with an average rating of 6.02/10. The site's critical consensus reads, \"Pitch Perfect 2 sings in sweet comedic harmony, even if it doesn't hit quite as many high notes as its predecessor.\"[59] On Metacritic, the film holds average rating score of 63 out of 100, based on 39 critics, indicating \"generally favorable reviews\".[60] Audiences polled by CinemaScore during the opening weekend, gave the film an average grade of \"A–\" on an A+ to F scale.[61]\n\nAccolades [ edit ]\n\nBillboard Music Awards [ edit ]\n\n2016 Top Soundtrack (won)\n\nTeen Choice Awards [ edit ]\n\nPeople's Choice Awards [ edit ]\n\nKids Choice Awards [ edit ]\n\nFavorite Movie (lost to Star Wars: The Force Awakens )\n\n) Favorite Movie Actress (Anna Kendrick, Rebel Wilson, lost to Jennifer Lawrence)\n\nMTV Movie Awards [ edit ]\n\nGolden Raspberry Awards [ edit ]\n\nSequel [ edit ]\n\nOn April 11, 2015, a month before the release of Pitch Perfect 2, it was announced that Rebel Wilson would return for a third film, although she stated that she did not know if Anna Kendrick or any of the other cast members would also be reprising their roles. She added that she would be \"up for a Fat Amy spin-off,\" although nothing had yet been confirmed.[63] Director, star, and producer Elizabeth Banks acknowledged the possibility of a third film, saying, \"I will say, it would be disingenuous to say that no one's talking about a Pitch Perfect 3; the possibility of it. We are really focused on getting as many butts in seats for this one. If fans embrace it, we are going to seriously think about what the continuing journey would look like, but we don’t know what that is yet\".[64]\n\nOn June 10, 2015, a third film was officially confirmed, with Kay Cannon returning to write the script.[65] Several days later it was announced both Kendrick and Wilson would reprise their roles, and later Brittany Snow was also confirmed to return.[6] Banks returned to produce, but in June 2016 it was announced she would not be directing the film.[66]\n\nThe film was originally slated for a July 21, 2017 release, and was later pushed back to August 4, 2017 before moving back to the July 21 slot.[7] In May 2016 it was moved again, this time being pushed back to December 22, 2017.[67]", "images": ["https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pitch_Perfect_2", "title": "Pitch Perfect 2", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}