{"url": "people.com/tv/inside-brody-jenner-caitlyn-jenner-complicated-relationship/", "text": "Brody Jenner‘s relationship with his father Caitlyn Jenner hasn’t always been an easy one to navigate.\n\nOn Wednesday, PEOPLE confirmed Caitlyn will not attend her son’s upcoming wedding to fiancée Kaitlynn Carter.\n\nGet push notifications with news, features and more.\n\nCaitlyn, 68, “has work commitments that have been set up for months and couldn’t be changed in the end,” a source told PEOPLE.\n\nNevertheless, the source said “everything is good” between the two, adding that Caitlyn “will be throwing a big party for them when the newlyweds return to town.”\n\nAnd while there’s no bad blood over the wedding, Brody and Caitlyn haven’t always had such a smooth relationship.\n\nImage zoom Caitlyn Jenner and Brody Jenner Earl Gibson III/Getty\n\nA Rocky Childhood\n\nCaitlyn has long acknowledged that she was an absent father to her four oldest children Cassandra, Burt, Brandon and Brody.\n\nWhile the older Jenner children were not regulars on Keeping Up with the Kardashians, Brody did open up about his strained relationship with his father on the show in 2013.\n\n(Caitlyn went by Bruce before transitioning in 2015. She now goes by Caitlyn and uses female pronouns.)\n\n“I think Bruce is an incredible human being and I think that Bruce is a great father, he just wasn’t a great father to me,” he said.\n\nBrody said Caitlyn and his mother Linda Thompson had a “messy divorce” when he was young, which created tension in the family.\n\n“I grew up with my stepdad,” said Brody, referring to David Foster. “Bruce was never around. I can’t tell you how many birthdays went by where Bruce wasn’t there. I resent him for that.”\n\nBrody’s strained relationship with Caitlyn also caused a rift in his bond with sisters Kendall and Kylie. A source tells PEOPLE that Brody was “never close” with his step-siblings, Kourtney, Kim, Khloe and Rob Kardashian after Caitlyn married Kris Jenner.\n\n“He didn’t spend a lot of time with his dad when his dad married Kris, so he didn’t see them as much,” the sources says.\n\nAnd while Brody spent time with Kendall and Kylie when they were younger, they’ve grown apart.\n\n“As much as they love them, they’re not close,” the source adds. “It’s unfortunate.”\n\nUnderstanding Caitlyn’s Transition\n\nBefore transitioning, Caitlyn battled depression and identity issues, which caused her to pull away from her family.\n\n“The big, formative years for them, I was really struggling with those issues [of gender identity],” she said during a 20/20 interview with Diane Sawyer in 2015.\n\nStill, she takes full responsibility for not being there for her kids.\n\n“There’s no excuse for not being a good parent, no matter how many problems that you have,” Jenner told ABC in 2017. “No excuse for that.”\n\nAnd the former Hills star has remained supportive of Caitlyn‘s transition.\n\n“The first thing I thought was just like, ‘It finally makes sense,'” Brody told ABC in 2017.\n\nIn fact, Brody said he actually prefers Caitlyn over Bruce.\n\nImage zoom John M. Heller/Getty Images;\n\n“I’ve known Bruce for a long time and I didn’t really get along with Bruce,” he said. “Caitlyn and I get along a little more, because Caitlyn is actually who she really is and she’s living her life finally now as the person she actually was.”\n\nBrody said he was able to start fresh with Caitlyn and let go of his resentment toward his father.\n\n“It’s like getting to know somebody – your dad – all over again, in a better way.”\n\nBrody’s siblings have expressed similar sentiments about their father’s transition.\n\n“In seeing him come out to me and explain his true self, I was more proud right then to carry the last name Jenner, to be a part of the family, than at any time before,” said Brandon.\n\nRebuilding a Relationship\n\nBoth Brody and Caitlyn have been making more of an effort to spend time together in recent years.\n\nIn 2016, Caitlyn spent Thanksgiving with Brody and his siblings.\n\n“Thanksgiving with family is the best. And mine keeps getting bigger,” she wrote. “I hope you all had a wonderful day with your families!”\n\nIn April, Caitlyn celebrated her future daughter-in-law at her bridal shower at the Santa Anita Park racetrack in Los Angeles.\n\n“Caitlyn and Linda both love Kaitlynn. They’re so happy for Brody,” a source tells PEOPLE. “Brody and Kaitlynn are just trying to focus on the positive and who is there to support them.”\n\nCaitlyn shared a photo from the bridal shower, writing how happy she was to attend.\n\n“Went to my first bridal shower,” Caitlyn captioned a photo of her and Carter, 29. “I had so much fun! PS so much better than Bachelor parties!”\n\n“I’m so happy you were there!!!” Carter commented on the post. “It meant a lot to me!!”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1677&h=878&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcaitlyn-jenner-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1677&h=878&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg", "keywords": [], "authors": ["Jodi Guglielmi"], "canonical_link": "https://people.com/tv/inside-brody-jenner-caitlyn-jenner-complicated-relationship/", "title": "How Brody Jenner and Dad Caitlyn Jenner Repaired Their Relationship After Her Transition", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brody Jenner,Caitlyn Jenner,Kardashians,Keeping Up with the Kardashians,News,TV", "news_keywords": "Brody Jenner,Caitlyn Jenner,Kardashians,Keeping Up with the Kardashians,News,TV", "description": "Here is a look back at Brody Jenner's complicated relationship with his father Caitlyn Jenner", "og": {"title": "How Brody Jenner and Dad Caitlyn Jenner Repaired Their Relationship After Her Transition", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/inside-brody-jenner-caitlyn-jenner-complicated-relationship/", "description": "Brody Jenner‘s relationship with his father Caitlyn Jenner hasn’t always been an easy one to navigate. On Wednesday, PEOPLE confirmed Caitlyn will not attend&nbsp;her son’s&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1677&h=878&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg", "width": 1677, "height": 878}}, "pinterest": {"url": "https://people.com/tv/inside-brody-jenner-caitlyn-jenner-complicated-relationship/", "description": "Here is a look back at Brody Jenner's complicated relationship with his father Caitlyn Jenner", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/inside-brody-jenner-caitlyn-jenner-complicated-relationship/", "title": "How Brody Jenner and Dad Caitlyn Jenner Repaired Their Relationship After Her Transition", "description": "Here is a look back at Brody Jenner's complicated relationship with his father Caitlyn Jenner", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1677&h=878&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fbrody-jenner.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/yuA1_ud0Nh4"], "publish_date": null, "source": "http://people.com", "summary": ""}