{"url": "https://web.archive.org/web/20080506120114/http://pol.moveon.org:80/mccain10/email.html?", "text": "10 things to know about McCain\n\nFor all the coverage this week of Senator John McCain's background, there are some important things you won't learn about him from the TV networks. His carefully crafted positive image relies on people not knowing this stuff—and you might be surprised by some of it.\n\nPlease check out the list below, and then forward it to your friends, family, and coworkers. We can't rely on the media to tell folks about the real John McCain—but if we all pass this along, we can reach as many people as CNN Headline News does on a good night.\n\nClick here to tell us how many people you can pass it on to—and to see our progress nationally:\n\nhttp://pol.moveon.org/mccain10/\n\n10 things you should know about John McCain (but probably don't):\n\nJohn McCain voted against establishing a national holiday in honor of Dr. Martin Luther King, Jr. Now he says his position has \"evolved,\" yet he's continued to oppose key civil rights laws.1 According to Bloomberg News, McCain is more hawkish than Bush on Iraq, Russia and China. Conservative columnist Pat Buchanan says McCain \"will make Cheney look like Gandhi.\"2 His reputation is built on his opposition to torture, but McCain voted against a bill to ban waterboarding, and then applauded President Bush for vetoing that ban.3\n\nMcCain opposes a woman's right to choose. He said, \"I do not support Roe versus Wade. It should be overturned.\"4 The Children's Defense Fund rated McCain as the worst senator in Congress for children. He voted against the children's health care bill last year, then defended Bush's veto of the bill.5 He's one of the richest people in a Senate filled with millionaires. The Associated Press reports he and his wife own at least eight homes! Yet McCain says the solution to the housing crisis is for people facing foreclosure to get a \"second job\" and skip their vacations.6 Many of McCain's fellow Republican senators say he's too reckless to be commander in chief. One Republican senator said: \"The thought of his being president sends a cold chill down my spine. He's erratic. He's hotheaded. He loses his temper and he worries me.\"7 McCain talks a lot about taking on special interests, but his campaign manager and top advisers are actually lobbyists. The government watchdog group Public Citizen says McCain has 59 lobbyists raising money for his campaign, more than any of the other presidential candidates.8 McCain has sought closer ties to the extreme religious right in recent years. The pastor McCain calls his \"spiritual guide,\" Rod Parsley, believes America's founding mission is to destroy Islam, which he calls a \"false religion.\" McCain sought the political support of right-wing preacher John Hagee, who believes Hurricane Katrina was God's punishment for gay rights and called the Catholic Church \"the Antichrist\" and a \"false cult.\"9 He positions himself as pro-environment, but he scored a 0—yes, zero—from the League of Conservation Voters last year.10\n\nJohn McCain is not who the Washington press corps make him out to be. Please help get the word out—forward this email to your personal network. And if you want us to keep you posted on MoveOn's work to get the truth out about John McCain, sign up here:\n\nhttp://pol.moveon.org/mccaintruth/\n\nSources:\n\n1. \"The Complicated History of John McCain and MLK Day,\" ABC News, April 3, 2008\n\nhttp://blogs.abcnews.com/politicalpunch/2008/04/the-complicated.html\n\n\"McCain Facts,\" ColorOfChange.org, April 4, 2008\n\nhttp://colorofchange.org/mccain_facts/\n\n2. \"McCain More Hawkish Than Bush on Russia, China, Iraq,\" Bloomberg News, March 12, 2008\n\nhttp://www.bloomberg.com/apps/news?pid=20601103&sid=aF28rSCtk0ZM&refer=us\n\n\"Buchanan: John McCain 'Will Make Cheney Look Like Gandhi,'\" ThinkProgress, February 6, 2008\n\nhttp://thinkprogress.org/2008/02/06/buchanan-gandhi-mccain/\n\n3. \"McCain Sides With Bush On Torture Again, Supports Veto Of Anti-Waterboarding Bill,\" ThinkProgress, February 20, 2008\n\nhttp://thinkprogress.org/2008/02/20/mccain-torture-veto/\n\n4. \"McCain says Roe v. Wade should be overturned,\" MSNBC, February 18, 2007\n\nhttp://www.msnbc.msn.com/id/17222147/\n\n5. \"2007 Children's Defense Fund Action CouncilĀ® Nonpartisan Congressional Scorecard,\" February 2008\n\nhttp://www.childrensdefense.org/site/PageServer?pagename=act_learn_scorecard2007\n\n\"McCain: Bush right to veto kids health insurance expansion,\" CNN, October 3, 2007\n\nhttp://www.cnn.com/2007/POLITICS/10/03/mccain.interview/\n\n6. \"Beer Executive Could Be Next First Lady,\" Associated Press, April 3, 2008\n\nhttp://ap.google.com/article/ALeqM5h-S1sWHm0tchtdMP5LcLywg5ZtMgD8VQ86M80\n\n\"McCain Says Bank Bailout Should End `Systemic Risk,'\" Bloomberg News, March 25, 2008\n\nhttp://www.bloomberg.com/apps/news?pid=20601087&sid=aHMiDVYaXZFM&refer=home\n\n7. \"Will McCain's Temper Be a Liability?,\" Associated Press, February 16, 2008\n\nhttp://abcnews.go.com/Politics/wireStory?id=4301022\n\n\"Famed McCain temper is tamed,\" Boston Globe, January 27, 2008\n\nhttp://www.boston.com/news/nation/articles/2008/01/27/famed_mccain_temper_is_tamed/\n\n8. \"Black Claims McCain's Campaign Is Above Lobbyist Influence: 'I Don't Know What The Criticism Is,'\" ThinkProgress, April 2, 2008\n\nhttp://thinkprogress.org/2008/04/02/mccain-black-lobbyist/\n\n\"McCain's Lobbyist Friends Rally 'Round Their Man,\" ABC News, January 29, 2008\n\nhttp://abcnews.go.com/Blotter/story?id=4210251\n\n9. \"McCain's Spiritual Guide: Destroy Islam,\" Mother Jones Magazine, March 12, 2008\n\nhttp://www.motherjones.com/washington_dispatch/2008/03/john-mccain-rod-parsley-spiritual-guide.html\n\n\"Will McCain Specifically 'Repudiate' Hagee's Anti-Gay Comments?,\" ThinkProgress, March 12, 2008\n\nhttp://thinkprogress.org/2008/03/12/mccain-hagee-anti-gay/\n\n\"McCain 'Very Honored' By Support Of Pastor Preaching 'End-Time Confrontation With Iran,'\" ThinkProgress, February 28, 2008\n\nhttp://thinkprogress.org/2008/02/28/hagee-mccain-endorsement/\n\n10. \"John McCain Gets a Zero Rating for His Environmental Record,\" Sierra Club, February 28, 2008\n\nhttp://www.alternet.org/blogs/environment/77913/\n\nSupport our member-driven organization: MoveOn.org Political Action is entirely funded by our 3.2 million members. We have no corporate contributors, no foundation grants, no money from unions. Our tiny staff ensures that small contributions go a long way. If you'd like to support our work, you can give now at:\n\nhttp://political.moveon.org/donate/email.html\n\nPAID FOR BY MOVEON.ORG POLITICAL ACTION, http://pol.moveon.org/\n\nNot authorized by any candidate or candidate's committee.\n\n", "images": ["https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/bnav_contact_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/nav_donate_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/navrule.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/nav_about_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/bnav_home_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/nav_success_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/nav_campaigns_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/bnav_about_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/bnav_news_static.gif", "https://web.archive.org/web/20080506120114im_/http://pol.moveon.org/images/home/nav_signup_static.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "MoveOn.org Political Action: 10 things to know about McCain", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}