{"url": "https://people.com/style/we-tried-it-cate-blanchett-sandra-bullock-penis-facial/", "text": "What It Is: The “Hollywood EGF Facial”, otherwise known as the “Penis Facial” thanks to stars like Sandra Bullock and Cate Blanchett, who both swear by it for radiant, glowy skin\n\nWho Tried It: Jillian Ruffo, Associate Beauty Editor\n\nGet push notifications with news, features and more.\n\nWhy We Tried It: Let me ask you this: Would you pass up the chance to have skin that looks as smooth as Blanchett or Bullock’s? (We didn’t think so.)\n\nLevel of Difficulty: 2, if you factor in very mild pain and upkeep\n\nIt all started back in March, when Blanchett opened up about her skincare secret: a special facial at esthetician Georgia Louise‘s New York City skincare atelier, which Bullock turned her on to. She called it the “Penis Facial” — which, after further investigation, we learned got its name from the treatment’s ingredients. And on Thursday’s episode of The Ellen DeGeneres Show, Bullock explained not only why the treatment is so good, but also the reason behind the name.\n\nBullock explains that through a microneedling technique, the facial boosts collagen by enabling serums, including an epidermal growth factor (or EGF) serum to seep deeper into the skin. The serum, she tells DeGeneres, is “an extraction from a piece of skin that came from a young person far, far away.” But as DeGeneres bluntly points out, the EGF is derived from “foreskin from a Korean baby.”\n\nYes, she’s right. The serum is made from the foreskin of a baby’s penis. As a representative for Louise explains, “For the Hollywood EGF Facial treatment, Georgia Louise uses her TCA peels, micro-needling machine and an electrifying mask to calm the skin, followed by her ‘secret box’ of EGF serum (Epidermal Growth Factor). EGF is derived from the progenitor cells of the human fibroblast taken from Korean newborn baby foreskin – which helps to generate collagen and elastin.”\n\nFurther, Louise tells PeopleStyle of the FDA-approved serum, which uses skin collected during circumcision, “I always explain that EGF is derived from newborn baby foreskin, BUT cells were taken [from the foreskin] and from that, new cells are cloned from a laboratory.”\n\n“It’s not like I’m lying there with little pieces all over my face,” Bullock tells DeGeneres. “I call it the penis facial. And I think when you see how good it is to your face, you too will run to your local facialist and say, ‘give me the penis.'”\n\nAnd that, my friends, is exactly what I did — but instead of just any facialist, I went straight to the Louise’s NYC spa to receive the exact treatment that Bullock and Blanchett have received. Spoiler alert: I didn’t end up looking like them, but my skin looked pretty damn good for days afterward.\n\nImage zoom Alberto E. Rodriguez/Getty\n\nRELATED: The Best Beauty Product Launches of 2018\n\n“It started last year when Sandra Bullock was filming in NYC and came to see me for a deep cleansing and long-lasting facial glow. I wanted to give her something that would transform her skin without the need to undergo lasers, so I loaded up her bespoke facial with something that would give her long lasting results,” Louise says. “I have text threads which would blow your mind from celebs, asking for the ‘penis treatment’ all the time now!”\n\nI arrived at Louise’s super-fancy spa on the Upper East Side of Manhattan, I sat down in the lobby, which is placed in the first floor of a chic brownstone, and was offered a cup of black tea in fine china. Fancy, I know. Eventually, I made my way back to the treatment room with my esthetician, Sarah, who explained that my skin would be red afterwards, and that I’d have to abstain from wearing makeup for 24 hours, and steer clear of hot water or harsh products. I obliged.\n\nImage zoom\n\nBut I soon learned that while it definitely would be one of the best facials I’ll probably ever get in my life, it probably wouldn’t be the most relaxing. Sarah cleansed my skin (this part was relaxing) and then applied a gentle chemical peel to sterilize my skin. Next came the numbing cream. She massaged it all over my face, and then had me lay under red and blue lights (they have great anti-aging and anti-inflammatory properties, respectively) while the numbness kicked in. Soon enough, I couldn’t feel my face — which meant it was time for the most important part of the facial: microneedling.\n\nThe microneedling machine is an electric wand with a dozen tiny needles at the end. Yes, it looks — and sounds — scary, but since I was numb, it wasn’t so bad. Sarah pressed the needles into my skin in a linear pattern, poking teeny tiny holes into the surface of my face. While she did this, she applied the EGF serum — yes, the baby foreskin one — so that it penetrated immediately. The process took about 30 minutes — and while I was relieved that it was over, I was eager to see if I had yet morphed into Bullock during that time.\n\nImage zoom\n\nBut I wasn’t done yet. Next, Sarah applied a second chemical peel, and then a thick liquid face mask that she even smoothed over my eyes and mouth. Since I couldn’t see or speak, I motioned for her to take photos of me looking like a science project (above). Then, she hooked the edges of the mask up to an electrifying machine, which would send waves through my skin to lift, tone and soothe it. After that, she swiped on a few more serums and SPF and I was on my merry way.\n\nImage zoom\n\nThe Verdict: As if the resounding “you look glowing” from my coworkers didn’t prove how good the results were, I must have looked in the mirror to examine my skin about 20 times upon arriving at work. There wasn’t as much redness as I had expected, and I truly was glowing. My pores looked smaller, my cheekbones looked more defined, and the lines in my forehead that usually bug me were nowhere in sight. But beyond that, it felt smooth and firm for days. Since the experience, my usual redness has disappeared, enabling me to skip foundation, and there’s still a radiance about my skin that wasn’t there before. And while I certainly don’t have the budget (or the time, for that matter) to get these on the regular like the Ocean’s 8 cast, you better believe I’ll be taking better care of my skin from here on out in hopes of maintaining the results. Thanks, Sarah (and you, too, Sandra!).", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2F17%2Fimage_uploaded_from_ios_1024-1-e1526593119511.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2F17%2Fimage_uploaded_from_ios_1024-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2F17%2Fimage_uploaded_from_ios_1024.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg", "keywords": [], "authors": ["Jillian Ruffo"], "canonical_link": "https://people.com/style/we-tried-it-cate-blanchett-sandra-bullock-penis-facial/", "title": "We Tried Sandra Bullock's 'Penis Facial'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Beauty,News,Style News,We Tried It", "news_keywords": "Beauty,News,Style News,We Tried It", "description": "Spoiler: It didn't turn me into a celebrity overnight, but it came close", "og": {"title": "Here's What Happened When We Tried the $650 'Penis Facial' That Sandra Bullock and Cate Blanchett Swear By", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/we-tried-it-cate-blanchett-sandra-bullock-penis-facial/", "description": "What It Is: The “Hollywood EGF Facial”, otherwise known as the “Penis Facial” thanks to stars like Sandra Bullock and Cate Blanchett, who both swear&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/style/we-tried-it-cate-blanchett-sandra-bullock-penis-facial/", "description": "Spoiler: It didn't turn me into a celebrity overnight, but it came close", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/we-tried-it-cate-blanchett-sandra-bullock-penis-facial/", "title": "Here's What Happened When We Tried the $650 'Penis Facial' That Sandra Bullock and Cate Blanchett Swear By", "description": "Spoiler: It didn't turn me into a celebrity overnight, but it came close", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsandra-bullock-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/vJB3j2aKLio"], "publish_date": null, "source": "https://people.com", "summary": ""}