{"url": "https://www.rollingstone.com/culture/culture-lists/who-killed-jonbenet-ramsey-8-possible-suspects-129125/", "text": "JonBenét's mother, Patsy Ramsey, took whatever secrets of that morning she had with her to the grave when she passed away after a 13-year battle with ovarian cancer that eventually spread to the brain. Though both she and her husband John were formally exonerated in 2008 thanks to developments in DNA technology, many still suspect that the former Miss West Virginia accidentally murdered her six-year-old child in a fit of rage over a bed-wetting accident then covered it up post haste. From the outside, Patsy was your pleasant and influential suburban mother of two, known for her beauty-pageant-winning daughter JonBenét and the lavish Christmas parties she threw every year. Still, several pieces of evidence suggest she may have had more to do with the crime than she let on.\n\nFirst, it's been speculated that while cleaning up yet another one of JonBenét's bed-wetting accidents, which are said to have occurred with some frequency, Ramsey flipped a switch and slammed the little girl's head against the side of a hard, blunt surface like a bathtub. Second, JonBenét was found with a rope around her neck, tightened by a homemade garrote determined to have been fashioned out of a paintbrush taken from Patsy’s paint kit that lay nearby. Third, the most bizarre ransom note in the history of ransom notes: Patsy said she discovered a two-and-a-half page ransom note on one of the rungs down the spiral staircase that led to the basement where JonBenét’s body was found. Written in strange verbiage that seemed lifted from classic crime films, the note demanded $118,000 be given to the \"foreign faction\" by 10 a.m. the next day, which was later figured out to be the same amount of John Ramsey’s Christmas bonus from his company Access Graphics. Some sources, including Boulder PD’s former co-leading investigator Steve Thomas have speculated that Patsy wrote the note herself in a moment of panic after realizing what she'd done to JonBenét. But the handwriting analyses – though convincing – were eventually found to be inconclusive. It was determined, however, that the note had been written on a piece Patsy's stationary from inside the home with her own pen.\n\nIn the years following the murder, Patsy appeared extremely defensive, once even hashing it out with a naysayer on Larry King Live. While family friends insisted that Patsy adored JonBenét and would never have put the little girl in harm’s way, some onlookers came down hard, criticizing Ramsey for sexualizing a vulnerable child through a string of beauty pageants.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-lists%2Fwho-killed-jonbenet-ramsey-8-possible-suspects-129125%2F&ct=single-pmc_list&lob=rollingstone&loc=us&env=desktop&post_id=129125", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jonbenet-ramsey-d4372840-802b-422f-bb3f-87f61b5c0ad7.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jonbenet-ramsey-d4372840-802b-422f-bb3f-87f61b5c0ad7.jpg", "keywords": [], "authors": ["Bryn Lovitt", "Bryn Lovitt'S Most Recent Stories", "Suspects Charged In Tinder Murder", "How Dangerous Is App Dating", "A Brief History Of Pro-Gun Rallies At Sites Of Mass Shooting", "Third Man Accused Of Child Marriage In Utah Sex Cult", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-lists/who-killed-jonbenet-ramsey-8-possible-suspects-129125/", "title": "Who Killed JonBenet Ramsey? 8 Possible Suspects", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "From her immediate family to the kindly neighborhood Santa Claus, a brief look at the cases for – and against – the murder's most popular suspects", "news_keywords": "Crime, JonBenet Ramsey", "og": {"type": "article", "title": "Who Killed JonBenet Ramsey? 8 Possible Suspects", "url": "https://www.rollingstone.com/culture/culture-lists/who-killed-jonbenet-ramsey-8-possible-suspects-129125/", "description": "From her immediate family to the kindly neighborhood Santa Claus, a brief look at the cases for – and against – the murder’s most popular suspects", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jonbenet-ramsey-d4372840-802b-422f-bb3f-87f61b5c0ad7.jpg", "width": 1024, "height": 1177, "alt": "JonBenét Ramsey"}, "locale": "en_US"}, "article": {"published_time": "2016-10-12T13:10:00+00:00", "modified_time": "2018-06-25T16:02:33+00:00"}, "twitter": {"text": {"title": "Who Killed JonBenet Ramsey? 8 Possible Suspects"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jonbenet-ramsey-d4372840-802b-422f-bb3f-87f61b5c0ad7.jpg?w=891", "alt": "JonBenét Ramsey"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Who Killed JonBenet Ramsey? 8 Possible Suspects", "description": "From her immediate family to the kindly neighborhood Santa Claus, a brief look at the cases for – and against – the murder's most popular suspects"}, "generator": "WordPress 5.4", "author": "Bryn Lovitt", "googlebot": "index, follow", "Googlebot-News": "noindex,nofollow", "content_type": "List", "post_id": 129125, "title": "Who Killed JonBenet Ramsey? 8 Possible Suspects", "published_at": "2016-10-12 13:10:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-jonbenet-ramsey-d4372840-802b-422f-bb3f-87f61b5c0ad7.jpg?w=1024", "comment_count": 0, "tags": "JonBenet Ramsey", "topics": "Culture Lists", "body": "The unsolved murder of six-year-old JonBenét Ramsey never fails to spark a heated debate. Rife with conflicting theories, false confessions and a growing inventory of evidence, the 20-year-old case of who killed the tiny, blue-eyed pageant queen has become a white whale for armchair detectives and conspiracy theorists. While many adamantly believe JonBenét was accidentally killed by a member of her own family who then staged her death to look like a kidnapping, others are convinced that an intruder broke into the Ramsey home, slaughtered JonBenét and left her there for her family to find. Over the years of relentless and sensationalized coverage that immortalized JonBenét in tawdry pageant photos, the search to find her killer has turned into a massive game of media Clue. Was it her mother in the basement with a paint brush for a garrote? The emotionally disturbed older brother with a flashlight to the face? The family friend dressed as Santa who seemed a little too eager to visit his \"special friend\" on Christmas? This fall, several television networks raced to reveal new information in what&apos;s become the ultimate cold case. But aside from hype and bombast surrounding its 20-year anniversary, no one seemed to be able to offer much but more theories. As it stands, the list of people linked to JonBenét&apos;s murder is as winding as the spiral stairs that led to her corpse in the basement. Now that we&apos;ve supposedly been given all the information we&apos;ll probably get, here&apos;s a review of the alleged perps – ranging from her own parents to a child pornographer on the lamb in Thailand – who have come up in countless attempts to nail the killer behind one of America&apos;s longest and most baffling true-crime whodunits.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1476277800.0, "source": "https://www.rollingstone.com", "summary": ""}