{"url": "http://time.com/5244091/new-summer-tv-shows-2018/", "text": "Sure, summer is warm. But you can’t spend all your time outside. And what is a person to do with all that spare time in a summer without Game of Thrones?\n\nLuckily, there’s plenty of new summer TV shows to watch. The excellent spy series Killing Eve is currently airing on BBC America, and HBO’s Westworld continues to offer plenty of twists in its second season. Ryan Murphy (American Horror Story, The People v. OJ Simpson) is bringing yet another new summer TV show to FX, and another adaptation of a novel by Gone Girl author Gillian Flynn, with Amy Adams as the star, will air.\n\nLaura Dern returns to HBO with a new movie following her Emmy-winning role in Big Little Lies, and Michael B. Jordan will try to top his lauded Black Panther performance with a turn in Fahrenheit 451. Oh, and of course you must set your alarm early to tune into the royal wedding in May.\n\nWe’ve picked out the new summer TV shows we’re most excited to watch. For the completists, we’ve also included a longer list of returning TV series that are also worth your attention. Happy watching.\n\nThe top picks for new summer TV shows:\n\nThe Royal Wedding (May 19)\n\nPrince Harry and Meghan Markle attend an official photocall to announce their engagement at The Sunken Gardens, Kensington Palace on November 27, 2017 in London, England. Prince Harry and Meghan Markle have been a couple officially since November 2016 and are due to marry in Spring 2018. Max Mumby - Indigo/Getty Images\n\nThis will be the biggest television event of the summer. The royal wedding begins at 12 p.m. BST on May 19 in London, so Americans will have to set their alarms for the wee hours of the morning. In preparation for the nuptials, you can tune in to both the Fox documentary Meghan Markle: An American Princess (May 11) and a Lifetime movie about Meghan Markle and Prince Harry (May 13).\n\nFahrenheit 451 (HBO, May 19)\n\nAs if royal wedding day weren’t exciting enough, HBO’s hotly anticipated adaptation of Ray Bradbury’s dystopia Fahrenheit 451 premieres that same day. Michael B. Jordan, fresh off Black Panther, stars as Montag, a young “fireman” employed by the government to burn books. Montag begins to doubt his mission and comes into conflict with his mentor Beatty (Michael Shannon).\n\nPose (FX, June 3)\n\nRyan Murphy’s next big project is a musical set in 1980s New York City. The story juxtaposes the luxury of the Trump universe uptown with the art scene and ball culture downtown. The buzzy show will also make history with the largest cast of trans actors on TV to date, including Hailie Sahar, Indya Moore, Dominique Jackson, Angelica Ross and M.J. Rodriguez. James Van Der Beek and Kate Mara also star.\n\nSharp Objects (HBO, July)\n\nLONDON, ENGLAND - OCTOBER 14: Actress Amy Adams attends the 'Nocturnal Animals' Headline Gala screening during the 60th BFI London Film Festival at Odeon Leicester Square on October 14, 2016 in London, England. (Photo by John Phillips/Getty Images for BFI) John Phillips—Getty Images\n\nHBO is hoping the thriller Sharp Objects will be the next Big Little Lies. Amy Adams stars as a reporter with mental health issues trying to solve a murder in her hometown under the watchful eye of her critical mother (Patricia Clarkson). TV legend Marti Noxon adapted the script from Gillian Flynn’s novel. The cable network has even brought Big Little Lies’ Jean-Marc Vallée on to direct.\n\nMaking It (NBC, July 31)\n\nIt’s the Parks and Recreation reunion you’ve been waiting for — sort of. Amy Poehler and Nick Offerman co-host a new crafting competition series. Yes, you read that correctly. Making It has the potential to become the next The Great British Bake Off: a reality series that actually calms your anxieties at the end of the day.\n\nThe Full List\n\nDear White People (Netflix, May 4)\n\nA new teaser for Dear White People offers up an impressive syllabus of topics the show plans to side-eye in its sophomore season. Samantha White (Logan Browning) will continue to take on race, gender and a host of other issues in her campus radio show. The talented Lena Waithe also joins the cast as an MC starring on a faux reality show.\n\nSweetbitter (Starz, May 6)\n\nStephanie Danler has adapted her semi-autobiographical, bestselling novel Sweetbitter into a new summer TV show about a small-town girl who stumbles into a job waiting tables at one of Manhattan’s most celebrated restaurants. There she learns about food and wine — as well as the raucous, drug-fueled life chefs, bartenders and waitstaff lead after closing hours.\n\nVida (Starz, May 6)\n\nTwo sisters return home to Los Angeles after their mother passes away— only to find out that their mother secretly married a woman. The ambitious show featuring an entirely Latinx cast tackles issues of identity, culture and sexuality.\n\nSafe (May 10)\n\nNetflix is releasing so many movies and new TV shows this year, so it’s hard to sort out what is worth prioritizing in your queue. This new mystery series starring Michael C. Hall as a widowed dad whose daughter goes missing inside their gated community looks promising. Mysteries always make for great bingeing: You won’t have to wait to find out whodunnit.\n\nPatrick Melrose (Showtime, May 12)\n\nBenedict Cumberbatch returns to TV as another addict — though Patrick Melrose isn’t quite as high functioning as Sherlock. The five-episode mini-series based on Edward St. Aubyn’s five Patrick Melrose novels also stars Jennifer Jason Leigh, Blythe Danner, Hugo Weaving and Allison Williams.\n\nLittle Women (PBS, May 13)\n\nLouisa May Alcott’s classic Little Women is getting yet another adaptation. This time, Call the Midwife creator Heidi Thomas will helm the Masterpiece mini-series about four sisters navigating love, loss and what society expects of them during the Civil War. Angela Lansbury stars.\n\nCargo (Netflix, May 18)\n\nZombie triller Cargo will drop on Netflix after its Tribeca Film Festival premiere. The post-apocalyptic film stars Martin Freeman as a doomed dad looking for a safe haven for his baby daughter. The movie seems more philosophical than the action-packed Walking Dead or World War Z — perhaps closer in style and plot to The Road or Last of Us.\n\nThe Tale (HBO, May 26)\n\nYou may have to wait another year to see Big Little Lies 2, but HBO has more Laura Dern for you in the meantime. The Tale, which premiered at the Sundance Film Festival, tells the story of a woman who re-evaluates her first sexual relationship after reading a story she wrote when she was 13. The story of abuse feels all too prescient in the #MeToo era.\n\nPicnic at Hanging Rock (Amazon, May 25)\n\nhe mini-series, based on the Australian novel of the same name, three school girls that go missing on Valentine’s Day in the year 1900. Game of Thrones’ Natalie Dormer plays the school mistress trying to figure out what happened to her students. The mystery unfolds on a gothic backdrop, perfect for lovers of both procedurals and period pieces.\n\nThe Break With Michelle Wolf (Netflix, May 27)\n\nNBC—Getty Images\n\nMichelle Wolf is the next big thing in comedy. Her HBO standup special Nice Lady was a smash-hit and she’s coming off a controversial hosting gig at the White House Correspondents’ Dinner. Now she has snagged her own talk show on Netflix. “You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” she said when Netflix announced the show.\n\nQueen Sugar (OWN, May 29)\n\nSiriboe, Wesley and Gardner on Queen Sugar, produced by Oprah Winfrey OWN\n\nAva DuVernay’s Queen Sugar returns for a third season with an all-female directing team. The Bordelon siblings continue to struggle to resolve issues within their family and to run the farm that was left to them. The writers have said that this season specifically will focus on fatherhood.\n\nUnbreakable Kimmy Schmidt (Netflix, May 30)\n\nEllie Kemper radiates good cheer in Unbreakable Kimmy Schmidt, co-produced by Tina Fey Netflix\n\nKimmy (Ellie Kemper) and Titus (Tituss Burgess) are still trying to navigate life in New York after severe trauma: Kimmy was trapped in a bunker for years, and Titus had to sing on a cruise ship. Tina Fey and Robert Carlock have remained tight-lipped about what’s to come for their wacky comedy, although season 4 will likely be its last.\n\nDietland (AMC, June 4)\n\nPraise the television gods: The Good Wife’s Julianna Margulies is returning to the small screen to star alongside Joy Nash in a television adaptation of Dietland, Sarai Walker’s searing novel about society’s obsession with the perfect body. Better yet, Marti Noxon, of Buffy the Vampire Slayer and UnReal fame, will run the show.\n\nYounger (TV Land, June 5)\n\nThe Sutton Foster and Hillary Duff series about a woman who pretends to be, well, younger in order to restart her life and career returns for a fifth season. The showrunners are teasing a major twist in the opening episodes.\n\nCloak & Dagger (Freeform, June 7)\n\nTwo teenagers, Tandy Bowen (Olivia Holt) and Tyrone Johnson (Aubrey Joseph), find out that they are mysteriously linked by their newly discovered superpowers. Tandy can create light daggers, and Tyrone can control darkness.\n\nNashville (CMT, June 7)\n\nThe country music drama is gearing up for one last encore: The second half of the final season premieres in June. In the last eight episodes, Hayden Panettiere’s Juliette continues her journey to try to find herself.\n\nAmerican Woman (Paramount Network, June 7)\n\nParamount\n\nReal Housewives of Beverly Hills star Kyle Richards gets a series about her childhood starring Alicia Silverstone. The Clueless actor stars as Richards’ mother, a woman who divorced her husband in the 1970s in search of a more independent life.\n\nThe Affair (Showtime, June 17)\n\nThe fallout of the titular affair continues to plague the two couples in this dreary relationship drama (Dominic West, Ruth Wilson, Maura Tierney and Joshua Jackson). Sanaa Lathan — recently of Beyoncé conspiracy theory fame — joins the cast for the show’s fourth season.\n\nYellowstone (Paramount Network, June 20)\n\nKevin Costner stars as the head of a ranching family who must take on those encroaching upon his land. Things are bound to get violent considering that Taylor Sheridan, the buzzy screenwriter behind the brilliant but brutal movies Sicario and Hell or High Water, wrote the miniseries.\n\nLuke Cage (Netflix, June 22)\n\nMike Colter still packs a punch as the hero of Harlem in the second season of Luke Cage. This year, Iron Fist will assist Luke in protecting New York, as will Misty Knight — who now has a bionic arm. Cottonmouth actor Mahershala Ali (who won an Oscar for Moonlight after season 1 dropped) won’t return for season two, but Erik LaRay Harvey will appear as villain Diamondback.\n\nPreacher (AMC, June 24)\n\nPreacher and Outcast lift faith and fear from comics AMC\n\nSeth Rogen and Evan Goldberg’s irreverent superhero series about a small-town preacher-slash-criminal (Dominic Cooper) with the power to make people do whatever he says returns for a third season. This year, Jesse returns to his childhood home to settle old grudges.\n\nGLOW (Netflix, June 29)\n\nHang on to your leg warmers. The Gorgeous Ladies of Wrestling are busting their way into a second season. The satire series about 80s showbiz, sports and feminism will offer even more glitz with Alison Brie returning as the show’s lead.\n\nHeathers (Paramount, July 10)\n\nParamount\n\nParamount decided to delay the television show spinoff of the cult hit Winona Ryder film after the Parkland shooting. (Fans of the movie will recall that a certain high school character turns murderous.) The show differs greatly from its source material, and has rethought the characters for a modern era in the hopes of tackling modern social issues like gender, sexuality and identity.\n\nJack Ryan (Amazon, August 31)\n\nJohn Krasinski has come a long way from Scranton. After scoring a box office hit with his new film A Quiet Place, Krasinski will take a turn as action hero in the role of CIA agent Jack Ryan. Krasinski will have to put his own spin on the character that Harrison Ford, Alec Baldwin, Ben Affleck and Chris Pine have all played before him.\n\nManiac (TBD)\n\nManiac Netflix\n\nSuperbad co-stars Emma Stone and Jonah Hill reunite as strangers who find themselves in a pharmaceutical trial gone awry. The trippy-looking show also stars Sally Feild and Justin Theroux and looks to be one of the most intriguing TV shows of 2018.\n\nBetter Call Saul (AMC, TBD)\n\nBen Leuner/AMC\n\nThough showrunner Vince Gilligan’s lips are sealed on what is coming for the critically beloved Breaking Bad spinoff, Aaron Paul has teased a return of his fan favorite character Jesse Pinkman in season 4.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Eliana Dockterman at eliana.dockterman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2016/11/better-call-saul-1.jpg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2016/05/preacher-dominic-cooper-amc-comic-book.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/04/TheCircle.jpeg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg", "https://api.time.com/wp-content/uploads/2018/04/gettyimages-521245342.jpg", "https://api.time.com/wp-content/uploads/2018/03/heathers_avgsgp.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/04/meghan-markle-prince-harry-citizenship-us-uk-visa.jpg", "https://api.time.com/wp-content/uploads/2018/04/netflix-new-2018-maniac.jpg", "https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/06/queen-sugar-own-ava-duvernay.jpg", "https://api.time.com/wp-content/uploads/2017/12/gettyimages-614673396.jpg", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/04/american-woman_ep107_my_1960_r_lowres.jpg", "https://api.time.com/wp-content/uploads/2015/03/unbreakable-kimmy-schmidt.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Eliana Dockterman"], "canonical_link": "https://time.com/5244091/new-summer-tv-shows-2018/", "title": "All the New TV Shows You Need to Watch This Summer", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Television", "news_keywords": "summer tv, new tv, tv 2018", "description": "Summer is warm, but you can't spend all your time outside. There's plenty of new summer TV shows to watch, from Sharp Objects to Jack Ryan.", "og": {"title": "All the New TV Shows You Need to Watch This Summer", "type": "article", "site_name": "Time", "url": "https://time.com/5244091/new-summer-tv-shows-2018/", "description": "Summer is warm, but you can't spend all your time outside. There's plenty of new summer TV shows to watch, from Sharp Objects to Jack Ryan.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5244091/new-summer-tv-shows-2018/", "description": "Summer is warm, but you can't spend all your time outside. There's plenty of new summer TV shows to watch, from Sharp Objects to Jack Ryan.", "media": "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5244091/new-summer-tv-shows-2018/", "title": "All the New TV Shows You Need to Watch This Summer", "description": "Summer is warm, but you can't spend all your time outside. There's plenty of new summer TV shows to watch, from Sharp Objects to Jack Ryan.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/04/new-tv-shows.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/KxywNVLAf5o", "https://www.youtube.com/embed/__Xiq4GcI8E"], "publish_date": null, "source": "http://time.com", "summary": ""}