{"url": "https://www.theringer.com/2017/5/4/16038668/game-of-thrones-spinoffs-hbo-c0bdb9f74eab", "text": "On Thursday, The New York Times reported that HBO has commissioned writers to begin developing scripts for multiple Game of Thrones spinoff series. Those writers were asked to “explore different time periods of George R.R. Martin’s vast and rich universe.” We went ahead and did it for them. These are the Thrones spinoffs we most want to see.\n\n‘The Dance of Dragons’\n\nJason Concepcion: I have given the topic of Thrones spinoffs a lot of thought. And I hope the series is based on the Dance of Dragons Targaryen civil war. Quick primer: Early in second century of Targaryen rule, when dragons were still plentiful, the aging King Viserys I began laying the groundwork for his daughter, Princess Rhaenyra, to succeed him as heir. She attended important meetings, sat at her father’s side at court, and, over time, amassed an impressive collection of supporters. After the death of Queen Aemma, King Viserys officially named Rhaenyra his heir. This decision went against two succession precedents, but not in a way that would seem to interfere with the king’s will, assuming no other claimants to the throne should appear.\n\nUnfortunately, the second part happened. The king remarried. His new wife bore him sons. She wanted them to inherit the throne. Boom: a devastating dragon war that played a large role in the creature’s extinction.\n\nThis story has everything:\n\nNew characters (not new actors playing young versions of old characters)\n\nDynastic intrigue\n\nMean queens\n\nBetrayal\n\nLittle kids getting murdered\n\nDragon-on-dragon violence\n\nThe marks against the Dance as a GoT spinoff are:\n\nLots of dragons means a whopping special-effects bill.\n\nNew characters. (As I said above, I think this is a plus, but your mileage may vary.)\n\nMost of the written material comes from two novellas, The Rogue Prince and The Princess and the Queen, instead of five gigantic tomes, meaning more work for the writing team.\n\nYes, this would be expensive. But we’re worth it. Let the dragons soar.\n\n‘Night Falls’\n\nKate Knibbs: The character known as the Night King is shaping up to be Game of Thrones’ final boss, so he’s a known quantity for even casual GoT fans. But we see him only at the apex of his villainy. Who was he before turning evil? As ASOIF lore tells it, the Night’s King was once an early Lord Commander of the Night’s Watch who was enticed into evil by an alluring woman. (In the show, the Children of the Forest create the Night King during a war with the First Men, but let’s pretend that didn’t happen and go with the book version. Or combine the two. We can work out the mythology later.) A prequel tracing the Lord Commander’s slide into ultimate evil would be both entertaining and also not that expensive, since there’d be no dragons and HBO already has the Wall’s CGI on lockdown. Basically, I want to see Breaking Bad but for the Night King.\n\n‘Everybody Loves Aegon’\n\nJason Gallagher: From the comedy geniuses behind Mike and Molly comes the hit new sitcom about Aegon Targaryen and his incestuous marriages with two of his sisters. Literally everyone in his immediate family loved him. Oh, brother!\n\n‘Robert’s Rebellion’\n\nMallory Rubin: “But we know about it already,” my once-trusted colleague Jason Concepcion said in The Ringer’s Game of Thrones Slack after I expressed my fierce desire for one of HBO’s impending spinoffs to focus on Robert Baratheon’s rebellion. The Usurper’s war is too close to the events of the current show, my once-cherished friend cautioned; seeing young versions of characters we’ve spent so much time with is too weird, marching toward a conclusion we already know too devoid of mystery.\n\nWell, here’s a bonus Ask the Maester question for you, folks: Why should we fear what we know is good for us? Why should we run from what we’re sure we want? [Extremely Robert voice] They don’t put that part in the songs.\n\nIt’s natural for viewers to want something totally fresh, but the world that George R.R. Martin has built — and is, uh, hopefully still building — contains enough IP to generate 80 more seasons of A Song of Ice and Fire goodness. I look forward to spending time with Dunk and Egg in 2020, and with the Blackfyre Pretenders in 2022, and with Sex God Pod in 2024 (and forever). But I want to start a little closer to home. Finally witnessing the events at the Tower of Joy in Season 6 was a life-affirming experience, but it didn’t sate my desire. It made me want to gaze into Lyanna’s eyes for eternity.\n\nYou know what was super dope about Rogue One? Seeing Darth Vader’s lightsaber calisthenics. You know what’s going to make the second Fantastic Beasts installment more satisfying than the smoothest firewhiskey? Seeing Young Dumbledore reckon with Grindelwald and the Elder Wand. There’s comfort in what we already know.\n\nAnd if you’re worried that Bran has already shown us too much or soon might, rest easy against this featherbed of truth: Seasons 7 and 8 can’t show us everything from the past. We’re too close to hearing the bells toll to spend a ton of time anywhere but in the present. Yes, we got Lyanna. But we can still get so much more. Ned and Robert fostering at the Eyrie! The Knight of the Laughing Tree! Gulltown! Summerhall! Ashford! The Battle of the Trident! The siege of Storm’s End! (You know you miss Stannis.) THE SACK OF KING’S LANDING. Jaime! My dudes: TYWIN! And that’s just the tip of the content spear that Robert’s rebellion would thrust.\n\nNot every spinoff needs to be eight seasons long. None of them should. Make as many miniseries as Littlefinger has made good investments, and make this one first. It’s familiar but can still be fresh. It’s vast but can still be focused. It’s good material and, crucially, it’s good business: HBO’s signature property is about to conclude. That’s a problem — but not one that Robert’s war hammer can’t rip right through.\n\n‘The Blackfyre Rebellions’\n\nAlison Herman: When flipping through the thousands of pages of Westerosi history George R.R. Martin has helpfully provided for this very occasion, one conflict stands out that mirrors the scale, stakes, and, most importantly, convolution of the War of the Five Kings that took up much of Game of Thrones. This one, to paraphrase Stefon, has everything that makes the Thrones fandom go wild: an aggrieved bastard with a legitimate claim to the throne! An incompetent king who did more to endanger the peace than preserve it! Sibling-on-sibling violence! There are lots of proper nouns and short-lived alliances here that a proper TV adaptation will appropriately streamline, but the basic gist is that a Targaryen king (Aegon the Unworthy) decided to go out with a bang of geopolitical instability, legitimizing all of his numerous bastards on his deathbed and giving one of them (Daemon I Blackfyre) a valid-ish claim to the throne … which he then made, founding his own Targaryen-adjacent noble house and starting the first of five Blackfyre Rebellions. This thing has syndication potential! The premise has just the right mix of context-giving history, blood-spurting action, and a CGI-budget-conserving lack of dragons — though if it’s dragons we want, there’s always my backup plan of a Dragon Tales–style animated kids show starring Balerion and the gang.\n\n‘Sex Pirates’\n\nZach Kram: The life of a sex pirate is relaxed, simple, carefree; why worry about complicated bastard lineage and blood magic when there’s money to waste and women to cavort with? Each day is a new adventure for Salladhor Saan, but when his ship stumbles upon a lone raft in the Narrow Sea, the Lysene pirate finds himself drawn into his most hectic adventure yet: mentoring an orphaned boy who is a bit too familiar with complicated bastard lineage and blood magic.\n\nSalla is no warm father figure, though. Each night, he sends his young charge to bed with a sinister message: “Good night, Gendry. Good work. Sleep well. I’ll most likely kill you in the morning.” Over time, the former armorer learns to fence, fight, and flirt, but his captain carries a dark secret, which viewers will learn in a shocking finale when he takes Gendry aside in his cabin.\n\n“I am not the Sex Pirate Salla,” the smuggler reveals. “I inherited the ship from the previous Sex Pirate Salla, just as you will inherit it from me. The man I inherited it from was not the real Sex Pirate Salla either. The real Salla has been retired 15 years and living like a king in Volantis.” Cue Sex Pirate Gendry, spinoff number two.\n\n‘The Iron Bank’\n\nAndrew Gruttadaro: The options for Game of Thrones spinoffs are nearly unlimited. That’s actually the best explanation I can put forth for why the show (and the books) are so beloved. Game of Thrones is built on the foundation of deep mythology and a well-constructed world, both of which are by definition overflowing with history we’ve learned only in snippets and potential stories that haven’t even been told yet. In putting together a slate of GoT spinoffs, HBO could — and would not be wrong to — lean on the show’s most famous tales and characters. The Tower of Joy, Robert’s Rebellion, the First Men; The Hound, Ser Arthur Dayne, Brienne of Tarth. But the expansion of the GoT universe (the GoTU?) could also be an opportunity for Game of Thrones to get less, well, Game of Thrones–y, and there’s one locale in particular that could provide the setting for a deviation in tone: the Iron Bank of Braavos.\n\nAn Iron Bank spinoff could go a couple of ways. It could be Billions plus GoT, with Tycho Nestoris at the center of a drama about the cutthroat world of Westerosi economics. Regimes toppled from the Bank boardroom; high-intensity finance deals made over the finest oysters Braavos can offer; it could even feature a Young Tywin (played by Jude Law, of course) securing the backing of the Iron Bank. Or, this show could be Office Space plus GoT, focusing on a few disillusioned, entry-level accountants who are toiling away on low-impact financing in the recesses of the Iron Bank. You’d never see anyone of consequence — not even Tycho — and the major historical events of the world would be referenced only in passing conversation. It’d just be a bunch of normal people trying to make a living in Braavos, struggling with the mundanity of being middle class in Essos.\n\nAll of these spinoffs don’t have to be hourlong fantasy war dramas — let’s also take a look at the institutions upon which Essos and Westeros thrive, as well as the people who will never get their names memorialized in Samwell Tarly’s history books.\n\n‘Brienne of Tarth Solo Spinoff’\n\nRyan Wright: Brienne of Tarth is the best character in the Game of Thrones universe. Don’t argue with me, this is just a fact. She fought The Hound and won and might be a better swordsman than prime Jaime Lannister. In a show of full of cheaters and liars, it’s refreshing to see a character so loyal. She’s like Ned Stark but not boring.\n\nSo imagine how great it’d be if she got her own series. We’ve never been to Sapphire Isle during the show, and there’s so much we could explore about the island and her upbringing. For example:\n\nWhat it was like to grow up without siblings and a mother?\n\nThe moment when she was like, “Screw the bullshit, when I grow up I’m gonna be a knight.”\n\nWhat was her relationship with her father like?\n\nWhat happened when her father threw a ball in an attempt to find her a husband.\n\nThe show would also allow us to learn what Brienne thinks about everything. She’s doesn’t give her opinion on much during Thrones, and I want to see the universe through her perspective.\n\n‘Diners, Drive-Inns, and Dragons’\n\nCraig Gaines: Game of Thrones is a world-spanning series wherein the geography is a main character. Up north they have the cold, down south they have the throne, and out east they have … desert? Dragons? I’ve seen like five episodes; I don’t know. But anyway, hold the thought about geography. There are also more than a few prominent scenes featuring food, right? The blond woman eats a horse heart, many important people are murdered at a wedding feast, and the funny guy likes to drink a lot. Combine these two features — food and geography — and it’ll lead you to the greatest cooking show of them all, Great Chefs, Great Cities. I think it was on PBS, it was somewhat popular in the 1980s, and it, like Game of Thrones, took viewers on a tour through a land ruled by various territorial chieftains. In this case, the lords and ladies of the realm were chefs at the world’s leading restaurants. So I say the spinoff should be weekly installments featuring meal maesters showing us the secrets behind beloved dishes like dragon fricassee, dragons Rockefeller, and dragon wings. They eat dragons on the show, right?\n\n‘Jaqen H’ghar’s Backstory’\n\nDaniel Varghese: Among the cultish and morally questionable actors within the Game of Thrones universe, the Faceless Men of Braavos stand out for their cultish and morally questionable behavior. Any person wanting to join the society of assassins must be willing to forsake their individual identity before being trained. Arya’s journey through this process, and her eventual decision to retain the Stark name, was an immensely interesting part of the show’s last two seasons. As such, a spinoff that explored how her guide through this journey, the mysterious Jaqen H’ghar, came to join the group and become no one himself would also be interesting.\n\nNow I know what you’re thinking: How can you make the history of a bunch of people who repudiate their own history? To that, I say, lean in! Because the main story line of Game of Thrones is so massive in scope, it has to be linear to make sense. A story that explores how one person becomes the assassin who eventually saves Arya could be told in a way that honors this paradox and explore whether forsaking your identity is something that’s even possible in the first place. Plus, there would be loads of opportunities for Assassin’s Creed–style scenes set on the screens of Braavos centered around Jaqen, or whatever his/her/their real name is.\n\n‘Dunk and Egg’\n\nSean Yoo: Not to be Captain Obvious, but the most logical conclusion is that one of these potential spinoffs will be the “Tales of Dunk and Egg.” The story, for the non-diehards, revolves around the adventures of hedge knight Ser Duncan the Tall and his squire, Egg; it’s set about 89 years before the events of the main novels. Ser Duncan goes on to become a legendary member of the Kingsguard, while Egg goes on to become King Aegon V Targaryen. George R.R. Martin has already written three novellas surrounding these two characters — The Hedge Knight, The Sworn Sword, and The Mystery Knight — which means there is already plenty of content for the HBO hired writers. Don’t overcomplicate it!\n\nDisclosure: HBO is an initial investor in The Ringer.", "images": ["https://cdn.vox-cdn.com/thumbor/2UNTffKSdNR7p7X5tGJ5PDyKHr4=/0x0:665x444/1200x0/filters:focal(0x0:665x444):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8923011/1_-lkDK8OgExBkCs20JiaUaw.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/6VeRKJKxeTJOb9Jt4UTKHqPZVyw=/0x0:1000x1000/1200x0/filters:focal(0x0:1000x1000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8923001/0_MWH5YZtVp2Suqtfn..0.jpeg", "https://cdn.vox-cdn.com/thumbor/1yUMjBNnkq59aacTXiXmxEOt-gE=/166x0:2833x2000/1200x800/filters:focal(166x0:2833x2000)/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "https://cdn.vox-cdn.com/thumbor/MYNDaGhV7OJKO2ZDNqQvAVLG-I8=/0x0:2000x1330/1200x0/filters:focal(0x0:2000x1330):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8923009/1_KhC5NFnOcNOEUqJymaSXmw.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/XcQZonvty1BB3byJLGXXINxjvCg=/0x0:1503x1000/1200x0/filters:focal(0x0:1503x1000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8923005/1_HXAVb253mRxBVigG9teTtQ.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/thumbor/0-IXsn1692nVIT8eCms_hAojfWc=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/thumbor/1Pg3-WNwffkNquk8OW8FJmk5lXg=/0x0:665x444/1200x0/filters:focal(0x0:665x444):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8923003/1_2mGN8kULeoNGN1kJ4WSFCg.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "https://cdn.vox-cdn.com/thumbor/4Kw0LNEWAlnl_D2U5V5XabBG_MY=/0x0:1772x1181/1200x0/filters:focal(0x0:1772x1181):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8922999/1_auFZ2GH1y0WIfdE_oSrXyg.0.jpeg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/0-IXsn1692nVIT8eCms_hAojfWc=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "keywords": [], "authors": ["The Ringer Staff", "Liz Kelly", "Kate Halliwell", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "May"], "canonical_link": "https://www.theringer.com/2017/5/4/16038668/game-of-thrones-spinoffs-hbo-c0bdb9f74eab", "title": "The 11 ‘Game of Thrones’ Spinoffs We Want to See", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-05-04T17:29:14-04:00", "modified_time": "2017-05-04T17:29:14-04:00"}, "author": "The Ringer Staff", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Everybody loves Aegon!", "og": {"description": "Everybody loves Aegon!", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/0-IXsn1692nVIT8eCms_hAojfWc=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "alt": "(Warner Bros./HBO/Ringer illustration)", "height": 900, "width": 1600}, "site_name": "The Ringer", "title": "The 11 ‘Game of Thrones’ Spinoffs We Want to See", "type": "article", "url": "https://www.theringer.com/2017/5/4/16038668/game-of-thrones-spinoffs-hbo-c0bdb9f74eab"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/2017/5/4/16038668/game-of-thrones-spinoffs-hbo-c0bdb9f74eab", "title": "The 11 ‘Game of Thrones’ Spinoffs We Want to See", "description": "Everybody loves Aegon!", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/0-IXsn1692nVIT8eCms_hAojfWc=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "alt": "(Warner Bros./HBO/Ringer illustration)"}, "site": "ringer"}, "sailthru.title": "The 11 ‘Game of Thrones’ Spinoffs We Want to See", "sailthru.tags": "general,the-ringer,front-page,tv,game-of-thrones", "sailthru.description": "Everybody loves Aegon!", "sailthru.date": "2017-05-04T17:29:14-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/0-IXsn1692nVIT8eCms_hAojfWc=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/RQ3uTe8-Qg80xdDngBs9ut3qXWc=/500x0:2500x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/55901649/1_PdqUaR8jk3U5Jf0X8lk2yA.0.jpeg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1493827200.0, "source": "https://www.theringer.com", "summary": ""}