{"url": "https://www.lennyletter.com/story/troian-bellisario-reveals-mental-health-struggle", "text": "We were swimming our second lap in the lake when I lost the feeling in my toes. When you first jump in water this cold you scream, gasp for air, but immediately laugh because it makes you feel extra-alive. You learn, after a few jumps, you don't have to fear the cold. If you move around, it fades away. Soon, it's as if you're inside a house looking out at a snow flurry as it lightly taps the windows. You know there is cold, all around you, but it can't hurt you.\n\nFor a while, this kind of numb makes me feel invincible.\n\nBut now, after maybe a half-hour in the water, the cold has returned, and not just outside the window, it's in my skin. Beneath the surface, I probably looked like a chicken breast sitting under plastic in a refrigerator of a grocery store, pale and goose-pimpled. Then it's in my joints, making it difficult to move. Soon, it's in my bones, so much that even though I knew I was kicking my legs, I couldn't tell you where they ended and the water began. I wasn't even sure if I had toes anymore.\n\nSuddenly, I'm in very familiar territory. I know I should get out of the water before I hurt myself or make myself sick, but I just don't. I keep swimming.\n\nHere I am, 31 years old, and I'm still denying my body the one thing it is asking me to do: take care of it.\n\n***\n\nWhen I shot the pilot of Pretty Little Liars, it was December in Vancouver, and I was 24 years old. We were shooting a summer scene (the exterior of the funeral for Alison, the Queen Bee of Rosewood), and even though I don't remember exactly how cold it was outside, I can tell you it was too cold to snow. The girls and I were dressed in skimpy black dresses with kitten heels and ballet flats. Later, in editing, they could push the saturation, add a golden filter, and BAM, it would look like we were sweating in July. But while we were shooting, well, it was December in Canada.\n\n\"Rolling!\" yelled the assistant director, and wardrobe would rush in and apologetically remove the giant down coats from our shoulders. Everyone watched, hoping we could get the scene before our jaws locked or our shoulders unintentionally rose around our ears. Eventually, Leslie, our director, yelled \"Cut!,\"and the beautiful warm jackets reappeared.\n\nWanting to be the most professional I could be, I sniffed back the snot that was threatening to ruin every take and forced my shoulders to stay where they were, even though I could see my breath on the air. I looked around: Lucy, Ashley, and Shay all seemed cold but fine; they looked professional, powerful. Was I not cut out for this? I pushed that thought out of my mind. Suck it up, Bellisario, do your job.\n\nThere came a point when I mentioned offhand, \"Huh, I can't feel my feet.\" \"Stop!\"a voice screamed, and an angel in the form of a crew member descended upon me and demanded I follow her inside the church we were shooting near.\n\nShe sat me down, removed my shoes, and began to rub my feet. She asked me to let her know when I had feeling in them again. \"Don't worry about my feet! They're fine!\"I tried to sweetly wiggle away from her, my eyes flitting to the crew that was waiting nearby. I was holding up production, a production that costs thousands of dollars per minute, all for my stupid comment about my stupid toes. I started to panic: Everyone is going to think I'm a diva, that I can't hack it, that I'm a horrible actor, and they'll never want to work with me again.\n\nI am practiced at ignoring [my disease], for the most part, but it's still there, finding new ways to undermine me.\n\nBut the angel remained resolute. She told me that she had worked with people who had lost toes to frostbite, and she wasn't about to see me lose mine. Eventually, I announced (truthfully) that the feeling in my feet had returned, and she let me go.", "images": ["https://www.lennyletter.com/verso/static/lennyletter/assets/logo-header.c98e4b0ddbdc36ae916b8841a430f48bfcc366ef.svg", "https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/16:9/w_1280,c_limit/1500040609-imenough-wentingli.jpg", "https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/master/w_2560%2Cc_limit/1500040609-imenough-wentingli.jpg", "https://www.lennyletter.com/verso/static/lennyletter/assets/logo-reverse.92a7056c980a0ecd4f5e08e6fc75b5d0486d35b7.svg"], "top_img": "https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/16:9/w_1280,c_limit/1500040609-imenough-wentingli.jpg", "keywords": [], "authors": ["Troian Bellisario", "Troian Bellisari"], "canonical_link": "https://www.lennyletter.com/story/troian-bellisario-reveals-mental-health-struggle", "title": "Troian Bellisario Gets Real About Her Struggle with Mental Health", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Troian Bellisario", "copyright": "Copyright (c) Condé Nast 2020", "description": "The Pretty Little Liars star on learning to listen to her body instead of the punishing voice in her head.", "id": "5a2467c3cc9b95000f85847b", "keywords": "health,troian bellisario,mental health,career", "news_keywords": "health,troian bellisario,mental health,career", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a2467c3cc9b95000f85847b", "parsely-metadata": "{\"description\":\"The Pretty Little Liars star on learning to listen to her body instead of the punishing voice in her head.\",\"image-16-9\":\"https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/16:9/w_1000,c_limit/1500040609-imenough-wentingli.jpg\",\"image-1-1\":\"https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/1:1/w_1000,c_limit/1500040609-imenough-wentingli.jpg\"}", "og": {"description": "The Pretty Little Liars star on learning to listen to her body instead of the punishing voice in her head.", "image": "https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/16:9/w_1280,c_limit/1500040609-imenough-wentingli.jpg", "site_name": "Lenny Letter", "title": "Troian Bellisario Gets Real About Her Struggle with Mental Health", "type": "article", "url": "https://www.lennyletter.com/story/troian-bellisario-reveals-mental-health-struggle"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@lennyletter", "description": "The Pretty Little Liars star on learning to listen to her body instead of the punishing voice in her head.", "domain": "https://www.lennyletter.com", "image": {"src": "https://media.lennyletter.com/photos/5a2464309ce6da000fcaa26c/16:9/w_1280,c_limit/1500040609-imenough-wentingli.jpg?mbid=social_retweet"}, "site": "@lennyletter", "title": "Troian Bellisario Gets Real About Her Struggle with Mental Health"}, "fb": {"app_id": 966242223397117, "pages": 647518172048219}}, "movies": [], "publish_date": null, "source": "https://www.lennyletter.com", "summary": ""}