{"url": "https://www.tvguide.com/news/the-bachelorette-rachel-hometown-dates-recap/", "text": "If a playwright were to dramatize Dean's Bachelorette hometown date, they would win a Pulitzer. The family drama was that intense. There were so many levels to everyone's pain. Dean wanted to finally have a real conversation about his mother's death a decade ago and how his father wasn't there when he needed him, but he waited to do it until he was in front of TV cameras. His father, who was clearly even more affected by Dean's mother's death than he can express, couldn't talk about it and clearly wasn't prepared for the raw emotion Dean came to him with. They were both obviously in so much pain that it hurt to watch them. And Rachel was caught in the middle.\n\nBefore we really get into that date, though, there were three other hometown dates to discuss.\n\nFirst was Eric's in Baltimore. Eric famously introduced himself as being from Baltimore, but throughout the season he was identified by where he lives now. Odd. Other seasons, guys have been identified by their hometowns instead of Los Angeles or wherever they actually live. But not Eric, which has been a little disorienting, because he's so Baltimore. When he was there he slipped back into a Baltimore accent.\n\nRachel and Eric, The Bachelorette Photo: Randy Sager, ABC\n\nI like Eric and his family. Eric seems like he's had a lot of therapy to work through his tough upbringing and came out better for it. I'm glad he's sticking around.\n\nNext up was Bryan in Miami. As foreshadowed last week, Bryan's mother is INTENSE. She said Bryan is her life and warned Rachel that she is marrying the family, too. She revealed a paranoid thought about how a wife can take a husband away from his family if she wants, which shows that she has some unhealthy competitive feelings toward other women in her son's life.\n\n\"If he's happy, I'm happy. If not, I will kill you,\" she said. It was a joke, but Rachel took a beat too long to laugh because she wasn't sure if she was kidding. She won't literally murder her, but she'll definitely make her life difficult. She cried when she said, \"This morning I went to mass because I was asking God if you were the one.\" She cried like five times in the 15 minutes we spent with her.\n\nBryan's mother is obviously an impossible person and she will make any woman's relationship with Bryan difficult. If Rachel chooses Bryan she better really love him.\n\nBryan and Rachel, The Bachelorette Photo: Rodrigo Varela, ABC\n\nNext up was Peter's in Madison, which was boring. It was revealed that Peter has eight black friends, which he is proud of, and his mom has a \"can I speak to the manager\" haircut.\n\nBut the main event was Dean's hometown date, which was a rare Bachelorette event that lived up to the Chris Harrison \"most dramatic event in history\" hype. The family dynamics were fascinating and riveting in a voyeuristic way. It felt like if we were to be watching something so intimate, it should be in a more serious setting like Intervention or something.\n\nDean hadn't spoken to his father in two years, and then he came to his house with a camera crew. He had spent much of his time with Rachel talking about how traumatized he was after his mother's death when he was 15, and how his father wasn't there for him, and how his family had fractured. He mentioned that his father had changed into an \"eccentric\" man who wasn't even really his father anymore. And then we saw it — a white man who had converted to Sikhism named Paramroop Singh Khasa.\n\nThe date followed a perfect dramatic narrative structure. Dean and Rachel came in and things were polite and people acted like nothing was wrong, although Dean was barely holding it together and making comments questioning his father's lifestyle. He said flat out, \"I'm suppressing every single emotion I'm trying to feel.\" They laid on the floor and meditated while Paramroop banged a gong. Paramroop gave Dean and Rachel feathers that symbolized Dean's mother Debbie and he started crying as he talked about the wife of 27 years he lost, and his current wife said he never got emotional like that. Rachel was moved. They ate food Paramroop had prepared, and Dean said he'd ate before he came. The bitterness and resentment was coming to the surface. End of Act I.\n\nRachel and Dean, The Bachelorette Photo: Josh Vertucci, ABC\n\nRachel talked to Dean's sister, who said her brother had been through so much. Inside, Dean and his father finally sat down to talk, and Paramroop said, \"I must be a pretty great dad, because look at my son,\" and Dean couldn't hold it in anymore. He tried to engage his father about how he felt emotionally abandoned by him and about how angry he still was about it. Paramroop got defensive, saying he couldn't understand his frustration because he'd never had a mother die, and besides, he had his own anger about losing Debbie.\n\nIt seems like it was the most Paramroop had ever said to Dean about what he went through. \"It was horrible watching your mother die,\" he said. \"Watching her stop eating, watching her shrivel, just to see her get smaller and smaller.\" He said how he worked so hard to provide for the family while Debbie did the emotional work of the home, and then the home they'd built was gone.\n\n\"I didn't love you, is that what you're saying?\" he said, like he was throwing a dart at his son. Dean said that at the time he needed him to be more maternal. Paramroop said that he didn't know how, all he knew was how to make money and provide that way. Then he couldn't talk about it anymore and got pretty hurtful.\n\n\"In my teaching, we believe the other person is you, so whatever you think of me is really what you think of yourself,\" he said, literally pulling the holier-than-thou card to dismiss Dean's feelings.\n\n\"What is there to work through, Dean?\" he said.\n\n\"I love you regardless,\" said Dean.\n\n\"Whatever,\" Paramroop sighed. He went outside and threw his drink in the grass. That was the end of Act II.\n\nRachel came up to him.\n\n\"Can I talk to you for a second?\" she said.\n\n\"If you must,\" he answered. \"I'm really kinda done.\"\n\nShe tried to talk to him about how much she cared about his son, and he started to engage, but then he looked at the camera and couldn't keep going.\n\n\"I didn't realize he had such harsh feelings about me still,\" he said. He told Rachel that as her and Dean's relationship progresses, she's welcome to come back and they can get to know each other. But otherwise, his night is over.\n\nRachel went inside and found Dean laying on the floor. She snuggled up next to him and told him about what his sister said. He laid there and felt the distance between him and his father. But Rachel was very close. \"I know that I'm falling in love with you,\" he said. \"I'm falling in love with you too,\" she murmured. They made out, and then he put her in an SUV and she drove away while he stood in the rain. The end. And it was an ambiguous ending, like this kind of play always has.\n\nI'm not going to get too deep into armchair psychiatry about how Paramroop's spiritual reinvention is an attempt to deal with his pain that doesn't get to the root problem and he's clearly still sick and suffering. And I'm not going to get too deep into why Dean felt like this show was the way to try to deal with his family issues. All I'll say is that these are very complex people and I empathize with their immense pain and I hope they can find some relief someday. They definitely need therapy. I'll also say that this was some excellent reality television and Dean's story has been the most well-told of any I've seen on The Bachelor or The Bachelorette.\n\nThe episode ended with a rose ceremony where Rachel said goodbye to Dean. She doesn't think he's ready. He's too young for her. We knew this all along. But it's pretty bad that she told him she was falling in love with him and then sent him home a few days later. A rare misstep on Rachel's part. He was angry. But something tells me he'll be fine. He's been through worse.\n\nThe Bachelorette airs Mondays at 8/7c on ABC.", "images": ["https://tvguide1.cbsistatic.com/i/r/2020/04/16/565eda06-3941-42fa-b7fc-d930aee08f41/crop/1380x1380+345+0/thumbnail/70x70/4b41f885e39268c832df50f93dcc84c5/pdcoa-1-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/07/05/bc91406b-3a01-4435-aee9-43c1dbd39980/crop/1380x1380+345+0/thumbnail/70x70/c42dde18b65265a935b0ebab8df274fb/170705-news-broadchurch.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/01/03/923b13d6-3282-4843-a171-21faced10985/crop/220x220+90+0/thumbnail/64x64/e7bba1091c020fad81e1c35ba5c67edc/best100shows.png", "https://tvguide1.cbsistatic.com/i/r/2020/03/30/af5b983a-0607-4360-b289-d0abd98d9bd6/crop/450x450+180+0/thumbnail/70x70/7c04a71635e3f0d825c961f272e7572e/200330-tiger-king-hp.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/1ced518e-b4cf-4436-b8dc-4ba119b7d796/crop/1380x1380+345+0/thumbnail/70x70/b4262d63c01e8fee3fb0cb11249be109/200415-wwdits.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/a-b/thumbs/bryan-abasolo-1067241_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2019/10/18/13f3374e-121e-4076-a965-25b39d80f359/crop/113x113+44+0/thumbnail/64x64/bf3ac71eb6c1e855f44b57941e2fa3bc/botd-small.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/16/4acca96b-e6f0-47d1-937b-0fc170ca8fbf/crop/768x768+316+0/thumbnail/64x64/75984ad9c47e168d02ada156753aea77/200316-streaming-header.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/04/13/345ae1e9-49f3-466b-b122-f444fa426c1c/crop/810x449+0+0/thumbnail/240x133/8f715235a1eb3c4f097109f6ce3d6a39/180413-kylechandlerfridaynightlights-hpsm.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://tvguide1.cbsistatic.com/i/r/2020/03/19/a704c117-cd63-4e73-bd2b-e642ebfeabde/crop/1380x1380+345+0/thumbnail/64x64/0b19d9a21f9e3babd4f91f0332011d86/feelgoodshows-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/08/b47c62ea-c071-4943-9af0-3ec30214f190/crop/1380x1380+345+0/thumbnail/64x64/ef6c75665c8a3dd657d67933e7c05632/191107-supernatural-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/22/3ee64a21-6fa9-40ab-ab73-63b7f8398081/crop/768x768+316+0/thumbnail/64x64/626c97834f395b4c04437030da2d91d6/streamingshow-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/02/12/d50dc4eb-048c-46a7-a10b-6612702aa280/crop/1380x1380+345+0/thumbnail/70x70/b946d714a340f58fc03a96538dca2b5b/200213-prodigal-son-superlatives.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/27/3fad4b53-a36e-4293-b6ce-ccefad29ffcd/crop/810x449+0+0/thumbnail/240x133/cad5df011ab1dd8b351cd24feada7c86/190627-one-day-at-a-time-hpsm.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/p-r/thumbs/rachel-lindsay-1015966_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2020/01/12/ceb0da6a-93ad-49f7-938a-28d551bde55d/crop/450x450+180+0/thumbnail/70x70/0de32324bb3e93d698553f52955d65b3/sbtb-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/07/17/43add529-5386-4700-8105-e3d4889a8c74/thumbnail/1300x867/6517cbfc72deb1490eefd906532f5eb9/170717-the-bachelorette.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/05/e7406a34-3c0a-4bc9-a6c5-c78b9fc15206/crop/2070x1147+0+0/thumbnail/240x133/33366fa0427b5fbcd05d82d4d88bb082/stranger-things-reg.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/12/01/96c48961-ca4f-4b28-b527-8671dead3c25/crop/450x450+180+0/thumbnail/70x70/845f18917d00275750e9fdf4fa575dea/yoda-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/82faad20-77d8-4a9e-822a-45cfbbd511a1/crop/2070x1147+0+0/thumbnail/240x133/824ebe929b742c271435470c8ce0eec8/200415-blackaf.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/tvshows/100000-199999/thumbs/100447-the-bachelorette_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2018/01/26/655ca22a-13c4-4792-9064-69485e432cb7/crop/450x450+180+0/thumbnail/70x70/7342b085915e1f180f5a9f27a6772d79/180125-schitts-creek-annie-murphy-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/08/d0d677a3-6ae0-42a7-a3e0-97afef3f110e/crop/450x450+180+0/thumbnail/70x70/6ea81c93896c18de5e6a87a77328475b/snl-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/12/13/a90a16b6-6ea8-4d66-80f7-54bd3e813b86/crop/1380x1380+345+0/thumbnail/64x64/a03f5a19631705481b2d6511b4e5ed50/191213-tatb2.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/20/34eef86e-4f48-4135-8b87-1958ef4a7d87/crop/450x450+180+0/thumbnail/70x70/6225df71d218139e69d9100bb5108d9a/onward-hpsm.jpg"], "top_img": "https://tvguide1.cbsistatic.com/i/r/2017/07/17/43add529-5386-4700-8105-e3d4889a8c74/thumbnail/1300x867/6517cbfc72deb1490eefd906532f5eb9/170717-the-bachelorette.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tvguide.com/news/the-bachelorette-rachel-hometown-dates-recap/", "title": "The Bachelorette Hometown Dates Recap", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-itunes-app": "app-id=333647776, affiliate-data=at=11l9QE, app-argument=https://www.tvguide.com/news/the-bachelorette-rachel-hometown-dates-recap/", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "description": "Bryan's mother and Dean's father are the focal points of an intense set of hometown dates", "og": {"title": "The Bachelorette Went Full-On Family Psychodrama | TV Guide", "type": "article", "url": "https://www.tvguide.com/news/the-bachelorette-rachel-hometown-dates-recap/", "image": "https://tvguide1.cbsistatic.com/i/r/2017/07/17/43add529-5386-4700-8105-e3d4889a8c74/thumbnail/1300x867/6517cbfc72deb1490eefd906532f5eb9/170717-the-bachelorette.jpg", "description": "We've never seen anything like Dean's hometown date on The Bachelorette before", "site_name": "TVGuide.com"}, "article": {"published_time": "2017-07-17T22:00:00-04:00", "tag": "Summer TV"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "title": "The Bachelorette Went Full-On Family Psychodrama | TV Guide", "description": "We've never seen anything like Dean's hometown date on #TheBachelorette before", "creator": "@liamaathews", "image": {"src": "https://tvguide1.cbsistatic.com/i/r/2017/07/17/43add529-5386-4700-8105-e3d4889a8c74/thumbnail/1300x867/6517cbfc72deb1490eefd906532f5eb9/170717-the-bachelorette.jpg"}}}, "movies": [], "publish_date": 1500343200.0, "source": "https://www.tvguide.com", "summary": ""}