{"url": "https://staging.omgcheckitout.com/search-warrants-reveal-prince-mislabeled-pills-paisley-park/", "text": "Almost a year after Prince was found unconscious in his Paisley Park home, search warrants from the investigation of his death were released on Monday, revealing that prescription medications were found all over his house, NBC News reports.\n\nAccording to reports by E!, the documents filed last year provide clearer view into the days leading up to the star’s accidental opioid overdose, including medications he acquired without prescriptions. According to the affidavits, substances were found within the compound, particularly in places that Prince regularly visited, like his bedroom and laundry room. Many pills were found stored in bottles for other medications, often in vitamin bottles. Per NBC News, some were in a suitcase labelled with a Prince alias, Peter Bravestrong, along with a handwritten lyrics to the 1987 hit “U Got The Look.”\n\nAccording to E!, several medications were prescribed to Prince’s longtime friend and aide, Kirk Johnson. Dr. Michael Todd Schulenberg, who saw Prince twice before his death, arrived on the premises on April 21 to drop off test results and when later questioned by authorities, NBC News reports he confessed that he prescribed oxycodone on April 16, 2016, the same day that the pop star’s plane made a post-concert emergency landing when he “passed out” while aboard after taking pain killer medication.\n\nWarrant says that Schulenberg told investigators he put it under Johnson’s name “for Prince’s privacy.” The doctor’s attorney, however, said in a statement that he “never directly prescribed opioids to Prince, nor did he ever prescribe opioids to any other person with the intent that they would be given to Prince.”\n\nAccording to NBC News, investigators discovered a suitcase next to Prince’s bed and found at least two bottles with pills prescribed by Schulenberg under Johnson’s name on April 7: the anti-nausea drug ondansetron hydrochloride in a Vitamin D bottle, and the painkiller Percocet in a bottle labeled as ondansetron.\n\nAccording to E!, documents stated that Johnson contacted Schulenberg to ease Prince with hip pain, for which he prescribed clonidine, hydroxyzine pamoate and diazepam, medications typically used for anxiety and high blood pressure. Johnson picked up the medicines the day before Prince’s death and claimed it “was the first time he had ever done something like that for Prince.”\n\nJohnson told investigators he was “unaware Prince was addicted to pain medication.” But Andrew Kornfeld, the son of Dr. Howard Kornfield, who founded the Recovery Without Walls told detectives that Johnson had contacted them because the famed musician was struggling with opiate use, E! reports.\n\nPer search warrants, Andrew was visiting the compound on the day of Prince’s death to determine if the singer could be a candidate of their program. He was also found to be carrying several envelopes containing pills when he came to Paisley Park on that day, but did not have any prescriptions for them and is not a licensed doctor. He denied to officials that he had any intention of treating Prince with the medication.\n\nOther revelations in the warrants, as per NBC News, stated that Prince communicated via his landline phone and through email, he stopped using cellphone after being hacked. Authorities also learned he had been in a romantic relationship with singer-songwriter Judith Hill since 2014. Hill was with Prince when he was briefly hospitalized after his plane made an emergency landing. Prince didn’t have a regular doctor for most of his career and his team would arrange for a various doctors to give him B-12 shots before his performances.\n\n“The investigation remains active at this point,” The chief deputy for the Carver County Sheriff’s Office Jason Kamerud told The New York Times. “We’ve gained a lot of progress over the last year, but there still is some more work to be done.”", "images": ["https://shaistest.wpengine.com/wp-content/uploads/2016/12/logo_transparent_background_small.png", "https://staging.omgcheckitout.com/wp-content/uploads/2018/02/shutterstock_8458104as-324x400.jpg", "https://staging.omgcheckitout.com/wp-content/uploads/2017/12/shutterstock_9049606p-100x70.jpg", "https://staging.omgcheckitout.com/wp-content/uploads/2017/07/shutterstock_8847999bb-100x70.jpg", "https://staging.omgcheckitout.com/wp-content/uploads/2018/03/shutterstock_9438996w-100x70.jpg", "https://staging.omgcheckitout.com/wp-content/uploads/2017/04/Prince-performing-at-Coachella-2008.-By-Micahmedia-CC.jpg", "https://staging.omgcheckitout.com/wp-content/uploads/2018/03/shutterstock_9475376gk-100x70.jpg"], "top_img": "https://staging.omgcheckitout.com/wp-content/uploads/2017/04/Prince-performing-at-Coachella-2008.-By-Micahmedia-CC.jpg", "keywords": [], "authors": [], "canonical_link": "https://staging.omgcheckitout.com/search-warrants-reveal-prince-mislabeled-pills-paisley-park/", "title": "Search Warrants Reveal Prince Had Mislabeled Pills All Over Paisley Park", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": {"identifier": "https://staging.omgcheckitout.com/wp-content/uploads/2017/04/Prince-performing-at-Coachella-2008.-By-Micahmedia-CC.jpg", "secure_url": "https://staging.omgcheckitout.com/wp-content/uploads/2017/04/Prince-performing-at-Coachella-2008.-By-Micahmedia-CC.jpg", "width": 267, "height": 400}, "locale": "en_US", "type": "article", "title": "Search Warrants Reveal Prince Had Mislabeled Pills All Over Paisley Park", "description": "Almost a year after Prince was found unconscious in his Paisley Park home, search warrants from the investigation of his death were released on Monday,", "url": "https://staging.omgcheckitout.com/search-warrants-reveal-prince-mislabeled-pills-paisley-park/", "site_name": "OMG Check It Out !"}, "description": "Almost a year after Prince was found unconscious in his Paisley Park home, search warrants from the investigation of his death were released on Monday,", "article": {"publisher": "https://facebook.com/omgcheckitout", "section": "Entertainment", "published_time": "2017-04-19T09:47:02+00:00"}, "twitter": {"card": "summary", "description": "Almost a year after Prince was found unconscious in his Paisley Park home, search warrants from the investigation of his death were released on Monday,", "title": "Search Warrants Reveal Prince Had Mislabeled Pills All Over Paisley Park", "site": "@OMG_CheckItOut", "image": "https://staging.omgcheckitout.com/wp-content/uploads/2017/04/Prince-performing-at-Coachella-2008.-By-Micahmedia-CC.jpg", "creator": "@OMG_CheckItOut"}, "theme-color": "#bc2025", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1492595222.0, "source": "https://staging.omgcheckitout.com", "summary": ""}