{"url": "http://time.com/money/5136679/olympic-figure-skating-costs/", "text": "When Elise Freezer is gliding gracefully through her routine—landing jumps and nailing her favorite move, the layback spin—it makes all the work and sacrifices worth it. Three perfect minutes on the ice at a competition, and she’s happy for the next two months, she says.\n\nThis 11-year-old figure skater has Olympic-sized dreams. But getting there, of course, won’t be all smiles. For her, it will take hundreds of hours skating and conditioning off-ice, skipping a traditional school schedule, rehabbing through painful injuries, and traveling frequently to compete against other top talent.\n\nFor her parents, it will require years of careful budgeting and carry a six-figure price tag.\n\nIt takes gold to compete for gold, after all.\n\nIt’s true in nearly every sport. Coaching fees, travel expenses, and physical therapy and athletic conditioning to keep the body operating at elite levels add up. But figure skating is among the priciest, with costs running more than $35,000 a year and as much as $50,000 annually by some estimates.\n\n“It’s a huge sacrifice for families,” says Jerod Swallow, a five-time national champion ice dancer and two-time Olympian who now manages the Detroit Skate Club.\n\nWhere the Money Goes\n\nElite figure skaters generally train six days a week for hours at a time, skating, dancing, and conditioning to nail down a program that lasts less than five minutes.\n\nAfter a figure skater advances past beginner levels, private coaching fees range from $65 an hour to up to $120 an hour for a coach who’s trained successful international competitors. It’s common today to work with multiple coaches throughout the week, alternating between those who specialize in certain skills such as spins or jumps. Figure skaters also have to pay for their time on the ice—between roughly $20 and $40 a day, depending on the arena and how much time they spend on the ice.\n\nChoreography for a program is a separate fee, generally running between $1,500 and $5,000, Swallow says. And while skaters might occasionally use one program for two years, they generally perform a new routine each year for both the short and long skate events.\n\nFamilies also fork out for ballet or ballroom dancing lessons, private training in the gym, even acting lessons for skaters who want help learning how to convey certain emotions with facial expressions, says Jennifer Freezer, Elise’s mother.\n\n“It’s the entire package that counts,” Freezer says. “You can land beautiful jumps, but if you’re missing the performance, you’re missing half of it.”\n\nThat’s why figure skaters also pay a pretty penny for hand-sewn costumes that help tell the story of their program. Freezer spent $2,500 on a Rey-inspired costume for a Star Wars-themed program Elise skated last year. At the higher level of competition, figure skating dresses can easily reach up to $10,000.\n\nFigure skates, the other major equipment expense, are often covered through sponsorships once a skater reaches Olympic caliber. But without a sponsor, high-quality, custom-made boots would cost between $800 and $1,000. Blades add on an additional $1,000. Ice skaters, who do more jumps than ice dancers, can go through a couple pairs of boots a year, Swallow says.\n\nTravel expenses add up, too. Figure skaters on the cusp of making the international Grand Prix circuit travel to a handful of domestic competitions a year. Families not only pay their own way, but also cover their coach’s travel expenses and pay coaching fees while at the competition.\n\nThat last charge—which coaches charge to make up for lost wages while traveling—often shocks families the first time, Swallow says.\n\nSpecialized Medical Costs\n\nThen there are the health care costs. Figure skaters train hard to make the moves look effortless, but it’s actually an incredibly strenuous sport. Skaters have to build incredible momentum to be able to rotate their bodies three or four full times in the air in matter of seconds. Research from Brigham Young University found the force required to pull off such jumps puts between five and eight times a skater’s body weight on their ankles and feet every time they land—and that’s dozens of times a day in practice. (Nathan Chen, a favorite to reach the podium in the men’s singles competition, includes a record five quadruple jumps in his four-and-a-half minute program.)\n\nThe toll the sport takes on athletes’ bodies adds medical bills to the training expenses. Stress fractures, knee injuries, and hip problems are most common. At 11, Elise Freezer has already had knee surgery and recovered from a torn hamstring. She’s now working five days a week with a personal trainer to better prepare her body for the rigors of increased training, says Jennifer Freezer.\n\nEven when an athlete is healthy, regular physical therapy or massages are a part of the routine that keep them competing at the highest levels.\n\n“You’re on a first-name basis with your physical therapist,” Jennifer Freezer says.\n\nWhat You Make When (or If) You Win\n\nFigure skating is one of the highest-profile sports at the Winter Olympic Games, and the sport’s national governing body is comparatively large and wealthy. So, a figure skater’s earning potential is larger than, say, a cross-country skier or biathlete, says Peter Carlisle, a sports agent who exclusively represents Olympians.\n\nStill, only a fraction of figure skaters make enough to even begin to pay off the money they’ve poured into the sport. Figure skaters who place in international competitions at the senior level earn prize money ranging from $2,000 to $45,000, depending on the competition and where they place.\n\nA few can also score sponsorship deals leading up to Olympic years to help offset expenses, especially if they’re in contention for gold. (Elise Freezer got a small taste of that when she snagged a paid gig in a commercial advertising OnUp.com, a website with budgeting tools sponsored by SunTrust.)\n\nCarlisle estimates less than 5% of Olympic athletes overall can achieve the sort of name recognition and athletic success that will let them support themselves through prize money and sponsorships. Instead, most athletes have to cobble together their own sources of funding through part-time work, family funds, and community support.\n\nOther Funding Options\n\nFigure skaters do have access to limited funding through U.S. Figure Skating. During the 2016-17 season, the organization says it spent $14.5 million—nearly 80% of its budget—on athlete assistance, which helped to send 500 figure skaters to 35 international competitions.\n\nBut the amount a figure skater can receive is based on their performance history the prior year—in other words, it’s the highest-performing skaters who are eligible for the most money. And athletes have to pay bills up front, even borrowing money if needed to do so, and then submit their expenses for reimbursement. (The organization also runs a donation program, Destination PyeongChang, that aims to ensure every figure skater has at least one family member attending the Games.)\n\nOther skaters have turned to online fundraising to cover competition-related expenses, a growing trend among elite athletes. This year, a GoFundMe page aimed at sending skater Bradie Tenell’s family to South Korea caught the attention of United Airlines, which picked up the tab for her mom, a single mother who works as a nurse, and her two teenage brothers.\n\nThere are also nonprofit groups dedicated to helping athletes fund their competition. Carlisle helped Olympian Ross Powers set up the Level Field Fund charity, which provides grants to athletes who otherwise wouldn’t be able to afford attending major qualifying competitions. Fourteen athletes who’ve benefitted from the fund will compete in PyeongChang, though no awards yet have gone to figure skaters.\n\nFamily Support\n\nWhen figure skater Jeremy Abbott was competing internationally, funding from U.S. Figure Skating was a big help, says his mother, Allison Scott. Even so, she adds, that money covered about a third of the skating expenses for Abbott, a two-time Olympian and four-time national champion.\n\n“The biggest misconception in the expenses is that once you hit the Olympic level, everything is taken care of,” says Allen Scott, Abbott’s stepfather. “It’s not.”\n\nJeremy Abbott of the United States Figure Skating team poses at the Olympic Park ahead of the Sochi 2014 Winter Olympics on February 4, 2014 in Sochi, Russia. Scott Halleran—Getty Images Scott Halleran—Getty Images\n\nTo keep up with the cost of figure skating, along with college expenses for two older children, Allison and Allen Scott worked two jobs each. He switched careers to start working for United, which provided discounted travel to out-of-town competitions. Allison Scott drove about 500 miles round-trip on weekends so Abbott could advance his training in Colorado Springs. Driving through Colorado winters meant the trip sometimes dragged into seven or more hours each way. (The family eventually relocated to Colorado Springs.) For years, the Scotts skipped traditional vacations, instead using any time off work to send at least one of them to competitions, everywhere from Tokyo to Torino.\n\nThe higher the level of competition got, the higher the costs went. To make it work, the Scott family refinanced their home three times and then took out a second mortgage in 2005. In fact, one running family joke goes something like this: The good news is you’re in the will to inherit the house. The bad news is it won’t be paid off until 2068.\n\nJokes aside, figure skating is a wildly expensive sport, and the reality is that managing the financial side is far from easy, Allison Scott says.\n\nBut “seeing your kid do what they really love to do,” she says—”that’s the best return on investment a parent could ask for.”", "images": ["https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-jeremy-abbott.jpg", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-bradie-tennell.jpg?quality=85"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-bradie-tennell.jpg?quality=85", "keywords": [], "authors": ["Kaitlin Mulhere"], "canonical_link": "https://money.com/olympic-figure-skating-costs/", "title": "This Is the Insane Amount of Money It Takes to Become an Olympic Figure Skater", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "olympics 2018", "news_keywords": "olympic figure skating, olympic team figure skating, figure skating olympics, figure skating costs, figure skating expenses, how much is a figure skating dress, how much do figure skates cost", "description": "Figure skating is one of the most popular sports at the Winter Games. Here's how much it costs to train, dress and prepare for the Olympics.", "og": {"title": "This Is the Insane Amount of Money It Takes to Become an Olympic Figure Skater", "type": "article", "site_name": "Money", "url": "https://money.com/olympic-figure-skating-costs/", "description": "$10,000 for a skating dress. $1,500 to $5,000 to get a routine choreographed.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-bradie-tennell.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/olympic-figure-skating-costs/", "description": "Figure skating is one of the most popular sports at the Winter Games. Here's how much it costs to train, dress and prepare for the Olympics.", "media": "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-bradie-tennell.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/olympic-figure-skating-costs/", "title": "This Is the Insane Amount of Money It Takes to Become an Olympic Figure Skater", "description": "$10,000 for a skating dress. $1,500 to $5,000 to get a routine choreographed.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/02/180209-cost-olympic-figure-skater-bradie-tennell.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}