{"url": "nypost.com/2018/07/01/meghan-markle-has-gone-from-chic-to-a-fashion-disaster/", "text": "Ever since she said “I do” to Prince Harry on May 19, Meghan Markle has been under pressure to adhere to royal protocol — and look good doing it.\n\nBut for the past six weeks, the new Duchess of Sussex’s fashion selections have come under fire: from her choice of sheer pantyhose to the tailoring of her dresses to her oversize pumps. Drawing particular ire was a blue and white Oscar de la Renta dress that she wore on June 17 to the wedding of Harry’s cousin. The internet caught fire with incendiary criticisms of the $5,490 frock’s too-long sleeves and ill-fitting torso.\n\nOn Twitter, it was compared to both a sack of potatoes and the “Gone With the Wind” scenes where Scarlett O’Hara fashions a dress from curtains.\n\nThe public disappointment with these perceived missteps may stem from the fact that the duchess is dealing with the pressures and expectations of her new role largely on her own.\n\nBefore the wedding, Meghan had a secret style weapon: her best friend, Jessica Mulroney. Now, it seems they’re not working together as closely, and it shows.\n\nThe Toronto-based professional stylist is credited with advising the then-actress on her wardrobe choices and introducing her to new designers. As a result, Meghan was praised for her casual, chic style, as she embraced hip Canadian labels such as Erdem. When she wore ripped Mother jeans, a white “boyfriend” shirt by Misha Nonoo and an Everlane tote for a date with Harry this past September, all three pieces saw an immediate sales spike.\n\nBut with Mulroney in Canada (where Meghan lived while starring in “Suits”) and the duchess, 36, in England, the new royal has been left to live up to the royal rules of decorum on her own.\n\n“The royal family is a firm and the protocol is huge,” said British designer Caroline Castigliano. “We’re seeing everything about Meghan change. It’s very difficult when you’re 36 to do this — it’s far easier when you’re in your early 20s and they can mold and adapt you. It’s a much bigger job for Meghan. It must be unbelievably difficult that Meghan was a working woman and had her own style.”\n\nSo it’s out with the ripped jeans and messy bun, in with the oh-so-modest below-the-knee dresses. Goodbye to the casual totes and body-cross bags, hello to ladylike little clutches.\n\nGone is the Meghan who dared to wear a very sexy, sheer and metallic gown by Ralph and Russo for her engagement photos.\n\nOne of the biggest changes has been to her palette. Previously, Meghan wore plenty of bold hues: scarlet red, midnight blue, forest green, plus rich plaids and stripes. Now, she all but fades into the background in white, cream and the palest of pinks. Royal watchers say the wallflower look is in deference to Queen Elizabeth, to whom the duchess has been seen cozying up at recent public events.\n\n“If you’re going to be seen with the queen, who wears bright colors, then this neutral palette she’s been sticking to is really a measure of respect,” said Castigliano. “This much more demure, classic look is absolutely right on key to what she needs to fit in with the family.”\n\n“At events with the queen, she lets Her Majesty shine,” said William Hanson, an expert on British etiquette. “The queen is top of the bill. Meghan is on the bill, not top of the bill.”\n\nWith Mulroney back in Toronto, it seems Meghan has someone else guiding her, at least a bit.\n\n“At the moment, she’s really dressing like Kate,” Castigliano said of Meghan’s sister-in-law, the Duchess of Cambridge. “At this stage, Kate is probably giving her tons of advice on how to fit in.”\n\nSources say that Kate’s assistant, Natasha Archer, has been calling in clothes from designers for Meghan until she hires an assistant of her own.\n\nOne big difference, one source pointed out, is that Kate’s clothes “fit her like a glove” because all the designers know her sizing, while Meghan is still developing her relationships.\n\nInternet critics cluck that the clothes have too often been unflattering: frumpy waistlines, too-long sleeves, hems that hit at an odd point on her calves and a series of hats and fascinators that seem to age her. The wags even latched on to Meghan’s shoes appearing to be too big and gaping at the heel and toe.\n\nAs it turns out, there’s a good reason why. Fashion expert Harriet Davey told the Sun this week that “celebs often go a size up, or even two, in the shoe department when they’re at an event or on the red carpet . . . to avoid blisters.”\n\nAccording to Hanson, Meghan will almost certainly have to find a stylist soon: “I believe that the Duchess of Cambridge did not have a stylist at first and very much said, ‘I’m going to do this myself,’ but soon realized she needed some help. I believe Catherine now has a stylist, at least part time, and that’s highly likely what will happen for Meghan.\n\n“[She] has a big tour in Australia, New Zealand, Fiji and Tonga later this year and will need help,” he added. “In five months, Meghan won’t be making these minor mistakes.”\n\nCastigliano agrees. In fact, she predicts that the duchess will slowly make a return to the stylish, youthful Meghan with whom the public first fell in love.\n\n“Over the next year, Meghan will have more designers throwing themselves at her, and she will adapt her style,” she said. “It will be fabulous when she takes everything she learns and ‘Meghan-izes’ it.”", "images": ["https://thenypost.files.wordpress.com/2018/04/pagesixapp_ad_300x250_v32x1.jpg", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=1200", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://thenypost.files.wordpress.com/2020/04/sephora.png?w=300&h=200&crop=1", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["July"], "canonical_link": "https://nypost.com/2018/07/01/meghan-markle-has-gone-from-chic-to-a-fashion-disaster/", "title": "Royal life is ruining Meghan Markle’s sexy style", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "Ever since she said “I do” to Prince Harry on May 19, Meghan Markle has been under pressure to adhere to royal protocol — and look good doing it. Lately, the Duchess of Sussex’s fashion choices have come under fire: from her use of sheer pantyhose to tailoring of her dresses to her oversize pumps.", "generator": "WordPress.com", "og": {"type": "article", "title": "Royal life is ruining Meghan Markle’s sexy style", "url": "https://nypost.com/2018/07/01/meghan-markle-has-gone-from-chic-to-a-fashion-disaster/", "description": "Ever since she said “I do” to Prince Harry on May 19, Meghan Markle has been under pressure to adhere to royal protocol — and look good doing it. But for the past six weeks, the new Duchess of Suss…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-07-01T13:21:09+00:00", "modified_time": "2018-07-06T17:35:35+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Royal life is ruining Meghan Markle’s sexy style"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=664&h=441&crop=1", "alt": "Meghan Markle in 2016 (left) and 2018", "src": "https://thenypost.files.wordpress.com/2018/06/meghan-markle-fashion-evolution.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Royal life is ruining Meghan Markle's sexy style", "description": "Ever since she said “I do” to Prince Harry on May 19, Meghan Markle has been under pressure to adhere to royal protocol — and look good doing it.\nBut for the past six weeks, the new Duchess of"}, "fb": {"pages": 225343690812937}, "nypost-section": "Fashion", "parsely-metadata": "{\"post_id\":\"nypost-12688126\"}", "keywords": "Fashion,kate middleton,meghan markle,prince harry,queen elizabeth ii,royal family,women's fashion", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 1530374400.0, "source": "http://nypost.com", "summary": ""}