{"url": "https://tvline.com/2018/12/16/outlander-recap-season-4-episode-7-down-the-rabbit-hole/", "text": "Need to catch up? Check out the previous Outlander recap here.\n\nBoth Brianna and Roger make the leap through time in this week’s Outlander, thank goodness. It’s been fun watching Jamie and Claire channel Bob Vila and all, but I’m ready for the Frasers and Rog all to be in one place (and century) so that the joyful reunions, tearful misunderstandings and 18th-century game of telephone* can get underway!\n\nOn a related note, this week’s episode brings back two characters we haven’t seen in a while: Frank and Laoghaire. For the first time, particularly in Laoghaire’s case, we see aspects of both that don’t come to light when the story is told from Claire’s perspective. Also: Nell Hudson doesn’t get nearly enough credit for how masterfully she plays Jamie’s ex-wife.\n\nBut wait, before I forget: Did Frank know Claire was destined to go back in time again?\n\nRead on for the highlights of “Down the Rabbit Hole.”\n\n*Don’t know what I’m talking about? You will, and soon!\n\nBRIANNA ARRIVES | Brianna, who definitely made it back to old-timey Scotland, walks through the Highlands in the snow. She occasionally consults an old map, but she’s a long way from anything even slightly resembling civilization. At one point, she falls and severely hurts her ankle; when she soaks it in an icy stream to stem the swelling, we see that it’s badly sprained. But she pushes on, limping along a road and sleeping under the stars. She’s able to start a fire using a box of matches she wisely brought with her from the future, and she dines on a peanut-butter-and-jelly sandwich.\n\nThe next morning, though, she’s in a lot of pain and looks rather ashen. As she lurches through the forest, she notices smoke from a house’s chimney in the distance. But before she can do anything about it, she passes out.\n\nBE LEERY, IT’S LAOGHAIRE! | Bree dreams/remembers herself as young girl, with Frank (hi, Tobias Menzies!) gently lifting her out of a car she’d fallen asleep in. When she actually wakes, she’s tucked into a bed in a cozy home, and Laoghaire — !!! — was her savior.\n\nThe wenchiest wench who ever wenched Laoghaire and Joanie were walking home, it turns out, when they found Bree near a tree. “We had no choice but to bring you home with us,” the older woman explains, introducing herself and her younger daughter and telling Bree she can stay as long as she needs to. Brianna tells them she’s from England but her parents are in North Carolina, and that she’s going to meet them there. “Marsali’s in North Carolina!” Joanie pipes up.\n\nA note before we move on: In Drums of Autumn, Brianna shows up at Lallybroch first. That’s where she meets Ian and Jenny, and her first interaction with Laoghaire is decidedly different (read: Bree knows who she is right away, and she shocks everyone by announcing that Laoghaire was behind the business at Cranesmuir. In short, they yell at each other a lot). “We had plans to go to Lallybroch and do certain things,” executive producer Matthew B. Roberts told me, “and then through actor availability we were unable to tell the story exactly the way that we wanted to. So we had to revamp.”\n\nSHIPPIN’ OUT | Back in 1969, Roger and Fiona drive to Craig na Dun. He’s shaved his beard and dressed in period garb in preparation for his trip, and he’s got money, a compass, a knife and some gemstones to see him safely into the past. As they walk toward the circle, he hears a buzzing, but Fiona can’t. “The stones dinna call to me,” she reminds him. They hug, then he walks toward the stone and puts his palms on it. Later, Fi!\n\nWe don’t see him again until he’s in the 1700s, seeking passage to the Carolinas. Oh look, Roger has found himself another knit cap. Joy. The captain of the Gloriana — wait a minute, it’s Stephen Bonnet! — says he’s going to Wilmington but isn’t accepting any more passengers. So Roger hoists a barrel over his shoulder to prove that he’s hale and hearty enough to join the crew. Bonnet looks amused, so he flips a coin to decide whether or not Rog can come aboard. When the toss comes out in Roger’s favor, Bonnet snarks, “There’s four ports before Wilmington. I hope she’s worth it.”\n\nA VERRA INTERESTING DEVELOPMENT | Her first night at Laoghaire’s, Ian comes to give Laoghaire some money. But it’s not the full amount of monthly alimony Jamie owes her, and she’s verra testy about that. The next morning, Bree dons one of Marsali’s dresses and comes to help Laoghaire and Joanie in the garden. That’s where the little girl tells her about her “Da,” who raised her but wasn’t her biological father. The two redheads bond over being brought up by good men who weren’t in love with their mothers.\n\nAnd that leads us to a very intriguing flashback set right around the time of Brianna’s high school graduation. The teen finds her father in his office at Harvard, drunk-ish and despondent. He won’t say precisely why, but when Bree asks what some papers on his desk are, we can see that he had a copy of Claire and Jamie’s death notice — the same one Roger and Bree found independently of each other — way back then. He brushes it off as “research from a colleague in Scotland,” and when she presses, only adding that it’s “complicated.” He eventually sends her home, and she leaves in a huff.\n\nTHIS IS INTERESTING, NO, OLDLANDERS? In the books, we learn that Frank knew Jamie survived the Battle of Culloden, but it’s unclear how much more research he did after that. But this slight change indicates that Frank not only knew Jamie eventually died in North Carolina… but that Claire was with him when it happened. So you can look at this scene as Frank realizing that no matter what he does, Claire is destined to leave him again and go back through the stones. It also might explain why — in Season 3 and in another flashback in this episode — he pushes so hard for Brianna to move to England with him: If Claire is going to leave them, they might as well make that break on their own terms, possibly sparing Bree a little of the pain? Or maybe he’s doing it to make things easier for Claire, to tie up some loose ends ahead of time?\n\nOf course, he doesn’t tell Brianna any of this. And when he announces the divorce and pitches the move, she soundly rejects both. “Sometimes, life takes unexpected turns. And when it does, you know what we do? We soldier on,” he tells her, but she’s very upset and leaves so they can’t discuss it further. Sadly, we know that this is just before he gets into the car accident, meaning that their last conversation was an angry one. Much later, at his graveside, Brianna cries as she promises him she’ll “soldier on.”\n\nTHE TRUTH COMES OUT | Bree’s sojourn at Laoghaire’s house is going along swimmingly until the blonde mentions Lallybroch. Brianna perks up and says that her relatives live there and her mother spent time there. “And who might your mother be?” Laoghaire politely inquires. “Claire Fraser,” Bree answers. Hold onto yer stomachers, because it’s going to get wild in here! Laoghaire’s manner goes from maternal to brittle REAL fast. Without letting on that she knows precisely who Bree’s mama is, the blonde besom starts talking smack about how Jamie left Claire when he found out she was pregnant. “I dinna like to repeat such things myself,” she adds, airily, which makes me guffaw.\n\n“I can prevent their deaths if I go to them now. There’s going to be a fire,” Bree says, which immediately makes Laoghaire suspicious. Um, Brianna? First rule of time-travel club? DON’T TALK ABOUT TIME-TRAVEL CLUB. Ultimately, Laoghaire only wants the money she’s owed, and she fears that the Frasers sent Bree there to spy on her. “Your mother is the thieving whore who stole my husband and left me destitute!” she yells, and things only get louder from there.\n\nWhen Bree goes to pack her things, Laoghaire follows her. “Claire Fraser should have burnt at the stake in Cranesmuir,” she spits. A penny drops for Brianna: “Oh my God: You’re the one who tried to have my mother killed!” In Laoghaire’s mind, this just cements the notion that Bree is just the latest witch in Claire’s coven, and she says as much. “I’m sure believing that is easier than facing the truth. And the truth is that Jamie Fraser has never loved you,” Bree shoots back. So Laoghaire locks her in the bedroom and says she’ll have her guest arrested for witchcraft.\n\nBONNET’S A BADDIE | On the Gloriana, Roger is friendly with a female passenger who’s traveling with an infant. That night, he’s awakened by a woman’s scream, and he runs to see what’s up. A young girl passenger has smallpox, and her mother is begging Bonnet not to toss her out the window to stem the spread of the disease. Roger begs Bonnet, as well, but the stone-cold captain pushes the child into the icy waters. Her mother dives in after her. They’re both doomed. As Roger reels in shock, Bonnet orders the crew to examine everyone and bring him anyone who’s ill.\n\nThe infant’s mother, whose name is Morag MacKenzie, freaks out: The baby is teething, which makes him seem like he’s poxed, but he’s not. So Roger promises to hide her and baby Jemmy and bring them food, a plan that Bonnet eventually realizes and confronts them both. “Would you say you’re a gambling man, MacKenzie?” Bonnet asks, flipping a coin to see whether Roger lives or dies. It comes out in his favor; Bonnet leaves them alone.\n\nBREE MEETS HER UNCLE | Bree has just managed to get a window of her new prison open when wee Joanie unlocks the door and drives her over to Lallybroch. “It’s not your fault your mother is a witch,” the little girl tells her. What a good kid!\n\nJenny’s away helping birth a grandchild, but Ian is at home when Bree arrives. He instantly believes what she says, noting that she has Claire’s eyes, and calls her “an unexpected blessing.” Then he gives her money to buy passage to the colonies, a trunk full of Claire’s old clothes and a tip to find Jocasta at River Run when she arrives in North Carolina. Man, Ian is always, always the best.\n\nAt the port, just before Bree books passage, she’s approached by a man named Joseph Wemyss who begs her to take his daughter on as a servant. Brianna is uninterested, but his story about how another man will buy the girl and keep her as a concubine sways her a bit. So pretty soon Brianna and Lizzie Wemyss (who looks nothing like I pictured her from the book, but whatever) are both heading out to board the Philip Alonso.\n\nBefore they get on the ship, Brianna takes a look back and imagines Frank standing there and nodding fondly at her. Then she turns around and heads into her next adventure.\n\nNow it’s your turn. What did you think of the episode? Sound off in the comments!", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://pmctvline2.files.wordpress.com/2019/06/lucifer-season-4-episode-4.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/too-hot-to-handle-finale.jpg?w=620", "https://pmcspy.files.wordpress.com/2020/04/best-hangboards.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-a.jpeg?w=300&h=200", "https://boygeniusreport.files.wordpress.com/2020/04/webp.net-resizeimage-17.jpg?quality=98&strip=all&resize=180%2C101", "https://pmctvline2.files.wordpress.com/2020/04/macgyver-spoilers-mac-riley-desi.jpg?w=620", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=180%2C101&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/alia-shawkat-leaves-brad-pitts-house-backgrid-ftr.jpg?resize=180%2C101", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=tvline.com&path=%2F2018%2F12%2F16%2Foutlander-recap-season-4-episode-7-down-the-rabbit-hole%2F&ct=article&lob=tvline&loc=us&env=desktop&post_id=1012009&comment_count=71", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=630", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-b.jpeg?w=300&h=200", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=180%2C101", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://pmctvline2.files.wordpress.com/2020/04/brooklyn-nine-nine-season-7-episode-13-finale-nbc-1.jpg?w=620", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-d.jpeg?w=300&h=200", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-c.jpeg?w=300&h=200", "https://pixel.wp.com/b.gif?v=noscript", "https://pmctvline2.files.wordpress.com/2020/04/one-chicago-cast-exits-2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/03/dw-2.jpg?w=280", "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=620&h=420&crop=1"], "top_img": "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=630", "keywords": [], "authors": ["Kimberly Roots"], "canonical_link": "https://tvline.com/2018/12/16/outlander-recap-season-4-episode-7-down-the-rabbit-hole/", "title": "Outlander Recap: What Frank Knew, and When He Knew It", "meta_data": {"viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "yes", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "'Outlander' Season 4, Episode 7: Brianna time-travels in 'Down the Rabbit Hole.' Read our recap!", "news_keywords": "Outlander, Starz", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress.com", "og": {"type": "article", "title": "Outlander Recap: What Frank Knew, and When He Knew It", "url": "https://tvline.com/2018/12/16/outlander-recap-season-4-episode-7-down-the-rabbit-hole/", "description": "Need to catch up? Check out the previous Outlander recap here.   Both Brianna and Roger make the leap through time in this week’s Outlander", "site_name": "TVLine", "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=630", "width": 630, "height": 420, "alt": "Outlander Recap Season 4 Episode 7"}, "locale": "en_US"}, "article": {"published_time": "2018-12-17T01:59:38+00:00", "modified_time": "2018-12-17T21:04:21+00:00"}, "twitter": {"site": "@TVLine", "text": {"title": "<I>Outlander</I> Recap: What Frank Knew, and When He Knew It"}, "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=630", "alt": "Outlander Recap Season 4 Episode 7"}, "card": "summary_large_image", "creator": "@kimroots", "title": "Outlander Recap: What Frank Knew, and When He Knew It", "description": "'Outlander' Season 4, Episode 7: Brianna time-travels in 'Down the Rabbit Hole.' Read our recap!"}, "author": "Kimberly Roots", "content_type": "Article", "post_id": 1012009, "title": "<I>Outlander</I> Recap: What Frank Knew, and When He Knew It", "published_at": "2018-12-16 17:59:38", "image": "https://pmctvline2.files.wordpress.com/2018/12/outlander-recap-season-4-episode-7-f.jpg?w=300&h=208&crop=1", "comment_count": 71, "tags": "Starz", "topics": "Recaps", "body": "Need to catch up? Check out the previous Outlander recap here.  \r\n\r\nBoth Brianna and Roger make the leap through time in this week's Outlander, thank goodness. It's been fun watching Jamie and Claire channel Bob Vila and all, but I'm ready for the Frasers and Rog all to be in one place (and century) so that the joyful reunions, tearful misunderstandings and 18th-century game of telephone* can get underway!\r\n\r\nOn a related note, this week's episode brings back two characters we haven't seen in a while: Frank and Laoghaire. For the first time, particularly in Laoghaire's case, we see aspects of both that don't come to light when the story is told from Claire's perspective. Also: Nell Hudson doesn't get nearly enough credit for how masterfully she plays Jamie's ex-wife.\r\n\r\nBut wait, before I forget: Did Frank know Claire was destined to go back in time again?\r\n\r\nRead on for the highlights of \"Down the Rabbit Hole.\"\r\n\r\n*Don't know what I'm talking about? You will, and soon!\r\n\r\nBRIANNA ARRIVES | Brianna, who definitely made it back to old-timey Scotland, walks through the Highlands in the snow. She occasionally consults an old map, but she's a long way from anything even slightly resembling civilization. At one point, she falls and severely hurts her ankle; when she soaks it in an icy stream to stem the swelling, we see that it's badly sprained. But she pushes on, limping along a road and sleeping under the stars. She's able to start a fire using a box of matches she wisely brought with her from the future, and she dines on a peanut-butter-and-jelly sandwich.\r\n\r\nThe next morning, though, she's in a lot of pain and looks rather ashen. As she lurches through the forest, she notices smoke from a house's chimney in the distance. But before she can do anything about it, she passes out.\r\n\r\nBE LEERY, IT'S LAOGHAIRE! | Bree dreams/remembers herself as young girl, with Frank (hi, Tobias Menzies!) gently lifting her out of a car she'd fallen asleep in. When she actually wakes, she's tucked into a bed in a cozy home, and Laoghaire — !!! — was her savior.\r\n\r\nThe wenchiest wench who ever wenched Laoghaire and Joanie were walking home, it turns out, when they found Bree near a tree. \"We had no choice but to bring you home with us,\" the older woman explains, introducing herself and her younger daughter and telling Bree she can stay as long as she needs to. Brianna tells them she's from England but her parents are in North Carolina, and that she's going to meet them there. \"Marsali's in North Carolina!\" Joanie pipes up.\r\n\r\nA note before we move on: In Drums of Autumn, Brianna shows up at Lallybroch first. That's where she meets Ian and Jenny, and her first interaction with Laoghaire is decidedly different (read: Bree knows who she is right away, and she shocks everyone by announcing that Laoghaire was behind the business at Cranesmuir. In short, they yell at each other a lot). \"We had plans to go to Lallybroch and do certain things,\" executive producer Matthew B. Roberts told me, \"and then through actor availability we were unable to tell the story exactly the way that we wanted to. So we had to revamp.\"\r\n\r\nSHIPPIN' OUT | Back in 1969, Roger and Fiona drive to Craig na Dun. He's shaved his beard and dressed in period garb in preparation for his trip, and he's got money, a compass, a knife and some gemstones to see him safely into the past. As they walk toward the circle, he hears a buzzing, but Fiona can't. \"The stones dinna call to me,\" she reminds him. They hug, then he walks toward the stone and puts his palms on it. Later, Fi!\r\n\r\nWe don't see him again until he's in the 1700s, seeking passage to the Carolinas. Oh look, Roger has found himself another knit cap. Joy. The captain of the Gloriana — wait a minute, it's Stephen Bonnet! — says he's going to Wilmington but isn't accepting any more passengers. So Roger hoists a barrel over his shoulder to prove that he's hale and hearty enough to join the crew. Bonnet looks amused, so he flips a coin to decide whether or not Rog can come aboard. When the toss comes out in Roger's favor, Bonnet snarks, \"There's four ports before Wilmington. I hope she's worth it.\"\r\n\r\nA VERRA INTERESTING DEVELOPMENT | Her first night at Laoghaire's, Ian comes to give Laoghaire some money. But it's not the full amount of monthly alimony Jamie owes her, and she's verra testy about that. The next morning, Bree dons one of Marsali's dresses and comes to help Laoghaire and Joanie in the garden. That's where the little girl tells her about her \"Da,\" who raised her but wasn't her biological father. The two redheads bond over being brought up by good men who weren't in love with their mothers.\r\n\r\nAnd that leads us to a very intriguing flashback set right around the time of Brianna's high school graduation. The teen finds her father in his office at Harvard, drunk-ish and despondent. He won't say precisely why, but when Bree asks what some papers on his desk are, we can see that he had a copy of Claire and Jamie's death notice — the same one Roger and Bree found independently of each other — way back then. He brushes it off as \"research from a colleague in Scotland,\" and when she presses, only adding that it's \"complicated.\" He eventually sends her home, and she leaves in a huff.\r\n\r\nTHIS IS INTERESTING, NO, OLDLANDERS? In the books, we learn that Frank knew Jamie survived the Battle of Culloden, but it's unclear how much more research he did after that. But this slight change indicates that Frank not only knew Jamie eventually died in North Carolina… but that Claire was with him when it happened. So you can look at this scene as Frank realizing that no matter what he does, Claire is destined to leave him again and go back through the stones. It also might explain why — in Season 3 and in another flashback in this episode — he pushes so hard for Brianna to move to England with him: If Claire is going to leave them, they might as well make that break on their own terms, possibly sparing Bree a little of the pain? Or maybe he's doing it to make things easier for Claire, to tie up some loose ends ahead of time?\r\n\r\nOf course, he doesn’t tell Brianna any of this. And when he announces the divorce and pitches the move, she soundly rejects both. \"Sometimes, life takes unexpected turns. And when it does, you know what we do? We soldier on,\" he tells her, but she's very upset and leaves so they can't discuss it further. Sadly, we know that this is just before he gets into the car accident, meaning that their last conversation was an angry one. Much later, at his graveside, Brianna cries as she promises him she'll \"soldier on.\"\r\n\r\nTHE TRUTH COMES OUT | Bree's sojourn at Laoghaire's house is going along swimmingly until the blonde mentions Lallybroch. Brianna perks up and says that her relatives live there and her mother spent time there. \"And who might your mother be?\" Laoghaire politely inquires. \"Claire Fraser,\" Bree answers. Hold onto yer stomachers, because it's going to get wild in here! Laoghaire's manner goes from maternal to brittle REAL fast. Without letting on that she knows precisely who Bree's mama is, the blonde besom starts talking smack about how Jamie left Claire when he found out she was pregnant. \"I dinna like to repeat such things myself,\" she adds, airily, which makes me guffaw.\r\n\r\n\"I can prevent their deaths if I go to them now. There's going to be a fire,\" Bree says, which immediately makes Laoghaire suspicious. Um, Brianna? First rule of time-travel club? DON'T TALK ABOUT TIME-TRAVEL CLUB. Ultimately, Laoghaire only wants the money she's owed, and she fears that the Frasers sent Bree there to spy on her. \"Your mother is the thieving whore who stole my husband and left me destitute!\" she yells, and things only get louder from there.\r\n\r\nWhen Bree goes to pack her things, Laoghaire follows her. \"Claire Fraser should have burnt at the stake in Cranesmuir,\" she spits. A penny drops for Brianna: \"Oh my God: You're the one who tried to have my mother killed!\" In Laoghaire's mind, this just cements the notion that Bree is just the latest witch in Claire's coven, and she says as much. \"I'm sure believing that is easier than facing the truth. And the truth is that Jamie Fraser has never loved you,\" Bree shoots back. So Laoghaire locks her in the bedroom and says she'll have her guest arrested for witchcraft.\r\n\r\nBONNET'S A BADDIE | On the Gloriana, Roger is friendly with a female passenger who's traveling with an infant. That night, he's awakened by a woman's scream, and he runs to see what's up. A young girl passenger has smallpox, and her mother is begging Bonnet not to toss her out the window to stem the spread of the disease. Roger begs Bonnet, as well, but the stone-cold captain pushes the child into the icy waters. Her mother dives in after her. They're both doomed. As Roger reels in shock, Bonnet orders the crew to examine everyone and bring him anyone who's ill.\r\n\r\nThe infant's mother, whose name is Morag MacKenzie, freaks out: The baby is teething, which makes him seem like he's poxed, but he's not. So Roger promises to hide her and baby Jemmy and bring them food, a plan that Bonnet eventually realizes and confronts them both. \"Would you say you're a gambling man, MacKenzie?\" Bonnet asks, flipping a coin to see whether Roger lives or dies. It comes out in his favor; Bonnet leaves them alone.\r\n\r\nBREE MEETS HER UNCLE | Bree has just managed to get a window of her new prison open when wee Joanie unlocks the door and drives her over to Lallybroch. \"It's not your fault your mother is a witch,\" the little girl tells her. What a good kid!\r\n\r\nJenny's away helping birth a grandchild, but Ian is at home when Bree arrives. He instantly believes what she says, noting that she has Claire's eyes, and calls her \"an unexpected blessing.\" Then he gives her money to buy passage to the colonies, a trunk full of Claire's old clothes and a tip to find Jocasta at River Run when she arrives in North Carolina. Man, Ian is always, always the best.\r\n\r\nAt the port, just before Bree books passage, she's approached by a man named Joseph Wemyss who begs her to take his daughter on as a servant. Brianna is uninterested, but his story about how another man will buy the girl and keep her as a concubine sways her a bit. So pretty soon Brianna and Lizzie Wemyss (who looks nothing like I pictured her from the book, but whatever) are both heading out to board the Philip Alonso.\r\n\r\nBefore they get on the ship, Brianna takes a look back and imagines Frank standing there and nodding fondly at her. Then she turns around and heads into her next adventure.\r\n\r\nNow it's your turn. What did you think of the episode? Sound off in the comments!", "fb": {"pages": 187516444593639, "page_id": 187516444593639}, "application-name": "TVLine", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "TV News, Previews, Spoilers, Casting Scoop, Interviews", "msapplication-task": "name=Subscribe;action-uri=https://tvline.com/feed/;icon-uri=https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "msapplication-TileImage": "https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1544889600.0, "source": "https://tvline.com", "summary": ""}