{"url": "www.dailymail.co.uk/news/article-3373403/Lawyer-defends-bankrupt-Teresa-Giudice-s-90-000-Lexus-gift-photos-arriving-home-jail-reuniting-husband-children.html", "text": "Advertisement\n\nAn architect who is owed $13,000 by Teresa and Joe Giudice has spoken of his anger at the lavish display of wealth that welcomed the criminal Real Housewife of New Jersey home on the day she got out of prison.\n\nTeresa, 43, was freed yesterday having served 11 and a half months of a 15 months sentence after pleading guilty to fraud and conspiracy to commit mail and wire fraud last March.\n\nAnd, along with the Welcome Home sign, a brand new 2016 Lexus LX570 was awaiting her arrival from Danbury Prison Connecticut.\n\nThe luxury SUV, which is worth at least $90,000, was sitting in the driveway of the couple's imposing New Jersey mansion with a red ribbon on top.\n\nNow architect John Fellgraff, 73, who worked for the couple some eight years ago has told Daily Mail Online that he has yet to see a cent of the $13,000 he billed them and that he intends to initiate legal proceedings in an attempt to claim it.\n\nSCROLL DOWN FOR VIDEO\n\nEarly Christmas present: Teresa Giudice had this brand-new Lexus SUV waiting for her outside her New Jersey mansion when she returned home from prison Wednesday after 11 months\n\nCa-ching! The car, a 2016 Lexus LX570, retails for just under $90,000, raising some questions about the true state of the Giudices' fiances\n\nGuess who? Teresa, dressed in a stylish peplum-enhanced leather jacket, blue jeans and knee-high black boots, looked overjoyed to be home with her family again after a long absence\n\nMom's home: Teresa's girls rushed into her arms as she made her big entrance Wednesday, with Bravo cameras rolling\n\nJoe Giudice patiently waited his turn to greet his long-absent wife home as she was swarmed by her adoring kids\n\nVictim: Architect John Fellgraff was commissioned by Joe Giudice but never saw a cent\n\nAddressing speculation as to how the couple, who infamously claimed bankruptcy, could afford the excessive present, Teresa's attorney James J Leonard Jr told Entertainment Tonight: 'They make money.'\n\nSpeaking to People he would say only, 'She needs a car. End of story – just like anyone else who needs a car.'\n\nBut it is not the end of the story for Mr Fellgraff who has branded the brash Christmas gift as 'offensive' and said: 'It's hard to see all that. I'd love to buy my wife a new Lexus for Christmas. That car costs more than they owe me – it's a lot of money.\n\n'Yes I feel angry towards them. It's ridiculous. It's offensive. I haven't initiated the process yet but I intend to in the next week or so to take legal action and see if we can get something out of them.'\n\nMr Fellgraff was employed by Joe, 44, to design some modifications and an addition on the couple's New Jersey mansion. He was also asked to design a completely new house to be built on an empty lot owned by Joe.\n\nHe said: 'I did plans for modifications to that house and to an addition. I didn't do the final drawings that make it look like a miniature castle. I wouldn't want to put my name to that. But we did do the original working drawings and they proceeded with the construction from those drawings.\n\n'And in addition, down the street from where they lived Joe had an empty lot and we designed and did drawings for a speculative house on that site.\n\n'I think our billing was about $13,000 and we've never received a penny of it.'\n\nAccording to Mr Fellgraff the drawings and design for the mansion constituted about six months work with the new home taking around two months.\n\nHe and wife, Judith, pursued the Giudice's for payments on a twice-monthly basis but received no payment.\n\nHe must have missed her! Joe Giudice nearly swept his wife off her feet and gave her a passionate kiss in the middle of their kitchen\n\nAfter 11 months apart, Mr and Mrs Giudice clearly have a lot of catching up to do before Joe heads to prison in March\n\nReunited, and it feels so good: Teresa received a big group hug from her husband Joe Giudice and her girls, Gia, Milania, Gabriella and Audriana\n\nAll smiles: The Giudice clan locked Teresa in a warm embrace, with her youngest daughters jockeying to give her a kiss\n\nLocking lips: Teresa and Joe evidently couldn't keep their hands off each other, even with their daughters vying for their mother's attention\n\nKids these days... One of Teresa's girls seemed distracted by her cellphone, even though she hadn't seen her mom in nearly a year\n\nGetting comfortable: Eventually, Teresa kicked off her boots and got a plastic cup of water from the kitchen\n\nBack to the routine: Joe Giudice feeds the family pets Thursday morning, a day after his wife's release from prison\n\nKeeping it clean: Mr Giudice, who will be heading to prison in March, is seen her cleaning up after the two pooches in the yard\n\nThe New Jersey businessman is pictured bending down to pick up after his two pooches. There was no sign of Teresa in the yard\n\nTheir decision to sue the Giudices coincided with the couple declaring themselves bankrupt in 2009.\n\nMr Fellgraff explained: 'We figured that's the end of that. But subsequently they were found guilty of falsifying their bankruptcy claim so now I'm thinking, 'What the heck? Maybe I'll try it again.'\n\nTeresa and Joe filed their fraudulent bankruptcy claim on 29 October 2009. In it they admitted to running up debts amounting to a staggering $11million.\n\nAmong the many false claims the later admitted to making they confessed to not disclosing assets and failing to mention Teresa's earnings from the Real Housewives of New Jersey at all.\n\nAnd among the banks and credit card companies is a smattering of private individuals and family run companies that fell victim to their flagrant disregard for settling bills.\n\nMr Fellgraff is just one of many left out of pocket and incensed by the opulent lifestyle enjoyed by the couple that claimed to be broke.\n\nThe couple finally withdrew their petition in 2011 in a move that turned out to be too late to evade justice for the fraud they had tried to perpetrate.\n\nA 39 count federal indictment was handed down in July 2013. Among the allegations was the claim that Teresa had failed to disclose her Real Housewives income despite the fact that both she and Joe had signed agreements in the summer of 2009 to appear on the Bravo show for $110,000.\n\nSpeaking at the time US Attorney Paul Fishman said: 'The indictment returned [by a grand jury] today alleges the Giudices lied to the bankruptcy court, to the IRS and to a number of banks.'\n\nHe added: 'Everyone has an obligation to tell the truth when dealing with the courts, paying their taxes and applying for loans or mortgages. That's reality.'\n\nBeach wear: With temperatures in the Tri-State area in the 70s, Joe opted for a casual ensemble of shorts, a tank top and slippers\n\nReady to go: Mrs Giudice, 43, is seen carrying a pair of bags as she exits the Danbury Prison where she has spent the last year\n\nShe'll be home for Christmas: Teresa Giudice sits in the backseat of an SUV driven by her lawyer immediately after her release from the Federal Correctional Institution in Danbury, Connecticut, Wednesday\n\nEntourage: The 43 year old was driven home by her attorney James Leonard Jr in a black SUV along with a convoy of four similar vehicles\n\nA high profile case followed ending last March when both plead guilty to various counts of fraud and conspiracy to commit mail and wire fraud with sentencing taking place last October.\n\nTeresa was sentenced to 15 months and Joe to 41 months in prison. He will begin his sentence in March.\n\nThey still owe the state of New Jersey more than $200,000 in court-ordered restitution on charges of conspiracy and fraud. And just last month the IRS issued the Giudices with a $551, 563.00 lien for nine years of unpaid taxes.\n\nShaking his head Mr Fellgraff dismissed the notion that justice had been done when it comes to the Giudice's financial dealings.\n\nHe said: 'I just don't understand it. They're living in this great big mansion supposedly living this extravagant life but they owe all these people all this money.\n\n'The whole thing I don't understand. The whole process allowing them to serve separate times so that somebody can be home for the kids. If it was you or me who'd done it they wouldn't have cared.\n\n'Then I read that about a week ago that show, The Real Housewives of New Jersey, signed her up again for $1million.'\n\nHe added: 'The way I see it it should be simple. I did my job. I did it properly and they've got to pay for it.'\n\nThe car is a symbol of Teresa's return to life - but its purchase has a further irony that the family already have at least one car which Joe cannot legally use, as he is banned from driving after 39 separate license suspensions.\n\nDeck the halls: The Giudice family made sure their mansion was thoroughly decked with festive Christmas decorations in time for Teresa's homecoming on Wednesday\n\nSigns of affection: Teresa Giudice was greeted with a pair of handmade posters taped to the front doors of her palatial home. The signs read, 'We Missed You' and 'We Love You'\n\nWas she on the 'Nice' list? Giudice's lawyer joked with reporters that 'maybe Santa Clause' got Teresa this black $90,000 Lexus\n\nMotorcade: A string of SUVs, cars and news vans are seen outside the Giudices' mansion on the morning of her release\n\nSpecial touches: Teresa's girls adorned the interior of their lavish home with more signs and posters welcoming her home\n\nTouching: The Giudice girls described their mom as 'kind, loving, amazing, awesome, cool, fashionable, and the most wonderful person on the hole [sic] world'\n\nHe was told by a local judge that he would go straight to prison if he so much as backed the car out of the driveway, making the Lexus purchase all the less necessary.\n\nA source told the New York Post's Page Six that the Giudices have a payment schedule in place that is meant to leave them with just enough money to cover the bare necessities, such as food and shelter. Teresa remains in home confinement until February 5.\n\nAt a press conference held following Teresa's release from jail, her attorney said he did not know who bought the black Lexus for his client and joked that 'maybe Santa Claus' was the mystery benefactor.\n\nThe lawyer said Teresa was looking forward to spending a 'nice, quiet, low-key holiday' with her family, reported the New York Daily News.\n\n'She kept saying how surreal this was — that she went to bed last night in Danbury and before the sun came up, she's at home,' Leonard said. 'Very emotional. Very powerful. Something special.'\n\nCameras were rolling Wednesday as Teresa crossed the threshold of her Towaco, New Jersey, mansion for the first time in nearly a year and was greeted by her ecstatic family - husband Joe and their four daughters.\n\nWalk: Milania Giudice is seen walking the family dogs and picking up the mail outside their home with a friend in Towaco, New Jersey\n\nExercise: Milania and two friends walk the family dogs outside their home in Towaco, New Jersey this morning\n\nPumped to have her home! Joe Guidice is pictured in his home gym waiting for his wife to return home from prison today\n\nHappy Holidays: Giudice, 43, arrived home to posters from her children and a brand-new Lexis under a large red bow in the driveway\n\nWarm welcome: Giudice was greeted with posters on the front door of her home with 'We Missed You' and 'We Love You' messages\n\n'We missed you!' A cameraman is seen on the front porch of the the Guidice's home where welcoming signs have been hung\n\nAttention: Teresa Giudice's attorney James Leonard Jr. gives a statement outside his client's home in Towaco, New Jersey\n\nOrange is the new black! The reality star's sentence was handed down that October last year. She entered the minimum-security prison, featured in the Netflix series, in January. Pictured, Joe and Teresa Guidice outside the Martin Luther King Jr. Courthouse in Newark, New Jersey, on October 2, 2014\n\nDark: The star will apparently have to check into a residential re-entry center before returning to her own home. Pictured, the Federal Correctional Institution early this morning\n\nFallen: Teresa Giudice has had to put her fame to one side since her fraud conviction. Her last appearance on the series was in a reunion episode with Melissa Gorga\n\nA series of photos shot inside the Giudices' extravagant home decked with festive Christmas decorations show Joe - wearing a sleeveless top which showed his tattoos - nearly sweeping his slender wife off her feet and planting a passionate kiss on her lips in the middle of their kitchen.\n\nThe couple's children - Gia, 14, Gabriella, 10, Milania, 9, and Audriana, 6 – showered their long-absent mother with kisses and hugs, and the mother-of-four seemed overjoyed to be home with her family again.\n\nIn preparation for her long-awaited homecoming, the girls decorated the family mansion with homemade signs and posters saying 'We Missed You' and 'We Love You.'\n\nOn Thursday, the Giudice family appeared to have settled back into their routine, with Joe being photographed feeding his two dogs and then cleaning up after them in the yard.\n\nEarly Wednesday morning, Teresa was met at the prison by her lawyer, James Leonard Jr, who drove her to her mansion in New Jersey in a black SUV accompanied by a convoy of other SUVs, with Christmas songs blasting from the radio.\n\nThe source claimed that her husband Joe was 'anxiously' waiting in the driveway for her arrival. Teresa arrived at home around 7.30am to welcoming signs hanging on the front door, including one that said: 'We missed you.' Her 14-year-old daughter Gia tweeted her delight, writing 'welcome home' alongside a beaming face emoji.", "images": ["https://i.dailymail.co.uk/1s/2020/04/17/17/27327004-0-image-m-21_1587141223790.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/1s/2020/04/17/20/27331384-0-image-a-22_1587150056520.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/15/2F96299100000578-3371791-image-a-63_1450886333808.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F992E1400000578-3373403-image-a-81_1450977048924.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F99307C00000578-3373403-image-a-42_1450973306497.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/16/2F96029900000578-3371791-Attention_Teresa_Giudice_s_attorney_James_Leonard_Jr_gives_a_sta-m-76_1450886850053.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/18/27329034-0-image-a-10_1587145310401.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D1400000578-3373403-image-a-46_1450973319879.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992CFA00000578-3373403-image-a-61_1450973464902.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D9500000578-3373403-image-a-29_1450973235331.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D8800000578-3373403-image-m-60_1450973455316.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992DFB00000578-3373403-image-m-66_1450973564972.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/15/2F992E8300000578-0-image-m-14_1450972467141.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F99703400000578-3373403-image-a-92_1450977232971.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/18/2F96F71F00000578-3371791-image-a-62_1450895356133.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992E9700000578-3373403-image-a-21_1450973017649.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316454-0-image-a-18_1587125714890.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/13/2F9229F400000578-3371791-Fallen_Teresa_Giudice_has_had_to_put_her_fame_to_one_side_since_-a-24_1450878599709.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D0200000578-3373403-image-a-59_1450973407131.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/18/2F964C6C00000578-3371791-image-a-65_1450895361884.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/13/55vNlbG6cO929b1fa79f60f986ad-3371791-Orange_is_the_new_black_The_reality_star_s_sentence_was_handed_d-a-19_1450878599367.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992E6300000578-3373403-image-m-50_1450973345188.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992FE700000578-3373403-image-a-44_1450973311916.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/15/2F99307500000578-0-image-a-4_1450971991897.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/15/2F960CA900000578-3371791-image-a-58_1450883021812.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F99700D00000578-3373403-image-a-88_1450977197731.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F992E1800000578-3373403-image-a-84_1450977057331.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992FC500000578-3373403-image-a-39_1450973295602.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F99706D00000578-3373403-image-a-85_1450977190299.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D7800000578-3373403-image-m-53_1450973371918.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27313170-0-image-m-25_1587119028862.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/15/2F9629E400000578-3371791-image-a-66_1450886351216.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/13/2F95C16600000578-3371791-image-a-34_1450878855657.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D0E00000578-3373403-image-a-49_1450973326813.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992DEB00000578-3373403-image-a-67_1450973574308.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F992E5F00000578-3373403-image-a-80_1450977035447.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F9981B100000578-0-image-a-77_1450974748739.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/17/2F99707500000578-3373403-image-a-89_1450977211579.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/15/2F992FCA00000578-0-image-a-2_1450971978022.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/17/27280024-0-image-a-10_1587054457209.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/13/2F94D92F00000578-3371791-Dark_The_star_will_apparently_have_to_check_into_a_residential_r-a-25_1450878599745.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F99305700000578-3373403-image-a-36_1450973276715.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/23/18/2F95C2ED00000578-3371791-Pumped_to_have_her_home_Joe_Guidice_is_pictured_in_his_home_gym_-a-60_1450895243696.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F992D8400000578-3373403-image-a-51_1450973352337.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/20/2F99B1A100000578-3373403-image-a-1_1450988351671.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/07/video-27306022-770_154x115.jpg", "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F99345D00000578-3373403-image-a-40_1450973299695.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F9981B100000578-0-image-a-77_1450974748739.jpg", "keywords": [], "authors": ["Laura Collins", "Laura Collins In Park Ridge", "New Jersey", "For Dailymail.Com", "Snejana Farberov For Dailymail.Com", "Khaleda Rahman For Dailymail.Com"], "canonical_link": "https://www.dailymail.co.uk/news/article-3373403/Lawyer-defends-bankrupt-Teresa-Giudice-s-90-000-Lexus-gift-photos-arriving-home-jail-reuniting-husband-children.html", "title": "Bankrupt Teresa Giudice's $90,000 Lexus SUV gift 'because she needs a car'", "meta_data": {"keywords": "dailymail,news", "news_keywords": "dailymail,news", "original-source": "https://www.dailymail.co.uk/news/article-3373403/Lawyer-defends-bankrupt-Teresa-Giudice-s-90-000-Lexus-gift-photos-arriving-home-jail-reuniting-husband-children.html", "description": "An architect commissioned by Joe Giudice and never paid a cent tells Daily Mail Online he will now sue after seeing Teresa being presented by the criminal with a $90,000 Lexus SUV to celebrate her freedom.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Lawyer defends bankrupt Teresa Giudice's $90,000 Lexus gift", "description": "An architect commissioned by Joe Giudice and never paid a cent tells Daily Mail Online he will now sue after seeing Teresa being presented by the criminal with a $90,000 Lexus SUV to celebrate her freedom.", "url": "https://www.dailymail.co.uk/news/article-3373403/Lawyer-defends-bankrupt-Teresa-Giudice-s-90-000-Lexus-gift-photos-arriving-home-jail-reuniting-husband-children.html", "image": "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F9981B100000578-0-image-a-77_1450974748739.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 3373403, "author": "Laura Collins", "divclasspage": "articlePage", "mol": {"headline": "EXCLUSIVE: 'It's offensive.' Fury of the architect owed thousands by the Giudices as brazen Teresa is given a $90,000 Lexus wrapped in a bow by her criminal husband because 'she needs a car'"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2015-12-24T16:00:09+0000", "modified_time": "2015-12-24T21:25:24+0000", "section": "News", "tag": "Lawyer defends bankrupt Teresa Giudice s 90 000 Lexus gift photos arriving home jail reuniting husband children", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Lawyer defends bankrupt Teresa Giudice's $90,000 Lexus gift", "type": "article", "description": "An architect commissioned by Joe Giudice and never paid a cent tells Daily Mail Online he will now sue after seeing Teresa being presented by the criminal with a $90,000 Lexus SUV to celebrate her freedom.", "url": "https://www.dailymail.co.uk/news/article-3373403/Lawyer-defends-bankrupt-Teresa-Giudice-s-90-000-Lexus-gift-photos-arriving-home-jail-reuniting-husband-children.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2015/12/24/16/2F9981B100000578-0-image-a-77_1450974748739.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2015/12/24/171593866357160875/1024x576_171593866357160875.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/3373403/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/3373403/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1450972809.0, "source": "http://www.dailymail.co.uk", "summary": ""}