{"url": "www.independent.co.uk/arts-entertainment/art/features/the-last-action-heroes-have-tom-cruise-will-smith-and-brad-pitt-lost-their-mojo-8677002.html", "text": "Independence Day director Roland Emmerich sent shockwaves through Hollywood when he declared that the film's star Will Smith was “too expensive and too much of a marquee name” to star in the sequel, scheduled to come out in 2015. Emmerich had previously declared that it would be impossible to do a sequel without Smith. The about-turn, announced while Emmerich was promoting his new film, White House Down, this week, is part of a changing of the guard in Hollywood that has seen Smith, Tom Cruise and Brad Pitt lose some of their cachet. The announcement also comes just as Hollywood has seemingly deemed it no longer needs its three biggest male stars to launch blockbuster movies.\n\nThe knives had been sharpened for Pitt when zombie thriller World War Z was being designated a megaflop even before it hit cinemas. With a budget rumoured to be in excess of $400m (£260m) including marketing, it was being touted as this year's John Carter. When the sci-fi adventure bombed last summer Disney boss Rich Ross resigned from his post; the film reputedly lost $200m. The worry was that Pitt's name alone could not sell the picture. In the end, the opening weekend saw the Pitt film take home more than $60m at the American box office and $117m worldwide. The dire pre-release predictions meant that what were in modern blockbuster terms quite ordinary numbers were painted as a success, with suggestions there might be a sequel.\n\nWhile on the surface the numbers looked good for Pitt they did not quite mask the new reality in Hollywood that views star-vehicle blockbusters as a risky commodity. Monsters University, an animation film from Pixar, beat World War Z to top spot in the box office. Other films released this year with production costs in the $200m budget range, such as Man of Steel and Iron Man, opened with weekends garnering well over $100m in the US alone. The mixed critical reaction of the zombie thriller could also see the WWZ box office plummet in the way that Man of Steel faltered in its second week. For now Pitt has at least avoided the box-office curse that afflicted his contemporaries earlier this year.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nIt seems laughable to talk about the former Fresh Prince having to rebuild his castle because After Earth “only” took $27m on its opening weekend. But to film trade magazine Variety it was a “crash landing”. There were numerous reasons why, none of which looks good for Smith. Since the 1996 release of Independence Day, every Smith summer movie has debuted at No 1 at the American box office. But After Earth came third, behind Fast and Furious 6, on its second week of release and, even more surprisingly, Now You See Me, a heist movie starring Jesse Eisenberg and Mark Ruffalo. The number is also bad when comparing like with like. Of Smith's previous films, the gross is more in line with his low-budgeted dramas such as The Pursuit of Happyness than blockbuster titles Men in Black and Hancock. All this points to why financiers believing there is no upside in paying Smith a small fortune for the Independence Day sequel.\n\nTom Cruise seemed to be back on track when Oblivion opened with a more than respectable $38m first weekend. That was the second highest opening for a Cruise vehicle outside of the Mission: Impossible franchise and followed years of diminishing returns from the likes of Jack Reacher, Rock of Ages, Valkyrie and Knight and Day. But that was where the good news ended. Word of mouth was bad and audiences tumbled to such an extent that Oblivion is yet another Cruise effort to not score blockbuster numbers in America. When not playing Ethan Hunt, the last Cruise-led film to break the $100m barrier was 2005's War of the Worlds.\n\nIt's commonly asserted that the start of Cruise's demise was his couch-jumping proclamation of love for Katie Holmes on Oprah. Yet Cruise can argue that his box-office average has remained high since. But take away the Mission: Impossible franchise and the numbers are bleak. Before 2005 every Cruise film for a number of years made more than $100m.\n\nThe fact is that these box-office figures for Oblivion, After Earth and World War Z would look amazing if the budgets for these movies were not north of $100m before marketing costs. Once you add the cut that cinema chains and home-video outlets take on revenue, movies need to make many times their budget to start being considered a success. Studios need a blockbuster film to pull in nearly $1bn theatrical, another $1bn on DVD and a good, multi-year sale on television for a $200m picture to be deemed a success.\n\nIndeed, the high cost of releasing films is making film-makers sweat at both ends of the budget scale. Steven Soderbergh said he had to make Behind the Candelabra for HBO as the budget of the film was $5m, but the marketing needed for an American release is a minimum of $70m – numbers that don't make sense.\n\nGeorge Lucas and Steven Spielberg, speaking recently at the University of Southern California, predicted that there would be an “implosion” in the film industry and only big-budget superhero movies would make it to the cinemas and cost $50 to see, while low-budget dramas would be made for ever smaller budgets and go straight to the small screen.\n\nCompounding the stars' misery is their ageing audience. Three-quarters of the spectators for Oblivion that first weekend were over 25. Younger audiences and families opted for Monsters University over World War Z.\n\nWhile Hollywood has increasingly been more forgiving about middle-aged male action stars there has always been a tipping point where it becomes far more of a stretch to believe that they are taking on the world single-handedly. Presently that tipping point seems to come at around 50. Cruise was born in Syracuse, New York in 1962. Oklahoma-born Brad Pitt will turn 50 this year. Will Smith, the youngest of the trio, is 44, but the Philadelphia native has nearly always banked on audiences buying into his youthful exuberance as a key selling factor.\n\nPitt is the curiosity of the current trio fighting against the sands of time. His box office has never been of blockbuster proportions. The big franchise of his career has been the Oceans trilogy, which had numerous stars to share the burden. His stardom has come from public perception and high-profile relationships. But add up the American box office of his last three films, Killing Them Softly, Moneyball and The Tree of Life, and the total gross is less than what Benjamin Button took home. World War Z is his big attempt at venturing into blockbuster territory and, while the raw numbers gave Pitt his highest grossing opening weekend, they are not blockbuster and it seems that he has gambled a decade too late.\n\nThe three are such big stars that they even run their own production companies – Pitt runs Plan B, Smith chairs Overbrook and Cruise founded Cruise/Wagner Productions. They call the shots on their movies, hiring directors, working on the scripts and picking projects. Pitt staked his star name that he could turn Max Brooks's novel into the start of a franchise. The jury is still out.\n\nStudios now have more control over their product when stars are not involved. This is especially true of superhero movies. The exception that proves the rule came recently when Robert Downey Jr caused a ripple by threatening to stop playing Iron Man. The studio dithered, no doubt knowing they could save a fortune by letting him go. Fans balked and the studio relented. A hefty payday will see him star in Avengers 2 and 3, a comic-book ensemble that doesn't need Downey Jr in it to guarantee bums on seats.\n\nA caveat is that the appeal of the stars seems to have not been so diminished in foreign markets, especially nascent territories such as China and Russia. There has been a big shift in Hollywood studios' attitudes in the last 10 years as the takings from foreign markets have started to dwarf those of domestic audiences. So while After Earth was deemed to have bombed in America, foreign takings a week later softened the crash landing.\n\nThe reaction of Cruise and Smith to their box-office numbers suggest they are in consolidation mode. Cruise has abandoned plans to star in an adaptation of 60s TV show The Man from U.N.C.L.E. and announced that he's making a 5th instalment of Mission: Impossible. There's also talk that he's considering turning Jerry Maguire into a TV show. Will Smith has been on American talk shows downplaying the weak opening of After Earth and, while talking about looking for more risks in his choices and moving away from blockbusters, he has also been rumoured to be preparing for sequels of Bad Boys, I, Robot and Hancock. Although his Men in Black franchise has seen each sequel make less money than predecessors. The stars are following the studios in relying on their best-known characters to sell their movies.\n\nWhat's intriguing is that there seem to be no successors to Cruise, Pitt and Smith. The recent huge blockbuster franchises have been superhero movies, Batman and Spider-Man, or ensembles based on books, Harry Potter, Twilight and Lord of the Rings. It's hard to imagine Christian Bale breaking box-office records outside of the bat-suit. The summer blockbusters have evolved away from being star vehicles as studios have hit on a formula where they can call the shots. That's bad news for the non-tights-wearing action star.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/06/27/15/smith-pitt-cruise-rex.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/06/27/15/smith-pitt-cruise-rex.jpg", "keywords": [], "authors": ["Kaleem Aftab"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/art/features/the-last-action-heroes-have-tom-cruise-will-smith-and-brad-pitt-lost-their-mojo-8677002.html", "title": "The last action heroes: Have Tom Cruise, Will Smith and Brad Pitt lost their mojo?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/art/features/the-last-action-heroes-have-tom-cruise-will-smith-and-brad-pitt-lost-their-mojo-8677002.html", "title": "The last action heroes: Have Tom Cruise, Will Smith and Brad Pitt lost", "description": "The same old familiar faces are saving the world this summer. They might be better employed saving themselves, says Kaleem Aftab", "updated_time": "2013-06-27T15:10:29+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/06/27/15/smith-pitt-cruise-rex.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "description": "Independence Day director Roland Emmerich sent shockwaves through Hollywood when he declared that the film's star Will Smith was “too expensive and too much of a marquee name” to star in the sequel, scheduled to come out in 2015. Emmerich had previously declared that it would be impossible to do a sequel without Smith. The about-turn, announced while Emmerich was promoting his", "keywords": ", Features, Art, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"published_time": "2013-06-28T19:00:10+01:00", "modified_time": "2013-06-27T15:10:29+01:00", "section": "Features", "subsection": "Frontpage, News, Culture", "author_name": "Kaleem Aftab", "content_type": "story", "word_count": 1590, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 0, "external_link_count": 0}, "twitter": {"description": "Independence Day director Roland Emmerich sent shockwaves through Hollywood when he declared that the film's star Will Smith was “too expensive and too much of a marquee name” to star in the sequel,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1372442410.0, "source": "http://www.independent.co.uk", "summary": ""}