{"url": "https://www.elitedaily.com/p/kourtney-kardashians-birthday-cake-for-younes-bendjima-will-make-you-swoon-8998460", "text": "I think it's safe to say Kourtney Kardashian and Younes Bendjima are one of my new favorite couples. If you haven't taken that same step yet, just wait until you see Kourtney Kardashian's birthday cake for Younes Bendjima. I promise you're gonna fall deeper for them than you ever thought possible.\n\nOn Friday, May 4, the mom-of-three brought Bendjima on a private jet to celebrate his 25th birthday, The Daily Mail reports. Kardashian kicked off the weekend getaway by sharing a glimpse of her and her beau on the jet with two over-sized helium balloons in the background that said \"25.\" When she posted the jet footage to her Instagram Story, their destination was unclear.\n\nShe followed up the post with a video of a one-tier birthday cake that featured an adorable throwback pic of a young Younes, and read, \"Joyeux Anniversaire Mon Bébé!\" (That means \"Happy Birthday My Baby\" in French, according to Google Translates.) Bendjima was then shown happily dancing around his birthday cake to Jagged Edge's gleeful banger, \"Where the Party At,\" before blowing out the candles. Honestly, his excitement is my entire mood after seeing the clip. IMO, it shows that they're such a great match for each other. Take a look for yourself and prepare to swoon.\n\n@KourtneyKardash on Instagram\n\nIn honor of his birthday, Kardashian also shared a few pictures of her and Bendjima's other adventures throughout their relationship, and let me just say: I really cannot take these levels of cuteness.\n\nDamn, y'all. And I can't even get a text back.\n\nThe getaway comes just weeks after Bendjima went all out for Kardashian's own birthday, on April 18. The reality star shared a video to Snapchat of her boyfriend cooking a romantic dinner in honor of her big day, and the two later topped off Kardashian's birthday celebrations with a trip to Disneyland.\n\nExcuse me while I go run into my own arms.\n\nBut seriously — wherever the couple has gone for Bendjima's birthday, I'm betting they're gonna have a phenomenal time. In an episode of Keeping Up With The Kardashians that aired in October 2017, Kourtney was shown planning a sexy surprise for the model's 24th birthday, and her sister, Khloé, couldn't help but chime in on how happy Kardashian was.\n\n“I know Kourt has been out on the dating scene recently — she’s planning a little birthday surprise tonight,” Khloé explained during a confessional, according to People. “I don’t really know the details, but she’s doing this whole exchange. She’s putting a hotel [room] key into this wallet.”\n\n“I’ve never known Kourtney to be this giddy, ever in my life,” she continued. “I’ve never known Kourtney to plan anything. It’s so cute though, to see her this giddy!”\n\nBut then again, how could she not be giddy after the smokin' hot circumstances they met under? In another episode of the show, Kardashian said she met Bendjima in a nightclub in 2016, but his approach is probably what made her fall for him. She explained:\n\nHe was friends with our friends. He would walk in, say hi, shake hands with like our security or whatever, but, like, not say hi to us. And then I was like, ‘Why do you hate us?' I was just drunk. Once I said that he literally like grabbed my hand and was like, ‘It's five in the morning. We're leaving.' And then next night Younes was like, ‘Bring your ass here.'\n\nE! Entertainment on YouTube\n\nIs it too soon to say Kardashian and Bendjima are a match made in heaven? 'Cause they are, if you ask me. If you somehow still have any doubts, just wait and see how far they go out for each other when the holidays roll around.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/13/7d9a1541-86c9-44a6-962f-e116013d37c8-21fecc54-ebbe-42ae-80dd-25bd0df43cf9-getty-930538180.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/image/2018/5/5/1bcb3f9c-f277-435f-8e8e-56b41ac6b28d-image-uploaded-from-ios.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/5/1ddf6bc5-7b59-4915-9c95-9413bc6bb360-getty-954811142.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/10/b195a297-8adf-49b1-946c-907106bde81d-getty-1095125670.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/5/1ddf6bc5-7b59-4915-9c95-9413bc6bb360-getty-954811142.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/5/1ddf6bc5-7b59-4915-9c95-9413bc6bb360-getty-954811142.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kourtney-kardashians-birthday-cake-for-younes-bendjima-will-make-you-swoon-8998460", "title": "Kourtney Kardashian's Birthday Cake For Younes Bendjima Will Make You Swoon", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kourtney-kardashians-birthday-cake-for-younes-bendjima-will-make-you-swoon-8998460", "type": "article", "title": "Kourtney Kardashian Gave Her BF The Cutest Birthday Cake & It'll Make You Swoon", "description": "I think it's safe to say Kourtney Kardashian and Younes Bendjima are one of my new favorite couples. If you haven't taken that same step yet, just wait until you see Kourtney Kardashian's birthday cake for Younes Bendjima. I promise you're gonna…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/5/1ddf6bc5-7b59-4915-9c95-9413bc6bb360-getty-954811142.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "I think it's safe to say Kourtney Kardashian and Younes Bendjima are one of my new favorite couples. If you haven't taken that same step yet, just wait until you see Kourtney Kardashian's birthday cake for Younes Bendjima. I promise you're gonna…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}