{"url": "http://www.bravotv.com/the-real-housewives-of-dallas/season-1/blogs/leeanne-locken/leeanne-on-that-night-in-austin-betrayal", "text": "Thank you all for tuning in again this week. Your loyalty softens the blow of some of the painful incidents I have relived while watching these episodes.\n\nFirst, let me say that doing this show has taught me a lot about myself and others. We’re all flawed and beautiful in our own ways; we make mistakes, and we all need to swallow our pride and accept them. We also learn to forgive others for their mistakes, which can be incredibly difficult sometimes. The same goes for forgiving ourselves, which I have learned to do over the last year.\n\nSometimes, you need a chance to explain your hurt and your perspective, and that’s what I want to do right now.\n\nSo a social worker, a nurse and a cheerleader walk into a bar... Ha! Kidding.\n\nOkay, here we go...\n\nGoing into the trip, I was really excited. I thought this was going to be an opportunity for all of us to let our hair down and really connect on a personal level without any facades and just keep it real. I was really hoping that this would be a chance for me to actually be vulnerable, to let those walls down and be the raw LeeAnne that I am with Tiffany. To let them really see the core of me, which they did until things got messy. Speaking of messy...\n\nI think I’d like to address the pee-on-the-bus incident. LOL.\n\nListen, I didn’t want Brandi to pee on the bus. (Big whoop!) But not for the reason you’d think. I mean, I get it. If you gotta go, you gotta go. But seriously, have you ever TRIED to pee on a bus? I mean, have you ever tried to pee in a cup on a moving bus? Yeah. SPLISH-SPLASH, y’all…Splish-Splash! Urine everywhere. To be honest, I didn’t want urine draining down the bus the next time he slammed on the breaks. Now, to be perfectly honest, I have peed in a car, and this is how I know the dangers of the task. IT’S DAMN RISKY BEHAVIOR.\n\nNow, apart from urine, something else a little more serious was spilled on that bus - Marie’s lies. When I found out that Marie had told my “little secret,” I looked her straight in the eyes and you could see her reaction. She fell back on her usual tactics, which is to LIE. That’s her native language. The bothersome part about her response was the that she looked so unconcerned about about the fact that she had been caught. She didn’t even care. It was like she turned on autopilot and just let her lips move and the lies shot out of her mouth like rapid fire bullets through my heart. She didn’t even try to convince me that she, in her mind, was being truthful. This was the saddest part of all of this mess and it let me know where our friendship REALLY was.\n\nI just want to flush this damn poop story right down the toilet (pun intended). When I was sitting outside with Marie and Tiffany and heard that Brandi and Stephanie Hollman were still talking about it, yes, I was annoyed. I mean, I was two feet away and could hear every word they were saying. It’s was like I was on trial for crapping in a car. What do you want from me? Proof? Would that quench your poop fetish? I crapped in a car. I’m sure most of us at some point in our lives have been victims of what Rich calls the “one cheek sneak” that goes bad. SO WHAT. I’m more focused on the BETRAYAL part. I find it very hard NOT to focus on that part of the issue. I went on this trip because I really wanted to be friends with these people, but the betrayal and constant beating of a dead horse about this story is driving me NUTS and causing me to put my walls back up.\n\nNOW - onto some of the good. A lot of wonderful, positive things happened with Brandi on that Austin trip. When we sat down and talked about PTSD and her brother, I felt like I was able to reach out to her and show her my true nature. My heart goes out to her and her family, and at that table, I wanted her to know that she wasn’t alone and hat her brother wasn’t alone. I’m no soldier but I have the utmost respect for our troops and the freedoms that they provide for us and the crap I’ve lived through is not the same as the things that our soldiers go through but it is all real pain to all of us. I’ve lived through a ton of crap, and if I have lived through all of that and didn't use it to help others, then what have I made of it? No matter who you are and what you’ve been through, pain is pain. These are the moments that I look for to have a chance to reach out to someone hurting. My hurt helps me be in touch with your hurt. She let me do that on the Austin trip. She let me reach out and be there for her. I know Tiffany and I both loved connecting with her about that. I loved getting drunk with her; she really is hilarious, and I was SO happy to be able to cut up with her. I loved that, during this episode, Brandi brings up the betrayal several times, and it’s like SHE SEES that I’m hurt but she just doesn’t want to point it out to the other girls. I think she she tries but she doesn’t want to be really aggressive about it, which I get. That’s not her job; it’s mine.\n\nPreview Has Brandi Finally Had Too Much Jesus Juice?\n\nThe morning after the fight, when Brandi talked me into staying, I was shocked. I was in that bedroom holding back a Niagra Falls of tears, and when she came in and said that I should not leave, I really felt like it was Brandi saying, “I’ve seen a different part of you, and I want to connect more with that part.” I really wanted the opportunity to do that. I felt that if I left, I definitely wouldn’t get that opportunity again. So I thought I’d take a chance against my better instinct and stay to hopefully have an opportunity to resolve it all. I stayed. I owned up to what I did, and I was hoping the trip would end in a positive way.\n\nI was so upset with Marie because THIS wasn’t her first betrayal, and for the last year, I had been denying her betrayals. So I have had to come to terms with the fact that this IS Marie. This is what she is to me: A Liar.\n\nMarie is like a tornado and I’m like a small town of 60 houses, and she has just plowed through, destroying every single one without a care. For me to have to finally face this fact after everything I’ve done for her, the secrets that I have kept for her, the lies, the tracking devices I’ve purchased for her, the meetings I’ve kept quiet, the trips to Mexico where I’ve talked her off the ledge, all of it. I’m flabbergasted. Shocked. And it all came out with 100% hurt and pain, which for me (as you all know by now) comes out in 100% anger.\n\nShow Highlight More of The Epic Confrontation Between LeeAnne and Marie\n\nHere’s the truth about the morning after the fight...\n\nThe next morning when I tried to speak to Marie, I had actually texted her asking her to please come downstairs to talk. She said she would be right down, but she never showed up. SHE SET ME UP 100 %. She wanted everyone in the house to believe she was the victim. I applaud her for her first class acting job and for her strategic, but childish game-playing. I mean, she really thought everything through, move by move. That shit wasn’t checkers, that was chess.\n\nTo her, friendship is just a game and I wasn’t aware that she knew how to play chess or I might have been better prepared. She’s only in it for a prize.\n\nEven though she was the tornado, she somehow made into her being the victim. It’s like she was saying, “Well, you little town of 60 houses, it’s your fault that I had to come sweeping through and destroy everything. Sorry not sorry.” The conversation was going exactly the way she wanted. She wanted them all to take her side, and each and every one of them did. (Apart from Tiffany, of course.)\n\nThen the BETRAYAL CONTINUED. I had to sit there and watch Stephanie call me abusive. For her to say, “I’ve never seen this before,” I mean, weren’t you a social worker? Have some compassion. I feel sorry for your clients. And Cary, you’re a nurse. You’re ALSO supposed to have compassion. You’re helping Mark perform some very serious, difficult and delicate procedures on people laying unconscious in front of you in an operating room and all you want to talk about is having sex with your husband.\n\nI want to clarify a few things. When I said I was going to “kill” Marie or “gut” Marie, that means I’m “gutting” her out of my life. It means she has no hope of seeing my face again. It means she is 100% irrelevant to me. She doesn’t matter to me at all. And you know what? She’s earned it.\n\nI sat there and apologized to that entire group for them having to listen to that rant and the reason is simply this: They shouldn’t have had to listen to it. That should have been a private moment between Marie and I. Oh but wait. There’s Cary, constantly trying to show what a horrible, crazy bitch I am. So she thinks it’s more important to SNEAK down stairs and COWER around a corner to try and video tape it. AND ALSO - if you were REALLY that concerned about Marie’s safety, why the hell would you get your CAMERA OUT. Here’s an idea: Why didn’t you call the police if you really thought she was in danger. The fact is, she wasn’t in any kind of danger and Cary knew that. What’s the matter with you? All you’re doing, Cary, is showing your true colors and you’re clashing! You’re clashing so badly that even Mark would probably say that those colors are no good on you and he actually has great “Fashion Sense”! Be careful, world. Don’t say words around Cary. She’ll just record it and send it to her friends.\n\nSo here’s another weird thing I’m trying to wrap my head around. Cary tends to say this one liner a lot: “LeeAnne is just jealous of me.” When has that come up? When have I said that or ever led anyone to believe that? This is the perfect sign of a narcissist. Cary, it seems to me that you kind of WANT me to be jealous of you. Is that what this is? Look honey-I’ll take my man, my friends and my life over yours any day. That full head of hair and sexy chiseled body that my man has, yeah. His spirit, his strength and love for me is fulfilling. Our life together is fulfilling. News for you: you’re going to have to find someone else to be jealous of you to validate your life for you. (Good luck?)\n\nThe things that Cary is actually guilty of (that most people in this town know about) and me yelling at Marie (no matter my verbiage) are not even comparable. So the fact that she constantly wants ME to be the mean girl says to me that SHE is the mean girl. The fact that she constantly wants to try to make me look bad tells me that her jealousy issues are deeper than I thought. You know what? Go to yoga. But this time, instead of doing it for your body, do it for your spirit and your mind. Clean that shit out. Hell, I know I’d benefit from a little Yoga quiet time. Do what you CLAIM to do! Become an ACTUAL yogi that believes in peace and agape. #NAMASTE\n\nAll I can tell you is this weekend trip to Austin proves to me that last week, Cary called me her enemy and this week she’s trying to destroy me by videotaping me? Guess what, Cary. I own my sh--. What a shame that you can’t.\n\nShow Highlight Dinner Gets Real Awkward and Brandi Redmond Walks Out\n\nEveryone is giving me crap for being quiet at the dinner. I didn’t speak at that dinner because I knew all those girls wanted was for me to get as angry as I got the night before. But the difference is, I’m not going to get that mad, because I haven’t known these girls 20 years. I haven’t put my life on the line for these girls the way I have for Marie. I’ve done so much for Marie over the years, which is why I got as mad as I did. I don’t care what anyone’s judgment is. I’m not proud of the words I chose or the octave at which I delivered them. I admit that I should have sobered up before ever confronting and upsetting situation like that. I never would have even had the courage to do it without the alcohol.\n\nAs far as Tiffany defending me to Stephanie and Brandi all the time, I gotta tell you there, Steph, your mom and dad have got to be incredibly proud of you saying that Marie “takes it up the ass.” Wow, girl. You were the sweet one on the show, right? Because you’re being pretty freaking nasty right now. And Brandi, stop picking on Tiffany pleeeaase. THIS is what a real friend does. Remember at the Christmas party the stuff you told us about your “friendship”? Yeah, I’ve never said that about Tiffany. That’s because we are real friends.\n\nOkay, so tomorrow’s my birthday.\n\nI know you guys are going to give me a sh--load of hate on social media, so I’m not going to look at it tomorrow. If you want to reach out, wait until Wednesday or Thursday, because I’m going to CELEBRATE tomorrow. I’m turning 49, and I’m proud of that. I’ve lived through a lot, and learned a lot through it. I know I’m much older than anyone on this cast. Maybe, just maybe, I have some answers, if they’d just give me a chance. This week, it was betrayal, betrayal, betrayal everywhere.\n\nLet’s just say a social worker and a nurse could really take a lesson or two from a cheerleader about compassion. Thanks Brandi, I appreciate you having my back this week.\n\nPeace out, y’all.", "images": ["http://www.bravotv.com/sites/bravo/files/styles/media-gallery-embed/public/field_media_items/2016/02/real-housewives-of-dallas-season-1-leeann-photo-diary-06.jpg?itok=8nV4EpIh", "http://www.bravotv.com/sites/bravo/files/real-housewives-of-dallas-season-1-hero-108-leeanne-is-loud-mouth-in-brandis-phone.jpg", "https://www.bravotv.com/sites/bravo/files/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/477/243/160603_3046033_More_of_The_Epic_Confrontation_Between_LeeAn.jpg", "http://www.bravotv.com/sites/bravo/files/field_blog_image/2016/04/rhod-bow-at-me-moment-dissected.jpg", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/601/139/200108_4096063_LeeAnne_Locken_Blames_RHOD_Production_for_No.jpg?itok=ARsHSzia", "http://www.bravotv.com/sites/bravo/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/393/179/200413_4149848_Kandi_Burruss_and_Todd_Tucker_Clash_Over_New.jpg?itok=f4JKV304", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/596/835/200106_4094609_The_Ladies_Never_Thought_LeeAnne_Locken_s_Co.jpg?itok=GSMPJa-D", "http://www.bravotv.com/sites/bravo/files/styles/blog-post-embedded--mobile/public/2020-04/kandi-burruss-blaze-tucker-rhoa.jpg?itok=JeNobttG", "https://www.bravotv.com/sites/bravo/files/styles/contributor-logo/public/field_person_cover_photo/2018/06/leeanne_locken.jpg?itok=QNHecLKq", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/field_blog_image/2018/11/brandi-blog-image_3.jpg?itok=fz5SMbjx", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/field_blog_image/2018/11/stephanie-blog-image_3.jpg?itok=xzcgFA0x", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/field_blog_image/2018/11/dandra-blog-image_1_0.jpg?itok=Qqppe9r5", "https://www.bravotv.com/sites/bravo/files/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/804/199/160527_3043202_You_Won_t_Believe_What_LeeAnne_Just_Threaten.jpg", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/597/811/200106_4094607_What_Did_Kameron_Westcott_Mean_When_She_Told.jpg?itok=Q7h-mLDz", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/field_blog_image/2018/11/kameran-blog-image.jpg?itok=dixouVRM", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/600/163/200108_4096055_Here_s_What_You_Didn_t_See_at_The_Real_House.jpg?itok=9d1R1HXZ", "http://www.bravotv.com/sites/bravo/files/styles/blog-post-embedded--mobile/public/2020-04/sonja-morgan-bridget-everett-friendship.jpg?itok=cIbhVQv-", "http://www.bravotv.com/sites/bravo/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/529/839/200415_4151514_Why_Did_Denise_Richards_Stop_Filming_With_Th.jpg?itok=WTimcsbI", "https://www.bravotv.com/sites/bravo/files/field_blog_image/2016/06/leeanne-blog-image.jpg", "https://www.bravotv.com/sites/bravo/files/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/807/126/160527_3043203_Has_Brandi_Finally_Had_Too_Much_Jesus_Juice_.jpg", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/field_blog_image/2018/11/cary-blog-image_2.jpg?itok=AMJhvkp1", "https://www.bravotv.com/sites/bravo/files/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/478/219/160603_3046032_Dinner_Gets_Real_Awkward_and_Brandi_Redmond_.jpg", "http://www.bravotv.com/sites/bravo/files/styles/blog-post--computer/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/597/311/200106_4094608_Andy_Cohen_Grills_LeeAnne_Locken_Over_Her_Us.jpg?itok=CthpmGjz", "http://www.bravotv.com/sites/bravo/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/bravo-video.nbcuni.com/image/NBCU_Bravo/616/903/200410_4149060_Your_First_Look_at_the_Season_Finale.jpg?itok=sWG7OjgC", "http://www.bravotv.com/sites/bravo/files/styles/blog-post-embedded--mobile/public/2020-04/paul-adrienne-maloof-children-rhobh.jpg?itok=Tvhm2ri5"], "top_img": "https://www.bravotv.com/sites/bravo/files/field_blog_image/2016/06/leeanne-blog-image.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bravotv.com/the-real-housewives-of-dallas/season-1/blogs/leeanne-locken/leeanne-on-that-night-in-austin-betrayal", "title": "LeeAnne on That Night in Austin: Betrayal, Betrayal Everywhere", "meta_data": {"title": "The Real Housewives of Dallas LeeAnne Locken on That Night in Austin: Betrayal, Betrayal Everywhere | The Real Housewives of Dallas Blog", "twitter": {"card": "summary_large_image", "site": "@bravotv", "description": "Thank you all for tuning in again this week. Your loyalty softens the blow of some of the painful incidents I have relived while watching these episodes.", "title": "LeeAnne on That Night in Austin: Betrayal, Betrayal Everywhere", "url": "https://www.bravotv.com/the-real-housewives-of-dallas/season-1/blogs/leeanne-locken/leeanne-on-that-night-in-austin-betrayal", "image": "https://www.bravotv.com/sites/bravo/files/field_blog_image/2016/06/leeanne-blog-image.jpg"}, "og": {"site_name": "Bravo TV Official Site", "type": "article", "url": "https://www.bravotv.com/the-real-housewives-of-dallas/season-1/blogs/leeanne-locken/leeanne-on-that-night-in-austin-betrayal", "title": "LeeAnne on That Night in Austin: Betrayal, Betrayal Everywhere", "description": "Thank you all for tuning in again this week. Your loyalty softens the blow of some of the painful incidents I have relived while watching these episodes.", "image": "https://www.bravotv.com/sites/bravo/files/field_blog_image/2016/06/leeanne-blog-image.jpg"}, "fb": {"app_id": 1592250694320227}, "article": {"published_time": "2016-06-06T23:01:02-04:00", "modified_time": "2016-06-06T23:01:02-04:00"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0", "vertical_name": "Blogs"}, "movies": [], "publish_date": 1465268462.0, "source": "http://www.bravotv.com", "summary": ""}