{"url": "https://www.latimes.com/fashion/la-ig-wwd-goop-podcast-20180308-story.html", "text": "Goop is kicking off its weekly podcast in a big way. Oprah big. Oprah Winfrey is Goop’s inaugural guest on its podcast, hosted by founder Gwyneth Paltrow, and the hour-plus conversation touches on everything Oprah, from her decades as an inimitable television host to her experiences with Harvey Weinstein and her ultimate hope for the #MeToo movement and her political aspirations, or lack thereof.\n\nWinfrey said she was friendly with Weinstein in a professional capacity from the days of her eponymous talk show, but addressed accusations that she must have known of his allegedly long history of sexually predatory behavior toward female actors and other women, saying she simply had no idea and wasn’t really in that world of entertainment. But she did know that everyone dreaded getting a call from him.\n\n“I was in Chicago, in my own little world, but what I knew about Harvey was that Harvey was a bully and that if Harvey’s on the phone, you didn’t want to take the call because you’re going to get bullied in some way,” Winfrey said.\n\nWhile for her a call from Weinstein generally meant being pressured, in a way left undefined, to have certain people on her show, now Winfrey is left wondering why she even let herself be bullied at all.\n\nAdvertisement\n\n“What I do question for myself is why I was willing to put up with a bullying thing?” Winfrey said. “I was willing to put up with, ‘OK I’ll take the call,’ ‘OK I’ll do that’…why am I willing to put up with an a–hole? Why we won’t tolerate other things, but you can throw phones and call people jerks or whatever and do all this nasty stuff.”\n\nAs for why Weinstein’s alleged behavior was a watershed for the long-normalized harassment and sexual abuse of women, despite many previous public allegations against not only Weinstein but other high-profile men, Winfrey thinks it’s something akin to critical mass.\n\n“It had been coming, it had been coming,” Winfrey said. “It had been coming with [Bill] Cosby and nothing happened, it had been coming with Bill O’Reilly, even with the President of the United States, where people can hear the Access Hollywood tape and yet, nothing happens. It had been coming and [Weinstein] was the moment was where it all crystallized.…In order for a phenomenon to be a phenomenon everything has to line up. It means the culture, the zeitgeist, for a particular moment in time to be ready, available and open to hear that message.”\n\nThe idea that these issues and women’s experiences with abuse and harassment have been building up in the culture for so long, with most women throughout history being unable to speak up because it would likely have meant further harm to them and their families, was what Winfrey was trying to get across in her acceptance speech at this year’s Golden Globes — not a political platform.\n\nAdvertisement\n\n“I wasn’t trying to run for any office,” Winfrey said of the speech. “I wanted to be able to say to the #MeToo movement, I’m proud of where we are and what we’re doing, but you need to know you didn’t get here alone. There are those who endured, suffered and didn’t speak because they couldn’t speak.”\n\nWinfrey slipped back into her role of interviewer and asked Paltrow if her decision to go public last fall with her own Weinstein story — wherein the producer got her as a relatively unestablished young actor to his hotel room under the guise of a business meeting and proceeded to unabashedly proposition her and then berate her for confiding in family and friends about the episode — was triggered by the then few other stories that had come out about him.\n\n“Very, and it’s been months of me trying to process through it all,” Paltrow, who worked with Weinstein several times after the incident, said. “It only happened one time and I confronted him and he never tried anything like that again, but he was [always] a bully about work things, he was shaming, he was really hard on me and then was incredibly generous and would send me a private plane somewhere. It was a kind of typical abusive relationship and I hadn’t processed it, because so much of my acting career and so many of the incredible highs and lows, as well, were associated with him and Miramax.”\n\nPaltrow added that the experience of going public has “brought up a lot of stuff lately” including abuse from her childhood, a topic that Winfrey spoke of her own experiences with during the podcast, and said she’s recently begun to question whether her decision to mostly leave acting when she had her first child was actually related to her experiences with Weinstein.\n\nAdvertisement\n\n“I always told myself the story that I’d lost the passion for it and then I had my daughter and I wanted to be home and now I’m starting to put the pieces together and thinking did this predominate relationship in my professional life lead me to not want to do it anymore?”\n\nWinfrey said that so many negative experiences with Weinstein “certainly had an influence” but also admitted that her hope for the #MeToo movement goes beyond women’s rights, and that it continues to facilitate what she and Paltrow agreed has become “a culture of enough.”\n\n“I’m hoping that it leads to a better way of all human beings treating each other and that this moment in the movement is leading to us toward saying, ‘Not only am I not going to take your sexual harassment, I’m not going to take any of your bulls–t.’ Period. I think we’re on our way but we’re still figuring it out.”", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/b4cbff4/2147483647/strip/true/crop/269x269+105+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F19%2Fb1%2F73bcdbba10cc9f3374e70e0adae1%2Fimg-58b0e357-turbine-la-bio-kali-hays-wwd-20170224", "https://ca-times.brightspotcdn.com/dims4/default/c8f15b4/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/89be78b/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/c8f15b4/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/fashion/la-ig-wwd-goop-podcast-20180308-story.html", "title": "Gwyneth Paltrow, Oprah talk Weinstein, #MeToo’s future in first Goop podcast", "meta_data": {"og": {"title": "Gwyneth Paltrow, Oprah talk Weinstein, #MeToo’s future in first Goop podcast", "url": "https://www.latimes.com/fashion/la-ig-wwd-goop-podcast-20180308-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/c8f15b4/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/c8f15b4/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "Variety's Power of Women, Roaming Arrivals, Los Angeles, America - 09 Oct 2015"}, "description": "Goop is kicking off its weekly podcast in a big way. Oprah big.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/la-bio-kali-hays-wwd-20170224-staff.html", "content_tier": "metered", "published_time": "2018-03-08T19:15:00", "opinion": "false", "tag": "Fashion"}, "twitter": {"card": "summary_large_image", "description": "Goop is kicking off its weekly podcast in a big way. Oprah big.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/55a3861/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2Ffe%2F3c73c88caef1679e978ddef7339c%2Fla-1520535701-iityehg66x-snap-image", "alt": "Variety's Power of Women, Roaming Arrivals, Los Angeles, America - 09 Oct 2015"}, "site": "@latimes", "title": "Gwyneth Paltrow, Oprah talk Weinstein, #MeToo’s future in first Goop podcast"}, "fb": {"app_id": 119932621434123, "pages": 5863113009}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "Oprah Winfrey talked of her hosting days, the evolving \"culture of enough\" and a lot more as Goop’s first podcast guest.", "keywords": "health, Oprah, Gwyneth Paltrow, Weinstein, #MeToo, style, chat, wellness, Goop, podcast", "brightspot.contentId": "00000169-0cba-dbbe-a16f-4efa22210000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1520438400.0, "source": "https://www.latimes.com", "summary": ""}