{"url": "https://www.hollywoodreporter.com/news/dolly-parton-creating-tunes-jennifer-aniston-movie-dumplin-1167900", "text": "The country legend talks penning not one but six songs for the Netflix comedy, reveals plans for her upcoming anthology series for the streamer and dishes on the status of the '9 to 5' sequel.\n\nIt's downright odd that it took until 2018 for someone to make a rom-com revolving around Dolly Parton's unmatched catalog of empowerment bops, but here we are and here Dumplin' is.\n\nBased on the 2015 YA novel by Texas-based author Julie Murphy, Dumplin', which bowed on Netflix on Dec. 7, tells the story of Willowdean Dickson, the overweight daughter of a former pageant winner slash current pageant host, who signs up for her mom's Miss Teen Blue Bonnet pageant as a tribute to her late Aunt Lucy, whose intense Dolly fandom Will-for-short inherited. Lucy's attendant supreme self-confidence (having taken the gospels of Dolly to heart), however, has proved harder to absorb.\n\nThe film, starring Jennifer Aniston and Patti Cake$ breakout Danielle Macdonald, features big hair, cute boys, dance numbers and a whole host of other hooks to hang a Parton needle drop on.\n\nWhile reaching out to Parton to ask for the rights to standards like \"Two Doors Down\" and \"Jolene\" (rights without which there wouldn't be much of a film), Aniston — who also exec produced via her banner Echo Films — and director Anne Fletcher asked Parton if she would write a theme song. And by the way, would she work with composer/producer Linda Perry? \"They just kept flinging stuff at me and I just kept saying 'Sure!' And I didn’t know Linda, actually, so I was just being a good sport,\" Parton says. However, when Parton and Perry met, they \"clicked like you wouldn't believe.\"\n\nTasked with writing a song, the duo wrote five — \"Girl in the Movies\" (nominated for a Golden Globe), \"Red Shoes,\" \"Who,\" \"Push and Pull\" and \"If We Don't\" — and Parton wrote a sixth, \"Why.\"\n\nThe soundtrack is filled out with Perry-produced re-recordings of Parton hits, several featuring collaborators like Sia (\"Here I Am\") and Miranda Lambert (\"Dumb Blonde\"). On Nov. 30, the morning of the album's release, Parton, 72, spoke with THR about her partnership with Perry; why the song the filmmakers chose as the theme, \"Girl in the Movies,\" is getting the biggest awards push; and convincing Aniston to sing backup.\n\nWere you surprised when the producers contacted you about this project and about collaborating with Linda?\n\nI didn’t know Linda, actually, so I was just being a good sport and was just flattered and honored that there was a movie being made that was paying some kind of homage to me. I got with Linda and we just clicked like you wouldn't believe. I was very surprised because I don’t write with people. I’m very picky about that. I've written with very few people in my whole lifetime. We started writing and working on what we thought would be the theme song, but we were so inspired we just kept just writing and writing and writing songs they hadn’t even asked for! So then we thought, \"Well we'll just save that for another album.\" But [Anne and Jennifer] kept hearing the songs and they thought, \"Well we can weave these in and out of the movie, and we can actually make these part of the soundtrack.\" So it just really came from two very strong women that love to write and love to create things, so it’s been a wonderful partnership.\n\nWhen you and Linda got together, was \"Girl in the Movies\" the first song you wrote?\n\nActually, I don't think that was the first one. I told [Linda], \"Let's go see the movie before we start to write anything,\" because I have to see and feel these characters; I have to know their stories. I [had read] the book, but that's different when you see it onscreen. Jennifer Aniston took Linda and me to see a rough cut of it. I got to know all the characters — the attitudes, the emotions, the feelings of all the people. That's when we started to write the different songs for it. I wrote the lyrics mostly. Linda's very strong with music and I'm good with words and feelings, so it was a very good collaboration. It was all based on what I felt the movie was about.\n\nAt some point, Miley Cyrus was going to sing \"Girl in the Movies\" or duet with you?\n\nI had hoped Miley could sing with me, and we actually did a cut of it, but we thought that this movie was coming out last year. Miley had a little bit of time and was kind of in between projects and so was I. But it kept lagging and lagging, so Miley had to start on her own projects; she was doing a new record and getting ready for her new tour. In defense of her, she did try and she did give us permission [to release the cut], but after a time we couldn't put it out as a single and it turned out that this was the [song] they wanted to use as the theme song, so we just had to take Miley off. But she will at some point record it, and I'm going to sing with her on her version.\n\nWhen you write six songs, how do you decide which one to focus on for the Oscar campaign?\n\nThe record label has a lot to do with it. I know everyone just seemed to take to \"Girl in the Movies\" because it is about a girl in the movies and [the song] is in the movie. That particular song was more of a team effort. I really enjoyed it, but I never know which one of my songs is great — they're like my kids; I love 'em all. Some of them might be prettier in other people's eyes, but they're all beautiful to you. So that was more of a business-ended decision on which [song] should be first, what they thought would be the best contender for an Oscar. Now that we are talking about it, \"Red Shoes\" is one of my personal favorites.\n\nI really like \"Push and Pull.\" It seems like it's the most thematically linked to the movie, in my mind. It also struck me as the most classic \"Dolly\" song.\n\nThere's a lot of truth in that, and actually, when I saw the movie I saw the relationship with the mother and the daughter, and they were both trying to push and pull. And I also have a sister and one of her daughters, and they’re always kinda like that too; they're always pushing and pulling and they fight and they fuss and they get back together. The reason it sounded like a Dolly song is I was playing off a lot of my own emotions and family feelings — and of course everybody has that in their family: mothers and daughters and fathers and sons, they collide when the kids start getting old enough to have a mind of their own. Anyhow, that is where I came up with \"Push and Pull.\" Not only that but I got Danielle and Jennifer to come over and sing on it. The said, \"Oh no, we don't sing!\" and I said \"You do now! I had them both come over, Linda and I, and we worked with them. They were so nervous, but they did good! And they're on there, credited.\n\nI also wanted to ask about \"Jolene\" with the new arrangement. I know you've recorded that song a lot over the years different ways. How did this version come about?\n\nWell actually that was totally Linda’s idea. She loved the song \"Jolene\" and she put on Paul McCartney's version of \"Eleanor Rigby\" and said, \"Wouldn’t it be cool to just do 'Jolene' completely different? Just you and the orchestra?\" I said \"Well, I guess!\" (Laughs.) And so she worked up a string arrangement with the orchestra and she said, \"Well, get out there and sing!\" I went out and it was like a one-take! It was really a magical moment. To hear it slowed down that way with the orchestra it really took it into that Elizabethan sound, like old parlour music. It took on a life of its own, and I am really proud of that. I had never thought of [the song] that way, and I cannot take any credit for it — other than to write it and to sing it. (Laughs.)\n\nWell, you know, just that!\n\nBut not for that new arrangement! It's kinda refreshing actually to get to do it differently than I always have.\n\nWhat can you say about the songs that will be featured in your eight-episode Netflix anthology series?\n\nThe series is called Heartstrings, and it's based on songs that I've written. Some of them are famous and some of them are not. They're just the songs that make the best stories. We, of course, did \"Jolene.\" Julianne Hough played Jolene, and she killed it. And Kimberly Williams-Paisley, Brad Paisley's wife, played Jolene's best friend. I actually got to star in that one: [My character owns] the bar where Jolene works — she's a singer — so I'm trying to encourage her to get to Nashville and all that. We also did \"Two Doors Down.\" We did a song called \"If I Had Wings,\" with Gerald McRaney and Delta Burke. They're married, of course, and have been for many, many years, but it's the first time they've starred together in anything. We did one pet song — I have an old song called \"Cracker Jack.\" We have one called \"J.J. Sneed\" — it's a Western. They're all completely different. One of my favorites is called \"These Old Bones.\" It's about an old clairvoyant country woman played by Kathleen Turner. I narrate all the shows at the front and talk about how the song came to be, and my music plays in and out — sometimes more than one song in each show.\n\nI have to ask if you did an episode based on one of my personal favorites, \"Wildflowers\"?\n\nWell, you know what? I will. Because I'm like you: I think \"Wildflowers\" would make a wonderful one. It's kind of like my story. That's so much like \"The Dolly Parton Story\" that I'm going to make them pay me more money for that one! (Laughs.) But I will be doing ones like \"My Blue Ridge Mountain Boy\" about the country girl that goes to New Orleans, becomes a prostitute and thinks she's going to make it big in the world and then realizes she misses that boy she left behind. If they continue with it — because they seem to like what we're doing so far — after these eight shows, which they plan to drop next fall worldwide, we'll see how it goes.\n\nWhat's that status of the 9 to 5 sequel, which is set up at Fox with Rashida Jones and Pat Resnick writing the script?\n\nActually, we are supposed to have the first scripts in our hands within days. Of course, we will have to see what our thoughts are, and it will have to be rewritten a time or two, I'm sure. Hopefully, we might get a chance to start that in the new year. But it's going to really be good — after all these years, they finally came up with something that makes sense and was worthwhile to do. [The new plot focuses on] three younger women working at the same Consolidated Companies, and these three girls try to figure out who these women were who made all these changes years ago. They find us, and I am sure it will have a lot of comedy and cover some issues that still need to be touched on, but in a fun, new way. Talking about 9 to 5, they did a 9 to 5 [movie,] then they did a 9 to 5 series, which actually stars one of my sisters, Rachel. Then I had the chance to write the musical 9 to 5 for Broadway, and now they are actually opening that again in London in January. I've written another song or two for that. I'm very proud that 9 to 5 just keeps paying off. It is the song and the movie that just will not die!\n\nA version of this story first appeared in a December stand-alone issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/12/dolly_parton.jpg", "https://cdn1.thr.com/sites/default/files/2018/12/dolly_parton.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/12/dolly_parton.jpg", "keywords": [], "authors": ["Pete Keeley", "Pete.Keeley Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/dolly-parton-creating-tunes-jennifer-aniston-movie-dumplin-1167900", "title": "Dolly Parton on Creating Tunes for 'Dumplin'': \"I Was Playing Off a Lot of My Own Emotions\"", "meta_data": {"viewport": "width=device-width", "description": "Dolly Parton talks penning not one but six songs for the Netflix comedy, reveals plans for her upcoming anthology series for the streamer and dishes on the status of the '9 to 5' sequel.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/dolly-parton-creating-tunes-jennifer-aniston-movie-dumplin-1167900", "domain": "https://www.hollywoodreporter.com/", "title": "Dolly Parton on Creating Tunes for 'Dumplin'': \"I Was Playing Off a Lot of My Own Emotions\"", "description": "The country legend talks penning not one but six songs for the Netflix comedy, reveals plans for her upcoming anthology series for the streamer and dishes on the status of the '9 to 5' sequel.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/12/dolly_parton.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Dolly Parton on Creating Tunes for 'Dumplin'': \"I Was Playing Off a Lot of My Own Emotions\"", "description": "The country legend talks penning not one but six songs for the Netflix comedy, reveals plans for her upcoming anthology series for the streamer and dishes on the status of the '9 to 5' sequel.", "url": "https://www.hollywoodreporter.com/news/dolly-parton-creating-tunes-jennifer-aniston-movie-dumplin-1167900", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/12/dolly_parton.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Dolly Parton on Creating Tunes for 'Dumplin'': \"I Was Playing Off a Lot of My Own Emotions\"", "sailthru.description": "The country legend talks penning not one but six songs for the Netflix comedy, reveals plans for her upcoming anthology series for the streamer and dishes on the status of the '9 to 5' sequel.", "sailthru.author": "Pete Keeley", "sailthru.vertical": "Music", "sailthru.date": "2018-12-12 08:30:00", "sailthru.tags": "Movies,Music,Dolly Parton,Netflix,Dumplin"}, "movies": [], "publish_date": 1544574600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}