{"url": "https://people.com/home/drew-scott-linda-phan-wedding/", "text": "Drew Scott is officially a married man!\n\nThe Property Brothers star married Scott Brothers Global creative director Linda Phan in a whimsical outdoor ceremony on Saturday in Italy. The couple said their vows in front of 300 guests, including family and friends who flew in from the United States, Canada, Latin America and Scotland.\n\nGet push notifications with news, features and more.\n\n“We are still floating on clouds… today couldn’t have been more magical,” the couple exclusively tells PEOPLE. “Surrounded by so many loved ones in such a beautiful place was unreal. We are very, very lucky. Friends, family, amazing food, blue skies and being even more in love than ever before — what more could we ask for?”\n\nDesigned by Oany Ravelo, the destination wedding festivities kicked off on May 9 with bachelor and bachelorette excursions including a bicycle tour and cooking classes. They then hosted an Apulian style welcome party on May 11, complete with artisan booths including cheese and pasta making.\n\nImage zoom Dennys iLic\n\n“There was never a thought of doing anything else for both of us,” says Scott. “A whole week to hang out on a beach, enjoy each others’ company: that sounded like the perfect wedding to us.”\n\nFor more details and photos from the wedding, pick up the issue of PEOPLE on newsstands Friday, May 18, and watch PeopleTV’s exclusive special, People Weddings: Drew Scott and Linda Phan, on Wednesday, May 16 on PeopleTV.com or download the app on your favorite mobile or connected device.\n\nFor the big day, Phan’s ceremony and reception dresses were designed by Claire Pettibone, while Scott, 40, and his groomsmen wore kilts by Claymore Imports. Scott later changed into a custom tuxedo for the reception by GotStyle.\n\nThe couple exchanged custom wedding bands by Devil’s Workshop and Florist Vincenzo Dascanio created the flower arrangements for the ceremony. “He’s a mastermind,” says Phan, 31, of the arrangements.\n\nFor their first dance, the newlyweds surprised guests with a choreographed number by Scott’s Dancing with the Stars partner, Emma Slater, and her husband, Sasha Farber.\n\nThe wedding party included Scott’s brothers, Jonathan and J.D., who served as the best men, while Linda opted to go sans maid of honor, but had 10 bridesmaids. Scott gifted his groomsmen with personalized gift sets by Swanky Badger and Linda gave her wedding party PJ sets and scarves by Cloroom and Wayu Shigra Bucket Bags from ME to WE, hand-woven by artisan partners in Ecuador.\n\nIn lieu of a registry, the couple partnered with the non-profit ME to WE to tie their wedding with their passion for the charity’s mission to provide access to clean water to people in need around the world.\n\nFor each of their 300 guests, Scott and Phan gave out two travel bags designed by Lug, plus custom pizza cutters and plates that they created with Fortessa, the manufacturer of their Scott Living line. The set will also be available for purchase on Amazon, and for each one sold, Fortessa will donate to the #WeMovement, providing one person with clean water for life.\n\nThe couple’s buttercream frosting cake, which will be featured on an episode of Cake Hunters (airing June 25, at 8:30 p.m. on Food Network), was made with four flavors inside including vanilla with goat cheese and strawberry balsamic, organic red velvet, carrot and chocolate hazelnut.\n\nWhile the pair is keeping their honeymoon destination a secret, they can’t wait for the next chapter of their lives.\n\n“I’m most looking forward to spending more time together,” says Scott. “We’ve been working so hard for so long, I’m looking forward to making plans to settle down and just enjoy doing nothing once in a while.”\n\nProperty Brothers: Linda & Drew Say I Do premieres June 2 at 9/8c on TLC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg", "keywords": [], "authors": ["Emily Strohm"], "canonical_link": "https://people.com/home/drew-scott-linda-phan-wedding/", "title": "Drew Scott Is Married! The Property Brothers Star Weds Linda Phan in 'Magical' Italian Ceremony", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrity Weddings,Drew Scott,Exclusive,Property Brothers,Wedding", "news_keywords": "Celebrity Weddings,Drew Scott,Exclusive,Property Brothers,Wedding", "description": "The Property Brothers star married Scott Brothers Global creative director Linda Phan in a romantic outdoor ceremony on Saturday.", "og": {"title": "Drew Scott Is Married! The Property Brothers Star Weds Linda Phan in 'Magical' Italian Ceremony", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/home/drew-scott-linda-phan-wedding/", "description": "Drew Scott is officially a married man! The Property Brothers star married Scott Brothers Global creative director Linda Phan in a whimsical outdoor ceremony on&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/home/drew-scott-linda-phan-wedding/", "description": "The Property Brothers star married Scott Brothers Global creative director Linda Phan in a romantic outdoor ceremony on Saturday.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/home/drew-scott-linda-phan-wedding/", "title": "Drew Scott Is Married! The Property Brothers Star Weds Linda Phan in 'Magical' Italian Ceremony", "description": "The Property Brothers star married Scott Brothers Global creative director Linda Phan in a romantic outdoor ceremony on Saturday.", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fdrew-linda-wedding1-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}