{"url": "https://www.flare.com/bachelor/bachelor-winter-games/", "text": "Does it look corny AF? Yup. Are we going to watch? You betcha\n\nOur favourite Bachelor hotties are returning for another shot at love—and this time it’s going international.\n\nThe new Bachelor spinoff, The Bachelor Winter Games, debuts on Feb. 13 at 8:00 EST and is basically a show where contestants compete in a series of winter-themed challenges for a chance to win the ultimate prize: love. *Cue eye rolls now* The show, described as “different and fun” by host Chris Harrison, is a four-part series filmed in Manchester, Vermont, at what producers call a “luxurious winter resort.” (Basically, it’s a fancy AF space for cozy rendezvous, cuddle sessions and, obviously, drama.)\n\nWhile we’re stoked that some of our fave Bach Nation contestants will be taking part (hello Eric Bigger!), we don’t know a heck of a lot about this new *reality* show. So, we did a deep dive into The Bachelor Winter Games and this is everything we learned so far about the show we will complain about non-stop while compulsively watching. You’re welcome.\n\nWhen it airs\n\nClear your calendars, babes. The four-parter airs from 8:00 EST to 10:00 EST on Tuesday, February 13, Thursday February 15, Tuesday February 20 and Thursday February 22 on ABC. That means—including Arie’s season—there will be six hours of Bachelor Nation programming on the weeks of February 12 and 19. We are seriously not sure if we can handle it all, HBU?\n\nHere’s how the game works\n\nTen former Bachelor/Bachelorette contestants from the United States along with 14 contestants from overseas editions of The Bachelor—including Australia’s Tiffany Scanlon, Canada’s Benoit Beausejour Savard and New Zealand’s Jordan Mauger—will compete for “date cards” that they can use to pursue romantic one-on-ones with fellow competitors. How does one win a date card, you ask? Simple. By showing off one’s skiing, biathlon and ice-dancing skills.\n\nAccording to a press release by ABC, the competitions will “test the contestants’ perseverance in pursuing relationships with one another while faced with language barriers and cultural differences.” Producer Mike Fleiss hopes the games will “create a global celebration of unity and love.” Hey, if that means we get to see Ben Higgins’s winter bod we’re alllllllll for it.\n\nThe special guests are insane\n\nIn case you are bummed about missing some of the actual Winter Olympics in Pyeongchang, South Korea (which will air at the same time), you can get your athlete fix with special appearances by world figure skating champions Tai Babilonia and Randy Gardner, and Olympic figure skater Nancy Kerrigan. Other special appearances include former Bach contestants and forever lovebirds Trista and Ryan Sutter, who will kick off the games as “grand marshals,” former Bachelorettes Rachel Lindsay and JoJo Fletcher, and current Bachelor Arie Luyendyk Jr.\n\nThese are the contestants we are most stoked to see\n\nBen Higgins\n\nOur hearts filled and then eventually broke for season 20 Bachelor Ben and his now-ex Lauren Bushnell. But hey, if Ben can’t find love in Vermont, Amy Schumer seems to dig him.\n\nAshley Iaconetti (a.k.a. Ashley I)\n\nC’mon. As if we wouldn’t be excited for the return of infamous Kim Kardashian-esque crying Ashley! It’s been too long since we saw her on Bachelor in Paradise seasons 2 and 3. And if the games are anything like the promo suggests, there will be plenty of tears ahead.\n\nEric Bigger\n\nSweet, charming, sexy Eric was a fan favourite on Rachel Lindsay’s season of The Bachelorette. He wasn’t lucky enough to capture her Final Rose, but will her guest appearance bring up old feelings? WE HOPE SO.\n\nLuke Pell\n\nWe still have a serious bone to pick with Luke about his not-so-cute f-ckboy tendencies, so we will be watching to see if he’s improved his behaviour.\n\nDean Unglert\n\nHe won our hearts when he showed his sensitive side on Rachel’s season of The Bachelorette, but got a bad boy reputation on Bachelor in Paradise season 4 when he tried to date BOTH Kristina Schulman and Danielle Lombard. Which Dean will we get this time?\n\nHow do Bach fans feel?\n\nMany fans are stoked for the triumphant return of our favourite Bachelor babes\n\nOH MY GOD BACHELOR WINTER GAMES??? MY KIND OF SPORT — aleX cwioK (@AlexCwiok) January 9, 2018\n\nBACHELOR WINTER GAMES? MY PRAYERS HAVE BEEN ANSWERED. — Paige Kirby (@paigeypookirby) January 9, 2018\n\nBut for real, Winter Games is looking promising, I might have to change my availability at work. #TheBachelor — ThatBachelorDude (@dude_bachelor) January 9, 2018\n\nOthers, not so much\n\nReading the cast for the bachelor winter games and it’s going to be a collective no from me dogg — Jennifer Iams (@jennifer_iams) January 8, 2018\n\nWhy is #BachelorWinterGames a thing? Why is The Bachelor still a thing? — Alana Mary (@AlanaKeke) January 8, 2018\n\nAnd some just don’t know what to think—but are obvs going to watch anyway\n\nMe to me: Okay there’s too many Bachelor spin offs it’s too much. It’s dumb.\n\nalso me: *sees Eric and Dean on Bachelor Winter Games* BIH ITS TIME TO WATCH GET READY — (Angel)ika (@angelikamariem) January 9, 2018\n\nWhy the hell is there a Bachelor Winter Games? Like do we really need more? And also when does it start? Not for me to set my DVR or anything — Alexis Moffett (@alexismoffett) January 8, 2018\n\nEven though i 0% care about The Bachelor winter games I’m about 95% sure that i will still watch. Who’s with me? #TheBachelor #TheBachelorWinterGames — Liv Ciotta (@quam_pura_nites) January 8, 2018\n\nRelated:\n\nPeter Kraus No Longer Listed as Cast on ‘The Bachelor Winter Games’\n\nSharleen Joynt on The Bachelor: Episode 2 + New Video!\n\nFor Your Reference: A Guide to Bachelor Arie’s Remaining Women", "images": ["https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/close.png", "https://www.flare.com/wp-content/uploads/2018/01/INLINE_BachelorWinterGames.jpg", "https://www.flare.com/wp-content/uploads/2018/01/FB_WinterGames.jpg", "https://www.flare.com/wp-content/themes/flare.com/assets/images/logo.png", "https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/info.png"], "top_img": "https://www.flare.com/wp-content/uploads/2018/01/FB_WinterGames.jpg", "keywords": [], "authors": ["Lindsay Pinter"], "canonical_link": "https://www.flare.com/bachelor/bachelor-winter-games/", "title": "Everything We Know About 'The Bachelor Winter Games'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"What the Hell Is &lt;i&gt;The Bachelor Winter Games&lt;\\/i&gt;?! Here&#039;s Everything We Know\",\"url\":\"https:\\/\\/www.flare.com\\/bachelor\\/bachelor-winter-games\\/\",\"pub_date\":\"2018-02-07 13:17:54\",\"mod_date\":\"2018-02-07 16:39:43\",\"type\":\"post\",\"post_id\":\"637591\",\"author_id\":\"1\",\"author_name\":\"FLARE Staff\",\"author_display_name\":\"Flare Staff\",\"tags\":[\"Editor&#039;s Picks\",\"The Morning After\"],\"categories\":[\"Bachelor\"],\"image\":\"https:\\/\\/www.flare.com\\/wp-content\\/uploads\\/2018\\/01\\/FEATURE_BachelorWinterGames.jpg\",\"image_alt\":\"Dean and Eric from The Bachelorette posing together for Bachelor Winter Games\"}", "description": "Are you confused about 'The Bachelor Winter Games'? We got you. From the schedule to the cast (#NotPeter) to how the it *really* works, here's what we know", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Everything We Know About 'The Bachelor Winter Games'", "description": "Spoiler: DEAN IS BACK", "url": "https://www.flare.com/bachelor/bachelor-winter-games/", "site_name": "Flare", "updated_time": "2018-02-07T16:39:43-04:00", "image": "https://www.flare.com/wp-content/uploads/2018/01/FB_WinterGames.jpg"}, "article": {"publisher": "https://www.facebook.com/FLAREFashion", "tag": "The Morning After", "section": "Bachelor", "published_time": "2018-02-07T13:17:54-04:00", "modified_time": "2018-02-07T16:39:43-04:00"}, "twitter": {"card": "summary_large_image", "description": "Spoiler: DEAN IS BACK", "title": "Everything We Know About 'The Bachelor Winter Games'", "site": "@FLAREfashion", "image": "https://www.flare.com/wp-content/uploads/2018/01/FB_WinterGames.jpg", "creator": "@FLAREfashion"}, "generator": "WordPress 4.9.13", "msapplication-TileImage": "https://www.flare.com/wp-content/uploads/2020/02/favicon.png"}, "movies": ["https://www.youtube.com/embed/rWvTRMi657o"], "publish_date": 1518023874.0, "source": "https://www.flare.com", "summary": ""}