{"url": "https://www.girlfriend.com.au/shawn-mendes-reveals-why-he-is-single", "text": "BUT, Shawn has his reasons.\n\nShawn spoke with Variety recently to talk about his HUGE transformation from a Vine star to a pop-music sensation and also touched on his elusive love life, and why he's not in a relationship right now.\n\n“I’m not currently dating anyone, but it’s not because I don’t have time — I don’t know if I’d be dating anyone if I was home in Pickering, either,” he explains. “It hasn’t stumbled across me, and I’m not chasing it. Of course, seeing all those other artists and people in relationships, you think, ‘Maybe it would be nice; who would be great for me?’ And that’s when you realize: ‘This is wrong. Let it be. I’m not supposed to be with anyone right now.'”\n\nHe did however admit last week that he's open to dating one of his fans... so ladies, line up!", "images": ["https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "https://www.girlfriend.com.au/Branding/Girlfriend/images/brand-logo-footer-new.svg", "http://www.girlfriend.com.au/media/11872/1000-shawn-mendes.jpg", "https://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "https://instagram.com/p/BnBhNvwBbPa/media/?size=l", "https://www.girlfriend.com.au/media/28821/gf0220_cover_harry_bws.png?height=158", "https://www.girlfriend.com.au/Branding/Girlfriend/images/brand-logo-mobile-menu-colored.svg", "https://www.girlfriend.com.au/Branding/Girlfriend/images/brand-logo-nav.svg"], "top_img": "http://www.girlfriend.com.au/media/11872/1000-shawn-mendes.jpg", "keywords": [], "authors": ["Summer R", "Summer Is A Digital Content Writer For Gf Online. When She'S Not Listening To On Repeat You'Ll Find Her Wandering Through The Aisles Of Sephora On The Hunt For The Perfect Highlighter."], "canonical_link": "https://www.girlfriend.com.au/shawn-mendes-reveals-why-he-is-single", "title": "Shawn Mendes reveals the really sweet reason why he's still single", "meta_data": {"language": "en-us", "description": "Shawn Mendes reveals the really sweet reason why he's still single", "news_keywords": "Shawn Mendes, Shawn Mendes dating life, Shawn Mendes relationship life, Shawn Mendes love life, Why is Shawn Mendes single, Is Shawn Mendes single, Shawn Mendes relationship news", "robots": "index, follow", "og": {"site_name": "Girlfriend", "type": "article", "url": "https://www.girlfriend.com.au/shawn-mendes-reveals-why-he-is-single", "title": "Shawn Mendes reveals the really sweet reason why he's still single", "description": "We volunteer!", "image": {"identifier": "http://www.girlfriend.com.au/media/11872/1000-shawn-mendes.jpg", "width": 1000, "height": 640}}, "twitter": {"title": "Content Media Help  Type to search... Content   Home   Content Gallery Content Article Content Recipe Content Video Content   Site Configuration   Sponsored Content   Sponsorships Author Profiles   Recycle Bin   Shawn Mendes reveals why he is single Intro Detail Content Body Content Label Content Management Metadata Syndication Video Meta Title Meta Title should be 55 to 60 characters in length. Defaults to \"Meta Title\" | Brand Title  You have entered 0 characters. Meta Description Meta Description should be 150 to 155 characters in length. Default to \"Description\"  You have entered 0 characters. Social Preview Image Optional - Will default to header image if not provided DFP Keyword  Canonical Url  Facebook OG Title This field is used to populate the Facebook OG Title  Facebook OG Description This field is used to populate the Facebook OG description  Twitter OG Title This field is used to populate the Twitter OG Title  You have entered 0 characters. Twitter OG Description This field is used to populate the Twitter OG description  You have entered 0 characters.   Save", "description": "Shawn Mendes reveals the really sweet reason why he's still single", "image": "http://www.girlfriend.com.au/media/11872/1000-shawn-mendes.jpg", "url": "https://www.girlfriend.com.au/shawn-mendes-reveals-why-he-is-single"}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1535504116.483, "source": "https://www.girlfriend.com.au", "summary": ""}