{"url": "http://www.washingtonpost.com/news/wonkblog/wp/2014/08/06/a-comprehensive-investigation-of-voter-impersonation-finds-31-credible-incidents-out-of-one-billion-ballots-cast/", "text": "May 2014: Ben Hodzic allegedly voted at the polls in the name of his brother in the Catskill School District Board of Education election in Catskill, NY.[1]\n\nNov. 2013: Mark Atlas allegedly voted at the polls in the name of someone else in the municipal election in Worcester, MA.[2]\n\nSep. 2013: At least four, and possibly 20-24, Hasidic voters in the South Williamsburg neighborhood of Brooklyn, NY, allegedly attempted to vote at the polls under others’ names in the municipal primary elections for New York City.[3]\n\nMar. 2013: Kristina Bentrim went to vote at the polls in the Cedar Rapids, IA, special election on a gambling referendum, and was allegedly told that someone had voted in her name.[4] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2012: A vote was apparently cast at the polls in the name of Angela Cooney in the general election in San Diego, CA; there is an Angela Cooney listed as dying 4 years earlier.[5] It is not clear whether the two are the same person, or whether the death reports are accurate, and poll book records do not appear to have been investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2012: A vote was apparently cast at the polls in the name of Evan Dixon in the general election in San Diego, CA; there is an Evan Dixon listed as dying 11 years earlier.[6] It is not clear whether the two are the same person, or whether the death reports are accurate, and poll book records do not appear to have been investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2012: A vote was apparently cast at the polls in the name of Alejandro Guerrero in the general election in San Diego, CA; there is an Alejandro Guerrero listed as dying 5 years earlier.[7] It is not clear whether the two are the same person, or whether the death reports are accurate, and poll book records do not appear to have been investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\n2012: According to the North Carolina State Board of Elections, one allegation of impersonation fraud in 2012 was sufficiently credible to refer to the local district attorney.[8] It is not clear whether the alleged fraud was in-person, or if follow-up established whether fraud did or did not likely occur.\n\nJune 2011: Hazel Brionne Woodard apparently arranged for her son Mark James Jr. to vote at the polls in the name of his father, Mark James Sr., in the municipal runoff elections in Tarrant County, TX.[9]\n\nNov. 2010: Four ballots may have been cast in the general election in South Carolina in the name of voters who had previously died (Ed Louis Johnson, Elbert R. Thompson, Ruth Middleton, and James L. Warnock); election and law enforcement officials had insufficient information to come to a final conclusion, including two pollbook pages that were unavailable. (Law enforcement agents believe that the ballot of Elbert R. Thompson may have been confused with that of his son, Elbert Thompson.) Another 203 allegations of deceased voters in the same election were revealed to be either clerical error or coincidence.[10]\n\nMay 2009: Lorenzo Antonio Almanza, Jr., after voting himself, apparently cast a ballot at the polls in the name of his incarcerated brother, Orlando Almanza, in the 2009 election for the Progreso Independent School District Board, TX. (His mother, Reyna Almanza, vouched for him, and was separately convicted.)[11]\n\nNov. 2008: A vote was apparently cast at the polls in the name of Forrest Downie in the general election in San Diego, CA; there is a Forrest Downie listed as dying 3 years earlier.[12] It is not clear whether the two are the same person, or whether the death reports are accurate, and poll book records do not appear to have been investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2008: A vote was apparently cast at the polls in the name of Scott Hagloch in the general election in San Diego, CA; there is a Scott Hagloch listed as dying 2 years earlier.[13] It is not clear whether the two are the same person, or whether the death reports are accurate, and poll book records do not appear to have been investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nMar. 2008: Jack Carol Crowder III allegedly impersonated his father (Jack Carol Crowder), using his father’s voter registration card at the polls in the March 2008 presidential primary election in Baytown, TX.[14]\n\nAug. 2007: A vote was apparently cast at the polls in the statewide primary in Hattiesburg, MS, in the name of James E. Barnes, who died in 2006. This may (or may not) have been the result of clerical error confusing the man with his son, James W. Barnes; it is not clear whether the pollbooks were reviewed to determine whether fraud or clerical error was the cause.[15]\n\nAug. 2007: A vote was apparently cast at the polls in the statewide primary in Hattiesburg, MS, in the name of Stanley Dwayne Echols, who was at the hospital and did not vote.[16] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nJune 2007: The two contending city council candidates in a municipal runoff election in Hoboken, NJ, both reported instances in the election in which someone went to the polls and found out that someone else had voted in their place.[17] It is not clear how many instances there were, or how the candidates learned of them. It is also not clear whether poll book records were investigated to determine whether the records of voting represented impersonated signatures or clerical errors.\n\n2007: A vote was apparently cast at the polls in a municipal budget referendum in Stonington, CT, in the name of Jane M. Drury, who died in 2000.[18] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2004: Rosalie B. Simpson died in August 2004, but a vote was apparently recorded at the polls in her name in the general election in Seattle, WA.[19] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2004: Frank Sanchez, in Albuquerque, NM, was told that someone had signed on the line for his name in the pollbook during the general election.[20] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2004: Someone apparently signed on the pollbook line for Rose-Mary G. McGee, in Albuquerque, NM, during the general election.[21]\n\nNov. 2004: Dwight Adkins, in Albuquerque, NM, was told that someone had signed on the line for his name in the pollbook during the general election.[22] It is not clear whether poll book records were investigated to determine whether the record of voting represented an impersonated signature or a clerical error.\n\nNov. 2004: Three people at the polls in Westchester County, NY, were given provisional ballots (in New York, “affidavit ballots”) in the general election because someone had allegedly signed the poll books in their place.[23] It is not clear whether poll book records were investigated to determine whether the records of voting represented impersonated signatures or clerical errors.\n\nNov. 2004: A vote was apparently cast at the polls in the general election in Milwaukee, WI, in the name of an individual who had died several years earlier.[24] It is not clear whether poll book records were investigated to determine whether the records of voting represented impersonated signatures or clerical errors.\n\n2004: According to the North Carolina State Board of Elections, one allegation of impersonation fraud in 2004 was sufficiently credible to refer to the local district attorney. [25] It is not clear whether the alleged fraud was in-person, or if follow-up established whether fraud did or did not likely occur.\n\nJan. 2004: Mark Lacasse apparently voted at the polls in the presidential primary in Londonderry, NH, in the name of his father, who was away on business at the time. [26]\n\nNov. 2002: Shasta Nicole Crayton apparently voted in her sister’s name at the polls in the general election in Dadeville, AL.[27]\n\nIn several municipal, primary, and general elections in 2006, 2007, 2008, 2010, and 2011, votes were cast in-person in Philadephia, PA, by an individual named Joseph Cheeseboro and by an individual named Joseph J. Cheeseborough. There is apparently some doubt about where one or both names represent real identities.[28]\n\nIn elections from October 2008 through June 2011, 44 individuals with names, dates of birth, and Social Security numbers matching the information of individuals listed as incarcerated were recorded as having cast ballots in person in Michigan.[29] It is not clear whether records were further investigated to determine whether the matches represent fraudulent votes or clerical errors in either the incarceration records or the voting records.\n\nIn elections from October 2008 through June 2011, 145 individuals with names, dates of birth, and addresses matching the information of individuals listed as deceased were recorded as having cast ballots in person in Michigan.[30] It is not clear whether records were further investigated to determine whether the matches represent fraudulent votes or clerical errors in either the death records or the voting records.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F5DBQB7KVMZVTERC6M4ZQSWQHI.jpg&w=150", "http://www.washingtonpost.com/pf/resources/images/favicon.ico?d=236"], "top_img": "http://www.washingtonpost.com/pf/resources/images/favicon.ico?d=236", "keywords": [], "authors": ["Justin Levitt"], "canonical_link": "https://www.washingtonpost.com/news/wonk/wp/2014/08/06/a-comprehensive-investigation-of-voter-impersonation-finds-31-credible-incidents-out-of-one-billion-ballots-cast/", "title": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast", "meta_data": {"description": "Voter impersonation is a dumb way to steal an election, which is why it rarely happens.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/wonk/wp/2014/08/06/a-comprehensive-investigation-of-voter-impersonation-finds-31-credible-incidents-out-of-one-billion-ballots-cast/", "title": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast", "description": "Voter impersonation is a dumb way to steal an election, which is why it rarely happens."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast", "description": "Voter impersonation is a dumb way to steal an election, which is why it rarely happens."}, "last_updated_date": "2019-04-26T08:43:32.945Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1407254400.0, "source": "http://www.washingtonpost.com", "summary": ""}