{"url": "https://www.vibe.com/2018/11/tde-dave-free-interview", "text": "TDE's Dave Free On Maintaining Authenticity, SZA's Stardom, and Kendrick's Pulitzer\n\nThe Top Dawg Entertainment president shares how TDE maintains its authenticity, keeps all of its stars on the same page, and ascended from the underground to the top.\n\nIf there was ever any doubt that Top Dawg Entertainment was the best crew in music, the past two years should dead any arguments. Kendrick Lamar was already considered one of the best rappers in the world with classics like good kid m.A.A.d city and DAMN., but his star shined even brighter after the latter album earned him a Pulitzer Prize. K. Dot also spearheaded the music for Black Panther: The Album for 2018’s record-breaking and cultural tentpole Marvel Comics film. R&B singer-songwriter SZA dropped a potential classic album with her debut LP Ctrl in 2017, and Jay Rock released a strong album of the year candidate, Redemption. The TDE squad celebrated their success as a team with the Championship Tour, which brought all of the label’s stars–Kendrick, Ab-Soul, ScHoolboy Q, Jay Rock, SZA, and SiR–together under one roof for an international string of shows.\n\nThe artists are the stars of the show, but TDE’s executives deserve their just due. The triumvirate of founder/CEO Anthony “Top Dawg” Tiffith and co-presidents Dave Free and Terrence “Punch” Henderson have created an environment where creativity comes before the plaques and critical acclaim. And the squad keeps working: after Dave Free’s interview for this story, Kendrick Lamar landed a memorable role on Power and their new signee REASON dropped There You Have It, a stirring collection of West Coast gangsta rap musings. Dave Free spoke to VIBE about how TDE maintains its authenticity, keeps all of its stars on the same page, and ascended from the underground to the top of the food chain. This interview has been edited and condensed for clarity.\n\n--\n\nVIBE: At one time TDE was the bubbling underground crew, but what has it been like to really work your way up to being a powerhouse?\n\nDave Free: In the middle of the process, it looks the same, just the resources changed. We get more resources to do bigger and better things but it feels and smells and looks the same because it's rooted off the same concept of repetition. So for us, we haven't even gotten to the celebration point yet, because there's still so much more to do. When I talk to friends and I talk to buddies, and even just hearing you say everything you're saying right now, that's when I get kind of pulled back into the perspective that “damn, it's been a long time. We were just that. We were that underground crew that was trying to figure out how to get our feet in the game and now it's the total opposite.” It's really hard to say in a few words ‘cause it feels exactly like when we were in Carson just grinding in the studio. It feels exactly the same.\n\nHow long do you think it took for you guys to really find your groove?\n\nI would say about eight years 'til we figured out what not to do. The earlier stages when we were just really grinding through. It's not about what you do right, it's about what you're doing wrong. We were doing a lot of right, but the wrong stuff sets you back. You don't have to do everything perfectly, just don't do anything that [sets you] back.\n\nWhat would you say you were doing wrong that you had to correct?\n\nNot so much doing wrong, more like just the knowledge of not knowing things––not knowing who to talk to, not knowing the next steps in being in the game that's forever changing. This whole system of hip-hop is a forever changing system. You can't replicate the system, so as management we're working and trying to figure out how to get our artists out there more and how to get them more notoriety or how to maybe not go so broad with it at first. Start it off slow and build up a pace where we can sell consistency. Consistency is built into a career, just like Kobe practicing in a gym, Steph Curry working on his dribbling skills. [It’s the] same concept from a managing perspective, or a boss' perspective, and then the artist hops on to that same concept just through their artistry, depending on what type of music they want to make, depending on what type of beat, depending on what they wanna say, who they want to talk to. Both of those things are happening at the same time and then you meet up. It meets right in the middle, perfect timing where I'm perfectly ready and equipped to manage what this artist has right at the perfect time. It wasn't so much the wrong things, it was just the not-knowing part like, you know, growing in the business and having to learn how to go up in the business. Learn how to be nimble, don't have your mindset to one way of doing things. You have to have multiple ways of doing things.\n\nIt's a trip just how much the game can change in a certain amount of time. good kid, m.A.A.d city just came out in 2012 and it feels like that was a lifetime ago. What are the differences between breaking an artist like Kendrick back then and breaking an artist now?\n\nOh man, the approach is totally different. I was actually telling a buddy of mine because he just thinks we just have all the cheat codes, we just hit a button and they could just be famous the next day. None of the tactics we used back in the day to break Kendrick, Ab-Soul, Jay Rock or ScHoolboy would work now, none of 'em. It's a whole new game. Blogs were very influential back then and I'd have to build a lot of relationships with blogs and now it's just more about streaming. You have to have the relationships with the streaming sites and it can't just be a fake relationship. It has to be a relationship of understanding. Back in the day, if a blog posted a bunch of stuff, it was no hurt no foul. For streaming, they centralize. They have to post what works for their system too, it's kind of back to a radio format a little bit in a sense.\n\nAnd the single is back. The single wasn't as important when Kendrick was coming up, it was more about the quality of an album. Now, the single takes you back into to the album. When Kendrick was coming up it was more about... the album [would] take you into it and then hopefully you get a single in the middle of that. It's a totally different game, totally different system. It's forever changing. We’re just trying to be nimble and change with it, pay attention to what's happening. I'm even back in the situation where I'm making business—I don't even go to the club and party, but I'll go to the club, go sit in there and pay attention to what's happening. I never get jaded and never get stuck in my ways.\n\nOne thing TDE has a really strong reputation for is authenticity. Very few moves come out of your camp that don't feel real. How do you maintain that despite being at the level you’re at? Many artists will seem authentic early on, but the bigger that they get—\n\nIt gets more watered down after time.\n\nExactly.\n\nThe biggest thing for that is our family structure. Everybody in the company has a voice. When albums come out we bring everybody in. We don't create yes men in our camp, and that plays a large part in why the artists can stay true to themselves. You're competing with your brother, you're competing with the guy next to you, and if he's rooted and grounded because he has a good support system, then you're more likely to be just as rooted and just as grounded. Two, we tend to sign really hard working artists. I've worked with artists that are so talented but didn't work hard, and that can mess up the authenticity because now you have to counteract that with bringing in people to help the equation. Then the artist gets further and further away from themselves. But we've been able to sign artists that understand that this is a blessing beyond belief. When you appreciate something that God doesn't have to bless you with and you are around people that treat it the same way, it tends to rub off and it becomes a situation where you value it. So you spend a crazy amount of time perfecting it, and that works with the music and even with the plan of just how you live your life and how your music dictates your life.\n\nWhat you said about the family structure stands out. “Ab-Soul’s Outro” on Section.80 truly summarized the whole album, so it felt like Ab was a part of the process. And in the video where you guys played Jay-Z's verse on \"B***h Don't Kill My Vibe\" for Kendrick, that scene is preceded by the crew mobbing out to ScHoolboy Q’s \"Yay Yay.\" How do you maintain that family structure when everyone is doing so many things?\n\nIt's hard, I won't act like it's not hard and it's different remnants of that in today's time now, too. For example, Jay Rock’s “Win” video. Getting all the artists in one place at one time was literally the hardest thing ever. If you look at the video, you won't see ScHoolboy Q in there because he just got there a little too late. It is a hard thing but when you care about what your brother is doing and what your team is doing, you'll make the time. You just try to figure it out. When SZA is touring, she's traveling all over the world; you know, if we can't get her right at this moment, we'll figure out the best way. She was traveling, we needed her on Jay Rock's album, she went and got in a studio and knocked out the feature. It was already people waiting for features at the time, but that's something she ain't gon' miss out on. We just support each other, man.\n\nThe Championship Tour was a long time coming, it took so long to get us to that point where we could take all the artists out on one tour together. When all of 'em got on tour, it was like a high school reunion––they see each other but they hadn't seen each other together in one space, from the guys that are artists and the guys that are just in the background as management and staff. The energy was so great on that road. Everybody is working but we all care, we all want to see each other win and grow. If I can be there, I’ma be there. Kendrick literally flew off his tour from Japan to South Korea. He only had four days off and he spent 2 of those days shooting videos–one for Jay Rock and one for Anderson .Paak. Anderson .Paak is not signed to TDE, he’s signed to Aftermath, but it's the same concept. It's still family, it's still people that we support and we love, and we’re gonna do whatever we have to do to support them.\n\nHow did you guys react when you heard that Kendrick was getting a Pulitzer Prize?\n\nI got a call that morning and we have a group chat––me, Top, Kendrick, Sounwave, a few other homies. I got a call from my publicist and he was like, “Did you hear anything from the Pulitzer people? You’re winning a Pulitzer for DAMN.” I was like, “Man, stop playing.” I just thought it was a rumor going around. I dropped it in the group chat and I was like, “Word on the street is, your name is in the mix for the Pulitzer.” It was just shocking. You never think in a million years that they would understand the concepts enough to award a boy from Compton that honor. It still is a big moment. I wear the hat all the time, Kendrick changed his whole stage name to Pulitzer Kenny. It's showin' that we're breaking barriers. There were people that came before us that did this so we can get to this point, so we make them proud, and we showed another kid that's sitting in his f**kin' room wherever he is that these things are possible.\n\nIt’s less about the award and more about the concept of people that came before us and the people that's gonna come after us. That's what you do it for. It's about shaking up the system and showing people it doesn't have be the way it's supposed to, the way you think it's gon' be. Sometimes you might be shocked, you might see the guy that's not supposed to be the winner become the winner. That's very important for our youth to see that.\n\nYou guys already have a working relationship with Interscope Records, but for Black Panther: The Album, you also worked with Marvel. What was that process like?\n\nIt's different because you have to put yourself in a place where you have to understand their deliverables also. It was actually a great experience because it was an experience that we definitely wanna get more into. So for our first step to be Marvel, which is the cream of the crop in the film space, it was like that final quiz but it was a crash-course on the first day. They understood that Kendrick is a true artist and he had to stay true to his artistry and we understood that this is less about it being our thing and more about it being a [collaboration]. It worked out great, we were against time but everybody stepped up and it became something we're really proud of. We're very proud of the accomplishment and to just be right there, hand in hand with a movie, was so powerful. Ryan Coogler and all the cast, something that's so powerful for our kids to see and understand that we got our own superheroes we can look up to and be proud of. I don't wanna make it seem like it was easy, but it wasn't difficult either when you have people who want the same concepts.\n\nThis past year also saw SZA become a star––Ctrl may go on as a classic. Last year, she was calling out TDE execs on Twitter about the album not being out. What has it been like to see her rise to prominence, and how difficult is it to make sure that everyone on the roster feels valued at all times?\n\nTo answer your first question, every artist goes through that point where––when you make music you're creating a child, and it's hard for artists to put their child in someone else's hands. Business and artistry have to collide in order for greatness, and we just have a proven track record. Give me your child, and I’ma help raise him, nurture him, help him grow. And that concept developed into wanting to get her music out there. No, let's take our time and make sure it's perfect: let's get the videos done, get the concepts done, then look at her now. It's a testament to the artist pushing themselves to deliver a concept and management staying firm on how we do things as a brand and as a family.\n\nI would say the first part [in making artists feel valued] is to keep them working, keep everyone moving. An idle mind is the devil's playground so we don't let the mind be idle because even though you're not dropping music, you're still working, you're still recording. I shoot videos a year in advance, literally. Some of the videos you see from Jay Rock’s album is a year in advance. That keeps the artist in the place where even though music is not coming out right away, they're busy, they're active, they got something to do and they're in the fold of the family vibe. The fans don't know our schedule and we try to update them as much as possible but we know our schedule and the artists know the schedule. For the most part, the artist knows, “after so and so, it's my time,” and we give everybody their time. When it's their time, you know because it's gonna be an onslaught of rollouts, materials, contents. So the artists are in a system where they know how it works, it's really just people on the outside that don't understand the process.\n\nYou guys just announced the signing of REASON. What expectations do new artists have after signing to TDE?\n\nIf you sign to TDE or if you want to sign to TDE, I think the expectation is just for [the] quality of work. That's why most people would wanna be with this label because it's definitely quality over quantity and it's a system of helping your brother, showing up for your brother. You have to have both of those characteristics if you really looking over this way. Most people that are trying to be with us have those characteristics: want to be a part of a family, want to be a part of a concept, not just out there creating by themselves. I think the biggest thing for new artists is the competition level. You’re coming into a fold of Kendrick, ScHoolboy, SZA, Jay Rock. There's less expectation about what the brand can do for you ‘cause the brand is proven, we've proven that if we develop time into our artists we can turn our artists into something. You got to compete with Kendrick Lamar, he's not gonna go easy on you on the track. He gon' tap that a** on the track for sure so you better come with it. The same thing with SZA, she gon' get on the track, she gon' serve it up so you better be ready. Same thing with Jay Rock. Jay Rock holds the crown for the most destroyed tracks from TDE, getting on with artists and destroying everybody on the track. He's the highest competitor in the camp when it comes to each other. He's gonna pull the best out of you. So I think the artists are focused more on that. “Sh*t, how do I come in and make an impression on the guys that are killing it already?\"\n\nThat's what I noticed the most and that's probably the most pressured situation for them. SiR is like, \"Man how do I even show these guys I'm tight, how do I even get them to pay attention to me?\" The first time I brought SiR to the studio with Kendrick, Kendrick was like, \"Go in the booth,\" and it literally reminded me of the time that Top told Kendrick to go in the booth. The first time Dot came, Top was like “go in the booth and rap.” Dot was in the booth for two hours. Dot did the same thing and I felt the energy that I felt when Top said that with Kendrick. I bring SiR in to [see] Kendrick and I'm in the same position I was in back then. It's like, “h sh*t, I hope he kill it in front of Dot. I hope Dot sees what I see.\"\n\nWhat are you planning for this next year? What haven't you done yet?\n\n'We’re getting heavy into the film game. I'm trying to get heavier into it. Kendrick’s trying to get heavier into it. A lot of the guys want to get more into the content creation game. We got a lot of new artists, we got REASON, we got other new things coming. To us, it's about replicating the success but also stretching our hands into as many fields as humanly possible. So all those big investors and all those big guys that wanna be with a winning team, come talk to TDE ‘cause we’re looking into a bunch of different fields. There's no label on what we can do now. Top literally just left my house and we were talking about everything else that we have to do. It can be real estate to just investments, we have to do more. Music is the driving force to create the opportunity, but we have to do more and we're inviting anybody that wants to do more to come speak with us.\n\nREAD MORE: TDE's REASON Hopes To Marry Real Rap With Community", "images": ["https://www.vibe.com/assets/images/logo/white.svg?0cd0b31e24683c892ef3", "https://static.vibe.com/files/2020/04/WuTang9713_FINAL-1586553982-320x480.jpg", "https://static.vibe.com/files/2020/04/sid-tipton-look-both-ways-premiere-1-copy-1587154525-e1587154609881-240x135.jpg", "https://static.vibe.com/files/2020/04/the-clark-sisters-lifetime-cast-viewers-1587065706-e1587066161772-300x169.jpg", "https://static.vibe.com/files/2020/04/pop-smoke-documentary-in-the-works-1-1587155425-240x135.jpg", "https://static.vibe.com/files/2020/04/kelly-rowland-coffee-music-video-1587167209-e1587167261519-240x135.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2018/10/GettyImages-840036482-1539723273-1024x682.jpg", "https://static.vibe.com/files/2020/04/WildNOut_Nick_Cannon_Da_Baby_Too_Short_0192_1-1586895809-e1586899488790-650x366.jpg", "https://static.vibe.com/files/2020/04/music-shopping-1586809069-650x366.jpg", "https://static.vibe.com/files/2020/04/WuTang9713_FINAL-1586553982-compressed.jpg", "https://static.vibe.com/files/2018/10/GettyImages-840036482-1539723273-650x366.jpg"], "top_img": "https://static.vibe.com/files/2018/10/GettyImages-840036482-1539723273-1024x682.jpg", "keywords": [], "authors": ["William E. Ketchum Iii"], "canonical_link": "https://www.vibe.com/2018/11/tde-dave-free-interview", "title": "TDE's Dave Free Talks Teamwork, Kendrick Lamar's Pulitzer And Marvel", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-11-06T12:39:56-05:00", "published_time": "2018-11-06T12:15:49-05:00"}, "description": "The Top Dawg Entertainment president Dave Free sharees how TDE maintains its authenticity, keeps all of its stars on the same page, and ascended from the underground to the top.", "og": {"description": "The Top Dawg Entertainment president Dave Free sharees how TDE maintains its authenticity, keeps all of its stars on the same page, and ascended from the underground to the top.", "image": {"identifier": "https://static.vibe.com/files/2018/10/GettyImages-840036482-1539723273-1024x682.jpg", "height": 682, "width": 1024}, "title": "TDE's Dave Free Talks Teamwork, Kendrick Lamar's Pulitzer And Marvel", "type": "article", "url": "https://www.vibe.com/2018/11/tde-dave-free-interview", "site_name": "Vibe"}, "twitter": {"card": "summary", "description": "The Top Dawg Entertainment president Dave Free sharees how TDE maintains its authenticity, keeps all of its stars on the same page, and ascended from the underground to the top.", "image": "https://static.vibe.com/files/2018/10/GettyImages-840036482-1539723273-1024x682.jpg", "title": "TDE's Dave Free On Maintaining Authenticity, SZA's Stardom, and Kendrick's Pulitzer", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1541524549.0, "source": "https://www.vibe.com", "summary": ""}