{"url": "www.salon.com/2015/07/22/the_inevitable_taylor_swift_backlash_begins_watching_the_critical_mad_love_crumble_right_on_schedule/", "text": "It's almost meteorological. The funny thing about a backlash is the way it opens things up and builds momentum on its own. It's no coincidence that the metaphors we use for a backlash tend to be come from climactic phenomenon -- an opening of the floodgates, a turning of the tide, when it rains it pours. A backlash, though made by human beings, can feel like a part of the natural world and its inexorable forces. And that seems to be what's happening right now with Taylor Swift.\n\nAnd while there are good things to say about Swift -- her pushing back against streaming services that shaft musicians, for instance -- this tide-turning comes not a moment too soon. I don't say this because I hate Taylor Swift or because I think she's talentless. It's because of the weird consensus that's shaped up around her in the last year or two: That she's a brave young woman who's earned it all herself, that she's \"just like us,\" that she should be lionized for her success at the game of self-branding, that she's a musical genius, that this scion of a multi-generational banking fortune is -- as the New York Times said of her not long ago -- some kind of \"underdog.\"\n\nAdvertisement:\n\nDespite this weird worship of wealth and power that's grown up in post-Great Recession America -- which has helped Swift immensely -- not everyone loves Swift or her oddly lifeless, machine-made music. But these critical voices have been marginalized. She's like the prom queen who drives the brand-new Mercedes to school, whose parents buy everyone cookies: If you defy her you are some kind of envious grouch or killjoy. Our job is simply to obey.\n\nBut the superstar's Twitter incident with Nicki Minaj -- spurred by MTV's Video Music Awards snubbing Minaj's \"Anaconda\" video -- has opened up a broader discussion about Swift's privilege and preening and phoniness, and it's about time. The Guardian has called Swift's response to Minaj -- she blamed it on men -- \"faux-feminist\" and \"tone deaf.\" The typically sober Atlantic charges Swift with \"uses the pretext of female solidarity to try and shut down [Minaj's] frustration with the music industry.\" (Minaj was complaining about the way black musician often get overlooked.)\n\nAnd the press and media -- which has bowed to Swift's every move -- may be just getting started in this new direction. This is from a substantial new Gawker piece, \"Taylor Swift is Not Your Friend,\" which documents a lot of over-the-top blather praising her.\n\nAdvertisement:\n\nIt’s surprising to see smart people talk about Swift with such breathlessly positive overtures, not only because—like pop stars before her and pop stars after her—her music is simple and unfussy and infused with inane platitudes, but also because there appears to be something more opportunistic and sinister at play. When Taylor Swift does the mega-pop stardom act, she does it to the tilt. Swift has to be the person with the prettiest friends, the biggest records, the most popular and successful and groanworthily obvious boyfriend. The underdog narrative that the Swift machine has built is one of forced falsehoods; Swift is not coming from behind. She’s been ahead since she started. And watching her collect best friends during a moment in history when womanhood is finally beginning to feel valued does not only feel uncomfortable—it feels evil.\n\nIt's also hard not to find the ultraviolent \"Bad Blood\" video a bit, uh, bloodthirsty, especially given that much of her audience is young girls who may not be legally admitted to PG-13 movies. But Dayna Evans's Gawker piece says the video perfectly illustrates Swift's ruthlessness and feminist posing. \"Swift isn’t here to help women—she’s here to make bank,\" she writes. \"Seeing her on stage cavorting with World Cup winners and supermodels was not a win for feminism, but a win for Taylor Swift. Her plan—to be as famous and as rich as she can possibly be—is working, and by using other women as tools of her self-promotion, she is distilling feminism for her own benefit.\"\n\nSo how far will this go? One thing we've learned lately is that Swift has very smart, savvy people working for her. She's a master of PR, and she could spin this all her way and go back to ordering us mortals to do her laundry and clear her table. But at least for now, we're enjoying a more honest, wide-ranging conversation about a figure who's been coddled for far too long.", "images": ["https://q.quora.com/_/ad/c63001bb8054442db2dc1a48b7b1fd7e/pixel?tag=ViewContent&noscript=1", "http://www.salon.com/design/images/salon_logo.svg", "https://media.salon.com/2015/07/taylor_swift7.jpg"], "top_img": "https://media.salon.com/2015/07/taylor_swift7.jpg", "keywords": [], "authors": ["Scott Timberg"], "canonical_link": "https://www.salon.com/2015/07/22/the_inevitable_taylor_swift_backlash_begins_watching_the_critical_mad_love_crumble_right_on_schedule/", "title": "The inevitable Taylor Swift backlash begins: Watching the critical mad love crumble, right on schedule", "meta_data": {"description": "The media's bizarre love-fest is finally abating, and not a moment too soon", "apple-itunes-app": "app-id=549374205", "viewport": "width=device-width, initial-scale=1", "msapplication-TileColor": "#000000", "theme-color": "#ffffff", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "apple-mobile-web-app-title": "Salon.com", "fb": {"pages": 120680396518, "app_id": 456294607741273}, "p": {"domain_verify": "afd252c603232fed8ddf2554b144079b"}, "twitter": {"title": "The inevitable Taylor Swift backlash begins: Watching the critical mad love crumble, right on schedule", "description": "The media's bizarre love-fest is finally abating, and not a moment too soon", "image": "https://media.salon.com/2015/07/taylor_swift7.jpg", "site": "@Salon", "card": "summary_large_image", "creator": "@Salon"}, "og": {"title": "The inevitable Taylor Swift backlash begins: Watching the critical mad love crumble, right on schedule", "site_name": "Salon", "description": "The media's bizarre love-fest is finally abating, and not a moment too soon", "image": "https://media.salon.com/2015/07/taylor_swift7.jpg", "url": "https://www.salon.com/2015/07/22/the_inevitable_taylor_swift_backlash_begins_watching_the_critical_mad_love_crumble_right_on_schedule/", "locale": "en_US", "type": "article"}, "article": {"published_time": "2015-07-23 01:15:00", "modified_time": "2015-07-23 03:07:48", "publisher": 120680396518, "section": "Culture"}, "parsely-title": "The inevitable Taylor Swift backlash begins: Watching the critical mad love crumble, right on schedule", "parsely-link": "https://www.salon.com/2015/07/22/the_inevitable_taylor_swift_backlash_begins_watching_the_critical_mad_love_crumble_right_on_schedule/", "parsely-type": "post", "parsely-image-url": "https://media.salon.com/2015/07/taylor_swift7.jpg", "parsely-pub-date": "2015-07-23T01:15:00Z", "parsely-section": "Culture", "parsely-author": "Scott Timberg"}, "movies": [], "publish_date": 1437494400.0, "source": "http://www.salon.com", "summary": ""}