{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "It might seem strange to be talking about Black Friday 2020 already, but it's been an interesting year for the deals so we've put together this guide over what to expect when Black Friday rolls around again.\n\nThe volume Black Friday and Cyber Monday deals are only set to increase in 2020, with this year seeing a near-20% rise in traffic for people shopping those sweet savings on all manner of goods (according to Adobe Analytics).\n\nOf those purchases on Black Friday, it was toys that took the title for most-purchased (hello, Frozen 2 and L.O.L Surprise dolls ahead of the Christmas period) and then games - Fifa 20 and Madden 20 - behind, with Nintendo Switch the top console.\n\nWe tracked last year's Black Friday deals pretty closely ourselves, and we saw a number of hot sales from Walmart, Best Buy and Amazon all impress us - Target was also a big player in the technology space, aping the best iPad deal (that saw it fall to $250... and then again on Cyber Monday too).\n\nIt's odd that consoles were so highly-sold this year, as we had little in the way of a cracking Nintendo Switch Black Friday deal, and even the PS4 deals - while they existed, and weren't too bad - were more scarce than we expected.\n\nOther winners were Apple products, with $400 cashback on an iPhone 11, lower prices on AirPods and Apple Watches and MacBook / iPads being cheaper than ever before - and people bought them in their droves.\n\nWe saw Dyson being popular for Black Friday last time around, DNA kits a surprise package and we even saw great discounts on power tools as well.\n\nSo what does this tell us for Black Friday 2020? Well, with the console wars hotting up (hello, PS5 and Xbox Series X) the current consoles will surely drop in price to make way for their 2020 counterparts.\n\nApple's AirPods Pro will be longer in the tooth by then, so we're expecting big discounts there (even more than the $15 drop this year) and the AirPods Classic might even creep closer to $100, which would be a great saving and see Apple clean up on the stocking front.\n\nHowever, there's nothing this year that suggests the likes of Instant Pot, TVs, laptops (which were huge this year too) along with Amazon's best own-brand products won't be the things to wait to buy on Black Friday 2020 - so expect more of the same and time your top purchases accordingly.\n\nThe top Black Friday deals we saw last year\n\nHP Laptop 15t: $979.99 $519.99 from HP\n\nThis HP laptop was a phenomenal price and came with a 15-inch display paired with a powerful 10th gen Intel Core i7 processor to power the whole thing. It also had 256GB of SSD storage onboard with Windows 10 built-in.View Deal\n\nPowerbeats Pro wireless earphones | $249.95 $199.95 at Amazon\n\nPowerbeats Pro were available for $50 off at Amazon, offering up to nine hours of the high quality audio you'd expect from Beats. Perfect for fitness fanatics, the Powerbeats Pro offer an adjustable ear hook design that keeps your buds firmly in place. You're also getting the Apple H1 chip, so using your earbuds with your Apple devices is smooth and simple.\n\nView Deal\n\nApple 10.2-inch iPad, 32GB: $329.99 $229.99 at Target\n\nThis was the absolute lowest price we'd ever seen on a 2019 iPad, with the 32GB model coming in just under $230 this Black Friday weekend (although it was actually after the Friday itself). You could pick it up in Gold or Space Grey and enjoy all the latest features for less.\n\nView Deal\n\niPhone 11 for $699 at Verizon | Get up to $400 off the iPhone 11 with select trade-in and Unlimited\n\nA big hitter, you could get up to $400 off the iPhone 11 if you traded in a select phone, and if you switched to an Unlimited plan with your handset you could also get a $400 prepaid Mastercard too. View Deal\n\nHulu for $1.99/month: $5.99 now just $1.99/month at Hulu\n\nYou could pay $6 a month for Hulu's memorable TV shows and movies, or you could have paid just $2 a month for the best deal in streaming. We did, and now we won't be saying \"Oh, I wish I had a Hulu subscription\" at any point in 2020. View Deal\n\nXbox One X | Star Wars Jedi: Fallen Order: $499 $349 at Best Buy\n\nThe Xbox One X is still one of the most powerful consoles on the market right now, and this early Black Friday deal made it finally affordable. You'll can now play all your favorite games in 4K, and this one even comes with Star Wars Jedi: Fallen Order. View Deal\n\n(NEW LOW PRICE) HP 14 Laptop: $599 $369 at Walmart\n\nA big seller, you could save $200 on the HP 14 laptop at Walmart. The powerful 14-inch laptop packs an Intel 10th Gen Core i5-1035G1 processor, 8GB of RAM, and 256GB of storage.\n\nView Deal\n\nMacBook Air 2019: $1099 $899 at B&H\n\nOften MacBook deals are hard to find, but $200 on a new MacBook Air was pretty nifty. This was for the 2019 model, and features a 13.3-inch display as well as 128GB of internal storage. It runs on a Intel Core i5 with 8GB of RAM and is still worth checking out now.\n\nView Deal\n\nFujifilm Instax Mini 9: $69 $49.95 at Amazon\n\nYou could have grabbed a huge 50% off on the Ice Blue and Flamingo Pink versions of the Instax Mini 9, thanks to this combination of a 28% discount and a $14.96 coupon. This was the bundle without a mini film pack, but represented incredible value for instant photography beginners.View Deal\n\nInstant Pot DUO60 6 Qt Pressure Cooker: $99.95 $49 at Walmart\n\nWalmart Black Friday shoppers could save 50% on the best-selling Instant Pot DUO60. That's the lowest price we'd seen for the pressure cooker, and made it a perfect gift for anyone on your list as Instant Pot's reign as top pressure cooker continued unabashed..\n\nView Deal\n\nSony WH-1000XM3 Noise Canceling Headphones: $349.99 $279.99 at Best Buy\n\nThese headphones from Sony are the best in the world (according to us), with excellent comfort, high-quality sound, and superb noise cancelling that made them an easy buy at this price.\n\nView Deal\n\nDyson V7 Motorhead Cord-Free Vacuum: $279 $179 at Walmart\n\nThe powerful Dyson V7 gained a $100 price cut at Walmart. The cord-free vacuum features a V7 motorhead to deep clean carpets and hard floors and includes a convenient hand-held vac, making it our top vacuum cleaner sale of 2019.\n\nView Deal\n\nTop 4K TV deal – TCL 6-Series 55-inch: $649 $599 at Amazon\n\nThis is the TCL 6-Series 55-inch 4KTV and it's one of our favorite TVs on a normal day. And when it came to Black Friday, it was even sweeter thanks to an extra $50 price cut through Amazon.\n\n(LIMITED STOCK) Apple AirPods Pro: $249.99 $234.99 at Amazon\n\nYou asked for it and we delivered: a real-life deal on AirPods Pro with delivery just before Thanksgiving. Yes, that's how limited this Black Friday AirPods deal was – it sold out twice on us until it finally died. Expect this to be bettered in 2020.View Deal\n\nJLab Audio - JBuds: $49 $29 at Best Buy\n\nTrue wireless earbuds can get expensive quickly - just take a look at the AirPods. However, this pair of JBuds from JLab Audio brought that freedom from wires into a package that was a fraction of the cost for just $29.View Deal\n\nMyHeritage DNA Test Kit: $75 $49 at Amazon\n\nAmazon had the top-rated MyHeritage DNA test kit on sale for $49. You can discover your ancestry and a detailed ethnicity breakdown from 42 regions.\n\nView Deal\n\nWhen is Black Friday 2020? And what is it?\n\nBlack Friday is the Friday immediately after Thanksgiving when retailers begin the holiday shopping season. It’s based around the aforementioned “doorbusters”, discounts so impressive that bargain-crazed customers will try to break the doors down before the shop opens - although that’s more of a virtual craze these days.\n\nThe actual date shifts every year, by the day of the week stays the same: it's always the Friday after Thanksgiving, and like last year it's later in the month of November.\n\nThe official Black Friday date is November 27, 2020, meaning it's close to Christmas again (less than a month before Christmas Day), and that gives you less time to shop online.\n\nThat may not seem like a big deal today, but you'll have to factor in waiting on the best deals, pouncing on the lowest price, and factoring shipping wait times.\n\nAs we've highlighted, Black Friday weekend isn't just a four-day affair, and deals don't necessarily follow the normal pattern of prime products to be unleashed - you can see new TV deals in the small hours of the morning or a brilliant wearable price slash just after the Thanksgiving turkey is prepped, so shoppers need to be more flexible than ever.\n\nThe origin of Black Friday: a history lesson\n\nImage credit: Shutterstock (Image credit: Shutterstock)\n\nLet’s take a Black Friday history lesson: the first known mention of Black Friday related to this shopping experience was in November 1951, when the journal Factory Management and Maintenance used it to describe people calling in sick the day after Thanksgiving so they could have an extra day off work.\n\nAt the same time US police were using the phrases “Black Friday” and “Black Saturday” to describe the horrendous traffic that occurred at the beginning of the pre-Christmas shopping season. In 1961 there was a movement from the local government to change the shopping season to “Big Friday” and “Big Saturday”, but it clearly never caught on.\n\nBlack Friday ads: when will we see them?\n\nBest Buy, Walmart, Amazon and Target have a habit of stretching the saving across multiple days preceding the classic four-day window, posting Black Friday ad leaks in October and early November.\n\nTrust us when we say we'll be monitoring the Black Friday ads hard this year, and giving you all the information as they drop.\n\nThe first signs of price drops come from these ad leaks, usually through major US newspaper print outs. Black Friday ad scans make their way online, giving you a heads-up on what to buy, how much to spend and where to shop.\n\nThis means Black Friday is more than just a one-day sales frenzy, or even an extended weekend tradition. It's a whole month of savings, if you know where to shop and when to hit that checkout button. If you’re savvy, it's the best time of the year to shop, and you can save a lot of money.\n\nImage credit: TechRadar\n\nWill Black Friday 2020 be different in any way?\n\nBlack Friday 2020 should continue last year's trend of not just offering discounts, but offering discounts on items you'll actually want to buy. There was some fierce competition between Amazon, Walmart, B&H Photo and Best Buy last year, and that's a good sign given payday will fall after Black Friday in 2020.\n\nSpecifically, we're expecting to see big-ticket items like 4KTVs with HDR support – a once expensive proposition, and Apple to offer cheap iPads, which was a big hit last year again. Essentially, that's more of the same. Beauty products and non-electricals should continue to increase in popularity as more brands and retailers look to take advantage of the Black Friday interest, particularly online.\n\nThe AirPods Pro, as mentioned, may see the older models on sale for a better price, while laptops, iPhones and Android smartphones should be at their lowest levels in 2020 once more.\n\nIt's not a surprise that Apple launches new iPhones in September to discount them (just a little bit) by Black Friday and Cyber Monday. This mostly happens through US carriers and BYGO Free deals, with some lovely cashback options last year as well to really sweeten the pot.\n\nHow does TechRadar prepare for Black Friday? Black Friday is one of the most important times of the year for TechRadar - we spend weeks ahead of the big day (or weekend) making sure the whole site is ready for people looking for the information they need to help them make the right buying choice. Whether that's knowing which is the best laptop, TV or iPad, or just seeing great deals for them through our Hawk price comparison widget, we've got everything you need to know.\n\nAre Black Friday deals real?\n\nGenerally speaking, yes - although there are two kinds of deals. The first has been pre-agreed between brands and retailers, so they’re not as off-the-cuff as you might expect.\n\nThe other is sudden price drops, whether that’s an algorithm working out the best way to attract users to buy (as brands like Amazon often will) or just the big names price-matching one another, or pushing the price down further as they look to be the big winner. (We saw something similar with iPads in the US).\n\nAs with any sales event you’ll see a mixture of bargains, discounted end-of-line stock and strange things found in the back of a warehouse somewhere. In 2016, consumer magazine 'Which?' accused retailers of some pretty dodgy behavior.\n\nYou might notice that some items are cheaper after Black Friday - even as soon as Cyber Monday. But those are part of the natural Christmas discounting period, and our advice is to always grab a deal if you like it, and be prepared to return if it drops lower.\n\nWhere can I find the best Black Friday deals?\n\nAs mentioned, you’ll find the best options if you bookmark this page right now - there will be deals from the beginning of November 2020, and we’ll be bringing you the best of them, those that we think are worth checking out, the second that we see them flash up.\n\nHow do I get the best Black Friday deals in 2020?\n\nHomework really helps. Some retailers up prices from August through to October so they can offer supposedly amazing discounts on Black Friday, so don’t be fooled by such moves.\n\nThey’re particularly prevalent in expensive consumer electronics such as TVs or laptops with product numbers rather than names, with products that were dropped down to a great bargain price suddenly being pushed back to their MSRP again.\n\nIt’s also a very good idea to be flexible: for example, if you fancy a Samsung UHD TV it’s best to think about the features you want rather than a specific model number: the BRV553ABD34-82C-9218-X may not be discounted on Black Friday 2020, but an almost identical set with the specification you want probably will be.\n\nSo do your research on what matters and we’ll do our best to give you the right comparison needed.\n\nHowever, don’t be fooled into thinking that something that looks like a five star set is the same but cheaper - certain elements (often with regards to screen quality or image processing) won’t be as high quality to achieve that lower price point.\n\nCan I get cashback on Black Friday deals?\n\nSometimes, yes. Your debit card or credit card may offer cashback on purchases. It’s definitely worth looking into, not just for Black Friday 2020 but for any online shopping, when you’ll be spending the most online.\n\nAm I protected when I buy on Black Friday?\n\nIn general, you should be just as protected as you are when shopping any other time of the year. You’ll want to check on return policies and warranty periods, and you should also make sure you’re shopping at known retailers you trust.\n\nWhile many deals can seem too good to be true on Black Friday, landing on an unfamiliar website claiming to have a product for pennies on the dollar is a good sign you’re in the wrong place.\n\nRemember that using your credit card also can offer a level of protection, so as long as you have the means to pay it back straight away, using this method can give you more peace of mind.\n\nMany credit cards can help you contest payments if you never receive a product, and some even offer extended warranties on products beyond the one included from manufacturer or retailer.", "images": ["https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-320-80.jpg", "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg"], "top_img": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "keywords": [], "authors": ["Gareth Beavis", "Matt Swider"], "canonical_link": "https://www.techradar.com/news/black-friday-deals-2019", "title": "Black Friday 2020: the top deals we're expecting", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2019-12-23T16:48:39+00:00", "description": "The Black Friday sales are over for another year - but what have we learned to help us save money in 2020?", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/174424/apple-touch-icon.png", "og": {"title": "Black Friday 2020: the top deals we're expecting", "site_name": "TechRadar", "url": "https://www.techradar.com/news/black-friday-deals-2019", "description": "What can we learn from the previous deals?", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "width": 1200}, "type": "article"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "author": "https://www.facebook.com/TechRadar"}, "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "Black Friday 2020: the top deals we're expecting", "description": "What can we learn from the previous deals?", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "OMG-Verify-V1": "1036697-2d2c9025-5430-4e79-8349-e8c1c926dd73", "taboola": {"url": "https://www.techradar.com/news/black-friday-deals-2019"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#2f6e91", "lomadee-verification": 22816996, "parsely-type": "post", "parsely-post-id": "wT8vJMUSL8GrB8EYX5yuPg", "parsely-pub-date": "2019-12-23T16:48:39Z", "parsely-title": "Black Friday 2020: the top deals we're expecting", "parsely-link": "https://www.techradar.com/news/black-friday-deals-2019", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe.jpg", "parsely-section": "Black Friday", "parsely-tags": "Category: Black Friday,Category: Other,Category: News,deals,techdeals,Black Friday,Black Friday sales,black friday deals,holiday,black friday 2020,deals,techdeals,Black Friday,Black Friday sales,black friday deals,holiday,black friday 2020,Internet,type_deal,_van_ads_none,van-disable-inbody-ads,tr-holidays-19,deals,channel_other,blackfridayhub,_van_disable_sidebar,van-block-taboola,exclude-from-homepage,type_deal,_van_ads_none,van-disable-inbody-ads,tr-holidays-19,deals,channel_other,blackfridayhub,_van_disable_sidebar,van-block-taboola,exclude-from-homepage", "parsely-author": "Matt Swider"}, "movies": [], "publish_date": 1577119719.0, "source": "https://www.techradar.com", "summary": ""}