{"url": "https://www.bustle.com/p/mamma-mia-is-coming-to-netflix-in-may-its-the-perfect-way-to-prep-for-the-sequel-8855771", "text": "If you love singing your heart out to Mamma Mia! and have been hoping to watch it before the sequel Mamma Mia! Here We Go Again comes this summer, Netflix has listened to your wishes. That’s right, Mamma Mia! is finally coming to Netflix in May, with the star-studded musical arriving to the site on May 2. The full list of movies coming to Netflix in May will be released on April 24, but this one should get you pretty excited for what’s to come.\n\nIn case you never saw the blockbuster 2008 film in theaters or saw the musical on Broadway, Mamma Mia! tells the story of Sophie (Amanda Seyfried), a 20-year-old who is about to get married. Raised by a single mother (Meryl Streep), Sophie wants to know who her father is, so she invites three of her mom’s former lovers to her wedding to find out which of them is her father.\n\nThe most special thing about Mamma Mia! — besides bringing together a fantastic cast — is the music. Chances are even if you’re not totally familiar with ABBA’s discography, you know plenty of their songs. By using tracks everyone already knows instead of original ones, the movie (based on the hit Broadway musical) makes everyone want to sing and dance along. Watching the film, you can tell the actors are having a blast, too.\n\nMamma Mia! did the unthinkable with its incredible cast: it had all of them singing, even those who had absolutely no musical experience. Streep surprised everyone at first being cast in a musical, but the actor has been singing throughout her whole film career, even going on to play a rock star in Ricki and the Flash after Mamma Mia.!(It goes to show how there’s seriously nothing she can’t do.) However, some of Streep's Mamma Mia! castmates weren’t so musically fortunate. Colin Firth, Pierce Brosnan, and Stellan Skarsgård had to learn to sing for it, which was no easy feat.\n\nEVLEIGH on YouTube\n\nThe men tried their best, but their singing got some flak from critics, who wished their songs were sung by professional singers. The cast proved that the criticism didn’t matter, though; what mattered is the joy that the movie brought to them. Despite not having the best voice, Firth said in the behind the scenes featurette above that he had “never done anything so easy in his life” because of how fun it was. Brosnan echoed this sentiment in an interview with POPSUGAR, saying, “It was great fun. I had the time of my life from day one all the way to end. Apart from the terror of singing, but once you’d got that under your belt, and you came to the theatricality of it and you made peace with your voice, it was just wonderful to be in a company, you know a young company and to see Meryl there and to see this wonderful cast.”\n\nIn fact, the actors enjoyed the experience so much they all decided to come together again for the sequel. In a recent interview with Uproxx, Brosnan denounced the haters, saying he’s ready to belt out some ABBA tunes. “Am I excited? Yes, I’m excited. I don’t know if the people will be excited, but one way or the other I shall sing again, whether they like it or not. I don’t care what they say! I love my voice! I think that it will grow on people. They will always just want to hear a little singing from me.”\n\nIt’s pretty hard to feel confident on set when you have queen Cher joining the cast, but Brosnan clearly has that covered. If you want to have as much fun as the cast of Mamma Mia!, make sure to watch it once it hits Netflix and get ready for the sequel out July 20.", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/4/20/4dbe5019-e136-4cf1-9633-8e1d43d3e491-netflix2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/2/8bfab305-3142-4fd7-85c1-218ec07f1669-getty-1200453949.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/11/1bf9973e-0e3e-46ad-95b4-561b8ad80bd5-b675aa3e-0ec5-4754-8ac1-ccfed2769774-disney_robin_hood.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/4/20/4dbe5019-e136-4cf1-9633-8e1d43d3e491-netflix2.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/a5d8233a-8dd7-44d5-b848-5011e974c11f-bb_101_unit_01979_r.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/3/30/d24a5296-24a7-4ba7-8306-6399e607e698-9a7f7172-4555-4332-8eb5-b4ab3e9604dc.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/4/20/4dbe5019-e136-4cf1-9633-8e1d43d3e491-netflix2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/mamma-mia-is-coming-to-netflix-in-may-its-the-perfect-way-to-prep-for-the-sequel-8855771", "title": "'Mamma Mia' Is Coming To Netflix In May & It's The Perfect Way To Prep For The Sequel", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/mamma-mia-is-coming-to-netflix-in-may-its-the-perfect-way-to-prep-for-the-sequel-8855771", "type": "article", "title": "Your Fave Movie Musical Is Coming To Netflix In May So Get Ready To Sing Along", "description": "If you love singing your heart out to Mamma Mia! and have been hoping to watch it before the sequel Mamma Mia! Here We Go Again comes this summer, Netflix has listened to your wishes. That’s right, Mamma Mia! is finally coming to Netflix in May,…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/4/20/4dbe5019-e136-4cf1-9633-8e1d43d3e491-netflix2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "If you love singing your heart out to Mamma Mia! and have been hoping to watch it before the sequel Mamma Mia! Here We Go Again comes this summer, Netflix has listened to your wishes. That’s right, Mamma Mia! is finally coming to Netflix in May,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}