{"url": "marriedbiography.com/caitlyn-jenner-confrontation-kardashians-pay-per-view-tv-special-lonely-mothers-day-new-date-know/", "text": "Caitlyn Jenner: her confrontation with the Kardashians about pay per view TV special, her lonely Mother’s day, and her new date: Know all that here! Share this\n\nThe alleged confrontation with Kardashians about ‘pay per view TV special’\n\n‘Life and Style’ has recently written about the feud between Kardashian matriarch Kris Jenner and her ex Caitlyn Jenner (earlier Bruce Jenner) about the details Caitlyn Jenner had put down on his gender transition in his new autobiography titled ‘The Secrets of My Life’. Kris Jenner feels that she has been projected in a bad light in the book and has been labeled as ‘being less understanding’. The tabloid alleged that Caitlyn Jenner is angry with the Kardashians for not keeping their mouth shut about his transition. Caitlyn Jenner feels that they are spreading lies about her and wants them all to undergo polygraph (lie detector test) to prove their falsehood. The tabloid further adds that Kris Jenner said that she is ready to undergo the test provided the price is right.\n\nHowever, Gossip Cop has found out that all these stories revolving around the Kardashians and their extended family are untrue. Jenner’s own rep has labeled the tabloid’s story as being totally inaccurate. Also, Gossip Cop inquired with a number of people in the pay per view business and none of them had heard about Caitlyn trying to set up any live TV special with her ex-wife and estranged daughters and stepdaughters.\n\nThe lonely Mother’s Day\n\nIt was seen that her ex-wife Kris Jenner celebrated Mother’s day with her 6 children: Kourtney Kardashian (38), Kim Kardashian (36), Khloe Kardashian (32), Rob Kardashian (29), Kendall Jenner (21) and Kylie Jenner (19). Kris Jenner has fallen apart from her husband Caitlyn Jenner (then Bruce Jenner) after he launched his autobiography ‘The Secrets of my Life’. In this autobiography, Caitlyn Jenner has mentioned that she had never been comfortable having sex with Kris Jenner. Caitlyn goes on to say that she would have continued with the marriage if Kris Jenner was a bit more understanding. Kris Jenner felt that she has been portrayed in a bad shape and has since excluded her ex from her life. She did not include her ex-husband, Caitlyn Jenner in any of her three Instagram posts she uploaded for Mother’s day. These posts were dedicated to her ex-husband, Robert Kardashian, her six children and her mother. There was no mention of Caitlyn Jenner anywhere. Besides, her kids Kendall and Kylie Jenner with Caitlyn Jenner also did not acknowledge their father (now mother Caitlyn Jenner) in any of their Mother’s day posts.\n\nCaitlyn Jenner was spotted alone on the Mother’s day morning in a pink top, blue tight jeans, black sandals, and a black handbag. She had stopped at the Starbucks outlet at Malibu to pick up a coffee for herself. She was also sighted at a local fuel station pumping gas into her white SUV. She wore no smile on her face and stood there with folded arms. Later on Monday night, Caitlyn Jenner was seen at dinner time at a restaurant in West Hollywood adorning a black dress and matching heels. She preferred to use the back door to exit and drove her own vehicle after leaving the restaurant.\n\nHowever, unbothered by all the neglect, Caitlyn Jenner took to the Instagram media to pay tribute to her mother who is also celebrating her 91st Birthday. She wrote:\n\n“Big day for my mom today. Mother’s Day and her 91st birthday!”\n\nThe new mystery date\n\nTwo days after Mother’s day, Caitlyn Jenner was seen coming out for coffee with a hot mystery blonde. Caitlyn was dressed in black T-shirt and sweater paired with skinny blue jeans and ankle boots. They were walking down a set of steps together and Caitlyn looked quite comfortable in the company of her new female companion. The blonde was in a white sweater and black jeans with holes cut out at the knees. Her feet were covered in high-heeled strappy sandals. Her long blonde hairs were let down and straight. Caitlyn was sans her makeup and was in her Ray-Ban sunglasses to save her eyes from the Malibu sun glare. Will this relationship turn serious? We will have to wait and watch.\n\nOn the ‘I am Cait’ show, Caitlyn was seen with newly found friends in American actress Candis Cayne, transgender Chandi Moore, American transgender multimedia artist Zackary Drucker, author and gender theorist Kate Bornstein, American author and political activist Jenny Boylan and high-school male-to-female transitioned Ella Giselle. On this show, Caitlyn had also talked about dating and relationships. Caitlyn had said:\n\n“To be honest with you, I can’t see myself dating women in the future. I’ve been there done that. I’ve got three very strong ex-wives. I just don’t see it.”\n\nShe, however, is open to a new romance with a man. She said:\n\n“If I was in a relationship with a guy, I would enjoy being treated like that—opening doors for you, doing all what you think is the traditional stuff in a guy and a girl relationship. They have to be a very special guy to be able to do that.”\n\nShe has been spotted with more of women than men after her transition. She was seen with Kris Jenner’s former best friend, Ronda Kaminhira in March 2017. Before that, she was seen at the Oscar night with transgender model Andreja Pejic. One will have to wait and see which sexual orientation Caitlyn Jenner ultimately takes. There have been reports which allege that dismayed by the cold and negative reactions of her family, friends, and fans to her new look, Caitlyn Jenner has felt often to de-transition back to a male. Only time will tell!\n\nShort Bio on Caitlyn Jenner\n\nCaitlyn Jenner is the former Olympic gold medal-winning decathlon champion. Caitlyn Jenner is well known in the world as the Bruce Jenner came out as a transgender woman since April 2015. More Bio…", "images": ["https://marriedbiography.com/wp-content/uploads/2020/04/Karen-Allen-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2019/11/share_new.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20600%20802'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2020/04/Michael-1-232x290.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2060%2075'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2017/05/caitlyn-with-new-date.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Jacqueline-4-400x280.jpg", "https://marriedbiography.com/wp-content/uploads/2020/03/Jenna2-400x280.jpg", "https://marriedbiography.com/wp-content/uploads/2017/05/caitlyn-feud-1.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Danny-Brown-Feature-Img-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Lynne-Curtin-60x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Joshua-Waring-232x290.jpg", "https://marriedbiography.com/wp-content/uploads/2020/03/Taraji1-400x280.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2075%2075'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20600%20785'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2017/05/caitlyn-alone.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20232%20290'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2020/03/Cassandra-4-400x280.jpg", "https://marriedbiography.com/wp-content/uploads/2017/05/cait.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20400%20280'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2020/04/Tom4-232x290.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Josh-Waring-60x75.jpg", "https://marriedbiography.com/wp-content/plugins/married-biography//public/images/ajax-loader.gif", "https://marriedbiography.com/wp-content/uploads/2020/04/Marquise-Jackson-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Jordan-Ozuna-232x290.jpeg", "https://marriedbiography.com/wp-content/uploads/2020/02/Peggy4-400x280.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Tarvaris-Jackson-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Kate1-232x290.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Lesley-Ann-Warren-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Thomas-1-400x280.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Karl4-232x290.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20600%20600'%3E%3C/svg%3E", "https://marriedbiography.com/wp-content/uploads/2020/04/RZA-75x75.jpg", "https://marriedbiography.com/wp-content/uploads/2020/04/Alex-Morgan-60x75.jpg"], "top_img": "https://marriedbiography.com/wp-content/uploads/2017/05/cait.jpg", "keywords": [], "authors": [], "canonical_link": "https://marriedbiography.com/caitlyn-jenner-confrontation-kardashians-pay-per-view-tv-special-lonely-mothers-day-new-date-know/", "title": "Caitlyn Jenner: her confrontation with the Kardashians about pay per view TV special, her lonely Mother’s day, and her new date: Know all that here! – Married Biography", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "jDQ74aKP02o-cHu2R3e21jpdCzibOL_nIrNlSpIYGH8", "msvalidate.01": "A5C7964AE839232FFCE973E54D2B935A", "yandex-verification": "2d37d7ff4bf9c48f", "description": "The alleged confrontation with Kardashians about ‘pay per view TV special’ Life and Style has recently wrote about the feud between Kardashian matriarch Kri", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "description": "The alleged confrontation with Kardashians about ‘pay per view TV special’ Life and Style has recently wrote about the feud between Kardashian matriarch Kri", "url": "https://marriedbiography.com/caitlyn-jenner-confrontation-kardashians-pay-per-view-tv-special-lonely-mothers-day-new-date-know/", "site_name": "Married Biography", "updated_time": "2018-06-07T07:39:30+00:00", "image": {"identifier": "https://marriedbiography.com/wp-content/uploads/2017/05/cait.jpg", "secure_url": "https://marriedbiography.com/wp-content/uploads/2017/05/cait.jpg", "width": 400, "height": 500}}, "article": {"tag": "transgender", "section": "Dating", "published_time": "2017-05-17T10:32:43+00:00", "modified_time": "2018-06-07T07:39:30+00:00"}, "twitter": {"card": "summary", "description": "The alleged confrontation with Kardashians about ‘pay per view TV special’ Life and Style has recently wrote about the feud between Kardashian matriarch Kri", "image": "https://marriedbiography.com/wp-content/uploads/2017/05/cait.jpg"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://marriedbiography.com/wp-content/uploads/2019/11/favicon.png"}, "movies": [], "publish_date": 1495017163.0, "source": "http://marriedbiography.com", "summary": ""}