{"url": "www.dailymail.co.uk/news/article-4885794/Angelina-Jolie-attended-Cambodian-wedding-baby-Maddox.html", "text": "Advertisement\n\nSaas Mean couldn't believe his luck. Before meeting Angelina Jolie, he was living in a makeshift chicken shed with other landmine victims and their families.\n\nBlinded, maimed and suffering horrific internal injuries, he'd been virtually left to die after stepping on a landmine in 1984.\n\nThere was no care for people like Saas, who had been made a refugee during Cambodia's war ravaged years, at least until Jolie heard about the plight of landmine victims in 2000.\n\nThe Oscar-winner helped transform their lives by building them a row of houses, attending a wedding that she threw for a couple with her son Maddox in 2003, and even acting as a midwife for a woman, who later named the baby Jolie in the actress' honor.\n\nCambodia has always been close to the 42-year-old's heart and her directorial debut First They Killed My Father, which centers on the country during its brutal communist period, will be released on Netflix on Sunday.\n\nScroll down for video\n\nA Cambodian landmine victim reveals how Angelina Jolie transformed his life when she visited his village of Samlaut in 2000 and built him a home and threw him a wedding in 2003. The Oscar-winner was a guest of honor and even brought her son Maddox to the ceremony (pictured)\n\nSaas was forced to marry his wife Dol Sea (pictured together center in gold) at gunpoint by Khmer Rouge soldiers. Upon finding out about Saas' situation, Jolie was adamant that he should have the wedding again, but on her dime\n\nThe actress built nine wooden houses in a row for those whose lives had been destroyed by standing on landmines in war and couldn't look after their families. Keo Bun, Saas Mean (center) and Bai La are some of those whose lives were changed by Jolie\n\nSaas said: 'She gave us nine houses, cows. Many have promised to help our people, but she really did. I'm so grateful, my life would have been so hard, I'd probably be dead, but now I'm born again.' Pictured: Some of the homes Jolie built\n\nCambodia has always been close to the 42-year-old's heart and her directorial debut First They Killed My Father, which centers on the country during its communist period, will be released on Netflix on Sunday. Pictured: Jolie with her adopted son Maddox, who is from Cambodia, at her film premiere in Toronto on Monday\n\nThe highly anticipated film centers on screen author Loung Ung's autobiography about growing up in the country during the Khmer Rouge years.\n\nDuring her time in Cambodia, Jolie worked on the ground speaking to the people, especially those living in the remote region of Samlaut, north west Cambodia, such as Saas and the other landmine victims.\n\nIt's where her major conservation project is situated, Maddox Jolie Pitt Foundation, which owns over 100,000 acres of endangered forest.\n\nHer great hope was to lift the surrounding villages out of poverty, which were some of the poorest in the country and had been destroyed by the genocidal regime of the Khmer Rouge.\n\nThe government was at war with Vietnam in the 1970s and '80s and nearly two million people were killed by the communist party led by Pol Pot.\n\nSamlaut was one of the last remaining outposts of the regime and was governed by the Khmer Rouge until 1998, with many of its former generals still living in the area.\n\nJolie's Cambodian film tells the true-to-life story of a five-year-old girl named Loung Ung as she recounts the terror she suffered under the Khmer Rouge. The director gave her first interview since separating from husband Brad Pitt last September to Vanity Fair for its September issue\n\nJolie paid for everything at the wedding and the whole village attended in 2003, as Jolie was the guest of honor and brought along Maddox, who was only a few months old at the time of the ceremony\n\nJolie's hope is to lift the area's villages out of poverty, which are some of the poorest in the country and had been destroyed by the genocidal regime of the Khmer Rouge\n\nThe region's tribal elders said Jolie helped thousands of villagers get jobs and work on the fields.\n\nThe Hollywood star even acted as a glorified midwife, helping one poor, young mother with her baby.\n\nIn return, the grateful Leany Sopheap named her daughter Jolie.\n\nBut perhaps the most compelling story belongs to landmine victim Saas, now 60.\n\nLiving in the Khmer Rouge stronghold of Samlaut, Saas was forced to sign up for its army to fight against the Vietnamese in the Cardamom Mountains, Koh Kong province, under brutal conditions.\n\nIn 1984, he stood on a landmine, losing his arms, sight - with his eyes are now glued together.\n\nThe shrapnel left him hobbling on a walking stick that is attached to his arm limb.\n\nThe disability made the next 16 years almost unbearable for his family - wife Dol, 50 and children Sean, 25, Serm, 23, and Sokhin, 18.\n\nJolie acted as a glorified midwife, helping Leany Sopheap (left and right), a poor young mother with her baby. Leany then went on to name her daughter Jolie in the actress' honor\n\nJolie filmed her new project with her son Maddox, saying: 'We had this script for a few years and he came up to me and said, \"I'm ready\"', and they began the project\n\nBefore Jolie came along, the landmine victims were living in poverty, with several people living in one hut. Pictured: The wooden homes the actress built for them to live in\n\nMaddox, who was actually born in Cambodia, was invited by his mother to participate in the film as an executive produce. Pictured: Jolie at a special screening of Netflix's First They Killed My Father in New York on Thursday\n\nSaas said: 'I just want to tell my story to express my gratitude to Ms Jolie. I was a soldier and I go to fight with Vietnam. After my injuries, I was in hospital a long time in Thailand and Cambodia, I then came out and the Khmer Rouge forced my wife and I to get married in 1993.\n\n'It made life very tough. We were refugees and it was only the support of the UNCHR [UN Refugee Agency] that I survived.\n\n'I first of all lived in a plastic tent with my wife and children, then we lived with other amputees in the village in a chicken hut. We ate only once every other day, the children would work one day, and have a meal the next.'\n\nSaas' children couldn't attend school because they had to beg and work on a tiny amount of land they had, just to earn a few cents a day.\n\nThen, in 2000, Jolie heard about Saas' tragic story.\n\nHe said: 'Ms Jolie knows me by from the UNHCR and met me here in the village. I asked why did she want to meet me.\n\n'Ms Jolie says that she only meets the fake poor people and she really wants to meet the real poor people and that's how she came by me.'\n\nThe region's elders said Jolie helped thousands of villagers get jobs and work on the fields, drastically improving their living conditions due to the work\n\nKhmer Rouge was at war with Vietnam in the 1970s and 80s and nearly two million people were killed by the communist party\n\nChean Pheng, chief commissioner of the Tasanh commune which oversees Samlaut village, was one of the guests who fondly remembers Jolie's 'great kindness.' He adds: 'Ms Jolie cares about all people, deaf, blind, everyone. She's more than just Hollywood'\n\nInclusive: Angelina Jolie, 42, brought all of her children to the New York City premiere of her new film First They Killed My Father (also pictured with cast and producers) on Thursday\n\nSaas added: 'She asked me lots of questions, then came back to see me. It was then that she decided to help me. I had nothing. She said she'd give me a house, cow, well, toilet.\n\n'She said she'd help my brothers and sisters. Ever since then she's been supporting me.'\n\nAnd not only did Jolie help Saas, but she helped other landmine victims too, most of who were maimed and in wheelchairs.\n\nShe built nine wooden houses in a row for those whose lives had been destroyed by standing on landmines in the war and couldn't look after their families.\n\nSaas said: 'She gave us nine houses, cows, they were just like me, blind and can't walk. We are like a family. Many have promised to help our people, but she really did. I'm so grateful, my life would have been so hard, I'd probably be dead, but now I'm born again.'\n\nTwo other men in wheelchairs, Bai La and Keo Bun, are also landmine victims from fighting in the war, and Saas' next-door neighbors.\n\n'I was injured in 1983 and Keo Bun in 1987,' says Bai. 'I lived in a chicken house, it wasn't meant for humans, until Ms Jolie came along.'\n\nSaas (pictured with his wife) said: 'I first of all lived in a plastic tent with my wife and children, then we lived with other amputees in the village in a chicken hut. We ate only once every other day, the children would work one day, and have a meal the next'\n\nJolie hopes the film brings audiences closer to the Cambodian people, as well as other countries experiencing violent tumult\n\nMaking the film had its own emotions. Jolie had a therapist on set for those whose memories were too painfully resurrected. One man dropped to his knees when he saw the Khmer Rouge actors marching over a bridge\n\nJolie, a UN ambassador for refuges, said that 'every care' had been taken for the welfare of the children in the film, who had been cast from a diverse backgrounds including from 'orphanages, circuses and slum schools'\n\nTHE BODYGUARD SAID NO BUT ANGELINA WAS DESPERATE TO BE A MIDWIFE AND HELPED OUT Two years on and Leany Sopheap still has the clothes, she's never letting go of them, even if her baby has outgrown them. For she'll always remember them for the time that Angelina Jolie came and offered reassuring words while she was having a baby. Leany and husband Siam Komsot were staggered when the actress came unannounced to the local Samlaut hospital, Bueng Van Health Centre. Her sister Bun tells the story: 'My sister was in the hospital as she was having a baby when Angelina turns up. It was a complete surprise. The bodyguard said no, no one is allowed near her, but when she saw my sister, she wanted to help, she wanted to be friendly and see the baby and help with the medicine. 'The baby had just been born and she prayed for it and wished good health on it. She also bought some baby clothes and a sarong for my sister.' The family was so delighted that they even named the baby after the star, calling her Jolie. Bun adds: 'I've never met Maddox but all we think is he's a lucky boy, he was just a poor boy, now he's rich and has a famous mother, going all round the world. We were very lucky to meet her.' Jolie acted as a glorified midwife while in Cambodia, helping Leany Sopheap (pictured left with star and her husband Siam Komsot) poor young mother with her baby. Bueng Van (right), Leany's sister, said the baby was named Jolie in honor of the actress\n\nBai added: 'She gave me a house, a cow and a field. We met her a few times, the last time in 2004. I wish just to see her one more time, to ask her about her life and say thank you, thank you very much.'\n\nJolie was so touched by Saas' story that she wanted to do something special just for him. He and his wife Dol Sea had been forced to marry at gunpoint by the Khmer Rouge soldiers.\n\nUpon finding out about Saas' situation, Jolie was adamant that he should have the wedding again but on her dime.\n\nThe Hollywood actress paid for everything and the whole village attended in 2003, as Jolie was the guest of honor and brought along Maddox, who was only a few months old at the time of the ceremony.\n\nChean Pheng, chief commissioner of the Tasanh commune which oversees Samlaut village, was one of the guests and fondly remembers Jolie's 'great kindness.'\n\nHe adds: 'Ms Jolie came to help the community and we are so grateful because she set up all the conservation forest, it helps the community and preserve the last forest in this area.\n\n'Ms Jolie cares about all people, deaf, blind, everyone. She's more than just Hollywood.'\n\nFirst They Killed My Father is set in Cambodia, a country where Jolie has honorary citizenship and where she adopted Maddox\n\nMaddox is pictured just months old at the Cambodian wedding ceremony that Jolie paid for with her personal funds\n\nJolie arrived to the ceremony in a helicopter with co-workers from the Maddox Jolie Pitt Foundation and a translator", "images": ["https://i.dailymail.co.uk/1s/2020/04/17/01/27297820-0-image-m-1_1587082317595.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/pix/2017/09/14/16/4445B5AA00000578-0-image-m-26_1505402266106.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4AD000000578-4885794-The_region_s_elders_said_Jolie_helped_thousands_of_villagers_get-a-126_1505423968091.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E49F300000578-4885794-Saas_pictured_with_his_wife_said_I_first_of_all_lived_in_a_plast-a-139_1505423968619.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/03/27250660-0-image-a-4_1587005883759.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27312524-0-image-a-19_1587118046208.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E480400000578-4885794-Jolie_acted_as_a_glorified_midwife_while_in_Cambodia_helping_Lea-a-147_1505423968895.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/16/44449B3600000578-0-image-m-65_1505402607116.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4AAB00000578-4885794-image-a-140_1505423968660.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E47FB00000578-4885794-Jolie_even_acted_as_a_glorified_midwife_helping_Leany_Sopheap_wi-a-145_1505423968865.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E49DB00000578-4885794-e_translator_for_the_day_was_her_friend_and_business_associate_i-a-135_1505423968406.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316298-0-image-a-1_1587125304518.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/442E0B1C00000578-4885794-It_seems_that_Cambodia_has_always_been_close_to_the_42_year_old_-a-136_1505423968438.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4AC800000578-4885794-image-a-143_1505423968757.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C9700000578-4885794-Saas_said_She_gave_us_nine_houses_cows_Many_have_promised_to_hel-a-125_1505423968038.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E47F000000578-4885794-Leany_then_went_on_to_name_her_daughter_Jolie_in_the_actress_hon-a-146_1505423968883.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4ABD00000578-4885794-Maddox_is_pictured_just_months_old_at_the_wedding_ceremony_which-a-137_1505423968446.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4A9700000578-4885794-Saas_was_forced_to_marry_his_wife_Dol_Sea_at_gunpoint_by_the_Khm-a-138_1505423968554.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/15/13/444A061F00000578-4885794-Inclusive_Angelina_Jolie_42_brought_all_of_her_children_to_the_N-a-5_1505478760105.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/05/19/43EC042900000578-0-image-m-103_1504634905396.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/2CEF4DE700000578-4885794-The_director_gave_her_first_interview_since_separating_from_husb-a-152_1505423969134.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C1100000578-4885794-Jolie_instead_hopes_the_film_brings_audiences_closer_to_the_Camb-a-132_1505423968356.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E48C200000578-4885794-The_actress_built_nine_wooden_houses_in_a_row_for_those_whose_li-a-130_1505423968199.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4BEF00000578-4885794-Chean_Pheng_chief_commissioner_of_the_Tasanh_commune_which_overs-a-133_1505423968358.jpg", "https://i.dailymail.co.uk/1s/2020/04/15/18/27234622-0-image-m-45_1586972930213.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C3100000578-4885794-Jolie_arrived_to_the_ceremony_in_a_helicopter_with_co_workers_fr-a-141_1505423968664.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E48BE00000578-4885794-The_area_was_governed_by_the_Khmer_Rouge_until_1998_with_many_of-a-151_1505423969028.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/15/15/44508D9A00000578-0-image-a-42_1505487262073.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4A5F00000578-4885794-Jolie_s_hope_was_to_lift_the_surrounding_villages_out_of_poverty-a-144_1505423968821.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27313170-0-image-m-25_1587119028862.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4A1F00000578-4885794-Before_Jolie_came_along_the_landmine_victims_were_living_in_pove-a-128_1505423968103.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/15/13/444B13D300000578-4885794-image-a-2_1505478555563.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C8B00000578-4885794-Jolie_filmed_her_new_project_with_her_son_Maddox_saying_We_had_t-a-142_1505423968729.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/09/27309852-0-image-a-13_1587113311145.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C2700000578-4885794-She_paid_for_everything_and_the_whole_village_attended_in_2003_a-a-127_1505423968100.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/4449099500000578-4885794-Jolie_s_Cambodian_film_tells_the_true_to_life_story_of_a_five_ye-a-150_1505423969019.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C6E00000578-4885794-image-a-134_1505423968373.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4A8100000578-4885794-Samlaut_was_one_of_the_last_remaining_outposts_of_the_Khmer_Roug-a-148_1505423968999.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4BA400000578-4885794-Khmer_Rouge_was_at_war_with_Vietnam_in_the_1970s_and_80s_and_nea-a-131_1505423968233.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E4C3F00000578-4885794-A_Cambodian_landmine_victim_reveals_how_Angelina_Jolie_transform-a-129_1505423968139.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/14/27271348-0-image-a-37_1587043733883.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27297876-0-image-a-7_1587082503828.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/07/video-27306022-770_154x115.jpg", "https://i.dailymail.co.uk/i/pix/2017/09/14/22/443E486A00000578-4885794-Bueng_Van_right_Leany_s_sister_said_the_baby_was_named_Jolie_in_-a-149_1505423969009.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/09/15/15/44508D9A00000578-0-image-a-42_1505487262073.jpg", "keywords": [], "authors": ["Chris White", "Chris White For Dailymail.Com"], "canonical_link": "https://www.dailymail.co.uk/news/article-4885794/Angelina-Jolie-attended-Cambodian-wedding-baby-Maddox.html", "title": "Angelina Jolie's humanitarian efforts in Cambodia revealed", "meta_data": {"keywords": "dailymail,news", "news_keywords": "dailymail,news", "original-source": "https://www.dailymail.co.uk/news/article-4885794/Angelina-Jolie-attended-Cambodian-wedding-baby-Maddox.html", "description": "Cambodian landmine victims reveal how Angelina Jolie changed their lives when she visited their village of Samlaut and built them new homes in 2000 and threw a wedding in 2003.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Angelina built homes for Cambodia landmine victim and attended wedding", "description": "Cambodian landmine victims reveal how Angelina Jolie changed their lives when she visited their village of Samlaut and built them new homes in 2000 and threw a wedding in 2003.", "url": "https://www.dailymail.co.uk/news/article-4885794/Angelina-Jolie-attended-Cambodian-wedding-baby-Maddox.html", "image": "https://i.dailymail.co.uk/i/pix/2017/09/15/15/44508D9A00000578-0-image-a-42_1505487262073.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4885794, "author": "Chris White", "divclasspage": "articlePage", "mol": {"headline": "EXCLUSIVE: Cambodian landmine victims tell how Angelina Jolie built them houses, paid for one of their weddings and was guest of honor with baby Maddox in tow as her film on the Khmer Rouge is set to premiere on Netflix"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-09-15T16:01:19+0100", "modified_time": "2017-09-15T22:21:58+0100", "section": "News", "tag": "Angelina Jolie attended Cambodian wedding baby Maddox", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Angelina built homes for Cambodia landmine victim and attended wedding", "type": "article", "description": "Cambodian landmine victims reveal how Angelina Jolie changed their lives when she visited their village of Samlaut and built them new homes in 2000 and threw a wedding in 2003.", "url": "http://www.dailymail.co.uk/~/article-4885794/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/09/15/15/44508D9A00000578-0-image-a-42_1505487262073.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/09/12/866426370199209059/1024x576_MP4_866426370199209059.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4885794/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4885794/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1505487679.0, "source": "http://www.dailymail.co.uk", "summary": ""}