{"url": "https://en.wikipedia.org/wiki/Hugh_Hefner", "text": "American businessman and magazine publisher\n\nHugh Marston Hefner (April 9, 1926 – September 27, 2017) was an American magazine publisher. He was the founder and editor-in-chief of Playboy magazine, a publication with revealing photographs and articles which provoked charges of obscenity. The first issue of Playboy was published in 1953 featuring Marilyn Monroe in a nude calendar shoot; it sold over 50,000 copies.\n\nHefner extended the Playboy brand into a world network of Playboy Clubs. He also resided in luxury mansions where Playboy \"playmates\" shared his wild partying life, fueling keen media interest. He was an advocate of \"sexual liberation\" and \"freedom of expression\", and he was a political activist in the Democratic Party and for the causes of First Amendment rights, animal rescue, and the restoration of the Hollywood Sign.\n\nEarly life\n\nHefner was born in Chicago on April 9, 1926,[2] the first child of Glenn Lucius Hefner (1896–1976), an accountant, and his wife Grace Caroline (Swanson) Hefner (1895–1997) who worked as a teacher. His parents were from Nebraska.[3][4] He had a younger brother, Keith (1929–2016).[5][6][7] His mother was of Swedish ancestry, and his father was German and English.[8][9]\n\nThrough his father's line, Hefner was a descendant of Plymouth governor William Bradford.[10][11] He described his family as \"conservative, Midwestern, [and] Methodist\".[12] His mother had wanted him to become a missionary.[13]\n\nHe attended Sayre Elementary School and Steinmetz High School, then served from 1944 to 1946 as a U.S. Army writer for a military newspaper. Hefner graduated from the University of Illinois at Urbana–Champaign in 1949 with a Bachelor of Arts in Psychology and a double minor in Creative Writing and Art, having earned his degree in two and a half years. After graduation, he took a semester of graduate courses in Sociology at Northwestern University, but dropped out soon after.[14]\n\nCareer\n\nIn January 1952, Hefner left his job as a copywriter for Esquire after he was denied a $5 raise. In 1953, he took out a mortgage loan of $600 and raised $8,000 from 45 investors (including $1,000 from his mother—\"not because she believed in the venture,\" he told E! in 2006, \"but because she believed in her son\") to launch Playboy, which was initially going to be called Stag Party. The first issue was published in December 1953 and featured Marilyn Monroe from her 1949 nude calendar shoot; it sold more than 50,000 copies.[15] (Hefner never met Monroe, but he bought the crypt next to hers at the Westwood Village Memorial Park Cemetery in 1992 for $75,000.)[16][17]\n\nEsquire magazine rejected Charles Beaumont's science fiction story \"The Crooked Man\" in 1955, so Hefner agreed to publish it in Playboy. The story highlighted straight men being persecuted in a world where homosexuality was the norm. The magazine received angry letters, so Hefner responded, \"If it was wrong to persecute heterosexuals in a homosexual society then the reverse was wrong, too.\"[18] In 1961, Hefner watched Dick Gregory perform at the Herman Roberts Show Bar in Chicago, and he hired Gregory to work at the Chicago Playboy Club. Gregory attributed the launch of his career to that night.[19]\n\nHefner promoted a bon vivant lifestyle in his magazine and in the TV shows that he hosted Playboy's Penthouse (1959–1960) and Playboy After Dark (1969–1970).[20] He was also the chief creative officer of Playboy Enterprises, the publishing group which operates the magazine.[21]\n\nOn June 4, 1963, Hefner was arrested for promoting obscene literature after he published an issue of Playboy featuring nude shots of Jayne Mansfield in bed with a man present.[22] The case went to trial and resulted in a hung jury.[23]\n\nIn the 1960s, Hefner created \"private key\" clubs that were racially diverse.[24] During the civil rights movement in 1966, Hefner sent Alex Haley to interview George Lincoln Rockwell, much to Rockwell's surprise because Haley was black. Rockwell had founded the American Nazi Party, described by some[who?] as the \"American Hitler\". Rockwell agreed to meet with Haley only after gaining assurance that he was not Jewish, although Rockwell kept a handgun on the table throughout the interview. The interview was recreated in Roots: The Next Generations in 1979, with James Earl Jones as Haley and Marlon Brando as Rockwell; Brando won a Primetime Emmy Award for his portrayal of Rockwell.[25] Haley had also interviewed Malcolm X in 1963 and Martin Luther King Jr. in 1966 for the newly established 1962 \"playboy interview\"; all three interviewees were assassinated by 1968.[26]\n\nHefner with his trademark Playboy Pipe in 1966\n\nIn 1970, Hefner stated that \"militant feminists\" are \"unalterably opposed to the romantic boy-girl society that Playboy promotes\" and ordered an article in his magazine against them.[27] In the 1993 The Simpsons episode \"Krusty Gets Kancelled\", Hefner voiced himself.[28][29] In 1999, Hefner financed the Clara Bow documentary Discovering the It Girl. \"Nobody has what Clara had,\" he said. \"She defined an era and made her mark on the nation\".[30] Hefner guest-starred as himself in the 2000 Sex and the City episode \"Sex and Another City\".[31] In 2005, he guest-starred on the HBO shows Curb Your Enthusiasm and Entourage.[31] He guest-starred as himself in a 2006 episode of Seth Green's Robot Chicken on the late-night programming block Adult Swim.[29] In the 2007 Family Guy episode \"Airport '07\", he voiced himself.[31] He has a star on the Hollywood Walk of Fame for television and made several movie appearances as himself. In 2009, he received a \"worst supporting actor\" nomination for a Razzie award for his performance as himself in Miss March. On his official Twitter account, he joked about this nomination: \"Maybe I didn't understand the character.\"[32]\n\nBrigitte Berman's documentary Hugh Hefner: Playboy, Activist and Rebel was released on July 30, 2010. He had previously granted full access to documentary filmmaker and television producer Kevin Burns for the A&E Biography special Hugh Hefner: American Playboy in 1996.[33] Hefner and Burns later collaborated on numerous other television projects, most notably on The Girls Next Door, a reality series that ran for six seasons (2005–2009) and 90 episodes.[34] Hefner also made a voice-only appearance as himself in the 2011 film Hop.\n\nIn 2012, Hefner announced that his youngest son Cooper would succeed him as the public face of Playboy.[35]\n\nPersonal life\n\nHefner was known to friends and family simply as \"Hef\".[36] He married Northwestern University student Mildred (\"Millie\") Williams in 1949, and they had daughter Christie (b. 1952) and son David (b. 1955).[37] Before the wedding, Mildred confessed that she had an affair while he was away in the army. He called the admission \"the most devastating moment of my life.\" A 2006 E! True Hollywood Story profile of Hefner revealed that Mildred allowed him to have sex with other women, out of guilt for her own infidelity and in the hope that it would preserve their marriage. The two were divorced in 1959.[38][39]\n\nHefner remade himself as a bon vivant and man about town, a lifestyle that he promoted in his magazine and TV shows. He admitted to being \"'involved' with maybe eleven out of twelve months' worth of Playmates\" during some years.[40] Donna Michelle, Marilyn Cole, Lillian Müller, Shannon Tweed, Barbi Benton, Karen Christy, Sondra Theodore, and Carrie Leigh were a few of his many lovers; Leigh filed a $35 million palimony suit against him.[citation needed] In 1971, he acknowledged that he experimented in bisexuality.[41] Also in 1971, he established a second residence in Los Angeles with the acquisition of Playboy Mansion West, and he moved there permanently from Chicago in 1975.[42]\n\nOn March 7, 1985, Hefner had a minor stroke at age 58, and he re-evaluated his lifestyle and made several changes. He toned down the wild, all-night parties, and daughter Christie took over the operation of the Playboy empire in 1988. The following year, he married Playmate of the Year Kimberley Conrad; they were 36 years apart in age. The couple had sons Marston Glenn (born 1990) and Cooper (born 1991).[43] The E! True Hollywood Story profile noted that the notorious Playboy Mansion had been transformed into a family-friendly homestead. He and Conrad separated in 1998 and she moved into the house next door to the mansion.[44] Hefner filed for divorce from Conrad in 2009 after an 11-year separation, citing irreconcilable differences.[45] He has stated that he only remained nominally married to her for the sake of their children,[46] and their youngest child had just turned 18. The divorce was finalized in 2010.[43]\n\nHefner became known for moving an ever-changing coterie of young women into the Playboy Mansion, including twins Mandy and Sandy Bentley. He dated as many as seven women concurrently. He also dated Brande Roderick, Izabella St. James, Tina Marie Jordan, Holly Madison, Bridget Marquardt, and Kendra Wilkinson. Madison, Wilkinson, and Marquardt appeared on The Girls Next Door depicting their lives at the Playboy Mansion.[47] In October 2008, all three of them decided to leave the mansion.\n\nIn January 2009, Hefner began a relationship with Crystal Harris;[48] she joined the Shannon Twins after his previous \"number one girlfriend\" Holly Madison had ended their seven-year relationship.[49] On December 24, 2010, he became engaged to Harris,[50] but she broke off their engagement on June 14, 2011, five days before their planned wedding.[51] The July issue of Playboy reached store shelves and customer's homes within days of the wedding date; it featured Harris on the cover and in a photo spread, as well. The headline on the cover read \"Introducing America's Princess, Mrs. Crystal Hefner\".[52] Hefner and Harris subsequently reconciled and married on December 31, 2012.[53][54][55][56]\n\nHefner's brother Keith died at age 87 on April 8, 2016, one day before Hefner's 90th birthday.[57]\n\nPlayboy Mansion\n\nIn January 2016, the Playboy Mansion was put on the market for $200 million, on condition that Hugh Hefner would continue to work and live in the mansion.[58] Later that year it was sold to Daren Metropoulos, a principal at private equity firm Metropoulos & Company, for $100 million. Metropoulos planned to reconnect the Playboy Mansion property with a neighboring estate that he purchased in 2009, combining the two for a 7.3 acre (3-hectare) compound as his own private residence.[59]\n\nIn May 2017, Eugena Washington was the last Playmate of the Year to be announced by Hugh Hefner at the Playboy Mansion.[60]\n\nPolitics and philanthropy\n\nThe Hugh M. Hefner First Amendment Award was created by Christie Hefner \"to honor individuals who have made significant contributions in the vital effort to protect and enhance First Amendment rights for Americans.\"[61]\n\nHe donated and raised money for the Democratic Party.[62] In 2011, he referred to himself as an independent due to dissatisfaction with both the Democratic and Republican parties.[63] Nonetheless, in 2012, he supported Barack Obama's reelection campaign.[64]\n\nIn 1978, Hefner helped organize fund-raising efforts that led to the restoration of the Hollywood Sign. He hosted a gala fundraiser at the Playboy Mansion and contributed $27,000 (or 1/9 of the total restoration costs) by purchasing the letter Y in a ceremonial auction.[65][66]\n\nHefner donated $100,000 to the University of Southern California's School of Cinematic Arts to create a course called \"Censorship in Cinema\", and $2 million to endow a chair for the study of American film.[67] In 2007, the university's audiovisual archive at the Norris Theater received a donation from Hefner and was renamed to the Hugh M. Hefner Moving Image Archive in his honor.[68]\n\nBoth through his charitable foundation and individually, Hefner also contributed to charities and other organizations outside the sphere of politics and publishing, throwing fundraiser events for Much Love Animal Rescue as well as Generation Rescue,[69] an anti-vaccinationist campaign organization supported by Jenny McCarthy.\n\nOn November 18, 2010, Children of the Night founder and president Dr. Lois Lee presented Hefner with the organization's first-ever Founder's Hero of the Heart Award in appreciation for his unwavering dedication, commitment and generosity.[70]\n\nOn April 26, 2010, Hefner donated the last $900,000 sought by a conservation group for a land purchase needed to stop the development of the famed vista of the Hollywood Sign.[65] Sylvilagus palustris hefneri, an endangered subspecies of marsh rabbit, is named after him in honor of financial support that he provided.[71][72][73]\n\nThe Barbi Twins who are among a notable cohort of celebrity Playmates, including Pamela Anderson and Hefner's third wife Crystal Harris, praised the publishing icon for providing centerfolds and extended members of the Playboy family with a platform for activism and advocacy on behalf of animal populations in need.[74][73]\n\nHefner supported legalizing same-sex marriage, and he stated that a fight for gay marriage was \"a fight for all our rights. Without it, we will turn back the sexual revolution and return to an earlier, puritanical time.\"[75]\n\nDeath\n\nHefner died at his home in Holmby Hills, Los Angeles, California, on September 27, 2017, at the age of 91.[76][77] The cause was sepsis brought on by an E. coli infection.[78][79][80]\n\nHe is interred at Westwood Memorial Park in Los Angeles, in the $75,000 crypt beside Marilyn Monroe. \"Spending eternity next to Marilyn is an opportunity too sweet to pass up,\" Hefner had told the Los Angeles Times in 2009.[81]\n\nCriticism\n\nSuzanne Moore wrote in The Guardian that Hefner threatened to file a lawsuit against her for calling him a \"pimp\".[82] Defending her position, Moore argued that \"he was a man who bought and sold women to other men\".[82] She further stated that \"part of Hefner's business acumen was to make the selling of female flesh respectable and hip, to make soft porn acceptable.\"[82] Julie Bindel argued in The Independent that Hefner \"caused immeasurable damage by turning porn – and therefore the buying and selling of women's bodies – into a legitimate business.\"[83] Robin Abcarian wrote in the Los Angeles Times that Hefner \"probably did more to mainstream the exploitation of women's bodies than any other figure in American history,\" adding that he \"managed to convince many women that taking off their clothes for men's pleasure was not just empowering, but a worthy goal in itself.\"[84] She further stated that Hefner \"embodied the aesthetic notion that images of women — and women themselves — exist to please men.\"[84]\n\nHefner's former girlfriend Holly Madison said that he \"would encourage competition—and body image issues—between his multiple live-in girlfriends. His legacy is full of evidence of the exploitation of women for professional gain.\"[85] Ed Stetzer wrote in Christianity Today that Hefner would have the residence systematically cleaned whenever Christie Hefner visited in order \"to keep the realities from his own daughter\".[86] Stetzer further lamented the consequences of Hefner's role as a \"general\" of the \"sexual revolution\":\n\nIt's hard to fathom that anyone would have known what this would have turned into. Parents growing up today are fighting to keep their children pure. Spouses are fighting to keep their marriages intact. And many enslaved and trapped in the adult entertainment industry have been figuratively and literally stripped not only of their clothes, but their very value as people made in the image of God. If this does not concern us, what will?[86]\n\nFilm adaptation\n\nOn October 3, 2017, it was announced[by whom?] that Jared Leto would play Hugh Hefner in a biopic directed by Brett Ratner with the screenplay by Jeff Nathanson. However, the film was indefinitely put on hold and it was confirmed[by whom?] that Leto would not portray Hefner following sexual harassment allegations against Ratner on November 2, 2017.[87][88]\n\nThe Amazon Original Series American Playboy: The Hugh Hefner Story was released in 2017. It stars Matt Whelan in the title role, along with Emmett Skilton and Chelsie Preston Crayford. The first season was released on April 7, composed of ten episodes. The series is a combination of interviews, archival footage (including moments found in Hefner's vast personal collection), and cinematic re-enactments that cover the launch of the magazine as well as the next six decades of Hefner's personal life and career. The series was filmed in Auckland, New Zealand.[89]\n\nReferences", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Hefner_1978.jpg/220px-Hefner_1978.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hugh_Hefner_Glamourcon_2010.jpg/1200px-Hugh_Hefner_Glamourcon_2010.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Social_sciences.svg/24px-Social_sciences.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hugh_Hefner_Glamourcon_2010.jpg/220px-Hugh_Hefner_Glamourcon_2010.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Holly_Madison_6.jpg/220px-Holly_Madison_6.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Hugh_Hefner_1966.jpg/170px-Hugh_Hefner_1966.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hugh_Hefner_Glamourcon_2010.jpg/1200px-Hugh_Hefner_Glamourcon_2010.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Hugh_Hefner", "title": "Hugh Hefner", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hugh_Hefner_Glamourcon_2010.jpg/1200px-Hugh_Hefner_Glamourcon_2010.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}