{"url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "text": "So many beauty e-tailers have sprung up in the past 10 years that it's hard to know where to start if you're looking to buy cosmetics online.\n\nLuckily, we've done the hard work for you by scouring the web to find the best sites to buy beauty products.\n\nYou'll find organic beauty at LoveLula, endless sun cream options at Boots and make-up artist must-haves at Cult Beauty.\n\nOur roundup only features retailers with sites that are easy to use; including both larger retailers with wide ranges and niche options that deliver on their specialism, like natural skincare, for example.\n\nWhether you're looking to stock up on old favourites or to try something new, these beauty heroes are sure to get you in the mood for some online splurging.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps us to fund journalism across The Independent.\n\nAll Beauty\n\nLaunched in 2004, All Beauty is the go-to site for discounted beauty products. Ideal for savvy shoppers, the site sells all the best big beauty brands at the lowest possible with everything from fragrance and skincare to haircare up for grabs. They also offer a price match service against retailers like Boots, Debenhams, Harrods and Superdrug.\n\nVisit shop\n\nASOS\n\nYou might know ASOS as a go-to destination for fashion but as of last year it also launched its very own collection of in-house beauty products, relaunching the ASOS beauty section as ASOS Face + Body. As well as its own makeup and skincare including lipsticks, highlighters and budge-proof eyeliners, it also sells products from a number of leading brands including Smashbox, Bobbi Brown, Clinique and Illamasqua.\n\nVisit shop\n\nBeauty Bay\n\nMore than a retailer, Beauty Bay is packed with make-up tutorials, colour trend reports, get the make-up look tips with product recommendations, and tried and tested reviews. With over 10,000 products available from the very best UK and International brands – think Jeffrey Star, Sigma and Anastasia Beverly Hills – you’ll be hard pressed to leave this site empty handed. They also have a blog which is fab for keeping up with all the latest beauty news.\n\nVisit shop\n\nBeauty Pie\n\nThe brainchild of Marcia Kilgore, the beauty buff behind brands like Bliss Spa and Soap & Glory, Beauty Pie is about to revolutionise the way you buy makeup. The digital-only make-up brand cuts out the middleman and the mark-ups, allowing you to buy direct from factories that also supply the majority of luxury beauty brands. For just £10 a month, you’re given a shopping allowance of up to £100 retail price but you only pay factory cost. For example, Beauty Pie’s Precision Eyeliner Marker is valued at £16 retail cost (and looks suspiciously like Kat Von D’s Tattoo Liner) but it will only set you back a mere £1.50. Where do we sign up?\n\nVisit shop\n\nBeing Content\n\nHandbag.com creator Nancy Cruickshank and Kate Shapland Beauty Editor at The Telegraph for over 10 years, have created a new concept in online beauty retail. “Think Avon meets SpaceNK, but with a passion for supporting female entrepreneurs in building or expanding their businesses – be it a brand or as a stylist,” says Nancy. The boutique organic skincare store specialises in emerging niche brands and hand picks a selection of the most advanced, cult natural beauty brands from around the world.\n\nVisit shop\n\nBenefit Cosmetics\n\nAmerican brand Benefit began when identical twins Jean and Jane Ford opened a small beauty boutique in San Francisco back in 1976. Their entire approach was one of fun with kitsch packaging and quirkily named products that were an escape from other cosmetics brands of the time – a practice the brand still adheres to today. If eyebrows are your thing, Benefit should be your go-to destination.\n\nVisit shop\n\nBoots\n\nThe UK’s leading pharmacy-led health and beauty retailer, Boots’ purpose is to “help customers look and feel better than they ever thought possible.” The website sells products from leading products such as No7 and Barry M as well as beauty electricals from Tresemme and Dyson. Even better, if you order online by 8pm you can collect your purchases for free the very next day at a store near you.\n\nVisit shop\n\nCharlotte Tilbury\n\nAfter more than 20 years working as a makeup artist, Charlotte Tilbury has put every tip and trick she’s learned along the way into her makeup and skincare line, which debuted in the UK in 2013. Available on her eponymous website, Tilbury offers everything from foundation and mascara to moisturisers and ready-made gifts for the beauty obsessive in your life. The website also has a handy “How-to” section where you can follow makeup tutorials for a number of different looks.\n\nVisit shop\n\nCult Beauty\n\n'Top Rated', ‘Exclusives and 'New In' are just some of the ways you can filter the cherry-picked beauty products from more than 130 brands on Cult Beauty. “Our mission is to demystify the beauty industry, combining consumer trials with the vast knowledge of our expert panel to filter out the blaggers and braggers from the gems that do what they say on the tin. The result is a beauty hall of fame – you can shop in the knowledge that anything you buy will be outstanding.” Big claims, but they are well and truly substantiated with some real beauty corkers up for grabs.\n\nVisit shop\n\nDebenhams\n\nA high-street favourite, Debenhams has become a leading international, multi-channel brand. Far beyond your standard department store, Debenhams have come to represent some of the most sought-after beauty brands including Kat Von D, Too Faced and Urban Decay. They also have a Beauty Club reward scheme that allows you to collect and spend points across over 200 beauty and fragrance brands.\n\nVisit shop\n\nEscentual\n\nIf you’re after a bit of luxury, Escentual should be your got-to, one stop shop. Founded in 2000, the site brings over 9,000 products to its customers across a range of high-end brands including Dior and Burberry. Whether it’s makeup, skincare, hair care of fragrance you’re after, you’re guaranteed to find it all here.\n\nVisit shop\n\nFeel Unique\n\nWomen, men, brands and special events like Father’s Day are just some of the handy ways you can navigate this website. With over 30,000 products at your fingertips Feel Unique has something for everyone and at every budget, from high street favourites like Maybelline to high end cult brands like Burberry and By Terry.\n\nVisit shop\n\nFenty Beauty\n\nLast year, singer Rihanna launched the highly-anticipated makeup line Fenty Beauty and it has since become a huge hit amongst beauty aficionados. Championing diversity, the line targets women of all skin tones with 40 different hues of foundation and more than 20 correcting concealers/\n\nVisit shop\n\nGlossy Box\n\nOne for the serious beauty lover, Glossy Box allows you to test out new products without having to splurge. A service that sends 5 surprise beauty products directly to your door every month for just £10 across brands like Becca Cosmetics, Caudalie, Givenchy and Sarah Chapman, the monthly subscriptions comes in 3, 6, or 12 month plans.\n\nVisit shop\n\nHouse of Fraser\n\nA department store that’s been around for more than 150 years, House of Fraser offers an extensive range of beauty products for both men and women. As well as makeup and skincare, the website also sells haircare, tools and fragrances across a number of high-end brands including Chanel, La Mer, Clinique and Elemis. If you’re not sure what to buy, the website also has a great “Beauty Spotlight” section which helps you discover the latest beauty must-haves loved by industry professionals and bloggers alike.\n\nVisit shop\n\nLook Fantastic\n\nEurope’s number one retailer for beauty, Look Fantastic has over 14,000 products from more than 350 brands available on its site across hair, make-up, fragrance and men; there really is something for everyone here. The site is super-easy to navigate and even allows you to search by brand. We also love the fact that they have introduced the Beauty Box; a monthly subscription which means you can take home premium beauty treats worth over £60 for just £15 a month plus a copy of the latest Elle UK.\n\nVisit shop\n\nLove Lula\n\nWith more rosettes for organic, soil association, natural health and green parenting than you can shake a muddy stick at, this is the place to go for natural beauty. Fifteen years ago it was hard work to get hold of natural organic products, you had to really know your stuff and know where to look. Now we have Love Lula that only sells natural and organic. Now that is progress! They insist on “no sodium lauryl sulfates, no parabens, no animal testing”, but they “must be effective, luxurious and guilt-free.” LoveLula also say they “seek out the most innovative companies and strive to support morally run and environmentally driven businesses”.\n\nVisit shop\n\nLush Cosmetics\n\nOne of the most powerful beauty brands, Lush stores can be found in 49 countries across the world. A brand best known for their inimitable bath bombs, it also sells soaps, shampoos, cosmetics and masks using only vegetarian or vegan recipes. What’s more, they do not buy from any companies that carry out or fund any animal testing.\n\nVisit shop\n\nMac Cosmetics\n\nThe world’s leading professional makeup authority, Mac Cosmetics has become a cult favourite among beauty fans, and for good reason. The company has taken the industry by storm since its launch in 1984 and is now sold in more than 105 countries around the world. It sells everything from super-matte lipsticks and professional standard makeup brushes, to shimmering setting sprays and eyeshadow palettes.\n\nVisit shop\n\nMarks & Spencer\n\nA stalwart on the British high street, it’s not just groceries that Marks & Spencer do really well. Available both in-store and online, the brand also offers an edit of much-loved beauty products from some of the best brands in the business such as Pixi, Nuxe, Emma Hardie and Aveda. It’s also home to a collaboration with supermodel Rosie Huntington-Whiteley which offers easy-to-use modern make-up classics and stylish perfumes.\n\nVisit shop\n\nNet-a-Porter\n\nThe world’s premier luxury fashion destination, Net-a-Porter sells much more than high-end garb. In fact, the website has quickly become a beauty lovers paradise brimming with indulgent names like Balmain, Chantecaille and Charlotte Tilbury. As well as cosmetics it also sells fragrance, skincare, tools and devices.\n\nVisit shop\n\n& Other Stories\n\nA one-stop styling destination filled with fashion collections, & Other Stories also sells a range of products designed to elevate your natural beauty. Ideal for those looking to discover new makeup products for everyday and evening looks, the website sells staple makeup must-haves from brushes and foundation to lipstick and eye colour palettes.\n\nVisit shop\n\nQVC\n\nWhat started as a television network, QVC now runs a proficient online service with all the same money-saving benefits. Known to offer some of the best beauty deals around, the site sells everything from makeup to and allows you to have hard to come by brands like Tarte and It cosmetics at your fingertips.\n\nVisit shop\n\nSelfridges\n\nA brand that started life in 1906 with a revolutionary understanding of the theatre of retail, Selfridges has gone from strength-to-strength over the years. Now, the website offers beauty lovers everything they could ever need from high street brands like Bare Minerals and Bobbi Brown to luxury names including Burberry, Aesop and Escentric Molecules.\n\nVisit shop\n\nSpace NK\n\nSpaceNK's Nicky Kinnaird started it all in 1993 with a little shop in Covent Garden where she introduced us to the world of niche high performance beauty brands like Laura Mercier, Chantecaille, Eve Lom, Nars and Shu Uemura. Now, with a wealth of brands online, this is a one-stop-shop for serious luxury and glamour and an edited selection of the world's best beauty products. Nicky still travels the globe searching out great products, “I look for the unusual, exciting and special wherever I am,” she says. The site also has a live chat feature which means you can speak to a Space NK assistant at any time.\n\nVisit shop\n\nSuperdrug\n\nA favourite on the high street, Superdrug has extended its offering online. Committed to bringing innovation to the industry, as well as the best big beauty brands, such as Rimmel and Bourjois, it also offers a host of exclusive and own-brand products that you won’t find anywhere else. The Superdrug website sells everything from makeup and skincare to men’s grooming products and electricals.\n\nVisit shop\n\nThe Body Shop\n\nNever afraid to stand out from the crowd, The Body Shop is famed for its naturally-inspired beauty products that are 100 per cent vegetarian and cruelty free. As well as makeup, it also sells fragrances, skincare and an extensive range of moisturising body products. The Body Shop website also features a “Tips and Advice” section where you can find information on everything from how to reduce blackheads to the benefits of hyaluronic acid.\n\nVisit shop\n\nToo Faced\n\nFounded by Jerrod Blandino and Jeremy Johnson in 1998, Too Faced is now sold in more than 30 countries and is one of the top-selling brands everywhere it’s sold. Famed for its sweet-scented products, budge-proof mascaras and high-coverage foundations, has quickly become a brand that women love to wear.\n\nVisit shop\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/furniture.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/laptops-and-tablets.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/04/27/15/kitchen-appliance.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/24/09/indonesia-etc.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/04/27/09/osprey-meridian.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/marley-spoon.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/mango.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/clothing-and-footwear.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/phones-and-accesories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/pitt-and-cue.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/non-fiction-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/hair.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/23/16/sweatybetty.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/gifts.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/15/flying.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/stand-mixers.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/outdoor-eating.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/mens-shoes.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/garden-furniture.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/09/running.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/06/09/montezuma.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/04/24/09/crocs-womens-literide-sandal-sandals.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/headphones-and-earphones.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/11/07/17/kitchenaid.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/skincare.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/camping.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/mens-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/activity-books-and-crafts.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/powertools.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/01/23/16/taylormade-daytona.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/household-appliances.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/toys.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/computer-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2017/11/06/15/wintersports.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/lingerie.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/audio.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/florent-rouve-vire-clesse.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/outside-eating.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/make-up.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/leon-sized.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/baby-tech-and-essentials.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/04/24/10/walking-sandals-hero.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/the-travel-atlas.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/champagne-prosecco-and-sparkling-wine.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/stationery.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/11/sports-equipment-and-accessories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/cameras-and-accesories.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/12/childrens-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/14/tv-and-entertainment.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/jack-wolfskin-mtn.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/10/volt-metro.jpg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/09/15/best-beauty-retailers-indybest.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/17/screen-shot-2016-10-05-at-18.01.35.png", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2019/03/04/16/7-made.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/09/bugaboo-bee-3.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/10/05/13/fiction-books.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/13/spirits.jpg", "https://static.independent.co.uk/s3fs-public/styles/meganav_thumb/public/thumbnails/image/2016/09/30/15/beer-cider-and-perry.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/09/15/best-beauty-retailers-indybest.jpg", "keywords": [], "authors": ["Sarah Young"], "canonical_link": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "title": "Best online beauty shops for must-have make-up and skincare saviours", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "title": "Best online beauty shops for must-have make-up and skincare saviours", "description": "Enter cosmetic heaven in our roundup of the best destinations for all things beauty", "updated_time": "2020-03-10T11:00:32+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/09/15/best-beauty-retailers-indybest.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/669216"}, "description": "Stock up on old favourites or find something new with our roundup of the best online beauty retailers, featuring Cult Beauty, Escentual, Boots and more", "keywords": "Fashion and Beauty, fashion and style, best buy, Beauty Products, Fashion & Beauty, IndyBest, Extras", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Fashion and Beauty", "published_time": "2019-08-09T16:00:00+01:00", "modified_time": "2020-03-10T11:00:32+00:00", "section": "Fashion & Beauty", "author_name": "Sarah Young", "content_type": "story", "word_count": 2240, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 56}, "twitter": {"title": "Best online beauty shops for must-have make-up and skincare saviours", "description": "So many beauty e-tailers have sprung up in the past 10 years that it's hard to know where to start if you're looking to buy cosmetics online. Luckily, we've done the hard work for you by scouring the", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1565362800.0, "source": "https://www.independent.co.uk", "summary": ""}