{"url": "www.thesun.co.uk/tvandshowbiz/5594388/jennifer-aniston-justin-theroux-split-marriage-reason-fights-neighbour/", "text": "JENNIFER Aniston and Justin Theroux's split was a long time coming with \"rows with their neighbours\" one of the main reasons for their break up.\n\nAccording to new reports, the couple also argued about where to live, while a bizarre \"bologna incident\" only added to the tension.\n\n5 Jennifer Aniston and Justin Theroux, pictured last April, announced their divorce yesterday with 'differences over where to live' one of the main reasons Credit: Rex Features\n\nThe couple yesterday announced they were \"lovingly\" divorcing after just two years of marriage.\n\nA source told Entertainment Tonight that Justin prefers living in New York and \"that's been a major issue for the couple for a long time\".\n\nAlthough Jen was initially happy to make a go of things in the city and moved into an apartment in the West Village with Justin, 46, she found herself constantly being snapped by paparazzi.\n\nThe paps would often set up shop in a small park opposite the apartment to photograph the actress, 49, coming and going, which upset the neighbours.\n\n5 Justin lived a more care-free life in New York city than Jen, who was often snapped by paparazzi Credit: Rex Features\n\n5 Jennifer, pictured in New York back in 2016, was never happy in the city Credit: Rex Features\n\nThe source recalled: \"There was the construction, which is obviously a nuisance, but what really p***ed off the neighbours was just the constant commotion outside their door all the time with the photographers.\n\n\"It made for an awkward living situation for Jen and Justin because they knew the neighbours weren't happy.\n\n\"Justin can hop on his bike, walk in the neighbourhood, hang at a bar and all that without being bothered, but for Jen, the paparazzi are all over her.\"\n\nAt one point, Justin found his beloved motorbike covered with bologna sausage slices, which is said to have infuriated the Friends star who was convinced the neighbours did it.\n\n5 Jennifer, posing at her Bel Air apartment for the cover of Architectural Digest, was much happier on the West Coast Credit: Architectural Digest\n\nThe source said: \"She just never really could get settled in, she wasn't happy [in New York].\"\n\nThe couple ended up selling the West Village apartment, but Justin tellingly kept his Greenwich Village pad.\n\nAlthough he would stay there when they were on the East Coast, Jen would opt to stay in a luxury hotel.\n\nEventually, Justin agreed to move to Los Angeles.\n\nBut his friendship circle was still in New York and he \"constantly came up with reasons to return\", according to the website.\n\nAlthough the couple \"really wanted\" to make things work, they couldn't keep the marriage going and they split at the end of last year.\n\n5 Justin, pictured in Los Angeles, kept finding excuses to return to the East Coast, according to Entertainment Tonight Credit: Rex Features\n\nJustin Theroux missed his audition for friends because he slept in\n\nThe statement, released by Jennifer's publicist, reads: “In an effort to reduce any further speculation, we have decided to announce our separation.\n\n\"This decision was mutual and lovingly made at the end of last year.\n\n\"We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.\n\nMost Read in TV Showbiz GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize BECK HOME The Beckhams post pics proving they didn't move back to London Exclusive Show me the money Bra tycoon Michelle Mone in secret talks to join Dragon’s Den 'SICKENING' This Morning calls police as domestic abuse victim phones in and begs for help TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior MAN'S BEST FRIEND Paul O'Grady reveals new puppy Nancy after announcing death of older dog\n\n\"Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly.\n\n\"Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative.\n\n\"Above all, we are determined to maintain the deep respect and love that we have for one another.”\n\nThere are currently no additional details as to why they have decided to split.\n\nJustin and Jennifer got together in 2011, and became engaged in 2012.\n\nThe pair had met through mutual friends and had worked on a series of films together, including 2008's Tropic Thunder and Wanderlust in 2011.\n\nJennifer Aniston insists she should not be made to feel bad because she does not have kids\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220.\n\nWe pay for videos too. Click here to upload yours.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2018/02/jh-jen-composite.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/02/jh-jen-composite.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Ellie Genower"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5594388/jennifer-aniston-justin-theroux-split-marriage-reason-fights-neighbour/", "title": "Jennifer Aniston and Justin Theroux’s furious fights with New York neighbour and his bike being covered in sausage the ‘real reason for their split’, claim reports", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Jennifer Aniston and Justin Theroux's furious fights with New York neighbour and odd 'bologna incident' was the 'real reason for their split' claim reports", "url": "https://www.thesun.co.uk/tvandshowbiz/5594388/jennifer-aniston-justin-theroux-split-marriage-reason-fights-neighbour/", "description": "JENNIFER Aniston and Justin Theroux’s split was a long time coming with “rows with their neighbours” one of the main reasons for their break up. According to new reports, the coup…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/02/jh-jen-composite.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Justin, pictured in Los Angeles, kept finding excuses to return to the West Coast, according to Entertainment Tonight"}, "locale": "en_GB"}, "article": {"published_time": "2018-02-16T13:50:53+00:00", "modified_time": "2018-02-17T19:51:06+00:00", "publisher": 161385360554578, "tag": "Jennifer Aniston, Justin Theroux", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Jennifer Aniston and Justin Theroux yesterday announced they were divorcing after two years of marriage. According to new reports, the couple's break up was 'a long time coming' with rows about where to live one of the main reasons for their break up.", "twitter": {"text": {"title": "Jennifer Aniston and Justin Theroux’s furious fights with New York neighbour and his bike being covered in sausage the ‘real reason for their split’, claim reports"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "not friends", "headline": "How Justin's bike getting covered with sausage 'was behind his split with Jen'", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/02/jh-jen-composite.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/02/jh-jen-composite.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5594388, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1518789053.0, "source": "http://www.thesun.co.uk", "summary": ""}