{"url": "https://people.com/music/mac-miller-dead-ariana-grande-breaks-silence/", "text": "Image zoom David X Prutting/BFA/REX/Shutterstock\n\nAriana Grande is mourning the death of her late ex-boyfriend, Mac Miller.\n\nOne day after the 26-year-old rapper was pronounced dead from an apparent overdose, Grande, 25, shared a black-and-white photograph of her former boyfriend via Instagram on Saturday.\n\nGet push notifications with news, features and more.\n\nIn the picture, Miller stares up at the camera while sitting on the grass. A pair of tennis shoes, presumably Grande’s, can be seen between his legs.\n\nChoosing to let the image speak for itself, Grande shared the image without a caption.\n\nThe “God Is a Woman” singer disabled comments on the social media platform after some fans began to blame her for Miller’s death on Friday.\n\nRELATED: Mac Miller Dead at 26 of Apparent Overdose: ‘He Was a Bright Light in This World’ Says Family\n\nMiller, whose real name was Malcolm McCormick, was pronounced dead at 11:51 a.m. at his Studio City, California, home on Friday, the Los Angeles County Department of Medical Examiner-Coroner confirmed in a statement to PEOPLE.\n\nA cause of death is yet to be determined, but a source told PEOPLE that Miller had gone into cardiac arrest after appearing to suffer a drug overdose.\n\nImage zoom Mac Miller Jamie McCarthy/Getty\n\nRELATED: Ariana Grande’s Manager Remembers Mac Miller’s ‘Kind Heart’: ‘You Will Be Missed’\n\nMinutes before Grande broke her silence on Miller’s death, the rapper’s mother Karen Meyers also shared a photograph of her smiling son learning his head against her while they enjoyed a baseball game together.\n\nShe captioned the image with a broken-heart emoji.\n\nFollowing Miller’s death, his family released a statement thanking everybody for their “prayers.”\n\n“Malcolm McCormick, known and adored by fans as Mac Miller, has tragically passed away at the age of 26,” they said in a statement provided to PEOPLE. “He was a bright light in this world for his family, friends and fans. Thank you for your prayers. Please respect our privacy. There are no further details as to the cause of his death at this time.”\n\nThe rapper’s tragic death comes months after PEOPLE confirmed his split from Grande in May.\n\n“Ariana and Mac officially broke up right after Coachella weekend, but they ultimately struggled for a long time with their relationship, and it was basically over last year,” a source previously told PEOPLE.\n\nAfter online trolls blamed her for Miller’s untimely death on Friday, a source told PEOPLE that the rapper had moved on from their relationship.\n\n“It honestly seemed he was over the Ariana situation,” the source said, adding that Miller had said at one point, “I’ve matured and my ex hasn’t.”\n\nImage zoom Mac Miller and Ariana Grande David X Prutting/BFA/REX/Shutterstock\n\nRELATED: ‘One of My Best Friends’: Everything Mac Miller and Ariana Grande Said About Their Relationship\n\nGrande and Miller first went public with their relationship in September 2016 — three years after they collaborated on her hit single “The Way.”\n\nRELATED VIDEO: LISTEN: Mac Miller Was Working on Music Hours Before His Death\n\n“This is one of my best friends in the whole world and favorite people on the planet,” she wrote of Miller in an Instagram Story days after their breakup in May. “I respect and adore him endlessly and am grateful to have him in my life in any form, at all times regardless of how our relationship changes or what the universe holds for each of us!”\n\nShortly after their breakup, Grande began dating Pete Davidson, to whom she became engaged in June.\n\nImage zoom Jeff Kravitz/FilmMagic\n\nRELATED: Mac Miller Is ‘Happy’ for Ex Ariana Grande Following Her Engagement: ‘It’s All Positive Energy’\n\nIn July, Miller opened up about his past relationship with Grande during an interview with Zane Lowe on Beats 1 on Apple Music and explained that they had both moved on since their split.\n\n“I was in love with somebody. We were together for two years. We worked through good times, bad times, stress and everything else. And then it came to an end and we both moved on. And it’s that simple,” he said.\n\nMiller also went on to add that while some fans have assumed he’d “been on the Internet” following up on his ex’s every move after the news of her whirlwind romance with fiancé Davidson, that wasn’t the case.\n\nRELATED: Mac Miller Spent the Night Before He Died Watching Football with Friends, Source Reveals\n\nExplaining why he’d taken a step back from things, the rapper remarked that not only was he about to drop his new album, “It just all seemed kind of unimportant you know — the need to show people I was OK.”\n\n“It’s all positive energy,” he added. “I am happy for her and [the fact that she’s] moving forward with her life, just as I’m sure she is with me.”\n\n“It honestly seemed he was over the Ariana situation,” the source reveals, adding that Miller had said at one point, “I’ve matured and my ex hasn’t.”\n\nIf you or someone you know is in need of help, please contact the SAMHSA substance abuse helpline at 1-800-662-HELP.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F03%2Fmac-miller-31.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fmac-miller-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/music/mac-miller-dead-ariana-grande-breaks-silence/", "title": "Ariana Grande Breaks Her Silence After Ex Mac Miller's Tragic Death with a Touching Photo", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ariana Grande,Death,Mac Miller,Music News,News,Substance Abuse", "news_keywords": "Ariana Grande,Death,Mac Miller,Music News,News,Substance Abuse", "description": "The musicians first went public with their relationship in September 2016 and PEOPLE confirmed their split in May", "og": {"title": "Ariana Grande Breaks Her Silence After Ex Mac Miller's Tragic Death with a Touching Photo", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/mac-miller-dead-ariana-grande-breaks-silence/", "description": "Ariana Grande is mourning the death of her late ex-boyfriend, Mac Miller. One day after the 26-year-old rapper was pronounced dead&nbsp;from an apparent overdose, Grande,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/mac-miller-dead-ariana-grande-breaks-silence/", "description": "The musicians first went public with their relationship in September 2016 and PEOPLE confirmed their split in May", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/mac-miller-dead-ariana-grande-breaks-silence/", "title": "Ariana Grande Breaks Her Silence After Ex Mac Miller's Tragic Death with a Touching Photo", "description": "The musicians first went public with their relationship in September 2016 and PEOPLE confirmed their split in May", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmac-miller-71.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}