{"url": "https://movieweb.com/gal-gadot-wonder-woman-1984-childrens-hospital-visit/", "text": "Wonder Woman 1984 star Gal Gadot took a break from filming to make a surprise children's hospital visit. Gadot is currently working on the sequel to last year's wildly successful Wonder Woman around Virginia with director Patty Jenkins and co-star Chris Pine. Production on the sequel started at the beginning of last month and DC fans have spotted Gadot as well as her co-stars around town filming at a mall and some street fighting scenes too. To say that Gadot is busy would be a massive understatement.\n\nEven with her busy filming schedule for Wonder Woman 1984, Gal Gadot made time to surprise the staff and children at Inova's Children's Hospital in Falls Church, Virginia. Gadot showed up completely unannounced while wearing her full Wonder Woman costume. She sat down with patients to speak with them and answer any questions that they may have had about Themyscira or about Steve Trevor. The actress also posed for pictures with the children and the staff, all of whom were extremely happy about her visit.\n\nGet notified when your movie theaters open back up! We'll let you know when your local theaters open so that you can start enjoying the cinemas once again.\n\nGal Gadot and the rest of her pals in Justice League have all made it out to children's hospitals over the years, bringing joy to the kids and staff. Even the Marvel Cinematic Universe gets in on the fun. Tom Holland visited a hospital in costume while filming Spider-Man: Homecoming while Chris Evans and Chris Pratt often visit children's hospitals as well. It's cool to see the actors and actresses taking time out of their busy schedules to make some children very happy about getting to meet their favorite superheroes.\n\nAs previously noted, Gal Gadot is in Virginia filming Wonder Woman 1984. Even with all of the set pictures and videos that have leaked online, the plot is still very much a secret. DC fans are wondering how Chris Pines' Steve Trevor is alive and how Kristen Wiig's Cheetah will fit into the mix. It's impressive to see the ways that DC and Marvel are able to make their projects out in the open with such large crews over the span of months and not have anything leak about the storyline.\n\nWonder Woman 1984 will open in theaters on November 1st, 2019, which means that there's still a lot of time for Patty Jenkins to work on the sequel. It isn't clear at this time when production will wrap or whether or not filming will take place in other areas. It seems likely that the production on the sequel will finish up in the next few weeks, giving plenty of time to work on the post-production phase. For now, everything is taking place around the Virginia area. While we wait to get some more information about the highly secretive Wonder Woman 1984, you can check out some pictures of Gal Gadot at Inova's Children's Hospital with the staff as well as the children below, provided by Reddit.\n\nDear @GalGadot- Thank you SO MUCH for visiting my patients and colleagues at #InovaChildrensHospital! Next time, can you align your visit with my call schedule? Love, #SuperFanpic.twitter.com/kmE7CoFRvE — Patty Seo-Mayer (@PattySeoMayerMD) July 7, 2018", "images": ["https://cdn3.movieweb.com/i/article/VDt845IiCEfagsiAo25tuJDGs4a7vg/1200:100/Gal-Gadot-Wonder-Woman-1984-Childrens-Hospital-Visit.jpg", "https://cdn3.movieweb.com/i/author/xOPw7WWJQayBqpBi49Vki5rZ4ri0kb/60:70/Kevin-Burwick.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17091571&cv=2.0&cj=1", "https://certify.alexametrics.com/atrk.gif?account=4fQco1IWNa10zK"], "top_img": "https://cdn3.movieweb.com/i/article/VDt845IiCEfagsiAo25tuJDGs4a7vg/1200:100/Gal-Gadot-Wonder-Woman-1984-Childrens-Hospital-Visit.jpg", "keywords": [], "authors": ["Kevin Burwick", "Writer For Movieweb Since Enjoys Playing Catan When Not Writing About Superheroes", "Star Wars."], "canonical_link": "https://movieweb.com/gal-gadot-wonder-woman-1984-childrens-hospital-visit/", "title": "Gal Gadot Suits Up as Wonder Woman to Surprise a Children's Hospital", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Gal Gadot visited a children's hospital in Falls Church, Virginia in her full Wonder Woman 1984 costume.", "fb": {"app_id": 357878074202}, "robots": "max-image-preview:large", "og": {"title": "Gal Gadot Suits Up as ‘Wonder Woman’ to Surprise a Children's Hospital", "type": "article", "image": "https://cdn3.movieweb.com/i/article/VDt845IiCEfagsiAo25tuJDGs4a7vg/1200:100/Gal-Gadot-Wonder-Woman-1984-Childrens-Hospital-Visit.jpg", "url": "https://movieweb.com/gal-gadot-wonder-woman-1984-childrens-hospital-visit/", "description": "Gal Gadot visited a children's hospital in Falls Church, Virginia in her full ‘Wonder Woman 1984’ costume.", "site_name": "Movieweb"}, "article": {"published_time": "2018-07-08T12:21:22-07:00", "section": "Movie News"}, "twitter": {"card": "summary_large_image", "site": "@movieweb", "creator": "@PantherInCrime", "title": "Gal Gadot Suits Up as ‘Wonder Woman’ to Surprise a Children's Hospital", "description": "Gal Gadot visited a children's hospital in Falls Church, Virginia in her full Wonder Woman 1984 costume.", "image": {"identifier": "https://cdn3.movieweb.com/i/article/VDt845IiCEfagsiAo25tuJDGs4a7vg/1200:100/Gal-Gadot-Wonder-Woman-1984-Childrens-Hospital-Visit.jpg", "alt": "Gal Gadot Suits Up as Wonder Woman to Surprise a Children's Hospital"}, "url": "https://movieweb.com/gal-gadot-wonder-woman-1984-childrens-hospital-visit/"}}, "movies": [], "publish_date": 1531077682.0, "source": "https://movieweb.com", "summary": ""}