{"url": "www.hollywoodreporter.com/features/kardashian-decade-how-a-sex-tape-led-a-billion-dollar-brand-1029592", "text": "In 2007, an L.A. family's unvarnished docuseries launched on E!, and reality television, female body image, social media and, above all, the economy of celebrity were forever changed. Now the stars and producers of the megafranchise (nine TV spinoffs, hundreds of millions of dollars earned) reveal the secrets of its improbable explosion into the zeitgeist.\n\nWearing curve-hugging black workout pants and a white tank top, Kim Kardashian perches on a couch in the media room of her newly renovated Bel Air estate and sips Pedialyte through a straw. The makeup-free 36-year-old appears almost normal — certainly not like a mogul who, according to Forbes, banked $45.5 million the past year from a brand she built on self-­aggrandizement, shameless product peddling and nude selfies. At the epicenter of this unprecedented trajectory remains E!'s Keeping Up With the Kardashians, a living record of her happily debauched family — Kourtney, 38; Khloe, 33; Rob, 30; Kendall, 21; and Kylie, 20; as well as matriarch Kris, 61, and her ex Caitlyn Jenner, 67 (who in 2015 transitioned from Bruce). On Sept. 24, a 90-minute special will celebrate the series' 10th unapologetic year. It's a head-scratching milestone for a show that, at its conception, offered viewers little more than a voyeuristic lens into the lives of a celebrity-adjacent family — but quickly became the mother ship for all their product extensions and the platform through which Kris and her five daughters ushered in the era of the reality celebrity as a brand.\n\nKeeping Up With the Kardashians now airs in 167 countries, boasts nine spinoffs to date and has ranked as E! Entertainment's top-rated series since 2010. And while it peaked in 2011 with 10.5 million viewers over two nights for Kim's fairy-tale wedding to Kris Humphries (they divorced after 72 days), it still averages north of 2.1 million every Sunday in its 13th season. In 2015, E! agreed to a reported $80 million deal to keep the family through season 14. But that's a pittance compared to the fashion and lifestyle empire they've built from one boutique in the Valley. With a combined social media reach of 700 million-plus followers and five insanely profitable apps, the family mints millions from a hodgepodge of endorsement deals, paid appearances and can't-stay-in-stock products. And it all grew from a show that opened its pilot with these prophetic words from Kim (already notorious for the sex tape she made with her ex, Ray J, that was made public in 2007): \"I hate you all.\"\n\nAs much as the family reveals on the show, on red carpets and on Instagram, one mystery remains. How the hell did this happen?\n\nKris Jenner (star, executive producer) Before the show, I was managing Bruce's speaking career and personal appearances.\n\nKim Kardashian (star, executive producer) I was going to [Pierce College], and after school I would go work the cash register at our store, Dash. This all happened when I was 27 …\n\nKendall Jenner (star) That's so crazy because I'm not even 27. We've lived the same amount of time of the same thing, but I'm not even the age you were when you started.\n\nRyan Seacrest (executive producer) Everyone was talking about The Osbournes, and I said to my development executive Eliot [Goldberg], \"Let's try to find something in this world and take it to E!\"\n\nKris One night, Deena Katz [casting director for Dancing With the Stars] came over for dinner and life was swirling around, and she said, \"This is a reality show — I think you should really talk to Ryan Seacrest.\" So I did.\n\nSeacrest Kris told me what she envisioned, and I said, \"Let's send a crew to your house and tape some stuff and then we'll take a look at it.\" Then I realized I didn't have a crew; I didn't even have a camera. I had Eliot buy a camera, and he went and shot them. He called me after and said, \"I think we have something special.\"\n\nKourtney Kardashian (star, executive producer) We had talked to producers about doing a show about the three of us running the store, Dash, where Khloe and I would do the day-to-day, and Kim would come in as a stylist. It didn't go anywhere.\n\n•••\n\nIn Caitlyn Jenner's memoir, The Secrets of My Life, released earlier this year, she implies that the series may actually have been her brainchild. She writes, \"The house is awash in puberty and adolescence and young adulthood and two parents with very different styles. It seems to me something is there for television. … Kris says she is the one who came up with the idea …\" Jenner declined to participate in this story.\n\nKris It's so absurd. I'm not sure what the motivation was for her to say something like that. Maybe somebody should remind her that it's called Keeping Up With the Kardashians.\n\nTed Harbert (then-CEO of E! Networks) Just like anybody else, I knew of the family through [O.J. Simpson attorney] Robert Kardashian. There was a bit of the stuff with Kim hanging around Paris Hilton and, of course, the fun with Ray J [who made a sex tape with Kim]. That was sort of world news.\n\nDamla Dogan (senior vp development & programming, E!) They were just crossing over into pop culture territory, especially Kim. She had a look that wasn't on TV at the time. She wasn't stick thin, and that was relatable.\n\nSeacrest We pitched it to E!, and initially they passed. I called Ted and said, \"This is a special show, and I want you to know we brought it to you [first].\" I was going to take it to Bravo.\n\nHarbert Ryan asked me to take a look at this tape of them at the dinner table. There was conflict, sniping and resolution. I call it, \"Fight, fight, fight. Love, love love.\" I came in the next day and said I wanted to do it.\n\nSeacrest I was overseas and got a phone call from E!. \"We're picking it up and going right into production.\" And I said, \"Well, we just bought a camera.\" (Laughs.) They suggested Bunim/Murray to be our partners.\n\nGil Goldschein (CEO and chairman, Bunim/Murray Productions) Within 24 to 36 hours, I did a deal with E!, and we were in preproduction early the following week.\n\nJeff Jenkins (co-president of entertainment & development, Bunim/Murray) During our first meeting, Kris said, \"How can we make this successful?\" And I said, \"Share everything.\" In other documentary series, you're following a football star or a rock star; in this case, sharing is the career.\n\nSeacrest I remember Kris saying, \"In order for this to work, yes, there's a glitz and glamour, but there's got to be honesty and vulnerability. We need to make a pact that the show won't just be pretty pictures. As time goes by, you see some of the most vulnerable moments. There was a deliberate intent to be vulnerable and capture that from the beginning.\n\nKris I sat everyone down and said, \"If we're going to do this, we have to be all in. We have to really be who we are.\"\n\nKendall I was like, \"Whatever. What am I having for lunch tomorrow?\" She didn't make it seem like it was going to last this long.\n\nKim I don't think any of us thought it would.\n\nKris The only person I got any resistance from was Kourtney. She was sort of skeptical.\n\nKourtney I remember in season one being like, \"I have to go the bathroom,\" and I'd cry in there as quietly as I could because I was still mic'd. I never want to cry in front of cameras.\n\nKhloe Kardashian (star, executive producer) I don't think we knew what we were even saying yes to. Everything was just super-fast. Kim and my mom were steering the ship. We were just like, \"Tell us where to be and we'll be there.\"\n\nDogan We were up against an airdate and didn't have a title we loved. There were a few contenders: The Kardashians: Krazy With a K.\n\nFarnaz Farjam (current programming vp, Bunim/Murray) Living Kardashian, Krazy Kardashians …\n\nDogan But none that we loved. We were having our big launch meeting where we invite the producers to come in and tell our internal departments about the show, so everyone can get on the same page.\n\nFarjam We all had been tasked with coming to the meeting with some title ideas and when it was my turn I had to confess I didn't have a list. I made a factual statement that I was \"too busy keeping up with the Kardashians.\"\n\nDolgan Instantly, we knew that was our title.\n\nFarjam I came up with it on accident because I was living it.\n\nHarbert Internally, everybody had an opinion [about the show before it launched]. It was, who are these people and why do they get a TV show? Ad sales departments don't tend to jump up and down about shows that feature people that have been in sex tapes. They're usually going to worry about advertiser resistance, but I don't remember there being much.\n\nKris From the network's point of view it was a big success.\n\nHarbert Sisters who wax each other will tend to strike a chord. I'm a big believer in TV that surprises people, and boy, did that surprise me. I was shocked at how they would speak to their mother and, who was then, Bruce.\n\nKris The watercooler chatter from the first episode was all about [9-year-old] Kylie jumping on a stripper pole. Kim had one installed in my bedroom and our friend Robin Anton, who is the founder of The Pussycat Dolls, was just messing around, and Kylie hops up there, twirls around a couple times, and it became this thing.\n\nSeacrest Some people were up in arms; some people thought it was funny.\n\nKris When I look back on that, I belly laugh. I have a very dry sense of humor. You either think I'm hilarious or you think I'm a bitch.\n\nSeacrest It was in that moment we realized what this show could be. At its foundation, it was an aspirational, Hollywood reality version of The Brady Bunch. They were unvarnished, and that honesty and irreverence resonated.\n\nBrian Dow (former agent for the Kardashians) There was a lot of authenticity. If you look at the rest of the marketplace at the time, other reality stars were showing you their \"character\" and were more guarded.\n\nKhloe In those days, our first and second season especially, no one knew who we were. We were allowed to leave the gates to film and not have it be a distraction. No one bothered us.\n\nKim When we would travel, I remember people calling mine, Kourtney, and Khloe's names and we thought they knew us from high school or something. We just didn't get it. Then they started chasing us down at the airport. That was the first time that we were like, \"Oh my God.\"\n\nKhloe In Armenia, I've never seen so many people. I got separated from Kim and everyone, and they all got in the van and left. I was like, \"Hello? I'm still in the fucking crowd of people!\" Everyone forgot about me and Erin Paxton, our audio mixer, took her boom and literally fished me back into our producer's van.\n\nKendall Kylie and I did a magazine signing for Seventeen, and it was at some store at The Grove and we had a crazy line around the corner. The store owner came up to us and said, \"Justin Bieber was here a week ago and didn't get this response.\"\n\nDow They were flooding the marketplace with good photo content. There's a method to the madness, and when you don't know the method it just looks like madness.\n\nKris It just got really crazy, really fast. They engaged in conversation with an audience that through proper television had been completely ignored.\n\n•••\n\nBefore filming wrapped on season one, E! re-upped the series for a second turn, just as social media platforms were starting to take hold.\n\nKris There was barely Twitter when we started. Ryan called Kim and said, \"There's this thing called Twitter you might want to pay attention to.\" The girls [began] embracing their audience and sharing their lives.\n\nSeacrest There were conversations where we said, \"Is this OK that posts are happening today and the show airs five months later?\" We didn't know if it was good or bad. We ended up determining that it was fueling the narrative and people will want to see what really happened.\n\nDow Kim sort of paved the way for the economic structure of native influencer marketing. Before the rise of the common man YouTuber in their bedroom, you had people like her. She was the one who kicked down the door and got the brands to spend money in that area because she showed success. Brands noticed that when when you would pay a celebrity to send out a branded tweet, they were getting more click-throughs for the dollar, so it made more monetary sense. That's why that revolution started.\n\nHarbert At the beginning, I tried very hard to get a piece [of the earnings] because the policy was, if you become famous on our backs and get other businesses, we get a piece. Kris, given her great negotiating abilities, said, \"We were already kind of famous.\" I remember those stare-downs, but I lost that fight. You know who I've got 10 percent of? Dr. 90210. That had to be at least $300 or $400 that I made off of that. Almost the same. (Laughs.)\n\nKhloe It's totally a blessing to have the show to put you in that spotlight where you could let people see the brand that you're trying to create. At first, you are bright-eyed and people want to pay you to do the craziest things. Me and my sisters have all done it, but we've learned from those mistakes. I think viewers could see through when things are unauthentic, even with a social media platform. People need to really aware of their authenticity and doing thing out of passion not just to make a dollar. I will say there has been a learning curve.\n\nDow When Kim did the cover of CR [in 2013], that's when she was anointed. It's Carine Roitfeld's magazine, Karl Lagerfeld shot it and Riccardo Tisci art-directed. Fashion washes away all sins. That's when she went next-level.\n\nHarbert Kris deserves the credit for turning it into an empire. Doing the show is a pain in the neck for them, but that TV presence provides the basis for many other products. When somebody leaves the limelight a network provides, it goes away. God bless her, Paris Hilton is a fantastic DJ in Ibiza.\n\n•••\n\nE! launched the first of nine spinoffs in 2009. That same year, Khloe married NBA star Lamar Odom in an episode that brought record ratings for the network (3.2 million viewers). In 2011, the couple debuted Khloe & Lamar.\n\nHarbert Sometime during the first season, I said, \"There are other shows in this family.\" Being able to get that many franchises from one family is sort of a schedule saver.\n\nSeacrest We had a successful mother ship and we thought, \"Let's try a spinoff.\" They were opening a Dash store in Miami, so that gave us a premise [Kourtney & Kim Take Miami]. I got a call from Jeff Shell, who was under Steve Burke at Comcast, which owned E! before the NBC merger. He said, \"Should we be investing in spinoffs?\" I told him, \"I'll take the risk.\"\n\nHarbert A couple of years in, I said, \"Wait until Kylie and Kendall are 18 years old, then there's a whole new generation of shows that can supply the schedule for years.\" [Life of Kylie premiered Aug. 6 to solid ratings.]\n\nKylie Jenner (star) I feel like I've been hiding myself and my personal life for a really long time, so I thought it was time to do this show and hopefully be a little more understood.\n\nKhloe I never wanted to do Khloe & Lamar [which ran for two seasons in 2011 and 2012]; my ex-husband did. He sold it to E!, and I let it happen because I wanted him to be happy. I was the one who canceled it. It was way too much. [Odom was hospitalized in 2015 after being found unconscious at a Nevada brothel. The couple divorced in 2016.]\n\nJenkins We deferred to Khloe on what she was comfortable with, because someone's life was hanging in the balance and that someone is a hero to a lot of young people. It wasn't necessary to go stick a camera in Lamar's face while he's on death's door in the hospital. It's just too much, so I guess, in a way, there is a line.\n\n•••\n\nIn August 2011, Kim married NBA player Kris Humphries. The E! special of the $6 million wedding earned the network its highest ratings to date and more than $10 million in ad revenue.\n\nKim There was all this attention on the wedding, and I thought maybe it was just the pressure of the show giving me this anxiety. My friends told me I just had cold feet, but even the producers said, \"You don't seem happy. You don't have to go through with this.\" The night before, my mom pulled me aside, off camera, and was like, \"This isn't it for you. Why don't you go away and I'll handle it?\" I felt like, if I pulled out now, everyone's going to think I just did it for the show. Then afterwards, people were saying, \"You have to stay married for a year,\" but I physically couldn't do it. When I made the decision [to divorce], everyone said it was made up for the show. Everyone really wanted to take me down.\n\nKris People write and say the nastiest things and they've never met you. They have miserable lives, they have no direction, and probably no job. I mean for anybody to sit and be on the internet all day long. It always shocks me when I see such stupidity and really toxic energy.\n\nSeacrest I remember when Kim called me after the wedding. It was just a few days after, and she just didn't feel like it was right. She was very candid and open.\n\nKim Think about this realistically: If it was for the show don't you think we would have found someone that signed off? Someone OK with getting married and getting divorced two months later? If it's for a show don't you think you'd want as little legal trouble as possible? This was real emotions, real feelings. People fuck up.\n\nKendall The beauty of having older sisters is you learn so many lessons from them. I've seen how their relationships have played out on TV so I learned that lesson. I I feel like it's just better to keep it more private.\n\nKourtney The hardest episode to film was my break-up with Scott [Disick]. I had a lot of anxiety about it, and finally said let's just get this over with. I sat down and started crying. You go through something, and then you move past it. Then you do your interview, and get all riled up again. And then you see the episode, and start seeing all these comments [on social media].\n\nKylie When you involve the whole world, everyone has an opinion. It's not the healthiest. That part of your life should remain sacred.\n\nKim It's kind of hard not to at least reference [your relationship]. [Current husband] Kanye [West] was like, \"I'm not a part of the show. That's not what I do. I have my own career and life.\" He'll really surprise you though. He'll be like, \"I'm not filming\" and then randomly show up. But I will get [the footage] and show him. He knew I would love to have my engagement on camera so he filmed it and he said, \"The look might be a little different because I need these type of cameras,\" and got music clearance. But I won't really ever talk about something that's going on with Kanye. I'll talk about how I feel. He knows that I'm really protective of him.\n\nAdam Stotsky (president, E!) Kanye has been gracious enough to be on the show quite a bit. If he had a story that he wanted to tell through the lens of E!, we would be very open to hearing it, that's for sure.\n\nKris Kanye does not have time or have any desire that I know of to do a show like that.\n\nKim We had no intention of showing our wedding on the show. It was shot with only iPhones and my assistant on a handycam. She was literally standing on top of a castle and freezing, because we knew we wanted to capture this gorgeous walk from up above. People were yelling at her like, \"You can't film up there!\" But then we loved the footage so much, [we used some of it on the show].\n\n•••\n\nIn 2014, Kris and Bruce Jenner finalized their divorce. The next year, Bruce announced in an interview with Diane Sawyer that he would begin living as a woman and signed on for E! series I Am Cait. In April 2017, Caitlyn released a memoir revealing details of her marriage to Kris.\n\nJenkins I was shooting with Kris during the last conversation she ever had with Bruce. I'm pointing a camera at her while she is having her heart ripped out. Those are not fun days, but those episodes have touched our culture.\n\nKim The most difficult thing [to film] was probably Caitlyn's transition and just seeing my mom and Khloe having such a hard time. We never really edited content before, but we did edit a bit of Khloe's reaction just because she was so upset.\n\nKhloe If I act a certain way, I act a certain way, but I just knew in my head this needed to be a four-hour episode. This is so real, and I want to ask every question I have, but also I want honest answers.\n\nKylie At the time, I didn't think, \"Oh, this is going to make pop culture history.\" I had different things on my mind, because this was my reality, and this is my dad.\n\nStotsky Caitlyn shared an incredible amount of personal history with us before we had even agreed to shoot it. [As an executive], you think about, \"What kind of story do we think we can tell, and given the sensitivity of the matter, do we have the wherewithal to handle it appropriately and not be exploitative?\" And then the last thing you think about is, \"Is it going to be a hit?\" We felt and Caitlyn felt that she had told the story that she wanted to tell in front of the cameras through two cycles and 20 hours [of I Am Cait]. There was a beginning, middle and end. Caitlyn is still a part of Keeping Up With the Kardashians. She is a part of Kylie's life and you will see her in Life of Kylie. Once a Kardashian always a Kardashian.\n\n•••\n\nIn October 2016, Kim was robbed at gunpoint in Paris after burglars got her location via Snapchat and made off with $10 million in jewelry.\n\nKris Every time I tried to watch the episode when Kim shares her experience getting robbed in Paris, I couldn't even get through it to give my notes. I was crying so hard. I would watch it and then cry, cry, cry and then start over. It was very difficult for me to watch my daughter in that kind of pain.\n\nKim I was OK to show my struggles, because there was no way that I was going to allow it to damage me and make me a different person for my kids. I wasn't going to allow it to debilitate me from being be the mom that I need to be.\n\nKendall Your situation was a scare for all of us.\n\nKim It really changed our lives. This extra layer of security needed to happen. On social media, I'll never post something where I'm at home unless I know there's four to six security. We know when we're filming it doesn't air until months later, so we can share that and be free and always be who we are.\n\nKris It always occurs to me maybe this should be left out. Maybe this is too much. Every time I catch myself and I say no, this is what everyone who's watched since day one deserves to see for one reason or another. We signed up for this.\n\nKim Everyone was calling for a sit-down interview and I was like why would I do an interview about something I was just traumatized from? But I felt really comfortable to tell my story on my show, because it wasn't going to get twisted. I needed time off, but I was going to talk about it. I'm very aware of what fans want to see. I think if you ask the crew, I probably produce the most, because I know what my sisters might not be sharing. So I'll tell them, \"Go over to Kourt's house right now. Something is going on.\"\n\nKendall I'm the most private one. If there's a moment I don't want anyone to hear, I talk to myself or talk to someone in another room.\n\nKim We're not perfect, but you see these things in the media, like Kendall and [her Pepsi ad that was accused of trivializing Black Lives Matter], where I see her at home crying, but in the media she looks another way because she's not addressing it. I'm just like, \"This is wrong. You need to speak up.\" She was like, \"I don't ever want to show that footage of me crying.\" She was trying to not make excuses or be dramatic, but that was what she was going through at the time.\n\nKris There are moments when it's hard to leave something in because it's vulnerable and it exposes us to a deeper level of emotion, and sometimes that's hard to share.\n\nJenkins There are days when there might be 30 crew people at a location to cover an event and there are days where there may be one person with an iPhone covering something incredibly intimate.\n\nKendall We have such a personal relationship with the crew. When one of us cries on the show usually you'll look around and the camera guy is crying and the producer is crying.\n\nKim It really is an intimate relationship. These people see every last thing.\n\nKris I mean, believe me, I'm not going to lie, there's been times when I've walked away from the camera and I've got a big bump in my hair and I'm like \"Take that out, my hair looks like shit.\" I'm too vain to leave really ugly, ugly angles in.\n\nKim I definitely wish I didn't film so much pregnant. I looked like such a cow and I can't stand to see those episodes. I would say, \"Try to film me more from chest up, so it looks better,\" but I look like a blob. I would have rather seen my belly and shot farther away. [On the possibility of a third child with Kanye, reportedly via surrogate] I hope so. There have been a lot of things said and Kanye and I have not confirmed anything. We're definitely trying. We are hoping so.\n\nDow The reason the show has this shelf life is that at its core it's about family and everyone can relate to it on some level. It has this ongoing ability to allow people to relate even if they don't live a life that's anywhere similar they can find connections to the material. The girls are incredibly hard workers and they had the ability to evolve so they didn't just get stuck. They constantly reinvented themselves with an upward trajectory.\n\nKhloe I know people think, \"You guys just film and eat your salads and drink iced tea all day.\" I think if someone tried to spend a week with us and did what we do — I'm not complaining about what we do at all, but it's a job.\n\nSeacrest This family has been through things in their life that have introduced understanding and acceptance to people. Everything from interracial relationships to addiction to the Bruce-to-Caitlyn transition. There will always be a story; as they're committed to doing it, the show can go on.\n\nHarbert You can have whatever opinion you want about the Kardashians, but they deliver a true family drama. When people ask me what [shows] I've been involved in, I love to mention Kardashians. I'll get that \"really?\" look, and I just look them in the eye and say, \"The job is to put on hits, and this is a hit. So, sorry.\" You can decide if you're not a fan of the way they speak or the language they use, but as far as I can tell, the republic is still standing, and we've got bigger problems than the Kardashians.\n\nStotsky It's unfortunate people won't give them the credit they're due. If you take a step back and assess what they've built, it's extra­ordinary, and it didn't happen by accident.\n\nKris When we first started, I jokingly said, \"We'll be on season 32, Kylie gets married.\" I was kidding, and here we are, and it's season 14, so be careful what you wish for.\n\nAdditional reporting by Lacey Rose.\n\nA version of this story first appeared in the Aug. 16 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/08/the_kardashian_family_-_photographed_by_miller_mobley_-_splash_2_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/08/the_kardashian_family_-_photographed_by_miller_mobley_-_splash_2_2017.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/08/the_kardashian_family_-_photographed_by_miller_mobley_-_splash_2_2017.jpg", "keywords": [], "authors": ["Leslie Bruce"], "canonical_link": "https://www.hollywoodreporter.com/features/kardashian-decade-how-a-sex-tape-led-a-billion-dollar-brand-1029592", "title": "The Kardashian Decade: How a Sex Tape Led to a Billion-Dollar Brand", "meta_data": {"viewport": "width=device-width", "description": "In 2007, an L.A. family's unvarnished docuseries launched on E!, and reality television, female body image, social media and, above all, the economy of celebrity were forever changed. Now the stars and producers of the megafranchise (nine TV spinoffs, hundreds of millions of dollars earned) reveal the secrets of its improbable explosion into the zeitgeist.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/kardashian-decade-how-a-sex-tape-led-a-billion-dollar-brand-1029592", "domain": "https://www.hollywoodreporter.com/", "title": "The Kardashian Decade: How a Sex Tape Led to a Billion-Dollar Brand", "description": "In 2007, an L.A. family's unvarnished docuseries launched on E!, and reality television, female body image, social media and, above all, the economy of celebrity were forever changed. Now the stars and producers of the megafranchise (nine TV spinoffs, hundreds of millions of dollars earned) reveal the secrets of its improbable explosion into the zeitgeist.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/08/the_kardashian_family_-_photographed_by_miller_mobley_-_splash_2_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "The Kardashian Decade: How a Sex Tape Led to a Billion-Dollar Brand", "description": "In 2007, an L.A. family's unvarnished docuseries launched on E!, and reality television, female body image, social media and, above all, the economy of celebrity were forever changed. Now the stars and producers of the megafranchise (nine TV spinoffs, hundreds of millions of dollars earned) reveal the secrets of its improbable explosion into the zeitgeist.", "url": "https://www.hollywoodreporter.com/features/kardashian-decade-how-a-sex-tape-led-a-billion-dollar-brand-1029592", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/08/the_kardashian_family_-_photographed_by_miller_mobley_-_splash_2_2017.jpg", "width": 1500, "height": 844, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "The Kardashian Decade: How a Sex Tape Led to a Billion-Dollar Brand", "sailthru.description": "In 2007, an L.A. family's unvarnished docuseries launched on E!, and reality television, female body image, social media and, above all, the economy of celebrity were forever changed. Now the stars and producers of the megafranchise (nine TV spinoffs, hundreds of millions of dollars earned) reveal the secrets of its improbable explosion into the zeitgeist.", "sailthru.author": "Leslie Bruce", "sailthru.vertical": "Television", "sailthru.date": "2017-08-16 06:00:00", "sailthru.tags": "Television,Culture,Khloe Kardashian,Kim Kardashian,Kris Jenner,Kylie Jenner,Ryan Seacrest,Keeping Up With the Kardashians"}, "movies": [], "publish_date": 1502834400.0, "source": "http://www.hollywoodreporter.com", "summary": ""}