{"url": "https://www.smh.com.au/entertainment/movies/how-a-dance-dream-team-turned-jennifer-lawrence-into-a-ballerina-for-red-sparrow-20180228-h0wr91.html", "text": "Jennifer Lawrence in the ballet scene from Red Sparrow. Red Sparrow may not be a dance movie, but ballet – its single-mindedness – permeates it. In this dark spy thriller, directed by Francis Lawrence and based on the 2013 novel of the same name by Jason Matthews, Jennifer Lawrence plays Dominika Egorova, a Russian ballerina who has to retire from the stage – and here comes a spoiler, which is easier to read about than to watch – after her partner leaps into the air and crashes onto her leg. It's a career-ender. Forced to become a spy whose specialty is the art of seduction, Dominika finds that her ballet past helps. She has discipline, athleticism, ambition. She knows how to act. For Francis Lawrence, who is not related to Jennifer Lawrence but has directed her in three Hunger Games films, having his star engage in intense ballet training wasn't only about dancing. It helped to define her character. The opening scene showcases Peck's ballet, performed by members of the Hungarian National Ballet and inspired by The Firebird. (The dance scenes were shot at the Hungarian State Opera House in Budapest.) Instead of using Stravinsky's timeless music, it is set to an original score by James Newton Howard. \"Justin was the creative collaborator, and Kurt was the one who took on the physical aspects of really working with Jen,\" Francis Lawrence said. (Jennifer Lawrence also worked with Russian ballet coach Olga Kostritzky.)\n\nForced to become a spy whose specialty is the art of seduction, Dominika finds that her ballet past helps. Credit:Murray Close Froman is \"the ballet-boot-camp guy, and in a great way,\" Francis Lawrence said. \"He knows how to teach ballet to lay people, to ease them in as best as possible.\" And he knows their limits, Lawrence added. \"He was the one who told me: 'Jen will never get up on pointe. It's too dangerous.'\" Jennifer Lawrence has danced before on film, memorably in a duet with Bradley Cooper in Silver Linings Playbook. But while it was a delight, the number, despite a couple of harrowing lifts, had little in common with ballet. Jennifer Lawrence plays Dominika Egorova, a Russian ballerina who has to retire from the stage. Credit:MURRAY CLOSE Though only Lawrence's upper body is what is shown in the Red Sparrow sequence, she learned all the choreography, which, Froman said, was not created with a beginner in mind. She had to hit the rise and fall of the movement, essentially matching Boylston - if not in quality than in dynamics and with the correct paulement, or placement of the shoulders.\n\nFor three and a half months, Froman worked with Lawrence – mainly in her garage in Los Angeles – for four hours a day, five days a week. They started with stretching and working with discs to help Lawrence grasp turnout, or the opening of the legs from the hips. \"I wanted her to understand what muscle groups were involved, and how most people walking on the street are internally rotated with their shoulders – their palms are facing back,\" Froman said. \"With ballet dancers, you have to spin that back so it looks more like their arms are an extension of their back, and that whole alignment lengthens your neck. It widens your shoulder line.\" Froman made her hold a ball to bring awareness to her arm. \"When there's weight in it and when you're activating those fingers, it's different than just having your arm as a prop or lifeless,\" he said. \"By the time we started working on choreography, she had beautiful hands and a really nice neck and shoulders.\" And he didn't make the exercises easy. \"Even for an actor, they have to understand this world,\" he said. \"It's almost like a religion. Every day there's a checklist going through your head: Where's my centre of gravity? Are my ribs closed?\" During the filming, Froman stood behind the camera facing Lawrence instead of using a microphone as he talked her through the movement. \"I wanted it to be just between the two of us,\" he said. \"Immediately, she performed exactly the quality of work that we had rehearsed. It didn't all go out the window because of nerves.\"\n\nIn the end, the ballet sequence relies on visual effects, with a combination of shots featuring Lawrence and Boylston. Polunin, who plays Dominika's dance partner, said Lawrence possessed \"a ballerina's energy\". \"It's different than what a normal person has,\" he said. \"There's a tight feeling inside. It's the muscle compression and wanting to be perfect. She had that.\" After Sarah Lane, then a Ballet Theater soloist, performed as Portman's dance double in Black Swan, a controversy erupted; Lane didn't feel she was getting the credit she deserved and went public. Why would Boylston, a ballerina at the top of her game, want to be a dance double? She wanted to work with Peck, she said, adding, \"Any opportunity to help bring ballet to a larger audience is something to be capitalised on.\" Francis Lawrence said he never wanted to hide that they were using a double, \"and stand around in interviews going, 'No, no, no – Jen did all the training herself.'\" Froman realised that dancing next to Boylston could make just about anyone feel vulnerable. Jennifer Lawrence \"trusted the fact that I would tell her something didn't look good or not,\" Froman said.\n\n\"I'm at my happiest working with a dancer or an actor – I want it to feel participatory, I want it to feel collaborative, and I want to hear their ideas,\" he said. \"I'm in this line of work to give it away and to empower. I had to be there for Jen.\" The New York Times", "images": ["https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1", "https://static.ffx.io/images/$zoom_1%2C$multiply_0.2976%2C$ratio_1.777778%2C$width_1260%2C$x_2%2C$y_10/t_crop_custom/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1", "https://static.ffx.io/images/$zoom_1%2C$multiply_0.378%2C$ratio_1.777778%2C$width_992%2C$x_0%2C$y_10/t_crop_custom/q_86%2Cf_auto/0196cc7461d90c1a8adfa9c9e9f92b690a0d4e0c", "https://static.ffx.io/images/$zoom_1%2C$multiply_0.1875%2C$ratio_1.777778%2C$width_2000%2C$x_0%2C$y_36/t_crop_custom/q_86%2Cf_auto/b0576224468a73773790576b1486a47561f1da60"], "top_img": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1", "keywords": [], "authors": ["Gia Kourlas"], "canonical_link": "https://www.smh.com.au/entertainment/movies/how-a-dance-dream-team-turned-jennifer-lawrence-into-a-ballerina-for-red-sparrow-20180228-h0wr91.html", "title": "How a dance dream team turned Jennifer Lawrence into a ballerina for Red Sparrow", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "theme-color": "#0A1633", "title": "How a dance dream team turned Jennifer Lawrence into a ballerina for Red Sparrow", "description": "Red Sparrow may not be a dance movie, but ballet – its single-mindedness – permeates it.", "keywords": "Red Sparrow, Jennifer Lawrence, ballet, film", "article": {"section": "Movies", "published_time": "2018-02-28T03:40:44+00:00", "modified_time": "2018-03-01T23:40:40+00:00"}, "pubdate": "2018-02-28T03:40:44+00:00", "author": "Gia Kourlas", "fb": {"app_id": 193677504039845, "pages": 1432569230378131}, "og": {"description": "Red Sparrow may not be a dance movie, but ballet – its single-mindedness – permeates it.", "image": {"identifier": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1", "width": 800, "height": 450, "secure_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1"}, "locale": "en_US", "site_name": "The Sydney Morning Herald", "title": "How a dance dream team turned Jennifer Lawrence into a ballerina for Red Sparrow", "url": "https://www.smh.com.au/entertainment/movies/how-a-dance-dream-team-turned-jennifer-lawrence-into-a-ballerina-for-red-sparrow-20180228-h0wr91.html"}, "parsely-title": "How a dance dream team turned Jennifer Lawrence into a ballerina for Red Sparrow", "parsely-link": "https://www.smh.com.au/entertainment/movies/how-a-dance-dream-team-turned-jennifer-lawrence-into-a-ballerina-for-red-sparrow-20180228-h0wr91.html", "parsely-type": "NewsArticle", "parsely-image-url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1", "parsely-section": "Movies", "parsely-author": "Gia Kourlas", "parsely-pub-date": "2018-02-28T03:40:44+00:00", "parsely-metadata": "{\"type\":\"article\",\"assetId\":\"h0wr91\"}", "parsely-network-canonical": "https://www.smh.com.au/entertainment/movies/how-a-dance-dream-team-turned-jennifer-lawrence-into-a-ballerina-for-red-sparrow-20180228-h0wr91.html", "robots": "noarchive,noodp,index", "twitter": {"card": "summary_large_image", "description": "Red Sparrow may not be a dance movie, but ballet – its single-mindedness – permeates it.", "image": {"src": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/1a94ce799f53523c3bd56bea80f74cdaeec945d1"}, "site": "@smh", "title": "How a dance dream team turned Jennifer Lawrence into a ballerina for Red Sparrow"}, "google-signin-client_id": "589384154045-p5vk6p2adh6l4p13n8rfjtbsfqu8gbn5.apps.googleusercontent.com"}, "movies": [], "publish_date": 1519747200.0, "source": "https://www.smh.com.au", "summary": ""}