{"url": "https://www.vulture.com/2018/05/david-cross-unequivocally-apologizes-to-jessica-walter.html", "text": "David Cross. Photo: Cindy Ord/Getty Images for SiriusXM\n\nIn a new interview with Gothamist, David Cross addressed comments made in a piece published yesterday by the New York Times in which Jessica Walter was brought to tears while discussing an instance of her being berated on the set of Arrested Development by Jeffrey Tambor. Cross apparently logged off of Twitter shortly after the Times interview went live, and had not yet seen the apologies issued by his co-stars Jason Bateman and Tony Hale who, along with Will Arnett, essentially gaslighted Walter by minimizing the effect Tambor’s behavior had on her during the conflict, even as she emphasized that she had never been treated so poorly by someone in her 60-year career.\n\nFor coming to Tambor’s defense (he told the Times that the actor has “learned from the experience and he’s listening and learning and growing,” adding “That’s important to remember”) instead of empathizing with the actively weeping Walter, Cross told Gothamist, “I will unequivocally apologize to Jessica. I’m sorry that we behaved the way we behaved. Whatever the criticisms are, I will own up. I don’t even know what they are, as I said, I saw the initial thing but I jumped off [of Twitter] at the behest of various people.” He also said that, “I think we kind of got what we deserved,” because they never addressed Tambor’s blow-up as a group prior to this press tour.\n\nCross said too that he has been having conversations about the backlash with his wife, Amber Tamblyn, as well as his co-star, Alia Shawkat, who was the only Arrested cast member to call Tambor’s behavior toward Walter unacceptable without qualification in the Times conversation. “I agreed with Alia that there was no excuse. There’s never an excuse ever for yelling at somebody and humiliating them in front of other people,” said Cross, who explained that he once saw Walter treat another performer on set poorly, but that her outburst did not approach the severity of Tambor’s. “There was no excuse when Jessica did it. To Jessica’s credit, she eventually apologized to the actress, and felt bad about it. Jeffrey did as well, but it was a bigger deal, there were more people in the room and it was an extremely uncomfortable moment.”\n\nIn the Times conversation, Bateman pressed the point that the unique demands of acting can result in strange behavior when an actor is working through their “process,” but Cross stressed multiple times to Gothamist that Tambor’s treatment of Walter was “egregious and there was a little bit of cruelty to it, which I have a real issue with,” and added, “I’m not going to defend what Jeffrey did at all, because I would never do that. I’ve never seen anybody do that to that level and that’s just not right. There’s just no excuse for behaving like that.”", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/05/24/24-david-cross.w330.h330.jpg", "https://pyxis.nymag.com/v1/imgs/8fd/b49/a957de191f17e7791e5db0c02a1f517118-24-david-cross.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/8fd/b49/a957de191f17e7791e5db0c02a1f517118-24-david-cross.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Jordan Crucchiola"], "canonical_link": "https://www.vulture.com/2018/05/david-cross-unequivocally-apologizes-to-jessica-walter.html", "title": "David Cross ‘Unequivocally’ Apologizes to Jessica Walter", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "David Cross Says He Will ‘Unequivocally Apologize’ to Jessica Walter", "url": "https://www.vulture.com/2018/05/david-cross-unequivocally-apologizes-to-jessica-walter.html", "description": "“I’m sorry that we behaved the way we behaved.”", "image": "https://pyxis.nymag.com/v1/imgs/8fd/b49/a957de191f17e7791e5db0c02a1f517118-24-david-cross.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "David Cross ‘Unequivocally’ Apologizes to Jessica Walter", "description": "“I’m sorry that we behaved the way we behaved.”", "image": "https://pyxis.nymag.com/v1/imgs/8fd/b49/a957de191f17e7791e5db0c02a1f517118-24-david-cross.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@jorcru", "site": "@vulture"}, "article": {"published_time": "2018-05-24T19:41:25.033-04:00", "tag": "arrested development, david cross, jason bateman, jeffrey tambor, jessica walter, alia shawkat, tony hale, tv, backlash", "publisher": "https://www.facebook.com/Vulture"}, "description": "David Cross addressed the controversial interview the cast of ‘Arrested Development’ gave to the New York ‘Times’, in which Jessica Walter’s male co-stars minimized the severity of Jeffrey Tambor berating her on set, even as she sat there and cried.", "sailthru.tags": "arrested development, david cross, jason bateman, jeffrey tambor, jessica walter, alia shawkat, tony hale, tv, backlash", "author": "Jordan Crucchiola", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1527205285.033, "source": "https://www.vulture.com", "summary": ""}