{"url": "www.billboard.com/articles/news/8249682/barbra-streisand-talks-metoo-a-star-is-born-remake-with-lady-gaga", "text": "Barbra Streisand speaks onstage during the 75th Annual Golden Globe Awards at The Beverly Hilton Hotel on Jan. 7, 2018 in Beverly Hills, Calif.\n\nBarbra Streisand took a trip down memory lane Friday night (March 16).\n\nThe Hollywood legend was presented with the Icon Tribute during the kickoff to the 35th annual PaleyFest LA at the Dolby Theater.\n\nRyan Murphy was on hand to a lead an in-depth conversation with Streisand about her life in television, which began in 1961 with an appearance on The Tonight Show.\n\n“I have to look up everything about myself because I forget,” Streisand said. “I don’t remember. I asked my assistant today, ‘Did I win the Emmy for that? I don’t remember that.’”\n\nShe added, “I usually remember things by the food or what I was wearing. Quincy [Jones] sent me a picture and there we are, 1963, at my first Grammys and I don’t know where it was. At a hotel? A theater? I get things like that mixed up.”\n\nStreisand admitted that she didn’t realize the PaleyFest tribute would be on stage at the Dolby. “I thought tonight was going to be at Beverly Hills at the Television Academy,” she said to big laughs. “I really thought that it was a dinner and we’d be sitting around tables and it was a chat. I wasn’t prepared for the Dolby Theatre.”\n\nPrepared or not, Streisand had no trouble reminiscing about her many television projects, which have earned her five primetime Emmys.\n\nHere are some of the highlights of Friday night’s almost hour-long chat with Murphy.\n\nShe was 21 when she appeared on Judy Garland’s variety show. She recalled the 41-year-old Wizard of Oz’s hands to be cold and shaking. “I adored her,” Streisand said. “I loved her. She was so wonderful to me. But it was interesting to observe, that drinking to try to ease the tension of fear…I know what she feels now because she was a legend. It gets harder as you get older.”\n\nStreisand was struck with a paralyzing case of stage fright after she forgot the lyrics to one of her songs during her famous Central Park concert in 1968. She didn’t perform publicly for another almost 30 years unless it was for a political cause or a charity fundraiser. Listening to a self-help tape called Excellence helped her overcome the fear of performing.\n\n“Even today, I don’t really like to talk before I go on,” she said. “I get very quiet. I also got a little pill called Inderoll. 10 milligrams. It did take away my pounding heart because when you have a pounding heart you can’t sing. It effects your vocals.\"\n\nAs for calming her nerves with a glass of wine, Streisand said she doesn’t drink. “I liked rum-and-coke sometimes when I was a teenager,” she said. “I like that little buzz like beer. I like beer but I was never into wines.”\n\nStreisand’s longtime disdain for the press hasn’t subsided. She doesn’t understand why the press is surprised when she asks for photo approvals. “Yeah, I want f---ing photo approval,” she said.\n\nShe makes no apologies for being a control-freak. “I would say anybody talented…wants to control their work,” Streisand explained. “It’s not controlling life. It’s not controlling your life. It’s controlling your work.”\n\nStreisand also says she never experienced a #MeToo moment. “I wasn’t one of those pretty girls with those nice little noses,” she said, adding, “We’re in a strange time now with men and women and the pendulum is swinging this way and that way and it’s going to have to come to the center.”\n\nMost of Streisand’s television watching these days is CNN and MSNBC. However, she enjoys watching Who Wants to be a Millionaire? while she’s exercising. The latest season of Homeland has left her “disappointed” and Murphy’s American Crime Story: The Assassination of Gianni Versace too “scary.” “I like the parts with Penelope Cruz and Edgar Ramirez,” she said.\n\nShe has seen parts of the upcoming remake of A Star is Born directed by and starring Bradley Copper opposite Lady Gaga. “It’s very very good,” Streisand said.\n\nThere was no mention of rumors that Streisand would guest star on Murphy’s upcoming political drama on Netflix with Gwyneth Paltrow and Ben Platt. However, when Streisand said she doesn’t like doing more than four takes when she’s acting, Murphy said with a smile, “Noted.” When she talked about still wanting to star as Mama Rose in a Gypsy remake, Ryan offered, “I have a really good Netflix deal, Barbra.”\n\nThe evening ended with The Paley Center for Media president and CEO Maureen J. Reidy presenting the Icon award to Streisand. Anyone hoping to get a quick photo or word with Streisand was out of luck. As soon as she began to walk off stage, seven burly security guards appeared on stage to thwart any overzealous fans.\n\nThis article originally appeared on The Hollywood Reporter.", "images": ["https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/Barbra-Streisand-2018-golden-globes-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/media/billboard-logo-b-20-billboard-1548-compressed.jpg", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?c596412deda54d9a807d"], "top_img": "https://static.billboard.com/files/media/Barbra-Streisand-2018-golden-globes-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Marc Malkin"], "canonical_link": "http://www.billboard.com/articles/news/8249682/barbra-streisand-talks-metoo-a-star-is-born-remake-with-lady-gaga", "title": "Barbra Streisand Talks #MeToo, 'A Star Is Born' Remake With Lady Gaga", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-03-17T11:30:43-04:00", "published_time": "2018-03-17T11:30:43-04:00"}, "description": "During her chat with Ryan Murphy Friday (March 16) for the opening night of PaleyFest in Los Angeles, the actress teased that the new film, which she's seen parts of, is \"very, very good.\"", "og": {"description": "During her chat with Ryan Murphy Friday (March 16) for the opening night of PaleyFest in Los Angeles, the actress teased that the new film, which she's seen parts of, is \"very, very good.\"", "image": {"identifier": "https://static.billboard.com/files/media/Barbra-Streisand-2018-golden-globes-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Barbra Streisand Talks #MeToo, 'A Star Is Born' Remake With Lady Gaga | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/8249682/barbra-streisand-talks-metoo-a-star-is-born-remake-with-lady-gaga", "site_name": "Billboard"}, "title": "Barbra Streisand Talks #MeToo, 'A Star Is Born' Remake With Lady Gaga", "twitter": {"card": "summary_large_image", "description": "During her chat with Ryan Murphy Friday (March 16) for the opening night of PaleyFest in Los Angeles, the actress teased that the new film, which she's seen parts of, is \"very, very good.\"", "image": "https://static.billboard.com/files/media/Barbra-Streisand-2018-golden-globes-billboard-1548-1024x677.jpg", "title": "Barbra Streisand Talks #MeToo, 'A Star Is Born' Remake With Lady Gaga", "site": "@billboard"}}, "movies": [], "publish_date": 1521300643.0, "source": "http://www.billboard.com", "summary": ""}