{"url": "https://en.wikipedia.org/wiki/Kate_Hudson", "text": "American actress\n\nKate Garry Hudson (born April 19, 1979)[1] is an American actress, author, and fashion entrepreneur. She rose to prominence for her performance in the film Almost Famous (2000), for which she won a Golden Globe and was nominated for the Academy Award for Best Supporting Actress. Her other films include How to Lose a Guy in 10 Days (2003), Raising Helen (2004), The Skeleton Key (2005), You, Me and Dupree (2006), Fool's Gold (2008), Bride Wars (2009), Nine (2009), Deepwater Horizon (2016), Mother's Day (2016) and Marshall (2017).\n\nHudson co-founded the fitness brand and membership program, Fabletics, operated by JustFab.[2][3] In 2016, Hudson released her first book, Pretty Happy: Healthy Ways to Love Your Body, and in 2017, she released her second book, Pretty Fun: Creating and Celebrating a Lifetime of Tradition.\n\nEarly life [ edit ]\n\nHudson was born in Los Angeles, California, the daughter of Academy Award-winning actress Goldie Hawn and Bill Hudson, an actor, comedian, and musician.[1] Her parents divorced when she was 18 months old and she and her older brother, actor Oliver Hudson, were raised in Snowmass, Colorado, and Pacific Palisades, California, by her mother and her mother's longtime boyfriend, actor Kurt Russell.[4] Hudson's ancestry is Italian (from her paternal grandmother), Hungarian Jewish (from her maternal grandmother),[5][6][7] and the remainder a mix of English and some German.[8][9] Hudson was raised Jewish;[10][11] like her mother, she also practices Buddhism.[12]\n\nHudson has stated that her biological father \"doesn't know me from a hole in the wall\", and she considers Russell her father.[13] Hudson has described her mother as \"the woman that I've learned the most from, and who I look up to, who has conducted her life in a way that I can look up to\".[14] She has four half-siblings: Emily and Zachary Hudson, from her biological father's later marriage to actress Cindy Williams; Lalania Hudson, from his relationship with another woman;[15] and Wyatt Russell, from her mother's relationship with Kurt Russell.\n\nIn 1997, she graduated from Crossroads, a college preparatory school in Santa Monica. She was accepted to New York University, but chose to pursue an acting career instead of an undergraduate degree.[4]\n\nCareer [ edit ]\n\nBeginnings and Almost Famous (1996–2001) [ edit ]\n\nAt age 11, Hudson performed on stage at the Santa Monica Playhouse.[16] She made her film debut in the dramedy Desert Blue (1998), and subsequently appeared in the romantic comedy 200 Cigarettes (1999). She took on the roles of a college student in the psychological thriller Gossip, the lesbian daughter of the titular character in the dramedy Dr. T & the Women and one of the leading roles in the romantic comedy About Adam, all of which were released throughout 2000.[16]\n\nHer breakthrough came with the role of a veteran groupie in Cameron Crowe's semi-autobiographical dramedy Almost Famous (2000). She \"hung in and had turned down leads in other movies just to play the part\" and soon obtained it \"because of her loyalty\", according to Crowe.[16] For her performance, she won the Golden Globe Award for Best Supporting Actress and was nominated for an Academy Award for Best Supporting Actress.[4] Entertainment Weekly put it on its end-of-the-decade, \"best-of\" list, saying, \"This power ballad of a movie also happens to be Crowe's greatest (and most personal) film thanks to the golden gods of Stillwater and their biggest fan, Kate Hudson's incomparable Penny Lane.\"[17] She worked hard in avoiding association with her well-known parents, as she did not want to be perceived as someone who \"rode on somebody's coattails\".[4]\n\nCommercial success (2002–2009) [ edit ]\n\nIn 2002, Hudson appeared in the remake of the historical romance The Four Feathers, as the fiancée of a young British officer (played by Heath Ledger). The film was panned by critics and had a lukewarm box office response.[18] In her next film, the romantic comedy How to Lose a Guy in 10 Days (2003), Hudson starred with Matthew McConaughey, as a writer for a women's magazine who starts dating a guy and eventually drives him away using only the \"classic mistakes women make\" in relationships. The film was a box office success, grossing over US$100 million upon its release. She also starred opposite Naomi Watts in the Merchant-Ivory film Le Divorce (2003), portraying a woman who, with her sister, dispute the ownership of a painting by Georges de La Tour with the family of her former brother-in-law. Entertainment Weekly gave the film a \"C\" rating and wrote: \"I'm disappointed to report that Hudson and Watts have no chemistry as sisters\".[19]\n\nHudson in July 2006\n\nHer next romantic comedies, Alex and Emma (2003), in which she played a stubborn stenographer, and Raising Helen (2004), taking on the role of a young woman who becomes the guardian of her deceased sister's children, were released to varying degrees of success. In 2005, Hudson starred in the supernatural thriller The Skeleton Key, as a young hospice nurse who acquires a job at a New Orleans plantation home, and becomes entangled in a supernatural mystery involving the house. In its review, The Washington Post, describing her, wrote: \"Hudson, who dials back her native, Goldie-given charm here to give Caroline a no-nonsense brusqueness, manages to convincingly convey a fearless bullheadedness rather than less sympathetic naivete\".[20] The film was a box office hit, grossing over US$91.9 million worldwide ($47.9 million in North America).[21] Her next film, the comedy You, Me and Dupree, in which she appeared with Owen Wilson and Matt Dillon as one half of a couple who allows an unemployed friend to move in, grossed US$21.5 million on its opening weekend of July 14, 2006.[22] It eventually made US$130.4 million worldwide.[23]\n\nIn 2007, Hudson directed the short film Cutlass, one of Glamour magazine's \"Reel Moments\" based on readers' personal essays, which starred Kurt Russell, Dakota Fanning, Virginia Madsen, Chevy Chase and Kristen Stewart.[24] In the romantic comedy Fool's Gold (2008), her second film with Matthew McConaughey, Hudson took on the role a divorced woman who returns with her former husband while searching for a lost treasure. She was certified in scuba diving in the Great Barrier Reef for the underwater scenes. The film made US$111.2 million worldwide.[25] In My Best Friend's Girl, another romantic comedy released in 2008, Hudson played the colleague of an amiable guy (Jason Biggs). Despite negative reviews, it was a moderate commercial success.[26]\n\nHudson starred in Bride Wars (2009),[27] alongside Anne Hathaway, playing two best friends who become rivals after their weddings are scheduled on the same day. The film was named among the 10 worst chick flicks of all time by Time in 2010,[28] but was successful financially, grossing US$114.6 million globally.[29] Her next film was the musical Nine, directed by Rob Marshall, in which she played a Vogue fashion journalist, alongside Daniel Day-Lewis, Marion Cotillard, Penélope Cruz, Nicole Kidman, and Judi Dench. The film was acclaimed by critics and Hudson garnered praise for her dancing skills, showcased in a 1960s-inspired original piece called \"Cinema Italiano\", which was written specifically for her character.[30]\n\nIndependent films and Glee (2010s) [ edit ]\n\nHudson starred with Casey Affleck and Jessica Alba, as the wife of a West Texas serial killer, in the film adaptation The Killer Inside Me, which premiered at the 2010 Sundance Film Festival. In 2011, Hudson played a quickwitted, carefree ad executive in the romantic comedy film A Little Bit of Heaven, and an unmarried attorney in another romantic comedy, Something Borrowed, based on Emily Giffin's novel of the same name. In is review for the latter, Detroit News remarked: \"Kate Hudson looks exhausted, as if she is as tired of wading through another one of her feckless duds as we are of watching them\".[31] While A Little Bit of Heaven found a limited release in theaters, Something Borrowed was a moderate commercial success.[32]\n\nIn 2012, Hudson was cast on the Fox teen comedy series Glee, in the recurring role of Cassandra July, a dance teacher at the fictitious New York Academy of the Dramatic Arts.[33][34][35] In 2013, Hudson appeared in the political thriller The Reluctant Fundamentalist, as a photographer and the girlfriend of a professor at Lahore University. In 2014, she starred in the comedy Wish I Was Here, as the wife of a struggling actor, and the thriller Good People, as one half of a couple who fall into severe debt while renovating their family's home. The aforementioned films received a limited release and mixed reviews from critics.[36][37][38][39] In Rock the Kasbah (2015), Hudson played a top-hatted hooker with a heart of gold who befriends a has-been actor manager (Bill Murray) in Afghanistan. Despite a US$15 million budget, the film only made US$3 million at the North American box office.[40]\n\nHudson voiced a crazy ribbon-dancing panda in the DreamWorks animation Kung Fu Panda 3 (2016),[41] which grossed US$521.1 million globally,[42] and became her most widely seen film.[41] She starred as a woman married to an Indian man and the sister of a lesbian woman, both of which had not told their conservative parents, in the romantic comedy Mother's Day (2016), directed by Garry Marshall and opposite Julia Roberts, Timothy Olyphant, and Jason Sudeikis.[43] The film was panned by critics and a moderate commercial success.[44] She next played the wife of a chief electronics technician (Mark Wahlberg) in the drama Deepwater Horizon, based on the Deepwater Horizon explosion.[45][46] While critical response was positive, the film made US$121.8 million, on a budget of around US$110 million.[47]\n\nIn the 2017 film Marshall, Hudson portrayed an employer accusing her black chauffeur of rape. It received positive reviews from critics but found a limited audience in theaters.[48] In 2019, she is set to star in Blood Moon, a fantasy-adventure film by writer-director Ana Lily Amirpour.[49] She is also co-starring in a film directed by Sia, expected in 2020, called Music.[50]\n\nOther ventures [ edit ]\n\nPretty Happy: Healthy Ways to Love Your Body in February 2016 Hudson at her book signing forin February 2016\n\nIn 2013, Hudson, in a partnership with online fashion retailer JustFab, launched her own line of workout clothes and active wear, Fabletics,[51][52][53] which currently operates 25 stores in the United States. The venture became her focus, and in a 2018 interview, Hudson remarked: \"I work more on Fabletics now than I do on movies.\"[54]\n\nIn 2016, Hudson released her first book, Pretty Happy: Healthy Ways to Love Your Body.[55] In 2017, she released her second book, Pretty Fun: Creating and Celebrating a Lifetime of Tradition.\n\nIn August 2018, Hudson and New York & Company, Inc. announced their partnership, a multi-year deal, consisting on being the ambassador for its US$200 million Soho Jeans collection, and develop her own fashion line.[56] In 2018, Hudson collaborated with her mother Goldie to create a capsule collection, with 50 percent of net proceeds will benefit MindUP, a program within the Goldie Hawn Foundation.\n\nPersonal life [ edit ]\n\nGeneral [ edit ]\n\nIn early 2006, Hudson sued the British version of the National Enquirer after it reported she had an eating disorder, describing her as \"painfully thin\". Hudson said the tabloid's statements were \"a blatant lie\" and she was concerned about the impact the false report could have on impressionable young women.[57] The newspaper apologized and compensated her.[58]\n\nHudson says that she does not enjoy seeing herself on screen, saying, \"I get cold and I shake and I sweat\" when watching her performances for the first time.[14]\n\nIn 2016, Hudson said: \"Meditation has been the most helpful and life-changing thing for me. You can feel the difference when you meditate on a regular basis. At least I can.... I started practicing transcendental meditation a year and a half ago so I meditate 20 minutes in the morning and I try to do another 20 minutes in the afternoon.\"[59]\n\nRelationships [ edit ]\n\nHudson married Chris Robinson, the frontman for The Black Crowes, on December 31, 2000, in Aspen, Colorado. The couple's son, Ryder Russell Robinson, was born in January 2004.[60] They lived in a house that was once owned by director James Whale and traveled together during Hudson's film shoots or Robinson's music tours.[4] On August 14, 2006, Hudson's publicist announced that Hudson and Robinson had separated. On November 18, 2006, Robinson filed divorce papers, citing \"irreconcilable differences\".[61] The divorce was finalized on October 22, 2007, with Hudson being granted joint custody.[62]\n\nIn early 2010, Hudson began dating Muse frontman Matt Bellamy.[63][64][65] Hudson and Bellamy became engaged in April 2011[66] and their son, Bingham Hawn Bellamy, was born in July 2011.[67][68] On December 9, 2014, the couple announced that they had ended their engagement.[69] Hudson and Bellamy are on good terms with one another and co-parent their son.[70]\n\nIn December 2016,[71] Hudson had her first date with Danny Fujikawa, a musician, actor, and co-owner of a record company 7 years her junior.[72][73] She first met him when she was 23, through her best friends, Sara Foster and Erin Foster, who are his stepsisters.[74] On April 6, 2018, Hudson announced she was expecting her first child with Fujikawa.[75] On October 2, 2018, she announced the birth of their daughter, Rani Rose Hudson Fujikawa, via Instagram. She was named for her grandfather, Ron Fujikawa.[76][77]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nPublished works [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Kate_Hudson_%288033413872%29_%28cropped%29.jpg/220px-Kate_Hudson_%288033413872%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Kate_Hudson_2006_cropped.jpg/170px-Kate_Hudson_2006_cropped.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/6/61/Kate_Hudson_%288033413872%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Kate_Hudson_%2824859973219%29_%28cropped%29.jpg/220px-Kate_Hudson_%2824859973219%29_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/61/Kate_Hudson_%288033413872%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kate_Hudson", "title": "Kate Hudson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/61/Kate_Hudson_%288033413872%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}