{"url": "https://acriticalreviewofthehelp.wordpress.com/for-students/quotes-from-the-help/", "text": "Quotes from The Help\n\n**** DEAR STUDENTS, and anyone else who has been assigned this book. While I occasionally answer reader questions, it is not a daily function of this blog. ****\n\nPlenty of black men leave their families behind like trash in a dump, but it’s not something the colored woman do. We’ve got the kids to think about – Minny Jackson (Pg 311)\n\n“You is kind, you is smart. You is important.” Mae Mobley (Pg 443)\n\nThey are scared, looking at the back door every ten minutes, afraid they’ll get caught talking to me. Afraid they’ll be beaten like Louvenia’s grandson, or, hell, bludgeoned in their front yard like Medgar Evers.* (Pg 277 *error in the book. Medgar Evers was shot, not bludgeoned. The novel even has the character of Minny stating Evers’ was shot)\n\nI might as well be Little Stevie Wonder I am so blinded by that dress – Minny Jackson (Pg 317)\n\n“I’ve been thinking about you. You’re smart, you’re pretty, you’re…tall.” Stuart Whitworth, the state senator’s son to Skeeter, his date (Pg 171)\n\n“I hope you write someting really good. Something you believe in” –Stuart Whitworth speaking to Skeeter (Pg 171)\n\n“It’s called the Home Help Sanitation Initiative- ” Hilly Holbrook (Pg 60)\n\n“A bill that requires every white home to have a separate bathroom for the colored help. I’ve even notified the surgeon general of Mississippi to see if he’ll endorse the idea.” Hilly Holbrook (Pg 9)\n\n“What you think I am? A chauffeur? I ain’t driving you to no country club in the pouring rain.” – Minny Jackson (Pg 17)\n\n“Are you…do you find …find men attractive? Are you having unnatural thoughts about…girls or-or women?” –Charlotte Phelan (Pg 75)\n\nI am neither thrilled nor disappointed by the news that they might let a colored man into Ole Miss, just surprised. – Skeeter (Pg 83)\n\n“I say ‘ That good vanilla from Mexico’ and then I go head. I tell her what else I put in that pie for her.” Minny revealing the Terrible Awful secret to Miss Celia (Pg 339)\n\n“Mother, I want to be with girls as much as you’d like to be with …Jameso.” Skeeter (Pg 75)\n\n“All these houses they’re building without maid’s quarters? It’s just plain dangerous. Everybody knows they carry different kinds of diseases than we do.” Hilly Holbrook (Pg eight)\n\nAnd Miss Skeeter asking don’t I want to change things, like changing Jackson, Mississippi, gone be like changing a lightbulb. – Aibileen (Pg 24)\n\n“If I didn’t hit you Minny, who knows what you become.” Leroy to Minny (Pg 413)\n\nI told him don’t drink coffee or he gone turn colored. He say he still ain’t drunk a cup a coffee and he twenty-one years old. It’s always nice to see the kids grown up fine. (Aibileen Pg 91)\n\nYule May easy to recognize from the back cause she got such good hair, smooth, no nap to it. (Pg 208)\n\n“We was all surprised Constantine would go and… get herself in a family way. Some folks at church wasn’t so kind about it, especially when the baby come out white. Even though the father was black as me.” Aibileen to Skeeter (Pg 358)\n\n“I’m ashamed. Sometimes, Senator. Ashamed of what goes on in Mississippi.” Carlton Phelan Skeeter’s father (Pg 268)\n\n“I told Shirley Boon her ass won’t fit on no stool at Woolworth’s anyway.” Minny (Pg 217)\n\n“And then they dropped him off at the colored hospital. That’s what the nurse told me, who was standing outside. They rolled him off the truck bed and the white men drove away.” Aibileen to Skeeter (Pg 153)\n\n“You know, its no wonder Stuart Whitworth dropped you.” Hilly talking to Skeeter. (Pg 280)\n\nWhat would Constantine think of me? Skeeter (Pg 281)\n\n“Remember I told you Constantine had a daughter. Well, Lulabelle was her name. Law, she come out pale as snow. Grew hair the color a hay. Not curly like yours. Straight it was.” Aibileen to Skeeter (Pg 358)\n\n“She looked white as anybody, and she knew it too.” Charlotte Phelan talking to Skeeter about Lulabelle, Constantine’s now fully grown daughter. (Pg 362)\n\n“I told Lulabelle the truth. I told her, “Your daddy didn’t die. He left the day after you were born. And your mama hadn’t been sick a day in her life. She gave you up because you were too high yellow. She didn’t want you.” Charlotte Phelan to Sketter (Pg 364)\n\n“It’s not the same with Pascagoula here, is it?” she says.\n\n“No” I say. It’s not.” This is the first time she’s mentioned Constantine since our terrible discussion.\n\n“They say its like true love, good help. You only get one a lifetime.”\n\nI nod, thinking I should write that down. But of course, include it in the book. But of course its too late, it’s already been mailed. There’s nothing I can do, nothing any of us can do now, except wait for what’s coming. Charlotte Phelan speaking with Skeeter (Pg 372)\n\n“Go shopping…get some new clothes. Go do whatever white women do when the maid’s home.” Minny speaking to Miss Celia (Pg 51)\n\n“Cat got on the porch this morning, bout gave me a cadillac arrest thinking it was Mister Johnny.” Minny (Pg 48)\n\n“Say maybe she getting mal-nutritious.” Aibileen to Minny, (Pg 14)\n\n“That ugly white fool” Minny (Pg 292)\n\n“I got me a knife!” Minny (Pg 307)\n\n“I never thought Constantine would go to Illinois with her, Eugenia. Honestly, I was…sorry to see her go.” Charlotte Phelan to Skeeter, on Constantine leaving with her daughter Lulabelle for Chicago (Pg 365)\n\n“The book is not about Jackson!” Hilly to the bridge club ladies after Skeeter’s novel comes out. (Pg 428)\n\nShe roll her eyes and stick her tongue out like I handed her a plate a dog biscuits. “I knew you was getting senile,” she say. Aibileen, noting Minny’s expression before she answers. (Pg 430)\n\n“Who taught you those things, Mae Mobley?” Mister Leefolt say and Baby Girl whip her head around with eyes like she seed a ghost. Aibileen watching Raleigh Leefolt speak to Mae Mobley (Pg 431)\n\nMy mouth drop open. Why she never tell me this before? “You saying people think I got the black magic?” Aibileen speaking to Minny (Pg 24)\n\n“Please. Find you another colored maid. A young’un. Somebody. . .else.”\n\n“But I don’t know any others well enough.” I am tempted to bring up the word friends, but I’m not that naïve. I know we’re not friends. (Skeeter speaking with Aibileen Pg 109)\n\nHe black. Blacker than me. (Pg 189) Aibileen, comparing her complexion to a roach", "images": ["https://i0.wp.com/lh5.googleusercontent.com/-3y1zeEuupoI/AAAAAAAAAAI/AAAAAAAAAAA/ABtNlbD4AQtdSrYB1PqpcMYVQRmtkck7IA/mo/photo.jpg?resize=48%2C48&ssl=1", "https://acriticalreviewofthehelp.files.wordpress.com/2011/08/boycott-the-help-page.jpg?w=210", "https://acriticalreviewofthehelp.files.wordpress.com/2010/07/movie-still-from-the-help.jpg?w=300&h=200", "https://i0.wp.com/graph.facebook.com/100003707446804/picture?q=type%3Dlarge%26_md5%3D941a2ccffb3fb2f987238f193d9d8e02&resize=48%2C48", "https://i1.wp.com/feedjit.com/b/745ba47b10d05f803c61afeb6a92ac54.png", "https://i2.wp.com/pbs.twimg.com/profile_images/431168993580576769/QBUcbBqu_normal.jpeg?resize=48%2C48", "https://i2.wp.com/graph.facebook.com/1580276561/picture?q=type%3Dlarge%26_md5%3Dca2198a896de22b315a38b6a5f00196c&resize=48%2C48", "https://i2.wp.com/graph.facebook.com/100002341899579/picture?q=type%3Dlarge&resize=48%2C48", "https://i0.wp.com/lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg?resize=48%2C48&ssl=1", "https://i0.wp.com/lh4.googleusercontent.com/-UF9o6LmKW_E/AAAAAAAAAAI/AAAAAAAACgc/5hOOw-m52GQ/photo.jpg?resize=48%2C48&ssl=1", "https://i0.wp.com/graph.facebook.com/100001846923359/picture?q=type%3Dlarge%26_md5%3D67676eeb859d686cb3649a9d2064d171&resize=48%2C48", "https://1.gravatar.com/avatar/4fac8ce13a5977833ff524e1121c3a95?s=48&d=identicon&r=PG", "https://acriticalreviewofthehelp.files.wordpress.com/2014/05/the-help-screenplays-last-scene.jpg?w=594", "https://i2.wp.com/graph.facebook.com/100002341899579/picture?q=type%3Dlarge%26_md5%3D6128150dedd1da3eb9af9b4ece82ceec&resize=48%2C48", "https://1.gravatar.com/avatar/db938fdb7328cc205c12187da05649d6?s=48&d=identicon&r=PG", "https://i1.wp.com/lh6.googleusercontent.com/-E9acHlYAjSY/AAAAAAAAAAI/AAAAAAAAABY/kuFZ6B5_qvw/photo.jpg?resize=48%2C48&ssl=1", "https://i2.wp.com/graph.facebook.com/1595954982/picture?q=type%3Dlarge%26_md5%3Db8fd268c895ae7636e7d736c34d48899&resize=48%2C48", "https://acriticalreviewofthehelp.files.wordpress.com/2011/09/shot-of-pg-277-hard-copy-version-of-the-help.jpg?w=200", "https://1.gravatar.com/avatar/779aaeb6ed2db7f896988f233a481eed?s=48&d=identicon&r=PG", "https://i0.wp.com/graph.facebook.com/100000602413531/picture?q=type%3Dlarge%26_md5%3Daabe2ac179e02bc0247c48e8ce9530db&resize=48%2C48", "https://acriticalreviewofthehelp.files.wordpress.com/2010/07/movie-still-from-the-help.jpg?w=300", "https://acriticalreviewofthehelp.files.wordpress.com/2011/08/the-help-musical-poster.jpg?w=225", "https://1.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=25&d=identicon&forcedefault=y&r=PG", "https://1.gravatar.com/avatar/a1f7cb1d861d78289c82d1e4aa9a94de?s=48&d=identicon&r=PG", "https://i2.wp.com/lh6.googleusercontent.com/-EHMDJmX0518/AAAAAAAAAAI/AAAAAAAAAFw/-3XLrfgOIDg/photo.jpg?resize=48%2C48&ssl=1", "https://1.gravatar.com/avatar/16dfe994b406ffb5129acc8175d5169f?s=48&d=identicon&r=PG", "https://2.gravatar.com/avatar/b5e5af24d137369583e484af9a80cefe?s=48&d=identicon&r=PG", "https://i0.wp.com/graph.facebook.com/797868943/picture?q=type%3Dlarge%26_md5%3D840d2c6fe19c9b8f2934d4fbe1898ade&resize=48%2C48", "https://1.gravatar.com/avatar/da34e7d53a40360aaeafc547b7929b15?s=48&d=identicon&r=PG", "https://i1.wp.com/a0.twimg.com/profile_images/378800000382613885/9a0e6639136402680bb09d1a0ed55394_normal.jpeg?resize=48%2C48", "https://acriticalreviewofthehelp.files.wordpress.com/2014/05/the-help-screenplay-last-two-pages.png?w=594", "https://pixel.wp.com/b.gif?v=noscript", "https://0.gravatar.com/avatar/00848860a9939a076c2c3017c2546bd7?s=48&d=identicon&r=PG"], "top_img": "https://acriticalreviewofthehelp.files.wordpress.com/2010/07/movie-still-from-the-help.jpg?w=300", "keywords": [], "authors": ["Dominic Graves"], "canonical_link": "https://acriticalreviewofthehelp.wordpress.com/for-students/quotes-from-the-help/", "title": "Quotes from The Help", "meta_data": {"viewport": "width=device-width", "generator": "WordPress.com", "og": {"type": "article", "title": "Quotes from The Help", "url": "https://acriticalreviewofthehelp.wordpress.com/for-students/quotes-from-the-help/", "description": "**** DEAR STUDENTS, and anyone else who has been assigned this book. While I occasionally answer reader questions, it is not a daily function of this blog. ****     Plenty o…", "site_name": "A Critical Review of the novel The Help", "image": {"identifier": "https://acriticalreviewofthehelp.files.wordpress.com/2010/07/movie-still-from-the-help.jpg?w=300", "width": 300, "height": 200}, "locale": "en_US"}, "article": {"published_time": "2010-06-27T20:45:24+00:00", "modified_time": "2014-01-16T19:27:11+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"site": "@wordpressdotcom", "text": {"title": "Quotes from The Help"}, "card": "summary"}, "fb": {"app_id": 249643311490}, "application-name": "A Critical Review of the novel The Help", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "An analysis of the novel The Help, its audio version and the movie. Blog est. in 2010", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s1.wp.com/i/favicon.ico", "description": "**** DEAR STUDENTS, and anyone else who has been assigned this book. While I occasionally answer reader questions, it is not a daily function of this blog. ****     Plenty of black men leave their families behind like trash in a dump, but it’s not something the colored woman do. We’ve got the kids…"}, "movies": [], "publish_date": 1277671524.0, "source": "https://acriticalreviewofthehelp.wordpress.com", "summary": ""}