{"url": "www.thisisinsider.com/selena-gomez-justin-bieber-engagement-sexist-reactions-2018-7", "text": "Justin Bieber recently announced his engagement to Hailey Baldwin.\n\nThis took many by surprise, especially considering Bieber's long history with Selena Gomez.\n\nMuch of the surprise, however, has crossed over into invasive speculation and unnecessary concern for Gomez's wellbeing.\n\nGomez is being inserted into a narrative she didn't ask to be a part of.\n\nThis is a trend with female celebrities whose exes move on — largely because our society has difficulty recognizing that a woman can be happy alone and, in particular, without a man.\n\n\n\nWhere were you when you found out Justin Bieber got engaged? Correction: Where were you when you found out Justin Bieber got engaged to someone who is not Selena Gomez? I was minding my own business on the subway while mindlessly scrolling through Instagram. Suddenly, my thumb stopped and hovered over Bieber's Instagram post where he referred to his 21-year-old fiancée Hailey Baldwin as the \"love of his life.\" I immediately sent the post to a handful of friends writing, \"Truly speechless.\" My best friend wrote back, \"Doesn't that make you sad for Selena?\" My response? \"10000000%.\"\n\nBieb's early music served as the soundtrack to my teen years. Who didn't listen to \"One Time\" on repeat while wondering how we got so #blessed with this shaggy-haired heartthrob? (OK — maybe a lot of people, but I wasn't one of them.) I fully embraced the pop star who quickly became every teenage girl's dream guy, including a very famous one: Selena Gomez. So, yeah, when I found out Bieber was marrying Baldwin instead of Gomez, I couldn't help but feel bad for Sel. She clearly has a lot of love for her on-again, off-again ex. But isn't it a bit sexist to feel bad for a wildly successful woman just because her ex-boyfriend is marrying another woman? Why does she have to lose just because he wins?\n\nThough I'm not the only person mourning the end of Jelena, nowhere in Bieber's lengthy Instagram post does he mention his ex's name — yet media headlines about Bieber and Baldwin are littered with mentions of Gomez. From a Vogue beauty article that conjectures that Gomez's new hairstyle is because of her ex's engagement to E! News' in-depth feature about why she wasn't the woman for Bieber (sigh), Gomez is being inserted into a narrative she didn't ask to be a part of. Plus, let's not forget these gems of headlines: \"Inside Selena Gomez's New Life Without Justin Bieber,\" \"Selena Gomez's Post–Justin Bieber Engagement Makeover Includes New Hair and a Pointed Statement T-Shirt\" and the lovely \"Fans on Selena Gomez Watch in Wake of Bieber Engagement.\"\n\nGomez and Bieber in their heyday. Craig Barritt/Getty Images\n\nLook, I used to work for a celebrity tabloid, so I know the drill. When a big star gets engaged, you immediately check up on their exes and their relationship history. This isn't a new narrative, but it's a tired one. Don't believe me? Just look at what's widely considered to be the most controversial celebrity breakup of all time: Brad and Jen. Flashback to 2005, when Brad Pitt left Jennifer Aniston for his \"Mr. & Mrs. Smith\" costar, Angelina Jolie: And the reign of Brangelina began.\n\nOf course, a media frenzy ensued after Aniston and Pitt's dramatic split, and fans declared themselves #TeamAniston or #TeamJolie. Everyone felt bad for Aniston, but it was like a car crash — they just couldn't look away. Almost 13 years later, if we're being honest, we still can't look away from Aniston's love life. People say that they want to see the OG girl next door \"happy,\" but that's really code for \"coupled.\" A guy can be single and revered ad infinitum (just look at George Clooney, pre-Amal), but a woman — even a wildly successful and world-famous one, such as Aniston or Gomez — needs a man to openly declare \"she's good enough! I'm marrying her!\" for the public to not think there's something wrong with her. It's the ugly truth.\n\nThat's why when Pitt and Jolie broke up in 2016 after nearly 12 years together, the world collectively gasped before turning to Aniston, waiting patiently for her next move. Was she happy that karma finally caught up to her ex? Did she want to get back together? Just like Gomez, Aniston had nothing to do with her ex's romantic news, yet she was mentioned in article after article. She was a major character in Pitt and Jolie's breakup, even though she was seemingly happily married to actor Justin Theroux.\n\nBrad Pitt and Jennifer Aniston in 2004; Pitt and Angelina Jolie in 2006. Evan Agostini/Bryan Bedder/Getty Images\n\nIt didn't matter that Aniston split from Pitt more than a decade ago and had moved on with her life. She was once again the source of speculation due to her ex's love life. Perhaps the most overt sign of this was the New York Post cover that featured a laughing Aniston with the headline, \"BRANGELINA 2004–2016.\" The coverage was so unfair that think pieces started popping up coming to Aniston's defense. Entertainment Tonight published: \"Leave Jennifer Aniston Out of Angelina Jolie and Brad Pitt's Divorce!\" Her soon-to-be estranged husband, Theroux, also came to her defense in the press.\n\nAfter Aniston eventual split from Theroux, in February 2018, the world once again mourned her impending divorce, because God forbid one of the most successful actresses of our time dare to be single and childless. The \"Poor Jen\" narrative has been so rampant that mainstream media outlets even started calling each other out. Life & Style published an article with the headline \"Sorry, Jennifer Aniston! Justin Theroux Is Moving in with Emma Stone\" while the Daily Mail wrote, \"Why can't Jennifer Aniston find a lasting love?\" This type of coverage spurred The Guardian's article, \"I'm sick of ‘Poor Jen' sexism on repeat. This is The One Where Aniston Was Just Fine and USA Today's \"It's time to leave Jennifer Aniston alone.\"\n\nHonestly, the likelihood that Aniston cares about her exes' love lives is slim, as is the likelihood that Gomez shed tears over Bieber's engagement to Baldwin. These women haven't inserted themselves into their exes' love lives, so why do we insist on doing it? Jelena came into existence in December 2010 after the young lovebirds were spotted holding hands. In the eight years since, they've broken up multiple times, written songs about each other and dated other people. Their relationship statuses have changed, but one thing has remained the same: the media's obsession with their relationship — and their projection of Gomez's \"devastation\" every time Bieber starts dating someone else.\n\nA post shared by Sofia Richie (@sofiarichie) Aug 13, 2016 at 10:37pm PDT\n\nIn 2016, Bieber had a brief romance with Sofia Richie (before her Scott Disick days) and just like now, the media was quick to paint Gomez as \"destroyed\" by her ex's new relationship. Hollywood Life published an article titled \"Selena Gomez Devastated Justin Bieber Is Finally Over Her & Into Sofia Richie,\" in which they called her \"hysterical\" and reported that she was \"constantly crying.\" They wrote this even though Gomez had done absolutely nothing to back up these claims… except fall in love with Bieber when she was a teenager.\n\nSo I can't help but fear that Gomez is in danger of becoming the Aniston of our generation. She was part of a celebrity power couple. She and Bieber had not just one but several public splits. And now he's moving on while she's still single. But why do we always assume that's a bad thing? Is it so far-fetched to think that Pitt wasn't the one for Aniston, even though they were married? Maybe Gomez and Bieber were first loves, but not forever loves.\n\nI, for one, am tired of the media and the public turning women into victims just because their exes are moving on. As much as we all loved Jelena, their time came and went. So instead of speculating about Gomez's feelings about Bieber's engagement to Baldwin, let's just blast \"It Ain't Me\" and move on with our lives. Gomez sure is.\n\nSign up here to get INSIDER's favorite stories straight to your inbox.", "images": ["https://i.insider.com/5b4cb84b20e3a864008b459f?width=1200&format=jpeg", "https://i.insider.com/5b4cb86520e3a85f008b459c?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b4cbb8120e3a81c008b45b0?width=600&format=jpeg&auto=webp", "https://i.insider.com/5967a19ab4ec012f008b4646?width=150&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "http://www.thisisinsider.com/selena-gomez-justin-bieber-engagement-sexist-reactions-2018-7?width=600&format=jpeg&auto=webp", "https://i.insider.com/5b4cb86520e3a85f008b459c?width=24&format=jpeg&auto=webp", "https://i.insider.com/5b465d4620e3a84a008b45d4?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5b4cb84b20e3a864008b459f?width=1200&format=jpeg", "keywords": [], "authors": ["Paulina Jayne Isaac"], "canonical_link": "http://stylecaster.com/selena-gomez-justin-bieber-hailey-baldwin-engagement-sexist/", "title": "People can't stop wondering if Selena Gomez reacted to Justin Bieber's engagement — but everyone's concern is unnecessary and sexist", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "People can't stop wondering if Selena Gomez reacted to Justin Bieber's engagement — but everyone's concern is unnecessary and sexist", "date": "2018-07-16", "news_keywords": "Selena Gomez, Justin Bieber, Relationships, Sexism, Celebrities, Contributor, StyleCaster, Paulina Jayne Isaac", "description": "Justin Bieber recently announced his engagement to Hailey Baldwin. Plenty of media coverage and fan reactions have focused on Selena Gomez, Bieber's ex-girlfriend, and how she may be feeling about the news. This is a popular and sexist trend with female celebrities whose exes move on.", "author": "Paulina Jayne Isaac", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Health", "og": {"title": "People can't stop wondering if Selena Gomez reacted to Justin Bieber's engagement — but everyone's concern is unnecessary and sexist", "description": "Justin Bieber recently announced his engagement to Hailey Baldwin. Plenty of media coverage and fan reactions have focused on Selena Gomez, Bieber's ex-girlfriend, and how she may be feeling about the news. This is a popular and sexist trend with female celebrities whose exes move on.", "type": "article", "url": "https://www.insider.com/selena-gomez-justin-bieber-engagement-sexist-reactions-2018-7", "image": "https://i.insider.com/5b4cb84b20e3a864008b459f?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "People can't stop wondering if Selena Gomez reacted to Justin Bieber's engagement — but everyone's concern is unnecessary and sexist", "sailthru.date": "2018-07-16", "sailthru.tags": "Selena Gomez, Justin Bieber, Relationships, Sexism, Celebrities, Contributor, StyleCaster, Paulina Jayne Isaac", "sailthru.description": "Justin Bieber recently announced his engagement to Hailey Baldwin. Plenty of media coverage and fan reactions have focused on Selena Gomez, Bieber's ex-girlfriend, and how she may be feeling about the news. This is a popular and sexist trend with female celebrities whose exes move on.", "sailthru.author": "Paulina Jayne Isaac", "sailthru.verticals": "health, culture", "sailthru.image.full": "https://i.insider.com/5b4cb83a20e3a840008b45a5?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5b4cb83a20e3a840008b45a5?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "People can't stop wondering if Selena Gomez reacted to Justin Bieber's engagement — but everyone's concern is unnecessary and sexist": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 200, "back-to-top": "control", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5b4cbe9a20e3a820008b459d", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1531670400.0, "source": "http://www.thisisinsider.com", "summary": ""}