{"url": "www.inquisitr.com/3917369/jennifer-garner-is-not-suspicious-of-ben-afflecks-relationship-with-elizabeth-weaver-estranged-couple-doing-well-debunked/", "text": "Jennifer Garner and Ben Affleck continue to be the subject of outrageous rumors mostly focused on false links between Ben and different women. Last week, Sienna Miller was the said woman who had Affleck’s attentions, yet this week, it is his “detox nurse” Elizabeth Weaver who the Live By Night star is said to be infatuated with. Not only that, but Garner is reportedly “seeing red” over the relationship that her estranged husband has with the nurse.\n\nBen Affleck Enjoys Lunch Date With Mystery Blonde Amid Jennifer Garner Reunion Rumors https://t.co/3zcem61YZm #celebrity #gossip — 100% Celeb News 24/7 (@celebnews1456) January 6, 2017\n\nGossip Cop shares how the rumor came to be ignited and the culprit is none other than The National Enquirer, a tabloid known for its fabricated stories.\n\n“According to the National Enquirer, an ‘addiction-challenged’ Affleck is ‘hooked’ on Weaver, who the magazine describes as his ‘detox nurse.’ A so-called ‘source’ tells the tabloid, ‘Ben is infatuated with her.’ The magazine’s supposed insider further contends, ‘He’s feeling pretty vulnerable these days, and Elizabeth has helped him regain his confidence.’ ]He adores her,’ adds the publication’s alleged tipster.”\n\nThe story is completely inaccurate and as GC notes, the tabloid simply used photos of Affleck and Elizabeth Weaver while in Los Angeles together to make it seem as though the two are dating. The photos then became the catapult to the tabloid fabricating a whole story that is totally untrue.\n\nAs for Garner’s anger about the relationship Ben and Elizabeth have, these claims are also completely false. Both Jennifer and Ben have been longtime friends with Weaver and the nurse is a trusted confidant to both.\n\nAs it seems, based on new claims, Jennifer Garner and Ben Affleck are actually doing better than ever since their split 18 months ago. There have been many ups and downs, yet the estranged couple, who have remained amicable all the while, are said to be on the upswing.\n\nRadar Online shares details about Jen and Ben’s current status.\n\nA source close to the stars stated to the publication, “Jennifer confided in a friend that she and Ben Affleck are getting along better than ever.” Garner reportedly also stated, “We weren’t having sex before, so now I get the best of both worlds!”\n\nIt was a very difficult time when Jen and Ben announced their separation back in June of 2015. Following the announcement, the infamous nanny scandal then broke involving the former couple’s nanny Christine Ouzounian. The source reminded that it was not the nanny who led to the split between Jen and Ben, stating “It wasn’t the nanny’s fault they split because they weren’t having sex before that.”\n\nJennifer Garner And Ben Affleck Spotted Together At Church Amid Reconciliation Rumors https://t.co/BUDBM66Yan — Lindsay Cronin (@GirlWithGossip) December 13, 2016\n\nJen, herself, even corroborated the fact that Ouzounian was not at all the cause of she and Ben’s split. Garner spoke openly to Vanity Fair on the subject during her first interview after the two separated. It was also during this same interview that Garner was candid about her love for Ben and the love their children have for him.\n\n“It’s not Ben’s job to make me happy. The main thing is these kids—and we’re completely in line with what we hope for them. Sure, I lost the dream of dancing with my husband at my daughter’s wedding. But you should see their faces when he walks through the door. And if you see your kids love someone so purely and wholly, then you’re going to be friends with that person.”\n\nThe two have continued on co-parenting their three children-Violet, 11, Seraphina, 8, and Samuel, 4, and are sure to take family trips to remind their kids that they are still a unit and that both are present in their lives.\n\nThe most recent getaway for Jennifer Garner and Ben Affleck with the little ones was a trip to Big Sky over the holidays\n\n[Featured Image by Jason Merritt/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/01/Jennifer-Garner-and-Ben-Affleck-Things-Getting-Tense.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/3917369/jennifer-garner-is-not-suspicious-of-ben-afflecks-relationship-with-elizabeth-weaver-estranged-couple-doing-well-debunked/", "title": "Jennifer Garner Is Not Suspicious Of Ben Affleck’s Relationship With Elizabeth Weaver, Estranged Couple Doing Well [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}