{"url": "https://en.wikipedia.org/wiki/Better_Call_Saul", "text": "American crime drama television series\n\nBetter Call Saul is an American television crime drama series created by Vince Gilligan and Peter Gould, and a prequel and spin-off of Gilligan's prior series Breaking Bad. Set in the early to mid 2000s, the series follows the story of con-man turned small-time lawyer Jimmy McGill (Bob Odenkirk), beginning six years before the events of Breaking Bad and showing his transformation into the persona of criminal for hire Saul Goodman. McGill becomes the lawyer for former police officer Mike Ehrmantraut (Jonathan Banks), whose skills allow him to enter the criminal underworld of drug trafficking in Albuquerque, New Mexico. The show premiered on AMC on February 8, 2015. The fifth season premiered on February 23, 2020, and a sixth and final season is scheduled to air in 2021.[5]\n\nMcGill is initially working as a low-paid lawyer with the back room of a nail salon as his home and office. His friend and romantic interest Kim Wexler (Rhea Seehorn) works as a lawyer at the firm of Hamlin, Hamlin & McGill (HHM), where she and Jimmy once worked in the mailroom. Partners at HHM include Jimmy's nemesis Howard Hamlin (Patrick Fabian) and his brother Chuck McGill (Michael McKean). Ehrmantraut conducts illegal drug distribution with Nacho Varga (Michael Mando), in addition to becoming right-hand man for drug lord Gus Fring (Giancarlo Esposito) who runs a chain of fast food restaurants as a business front. Their operations are disrupted by members of the Salamanca crime family, including Lalo Salamanca (Tony Dalton). Odenkirk, Banks, and Esposito all reprise their roles from Breaking Bad.\n\nBetter Call Saul has received critical acclaim, with particular praise for its acting, characters, and cinematography; many critics have called it a worthy successor to Breaking Bad and one of the best prequels ever made, with some deeming it superior to its predecessor.[6][7][8] It has garnered many nominations, including a Peabody Award, 23 Primetime Emmy Awards, eleven Writers Guild of America Awards, five Critics' Choice Television Awards, a Screen Actors Guild Award, and two Golden Globe Awards. The series premiere held the record for the highest-rated scripted series premiere in basic cable history at the time of its airing.\n\nPremise [ edit ]\n\nBetter Call Saul follows the transformation of Jimmy McGill (Bob Odenkirk), a former con artist that is trying to become a respectable lawyer, into the personality of the flamboyant criminal lawyer Saul Goodman (a play on the phrase \"[it]'s all good, man!\"), over the six-year period prior to the events of Breaking Bad spanning from approximately 2002 to 2008.[9][10] Jimmy is inspired to turn his life around from his past \"Slippin' Jimmy\" con-man approach by his older brother Chuck McGill (Michael McKean), a senior partner alongside Howard Hamlin (Patrick Fabian) in the Albuquerque law firm Hamlin, Hamlin & McGill, as well as Kim Wexler (Rhea Seehorn), one of the firms legal associates who also becomes Jimmy's romantic interest.\n\nJimmy's initial pursuits during this period are focused on the public defense and earnest attempts to fight for proper justice while trying to get ahead, but soon his life and career starts to intersect with the illegal drug trade in the region, featuring characters and story arcs that continue into Breaking Bad. This includes the uneasy truce between the Salamanca family that serves the Juárez Cartel drug interest and later led by Lalo Salamanca (Tony Dalton) when their patriarch falls ill, and Gus Fring (Giancarlo Esposito), a restaurant entrepreneur that uses his stores as a front for the drug trade. Among those caught up in these events include Ignacio \"Nacho\" Varga (Michael Mando), an enforcer for the Salamancas who only wants to protect his father from harm, and Mike Ehrmantraut (Jonathan Banks), a former police officer who becomes a fixer for Gus.\n\nThe show also includes flash-forwards at the start of each season's premiere following the events of Breaking Bad, where Saul has paid to take on a new identity as Gene Takovic, the manager of a Cinnabon store in Omaha, Nebraska.\n\nProduction [ edit ]\n\nConception [ edit ]\n\nVince Gilligan and Peter Gould began planning a television spinoff of Breaking Bad as early as 2009. While filming \"Full Measure\", Gilligan asked Bob Odenkirk, the actor of series character Saul Goodman, what he thought of a spinoff of the show.[11] In July 2012 Gilligan hinted at a possible Goodman spinoff,[12] stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of a court of law\", including settling on the courthouse steps.[13] During his appearance on Talking Bad, Odenkirk noted that Saul was one of the most popular characters on the show, speculating that the audience likes the character because he is the program's least hypocritical figure, and is good at his job.[14]\n\nGilligan noted that over the course of Breaking Bad, there were a lot of \"what if\"s their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. Further, Saul's character on Breaking Bad became much more developed than the staff had originally planned, as he was originally slated to appear in only three episodes; with the growth of Saul's character, Gilligan saw ways to explore Saul's character further.[15]\n\nDevelopment [ edit ]\n\nIn April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould; the latter wrote the Breaking Bad episode that introduced the character.[16][17] As of July 2013, the series had yet to be greenlighted.[18] Netflix was one of many interested distributors, but ultimately a deal was made between AMC and Breaking Bad production company Sony Pictures Television.[19] Gilligan and Gould serve as co-showrunners and Gilligan directed the pilot.[20] Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer.[21] Also on the writing staff are Bradley Paul, and Gordon Smith, who was a writer's assistant on Breaking Bad.[20]\n\nAs Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients - celebrities in guest roles - in his strip mall office, a format similar to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format, and fell back onto planning for hour-long episodes.[22][16][13] Since they had done this format with Breaking Bad, which Gilligan said was \"25-percent humor, 75-percent drama\", the two considered reversing that for Better Call Saul.[22] While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"[23] Additionally, while several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show but one that would necessitate some legal elements. To help in these areas, the writers did speak to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime on waiting others to complete actions.[24]\n\nGilligan and Gould found that the character of Saul Goodman was not sufficient to carry the show by himself, with Gilligan calling the character of Saul \"great flavoring\" for a show but not the substance.[22] They came to realize that Saul, in the Breaking Bad timeframe, was a man that had come to accept himself, and recognized the potential to tell the story of how Saul got to be that person.[22] Gilligan and Gould had already committed to the Better Call Saul title, so that going this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman or otherwise would disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".[22] Gilligan and Gould had learned several lessons related to foreshadowing without writing the foresight for it from Breaking Bad,[25] and so with Better Call Saul, gave themselves more flexibly in how the show's plot would develop over its run, and had no firm idea where it will end up outside the connection to Breaking Bad.[22] For example, Rhea Seehorn's performance as Kim Wexler during the first season significantly altered how the writers used her character in later seasons as well as slowed down the pacing of how fast they transitioned Jimmy into Saul, as they gave more focus to the Jimmy-Kim relationship. Gilligan compared this to the impact Aaron Paul's outstanding acting had on Breaking Bad's ultimate pacing.[26]\n\nIn writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centers on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus with some overlap, so as if they were giving the audience two shows for one.[22] Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but for major Breaking Bad characters like Walter or Jesse, Gilligan preferred only to include them if their inclusion did not feel shoehorned in and feel less satisfactory to both the production team and to audiences.[22] Because of the closeness to the Breaking Bad storyline, one of the writers was tasked at the start of each season to rewatch all 62 episodes of the show and verify the scripts for the Better Call Saul season did not introduce any conflicts.[27]\n\nNearing the start of filming of the pilot, Gilligan did become concerned which way audiences would take Better Call Saul as a spinoff, either favorably as Frasier or as a disappointment as with After MASH, though felt his production team had done the best job they could for the show.[28][29]\n\nCasting [ edit ]\n\nBob Odenkirk stars as lawyer Jimmy McGill (known as Saul Goodman in Breaking Bad). In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.[30]\n\nNew cast members include Michael McKean as McGill's elder brother Chuck. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\".[31][32] The cast also includes Patrick Fabian as Howard Hamlin, Rhea Seehorn as Kimberly \"Kim\" Wexler, and Michael Mando as Ignacio \"Nacho\" Varga.[33] In October 2014, Kerry Condon was cast[34] as Stacey Ehrmantraut, Mike's daughter-in-law. In November 2014, it was announced that Julie Ann Emery and Jeremy Shamos had been cast as Betsy and Craig Kettleman, described as \"the world's squarest outlaws.\"[35]\n\nGoing into Season 3, it was announced that Giancarlo Esposito would return to play Gus Fring.[36]\n\nTony Dalton was announced as Lalo Salamanca for Season 4;[37] Lalo had been a character mentioned only by name, alongside Nacho, in the Breaking Bad episode \"Better Call Saul\".[38]\n\nDean Norris, another Breaking Bad alumnus, stated he could not be part of the earlier seasons, partly due to his involvement in the CBS series Under the Dome,[39] but was announced as a guest star reprising his role as Hank Schrader by Season 5.[40]\n\nOther Breaking Bad actors have spoken of the potential of being on Better Call Saul. Both Bryan Cranston and Aaron Paul said, as of Season 3, they are both open to reappearing on the show as Walter White and Jesse Pinkman, respectively, if asked, believing that Gilligan would have a sufficiently good reason to bring them in.[41] Paul had previously mentioned the possibility of a cameo during Season 1 but this fell through.[42][43] Anna Gunn also mentioned a \"talk\" with Gilligan over possible guest appearances as Skyler White.[44] Gilligan said that by Season 3 that show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential for the story.[41]\n\nFilming and production [ edit ]\n\nLike its predecessor, Better Call Saul is set and filmed primarily in and around Albuquerque, New Mexico.[45] Notable locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, include Northrop Grumman's, that collectively are used for the HHM office spaces. Jimmy's back office is located in an actual nail salon, which the producers worked with the owners to accommodate, while the Salamanca's restaurant is also a real business in the South Valley that production modified a bit for the show, but otherwise remained an open business outside of filming. The scenes set in Omaha are actually filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees.[46] Additional filming took place at Albuquerque Studios.[47] The New Mexico Film Office reported that the first four seasons of Better Call Saul had brought in over US$120 million into the state, and has hired 1,600 crew for each season and a cumulative 11,300 extras.[48]\n\nFilming for the pilot started on June 2, 2014.[49]\n\nBetter Call Saul also employs Breaking Bad's signature time jumps.[50] Notably, each season pilot has started with a black and white flash-forward to a period in the years after the finale of Breaking Bad where Saul has been relocated to Omaha, Nebraska as \"Gene\", a manager of a Cinnabon store, remaining paranoid about anyone discovering his past identity as Saul.\n\nBroadcast and marketing [ edit ]\n\nThe first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015.[51] In November 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing Mondays at 10:00 pm.[52]\n\nIn June 2014, prior to the series' launch, AMC had renewed the series for a second season of 13 episodes to premiere in early 2016;[20] however, it was later reduced to 10 episodes.[53] In May 2015, Gilligan confirmed that more of the prominent characters from Breaking Bad would be making guest appearances in season 2, but remained vague on which characters were likely to be seen.[54] The second season premiered on February 15, 2016.[55]\n\nIn March 2016, AMC announced that Better Call Saul was renewed for a 10-episode third season which premiered April 10, 2017.[56][57] Following the season's end in June 2017, AMC renewed the series for a 10-episode fourth season which premiered on August 6, 2018.[58][59]\n\nThe series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season.[60] The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\".[61] Filming for the fifth season started in April 2019, and finished in September 2019.[62][63] AMC later affirmed the ten-episode fifth season will start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays.[64]\n\nIn January 2020, AMC renewed the series for a sixth season that will air in 2021. Gould confirmed it will be the show's final season, and will consist of 13 episodes rather than the usual 10. This will bring the show's final episode count to 63, one more than its predecessor Breaking Bad. Gould stated: \"From the beginning when we started this, I think all our hopes and dreams were to be able to tell the whole story ... and make it to be a complete story from beginning to end. We're going to try like hell to stick the landing of these 63 episodes\".[65]\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nIntroduced in season 1 [ edit ]\n\nIntroduced in season 2 [ edit ]\n\nEd Begley Jr. as Clifford Main, managing partner at Davis & Main.\n\nOmar Maskati as Omar, Jimmy's assistant at Davis & Main.\n\nJessie Ennis as Erin Brill, a lawyer at Davis & Main who is ordered to shadow Jimmy.\n\nJuan Carlos Cantu as Manuel Varga, Nacho's father who owns an upholstery shop.\n\nVincent Fuentes as Arturo Colon, a criminal associate of Hector Salamanca (seasons 2–4).\n\nRex Linn as Kevin Wachtell, chairman of Mesa Verde Bank and Trust and a client of HHM and Kim.\n\nCara Pifko as Paige Novick, senior legal counsel for Mesa Verde Bank and Trust and a friend of Kim.\n\nAnn Cusack as Rebecca Bois, Chuck's ex-wife.\n\nManuel Uriza as Ximenez Lecerda, an associate of Hector Salamanca.\n\nHayley Holmes as Drama Girl, one of the three UNM film students Jimmy hires for various projects.\n\nIntroduced in season 3 [ edit ]\n\nBonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit.\n\nKimberly Hebert Gregory as Assistant District Attorney Kyra Hay.\n\nTamara Tunie as Anita, a member of Mike and Stacey's support group.\n\nIntroduced in season 4 [ edit ]\n\nRainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\".\n\nBen Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\".\n\nStefan Kapičić as Casper, a member of Werner Ziegler's team.\n\nPoorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant.\"\n\nIntroduced in season 5 [ edit ]\n\nSasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks that are among \"Saul Goodman\" 's first clients.\n\nfirst clients. Barry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde who becomes a legal matter for Kim to evict to make way for the bank's new call center.\n\nBreaking Bad characters [ edit ]\n\nEpisodes [ edit ]\n\nSeries overview for Better Call Saul Season Episodes Originally aired First aired Last aired 1 10 February 8, 2015 ( ) April 6, 2015 ( 2015-04-06 ) 2 10 February 15, 2016 ( ) April 18, 2016 ( 2016-04-18 ) 3 10 April 10, 2017 ( ) June 19, 2017 ( 2017-06-19 ) 4 10 August 6, 2018 ( ) October 8, 2018 ( 2018-10-08 ) 5 10[69] February 23, 2020 ( ) April 20, 2020 ( 2020-04-20 ) [69]\n\nSeason 1 (2015) [ edit ]\n\nTired of public defender work, Jimmy works to represent the Kettlemans, who are accused of embezzlement. Jimmy cares for his brother Chuck, who is housebound without electricity because he believes he has electromagnetic hypersensitivity. While pursuing an elder law career, Jimmy discovers clients being defrauded by the Sandpiper retirement home and begins a class action lawsuit with Chuck. When the case grows, Chuck suggests giving it to HHM, but secretly arranges with Howard to cut Jimmy out. The case continues growing and HHM brings on Davis & Main. Unhappy at Howard's treatment of him, Kim recommends Jimmy to D&M.\n\nSeason 2 (2016) [ edit ]\n\nJimmy works at D&M but quits after being reprimanded for his client outreach methods. Kim is demoted because of Jimmy's actions. To reclaim her status, she secures Mesa Verde Bank as a client for HHM but Howard denies her credit. Kim quits at HHM, and she and Jimmy begin separate private practices in a shared office. Jimmy secretly causes Chuck to make an error that delays a new branch construction, so Mesa Verde drops HHM to hire Kim. Nacho hires Mike to remove Tuco from the Salamanca organization. Mike goads Tuco into fighting and Tuco is imprisoned. Hector is suspicious so Mike prepares to assassinate him but is interrupted.\n\nSeason 3 (2017) [ edit ]\n\nChuck discovers Jimmy's fraud and tricks him into confessing, leading to suspension of Jimmy's law license. Chuck's ouster at HHM leads to his suicide. Gus stops Mike from killing Hector. Mike attacks Hector's trucks and steals $250,000 from one. Mike asks for help laundering the money. Gus arranges for Mike's hire as a contracted security expert at Madrigal and payment of monthly consulting fees. Hector plans to take over Manuel's business so Nacho attempts to kill Hector by changing his angina medication for a placebo. Hector suffers a stroke and Gus’ first aid saves him, though he remains comatose.\n\nSeason 4 (2018) [ edit ]\n\nJimmy regains his outgoing demeanor after Howard shoulders blame for Chuck's death. Jimmy manages a cell phone store but makes more reselling prepaid phones. His reinstatement request is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals, but reveals he is going to practice as Saul Goodman. Gus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate the laundry's potential as a meth lab and Gus hires Werner to oversee construction. Hector recovers mentally and can move his right index finger. Lalo Salamanca arrives to run Hector's business.\n\nSeason 5 (2020) [ edit ]\n\nThe season shows the progression of Jimmy, having regained his law license after a year's suspension, into the character of Saul Goodman, much to Kim's dismay. In addition, Lalo Salamanca's presence disrupts Gus Fring's plans to build a \"superlab\" that will enable him to bypass the Mexican cocaine cartel by selling locally-produced methamphetamine.\n\nTalking Saul [ edit ]\n\nTalking Saul is a live aftershow hosted by Chris Hardwick, which features guests discussing episodes of Better Call Saul. The show uses the same format as Talking Dead, Talking Bad, and other similar aftershows also hosted by Hardwick. AMC announced that Talking Saul would air after the second season Better Call Saul premiere on February 15, 2016, and again after the second-season finale on April 18, 2016.[70] It returned following the season 3 premiere and finale.[71]\n\nSeason 1 (2016) [ edit ]\n\nThese episodes discuss season two of Better Call Saul.\n\nSeason 2 (2017) [ edit ]\n\nThese episodes discuss season three of Better Call Saul.\n\nNo.\n\noverall No. in\n\nseason Episode discussed Guests Original air date U.S. viewers\n\n(millions) 3 1 \"Mabel\" Vince Gilligan, Peter Gould, Jonathan Banks and Rhea Seehorn April 10, 2017 ( ) 0.545[74] 4 2 \"Lantern\" Peter Gould, Patrick Fabian and Michael Mando; Michael McKean via satellite June 19, 2017 ( ) 0.589[75]\n\nBroadcast [ edit ]\n\nBetter Call Saul airs on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million.[76] This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.[77]\n\nIn December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode airs in the U.S.[78] However, the first season was not released on Netflix in the U.S. until February 1, 2016.[79][80] Internationally, episodes of the second season became available the day after they aired in the U.S.[81]\n\nNetflix is the exclusive video-on-demand provider for the series and makes the content available in all its territories, except for Australia and New Zealand.[78] In Australia, Better Call Saul premiered on the streaming service Stan[82] on February 9, 2015, acting as the service's flagship program.[83] In New Zealand, the show is exclusive to the New Zealand-based subscription video-on-demand service, Lightbox.[84] The episodes were available for viewing within three days of broadcast in the U.S.[85]\n\nIn the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013,[86] and the first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter.[87] In India, the series is broadcast on Colors Infinity within 24 hours of the U.S. broadcast.[88]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nBetter Call Saul has received widespread critical acclaim.\n\nSeason 1 [ edit ]\n\nSeason Critical response Rotten Tomatoes Metacritic 1 97% (68 reviews) 78 (43 reviews) 2 97% (31 reviews) 85 (18 reviews) 3 97% (39 reviews) 87 (18 reviews) 4 99% (36 reviews) 87 (16 reviews) 5 99% (33 reviews) 92 (16 reviews)\n\nThe first season of Better Call Saul received critical acclaim, particularly for its acting, writing, and directing with many critics calling it a worthy successor to Breaking Bad. On Rotten Tomatoes, the first season has a rating of 97%, based on 68 reviews, with an average rating of 8.03/10. The site's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\"[89] On the review aggregator website Metacritic, the first season has a score of 78 out of 100, based on 43 critics, indicating \"generally favorable reviews\".[90]\n\nSeason 2 [ edit ]\n\nThe second season, much like the previous, received critical acclaim. On Rotten Tomatoes, the second season has a score of 97%, based on 31 reviews, with an average rating of 8.7/10. The site's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\"[91] On Metacritic, the second season has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".[92]\n\nSeason 3 [ edit ]\n\nThe third season, much like the previous two, received critical acclaim, particularly for the character development of Jimmy McGill. On Rotten Tomatoes, the third season has an approval rating of 97% based on 39 reviews, with an average rating of 8.78/10. The site's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\"[93] On Metacritic, the season has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".[94]\n\nSeason 4 [ edit ]\n\nThe fourth season also received critical acclaim. On Rotten Tomatoes, the season has a 99% approval rating with an average score of 8.93 out of 10 based on 36 reviews. The site's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\"[95] On Metacritic, the season has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".[96]\n\nSeason 5 [ edit ]\n\nOn Rotten Tomatoes, the season has an approval rating of 99% based on 33 reviews, with an average rating of 8.82/10. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\"[97] On Metacritic, the season has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".[98]\n\nAwards and accolades [ edit ]\n\nRatings [ edit ]\n\nSeason Timeslot (ET) Episodes First aired Last aired Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Sunday 10:00 pm (premiere)\n\nMonday 10:00 pm 10 February 8, 2015 6.88[137] April 6, 2015 2.53[138] 3.21[139] 2 Monday 10:00 pm 10 February 15, 2016 2.57[72] April 18, 2016 2.26[140] 2.16[141] 3 10 April 10, 2017 1.81[142] June 19, 2017 1.85[143] 1.64[144] 4 Monday 9:00 pm 10 August 6, 2018 1.77[145] October 8, 2018 1.53[146] 1.49[147] 5 Sunday 10:00 pm (premiere)\n\nMonday 9:00 pm 10 February 23, 2020 1.60[148] April 20, 2020 TBD TBD\n\nHome media [ edit ]\n\nThe first season was released on Blu-ray and DVD in region 1 on November 10, 2015; bonus features include audio commentaries for every episode, uncensored episodes, deleted scenes, gag reel, and several behind-the-scenes featurettes. A limited edition Blu-ray set was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.[149] The second season was released on Blu-ray and DVD in region 1 on November 15, 2016; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[150] The third season was released on Blu-ray and DVD in region 1 on January 16, 2018; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[151] The fourth season was released on Blu-ray and DVD in region 1 on May 7, 2019; bonus features include audio commentary for every episode and several behind-the-scenes featurettes.[152]\n\nOther media [ edit ]\n\nWeb series [ edit ]\n\nIn 2017, before the release of the third season of Better Call Saul, AMC published on their website a 10-episode web series called Los Pollos Hermanos Employee Training, celebrating the return of Gus Fring. Following the success of the latter, which won the Emmy for Outstanding Short Form Comedy or Drama Series at the 69th Primetime Creative Arts Emmy Awards, AMC published another 10-episode web series called Madrigal Electromotive Security Training in 2018.[153]\n\nComics [ edit ]\n\nAMC has released two digital comic books for Better Call Saul. The first, titled Better Call Saul: Client Development, released in February 2015, in advance of the series premiere, details the history of Saul and Mike, acting as a spin-off of the Breaking Bad episode that introduced Saul.[154] In February 2016, in advance of the second-season premiere, AMC released Better Call Saul: Saul Goodman and the Justice Consortium in the Clutches of the Judgernaut![155]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Patrick_Fabian_by_Gage_Skidmore.jpg/125px-Patrick_Fabian_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Jonathan_Banks_2012_2.jpg/125px-Jonathan_Banks_2012_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Vince_Gilligan_by_Gage_Skidmore_3.jpg/144px-Vince_Gilligan_by_Gage_Skidmore_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Peter_Gould_by_Gage_Skidmore.jpg/140px-Peter_Gould_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Giancarlo_Esposito_by_Gage_Skidmore_2.jpg/125px-Giancarlo_Esposito_by_Gage_Skidmore_2.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Tony_Dalton_%28cropped%29.jpg/125px-Tony_Dalton_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/MichaelMcKeanApr09cropped.jpg/125px-MichaelMcKeanApr09cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/27px-Wikivoyage-Logo-v3-icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Bob_Odenkirk_by_Gage_Skidmore_2.jpg/125px-Bob_Odenkirk_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Rhea_Seehorn_by_Gage_Skidmore.jpg/125px-Rhea_Seehorn_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Michael_Mando_by_Gage_Skidmore.jpg/125px-Michael_Mando_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/250px-Better_Call_Saul_logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Better_Call_Saul", "title": "Better Call Saul", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}