{"url": "https://www.digitalspy.com/tv/ustv/a855034/the-flash-season-5-release-date-cast-plot-trailer/", "text": "One of the most popular CW superhero shows, The Flash has a winning mixture of a likeable lead, fun premise and fast-paced (see what we did there?) action.\n\nWith a large and passionate fanbase, we expect this show to run and run (oooh, we did it again!) – with a season 5 already confirmed. Here's everything we know about the next batch of episodes involving everyone's favourite DC TV speedster.\n\nThe Flash season 5 release date: When's it coming?\n\nThe Flash was renewed alongside its fellow ArrowVerse series in April 2018, with a premiere date for the fifth season being confirmed in June.\n\nNew episodes will air on The CW in the US from Tuesday, October 9 at 8/7c, followed by new episodes of Black Lightning.\n\nIn the UK, Sky One is expected to follow its regular pattern of airing The Flash a few weeks after episodes air Stateside.\n\nThe Flash season 5 cast: Who'll be in it?\n\nThe CW\n\nThe following Flash favourites will all return as series regulars:\n\n- Grant Gustin as Barry Allen / The Flash\n\n- Candice Patton as Iris West\n\n- Danielle Panabaker as Caitlin Snow\n\n- Carlos Valdes as Cisco Ramon / Vibe\n\n- Jesse L. Martin as Joe West\n\nTom Cavanagh will also be back... in a new form.\n\nIt's become a tradition on The Flash that each new season introduces us to a new batch of weird and wonderful takes on Harrison Wells, all played by the incomparable Cavanagh.\n\nThe first and most prominent will be the Holmes-inspired 'Sherloque' Wells, but we can expect some more variations as the episodes unfold.\n\nAfter previously recurring on the show, Danielle Nicolet (Cecile Horton), Hartley Sawyer (Ralph Dibny / Elongated Man) and Jessica Parker Kennedy (Nora West-Allen) have also been promoted to the main cast for season 5.\n\nThe CW\n\nIt's not all good news, though: having previously transferred to spin-off Legends of Tomorrow, Keiynan Lonsdale later announced that he wouldn't be returning to either that show or The Flash as a regular this fall.\n\nIn a social post, Lonsdale later explained that now was \"the right time to continue [his] journey on an unknown path\" but insisted that his exit was not \"a total goodbye\" from the Arrow-Verse.\n\nWally will appear in season 5's premiere and is \"in three episodes this season\" - as confirmed by The Flash showrunner Todd Helbing. (No word yet on if they'll be three consecutive episodes, or if Kid Flash will pop up sporadically throughout.)\n\n\"We have not as much time with Kid Flash as I think everybody would like to see,\" Helbing said. But the story we have for him is really cool, so I hope everybody likes it.\"\n\nMeanwhile, Chris Klein — best known for playing Oz in the American Piemovies — will be shedding his nice guy persona for a considerably darker turn as the Big Bad in the new season of the DC TV series.\n\nGabriel Olsen/Getty Images\n\nKlein will be playing Cicada – not be a cult leader as in the comics, the character has been described as a \"grizzled, blue-collar everyman\" who seeks to eliminate metahumans one-by-one to settle a family grudge.\n\nGuest / recurring cast this year will include: KIana Madeira as a gender-swapped version of the comic book villain Spin, and America's Got Talent contestant Troy James as metahuman contortionist Peter Merkel (aka Rag Doll)...\n\nKyle Secor (who you may recognise from Veronica Mars or The Purge: Election Year) has also been cast as the elusive Dr. Thomas Snow — father to Caitlin. We predict one more awkward daddy / daughter reunion...\n\nAlongside Secor, Susan Walters will also be reprising her role as Caitlin's mother Dr. Carol Tannhauser.\n\nThe Flash season 5 plot: What will it be about?\n\nThe CW\n\nThe last season of The Flash closed with the reveal of Mystery Girl's identity (she's Nora West-Allen, Barry and Iris's daughter from the future!) and the next will explore the immediate ramifications, picking up – according to Helbing – \"right where we left off\".\n\nThe theme for this season is \"legacy\". That's according to Helbing, who elaborates, \"It's [about] what's really important to people, [in terms of] what they leave behind. Is it more important for Barry to be a good father, or The Flash?\"\n\nBut what is Nora's \"big, big mistake\"? Why has she travelled into the past when The Flash has previously established that time-travel is seriously perilous? And what's her beef with her mo Iris?\n\n\"Definitely something has happened to make me feel much closer to my father than my mother,\" Jessica Parker Kennedy has confirmed. \"It's something that you'll find out relatively early on in this season.\"\n\nThe CW\n\nSpeaking of Iris, she's going to be returning to her roots as a journalist this season, having previously sidelined her reporter gig to focus on leading Team Flash. \"I've been pushing for that for years,\" said Candice Patton. \"That's how we know her in the comic books, and that's where she got a lot of her agency in the comic books.\"\n\nWe'll also be exploring Caitlin Snow's childhood in more detail. It was always assumed that Caitlin (Danielle Panabaker) only became Killer Frost as an adult, but a resurfaced memory last season revealed that she's actually been carrying her icy alter-ego around from a very young age.\n\n\"We'll get to delve into that a little bit more,\" promised Danielle Panabaker, who'll also be making her Flash directorial debut this season with episode 18.\n\nA \"more mature and adult\" Ralph will be showcasing some more of his detective skills this season, while also possibly finding time to hit the town with Cisco following his break-up with (Jessica Camacho).\n\nThe CW\n\n\"There's going to be a lot to mine there, with the two of them being single men,\" said Hartley Sawyer. \"Cisco's single, his heart broken, Ralph's single... so lets go see what's out on the town!\"\n\nThe eighth episode of The Flash's fifth season, aired in late 2018, will also be the show's 100th outing. To mark the centenary, the team are planning a very special episode – helmed by Tom Cavanagh, in his third directorial effort on the show – but are remaining tight-lipped on the details.\n\n\"All I can you tell is... it's a little bit different,\" says Helbing. \"Normally our eighth episode is the crossover – that's going to be the ninth this season, [but] the eighth it's a big thing for us.\n\n\"It's going to have the typical mid-season finale ending I would say, but I can't get into too many details right now.\"\n\nImmediately following the big 100 will be episode 5x09, which will be The Flash's contribution to this year's epic ArrowVerse crossover - set to introduce Batwoman (Ruby Rose) and see The Flash finally share scenes with Superman (Tyler Hoechlin).\n\nThe CW has announced that it will be shaking up the usual DC TV schedule across three nights, moving The Flash to Sunday night on December 9 to kick off the crossover.\n\nBarry will also be getting a new costume this season, though the reveal of said suit didn't pass without controversy.\n\nAn unofficial shot of the costume leaked online in August, with Grant Gustin hitting back at trolls who'd both criticised the suit and body-shamed him online.\n\n\"I've had 20+ years of kids and adults telling me or my parents I was too thin,\" he wrote on Instagram. \"I've had my own journey of accepting it. \"I'm naturally thin, and my appetite is greatly affected by stress. Stress is something that ebbs and flows for me throughout a season. Thus, gaining weight is a challenge for me.\n\nThe CW\n\nGrant went on to tell fans that he was \"happy\" with his body and loved the new suit, but that his goal was to make other people with a similar body type to \"feel the same way.\"\n\n\"Not only that, but they should be able to feel like THEY could be a superhero on tv or film or whatever it may be someday,\" he wrote.\n\nGood on ya, Grant!\n\nWe got an official look at The Flash's new threads shortly afterwards, revealing a more comics-faithful look that does away with the old suit's 'chin-strap'.\n\nThe CW\n\nEven better... season 5's first trailer (see below) hints that the costume will spring out of a special ring, just like in the comic books!\n\n(Nora will also be suiting up as the speedster XS this year, with some on-set snaps of Kennedy in costume leaking in August.)\n\nThe Flash season 5 trailer: When will we see it?\n\nThe first footage from season 5 debuted at San Diego Comic-Con in July, with an explosive new trailer detailing the impact Nora's arrival, while hinting at the big secret she's keeping and the arrival of Cicada.\n\nA second teaser featuring fresh footage from the various ArrowVerse shows premiering this fall included a first look at The Flash's Barry Allen in action in his new costume.\n\nBookmark this page for all the latest The Flash season 5 news and updates.\n\nThe Flash airs on The CW in the US, and on Sky One and Now TV in the UK.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "keywords": [], "authors": ["Sam Ashurst"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a855034/the-flash-season-5-release-date-cast-plot-trailer/", "title": "The Flash season 5 release date, cast, plot, trailer and everything you need to know", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "The Flash season 5: Everything you need to know", "description": "When's Barry speeding back onto our screens?", "url": "http://www.digitalspy.com/tv/ustv/a855034/the-flash-season-5-release-date-cast-plot-trailer/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-12-03 12:25:26", "published_time": "2018-09-04 02:53:00", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "The Flash season 5 release date, cast, plot, trailer and everything you need to know", "description": "The Flash season 5 release date, cast, plot, trailer", "keywords": "The Flash season 5 release date, The Flash season 5 cast, The Flash season 5 plot, The Flash season 5 trailer, the flash grant gustin, the flash barry allen", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=0.5625xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Carols Valdes,Todd Helbing,Jesse L Martin,Candice Patton,Danielle Panabaker,Grant Gustin,Tom Cavanagh", "sailthru.date": "2018-09-04T14:53:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=1xw:0.8888888888888888xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/36/1536068719-the-flash-season-5-poster.jpg?crop=0.5625xw:1xh;center,top", "sailthru.socialtitle": "The Flash season 5: Everything you need to know", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1536000780.0, "source": "https://www.digitalspy.com", "summary": ""}