{"url": "https://money.usnews.com/money/blogs/my-money/articles/2017-06-28/11-best-fourth-of-july-sales-for-2017", "text": "Whether you're searching for deals on new appliances, outdoor gear, mattresses or clothing, this year's crop of Fourth of July sales has plenty to offer. (Rebecca Nelson/Getty Images)\n\nThe Fourth of July falls on a Thursday this year, creating a long holiday weekend for many. And when shoppers get extra time off work, retailers respond with sales. In fact, some Fourth of July sales have already begun.\n\nWhether you're searching for deals on new appliances, outdoor gear, mattresses or clothing, this year's crop of Fourth of July sales has plenty to offer. Use this list to navigate your many options, so you can return to the pool, parade or barbecue. Here are the best Fourth of July sales for 2019:\n\nAmerican Eagle Outfitters\n\nAthleta\n\nBarnes & Noble\n\nBass Pro Shops/Cabela's\n\nBest Buy\n\nBrooklyn Bedding\n\nDell\n\nGoogle Store\n\nHome Depot\n\nKarl Lagerfeld Paris\n\nMattress Firm\n\nOverstock\n\nPacSun\n\nRead on for more information about each July 4 sale.\n\nAmerican Eagle Outfitters\n\nThe retailer is running a clearance sale until July 5, which features 60% off plenty of warm-weather clothing, including T-shirts, shorts, dresses and light jackets.\n\nAthleta\n\nThe retailer's swimwear sale has already begun. Get 40% off swimwear and select other styles until supplies run out.\n\nBarnes & Noble\n\nLooking for your summer airplane or beach read? Use coupon code TAKE10 to get 10% off your order through the holiday weekend.\n\nBass Pro Shops/Cabela's\n\nThe outdoor retailers, which are under the same ownership umbrella, are running a Star Spangled Summer sale through Independence Day. It features up to 60% off a wide range of outdoor and camping items, including select tents, fishing and hunting equipment, hiking clothing, kayaks and more.\n\nBest Buy\n\nGet up to 40% off select appliances until July 10. You'll find savings not only on large kitchen and laundry appliances, but on small appliances and robotic vacuums as well. Plus, when you buy at least two appliances totaling $999 or more, you'll receive $50 to $500 in Best Buy gift cards, depending on how many appliances you buy and the total of your purchase.\n\nBrooklyn Bedding\n\nThe online bedding and mattress retailer is offering 25% off across the entire site through July 4. Use that discount on a new mattress, pillows or sheets.\n\nDell\n\nBeginning July 1, Dell's Black Friday in July event overlaps Independence Day. It includes deals on laptops, desktops, gaming computers and other electronics. Doorbuster deals, which launch at specific times, begin launching July 3 and continue until July 12.\n\nGoogle Store\n\nSave on smart home gadgets from Google and Nest, which Google recently acquired. The sale includes $30 off the Google Home smart speaker, $50 off the Google Nest Hub and bundled deals on smart thermostats, smart lights and more. The sale runs until July 17.\n\nHome Depot\n\nHome Depot is known for its huge Fourth of July sale, and this year, it delivers storewide savings again. Until July 10, save up to 40% on appliances. A wide range of large appliances are included in the sale, as well as robotic vacuums, upright vacuums and microwaves. Plus, save up to $600 instantly when you purchase multiple appliances. The size of your instant discount will depend on how many appliances you buy and the total of your purchase.\n\nHome Depot is also running a Red White and Blue savings event, which features up to 40% off patio furniture, up to 30% off tools, up to 20% off outdoor power equipment, including select lawn mowers, and other discounts.\n\nKarl Lagerfeld Paris\n\nUse promo code ESCAPE at checkout to get an extra 20% off your purchase. This deal lasts until July 8.\n\nMattress Firm\n\nThrough July 4, enjoy a variety of discounts. These include $200 off the Sleepy's Hush Firm mattress and $100 off the Beautyrest Ashaway Plus mattress. The sale offers free gifts with purchase as well. Spend at least $299, and get two free memory foam pillows or mattress protector. Spend at least $599, and get a free adjustable base, or two pillows and a mattress protector. Or spend at least $799 and get all of these free gifts.\n\nOverstock\n\nShop the Fourth of July Blowout sale until July 8. The sale features an extra 20% off in most departments, and 15% off garden and patio furniture. More deals will debut as Independence Day gets closer.\n\nPacSun\n\nUntil July 4, all items sitewide are buy one, get one free. The lower-priced item will be the free one.", "images": ["https://www.usnews.com/dims4/USNEWS/5738575/2147483647/thumbnail/84x84/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fcc%2F98%2F75cb376641019c29d74644ebc57e%2Fkristin-mcgrath.jpg", "https://media.beam.usnews.com/01/a9/b19bea1441659c77d0174e0d03ed/200316-usnlogo-design.png", "https://www.usnews.com/dims4/USNEWS/8ea8bab/2147483647/resize/1200x%3E/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fbe%2F3d%2Fcaf3470f4bf68f2dd8220f96e520%2F190628-sparklergirl-stock.jpg", "https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/dims4/USNEWS/f8b1946/2147483647/thumbnail/640x420/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2F31%2F48%2Fea3d2d1a440ebc9b4858c0466c04%2F151130-brokenpiggy-stock.jpg", "https://media.beam.usnews.com/50/3c/5438b2f142939830f903a1757d17/181116-wealthofknowledge-logo-design.jpg", "https://www.usnews.com/dims4/USNEWS/6e162fe/2147483647/thumbnail/640x420/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fbe%2F3d%2Fcaf3470f4bf68f2dd8220f96e520%2F190628-sparklergirl-stock.jpg"], "top_img": "https://www.usnews.com/dims4/USNEWS/8ea8bab/2147483647/resize/1200x%3E/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fbe%2F3d%2Fcaf3470f4bf68f2dd8220f96e520%2F190628-sparklergirl-stock.jpg", "keywords": [], "authors": ["July", "At A.M.", "Read More"], "canonical_link": "https://money.usnews.com/money/blogs/my-money/articles/best-fourth-of-july-sales", "title": "Best Fourth of July Sales for 2019", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "These retailers, including Athleta, PacSun, Home Depot and Best Buy, are offering the best bargains during the week of July 4.", "keywords": "Kristin McGrath ,personal finance,personal budgets,money,Independence Day,shopping,My Money,Spending", "site": "money-news", "zone": "blogs/my-money/articles", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "og": {"title": "Best Fourth of July Sales for 2019", "description": "These retailers are offering the best bargains during the week of July 4.", "image": "https://www.usnews.com/dims4/USNEWS/8ea8bab/2147483647/resize/1200x%3E/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fbe%2F3d%2Fcaf3470f4bf68f2dd8220f96e520%2F190628-sparklergirl-stock.jpg", "type": "article", "site_name": "US News & World Report", "url": "https://money.usnews.com/money/blogs/my-money/articles/best-fourth-of-july-sales"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/8ea8bab/2147483647/resize/1200x%3E/quality/85/?url=https%3A%2F%2Fmedia.beam.usnews.com%2Fbe%2F3d%2Fcaf3470f4bf68f2dd8220f96e520%2F190628-sparklergirl-stock.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Fourth of July Sales for 2019", "description": "These retailers are offering the best bargains during the week of July 4."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "optimizely": "Optimizely is running on this page."}, "movies": [], "publish_date": 1498579200.0, "source": "https://money.usnews.com", "summary": ""}