{"url": "https://en.wikipedia.org/wiki/E!_People%27s_Choice_Awards", "text": "American awards show\n\nThe People's Choice Awards, officially the E! People's Choice Awards since E! took it over in April 2017, is an American awards show, recognizing people in entertainment, voted online by the general public and fans. The show has been held annually since 1975,[1][2] with the winners originally determined using Gallup Polls until the switch to online voting in 2005.\n\nThe awards were created by Bob Stivers, who produced the first show in 1975.[3][4] The first awards recognized The Sting as Favorite Picture of 1974, Barbra Streisand as the year's Favorite Film Actress, and John Wayne as its Favorite Film Actor.[5] Ratings for the annual event peaked in 1977, when the third People's Choice Awards attracted 35.3 million viewers who witnessed Farrah Fawcett win the award for Favorite Female TV Star, Star Wars win as the Favorite Picture, and Streisand and Wayne win again in the Film Actress and Actor categories. So far, Ellen DeGeneres is the most awarded person, with a total of 20 awards.[6]\n\nIn 1982, Stiver sold the People's Choice Awards to Procter & Gamble Productions; under P&G, the ceremony was broadcast by CBS, and Procter & Gamble's brands held exclusive national advertising time across the entire telecast. In April 2017, the E! network announced that they had acquired the People's Choice Awards.[7][8]\n\nIn December 2017, E! announced that the 2018 ceremony would be held on November 11, 2018—moving from its previous January scheduling to reduce its proximity to the busier months of awards season. The ceremony was televised by E! and its international affiliates, with the network using an \"end-to-end\" experience to leverage its experience in covering other major awards shows.[9][10][11]\n\nCategories [ edit ]\n\nThe award categories have varied over the years. For example, the 16th People's Choice Awards had categories including Favorite All-Around Movie (Batman), and both a Favorite Movie Actor (Tom Cruise) and a World Favorite Movie Actor (Dustin Hoffman). At the 23rd People's Choice Awards, Rob Reiner was named the People's Choice Awards Honoree. More recently, the 32nd People's Choice Awards (broadcast in January 2006) included categories such as Favorite On-Screen Match-Up (Vince Vaughn and Owen Wilson in Wedding Crashers), Favorite Leading Lady (Reese Witherspoon), Favorite Tour (U2), and an award named after a Procter & Gamble brand: Nice 'n Easy Fans Favorite Hair (Faith Hill). In 2008, the People's Choice Awards introduced a new category: Favorite Sci-Fi Show. The nominees were Stargate Atlantis, Battlestar Galactica, and Doctor Who. Stargate Atlantis was the first recipient of the award.\n\nPoll-based awards [ edit ]\n\nIn the 20th century, the awards were based on results from Gallup polls. Each year, Gallup took a survey of different categories for favorite actor, actress, movie, artist, television program or group. The scope was unlimited—the public could choose whomever or whatever it liked. The results of the annual survey were announced in the form of the People's Choice Awards. Since polls have margins of error, many years' awards have had ties in at least one category, when Gallup declared that the voting was so close that a single winner could not be chosen. For instance, in 2003, both Spider-Man and The Lord of the Rings: The Fellowship of the Ring were recognized as Favorite Motion Picture.\n\nSwitch to online voting [ edit ]\n\nThe winners of the 31st People's Choice Awards (on January 9, 2005) were decided by online voting rather than Gallup polls. The nominees submitted for Internet voting were selected using an unpublished process involving editors at Entertainment Weekly, the show's production team and a panel of pop culture fans.\n\nThe nominees for the 32nd People's Choice Awards were determined by the web research company Knowledge Networks, which took a nationally representative sample of men and women ages 18 to 54, with and without Internet access, to come up with the nominees. After being presented with a list of candidates determined by national ratings averages, box office grosses and album sales, they had the option to write in their favorites. Knowledge Networks recruits its panel by using a RDD phone recruitment method and provides a web TV and Internet access to households without Internet access enabling them to infer back to the entire population.\n\nThe nominees for the 2010 People's Choice Awards were determined by the media research company Visible Measures, which specializes in measuring Internet video audience behavior. The announcement of this partnership stated,\n\n\"For the first time ever, the People's Choice Awards has incorporated Internet video viewing data into the initial nominee selection process, depending on Visible Measures True Reach metrics to objectively measure online video popularity. [...] Visible Measures worked with the People's Choice Awards to determine each potential nominees' popularity on a True Reach basis, a unique measure of the total audience that has been exposed to an online video campaign – regardless of how widely the campaign spreads or where it appears. To measure True Reach, Visible Measures deploys a robust and patented set of technologies with the goal of capturing the universe of Internet video viewership data in near real-time.\"[12]\n\nPast categories [ edit ]\n\nThese are some of the past categories for the People's Choice Awards:[13][14]\n\nMovies [ edit ] Favorite Movies\n\nFavorite Movie Actor\n\nFavorite Movie Actress\n\nFavorite Action Movie\n\nFavorite Action Actor\n\nFavorite Action Actress\n\nFavorite Animated Movie Voice\n\nFavorite Cast [15]\n\nFavorite Comedy Movie\n\nFavorite Comedic Movie Actor\n\nFavorite Comedic Movie Actress\n\nFavorite Dramatic Movie\n\nFavorite Dramatic Movie Actor\n\nFavorite Dramatic Movie Actress\n\nFavorite Family Movie\n\nFavorite Horror Movie\n\nFavorite Movie Icon Television [ edit ] Favorite TV Show\n\nFavorite Network TV Comedy\n\nFavorite Comedy TV Actor\n\nFavorite Comedy TV Actress\n\nFavorite Network TV Drama\n\nFavorite Dramatic TV Actor\n\nFavorite Dramatic TV Actress\n\nFavorite Cable TV Comedy\n\nFavorite Cable TV Drama\n\nFavorite Cable TV Actor\n\nFavorite Cable TV Actress\n\nFavorite Premium Cable TV Show\n\nFavorite Premium Cable TV Actor\n\nFavorite Premium Cable TV Actress\n\nFavorite TV Crime Drama\n\nFavorite Crime Drama TV Actor\n\nFavorite Crime Drama TV Actress\n\nFavorite Network Sci-Fi/Fantasy Show\n\nFavorite Cable Sci-Fri/Fantasy Show\n\nFavorite Sci-Fi/Fantasy Actor\n\nFavorite Sci-Fi/Fantasy Actress\n\nFavorite Competition TV Show\n\nFavorite Daytime TV Host\n\nFavorite Daytime TV Hosting Team\n\nFavorite Late Night Talk Show Host\n\nFavorite Streaming Series\n\nFavorite Actor in a New TV Series\n\nFavorite Actress in a New TV Series\n\nFavorite Animated TV Show\n\nFavorite New TV Comedy\n\nFavorite New TV Drama Digital [ edit ] Favorite Comedic Collaboration\n\nFavorite Social Media Celebrity\n\nFavorite Social Media Star\n\nFavorite Mobile Game\n\nFavorite Video Game\n\nFavorite YouTube Star\n\nCBS.com's Favorite Digital Obsession\n\nCurrent categories [ edit ]\n\nThe first ceremony in 1975 had 14 categories. In 2016, 74 categories were established.[16]\n\nAs of 2018, these are the current categories:[17][18]\n\nMovies [ edit ]\n\nMovie of the Year\n\nComedy Movie of the Year\n\nAction Movie of the Year\n\nDrama Movie of the Year\n\nFamily Movie of the Year\n\nDrama Movie Star of the Year\n\nMale Movie Star of the Year\n\nFemale Movie Star of the Year\n\nComedy Movie Star of the Year\n\nAction Movie Star of the Year\n\nMusic [ edit ]\n\nMale Artist of the Year\n\nFemale Artist of the Year\n\nGroup of the Year\n\nSong of the Year\n\nAlbum of the Year\n\nCountry Artist of the Year\n\nLatin Artist of the Year\n\nMusic Video of the Year\n\nConcert Tour of the Year\n\nTelevision [ edit ]\n\nDrama Show of the Year\n\nComedy Show of the Year\n\nRevival Show of the Year\n\nReality Show of the Year\n\nCompetition Show of the Year\n\nMale TV Star of the Year\n\nFemale TV Star of the Year\n\nDrama TV Star of the Year\n\nComedy TV Star of the Year\n\nDaytime Talk Show of the Year\n\nNighttime Talk Show of the Year\n\nCompetition Contestant of the Year\n\nReality TV Star of the Year\n\nBingeworthy Show of the Year\n\nSci-Fi/Fantasy Show of the Year\n\nPop culture [ edit ]\n\nSocial Star of the Year\n\nBeauty Influencer of the Year\n\nSocial Celebrity of the Year\n\nAnimal Star of the Year\n\nComedy Act of the Year\n\nStyle Star of the Year\n\nGame Changer of the Year\n\nPop Podcast of the Year\n\nVideo Game of the Year\n\nCeremonies [ edit ]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/40px-Ambox_current_red.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/People%27s_Choice_Awards", "title": "People's Choice Awards", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}