{"url": "https://deadline.com/2017/06/jerrod-carmichael-leaving-the-carmichael-show-nbc-1202122423/", "text": "UPDATED with cancellation confirmation: NBC’s The Carmichael Show won’t be returning for a fourth season. The network and studio announced the news shortly after creator and star Jerrod Carmichael revealed he was exiting the series as cast options were set to expire at the end of today.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nThe Carmichael Show, from 20th TV, which is the leading studio, and Universal TV, scored a dramatic eleventh-hour renewal last year, with a deal coming after NBC had announced its fall schedule and its executives had faced questions about the show’s uncertain future in light of its acclaim.\n\nCarmichael released a statement to Deadline today through his publicist.\n\n“For three seasons (okay 2.5), I got to make a show that I love with my friends,” he said. “It’s something I’ve wanted to do since I was 13. Now, I’m excited to go make other things that I love. Thank you to every person who worked on or watched The Carmichael Show.“\n\nJust like last May, we heard renewal negotiation between NBC and 20th TV had been difficult, with the two sides far apart and talks going slowly. With no clear indications from the network one way or the other, I hear 20th TV quietly sent out feelers to other networks to gauge potential interest in case NBC opted to cancel the show.\n\n“The Carmichael Show was such a wonderful show that we choose to focus today not on its loss but on the three incredible seasons we had the pleasure to produce,” said 20th Century Fox TV Presidents Jonnie Davis and Howard Kurtzman today in a statement. “We are thankful to the brilliant Jerrod Carmichael and his talented cast, and to showrunner Danielle Sanchez-Witzell, our fantastic writers and devoted production team. It’s a rarity that a comedy series tackles the social and political issues of the day in such a clever and hilariously funny way. This show was special, and we will miss it.”\n\nSaid NBC Entertainment Chairman Bob Greenblatt and President Jennifer Salke: “We are enormously proud of The Carmichael Show and Jerrod’s talent and vision to do a classic family sitcom that also taps into issues and relevant stories from the real world. We thank and salute the cast, crew, and producers — and especially Jerrod — for three critically acclaimed seasons.”\n\nSeason 3 of The Carmichael Show — a rare critically praised multi-camera sitcom — was produced for this midseason but was held until May 31. There had been concerns the delay would chip away at the show’s timeliness, which had been part of its DNA as the show had regularly taken on hot-button subjects like police violence.\n\nNBC\n\nBut Season 3 has proven very timely — two weeks ago NBC postponed at the last minute an episode that deals with a mass shooting as it fell on a day of two real-life mass shootings in the U.S. — including the one at a congressional GOP baseball practice. The network’s decision was publicly criticized by Carmichael who called it “criminal.” That episode aired last night.\n\nLast week, The Carmichael Show tackled the N-word and whether white people can say it on the heels of the controversy surrounding comedian Bill Maher’s use of the word on his HBO show.\n\nRatings-wise, The Carmichael Show has been relatively stable. Airing on Wednesdays behind Little Big Shots and its offshoot Little Big Shots: Forever Young, the comedy’s adults 18-49 ratings have stayed within the 0.7-0.9 in Live+Same Day.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=1024", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F06%2Fjerrod-carmichael-leaving-the-carmichael-show-nbc-1202122423%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202122423&comment_count=283", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=301&h=202&crop=1"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=1024", "keywords": [], "authors": ["Nellie Andreeva Denise Petski", "Nellie Andreeva", "Denise Petski"], "canonical_link": "https://deadline.com/2017/06/jerrod-carmichael-leaving-the-carmichael-show-nbc-1202122423/", "title": "‘The Carmichael Show’ Canceled After 3 Seasons At NBC After Star Leaks News", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "NBC’s The Carmichael Show won't be returning for a fourth season.", "news_keywords": "Jerrod Carmichael, NBC, The Carmichael Show", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Carmichael Show’ Canceled After 3 Seasons At NBC After Star Leaks News", "url": "https://deadline.com/2017/06/jerrod-carmichael-leaving-the-carmichael-show-nbc-1202122423/", "description": "UPDATED with cancellation confirmation: NBC’s The Carmichael Show won’t be returning for a fourth season. The network and studio announced the news shortly after creator and star Jerrod Carmi…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=1024", "width": 1024, "height": 682, "alt": "The Carmichael Show"}, "locale": "en_US"}, "article": {"published_time": "2017-06-30T20:17:56+00:00", "modified_time": "2017-06-30T21:45:43+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘The Carmichael Show’ Canceled After 3 Seasons At NBC After Star Leaks News"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=1024", "alt": "The Carmichael Show"}, "card": "summary_large_image", "creator": "@DeadlineNellie", "title": "‘The Carmichael Show’ Canceled After 3 Seasons At NBC After Star Leaks News", "description": "NBC’s The Carmichael Show won't be returning for a fourth season."}, "author": "Denise Petski", "content_type": "Article", "post_id": 1202122423, "title": "'The Carmichael Show' Canceled After 3 Seasons At NBC After Star Leaks News", "published_at": "2017-06-30 13:17:56", "image": "https://pmcdeadline2.files.wordpress.com/2017/06/the-carmichael-show.jpg?w=296&h=166&crop=1", "comment_count": 283, "tags": "The Carmichael Show", "topics": "TV", "body": "UPDATED with cancellation confirmation: NBC’s The Carmichael Show won't be returning for a fourth season. The network and studio announced the news shortly after creator and star Jerrod Carmichael revealed he was exiting the series as cast options were set to expire at the end of today.\r\n\r\nThe Carmichael Show, from 20th TV, which is the leading studio, and Universal TV, scored a dramatic eleventh-hour renewal last year, with a deal coming after NBC had announced its fall schedule and its executives had faced questions about the show’s uncertain future in light of its acclaim.\r\n\r\nCarmichael released a statement to Deadline today through his publicist.\r\n\r\n\"For three seasons (okay 2.5), I got to make a show that I love with my friends,\" he said. \"It's something I've wanted to do since I was 13. Now, I'm excited to go make other things that I love. Thank you to every person who worked on or watched The Carmichael Show.\"\r\n\r\nJust like last May, we heard renewal negotiation between NBC and 20th TV had been difficult, with the two sides far apart and talks going slowly. With no clear indications from the network one way or the other, I hear 20th TV quietly sent out feelers to other networks to gauge potential interest in case NBC opted to cancel the show.\r\n\r\n“The Carmichael Show was such a wonderful show that we choose to focus today not on its loss but on the three incredible seasons we had the pleasure to produce,\" said 20th Century Fox TV Presidents Jonnie Davis and Howard Kurtzman today in a statement. \"We are thankful to the brilliant Jerrod Carmichael and his talented cast, and to showrunner Danielle Sanchez-Witzell, our fantastic writers and devoted production team. It’s a rarity that a comedy series tackles the social and political issues of the day in such a clever and hilariously funny way. This show was special, and we will miss it.\"\r\n\r\nSaid NBC Entertainment Chairman Bob Greenblatt and President Jennifer Salke: “We are enormously proud of The Carmichael Show and Jerrod's talent and vision to do a classic family sitcom that also taps into issues and relevant stories from the real world. We thank and salute the cast, crew, and producers -- and especially Jerrod -- for three critically acclaimed seasons.\"\r\n\r\nSeason 3 of The Carmichael Show -- a rare critically praised multi-camera sitcom -- was produced for this midseason but was held until May 31. There had been concerns the delay would chip away at the show’s timeliness, which had been part of its DNA as the show had regularly taken on hot-button subjects like police violence.\r\n\r\n\r\n\r\nBut Season 3 has proven very timely — two weeks ago NBC postponed at the last minute an episode that deals with a mass shooting as it fell on a day of two real-life mass shootings in the U.S. -- including the one at a congressional GOP baseball practice. The network’s decision was publicly criticized by Carmichael who called it “criminal.” That episode aired last night.\r\n\r\nLast week, The Carmichael Show tackled the N-word and whether white people can say it on the heels of the controversy surrounding comedian Bill Maher’s use of the word on his HBO show.\r\n\r\nRatings-wise, The Carmichael Show has been relatively stable. Airing on Wednesdays behind Little Big Shots and its offshoot Little Big Shots: Forever Young, the comedy's adults 18-49 ratings have stayed within the 0.7-0.9 in Live+Same Day.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1498853876.0, "source": "https://deadline.com", "summary": ""}