{"url": "https://people.com/tv/kim-kardashian-rob-blac-chyna-drama/", "text": "Months after Rob Kardashian‘s drama with Blac Chyna reached its explosive peak, the aftermath is being documented on Keeping Up with the Kardashians.\n\nIn a preview of Sunday’s episode, sisters Kim and Khloé Kardashian sit down to discuss their brother’s bitter legal battle with his ex-fiancée, which began after he posted graphic and expletive-ridden content about her on social media in July — including three naked photos — while accusing her of drug use, alcohol abuse and infidelity.\n\nGet push notifications with news, features and more.\n\n“Did you see how I just went off on Rob in our group text?” says Kim, 37. “I couldn’t take it.”\n\nKhloé, 33, points out that there’s a “plus and a minus” to the situation — with the plus side being that there’s “no way” Rob, 30, and Chyna, 29, could “get back together after this.”\n\n“Let’s focus on the positive,” Khloé says. “The negative is all of this other s— right now.”\n\n“The negative is just that like, with Rob having sisters, he should just know better,” Kim says. “He should have just like, controlled himself.”\n\nBut Khloé is still in Rob’s corner.\n\n“It just sucks,” she tells Kim. “He’s made out to [be] this bad guy when [Chyna] is taunting him. Love makes you do f—ed up things. Do you think anyone’s proud of that? No. You don’t f— with someone’s heart and emotions.”\n\nAfter Rob’s social media rampage, Chyna and her legal team accused him of violating California’s revenge porn laws, claiming in court documents obtained by PEOPLE that he allegedly hit her and threatened to kill himself multiple times. A judge later granted her a set of restraining orders against her ex.\n\nHis actions launched a two-month-long custody war over their 14-month-old daughter Dream Renée. The two agreed to joint custody Sept. 15, PEOPLE confirmed — though at the time, Chyna’s lawyer Lisa Bloom said the decision “does not resolve all disputes between Chyna and Rob.”\n\n“So Rob and Chyna have officially broken up, but they obviously still have to communicate for the custody of Dream,” Khloé says in the sneak peek. “They’re still having a hard time getting along. The legal battle that has been going on between the two of them has been super frustrating. I feel like this is escalating to a place that none of us could have ever imagined.”\n\nIn September, Rob and his sister Kylie Jenner, 20, sued Chyna for battery, assault and vandalism, alleging she attempted to choke Kardashian with an iPhone cord during a fight in December 2016. (Jenner owns the home where the alleged altercation took place.)\n\nIn the complaint, the siblings alleged Chyna made a “deliberate attempt to extort the Kardashian family for her own monetary gains” and claimed her decision to have a baby with Rob was “nothing short of an outright fraud to shake down the Kardashian family.”\n\nIn October, Chyna filed her own lawsuit against her ex for allegedly damaging her brand and verbally and physically abusing her. In the filing obtained by PEOPLE, Chyna claims she has suffered “significant damages” from his social media posts. She alleged the nude photo scandal — along with influence from the Kardashian family — are what got Rob & Chyna, her and Rob’s E! reality show, axed before a season 2.\n\nShe also accused Rob of physical abuse, alleging that her ex once grabbed her phone out of her hand and “violently knocked her to the ground where she landed on her hands and knees” after she tried to call Tyga, with whom she shares 5-year-old son King Cairo and who previously dated Jenner for almost three years.\n\nRELATED: Lawsuits, Assault Accusations and Social Media Wars — Blac Chyna and Rob Kardashian’s Rocky History\n\nRob, who denies the assault claims, and his family have requested that the case be dismissed. According to court documents filed Dec. 27 in the Superior Court of Los Angeles and obtained by The Blast, Rob “generally and specifically denies each of the allegations” and claimed Chyna “did not suffer any injury or harm as a result of any conduct by [Kardashian].”\n\nIn a statement to PEOPLE in response, Chyna’s attorney said, “We are confident that we will prevail on this motion and at trial.”\n\nKeeping Up with the Kardashians airs this Sunday and Monday at 9 p.m. ET on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=842&h=441&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-west.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=842&h=441&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-west.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kim-kardashian-rob-blac-chyna-drama/", "title": "Kim and Khloé Kardashian: Rob Should Have 'Controlled Himself' During Blac Chyna Drama", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Blac Chyna,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,News,Rob Kardashian,TV", "news_keywords": "Blac Chyna,Keeping Up with the Kardashians,Khloé Kardashian,Kim Kardashian,News,Rob Kardashian,TV", "description": "\"With Rob having sisters, he should just know better,\" says Kim Kardashian West in a Keeping Up with the Kardashians sneak peek", "og": {"title": "Kim and Khloé Kardashian: Rob Should Have 'Controlled Himself' During Blac Chyna Drama", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-kardashian-rob-blac-chyna-drama/", "description": "Months after Rob Kardashian‘s drama with Blac Chyna reached its explosive peak, the aftermath is being documented on&nbsp;Keeping Up with the Kardashians. In a preview&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=842&h=441&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-west.jpg", "width": 842, "height": 441}}, "pinterest": {"url": "https://people.com/tv/kim-kardashian-rob-blac-chyna-drama/", "description": "\"With Rob having sisters, he should just know better,\" says Kim Kardashian West in a Keeping Up with the Kardashians sneak peek", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-west.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-kardashian-rob-blac-chyna-drama/", "title": "Kim and Khloé Kardashian: Rob Should Have 'Controlled Himself' During Blac Chyna Drama", "description": "\"With Rob having sisters, he should just know better,\" says Kim Kardashian West in a Keeping Up with the Kardashians sneak peek", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=842&h=441&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fkim-kardashian-west.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/lzZadh-D8Tk"], "publish_date": null, "source": "https://people.com", "summary": ""}