{"url": "https://mic.com/articles/11673/who-did-emily-maynard-pick-the-bachelorette-dumps-arie-and-makes-the-right-choice", "text": "It is official! Emily Maynard and Jef Holm, the edgy, Mormon entrepreneur, are engaged to be married.\n\nIn a tearful season finale Sunday night, after meeting daughter Ricki for the first time, Jef got down on one knee and proposed to Emily, to which she hastily accepted. However, instead of rejecting the proposal of Arie Luyendyk Jr., the racecar driver, she respectfully let him go the day before, sparing him the embarrassment that many before have experienced on the show.\n\nInterestingly, it was later revealed that after the show ended Arie traveled to Charlotte, North Carolina, the hometown of Emily, because he didn’t feel their emotional breakup had enough closure. Although he didn’t see Emily, they talked on the phone, and he dropped off the diary he kept with him throughout the journey on her doorstep, urging her to read through it. However, Emily has not yet read the diary, and she revealed as much last night on the live portion of the show when she took out the diary which was still inside a sealed envelope.\n\nWill Jef and Emily last? Only time will tell. But, I can tell you that they definitely have a better shot at working out than she would have had with Arie, whose fast-paced racecar driver lifestyle would be difficult to juggle with a family. Jef, on the other hand, is the much safer bet: not only does his job seem very flexible, but also he expressed his feelings to Emily whereas Arie demonstrated them physically and sexually. If she had chosen Arie, their relationship would most likely have suffered.\n\nWith another season of The Bachelorette in the record books, who will be the next man chosen to be on The Bachelor? My two bets would be Arie and Sean Lowe, the insurance agent who made it all the way to the final three in Curacao only to be let go. Rumors say it will be Sean, but don’t count Arie out. Both would make for interesting seasons.", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://cdn2.bustle.com/mic/2020/favicon-17b7a43e11.ico", "https://imgix.bustle.com/uploads/image/2019/2/6/29fa1353-f9a4-4ba3-a604-7682ced25c21-group-573x-1200x457.png?w=1020&h=576&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://cdn2.bustle.com/mic/2020/favicon-17b7a43e11.ico", "keywords": [], "authors": [], "canonical_link": "https://www.mic.com/articles/11673/who-did-emily-maynard-pick-the-bachelorette-dumps-arie-and-makes-the-right-choice", "title": "Who Did Emily Maynard Pick: The Bachelorette Dumps Arie and Makes the Right Choice", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@mic"}, "og": {"site_name": "Mic", "url": "https://www.mic.com/articles/11673/who-did-emily-maynard-pick-the-bachelorette-dumps-arie-and-makes-the-right-choice", "type": "article", "title": "Who Did Emily Maynard Pick: The Bachelorette Dumps Arie and Makes the Right Choice", "description": "It is official! Emily Maynard and Jef Holm, the edgy, Mormon entrepreneur, are engaged to be married.\nIn a tearful season finale Sunday night, after meeting daughter Ricki for the first time, Jef got down on one knee and proposed to Emily, to which…"}, "description": "It is official! Emily Maynard and Jef Holm, the edgy, Mormon entrepreneur, are engaged to be married.\nIn a tearful season finale Sunday night, after meeting daughter Ricki for the first time, Jef got down on one knee and proposed to Emily, to which…"}, "movies": [], "publish_date": null, "source": "https://mic.com", "summary": ""}