{"url": "https://abc.go.com/shows/new-years-rockin-eve/news/latest/camila-cabello-nick-jonas-and-sugarland-to-perform-live-from-time-square", "text": "dick clark productions and ABC today announced that chart-topping singer/songwriter Camila Cabello, multiplatinum singer/songwriter and actor Nick Jonas and award-winning duo Sugarland are set to perform live for more than 1 million people in Times Square on Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018 in the hours leading up to the 2018 countdown. America's largest celebration of the year will take place on SUNDAY, DEC. 31, beginning at 8:00 p.m. EST on The ABC Television Network. Additional performers will be announced soon.\n\nDick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018 marks the 46th anniversary of America's largest celebration of the year and will include five-and-a-half hours of special performances and reports on New Year's celebrations from around the globe. Ryan Seacrest will host the primetime festivities and lead the traditional countdown to midnight from Times Square in New York City, as he has for the last 12 years, with live onsite reporting from actress and comedian Jenny McCarthy. Multiplatinum music superstar Ciara will ring in the New Year from the west coast as the new host of the Hollywood Party in Los Angeles.\n\nCuban born singer/songwriter Camila Cabello (Epic Records / SYCO) is no stranger to the spotlight. Beginning her official solo career after four years in Fifth Harmony, Cabello released her much-anticipated debut single, \"Crying in the Club,\" to rave reviews. Cabello's newest song \"Havana,\" was released in August and is currently exploding on the charts. It reached No. 1 on the pop radio chart, which makes this her second top 40 No. 1 as a solo artist. The track was No. 1 on the iTunes overall top songs chart, No. 2 on the Spotify Global chart and hit No. 1 in 80 countries around the world. The song has over 400 million streams and 304 million YouTube views. She had already earned a chart-topping smash with the recent double platinum-certified hit \"Bad Things\" with MGK. The track generated over 240 million Spotify streams. As a result of its success, she became \"the first female artist to hit No. 1 on Top 40 Radio with and without a group.\" Cabello was recently featured on J Balvin and Pitbull's \"Hey Ma\" from the worldwide hit film \"Fate of the Furious\" and its chart-topping soundtrack as well as \"Know No Better.\" She has also collaborated with Shawn Mendes for the platinum-certified duet, \"I Know What You Did Last Summer,\" which reached 10 at pop radio and hit No. 20 on The Hot 100 chart. Her debut album is due out January 2018.\n\nMultiplatinum and Grammy-nominated recording artist, actor and award-winning songwriter, Nick Jonas, released his self-titled debut album in November 2014. The critically acclaimed album included the double platinum and No. 1 U.S. radio hit, \"Jealous,\" and his sultry chart-climbing radio single, \"Chains.\" A recipient of the Songwriters Hall of Fame's prestigious Hal David Starlight Award, Jonas released his sophomore solo album, \"Last Year Was Complicated,\" in June 2016. The album, which included the platinum hit \"Close\" featuring Tove Lo, debuted as the No. 1 selling album of the week. In 2017, Nick released a new single \"Find You\" off of his upcoming album. Jonas also wrote an original song titled \"Home\" for the movie \"Ferdinand,\" released by FOX Animation. As an actor, Jonas garnered unanimous critical praise for his lead role in the 2016 Sundance Film Festival favorite \"Goat,\" which was produced by and featured James Franco. He also appeared in a guest-starring role in Fox's horror-comedy series, \"Scream Queens.\" Jonas starred in the gritty television show \"Kingdom,\" a mixed martial arts drama that premiered in the fall of 2014. Next, Jonas will appear alongside Dwayne Johnson, Kevin Hart, and Jack Black in Sony's reimagining of \"Jumanji,\" out December 20. Jonas is currently in production on Lionsgate's post-apocalyptic thriller, \"Chaos Walking,\" which also stars Daisy Ridley and Tom Holland, and is scheduled for release in March 2019.\n\nGrammy Award-winning duo Jennifer Nettles and Kristian Bush are refreshing their musical vision while staying true to the authentic sound and emotive songwriting that made Sugarland one of the most successful acts in country music history. Since the band's inception in 2002, Sugarland has sold nearly 10 million albums domestically, achieving high-mark sales with platinum-certified \"The Incredible Machine,\" 2X platinum \"Love on the Inside\" and 3X platinum \"Twice the Speed of Life\" as well as \"Enjoy the Ride.\" The superstars have also garnered platinum-certified singles \"All I Want to Do\" and \"Stay\" as well as 2X platinum hit \"Stuck Like Glue.\" The pair has amassed six gold-certified smashes with \"Baby Girl,\" \"It Happens,\" \"Just Might (Make Me Believe),\" \"Settlin',\" \"Something More\" and \"Want To,\" while enjoying a host of industry accolades including five consecutive CMA Awards for Vocal Duo of the Year (2007-2011), five ACM Awards (including Song of The Year and Single of The Year) and Grammy Awards for Best Country Performance by a Duo or Group with Vocals and Best Country Song for \"Stay.\" The chart-toppers have earned seven No. 1 singles to date and over 260 million on-demand streams. Sugarland is currently back in the studio working on their new studio album, a joint venture with Big Machine Records and UMG Nashville, while simultaneously mapping out tour plans for 2018.\n\nThe complete lineup airing Sunday, Dec. 31, on ABC is:\n\n8:00-10:00 p.m. EST – \"Dick Clark's Primetime New Year's Rockin' Eve with Ryan Seacrest 2018 – Part 1\"\n\n10:00-11:00 p.m. EST – \"Dick Clark's Primetime New Year's Rockin' Eve with Ryan Seacrest 2018 – Part 2\"\n\n11:30 p.m.-1:09 a.m. EST – \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018 – Part 1\"\n\n1:09-2:13 a.m. EST – \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018 – Part 2\"", "images": ["https://assets.cdn.watchdisneyfe.com/delta/assets/abc/abc.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/search.png", "https://cdn1.edgedatg.com/aws/v2/abc/DickClarksNewYearsRockinEvewithRyanSeacrest/blog/2103900/afe11dd678839c5841944594b6233cf4/512x288-Q90_afe11dd678839c5841944594b6233cf4.jpg", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/facebook.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/twitter.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/DickClarksNewYearsRockinEvewithRyanSeacrest/blog/2103900/afe11dd678839c5841944594b6233cf4/512x288-Q90_afe11dd678839c5841944594b6233cf4.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/shows/new-years-rockin-eve/news/latest/camila-cabello-nick-jonas-and-sugarland-to-perform-live-from-time-square", "title": "Camila Cabello, Nick Jonas and Sugarland to Perform Live From Time Square", "meta_data": {"fb": {"app_id": 137585909851}, "twitter": {"card": "summary_large_image", "site": "@NYRE", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DickClarksNewYearsRockinEvewithRyanSeacrest/blog/2103900/afe11dd678839c5841944594b6233cf4/512x288-Q90_afe11dd678839c5841944594b6233cf4.jpg"}, "og": {"url": "https://abc.com/shows/new-years-rockin-eve/news/latest/camila-cabello-nick-jonas-and-sugarland-to-perform-live-from-time-square", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DickClarksNewYearsRockinEvewithRyanSeacrest/blog/2103900/afe11dd678839c5841944594b6233cf4/512x288-Q90_afe11dd678839c5841944594b6233cf4.jpg", "description": "Multiplatinum music superstars are performing live from Times Square on \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018\"", "title": "Camila Cabello, Nick Jonas and Sugarland to Perform Live From Time Square | Dick Clark's New Year's Rockin' Eve with Ryan Seacrest", "locale": "en_US"}, "keywords": "Camila Cabello, Nick Jonas and Sugarland to Perform Live From Time Square, Dick Clark's New Year's Rockin' Eve with Ryan Seacrest blogs", "description": "Multiplatinum music superstars are performing live from Times Square on \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest 2018\"", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/aws/abc/brand/fall2018/favicon_ie10.png", "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "google-site-verification": "5ojqqxU4pdyoa-4TgjCukgNv4eEl-8TGQZPsRhznWXc", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}