{"url": "https://www.tourradar.com/days-to-come/5-kardashian-vacations-ranked/", "text": "They may have started off as a quick sideshow to the main stage that was Paris Hilton’s entire life but the early 2000s were a much different time. Oversized shades were still in style for crying out loud! This was considered the epitome of fashion:\n\nBut now it’s 2017 and the Kardashians are everywhere. Their show, aptly named, Keeping up with the Kardashians, has been on E! for 13 seasons, and in that time Kim’s been married 3 times, famous Olympian and Kardashian patriarch Bruce Jenner became Caitlyn Jenner, Kendall started a career in high fashion and Kylie’s face and proportions have evolved faster than my level 10 Charmander:\n\nBut we’re not here to throw shade. We’re a travel blog, so to be honest, all we really care about are the epic vacations this overexposed family take together every year. From the Western United States all the way to Southeast Asia, we’ve decided to rank our favourite Kardashian vacations based on a highly scientific algorithm that includes decadence, drama and damage to your bank account.\n\n5. Vail, Colorado, United States\n\nEveryone loves a snow bunny right? The Kardashians are no exception to this rule and it’s understandable when you consider that skiing is excellent exercise. After all, when you have a 10 person camera crew following you around 24/7 it’s sort of essential that at least some of your vacations involve physical activity. You really can’t pick a better place in the United States to go skiing than Colorado, with incredible ski towns like Aspen and Breckenridge, the state’s glorious expansive mountain range offers a lot to the winter lovers out there. Vail, in particular, is a great place to hit the slopes if you’re stuck in an awkward co-parenting situation with your alcoholic/sex addict ex-partner or if you’re just trying to get away from it all with your mega-star rapper husband: perfect for every kind of relationship!\n\n\n\nNow we can’t lie to you: skiing, in general, is an expensive hobby to have. From equipment rentals to lift passes, just partaking in the sport itself can be tough on your bank account. I had some trouble narrowing down exactly where the Kardashians stayed this time but if you want to recreate the magic you can choose from any place that Vogue considers cool like the Four Seasons Vail or the Sonnenalp Hotel, both of which are reasonably priced at a meager $300 a night for peasants like me and you. If you’re prepared to leave your two private jets at home and simply take a Greyhound then you’ll make this trip even more affordable!\n\nDecadence: 3 out of 5 (plenty of 5-star restaurants with mountain views to choose from but nothing too outrageously indulgent)\n\nDrama: 1 out of 5 (It gets one star instead of zero because at least Kanye let himself be on camera this time)\n\nDamage to your bank account: 3 out of 5 (Skiing is expensive, accommodations are expensive, but if you visit during the off-season and pack a cooler full of freeze-dried astronaut food you could make it work on a normal person budget)\n\n4. Phuket, Thailand\n\nIt’s possible that nobody told the Kardashians that it’s easy to live quite lavishly in Thailand for only $70 a night (I’m talking at a really nice 5-star hotel) because they settled on the nutso Iniala Beach House, a $150,000 per week beachfront rental in Phuket. But if my NBA star husband had just abandoned me, forcing me to move in with my shut-in, jobless brother, I might feel like I deserve to indulge a little too. And indulge is something the Kardashians do as if it were an Olympic sport. The house they called home in Thailand features hot tubs in every bedroom and an instagrammable infinity pool that spills onto Phuket’s golden sands. The rooms are expertly decorated, with high ceilings and floor to ceiling windows scattered throughout.\n\nBut as the Kardashians show us, there’s way more to do in Thailand than just relax in your crazy resort style rental. You can go ziplining through the jungle, take 1200 selfies on the country’s many beautiful beaches, lose yourself (and your worried parents) in the many unique shops and bars or celebrate your problematic and privileged self by visiting local orphanages or taking pictures with “rescued” elephants.\n\n4 out of 5\n\nDrama: 2 out of 5 (Average vacation by Kardashian standards but brother Rob bailing at the last minute made things exciting)\n\nDamage to your bank account: 1 out of 5 (You can stay in decent places for as little as $4 a night and eat for under $5 a day, of course, sacrifices will need to be made)\n\n3. Guanacaste, Costa Rica\n\nThe most recent Kardashian escape has left us desperate for a plane ticket to this Central American country. We’ve already covered why it’s the perfect escape for every family but as usual, seeing it through the eyes of a Kardashian has added a whole new enticing element to Costa Rica. This time the family (including on-again, off again boyfriend of Kourtney, Scott Disck) tucked themselves away in the northwest province of Guanacaste along the country’s Pacific Coast at the incredibly exclusive and very private, Villa Manzu. The villa, available at a reasonable $16,500 a night, offers eight suites, includes over 30,000 square feet and covers about five acres in an already isolated peninsula. There’s also a spa, two swimming pools, a theatre and a bar for when you and your closest millionaire friends need to unwind. Oh and of course, chef-prepared meals are delivered to you daily and the staff is on hand to answer questions regarding the country’s geography and culture.\n\nBut maybe endless rain forests, diverse wildlife and delicious coffee aren’t what you’re all about. That’s okay too because when you stay in a steamy, private resort there’s plenty else to get up to. For instance, you could scream at your sisters or scream at your ex-boyfriend or scream at your sister’s ex-boyfriend’s potential new girlfriend. The options for fun are truly endless in Costa Rica!\n\nDecadence: 4 out of 5\n\nDrama: 5 out of 5 (“You can’t last four days without getting your d**k sucked?”)\n\nDamage to your bank account: 4 out of 5 (Costa Rica can be expensive but if you’re willing to forgo the private chefs and go camping or stay on the Caribbean side, you can make it work on a budget)\n\n2. Bora Bora (and Tahiti), French Polynesia\n\nWho could forget the infamous Bora Bora vacation? This was back in 2011, when Bruce decided to take the whole Kardashian klan on vacation to the French Polynesian island — located about 230 km northwest of Papeete — in order to celebrate his wedding anniversary with Kris. This vacation rates high for drama because it included several fights, a missing diamond earring, and it was where the ever forgettable Kris Humphries (not to be confused with Kris Jenner) made his decision to propose to Kim and ruin any hopes he had to ever be taken seriously again. Most of the family actually stayed in Tahiti’s signature overwater bungalows, while Kris, Bruce, Kris and Kim relaxed in the Hilton Bora Bora Nui Resort & Spa’s Presidential villas.\n\nAll of this could be yours, for only $5000 a night. Catch a flight with Air Tahiti, who run about five or six flights a day to the Bora Bora Airport. Once you arrive you can get around the islands via cars, bicycles, or motorboats — all available for rent. With the warm waters, turquoise lagoons, and lush green hills it’s not hard to understand why the Kardashians would pick this place to unwind. Just remember to remove any valuables before taking a dip.\n\nDecadence: 3 out of 5\n\nDrama: 3 out of 5 (“Kim, there are people that are dying”)\n\nDamage to your bank account: 5 out of 5 (it is possible to forgo the fancy suites for a tent)\n\n1. Las Vegas, Nevada, United States\n\nThis one is an oldie but a goodie and represents the Kardashians at their most authentic, before they upgraded everything from their faces to their brand partnerships. They’ve travelled to Vegas several times to let loose and tear up the town but this is perhaps the most iconic trip. This is also a perfect example about how inviting Scott to any vacation makes for excellent television. The occasion for the vacation this time around? Kim’s 29th birthday of course! But she isn’t here to celebrate because she’s a professional — she’s got products to hawk and a club to promote. The club in question is TAO, which humbly refers to itself as the most iconic nightclub in Las Vegas. They boast a regular line-up of world-class entertainers and it’s a hotspot for A-list celebrities who enjoy packed dance floors every Thursday, Friday and Saturday.\n\nIf you’re the real deal like Kim K, you can score an invite-only stay in The Venetian’s Chairman’s Suites, which includes multiple luxurious bedrooms, a personal butler, a private salon, massage room and karaoke booth. The good news? It’s only $25,000 a night!\n\nNow I don’t know about you, but when I take a family vacation to a party capital like Las Vegas, I also hope that my significant other will get so outrageously drunk that they shove a $100 bill in my waiter’s face. In the disappointing reality where this doesn’t happen, I’m satisfied by the literally hundreds of other exciting options for entertainment in Sin City. From glamorous casinos like Caesar’s Palace to The Bellagio and impressive live shows like Cirque du Soleil, Las Vegas is the perfect place for a person with money to burn and sins to cross off the bucket list.\n\nDecadence: 2 out of 5 (Vegas is glam for sure, but it’s also inherently a little scummy and Scott’s crazy outburst definitely drags the rating down on this one)\n\nDrama: 5 out of 5 (Maybe the phrase “what happens in Vegas, stays in Vegas” is only true when you aren’t the drunken star of a hyper-successful reality series)\n\nDamage to your bank account: 2 out of 5 (Never underestimate the power of scoring a great package deal, the kind with flights included. Bonus points if you get famous enough to host club events — they almost always include free hotel rooms!)\n\nFeatured image: Your Reality Recaps", "images": ["https://www.tourradar.com/days-to-come/wp-content/uploads/2016/03/12642736_10153431956918214_561751470124538236_n-150x150.jpg", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20480%20270%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/scottstuffsmoney.gif", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20304%20304%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20720%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20718%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20500%20292%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/Kylie-Jenner-plastic-surgery-Before-and-after-785868.jpg", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20590%20392%22%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.tourradar.com/days-to-come/wp-content/themes/tour-radar/assets/images/logo-days-to-come.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/james-walsh-183837-min-1.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kimkardashianearlyfashion.jpg", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20%20%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kim-kardashian-kris-jenner-thailand.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/flo-karr-145590.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/tumblr_nukyd1U8r51ql5yr7o1_500.gif", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/giphy.gif", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20715%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20128%20128%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20120%2080%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/costarica-min.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2016/03/12642736_10153431956918214_561751470124538236_n.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/phuketthailand.jpg", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/khloethrowswater.gif", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20710%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20729%22%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201080%20747%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/borabora-min-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20500%20280%22%3E%3C/svg%3E", "https://www.tourradar.com/days-to-come/wp-content/uploads/2019/11/DTC_XS_LOGO.png", "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/vail-colorado-min.jpg", "https://www.tourradar.com/days-to-come/wp-content/themes/tour-radar/assets/images/logo-tourradar.jpg"], "top_img": "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kim-kardashian-kris-jenner-thailand.jpg", "keywords": [], "authors": ["Read More", "Jackie"], "canonical_link": "https://www.tourradar.com/days-to-come/5-kardashian-vacations-ranked/", "title": "I've Ranked My Favourite Kardashian Family Vacations", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "description": "I sat through countless hours of KUWTK to bring you the latest on which Kardashian vacation is worth recreating. Bora Bora anyone?", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "I've Ranked My Favourite Kardashian Family Vacations - Days to Come", "description": "I sat through countless hours of KUWTK to bring you the latest on which Kardashian vacation is worth recreating. Bora Bora anyone?", "url": "https://www.tourradar.com/days-to-come/5-kardashian-vacations-ranked/", "site_name": "Days to Come", "updated_time": "2019-04-11T12:06:47+00:00", "image": {"identifier": "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kim-kardashian-kris-jenner-thailand.jpg", "secure_url": "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kim-kardashian-kris-jenner-thailand.jpg", "width": 1080, "height": 715}}, "article": {"publisher": "https://www.facebook.com/TourRadar", "tag": "United States", "section": "Lifestyle", "published_time": "2017-05-15T19:33:52+00:00", "modified_time": "2019-04-11T12:06:47+00:00"}, "twitter": {"card": "summary_large_image", "description": "I sat through countless hours of KUWTK to bring you the latest on which Kardashian vacation is worth recreating. Bora Bora anyone?", "title": "I've Ranked My Favourite Kardashian Family Vacations - Days to Come", "site": "@TourRadar", "image": "https://www.tourradar.com/days-to-come/wp-content/uploads/2017/05/kim-kardashian-kris-jenner-thailand.jpg", "creator": "@TourRadar"}, "generator": "WordPress 5.3.2", "fb": {"pages": 118177141533004}, "msapplication-TileImage": "https://www.tourradar.com/days-to-come/wp-content/uploads/2019/02/cropped-dtc_logo_sq_333-270x270.png"}, "movies": [], "publish_date": 1494876832.0, "source": "https://www.tourradar.com", "summary": ""}