{"url": "https://web.archive.org/web/20171215062849/https://www.truthexam.com/2017/11/new-jersey-police-chief-says-black-people-no-value-executed/", "text": "According to CNN, the former police chief of a small New Jersey town said African-Americans had “no value” and were “like ISIS,” and said he wanted to put them before a firing squad, and now the racist has been arrested.\n\nAdvertisement\n\nThe FBI has arrested Frank Nucera Jr., who was the chief of Bordentown Township Police Department. They allege Nuncera referred to African-Americans using several racial slurs and told his officers to position police dogs at high school basketball games to specifically intimidate African-Americans.\n\nNucera abruptly retired in February after he learned his use of racially motivated force was under investigation. He was making $151,418.31 per year. Nucera draws an annual pension of $105,992.76 — $8,832.73 per month — according to public records.\n\nSixty-year-old Nucera is facing a hate crime charge and a federal civil rights charge. FBI Special Agent Vernon Addison wrote in an affidavit that Nucera “has a significant history of making racist comments concerning African Americans, to whom he frequently referred to as ‘n*ggers'”. One of Nucera’s officers “made numerous recordings” of Nucera that “contained extremely offensive racist comments” over the course of a year because he was “alarmed” by Nucera’s racism, according to the affidavit.\n\nThe federal charges against Nucera relate to a Sept. 1, 2016, police encounter involving an 18-year-old African-American man and 16-year-old African-American girl. A hotel manager called police because he said the pair hadn’t paid for their hotel room the night before and were swimming in the hotel pool. The FBI affidavit states that their encounter with police “escalated into a physical struggle,” that both teens “resisted arrest” and that one of the officers used pepper spray.\n\nAdvertisement\n\nAfter both teens were handcuffed, Nucera grabbed the 18-year-old’s head and slammed it “into the right side of the metal doorjamb,” according to the affidavit. An officer heard the 18-year-old’s head make “a loud thud” as it hit the doorjamb, the feds alleged. Officers said the 18-year-old wasn’t resisting when Nucera slammed his head, but had “stopped walking for a moment to loudly complain.” The use of force wasn’t reported to the department.\n\nHours after the assault, Nucera was recorded telling an officer he was “f*cking tired” of African-Americans.\n\n“I’ll tell you what, it’s gonna get to the point where I could shoot one of these motherfuckers,” Nucera allegedly said. “And that n*ggerr bitch lady, she almost got it,” he said, referring to the 16-year-old girl’s aunt, who was present at the arrest. “Fucking nipple hanging bitch. I’m so tired of them, man.”\n\nNucera allegedly said that black people should “stay the fuck out of Bordentown” and referred to the 18-year-old as “fucking little, fucking n****r.”\n\nIn a separate incident noted in the report that occurred in November 2015, Nucera said he wished an African-American from Trenton who he believed had slashed the tires of a police vehicle would give him a reason to “put my hands” on him.\n\n“These n****rs are like ISIS, they have no value,” Nucera allegedly said. “They should line them all up and mow ’em down. I’d like to be on the firing squad, I could do it. I used to think about if I could shoot someone or not, I could do it, I’m tired of it.”\n\n“The conduct alleged is shocking,” acting US Attorney William E. Fitzpatrick said at a news conference.\n\n“It’s a shocking breach of the duty of every police officer to provide equal justice under the law and to never mistreat a person in their custody.”\n\nNucera appeared in court Wednesday afternoon in Camden, NJ, and waived his right to a preliminary hearing. He was released on a bail of $500,000.", "images": ["https://web.archive.org/web/20171215062849im_/https://www.truthexam.com/files/2017/11/2017.11.02-04.20-truthexam-59fb45e3660a2.jpg"], "top_img": "https://web.archive.org/web/20171215062849im_/https://www.truthexam.com/files/2017/11/2017.11.02-04.20-truthexam-59fb45e3660a2.jpg", "keywords": [], "authors": ["Nicole James"], "canonical_link": "https://web.archive.org/web/20171215062849/https://www.truthexam.com/2017/11/new-jersey-police-chief-says-black-people-no-value-executed/", "title": "New Jersey Police Chief Says Black People ‘Have No Value’ And Should All Be Executed", "meta_data": {"description": "Frank Nucera Jr. just got what he deserves...", "og": {"locale": "en_US", "type": "article", "title": "New Jersey Police Chief Says Black People ‘Have No Value’ And Should All Be Executed", "description": "Frank Nucera Jr. just got what he deserves...", "url": "https://web.archive.org/web/20171215062849/https://www.truthexam.com/2017/11/new-jersey-police-chief-says-black-people-no-value-executed/", "site_name": "TruthExam.com", "updated_time": "2017-11-02T14:20:01-06:00", "image": {"identifier": "https://web.archive.org/web/20171215062849im_/https://www.truthexam.com/files/2017/11/2017.11.02-04.20-truthexam-59fb45e3660a2.jpg", "secure_url": "https://www.truthexam.com/files/2017/11/2017.11.02-04.20-truthexam-59fb45e3660a2.jpg", "width": 780, "height": 438}}, "article": {"author": "https://www.facebook.com/nicolehickmanjames", "tag": "New Jersey", "section": "Politics", "published_time": "2017-11-02T11:25:12-06:00", "modified_time": "2017-11-02T14:20:01-06:00"}, "fb": {"admins": 100000227298708, "pages": 1340186812659728}, "twitter": {"card": "summary", "description": "Frank Nucera Jr. just got what he deserves...", "title": "New Jersey Police Chief Says Black People ‘Have No Value’ And Should All Be Executed", "image": "https://web.archive.org/web/20171215062849im_/https://www.truthexam.com/files/2017/11/2017.11.02-04.20-truthexam-59fb45e3660a2.jpg", "creator": "@nicolejames"}, "msapplication-TileImage": "https://www.truthexam.com/files/images/msapplication-icon-144.png", "msapplication-TileColor": "#eeeeee", "apple-mobile-web-app-status-bar-style": "black", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1509643512.0, "source": "https://web.archive.org", "summary": ""}