{"url": "https://www.npr.org/2018/06/25/621990166/npr-musics-favorite-35-songs-of-2018-so-far-part-1", "text": "NPR Music's 35 Favorite Songs Of 2018 (So Far)\n\nEnlarge this image Angela Hsieh/NPR Angela Hsieh/NPR\n\nThe best songs from the first half of 2018 serve many functions. Some reveal pain, others relieve it. Some guide us forward through the darkness, others eradicate it like a firework. Here are 35 favorites that put in work for us, each one the personal choice of one person at NPR Music or one of our partner stations around the country. (If you're into playlists, there's one here.) We didn't vote or haggle; we each reached into our hearts and picked what nestled closest. As one of these songs puts it in less printable fashion, we didn't really care too much if no one else liked it. Well, maybe we care a little — here's hoping you find a new favorite, too.\n\nCourtney Marie Andrews\n\n\"May Your Kindness Remain\" YouTube\n\nCould we be in the market for a new anthem? May I propose the title track from Courtney Marie Andrews' latest album, May Your Kindness Remain? Its message speaks to what is important in life; not the money or accoutrements, but the call to our better angels. Andrews' voice soars with passion, conviction and the tenderness of true understanding. Music can deliver empathy, allow you to hear the words of another and feel their truths. In this mean season, we must remember to be mindful of little things, which just might be the biggest thing after all. — Jessie Scott, WMOT's Roots Radio\n\nBalún\n\n\"El Espanto\" YouTube\n\nBalún's \"El Espanto\" is an innovative exploration of Puerto Rican folk music and electronic production that takes music from the island to another level entirely. The delicate vocals are part of an arrangement that thrives on upbeats and clever drumming. This track is just a hint of what's in store — I've heard the upcoming album and it's going to blow your mind. — Felix Contreras, Alt.Latino\n\nBig Red Machine\n\n\"Hymnostic\"\n\nThere is something about a gospel hymn, regardless of your religious stripes, that immediately invokes a spirit of love and good will. Even non-believers can be moved to tears by a choir, or a single voice, singing about a higher power, our earthly struggles and redemption. In the case of \"Hymnostic\" by Big Red Machine, this type of comfort can be found not in a house of worship, but online, in a similarly welcoming and communal atmosphere, where a collective of artists are sharing their music directly with fans, for free.\n\nBoth the band and the new digital platform, PEOPLE, are parts of a collaboration between Aaron Dessner (The National) and Justin Vernon (Bon Iver). The gorgeous and moving \"Hymnostic\" (perhaps an amalgam of \"hymn\" and \"agnostic\") brings the communal essence of these projects to life, with lyrics co-written by the contemporary artist Ragnar Kjartansson, and featuring Dessner on piano, Vernon's unmistakable falsetto, Brad Cook (Megafaun, Hiss Golden Messenger) on omnichord and a choir of friends, including The Staves, Kate Stables (This Is The Kit), Lisa Hannigan and Richard Reed Parry (Arcade Fire). If a piece of music can make you feel as though you've been invited to share in the beauty of community and lose your troubles for a while, the gospel truth is in the final line of the song, as Vernon sings the promise: \"I'll be singing for your health, I'll be righteous, you'll see.\" — Carmel Holt, WFUV\n\nBlack Pumas\n\n\"Black Moon Rising\" YouTube\n\nGrammy-winning producer and Brownout guitarist Adrian Quesada has been the man behind the curtain for so many projects that it has become a bit of a running joke. The Austin musician is relentlessly driven, and has found lots of success my digging into deep psychedelic grooves. Yet none of his endeavors has leapt out of the gate quite like Black Pumas. Led by newfound vocalist Eric Burton's commanding soul, Quesada and crew have become Austin's hottest new band based on one dubbed-up single. — Jeff McCord, KUTX\n\nLeon Bridges\n\n\"If It Feels Good (Then It Must Be)\" YouTube\n\nBest known for his slow-burning retro soul ballads, this song finds Leon Bridges steppin' out with something for the dancefloor. As the title suggests, the good feeling is pretty immediate. The mid-tempo shuffle-and-clap groove and hooky Nile Rodgers-style guitar line makes for an undeniable summer party starter. It also shows a different side of Bridges' music, exploring a more contemporary, uptempo R&B mode. He seems conscious of the shift in tone, singing \"we don't have to act so serious, like no one's watching, only us.\" As this young artist continues to evolve on his sophomore album, Good Thing, it's nice to hear him take fun and confident strides to wider audiences. — Jason Bentley, KCRW\n\nJoseph Calleja\n\nAh! Si, ben mio... (Verdi: Il trovatore)\n\nYouTube\n\nThe overall plot of Verdi's Il trovatore might be far-fetched, but few could fail to relate to the sentiment in this stirring aria. Boy tells girl he'll be braver and stronger with her at his side, even in the face of death. It's classic Verdi, with a potent blend of urgency, natural beauty and a melody that sticks in your head. Rare is the tenor, from any era, who can top Joseph Calleja's distinctive, old school phrasing or match the golden warmth of Italian sunshine that radiates from every perfectly focused note. — Tom Huizenga\n\nCar Seat Headrest\n\n\"Nervous Young Inhumans\" YouTube\n\nCould this be Will Toledo's most optimistic sounding song? \"Nervous Young Inhumans\" comes on like a runner's high, a sunrise of synthesizers and electronic drumbeats inviting the listener to jog along to the newly recorded version of this 2011 Car Seat Headrest deep cut. Like the rest of Twin Fantasy, a slight rewrite of the song's lyrics and a massive overhaul of its production helps to usher Toledo's lesser-known material into a new era, drawing a line from the scrappy coming-of-age stories and bedroom recordings of his early career to the barbed, avant guitar-pop of his present and future. — Andrea Swensson, The Current\n\nCardi B feat. SZA\n\n\"I Do\" YouTube\n\nThis track is syrupy trap goodness. Moody production courtesy of Murda Beatz sets the vibe for SZA's sweetly sung braggadocious hook, teasing what at first feels like a CTRL bonus track. But once Cardi B comes in with one line after another worthy of being printed on a T-shirt, she reminds us why her 15 minutes of fame are lasting long as hell. This song is sticky and fun, and Bardi delivers a banger. This is the perfect song to listen to right before a power meeting. — Silvia Rivera, Vocalo Radio\n\nThe Carters\n\n\"Black Effect\"\n\nThe eighth song on Jay-Z and Beyonce's surprise collab album, Everything Is Love, \"Black Effect\" marries blackness and culture capital in a matrimony full of alchemy-level whimsy. The spellbinder opens with a modest explanation of the most multi-faceted emotion known to many by Dr. L'Antoinette Stines — the kind of warm wisdom received on a rainy afternoon from across a kitchen table. From there, HOV and Bey ascend over a bass-injected Flower Travellin' Band sample to deliver a sermon on black strife and prosperity. Jay likens himself to Malcolm X and puffs his chest over his fraternal familiarity in any black mecca (\"I'm good on any MLK Boulevard\"). Bey pays homage to Sarah Baartman, Prince and Shawty Lo and breaks with the beat for a moment to proclaim, \"I will never let you shoot the nose off my pharaoh.\"\n\nWith pop culture references spanning centuries and drawing from music, politics, fashion and beauty standards, the pair trade verses and ad-libs about how the nuances of black culture — and themselves, by default — have come to be the nucleus of these worlds without proper recognition. — Sidney Madden\n\nChildish Gambino\n\n\"This Is America\" YouTube\n\nMore than a month has passed since the release of Childish Gambino's visual gut punch \"This Is America,\" and I'm still unpacking the shock it elicited the moment it hit the web. Was it the 400 years of American violence and racial exploitation Donald Glover distilled into four minutes of graphic symbolism? Was it the impact of his truth juxtaposed against the utter fiction spoken the same week by Kanye West when he alluded to slavery being a choice? Or was it seeing the guy who'd quietly infiltrated the industry a decade ago in Tina Fey's 30 Rock writers room suddenly reveal the depths of his radical blackness? The brilliance of \"This Is America\" is that Gambino refuses to provide any easy answers. Instead he uses a cacophony of stark imagery — from the gun-splattered gospel choir to the pale white horse obscured by dancing schoolchildren — to question the myriad ways the nation employs black entertainment as a distraction, and abstraction, from the violence aimed at black America everyday. — Rodney Carmichael\n\nYears from now, when I try to unlock the memory of what 2018 felt, smelled and looked like, \"This Is America\" will take me there. I'll remember the smile that spread across my face in the first 50 seconds — that fun, feel-good opening, with joyous chanting and Donald Glover's playful lyrics about just wanting to party. But then I'll remember the drop, and the horror, and the revelation. For me, this year of music began and very well may peak with this song. — Jessi Whitten, CPR\n\nChristine and the Queens\n\n\"Girlfriend\" YouTube\n\nThis is more than just the queer anthem of the year, though that's already saying a lot. \"Girlfriend\" is supercharged fun: It's got swagger to burn from the opening note; it's got all the right musical nods, from MJ to Daft Punk and it's got the lyrical weight to carry it beyond pop. Christine is actually Héloïse Letissier, a French singer-songwriter (check out the French version of \"Girlfriend,\" too) with a flair for theater and performance art — and a great dancer, too. If you agree that a macho girlfriend is what this world needs now, sidle up to Christine and the Queens! — Rita Houston, WFUV", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/assets/img/2018/06/22/hsieh_angela_npr_music50bestsongs_wide-40b6ee6133171d68c8d7a03bd18060810af2b013-s1100-c15.jpg", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://media.npr.org/assets/img/2018/06/20/big-red-machine_sq-44e910b7e4556aa924781f6a39dbd4ba64fa67c1-s1100-c15.jpg", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2018/06/20/the-carters-everything-is-love_sq-fd6dd54c4d72e22b5c5f98ebe7406cb5d634d168-s1100-c15.jpg", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2018/06/25/hsieh-npr-albums-so-far_sq-8beeff7c406ecd9c23db7ffc1f9cd8eb1e1ff4ab-s100-c15.jpg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/assets/img/2018/06/22/hsieh_angela_npr_music50bestsongs_wide-40b6ee6133171d68c8d7a03bd18060810af2b013.jpg?s=1400", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png"], "top_img": "https://media.npr.org/assets/img/2018/06/22/hsieh_angela_npr_music50bestsongs_wide-40b6ee6133171d68c8d7a03bd18060810af2b013.jpg?s=1400", "keywords": [], "authors": [], "canonical_link": "https://www.npr.org/2018/06/25/621990166/npr-musics-favorite-35-songs-of-2018-so-far-part-1", "title": "NPR Music's 35 Favorite Songs Of 2018 (So Far)", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2018-06-25", "description": "Writers from across the public radio map pick the best songs they've heard this year.", "og": {"title": "NPR Music's 35 Favorite Songs Of 2018 (So Far)", "url": "https://www.npr.org/2018/06/25/621990166/npr-musics-favorite-35-songs-of-2018-so-far-part-1", "type": "article", "description": "Writers from across the public radio map pick the best songs they've heard this year.", "image": "https://media.npr.org/assets/img/2018/06/22/hsieh_angela_npr_music50bestsongs_wide-40b6ee6133171d68c8d7a03bd18060810af2b013.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "NPR Music's 35 Favorite Songs Of 2018 (So Far)", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2018/06/22/hsieh_angela_npr_music50bestsongs_wide-40b6ee6133171d68c8d7a03bd18060810af2b013.jpg?s=1400"}}}, "movies": ["https://www.youtube.com/embed/Ne5SQQIxxik?rel=0", "https://www.youtube.com/embed/H5ua3KdJhfw?rel=0", "https://www.youtube.com/embed/z7hnLq9NXh4?rel=0", "https://www.youtube.com/embed/xvPMqljGruE?rel=0", "https://www.youtube.com/embed/6VoKl6gHG4c?rel=0", "https://www.youtube.com/embed/3NPATRzaF00?rel=0", "https://www.youtube.com/embed/Psn0fiNaHOw?rel=0", "https://www.youtube.com/embed/VYOjWnS4cMY?rel=0", "https://www.youtube.com/embed/S0NMTuz9Duo?rel=0"], "publish_date": 1529856000.0, "source": "https://www.npr.org", "summary": ""}