{"url": "https://web.archive.org/web/20081223093911/http://www.parentstv.org:80/PTC/news/release/2008/1217.asp", "text": "PTC Analysis of YouTube Finds Explicit Content is One Click Away from Children\n\nPopular Child-Friendly Terms Like ďHannah MontanaĒ Give Kids Easy Access to Sexual Content and Explicit Language\n\nLOS ANGELES (December 17, 2008) Ė In its first analysis of online media, the Parents Television Councilô found that extremely graphic content and harsh profanity are just a click away for kids entering seemingly innocent search terms on YouTube, the most popular destination for online video that has undertaken several policies to control inappropriate content. The PTCís latest study, The ďNewĒ Tube, not only analyzes content in 280 of the most popular YouTube videos between March and October 2008 according to Compete Data Hub, but also takes into account the text commentary and advertisements that were available alongside the videos.\n\nďJust as the number of entertainment options is growing by leaps and bounds with new and emerging technologies, so too are the risks that parents face when trying to protect their children from inappropriate material. Our study today marks the PTCís first foray into analyzing content in digital media, and as such we wanted to help parents with the most popular online video resource Ė YouTube,Ē said PTC President Tim Winter.\n\nďWhile we applaud YouTube for its commitment to gating procedures and its recently announced plans to curb inappropriate content, the core implication of our analysis is that the site isnít doing enough to protect kids.\n\nďChildren who use YouTube to search for video clips of their favorite stars like Miley Cyrus and the Jonas Brothers are exposed to some of the most offensive profanity in the English language. Video searches for these popular terms showed that YouTubeís gating procedures do not extend to text commentary.\n\nďAnd despite YouTubeís policy of not hosting sexually graphic videos, entering any number of popular search terms produced videos linked to ads for triple-X pornography Ė often without even requiring age verification.\n\n\n\nďWith nearly half of boys and a third of girls ages 13-17 naming YouTube as one of their top three favorite websites, no parent can afford to ignore these findings. The results of this study should serve as a wake-up call for any parent concerned about graphic or indecent material on websites they perceive to be Ďsafeí for their children,Ē said Winter.\n\n\n\nMajor Findings:\n\n\n\nChildren entering such ďchild-friendlyĒ search terms as Miley Cyrus, Jonas Brothers, High School Musical and Hannah Montana were confronted with highly offensive content in the accompanying text commentary posted by other site users:\n\nViewing 20 YouTube videos under each ďteen idolĒ search term produced a total of 422 instances of explicit content within the text commentary that accompanies the videos.\n\nAn average of 68% of those comments included profanity and 31% of the profanity was of the most offensive nature (e.g. the f, s, and b-words).\n\nThe 20 highest-ranked YouTube videos from each of the siteís most popular search terms yielded an extraordinary amount of graphic and adult-themed content:\n\nFor example, 98 percent of the videos analyzed under the popular search term ďLil WayneĒ did not require any form of age verification, despite containing high levels of explicit adult content. In fact, 50 percent of the videos that were associated with the rapper featured verbalized non-muted expletives, including the s-word, b-word, several variations of the f-word, and explicit references to human anatomy.\n\nTwenty-eight percent of the videos resulting from the search term ďpornĒ did not require any form of age verification.\n\nďYouTubeís status as the leading site for online video combined with the fact that more and more children are consuming entertainment media outside the confines of a television set underscore our demand for more responsibility,Ē Winter stated.\n\n", "images": ["https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/publications/emailalerts/images/SA IPTV_logo_163x70.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/TVicon.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/square.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/FVC-Banner11(2).gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/news/release/2008/images/spacer.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/publications/reports/YouTube/newtube.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/Tivo/tivo_162x70_ss.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_07.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_01.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/images/medved.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_08.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/boone.1.c.162.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_09.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_04.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/ealerticon.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/joinus/images/Best%20Of%20America%20Logo.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_11.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/news/release/2008/images/nav/spacer.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_06.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_12.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/TEMPLATE_02.jpg", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/donatebanner.png", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/nav/spacer.gif", "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/images/Movieicon.gif"], "top_img": "https://web.archive.org/web/20081223093911im_/http://www.parentstv.org/PTC/publications/reports/YouTube/newtube.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "PTC Analysis of YouTube Finds Explicit Content is One Click Away from Children", "meta_data": {"description": "PTC- A nonprofit organization dedicated to educating parents  about television content, improving the quality of prime time television, promoting family  friendly entertainment, restoring positive values, and making Television a socially responsible  medium -- the Parents Television Council based in Hollywood, California", "keywords": "Parents Television Council, PTC, TV, Television, family hour,  family guide, family friendly, media violence, sex, language, parents, clean up tv, trash tv,  children, vulgarity, filth, network, sponsor, Hollywood, responsibility, shows, programs, prime  time, entertainment, studies, statistics, reviews, best and worst, v-chip, ratings, video games,  album, movies, steve allen, brent bozell, archive, action alerts, e-alerts, insider, effects,  recommendations"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}