{"url": "www.inquisitr.com/4599312/kris-jenner-wishes-to-invite-kate-middleton-prince-william-to-her-crazy-christmas-party/", "text": "Kris Jenner is now including royalties on the guest list for her annual Christmas party this year according to an online tabloid. The Jenner-Kardashian matriarch is reportedly inviting British royalties Kate Middleton and Prince Charles to her crazy Christmas party.\n\nKris Jenner has been known to host outlandish Christmas parties and this year won’t be an exception according to Celeb Dirty Laundry. In the past, the great matriarch of the Jenners and Kardashians bought nine Christmas trees and live reindeers for this very reason. On top of that, guests get to take home gift bags worth thousands of dollars. So, who are the lucky souls that get invited to her crazy party? The article claims that the invitation has been extended to the British royalties this year.\n\nAccording to the website, the guest list is one for the books, which allegedly includes Prince William and Kate Middleton. While the author of the article admits that this idea could be pure madness, it goes on to say that Kris Jenner wants the royal family to enjoy the Christmas celebrations with them too. However, Gossip Cop is quick to point out the false claims of this news.\n\nKris Jenner did mention the royalties in a recent interview with Glamour UK. However, this is to say that she wished to invite Prince William and Kate Middleton to one of her parties if given a chance. It should be emphasized that this is only wishful thinking on her part.\n\n“If I could get any guests at our party, it would have to be Prince William and Duchess Kate. Oh, and they can bring Harry, too.”\n\nSo this is to say that Kris Jenner did not actually invite the Duke and Duchess of Cambridge to her upcoming Christmas party. Her statements were only good-natured remarks about a hypothetical situation. She was just asked about her dream guests at one point during the interview, to which she answered gamely. In fact, she goes on to say that Charlotte and George would probably love the hot-dog-on-a-stick stand in her party.\n\nKris Jenner dodges questions about Khloe and Kylie's pregnancies https://t.co/na8n22630r — Entertainment Weekly (@EW) November 3, 2017\n\nSo this goes on to say that Kris Jenner did not extend an invitation to Prince William and Kate Middleton. This was a clear fabrication from what she mentioned in her interview with Glamour UK. Celeb Dirty Laundry also did not provide actual quotes that could prove that Kris actually invited the British royalties.\n\n[Featured Image by Charley Gallay/Getty Images for LACMA]", "images": ["https://secure.gravatar.com/avatar/e1be0684bc30f8a328b5390ff51841a8?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/Kir-Jenner-Invites-Prince-William-Kate-Middleton.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Alexis Villarias"], "canonical_link": "https://www.inquisitr.com/4599312/kris-jenner-wishes-to-invite-kate-middleton-prince-william-to-her-crazy-christmas-party/", "title": "Kris Jenner Wishes To Invite Kate Middleton And Prince William To Her Crazy Christmas Party", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}