{"url": "https://web.archive.org/web/20141120092001/http://www.break.com:80/article/is-there-a-britney-spears-sex-tape-2752733", "text": "Britney Spears has lived almost half of her life in the public spotlight. Ever since her debut album, “...Baby One More Time,” was released in January 1999, Britney hasn’t made a move without the paparazzi recording her every movement. The album became the biggest selling record ever by a teenage artist and solidified Britney’s status as a superstar.\n\nBritney back in the day:\n\niframes not supported\n\nOne of the most highly publicized events in Britney’ life is her brief marriage to back up dancer, Kevin Federline who she had only known for three months before marrying him on September 18, 2004. (They were not legally married until October 6 after their prenuptial agreement was finalized.) Since Federline’s ex-girlfriend, actress Shar Jackson was pregnant with their second child at the time, Britney’s engagement and marriage to Federline was the subject of intense media scrutiny. While Federline waited for one woman to give birth to his baby, Britney announced in October 2004 she would be taking a career break to start a family with her new husband.\n\nThe newlyweds in 2004:\n\nHOW DID THE BRITNEY SPEARS SEX TAPE RUMORS START?\n\nIn 2005, the couple signed a deal for a reality television series, “Britney and Kevin: Chaotic,” a five-episode series chronicling the couple's relationship from their courtship and engagement to their wedding. The show aired on UPN from May 17 to June 14, 2005 and used footage that was shot during the European leg of Britney’s The Onyx Hotel Tour. Britney had originally intended to shoot backstage footage of the concert tour for a reality show called, “OnTourage” but had to scrap the tour after undergoing arthroscopic surgery following a knee injury while she was shooting a music video.\n\nBritney said about the reality show, \"From the day that Kevin and I met, there have been constant rumors and inaccurate speculation about our lives together. I feel that last year, the tabloids ran my life and I am really excited about showing my fans what really happened, rather than all the stories which have been misconstrued by journalists in the past. As I mentioned before, I am now going to be expressing my personal life through art.”\n\nThe tagline from the show was, “Can you handle our truth?”\n\nThe 5 episode series later came out on DVD:\n\nThe show was panned by critics who deemed the show as being too explicit and criticized Britney’s excessive narcissism. In the series, the pop star is seen talking about how the couple's bedroom antics are \"so good\" and begs Kevin to let her take the day off \"to just fuck all day.\" She’s also seen quizzing her staff and crew about their sex lives and favorite sexual positions. During her pregnancy, Britney told reporters that her sex life was the best it had ever been since she conceived claiming, \"I think it's the best. Sex is crazy good.\" Talk like this is generally what births and fuels sex tape rumors since the thought process is if the sex is that great, it must have been captured on video especially if the participants involved are celebrities.\n\nA pregnant Britney with Federline. Now we get why they’re smiling:\n\nIS THERE A BRITNEY SPEARS SEX TAPE?\n\nRumors about a Britney and Kevin sex tape didn't heat up until Us Weekly said in its October 17, 2005 \"Hot Stuff\" column that the couple watched “sex tape footage” with their lawyers and that the video was supposedly shot by a member of their entourage. Other rumors circulated that a member of Britney’s entourage copied one of the couple's personal video tapes and a source reportedly told America's Us Weekly magazine, \"He has threatened to release raunchy footage of the two taken before Spears looked pregnant.\"\n\nBritney responded to the US Weekly story by filing a $10 million defamation lawsuit in Los Angeles Superior Court declaring in court documents that, \"My husband and I have not filmed ourselves having sex. Therefore, we obviously did not bring any 'sex tape' to our lawyers' offices for any reason, nor were we concerned that someone from our 'entourage' was threatening to release a tape since no 'X-rated' tape exists. The entire story is a complete fabrication. In fact, the first time that I heard about the alleged 'sex tape' is when I first heard about the article.\" Britney went on to say the report was \"damaging\" to her career and reputation particularly with her younger audience and pointed out that she had \"repeatedly rejected substantial monetary offers to pose in photographs or appear in feature films with my breasts exposed.\" Ultimately, a judge dismissed the suit on the grounds that since Britney has \"put her modern sexuality squarely and profitably before the public eye,\" that she can't be defamed by rumors of any such alleged sex tape. However, the ruling did not address whether or not the story about a purported sex tape was true.\n\nGuess this is what the judge meant:\n\nGossip about a sex tape only increased when in November 2006, two months after giving birth to her second child with Federline, Britney filed for divorce citing irreconcilable differences. Another rumor then emerged that Federline was shopping the alleged tape to the highest bidder and using it as leverage to get more money from the divorce proceedings. This was followed by another rumor suggesting Britney would leak the tape herself to prevent Federline from profiting. Britain's News of the World offered Federline $50 million for the sex tape if it indeed existed.\n\nHoping to put an end to any and all sex tape rumors, the divorcing couple jointly released an official statement through their attorney Mark Vincent Kaplan. The statement said, \"There is not a sex video of Kevin and Britney in existence. It goes without saying that the stories of Kevin attempting to sell such a video are patently false and anyone who reports that they have information of such attempts is either lying or reporting the lie of someone else.\" The statement went on to say, \"It would be impossible to comment upon and correct all of the other misinformation about Kevin that appears on a daily basis and consequently no attempt has been made, or will be made, to do so.\" Britney and Federline’s divorce was finalized in July 2007 after the ex-couple reached a settlement and agreed to share joint custody of their children.\n\nThe short love story ends:\n\nIS THERE A BRITNEY SPEARS SEX TAPE WITH ANOTHER PERSON?\n\nIn February 2007, Britney became an unwitting star of a surveillance tape at a nightclub, One in New York City. The video reportedly shows the singer wearing fishnet stockings and a bikini while partying and eventually getting intimate with two female dancers who were fired after the manager of the club saw the video. The New York Daily News reported that a source said there were also pictures of Britney’s naked rear taken while she was trying on clothes with the dancers. The expectation was that it would leak to the internet however, the video still hasn’t surfaced.\n\nBritney with her own dancers during a show:\n\nIn December 2007, Britney started dating celebrity photographer Adnan Ghalib who was her boyfriend during her very public mental breakdown at the beginning of 1998. By May, their relationship was over and rumors started that Ghalib wanted to sell a sex tape they had shot while they were on vacation in Mexico in January. Ghalib reportedly told British entertainment magazine, Heat, “There is such a tape. But I won’t discuss prices for hypothetical inquiries. Unless there is a locked-in deal, I will go no further. I am not interested in selling out any other details about Britney.” British newspaper The Sun said a source told them that the two-hour X-rated footage features the pop princess naked wearing just a pink wig. The insider alleges that “The video starts with Britney undressing. She was wearing some cheap clothes that she bought down there in Rosarito. The sex wasn’t particularly kinky but Britney wears a pink wig throughout. At one point in the tape Adnan asks that singer to remove the pink bob but she refused,” the source says. “Adnan tells her to take it off at one point and she says coyly, ‘Take what off? There’s nothing left to take off.’”\n\nAlthough in October 2008, British tabloid Daily Star quoted a Spears family source as saying that Britney was planning to fight Ghalib in court over the sex tape, nothing materialized and neither has the alleged sex tape.\n\nBritney and Ghalib before their break-up:\n\nBUT WHAT ABOUT THE BRITNEY SPEARS SEX TAPE SITE?\n\nAlthough there is a Britney Spears sex tape site, there’s no sex tape available. The site is best for seeing upskirt or nip slip pictures of the singer and there is a nice selection of those since Britney has been known to have a few very public “off” moments. However, clicking on any link advertising a sex tape will only take you to a paid adult website. Also, unfortunately or fortunately, Britney’s All American looks can be copied by many American girls so an internet search will reveal several videos featuring girls claiming to be Britney. In reality, they’re just girls who resemble her. The most circulated video is one of a Britney look-a-like performing oral sex on someone who is supposedly Federline. There’s even one video on the net that claims to be Britney but you can’t even see the people’s faces in the footage.\n\nThe best thing for Britney Spears fans to do is to enjoy the various photographs and videos of the pop princess that is out there especially the ones of her in her heyday. Not shy in front of the camera and remember, a Superior Court judge ruled that Britney has no problem putting her modern sexuality before the public eye. So until a real Britney sex tape surfaces, fans will just have to be comforted by her the available modern sexuality that is out there and fortunately for them, there is plenty.\n\nIt was 18 year-old Britney’s idea to dress as a Catholic school girl for the video. See her evolution from this:\n\niframes not supported\n\nTo this:\n\niframes not supported\n\nBritney was happy to pose nude even when she was pregnant:", "images": ["https://web.archive.org/web/20141120092001im_/http://s.brkmd.com/content/break/img/misc/placeholder_192x108.jpg", "https://web.archive.org/web/20141120092001im_/http://media1.break.com/dnet/media/768/752/2752768/britney-spears-in-her-underwear-in-rolling-stone.jpg", "https://web.archive.org/web/20141120092001im_/http://media.mademan.com/chickipedia/uploaded_photos/6/64/Britney_Spears-stunning-after-young-skin-lovely_thumb_585x795.jpg", "https://web.archive.org/web/20141120092001im_/http://b.scorecardresearch.com/p?c1=2&c2=4000003&c3=&c4=http://www.break.com/article/is-there-a-britney-spears-sex-tape-2752733&c5=&c6&c15&cv=2.0&cj=1", "https://web.archive.org/web/20141120092001im_/http://content4.catalog.photos.msn.com/ds/pic-en-us/picenus_msnentertainment/MSNE/DC91110B-767E-4A93-9E89-22863D3678AB.jpg", "https://web.archive.org/web/20141120092001im_/http://cdn2.screenjunkies.com/wp-content/uploads/images/2009/britney-kevin-chaotic.jpg", "https://web.archive.org/web/20141120092001im_/http://ruthlessreviews.com/pics5/bkchaotic1.jpg", "https://web.archive.org/web/20141120092001im_/http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-103628h&cg=0&cc=1&ts=noscript", "https://web.archive.org/web/20141120092001im_/http://pixel.quantserve.com/pixel/p-83WcMqNwWwE46.gif", "https://web.archive.org/web/20141120092001im_/http://www2.pictures.gi.zimbio.com/Britney+Spears+Files+Divorce+gzMlyAOZzE8l.jpg", "https://web.archive.org/web/20141120092001im_/http://media1.break.com/dnet/media/767/752/2752767/britney-spears-in-bed.jpg", "https://web.archive.org/web/20141120092001im_/http://earsucker.com/wp-content/uploads/2008/01/britney_spears_adnan_ghalib1.jpg", "https://web.archive.org/web/20141120092001im_/http://www.breatheheavy.com/picture%20links/964.jpg", "https://web.archive.org/web/20141120092001im_/http://media11.break.com/break/2.0/img/404/NeutralAvatar_36x36.jpg", "https://web.archive.org/web/20141120092001im_/http://d4.yimg.com/sr/img/1/24624e50-a53c-11e3-adff-f5b10397f0e5", "https://web.archive.org/web/20141120092001im_/http://2.bp.blogspot.com/-Kcs1d4tMpdI/TtgT_wX6VxI/AAAAAAAAACw/Ovf0_EkYEiI/s1600/britney-chaotic.jpg", "https://web.archive.org/web/20141120092001im_/http://media11.break.com/dnet/media/733/752/2752733/f4decbe2-0aa9-4e5b-9ddf-8f9d6bee0fde.jpg", "https://web.archive.org/web/20141120092001im_/http://www.break.com/article/is-there-a-britney-spears-sex-tape-2752733", "https://web.archive.org/web/20141120092001im_/http://chismetime.com/wp-content/uploads/2008/12/britney-spears-kevin-federline-11.jpg", "https://web.archive.org/web/20141120092001im_/http://media11.break.com/dnet/media/698/752/2752698/0acc9a2f-566a-4f17-bec9-831c20cc12d8_288x162.jpg", "https://web.archive.org/web/20141120092001im_/http://www.gobritney.com/albums/userpics/10001/normal_Andrew-Eccles-Shoot-2003-09v.jpg", "https://web.archive.org/web/20141120092001im_/http://img2.timeinc.net/people/i/2006/gallery/britneykevinsplit/britney_spears5.jpg"], "top_img": "https://web.archive.org/web/20141120092001im_/http://media11.break.com/dnet/media/733/752/2752733/f4decbe2-0aa9-4e5b-9ddf-8f9d6bee0fde.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20141120092001/http://www.break.com/article/is-there-a-britney-spears-sex-tape-2752733", "title": "Is there a Britney Spears Sex Tape?", "meta_data": {"description": "Read Did Britney Spears Do It One More Time in a Sex Tape? now. Also surf around Break to find other great articles, videos, and pictures.", "viewport": "width=960,user-scalable=1,maximum-scale=1.0", "google-site-verification": "wVFhf5HVF0MXlvnoW9R3u4gUUVRBHp0LDTfoFWSMnWY", "msvalidate.01": "4B5EC512F2F8F984A26CE9B8F412FA5D", "twitter": {"title": "Did Britney Spears Do It One More Time in a Sex Tape? | Break.com", "card": "summary_large_image", "site": "@breakcom", "image": {"src": "http://media11.break.com/dnet/media/733/752/2752733/f4decbe2-0aa9-4e5b-9ddf-8f9d6bee0fde.jpg"}, "app": {"name": {"iphone": "Break", "ipad": "Break", "googleplay": "Break"}, "id": {"iphone": 342257973, "ipad": 342257973, "googleplay": "com.breakapps.breakdotcom"}}}, "og": {"title": "Did Britney Spears Do It One More Time in a Sex Tape? | Break.com", "type": "article", "url": "https://web.archive.org/web/20141120092001/http://www.break.com/article/is-there-a-britney-spears-sex-tape-2752733", "image": "https://web.archive.org/web/20141120092001im_/http://media11.break.com/dnet/media/733/752/2752733/f4decbe2-0aa9-4e5b-9ddf-8f9d6bee0fde.jpg", "site_name": "Break", "locale": "en_US"}, "fb": {"app_id": 376604520810}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}