{"url": "https://www.cheatsheet.com/entertainment/this-is-the-biggest-change-carrie-underwood-is-making-in-her-life-after-freak-accident.html/", "text": "Carrie Underwood could be making a big change following her accident in 2017 in which she fell, broke her wrist, and needed 40 to 50 stitches in her face.\n\nAfter months of covering up on social media and plenty of speculation about how different her face would look, Underwood has started making public appearances again and is getting candid about what happened to her on that day.\n\nHere’s more on that and the major change the star and her husband, Mike Fisher, have reportedly decided to make after her fall (page 6). She also gave the reason why people haven’t really noticed a difference in the way she looks (page 5).\n\nFans were confused after her first public appearance\n\nFans had a few questions for the country singer. | Ethan Miller/Getty Images Fans had a few questions for the country singer. | Ethan Miller/Getty Images\n\nUnderwood performed for the first time in public following her fall at the 53rd Academy of Country Music Awards in April 2018, but her appearance left many of her fans scratching their heads.\n\nThe reason people were so confused is because no one seemed to think she looked any different after the gruesome injuries she sustained. This led to several conspiracy theories about her accident.\n\nNext: Underwood silenced rumors with photo of her scar\n\n\n\nUnderwood shared close-up photo of her scar\n\nWas she being overly-dramatic about her injury? | Was she being overly-dramatic about her injury? | Carrie Underwood via Instagram\n\nFor anyone who had questions about Underwood’s fall and if her facial injuries were as severe as she said, the “Cry Pretty” artist shared a photo of scar on social media.\n\nIn the picture taken on April 20, there is some visible scarring above her lip, which is likely what she was so afraid of everyone seeing for months.\n\nNext: Underwood gives a play-by-play of her accident.\n\n\n\nUnderwood shares more details about her accident\n\nUnderwood had previously spoken about an injury that left her hurt. | Jason Kempin/Getty Images for SiriusXM Underwood had previously spoken about an injury that left her hurt. | Jason Kempin/Getty Images for SiriusXM\n\nFollowing her AMA performance, Underwood was featured on SiriusXM’s The Highway channel and for the first time opened up about her accident and what exactly led to her fall.\n\nI was clumsy and I tripped. I held onto the dog leashes in my left hand and went to catch myself with my right and just missed the step. There’s one lone step. I said if I had fallen anywhere else, I would have been absolutely fine, but it’s just because there was … I went to catch myself and I missed … I thought I just busted my lip. Then I walked inside and took the dog leashes off and took my coat off and went to go survey the damage and was like, “Oh, no!” … It wasn’t pretty. I chipped my tooth but it was just my skin, thank the Lord. Stitches and all that stuff.\n\nNext: Underwood also got candid about her recovery.\n\n\n\nShe talked about the recovery process as well\n\nShe had her own explanation. | Ethan Miller/Getty Images She had her own explanation. | Ethan Miller/Getty Images\n\nThe songstress also spoke about what the recovery process has been like for her. “It set me back,” she said. “The most frustrating part was trying to work out with a broken wrist, and just how much it can throw off your world, having an appendage that is there but you just can’t use it.”\n\nUnderwood revealed why she and her team felt the need to release a memo to her fans explaining that her accident was worse than she first let on. “We put a memo out to the fan club just because I was like, ‘Man, somebody’s going to catch me at the Kroger and people are going to be like, “What’s going on?!”‘ It was just important — I knew they’d be the first ones to come to my defense.”\n\nNext: Underwood offers explanation for why she looks the same.\n\nShe explained why she looks the same now\n\nShe might have chosen to address the criticism. | NBC She might have chosen to address the criticism. | NBC\n\nOn May 10, Underwood gave her first television interview on the Today show. When Hoda Kotb commented that she thought the country songbird looked the same as she did before her fall Underwood offered an explanation about why that is.\n\n“I have a dedicated team of professionals who can spackle and paint and paste,” the singer said crediting her glam squad.\n\nNext: This is the change she and her husband may be making.\n\nAfter her fall, Underwood may be changing her address\n\nMike Fisher and Carrie Underwood | Rick Diamond/Getty Images for ACM Mike Fisher and Carrie Underwood | Rick Diamond/Getty Images for ACM\n\nThankfully Underwood’s on the mend now, but don’t be surprised if she and Fisher decide to pack up their belongings and move to a new address. Sources told People that they are planning on doing just that.\n\nThe insiders claimed that the family wants to make the change and is “looking to move” saying, “They are completely done with the neighborhood. The decision came after her fall. They’ve been having a lot of issues with neighbors letting people in the community to look around and it all escalated after the fall.”\n\nThe couple has lived at the same location since 2010.\n\nNext: This is how Underwood feels now.\n\n\n\nShe’s starting to feel ‘back to normal’\n\nCarrie Underwood is doing alright. | Christopher Polk/Getty Images for Mastercard Carrie Underwood is doing alright. | Christopher Polk/Getty Images for Mastercard\n\nDuring her Today show interview, Underwood also gave her fans an update on how she’s been doing and shared that each day she feels like she’s getting back to her old self.\n\n“Every day I’m feeling a little more back to normal,” she told Kotb.\n\nNext: She’s also back to doing what she does best.\n\nUnderwood is focusing on her new music\n\nUnderwood’s faith is very important to her. | Valerie Macon/AFP/Getty Images Underwood’s faith is very important to her. | Valerie Macon/AFP/Getty Images\n\nUnderwood spent a lot of time in the studio while she was recovering, and to the delight of her fans has plenty of new music coming out in the near future. Her new album titled Cry Pretty is due out in September and is her first album in which she serves as co-producer.\n\n“We have a lot of songs on there that are definitely emotional and kind of soulful and real and raw,” she said. “I hope everyone loves it as much as I do.\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/mike-fisher-carrie-underwood-640x461.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Carrie-Underwood-at-an-interview-640x441.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Carrie-Underwood-holdsthe-Grammy-award-f.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-804329872-640x460.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Carrie-Underwood-on-the-Today-show-640x338.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/Carrie-Underwood-selfie-640x500.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-640x496.png?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/this-is-the-biggest-change-carrie-underwood-is-making-in-her-life-after-freak-accident.html/", "title": "The Biggest Change Carrie Underwood Is Making In Her Life After 'Freak Accident'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/this-is-the-biggest-change-carrie-underwood-is-making-in-her-life-after-freak-accident.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Carrie Underwood and her husband may be making a major change in their lives following her accident.", "og": {"locale": "en_US", "type": "article", "title": "The Biggest Change Carrie Underwood Is Making In Her Life After 'Freak Accident'", "description": "Carrie Underwood and her husband may be making a major change in their lives following her accident.", "url": "https://www.cheatsheet.com/entertainment/this-is-the-biggest-change-carrie-underwood-is-making-in-her-life-after-freak-accident.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-07T15:05:16-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "injury", "section": "Entertainment", "published_time": "2018-06-07T14:46:00-04:00", "modified_time": "2018-06-07T15:05:16-04:00"}, "twitter": {"card": "summary_large_image", "description": "Carrie Underwood and her husband may be making a major change in their lives following her accident.", "title": "The Biggest Change Carrie Underwood Is Making In Her Life After 'Freak Accident'", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/carrieunderwood-1-627x500.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528397160.0, "source": "https://www.cheatsheet.com", "summary": ""}