{"url": "http://time.com/5279661/alyssa-milano-mental-illness-month-anxiety-pregnancy/", "text": "I have a secret, and I am not alone.\n\nI am a mother, an actor and an activist — and like over 40 million Americans, I live with a mental illness. This Mental Health Awareness Month, I am joining the people nationwide who are standing up, sharing their stories and demanding that lawmakers defend our access to health care.\n\nMy Generalized Anxiety Disorder was most likely triggered by my postpartum depression, and my journey with mental illnesses began with my journey into motherhood.\n\nIn 2011, two years after suffering a miscarriage, I learned that I was pregnant with my first son, Milo — and it was a dream. My miscarriage was heartbreaking, but this pregnancy was beautiful: I did not experience morning sickness; I went to prenatal yoga five times a week; I walked two miles a day; and I took naps in the afternoon.\n\nFollowing this idyllic image of motherhood, I wrote a strict birth plan: no induction of labor, no pain medication and no c-sections. I equated a natural birth to my value as a woman and as a mother — and I was determined not to stray from that course.\n\nBut life does not always go according to plan.\n\nOn August 31, 2011, ten days before my due date, I began to have complications. Despite my plan, the doctors had to try to induce labor. I was forced to take an epidural, and I eventually delivered my beautiful son (after 18 hours of labor and three and a half hours of pushing) via C-section. And then, with my darling son in my hands, I was in excruciating pain not only from my C-section but also, from my milk coming in.\n\nThat first night, after we returned from the hospital, I suffered my first anxiety attack. I felt like I had already disappointed my child. I felt like I failed as a mother, since I was not able to give birth vaginally or nourish him with the breast milk that had not come in yet. My heart raced. My stomach seized up. I felt like I was dying.\n\nI recovered. But a few months later, Milo spiked a very high fever and had a febrile seizure in my arms, and my paralyzing anxiety reared its head again.\n\nNo, no, no, I thought to myself. This can’t be happening again. I don’t have time for this. This was still 2011, and I was supposed to start work on a television show the following week.\n\nI told myself that I needed to keep myself together.\n\nAs we began filming, my anxiety worsened. I began to develop irrational and obsessive fears. Like many working moms, I was overwhelmed by guilt for leaving my son during work hours, and like many others who suffer from anxiety, my pain was not taken seriously.\n\nEvery day, I would drive to work and think about all the ways that Milo could die in the hands of his caretakers. Every night, after working 16-hour days, after I was finally able to hold my child and put him to sleep, my day’s anxiety would culminate into a debilitating anxiety attack.\n\nFinally, I hit a wall. One early morning, I went to the emergency room at 2:00 AM, asked for a psychiatrist and got help. I felt as though I had no choice: I asked to be committed; I stayed in a public psychiatric ward for three days.\n\nAt last, I began to feel as if my pain was recognized, but it wasn’t easy. One of my doctors dismissed my symptoms, and many of my colleagues, even female colleagues, still had trouble understanding that I was hurting at all.\n\nBut throughout this process, I also found angels — including my psychiatrist and my therapist. They convinced me that I had the bravery to face my illness, the value to seek help and the strength to recover.\n\nAnd I am continuing to do all three. And most likely I will for the rest of my life.\n\nHere’s the thing about mental illnesses: you don’t always look sick, and the answers are not always clear or black-and-white. But we should not confront these challenges by placing more hurdles in front of Americans who desperately need the care. I was lucky enough to have the means and the insurance to get the help and support I needed. What happens to those mothers who don’t have the kind of support I received?\n\nMental health is also not a threat that can only happen to someone else: one in six Americans face mental illness, and less than half of them receive any form of mental health services.\n\nLet’s rededicate ourselves to talking about mental health. Let’s demand that our lawmakers pass policies that open — not restrict — our access to mental health services. Let’s remind each other that no one should have to face these challenges by themselves.\n\nAnd if you see me on the street, please come tell me that I am not alone.\n\nSign up for Inside TIME. Be the first to see the new cover of TIME and get our most compelling stories delivered straight to your inbox. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg", "https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/01/TIME_Kaiser_Permanente-124.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/02/your_brain_knows_the_meds_you_need.jpg?quality=85&w=487"], "top_img": "https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Alyssa Milano"], "canonical_link": "https://time.com/collection/davos-2020-mental-health/5279661/alyssa-milano-mental-illness-month-anxiety-pregnancy", "title": "Alyssa Milano: How I Came to Terms With My Anxiety Disorder", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "DavosMentalHealth,Mental Health,onetime", "news_keywords": "DavosMentalHealth,Mental Health,onetime", "description": "This Mental Health Awareness Month, I am joining people in sharing our stories. Mine began with an anxiety attack when I was pregnant", "og": {"title": "Alyssa Milano: How I Came to Terms With My Anxiety Disorder", "type": "article", "site_name": "Time", "url": "https://time.com/5279661/alyssa-milano-mental-illness-month-anxiety-pregnancy/", "description": "\"I am joining the people nationwide who are standing up, sharing their stories\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "true"}, "pinterest": {"url": "https://time.com/collection/davos-2020-mental-health/5279661/alyssa-milano-mental-illness-month-anxiety-pregnancy", "description": "This Mental Health Awareness Month, I am joining people in sharing our stories. Mine began with an anxiety attack when I was pregnant", "media": "https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5279661/alyssa-milano-mental-illness-month-anxiety-pregnancy/", "title": "Alyssa Milano: How I Came to Terms With My Anxiety Disorder", "description": "\"I am joining the people nationwide who are standing up, sharing their stories\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/05/alyssa-milano-color1.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}