{"url": "https://www.etonline.com/best-dressed-stars-week-oct-22-harry-styles-selena-gomezs-demi-lovato", "text": "Harry Styles continues to lead the way as best dressed guy with out-of-this-world fashion. Selena Gomez proved that a little black dress never goes out of style and Demi Lovato matched her lilac eyeshadow to her body-hugging Alice + Olivia dress.\n\nThis week, Hollywood's most fashion-forward stars let statement pieces speak for themselves. Whether it was a bold lip, a power suit, mismatched heels or an oversized blue floral pin, A-listers chose key accessories to stand out and express their individuality.\n\nFrom streetwear to red carpet glamour, these celebrities slayed the fashion game for the week of Oct. 22. ET has all the details on the best dressed stars -- and where you can get their looks!\n\nRELATED: Best Dressed Celebs of the Week: Beyonce, Blake Lively, Camila Cabello & More\n\nDemi Lovato\n\nGetty Images\n\nThe \"Confident\" singer wowed in a show-stopping silky lilac Alice + Olivia gown with a thigh-high slit and belted waist at the InStyle Awards in Los Angeles on Oct. 23.\n\nLovato paired the $395 body-hugging dress with barely-there glittery pointed toe Gianvito Rossi heels retailing $795 and a whopping $19,000 Leticia Linton Lavender Cocktail Ring. She finished off her sleek look with a matching lavender eye and nude lip.\n\nLeticia Linton Design\n\nKate Bosworth\n\nGetty Images\n\nAnother celeb who dazzled at the InStyle Awards was Kate Bosworth, who was all sparkles in a gold Alexandre Vauthier long-sleeve dress with a high slit and blue flower pinned to her shoulder.\n\nThe 34-year-old actress had her hair slicked back and wore a bold red lip, accessorizing her stunning look with Louboutin black strappy heels, a $315,000 13.28 carat Norman Silverman diamond ring set and 8.86 carat diamond Norman Silverman earrings, which cost $36,000.\n\nRELATED: Selena Gomez and Demi Lovato Reunite at the ‘InStyle’ Awards: See the Sweet Moment!\n\nSelena Gomez\n\nGetty Images\n\nA special shout-out also goes to the \"Fetish\" singer, who jumped on the mismatched shoe trend with her Jacquemus heels at the InStyle Awards. Retailing for $655, one shoe featured a yellow circle as a heel, while the other had two wooden blocks and a ball in a darker shade.\n\nGomez showed off her unique pair of sandals with a $465 sexy spaghetti strap LBD from the same designer's Spring 2006 runway collection.\n\nGetty Images\n\nRELATED: Cate Blanchett Goes Bold, Cindy Crawford Sparkles And More Looks From InStyle Awards: Pics!\n\nHarry Styles\n\nBackgrid\n\nThe \"Sign of the Times\" singer is a natural when it comes to fashion. On Oct. 25, Styles was spotted looking casually cool in a Solar System-Intarsia cashmere sweater by The Elder Statesmen, knitted with a colorful solar system and retailing for $2,348.55.\n\nHe paired the statement sweater with black skinny jeans, brown boots and tortoise shell Ray-Ban sunglasses.\n\nTHE ELDER STATESMAN\n\nKaia and Presley Gerber\n\nGetty Images\n\nThe model siblings made a chic appearance at the CFDA/Vogue Fashion Fund Show and Tea at Chateau Marmont in Los Angeles on Oct. 25.\n\nKaia, 16, looked picture perfect in a plaid sleeveless Veronica Beard Finn dress from the designer's Spring 2018 collection, which she paired with white strappy, pointed-toe heels and a rectangular-shaped red clutch. Meanwhile, Presley, 18, looked dapper in black trousers, a white button-up and black-and-white sneakers. Sibling goals!\n\nRELATED: Kaia and Presley Gerber Are the Ultimate Chic Sibling Goals at CFDA/Vogue Fashion Fund Show\n\nNikki Reed\n\nGetty Images\n\nThe 29-year-old actress was just as excited as we were about her chic Spring 2017 Ready to Wear Emporio Armani bright pink suit she wore at the CFDA/Vogue Fashion Fund Show on Oct. 25.\n\nThe fashion-forward garb featured candy cane stripes on the bottom of the trousers and on the blazer's sleeves, as well as tiny elephant prints. Letting the pajama-inspired outfit speak for itself, Reed kept the rest at a minimal with single-strap silver heels and no jewelry.\n\n\"If you know me, you know I love pajamas. But pajamas with tiny elephants all over them?! Come on! @emporioarmani you made all my dreams come true,\" the new mom posted on Instagram about her ensemble.\n\nAmal Clooney\n\nGetty Images\n\nAs if the 39-year-old human rights lawyer couldn't get any more beautiful, Amal stunned at the Suburbicon premiere at the Village Theatre in Los Angeles, California on Oct. 22. Amal looked ethereal in a Greek goddess-inspired strapless blue-and-white Bill Blass gown from the designer's Spring 2007 collection. The mother of two complemented her look with 18 karat white gold and diamond torpedo Lorraine Schwartz earrings and a silver Judith Leiber rectangular clutch priced at $2,995.\n\nET spoke with Amal's hubby, George, at the premiere, where he gushed about his 4-month-old twins, Alexander and Ella. \"This is an important part of my life's journey and this is really, truly the largest step in fatherhood for me at this point,\" the 56-year-old first-time dad expressed.\n\nGigi and Bella Hadid\n\nJames Devaney/GC Images\n\nThe supermodel sisters made us do a double take with their posh Chanel ensembles they wore at V Magazine’s Intimate Dinner in Honor of Karl Lagerfeld at the Top of the Standard in New York City on Oct. 23.\n\nGigi, 22, opted for a gray with black patterned coat, which she paired with a gray-and-white wool pullover, a $15,450 black, white and yellow glitter tweed dress from the Fall-Winter 2017/Ready-to-Wear collection, and gray velvet booties.\n\nMeanwhile, Bella, 21, took an edgier route, donning a $13,600 black double face embroidered lambskin coat from the same collection, a $1,475 belt and Chanel black fingerless gloves, purse and pointed toe heels. So fierce!\n\nPICS: Red Hot Red Carpet Crushes\n\nAna de Armas\n\nGetty Images\n\nThe 29-year-old actress oozed elegance at the Blade Runner 2049 premiere at Roppongi Hills in Tokyo, Japan, on Oct. 24. The Cuban actress looked whimsical in a romantic pale pink long-sleeved Giambattista Valli gown from the Spring 2017 Couture collection.\n\nThe floral chiffon dress featured a high collar topped with frills and decorated with blue, white and green crystals around the neck, sleeves and waist. Armas completed her hyper-feminine look with her hair wisped back in a low bun and light-and-fresh makeup.\n\nShantel VanSanten\n\nRich Fury/Getty Images\n\nThe Shooter star was the perfect combination of sexy and cute at the Platt Boutique Jewelry and The Kit Vintage Opening Celebration in Los Angeles on Oct. 24.\n\nVanSanten looked timeless in a powder blue Elisabetta Franchi Fall 2017 blazer and cropped trousers, which she stylishly paired with a matching Zita bag by Lei Lou by Alex Dojcinovic, a silver chain belt with stars and gold-and-silver Aquazzura heels. Her tousled blonde locks and aqua eyeshadow completed the sophisticated look.\n\nRELATED: Ladies, Suit Up!\n\nZendaya\n\nGetty Images\n\nLast week, the Disney star appeared on our list with her romantic H&M x Erdem ensemble. This week, Zendaya slayed a laid-back look at the Michael Jackson Scream Halloween Takeover at TCL Chinese 6 Theatres in Hollywood on Oct. 24.\n\n\"I wanted something that was casual and cool,\" Zendaya told ET at the event. \"I went for more of an understated look today.\" We approve!\n\nHer cropped khaki trench jumpsuit by Frame, which she styled with beige pointed toe heels and layered necklaces, retails for $399. Her John Hardy pendant is worth $2,500 and the \"We the People\" necklace by Slow Factory is just $75 bucks!\n\nSlow Factory\n\nMORE: Kourtney Kardashian Rocks Tiny LBD at Fashion Event After Confirming She’s Not Pregnant: Pics!\n\nWhat did you think of this week's best dressed stars? Did you see anything else you absolutely loved? Tell us your thoughts by tweeting @LizCalvario or @etnow!\n\nBeyonce's $5 Million Dollar Moment, Blake Lively's Alligator Bag: The 4 Best Dressed Stars of the Week This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/selena_gomez_dress_gettyimages_865626540_0.jpg?itok=_uKSipqV", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/nikki_reed_gettyimages-866438378.jpg?itok=wNPqa6cY", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/kaia_gerber_presley_gerber_gettyimages-866439422.jpg?itok=qYX1KIi3", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/ana-de_armas_gettyimages-865758806.jpg?itok=bKPFO3ej", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/zendaya_-_gettyimages-866071506.jpg?itok=NlesjVAQ", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/gigi_hadid_bella_hadid_getty865721716.jpg?itok=xnoD3M7Z", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/selena_gomez_heels_gettyimages-865677994.png?itok=Zknh64PZ", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/we_the_people_necklace.jpg?itok=x19vrWcq", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/elder_statesman_sweater.jpg?itok=3XToQRjm", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/leticia_linton_ring_2.png?itok=s9SYDWn4", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/amal_clooney_gettyimages-865229186.jpg?itok=RM7qkXxR", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2017-11/1280_millie_bobby_brown_getty868683828.jpg?h=c673cd1c&itok=Jldm1vgc", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/dressed_vidpic_102717_1280_1.jpg?h=c673cd1c&itok=0lWCY0GZ", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/kate_bosworth_gettyimages-865601390.jpg?itok=FCF0s7qR", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/shantal_vansanten_getty866051574.jpg?itok=TwLRejXl", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/demi_lovato_dress_gettyimages_865625906_0.jpg?itok=cScuULhO", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/harry_styles_bgus_1038188_017.jpg?itok=kxWoUkaE"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/dressed_vidpic_102717_1280_1.jpg?h=c673cd1c&itok=0lWCY0GZ", "keywords": [], "authors": ["Liz Calvario"], "canonical_link": "https://www.etonline.com/best-dressed-stars-week-oct-22-harry-styles-selena-gomezs-demi-lovato", "title": "Harry Styles' Galactic Sweater, Selena Gomez's Perfect LBD & More Best Dressed Stars of the Week", "meta_data": {"article": {"opinion": "false"}, "title": "Harry Styles' Galactic Sweater, Selena Gomez's Perfect LBD & More Best Dressed Stars of the Week | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/best-dressed-stars-week-oct-22-harry-styles-selena-gomezs-demi-lovato", "title": "Harry Styles' Galactic Sweater, Selena Gomez's Perfect LBD & More Best Dressed Stars of the Week", "description": "From streetwear to red carpet glamour, these are the stars who slayed the fashion game the week of Oct. 22.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/dressed_vidpic_102717_1280_1.jpg?h=c673cd1c&itok=0lWCY0GZ", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "From streetwear to red carpet glamour, these are the stars who slayed the fashion game the week of Oct. 22.", "title": "Harry Styles' Galactic Sweater, Selena Gomez's Perfect LBD & More Best Dressed Stars of the Week", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Liz Calvario‍", "url": "https://www.etonline.com/best-dressed-stars-week-oct-22-harry-styles-selena-gomezs-demi-lovato", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/dressed_vidpic_102717_1280_1.jpg?h=c673cd1c&itok=0lWCY0GZ"}, "description": "From streetwear to red carpet glamour, these are the stars who slayed the fashion game the week of Oct. 22.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Fashion, News, Demi Lovato, Selena Gomez, Kaia Gerber, Harry Styles", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}