{"url": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633", "text": "Former 'Bachelorette' Andi Dorfman on What Happened Behind the Scenes and After Break-Up with Ex Josh Murray Dorfman reveals she burned belongings that reminded her of her ex-fiance.\n\n\u0097 -- When Andi Dorfman went searching for love on the 10th season of “The Bachelorette,” she thought she found her happy ending with Josh Murray.\n\nBut just nine months after the final rose ceremony, Dorfman and Murray both decided to end their engagement.\n\n“I don’t generally think of myself as a weak person, but it rocked me. It was heartbreak,” Dorfman told ABC News’ “Nightline.”\n\nIn her new book, “It’s Not Okay,” Dorfman is now pulling back the curtain on her life in the “Bachelorette” bubble and revealing her version of the details surrounding her failed engagement, including why she set some of the things Murray had given her on fire after their break-up.\n\nDorfman first stepped onto the “Bachelor”/”Bachelorette” scene as one of 27 women vying for the heart of “Bachelor” Juan Pablo before becoming a “Bachelorette” herself.\n\nDuring her season as the Bachelorette, Dorfman, 29, fell head over heels for Murray, a then 29-year-old former baseball player, and the two got engaged.\n\nAfter filming wrapped she said, “I was so comfortable with Josh at that point... It felt like we were there and that everyone else were strangers. But I will say I remember after they yelled, ‘Cut’ ... they gave us our cell phones, and the first thing I did was get his number. And I said, ‘Wow, I’m getting my fiancé’s number for the first time.’ ... So, things like that are kind of funny.”\n\nIn her book, Dorfman dishes about the scandalous “Fantasy Suite,” where she hooked up with the two men she was considering, Murray and Nick Viall. Dorfman said she was blindsided by the backlash she received over having sex in the Fantasy Suite twice.\n\n“I was at a point where I felt deeply for these two men,” Dorfman said. “Every woman who is 27 years old that is looking to be with a man for the rest of their life that has dated them for seven weeks and met their family and been told that they’re loved by them and had these intimate experiences outside the bedroom, probably feels like they can extend that intimacy into the bedroom.”\n\nIn the end, she chose Murray, but off-camera, Dorfman said their relationship started to fall apart. She said Murray didn’t know how to handle her independence.\n\n“I started to change. I think I blame myself for not standing up for my independence. But [there were] little things, like not being able to see my friends as often or feeling like my whereabouts were kind of always in question,” she said. “I had never felt worse about myself. ... I didn’t like who I was. I didn’t like how I felt on a daily basis.”\n\nAfter months of bickering, they both decided to end it. The newly-minted reality show starlet found herself in a painfully public break-up and Dorfman said it was hard for her to even leave the house at first.\n\n“I literally slept until noon every day at which point I would watch TV,” she said. \"I’d loaf around [in] yoga pants and [a] smelly t-shirt. I’d drink wine. I was just a loser, in a sense.”\n\nIt took Dorfman weeks to build up the courage to go back to the home they shared in Georgia and get her things. When she got there, she said she found a pile of her belongings, including things Murray had given her, sitting in a corner.\n\n“That, I think, will never escape me -- just that feeling of having a home that you shared with someone and just everything be piled up and that feeling of just being disposable,” she said.\n\nFueled with anger, Dorfman said she threw everything that reminded her of Murray into the fireplace and set them on fire.\n\n“Was it the most mature approach? No, but that’s the point. I think that on TV I always felt this need to be my best, and I wasn’t at my best when I was going through a breakup and that’s just the truth,” Dorfman said. “Sometimes you have to embrace weakness. You have to recognize that you’re not going to be at your best every single day.”\n\nBut even after the heartache, Dorfman said she wouldn’t change a thing about her relationship with Murray.\n\n“I almost don’t want to know whether [what we had] was real because I know what I felt during those eight weeks,” she said. “The day I got engaged was, to this day, the happiest day of my life. I want to deny it in a sense because it didn’t work out, but if I’m being truthful about it, that was the happiest day of my life.”\n\nIn a statement to ABC News, Murray said, \"How is one supposed to comment on a fictional novel? I choose to go through life building others up, not tearing them down. I wish her nothing but the best in her new career.\"\n\nDorfman is now single and living in New York City. She says she wants to keep writing and try being a bachelorette in the city.\n\n“I just have fun here. I have fun with my girlfriends and like soaking so much of New York,” she said. “It’s scary in a sense but ... I have nothing to lose and everything to gain, it’s kind of like the silver lining of heartbreak.”", "images": ["https://s.abcnews.com/images/Entertainment/abc_andidorfman_le_160523_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/abc_andidorfman_le_160523_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Juju Chang", "Erin Brady", "Alexa Valiente", "May", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633", "title": "Former 'Bachelorette' Andi Dorfman on What Happened Behind the Scenes and After Break-Up with Ex Josh Murray", "meta_data": {"description": "When Andi Dorfman went searching for love on the 10th season of “The Bachelorette,” she thought she found her happy ending with Josh Murray.", "keywords": "andi dorfman, bachelorette, bachelor, it's not okay, juju chang, nightline,", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Former 'Bachelorette' Andi Dorfman on What Happened Behind the Scenes and After Break-Up with Ex Josh Murray", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633", "title": "Former 'Bachelorette' Andi Dorfman on What Happened Behind the Scenes and After Break-Up with Ex Josh Murray", "description": "When Andi Dorfman went searching for love on the 10th season of “The Bachelorette,” she thought she found her happy ending with Josh Murray.", "image": "https://s.abcnews.com/images/Entertainment/abc_andidorfman_le_160523_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2016-05-24T10:15:31Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,39319633", "ipad": "abcnewsipad://link/story,39319633", "googleplay": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Former 'Bachelorette' Andi Dorfman on What Happened Behind the Scenes and After Break-Up with Ex Josh Murray", "description": "When Andi Dorfman went searching for love on the 10th season of “The Bachelorette,” she thought she found her happy ending with Josh Murray.", "url": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/abc_andidorfman_le_160523_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,39319633", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,39319633", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/bachelorette-andi-dorfman-happened-scenes-break-josh-murray/story?id=39319633"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}