{"url": "https://www.hollywoodreporter.com/thr-esq/judge-lets-ashley-judd-sue-harvey-weinstein-defamation-not-sexual-harassment-1145409", "text": "The actress alleges she was nixed for a role in 'Lord of the Rings' after she rebuffed Weinstein.\n\nA California federal judge on Wednesday has decided that Ashley Judd can move forward in her lawsuit against Harvey Weinstein. However, she will only be able to proceed on defamation and tortious interference claims. A sexual harassment claim has been rejected in the first iteration of the lawsuit.\n\nThe actress alleges in her complaint that she became Weinstein's victim when the movie mogul made demands on her in a hotel room about 20 years ago. Judd says that she only escaped after relenting to a deal where she would let him touch her if she won an Academy Award. Later, Judd says she was in serious discussions for a big role in Peter Jackson's Lord of the Rings, but that opportunity was torpedoed after Weinstein or someone at Miramax told the director that she was a \"nightmare\" to work with.\n\nIn a ruling on Wednesday, one day after hearing oral arguments on Weinstein's motion to dismiss, U.S. District Court Judge Philip Gutierrez examined whether Judd had brought a timely lawsuit or whether her claims were barred by statute of limitations.\n\nThe actress said she only learned that she was nixed for a role in Lord of the Rings after Jackson recounted what happened in a December 2017 interview. Although Weinstein argued she had a duty to conduct a reasonable investigation, she responded that it was unlikely that a powerful producer and film distributor would reveal something in confidence and disrupt the relationship.\n\nThe judge writes that Judd need only raise a plausible inference at this stage that she would have been unable to learn of Weinstein's statements about her to Jackson.\n\n\"At this point, no evidence has been presented about whether it is common in the industry for actors to inquire into why they were not cast, and further, no evidence has been presented as to whether Jackson and Walsh would have informed Plaintiff about Defendant’s statements had she asked them why she was not given a role in the Lord of the Rings films,\" states the order (read here). \"Taking Plaintiff’s allegations as true — as the Court must at this stage — the Court concludes that she has raised a plausible inference that she would not have been able to learn about Defendant’s statements during the limitations period, even if she had conducted a diligent investigation.\"\n\nThe judge also rules that Judd had adequately pled a defamation claim. Weinstein attempted to argue that if he stated that he had \"bad experiences\" with Judd, this amounted to a non-actionable opinion.\n\nJudd \"argues that she can prove these statements false because Defendant had no previous professional interaction with her and her short two-day experience working on the Miramax film Smoke (where she alleges that she did not interact with Defendant) was uniformly positive,\" writes the judge. \"The Court agrees with Plaintiff.\"\n\nAs for Judd's sexual harassment claim, the judge writes that he is skeptical that the statute being invoked (California Civil Code Section 51.9) \"can ever properly be applied to a relationship between a potential employer and a prospective employee.\"\n\nHowever, Gutierrez doesn't make a firm determination on whether a claim of this nature would ever fly. Instead, he looks at Judd's description of her single meeting with Weinstein to ostensibly discuss potential roles in films and finds this doesn't fit the type of relationship of someone providing professional services on an ongoing basis — something that would actually be susceptible to sexual harassment in the workplace.\n\n\"[Judd] argues that the statute was intended to cover harassment in 'power relationships,' but the statute does not use that term,\" writes the judge, later adding, \"A prospective employee usually either gets the job after an interview or series of interviews (and then becomes covered under sexual harassment laws applicable to employment relationships), or does not get the job, in which case the relationship ends. The temporary nature of a prospective employment relationship is qualitatively different than the often-more-permanent relationships common with the categories of individuals explicitly listed in the statute.\"\n\nJudd tried to position Weinstein's behavior as similar to sexual harassment perpetrated by attorneys, physicians, and teachers — occupations referenced in the code as examples — but the judge says that she hasn't alleged the same kind of professional responsibilities on Weinstein's part.\n\nGutierrez does note that the law isn't settled on this point. If this issue eventually gets to an appeal, it could become an important and closely watched one in the #MeToo era.\n\nJudd will have an opportunity to file an amended complaint to try again with her sexual harassment claim.\n\nUpdate:\n\nTheodore Boutrous Jr., attorney for Judd, commented: \"We are very pleased that today the District Court held that Ashley Judd can proceed with her lawsuit against Harvey Weinstein and continue her effort to vindicate the wrongs he committed against her among so many other women. We are also pleased that the court gave us an opportunity to amend our complaint and present additional facts related to one of Ms. Judd's claims. We will move forward immediately with discovery, including Mr. Weinstein's deposition, and look forward to proving to a jury at trial that Mr. Weinstein defamed Ms. Judd, interfered with her ability to earn a living, and engaged in unlawful business practices. The law should not tolerate this abuse of power to damage another's career.\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/eriq096-1_0.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/04/ashhar_.jpg", "https://cdn1.thr.com/sites/default/files/2018/04/ashhar_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_hollywoodesq.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/04/ashhar_.jpg", "keywords": [], "authors": ["Eriq Gardner", "Eriq.Gardner Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/thr-esq/judge-lets-ashley-judd-sue-harvey-weinstein-defamation-not-sexual-harassment-1145409", "title": "Judge Lets Ashley Judd Sue Harvey Weinstein for Defamation, Not Sexual Harassment", "meta_data": {"viewport": "width=device-width", "description": "A California federal judge on Wednesday decided to let Ashley Judd move forward in her lawsuit against Harvey Weinstein. However, she will only be able to proceed on defamation and tortious interference claims. A sexual harassment claim has been rejected.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/thr-esq/judge-lets-ashley-judd-sue-harvey-weinstein-defamation-not-sexual-harassment-1145409", "domain": "https://www.hollywoodreporter.com/", "title": "Judge Lets Ashley Judd Sue Harvey Weinstein for Defamation, Not Sexual Harassment", "description": "The actress alleges she was nixed for a role in 'Lord of the Rings' after she rebuffed Weinstein.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/04/ashhar_.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Judge Lets Ashley Judd Sue Harvey Weinstein for Defamation, Not Sexual Harassment", "description": "The actress alleges she was nixed for a role in 'Lord of the Rings' after she rebuffed Weinstein.", "url": "https://www.hollywoodreporter.com/thr-esq/judge-lets-ashley-judd-sue-harvey-weinstein-defamation-not-sexual-harassment-1145409", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/04/ashhar_.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Judge Lets Ashley Judd Sue Harvey Weinstein for Defamation, Not Sexual Harassment", "sailthru.description": "The actress alleges she was nixed for a role in 'Lord of the Rings' after she rebuffed Weinstein.", "sailthru.author": "Eriq Gardner", "sailthru.channel": "THR, Esq.", "sailthru.vertical": "Esq.", "sailthru.date": "2018-09-19 11:42:06", "sailthru.tags": "THR, Esq., Movies, Business, Ashley Judd, Harvey Weinstein"}, "movies": [], "publish_date": 1537328526.0, "source": "https://www.hollywoodreporter.com", "summary": ""}