{"url": "https://www.elitedaily.com/p/taylor-swifts-reputation-magazine-covers-prove-shes-trolling-all-of-us-3260440", "text": "Taylor Swift has made it clear she's not messing around with gossip anymore. Reputation is coming out on Nov. 10, at midnight, and the days leading up to the album's release have been packed with new content from Swift revealing things like the Reputation tracklist, behind-the-scenes videos highlighting the creation of the album, and now, the back covers of the Reputation magazines that are available at Target when you buy the album. And Taylor Swift's Reputation magazine covers prove she's trolling all of us with this album release.\n\nOn Wednesday, Nov. 8, Swift tweeted two photos that are apparently the back covers of the Reputation magazines that will be available come tomorrow, Nov. 10. Her tweet said,\n\nForgot to show the back of the Target magazines on Friday you can get your hands on this quality reading material.\n\nThe covers themselves say things like \"WHO IS OLIVIA'S REAL FATHER?\" and \"CATITUDE! MEREDITH IS OUT OF CONTROL!\" In case you didn't know, Olivia and Meredith are Swift's two cats named after Olivia Benson from Law & Order: SVU and Meredith Grey from Grey's Anatomy. This is expert trolling, if I do say so myself. The magazine covers show Swift making fun of tabloid coverage of her over the years while also making fun of herself. The magazines themselves will reportedly feature poems written by Swift as well as photos from her Reputation photo shoot.\n\nI can't lie. They're pretty funny.\n\nSwift is really going gung-ho with this whole \"F the media\" angle with Reputation.\n\nIs this angle about the ~dishonest media~ pretty poorly/insensitively timed given the fact that the President of the United States actively tries to discredit one of the most important tenets of American democracy? One hundred percent. But look what we made her do!!\n\nSwift's \"Call It What You Want\" lyrics highlight the emotional side of how done she is with tabloid gossip. The lyrics go:\n\nMy castle crumbled overnight, I brought a knife to a gunfight, they took the crown but it's alright. All the liars are calling me one, nobody's heard from me in months, I'm doing better than I ever was.\n\nCause my baby's fit like a daydream, walking with his head down, I'm the one he's walking to. So, call it what you want yeah, call it what you want to. My baby's fly like a jet stream, high above the whole scene, loves me like I'm brand new. So, call it what you want yeah, call it what you want to.\n\nAll my flowers grew back as thorns, windows boarded back up after the storm, he built a fire just to keep me warm. All the drama queens taking swings, all the jokers dressing up as kings, they fade to nothing when I look at him.\n\nAnd I know I make the same mistakes every time, bridges burn, I never learn, at least I did one thing right, I did one thing right. I'm laughing with my lover, making forts under covers, trust him like a brother, yeah you know I did one thing right. Starry eyes sparking up my darkest night.\n\nCause my baby's fit like a daydream, walking with his head down, I'm the one he's walking to. So, call it what you want yeah, call it what you want to. My baby's fly like a jet stream, high above the whole scene, loves me like I'm brand new. So, call it what you want yeah, call it what you want to.\n\nI want to wear his initial on a chain around my neck, not because he owns me, but 'cause he really knows me, which is more than they can say. I recall late November, holding my breath, slowly I said, \"You don't need to save me, but would you run away with me?\" \"Yes.\"\n\nCause my baby's fit like a daydream, walking with his head down, I'm the one he's walking to. So, call it what you want yeah, call it what you want to. My baby's fly like a jet stream, high above the whole scene, loves me like I'm brand new. So, call it what you want yeah, call it what you want to.\n\nSwift released the Reputation tracklist earlier this week, and it looks like the first half of the album is about her media reputation and the second half is about her relationship with Joe Alwyn.\n\nReputation comes out Friday, Nov. 10, at midnight.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2017/11/9/de5af921-1ab9-4e7e-8d9d-c7b0044fea09-getty-500762824.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/77bee980-e9e8-4a76-80c2-acd01f4d9518-lead-image-14.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/9/de5af921-1ab9-4e7e-8d9d-c7b0044fea09-getty-500762824.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/16/dfe9d464-85db-4695-9f18-061ddea19988-lead-image-16.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/16/537da083-5075-450e-b0c1-60575d98ec5d-capture.JPG?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/9/de5af921-1ab9-4e7e-8d9d-c7b0044fea09-getty-500762824.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/taylor-swifts-reputation-magazine-covers-prove-shes-trolling-all-of-us-3260440", "title": "Taylor Swift's 'Reputation' Magazine Covers Prove She's Trolling All Of Us", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/taylor-swifts-reputation-magazine-covers-prove-shes-trolling-all-of-us-3260440", "type": "article", "title": "Taylor Swift's 'Reputation' Magazine Covers Prove She's Trolling All Of Us", "description": "Taylor Swift has made it clear she's not messing around with gossip anymore. Reputation is coming out on Nov. 10, at midnight, and the days leading up to the album's release have been packed with new content from Swift revealing things like the…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/9/de5af921-1ab9-4e7e-8d9d-c7b0044fea09-getty-500762824.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Taylor Swift has made it clear she's not messing around with gossip anymore. Reputation is coming out on Nov. 10, at midnight, and the days leading up to the album's release have been packed with new content from Swift revealing things like the…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}