{"url": "abcnews.go.com/GMA/Culture/meghan-markles-father-breaks-silence-wedding-wanted-walk/story?id=55969067", "text": "Meghan Markle's father breaks silence on wedding: 'I really wanted to walk her down the aisle' Meghan Markle's father, Thomas, spoke to \"Good Morning Britain\" on Monday.\n\nThomas Markle, father of newly married Duchess Meghan Markle, apologized for staging photos before his daughter's wedding to Prince Harry and expressed regret at not being able to walk her down the aisle in his first interview since the wedding.\n\n\"She was beautiful. I cried a little watching her,\" Thomas Markle said on \"Good Morning Britain.\" \"I was very proud and I couldn't see a better moment in my life. The whole world was watching my daughter.\"\n\n\"The unfortunate thing now is that I'm a footnote in one of the greatest moments in history instead of a dad walking his daughter down the aisle,\" he said. \"It was a very emotional moment. I regretted it because I really wanted to walk her down the aisle. But I'm thankful for how it all went.\"\n\nMeghan Markle and Prince Harry attend a Wheelchair Tennis match during the Invictus Games 2017 at Nathan Philips Square, Sept. 25, 2017, in Toronto. Chris Jackson/Getty Images\n\nMeghan's father admitted to being a bit jealous that he was not at the wedding, but expressed thanks to Prince Charles, Harry's father, for stepping in.\n\n\"I can't think of a better replacement than Prince Charles,\" said Markle. \"He looked very handsome. I was jealous, I wish it was me, but thank God he was there and I thank him for that.\"\n\nThe father of the bride, who described his daughter as a \"princess,\" said that he imagines Prince Charles was thrilled to walk his daughter down the aisle.\n\n\"It might have been a treat for him as well because he didn't have a daughter.\"\n\nThe Prince of Wales has expressed many times how he had always hoped to have a daughter. He has become particularly close to his new daughter-in-law, Meghan.\n\nPrince Harry, Duke of Sussex, places the wedding ring on Meghan Markle during their wedding ceremony in St George's Chapel, Windsor Castle, in Windsor, on May 19, 2018. Jonathan Brady/AFP/Getty Images\n\nThomas Markle decided to withdraw from the wedding after the U.K.'s Mail on Sunday claimed that he had been participating in staged photo shoots to help his image.\n\nWithin 24 hours it appeared that he had changed his mind after speaking with his daughter and Prince Harry. But again he backed out several days later after saying he had suffered a heart attack and would be unable to travel.\n\n\"Good Morning Britain\" host Piers Morgan disclosed on-air that Markle, who lives in Mexico, was paid \"a few thousands pounds\" for his interview with the TV show.\n\nMarkle said his daughter was only concerned about his health in a tearful phone call with Prince Harry when he shared that he would be unable to attend her wedding.\n\n\"They were disappointed,\" he said. \"Meghan cried, I'm sure, and they both said, 'Take care of yourself, we are really worried about you.'\"\n\nMeghan's father said he apologized to Meghan and Harry for his error in judgment with regard to taking the photos.\n\n\"I realized it was a serious mistake,\" he said. \"It's hard to take it back.\"\n\nKensington Palace issued a statement on Meghan’s behalf shortly before the wedding and after her father announced he would be undergoing heart surgery.\n\n\"Sadly, my father will not be attending our wedding,\" Markle, 36, said in the statement from Kensington Palace. \"I have always cared for my father and hope he can be given the space he needs to focus on his health.\n\n\"I would like to thank everyone who has offered generous messages of support,\" the statement continued. \"Please know how much Harry and I look forward to sharing our special day with you on Saturday.\"\n\nFirst conversation with Meghan about her new boyfriend\n\nThe first phone calls were, \"Daddy, I have a new boyfriend.' And I said, 'That's really nice,' and the next phone call was like, 'He's British,' and I said, 'That's really nice,' and eventually the third time around was like: 'He's a prince.'\"\n\nHe continued: \"And at that point, she said, 'It's Harry,' and I said, 'Oh, Harry, OK!' She said, 'Of course we’ll have to call him 'H' so no one knows we're talking about Harry.'\"\n\n\"We talked a little about how they met and how happy they were with each other,\" Markle reflected.\n\n\"He's quite easy to talk to; he's quite a comfortable person to talk to,\" Markle added. \"I wasn't nervous. Ten thousand miles apart, it's hard to be nervous talking to someone on the phone.\"\n\nAsking for Meghan's hand in marriage\n\nThomas Markle recounted the moment when Prince Harry asked him for his daughter's hand in marriage over the phone.\n\n\"You are a gentleman, promise me you will never raise your hand against my daughter and of course I will grant you my permission,'\" he recalled saying.\n\nMarkle said his daughter has \"been a princess since the day she was born,\" adding, \"He made a good pick, didn't he?\"\n\nWhen asked about Harry's grandmother, Queen Elizabeth, Markle replied, \"I’ve had respect for that women since I was a child. I think she’s one of the most incredible women in the world and I would love to meet her.\"\n\nOn Meghan wanting children\n\nThomas Markle also revealed that Meghan and Harry are ready to start a family.\n\n\"She's wanted children for a long time,\" the former Hollywood producer told \"Good Morning Britain.\" \"When she met Harry and spoke about how much she loved him, there’s got to be a child in the making somewhat soon.\"\n\nWORLD EXCLUSIVE: ’She [Meghan\n\nOn when he knew the relationship was serious\n\nThe wide-ranging interview with \"Good Morning Britain\" saw hosts Piers Morgan and Susannah Reid ask about when he realized that Meghan and Harry's relationship was serious.\n\n\"I can't give you a date, no, [but] it was certainly a few months before the announcement of the engagement,\" he said.\n\n\"My daughter is very intelligent. She knows how to choose who she wants to be with. She's a smart girl and she made a good pick. The royals are very complicated, but she can always rise to that occasion.\n\n\"My daughter is capable of anything and she will be a complement to the royal family.\"\n\nMeghan Markle walks down the aisle as she arrives for the wedding ceremony to Prince Harry at St. George's Chapel in Windsor Castle in Windsor, May 19, 2018. Danny Lawson/AP\n\nOn the staged photos and paparazzi deal\n\nFor the first time Meghan's father discussed the leaked photographs and his agreement to participate in order to change his image.\n\n\"For the last year photographs of me were always derogatory,\" he explained. \"They would take pictures of my hand grabbing the beer, they’d take pictures of me getting in my car, taking the garbage out, they’d take pictures of me buying a toilet and making a big deal out of it. They took all kinds of pictures making me look negative.\"\n\nHe said he apologized to his daughter and son-in-law over the phone.\n\n\"I thought this would be a nice way of me improving my look. Well obviously that all went to hell. And I feel bad about it,\" he said. \"I apologized for it and that’s all I can do. I can't do much beyond that. That was a mistake.\n\nMarkle added, \"I didn’t do this for money; I did this to change my image. For one whole year I was presented as a hermit hiding out in Mexico. I was looking to change my image and obviously that was a mistake that went wrong.\"\n\nOn Markle’s nickname for his daughter\n\nMarkle also spoke warmly about his nickname for his daughter and how it came about.\n\n\"When she was a child she loved \"Jack and the Beanstalk.\" ... Because she’s so small I called her Bean or beanie,\" Thomas said.\n\nWhen asked jokingly if he called her Duchess Bean, Markle answered, \"Well I don’t think I’ll call her duchess. I don’t have to, she’s my daughter.\"", "images": ["https://s.abcnews.com/images/Entertainment/thomas-markle-sr-bg-jc-180514_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/thomas-markle-sr-bg-jc-180514_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Carolyn Durand", "June", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067", "title": "Meghan Markle's father breaks silence on wedding: 'I really wanted to walk her down the aisle'", "meta_data": {"keywords": "Prince Charles, Prince Harry, children, fathers, Meghan Markle, wedding", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Meghan Markle's father breaks silence on wedding: 'I really wanted to walk her down the aisle'", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067", "title": "Meghan Markle's father breaks silence on wedding: 'I really wanted to walk her down the aisle'", "image": "https://s.abcnews.com/images/Entertainment/thomas-markle-sr-bg-jc-180514_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-06-18T11:48:45Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,55969067", "ipad": "abcnewsipad://link/story,55969067", "googleplay": "https://goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Meghan Markle's father breaks silence on wedding: 'I really wanted to walk her down the aisle'", "url": "https://goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/thomas-markle-sr-bg-jc-180514_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,55969067", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,55969067", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/meghan-markles-father-breaks-silence-wedding-wanted-walk-55969067"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}