{"url": "www.bustle.com/p/meghan-markle-was-really-at-pippa-middletons-wedding-reception-but-the-details-are-a-much-debated-mystery-9038753", "text": "One of the more romantic scenes in Lifetime's take on everyone's favorite royal duo, Harry & Meghan: A Royal Romance, involves the wedding of someone the couple is only tangentially related to: Pippa Middleton, sister of Kate Middleton, Duchess of Cambridge. In the made-for-TV movie, the almost-royal is excluded from a pretty significant Middleton family gathering (ahem, our girl Pippa's wedding ceremony) and as it turns out, the real Meghan Markle wasn't at Pippa's wedding ceremony, either — but she managed to make it to the reception.\n\nIn the movie, the fictional Markle is on the phone with her mother, slightly sad about being left out, when Harry bursts in to take her to the party after all — where she met Harry's parents for the first time. In the film, Kate Middleton blames her sister's \"no ring, no bring\" policy — meaning only engaged or married couples were allowed — for Markle being benched. (In real life and in the movie, Markle and the prince were not yet betrothed.)\n\nAs it turns out, this plus one policy was the real deal, but as PEOPLE noted, both James Middleton's longtime girlfriend Donna Air and Princess Eugenie's longtime boyfriend Jack Brooksbank attended the ceremony. Additionally, according to The Telegraph, Markle was fully invited to Middleton's May 2017 wedding despite the \"no ring no bring\" policy, but at the last moment Markle did not appear at the ceremony itself. So what gives?\n\nThe way PEOPLE told the story, Harry left after the ceremony and drove 90 minutes back to London to pick up his then girlfriend from Kensington Palace where she was cooped up. According to Vanity Fair, Markle had been seen in London before the wedding and everything seemed good to go. E! news reported that Markle skipped out of the ceremony so as not to draw attention to a wedding that was not her own and upstage the couple on their special day. (For the record, The Daily Beast was already speculating whether or not Markle would steal the show, as many once thought Pippa did at her sister's wedding, before the big day even arrived.) It's also possible there was concern that the paparazzi, who mobbed Markle at every chance, would make for unruly and unwelcome wedding guests. The Mirror speculates that it was always the plan for Markle to attend the reception, despite laying low for the wedding itself, and that Prince Harry's last-minute drive was simply so she wouldn't have to arrive alone. (Bustle reached out to Kensington Palace for comment but did not hear back.)\n\ncourtesy of Lifetime\n\nUnfortunately for that wasn't the end of the drama. There was still some slight scandal when The Mirror reported that Markle's black dress and white cape was a sombre fashion faux pas for a wedding reception. The Lifetime movie leaves this bit out, making Markle's reception dress red, and any real life faux pas doesn't seem to have affected any permanent damage on Markle's relationship with the Royals in 2018.\n\nOh, but there's more: The wedding reception scene in the Lifetime movie takes additional steps to mix fiction with reality for the sake of drama by including a fictional relative named Lady Violet, who wears an offensive brooch to the wedding. The scene calls to mind a heated racist brooch trolling debacle — in which Princess Michael of Kent caught fire for wearing a blackamoor brooch, with an exotic and offensive depiction of an African person, to a luncheon attended by Markle. The Princess later apologized and claimed not to have worn something so offensive to Markle intentionally, but in the Lifetime movie, Harry warns this fictional Lady Violet about the same brooch, months before the luncheon would have taken place — which is a pretty shady twist on the real life story.\n\nAnd look, there was probably a decent amount of actual family drama at Pippa's wedding — the Royals are humans, after all, and humans get dramatic at weddings. But clearly, the Lifetime movie plays up it all up for our amusement — likely far more than anything that actually happened in real life.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/5/9/6f15ec86-cbf2-4b9c-bd57-ad564ee4286c-getty-685904558.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/5/e5059d5f-f23d-4016-90e4-bc4a73592502-96ece6fb-101e-42cd-a084-bfdfcbe60052-john-finlay-tattoos.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/5/9/6f15ec86-cbf2-4b9c-bd57-ad564ee4286c-getty-685904558.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/f68a1b87-538b-4638-809f-cb823668dbd5-screen-shot-2020-04-09-at-21211-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/2956127a-2dc3-49d5-9022-8e866922d0bb-getty-833926804.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/9/942e2f86-246e-42e4-9ddb-f74e976ddb65-hmarr_02272018_mc_0070-1.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/bdb0f12d-3fc5-4f54-9148-62a9337bc4d5-getty-1199620322.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/9/6f15ec86-cbf2-4b9c-bd57-ad564ee4286c-getty-685904558.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/meghan-markle-was-really-at-pippa-middletons-wedding-reception-but-the-details-are-a-much-debated-mystery-9038753", "title": "Meghan Markle Was Really At Pippa Middleton's Wedding Reception, But The Details Are A Much Debated Mystery", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/meghan-markle-was-really-at-pippa-middletons-wedding-reception-but-the-details-are-a-much-debated-mystery-9038753", "type": "article", "title": "Lifetime's Harry & Meghan Movie Makes Meghan's Appearance At Pippa's Wedding Seem SO Dramatic", "description": "One of the more romantic scenes in Lifetime's take on everyone's favorite royal duo, Harry & Meghan: A Royal Romance, involves the wedding of someone the couple is only tangentially related to: Pippa Middleton, sister of Kate Middleton, Duchess of…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/9/6f15ec86-cbf2-4b9c-bd57-ad564ee4286c-getty-685904558.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "One of the more romantic scenes in Lifetime's take on everyone's favorite royal duo, Harry & Meghan: A Royal Romance, involves the wedding of someone the couple is only tangentially related to: Pippa Middleton, sister of Kate Middleton, Duchess of…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}