{"url": "https://comicbook.com/marvel/2018/02/28/thor-ragnarok-chris-hemsworth-brainwash-kids/", "text": "With Thor: Ragnarok now out on Digital HD, many people are experiencing the film from the comfort of their own homes. Including star Chris Hemsworth, who is using the opportunity to indoctrinate his children!\n\nThe actor posted a video to social media featuring his kids watching the film on an iPad, proud that he's \"brainwashing\" them into becoming Marvel- no, THOR fans. Check it out in the video below.\n\nTo be fair, this is a marked improvement from the last update about Hemsworth's kids and their fondness for superheroes. He previously told E! that they preferred a different god from the DC Comics' pantheon.\n\n\"They want to be Wonder Woman, both my sons and my daughter,\" Hemsworth said. \"Yep, that's alright, I love Wonder Woman, it's cool. Different universe, but that's ok.\"\n\nThe kids also seem much more engrossed now that they're watching the finished product, because they were \"wildly unimpressed\" when they visited him on the set of the new film.\n\n\"They were like, 'This is so boring! We thought you fought monsters for a living and you don't. You just pretend, and so we're going to wreck stuff,'\" he said. \"And that's what they did. They ran around and broke things… If they see the movie and they see all the special effects, which make me look cool, then I'm the hero. But once they saw behind the curtain, it ruined it.\"\n\nIt looks like they just needed some time to process, because they're just as engrossed in the battle between the God of Thunder and Surtur as many viewers were when the film premiered in theaters.\n\nWho knows if Hemsworth will drag his kids to another Marvel Studios set in the future. With Avengers: Infinity War set to release in a couple of months and his filming completed on the untitled sequel, he's candid in admitting to Channel 7's Sunrise that he's \"done\" with the role unless something compelling comes along.\n\n\"We felt like we reinvented the last one in a big way,\" he said of Taika Waititi's Ragnarok. \"We might have a conversation if there's another great script that comes along. But at the moment that's it.\"\n\nThor: Ragnarok is now available on Digital HD, and will premiere on Blu-ray and DVD on March 6th.", "images": ["https://media.comicbook.com/2018/02/thor-ragnarok-chris-hemsworth-brainwash-kids-1087136-640x320.jpeg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2018/02/thor-ragnarok-chris-hemsworth-brainwash-kids-1087136-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/marvel/2018/02/28/thor-ragnarok-chris-hemsworth-brainwash-kids/", "title": "Chris Hemsworth Shares Video of Brainwashing His Kids With 'Thor: Ragnarok'", "meta_data": {"description": "With Thor: Ragnarok now out on Digital HD, many people are experiencing the film from the comfort of their own homes. Including star Chris Hemsworth, who is using the opportunity to indoctrinate his children!The actor posted a video to social media featuring his kids watching the film on an iPad, [...]", "keywords": "Thor: Ragnarok,Chris Hemsworth,Thor,Avengers: Infinity War", "news_keywords": "Thor: Ragnarok,Chris Hemsworth,Thor,Avengers: Infinity War", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Chris Hemsworth Shares Video of Brainwashing His Kids With 'Thor: Ragnarok'", "description": "With Thor: Ragnarok now out on Digital HD, many people are experiencing the film from the comfort [...]", "image": "https://media.comicbook.com/2018/02/thor-ragnarok-chris-hemsworth-brainwash-kids-1087136-640x320.jpeg"}, "og": {"title": "Chris Hemsworth Shares Video of Brainwashing His Kids With 'Thor: Ragnarok'", "type": "article", "url": "https://comicbook.com/marvel/2018/02/28/thor-ragnarok-chris-hemsworth-brainwash-kids/", "image": {"identifier": "https://media.comicbook.com/2018/02/thor-ragnarok-chris-hemsworth-brainwash-kids-1087136-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Marvel", "description": "With Thor: Ragnarok now out on Digital HD, many people are experiencing the film from the comfort [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1519747200.0, "source": "https://comicbook.com", "summary": ""}