{"url": "http://toofab.com/2017/05/11/is-amy-schumers-snatched-a-trainwreck-here-are-7-worst-reviews/", "text": "Amy Schumer and Goldie Hawn's latest flick \"Snatched\" tells the story of a young social media obsessed woman (Schumer) and her prude mother (Hawn) as they embark on an adventure that goes from bad to worse.\n\nThe comedy film is being met with mixed reviews, with many critics saying they enjoyed the comedy while others wish they never watched it. Positive reviews for the movie recognize its 'good, raunchy fun,' noting that it might possible cause you to \"crack up from start to finish, while also leaving you misty-eyed and wanting to hug your mom.\"\n\nBut, as always, with the good comes the bad. As it stands now, the film has a score of 40% on Rotten Tomatoes with critics taking aim at the film's lackluster plot and half decent humor.\n\n'Snatched' hits theaters on May 12.\n\nHere are 7 of the worst reviews.\n\nSlant Magazine critic Keith Watson:\n\n\"It's not surprising that even in a film set in Latin America it's the white actors who're front and center, but it's dismaying how comfortable the filmmakers are in treating the film's few Ecaudorian and Colombian characters as mere props for violent gags. Dippold and Levine are smart enough to winkingly call attention to some of their own racial stereotyping, but they're never quite clever enough to turn a critical eye on their protagonists or to interrogate the cultural assumptions embedded in their own white-women-in-peril narrative.\"\n\nNews.com AU critic Wenlei Ma:\n\n\"There are some great laugh-out loud moments (“Welcome/whale cum”) and the supporting characters have a lot of fun (Barinholtz and Wanda Sykes are highlights) but there are a lot more misses than there are hits. Snatched is narratively incoherent and often really boring. It’s more like an extended sketch show where only every second or third joke works.\"\n\nTime Out critic Tom Huddleston:\n\n\"...Schumer needed to show her range – can she play anything other than a directionless, oversexed thirtysomething who drinks too much but learns a few valuable life lessons before the credits roll? On this evidence, um, no.\"\n\nNew York Times critic A.O. Scott:\n\n\"Ms. Schumer has been criticized for this kind of thing before, and I suppose there’s a certain integrity in blithely refusing to care. It’s also true that comedy can be forgiven for a lot as long as it manages to make you laugh. Which “Snatched” did, in my case, a handful of times, including when Emily has a tapeworm and when her brother reaches out to the State Department for help rescuing his mother and sister. But though this movie ostensibly celebrates the spirit of adventure and openness to experience, it takes no risks and blazes no trails. It’s ultimately as complacent, self-absorbed and clueless as its heroine, and not always in an especially amusing way.\"\n\nTheWrap critic Robert Abele:\n\n\"What we’ve gotten in “Snatched” is an uninspired, scattershot disaster romp that mostly serves the talents of one half of the marquee pairing, underuses the other half, and struggles to blend R-rated humor, foreign misadventure, and oil-and-water mother-daughter dynamic into a cohesive diversion.\"\n\nVariety critic Owen Gleiberman:\n\n\"But at “Snatched,” even if you do love Amy Schumer, you have to follow her into an aggressively cartoonish mother-daughter vacation-from-hell comedy that never strays far from the fractious, one-note surface. The movie teams Schumer with Goldie Hawn, in what’s supposed to be a return to form for the original contempo kewpie doll of screwball comedy. The trouble is, “Snatched” really is a return to form — it goes right back to the knockabout synthetic spirit of such cheeseball Goldie Hawn comedies as “Foul Play,” “Overboard,” and “Bird on a Wire.” If you like those movies (and some do), maybe you’ll go for this, and “Snatched,” at least for the time being, probably has the market cornered on major Hollywood comedies about women behaving badly. But as written by Katie Dippold (the “Ghostbusters” remake) and directed by Jonathan Levine (“The Wackness”), it doesn’t set the bar very high.\"\n\nFresno Bee critic Rick Bentley:\n\n\"Schumer is so bad in this movie that the biggest laughs she gets are by exposing her breast and passing gas. That’s not smart comedy writing, just laziness. All Schumer has done is proven that comedians of all faith, creed or sex can be in a production that is criminally unfunny. Best-case scenario with “Snatched” is that you are kidnapped and taken from the theater during a screening. Worst case is you are kidnapped and forced to watch this total mess.\"\n\nView Photos", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://toofab.akamaized.net/2017/05/11/snatched-film-still-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2017/05/11/snatched-film-still-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/05/11/is-amy-schumers-snatched-a-trainwreck-here-are-7-worst-reviews/", "title": "Is Amy Schumer's 'Snatched' a Trainwreck? Here Are 7 Worst Reviews", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Is Amy Schumer's 'Snatched' a Trainwreck? Here Are 7 Worst Reviews", "description": "Ouch - Critics are really hating on Amy Schumer and Goldie Hawn's 'Snatched.'", "image": "https://toofab.akamaized.net/2017/05/11/snatched-film-still-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Ouch - Critics are really hating on Amy Schumer and Goldie Hawn's 'Snatched.'", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/05/11/is-amy-schumers-snatched-a-trainwreck-here-are-7-worst-reviews/", "site_name": "toofab", "type": "article", "title": "Is Amy Schumer's 'Snatched' a Trainwreck? Here Are 7 Worst Reviews", "description": "Ouch - Critics are really hating on Amy Schumer and Goldie Hawn's 'Snatched.'", "image": "https://toofab.akamaized.net/2017/05/11/snatched-film-still-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": ["https://www.youtube-nocookie.com/embed/QcyeYFXdHNQ"], "publish_date": 1494432000.0, "source": "http://toofab.com", "summary": ""}