{"url": "https://en.wikipedia.org/wiki/America%27s_Got_Talent_(season_12)", "text": "The twelfth season of America's Got Talent, an American talent show competition, began broadcasting in the United States during 2017, from May 30 to September 20 on NBC. Following the previous season, Nick Cannon ended his role as host of the program following a disagreement with the network, leading to producers hiring Tyra Banks as his replacement.[2] The guest judges for Judge Cuts this season included Chris Hardwick, DJ Khaled, Laverne Cox and Seal.[3][4][5]\n\nThe twelfth season was won by singing ventriloquist Darci Lynne, with singer Angelica Hale finishing second, and glow-light dance troupe Light Balance placing third.[6] During its broadcast, the season averaged around 12.66 million viewers and is the highest viewed in the program's history to date. The season is most notable for the death of a participant outside of filming, who was subsequently given tribute by the program.[7][8]\n\nSeason Overview [ edit ]\n\nOpen auditions took place in late 2016, within Chicago, Austin, Cleveland, Jacksonville, Philadelphia, Las Vegas, San Diego, New York City, Charleston, Memphis, and Los Angeles,[9] with online auditions also accepted by producers. As with the previous year, the judges' auditions were held and filmed in March at the Pasadena Civic Auditorium in Los Angeles. The Judge Cuts stage of the competition saw the involvement of comedian Chris Hardwick, media personality DJ Khaled, actress Laverne Cox, and singer and musician Seal as guest judges for this stage.[3][4][5]\n\nAfter eight years of hosting America's Got Talent, Nick Cannon's future on the program became uncertain after he faced criticism from NBC over a joke he made on his 2017 Showtime comedy special, Stand Up, Don't Shoot, which the network deemed as potentially racist. Cannon determined from this that it was best he left the program rather than to remain and face the possibility of being fired by the network, and so announced his resignation from the program on February 13, 2017, a month before production of the twelfth season was to begin.[10] Although the network would not accept his announcement to begin with, owing to the fact that Cannon was still under contract to host AGT, the network's executives eventually agreed that his decision was the best course of action under the circumstances, and thus advised the production staff to find a replacement before the new season was due to begin.[11] On March 12, television personality Tyra Banks was unveiled as the new host for America's Got Talent, prior to filming commencing. Apart from the change in host, the program required no further changes, although production staff were forced to take care with airing the audition of a participant, after they died in an accident outside of filming.[7]\n\nOf the participants who auditioned for this season, 36 secured a place in the live quarter-finals, with twelve quarter-finalists in each one - amongst these included: singing ventriloquist Darci Lynne, singer and ukeleleist Mandy Harvey, singer Christian Guardino, glow-light dance troupe Light Balance, and singer Angelina Green,[12] who had each received a golden buzzer from the main judges; singer Angelica Hale, singer and guitarist Chase Goehring, singer Celine Tam, and soul singer Johnny Manuel,[12] who had each received a golden buzzer from the guest judges; and vocal group Final Draft, comic darevevil Bello Nock, and video-mappers Oskar and Gaspar, who were chosen as WildCard quarter-finalists. Around 22 quarter-finalists advanced to and split between the two semi-finals - including dog tricks act Pompeyo Family Dogs, chosen as the WildCard semi-finalist - with 10 semi-finalists securing a place in the finals. The following below lists the results of each participant's overall performance in this season:\n\nWinner | Runner-up | Third place | Finalist | Semi-finalist Quarter-finalist | Wildcard Quarter-finalist | Wildcard Semi-finalist Golden Buzzer - Auditions | Golden Buzzer - Judge Cuts\n\nQuarter-final Summary [ edit ]\n\nBuzzed Out | Judges' choice | Advanced to Semi-finals Won Online Public Vote | Won Judges' Vote | Lost Judges' Vote\n\nQuarter-final 1 (August 15) [ edit ]\n\nGuest Performers, Results Show: Grace VanderWaal [13]\n\nQuarter-Finalist Order Act Buzzes and Judges' votes Result (August 16) Cowell Klum Mel B Mandel Christian Guardino 1 Singer Advanced (Online Public Vote) Artyon & Paige 2 Dancing Duo Eliminated In The Stairwell 3 A-cappella Group Advanced The Singing Trump 4 Singing \"Donald Trump\" Impersonator Eliminated Angelica Hale 5 Singer Advanced Bello Nock 6 Comic Daredevil Eliminated Just Jerk 7 Hip-hop Dance Group Eliminated (Judges' Vote Tied - Lost by Public Vote) Puddles Pity Party 8 Singing Clown Eliminated Preacher Lawson 9 Stand-up Comedian Advanced Yoli Mayor 10 Singer Advanced (Judges' Vote Tied - Won by Public Vote) Billy & Emily England 11 Extreme Rollerskating Duo Advanced Darci Lynne 12 Singing Ventriloquist Advanced\n\nQuarter-final 2 (August 22) [ edit ]\n\nGuest Performers, Results Show: Circus 1903 [14]\n\nQuarter-Finalist Order Act Buzzes and Judges' votes Result (August 23) Cowell Klum Mel B Mandel Brobots & Mandroidz 1 Hip-hop Dance Crew Eliminated Celine Tam 2 Singer Advanced Mirror Image 3 Vocal Dance Duo Eliminated Johnny Manuel 4 Singer Advanced Merrick Hanna 5 Dancer Advanced Eric Jones 6 Close-up Magician Advanced (Judges' Vote Tied - Won by Public Vote) The Masqueraders 7 Soul Trio Eliminated (Judges' Vote Tied - Lost by Public Vote) Light Balance 8 Glow-light Dance Troupe Advanced Evie Clair 9 Singer & Pianist Advanced (Online Public Vote) Demian Aditya 10 Escape Artist Eliminated Pompeyo Family Dogs 11 Dog Tricks Act Eliminated Mandy Harvey 12 Singer & Ukulelist Advanced\n\nQuarter-final 3 (August 29) [ edit ]\n\nGuest Performers, Results Show: Mat Franco, Piff the Magic Dragon, and Jon Dorenbos[17][18]\n\nQuarter-Finalist Order Act Buzzes and Judges' votes Result (August 30) Cowell Klum Mel B Mandel DaNell Daymon & Greater Works 1 Gospel Choir Advanced (Won Judges' Vote) Junior & Emily Alabi 2 Salsa Dance Duo Eliminated Final Draft 3 Vocal Group Eliminated Oscar Hernandez 4 Dancer Eliminated Angelina Green 5 Singer Eliminated (Lost Judges' Vote) Colin Cloud 6 Mentalist Advanced (Online Public Vote) Mike Yung 7 Singer Advanced Oskar & Gaspar 8 Video-mapping Act Eliminated Sara and Hero 9 Dog Tricks Act Advanced Chase Goehring 10 Singer & Guitarist Advanced Diavolo 11 Acrobatic Dance Group Advanced Kechi Okwuchi 12 Singer Advanced\n\nSemi-final Summary [ edit ]\n\nBuzzed Out | Judges' choice | Advanced to Finals Won Online Public Vote | Won Judges' Vote | Lost Judges' Vote\n\nSemi-final 1 (September 5–6) [ edit ]\n\nGuest Performers, Results Show: The Clairvoyants [19]\n\nSemi-Finalist Order Act Buzzes and Judges' votes Result (August 31) Cowell Klum Mel B Mandel Yoli Mayor 1 Singer Eliminated Eric Jones 2 Close-up Magician Eliminated (Lost Judges' Vote DaNell Daymon & Greater Works 3 Gospel Choir Eliminated Preacher Lawson 4 Stand-up Comedian Advanced Johnny Manuel 5 Singer Eliminated Billy & Emily England 6 Extreme Rollerskating Duo Eliminated Evie Clair 7 Singer Advanced (Online Public Vote) Sara & Hero 8 Dog Tricks Act Advanced Chase Goehring 9 Singer & Guitarist Advanced (Won Judges' Vote) Darci Lynne 10 Singing Ventriloquist Advanced Mike Yung 11 Singer Eliminated\n\nSemi-final 2 (September 12) [ edit ]\n\nGuest Performers, Results Show: Absinthe\n\nSemi-Finalist Order Act Buzzes and Judges' votes Result (September 13) Cowell Klum Mel B Mandel Celine Tam 1 Singer Eliminated Colin Cloud 2 Mentalist Eliminated (Lost Judges' Vote) Christian Guardino 3 Singer Eliminated In the Stairwell 4 A-cappella Group Eliminated Merrick Hanna 5 Dancer Eliminated Mandy Harvey 6 Singer Advanced Pompeyo Family Dogs 7 Dog Tricks Act Eliminated Diavolo 8 Acrobatic Dance Group Advanced (Won Judges' Vote) Kechi Okwuchi 9 Singer Advanced (Online Public Vote) Light Balance 10 Glow-light Dance Troupe Advanced Angelica Hale 11 Singer Advanced\n\nFinals (September 19-20) [ edit ]\n\nWinner | Runner-up | 3rd place | Top 5\n\nFinalist Act Performed with\n\n(2nd Performance) [6] Result (September 20) Angelica Hale Singer Kelly Clarkson 2nd Chase Goehring Singer & Guitarist James Arthur Finalist Sara & Hero Dog Tricks Act N/A Grand-finalist Diavolo Acrobatic Dance Group N/A Finalist Evie Clair Singer James Arthur Finalist Preacher Lawson Stand-up Comedian N/A Finalist Kechi Okwuchi Singer Kelly Clarkson Finalist Darci Lynne Singing Ventriloquist Terry Fator 1st Mandy Harvey Singer & Ukeleleist Shania Twain Grand-finalist Light Balance Glow-light Dance Troupe Derek Hough 3rd\n\nRatings [ edit ]\n\nThe following ratings are based upon those published by Nielsen Media Research after this season's broadcast:\n\nShow Episode title First air date Timeslot (EDT) Rating\n\n(18–49) Share\n\n(18–49) Viewers\n\n(millions) Nightly\n\nRank Weekly\n\nRank 1 Auditions Week 1 May 30, 2017 Tuesday\n\n8:00 p.m. 2.7 11 12.32 [20] 1 3 [21] 2 Auditions Week 2 June 6, 2017 2.7 11 12.53 [22] 1 3 [23] 3 Auditions Week 3 June 13, 2017 2.6 11 12.70 [24] 1 2 [25] 4 Auditions Week 4 June 20, 2017 2.6 11 12.74 [26] 1 1 [27] 5 Auditions Week 5 June 27, 2017 2.5 10 12.36 [28] 1 1 [29] 6 Auditions Week 6 July 11, 2017 2.5 10 12.59 [30] 1 1 [31] 7 Judge Cuts 1 July 18, 2017 2.5 11 12.57 [32] 1 1 [33] 8 Judge Cuts 2 July 25, 2017 2.6 11 13.08 [34] 1 1 [35] 9 Judge Cuts 3 August 1, 2017 2.8 12 13.33 [36] 1 1 [37] 10 Judge Cuts 4 August 8, 2017 2.7 11 13.32 [38] 1 1 [39] 11 Quarterfinals, Week 1 (Performances) August 15, 2017 2.8 11 13.44 [40] 1 1 [41] 12 Quarterfinals, Week 1 (Results) August 16, 2017 Wednesday 8:00 p.m. 2.1 9 10.89 [42] 1 2 [41] 13 Quarterfinals, Week 2 (Performances) August 22, 2017 Tuesday 8:00 p.m. 2.6 10 12.76 [43] 1 1 [44] 14 Quarterfinals, Week 2 (Results) August 23, 2017 Wednesday 8:00 p.m. 2.0 9 10.84 [45] 1 2 [44] 15 Quarterfinals, Week 3 (Performances) August 29, 2017 Tuesday 8:00 p.m. 2.6 11 13.13 [46] 1 2 [47] 16 Quarterfinals, Week 3 (Results) August 30, 2017 Wednesday 8:00 p.m. 1.9 8 11.07 [48] 1 3 [47] 17 Semifinals, Week 1 (Performances) September 5, 2017 Tuesday 8:00 p.m. 2.6 10 13.29 [49] 1 3 [50] 18 Semifinals, Week 1 (Results) September 6, 2017 Wednesday 8:00 p.m. 2.1 8 11.99 [51] 1 6 [50] 19 Semifinals, Week 2 (Performances) September 12, 2017 Tuesday 9:00 p.m. 2.3 9 11.57 [52] 1 3 [53] 20 Semifinals, Week 2 (Results) September 13, 2017 Wednesday 8:00 p.m. 2.1 8 11.59 [54] 1 2 [53] 21 The Finals September 19, 2017 Tuesday 8:00 p.m. 3.0 12 14.70 [55] 1 4 [56] 22 Season Finale September 20, 2017 Wednesday 8:00 p.m. 3.0 11 15.64 [57] 1 2 [56]\n\nSpecials\n\nShow Episode title First air date Timeslot (EDT) Rating\n\n(18–49) Share\n\n(18–49) Viewers\n\n(millions) Nightly\n\nRank Weekly\n\nRank S1 Best of Season 12 Auditions July 13, 2017 Thursday 8:00 p.m. 1.3 6 7.10 [58] 2 10 [31] S2 Road to Finals[59] August 9, 2017 Wednesday 8:00 p.m. 1.3 6 7.01 [60] 2 8 [39]\n\nIncidents [ edit ]\n\nBehind-the-scenes Death\n\nOne of the most notable incidents to occur on America's Got Talent took place in 2017, and involved the death of a participant, American physician Brandon Rogers, outside of filming during the auditions stages of the competition. Rogers became involved in the twelfth season when producers came across his YouTube videos, in which he had become a viral success story as a result of his skill in singing various different songs, including one by Boyz II Men. Although he had performed well and had voiced optimism at potentially earning a place in the live rounds, Rogers became involved in a fatal automobile accident on June 11, 2017, and died in hospital the following day.[7] Producers felt it unwise to showcase footage of his performances without consent of his family, but prior to the Judge Cuts episodes being aired, they eventually were given to showcase Rogers' audition as a special tribute in his memory on July 11.[8]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Crystal_Clear_action_button_cancel.svg/20px-Crystal_Clear_action_button_cancel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Tyra_Banks_2012_Shankbone.JPG/180px-Tyra_Banks_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Crystal_Clear_action_bookmark.png/20px-Crystal_Clear_action_bookmark.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Crystal_Clear_app_clean.svg/20px-Crystal_Clear_app_clean.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Yellow_ffff00_pog.svg/15px-Yellow_ffff00_pog.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Playing_card_club_A.svg/20px-Playing_card_club_A.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Playing_card_heart_A.svg/15px-Playing_card_heart_A.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Playing_card_heart_A.svg/20px-Playing_card_heart_A.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Crystal_Clear_action_bookmark.png/15px-Crystal_Clear_action_bookmark.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Playing_card_club_A.svg/15px-Playing_card_club_A.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Yellow_ffff00_pog.svg/20px-Yellow_ffff00_pog.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Crystal_Clear_app_clean.png/20px-Crystal_Clear_app_clean.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/America%27s_Got_Talent_(season_12)", "title": "America's Got Talent (season 12)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}