{"url": "www.thesun.co.uk/tvandshowbiz/5489130/spice-girls-reunion-victoria-beckham-snubs-husband-david/", "text": "THE Spice Girls re-formed — with Victoria Beckham looking to grab the showbiz limelight back from husband David.\n\nPosh Spice was said to be the most excited of the five.\n\n32 Spice Girls Mel C, Victoria Beckham, Emma Bunton, Geri Horner and Mel C pictured together for the first time since 2012\n\n32 Spice Girls share pic on social media of their reunion, featuring Processo bottle, Union Jack cup and Brit Awards\n\nThe Spice Girls leave Geri Horner's London pad after holding talks to reunite for the first time in six years\n\nShe is still smarting over husband David’s move to Miami and this is her way of taking back control.\n\nVictoria, 43, was reunited with Emma Bunton and Mel B, both 42, Mel C, 44, and Geri Horner, 45.\n\nThe get-together at Geri’s North London pile came hours after The Sun revealed plans for the iconic group to get back together.\n\nImmediately afterwards, Victoria posted the first picture of the band together in six years on Instagram, writing: “Love my girls!!! So many kisses!!! X Exciting x #friendshipneverends #girlpower.”\n\n32 Victoria Beckham and Emma Bunton share sweet snap on social media Credit: Instagram\n\n32 Beaming Emma Bunton and Mel B celebrate reunion and TV deal Credit: Instagram\n\n32 Geri Horner holds baby son Montague as she celebrates with bandmate Mel B Credit: Instagram\n\n32 Mel C joins in the fun as band talk deal with Simon Fuller Credit: Instagram\n\nWe can reveal that during the one hour, 15-minute meeting the Wannabe singers launched plans for their first TV series later this year.\n\nThey ate sushi, kissed and hugged, and shared stories about their kids.\n\n32 David Beckham recently announced his move back to Miami Credit: AFP or licensors\n\n32 Spice Girls reunite with Simon Fuller as they plan comeback\n\n32 Spice Girls were known for their platform shoes and catchy tunes in the Nineties Credit: Rex Features\n\nMusic video for Spice Girls hit single 2 Become 1\n\nOur insider revealed: “Victoria knows this is the last chance saloon for the Spice Girls, their last chance to get back into their hot pants.\n\n“She knows David is viewed as the showbiz force in their marriage and she is now a fashion businesswoman.\n\n“But she wants that to change and really embrace being back in the spotlight with the Spice Girls.\n\n“For many years, it’s been Victoria who has put the block on the Spice Girls returning. But yesterday she was the most excited about it.\n\n32 Scary Spice Mel B arrives to reunion meeting in VW Golf Credit: Doug Seeburg - The Sun\n\n32 Geri Horner pictured in her Aston Martin on drive to the get-together venue Credit: The Mega Agency\n\n32 Victoria Beckham arrives in her Mercedes Credit: Splash News\n\n“For the moment, she’s still insisting on not singing, but Geri, Mel B and Emma are confident they can change her mind.\n\n“Mel C is nervous about the idea of a full-scale tour, but there could be some type of shows and perhaps even new music.\n\n“It’s something no one in Spice world thought was possible even a few weeks ago.\n\n“Mel C was really wavering until the end but she’s now come aboard with ideas of her own.\n\n32 Spice Girls wow fans with Instagram reunion snap\n\n32 The book on Geri’s table — Strong Is The New Pretty — is a book celebrating girl power composed by Kate T. Parker\n\n32 We revealed the band's reunion plans earlier this week\n\n“The meeting went incredibly well and the Spice Girls are now back together.\n\n“Initially there was lots of reminiscing and then they started to talk about future plans.\n\n“A tour isn’t on the agenda right now, but there is hope that perhaps they could end up on stage together in some way.\n\n“Mel C is most nervous about big commitments, even more so than Victoria.\n\n“The most concrete plan is for a TV show this year, with the possibility of a series aimed at children.\n\n“All five of the girls were united in the fact that they want their children to be very heavily involved in the reunion.”\n\n32 Mel C arrives at the bash in black coat and sunglasses Credit: Peter Jordan - The Sun\n\n32 Cheeky Instagram snap shows Geri Horner enjoying herself on reunion Credit: Instagram\n\n32 Mel B sits in car and wows fans in her snazzy jacket Credit: Peter Jordan - The Sun\n\n32 Victoria Beckham is still smarting over David's latest news Credit: Peter Jordan - The Sun\n\n32 Emma Bunton arrives at do in a bright blue coat and wearing high heels Credit: Peter Jordan - The Sun\n\nPop Idol creator and former Spice Girls manager Simon Fuller, 57, was also at the meeting.\n\nHe is expected to be put in charge of the reunion plans — which will net each member at least £10million.\n\nThe Spice source said: “So 2018 is all about monetising the Spice Girls again.\n\n\"It’s what Fuller has done with Brand Beckham so they’re confident if he’s at the helm they will all ­seriously profit.”\n\n32 Spice Girls pictured performing live at the Olympics in London Credit: PA:Press Association\n\n32 Spice Girls had nine No1 hits and wowed fans with their Girl Power message Credit: Rex Features\n\n32 Victoria Beckham is overjoyed by the reunion Credit: Getty - Contributor\n\n32 Simon Fuller pictured arriving at the meeting as the band discuss plans Credit: Splash News\n\nThe Nineties favourites, who have had nine No1 hits, were originally due to meet at the five-star Connaught Hotel in London’s Mayfair.\n\nThey changed venue at the last minute over fears they would be seen together. Fuller, who met with fashionista Posh and husband David, 42, the previous evening in London, was first to arrive at 12.15pm.\n\nHe was followed by Emma, at 12.20pm.\n\nMel C shocked onlookers by walking to Geri’s house at 12.23pm in stark contrast to Victoria, who turned up at 12.20pm in the back of a blacked-out Mercedes.\n\n32 Geri Horner pictured in her car as she joins meeting Credit: Flynet Pictures\n\n32 Spice Girls picked up 1997 Brits for Say You’ll Be There video and best single, Wannabe, plus 1998 gong for Spice Up Your Life Credit: PA:Empics\n\n32 David Beckham recently announced plans to move back to Miami Credit: Splash News\n\nGeri Horner looks back on the Nineties and the rise of the Spice Girls\n\nMel B, fresh from the airport, was last to arrive at 1.20pm. She was dropped off in a Volkswagen Golf.\n\nThe meeting was interrupted by a food delivery from Planet Organic and the arrival of Bluebell, Geri’s nine-year-old daughter from school.\n\nIt is the first time the five singers have been in a room together since the opening of their flop musical Viva Forever! in December 2012.\n\nMOST READ IN BIZARRE WAR AND QUICHE Sue Perkins was 'devastated' by Bake Off co-star Paul Hollywood's behaviour Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior Exclusive TAKING THE RICK Ricky Gervais tells celebs to stop moaning in mansions while NHS staff die Exclusive FEARLESS Dynamo performed magic as a kid to thugs who'd have battered him if he was no good Exclusive That's willy close BGT's David Walliams nearly loses his todger in bold motorcycle stunt Exclusive STROKE OF LUCK The Strokes frontman Julian dating roadie half his age after split from wife\n\nThe last time the Spice Girls performed as a five-piece was at the closing ceremony of the London 2012 Olympic Games.\n\nFuller and Victoria were the first to depart yesterday at 3.30pm — followed by Baby Spice Emma. Mel C left minutes later, and stayed true to her Sporty Spice moniker by swerving a lift in favour of a walk.\n\nScary Spice Mel B was last to depart at 4.02pm, using her contacts to upgrade her transport to a silver blacked-out Mercedes.\n\n32 Mel C stayed true to her Sporty Spice moniker by swerving a lift in favour of a walk Credit: Splash News\n\n32 Mel B clutches handbag as she prepares for meeting Credit: Doug Seeburg - The Sun\n\n32 Emma Bunton beams as she chats about comeback with her bandmates Credit: Doug Seeburg - The Sun\n\n32 Spice Girls celebrate being back together with cute Instagram snap\n\n32 Victoria is overjoyed by the news after David Beckham's success in football world Credit: Rex Features\n\nThe Spice Girls said in a joint statement: “We have enjoyed a wonderful afternoon catching up and reminiscing about the amazing times we have spent together.\n\n“We are always overwhelmed at how much interest there is across the whole world for The Spice Girls.\n\nThe time now feels right to explore some incredible new opportunities together.\n\n“We all agree that there are many exciting possibilities that will once again embrace the original essence of The Spice Girls, while reinforcing our message of female empowerment for future generations.”", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.2 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2018/02/af-composite-spice-girls1.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.6 1\"%3E%3C/svg%3E"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/02/af-composite-spice-girls1.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Dan Wootton"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5489130/spice-girls-reunion-victoria-beckham-snubs-husband-david/", "title": "Victoria Beckham overjoyed at Spice Girls reunion as band’s TV deal is snub to David Beckham’s move to Miami", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Posh overjoyed at Spice Girls reunion as band's TV deal is snub to David Beckham", "url": "https://www.thesun.co.uk/tvandshowbiz/5489130/spice-girls-reunion-victoria-beckham-snubs-husband-david/", "description": "THE Spice Girls re-formed — with Victoria Beckham looking to grab the showbiz limelight back from husband David. Posh Spice was said to be the most excited of the five. She is still smarting over h…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/02/af-composite-spice-girls1.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500, "alt": "Mel C"}, "locale": "en_GB"}, "article": {"published_time": "2018-02-02T22:00:35+00:00", "modified_time": "2018-02-04T04:53:09+00:00", "publisher": 161385360554578, "tag": "David Beckham, Emma Bunton, Geri Horner, Victoria Beckham, Pop Music, Spice Girls", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Posh Spice, 43, was reunited with her bandmates in London and the iconic nineties band's reunion is her way of taking back control of her life.", "keywords": "Victoria Beckham, Melanie Brown, Mel C, Mel B, Geri Horner, Geri Halliwell, Emma Bunton, Simon Fuller, Posh Spice, Baby Spice, Ginger Spice, Sporty Spice, Scary Spice, David Beckham", "news_keywords": "Victoria Beckham, Melanie Brown, Mel C, Mel B, Geri Horner, Geri Halliwell, Emma Bunton, Simon Fuller, Posh Spice, Baby Spice, Ginger Spice, Sporty Spice, Scary Spice, David Beckham", "twitter": {"text": {"title": "Victoria Beckham overjoyed at Spice Girls reunion as band’s TV deal is snub to David Beckham’s move to Miami"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "BECKLASH", "headline": "Posh overjoyed as Spice Girls plan new TV show in snub to hubby David", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/02/af-composite-spice-girls1.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/02/af-composite-spice-girls1.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 5489130, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1517608835.0, "source": "http://www.thesun.co.uk", "summary": ""}