{"url": "https://www.thewrap.com/game-of-thrones-pacing-commentary/", "text": "Major spoilers for “Game of Thrones” up to Season 7 Episode 3 ahead.\n\n“Game of Thrones” is moving a bit fast, right?\n\nJon Snow arrives at Dragonstone from Winterfell in less than an episode, for instance, while Euron Greyjoy goes from King’s Landing to somewhere between Dragonstone and Sandstone, back to King’s Landing and then to Casterly Rock in three episodes. In the past, such moves would’ve taken all season, thanks to traveling on horseback or by boat. Nowadays, it’s like the characters invented the Hyperloop off-screen, which would’ve helped Daenerys instead of waiting six seasons to get her to Westeros.\n\nThis new breakneck speed has characters teleporting all over the Westerosi map in a move by showrunners, D.B. Weiss and David Benioff to get to the final, important plot threads.\n\n“Things are moving faster because in the world of these characters the war that they’ve been waiting for is upon them,” Weiss explained in an Entertainment Weekly interview. “The conflicts that have been building the past six years are upon them and those facts give them a sense of urgency that makes [the characters] move faster.”\n\nWhile it makes sense practically, the transition has only served as a distraction for longtime viewers — drawing attention to the pacing and the movement of time when they should be focusing on narrative and character.\n\nIt also breaks away from George R.R. Martin’s novels. The show diverges from the source material at a certain point in all respects, but tweaking with how the story plays with time and distance only shows that the showrunners and HBO are missing a key theme and a deliberate move by Martin to build tension.\n\nAlso Read: HBO Hackers Threaten to Release Data on Sunday From 'Game of Thrones' Leak: 'HBO Is Falling'\n\nThe “Song of Ice and Fire” books are almost too long thanks in part to how much time Martin puts into traveling. Readers won’t read passages about the intricacies of travel — how to pitch a camp or how to get food, for example — but a lot of the events of the first three novels revolve around transit. The fact that it takes forever for characters to get from one city to another is the device used to instigate events.\n\nHow the act of movement affects the characters can be clearly seen with Arya Stark, who spends most of her time throughout these books getting from one place to another. The first book, “Game of Thrones” has her going from Winterfell to King’s Landing. After her father’s death, she gets caught up in a series of unfortunate distractions, whether it’s being captured at Harrenhal (while on the way to the Night’s Watch) or being taken hostage by the Hound.\n\nShe eventually gains her freedom and travels to Braavos, where she apprentices with the Faceless Men. It’s around this time when the books and the show diverge. The books end with Arya losing her eyesight, which viewers will remember occurs at the end of Season 5. Season 6 then is about Arya gaining her sight back and going through another separate moral crisis.\n\nThat’s when the pacing starkly (pun intended) changes. Remember how it took Arya essentially four seasons to get to Braavos? Sometime in between the eighth episode of Season 6 and the finale (episode 10), she manages to get from the island to the Twins. She would’ve had to cross the Narrow Sea — the body of water that runs in between Westeros and Essos — and then cross the bulk of Westeros to even get to the Frey stronghold. This is a long journey, yet she’s able to do it in less than three episodes. She also has time to kill and cook each of Walder Frey’s sons into a pie.\n\nAlso Read: 'Game of Thrones': Tracking Every Valyrian Steel Sword We Know Of\n\nThis change of pace has only become more clear in Season 7, as the showrunners work to close all open story threads. In Season 6, the sudden location jumps were different, but because the plots didn’t revolve around one character having to meet with another or a group going off to war, it didn’t matter as much. Season 7, over the first three episodes at the time of this writing, has consisted primarily of characters practically teleporting to other locations that are hundreds of miles away.\n\nNormally this wouldn’t be much of a problem. There is limited time left in “Game of Thrones” to be worrying about what a character like Jon Snow is doing on the way to Dragonstone or if he encounters any conflicts. However, when the pace of a show is consistent for five seasons and then immediately becomes the opposite, the change is distracting.\n\nAnd while the show is its own entirely separate work, the change in pacing is also a dramatic departure from the source material, which frequently emphasizes long, difficult (and often boring) travel, during which you’re all but cut off from channels of communication, as an inconvenient fact of life in Westeros. That distance keeps characters utterly out of the loop at critical times, a frequent source of dramatic irony and tension.\n\nThat aspect paid off well in the TV series. In Season 3, for example, as we see Arya slowly make her way to the Twins, we’re also witnessing what will eventually become the Red Wedding. The parallel journeys and how they intersect makes Arya’s timing and observance of her brother and mother’s deaths only made the scene more heartbreaking. This is even more apparent in the books, as Arya only learns about the event in bits and pieces over the next few chapters.\n\nHowever, none of this is more apparent than with the core conflict of the show — the fight against the White Walkers. Jon and the rest of the Night’s Watch know about the impending undead doom and have been slowly trying to solve the incoming apocalypse while the rest of Westeros is engaged in war. This distance allows scenes like the one in Season 7 episode 3 where Jon tries to convince Daenerys of the Walkers’ existence possible. Because travel to the North would be complicated, nobody south of Winterfell knows anything about the true nature of winter.\n\nAlso Read: 'Game of Thrones': The Key Events In the Series So Far (Photos)\n\nSubsequently, the distance between the cities in the North, the capital in the South and the cities in Essos where Daenerys had been holed up for six seasons, ensured that those stories remained appropriately separate. While Season 7 shows that these stories are finally intersecting, it doesn’t make much sense when the White Walkers are only now a hop and a skip away from King’s Landing, if the new travel is any indication. It throws what we’ve been taught over six seasons into chaos.\n\nGranted, the White Walkers are barred from traveling south because The Wall is infused with magic that prevents the dead from passing it — but once The Wall is breached, as it surely must be, will the overrun Westeros as quickly as Jaime went from King’s Landing to Highgarden in the third Season 7 episode?\n\nIt’s clear that the showrunners have deemed the pacing change as the best means of finishing up “Game of Thrones” in the limited time frame they’ve imposed on themselves. (By design, Season 7 has only seven episodes, and Season 8 will have only six). However, in the process the show is losing a significant part of what made it — and the books on which it is based — so fascinating.\n\nIt’s not that the slow pacing is inherently better than the opposite. But this particular tale has long been defined by, and benefitted from, a pacing that is purposefully slow. As a result, the dramatic change in pace proves to be a needless distraction just as the show is (finally) getting close to the finale we’ve been waiting for since 2011.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/laura-bush-michelle-obama-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/white-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/game-of-thrones-recap-cersei-kicks-off-her-revenge-tour-1-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/04/bill-cosby-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2017/07/game-of-thrones-the-prince-that-was-promised-will-bring-the-dawn-melisandre-translations-prophecy-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/03/GettyImages-52741361-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/ben-hawkey-game-of-thrones-160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2017/08/AlGore-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "https://www.thewrap.com/wp-content/uploads/2020/04/Dwayne-Johnson-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/uploads/2016/04/game-of-thrones-shocking-deaths.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "keywords": [], "authors": ["Carli Velocci", "Beatrice Verhoeven", "Phil Hornshaw", "Jeremy Fuster", "Daniel Goldblatt", "Rosemary Rossi", "Trey Williams"], "canonical_link": "https://www.thewrap.com/game-of-thrones-pacing-commentary/", "title": "‘Game of Thrones’ Is Moving at a Breakneck Speed — And That’s a Problem (Commentary)", "meta_data": {"parsely-title": "‘Game of Thrones’ Is Moving at a Breakneck Speed — And That’s a Problem (Commentary)", "parsely-link": "https://www.thewrap.com/game-of-thrones-pacing-commentary/", "parsely-type": "post", "parsely-pub-date": "2017-08-03T17:07:03-07:00", "parsely-section": "tv", "parsely-author": "Carli Velocci", "parsely-tags": "a_song_of_ice_and_fire, arya-stark, db_weiss, david_benioff, game-of-thrones, george-r-r-martin, hbo, jon-snow", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "While \"Game of Thrones'\" now quick pace it makes sense practically, the transition has only served as a distraction for longtime viewers", "news_keywords": "a song of ice and fire, arya stark, d.b. weiss, david benioff, game of thrones, george r. r. martin, hbo., jon snow", "original-source": "https://www.thewrap.com/game-of-thrones-pacing-commentary/", "og": {"locale": "en_US", "type": "article", "title": "'Game of Thrones' Is Moving at a Breakneck Speed -- And That's a Problem (Commentary)", "description": "While \"Game of Thrones'\" now quick pace it makes sense practically, the transition has only served as a distraction for longtime viewers", "url": "https://www.thewrap.com/game-of-thrones-pacing-commentary/", "site_name": "TheWrap", "updated_time": "2017-08-04T17:24:05-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "Jon Snow", "section": "TV", "published_time": "2017-08-04T00:07:03-07:00", "modified_time": "2017-08-04T17:24:05-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "While \"Game of Thrones'\" now quick pace it makes sense practically, the transition has only served as a distraction for longtime viewers", "title": "'Game of Thrones' Is Moving at a Breakneck Speed -- And That's a Problem (Commentary)", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "creator": "@velocciraptor"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘Game of Thrones’ Is Moving at a Breakneck Speed — And That’s a Problem (Commentary)", "sailthru.date": "2017-08-04T00:07:03+00:00", "sailthru.author": "Carli Velocci", "sailthru.tags": "david benioff,d.b. weiss,a song of ice and fire,hbo.,jon snow,george r. r. martin,arya stark,game of thrones", "sailthru.category": "tv,game of thrones", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones.png", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/05/arya-stark-game-of-thrones-150x150.png", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1501830423.0, "source": "https://www.thewrap.com", "summary": ""}