{"url": "https://www.j-14.com/posts/becky-g-guardian-angel-tyler-the-medium-137621/", "text": "Becky G puts on a strong persona in the spotlight but this time, in the presence of Tyler Henry, she couldn't hold it together. Becky was featured on the show, Tyler Henry Hollywood Medium, and brought along a frame that was turned upside down so Tyler couldn't see the front. As soon as he got ahold of the object the first thing that came out of his mouth was the name, \"Tinker Bell.\" At that moment, Becky broke down in tears. She told the story of what Tinker Bell actually meant and we couldn't help but wipe away tears from our eyes as well.\n\nThis is the first time Becky has really opened up about someone from her past who died at an early age and to this day she still calls this person her guardian angel. This was someone who Becky turned to when her family was going through a very difficult time. Becky's room was decked out in Tinker Bell decor during this period of her life which is why Becky made the connection. Tyler is literally incredible. Not only does he connect people with their past but he brought back a memory for Becky that showed off a very vulnerable and very real side for her fans.\n\nRELATED: Becky G and Austin Mahone Reunite On Stage Proving Yes, They Indeed Are Still Friends\n\nTyler, at first, said, \"Tinker Bell. I don’t know what that is.\"\n\nDuring the clip, Becky responds, \"What was it? That’s so weird. The frame … at the same time as I had it, one of my rooms, everything was decorated Tinker Bell. I was obsessed with Disney. That frame was one of the things I took from my room. That was when me and my family went through a really hard time, and we lost that home.\n\nRELATED: This Is Why Selena Gomez and Becky G Could Be Soulmates\n\nThat’s when I turned to who I consider [to be] my guardian angel, to this day,” Becky continues. “I lost her when I was really young and, um, she was around the same age, and yeah, she was just always with me. Like, still after she passed, I could see her, I could feel her. And, it’s so weird, ‘cause that frame is one of the only things I have from my room, that was Tinker Bell when I went through one of the hardest times of my life, and my family’s life, so far.\"\n\nThis was absolutely chilling. In a separate confessional, Becky explains who her guardian angel is and why she connected her to the words, 'Tinker Bell.'\n\nBecky said, \"I was 9 years old and we lost our home and we were losing our house bill by bill we just couldn’t keep up anymore and one of things about my room in that house was I had a Tinkerbell my mom had hand painted a Tinkerbell that half of her was on the wall and the other half was on the ceiling so it was Tinkerbell kind of looking over my bed and putting her little fairy dust and there was a frame of my cousin who I lost when I was about 3 years old we were about 6 years apart. I call her my guardian angel. And maybe she passed on that message like, Tinkerbell, I was with her and that picture by my bed, I still have to this day and that’s the only thing that I have from my room.\"\n\nNot only did Becky open up about losing her cousin when she was so young but she also talks about how she connects this family member with dragonflies. She recalled a show she was doing just recently and felt like she couldn't go on anymore. The \"Todo Cambio\" singer was tired, exhausted and completely drained when she saw a dragonfly circling the stage. Becky knew it had to be her cousin. The dragonfly literally lifted her spirit and she went out totally nailing the performance. This story is incredibly sad yet heartwarming at the same time. It shows fans a side of Becky they have never seen before and it's pretty amazing how she's letting the world in on such a personal and intimate part of her life.\n\nRELATED: Becky G and Sebastian Lletget Shower Each Other With Love on Their Anniversary\n\nThis post was originally published on July 25, 2017.\n\nLove J-14? Be sure to subscribe to our YouTube channel for fun, exclusive videos with your favorite stars.", "images": ["https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?resize=1200%2C630", "https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?fit=200%2C113", "https://www.j-14.com/wp-content/uploads/2019/12/becky-g-new-makeup-line.jpg?resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2018/09/becky-austin.jpg?crop=0px%2C0px%2C3000px%2C1688px&resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2018/11/becky-g-lawsuit.jpg?crop=0px%2C0px%2C2313px%2C1308px&resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2017/12/beckyg.png?crop=0px%2C0px%2C1900px%2C1069px&resize=200%2C113", "https://www.j-14.com/wp-content/uploads/2017/07/screen-shot-2017-07-27-at-11-28-44-am.png?w=1180&h=290&crop=1", "https://www.j-14.com/wp-content/uploads/2018/10/j14_cover-e1539589804523.jpg"], "top_img": "https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?resize=1200%2C630", "keywords": [], "authors": ["Alex Riccardi"], "canonical_link": "https://www.j-14.com/posts/becky-g-guardian-angel-tyler-the-medium-137621/", "title": "Becky G Talks Guardian Angel With Tyler Henry Hollywood Medium", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Becky G puts on a strong persona in the spotlight but this time, in the presence of Tyler Henry, she couldn't hold it together. Becky was featured on the show, Tyler Henry Hollywood Medium, an…", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Becky G Talks Guardian Angel With Tyler Henry Hollywood Medium", "description": "Becky G puts on a strong persona in the spotlight but this time, in the presence of Tyler Henry, she couldn't hold it together. Becky was featured on the show, Tyler Henry Hollywood Medium, an…", "url": "https://www.j-14.com/posts/becky-g-guardian-angel-tyler-the-medium-137621/", "site_name": "J-14", "updated_time": "2017-07-27T15:45:54+00:00", "image": {"identifier": "https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?resize=1200%2C630", "secure_url": "https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?resize=1200%2C630", "width": 1200, "height": 630}}, "article": {"tag": "becky g", "published_time": "2017-07-25T15:37:00+00:00", "modified_time": "2017-07-27T15:45:54+00:00"}, "fb": {"app_id": 782474828470382, "admins": 593583017, "pages": 6338692612}, "twitter": {"card": "summary_large_image", "description": "Becky G puts on a strong persona in the spotlight but this time, in the presence of Tyler Henry, she couldn't hold it together. Becky was featured on the show, Tyler Henry Hollywood Medium, an…", "title": "Becky G Sobs Thinking About Someone Close to Her Who Passed Away", "image": "https://www.j-14.com/wp-content/uploads/2017/07/beckyg.jpg?resize=1200%2C630"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1500997020.0, "source": "https://www.j-14.com", "summary": ""}