{"url": "https://www.bustle.com/p/the-bachelor-in-paradise-season-4-trailer-is-making-fans-question-everything-70848", "text": "Just a few weeks ago, Bachelor in Paradise wasn't a sure thing that was happening this summer, but now it's officially coming back on August 14. But the first footage of the show fans got to see wasn't exactly what most people expected. On Monday night, the Bachelor in Paradise Season 4 trailer dropped and a lot of fans felt that it seemed kind of inappropriate after everything that's happened surrounding the show. (ABC declined to comment on the promo.)\n\nInstead of showing a few scenes that would give fans something to look forward to in the month left before the premiere like most first promos do, this one had a bit of a different tone. It first played up how upset some fans were when they found out that Bachelor in Paradise production was put on hold last month following a producer complaint about the relationship between Corinne Olympios and DeMario Jackson. Then the preview showed how some fans celebrated when news broke that the show actually was coming back, after all.\n\nAt the time of the production shut down, Warner Brothers, the production company for the show, stated: \"We have become aware of allegations of misconduct on the set of Bachelor in Paradise in Mexico. We have suspended production and we are conducting a thorough investigation of these allegations. Once the investigation is complete, we will take appropriate responsive action.\" The investigation was later concluded with no evidence of wrongdoing. A Warner Bros. spokesperson gave this statement to Bustle about production resuming.\n\nOur internal investigation, conducted with the assistance of an outside law firm, has now been completed. Out of respect for the privacy interests of those involved, we do not intend to release the videotape of the incident. We can say, however, that the tape does not support any charge of misconduct by a cast member. Nor does the tape show, contrary to many press reports, that the safety of any cast member was ever in jeopardy. Production on this season of Bachelor in Paradise will be resuming, and we plan to implement certain changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.”\n\nBut even though many fans were happy when they found out that BiP was coming back after all, it seemed wrong to many fans to promote the season this way — after all, what happened involved real people and affected their real lives.\n\nEven though the investigation launched by Warner Brothers came up with no evidence of wrongdoing, Corinne and DeMario have both been open about how the situation affected their lives outside of BiP in interviews they've done since. And beyond Corinne and DeMario, there was an entire cast of people (plus the show's crew) who were affected by the show's brief suspension of production. Making light of the situation wasn't really the best way the show could have chosen to handle or move past what happened. In fact, the trailer didn't even need to address it — that could have been saved for the premiere — but the way that it did was uncomfortable for many to watch.\n\nThe trailer talked more about the fact that the show was cancelled and then revived than what's going to happen in the season to come. There were a few quick clips and soundbites from contestants, but it paled in comparison to the amount of time spent on showing tweets from fans on the screen.\n\nThere are many fans who are excited to watch BiP in August. But celebrating it so blatantly when real people's lives were involved? That didn't really seem to sit well with many viewers.", "images": ["https://imgix.bustle.com/uploads/image/2017/7/18/259f2ddc-4ab0-49c5-a5a9-b8df1afb3c8d-bachelor-in-paradise-3-cast-photo-640x480-1469655844.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2017/7/18/259f2ddc-4ab0-49c5-a5a9-b8df1afb3c8d-bachelor-in-paradise-3-cast-photo-640x480-1469655844.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/2942276e-7f98-4e0d-9e78-fffb077dd2ed-getty-1167464598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/3/20/c328eadf-9ae0-4257-99eb-e601f708c458-getty-916296824.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/5f2cf0b3-da77-45bf-8355-6e3fb62b007d-screen-shot-2020-04-13-at-103159-am.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/31/54a3b259-9df1-4f6f-81b9-8068a873ddaa-getty-1200238649.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/7/18/259f2ddc-4ab0-49c5-a5a9-b8df1afb3c8d-bachelor-in-paradise-3-cast-photo-640x480-1469655844.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-bachelor-in-paradise-season-4-trailer-is-making-fans-question-everything-70848", "title": "The 'Bachelor In Paradise' Season 4 Trailer Is Making Fans Question Everything", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-bachelor-in-paradise-season-4-trailer-is-making-fans-question-everything-70848", "type": "article", "title": "The 'Bachelor In Paradise' Season 4 Trailer Has Fans Upset", "description": "Just a few weeks ago, Bachelor in Paradise wasn't a sure thing that was happening this summer, but now it's officially coming back on August 14. But the first footage of the show fans got to see wasn't exactly what most people expected. On Monday…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/7/18/259f2ddc-4ab0-49c5-a5a9-b8df1afb3c8d-bachelor-in-paradise-3-cast-photo-640x480-1469655844.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Just a few weeks ago, Bachelor in Paradise wasn't a sure thing that was happening this summer, but now it's officially coming back on August 14. But the first footage of the show fans got to see wasn't exactly what most people expected. On Monday…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}