{"url": "en.wikipedia.org/wiki/Dennis_Quaid", "text": "American actor\n\nDennis William Quaid (born April 9, 1954)[1] is an American actor known for a wide variety of dramatic and comedic roles. First gaining widespread attention in the 1980s, some of his notable credits include Breaking Away (1979), The Right Stuff (1983), The Big Easy (1986), Innerspace (1987), Great Balls of Fire! (1989), Dragonheart (1996), The Parent Trap (1998), Frequency (2000), Traffic (2000), The Rookie (2002), The Day After Tomorrow (2004), Vantage Point (2008), Footloose (2011), Soul Surfer (2011), and The Intruder (2019). For his role in Far from Heaven (2002), he won the New York Film Critics Circle Award for Best Supporting Actor among other accolades.\n\nEarly life [ edit ]\n\nDennis William Quaid was born in Houston, Texas, the son of Juanita B. \"Nita\" Quaid, a real estate agent, and William Rudy Quaid, an electrician.[1] Quaid has English, Irish, Scots-Irish, and Cajun (French) ancestry.[2] He attended Paul W. Horn Elementary School in Bellaire, and Pershing Middle School in Houston. He studied Mandarin and dance at Bellaire High School in Bellaire, Texas, and later in college, at the University of Houston, under drama coach Cecil Pickett, who had previously taught at Bellaire High and whose daughter is actress Cindy Pickett. He was raised in the Baptist faith.[3][4] He is the younger brother of actor Randy Quaid.\n\nCareer [ edit ]\n\nQuaid at the 2012 Toronto International Film Festival.\n\nQuaid dropped out of the University of Houston before graduating and moved to Hollywood to pursue an acting career.[2] He initially had trouble finding work but began to gain notice when he appeared in Breaking Away (1979) and earned good reviews for his role as astronaut Gordon Cooper in The Right Stuff (1983).[2]\n\nKnown for his grin,[5] Quaid has appeared in both comedic and dramatic roles.[2] Quaid had starring roles in the films The Night the Lights Went Out in Georgia (1981),[6] Jaws 3-D (1983), Enemy Mine (1985), Innerspace (1987) and The Big Easy (1987). He also achieved acclaim for his portrayal of Jerry Lee Lewis in Great Balls of Fire! (1989).[2] In 1989, he also appeared throughout the Bonnie Raitt music video for the song \"Thing Called Love.\"[7]\n\nQuaid's career lost steam in the early 1990s, after he fought anorexia nervosa brought on when he lost 40 pounds to play the tuberculosis-afflicted Doc Holliday in Wyatt Earp[8] and recovered from a cocaine addiction.[2] He continued to garner positive reviews in a variety of films, however.[2] Quaid was also the guest star of a season 2 episode of Muppets Tonight (1997). He starred in the lead role in the 1996 adventure film Dragonheart, the remake of The Parent Trap (1998), playing the part of the twins' father, and as an aging pro football quarterback in Oliver Stone's Any Given Sunday (1999). In 1998, he made his debut as a film director with Everything That Rises a television movie western in which he also starred.[9]\n\nSome of Quaid's film credits include Frequency (2000), The Rookie (2002), Far from Heaven (2002), Cold Creek Manor (2003), The Flight of the Phoenix (2004), The Alamo (2004), In Good Company (2004), The Day After Tomorrow (2004), Yours, Mine and Ours (2005), Vantage Point (2008), G.I. Joe: The Rise of Cobra (2009), and Pandorum (2009).\n\nIn 2009, Quaid guest starred in an episode of SpongeBob SquarePants, playing Mr. Krabs' grandfather, Captain Redbeard.\n\nHe portrayed U.S. President Bill Clinton, alongside Michael Sheen as Tony Blair and Hope Davis as Hillary Clinton, in the 2010 film The Special Relationship.\n\nIn 2012 and 2013, Quaid played Sheriff Ralph Lamb in the CBS TV drama series Vegas.\n\nIn 2017, he starred in A Dog's Purpose as Ethan Montgomery, billed as \"a celebration of the special connection between humans and their dogs\".[10]\n\nIn 2018, Quaid starred in I Can Only Imagine, where he played Arthur Millard, the father of singer and songwriter Bart Millard, and Kin, where he plays Hal, the father of the film's two protagonists.\n\nIn March 2018, it was confirmed by director Sean McNamara that Quaid would portray President Ronald Reagan in an upcoming biopic, titled Reagan.[11] The film is slated to have a summer 2019 release.[11]\n\nPersonal life [ edit ]\n\nRelationships and children [ edit ]\n\nQuaid has been married three times and has three children.\n\nQuaid and his first wife, actress P. J. Soles, were married on November 25, 1978. The couple divorced in 1983.[1]\n\nQuaid playing golf in 2006\n\nOn February 14, 1991, Quaid married actress Meg Ryan. Quaid and Ryan fell in love during the shooting of their second film together, D.O.A.[12] Quaid and Ryan have a son, Jack Henry Quaid (born April 24, 1992).[13] Quaid and Ryan announced their separation on June 28, 2000, saying they had been separated six weeks by then.[12] Their divorce was finalized July 16, 2001.[1]\n\nQuaid dated model Shanna Moakler in 2001.[14] The relationship lasted for eight months.[15]\n\nQuaid married Texas real-estate agent Kimberly Buffington, on July 4, 2004, at his ranch in Paradise Valley, Montana.[16] They have fraternal twins who were born via a surrogate on November 8, 2007, in Santa Monica, California.[17][18]\n\nOn November 18, 2007, hospital staff mistakenly gave Quaid's ten-day-old twins a dosage of heparin (a blood thinner) that was 1,000 times the common dosage for infants.[19][20] The babies recovered, but Quaid filed a lawsuit against the drug manufacturer, Baxter Healthcare, claiming that packaging for the two doses of heparin are not different enough.[21] In May 2008, the Quaids testified before the United States House Committee on Oversight and Government Reform, asking U.S. Congress not to preempt the right to sue drug manufacturers for negligence under state law.[22] This incident led Quaid to become a patient-safety advocate, producing a series of documentaries on preventable medical errors that aired on the Discovery Channel[23][24] as well as co-authoring a medical journal article addressing the positive influence of patient stories in motivating change in healthcare.[25] The first documentary, Chasing Zero: Winning the War on Healthcare Harm, aired on the Discovery Channel in 2010,[23][24] and the second documentary, Surfing the Healthcare Tsunami: Bring Your Best Board, aired on the Discovery Channel in 2012.[26][27][28][29]\n\nBuffington filed for divorce from Quaid in March 2012.[30] Buffington's attorney then withdrew the divorce papers on April 26, 2012.[31] In the summer of 2012, Quaid and Buffington moved to California.[32] In October 2012, Quaid and Buffington again decided to separate, and Buffington filed for legal separation, seeking joint legal and sole physical custody of the twins.[33] After waiting to establish the required six months of residency in California, Quaid filed for divorce on November 30, 2012, asking for joint legal and physical custody of the children and offering to pay spousal support to Buffington.[32] They then reconciled and the divorce was dismissed by September 2013.[34] On June 28, 2016, the couple announced in a joint statement that they were divorcing, with Kimberly Quaid asking for full physical custody and joint legal custody.[35] The divorce was finalized April 27, 2018.\n\nOn October 21, 2019, Quaid confirmed his engagement to Laura Savoie.[36]\n\nReligion [ edit ]\n\nQuaid is a Christian, writing the Christian song \"On My Way to Heaven\" dedicated to his mother and included in the film I Can Only Imagine, in which he starred.[37]\n\nInterests [ edit ]\n\nIn addition to acting, Quaid is a musician and plays with his band, the Sharks. He wrote and performed the song \"Closer to You\" in the film The Big Easy (1987). Quaid also had a pilot's license and owned a Cessna Citation.[38] He is also a one-handicap golfer, and in 2005, he was named as the top golfer among the \"Hollywood set\" by Golf Digest magazine.\n\nQuaid is a fan of the Houston Astros, and after the team's 2005 National League Championship-winning season, he narrated their commemorative DVD release. After the filming of The Express: The Ernie Davis Story, Quaid went to Cleveland Browns Stadium to dedicate Davis's jersey.\n\nSubstance use [ edit ]\n\nThere have been extensive stories about Quaid's past abuse of cocaine. In a candid 2002 interview with Larry King on his talk show, after King asked about his motives for using drugs, Quaid responded, \"Well, you got to put it in context. Back in the late 1960s, early 1970s. That was back during the time where, you know, drugs were going to expand our minds and everybody was experimenting and everything. We were really getting high, we didn't know it. And cocaine at that time was considered harmless. You know. I remember magazine articles in People Magazine of doctors saying it is not addicting. It is just—alcohol is worse. So I think we all fell into that. But that's not the way it was.\" When asked if he believed he had ever been addicted to the drugs, he responded, \"It was a gradual thing. But it got to the point where I couldn't have any fun unless I had it. Which is a bad place to be.\" Later in the interview he said, \"But I saw myself being dead in about five years if I didn't stop.\"[39]\n\nPolitical views [ edit ]\n\nIn a conversation with The New York Post, Quaid stated he was a registered independent and has voted for candidates from both major U.S. political parties. Quaid also expressed his independence from any political party or ideology and being open to other points of view.[40]\n\nCharities [ edit ]\n\nQuaid lent his name to the annual \"Dennis Quaid Charity Weekend\" (formerly the \"Jiffy Lube/Dennis Quaid Charity Classic\"), held in Austin from 2002 until 2007. The golf tournament attracted numerous celebrities with the proceeds split among local children's charities.\n\nQuaid at the 2009 Texas Film Hall of Fame Awards\n\nQuaid worked with the International Hospital for Children in New Orleans. He made several trips to Central America in the nineties to help build medical clinics and transport sick children back to the U.S. for treatment they cannot get locally.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nHome Video [ edit ]\n\nYear Title Role Notes 1997 Sesame Street: Kids' Guide to Life video series Uncle Tommy Video: \"Telling the Truth\"\n\nAccolades [ edit ]\n\nFor his role in Far from Heaven (2002) he won the New York Film Critics Circle Award for Best Supporting Actor, the Chicago Film Critics Association Award for Best Supporting Actor, the Online Film Critics Society Award for Best Supporting Actor and the Independent Spirit Award for Best Supporting Male. He received nominations for Best Supporting Actor from the Golden Globe Awards, the Phoenix Film Critics Society Awards and the Screen Actors Guild Awards. Quaid was also honored with a Distinguished Alumni Award from his alma mater, the University of Houston, in April 2012.[42]\n\nAwards and nominations [ edit ]\n\nReferences [ edit ]\n\nFurther reading [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/220px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/DennisQuaidTIFFSept2012.jpg/220px-DennisQuaidTIFFSept2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Dennis_Quaid_golfing.jpg/220px-Dennis_Quaid_golfing.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/1200px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Dennis_Quaid_2009.jpg/220px-Dennis_Quaid_2009.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/1200px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dennis_Quaid", "title": "Dennis Quaid", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/1200px-Dennis_Quaid_2020_by_Glenn_Francis.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}