{"url": "globalgrind.cassiuslife.com/3880177/kanye-west-car-accident-11-years-ago-full-story-photos/", "text": "Did you know who Kanye West was on October 23, 2002?\n\nMaybe, if you were a hardcore rap fan, but probably not. Up to that point, Kanye West had a name mostly from his production work: the Chicago-native produced the bulk of Jay Z’s 2001 classic, The Blueprint. But he wasn’t known as a rapper: he would literally make his rapping debut a month later, appearing on Jay Z’s “The Bounce” (rapping as Ray Ray, for some reason).\n\nBut, in short, he was a nobody to most.\n\nSo when news came out that the rapper was in a serious car accident on October 23, 2002, many people just shrugged. No one knew that moment would probably end up being the most important moment of his career.\n\nThat night would be the inspiration for Kanye West’s first true big hit, “Through the Wire.”\n\nBut, what happened that night? Throughout the years, Kanye has told the story a number of times. Essentially, after finishing a late night session with Beanie Sigel, Peedi Crack and The Black Eyed Peas, Kanye left the studio in L.A., at around 3AM, in his rented Lexus. While in the car, he was cut off and he ran head-on into traffic, colliding with another car just blocks away from the W Hotel.\n\nThe accident was devastating; he had to have reconstructive surgery for his face. Kanye was laid up in the hospital for weeks. He had no health insurance, paying for everything out of pocket.\n\nYears later, while pushing Late Registration, Kanye talked about the incident in an interview with USA Today, saying:\n\n“When I had my accident, I was working on Beanie Sigel, Black Eyed Peas and Peedi Crack, and let’s just say that those tracks were not my best work. If I would have passed that night, that would have been the end of my legacy. Now when I go into the studio, I act like this could possibly be my last day.”\n\nHowever, there are parts that Kanye seemed to have left out. Last year, DJ Whoo Kid, who apparently was in the studio before Kanye left, talked about what happened that night.\n\nAccording to the DJ, Ludacris was also in the studio. Kanye, trying to impress everyone, started spitting verses that Ludacris wasn’t trying to hear:\n\n“So Kanye’s looking crazy, you know, trying to impress Luda, but it wasn’t that time. Luda wanted to come in, do that verse and get the f–k out. So, what made it worse is he went out there and played a beat but by the time he got out there, Luda picked a Red Spyda beat. So now I gotta tell Kanye ‘Your services are not needed.’”\n\nAccording to Whoo Kid, Kanye would leave the session furious.\n\nWeeks after the accident, Kanye West would go back to the studio, loop up Chaka Khan’s “Through the Fire” and create “Through the Wire,” a song he rapped with a broken jaw.\n\nThe song wouldn’t reach the world until early 2003, when the track was on his debut mixtape, Get Well Soon. The tape was mostly a mixture of tracks that Kanye West produced. But there were also a couple of Kanye West songs, including unreleased classics like “Home” and “My Way.” (There were also a couple of tracks that would appear on College Dropout, like “Jesus Walks” and “Two Words”).\n\nAfter the song floated on the mixtape scene for a while, Kanye West, who wasn’t getting much label support from Roc-A-Fella at the time, took $30 grand, hooked up with Coodie and Chike and shot a cozy video.\n\nThe video premiered in November 2003 and the rest is kinda history. The song was the first single off of Kanye West’s classic debut College Dropout, which released on February 10, 2004.\n\nNothing’s been the same since.", "images": ["https://pixel.wp.com/b.gif?v=noscript", "https://secure.gravatar.com/avatar/f4c701b8621f5923353e5f040c66ecb5?s=195&d=identicon&r=g", "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=100&strip=all&w=608", "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=80&strip=all&w=608&h=1024", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://ioneglobalgrind.files.wordpress.com/2017/03/1490645017281.jpg?quality=80&strip=all&w=201&h=300", "https://ioneglobalgrind.files.wordpress.com/2017/03/14906448601755.jpg?quality=80&strip=all&w=201&h=300"], "top_img": "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=100&strip=all&w=608", "keywords": [], "authors": [], "canonical_link": "https://globalgrind.com/3880177/kanye-west-car-accident-11-years-ago-full-story-photos/", "title": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed His Life…Here’s The Entire Story", "meta_data": {"viewport": "width=device-width, height=device-height, initial-scale=1", "description": "When news came out Kanye was in a serious car accident in 2002, no one knew it would end up being the most important moment of his career.", "news_keywords": "kanye west, through the wire, car accident", "fb": {"pages": 8732630162, "app_id": 1612998638912583}, "p": {"domain_verify": "97a2356354b67006a90996b3d72bf94a"}, "google-site-verification": "x-6a6ICNV5fUNJmw9lIXWM9BCuU5vIWnmirizanBR00", "generator": "WordPress.com", "og": {"type": "article", "title": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed His Life…Here’s The Entire Story", "url": "https://globalgrind.com/3880177/kanye-west-car-accident-11-years-ago-full-story-photos/", "description": "When news came out that the rapper was in a serious car accident on October 23, 2002, many people just shrugged. No one knew that moment would probably end up being the most important moment of his…", "site_name": "Global Grind", "image": {"identifier": "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=100&strip=all&w=608", "width": 201, "height": 300, "alt": "Kanye West Signs His Album Late Registration at Tower Records in New York City - August 30, 2005"}, "locale": "en_US"}, "article": {"published_time": "2013-10-23T22:14:05+00:00", "modified_time": "2017-03-27T20:04:43+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"creator": "@GlobalGrind", "site": "@GlobalGrind", "text": {"title": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed His Life…Here’s The Entire Story"}, "card": "summary", "title": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed Hi", "description": "Did you know who <a href=\"http://www.globalgrind.com/tag/kanye-west\"><strong>Kanye West</strong></a> was on October 23, 2002?\r\n\r\nMaybe, if you were a hardcore rap fan, but probably not. Up to th", "image": "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=100&strip=all&w=608"}, "pubexchange": {"headline": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed His Life...Here's The Entire Story", "description": "Did you know who <a href=\"http://www.globalgrind.com/tag/kanye-west\"><strong>Kanye West</strong></a> was on October 23, 2002?\r\n\r\nMaybe, if you were a hardcore rap fan, but probably not. Up to that point, Kanye West had a name mostly from his product", "image": "https://ioneglobalgrind.files.wordpress.com/2017/03/14906447003864.jpg?quality=100&strip=all&w=608"}, "sailthru.date": "2013-10-23 18:14:05", "sailthru.title": "11 Years Ago Today, Kanye West Was In The Car Accident That Changed His Life…Here’s The Entire Story", "sailthru.tags": "kanye west", "sailthru.description": "When news came out that the rapper was in a serious car accident on October 23, 2002, many people just shrugged. No one knew that moment would probably end up being the most important moment of his career.", "wp-parsely_version": "1.13.0", "msvalidate.01": "30473C9E51B1FA7645F80C5736971CF1", "application-name": "Global Grind", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "The World According to Hip-Pop", "msapplication-task": "name=Subscribe;action-uri=https://globalgrind.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/b6f2d7b5b7fe8b598091e1ad49899990?s=16"}, "movies": [], "publish_date": 1382566445.0, "source": "http://globalgrind.cassiuslife.com", "summary": ""}