{"url": "https://www.etonline.com/pamela-anderson-claims-tommy-lee-is-spinning-out-of-control-following-altercation-with-their-son", "text": "Pamela Anderson is weighing in on the altercation between her ex-husband, Tommy Lee, and their 21-year-old son, Brandon Lee, that has led to a criminal investigation.\n\nIn a statement posted to her website on Thursday, titled \"Alcoholism Is the Devil,\" the 50-year-old model seemingly backs up her eldest son, who previously claimed that his father has issues with alcoholism, which the Mötley Crüe rocker has denied.\n\n\"For the record. I have made NO comment anywhere to anyone before this -- beware of tabloid gossip,\" Pamela's statement begins. \"This is a matter of life and death. I am surreally calm -- I feel justice is at work. I am not frantic or 'as reported' -- devastated. I am hopeful -- this is not new to us.\"\n\n\"I am staying in France for the moment. I have complete faith in Brandon and his team to resolve this unfortunate and sad situation regarding his father. I pray Tommy gets the help he needs,\" the statement continues. \"His actions are desperate and humiliating -- he is a disaster spinning out of control and he is not acting like a father.\"\n\nPamela continues on, claiming that \"this is nothing new,\" and that Brandon and their other son, 20-year-old Dylan Jagger Lee, have made \"every attempt to help\" their dad in recent months, by staying with him to \"make sure he's OK.\"\n\n\"Just by being present with him they were hoping he’d feel loved and act differently,\" Pamela says in the statement. \"I feared things might escalate. But -- knew this might be what it took to heal old wounds. Him blaming his son or us for anything is delusional. We have all tried to protect him and help him for too long. Hoping he’d look after himself better. I do not like to comment about this. But feel like it's necessary because of Tommy's 'Trump style,' no thought out rampage on Twitter and [Instagram]. This matter is ideally between just a father and a son -- and rehab if the stars align.\"\n\nPamela alleges that Tommy has made attempts to contact her, but she blocked him. She also says that she will never talk to Tommy again until he \"is sober and in his right mind.\"\n\n\"It is impossible to reason with crazy. I’m sure the world can see the truth,\" she continues in the statement. \"I stand beside my son who acted out of self defense and was scared for his life. Nobody understands the lifetime of disappointment this man has brought our family. Consistently the centre of sadness, drama and confusion. Jealous of his sons talent and beauty from the day they were born.\"\n\nPamela also claims that Tommy is \"sick,\" the \"definition of narcissist/sociopath,\" and that his fiancee, Brittany Furlan, \"keeps him drunk.\"\n\n\"This is what he wants -- someone to behave badly with,\" Pamela alleges. \"It’s terrible and unfortunately he has made this private matter very public. I have always tried only to set record straight. Trying to paint him as not a bad guy. Just one who is human and made mistakes. He still cannot handle the guilt about his abusive behavior and has never taken responsibility for what he has done. Let’s hope this will be his saving grace. I can only pray for him. And protect my sons. Who also fiercely protect me.\"\n\nRead the rest of Pamela's statement, below:\n\n\"Brandon has asked me to stay in France and not come home right now. He is happy and content that I am safe and loved where I am at -\n\nHe has invaluable support and has everything under control. His heart amazes me. He still does not want to see his dad in Jail. He just wants him to get sober. He was putting together an Intervention (along with friends and people Tommy works with and admired). So that whatever is left of his life can be healthy and peaceful and maybe he will be a healthy part of their lives one day.\n\n\n\nMaybe a positive part of our future grandkids life. Brandon has risked everything to save his father. He takes his career very seriously. He does not touch alcohol or drugs - (he understands his genetics) and is an example to many. He is a tremendous talent that will show the world- But he has put all on hold for dealing with this. His family - his brother and our family is his priority.\n\nBelieve me. He punched him in the nose for all of us who he has hurt - Now Tommy feels humiliated - and is attempting to destroy his own son. This is the Devil - This is the disease of alcoholism.\"\n\nAs ET previously reported, Tommy shared a since-deleted photo of his bloodied face via Instagram on Tuesday, alleging that Brandon had assaulted him. A Los Angeles County Sheriff's Department officer told ET that police responded to the 55-year-old rocker's Calabasas, California, home on Monday, and Tommy was transported to a local hospital shortly after. The officer noted that when police arrived, Tommy had a visible injury on his face. ET has learned that nobody was taken into custody, but according to police, Tommy stated that he planned to press charges.\n\nTommy's fiancee, Brittany, alleged in the 911 call obtained by ET on Wednesday that Tommy was unconscious and bleeding \"in his mouth\" after Brandon allegedly punched him following a disagreement involving Pamela. Brittany also alleged that Brandon had guns in his room, which \"freaked\" her out. However, at about four minutes into the call, Brittany told the operator that Tommy had started to regain consciousness, asking if they could \"cancel\" the request.\n\nBrandon claimed in a statement to People on Wednesday that the altercation was \"a result of my father’s alcoholism.\" Tommy denied those allegations via Twitter, writing, \"LMAAAO!!!! I’m happier than I've been in my entire life. I have a few drinks here & there because I'm f**kin retired and enjoying my life. I worked 30+ f**kin years I deserve it. You didn't arrange any intervention, you barely spoke to me while u were here. Just coverin ur a**!!.\"\n\nET has reached out to Tommy's manager, Pamela's rep, Brandon's publicist and Brittany for comment.\n\nHear more in the video below.\n\nRELATED CONTENT:\n\nTommy Lee's Son Brandon Calls Their Alleged Altercation a 'Result of My Father's Alcoholism'\n\nTommy Lee Plans to Press Charges Against 21-Year-Old Son Brandon After Alleged Assault\n\nTommy Lee Shares Picture Of Bloodied Face, Alleges 21-Year-Old Son Brandon Assaulted Him\n\nHear the Tommy Lee 911 Call After 21-Year-Old Son Brandon Allegedly Assaulted Him This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-09/bill_cosby_mugshot_2018_1280.jpg?h=c673cd1c&itok=b6Dd3Ys1", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/1280_pamela_tommy_getty.jpg?h=c673cd1c&itok=HJb4E0zr"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/1280_pamela_tommy_getty.jpg?h=c673cd1c&itok=HJb4E0zr", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/pamela-anderson-claims-tommy-lee-is-spinning-out-of-control-following-altercation-with-their-son", "title": "Pamela Anderson Claims Tommy Lee Is 'Spinning Out of Control' Following Altercation With Their Son", "meta_data": {"article": {"opinion": "false"}, "title": "Pamela Anderson Claims Tommy Lee Is 'Spinning Out of Control' Following Altercation With Their Son | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/pamela-anderson-claims-tommy-lee-is-spinning-out-of-control-following-altercation-with-their-son", "title": "Pamela Anderson Claims Tommy Lee Is 'Spinning Out of Control' Following Altercation With Their Son", "description": "The model released a statement via her website on Thursday, alleging that her ex-husband is 'delusional.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/1280_pamela_tommy_getty.jpg?h=c673cd1c&itok=HJb4E0zr", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The model released a statement via her website on Thursday, alleging that her ex-husband is 'delusional.'", "title": "Pamela Anderson Claims Tommy Lee Is 'Spinning Out of Control' Following Altercation With Their Son", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍", "url": "https://www.etonline.com/pamela-anderson-claims-tommy-lee-is-spinning-out-of-control-following-altercation-with-their-son", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-03/1280_pamela_tommy_getty.jpg?h=c673cd1c&itok=HJb4E0zr"}, "description": "The model released a statement via her website on Thursday, alleging that her ex-husband is 'delusional.'", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, News, Pamela Anderson, Tommy Lee", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}