{"url": "https://en.wikipedia.org/wiki/Strip_That_Down", "text": "\"Strip That Down\" is the debut solo single by English singer and songwriter Liam Payne, featuring guest vocals from American rapper Quavo. It was released as the lead single for Payne's debut studio album LP1 on 19 May 2017, via Capitol Records in the UK and Republic Records in the US.[3] The song was written by Payne, Ed Sheeran—who contributes uncredited vocals to the song, Steve Mac and Quavo. It was serviced to US contemporary hit radio on 23 May 2017.[4] The song's accompanying music video was released on 2 June 2017. The lyrical content is supposed to reflect Payne's freedom to venture into raunchy musical elements after departing from the British-Irish boy band One Direction.\n\nBackground [ edit ]\n\n\"Strip That Down\" features a guest appearance from Quavo (pictured), from the Atlanta-based hip hop group, Migos\n\nAfter One Direction went on a hiatus, Payne, who co-wrote songs on each of the group's five albums, intended to focus only on songwriting. He told Billboard:\n\nTo be honest with you, I wasn't going to do a solo venture. I was just going to go into songwriting and carry on and do that. But then I was like, 'You've been trying to do this since you were 14 years old. You would be ridiculously stupid to turn down the option to have a deal.' Coming out of the band, we had some pretty good opportunities around us. I had to do something.[5]\n\nThe singer met Ed Sheeran in London in late summer of 2016, \"We went in, sat around and discussed a bunch of things about life, and [the song] basically just came together,\" said Payne. After working with Sheeran and producer Steve Mac, Payne decided to add Migos member Quavo into the mix as the song's featured artist.[5] While talking about how that collaboration came together in an interview with iHeartRadio, Payne said; \"I was thinking, like rapper time, it was going to take two or three weeks. But, we got it, played it straight away, and we were like, 'We absolutely love it.' He's a great man to have on the team.\"[6]\n\nComposition [ edit ]\n\nEd Sheeran (pictured) co-wrote the song and provided uncredited vocals to it. ) co-wrote the song and provided uncredited vocals to it.\n\n\"Strip That Down\" is a trap and hip hop-influenced[7][8] pop and R&B track. Payne croons over \"pulsating\" synth-bass and chants with minimalist production style. Lyrically, the song contains themes of wealth, celebrity appeal and newfound career independence.[9] While talking about the song, Payne said; \"It just sets a few things straight, but then also the chorus is more about stripping back the music. I like to hear it loud sometimes, but sometimes you got to strip it back.\"[6] For the concept of the song, Payne stated that they contemplated what Justin Timberlake would release as his debut solo single in 2017.[10]\n\n\"Strip That Down\" contains an interpolation of 2000 single \"It Wasn't Me\",[11] written by Orville Burrell \"Shaggy\", Rikrok, Shaun Pizzonia, and Brian Thompson. \"It Wasn't Me\" interpolates War's \"Smile Happy\", composed by Sylvester Allen, Harold Ray Brown, Morris Dickerson, Lonnie Jordan, Charles William Miller, Lee Oskar, and Howard E. Scott. Therefore, they are also credited as songwriters.[12]\n\nCritical reception [ edit ]\n\nRolling Stone staff called it a \"summer club banger\".[13] Writers from Billboard thought Payne \"seems to be aiming for a DJ Mustard/Tyga vibe,\" and concluded that \"the song's fun: The swaggering, Directioner-baiting pre-chorus especially, which is probably the JT-est thing any of the five members have done since going solo.\"[14] Comparing it to One Direction's catalogue, Jordan Harris from Express and Star opined it \"is a lot more danceable, incredibly fun to listen to\" and added, \"Another similarity, and one which Liam would do well to use as a benchmark going forward, is the vocal style of Justin Timberlake.\"[15] In Digital Spy, Laurence Mozafari wrote \"the song screams of trying to be grown up.\"[16] Time magazine listed \"Strip That Down\" as one of the worst songs of 2017.[17]\n\nMusic video [ edit ]\n\nOn 18 May 2017, the lyric video for \"Strip That Down\" was uploaded to Payne's Vevo channel. The music video for the song was released on the same channel on 2 June 2017. The video was directed by Emil Nava.[18] It starts with a female dancer performing, followed by a black-and-white scene with Payne. As the video transitions from black and white to colour, it shows Payne in a neon world of bright lights, dancing, and an appearance from featured artist Quavo.[19]\n\nReviewing the \"sleek, colorful\" clip, Rolling Stone staff wrote: \"Payne rocks gently in what appears to be the inside of tanning bed.\"[13] In Digital Spy, Justin Harp opined Payne \"sheds One Direction's wholesome image in the sexy music video,\" and added, \"The promo clip does exactly what it says on the tin, as the former boybander demonstrates his newfound hip-hop vibe while slinking around with twerking back-up dancers.\"[20] Mike Wass from Idolator wrote that the video is \"as awkward as the song\", saying: \"The Migos rapper appears completely at ease in his surroundings, while Liam looks like he accidentally wandered on to the set.\"[21]\n\nAs of March 2019, the video has over 288 million views on YouTube, becoming Payne's first Vevo-certified music video outside of One Direction.\n\nChart performance [ edit ]\n\n\"Strip That Down\" charted within the top 5 in the charts of Australia, Ireland, New Zealand, and the United Kingdom. The single reached number 10 on the US Billboard Hot 100 on the issue dated 16 September 2017, becoming Payne's first top ten as a solo artist and Quavo's fourth. With his top ten, Payne became the third member of One Direction to achieve a solo top 10 single on the Hot 100, following Zayn and Harry Styles. In addition, One Direction joined The Beatles, Fleetwood Mac, and New Edition to have at least 3 members with solo Hot 100 songs reach the top 10.[22]\n\nOn Billboard's Dance/Mix Show Airplay chart, \"Strip That Down\" reached number one in its 4 November 2017 issue for both artists, marking a first for Payne as he became the first solo artist from an all-male vocal group to top this chart (as he has charted as a member of One Direction, whose \"What Makes You Beautiful\" peaked at number 13 in May 2012); he also eclipsed his fellow members, three of whom also had top tens on this chart (two from Zayn, one each from Horan and Tomlinson respectively; Styles' debut \"Sign of the Times\" peaked at 37 in June 2017). In the case of Quavo, it surpassed his featured collaboration (with Justin Bieber, Chance the Rapper and Lil Wayne) on DJ Khaled's \"I'm the One\", which peaked at number two in July 2017.[23]\n\nLive performances [ edit ]\n\nOn 26 May 2017, Payne performed the song for the first time on The Graham Norton Show.[24] The singer also performed \"Strip That Down\" at the Capital FM's Summertime Ball on 10 June,[25] on The Tonight Show Starring Jimmy Fallon on 22 June[26] and at the 2017 MTV Europe Music Awards on 12 November 2017.[27]\n\nTrack listing [ edit ]\n\nDigital download[28]\n\n\"Strip That Down\" – 3:24\n\nDigital download – Acoustic[29]\n\n\"Strip That Down\" (Acoustic) – 3:04\n\nDigital download – Nevada Remix[30]\n\n\"Strip That Down\" (Nevada Remix) – 3:44\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Ed_Sheeran_%288507723113%29.jpg/170px-Ed_Sheeran_%288507723113%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ee/Liam_Payne_-_Strip_That_Down_%28Official_Single_Cover%29.png/220px-Liam_Payne_-_Strip_That_Down_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/en/e/ee/Liam_Payne_-_Strip_That_Down_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Quavo_Veld_festival_2017.jpg/170px-Quavo_Veld_festival_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ee/Liam_Payne_-_Strip_That_Down_%28Official_Single_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Strip_That_Down", "title": "Strip That Down", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ee/Liam_Payne_-_Strip_That_Down_%28Official_Single_Cover%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}