{"url": "https://deadline.com/2017/09/how-to-get-away-with-murder-karla-souza-interview-season-4-spoilers-1202179086/", "text": "SPOILER ALERT: This story contains details about tonight’s Season 4 premiere of How to Get Away With Murder.\n\nABC’s How to Get Away With Murder returned tonight for its fourth season and the Viola Davis-led series picks up right where it left off, with Davis’ Annalise Keating putting the pieces back together after losing more than just her beloved Wes “Waitlist” Gibbons (Alfred Enoch) and the students struggling to move on with their lives.\n\nSeason 3 had no shortage of shocking twists including the death of a key character and unveiling the assailant as Dominic (Nicholas Gonzalez), who was given the go-ahead by Laurel’s father (Esai Morales)\n\nABC\n\nAnother game-changer that arose in the latter part of last season was Laurel’s pregnancy with Wes’ baby. In one of the first big twists of the new season, it was unveiled that she decided to keep the baby, due in five months, which even surprised actress Karla Souza. “As actors, we assume that the baby wouldn’t really happen because, production-wise, it gets a little complicated to have the prosthetic bellies and little babies and kids running around,” Souza told Deadline. “I assumed that it wasn’t going to go through and when I came back from hiatus, it was pretty much assured that we were going to have a baby.”\n\nRelated Story 'American Idol': ABC Plots Remote Live Shows Following COVID-19 Production Shutdown\n\nThe reveal came at the end of the episode when Laurel shares the news with her fellow accomplices during a dinner meeting prompted by Annalise. However, she chooses to withhold this information from her father, telling him at the top of the season opener that she got an abortion instead.\n\n“The reason why she decides to not tell her father is because she has a very big suspicion that he indeed killed Wes,” said Souza, which becomes apparent when Laurel types ‘why did you kill Wes’ in a text message to her father but doesn’t send it. “If she tells her father that she’s pregnant, her father is going to assume that Laurel is going to look out for more clues about the killer. Whereas if she makes it all go away in his mind, it buys time and also space to do some snooping around, without him being aware of it.”\n\nABC\n\nSouza added that she also “tells him that she’s pregnant to see if he already knows” because, “it gives her power in the relationship because she has something that he hasn’t been able to infiltrate in her life.”\n\nWith the exception of Laurel, it seemed like Annalise and the gang were ready to close the “who killed Wes?” case and leave the crime life behind, with Annalise assuming the blame for the loss of her student. “It was a huge shock to [the audience] to see that Laurel’s father made that phone call to Dominic to murder Wes. We’re going to find out, through Laurel’s digging, why exactly that happened,” and in turn, “it’s going to resurface everyone’s passion for finding the truth. Laurel is hoping that once she’s able to prove [her father’s involvement], she’ll have more people on her side seeking revenge.”\n\nThe dinner, which was teased throughout the episode, served as the last supper with Annalise essentially letting the team go, much to the chagrin of the group.\n\nABC\n\n“When [Laurel] tells Annalise she’s having the baby, I think Laurel is telling her, ‘we’re having it together,'” said Souza. “It’s going to be their redemption and it comes to her as such a blow when, despite that, Annalise fires her. That’s a big rejection for Laurel. However, she’ll take it as an engine to keep on with her plan [to uncover Wes’ killer], with or without Annalise … that will be her arc in at least these first eight episodes.”\n\nTonight’s episode ended in a three-month time jump with Laurel waking up in a hospital bed in a panic over the whereabouts of her infant.\n\n“Last season the hashtag was #WhoKilledWes. I think [this season] it’ll be #WhereIsTheBaby. As in past seasons, it’s just a piece of the puzzle,” said Souza, assuring that will know what happen to the baby by the midseason finale. “There’s so much more to how Jimmy Smits’ character and Frank (Charlie Weber) are there and little by little we’re going to find out more about what happened that night… the baby is definitely going to be at the center of it all.”\n\nCreated by Peter Nowalk, How to Get Away With Murder airs Thursdays as part of ABC’s Shondaland TGIT lineup.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F09%2Fhow-to-get-away-with-murder-karla-souza-interview-season-4-spoilers-1202179086%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202179086&comment_count=6", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0242.jpg?w=300&h=200", "https://pmcdeadline2.files.wordpress.com/2017/09/147214_1672.jpg?w=300&h=200", "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0516.jpg?w=300&h=200", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0029.jpg?w=1024"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0029.jpg?w=1024", "keywords": [], "authors": ["Amanda N'Duka"], "canonical_link": "https://deadline.com/2017/09/how-to-get-away-with-murder-karla-souza-interview-season-4-spoilers-1202179086/", "title": "‘How To Get Away With Murder’: Karla Souza On Season 4 Premiere Reveals & What’s In Store", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "SPOILER ALERT: This story contains details about tonight’s Season 4 premiere of How to Get Away With Murder.   ABC's How to Get Away With Murder returned tonight for its fourth season and the Viola Davis-led series picks up right where it left off, with Davis' Annalise Keating putting the piec...", "news_keywords": "ABC, How To Get Away With Murder, Karla Souza, Viola Davis", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘How To Get Away With Murder’: Karla Souza On Season 4 Premiere Reveals & What’s In Store", "url": "https://deadline.com/2017/09/how-to-get-away-with-murder-karla-souza-interview-season-4-spoilers-1202179086/", "description": "SPOILER ALERT: This story contains details about tonight’s Season 4 premiere of How to Get Away With Murder.   ABC’s How to Get Away With Murder returned tonight for its fourth season and the…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0029.jpg?w=1024", "width": 1200, "height": 800, "alt": "HOW TO GET AWAY WITH MURDER - \"I'm Going Away\" - In the wake of Wes' tragic death, Annalise returns to her family home to pick up the pieces of her shattered life, and realizes that, in order to rebuild, she must make a tough and shocking decision. Meanwhile, \"the Keating 4\" all face an uncertain future while Laurel becomes obsessed with finding out what actually happened to Wes the night he died. In a flash-forward, a terrifying crime is committed and everyone is a suspect on the highly anticipated season four premiere of \"How to Get Away with Murder,\" THURSDAY, SEPTEMBER 28 (10:00-11:00 p.m. EDT), on The ABC Television Network. (ABC/Mitch Haaseth) LIZA WEIL, JACK FALAHEE, VIOLA DAVIS, MATT MCGORRY, AJA NAOMI KING"}, "locale": "en_US"}, "article": {"published_time": "2017-09-29T03:00:50+00:00", "modified_time": "2017-09-29T16:36:38+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘How To Get Away With Murder’: Karla Souza On Season 4 Premiere Reveals & What’s In Store"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0029.jpg?w=1024", "alt": "HOW TO GET AWAY WITH MURDER - \"I'm Going Away\" - In the wake of Wes' tragic death, Annalise returns to her family home to pick up the pieces of her shattered life, and realizes that, in order to rebuild, she must make a tough and shocking decision. Meanwhile, \"the Keating 4\" all face an uncertain future while Laurel becomes obsessed with finding out what actually happened to Wes the night he died. In a flash-forward,…"}, "card": "summary_large_image", "title": "‘How To Get Away With Murder’: Karla Souza On Season 4 Premiere Reveals & What’s In Store", "description": "SPOILER ALERT: This story contains details about tonight’s Season 4 premiere of How to Get Away With Murder.   ABC’s How to Get Away With Murder returned tonight for its fourth season and the…"}, "author": "Amanda N'Duka", "content_type": "Article", "post_id": 1202179086, "title": "'How To Get Away With Murder': Karla Souza On Season 4 Premiere Reveals & What's In Store", "published_at": "2017-09-28 20:00:50", "image": "https://pmcdeadline2.files.wordpress.com/2017/09/147214_0029.jpg?w=296&h=166&crop=1", "comment_count": 6, "tags": "Viola Davis", "topics": "TV", "body": "SPOILER ALERT: This story contains details about tonight’s Season 4 premiere of How to Get Away With Murder.  \r\n\r\nABC's How to Get Away With Murder returned tonight for its fourth season and the Viola Davis-led series picks up right where it left off, with Davis' Annalise Keating putting the pieces back together after losing more than just her beloved Wes \"Waitlist\" Gibbons (Alfred Enoch) and the students struggling to move on with their lives.\r\n\r\nSeason 3 had no shortage of shocking twists including the death of a key character and unveiling the assailant as Dominic (Nicholas Gonzalez), who was given the go-ahead by Laurel's father (Esai Morales)\r\n\r\n\r\n\r\nAnother game-changer that arose in the latter part of last season was Laurel's pregnancy with Wes' baby. In one of the first big twists of the new season, it was unveiled that she decided to keep the baby, due in five months, which even surprised actress Karla Souza. \"As actors, we assume that the baby wouldn’t really happen because, production-wise, it gets a little complicated to have the prosthetic bellies and little babies and kids running around,\" Souza told Deadline. \"I assumed that it wasn’t going to go through and when I came back from hiatus, it was pretty much assured that we were going to have a baby.\"\r\n\r\nThe reveal came at the end of the episode when Laurel shares the news with her fellow accomplices during a dinner meeting prompted by Annalise. However, she chooses to withhold this information from her father, telling him at the top of the season opener that she got an abortion instead.\r\n\r\n\"The reason why she decides to not tell her father is because she has a very big suspicion that he indeed killed Wes,\" said Souza, which becomes apparent when Laurel types 'why did you kill Wes' in a text message to her father but doesn't send it. \"If she tells her father that she's pregnant, her father is going to assume that Laurel is going to look out for more clues about the killer. Whereas if she makes it all go away in his mind, it buys time and also space to do some snooping around, without him being aware of it.\"\r\n\r\n\r\n\r\nSouza added that she also \"tells him that she’s pregnant to see if he already knows\" because, \"it gives her power in the relationship because she has something that he hasn’t been able to infiltrate in her life.\"\r\n\r\nWith the exception of Laurel, it seemed like Annalise and the gang were ready to close the \"who killed Wes?\" case and leave the crime life behind, with Annalise assuming the blame for the loss of her student. \"It was a huge shock to [the audience] to see that Laurel’s father made that phone call to Dominic to murder Wes. We’re going to find out, through Laurel's digging, why exactly that happened,\" and in turn, \"it’s going to resurface everyone's passion for finding the truth. Laurel is hoping that once she’s able to prove [her father's involvement], she’ll have more people on her side seeking revenge.\"\r\n\r\nThe dinner, which was teased throughout the episode, served as the last supper with Annalise essentially letting the team go, much to the chagrin of the group.\r\n\r\n\r\n\r\n\"When [Laurel] tells Annalise she’s having the baby, I think Laurel is telling her, 'we’re having it together,'\" said Souza. \"It's going to be their redemption and it comes to her as such a blow when, despite that, Annalise fires her. That’s a big rejection for Laurel. However, she'll take it as an engine to keep on with her plan [to uncover Wes' killer], with or without Annalise ... that will be her arc in at least these first eight episodes.\"\r\n\r\nTonight's episode ended in a three-month time jump with Laurel waking up in a hospital bed in a panic over the whereabouts of her infant.\r\n\r\n\"Last season the hashtag was #WhoKilledWes. I think [this season] it'll be #WhereIsTheBaby. As in past seasons, it's just a piece of the puzzle,\" said Souza, assuring that will know what happen to the baby by the midseason finale. \"There's so much more to how Jimmy Smits' character and Frank (Charlie Weber) are there and little by little we’re going to find out more about what happened that night... the baby is definitely going to be at the center of it all.\"\r\n\r\nCreated by Peter Nowalk, How to Get Away With Murder airs Thursdays as part of ABC's Shondaland TGIT lineup.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1506654050.0, "source": "https://deadline.com", "summary": ""}