{"url": "www.theguardian.com/lifeandstyle/2007/feb/11/familyandrelationships2", "text": "My mother, and the mothers of my friends in single-parent families, were the first inspirational group of women I knew. The majority of fathers that I saw when I was growing up in Vancouver didn't take the responsibility to look after their kids and I was aware that society is geared towards punishing single women. Because my mother didn't have someone else there, she had to give both her kids a lot more responsibility, which allowed me to deal with being an adult quicker.\n\nI've always felt more comfortable in the company of women, and as far as girlfriends go, they've each been a learning experience. You meet someone at a certain point in your life, then break apart, but you always share that time. And you'll run into each other years later to find you have nothing in common, but you'll always have that mutual experience - that moment.\n\nI wish I could still believe in the Romeo and Juliet way but it doesn't seem to work. I only believe in lust at first sight. Love takes much longer to develop, and it's constantly renewing. As an actor, it's always an odd occasion when you're building that false romance with someone, because the only way I've learnt to do it is to actually fall in love a bit. When you're playing those parts, you have to open yourself up to someone in the way you would to a lover, so you do emotionally connect. That's one of the bizarre aspects of our business - you build these incredibly intense relationships with people and then when the film's finished you all part ways and never see each other again. Everyone goes back to paying their bills and looking after their babies, and the film is just this little memory of sunlight.\n\nI've worked with some brilliant actresses who teach by doing, not by saying, and through working on a TV show for six years I actually grew up with some amazing women. Katie [Holmes], at the beginning of Dawson's Creek was so natural - she'd never really worked before, so the words would go in her ear and come out her mouth with no filter and it was beautiful to watch. On Bobby I worked with an amazing group of women - Demi Moore, Helen Hunt, Sharon Stone, Heather Graham, Joy Bryant. And each represented a different thing.\n\nActresses have to be quite galvanised, so I meet women who are really headstrong. I find that strength attractive - I like a woman who can argue - I live in LA, and there are a lot of pretty, stupid women. My sister's very strong-headed too, which can be a pain in my ass I'll admit, but I'm from a family where you're not only expected to have an opinion but be able to defend it.\n\nI have lots of hard-earned knowledge about women through heartbreak, and social faux pas. When I was about 15, thinking I was engaging in light conversation, I asked a woman when she was due. Of course, she wasn't pregnant. I learnt the lesson never to ask again. As a leading man you don't ask a woman's age, and you don't care about her natural hair colour or her weight.\n\nThere'll always be sexual tension between male and female friends - we're animals after all, wired to accept each other on a sexual level at all times. Of course we all agree to a variety of social restraints, but it doesn't mean the basic impulses aren't there, and I don't think sex is an unhealthy impulse. It's only when you try to hide and subvert it that it manifests itself in ugly ways.\n\nPart of post-feminism, I think, is women taking responsibility for themselves, and for doing what makes them happy. I think there's more progress to be made, but I don't think many of us are raised with those sexist ideals about women any more. I think we're moving towards equality. But, you know, I have a 23-year-old sister, so I have to believe that things are changing. I have to.\n\n· Joshua Jackson's latest film, Bobby, is out now", "images": ["https://assets.guim.co.uk/images/eada8aa27c12fe2d5afa3a89d3fbae0d/fallback-logo.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Life and style,Relationships"], "top_img": "https://assets.guim.co.uk/images/eada8aa27c12fe2d5afa3a89d3fbae0d/fallback-logo.png", "keywords": [], "authors": ["Eva Wiseman"], "canonical_link": "http://www.theguardian.com/lifeandstyle/2007/feb/11/familyandrelationships2", "title": "What I know about women ...", "meta_data": {"description": "What%20I%20know%20about%20women%20...%20%7C%20Life%20and%20style%20%7C%20The%20Guardian", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/lifeandstyle/2007/feb/11/familyandrelationships2", "description": "Joshua Jackson, actor, 27, in a relationship.", "image": "https://assets.guim.co.uk/images/eada8aa27c12fe2d5afa3a89d3fbae0d/fallback-logo.png", "type": "article", "title": "What I know about women: Joshua Jackson", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/evawiseman", "publisher": "https://www.facebook.com/theguardian", "section": "Life and style", "published_time": "2007-02-11T00:20:31.000Z", "tag": "Life and style,Relationships", "modified_time": "2017-11-23T11:29:50.000Z"}, "al": {"ios": {"url": "gnmguardian://lifeandstyle/2007/feb/11/familyandrelationships2?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://lifeandstyle/2007/feb/11/familyandrelationships2?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/lifeandstyle/2007/feb/11/familyandrelationships2", "iphone": "gnmguardian://lifeandstyle/2007/feb/11/familyandrelationships2?contenttype=Article&source=twitter"}}, "image": "https://assets.guim.co.uk/images/eada8aa27c12fe2d5afa3a89d3fbae0d/fallback-logo.png", "site": "@guardian", "card": "summary_large_image"}}, "movies": [], "publish_date": 1171123200.0, "source": "http://www.theguardian.com", "summary": ""}