{"url": "https://www.thewrap.com/this-is-us-everything-we-know-her-rebecca-future-randall-tess-beth-mother/", "text": "(Warning: This post contains spoilers for the midseason return of “This Is Us” Season 3, which aired Tuesday.)\n\nWhile offering up an overload of emotional information to Pearson family fans back in November, the midseason finale of “This Is Us” Season 3, called “The Beginning Is the End Is the Beginning,” finally gave us the answer to the question viewers have been asking since the second season finale’s shocking flash-forward ending aired last spring: who the “her” is that Future Randall and Future Tess are preparing to visit.\n\nThe answer: Randall’s mother, Rebecca Pearson (played by Mandy Moore).\n\nYes, just as “This Is Us” wrapped up the first half of its third season, it was revealed that decades from now, Randall (Sterling K. Brown) and his adult daughter — along with Toby and now Beth — are going to see “Randall’s mother,” as Beth puts it to her employee (apparently she’s running a ballet company now?), who she obtains a Pin the Tail on the Donkey game from, as she prepares to join Randall and daughter on this journey.\n\nAlso Read: 'This Is Us': Sterling K Brown on What That Election Result Means for Randall and Beth - And Future Randall and Future Beth\n\nThough this “her” revelation didn’t come until the episode’s closing moments — which also included a shocking twist about the fate of Jack’s little brother Nicky during the Vietnam War — we were building to it throughout the entire hour of the Dan Fogelman-created series.\n\nThe installment included scenes in the present of Rebecca accidentally upsetting young Tess while trying to address her emerging feelings toward other girls, and then relating to her enough so that she felt comfortable addressing them with her parents. The episode also ended with a fight between our Present Day Beth and Randall, because Randall refused to drop out of the city council race, when the polls show he won’t win and his wife asks him to give up and come back to helping his family.\n\nThat spat led to Randall sleeping on the couch, and a not so happy vibe between the happy couple in the present, with some hints in the future indicating the two are only communicating between Adult Tess. Does that mean they separate or even divorce?\n\nAlso Read: 'This Is Us' Season 3: 'ER' Alum Goran Visnjic Cast as Beth's Teacher on Backstory Episode\n\n“This Is Us” returned from hiatus tonight with an episode that jumped between the past and present — but didn’t head into the future again. So since we didn’t get anymore new hints on screen, TheWrap was able to gather a few clues for you while speaking with Brown about Randall winning the Philadelphia City Council race and how those election results might impact the Pearsons in the present and the future.\n\nTheWrap: How did you feel about the reveal Rebecca is the mysterious future “her” we’ve all been wondering about? How soon are we going to find out why everyone is gathering to see her?\n\nSterling K. Brown: We’ve all [in the cast] known that it’s Rebecca, though the audience didn’t know, and we know why it’s Rebecca and you guys will find out at the end of the season what it is. Yeah, you’ll see at the end.\n\nEnd of the season?\n\nEnd of the season you’ll get a better glimpse of why we’re going to see Rebecca.\n\nAlso Read: 'Brooklyn Nine-Nine' Boss on Why a 'This Is Us' Crossover Is Probably a Bad Idea\n\nCan you tell me the significance of the “Pin the Tail on the Donkey” game?\n\nI cannot! That’s an easy question.\n\nWelp, that’s all we were about to get out of Sterling on that front, but you can read more from our interview with him about tonight’s episode here.\n\nSee below for all the clues TheWrap previously rounded up about “This Is Us’s” now-not-so-mysterious character, so you can theorize over the next piece of the puzzle — what are the circumstances surrounding this foreboding reunion? — for the next couple months.\n\nAlso Read: Hold Up, 'This Is Us' Fans - Mandy Moore Says You Might Actually Like That Guy With the Flowers\n\nShe’s close to Tess, Randall and Toby\n\nIn the third season premiere, the final scene gives a few more clues as to who the unnamed woman might be. Tess and Randall arrive at some sort of facility, and while Tess goes to the bathroom, Randall gives Toby (Chris Sullivan) a call, and asks if he’s “coming down.” Toby says he doesn’t know, but Randall tells him the “she” would want him here, and Toby agrees that he probably should. We see Toby talking to Randall on the phone from a bed — alone — which made us wonder if perhaps the mystery woman could be his wife Kate (Chrissy Metz), or someone close to Kate, and Kate might be dead. Yikes!\n\nAlso Read: Hold Up, 'This Is Us' Fans - Mandy Moore Says You Might Actually Like That Guy With the Flowers\n\n“You thought we made it sound like he was talking about Kate — I would say that’s open to interpretation,” co-showrunner Isaac Aptaker told TheWrap at the show’s Season 3 finally in September.\n\nAlright, now we know it’s not Kate, but “Randall’s mother” — a person that is apparently close to Randall, Tess and Toby. And Sterling K. Brown told us that would be the case in the end, because anyone close to the Pearsons is close to Toby.\n\nAlso Read: 'This Is Us': Sterling K Brown Tells Us All About the Beth-Centric Episode You've Been Waiting For\n\n“Toby is part of our family now,” Brown said. “So anybody who Randall cares about, Tobias would obviously care about as well. That’s my brother.”\n\nTess hasn’t seen “her” in awhile\n\nBack on the Season 2 finale, we got our first glimpse of an older Randall and an older Tess. “It’s time to go see her, Tess,” Randall says. Tess responds that she’s “not ready,” and Randall says he’s not either.\n\nThe scene is cut in a way that makes us think Beth might be dying (but that was ruled out by Susan Kelechi Watson herself) or maybe something is going on with Deja, who in the Season 3 premiere agreed to let the Pearsons adopt her after her mother relinquished her paternal rights.\n\nBrown also told TheWrap that there’s a specific reason he needs to coax Tess to see “her” — which of course we’ll find out in due time.\n\nAlso Read: 'This Is Us' Season 3 Premiere: Showrunners Break Down Jack and Rebecca's Awful First Date\n\n“There’s a reason why he had to seek out Tess in particular,” Brown said. “Yes, there’s a reason why he had to seek out Tess in particular, because Tess hadn’t seen the ‘her’ for some time. And so there’s a reason why it’s time to go and she’s like, ‘I can’t.’ There’s a reason. Other people may have been more easily galvanized, but Tess needed a little more coaxing.”\n\nThis is as far in the future as we’ll go\n\n“This future timeline is sort of the furthest that we’ll go in these characters lives and where our series will wrap up,” Aptaker told TheWrap in September, backing up something Fogelman has previously talked about.\n\n“I don’t imagine us going past this time period in the future so in terms of a timeline, this is our ending timeline,” Fogelman said in an interview with EW after the Season 2 finale last spring. “But we may have other past timelines we’re going to introduce in the course of the series, and also other future story lines that we might introduce as well.”\n\nAlso Read: 'This Is Us': Mandy Moore Hints Season 3 Premiere Reveals More About Randall's 'Her'\n\n“Well we’re going to give answers in that timeline, but it doesn’t mean it’s a timeline we can’t revisit and sort of push the story forward in that timeline,” co-showrunner Elizabeth Berger told TheWrap. “We’re going to give a lot of satisfying answers regarding that timeline this season — so they’re quickly in store.”\n\nAnswers were promised to be coming soon\n\n“I think the plan is that, in the course of the season, you will get a lot of answers,” Fogelman said, during a panel after the LA premiere in September. “The story is not about where it ends up, it’s about how you kind of get there… we’re not going to string it out over seven seasons or anything.”\n\nMoore said Fogelman has, “talked a lot about figuring out who [Randall] is talking about.”\n\nAlso Read: 'This Is Us' Season 3: Milo Ventimiglia Hints Jack's Little Brother Nicky Has Some Real Issues\n\n“I think that every episode is offering a more fully realized picture of who that is,” Moore said in an interview with EW earlier this month. “It’s not being dragged for the sake of being cheeky. I think it’s just really brilliant storytelling and, Dan’s old favorite way of describing the show is the mixed up videotapes of home videos. This is exactly that, but we’re leaning a little bit into the future aspect of it.”\n\nBrown previously told EW that we do in fact know this character already.\n\n“It is someone that we have met over the first two seasons, so it won’t be something that comes out of nowhere,” Brown said. “Dan has already spoken to the fact that we’ve already shot parts of how he wants the series to end that’s dealing with that particular ‘her’ as well. I think by about midseason, maybe episode 9 or so, the audience will know who that individual is.”\n\n“This Is Us” airs Tuesdays at 9/8c on NBC.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/uploads/2020/03/This-Is-Us-Jack-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2019/02/EndeavorContent-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/BillMaherCOVID-19-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2018/09/Mandy-Moore-160x105.png", "https://www.thewrap.com/wp-content/uploads/2020/03/This-Is-Us-Jack.jpg", "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2020/04/Ranjit-Chowdhry-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/lori-loughlin-160x105.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2018/09/NUP_183539_3802-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us-160x105.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/GettyImages-1207555653-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "keywords": [], "authors": ["Jennifer Maas", "Ashley Boucher", "Ross A. Lincoln", "Phil Owen", "Daniel Goldblatt", "J. Clara Chan"], "canonical_link": "https://www.thewrap.com/this-is-us-everything-we-know-her-rebecca-future-randall-mother-tess-beth/", "title": "This Is Us: Sterling K Brown Tells Us Why Randall 'Had to Seek Out Tess' to Visit 'Her'", "meta_data": {"parsely-title": "‘This Is Us': Sterling K Brown Says You’ll Know Why They Are Going to See ‘Her’ By the End of Season 3", "parsely-link": "https://www.thewrap.com/this-is-us-everything-we-know-her-rebecca-future-randall-mother-tess-beth/", "parsely-type": "post", "parsely-pub-date": "2019-01-15T19:01:16-08:00", "parsely-section": "tv", "parsely-author": "Ashley Boucher", "parsely-tags": "mandy_moore, nbc, randall-pearson, sterling-k-brown, this-is-us", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "\"This Is Us\" star Sterling K. Brown tells TheWrap we'll know much more about the future \"her\" mystery by the end of Season 3.", "news_keywords": "mandy moore, nbc, randall pearson, sterling k. brown, this is us", "original-source": "https://www.thewrap.com/this-is-us-everything-we-know-her-rebecca-future-randall-mother-tess-beth/", "og": {"locale": "en_US", "type": "article", "title": "This Is Us: Sterling K Brown Tells Us Why Randall 'Had to Seek Out Tess' to Visit 'Her'", "description": "\"This Is Us\" star Sterling K. Brown tells TheWrap we'll know much more about the future \"her\" mystery by the end of Season 3.", "url": "https://www.thewrap.com/this-is-us-everything-we-know-her-rebecca-future-randall-mother-tess-beth/", "site_name": "TheWrap", "updated_time": "2019-01-16T03:08:10-08:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "This Is Us", "section": "TV", "published_time": "2019-01-16T03:01:16-08:00", "modified_time": "2019-01-16T03:08:10-08:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "\"This Is Us\" star Sterling K. Brown tells TheWrap we'll know much more about the future \"her\" mystery by the end of Season 3.", "title": "This Is Us: Sterling K Brown Tells Us Why Randall 'Had to Seek Out Tess' to Visit 'Her'", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "creator": "@jmaas421"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘This Is Us': Sterling K Brown Says You’ll Know Why They Are Going to See ‘Her’ By the End of Season 3", "sailthru.date": "2019-01-16T03:01:16+00:00", "sailthru.author": "Jennifer Maas", "sailthru.tags": "nbc,mandy moore,sterling k. brown,this is us,randall pearson", "sailthru.category": "tv", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us.png", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/09/Sterling-K-Brown-This-Is-Us-150x150.png", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1547636476.0, "source": "https://www.thewrap.com", "summary": ""}