{"url": "https://www.elle.com/culture/celebrities/a13036155/elle-women-in-hollywood-sexual-abuse-speeches/", "text": "Some of the most elite women in entertainment gathered to honor female achievement at ELLE’s Women in Hollywood event in Los Angeles Monday night — and used the opportunity to address the conversation that's finally starting to take place in Hollywood. Presenters and honorees acknowledged that a major shift was happening in their industry ever since reports of producer Harvey Weinstein’s alleged sexual harassment surfaced in The New York Times and The New Yorker.\n\n“We honor the women you see on stage tonight, but also I would like this opportunity to honor every woman who has suffered sexual harassment, every woman who has stood up to a powerful man and said that what he is doing is wrong,\"Jessica Chastain said in her speech. \"Women in Hollywood and beyond have had enough.”\n\nIn their speeches, several of the honorees and presenters took the opportunity to share their personal stories of dealing with sexual harassment and abuse in the entertainment industry — and talked about what happens next.\n\nReese Witherspoon\n\nGetty Images\n\nBefore introducing her Big Little Lies co-star Laura Dern, Reese Witherspoon took the stage and revealed she was a victim of sexual assault when she was still underage.\n\nI have my own experiences that have come back to me very vividly. I have found it hard to sleep. So many feelings — anxiety about being honest, guilt for not speaking up, disgust at the director who assaulted me when I was only 16, anger that I was made to feel that silence was a condition of my employment. I wish I could tell you that it was only one incident. Sadly, I have had multiple experiences and I don’t speak about them very often, but after hearing these women tonight, being so open and honest, it has made me want to speak up. And I actually feel less alone.\n\nJennifer Lawrence\n\nGetty Images\n\nIn Jennifer Lawrence’s speech, the Oscar winner recognized that after gaining fame with movies like The Hunger Games, she has the “power to say no.” But she says when she was just starting out, she was once pressured into losing weight in a “degrading and humiliating” way.\n\n\n\nWhen I was much younger and starting out, I was told by the producers of a film to lose 15 pounds in two weeks or I’d be fired. One girl before me had already been fired for not losing weight fast enough. During this time, a female producer had me do a nude lineup with about five women who were much thinner than me. We all stood side by side with only paste-ons covering our privates. After that degrading humiliating lineup, the female producer told me I should use the naked photos of myself as inspiration for my diet.\n\nIf at any point you’re wondering why didn’t I stick up for myself, I tried. I asked to speak to a producer about the unrealistic diet regime and he responded by telling me he didn’t know why everyone thought I was so fat. He thought I was perfectly “fuckable.”\n\nJessica Chastain\n\nGetty Images\n\nJessica Chastain took the stage again to commend the women who have had the courage to speak up against their accusers — something the actress says she wasn’t always able to do for herself.\n\nI had a producer spank me as I walked past him in a hallway. I didn’t speak up, because I was worried that I might be made un-hireable by dissenting. I have stopped making myself invisible, or small, and to my shock and happiness, my career has not stalled.\n\nIn speaking up, I’ve come to understand that if a director or a studio doesn’t hire me because of my stance on wage equality, diversity, or sexual harassment, then I’m fine with that. This is an industry rife with sexism, racism, and homophobia. It’s so closely woven into the fabric of the business that we’ve become snow-blind to the glaring injustices enacted every day.\n\nI’m so inspired by the women who have been far braver than I am, who have come forward with their stories, and risked everything to protect others. What is important is that the voices of these women do not disappear in a somewhat fog of war way. We must amplify them.\n\nKristen Stewart\n\nGetty Images\n\nKristen Stewart lent her support to victims of abuse and spoke about the importance of creating a safe space for them to share their stories.\n\nI just want to express how thankful I am to hear what is typically a sort of like murmured pseudo-conversation because we've all been talking about this forever—not to make it specific, but it is, about this motherfucker.\n\nSo kudos to those who felt hopeful enough, and comfortable enough to be caught and received and heard by those around them, that made it okay to allow themselves to feel better. Because you need to allow yourself to feel better when you feel that bad. And it takes help, and we can all be proud of that notion, and perpetuate it by saying that we have got you, affirmatively.\n\nMargot Robbie\n\nGetty Images\n\nMargot Robbie highlighted the overwhelmingly prevalent imbalance of power that exists in the entertainment industry.\n\nBeing a woman in Hollywood means you will probably have to fight through degrading situations, and will be offered chauvinistic roles by men who think that that's what other men want to see us play.\n\nEven those of us lucky enough to have established a career in the hallowed grounds of show business, are still in the shadows of the big trees, constantly reminded that we only grow in the sunshine they allow us. These difficulties we face share the same spirit of those faced by countless women all over the world who struggle for the right to earn a living, the right to be heard, and even the right to be safe from harm.\n\nAva DuVernay\n\nGetty Images\n\nFilm director Eva DuVernay was invited to introduce honoree Tessa Thompson. But before Thompson took the stage, DuVernay took a moment to reflect on how a woman's race can also affect how she is seen in Hollywood.\n\nI bring up color in regards to Tessa because it is important. Her identity in this industry isn't only woman, it is one of color. This invites a particular gaze, a particular way of being seen, a particular way of seeing yourself in this industry. I applaud the creation and call to create safe spaces for women in regards to sexual harassment.\n\nFor all these women, women like me and many others, that protection of our womenhood isn't enough, because we're not only women. We're black. We're brown. We are native. We are Asian. We are Muslim. We are queer. We are many things that deserve safe spaces and protection. We can take this moment and enter in with focus.\n\nKathleen Kennedy\n\nGetty Images\n\nFilm producer Kathleen Kennedy, who has produced more than 60 films, including Jurassic Park, The Sixth Sense, Rogue One, and The Girl on the Train, said she felt a sense of responsibility to move the needle forward. Kennedy called for the film industry to create a commission that would combat sexual harassment and abuse in the workplace.\n\nThe organizations that constitute the American film industry — the studios, the unions the guilds and the talent agencies — should immediately convene a commission charged with the task of developing new, industry-wide protections against sexual harassment and abuse. The commission should be composed of specialists in labor and management practices, lawyers and legal scholars, sociologists, psychologists, feminist activists and theorists, as well as people who work in film and television. The commission should be fully funded by our industry in order to address the task at hand in a thoroughgoing, comprehensive fashion. The goal of this commission would be to transform our industry in regards to sexual harassment and abuse in the workplace.\n\nI’ve asked the Board of Governors of the Academy of Motion Picture Arts and Science, of which I’m a Governor, to take the first steps towards creating this commission. We have to act. I am proud to have worked in film my entire adult life and I reject the idea that misogyny is the true heart of this industry.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.elle.com/culture/celebrities/a13036155/elle-women-in-hollywood-sexual-abuse-speeches/", "title": "Women in Hollywood Share Stories of Sexual Abuse in the Entertainment Industry", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Women in Hollywood Share Stories of Sexual Abuse in the Entertainment Industry", "description": "At ELLE's Women in Hollywood event, many opened up for the first time about their experiences.", "url": "https://www.elle.com/culture/celebrities/a13036155/elle-women-in-hollywood-sexual-abuse-speeches/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-03-19 05:05:01", "published_time": "2017-10-18 12:22:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Women in Hollywood Share Stories of Sexual Abuse in the Entertainment Industry", "description": "Several of the honorees at Elle’s Women in Hollywood event n Los Angeles Monday spoke out about their experiences with sexual harassment and abuse in the entertainment industry.", "keywords": "Jennifer Lawrence, Jessica Chastain, Kathleen Kennedy, Kristin Stewart, Margot Robbie, Reese Witherspoon, hollywood, entertainment, elle, sexual abuse, sexual harassment, elle's women in hollywood event, women in hollywood, actresses, elle magazine, elle event, elle magazine event, harvey weinstein", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=0.337xw:0.673xh;0.335xw,0.0545xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,Kristin Stewart,kathleen kennedy,margot robbie,jessica chastain,jennifer lawrence,reese witherspoon", "sailthru.date": "2017-10-18T00:22:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/women-in-hollywood-share-stories-of-sexual-abuse-in-the-entertainment-industry-1508280993.jpg?crop=0.337xw:0.673xh;0.335xw,0.0545xh", "sailthru.socialtitle": "Women in Hollywood Share Stories of Sexual Abuse in the Entertainment Industry", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1508300520.0, "source": "https://www.elle.com", "summary": ""}