{"url": "https://www.menshealth.com/nutrition/a19562004/kevin-smith-potato-diet/", "text": "Kevin Smith says he lost 17 pounds in nine days on Penn Jillette's potato-heavy diet\n\nThe Clerks director suffered a near-fatal heart attack in February\n\nHere's what nutritionists have to say about the restrictive diet\n\nIn late February, Kevin Smith shared with the world that he suffered a \"massive heart attack\" that came dangerously close to taking his life. Now, the Clerks director is opening up about how he’s making major lifestyle changes to protect himself from another health scare.\n\n\n\n\"I’ll never eat the way I used to,\" Smith shared on his Hollywood Babble-On podcast, according to E! News. \"The way I used to eat wasn’t fucking horrible. It was in my childhood that’s what my doctor said.\"\n\nAccording to Smith, doctors said he had to lose 50 pounds — and in order to do so, the director adopted the all-potato diet made famous by illusionist Penn Jillette in his book, Presto!: How I Made Over 100 Pounds Disappear. In the diet, Jillette ate only potatoes for two full weeks, then phased in vegetable stews.\n\nSo far, Smith said he’s lost 17 pounds in just nine days.\n\n\"It’s a pretty intense program, but it’s been interesting,\" Smith said of the diet. \"And of course necessary for my health and stuff. But once I get to a decent place, then I can think about eating again.\"\n\nWhat Do Nutritionists Think of Potato Diets?\n\nDena Champion, a registered dietician at The Ohio State University Wexner Medical Center, said she would not recommend a potato-only diet to a recent heart attack victim — or to anyone trying to lose weight, for that matter.\n\n\"This diet would not be adequate in protein, and contains no fat!\" she said in quotes provided via email to MensHealth.com. \"Not only that, but this diet is extremely low in most micronutrients including Calcium, Zinc, Selenium, and Vitamin A, to name only a few.\n\n\n\n\"Over time, this diet would surely cause an essential fatty acid deficiency and many micronutrient deficiencies,\" Champion continued. \"It should never be recommended to anyone for any reason.\"\n\n\n\nskhoward/Getty Images\n\nDaniel O'Shaughnessy, a registered nutritionist and registered nutritional therapist in the United Kingdom, was also skeptical of Smith's post-heart attack diet. \"I don’t think it’s healthy for anyone, due to the lack of nutrition, variety, and also psychological boredom,\" he told MensHealth.com.\n\nThe diet may be very low calorie, which would drive quick weight loss, but it's not the most ideal method for long-term sustainability, O'Shaughnessy added: \"You’d see a weight loss over two weeks and be fooled in thinking this is the diet for you.\"\n\nGetty Images\n\nSmith isn’t only guy to tout a potato-heavy diet as life-changing. In 2017, YouTuber Andrew Flinders Taylor, who goes by the name “Spud Fit,” explained that he lost 117 pounds over the course of a year using a potato-only diet. Taylor's plan was more extreme than Smith's: He stuck to eating plain potatoes for 365 days.\n\nTaylor tried to beat the potato boredom by seasoning his spuds with spices, dried herbs, and fat-free sweet chili or barbecue sauce. At the time, at least one expert told MensHealth.com he couldn't get behind the diet.\n\nGetty Images\n\n\"I personally would not recommend it,\" Spencer Nadolsky, D.O., author of , said. \"It’s very restrictive. A vegan diet is very restrictive, and a ketogenic diet is very restrictive, but a potato diet is one of the most restrictive diets you could ever do.\"\n\nInstead of following the potato-only path, O'Shaughnessy suggests that people looking to lose weight try intermittent fasting — or squeezing all your food consumption into a certain window of time each day. (When it comes to weight loss techniques, here's how intermittent fasting stacks up against plain old calorie restriction.)\n\nMarch 22, 2018, 2:34 p.m.: This story has been updated.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Stacey Leasca", "Stacey Leasca Is A Journalist Rhode Island."], "canonical_link": "https://www.menshealth.com/nutrition/a19562004/kevin-smith-potato-diet/", "title": "How the Director Says He Lost 17 Pounds in 9 Days Post-Heart Attack", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Men's Health", "title": "Kevin Smith Says He Lost 17 Pounds in 9 Days By Eating Only Potatoes", "description": "The Clerks director suffered a near-fatal heart attack in February.", "url": "https://www.menshealth.com/nutrition/a19562004/kevin-smith-potato-diet/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 128455567236258}, "article": {"publisher": "https://www.facebook.com/MensHealth", "modified_time": "2019-10-21 06:27:23", "published_time": "2018-03-22 03:31:00", "section": "Nutrition", "opinion": "false"}, "twitter": {"site": "@MensHealthMag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "KD2AYNrwYjrNCwZthxgElsAAkSgJhWPxx3FkmjgfPt0", "title": "Kevin Smith Potato Diet - How the Director Says He Lost 17 Pounds in 9 Days Post-Heart Attack", "description": "Kevin Smith, who suffered a massive heart attack last month, shared his new potato-only lifestyle with his podcast listeners.", "keywords": "kevin smith, kevin smith potato diet, kevin smith heart attack, potato diet, penn jilette, weight loss, how to lose weight", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Nutrition,nutrition", "sailthru.date": "2018-03-22T15:31:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kevinsmithpotatoes-1521732897.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Kevin Smith Says He Lost 17 Pounds in 9 Days By Eating Only Potatoes", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1521660660.0, "source": "https://www.menshealth.com", "summary": ""}