{"url": "www.usmagazine.com/celebrity-news/news/lamar-odom-breaks-his-silence-w473835/", "text": "Lamar Odom cheated death 17 months ago. “I’m a walking miracle,” says the former NBA star and ex-husband of Khloé Kardashian, admitting he suffered 12 strokes and two heart attacks after being found comatose October 13, 2015, at a Las Vegas–area brothel. Cocaine use and reckless behavior had already ended his four-year marriage. Yet Kardashian delayed a divorce to support his recovery, ultimately refiling in May 2016 after the Queens native was photographed drinking at L.A.’s Beverly Center.\n\nToday, the 37-year-old — who completed a stay at San Diego’s Casa Palmera rehab center in January — is working on a docuseries and an autobiography due this year. “I had no choice but to become stronger,” the dad of Destiny, 18, and Lamar Jr., 14 (with Liza Morales, 37), told Us’ entertainment director, Ian Drew, March 24 in the Hollywood Hills while cracking jokes, singing along to Hall & Oates’ “Sara Smile” and, yes, dribbling a ball. “S–t, I’m here talking to you. So I guess I’m winning.” Watch him tell his emotional story in the video above, and read on for our full interview.\n\nTake Us back to the start of your marriage. Was Khloé aware of your drug use?\n\nI was hiding it for a while, but then I got frustrated and was like, f–k it. Around two years before we split up [in 2011], I was in the man cave she had made for me and she caught me. She was disappointed. So was I. The sad thing about it is, I don’t know if I was disappointed because I was actually doing the drug or because she caught me. She knew I was doing cocaine the whole time after that. It was my drug of choice. I’m not going to say she accepted it because that would be the wrong word. Tolerated would be a better word.\n\nDo you regret sharing your ­marriage on TV?\n\nBusinesswise, it opened up opportunities, like the fragrance Khloé and I created. We probably cursed it by calling it Unbreakable, but that was my baby. It also opened this gate up with other women who probably wouldn’t have been interested in me. When I became Khloé Kardash­ian’s man and on TV, it made me look more enticing. People who didn’t even know basketball would approach me because they knew Lammy.\n\nYou mean other women?\n\nYes. Bitches and THOTs came out of the woodwork. If there is one thing I regret when I was married, it was having multiple affairs with different women. That wasn’t the stand-up thing to do. I wish I could have kept my d–k in my pants.\n\nAfter Khloé filed for divorce in December 2013, you moved into an apartment in L.A.\n\nThat’s where me and my friend Jamie [Sangouthai], God bless the dead, turned the drug use up to another level. The “don’t give a f–k” place. I was in a very dark place and very confrontational. I wasn’t trying to repair my marriage; I was just trying to get high. My life was all about drugs at that point. It probably helped the end of my career come along a little faster because drugs killed my drive to want to train and be in shape. It killed that and my sex drive. The only time you can f–k is when you take coke.\n\nTell Us about the night you ended up at the brothel.\n\nI was home by myself. Bored. I wanted to get out and have a good time. Looking back, I might have had a drink to get the mood started, but was I drunk or on drugs? Not at all. I remember lying in bed. Two women were in bed and then I fell asleep. That’s all. When I woke up four days later, I was trying to pull the tubes out of my mouth.\n\nSurprised Khloé was at your side?\n\nHell, yeah. It was definitely a moment of relief. I didn’t even know what had just happened. I mean, I’m a big strong dude who has made it to the highest level of doing what he loves. And now I can’t walk or talk. She was the first thing I saw. She said, “Hi, Mookah.” “Mookah” is a name my mother used to call me. She said it to let me know I wasn’t dead. She played a major role in me getting my memory back. She would bring pictures of my mother and my grandmother. I kept thinking, Am I paralyzed forever? Am I mute forever? It was scary shit. Faith got me through.\n\nDid you reconnect romantically?\n\nHonestly, at that time I was just blessed to be around her. I wasn’t making any more out of it than that. We haven’t been intimate in years.\n\nWhen did you realize you needed to enter rehab again?\n\nMy daughter gave me the ultimatum to go. She said, “Pops, you get help or I won’t talk to you.” I think she saw it in my behavior. Coke is a real psychological drug. You can be getting high and feeling great and then on the way down cursing yourself out. So I think it was one of those moments on the way down. This last time I checked into rehab, I was able to stay the whole 30 days and get the most out of it. I learned about addiction and that it’s a brain disease. The choices we make when our brain is diseased are involuntary. So it was important and life-changing. My kids were really scared that their dad wasn’t going to be here. It was good bonding time with them when they came to see me. They said, “Dad, we want you to be here.” I was honest with them. There is no reason to lie now. But it was good for them to know it is a disease and one I may pass back to them.\n\nAre you clean now?\n\nOf course. Living sober, meaning no drugs, is a great feeling. Being in the moment is important — how you react, respond, create. If I would have done coke last night, you would have gotten some d–khead here trying to get out of here fast. But you’re getting Lamar now.\n\nFor more of Odom’s exclusive interview with Us Weekly, pick up the new issue, on newsstands now.", "images": ["https://www.usmagazine.com/wp-content/uploads/lamar-290d0c12-5945-4f9d-b22e-9a9532ad36b6.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/khloe-ae53f906-787a-471c-9a73-27fe4bad9222.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/lamar-2bff1ff3-65d7-445d-bf78-a3aa999b17ff.jpg?crop=0px%2C147px%2C1333px%2C699px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/cover-fc22d83c-d503-4dee-9fe9-9327d290f43e.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/lamar-2bff1ff3-65d7-445d-bf78-a3aa999b17ff.jpg?crop=0px%2C147px%2C1333px%2C699px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Ian Drew"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/lamar-odom-breaks-his-silence-w473835/", "title": "Lamar Odom Breaks His Silence: ‘Everything Was My Fault’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "In his first magazine interview since his 2015 coma, Lamar Odom opens up to Us about adultery, drug addiction and ex-wife Khloe Kardashian", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Lamar Odom Breaks His Silence: 'Everything Was My Fault'", "description": "In his first magazine interview since his 2015 coma, Lamar Odom opens up to Us about adultery, drug addiction and ex-wife Khloe Kardashian", "url": "https://www.usmagazine.com/celebrity-news/news/lamar-odom-breaks-his-silence-w473835/", "site_name": "Us Weekly", "updated_time": "2018-10-17T17:50:50+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/lamar-2bff1ff3-65d7-445d-bf78-a3aa999b17ff.jpg?crop=0px%2C147px%2C1333px%2C699px&resize=1200%2C630&ssl=1", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/lamar-2bff1ff3-65d7-445d-bf78-a3aa999b17ff.jpg?crop=0px%2C147px%2C1333px%2C699px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Video", "section": "Celebrity News", "published_time": "2017-03-29T12:15:00+00:00", "modified_time": "2018-10-17T17:50:50+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "In his first magazine interview since his 2015 coma, Lamar Odom opens up to Us about adultery, drug addiction and ex-wife Khloe Kardashian", "title": "Lamar Odom Breaks His Silence: 'Everything Was My Fault'", "site": "@usweekly", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/lamar-2bff1ff3-65d7-445d-bf78-a3aa999b17ff.jpg?crop=0px%2C147px%2C1333px%2C699px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1490789700.0, "source": "http://www.usmagazine.com", "summary": ""}