{"url": "www.elle.com/culture/celebrities/a20122925/miley-cyrus-on-living-with-liam-hemsworth-pranks/", "text": "Two years ago, Miley Cyrus and Liam Hemsworth were still playing coy about being back together. Hemsworth even went so far as to deny to the press they were re-engaged, despite Cyrus wearing his ring. But time and going Instagram official must change all, because Cyrus very openly spoke about her life living with Hemsworth to Jimmy Kimmel last night.\n\nShe touched on the viral videos they've shared of Hemsworth pranking her, which is apparently a regular occurrence for the two. \"Yes, constantly [Liam likes to scare me],\" Cyrus said. About that last video he posted this week, she explained her, \"F*ck you, I hate you, I was already scared\" reaction.\n\n\"I was, I was already scared,\" she said. \"That was what was so annoying. I was putting—and this was bad, I know that it’s May, and I was putting our Christmas decorations away finally. I like lights, and I like shiny things and elves, and they just live for like a whole summer. So now it was time, May 1, Christmas has gotta go.\" Kimmel expressed his shock she still had the decorations up. \"They’re so cute. Santa makes me feel safe.\"\n\n\"So I was already in this really creepy basement and so I was coming up to say ‘Oh my god, that basement is so scary,’ and then he jumped out at the worst time,\" Cyrus continued. She dodged Kimmel's question of whether she's bothered by it or actually okay with it. \"I just don’t know why I haven’t caught onto this is all—but I don’t know he’s around every corner. He’s around a lot of corners,\" she said. And she can't get him back. \"I’m obviously very loud so I’m not good at scaring people. because I’m like—\" Cyrus hiss-laughs manically, \"And he’s like ‘I can hear you back there behind the door.’\"\n\nShe revealed to Kimmel that yes, they're living together, and Hemsworth also calls her a hoarder. \"I’m very, okay, I would say I’m a clean person but I’m also am a little bit of a hoarder. He calls it hoarding, I call it collecting. There’s a very small—there’s a thin line that divides hoarding and collecting, [and it] is keeping things in the package. So having things in the boxes, so for example, I have saved for probably 15 years now a bag of peanuts from Southwest airlines, but they’re still in the bag so that is collecting. Loose peanuts, that’s hoarding. Collecting is in the package because they mean something to me. [The peanuts], they represent the beginning of this life for me because I was on my way to LA for the first time to audition for Hannah Montana.\"\n\nAnd finally, Hemsworth got her hooked on video games. \"This is really random, you’d never expect this, but Liam was playing the UFC [fighting] video game, and I told him how dumb it was until the controller got in my hand one time, and now it’s my favorite thing in the world is smoking pot and playing UFC video games. It’s not very productive.\"\n\nBecause this is a Miley Cyrus interview, she also touched on her pot use these days: still none. \"I want to be but no, [I’m no longer smoking].\" Kimmel pointed out pot is now legal in California. \"That’s the way I—I’m a rebel. Because I am very focused on what I’m working on right now and I think I also think it is the most magical, amazing—it’s my first and true love, but it’s not for me at this time in my life, but I’m sure there will be a day I will happily indulge.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.342xh;0,0.0797xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.342xh;0,0.0797xh&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a20122925/miley-cyrus-on-living-with-liam-hemsworth-pranks/", "title": "Miley Cyrus Really Opened Up About Living With Liam Hemsworth", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Miley Cyrus Really Opened Up About Living With Liam Hemsworth", "description": "She talked about his constant pranks, why he believes she's a hoarder, and how he got her hooked on one video game.", "url": "https://www.elle.com/culture/celebrities/a20122925/miley-cyrus-on-living-with-liam-hemsworth-pranks/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.342xh;0,0.0797xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-05-02 03:48:46", "published_time": "2018-05-02 03:13:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.342xh;0,0.0797xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Miley Cyrus on Living With Liam Hemsworth and His Pranks - Miley Talks About Fiancé to Jimmy Kimmel", "description": "Two years ago, Miley Cyrus and Liam Hemsworth were still playing coy about their being back together, Hemsworth going so far as to deny they were re-engaged​ to press, despite Cyrus wearing his ring. But time and going Instagram official​ changes all because Cyrus was talking very openly about her life living with Liam Hemsworth to Jimmy Kimmel last night.", "keywords": "liam hemsworth, miley cyrus, miley cyrus boyfriend, miley cyrus engaged, miley cyrus jimmy kimmel, miley cyrus liam hemsworth, miley cyrus roommate", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.682xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,miley cyrus engaged,miley cyrus roommate,miley cyrus jimmy kimmel,miley cyrus boyfriend,miley cyrus liam hemsworth,liam hemsworth,miley cyrus", "sailthru.date": "2018-05-02T15:13:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.342xh;0,0.0797xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-927345946-1525272447.jpg?crop=1.00xw:0.682xh;0,0", "sailthru.socialtitle": "Miley Cyrus Really Opened Up About Living With Liam Hemsworth", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525201980.0, "source": "http://www.elle.com", "summary": ""}