{"url": "https://www.rollingstone.com/culture/culture-news/paul-haggis-accused-of-rape-sexual-misconduct-by-multiple-women-197402/", "text": "Multiple women have accused Oscar-winning movie director Paul Haggis of sexual assault. Last month, publicist Haleigh Breest filed a civil suit alleging that the filmmaker, who picked up Best Picture and Best Original Screenplay Academy Awards for 2004’s Crash, of rape. On Friday, three other women came forward to The Associated Press with accusations of sexual misconduct.\n\nHaggis denied the claims in Breest’s suit, which was filed in mid-December, and filed a countersuit, claiming the publicist and her lawyer had attempted to extort $9 million from him in exchange for withholding her suit. Breest claimed that Haggis assaulted her in 2013 after he offered her a ride home after an event, but instead took her to his Manhattan apartment; there, she said, he forced her to perform oral sex on him, fondled her, asked if she enjoyed anal sex and raped her. Haggis’ lawyer, Christine Lepera – who represented producer Dr. Luke in the wake of pop-star Kesha accusing him of sexual assault – said, “He didn’t rape anybody,” in a statement.\n\n“Mr. Haggis denies these anonymous claims in whole. In a society where one of a person’s fundamental rights is the ability to confront an accuser, that right has now been eviscerated when it comes to anyone being charged in the press with any sort of sexual misconduct,” a rep for Haggis said in a statement to Rolling Stone. “Notably, no one has reached out to anyone on Mr. Haggis’ team other than the press to report this. He views the fact that these reports appear to be spearheaded from the law firm representing Ms. Breest, as a further tactic to try to harm him and continue their effort to obtain money … We reiterate our claim against Ms. Breest, and note again that we initiated the legal proceedings, not Ms. Breest.”\n\nThe new accusers said they felt empowered to come forward after learning of Breest’s story and seeing women report stories of powerful men engaging in sexual misconduct as part of the #MeToo movement. The women, who all chose to remain anonymous out of fear of retribution, claimed to have stories similar to Breest’s: they were all in their 20s or early 30s and they all said Haggis allegedly attempted to set up private meetings with them to discuss business but subsequently tried to kiss them. Two said that Haggis allegedly became more antagonistic when they resisted him.\n\nA lawyer for Breest did not immediately reply to Rolling Stone‘s request for comment but told The AP that Haggis’ countersuit was “a preposterous and transparent PR stunt that will not succeed” and “a further act of aggression.”\n\nOne of the new accusers said she was 28 when the alleged attack took place in 1996. She claims she was working on a television show that Haggis produced when he asked her to review some photos from the show. When they met in a back office, she claimed he tried to kiss her. “He said, ‘Do you really want to continue working?'” she claimed. He then allegedly forced her to perform oral sex on him and pushed her onto the floor and raped her.\n\nAnother new accuser said she was in her 30s in the late 2000s when she set up a meeting with Haggis to pitch him on a TV show. She said that Haggis told her that he and his wife had an understanding about extramarital sex and came around a table attempting to kiss her. She ran to her car as Haggis allegedly pursued her, though she was able to drive away.\n\nThe last new accuser said she was in her late 20s in 2015 when Haggis allegedly held down her arms, kissed her and followed her into a taxi in Canada. When the cab took her to her apartment, she said Haggis allegedly tossed money at the driver, pursued her and kissed her again before she could get inside and close the door. She said that he then waved at her from outside her residence and claimed that he sent aggressive text messages over the next 24 hours until she blocked him. One of the women told the AP that he’d said, “I need to be inside of you,” before she was able to escape.\n\nOutside of filmmaking, Haggis has gained fame for speaking out against Scientology. He broke from the church in 2009 and has since participated in articles, books and a documentary that disparaged the religion. “Mr. Haggis also questions whether Scientology has any role here, which he notes has been attacking him for years with false accusations,” his rep said in a statement. The women whom AP spoke with in their investigation said they had no connection to the Church of Scientology.\n\nLast October, when news of Harvey Weinstein’s alleged misconduct surfaced, Haggis was outspoken in condemning the producer’s supposed behavior. “Although everyone thinks it is vile behavior, you have got to focus on those who may have colluded and protected him,” Haggis told The Guardian, as reported by The AP. “For me, they are as guilty as he is and in some cases more so, if I can say that. I mean, he was a predator and a predator is a predator. But what about those who would rather look the other way?”", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fpaul-haggis-accused-of-rape-sexual-misconduct-by-multiple-women-197402%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=197402", "https://www.rollingstone.com/wp-content/uploads/2018/06/paul-haggis-987947a6-94db-4bbe-9837-d4c75ce5ead3.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/paul-haggis-987947a6-94db-4bbe-9837-d4c75ce5ead3.jpg", "keywords": [], "authors": ["Kory Grow", "Senior Writer", "Kory Grow'S Most Recent Stories", "Dave Grohl Picks Patsy Cline", "Smashing Pumpkins For Pandemic Playlist", "Record Stores", "Coronavirus", "Could Be The Death Knell", "For Indie Retailers", "The Thing"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/paul-haggis-accused-of-rape-sexual-misconduct-by-multiple-women-197402/", "title": "Paul Haggis Accused of Rape, Sexual Misconduct by Multiple Women", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Oscar-winning filmmaker Paul Haggis has been accused of sexual misconduct and assault by four women.", "news_keywords": "sexual assault, sexual misconduct", "og": {"type": "article", "title": "Paul Haggis Accused of Rape, Sexual Misconduct by Multiple Women", "url": "https://www.rollingstone.com/culture/culture-news/paul-haggis-accused-of-rape-sexual-misconduct-by-multiple-women-197402/", "description": "Oscar-winning filmmaker allegedly forced kisses on women and grew more aggressive when they resisted him", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/paul-haggis-987947a6-94db-4bbe-9837-d4c75ce5ead3.jpg", "width": 1024, "height": 683, "alt": "Paul Haggis"}, "locale": "en_US"}, "article": {"published_time": "2018-01-05T21:09:00+00:00", "modified_time": "2018-06-25T14:36:21+00:00"}, "twitter": {"text": {"title": "Paul Haggis Accused of Rape, Sexual Misconduct by Multiple Women"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/paul-haggis-987947a6-94db-4bbe-9837-d4c75ce5ead3.jpg?w=1024", "alt": "Paul Haggis"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@korygrow", "title": "Paul Haggis Accused of Rape, Sexual Misconduct by Multiple Women", "description": "Oscar-winning filmmaker Paul Haggis has been accused of sexual misconduct and assault by four women."}, "generator": "WordPress 5.4", "author": "Kory Grow", "content_type": "Article", "post_id": 197402, "title": "Paul Haggis Accused of Rape, Sexual Misconduct by Multiple Women", "published_at": "2018-01-05 21:09:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/paul-haggis-987947a6-94db-4bbe-9837-d4c75ce5ead3.jpg?w=1024", "comment_count": 0, "tags": "sexual misconduct", "topics": "Culture News", "body": "Multiple women have accused Oscar-winning movie director Paul Haggis of sexual assault. Last month, publicist Haleigh Breest filed a civil suit alleging that the filmmaker, who picked up Best Picture and Best Original Screenplay Academy Awards for 2004's Crash, of rape. On Friday, three other women came forward to The Associated Press with accusations of sexual misconduct.Haggis denied the claims in Breest's suit, which was filed in mid-December, and filed a countersuit, claiming the publicist and her lawyer had attempted to extort $9 million from him in exchange for withholding her suit. Breest claimed that Haggis assaulted her in 2013 after he offered her a ride home after an event, but instead took her to his Manhattan apartment; there, she said, he forced her to perform oral sex on him, fondled her, asked if she enjoyed anal sex and raped her. Haggis' lawyer, Christine Lepera – who represented producer Dr. Luke in the wake of pop-star Kesha accusing him of sexual assault – said, \"He didn't rape anybody,\" in a statement. \"Mr. Haggis denies these anonymous claims in whole. In a society where one of a person’s fundamental rights is the ability to confront an accuser, that right has now been eviscerated when it comes to anyone being charged in the press with any sort of sexual misconduct,\" a rep for Haggis said in a statement to Rolling Stone. \"Notably, no one has reached out to anyone on Mr. Haggis' team other than the press to report this. He views the fact that these reports appear to be spearheaded from the law firm representing Ms. Breest, as a further tactic to try to harm him and continue their effort to obtain money ... We reiterate our claim against Ms. Breest, and note again that we initiated the legal proceedings, not Ms. Breest.\"The new accusers said they felt empowered to come forward after learning of Breest's story and seeing women report stories of powerful men engaging in sexual misconduct as part of the #MeToo movement. The women, who all chose to remain anonymous out of fear of retribution, claimed to have stories similar to Breest's: they were all in their 20s or early 30s and they all said Haggis allegedly attempted to set up private meetings with them to discuss business but subsequently tried to kiss them. Two said that Haggis allegedly became more antagonistic when they resisted him.A lawyer for Breest did not immediately reply to Rolling Stone's request for comment but told The AP that Haggis' countersuit was \"a preposterous and transparent PR stunt that will not succeed\" and \"a further act of aggression.\"One of the new accusers said she was 28 when the alleged attack took place in 1996. She claims she was working on a television show that Haggis produced when he asked her to review some photos from the show. When they met in a back office, she claimed he tried to kiss her. \"He said, 'Do you really want to continue working?'\" she claimed. He then allegedly forced her to perform oral sex on him and pushed her onto the floor and raped her.Another new accuser said she was in her 30s in the late 2000s when she set up a meeting with Haggis to pitch him on a TV show. She said that Haggis told her that he and his wife had an understanding about extramarital sex and came around a table attempting to kiss her. She ran to her car as Haggis allegedly pursued her, though she was able to drive away.The last new accuser said she was in her late 20s in 2015 when Haggis allegedly held down her arms, kissed her and followed her into a taxi in Canada. When the cab took her to her apartment, she said Haggis allegedly tossed money at the driver, pursued her and kissed her again before she could get inside and close the door. She said that he then waved at her from outside her residence and claimed that he sent aggressive text messages over the next 24 hours until she blocked him. One of the women told the AP that he'd said, \"I need to be inside of you,\" before she was able to escape.Outside of filmmaking, Haggis has gained fame for speaking out against Scientology. He broke from the church in 2009 and has since participated in articles, books and a documentary that disparaged the religion. \"Mr. Haggis also questions whether Scientology has any role here, which he notes has been attacking him for years with false accusations,\" his rep said in a statement. The women whom AP spoke with in their investigation said they had no connection to the Church of Scientology.Last October, when news of Harvey Weinstein's alleged misconduct surfaced, Haggis was outspoken in condemning the producer's supposed behavior. \"Although everyone thinks it is vile behavior, you have got to focus on those who may have colluded and protected him,\" Haggis told The Guardian, as reported by The AP. \"For me, they are as guilty as he is and in some cases more so, if I can say that. I mean, he was a predator and a predator is a predator. But what about those who would rather look the other way?\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1515186540.0, "source": "https://www.rollingstone.com", "summary": ""}