{"url": "www.newidea.com.au/meghan-markle-kate-middleton-due-to-give-birth-on-the-same-day", "text": "Getty\n\nAnd now Kate has decided that she doesn’t want Louis to be her last, and loves the idea of having two babies really close together.\n\n‘Kate really wants four children but also wants to get back to royal duty, so figures that if she has another baby straight away she can hopefully be back at work by late 2019. She has it all worked out, but falling pregnant again quickly is crucial,’ the insider explains.\n\nThat her body has bounced back so well after having Prince Louis just three months ago – Kate revealed this was down to running around after her children so much – is a sure sign she’s ready to produce another heir.\n\nThe double baby news comes amid last week’s revelation by Vanity Fair that Kate and Meghan’s friendship has greatly strengthened in the past few months, with Meghan now seeing Kate as a ‘pillar of support’.\n\nAs Meghan continues to face almost daily embarrassment from her estranged father Thomas Markle – who last wee even accused the palace of lying to him – her relationship with Kate has become a huge comfort.\n\nThey talk on the phone and try to make sure they see each other at least once a week.\n\nRelated: Kate Middleton and Prince William expecting fourth child\n\nRelated: Meghan and Harry's twin joy\n\nGetty\n\n‘Kate’s well aware of what Meghan is going through,’ a source told the magazine.\n\n‘Her family has been dragged through the tabloids and she knows it’s not nice. She’s made a big effort to be kind to Meghan and look out for her.’\n\nNow it seems the royals are bonding over babies.\n\nIn Touch reports Kate ‘penned a pregnancy food list for Meghan that’s full of nutritious things to eat and is advising her on how to balance motherhood with life as a royal’.\n\n‘Meghan is hoping for one of each – a boy and a girl,’ the insider told the US publication, adding that the duchesses will raise the cousins ‘as one big happy family’.\n\nThat happy family might even be larger than they all expect, as at 37 – Meghan celebrated her birthday last weekend at the wedding of Harry’s childhood friends Charlie Van Straubenzee and Daisy Jenks – she has a strong chance of having twins.\n\nMultiple birth expert Helen Turier told The Sun: ‘Older women – so women in their late 30s, early 40s – are more likely to hyper-ovulate. This means they’re more likely to release two eggs or more per cycle than younger women. Therefore, it is believed that’s why there’s a higher incidence of multiple birth babies in older women.’\n\nRelated: Confirmed: Prince Harry and Meghan Markle - 'Yes, it's twins!'\n\nAs for Harry, during a walkabout in Ireland last month, he hinted he might not want a super-sized family while chatting with a fan. ‘My husband also has red hair and he gave me five children,’ Elaine Adam-Stewart said. ‘When are you and Meghan going to get going?’ Harry joked back: ‘Five children? Too many.’\n\nMeanwhile, it appears there’s something special in the water at the palace, as news broke last month that Kate’s stylist Natasha Archer is expecting her first child with husband Christopher Jackson, the royal photographer. The couple told New Idea: ‘We’re so excited. We can’t wait to hear the pitter patter of tiny feet!’\n\nWith so much to celebrate the royal family couldn’t be happier.\n\nThe Queen – already pleased that her daughter-in-law shares a birthday with her late mother – is delighted.\n\n‘The Queen is tickled pink – there’s nothing like two royal babies to have popularity for the monarchy soaring,’ says the insider. ‘All the palace is talking about it, and how it would be the first time in royal history that anything like this has happened.’\n\nAs for Harry, during a walkabout in Ireland last month, he hinted he might not want a super-sized family while chatting with a fan. ‘My husband also has red hair and he gave me five children,’ Elaine Adam-Stewart said. ‘When are you and Meghan going to get going?’\n\nHarry joked back: ‘Five children? Too many.’\n\nMeanwhile, it appears there’s something special in the water at the palace, as news broke last month that Kate’s stylist Natasha Archer is expecting her first child with husband Christopher Jackson, the royal photographer. The couple told New Idea: ‘We’re so excited. We can’t wait to hear the pitter patter of tiny feet!’\n\nWith so much to celebrate the royal family couldn’t be happier.\n\nThe Queen – already pleased that her daughter-in-law shares a birthday with her late mother – is delighted.\n\n‘The Queen is tickled pink – there’s nothing like two royal babies to have popularity for the monarchy soaring,’ says the insider. ‘All the palace is talking about it, and how it would be the first time in royal history that anything like this has happened.’\n\nFor the full story see this weeks issue of New Idea, on sale now.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/media/31067/kate-middleton-meghan-markle.jpg", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/31067/kate-middleton-meghan-markle.jpg", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/meghan-markle-kate-middleton-due-to-give-birth-on-the-same-day", "title": "Meghan and Kate’s double baby joy: Due on the same day!", "meta_data": {"language": "en-us", "description": "They’ve struck up a close friendship, and now the Duchesses of Cambridge and Sussex have some exciting joint baby news: they could give birth on the same day!", "news_keywords": "kate middleton, meghan markle, kate and meghan, kate middleton meghan markle, kate and meghan both pregnant, kate middleton meghan markle pregnant, prince harry, prince william, harry and william, meghan and harry, prince harry meghan markle baby, william and kate, The Duke and Duchess of Cambridge, the duke and duchess of sussex, prince charles, royals, the royal family, royal family news, latest royal family news, the royals, royal baby", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/meghan-markle-kate-middleton-due-to-give-birth-on-the-same-day", "title": "Meghan and Kate’s double baby joy: Due on the same day!", "description": "They’ve struck up a close friendship, and now the Duchesses of Cambridge and Sussex have some exciting joint baby news: they could give birth on the same day!", "image": {"identifier": "http://www.newidea.com.au/media/31067/kate-middleton-meghan-markle.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Meghan Markle and Kate Middleton's double baby joy: Due on the same day!", "description": "They’ve struck up a close friendship, and now the Duchesses of Cambridge and Sussex have some exciting joint baby news: they could give birth on the same day!", "image": "http://www.newidea.com.au/media/31067/kate-middleton-meghan-markle.jpg", "url": "https://www.newidea.com.au/meghan-markle-kate-middleton-due-to-give-birth-on-the-same-day"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1533502688.015, "source": "http://www.newidea.com.au", "summary": ""}