{"url": "https://www.romper.com/p/jessie-james-decker-talks-about-breastfeeding-her-pregnancy-boobs-so-buckle-up-2956883", "text": "There are tons of joys of welcoming a baby into the world, no matter how many times you've done it. For country singer Jessie James Decker, breastfeeding is most definitely one of them. And that was true even when the going got a little, er... bloody. So, now that she's expecting her third child, Jessie James Decker reflected on breastfeeding in a conversation with E! News and spilled some serious deets. Despite how uncomfortable her experience sounds, her enthusiasm for the entire process will likely make you appreciate nursing just that much more.\n\nFollowing the release of her latest album, Southern Girl City Lights, sat down with E! News co-host Carissa Culiner, who is also pregnant, and offered up some advice to the new mom-to-be. When the subject of breastfeeding came up, Decker, had a lot to say:\n\nI love breastfeeding and you're gonna love it to. And when your nipples get really bloody, you know put a little Vaseline, you'll be fine.\n\nBut does breastfeeding really cause your nipples to bleed? Culiner wanted to know. \"Oh yes. Mine bled both times,\" Decker told her in the interview. \"I had some hungry little babies.\"\n\nAs she mentioned to Culiner, Decker has lots of experience with breastfeeding, as she is already mom to 3-year-old Vivianne Rose and 2-year-old Eric \"Buddy\" II, according to Us Weekly. She shares her kids with her husband, Tennessee Titans wide receiver Eric Decker. The couple also stars in the E! reality series Eric & Jessie: Game On.\n\nAnd Decker got about as real as it gets talking about pregnancy and breastfeeding with E! News on Thursday, even revealing what she believes to to be a major pregnancy downside:\n\nThe worst part [of pregnancy] is finding clothes to fit because I don't think they have the cutest maternity clothes. And my boobs get so massive, like humungous, that nothing fits. I can't get anything to fit my body and it's so stressful. My back hurts, so that's tough.\n\nStill, it's clear that she's pumped to have another one on the way. On Oct. 9, she announced the pregnancy on Instagram with a video of her telling Vivienne the big news.\n\n\"... [W]e are over the moon and feel so blessed and can't wait to meet this little one end of march,\" she captioned the post in part.\n\nAccording to BabyCenter, though, a woman's nipples should not bleed or crack if all is going well in breastfeeding. If they do, there are several possible causes: the baby's improper latch; something's wrong with the breast pump, such as the sucking level being too high; the baby's passing along thrush to the mom; eczema; or the baby's being \"tongue-tied,\" which can be corrected with a simple surgery. BabyCenter recommends discussing the situation with a lactation consultant if you do experience nipple bleeding from breastfeeding.\n\nStill, Decker told People in another interview that she's most looking forward to sharing the \"special bond\" of breastfeeding with her third child. She nursed both of her older kids for seven or eight months each, and wants to do so for even longer the third time around, she told the magazine.\n\nIt's a journey that her fans and moms alike would sure like to see documented on Eric & Jessie, if Decker is up for that, of course. If not, good luck to her in beating her previous impressive breastfeeding duration records. It's not an easy task, and Decker's obvious enthusiasm for it is pretty cool.\n\nWatch Romper's new video series, Romper's Doula Diaries:\n\nCheck out the entire Romper's Doula Diaries series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/da13aaa9-bb4b-41b1-a6e0-0df5d161293f-getty-1206118592.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/10/20/7071ed00-4c74-40b1-9bf4-b5fd072b1428-getty-663846912.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/7d4aadab-72d4-48ba-a55f-89c3c3906bdc-getty-1219338392.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/10/20/7071ed00-4c74-40b1-9bf4-b5fd072b1428-getty-663846912.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/8/6720e2cb-ebd2-46b4-ba82-6e819b851787-getty-1135811631.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/10/20/7071ed00-4c74-40b1-9bf4-b5fd072b1428-getty-663846912.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/jessie-james-decker-talks-about-breastfeeding-her-pregnancy-boobs-so-buckle-up-2956883", "title": "Jessie James Decker Talks About Breastfeeding & Her Pregnancy Boobs, So Buckle Up", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/jessie-james-decker-talks-about-breastfeeding-her-pregnancy-boobs-so-buckle-up-2956883", "type": "article", "title": "Jessie James Decker Dishes About Her \"Bloody\" Breastfeeding Experiences", "description": "There are tons of joys of welcoming a baby into the world, no matter how many times you've done it. For country singer Jessie James Decker, breastfeeding is most definitely one of them. And that was true even when the going got a little, er...…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/10/20/7071ed00-4c74-40b1-9bf4-b5fd072b1428-getty-663846912.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "There are tons of joys of welcoming a baby into the world, no matter how many times you've done it. For country singer Jessie James Decker, breastfeeding is most definitely one of them. And that was true even when the going got a little, er...…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}