{"url": "https://www.cbc.ca/news/entertainment/hand-in-hand-benefit-1.4287068", "text": "Dozens of stars turned out to sing, tell stories and plead for support for hurricane victims on Tuesday, in a one-hour televised benefit that organizers said raised more than $44 million (all figures US), with donations still being accepted.\n\nWith Stevie Wonder singing Lean on Me and Usher and Blake Shelton joining for Stand By Me, the message was clear: Americans were being asked to help those whose lives were upended by wind and rain.\n\nStevie Wonder was among the high-profile performers who took the stage for the benefit. (Kevin Mazur/Hand in Hand/Getty Images)\n\nJustin Bieber, George Clooney, Barbra Streisand, Al Pacino, Lupita Nyong'o, Jay Leno and dozens of others sat at phone banks to accept donations. Beyoncé, Will Smith and Dwayne (The Rock) Johnson sent in taped pleas for support during the event, shown on more than a dozen television networks and online simultaneously.\n\nActor Josh Gad and singer Justin Bieber were among the younger participants. (Kevin Mazur/Hand in Hand/Getty Images)\n\nOriginally conceived as a benefit for victims of Hurricane Harvey in Texas, the \"Hand in Hand\" telethon was expanded to help people in Florida and the Caribbean devastated in recent days by Irma.\n\nWe're here to raise money, lift some spirits,\" said Jamie Foxx, standing with actor Leonardo DiCaprio.\n\n\"When tough times hit, this is who we are. We're compassionate. We're unstoppable.\"\n\nCelebrities including, from left, Al Pacino, Leonardo DiCaprio and Robert De Niro were among those answering phones to speak to those making donations. (Theo Wargo/Hand in Hand/Getty Images)\n\nThe quick-moving show took a form familiar to viewers since a sad template was set in the wake of the 2001 terrorist attacks. Celebrities requested donations, told heartwarming survival stories involving people caught in the storm and sang songs. Several organizations will benefit, including the United Way and Save the Children.\n\nActress Sofia Vergara and actor-filmmaker Tyler Perry are seen at the benefit. (Kevin Mazur/Hand in Hand/Getty Images)\n\nMultiple locations\n\nStages in Los Angeles, New York and Nashville were filled simultaneously, although the night's final performance — a tribute to Texans by George Strait, Robert Earl Keen, Chris Stapleton, Miranda Lambert and Lyle Lovett — originated from San Antonio.\n\nMiranda Lambert and George Strait perform as part of the satellite benefit from San Antonio. (Rick Diamond/Getty Images for George Strait)\n\nDespacito singer Luis Fonsi and Tori Kelly performed Hallelujah together. Dave Matthews picked his guitar from a studio above Times Square, and Darius Rucker, Brad Paisley, Demi Lovato and Cece Winans sang the Beatles' With a Little Help From My Friends. Wonder, backed by a gospel chorus, opened the show with the Bill Withers classic.\n\n\"Natural disasters don't discriminate,\" Beyoncé said. \"They don't care if you're an immigrant, black or white, Hispanic or Asian, Jewish or Muslim, wealthy or poor.\"\n\nOprah Winfrey, left, and Cher shared the story of a much publicized image of strangers in Houston forming a chain to save someone. (Kevin Mazur/Hand in Hand/Getty Images)\n\nCher and Oprah Winfrey told the story behind a frequently-seen picture of strangers forming a human chain to save someone from flooding in Houston.\n\nUsually competitive network morning personalities Matt Lauer, Norah O'Donnell and Michael Strahan stood before a satellite image of an ominous Irma to describe devastation that the storm had caused.\n\nRising donations\n\nDonations were announced from some deep pockets. Computer maker Michael Dell and his wife Susan pledged to match the first $10 million in donations Tuesday.\n\nThey've given a total of $41 million to the Rebuild Texas Fund. Basketball star Chris Paul gave $20,000 and said the NBA Players Association would match donations of up to the same amount given by any NBA player.\n\nCatherine Zeta-Jones, Chris Paul and Steve Buscemi, in the foreground, snap a selfie at the benefit's New York location. In the background are, from left, Sam Smith, Malin Akerman, Uzo Aduba and Tracy Morgan. (Theo Wargo/Hand in Hand/Getty Images)\n\nAnnouncing Apple's promise to give $5 million, comic Stephen Colbert quipped said it was coincidentally \"also the price of the new iPhone.\"\n\nBilly Crystal, who gave the $14.5 million tally at the show's end, said phone lines would be kept open, and viewers could also donate online. ABC, CBS, NBC, Fox, HBO, MTV, BET and Univision were among the networks carrying the program, which was also streamed online.\n\n'Helpless is an understatement'\n\nHouston rap artist Bun B and Hollywood talent manager Scooter Braun organized the event.\n\nBraun said after the show, all the celebrities manning the phone banks stayed to take more calls.\n\nHouston rapper Bun B, left, and music manager Scooter Braun organized the event. (Kevin Mazur/Hand in Hand/Getty Images)\n\n\"No one left,\" he said. \"Everyone just kept answering phones and answering phones and answering phones. People want to give. Like, people want to help. And you don't have to be a celebrity to do it.\"\n\nFor many of the stars, the storms hit close to home.\n\nPeople want to give...people want to help. And you don't have to be a celebrity to do it. - Scooter Braun\n\n\"I have family in Puerto Rico, I have family in Miami. I've been on the road. I haven't been able to be there. So you can imagine how it's been,\" Fonsi said after the show, adding that all his family, including his wife and young children in Miami, survived the storm and are safe.\n\n\"Helpless — helpless is an understatement,\" Fonsi said of being on tour and unable to be with his family. He noted that his experience paled in comparison to the pain the storms have caused for many.\n\n\"You can imagine how frustrating it is to not be able to sort of protect your own family,\" he said.\n\n\"Imagine all of these people that have nothing to do. The videos that you see online. So as an artist, as a singer, I think it's part of our job, it's part of our resume, to take time off and come together and do these kind of things.\"\n\n'You can imagine how frustrating it is to not be able to sort of protect your own family,' said Luis Fonsi, seen performing Hallelujah with Tori Kelly during the benefit. (Kevin Mazur/Hand in Hand/Getty Images)\n\nAnother benefit event — with Willie Nelson, Paul Simon, James Taylor and Bonnie Raitt among the headliners — is set for next week, aimed to help Texas residents affected by Hurricane Harvey. The \"Harvey Can't Mess With Texas\" concert will be held in Austin on Sept. 22 and will be broadcast live on 11 Tegna stations in the state and on YouTube.\n\nAlso scheduled to perform are Lyle Lovett and Leon Bridges. Actors Renee Zellweger and Matthew McConaughey are scheduled to make special appearances at the four-hour show at the Frank Erwin Center.\n\nTickets go on sale Wednesday afternoon, with prices ranging from $30 to $199 and proceeds to benefit the Rebuild Texas Fund. Donations will also be collected from phone banks at the television stations.", "images": ["https://i.cbc.ca/1.4287119.1505309084!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/775041763ki00116-hand-in-ha.jpg", "https://www.cbc.ca/a/static/media/logo_cbc-radio-canada.svg", "https://i.cbc.ca/1.4287126.1505309528!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041759ap00040-hand-in-ha.jpg", "https://i.cbc.ca/1.4287110.1505308699!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00153-hand-in-ha.jpg", "https://i.cbc.ca/1.4287151.1505310272!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00039-hand-in-ha.jpg", "https://i.cbc.ca/1.4287119.1505309084!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/775041763ki00116-hand-in-ha.jpg", "https://i.cbc.ca/1.4287113.1505308880!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775040487ak00060-george-str.jpg", "https://i.cbc.ca/1.4287149.1505310240!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00065-hand-in-ha.jpg", "https://i.cbc.ca/1.4287135.1505309966!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00143-hand-in-ha.jpg", "https://i.cbc.ca/1.4287109.1505308664!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00126-hand-in-ha.jpg", "https://i.cbc.ca/1.4287191.1505311277!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041759ap00063-hand-in-ha.jpg", "https://i.cbc.ca/1.4287148.1505310208!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/775041763ki00098-hand-in-ha.jpg"], "top_img": "https://i.cbc.ca/1.4287119.1505309084!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/775041763ki00116-hand-in-ha.jpg", "keywords": [], "authors": ["The Associated Press"], "canonical_link": "https://www.cbc.ca/news/entertainment/hand-in-hand-benefit-1.4287068", "title": "Hand in Hand benefit: George Clooney, Oprah, Justin Bieber make TV appeal for hurricane relief", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"site_name": "CBC", "url": "https://www.cbc.ca/news/entertainment/hand-in-hand-benefit-1.4287068", "title": "Hand in Hand benefit: George Clooney, Oprah, Justin Bieber make TV appeal for hurricane relief | CBC News", "image": "https://i.cbc.ca/1.4287119.1505309084!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/775041763ki00116-hand-in-ha.jpg", "description": "Dozens of stars turned out to sing, tell stories and plead for support for hurricane victims on Tuesday, in a one-hour televised benefit that organizers said raised more than $44 million US, with donations still being accepted.", "locale": "en_US", "type": "article"}, "fb": {"pages": 5823419603}, "vf": {"section": "2.635", "unique_id": "1.4287068"}, "google-site-verification": "pJy_QmRvDz2tr7X8eQ6Y1L3Se-8RWM_PpJX42Pr_fYo", "twitter": {"site": "@cbc", "player": {"width": 640, "height": 360}, "card": "summary_large_image"}, "description": "Dozens of stars turned out to sing, tell stories and plead for support for hurricane victims on Tuesday, in a one-hour televised benefit that organizers said raised more than $44 million US, with donations still being accepted."}, "movies": [], "publish_date": null, "source": "https://www.cbc.ca", "summary": ""}