{"url": "https://www.bustle.com/p/blac-chyna-says-she-sent-rob-kardashian-the-video-of-her-with-another-man-so-he-would-leave-her-alone-69149", "text": "On Wednesday, Rob Kardashian and Blac Chyna caught the internet's attention, when the former posted a series of allegations about Chyna, nude photos of her, and a video of Chyna kissing another man that he said she sent him. Chyna addressed the video in an interview with Good Morning America on Monday, saying that she sent it to Kardashian in hopes that it would convince him to leave her alone. Bustle has reached out to reps for Kardashian and Chyna regarding the allegations made against each other, but did not receive a response. Kardashian's lawyer, Robert Shapiro, told TMZ that Kardashian's rant was \"a spontaneous reaction that he regrets.\"\n\nThe nude photos that Kardashian posted of Chyna were the main subject of the GMA segment. In the state of California, where both stars reside, posting sexually explicit photos that were understood to be meant to remain private without permission constitutes revenge porn and is punishable by law. Chyna intends to file a restraining order against Kardashian on Monday.\n\nIn addition to the potential illegality of the photos posted, the conversation also turned to the allegations that Kardashian made in his Instagram posts. In the series of since-deleted posts, he accused his ex of cheating on him, exploiting him for money, and abusing drugs and alcohol. Chyna responded with her own allegation, claiming on Snapchat that Kardashian was physically abusive, a charge which she reiterated in the GMA interview.\n\nChyna defended her decision to send the video of herself with another man to her ex. She clamed that Kardashian wouldn’t leave her alone, and said the video was meant to establish boundaries. \"I've been broken up with Rob since December and it's like, if somebody keeps poking at you and poking at you and poking at you, and keep poking at you, you're eventually, you're gonna pop,\" Chyna told GMA. \"And so I was just like, 'Maybe if I send this video to him, then he'll just leave me alone.'\"\n\nThe interviewer questioned whether there was any truth to her ex’s accusations that the couple were still together at the time the video was sent, which Chyna denied. She also refused the allegations that she used Kardashian family name for fame. “I was already Blac Chyna before the Kardashians,” the reality star responded. She also said that she her love for Kardashian was genuine when they were together. “Nobody was out to make a baby out of spite.”\n\nKardashian’s actions were, to Chyna, a violation of her trust. \"I was devastated, of course. I'm like, 'How could somebody, like, post these pictures of me?,'” Chyna told GMA. \"And I'm like, wow, OK, like, this is a person that I trusted. I just felt betrayed.\"\n\nShe also refuted claims that she had liked some of the pictures on Instagram, claiming that she had Kardashian's account blocked. Chyna hopes that pressing charges will inspire more women to come forward if they are ever in a similar situation. “It's just not right, it's not fair, and I feel like women should take up for themselves,\" Chyna said. \"I would like to just say something to all the women out there. You know, you're not the only one that's probably going through something. So I feel as though if one person speaks up, maybe it, hopefully, it will be a domino effect.”\n\nKardashian and Chyna's lawyers are expected in court Monday. According to TMZ, Kardashian will reportedly agree to Chyna's request for a restraining order.", "images": ["https://imgix.bustle.com/uploads/getty/2017/7/10/7d4e8f8c-29e2-47f2-9b55-1f21576c4d62-getty-800823206.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/2a7bf479-86a0-49f1-967d-34315e0e61ea-getty-1203122271.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/e7ab33bf-f193-4ed9-bdb4-7dad7449fca4-getty-1203620704.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/13/315e3e1a-2115-4704-b910-8bead21228c9-getty-1205850850.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/30/08d1d42c-bd1f-4770-bf38-b74e38c4f20b-getty-1211634455.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/7/10/7d4e8f8c-29e2-47f2-9b55-1f21576c4d62-getty-800823206.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/7/10/7d4e8f8c-29e2-47f2-9b55-1f21576c4d62-getty-800823206.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/blac-chyna-says-she-sent-rob-kardashian-the-video-of-her-with-another-man-so-he-would-leave-her-alone-69149", "title": "Blac Chyna Says She Sent Rob Kardashian The Video Of Her With Another Man So He Would Leave Her Alone", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/blac-chyna-says-she-sent-rob-kardashian-the-video-of-her-with-another-man-so-he-would-leave-her-alone-69149", "type": "article", "title": "Blac Chyna Addresses The Video She Sent To Rob", "description": "On Wednesday, Rob Kardashian and Blac Chyna caught the internet's attention, when the former posted a series of allegations about Chyna, nude photos of her, and a video of Chyna kissing another man that he said she sent him. Chyna addressed the…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/7/10/7d4e8f8c-29e2-47f2-9b55-1f21576c4d62-getty-800823206.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "On Wednesday, Rob Kardashian and Blac Chyna caught the internet's attention, when the former posted a series of allegations about Chyna, nude photos of her, and a video of Chyna kissing another man that he said she sent him. Chyna addressed the…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}