{"url": "https://www.theguardian.com/fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army", "text": "A gorgeous July day in Paris, the haute couture shows are in full swing and the Four Seasons hotel is in glamour lockdown. A motorcade of buffed, black, presidential-scale cars lines the kerb outside its street entrance, currently occupied by two women in red-carpet hair and makeup who have paused at the exit for a prolonged session with a selfie stick. Inside, a chandelier the size of a meteorite twinkles above a vast expanse of black and white marble floor, the airy space punctuated by urns crowded with triffid-sized white gladioli, reed slender and supermodel height.\n\nIn other words, the scene is perfectly set for the entrance of Olivier Rousteing, Balmain’s creative director and Paris fashion’s most glamorous frontman. Except, of course, he isn’t here yet, because I am 10 minutes early and he – like any self-respecting rock star – will be 20 minutes late. The restaurant is mostly empty, the diners having spilled out into the courtyard for post-lunch cigarettes and espresso, so I sip a Diet Coke served with elaborate ceremony by a waitress in a cocktail dress, and wait.\n\nAnd then here he is. He is in a black fedora, Keith Richards vibes, a sharp Balmain blazer with sleeves pushed up to the elbow. His chunky black and gold Rolex is exactly the watch Tutankhamun would have worn, were he to be reincarnated in 2016. Skinny jeans, biker boots, a black T-shirt faded to the perfect sultry charcoal. His sunglasses are enormous, the size of lab goggles. There is an awkward moment when he sits down opposite me and I think he isn’t going to take them off, but then he does, flashing me the wide, slightly distancing smile of the very beautiful, the smile of a man accustomed to being admired.\n\nHe is ridiculously good-looking. Zoolander good-looking. Poreless skin, worked-out body, cheekbones for days. And while being good-looking has never been part of the job description for a traditional fashion designer, that is the point, because Rousteing is very much a non-traditional fashion designer. He is mixed race. He loves the Kardashians. He posts endless selfies. And he has reinvented the house founded by Pierre Balmain in 1945 as a new kind of fashion enterprise, one that “is very pop, but communicates like a luxury brand”. He is not always adored by the critics (of which more later). But can 3.8 million Instagram followers be wrong?\n\nThe industry is scathing about designers who pour their creative energies into their celebrity friendships and social media feeds, but Rousteing turns this on its head. He tells me the moment his creativity stepped up a notch was five years ago, when he moved from behind the scenes at Balmain to replace Christophe Decarnin as creative director. “That was a big step,” he says. “School can teach you to be a great ‘designer’” – he puts ironic speech marks around the word with his fingers, as if to suggest being a designer isn’t really a proper job – “but there is so much more to being a creative director.” This job title, by contrast, he says in reverential tones. “It means overseeing everything from the business to the fittings to the campaign to the stores. It means having a vision.” Where the traditionalists of Paris revere the role of designer and roll their eyes at that of creative director, Rousteing does the opposite.\n\nFacebook Twitter Pinterest Olivier Rousteing backstage at Paris fashion week with bosom buddies Kanye West, Kim Kardashian, Kendall Jenner and Kris Jenner. Photograph: Michel Dufour/WireImage\n\nFrankly, Rousteing’s Balmain frightens the life out of the fashion establishment, particularly in Paris, where a few blue-chip family names – Gainsbourg, Deneuve, de la Fressange, de la Falaise – have for decades ruled the front row like a quaint oligarchy. Rousteing, by contrast, has forged an alliance with the Kardashian-Wests, an American family who have built a multimillion global empire on sex tapes and nude selfies. To use an analogy with a suitable level of cultural bling, Olivier Rousteing is to the Kardashians what Sandro Botticelli was to the Medici family. Critics who dismiss Balmain’s dresses as vulgar because they are made for Kim Kardashian might bear in mind that Botticelli painted Primavera for the Medicis.\n\nThe Balmain aesthetic is tight, bright and leggy. It is a rarefied, artisan-embroidered, exquisitely tailored version of an aesthetic instantly recognisable by any 18-year-old as Friday-night partywear. “Some people feel luxury shouldn’t look like what the masses like,” Rousteing says. “They feel it should be more elitist. But Balmain talks to young people. It’s not about selling to them, it’s about making them part of my world. And the people who can afford to buy luxury fashion, today those women want to feel young. So Balmain is pop, but it is a luxury brand as well. I don’t think you have to make sad, complicated clothes to show you have depth.” The aesthetic is accessible, but the prices are stratospheric – so high that they make Balmain feel aspirational in an abstract way. Like diamonds, or skiing holidays.\n\nFacebook Twitter Pinterest Olivier Rousteing hanging out with Justin Bieber at the Met Ball in New York. Photograph: Dimitrios Kambouris/Getty Images\n\nTogether, Rousteing, the Kardashians and a “Balmain army” of I’m-with-the-brand model-groupies have staged a coup over the fashion establishment as gamechanging as it is glamorous, in which the traditional gatekeepers of taste are bypassed. Consider, for example, how Balmain’s autumn/winter 2016 collection has made it into the public consciousness. When Kardashian-clan supermodel and Rousteing’s close friend Kendall Jenner opened and closed the show in March, she shared the moment with her 63 million Instagram followers. (It pains me to say it, but with that kind of instant reach, it arguably doesn’t matter whether newspaper critics like your show.) In July, Kanye West and Rousteing jointly released a music video for West’s single Wolves which doubled as the Balmain autumn/winter 2016 campaign video, featuring Kim Kardashian and models including Joan Smalls, Jourdan Dunn and Alessandra Ambrosio wearing the collection. “With music, you talk to an entire generation, where sometimes with fashion, you don’t talk to an entire generation because not everybody gets magazines,” Rousteing told Vogue. Within two days, the video had been watched five million times on YouTube.\n\nYet when we meet, two weeks before the video will be released, Rousteing is in sensitive mood. In particular, and awkwardly, he is fed up with critics, who he feels disparage his work.\n\n“The reality of fashion is that the more success you have, the more haters you get. I am talking about journalists. But I understand that I will not always be loved in fashion, and that the only thing that matters is the business I am building. So, I don’t care.” I am not entirely convinced of the veracity of this sentence, especially when he continues, “You can dislike my show, but don’t come to my show and then write 20 lines about how my face looks on Instagram! If that’s what you want to write, don’t bother coming to see six months’ hard work. Just stay home!”\n\nHaters? It is a word a pop star would use, not a fashion designer. But then that is Rousteing’s world. Earlier that day, I visited the Balmain showroom to see the resort collection, some of which had been showcased during the menswear show the week before. One fringed and latticed leather coatdress in cornflower blue looked familiar: Rihanna had already worn it on a night out in London, a couple of days after the show, at which it had been well-documented by the paparazzi. I asked Rousteing how that came about.\n\n“The night of the show, she [Rihanna] texted me and she was like, ‘Babe, I love that show, so beautiful, it was amazing.’ So I texted back, ‘What do you like?’ and she sent me a picture of the blue coat and I was like, ‘OK, I’ll send it tomorrow.’ There is no strategy. It comes from a text, from love and friendship. I don’t need PRs.” At this point he remembers his PR is sitting next to him and says, “I mean, of course I need PR. But I don’t need them for that.” His PR, sanguine, concurs. “When you see someone wearing Balmain, there’s no contract. It’s a real relationship, and that’s the magic.”\n\nFacebook Twitter Pinterest Rihanna wore a Balmain outfit to a fragrance launch in Paris just a few days after it was first shown on the catwalk. Photograph: David Fisher/Rex/Shutterstock\n\nRousteing has sufficient star quality not just to get his clothes in paparazzi photographs, but to be in the frame himself. There is a striking photograph of Beyoncé from this year’s Met Ball after party, in which she is lounging on a velvet sofa, gazing at Rousteing next to her, who is talking and gesticulating, feet pulled up on the sofa as if he owns the place. Rousteing wants to be the face of Balmain, because that is “a positive message”, he says. He spent the first year of his life in an orphanage before being adopted by a middle-class white couple, who brought him up in Bordeaux. “Diverse is a word that is really important to me,” he says. “I want to show that no matter your background, no matter what colour you are, where you come from, you can feel part of Balmain.” He is a committed activist for diversity in fashion, consistently casting a range of ethnicities for his catwalks and ad campaigns, and appearing on Newsnight and CNN to challenge the fashion industry’s lack of diversity.\n\nRousteing began his career in Italy, where he spent five years at Roberto Cavalli before moving back to France. For two years, he worked closely with Decarnin, adored by the French Vogue in-crowd for his haute-grunge aesthetic of insanely expensive ripped jeans, before stepping up to replace him in 2011 at the age of just 24. Between 2013 and 2015 revenue grew by 50% – but this tells only half the story. Balmain’s new celebrity firepower brought it a vast slice of the fashion bandwidth, and this new status as an industry headliner brought about the collaboration with H&M last year, which made the brand a household name. In June this year, Mayhoola, the Qatari private investment company that owns Valentino, announced the acquisition of Balmain, with a view to growing the brand.\n\nFacebook Twitter Pinterest Rousteing has recreated Balmain’s aesthetic: under his leadership it is tight, leggy and bright. Photograph: Jason Lloyd-Evans/The Guardian\n\nRousteing was closely involved in sealing the deal. “I met them right at the start, and we clicked. They understand the depth in my work. They get that I have success because I work hard.” To paraphrase Melanie Griffiths in Working Girl, Rousteing has a head for business and a bod for Instagram. “The point of my Instagram is to show the beauty of my life. I want to inspire people. Obviously, I’m not going to post a picture of me where I don’t feel like I am pretty, and I am not going to post a picture of my collection before it is ready. But everything is real. I can post a picture of a flower, of my grandma at Christmas.” The bio on his Instagram reads, “THIS IS MY REALITY”. To be fair, it is probably quite hard to take a bad photo of someone who looks like Rousteing.\n\nHe works at this. “I go to the gym every morning at 7.30. I work out, I box, and then I go to work for about 10am. I work late, so I eat in the office in the evening. And then I want to go to sleep, because I will be up early at the gym. I might go out Friday or Saturday, but not both.” He was working late in his office on the Friday evening in November last year when news broke of the terrorist attacks that killed more than 130 people. Rousteing’s apartment, like many of his colleagues’, is in the 11th arrondissement, close to where the attacks took place, so they slept in the office. That weekend, he stayed in a hotel. “I don’t have anyone in my life in Paris,” he told Vogue. “My assistants and colleagues went to their boyfriend’s or girlfriend’s or parents’ – I don’t have that here.”\n\nRousteing does have a support network, but it is a meta, international one. “When I post on Instagram about Justin [Bieber] or Lewis [Hamilton] or Kim or Rihanna, that’s a real friendship I am showing. If I love your album, I’ll post about your music. But also, we can call each other at 5am when we just need to talk.”\n\nHis connection to the Kardashians came through West, whom he first had lunch with seven years ago. These days, he is very close with Kris Jenner (“I am always with Kris”) and devoted to Kim. “I don’t care what anybody says about Kim. I love her. I love that she is a woman but has more power than so many men. And I love that she is so powerful but always takes care of the people she loves. And I admire her, because she is the best in the world at communicating with people.” Like it or not, Kim makes people want what she has. It’s a gift her friend Rousteing also has. Balmain’s global presence is only going to grow as the house’s new owners add their financial clout to the cultural pull of the Balmain army. “Fashion is a business. If you have a job in fashion, you have that job because people want fashion – and they want my fashion. You can dislike my taste, but you can’t say I’m not relevant.”", "images": ["https://i.guim.co.uk/img/uploads/2019/05/20/Jess_Cartner-Morley,_L.png?width=300&quality=85&auto=format&fit=max&s=83e14d6ea08e266b435fb3b9114f1828", "https://i.guim.co.uk/img/media/ca3fe1c030ebd1e618944b35b4e401ae2b0e6c78/0_0_2550_3000/master/2550.jpg?width=300&quality=85&auto=format&fit=max&s=89deafd4c75ba28c4bcdded826d99b95", "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/8075.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4fab207885fef2f5801e38b340034c8a", "https://i.guim.co.uk/img/media/8d4ccb93a94e5753cbf81c70afe27a337637fb58/0_0_3000_2001/master/3000.jpg?width=300&quality=85&auto=format&fit=max&s=3aa57aecbf823ee5c4041a4b003e9b94", "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/master/8075.jpg?width=300&quality=85&auto=format&fit=max&s=923ee371a223813fd856c19da7ceff82", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/e6ec0c4dad176647d029ad22c698c9f09f3de888/0_855_3280_3908/master/3280.jpg?width=300&quality=85&auto=format&fit=max&s=89c8dc383f6ff71c6ecd326ba0841294", "https://i.guim.co.uk/img/media/1fec7a7a49e77a5a2e7894ade6533b3809b23b6d/0_0_3016_4642/master/3016.jpg?width=300&quality=85&auto=format&fit=max&s=305079e231cf23dce4527c6c935904c7", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Fashion%2CCelebrity%2CLife+and+style%2CWomen%27s+dresses%2CKendall+Jenner"], "top_img": "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/8075.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4fab207885fef2f5801e38b340034c8a", "keywords": [], "authors": ["Jess Cartner-Morley"], "canonical_link": "https://www.theguardian.com/fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army", "title": "Olivier Rousteing on Rihanna, Kim Kardashian and the Balmain army", "meta_data": {"description": "With his model good looks, celebrity friends and Instagram fame, Olivier Rousteing is not your traditional fashion designer. But his brand of bling has made Balmain a household name, so who cares about tradition?", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Jess Cartner-Morley", "thumbnail": "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/8075.jpg?width=620&quality=85&auto=format&fit=max&s=6c4b212a524f8f334df24a76de199765", "keywords": "Fashion,Celebrity,Life and style,Women's dresses,Kendall Jenner", "news_keywords": "Fashion,Celebrity,Life and style,Women's dresses,Kendall Jenner", "og": {"url": "http://www.theguardian.com/fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army", "image": "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/8075.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4fab207885fef2f5801e38b340034c8a", "description": "With his model good looks, celebrity friends and Instagram fame, Olivier Rousteing is not your traditional fashion designer. But his brand of bling has made Balmain a household name, so who cares about tradition?", "type": "article", "title": "Olivier Rousteing on Rihanna, Kim Kardashian and the Balmain army", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/jesscartnermorley", "publisher": "https://www.facebook.com/theguardian", "section": "Fashion", "published_time": "2016-09-15T19:01:51.000Z", "tag": "Fashion,Celebrity,Life and style,Women's dresses,Kendall Jenner", "modified_time": "2018-07-02T13:56:16.000Z"}, "al": {"ios": {"url": "gnmguardian://fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army", "iphone": "gnmguardian://fashion/2016/sep/15/olivier-rousteing-on-rihanna-kim-kardashian-and-the-balmain-army?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/326de5a1b7759ce807d812bc8c1bd2810945e8dc/613_947_8075_4845/8075.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=e1c16d6490176b2a8cf60b4fd4889394", "site": "@guardian", "card": "summary_large_image", "creator": "@JessC_M", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1473868800.0, "source": "https://www.theguardian.com", "summary": ""}