{"url": "https://en.wikipedia.org/wiki/Nancy_Juvonen", "text": "Nancy Juvonen (born May 18, 1967) is an American film producer.[1] She and Drew Barrymore own the production company Flower Films.\n\nCareer [ edit ]\n\nJuvonen was born in Connecticut. Juvonen, who is of Finnish descent,[2][3] is the daughter of aviation industry executive William H. Juvonen, a Stanford University alumnus and former Marine Aviator.[4] In September 1961, while flying a gunnery mission as a new aviator undergoing fleet replacement pilot training in VMF 334, he experienced a wing failure at the fold joint and ejected from his F-8C Crusader jet.[5] William Juvonen later became an aviation executive before his death in 2018.\n\nJuvonen graduated from the University of Southern California with a degree in sociology and cooperative education.[6] After graduating, she worked odd jobs, including at a dude ranch in Wyoming, as a private flight attendant, and for an artist who was trying to eradicate homelessness. She later became an assistant to Clarence Clemons, a member of the E Street Band.[7][8]\n\nIn 1993, Juvonen met Drew Barrymore through her brother Jim, a writer and producer who was working on the set of Mad Love.[1] The two subsequently founded Flower Films.[9]\n\nPersonal life [ edit ]\n\nJuvonen married comedian Jimmy Fallon, host of The Tonight Show, on December 22, 2007.[10] After meeting on the set of Saturday Night Live[11], Nancy and Jimmy began dating in May 2007 after Drew Barrymore invited Fallon to a birthday party she threw for Nancy. A few months later in August 2007 Fallon proposed on the dock at sunset with a Neil Lane designed engagement ring at Nancy's family home in Wolfeboro on Lake Winnipesaukee in New Hampshire. They were married four months later.[12] They have two daughters: Winnie Rose, born in 2013, and Frances Cole, born in 2014. Both were born via gestational surrogacy.[13][14][15][16]\n\nFilmography [ edit ]\n\nAs producer\n\nAs actress\n\n2001 – Donnie Darko", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nancy_Juvonen", "title": "Nancy Juvonen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}