{"url": "https://en.wikipedia.org/wiki/Lecy_Goranson", "text": "American actress\n\nAlicia Linda \"Lecy\" Goranson ( ; born June 22, 1974) is an American actress. She plays Becky Conner in the television sitcoms Roseanne, which debuted in 1988, and The Conners.[1] She has also had supporting roles in the films How to Make an American Quilt (1996), Boys Don't Cry (1999), and The Extra Man (2010).\n\nCareer [ edit ]\n\nRoseanne [ edit ]\n\nGoranson studied acting in Chicago and subsequently landed the role of Becky Conner. It was only the second time she ever auditioned for any part. She played the character for five seasons, exiting the series in 1992, several episodes into the fifth season, to attend Vassar College.[2] Her academic schedule allowed her to continue appearing part-time as Becky. Under her new arrangement, the show's producers and writers wrote scenes for Becky sparingly. Goranson's exit resulted in Becky's eloping with her boyfriend Mark.\n\nDuring the following season, the producers wanted to bring the character. Goranson was still unavailable, so Sarah Chalke auditioned and won the role.[3]\n\nChalke played Becky for the remainder of the sixth season and all of the seventh season. When the show reached its eighth season, Goranson was able to play Becky again while still attending college, replacing Chalke. Goranson appeared in the show's eighth season, but by mid-season she had scheduling conflicts with school again. On two occasions Goranson had to pull out of episodes in which the Becky character was necessary: Darlene's wedding and a family trip to Walt Disney World. Chalke played Becky for these episodes. Toward the season's end, Goranson returned to play Becky. When the series was renewed for a ninth season, Goranson, who was still in school, declined to continue in the role in order not to cause scheduling conflicts. Chalke returned for the ninth and final season.\n\nThe appearances by Goranson vs. Chalke became a running gag. Goranson's first re-appearance was marked with a, \"Where the hell have you been?\" comment from several cast members while in character. Similarly, Chalke's sporadic appearances during Season 8 would be played for humor with an, \"Aren't you glad you're here this week?\" remark from Roseanne. There was even a glimpse into the future where a grown-up and somewhat catatonic DJ, played by John Goodman instead of Michael Fishman, repeatedly uttered to a psychiatrist (referring to Becky), \"They say she's the same, but she isn't the same\". One episode ended with both actresses mimicking each other's movements.\n\nPost-Roseanne [ edit ]\n\nAfter the initial run of Roseanne, Goranson had several small roles in films and has guest starred in Law & Order: Special Victims Unit, Sex and the City, Damages and Fringe. In her post-Roseanne film roles, she is normally credited as Alicia rather than Lecy Goranson. She played the part of Sandra in The Extra Man which opened in limited release on July 30, 2010. She is currently living in Brooklyn, New York.\n\nRoseanne revival and The Conners [ edit ]\n\nOn April 28, 2017 it was announced that a revival of Roseanne was in the works with most of the original cast and some of the original producers slated to return.[4] In May 2017, it was confirmed that Goranson would be returning in the role of Becky. Chalke would also appear, playing a different role. The revival of Roseanne premiered on March 27, 2018 on ABC. [5][6][7] On May 29, 2018, in the wake of controversial remarks made by Roseanne Barr on Twitter regarding Valerie Jarrett (an advisor of former president Barack Obama), ABC cancelled the revival after a single season.[8][9][10]\n\nOn June 21, 2018, ABC announced a spin-off from Roseanne, entitled The Conners, with all the original cast of Roseanne to return, except for Barr herself.[11] The new show premiered on October 16, 2018.\n\nPersonal life [ edit ]\n\nGoranson is the daughter of Stephen Goranson, an official who works for the Environmental Protection Agency, and Linda Goranson, an English teacher at Evanston Township High School. She has an older brother named Adam.[12]\n\nFilmography [ edit ]\n\nAwards and nominations [ edit ]\n\nTV Land Award\n\n2008: Won, \"Innovator Award\" – Roseanne\n\nYoung Artist Award\n\n1989: Nominated, \"Best Young Actress in a Supporting Role in a Television Series\" – Roseanne\n\n1990: Nominated, \"Best Young Actress in a Supporting Role in a Television Series\" – Roseanne", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Lecy_Goranson_as_Roz_Chapman_on_Dale_Radio.jpg/220px-Lecy_Goranson_as_Roz_Chapman_on_Dale_Radio.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/8/84/Lecy_Goranson_as_Roz_Chapman_on_Dale_Radio.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/84/Lecy_Goranson_as_Roz_Chapman_on_Dale_Radio.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lecy_Goranson", "title": "Lecy Goranson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/84/Lecy_Goranson_as_Roz_Chapman_on_Dale_Radio.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}