{"url": "https://tv.avclub.com/grab-a-golden-shovel-and-dig-through-part-5-of-twin-pea-1798288243", "text": "Russ Tamblyn (Photo: Suzanne Tenner/Showtime)\n\nLast night, in a moment of great TV serendipity, the finale of The Leftovers unspooled on HBO while the fifth chapter of the new Twin Peaks played out on Showtime. The Leftovers was the type of show that always kept me guessing, and not just as to the true nature of the Sudden Departure. With each passing episode, I could never be sure what I’d be getting from the show, whom I’d be spending time with, or where we’d be. It’s a quality that’s been jam-packed into the last three Sundays, when the aforementioned shows, plus American Gods, have all aired new episodes during the nine-o’clock hour. The original Twin Peaks cracked the door for this type of storytelling on TV, and The Leftovers kept that door open for the Peaks revival. It’s a cycle I feel the creators of both shows would appreciate—anybody else catch the Black Lodge vibes during the situation room scenes of “The Most Powerful Man In The World (And His Identical Twin Brother)”?—where Twin Peaks is now both influence on and successor to The Leftovers.\n\nAdvertisement\n\nGIF: Twin Peaks, “The Return, Part 5”\n\nThe cosmic ballet… goes on: One show takes an elegant bow by letting the mystery be (though I choose to believe Nora); the other forges ahead by deepening its mystery. “The Return, Part 5” is a feast for anyone who treats their TV shows like puzzles to be solved, a modern phenomenon we can attribute as much to David Lynch and Mark Frost as we can Leftovers and Lost boss Damon Lindelof. From Constance’s autopsy in this episode, we learn that the headless corpse from Ruth Davenport’s apartment had Dougie’s wedding band inside its stomach—which is not the ring we saw slide off Dougie’s hand when he turned into an otherworldly BB in the Red Room. [UPDATE: The original draft of this article conflated Dougie’s wedding band with The Owl Cave ring.] Does that mean the corpse is the body of the real Dougie? And if that’s the case, does that mean there was a fourth party targeting our ill-fated insurance agent, in addition to Doppel-Cooper, the hoods who booby-trapped his car, and the other hoods who tripped the explosives? And if that’s the case, whoever these people are, they keep creating new Lynchian tableaux of horror within the banal: first the scene in Ruth’s bed and then this shot of the neighborhood kid running home, past a single, noticeable shot of flaming wreckage.\n\nAdvertisement\n\nIt’s hard to tell if that chunk of car (or whatever) wound up in the frame on purpose or by accident. As Emily L. Stephens reminds us in her latest review, one of Twin Peaks’ signature images—Bob in the mirror behind a screaming Sarah Palmer—was a happy accident, so I have to wonder about the creators intentionally sticking any clues to their mystery in the background. In fact, as much as there is to pick apart in “Part 5,” I think it thumbs its nose at the people watching the show as amateur sleuths. If you were looking for deeper meaning in Dr. Jacoby’s golden shovels, you might be disappointed to find out they’re an Alex Jones-style scam meant for the proper digging and depositing of excrement. And if you’re tracking any of the numbers that keep popping into frame, you’ll be similarly frustrated by “Part 5.” The episode begins with the message to the black box in Buenos Aires, Argentina (containing the numbers “159” and “2”), introduces the fact that Dougie worked for the Lucky 7 Insurance Company, then puts a big ol’ “$8.95” behind Shelly and Norma while Becky (Amanda Seyfried) counts her $72. But if you’re looking to unravel some sort of cipher from within the episode, you’re also going to run smack dab into the numerals from the “Order Now” screen in Dr. Amp’s Gold Shit-Digging Shovel commercial, and then the clock next to the elevator that Dougie’s co-workers shove Coop out of.\n\nYou think you’ve found your way through the maze, but then Twin Peaks throws up a bunch of dead ends. None of which is to say that there’s a right way and a wrong way to watch this, or any other show of its kind. But if you’re going to dig your way through Twin Peaks, your shovel better be prepared for more than shit.\n\nAdvertisement\n\n[Erik Adams]\n\nErik, it seems clear that anyone watching this show and thinking they’re going to crack some key part of the mystery by studying the numbers is doomed to a fate akin to that of Jim Carrey in The Number 23, and given that he became a tortured saxophone man, I wouldn’t recommend that particular rabbit hole. I don’t think it’s the show thumbing its nose at would-be detectives—Lynch isn’t terribly interested in trolling his audience, I suspect—so much as demonstrating a fascination with the search for meaning. So many of his characters and stories are about the desperate quest to make sense of the unknowable, and attempts to wring significance from even the most arbitrary of symbols (another way the pairing with The Leftovers that you cite is so apt), something like numbers continually appearing and seeming to possess additional weight, just feels like Lynch being Lynch.\n\nAdvertisement\n\nHarry Goaz (left) and Michael Horse (Photo: Suzanne Tenner/Showtime)\n\nWhat’s becoming increasingly interesting is just how distant the happenings within the actual namesake town seem to be from the greater mystery of Dougie Jones, Dale Cooper, and the other country-spanning mysteries. (Now expanded to continents, with the appearance of Buenos Aires—the same place David Bowie’s FBI agent Phillip Jeffries vanished, according to Fire Walk With Me.) With each passing week, it seems clearer that revisiting his fictional town is mostly a way for Lynch to do a bunch of weird stuff he’s had rolling around in his head; and tying it back to his original cast of characters and their attendant stories is only important insofar as it can let him do these other things. Bobby, Andy and Lucy, Shelly and Norma, James, the Horne brothers, and Dr. Jacoby’s conspiracy-theory radio shtick seem to be happening in another world, no matter how much Hawk’s heritage may have something to do with Cooper’s situation. I’ve no doubt they’ll eventually come together in some manner, but I’m more and more convinced it likely won’t be in a way that isn’t as arbitrary and inexplicable as not-Dougie’s strange connection to that statue outside his office.\n\nAdvertisement\n\nSpeaking of strange connections, I’m also not convinced these stories are all happening at the same time. There’s nothing to suggest temporal shifts aren’t happening along with the geographical ones, and while some of these narratives are clearly unfolding simultaneously, there’s also evidence others may not be. From the way that Matthew Lillard’s suspected murderer experienced the real killing as a dream unspooling at a different hour to the way the various gangs tracking Dougie seem to mirror one another, there are ways this show is playing with time that imply Cooper’s journey to the stutter-stop room floating in a box in space isn’t the only instance of non-linear continuity we’re seeing. It may have been 25 years here on Earth, but who knows how long Cooper felt his time in the Black Lodge lasted; it’s not quite time as a flat circle, but it does feel like an M.C. Escher drawing now and then.\n\n[Alex McLevy]\n\nOne of the biggest questions I had going into a new season of Twin Peaks was how the show would fare against the instant scrutiny of the recap age—whether the ambiguity that made the original series so memorable could withstand so many knee-jerk Twitter reactions and morning-after analyses, all pulling at its myriad threads. Five episodes in, I think we’re already learning how: Lynch and Frost will just keep introducing newer, knottier threads to the larger tangle, all of which may or may not end up connected when this is over. Right now, it’s hard to divine just how the War of the Coopers is tied to the murder of Ruth Davenport, to Hawk’s reopening of the Laura Palmer case, to the mysterious reappearance of Major Briggs’ fingerprints on Ruth’s corpse, to Jim Belushi’s crime syndicate guy, to Amanda Seyfried’s Laura Palmer-esque relationship troubles, to Dr. Jacoby’s paranoiac libertarian act, to the cigarette-smoking scumbag who threatened to rape Jane Levy’s friend in The Bang Bang, etc. Certainly there are thematic parallels here to characters and events from the original series—most notably Lynch’s usual motifs of duality and innocence corrupted. But look, we’re not even a third of the way through the season, and already these roundtables have pretty much devolved into a litany of disconnected details that we’re struggling to compile and make sense of, followed by reminders to each other not to do that.\n\nAdvertisement\n\nI’m fine with that elliptical nature—I wouldn’t be a Twin Peaks fan if I weren’t—though I will say that this episode was the first time I started to get just a little frustrated by the sprawl. Dougie/Cooper being as-yet-inexplicably targeted by two rival gangs and Belushi’s casino boss now (turning what seemed to be a comic tangent into yet another plot thread) feels like plot overkill at this early point—particularly with the whole hinted-at subplot of the kid and his junkie mom across the street, particularly when there are so many other, more uniquely compelling dramas at hand. Similarly, while I’ve enjoyed Kyle MacLachlan’s dual performance, and it was fun to see Lynch try his hand at some workplace comedy, I’m hoping that the next episode finally sees Cooper making bigger inroads toward awakening from his extraterrestrial catatonia, beyond just remembering that he likes coffee, gazing meaningfully at gunslinging heroes, and perking up at the words “agent” and “case files.”\n\nAmanda Seyfried (left) and Caleb Landry Jones (Photo: Suzanne Tenner/Showtime)\n\nAdvertisement\n\nThat said, there were, as always, some incredible individual moments in here: Cooper looking in the mirror as his face warps into Bob; the whole sequence of Seyfried’s Becky, high on love and cocaine, gazing rapturously into the sunlight; the enigma of the magic shrinking Buenos Aires box and “Mr. Strawberry.” With scenes like this, even as Twin Peaks defiantly resists being broken down and speculated upon, it’s still an alluring sort of frustration it creates—and this season in particular feels like one of the purest distillations yet of Lynch’s aim to create cinema that replicates the feeling of dreaming. So the best we can do here is try to capture and record those moments like a dream journal, resist the urge to apply waking logic to them, and recognize that whatever we think we understand about them is probably going to be proven wrong.\n\nExcept that creepy kid at the bar is named “Richard Horne” in the credits, so he’s probably Audrey’s son who she had with Evil Cooper, right? Right?\n\nAdvertisement\n\n[Sean O'Neal]\n\n“Damn good joe, huh, Dougie?” After the uncompromising first four episodes, this hour felt similar to the rhythms (if not the accessibility) of classic, soap-operatic Twin Peaks. A couple of months ago, we did an AVQ&A on TV series where the protagonist is also the most interesting character, on which Erik rightly singled out Dale Cooper. For all the kooks and weirdoes who populate the Peaks­-verse, none of them can match the purity with which the series characterizes Cooper, and there’s something touching about the way the revival both subverts his straight-arrow personality (via the long-haired Doppel-Cooper) and embraces it. As the lime-green-jacketed Dougie Jones, the de-Lodged Dale Cooper guzzles coffee (MacLachlan’s bit with the cup in the elevator is a great piece of small-scale physical comedy) and lights up not only at the words “agent” and “case file,” but also “coffee”—the most recognizable traits of Dale Cooper are also apparently the deepest parts of his subconscious.\n\nAdvertisement\n\nScreenshot: Twin Peaks, “The Return, Part 5”\n\nWhat I can’t help but note is that Cooper-as-Dougie Jones reminded me visually of Ronald Reagan. Lynch’s politics are rarely talked about in discussions of his art, but he was a Reaganite in the 1980s who has since drifted to the left. (He supported Bernie Sanders in last year’s election.) And this episode—though it continues the impenetrable, ever-expanding nightmare logic of the revival—is about as close as he’s come to out-and-out political satire. The bit with Dr. Jacoby and the gold shovels (“Dig yourself out of the shit. $29.99!”) struck me as a more succinct and cogent caricature of Trumpism than all those overextended, trying Saturday Night Live bits put together. And there is, of course, more than a touch of social (and perhaps also political) satire in the way Dougie Cooper blends into his workplace at the insurance office despite his lobotomized behavior. Which is to say that, while part of the beauty of Twin Peaks is how it creates its own world, we can often forget that it’s still addressed at the real one.\n\nAdvertisement\n\nAnd how great is that long, silent-movie-starlet close-up of Seyfried blissfully leaning back in the convertible to the sound of the Paris Sisters’ “I Love How You Love Me?”\n\n[Ignatiy Vishnevetsky]", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yoljzhtnahxe1bfmadtn.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yoljzhtnahxe1bfmadtn.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/grab-a-golden-shovel-and-dig-through-part-5-of-twin-pea-1798288243", "title": "Grab a golden shovel and dig through part 5 of Twin Peaks", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "TV, Twin Peaks, Roundtable, TV Club", "news_keywords": "TV, Twin Peaks, Roundtable, TV Club", "twitter": {"url": "https://tv.avclub.com/grab-a-golden-shovel-and-dig-through-part-5-of-twin-pea-1798288243", "card": "summary_large_image", "site": "AVTVClub", "title": "Grab a golden shovel and dig through part 5 of Twin Peaks", "description": "Last night, in a moment of great TV serendipity, the finale of The Leftovers unspooled on HBO while the fifth chapter of the new Twin Peaks played out on Showtime. The Leftovers was the type of show that always kept me guessing, and not just as to the true nature of the Sudden Departure. With each passing episode, I could never be sure what I’d be getting from the show, whom I’d be spending time with, or where we’d be. It’s a quality that’s been jam-packed into the last three Sundays, when the aforementioned shows, plus American Gods, have all aired new episodes during the nine-o’clock hour. The original Twin Peaks cracked the door for this type of storytelling on TV, and The Leftovers kept that door open for the Peaks revival. It’s a cycle I feel the creators of both shows would appreciate—anybody else catch the Black Lodge vibes during the situation room scenes of “The Most Powerful Man In The World (And His Identical Twin Brother)”?—where Twin Peaks is now both influence on and successor to The Leftovers.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yoljzhtnahxe1bfmadtn.jpg"}, "description": "Last night, in a moment of great TV serendipity, the finale of The Leftovers unspooled on HBO while the fifth chapter of the new Twin Peaks played out on Showtime. The Leftovers was the type of show that always kept me guessing, and not just as to the true nature of the Sudden Departure. With each passing episode, I could never be sure what I’d be getting from the show, whom I’d be spending time with, or where we’d be. It’s a quality that’s been jam-packed into the last three Sundays, when the aforementioned shows, plus American Gods, have all aired new episodes during the nine-o’clock hour. The original Twin Peaks cracked the door for this type of storytelling on TV, and The Leftovers kept that door open for the Peaks revival. It’s a cycle I feel the creators of both shows would appreciate—anybody else catch the Black Lodge vibes during the situation room scenes of “The Most Powerful Man In The World (And His Identical Twin Brother)”?—where Twin Peaks is now both influence on and successor to The Leftovers.", "og": {"title": "Grab a golden shovel and dig through part 5 of Twin Peaks", "type": "article", "url": "https://tv.avclub.com/grab-a-golden-shovel-and-dig-through-part-5-of-twin-pea-1798288243", "description": "Last night, in a moment of great TV serendipity, the finale of The Leftovers unspooled on HBO while the fifth chapter of the new Twin Peaks played out on Showtime. The Leftovers was the type of show that always kept me guessing, and not just as to the true nature of the Sudden Departure. With each passing episode, I could never be sure what I’d be getting from the show, whom I’d be spending time with, or where we’d be. It’s a quality that’s been jam-packed into the last three Sundays, when the aforementioned shows, plus American Gods, have all aired new episodes during the nine-o’clock hour. The original Twin Peaks cracked the door for this type of storytelling on TV, and The Leftovers kept that door open for the Peaks revival. It’s a cycle I feel the creators of both shows would appreciate—anybody else catch the Black Lodge vibes during the situation room scenes of “The Most Powerful Man In The World (And His Identical Twin Brother)”?—where Twin Peaks is now both influence on and successor to The Leftovers.", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yoljzhtnahxe1bfmadtn.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}