{"url": "https://en.wikipedia.org/wiki/Quinn_Perkins", "text": "Character on American television series Scandal\n\nQuinn Perkins, formerly Lindsay Dwyer, is a fictional character portrayed by Katie Lowes and created by Shonda Rhimes for the political drama television series Scandal. At the beginning of the series, she is recruited to work for Olivia Pope in the Washington, D.C.-based crisis management-firm, Olivia Pope & Associates (OPA), that specializes in \"fixing\" political situations and scandals.[1]\n\nBackground [ edit ]\n\nShe lived in California under the name Lindsay Dwyer, with her mom and dad, Ray Dwyer, where she graduated from Stanford Law School. Her boyfriend, Jesse Tyler, was a computer programmer for the company Cytron. Lindsay received a text-message which she believed was from a colleague at Jesse's work who wanted to contact him. Lindsay broke up with Jesse just before he and six other co-workers at Cytron were killed in an explosion which Lindsay was framed for. She was drugged, kidnapped and taken to Washington D.C. where she was given a new identity as Quinn Perkins.\n\nShe joined a law firm in D.C. called O'Malley & Lee under her assumed identity. She was then called in to an interview by Harrison Wright to which she was hired to work at Olivia Pope & Associates.[2]\n\nStorylines [ edit ]\n\nSeason 1 [ edit ]\n\nQuinn gets a job at Olivia Pope & Associates after an interview with Harrison Wright, who she believed was a blind date. She is tasked by Olivia to watch Amanda Tanner at the hospital after Amanda tries to commit suicide.[3] As Olivia hires Amanda as her client, Quinn is the only one in the office allowed to help her with the case. She begins to form a relationship with a news-reporter Gideon Wallace after trying to find out what he knows about Amanda Tanner. Quinn begins to learn how the law-firm works and forms a friendship with Huck, the tech guy at the firm.\n\nQuinn and Gideon's relationship begins to evolve and they agree to be together as long as Gideon doesn't ask questions about Amanda Tanner. When Gideon figures out the truth about Amanda and President Grant's alleged affair, he confronts Billy Chambers, who is revealed to have slept with Amanda. Chambers attacks Gideon and stabs him in the neck with scissors, ultimately killing him.[4] When Quinn discovers the body, she calls Olivia, who decides to clean up the crime scene. Later, when Quinn is taken to the police station, David Rosen runs her fingerprints and discovers her past life as Lindsay Dwyer. He then confronts Olivia about going to the police to reveal Quinn's real identity.[5]\n\nSeason 2 [ edit ]\n\nAfter spending six months in jail awaiting trial, Quinn is prosecuted in federal court for the Cytron explosion, which led to the deaths of her ex-boyfriend Jesse Tyler and six other co-workers. People have begun calling her \"The Molotov Mistress\". David Rosen is the prosecutor of the case and asks for the death penalty. However, Olivia contacts Supreme Court Justice Verna Thornton, who managed to get the judge to agree upon a judgment of acquittal and Quinn goes free.[6] After getting released from jail, Quinn struggles to earn respect from her co-workers, as they treat her differently due to the fact she lied to them about her past life.\n\nSeason 3 [ edit ]\n\nAfter torturing Billy Chambers, Huck begins to distance himself from her. When on a case for Congresswoman Josie Marcus, Quinn buys herself a gun and begins to practice at the shooting range with a little help from Charlie.[7] Wanting to get adrenaline, Quinn joins Charlie on one of his B613-assignments where she is tricked by Charlie into killing a security guard who was an important part of an investigation being conducted by Olivia and the team.[8] Charlie uses this to blackmail her into joining B613. While searching through security footage Huck finds out that Quinn was responsible for the security guard's death and starts to torture her by pulling out her teeth for betraying Olivia. When she comes back to the office, she learns that Huck doesn't regret his actions, which leads her to leave Pope & Associates.[9]\n\nQuinn and Charlie's relationship begins to evolve as they are hired by Cyrus to help clean up the crime scene where Daniel Douglas was murdered. Olivia tries to convince Quinn to come back to the firm, but Quinn refuses. Jake, now the new Command of B613, is hesitated to let Quinn work at the organization.[10] Huck begins to visit her to try and convince her to come back, but Quinn refuses. She expresses her anger towards Huck for torturing her, and they end up kissing. Charlie begins to be concerned about Huck's behavior towards Quinn. She must confront her former colleagues when she and Charlie are called into Pope & Associates by Jake to help Olivia and her team to find Maya Pope. Quinn is caught in the middle when Huck and Charlie disagree on the way of locating Dominic Bell. Quinn and Huck end up kissing and having sex at the parking garage outside Pope & Associates, which leads Maya to walk past them and stab Rowan.[11] Abby and Harrison catch them having sex at the office, which shocks them. After Quinn broke up with Charlie, he gives her an envelope which contains information about Huck's former family. When she tries to give Huck the information, he becomes furious at her and terminates their relationship.[12]\n\nSeason 4 [ edit ]\n\nQuinn continues to run OPA after Olivia leaves with Jake, and tries to track her down. She has also kept in touch with Abby and Huck everyday in the two months Olivia was gone. Quinn finally manages to track Olivia down and sends her an envelope with information about Harrison's death. This prompts Olivia to return to Washington D.C.\n\nQuinn struggles with Huck as he is angry with her for finding out about his family and his feelings towards her. Jake asks Quinn for help in his investigation concerning Jerry and Harrison's death. Jake asks her to talk to Charlie and she agrees. Catherine Winslow, a former colleague of Olivia and Abby, asks OPA for help and Quinn begins to investigate the case as Catherine's daughter is killed. Quinn confronts Catherine's husband, but he shoots himself right in front of Quinn. Quinn then finds an envelope containing pictures of Olivia which she discusses with Huck.\n\nAt a stakeout spying on Kubiak, Quinn follows him to where Huck is spying on Elizabeth North. She discover that Kubiak, Elizabeth and Vice President Andrew Nichols are working together. She later figures out that the goal is to start a war between the U.S. and West-Angola by kidnapping Olivia and force Fitz to declare a war. When Olivia is kidnapped, Quinn, Huck and Jake team up to find her. They figure out her location in Pennsylvania, but the kidnappers had already left before they arrive. They try to bid on the auction of Olivia on the black market, but lose. Quinn becomes terrified when Huck starts talking about what the buyers will do to Olivia to make Fitz obey. She confronts him about it, admitting that she needs him to make herself feel okay.\n\nRelationships [ edit ]\n\nHuck [ edit ]\n\nHuck is the first person Quinn begins to form a friendship with at Olivia Pope & Associates. Throughout the first season Huck helps her around the firm. After her release from jail for the Cytron-explosion, Huck isn't angry at her, unlike the rest of the people at Pope & Associates. However, Quinn begins to become suspicious about her kidnapping and starts to suspect Huck for being the one who drugged her. She also attends several AA-meetings where Huck talks about his addiction to whiskey. However, Quinn realizes that he is actually talking about his addiction to torturing people and he merely passes it off as \"drinking whiskey\".\n\nQuinn becomes suspicious of Becky, Huck's new girlfriend, who he'd met at an AA-meeting, and tries to warn Huck about her. She starts to find information regarding her own kidnapping and she asks Huck questions about how to kidnap someone. She later accuses him for kidnapping her, which later turns out to be true, at the orders of Olivia. When they discover that Hollis Doyle hired Becky to kill Quinn's former boyfriend Jesse, Quinn tries to hire Huck to kill him. Huck agrees, but only if she leaves after he has completed the request, but Quinn ends up deciding to call off the murder of Hollis Doyle. Huck begins to teach Quinn his methods, trying to make her his protégé. He teaches her how to be a spy and investigate. Quinn learns quickly. When Huck is captured by Charlie and put in a box, Quinn manages to rescue him. Afterwards, Huck suffers from PTSD and she tells him that he helped her move forward with her life. At the end of the second season, Quinn takes over for Huck in the torturing Billy Chambers when Huck freezes, which affects their friendship.\n\nHuck starts to shut Quinn out after she tortured Billy Chambers and he realizes how much she has changed. Quinn starts to hang out with Charlie, much to Huck's displeasure. When Huck finds out that Quinn killed a security guard, who was crucial for the firm's investigation, he tries to punish her by pulling out her teeth. When she comes back to the office, Huck says he doesn't regret his actions of torturing her, which makes Quinn leave OPA and join B613. Huck tries multiple times to get her back to Pope & Associates, but Quinn refuses, still feeling betrayed by Huck. When she and Charlie join Jake at the office for trying to help finding Maya Pope, Quinn and Huck becomes romantically involved. After she breaks up with Charlie, she is given an envelope containing information about Huck's former family which she tries to give to Huck, but he becomes furious with her.\n\nHuck later forgives her and they remain friends", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/32/Quinn_Perkins%2C_Scandal_season_4%2C_jan_2015.jpg/200px-Quinn_Perkins%2C_Scandal_season_4%2C_jan_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/3/32/Quinn_Perkins%2C_Scandal_season_4%2C_jan_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/42px-Ambox_current_red.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/32/Quinn_Perkins%2C_Scandal_season_4%2C_jan_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Quinn_Perkins", "title": "Quinn Perkins", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/3/32/Quinn_Perkins%2C_Scandal_season_4%2C_jan_2015.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}