{"url": "www.cheatsheet.com/entertainment/you-wont-believe-how-emma-stone-got-her-start-in-hollywood.html/", "text": "Emma Stone didn’t become one of America’s most sought-after actresses overnight. She’s worked her way up in Hollywood for years, and has the extensive resume to prove it.\n\nThese days, she’s enjoying the fruits of her labor, and it’s hard to imagine her as anything less than an A-lister. But it wasn’t that long ago that she was just another actress trying to catch a big break.\n\nAnd when she finally landed her first starring role, it was in a place many fans might not expect.\n\n1. Stone first started acting when she was a child\n\nShe’s come a long way since she first started acting. | Angela Weiss/AFP/Getty Images She’s come a long way since she first started acting. | Angela Weiss/AFP/Getty Images\n\nMost of us don’t think of Stone as a child actor. But she was — at least, in her hometown’s community theater. Stone started acting when she was just 4 years old. And throughout her childhood, she was active in the Phoenix Valley Youth Theater program.\n\nBut when she was a teenager, she was ready for something more. And she knew how to get what she wanted.\n\nNext: Stone used unconventional methods to convince her parents to let her be an actress.\n\n2. She had a huge ambition\n\nShe always knew she could make it in Hollywood. | Frederick M. Brown/Getty Images She always knew she could make it in Hollywood. | Frederick M. Brown/Getty Images\n\nBy the time she became a teenager, Stone had taken years of voice lessons and appeared in more than a dozen community productions. She knew she wanted to try her hand at acting professionally.\n\nBut she had to convince her parents to let her move from Scottsdale, Arizona to Los Angeles first. Stone created a PowerPoint presentation called “Project Hollywood.” The presentation was designed to show her parents, in detail, what pursuing her dreams would entail. And she proved that she knew how to achieve them.\n\nNext: Stone’s research paid off.\n\n3. Stone got off to a shaky start in Hollywood\n\nShe wasn’t a well-known face here in 2006. | Mark Mainz/Getty Images She wasn’t a well-known face here in 2006. | Mark Mainz/Getty Images\n\nAt 15 years old, Stone moved to Los Angeles to implement the plan. And she wasted no time in trying to find her big break.\n\nBut it took her some time to make any headway. “I went up for every single show on the Disney Channel,” she said. “And auditioned to play the daughter on every single sitcom. I ended up getting none.”\n\nNext: Stone’s non-stop auditioning yielded surprising results.\n\n4. She didn’t let the rejection get her down\n\nLike her La La Land character, Stone continued to pursue her dreams of stardom. | Summit Entertainment Like her La La Land character, Stone continued to pursue her dreams of stardom. | Summit Entertainment\n\nStone’s Hollywood project may not have gone to plan right away. But she didn’t let the litany of no’s deter her. Instead, she focused on her strengths — comedy and music — and kept auditioning. And within a few months, she found a path to fame, albeit through a slightly more unconventional route.\n\nBefore too long, she booked her television debut. She just had to jump through a few more hoops to get there.\n\nNext: Emma Stone, reality star?\n\n5. Stone’s TV debut wasn’t exactly what you’d expect for a future Oscar winner\n\nEmma Stone on In Search of the Partridge Family | VH1 Emma Stone on In Search of the Partridge Family | VH1\n\nIn 2004, VH1 rebooted the classic ‘70s musical sitcom, The Partridge Family. And to drum up interest in the new series, they televised a reality competition to cast a new generation of actors in the iconic roles.\n\nThe up-and-coming actress — then going by her given name, Emily Stone — made the cut as one of the final contestants vying for the role of Laurie on In Search of The Partridge Family. Over the course of several episodes, she performed in acting and singing competitions designed to test her performance mettle.\n\nShe was a standout from the beginning, whether she was nailing her lines in Partridge Family-style skits or belting out ‘90s alt-rock classics like “Bitch.” And in the end, she won the role.\n\nBut her apparent big break didn’t last as long as she may have imagined.\n\nNext: Stone’s star was on the rise – but for how long?\n\n6. Her “Come On Get Happy” days did not last long\n\nLittle did she know she was headed for the big screen soon enough. | Screen Gems Little did she know she was headed for the big screen soon enough. | Screen Gems\n\nThe New Partridge Family wasn’t a hit. In fact, it was barely a blip on the radar. Only one episode, the pilot, was produced. And it aired with little fanfare on VH1 in January 2005.\n\nStone has spoken about her time on the reality series on multiple occasions. She told Vogue that she went in just thinking of it as another gig. But after several weeks, she admits, she just “really, really” wanted to win.\n\nIf Stone was disappointed that the series didn’t end up helping her in Hollywood, she didn’t have to wait for long for another chance to breakthrough.\n\nNext: The end of the new Partridge Family was for the best.\n\n7. Stone’s career took off not too long after\n\nThe rest, as they say, is history. | Mark Ralston/AFP/Getty Images The rest, as they say, is history. | Mark Ralston/AFP/Getty Images\n\nSure, Stone didn’t become a TV sensation. But the fact that The New Partridge Family was a flop probably ended up helping her career in the long run.\n\nShe began booking guest-starring roles on series like Medium and The Suite Life of Zach & Cody. And in 2007, she got another big break with a scene-stealing role in Superbad. For Stone, the rest is history. These days, she has serious Hollywood clout and a stellar career.\n\nAnd she’s even been able to put her singing talents to good use on more than one occasion since her Partridge Family days. Like, you know, when she won the Oscar for La La Land.\n\nIn other words, Project Hollywood was a success — even if she had to take a detour or two.\n\nFollow Katherine Webb on Twitter @prufrox.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-57415758.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/01/Emma-Stone.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/emma-stone-the-new-partridge-family.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2015/01/Emma-Stone.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg", "https://www.cheatsheet.com/wp-content/uploads/2014/10/Easy-A-emma-stone-19919835-1280-688-640x343.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2015/06/rs-248320-emma-stone-ryan-goseling-la-la-land-sing-dance-trailer.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg", "keywords": [], "authors": ["Katherine Webb"], "canonical_link": "https://www.cheatsheet.com/entertainment/you-wont-believe-how-emma-stone-got-her-start-in-hollywood.html/", "title": "You Won’t Believe How Emma Stone Got Her Start in Hollywood", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/you-wont-believe-how-emma-stone-got-her-start-in-hollywood.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The Oscar-winning actress had a lot of crazy gigs before she hit it big. But her stint on a short-lived TV series is the most surprising of all.", "og": {"locale": "en_US", "type": "article", "title": "You Won't Believe How Emma Stone Got Her Start in Hollywood", "description": "The Oscar-winning actress had a lot of crazy gigs before she hit it big. But her stint on a short-lived TV series is the most surprising of all.", "url": "https://www.cheatsheet.com/entertainment/you-wont-believe-how-emma-stone-got-her-start-in-hollywood.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-03-11T20:33:05-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "reality TV", "section": "Entertainment", "published_time": "2018-03-11T20:33:00-04:00", "modified_time": "2018-03-11T20:33:05-04:00"}, "twitter": {"card": "summary_large_image", "description": "The Oscar-winning actress had a lot of crazy gigs before she hit it big. But her stint on a short-lived TV series is the most surprising of all.", "title": "You Won't Believe How Emma Stone Got Her Start in Hollywood", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/08/Emma-Stone-e1504131437124.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1520814780.0, "source": "http://www.cheatsheet.com", "summary": ""}