{"url": "www.cheatsheet.com/health-fitness/revealing-details-about-prince-william-prince-harrys-royal-feud-camilla.html/", "text": "Prince William and Prince Harry with their father | Tim Rooke-Pool/Getty Images Prince William and Prince Harry with their father | Tim Rooke-Pool/Getty Images\n\nRoyal feuds are as old as the throne itself.\n\nPrince William and Prince Harry have known of their stepmother, Camilla, since very early in their lives. The high-profile and public affair between Camilla and Prince Charles is something the boys will never truly forget. Understandably, they have had a rocky relationship with Camilla over the years. Some years have been better than others, but it’s impossible to completely erase the dark history between each other.\n\nLet’s take a quick look at the revealing details behind the relationship between Prince William, Prince Harry, and Camilla, including a major sign of progress for their relationship (No. 9). We’ll also discuss the surprisingly blunt statement from Prince William (No. 12).\n\n1. William was resistant to meeting Camilla\n\nPrince William was wary of Camilla as a teenager. | Adrian Dennis/AFP/Getty Images Prince William was wary of Camilla as a teenager. | Adrian Dennis/AFP/Getty Images\n\nIn the summer of 1997, two months before Diana’s death, Charles sat his kids down to talk to them about Camilla. He explained their relationship from his point of view, but Diana had already tainted the mere thought of Camilla for the boys. William was especially resistant to meeting her. Charles did not push the relationship on the boys because he wanted them to warm up to her and knew they were aware of the trouble Camilla had caused Charles and Diana.\n\nNext: William took the initiative.\n\n2. William eventually set up a meeting with Camilla to clear the air\n\nWilliam agreed to meet with Camilla in 1998. | Joel Robine/AFP/Getty Images William agreed to meet with Camilla in 1998. | Joel Robine/AFP/Getty Images\n\nAfter taking a break from pushing the boys to meet Camilla, Charles tried once more. In 1998, William finally agreed to set up a meeting with Camilla so he could learn a little more about her. Afterward, both agreed that things went well. However, Camilla was not yet out of the woods with William. There was still a lot he wanted to know.\n\nNext: The brothers did not meet her at the same time.\n\n3. Harry let William get to know her first\n\nHarry’s meeting with Camilla was more casual. | Carl de Souza/AFP/Getty Images Harry’s meeting with Camilla was more casual. | Carl de Souza/AFP/Getty Images\n\nHarry did not attend the meet up with William. Instead, he met Camilla a few weeks later over tea. The two were at Highgrove, Charles’ home. Camilla’s children were present as well, and it was reportedly more casual than her meeting with William. Tensions were not as high, possibly since William had gotten to know Camilla a bit and filled Harry in.\n\nNext: Diana made no bones about her feelings.\n\n4. Diana made her feelings about Camilla clear to her sons\n\nLeft: Princess Diana in Australia in 1996 | Patrick Riviere/Getty Images, Right: Camilla, Duchess of Cornwall in 2017 | WPA Pool/Pool/Getty Images Left: Princess Diana in Australia in 1996 | Patrick Riviere/Getty Images, Right: Camilla, Duchess of Cornwall in 2017 | WPA Pool/Pool/Getty Images\n\nIt was evident that Diana was not OK with the affair between Charles and Camilla. She quickly confronted Camilla about it and reportedly let her sons know, too. She referred to him as “Charles’ lady” to her sons. The boys immediately got a bad taste in their mouths about Camilla, which likely led to a years-long, up-and-down relationship with their father’s current wife.\n\nNext: Things did not improve too quickly.\n\n5. The relationship was still rocky at Charles’ 50th birthday party\n\nPrince Charles and the Duchess of Cornwall, formerly Camilla Parker Bowles at their wedding. | Chris Ison/AFP/Getty Images Prince Charles and the Duchess of Cornwall, formerly Camilla Parker Bowles at their wedding. | Chris Ison/AFP/Getty Images\n\nThe boys organized a birthday party for Charles when he was turning 50. They made the nice gesture of inviting Camilla to sit with Charles. However, it’s been reported that their relationship was still very tentative at the time. The boys wanted to make progress with Camilla but still felt shadowed by how she had split up their mother and father.\n\nNext: This person may have had an influence on the boys, too.\n\n6. The queen may have delayed the brothers’ acceptance of Camilla\n\nBritain’s Queen Elizabeth II and Prince Harry share a joke at Prince Charles and his bride Camilla’s wedding. | Alastair Grant/AFP/Getty Images Britain’s Queen Elizabeth II and Prince Harry share a joke at Prince Charles and his bride Camilla’s wedding. | Alastair Grant/AFP/Getty Images\n\nAt Charles’ party, Camilla sat with him, and the whole family celebrated his milestone birthday. The one missing person? The queen. She refused to attend the event knowing Camilla would be present. The queen had still not accepted her son’s infidelity. Her hesitation toward letting Camilla join the family may have fueled additional hesitation from William and Harry.\n\nNext: Charles took a big step with this invitation.\n\n7. A family vacation built some connection\n\nEveryone reportedly had a good time on vacation. | Rodrigo Buendia/AFP/Getty Images Everyone reportedly had a good time on vacation. | Rodrigo Buendia/AFP/Getty Images\n\nWilliam, Harry, and Charles were set to fly to Greece to spend a vacation together. Charles invited Camilla to attend. She accepted the invitation and flew to Greece with the family. While it is unclear exactly what happened there, it appeared that the boys enjoyed the time spent with their father and Camilla.\n\nNext: Things were looking up for Camilla and the boys.\n\n8. By the time Camilla and Charles married, her relationship with the boys had greatly improved\n\nEveryone was smiles by the time the wedding rolled around. | Hugo Burnand/Pool/Getty Images Everyone was smiles by the time the wedding rolled around. | Hugo Burnand/Pool/Getty Images\n\nCamilla wed Charles in 2005. After the wedding, Harry had nothing but good things to say about his new stepmother. “[Camilla is] a wonderful woman who makes my father very, very happy,” Harry said in an interview with BBC. “William and I love her to bits.” He also reinforced that they do not see her as a wicked stepmother.\n\nNext: William played a big role in his father’s second wedding.\n\n9. William served as his father’s ‘best man’\n\nWilliam was honored to serve as his father’s best man. | Hugo Burnand/Pool/Getty Images William was honored to serve as his father’s best man. | Hugo Burnand/Pool/Getty Images\n\nWhile William had fewer comments about Camilla than Harry, his brother did say that both of them loved Camilla very much. Although “best man” is not a traditional wedding position in England — groomsmen are typically called “supporters” — William served as Charles’ best man equivalent in the wedding. When Charles asked, William accepted without much hesitation.\n\nNext: This gift from Camilla symbolized a harmonious family.\n\n10. Camilla gave Kate Middleton a gift at William and Kate’s wedding\n\nKate Middleton received a thoughtful wedding gift from Camilla. | Charlie Crowhurst/Getty Images Kate Middleton received a thoughtful wedding gift from Camilla. | Charlie Crowhurst/Getty Images\n\nWhen William and Kate tied the knot in 2011, Camilla gave Kate a special wedding gift. It was a gold charm bracelet with each of their initials engraved on either side. Kate sported the bracelet on multiple occasions, as if to say that she was happy to have Camilla in the family. It seemed as though the feud between Charles’ children and Camilla had finally ended.\n\nNext: … but things have not been perfect since.\n\n11. The brothers were silent at Camilla’s 70th birthday celebration\n\nPrince Charles and Camilla | Tim Rooke/Pool/Getty Images Prince Charles and Camilla | Tim Rooke/Pool/Getty Images\n\nThe Daily Mail recently reported that at Camilla’s 70th birthday celebration, no words were said by the brothers. Most people expected the brothers to make a public statement about their stepmother, whom they had once seemed to fully patch things up with. Instead, they stayed silent, leading people to question whether things had changed between the three.\n\nNext: This statement from William hints at an unstable relationship.\n\n12. William made it clear that his children only have two grandmothers\n\nCamilla is not “grandma” to George and Charlotte. | Patrik Stollarz/AFP/Getty Images Camilla is not “grandma” to George and Charlotte. | Patrik Stollarz/AFP/Getty Images\n\n2017 marked 20 years since the tragic death of William’s mother, Princess Diana. In Diana, Our Mother: Her Life and Legacy, William made it clear that Camilla was not a grandmother to his two children. “… [I] just try and remind them that there are two grandmothers — there were two grandmothers — in their lives,” he said. William did not mention Camilla when speaking about the childrens’ grandmothers, even though she was their grandfather’s wife and had known them since birth, just like Kate’s mother.\n\nNext: It appears the tides have turned.\n\n13. More than a decade later, the relationship ‘has changed’\n\n(L-R) Camilla, Duchess of Cornwall, Prince Harry, Prince Charles, Prince of Wales and Prince William, Duke of Cambridge | Ben A. Pruchnie/Getty Images (L-R) Camilla, Duchess of Cornwall, Prince Harry, Prince Charles, Prince of Wales and Prince William, Duke of Cambridge | Ben A. Pruchnie/Getty Images\n\nA source later confirmed to the Daily Mail that things have not been the same between Camilla and the boys in recent years. “They are not close to Camilla anymore,” said a friend of the royal family. “The relationship has changed.” Other friends of the family have backed up those claims. One person, an old friend of Diana’s, said, “It was pretty clear they don’t have a good word for Camilla.”\n\nNext: The boys don’t want Camilla gaining this role.\n\n14. They likely do not want Camilla to be named queen\n\nHarry and William have the public’s support on this one. | Carl de Souza/AFP/Getty Images Harry and William have the public’s support on this one. | Carl de Souza/AFP/Getty Images\n\nThe public has made it clear that when Charles is passed the throne and becomes king, Camilla should not be queen. That was supposed to be Diana’s role, and the public remains loyal to her. They have also declined to call Camilla “Princess of Wales” because that was Diana’s title. Since the boys have seemed to distance themselves from Camilla, it’s likely that they do not want her to be queen, either. Rumors have swirled that the feud has heated up again since it was suggested that William and Kate take the role, but those rumors have not been confirmed.\n\nNext: This one thing could be a big reason for their resistance.\n\n15. The boys never fully came to terms with their mother’s death\n\nDiana meant a lot to her sons. | Johnny Eggitt/AFP/Getty Images Diana meant a lot to her sons. | Johnny Eggitt/AFP/Getty Images\n\nIn Diana, Our Mother, Harry and William went into detail about how little they actually cried over their mother. Harry made a comment that he still felt like there was much more he had to let out about her death. Since the boys seemed to never properly mourn their mother, they may have never had that closure that would allow them to let another mother into their lives. Plus, Camilla caused Diana so much pain that not having the closure of her death might make it even more difficult to let someone like that in.\n\nNext: Is there already a feud between Camilla and Meghan Markle?\n\n16. For starters: Why would they fight?\n\nNot everyone is ready for Markle to join the royal family. | Chris Jackson/Getty Images Not everyone is ready for Markle to join the royal family. | Chris Jackson/Getty Images\n\nMeghan and Camilla can’t possibly know each other very well. And Camilla recently gushed over the engagement to Prince Harry. So why would a feud be on the horizon? As one online rag alleges, the Duchess of Cornwall has never thought the American actress was worthy of marrying into the royal family.\n\nNext: Trying to decipher how a feud might have started.\n\n17. Why would Camilla think of Meghan this way?\n\nCamilla doesn’t like that Meghan is American. | STEFAN ROUSSEAU/AFP/Getty Images Camilla doesn’t like that Meghan is American. | STEFAN ROUSSEAU/AFP/Getty Images\n\nFor starters, Camilla supposedly isn’t fond of Meghan because she is American and does not come from a royal background. (Camilla allegedly felt the same way about Kate Middleton entering the royal family, so there could potentially be some truth to this rumor.) It is also rumored that Camilla wasn’t a fan of Meghan dumping her boyfriend of two years the second she met Harry, seeing it as a social climbing move. (Something Meghan’s stepsister has also accused her of.)\n\nNext: Seeing if a fight interrupted the engagement timeline.\n\n18. Was the engagement really postponed?\n\nWas the engagement secretly postponed? | Kensington Royal via Instagram Was the engagement secretly postponed? | Kensington Royal via Instagram\n\nAccording to Inquisitr, Camilla flew to Toronto in the summer of 2017 to tell Meghan in person that she should not accept a marriage proposal from Harry. And that, if Meghan accepted, the Camilla would “make life difficult” for her. While Harry and Meghan announced their engagement later in the year, it was alleged that Camilla’s meddling pushed things back.\n\nNext: Examining the lengths Camilla might have gone to.\n\n19. Has Camilla continued to cause trouble?\n\nSources claim that there’s drama at the palace. | Ben Birchall/AFP/Getty Images Sources claim that there’s drama at the palace. | Ben Birchall/AFP/Getty Images\n\nNew Idea claims that Camilla didn’t stop at trying to sabotage the engagement. The site alleges that the duchess is responsible for at least 14 key staffers at Buckingham Palace resigning, which in turn postponed the early stages of planning the wedding. It’s also said that Prince Harry was livid and supposedly confronted his stepmother about the matter. (Of course, this is all from “well-placed sources” and it isn’t completely clear if this rumor is true.)\n\nNext: Relating the allegations to previous rumors.\n\n20. Has Camilla meddled like this before?\n\nCamilla may have tried to meddle in William and Kate’s wedding plans. | CARL DE SOUZA/AFP/Getty Images Camilla may have tried to meddle in William and Kate’s wedding plans. | CARL DE SOUZA/AFP/Getty Images\n\nAs it turns out, this isn’t the first time that Camilla has been accused of trying to ruin a royal wedding. Gossip columns pointed their fingers at her back in 2011 for allegedly trying to interfere with Prince William and Kate Middleton’s relationship. It was said that Camilla had confidantes leak lies about Kate to the tabloids in order to paint her in a bad light.\n\nNext: Speaking of Duchess Catherine …\n\n21. What does Kate think?\n\nIs there some plotting going on behind the scenes? | Arthur Edwards-WPA Pool/Getty Images Is there some plotting going on behind the scenes? | Arthur Edwards-WPA Pool/Getty Images\n\nHere’s where things get interesting. One gossip rag claims that the Duchess of Cambridge and the future royal have joined forces to kick Camilla out of the royal family. Another gossip site, Gossip Cop, says that story is untrue because it has “inside sources” telling it the claim is 100% not true. (Although if you read the bottom of that post, it appears this could just be a case of two tabloids fighting with each other.)\n\nNext: Only one questions remains …\n\n22. Will we ever know the truth?\n\nThese rumors will be in the tabloids for years to come. | Andy Stenning/AFP/Getty Images These rumors will be in the tabloids for years to come. | Andy Stenning/AFP/Getty Images\n\nUnless Meghan unleashes a right hook that connects with Camilla’s jaw, we’ll likely never know if the two are actually at odds or not. Surely there will be a million photographers trying to catch Camilla glaring in Meghan’s direction at the wedding. Or body language experts deciphering how uncomfortable they look standing next to each other. But for now, all we have is the good ol’ rumor mill.\n\nAdditional reporting by Chelena Goldman.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/11/royal-family-helicopter.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Princess-Diana-on-VJ-Day-in-1995.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-514655218.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-107933972.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-52611119.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-with-the-roya-family-e1522183784635.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-09-at-10.18.36-AM.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Prince-William-R-and-his-father-Prince.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/10/kate-middleton-william-wedding-front.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/07/GettyImages-180291813.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-877856750.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Collage-of-Diana-and-Camilla.jpeg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-138654754.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-107934124.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-664977848.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-160328776.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-106930855.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-and-Prince-Harry-laughing.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-52611128.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-57546222.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/GettyImages-877901676.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/07/KateMiddletonAscot.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg", "keywords": [], "authors": ["Julia Mullaney"], "canonical_link": "https://www.cheatsheet.com/health-fitness/revealing-details-about-prince-william-prince-harrys-royal-feud-camilla.html/", "title": "Revealing Details About Prince William and Prince Harry’s Royal Feud With Camilla", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/revealing-details-about-prince-william-prince-harrys-royal-feud-camilla.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The royal brothers have had their ups and downs with stepmother Camilla, and it seems things have once again become heated among the family members.", "og": {"locale": "en_US", "type": "article", "title": "Revealing Details About Prince William and Prince Harry’s Royal Feud With Camilla", "description": "The royal brothers have had their ups and downs with stepmother Camilla, and it seems things have once again become heated among the family members.", "url": "https://www.cheatsheet.com/health-fitness/revealing-details-about-prince-william-prince-harrys-royal-feud-camilla.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-07-30T18:27:11-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "relationship advice", "section": "Health & Fitness", "published_time": "2018-06-12T15:34:00-04:00", "modified_time": "2018-07-30T18:27:11-04:00"}, "twitter": {"card": "summary_large_image", "description": "The royal brothers have had their ups and downs with stepmother Camilla, and it seems things have once again become heated among the family members.", "title": "Revealing Details About Prince William and Prince Harry’s Royal Feud With Camilla", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/05/The-Centenary-Service-To-Commemorate-The-Battle-Of-Vimy-Ridge.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528832040.0, "source": "http://www.cheatsheet.com", "summary": ""}