{"url": "https://people.com/tv/khloe-kardashian-strong-resilient-cheating-scandal-paris-hilton-coachella/", "text": "Paris Hilton couldn’t be happier for new mom Khloé Kardashian.\n\nThe heiress, 37, has been longtime friends with Kardashian— who gave birth to her first child, a baby girl, on Thursday in Cleveland — and said “this all that she’s ever wanted.”\n\nGet push notifications with news, features and more.\n\n“I talked to Kim [Kardashian West] yesterday and they were flying out there for the birth,” Hilton told PEOPLE exclusively at Rachel Zoe’s fourth annual ZOEasis style retreat at Coachella on Friday. “Khloé has always wanted to be a mom and she has such a big heart and is so loving.”\n\n“She’s a natural,” continued Hilton. “This is her dream come true. She’s so happy, and I’m thrilled for her.”\n\nWatch the full special Born Kardashian streaming now on PeopleTV.com, or download the PeopleTV app on your favorite device.\n\nThe exciting chapter comes in the midst of scandal: Tristan Thompson, Kardashian’s boyfriend and the baby’s father, has been accused of cheating on her with multiple women.\n\n“I’ve known that girl my entire life and she’s a strong, resilient woman,” said Hilton. “I think that all she’s focusing on right now is this baby.”\n\nWATCH: Then & Now: Khloé Kardashian & Tristan Thompson’s Relationship Whirlwind —How Did We Get Here?\n\nPlus, Hilton believes Kardashian has “such an incredible family” by her side.\n\n“Her mother [Kris Jenner] and all her sisters and everyone, they’re so supportive and such a big family,” Hilton said. “She’s so lucky to have such an incredible support system because family is everything.”\n\nImage zoom Stefanie Keenan/Getty\n\nHilton thinks it’s particularly exciting that Kardashian had a baby girl — and she hopes to also have a girl when she starts a family with her fiancé Chris Zylka in the future.\n\n“I hope when I have my first baby it’ll be a girl because the bond you have with your mother is amazing,” she said.\n\nBut first will come the wedding, which Hilton says she’ll start planning after her brother Barron Hilton’s upcoming nuptials to socialite Tessa Gräfin von Walderdorff in St. Barts.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\n“I’m so stressed because I travel so much and am constantly in a different country like every couple of days for all my businesses and my work,” she said. “It’s been hard to plan.”\n\n“Right now, my sister [Nicky] and I are just looking at all the dresses,” she continued. “Different designers are sending us the most beautiful sketches, but it’s just so hard to choose, so I think I’m just going to do a couple outfit changes.”\n\nImage zoom Stefanie Keenan/Getty\n\nAs for the size of the ceremony, Hilton said she’ll need to have multiple receptions to include all her different groups of friends and family.\n\n“I have so many friends and it’s so hard to pick,” she says. “I have all my mom’s friends, all my family, all my cousins and all of that and then I have my other group of friends who are like my fun friends who I’m at Coachella with and EDC and Burning Man. It’s going to be a very weird mixture to have everyone, so I don’t know. Maybe I do like the family wedding and then the fun, friend wedding — the after, after party wedding.”\n\nFor Friday’s Moroccan-themed event sponsored by Belvedere Vodka, Hilton chose to wear Zoe’s Suzette dress because it had “bridal vibes.” A fan and friend of the designer, Hilton said she’s “proud” Zoe and the empire she’s built.\n\n“She’s a powerhouse,” she said. “I’ve known her since I was a teenager and just to see her grow into such an incredible businesswoman is so inspiring, and I love it.”\n\nThough fans have been rallying for a reboot of The Simple Life after seeing photos of Hilton and her former BFF Nicole Richie’s reunion at The Daily Front Row Fashion Awards in early April, Hilton said it would be tough to pull off.\n\n“They actually approached me [about it] last year,” Hilton told PEOPLE. “I was like, ‘I’m so different now and I don’t know if I could go back to that character. I don’t want to leave my fiancé. Nicole also has her two kids and she’s so busy with her TV show [Great News], and I’m so busy.”\n\nShe added: “It would be so much fun if we both weren’t basically married with me having a kid soon as well. We’re both so busy, but it would be hilarious. Nobody is as funny as Nicole.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton-11.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fparis-hilton-21-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton2.jpg", "keywords": [], "authors": ["Brianne Tracy"], "canonical_link": "https://people.com/tv/khloe-kardashian-strong-resilient-cheating-scandal-paris-hilton-coachella/", "title": "New Mom Khloé Kardashian Is a 'Strong, Resilient Woman' Amid Cheating Scandal, Says Paris Hilton", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Coachella,Exclusive,Kardashians,Khloé Kardashian,News,Paris Hilton,TV", "news_keywords": "Coachella,Exclusive,Kardashians,Khloé Kardashian,News,Paris Hilton,TV", "description": "Paris Hilton says her longtime friend Khloé Kardashian is a \"natural\" when it comes to motherhood", "og": {"title": "New Mom Khloé Kardashian Is a 'Strong, Resilient Woman' Amid Cheating Scandal, Says Paris Hilton", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/khloe-kardashian-strong-resilient-cheating-scandal-paris-hilton-coachella/", "description": "Paris Hilton couldn’t be happier for new mom&nbsp;Khloé Kardashian. The heiress, 37, has been longtime friends with Kardashian— who gave birth to her first child,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton2.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/khloe-kardashian-strong-resilient-cheating-scandal-paris-hilton-coachella/", "description": "Paris Hilton says her longtime friend Khloé Kardashian is a \"natural\" when it comes to motherhood", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/khloe-kardashian-strong-resilient-cheating-scandal-paris-hilton-coachella/", "title": "New Mom Khloé Kardashian Is a 'Strong, Resilient Woman' Amid Cheating Scandal, Says Paris Hilton", "description": "Paris Hilton says her longtime friend Khloé Kardashian is a \"natural\" when it comes to motherhood", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fparis-hilton2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}