{"url": "www.hollywoodreporter.com/news/george-clooney-leaving-lake-como-365525", "text": "UPDATED: More reporting has determined that the actor is not selling his lakeside Lake Como property.\n\nROME – The Hollywood Reporter updated this report with confirmation from George Clooney that the actor is not selling his Lake Como property.\n\nPreviously:\n\nIt looks like actor and Italy regular George Clooney may be severing his ties with the Bel Paese, at least according to a report from Italian news program TG 24.\n\nThe report said that Clooney is looking to sell Villa Oleandra, the mansion he bought on the shores of Lake Como 10 years ago, in order to distance himself from the attention of the corps of paparazzi who follow his every move while there.\n\nIf the reports prove to be true, it would be part of a dramatic withdrawal from Italy for the 51-year-old Clooney, who has established deep roots in the country.\n\nTwo years after buying Villa Oleandra, Clooney was made an honorary citizen of Laglio, the town where his villa is located.\n\nSTORY: THR Presents the Clooney Award: TV Stars Who Can Make the Leap\n\nHe also made his 2010 film The American in Italy after promising residents of the earthquake-stricken Abruzzo region he would make a film there in order to help boost the local economy, and he was an almost annual visitor to the Venice Film Festival. His political drama The Ides of March opened the festival a year ago.\n\nAdditionally, Clooney was connected romantically with Italian actress Elisabetta Canalis for nearly five years.\n\nBut the relationship with Canalis ended last year. And Marco Mueller, the Venice artistic director who regularly invited Clooney to the Venice Lido was ousted from the job in December and replaced by Alberto Barbera, who has said that Venice under Mueller was \"in a rut\" with the same people appearing every year -- perhaps an indication that the storied festival would not rush to invite Clooney back again so soon. He is not scheduled to appear at this year's edition of the Venice festival, which gets underay Wednesday.\n\nSTORY: President and Michelle Obama: George Clooney Is a 'Wonderful Guy' and 'Cute, Too'\n\nThe issue with Villa Oleandra concerns privacy -- or the lack of it, due to the scrum of paparazzi photographers camped outside the villa when Clooney is there. According to TG 24, the intrusiveness of the photographers got to the point where Stacy Keibler, Clooney’s current girlfriend, gave Clooney an ultimatum: \"Villa Oleandra or me.\"\n\nThe news program quoted some of the paparazzi, who said they had done no wrong. \"None of us has received any legal notice and nobody has broken the law,\" the program quoted photographer Pierpaolo Ferreri as saying. \"Clooney is a public figure. We stay out of the house and try to photograph him when he comes out. What’s wrong with that? Let us do our jobs.”\n\nThe report that Clooney may withdaw from Italy comes just days after another high-profile star, Madonna, said she may look to move there: according to Italian media, the Material Girl has been eyeing property in Rome.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2012/04/George_Clooney_a_l.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2012/04/George_Clooney_a_l.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2012/04/George_Clooney_a_l.jpg", "keywords": [], "authors": ["Eric J. Lyman", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/george-clooney-leaving-lake-como-365525", "title": "George Clooney Looking to Sell Italian Villa Because of Paparazzi (Report)", "meta_data": {"viewport": "width=device-width", "description": "UPDATED: More reporting has determined that the actor is not selling his lakeside Lake Como property.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/george-clooney-leaving-lake-como-365525", "domain": "https://www.hollywoodreporter.com/", "title": "George Clooney Looking to Sell Italian Villa Because of Paparazzi (Report)", "description": "UPDATED: More reporting has determined that the actor is not selling his lakeside Lake Como property.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2012/04/George_Clooney_a_l.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "George Clooney Looking to Sell Italian Villa Because of Paparazzi (Report)", "description": "UPDATED: More reporting has determined that the actor is not selling his lakeside Lake Como property.", "url": "https://www.hollywoodreporter.com/news/george-clooney-leaving-lake-como-365525", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2012/04/George_Clooney_a_l.jpg", "width": 648, "height": 365, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "George Clooney Looking to Sell Italian Villa Because of Paparazzi (Report)", "sailthru.description": "UPDATED: More reporting has determined that the actor is not selling his lakeside Lake Como property.", "sailthru.author": "Eric J. Lyman", "sailthru.vertical": "Style", "sailthru.date": "2012-08-27 08:31:43", "sailthru.tags": "Movies,Style,George Clooney,International"}, "movies": [], "publish_date": 1346027503.0, "source": "http://www.hollywoodreporter.com", "summary": ""}