{"url": "http://america.aljazeera.com/articles/2013/10/2/israel-netanyahurouhaniiranpresident.html", "text": "Such a reaction would be understandable if Saeed Jalili , the most anti-Western ultraconservative candidate, had won. But why has the Israeli government greeted Rouhani with hostility? The common refrain in Israel is that Rouhani's moderate image — in contrast to his predecessor Mahmoud Ahmadinejad's — will hamper Israel's efforts to keep Iran isolated. Furthermore, Rouhani's moderate tone could fool the United States and Europe into a false sense of security, resulting in the lifting of sanctions against Iran and even passivity toward the threat of Iran's nuclear program. Such concern likely peaked after Rouhani's recent visit to the United Nations General Assembly, which led to a number of milestones in Iran's troubled relationship with the U.S. The meeting between Iran's foreign minister Mohammad Javad Zarif and U.S. Secretary of State John Kerry — the first such formal talks between the two countries since the 1978 Iranian Revolution — was followed by another major unprecedented milestone: a phone call between Rouhani and President Barack Obama. To be sure, when it comes to Rouhani's ability to usher real change to Iran's nuclear program, a healthy dose of skepticism is called for. However, his election victory is not the threat that Netanyahu and his cabinet have alleged. In fact, there are good reasons for Israelis to welcome Rouhani's rise to power. Rouhani was elected on a platform of moderation. Among the presidential candidates, he was the most critical of Iran's nuclear-negotiation strategy. His criticism focused on Iran's intransigent posture at the talks, which forced it to pay a disproportionate price for its nuclear program. As Rouhani stated in a campaign video on June 5, 10 days before the election: \"If centrifuges are turning, but the country is dormant, then we don't choose this. If the arrangement is for Natanz [Iran's nuclear enrichment site] to work but 100 other factories close because of sanctions and shortage of primary material or they only work at 20 percent of their capacity, then this is unacceptable.\"\n\nIranian President Hassan Rouhani was the most moderate candidate among those allowed to run in the country's June election. Yet within one month of Rouhani's victory, Israel's Prime Minister Benjamin Netanyahu publicly called him a \"wolf in sheep’s clothing.\"\n\nIn what should be good news for Israel, Rouhani could usher in change to Iran's nuclear stance. He enjoys very good relations with Iran's Supreme Leader Ali Khamenei and seems to be highly trusted by him. For 25 years Rouhani was Khamenei's representative on the Supreme National Security Council (SNSC), which shapes Iran's national security and defense policies.\n\n\n\nIn fact, Rouhani's relations with Khamenei are far better so far than that of his predecessors, Akbar Hashemi Rafsanjani, Mohammad Khatami and Ahmadinejad. Khamenei may not have allowed Ahmadinejad to shift Iran's nuclear strategy, despite the latter's calls for Iran to halt enrichment at 20 percent, because of bad relations between the two leaders after a public falling out in April 2011.\n\nRouhani's rapprochement with the U.S. could also be good news for Israeli worries over Iran's nuclear ambitions. Improved relations with Iran, along with the leverage of sanctions, could give the U.S. what it needs to extract concessions from Tehran over its nuclear program.\n\n\n\nAt the same time, Rouhani's rise to power and the strengthening of his position will come at a cost to Iran's hard-liners, Israel's most ardent enemies. In fact, this is already happening: In less than two months since coming to power, Rouhani is already changing parts of Iran's stance on the Holocaust, much to the fury of Iran's ultraconservatives.\n\nLast but not least, Rouhani's election represented a victory for the tough sanctions imposed against Iran, such as the restrictions against Iran's Central Bank that Israel had demanded for many years. A military attack by Israel or the U.S., by contrast, would most probably have stiffened Iran's stance against negotiations. So now that the goal of softening Iran's stance has been achieved, it is time to reap its benefits.\n\nNetanyahu appears to believe that Rouhani cannot be trusted and must be pressured incessantly, even if he offers compromises. Netanyahu insists that Iran's entire nuclear program must be dismantled and, if Iran does not comply, military action should be taken.\n\nThe irony in Netanyahu's harsh line is that it helps Rouhani politically. In Iran praise from any Israeli leaders could be detrimental.\n\nFor now, Netanyahu appears to be attacking Rouhani because he genuinely doubts his sincerity and views his overtures as a threat to Israel. Let us hope that instead of hurting Rouhani, Netanyahu ends up helping him. Rouhani's diplomatic outreach could be the best opportunity Israel has seen in the last decade to find a negotiated settlement to Iran's nuclear program.", "images": ["http://america.aljazeera.com/content/ajam/watch/shows/live-news/2015/8/calls-for-the-us-mexican-border-wall/_jcr_content/image.adapt.full.low.WP-BORDER-CQ.jpg", "http://america.aljazeera.com/content/ajam/watch/shows/live-news/2015/1/flint-water-crisis-how-al-jazeera-america-reported-it-a-year-ago-today/_jcr_content/image.adapt.full.low.WP-FLINT%20WATER-CQ.jpg", "http://america.aljazeera.com/content/ajam/articles/2016/2/25/small-businesses-for-trump-just-get-somebody-different-in-there/_jcr_content/image.adapt.250.low.donald_trump_24feb2016.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw==", "http://america.aljazeera.com/content/ajam/watch/shows/Ali-Velshi-On-Target/2015/11/investigations-into-chicagos-red-light-traffic-cameras/_jcr_content/image.adapt.full.low.WP-RED%20LIGHT%20CAMERAS%20CQ.jpg", "http://america.aljazeera.com/content/ajam/watch/shows/live-news/2015/9/miss-japan-challenges-the-norm/_jcr_content/image.adapt.full.low.WP-JAPANHAFU-CQ.jpg", "http://america.aljazeera.com/content/ajam/articles/2016/2/25/as-thousands-enter-europe-eu-flails-in-anti-smuggling-efforts1/_jcr_content/image.adapt.250.low.frontex_greece.jpg", "http://america.aljazeera.com/content/ajam/external/2016/2/gone-girl/_jcr_content/image.adapt.250.low.pine_ridge_santana_janis_hp2.jpg", "http://america.aljazeera.com/content/ajam/watch/shows/america-tonight/2015/11/tiny-homes-provide-shelter-for-nashvilles-homeless/_jcr_content/image.adapt.full.low.tinyhomes913.jpg", "http://america.aljazeera.com/content/ajam/articles/2016/2/25/new-orleanians-see-tourism-bias-in-post-katrina-public-transport/_jcr_content/image.adapt.250.low.nola_busses_waiting_people.jpg", "http://america.aljazeera.com/content/ajam/opinions/2016/2/six-hot-media-startups-to-watch-in-2016/_jcr_content/image.adapt.250.low.jarvis_oped.jpg", "http://america.aljazeera.com/content/ajam/articles/2013/10/2/israel-netanyahurouhaniiranpresident/jcr:content/mainpar/adaptiveimage/src.adapt.960.high.israel_iran_093013.1380725054358.jpg", "http://america.aljazeera.com/content/ajam/articles/2013/10/2/israel-netanyahurouhaniiranpresident/_jcr_content/mainpar/adaptiveimage/src.adapt.480.low.israel_iran_093013.jpg"], "top_img": "http://america.aljazeera.com/content/ajam/articles/2013/10/2/israel-netanyahurouhaniiranpresident/jcr:content/mainpar/adaptiveimage/src.adapt.960.high.israel_iran_093013.1380725054358.jpg", "keywords": [], "authors": ["Meir Javedanfar"], "canonical_link": "http://america.aljazeera.com/articles/2013/10/2/israel-netanyahurouhaniiranpresident.html", "title": "Israel should welcome Rouhani's election victory", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "keywords": "US-Iran Diplomacy, Benjamin Netanyahu, Hassan Rouhani, Iran, Israel, International", "description": "Commentary: Netanyahu's hostility to Iran'\u0080\u0099s new president is misplaced.", "apple-itunes-app": "app-id=810543104, affiliate-data=10lxKx", "og": {"description": "Commentary: Netanyahu's hostility to Iran'\u0080\u0099s new president is misplaced.", "image": {"identifier": "http://america.aljazeera.com/content/ajam/articles/2013/10/2/israel-netanyahurouhaniiranpresident/jcr:content/mainpar/adaptiveimage/src.adapt.960.high.israel_iran_093013.1380725054358.jpg", "width": 960, "height": 600}, "title": "Israel should welcome Rouhani's election victory", "url": "http://america.aljazeera.com/articles/2013/10/2/israel-netanyahurouhaniiranpresident.html", "type": "article"}, "twitter": {"card": "summary", "site": "@AJAM", "title": "Israel should welcome Rouhani's election victory", "description": "Commentary: Netanyahu's hostility to Iran'\u0080\u0099s new president is misplaced.", "image": "http://america.aljazeera.com/content/ajam/articles/2013/10/2/israel-netanyahurouhaniiranpresident/jcr:content/mainpar/adaptiveimage/src.adapt.960.high.israel_iran_093013.1380725054358.jpg"}, "google-play-app": "app-id=com.aljazeera.simple"}, "movies": [], "publish_date": 1380643200.0, "source": "http://america.aljazeera.com", "summary": ""}