{"url": "https://www.theverge.com/2018/11/12/18081030/the-walking-dead-season-9-episode-6-who-are-you-now-recap", "text": "Warning: Spoilers for The Walking Dead season 9, episode 6 below.\n\nLast week, The Walking Dead was too clever for its own good. After head-faking for months that Andrew Lincoln’s Rick Grimes would be killed off the show, the series aired a finale that seemed to do exactly that — before revealing in the final moments that Rick was actually just whisked away via helicopter, injured but alive. Adding insult to injury, AMC then pulled another rabbit out of its crumpled hat: not only was Rick alive, but the character would be the lead in a trilogy of Walking Dead movies set to air on the network.\n\nThis season was promoted as the final episodes of Rick Grimes in The Walking Dead, but episodes aren’t the same as TV movies, you see. Or something.\n\nThe one-two troll-punch was about as cheap as you can get, but one sliver of hope remained: as part of the reinvention of the show under new showrunner Angela Kang, The Walking Dead would also time-jump forward six years, allowing for something of a fresh start, featuring Rick’s 10-year-old daughter Judith (now played by Cailey Fleming). The sixth episode of the season, “Who Are You Now?”, offered audiences their first glimpse at that fresh start, but it was unfortunately all too evident that when The Walking Dead turned the clock forward, it took a giant step back.\n\nLet’s talk about hair\n\nBryan: Okay, this is going to sound like I’m nitpicking, but there is a point. Stay with me.\n\nAs shown in the trailers for this week’s episode, The Walking Dead is aging up the established characters. They don’t actually look any older, mind you, and nobody exhibits any real significant behavioral changes, save for Michonne occasionally talking out loud to Rick or Carl. Walkers are still walkers, and for the most part, nothing has progressed meaningfully from an infrastructure standpoint, apart from the survivors building a windmill.\n\nInstead, everybody has a different hairstyle.\n\nDid nothing happen that altered the fundamental dynamics between this group of survivors?\n\nEver-practical Carol has ditched her short hair for a billowing witch’s mane. Daryl’s hair is still an unwashed mess, but he’s sporting enough extra length to earn him free admission to an Iron Maiden concert. Michonne has ditched her signature bandana, and even Negan has gotten into the game with a nicely trimmed beard and buzzcut. In a one-off flash-forward, I don’t have problems with this, but are changes in personal grooming truly the only signs of time’s passage that The Walking Dead has to offer? Were there no calamitous altercations that left characters wounded or scarred? Did nothing happen that altered the fundamental dynamics between this small group of survivors?\n\nThe idea that six full years could pass in this show — nearly two-thirds of the time span covered in its entire run — and leave no significant mark speaks to the very problem the show has been facing these past few years. Everything that happens is either shallow and cosmetic, or a huge, overplayed story beat that gets blown out of proportion. I’m still willing to see what happens this season, but this seems like such a cartoonish start.\n\nNick: I’m willing to give The Walking Dead the benefit of the doubt here — to an extent. I understand that you can’t artificially age your cast by six years, and that the only significant on-screen change is the introduction of the older Judith. But it does come off as overtly silly that the show spends the first 20 minutes of the episode alternating between a heavy-handed Michonne monologue and a generous display of Carol’s locks and Eugene’s new ponytail. (Thank god he ditched the mullet.)\n\nIt’s not like the show is unaware of how to show the gradual and subtle changes that have occurred, instead of just outright telling us. The scene where Gabriel leads Alexandria in a council session to decide the fate of the newcomers is an excellent display of how they’ve managed to rebuild a form of government, and we know Michonne’s role is now “head of security,” indicating everyone has more codified roles now.\n\nBut we don’t get much insight into whether they’ve spent the last six years doing anything but farming and pairing off into new couples. (Gabriel and Rosita is the new most unlikely match of the bunch.) We do get a brief mention of Eugene trying to establish a radio network, but all in all, the episode leans heavily on highlighting the time jump through the eyes of the four new characters Judith saves. Really, viewers want to know what Daryl’s up to, where Maggie went, and why — after six years — everyone else seems the same.\n\nThe never-ending soap opera\n\nBryan: I was wrong last week when I assumed that The Walking Dead wouldn’t just turn into The Judith Grimes Hour. That said, as the previous episode teased, the time-jump brings in a new group of characters who are meant to spin things off in interesting directions.\n\nThe problem? After last night’s episode, I can barely tell you a meaningful thing about them. There’s The Woman Who Used To Be In Prison Who Didn’t Turn Over Her Knife To Michonne (otherwise known as Magna, played by Nadia Hilker). There’s The Guy Who Used To Be A Music Teacher (Dan Fogler’s Luke), The Journalist (Connie, played by Lauren Ridloff), and The Journalist’s Sister (Angel Theory’s Kelly). Connie is deaf, which definitely adds a new wrinkle to dealing with the zombie apocalypse, but other than that, everything about the group feels familiar.\n\nThe citizens of Alexandria come across a new group. They give said group the benefit of the doubt. Someone in this new group (Magna, in this case), isn’t entirely forthcoming, and conflict arises as a result. Said group is then shuffled off to another community because that’s not as bad as leaving them all in the wilderness. Does that sound familiar? It should, because it’s basically the exact same storyline that happens every season on The Walking Dead.\n\nDespite the time jump, we’re back to the same old template\n\nI’m not disregarding these new characters outright. They’ve been with the show for a single episode, and at least some of them will probably have time to evolve and gain some nuance. But I am frustrated that, despite the time jump and the promise of a new vision, we’re back to the same old Walking Dead template. What do you think, Nick? Have I grown too cynical?\n\nNick: It does seem like convenient, lazy storytelling to use four new characters who are inept enough to be saved by a 10-year-old girl to do a lot of the heavy lifting around the time-jump. The Walking Dead tends to introduce new characters who are stiff and shallow enough to be used mostly as plot devices, and then it promptly discards them. (Anyone remember the short-lived return of season 1 character Morales last year? He lasts one episode before Daryl disposes of him.)\n\nIt’s hard to invest in these new characters, knowing they’re just being used as blunt tools to show off Michonne’s tough new attitude and Judith’s carefree, empathetic spirit. I also find it difficult to believe in these characters’ stories, at least going off the breadcrumbs the show gives us in this episode. The writers do, at the very least, try: at one point, Luke and Magna exchange names of communities and destinations they’ve survived and fled, similar to if Carol or Daryl mentioned Woodbury or Terminus in an offhand comment. Except we don’t recognize the names of the places these new strangers have come from, and we’re not supposed to. They have a whole implied history behind them.\n\nBut seeing how vulnerable and inexperienced they appear, it’s really hard to believe they’ve survived this long, or been through this many trials already. A flashback scene, or anything to highlight what these characters were running from and what their true nature is, would have gone a long way.\n\nThere could be some skeletons in their collective closet that the show reveals over time. Perhaps Magna’s prison stint will come back in a narratively interesting way. I do find Connie and Kelly’s dynamic with the use of sign language to be a fresh twist on post-apocalyptic survival mechanics. But like you, Bryan, I’m finding it hard to care about yet another batch of new characters, and even harder to believe they’ll stick around long after they’ve been used to showcase the tenuous relationship between Alexandria and the Hilltop.\n\nBryan: There was one big cathartic moment we should probably hit upon: Carol deciding to end her years of pacifism by taking out a group of Saviors. And not just in a mild, “Oh, civilization will be better off if we humanely execute them” kind of way. She literally douses them in gasoline and burns them alive. It’s cruel, brutal, vicious, and vengeful. After all the frustration the show’s slow-playing of Negan and the Saviors created, there’s something liberating about somebody getting rid of a chunk of them in one visceral swoop.\n\nBut even there, it feels like a repeat. Carol being a cold-hearted killer isn’t new; going to that place, and then slowly coming back around to Rick’s more moderate point of view, was a major part of her character arc over the life of the series. And so while the brutal murders are satisfying, they also feel like the show is just reverting back to what it knows best. Maybe Carol will adopt some new, previously explored shades of grey moral philosophy, but the way she disposes of the saviors seems like The Walking Dead just wants her to ping-pong between the only two shades of morality she knows.\n\nHey, look — a misdirect!\n\nNick: If you haven’t read the comics, the ending to “Who Are You Now?” might come as a big surprise. Zombies that can talk — and not just talk, but seemingly exhibit some form of intelligence — is about as big of a bombshell as The Walking Dead could have dropped in its first post-Rick episode. Generally speaking, it’s handled well: there’s a short, frightening scene featuring Eugene and Rosita evading a herd of the undead, only to discover that they’re actually being targeted. “Where are they?” one of the walkers appears to ask, before the show cuts to black.\n\nIt’s effective, sure, but it also feels unfair. The Walking Dead is setting up its next big arc here, and without spoiling too much, it’s a chapter ripped straight from Robert Kirkman’s source material. On one hand, it makes perfect sense that the show would turn to the comics, as it has heavily throughout the series, for its next narrative inspiration. On the other hand, it seems like a giant missed opportunity and a shallow misdirect to barrel right into this storyline after Rick’s departure, by essentially tricking the audience about the nature of the new threat.\n\nThe Walking Dead has always done a decent job of threading the needle and staying true to its source, while also making the show feel fresh and unique — at least up until Negan’s introduction. It’s done that by using show-exclusive characters, swapping around storylines, and taking artistic liberty when appropriate. With the talking walkers, however, it seems like the show is passing over the chance to really do some interesting storytelling with its new cast of characters and the time-jump, which isn’t in the comics. And that’s all to whip viewers into thinking they’re finally getting some answers about the nature of the virus, or perhaps some form of evolution on behalf of the undead. I feel like the big reveal will disappoint a lot of people, especially if the show belabors it until the mid-season finale, which is what I fear is going to happen.\n\nWith the talking walkers it seems like the show is passing over the chance to really do some interesting storytelling\n\nBryan: Out of everything in this episode, this final tease left me most dispirited. Why? Because for a brief, shining moment, it appeared that the show would actually do something different. Audiences have seen these characters dance the Find a New Community Boogie year after year. They’ve run into potential allies, only to discover they’re actually enemies. And they’ve had to deal with the loss of loved ones along the way. The one thing the show has never dared to do — even for a fleeting moment — is address the nature of the zombie outbreak, including where it came from, what its long-term impact is, and what might be happening to those who are turned.\n\nI get it. This isn’t a show about zombies; it’s a show about how society breaks down and then rebuilds itself. Problem is, the show has played out this cycle so many times now that I find it incredibly hard to care. When I thought that the zombies might actually, for real, be talking, I was knocked back on my heels. Taking things in new directions? Exciting new approaches? Sign me up!\n\nOf course, the first thing I did was ping Nick, who informed me about the next major villain arc in the comics — and it quickly became clear that the talking zombie is likely just setting up another disappointing misdirect. In all fairness, the final moment of the episode itself does work. The frustration comes from reading between the lines, and paying heed to some characters who were cast for this season. But that doesn’t take the sting away. This is the first episode of The Walking Dead that actually has the opportunity to do something innovative and new, and instead, it’s almost certainly going to be falling back on old patterns, then adding hair extensions.\n\nI’m in until the end with this season, but with all the talk of fresh takes and reinvention, I’m really starting to wonder: how is this vision for The Walking Dead any different than the one we’ve already been watching? And if it isn’t, then why all the fanfare?", "images": ["https://cdn.vox-cdn.com/thumbor/U4bW_h-mC90Msy9V7RkAlntmr2E=/0x0:4500x3000/1200x0/filters:focal(0x0:4500x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13419623/TWD_906_GP_0629_0225_RT.jpg", "https://cdn.vox-cdn.com/thumbor/AVbaWeeG8gnfxP471B2Az55P_28=/0x0:4500x3003/1200x0/filters:focal(0x0:4500x3003):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13419613/TWD_906_GP_0702_0053_RT.jpg", "https://cdn.vox-cdn.com/thumbor/dzGlIuiwEYgipE1q7linWWCOYF4=/0x0:4500x2999/1200x800/filters:focal(1480x308:2200x1028)/cdn.vox-cdn.com/uploads/chorus_image/image/62281033/TWD_906_GP_0705_0329_RT.0.jpg", "https://cdn.vox-cdn.com/thumbor/pCxDtBV9sJrb5_chkY3ehYwsKok=/0x0:4500x3000/1200x0/filters:focal(0x0:4500x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/13419617/TWD_906_GP_0703_0800_RT.jpg", "https://cdn.vox-cdn.com/thumbor/rm5iKvN15gOLbUExbRzQOXLniD8=/0x0:4500x2356/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13419611/TWD_906_GP_0705_0329_RT.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/rm5iKvN15gOLbUExbRzQOXLniD8=/0x0:4500x2356/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13419611/TWD_906_GP_0705_0329_RT.jpg", "keywords": [], "authors": ["Bryan Bishop", "Nick Statt", "Nov"], "canonical_link": "https://www.theverge.com/2018/11/12/18081030/the-walking-dead-season-9-episode-6-who-are-you-now-recap", "title": "The Walking Dead’s fresh start looks like a big step back", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "article": {"publisher": "http://www.facebook.com/verge", "published_time": "2018-11-12T13:19:47-05:00", "modified_time": "2018-11-12T13:19:47-05:00"}, "author": "Bryan Bishop", "style-tools": "https://www.theverge.com/style/community/372/e8584abde1fc118cbb44d8e68e9902bc/tools.css", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "After the departure of Rick Grimes, the hope was that The Walking Dead would use its six-year time jump to make a fresh start. The sixth episode of the season, \"Who Are You Now?,\" offered audiences their first glimpse at what that looks like, and one thing was unfortunately all too evident: The Walking Dead turned the clock forward only to take a giant step back.", "og": {"description": "The first episode without Rick Grimes looks like every other episode he was in.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/rm5iKvN15gOLbUExbRzQOXLniD8=/0x0:4500x2356/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13419611/TWD_906_GP_0705_0329_RT.jpg", "height": 630, "width": 1200}, "site_name": "The Verge", "title": "The Walking Dead’s fresh start looks like a big step back", "type": "article", "url": "https://www.theverge.com/2018/11/12/18081030/the-walking-dead-season-9-episode-6-who-are-you-now-recap"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theverge.com/2018/11/12/18081030/the-walking-dead-season-9-episode-6-who-are-you-now-recap", "title": "The Walking Dead’s fresh start looks like a big step back", "description": "The first episode without Rick Grimes looks like every other episode he was in.", "image": "https://cdn.vox-cdn.com/thumbor/4Jz56GpcaSvb5abo4G_GtADKx8Y=/0x0:4500x2250/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/13419611/TWD_906_GP_0705_0329_RT.jpg", "site": "verge"}, "sailthru.title": "The Walking Dead’s fresh start looks like a big step back", "sailthru.tags": "general,the-verge,front-page,entertainment,tv,the-walking-dead,culture", "sailthru.description": "After the departure of Rick Grimes, the hope was that The Walking Dead would use its six-year time jump to make a fresh start. The sixth episode of the season, \"Who Are You Now?,\" offered audiences their first glimpse at what that looks like, and one thing was unfortunately all too evident: The Walking Dead turned the clock forward only to take a giant step back.", "sailthru.date": "2018-11-12T13:19:47-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/QD-E3n909UFlWDgdlJEZP-ngVrA=/0x0:4500x2531/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/62281031/TWD_906_GP_0705_0329_RT.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/22bJo-8u2OSIfIQ-8CyrhSwaToU=/341x0:3340x2999/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/62281031/TWD_906_GP_0705_0329_RT.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/7396113/221a67c8-a10f-11e6-8fae-983107008690.0.png", "msapplication-TileColor": "#393092", "outbrainsection": "the-walking-dead"}, "movies": [], "publish_date": 1541952000.0, "source": "https://www.theverge.com", "summary": ""}