{"url": "http://time.com/5004529/stranger-things-steve-season-2/", "text": "Warning: This post contains spoilers for Stranger Things.\n\nStranger Things season 2 threw us a lot of curveballs, but one of them was how nice Steve Harrington (Joe Keery) could be. Praise for Steve’s character development blew up seemingly overnight as fans binged and decided that his accomplishments in the area of being a human being were as beautiful to behold as his illustrious hair.\n\nPerhaps Steve summed up his role best: “I may be a pretty sh-tty boyfriend, but turns out I’m actually a pretty damn good babysitter,” he says to Nancy in the finale. But let’s go back to the beginning of season 2 before diving in. When we first meet Steve again in season 2, we get out of touch boyfriend Steve. He’s less concerned about Nancy’s grief over Barb than he is about whether or not she loves him. Not a great look.\n\nBut when it came to how competent he was with the kids, by season’s end, he had won many fans over. How’d we get here?\n\nIt all started when he showed up at the Wheelers house to try to win Nancy back. She wasn’t there. His soon-to-be buddy was though. Once Dustin took Steve under his wing, from that moment on, every move Steve made was responsibility central. He had several shining moments including but not limited to the following:\n\n1. Schooling Dustin on the art of seduction while walking along the railroad tracks.\n\n2. Coughing up the secrets to his perfect hair in episode five.\n\n3. Proving his mettle when the Demodogs came growling to the junkyard where he was ready to fight them back with his bat in episode six.\n\n4. Taking his babysitter role seriously, trying (unsuccessfully) to halt Operation Demodog Distraction during the finale.\n\n5. He may have wanted to stay on the bench, but nevertheless, he persisted by insisting on leading the kids through the treacherous tunnel.\n\n6. Giving Dustin a pre-Snow Ball pep talk in the finale’s coda.\n\nSure, he showed us glimmers of hope back in season 1 when he helped Jonathan and Nancy in the finale, but 1983 crisis Steve is a joke compared to 1984 Steve’s leadership skill levels.\n\nAs for how he handled it when Nancy chose Jonathan instead of him, he accepted it. That’s no real prize-winning feat. But if you knew the old King Steve — who was involved in Nancy’s public shaming after she spent a platonic night with Jonathan — then if nothing else, it was surprising he bowed out.\n\nDid the way he gazed longingly at Nancy at the Snow Ball make you forget all about the way he dramatically broke Jonathan’s very expensive camera equipment? Some fans did. What a turnaround for this kid.\n\nSee some of the funniest reactions to Steve’s new and improved season 2 side below.\n\nThe dramatic difference between ’83 Steve and ’84 Steve was a major talking point.\n\nHe was so great at babysitting that one redditor shared, “Steve’s basically a franchise now.”\n\nOne Steve fan used Gigi Hadid’s buzzy sneaker commercial to compare Nancy’s love interests.\n\nAnother shared his shiny new resume.\n\nAnother felt a Meryl Streep shoutout and caps lock was necessary.\n\nAnother praised his mom moves.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Ashley Hoffman at Ashley.Hoffman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_40-000001r.jpeg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/TheCircle.jpeg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_40-000001r.jpeg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Ashley Hoffman"], "canonical_link": "https://time.com/5004529/stranger-things-steve-season-2/", "title": "Stranger Things: Steve Becomes an Unlikely Internet Hero", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "stranger things, stranger things steve, stranger things season 2, joe Keery, Steve and dustin, steve and dustin stranger things, steve dustin stranger things, steve Harrington, steve Stranger things actor, stranger things netflix", "news_keywords": "stranger things, stranger things steve, stranger things season 2, joe Keery, Steve and dustin, steve and dustin stranger things, steve dustin stranger things, steve Harrington, steve Stranger things actor, stranger things netflix", "description": "How Steve went from bully to surprisingly heroic leader in Stranger Things season two.", "og": {"title": "Why This 'Stranger Things' Character Became a Surprising Hero", "type": "article", "site_name": "Time", "url": "https://time.com/5004529/stranger-things-steve-season-2/", "description": "What a turnaround for this kid", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_40-000001r.jpeg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5004529/stranger-things-steve-season-2/", "description": "How Steve went from bully to surprisingly heroic leader in Stranger Things season two.", "media": "https://api.time.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_40-000001r.jpeg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5004529/stranger-things-steve-season-2/", "title": "Why This 'Stranger Things' Character Became a Surprising Hero", "description": "What a turnaround for this kid", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_40-000001r.jpeg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}