{"url": "https://web.archive.org/web/20180803021321/http://www.msn.com/en-us/tv/celebrity/jessica-simpson-getting-dollar1-billion-dollar-divorce/ar-BBLq3hh", "text": "© 2018 James Devaney NEW YORK, NY - JULY 31: Eric Johnson and Jessica Simpson seen on the streets of Manhattan on July 31, 2018 in New York City. (Photo by James Devaney/GC Images) Jessica Simpson and Eric Johnson are not headed for a $1 billion divorce, despite a completely untrue report in one of this week’s tabloids. Gossip Cop can exclusively debunk the supposed marital drama. A rep for the singer tells us the spouses are going strong, and there’s plenty of additional evidence to\n\nAccording to OK!, however, the couple’s four-year marriage is hanging by a thread due to “Jessica’s partying and Eric’s lack of interest” in their relationship.\n\nAn alleged insider tells the magazine, “They’re always clashing over all sorts of things. Friends are worried that Jessica and Eric may not make it through this.” The outlet’s questionable source goes on to say that the former NFL star is sick of his wife’s “antics” and is “tired of playing dad to their kids and his wife.”\n\nThe seemingly phony tipster further maintains that Simpson and Johnson rarely spend time together and “don’t actually have a lot in common apart from the kids.” The singer’s billion-dollar fashion empire may be at stake, according to the outlet’s suspicious source, who adds, “Eric could go after everything Jessica has. This could turn into a brutal custody war, a battle for their mansion and Jessica’s business.”\n\nThe tabloid’s take on the couple’s marriage is coming from an anonymous “insider,” but Simpson’s spokesperson tells Gossip Cop on the record that she and her husband are very much in love. The claim that they don’t spend time together is also provably untrue. On Wednesday, Simpson and Johnson were spotted on a date night in New York City. Simpson and her husband were also photographed walking arm-in-arm earlier that day.\n\nAdditionally, the singer frequently praises her husband on social media and documents the time they spend together and with their two children. Last month, Simpson shared an Instagram photo of Johnson holding up their kids, along with the caption, “God gave me life to live it with this man.” Just a few days ago, Simpson and Johnson smiled for a selfie on a flight. And in mid-July, Simpson celebrated her 38th birthday with her husband in Los Angeles. Over the past few months alone, the singer has shared dozens of Instagram photos of date nights with her husband, family vacations and other outings.\n\nConclusion: Without a single shred of evidence, an alleged “source” tells OK! that Simpson and her husband are headed for an acrimonious divorce that will put her fortune at stake. Not only does the singer’s rep deny the claim, but there’s a trail of evidence on her social media page to disprove it. In addition to Simpson’s own collection of pictures with her husband, the two are frequently photographed looking happy on date nights and day outings. It’s clear there’s no billion-dollar divorce on the horizon.\n\nRelated slideshow: George, Amal Clooney getting $1 billion divorce and more tabloid tales", "images": ["https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBLqg4f.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=290&y=96", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBLq7RZ.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=264&y=153", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBLqqKY.img?h=66&w=88&m=6&q=60&u=t&o=t&l=f&x=248&y=155", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAopNLw.img?h=72&w=96&m=6&q=60&u=t&o=t&l=f", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBLqe45.img?h=353&w=300&m=6&q=60&o=f&l=f&x=1630&y=852", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAyjAuh.img?h=72&w=96&m=6&q=60&u=t&o=t&l=f", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAyjNi0.img?h=72&w=96&m=6&q=60&u=t&o=t&l=f", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=100&w=100&m=6&q=60&u=t&o=f&l=f", "https://web.archive.org/web/20180803021321im_/http://static-entertainment-wus-s-msn-com.akamaized.net/sc/82/c22c7d.gif", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAsZMRM.img?h=72&w=96&m=6&q=60&u=t&o=t&l=f", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBL9go4.img?h=230&w=300&m=6&q=60&o=f&l=f&x=719&y=289", "https://web.archive.org/web/20180803021321im_/https://sb.scorecardresearch.com/p?c1=2&c2=3000001&cs_ucfr=1&rn=636688592017238379&c7=http%253A%252F%252Fwww.msn.com%252Fen-us%252Ftv%252Fcelebrity%252Fjessica-simpson-getting-dollar1-billion-dollar-divorce%252Far-BBLq3hh&c8=&c9=", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo11.img?h=17&w=0&m=6&q=60&u=t&o=t&l=f&f=png", "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBbyo1E.img?h=16&w=16&m=6&q=60&u=t&o=t&l=f", "https://web.archive.org/web/20180803021321im_/http://static-entertainment-wus-s-msn-com.akamaized.net/sc/57/a49b8d.gif", "https://web.archive.org/web/20180803021321im_/http://c.msn.com/c.gif?udc=true&rid=c2d45f3c12d64a1da2e4df20a72942df&rnd=636688592017238379&rf=&tp=http%253A%252F%252Fwww.msn.com%252Fen-us%252Ftv%252Fcelebrity%252Fjessica-simpson-getting-dollar1-billion-dollar-divorce%252Far-BBLq3hh&di=1275&lng=en-us&activityId=c2d45f3c12d64a1da2e4df20a72942df&d.dgk=downlevel.pc&d.imd=0&st.dpt=tv-celebrity&st.sdpt=&subcvs=tv&pg.n=articlevnext&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0", "https://web.archive.org/web/20180803021321im_/http://otf.msn.com/c.gif?js=0&evt=impr&di=1275&pi=&ps=&su=http%253A%252F%252Fwww.msn.com%252Fen-us%252Ftv%252Fcelebrity%252Fjessica-simpson-getting-dollar1-billion-dollar-divorce%252Far-BBLq3hh&mkt=en-us&pp=False&cv.partner=Gossip%2BCop&cv.publcat=Gossip%2BCop%2BMedia&st.dpt=tv-celebrity&st.sdpt=&dv.Title1=&cts=636688592017238379&rf=&rid=c2d45f3c12d64a1da2e4df20a72942df&cvs=Browser&subcvs=tv&cv.entityId=BBLq3hh&cv.entitySrc=ar&provid=AAdsRm7&ar=0&d.dgk=downlevel.pc&d.imd=0&cv.parentId=&isCorePV=&pgIdx=&pgTot=&activityId=c2d45f3c12d64a1da2e4df20a72942df&pm=&pg.n=articlevnext&pg.t=article&pg.c=&pg.p=prime&anoncknm=&issso=0&ex="], "top_img": "https://web.archive.org/web/20180803021321im_/http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBLqe45.img?h=353&w=300&m=6&q=60&o=f&l=f&x=1630&y=852", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180803021321/https://www.gossipcop.com/jessica-simpson-divorce-one-billion-dollars/", "title": "Jessica Simpson Getting $1 Billion Dollar Divorce?", "meta_data": {"application-name": "Jessica Simpson Getting $1 Billion Dollar Divorce?", "cq": "passed", "description": "Jessica Simpson and Eric Johnson are not headed for a $1 billion divorce, despite a completely untrue report in one of this week’s tabloids. Gossip Cop can exclusively debunk the supposed marital drama. A rep for the singer tells us the spouses are going strong, and there’s plenty of additional evidence to According to OK!, however, the couple’s four-year marriage is hanging by a thread due to “Jessica’s partying and Eric’s lack of interest” in their relationship. An alleged insider tells the magazine, “They’re always clashing over all sorts of things. Friends are worried that Jessica and Eric may not make it through this.” The outlet’s questionable source goes on to say that the former NFL star is sick of his wife’s “antics” and is “tired of playing dad to their kids and his wife.” The seemingly phony tipster further maintains that Simpson and Johnson rarely spend time together and “don’t actually have a lot in common apart from the kids.” The singer’s billion-dollar fashion empire may be at stake, according to the outlet’s suspicious source, who adds, “Eric could go after everything Jessica has. This could turn into a brutal custody war, a battle for their mansion and Jessica’s business.” The tabloid’s take on the couple’s marriage is coming from an anonymous “insider,” but Simpson’s spokesperson tells Gossip Cop on the record that she and her husband are very much in love. The claim that they don’t spend time together is also provably untrue. On Wednesday, Simpson and Johnson were spotted on a date night in New York City. Simpson and her husband were also photographed walking arm-in-arm earlier that day. Additionally, the singer frequently praises her husband on social media and documents the time they spend together and with their two children. Last month, Simpson shared an Instagram photo of Johnson holding up their kids, along with the caption, “God gave me life to live it with this man.” Just a few days ago, Simpson and Johnson smiled for a selfie on a flight. And in mid-July, Simpson celebrated her 38th birthday with her husband in Los Angeles. Over the past few months alone, the singer has shared dozens of Instagram photos of date nights with her husband, family vacations and other outings. Conclusion: Without a single shred of evidence, an alleged “source” tells OK! that Simpson and her husband are headed for an acrimonious divorce that will put her fortune at stake. Not only does the singer’s rep deny the claim, but there’s a trail of evidence on her social media page to disprove it. In addition to Simpson’s own collection of pictures with her husband, the two are frequently photographed looking happy on date nights and day outings. It’s clear there’s no billion-dollar divorce on the horizon. Share The Facts OK! Magazine Jessica Simpson and her husband Eric Johnson are getting a $1 billon dollar divorce. Thursday, August 2, 2018 Share Read More Embed Information on embedding in your site oEmbed Link https://www.sharethefacts.co/share/44863902-5d9d-4855-950e-4b757ae7c273", "viewport": "width=device-width,initial-scale=1, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}