{"url": "https://www.self.com/story/blow-dry-mistakes", "text": "It’s rare to find me without my curls smoothed, twisted by a curling iron into beach waves, and misted with texture spray. I love to have my hair done. A trip to the local blow-dry bar is my favorite Saturday afternoon pastime. However, at $50 a session, getting this look done by professionals on the regular is costly. So I’ve perfected my own blowout skills.\n\nIt may seem like an easy task: grab a blow-dryer, point, and blast with heat. But there is a mastery behind it. And you may be making simple mistakes that are actually hurting your hair even more than your look. Here, top pros break down the science to getting a gorgeous at-home blowout every single time and point out all the rookie mistakes that keep them in business.\n\n1. You don’t have a great blow-dryer.\n\nLet’s start at the very beginning: Investing in a high-quality tool is important, especially if you have a lot of hair or you’re blow-drying your hair often.\n\n“If you have thick hair, you’re probably damaging your hair more with a cheap blow-dryer as opposed to investing in a great one that will protect your hair and blow-dry it quicker,” Kérastase celebrity stylist Jennifer Yepez tells SELF. Expensive dryers tend to come with hair-saving smart features like high power, multiple heat settings, a cool shot, and ionic air technology. The last one helps with frizz, creates shine, and minimizes blow-dry time. “The technology in ionic hair dryers helps break down water molecules faster, which makes the hair dry faster,” she adds. The less time your hair is under heat and the more control you have over the temperature, the healthier it will be.\n\nYepez’s favorites are the new T3 Cura Luxe ($250) and the Dyson Supersonic ($399). Expensive? Yes, but you’ll pay for it in what you save skipping just five to 10 blowouts at the salon—and they’ll last you years.\n\n2. You’re spending too long with your hair wrapped in a towel.\n\n“After getting out of the shower, women tend to leave their hair in the towel for like 30 minutes,” says Giovanni Vaccaro, Glasmsquad’s creative director. “A cotton-based towel causes friction on the hair, and it's more prone to damaging the strands to the point where the hair breaks off,” he explains.\n\nIf you want to get rid of excess water, Vaccaro recommends using a microfiber towel like the Aquis or an old, clean t-shirt. And still, only spend about 10 minutes with your head wrapped up post-shampoo.\n\nThe best thing for your hair’s health is actually letting it air-dry before blow-drying. “Hair is in its most vulnerable state when wet, so allowing it to air-dry is always the healthiest option,” explains Vaccaro.\n\nMake sure to dry your hair according to your texture. Vaccaro says that fine-to-medium hair can air-dry a bit longer, to about 80 percent dryness, whereas thicker hair should only be about 50 percent dry before blow-drying. That’s because you have a better chance of getting curly or full hair straight while it’s still a little damp.\n\nIf you have curly or wavy hair and want to enhance your natural texture, add product when it’s very wet, squeeze out the excess with your hands, and wrap it up gently in a microfiber towel or t-shirt. Once your curls stop dripping, you can start blow-drying.\n\n3. You start in with the brush too soon.\n\nOn the opposite side of the 30-minute towel turban faux paus is taking a round brush to sopping wet hair. It’s bad form to immediately walk out of the shower and pick up your blow-dryer and round brush for a blowout. T3 celebrity stylist David Lopez suggests using a dryer to rough dry hair first. Set it to medium heat and low speed. “If hair is very wet and put on high speed, then it gets whipped around a lot,” he says. “This can cause split ends, tangles, and frizz.” Once hair is about 80 percent dry from the rough dry, then you can start sectioning it, molding it, and styling it with a round brush.\n\n4. You forget to spray heat protectant on the back of your head.\n\nUsing the right product pre-blowout is going to save your ends from breakage and make your blowout last longer. But make sure you’re applying it correctly.", "images": ["https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/5a946210fb42c00245b6b7da/4:3/w_2560%2Cc_limit/blowdrying-hair-mistakes.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg"], "top_img": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "keywords": [], "authors": ["Lauren Levinson"], "canonical_link": "https://www.self.com/story/blow-dry-mistakes", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Lauren Levinson", "copyright": "Copyright (c) Condé Nast 2020", "description": "Want to get salon-level blowout results at home when you blow-dry your hair? Get these tips from two professional hairstylists.", "id": "5aa7fdcfb79f332221a948c2", "keywords": "hair,blowdry", "news_keywords": "hair,blowdry", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5aa7fdcfb79f332221a948c2", "parsely-metadata": "{\"description\":\"Want to get salon-level blowout results at home when you blow-dry your hair? Get these tips from two professional hairstylists.\",\"image-16-9\":\"https://media.self.com/photos/5a946210fb42c00245b6b7da/16:9/w_1000,c_limit/blowdrying-hair-mistakes.jpg\",\"image-1-1\":\"https://media.self.com/photos/5a946210fb42c00245b6b7da/1:1/w_1000,c_limit/blowdrying-hair-mistakes.jpg\"}", "og": {"description": "Here's how to get salon-level results at home.", "image": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "site_name": "SELF", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair", "type": "article", "url": "https://www.self.com/story/blow-dry-mistakes"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Here's how to get salon-level results at home.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "8 Mistakes You're Making When You Blow-Dry Your Hair"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}