{"url": "www.cheatsheet.com/health-fitness/how-kylie-jenner-lost-weight-post-pregnancy.html/", "text": "After nine months of fan speculation and hiding from the spotlight, Kylie Jenner finally revealed baby Stormi to the world. Like most celebrities, we expected Kylie to get back into shape quickly with a healthy diet and exercise. But shortly after, photos reveal just how fast she dropped the pounds — and we’re all wondering whether it’s healthy.\n\nSo, what’s Kylie’s weight-loss secret? Here’s how she managed to lose a reported 25 pounds in just two weeks. Medical experts also provide a warning for Kylie and other mothers (page 7).\n\n1. Kylie allegedly follows Kim K’s advice and eats super clean\n\nKim Kardashian might be helping Kylie with her post-baby weight loss. | Kim Kardashian might be helping Kylie with her post-baby weight loss. | Kylie Jenner via YouTube\n\nDuring her pregnancy, Kylie admitted to having an obsession with In-N-Out fast food, Insider notes. That’s a serious departure from the way she currently eats, however. And thanks to Kim Kardashian, Kylie is getting one-on-one advice on how to drop excess fat and get into shape fast post-pregnancy.\n\nThe Independent says Kim advised Kylie to stick to a strict 1,500 calorie-a-day diet, according to one source. Along with that, Kim suggested Kylie eats no carbs or sugar, despite her “addiction” to fast food.\n\nNext: Kylie has been a fan of this dangerous weight-loss method for a while.\n\n2. She may be a fan of ‘detox teas’\n\nShe is often seen advertising detox teas on social media. | She is often seen advertising detox teas on social media. | Kylie Jenner via Instagram\n\nA source says in addition to a very strict diet, Kylie is drinking “detox teas” to help drop pounds, reports Hollywood Life. This wouldn’t be Kylie’s first attempt at weight loss with these teas, either. She posted a photo of her holding two of her favorite detox formulas on Instagram and promoting their cleansing effects.\n\nHere’s the problem, though: Teas don’t actually have the ability to “detox” your body. And drinking them won’t automatically help you lose weight, either, though some do have a laxative effect. In this case, you’ll just lose water weight.\n\nNext: This is how Kylie prefers to train.\n\n3. When she works out, she incorporates weight training\n\nKylie Jenner can afford the best personal trainers and nutritionists. | Astrid Stawiarz/Getty Images for NYFW: The Shows Kylie Jenner can afford the best personal trainers and nutritionists. | Astrid Stawiarz/Getty Images for NYFW: The Shows\n\nThough sister Khloe has accused Kylie of not putting much work into her body in the past, those days are seemingly over for the young Jenner. Hollywood Life notes one insider reveals the new mom hits the gym for a mix of cardio and weight lifting. She’s reportedly a big fan of running, squats, and push-ups to get that pre-baby body back.\n\nThe insider also says Kylie works out with a personal trainer five days a week for up to three hours a day. If this is the case, she could be leading up to serious burnout in the future, which can hinder her results in the long run.\n\nNext: Could it be true that Kylie is sticking to a diet this low in calories?\n\n4. Kylie sticks to an extremely calorie-restricted diet, some sources say\n\nAre these rumors true? | Are these rumors true? | Kylie Jenner via Instagram\n\nKim might advise a 1,500 calorie-a-day diet, but could Kylie be going to even bigger extreme? The Inquisitr says one insider mentions Kylie’s eating as little as 1,000 calories a day. They also said sometimes the starlet will just eat soup in the early evening as a meal replacement. And of course, this combined with no carbs or sugary sweets is sure to cause massive weight loss, even if it’s not sustainable.\n\nThe source says it gets even more severe than this, too. Allegedly, Kylie bans anyone from eating junk food around her, so she’s not tempted.\n\nNext: Kylie might go overboard quickly with her regimen.\n\n5. Some say she wants to look even thinner than she did pre-pregnancy\n\nIs she aiming for a thinner body type? | Is she aiming for a thinner body type? | Kylie Jenner via Instagram\n\nInStyle explains pre-pregnancy, Kylie was around 136 pounds, which is perfect for her 5-foot-6 frame. During her pregnancy, however, she gained upward of 50 pounds. And now, the Inquisitr notes one source says she wants to be even thinner than she was before baby Stormi was ever in the picture.\n\nRush reports Kylie was right in the “normal” weight range at 136, so she shouldn’t aim to go too far under this number. We’ll have to see how extreme she goes with her regimen — though hopefully she’ll make healthy adjustments.\n\nNext: Some think this is the reason Kylie’s losing weight so quickly.\n\n6. Others say the weight is falling off naturally due to genetics\n\nKylie Jenner might have her genes to thank. | Kylie Jenner might have her genes to thank. | Kylie Jenner via Instagram\n\nIs it possible Kylie’s not really partaking in extreme dieting after all, and the weight is falling off due to good genes? That’s what one source tells Hollywood Life. They told the publication that “her biggest weight loss secret is breastfeeding and good genetics. She has always had a great metabolism and breastfeeding has kicked it into high gear.”\n\nCould it be true that the young Jenner isn’t going to any extremes after all? Maybe so. And for more drama, the source also mentions Kim’s jealous the pounds are coming off so easily for Kylie after her own personal struggles with baby weight.\n\nNext: Should Kylie lose weight this fast? Experts weigh in.\n\n7. Here’s what medical experts believe Kylie should be doing post-pregnancy\n\nShould she be focusing on her image? | Shironosov/iStock/Getty Images Should she be focusing on her image? | Shironosov/iStock/Getty Images\n\nDr. Elizabeth Ward tells WebMD all about weight gain and loss before and after pregnancy. Ward says a woman at an average weight should expect to gain between 25 and 35 pounds, and they should also work to lose that excess weight after a year of having the baby. For at least six weeks postpartum, however, she suggests focusing on a healthy diet instead of cutting calories.\n\nWard also warns new mothers against following celebrity fad diets to lose weight quickly. Good nutrition, sleep, and physical activity are all vital for keeping energy levels up to take care of a newborn. And restricting calories if you’re a nursing mom will affect breast milk quality.\n\nNext: How is motherhood treating Kylie?\n\n8. Doing it all\n\nKylie Jenner is very protective of her daughter. | Kylie Jenner is very protective of her daughter. | Kylie Jenner via YouTube\n\nThough many folks were shocked when word of Jenner’s pregnancy hit the internet, according to a video that documented her pregnancy, she’s always wanted to be a mother. In fact, before baby Stormi’s arrival, the entrepreneur wanted to do everything for her daughter herself.\n\nA source told People, “At first, she only wants [mom Kris Jenner] and her sisters to help with the baby. She is worried about new people around the baby.” Considering how protective Jenner was of herself and her baby during her pregnancy, we can certainly see why she wanted to keep folks at bay.\n\nNext: A good team\n\n9. Seamless co-parenting\n\nTravis Scott and Kylie Jenner are sharing parenting duties. | Bob Levey/Getty Images Travis Scott and Kylie Jenner are sharing parenting duties. | Bob Levey/Getty Images\n\nIn addition to her family, Jenner also has the help of her boyfriend and Stormi’s dad, rapper Travis Scott. Apparently, the young couple has already mastered co-parenting, at least for this stage in their baby daughter’s life.\n\nAn insider told People, “Kylie and Travis are a good team. Travis is able to do his own thing during the day as well, but he helps Kylie out at night. He has cut down on work and only has a few shows coming up.”\n\nNext: Motherly advice\n\n10. Getting advice from mama\n\nKylie Jenner turns to her mom for help. | Frazer Harrison/Getty Images Kylie Jenner turns to her mom for help. | Frazer Harrison/Getty Images\n\nBecause Jenner’s mother, Kris Jenner, has six children of her own and a slew of grandchildren, it would only seem natural that her youngest daughter would reach out to her for advice. According to Cosmopolitan, the “momager” has been a major help for the new mom.\n\nA source told the magazine, “Kris has been spending a lot of time at Kylie’s house since she came home with Stormi. Kylie has been a natural at being a mother. However, it has been overwhelming, and Kylie has relied on Kris during these first days at home with Stormi. Kris is providing advice and, of course, an extra set of hands to help with Stormi.”\n\nNext: A ton of big changes\n\n11. Feeling a little overwhelmed\n\nShe’s hired some help to watch baby Stormi. | She’s hired some help to watch baby Stormi. | Kylie Jenner via Instagram\n\nThough Jenner is obviously obsessed with her daughter, she also felt pretty overwhelmed after Stormi’s birth. As a result, it appears that the socialite has decided to hire a nurse to help assist her with Stormi’s care. After all, Kris Jenner has a thriving business herself and can’t be around for everything.\n\nA source told People,“She knows she can’t rely on [mom Kris Jenner] every day and hired some help for the baby. Kris is helping out as much as she can, but she also runs a business and has her own life.”\n\nNext: Self-care\n\n12. Time for herself\n\nKylie Jenner is making sure to take some time for herself. | Kylie Jenner is making sure to take some time for herself. | Kylie Jenner via Instagram\n\nEven though she’s now hired help, Jenner has only been seen twice in public since giving birth to Stormi. However, the Lip Kit creator seems to understand the importance of taking care of herself. You cannot take care of anyone if you aren’t your best self.\n\nAn insider revealed to People, “Kylie is feeling great and likes leaving the house for short outings.” So far the paparazzi has spotted her leaving a meeting with her bestie, model Jordyn Woods, and heading to a friend’s baby shower.\n\nNext: Staying out of the spotlight\n\n13. The importance of privacy\n\nShe’ll be staying out of the spotlight for a while. | Nicholas Hunt/Getty Images for Huffington Post She’ll be staying out of the spotlight for a while. | Nicholas Hunt/Getty Images for Huffington Post\n\nIf there is one thing we know about the Kardashian-Jenner clan, it’s that they are obsessed with the spotlight. However, Jenner surprised us all when she was pregnant with Stormi. Protecting herself and the energy around her, she decided to keep her pregnancy under wraps until after she gave birth.\n\nShe explained in her pregnancy journey video, “I understand you’re used to me bringing you along on all my journeys. my pregnancy was one I chose not to do in front of the world.”\n\nThough Jenner has been more open since Stormi’s birth, it seems like her privacy policy concerning her daughter will be in effect for a while longer. An insider told US Weekly, “She is extremely protective, and she is very focused on trying to keep motherhood private for right now. She used to love being in the limelight, but that has totally changed. All Kylie wants is for her privacy to be protected right now and [she] is pretty demanding about that at this time.”\n\nNext: Taking it all in\n\n14. A happy little family\n\nThese two are a happy family. | These two are a happy family. | Kylie Jenner via YouTube\n\nIt seems like with Scott, an extra set of hands, and her family at her side, the youngest Jenner is getting a hang of motherhood.\n\nA source told People, “Kylie and Travis are not officially living together. They are co-parenting though, and things are going great. They are together and happy. They’re just enjoying their little family. [Travis Scott is] very sweet with his daughter.”\n\nAdditional reporting by Aramide Tinubu.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/02/kylie-jenner-tracksuit.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png", "https://www.cheatsheet.com/wp-content/uploads/2018/01/kriskylie.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/kylie-jenner-prabal-gurung-333x500.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/03/Expecting-baby-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/kylie-jenner-baby.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Kylie-Jenner-mirror-selfie-in-her-bathroom-587x500.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/f6f1cdbc-27b9-42e7-a5d7-f6276993e3dc-screen-shot-2018-02-06-at-94949-am.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kylie-Jenner-pregnant.png?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Kylie-Jenner-mirrr-selfie.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Kylie-Jenner-teatox-609x500.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/kylie-jenner-stormi-duo-640x453.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Travis-Scott-2.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Kylie-Jenner.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png", "keywords": [], "authors": ["Lauren Weiler"], "canonical_link": "https://www.cheatsheet.com/health-fitness/how-kylie-jenner-lost-weight-post-pregnancy.html/", "title": "Kylie Jenner Has Lost a Startling Amount of Weight Post-Pregnancy, and Here’s How", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/how-kylie-jenner-lost-weight-post-pregnancy.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "After Kylie Jenner had baby Stormi, fans freaked out about her sudden weight loss. Here's how she lost the weight so quickly.", "og": {"locale": "en_US", "type": "article", "title": "Kylie Jenner Has Lost a Startling Amount of Weight Post-Pregnancy, and Here's How", "description": "After Kylie Jenner had baby Stormi, fans freaked out about her sudden weight loss. Here's how she lost the weight so quickly.", "url": "https://www.cheatsheet.com/health-fitness/how-kylie-jenner-lost-weight-post-pregnancy.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-21T21:30:04-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "pregnancy", "section": "Health & Fitness", "published_time": "2018-06-21T21:30:00-04:00", "modified_time": "2018-06-21T21:30:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "After Kylie Jenner had baby Stormi, fans freaked out about her sudden weight loss. Here's how she lost the weight so quickly.", "title": "Kylie Jenner Has Lost a Startling Amount of Weight Post-Pregnancy, and Here's How", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Kim-Kylie-Chicago-nursery-640x360.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529631000.0, "source": "http://www.cheatsheet.com", "summary": ""}