{"url": "www.inquisitr.com/4362328/katie-holmes-and-jamie-foxxs-relationship-is-nothing-more-than-a-booty-call/", "text": "Katie Holmes and Jamie Foxx have been facing dating rumors for the past four years but is the couple’s rumored relationship strictly physical?\n\nAccording to a new report, Jamie Foxx has been accused of flirting with another woman, and when it comes to his dedication to the mother of one, an insider claims he treats her like a “booty call.”\n\nOn July 12, In Touch Weekly magazine shared a report regarding Katie Holmes and Jamie Foxx’s alleged romance, claiming that while they’ve been linked since 2013, Holmes reportedly wasn’t on Foxx’s mind when he celebrated the Fourth of July earlier this month.\n\nAs an insider explained, Jamie Foxx attended the Red, White and Bootsy Party on July 4 and ran over to a slender brunette. He allegedly started dancing and flirting with the woman right away. According to the report, Foxx appeared to be a real ladies’ man during the event and didn’t care who was watching.\n\nDespite being linked to Katie Holmes for years, Jamie Foxx reportedly acts like a frat boy when he goes out, and his rumored relationship with the actress becomes an afterthought. Meanwhile, the source claims Katie Holmes is in love with Jame Foxx and hopes to marry him one day.\n\n“Jamie treats her like a booty call. He just won’t commit,” the insider claimed.\n\nKatie Holmes and Jamie Foxx reportedly experienced excitement when their alleged romance began years ago and would often meet up late at night or early in the morning to avoid being seen. Now, as friends reportedly grow concerned for Holmes’ happiness, the source claims Holmes is well-aware of what is happening between her and the reported playboy.\n\nA post shared by Jamie Foxx (@iamjamiefoxx) on Jun 22, 2017 at 9:36pm PDT\n\nKatie Holmes and Jamie Foxx haven’t been seen together this month, but last month, they both turned up in Century City around the same time. Although they weren’t photographed together at the time, an E! News reported noted that the outing happened five years after Holmes and her ex-husband, Tom Cruise, divorced.\n\nA post shared by Katie Holmes (@katieholmes212) on Jul 9, 2017 at 4:45am PDT\n\nKatie Holmes shares daughter Suri with her ex-husband, Tom Cruise, and Jamie Foxx is the father of two daughters from a previous relationship.\n\n[Featured Image by Dimitrios Kambouris/Getty Images]", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/07/katie-holmes-booty-call.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/4362328/katie-holmes-and-jamie-foxxs-relationship-is-nothing-more-than-a-booty-call/", "title": "Katie Holmes And Jamie Foxx’s Relationship Is Nothing More Than A ‘Booty Call’?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}