{"url": "https://www.usatoday.com/story/life/people/2018/07/09/tab-hunter-star-damn-yankees-dies-86/767546002/", "text": "Staff and wire reports\n\nUSA TODAY\n\nTab Hunter, the All-American movie star who made teen hearts race in the 1950s with his blond good looks and blue eyes, has died at 86, his longtime partner Allan Glaser confirmed to USA TODAY.\n\nGlaser said Hunter collapsed in front of their home in Santa Barbara, Calif., and went into cardiac arrest after a blood clot migrated from his leg to his heart. He added that medical personnel spent six hours trying to revive him, without success.\n\nHe would have turned 87 on Wednesday.\n\nIn addition to his hit movies, his recording of “Young Love” topped the Billboard pop chart in 1957.\n\nBut in his 2005 memoir, “Tab Hunter Confidential: The Making of a Movie Star,” Hunter recounted the stresses of being a love object to millions of young women when he was, in reality, a gay man.\n\n“I believed, wholeheartedly – still do – that a person’s happiness depends on being true to themselves,” he wrote. “The dilemma, of course, that was being true to myself – and I’m talking sexually now – was impossible in 1953.”\n\nBorn Arthur Andrew Kelm, his screen tab (slang for “name” at the time) was fabricated by Henry Willson, the same talent agent who came up with the names Rock Hudson and Rory Calhoun.\n\nThe legend goes that Willson said to the young man: “We’ve got to find something to tab you with. Do you have any hobbies?” His client answered, “I ride horses. Hunters.” Agent: “That’s it! We’ll call you Tab Hunter.”\n\nWith no dramatic training, Hunter was cast in a minor role in the 1950 drama, “The Lawless.” The fuss over the young actor began two years later when he appeared bare-chested opposite Linda Darnell in the British-made “Island of Desire.” Soon his handsome face and muscular build appeared on magazine covers. Warner Bros., alert to the increasingly important youth market, signed him to a contract.\n\nHunter made a flurry of movies in the latter half of the 1950s, aimed at capitalizing on his popularity with young girls. The films included such war dramas as “Battle Cry” (with Van Heflin) and “Lafayette Escadrille” (Clint Eastwood in a small role). He made the Westerns “The Burning Hills” (Natalie Wood) and “They Came to Cordura” (Gary Cooper, Rita Hayworth). And he made romantic comedies like “The Pleasure of His Company” (Fred Astaire, Debbie Reynolds.)\n\nA highlight was the 1958 “Damn Yankees!,” an adaptation of the hit Broadway musical with Gwen Verdon and Ray Walston in their Tony-winning New York roles and the original director, George Abbott, sharing direction with Stanley Donen.\n\nBesides the movies, he displayed his athletic skills – he had been a figure skater as well as horseman – in a TV special, “Hans Brinker, or the Silver Skates.”\n\nAs with so many pop idols, his fans grew up and a new generation sought other favorites. His slide followed the classic pattern: to a television series (“The Tab Hunter Show,” on NBC, 1960-62); European films (“The Golden Arrow”) and cheap kid flicks (“Ride the Wild Surf.”) In his memoir, he took pains to note that “Ride the Wild Surf” was his only beach-party movie; his “Operation Bikini,” despite its title, was “yet another war movie.”\n\nOver the years, he also played small roles in “The Loved One,” “The Life and Times of Judge Roy Bean” and “Grease 2.”\n\nIn the 1980s, he won new fans by appearing in cult movies with Divine, the 300-pound transvestite, notably John Waters’ 1981 “Polyester” and Paul Bartel’s 1985 “Lust in the Dust,” co-produced by Hunter himself.\n\nOf “Polyester,” Hunter wrote: “Everybody got the joke. … For both John and me, our collaboration paid huge dividends: I’d helped ‘legitimize’ his brand of movie, and he made me ‘hip’ overnight.”\n\nHunter appeared on Broadway in 1964 in Tennessee Williams’ “The Milk Train Doesn’t Stop Here Anymore” opposite the formidable Tallulah Bankhead. The play closed within days, and he said it was “completely buried under Tallulah’s offhanded trademark campiness.”\n\nHunter was born in 1931 in New York City, the second son of a mechanic and his German immigrant wife. His father left the family two years later and the boy took his mother’s name, Gelien. Young Arthur Gelien grew up in San Francisco and Long Beach, California, and joined the Coast Guard at 15, lying about his age.\n\nWhile in New York, he saw Broadway plays and became interested in acting. Back in California, Willson arranged for a two-word role in a small Western, “The Lawless.” He got $500 and a new name.\n\nIn his memoir, he said that his career flourished despite some innuendo and smear articles in the scandal sheets – “clear evidence that despite its self-righteous claims, ‘Confidential’ magazine did not influence the taste and opinions of mainstream America.”\n\nWriting the book was difficult, he told The Associated Press in 2005, “because I’m a really private person. I grew up full of denial. I just didn’t like any suggestions or questioning of my sexuality.”\n\nIn 1960, Hunter’s boy-next-door reputation did take a hit when he was charged with cruelty for allegedly beating his dog. (He was acquitted). In recent years, Hunter appeared in dinner theaters and organized film projects. After living on a ranch in New Mexico for a time, he took a home in Montecito with his Glaser.\n\nHe didn’t dwell on his Hollywood career or regret losing it. “I had my fling, and I was very fortunate,” he remarked. “But that’s all in my past.”\n\nGeorge Takei, another actor-turned-gay activist, honored him on Twitter Monday, writing, \"Tab Hunter was so much more than a teen heartthrob—he was a celebrated actor, trailblazer, and an icon for the LGBTQ community. Brad and I extend our deepest condolences to his husband, Allan Glaser. RIP, Tab. You will be sorely missed.\"\n\nZachary Quinto, who came out in 2011, noted on Instagram how he had gotten to know Hunter over the last year. \"What a life! Such a rich experience. such a vital and generous nature. and such a pioneer of self-acceptance and moving through this world with authenticity as his guide. he will be missed greatly. may he rest in peace.\"\n\nHarvey Fierstein, who won Tonys for acting in \"Torch Song Trilogy\" and writing \"La Cage aux Folles\" and \"Kinky Boots,\" called Hunter a \"gawjuss gay icon.\"\n\nContributing: Maria Puente, USA TODAY", "images": ["https://www.gannett-cdn.com/-mm-/e51a0704451f7d10bc603dd5ab1bc6615ffa3c4b/c=0-305-1104-929/local/-/media/2018/07/09/USATODAY/USATODAY/636667288109200163-XXX-D03-TAB-HUNTER-BRIEFLY-10.jpg?width=1104&height=624&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/16b2f11cdcbcec238582c8b3bdf34ce4cbb144b6/c=25-0-1082-1409/local/-/media/2018/07/09/USATODAY/USATODAY/636667288109200163-XXX-D03-TAB-HUNTER-BRIEFLY-10.jpg?width=300&height=400&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/e51a0704451f7d10bc603dd5ab1bc6615ffa3c4b/c=0-305-1104-929/local/-/media/2018/07/09/USATODAY/USATODAY/636667288109200163-XXX-D03-TAB-HUNTER-BRIEFLY-10.jpg?width=1104&height=624&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/07/09/tab-hunter-star-damn-yankees-dies-86/767546002/", "title": "Tab Hunter, 1950s movie-star heartthrob, later gay icon, dies at age 86", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Tab Hunter, 1950s movie-star heartthrob, later gay icon, dies at age 86", "description": "The 1950s heartthrob, who starred in \"Damn Yankees\" made headlines again in 2005 when he came out as gay in an autobiography and documentary titled, \"Tab Hunter Confidential.\"", "url": "https://www.usatoday.com/story/life/people/2018/07/09/tab-hunter-star-damn-yankees-dies-86/767546002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/e51a0704451f7d10bc603dd5ab1bc6615ffa3c4b/c=0-305-1104-929/local/-/media/2018/07/09/USATODAY/USATODAY/636667288109200163-XXX-D03-TAB-HUNTER-BRIEFLY-10.jpg?width=1104&height=624&fit=crop&format=pjpg&auto=webp", "width": 1104, "height": 624}, "type": "article"}, "article": {"author": "Staff and wire reports", "content_tier": "free", "opinion": "false"}, "description": "The 1950s heartthrob, who starred in \"Damn Yankees\" made headlines again in 2005 when he came out as gay in an autobiography and documentary titled, \"Tab Hunter Confidential.\"", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/e51a0704451f7d10bc603dd5ab1bc6615ffa3c4b/c=0-305-1104-929/local/-/media/2018/07/09/USATODAY/USATODAY/636667288109200163-XXX-D03-TAB-HUNTER-BRIEFLY-10.jpg?width=1104&height=552&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Tab Hunter, 1950s movie-star heartthrob, later gay icon, dies at age 86", "description": "The 1950s heartthrob, who starred in \"Damn Yankees\" made headlines again in 2005 when he came out as gay in an autobiography and documentary titled, \"Tab Hunter Confidential.\""}}, "movies": [], "publish_date": 1531065600.0, "source": "https://www.usatoday.com", "summary": ""}