{"url": "www.elitedaily.com/p/how-did-kendall-jenner-blake-griffin-meet-heres-what-we-know-6781316", "text": "It's been a busy few months for the Kardashian/Jenner family. With pregnancy rumors a-swirling and just about every sister involved romantically with somebody, it was only a matter of time before Kendall Jenner jumped into a new relationship. People are wondering how Kendall Jenner and Blake Griffin met, and it's like... I don't know, you guys. How does ANYONE meet a famous supermodel and reality TV star and/or professional athlete? My guess is someone's \"people\" called the other person's \"people\" and set up a lunch date like I've read about in old-timey novels, but then again, I'm not famous. I literally have no idea how things work.\n\nAll I know is Jenner has been to at least four basketball games to catch Griffin play with his team, the Los Angeles Clippers, and they've had a few dinners together. If that doesn't shout \"MAYBE THEY'RE BECOMING A 'THING'\" I literally don't know what else does.\n\nJenner and Griffin were first linked together back in September of 2017 when they went out for dinner in New York City. The two dined at a spot called Carbone (bone... hehehe) and reportedly saw the movie It. I mean, a swanky Italian dinner followed by a scary movie? Sounds like a good ol' fashioned high school date night to me. Since then, Jenner has been regularly attending his games and even celebrated her 22nd birthday with him.\n\nE! reports that Jenner partied on her big day with family and friends at a taqueria in Los Angeles and that she and Griffin arrived separately. Still, an insider says the two spent the entire evening together. The source added, \"They weren't overly affectionate, but they spent a lot of time talking closely and dancing.\"\n\nMaybe that's because most of Jenner's family was there, including family matriarch Kris Jenner, Corey Gamble, Kim and Kanye West, and Caitlyn Jenner.\n\nAnother source told People magazine that they started dating casually, but now things are picking up. The source said,\n\nKendall is very happy with Blake. They started out more like friends, and then it was very casual. But it seems more serious lately. When they are not together, they keep in touch over the phone. Her family has accepted Blake. They are spending time getting to know him.\n\nYet another insider told US Weekly that the pair is \"full on,\" claiming,\n\nThey’re legit. They’re a full-on couple. Kendall has been going to a lot of his games and they have been enjoying time at home when Blake is in town. They’re good.\n\nNot for nothing, Griffin sounds like a pretty awesome guy. While he was once named One Of The Greatest Rookies Of All Time by Sports Illustrated, you might have also caught him flexing some comedy chops on the hit series Broad City. Griffin has somewhat of an affinity for comedy, and has even performed at Montreal's mega-comedy festival Just For Laughs. He also co-parents two kids, ages one and four, with his ex, Brynn Cameron, which Griffin says has changed a lot for him.\n\nHe told the Los Angeles Times,\n\nNow it’s like what kind of example am I leaving or setting for my son... When my daughter can actually know what’s going on? What type of example am I showing her about how she should expect to be treated by men and all those things...\n\nHe added, \"Like, that’s the biggest thing … I spend my time a little different and I think a little differently.\"\n\nSpend your time a little different like... hanging out with Kendall Jenner all the time? We totally get it.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/8/b47cc3b6-d313-4b09-b396-8fb0f48d2b13-getty-1205807538.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/f2d41d12-2957-4f14-83a9-45d955e82f13-getty-930538154.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/12/5/b6907b32-2837-4e12-9e32-08bc66f8f6bb-blake-kendall.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/12/5/b6907b32-2837-4e12-9e32-08bc66f8f6bb-blake-kendall.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2017/12/5/b6907b32-2837-4e12-9e32-08bc66f8f6bb-blake-kendall.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/how-did-kendall-jenner-blake-griffin-meet-heres-what-we-know-6781316", "title": "How Did Kendall Jenner & Blake Griffin Meet? Here's What We Know", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/how-did-kendall-jenner-blake-griffin-meet-heres-what-we-know-6781316", "type": "article", "title": "Here's Everything We Know About Kendall Jenner's Relationship With BF Blake Griffin", "description": "It's been a busy few months for the Kardashian/Jenner family. With pregnancy rumors a-swirling and just about every sister involved romantically with somebody, it was only a matter of time before Kendall Jenner jumped into a new relationship. People…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/12/5/b6907b32-2837-4e12-9e32-08bc66f8f6bb-blake-kendall.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It's been a busy few months for the Kardashian/Jenner family. With pregnancy rumors a-swirling and just about every sister involved romantically with somebody, it was only a matter of time before Kendall Jenner jumped into a new relationship. People…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}