{"url": "https://www.thefix.com/fuller-house-star-jodie-sweetin-slams-accusations-she-s-not-sober", "text": "'Fuller House' Star Jodie Sweetin Slams Accusations That She’s Not Sober\n\nThe ex-husband of Jodie Sweetin is alleging that the actress may have turned to drugs again due to a recent split from her fiancé.\n\nA rep for Jodie Sweetin, who plays Stephanie Tanner on the Netflix sitcom Fuller House, has slammed “completely baseless” claims that she’s no longer sober and unfit to parent.\n\nAccording to E! News, her ex-husband claims that the actress is also refusing his demands to take a drug test though Sweetin's rep says that her client \"will comply with all of the courts' requests.\"\n\nMorty Coyle, Sweetin’s ex, has charged in court documents that she has turned to drugs to deal with a recent split from her fiancé, putting their 7-year-old daughter Beatrix at risk. “This is not the first time Mr. Coyle has made ridiculous accusations about Jodie which were utterly untrue,” Sweetin’s rep told E! News.\n\nHowever, The Blast is reporting that as part of their custody agreement, the actress must submit to a hair follicle test within 12 hours of Coyle’s request. Coyle noted that Sweetin has had “well-documented” struggles with drug addiction, including alcohol, crystal meth, ecstasy, cocaine and various prescription medications.\n\nIn an appearance on ABC’s Dancing With the Stars, Sweetin openly acknowledged her struggles with addiction. “Drugs and alcohol just sort of numbed everything,” she said. “I was doing cocaine, and ecstasy, and alcohol, and all that. The darkest moments for me weren't necessarily ending up in the hospital and all that. It was those quiet moments alone when I'd just hated the person I'd become.”\n\nShe said that she turned to drugs as she battled depression in the years following the 1995 cancellation of Full House (the original series that preceded the Netflix revival), which ran for eight successful seasons.\n\nSweetin was also candid about her addiction (and recovery) in her memoir unSweetined, where she detailed just how far down the road her demons had taken her. The gateway was getting drunk at fellow Full House star Candace Cameron Bure’s wedding: “I probably had two bottles of wine, and I was only 14,” she admitted. “That first drink gave me the self-confidence I had been searching for my whole life. But that set the pattern of the kind of drinking that I would do.”\n\nCase in point: she later found herself snorting lines of crystal meth at the premiere of her former castmates Mary-Kate and Ashley Olsen’s 2004 film New York Minute. For the most part, Sweetin managed to keep her addiction hidden from the public eye. “I look at photos from that [premiere], and I didn't even look strung out,” she noted. “I was pulling off the deceit. It was hard for people to believe I was doing that much drugs.”\n\nIn her memoir, Sweetin added that her mother also fought addiction, putting the actress up for adoption when she was only nine months old. \"I would hear stories about my mom leaving me to go off and party. And for years I was like, ‘F— her. How could somebody do that to their kid?’” she said. “When I started seeing my own addiction getting in the way of being a mom, I finally understood: If you're not in the right place to get sober, you're not ready to be a mom.”\n\nSweetin contends she got sober for the sake of her own children, but ex-husband Coyle doesn’t believe that her drug past is behind her. Court documents indicate that red flags went up for Coyle when he spoke to her on the phone, becoming concerned that she sounded addled. While he acknowledged that Sweetin has enjoyed periods of extended sobriety, he claims that she’s also had “many private relapses.” Still, she actress maintains that Coyle’s accusations are as untrue as the walls of her sitcom are soundstage façades.", "images": ["https://www.thefix.com/sites/default/files/styles/article/public/Jodie.jpg", "https://www.thefix.com/sites/default/files/styles/sc50x50/public/Kusnacht%20Practice.jpg", "https://www.thefix.com/sites/all/modules/contrib/lazyloader/image_placeholder.gif", "https://www.thefix.com/sites/default/files/styles/medium/public/PaulFuhr_Profile_032917.jpg", "https://www.facebook.com/tr?id=1454120888203161&ev=PageView&noscript=1", "https://www.thefix.com/sites/default/files/styles/sc50x50/public/visionstreatment.jpg", "https://www.thefix.com/sites/default/files/Jodie.jpg", "https://www.thefix.com/sites/all/themes/thefixv2/logo.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thefix.com/sites/default/files/Jodie.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.thefix.com/fuller-house-star-jodie-sweetin-slams-accusations-she-s-not-sober", "title": "'Fuller House' Star Jodie Sweetin Slams Accusations That She’s Not Sober", "meta_data": {"referrer": "unsafe-url", "viewport": "width=device-width, initial-scale=1.0", "og": {"article": {"author": {"profile_image": "https://www.thefix.com/sites/default/files/PaulFuhr_Profile_032917.jpg"}}, "site_name": "The Fix", "type": "article", "url": "https://www.thefix.com/fuller-house-star-jodie-sweetin-slams-accusations-she-s-not-sober", "title": "'Fuller House' Star Jodie Sweetin Slams Accusations That She’s Not Sober | The Fix", "description": "The ex-husband of Jodie Sweetin is alleging that the actress may have turned to drugs again due to a recent split from her fiancé.", "updated_time": "2018-11-11T16:27:07-05:00", "image": {"identifier": "https://www.thefix.com/sites/default/files/Jodie.jpg", "secure_url": "https://www.thefix.com/sites/default/files/Jodie.jpg"}}, "description": "The ex-husband of Jodie Sweetin is alleging that the actress may have turned to drugs again due to a recent split from her fiancé.", "keywords": "Fuller House, Jodie Sweetin, drug addiction, drug use allegations, sobriety, drug tests, co-parenting,", "news_keywords": "Fuller House, Jodie Sweetin, drug addiction, drug use allegations, sobriety, drug tests, co-parenting,", "fb": {"app_id": 104762786600092}, "article": {"author": "Paul Fuhr", "published_time": "2017-09-29T10:30:00-04:00", "modified_time": "2018-11-11T16:27:07-05:00"}}, "movies": [], "publish_date": 1506695400.0, "source": "https://www.thefix.com", "summary": ""}