{"url": "https://www.rollingstone.com/music/music-features/cardi-b-and-offset-a-hip-hop-love-story-628750/", "text": "One humid afternoon in Atlanta, Cardi B, the new princess of hip-hop, wakes up in an endless white mansion flanked by tall trees. This is her fiancé’s castle – he’s Offset from Migos – and there are enough six-figure cars parked outside to form a small-town parade. By the curved dark-wood door, his friends smoke blunts in tracksuits as bright as British guardsmen’s jackets. Cardi, 25, and Offset, 26, are buying a new home shortly, and building a dream house too. But for now, this is the spot.\n\nWaking up late, Cardi pads around the house barefoot in a yellow cotton dress pulled tight over her swollen, nearly seven-and-a-half-months-pregnant belly. She eats a salad, manages the feat of typing on her phone with three-inch rhinestone-encrusted fake nails, and relaxes into a leather chair. Half zoning out, half watching Avatar, about a different princess and her race to save a far-off moon, she lets out a deep sigh. We are in the late stages of Cardi’s pregnancy and she’s finally wrapped the promotion for her first album, Invasion of Privacy, which topped the charts and set a record for the most first-week streams by a female artist on Apple Music. The exhausting pace of the past months – spent recording songs, perfecting a raft of lush videos and hiding her belly from the paparazzi – is receding now. All she needs to do is enjoy the next seven weeks before she becomes a mom.\n\nBut being Cardi, she can’t quite do that. In her songs, she may seem like a 24/7 bad bitch, but today, her face scrubbed clean of makeup and unbrushed, Rapunzel-like blond wig hanging to her waist, she’s a curious combination of raunchy extrovert and angst-plagued introvert. Right now, she’s worrying about the upcoming baby shower for the girl inside her tummy, which she still hasn’t planned. “I’ve got to buy mad flights for my friends from New York,” she says, jiggling her leg, a childhood habit that she indulges in when she’s nervous. “I haven’t even sent the invitations.” Her eyes dart around the room. “I forget everything.”\n\nSee behind the scenes of the Rolling Stone cover shoot with Cardi B and Offset\n\nShe’s saying this to a couple of members of Offset’s extended family who have dropped by for a visit, one of them carrying an infant in tiny white, spotlessly clean sneakers. They listen and nod along, then try to boost her confidence. “You got it like that, you’re a ballplayer,” one says to her. “Ballplayer, my ass!” Cardi replies, shaking her head. She closes her eyes, contemplating her to-do list.\n\nThen they spring open. “I want a lit baby shower,” she declares, waving around a bejeweled finger that catches the light of a grand chandelier hanging behind her while echoing an earlier thought. “My baby shower’s not starting at no 5:00. My shit is going to start at 9 p.m. because that’s how I celebrate, that’s how Caribbean people celebrate.” She lets out one of her trademark cackles. “I don’t like baby showers that be at 5 p.m. in the backyard, eating, cooking hors d’oeuvres. Nah.” She gets a mischievous look on her face. “Shit, I might even drink some red wine. Red wine’s healthy, right?”\n\nOffset’s family was laughing, but this makes them stop. “Don’t let Mama see you drinking that red wine,” says one of them, referring to Offset’s mom. “She’s going to have a fit.” Cardi laughs, but then appears to think this over. She’s going to be a mother. She has responsibilities to assume.\n\nIn the year or so since she’s become hip-hop’s breakout star, Cardi has come to represent the best of what we value as a country: She’s our irrepressibly cute, sexy, silly, filthy-mouthed Binderella who bootstrapped her way from the streets to celebrity. Once positioning herself as little more than a “regular, degular, shmegular girl from the Bronx,” she’s transformed into a multimedia artist with powerful facets to her personality both on and off the stage. She’s a Caribbean queen purveying the Latin-trap sound (see her Top 10 hit and song-of-the-summer candidate “I Like It”); she’s an ex-stripper with butt injections who’s after your money; she’s a possible former member of the Bloods and such a city girl that she never got a driver’s license and says today that she still carries a knife.\n\nGrowing up with a cab-driving Dominican dad and a strict Trinidadian mom who worked as a cashier, Cardi, born Belcalis Almanzar, rebelled early, fighting with her mom and misbehaving at school. By 19, she was living with a boyfriend who, she says, abused her. Stripping “saved me,” she has said, meaning the money made her independent. She started hosting parties (her job was to “get things turnt up”) and gathered 80,000 followers as a hot girl with a wicked sense of humor on Instagram. She leveraged her role on VH1’s Love & Hip-Hop to launch a rap career, which took off with the release of “Bodak Yellow” last June. “I built the fan base,” she declares, whipping a few blond locks over a shoulder. “No record label, no money, nothing can make you. You make yourself.”\n\nEven with her wild success, guileless personality and castle-dwelling lifestyle, Cardi in conversation still comes across as someone who might pull a knife on you if need be. She expresses genuine indignation toward people who look down on her for her accent and lack of education, and complains about trolls on the Internet: “These people who want to take food out of my mouth, and my future child’s mouth and my parents’ mouth – for what?” And when she looks back at her past, it’s not through rose-colored glasses. She resents growing up without money and the limited choices that institutionalized poverty offered her, and uses that energy every day to propel forward her music and her dreams, especially her dreams for her baby.\n\nThe baby – that’s all anyone is talking about here today. Bounding over with a beaming smile, Offset hands Cardi his phone, where his mom is waiting to talk to her on FaceTime. She wants to discuss whether Cardi should fly with Offset to New York soon, or if flying late in pregnancy is dangerous for the baby, and also, by the way, has she gone shopping for furniture for the new house yet? Cardi listens, nodding her head, polite, but when Offset hangs up the phone, she stares into space.\n\nBorn Kiari Kendrell Cephus, Offset has a rap sheet that includes gun and drug charges and an eight-month stint in jail, and has fathered three children with three different women. But the world knows him from Migos’ platinum albums and the crossover success of “Bad and Boujee” (which he chalks up to “people wanting the real shit!”). Wearing a tight white T-shirt and multiple diamond chains wrapped around his neck, and speaking in a tender tone, he is dapper and handsome, a lady killer to Cardi’s sex bomb. When I ask if he has a jewelry addiction, he says, “I don’t have an addiction, I have a fetish.”\n\nFurniture has been moved out of the first-floor parlor room in this home so he can hang dozens of his outfits, paired with shoes, because he can’t fit all his clothes in an upstairs closet; Cardi rolls her eyes at this and says, “He’s a boy.” His hands are also cut up from a vicious accident with his green 2018 Dodge Challenger SRT Hellcat two weeks ago. Six stitches cover the front of a palm. When Cardi first saw him after the accident, covered in blood, she thought he was shot and almost lost her mind.\n\nTheir romance is a hip-hop love story – a first date at the Super Bowl in 2017 (“That’s a power move,” Offset told Rolling Stone), followed about eight months later by his marriage proposal, on his knee with an eight-carat engagement ring, onstage during a Philadelphia concert. A couple of months later, there was a slight derailment in the tunnel of love: An iCloud hack allegedly caught Offset in a compromising position with another woman, but he and Cardi made amends, and he inked a new tattoo of Cardi’s name on his neck. (Cardi defended her decision to forgive him, in part, by telling a magazine, “I ain’t no angel.”) In April, Cardi publicly debuted the baby bump on Saturday Night Live in a form-fitting white dress, followed by a video posted online of her jumping around backstage yelling, “I’m finally free!”\n\nAs the lovebirds chat, Cardi absentmindedly caresses Offset’s arm, and later she says, “People want to make fun of me, saying I’m the fourth baby mom,” but “I know I’m not having a baby with a shitty-ass man.” Offset explains, “We really love each other. She’s real. I wanted real. I also wanted successful.” He isn’t threatened by his fiancée’s success, as some men might be. “My mama was the man of my household,” he says, adding, almost as a proclamation, “Guys, fellas! You’ll lose your wife trying to stop them from being the best they can.” These days, Offset is trying to take a page from Cardi and become more open and engaging in public, instead of portraying himself as hard. “That’s what I need to work on – my charisma in front of people,” he says solemnly.\n\nMotherhood, the circumscribed world of diapers and bottles and putting up play swings – Cardi is looking forward to crossing into it. She has a strict mom, Offset has a tough mom, and she grew up with a Caribbean vision of motherhood that involves tending closely to your child and trying to keep them from “eating in the streets.” Of course, she’s nervous, too, about her new responsibilities: “I’m scared I won’t be that kind of mom,” she confesses.\n\nWas the baby planned? Well, no. Late last year, Cardi began to be grossed out by food and not feel quite right. She and Offset had had some sexy pillow talk about making a baby, but she didn’t mean it – not right now. When a home pregnancy test came back positive, she immediately FaceTimed him. “He was like, ‘What? Are you sure?’ ” she says. “I said, ‘Yeah.’ And then he just started smiling really hard.”\n\nAt first, she kept the pregnancy quiet, talking with Offset about what to do. “He said, ‘What do you mean, what are you going to do? You’re going to keep it.’ ” She was consumed with worry. “A lot of successful women have kids, and a lot of successful artists have kids, but not at the peak of their career,” she says. And when she told her close friends and her team, they were apprehensive. “It was like, ‘You can’t do this. This might fuck up your career,’ ” she declares, resting her hands on her lap.\n\nMaking Invasion of Privacy became a logistical puzzle. Even as Cardi was trying to sync competing demands – keeping club appearances and concerts she’d already booked, starting work on the album, lining up directors for her videos – word leaked to Atlantic, her label, that she was pregnant. “The media didn’t even let me tell people, and I hated that,” she says. “I really wanted to tell them [Atlantic Records] myself, to sit down with them and tell everybody that I am pregnant and I have a plan.”\n\nThe label recommended that Cardi record far from New York, to avoid the distraction of friends and family. At four months pregnant, she says, she entered a studio in L.A. but was too drowsy from pregnancy hormones to concentrate. “We were making green juice and coffee,” she says. “I used to tell God, ‘Please don’t make me sleepy.’ ” After confessing her pregnancy to her engineer, she asked him and producers to tag along with her, to where she had prebooked appearance dates, to record on the fly. “All of the creative team kind of followed her around the country, from L.A. to Miami to Atlanta to New York, back to Atlanta,” says Craig Kallman, the CEO of Atlantic Records. Some nights, she’d sleep in the studio; others, she would try to get a good night’s rest to maintain her health for herself and the baby. “I was blown away by her stamina,” Kallman says, plus “her inner strength and her creative instincts.”\n\nOffset consulted with Cardi each step of the way. She has broken up with her manager Klenord “Shaft” Raphael, who is suing her and her new team for more than $10 million. She’s not embarrassed about using “co-writers”: Pardison Fontaine, who wrote the main verse of “Be Careful,” is a “dope-ass artist,” she says. Offset helped with Invasion of Privacy, he says, by, among other things, calling Chance the Rapper to collaborate on “Best Life.” “She doesn’t want to call and ask, ‘Can you do this song?’ You don’t think she’s shy, but she don’t like asking for no feature or no song, nothing. But I don’t give a damn.”\n\nInvasion of Privacy is the great album that Cardi didn’t really need to make, converting her huge personality into hooks, laugh lines (“Only thing fake is the boobs!”) and whispers about wanting a man who’ll take care of her heart. It’s the music version of her Instagram – all killer, no filler. Offset says their artistic instincts are mostly aligned, though he loves Auto-Tune, she hates it. She doesn’t want to pretend, doesn’t want to assume a generic voice. “She wants you to hear the struggle, so you feel it,” he says.\n\nOffset’s musical ambitions are vast. He’s considering putting out solo tracks this summer, including collaborations with 21 Savage and Metro Boomin. He wants the legacy of artists he idolized growing up: Michael Jackson, Sammy Davis Jr., James Brown and Prince, plus Lil Wayne and Lil Boosie (now Boosie Bad-azz). He was a standout dancer as a kid, putting on Jackson’s dress shirt and socks to entertain his mom, and even performing behind Usher and Whitney Houston in music videos shot in Atlanta. “Everything has to be tight,” says Offset. “It’s got to be a masterpiece like Michael Jackson’s, the same way he treated his music, his dance moves, his stage presence, his outfit, his hair, makeup, whatever it was.”\n\nWhen I ask each of them what they do for fun, they laugh. They aren’t into clubs (“Too much bull,” says Offset), or cooking (amply clear from a kitchen filled with takeout containers) or even binge-watching TV. What music do they listen to? Their own, mostly, both to enjoy it and to meditate on how to make it better. The previous week, Cardi even tweeted that she was amazed that Donald Glover and Childish Gambino look so much alike, not realizing they’re the same person. “When you look for him on Apple, his covers are not his face, so how the fuck am I supposed to know him?” she says today of Gambino. “Everybody’s judging me and calling me stupid, and it’s like” – here comes the heavy Caribbean accent – “ ‘Fuck ya, leave me alone.’ ”\n\nSumming up their lives together, Offset says, “We work. With a day off, we’ll be in bed all day, just enjoying each other’s company. It ain’t about going to no movie, no dinner, nothing. We can go eat McDonald’s or Wendy’s. She might want a chocolate Frosty.” He adds, “We done so much bizarre shit with each other – rings and cars and chains. We got that out of the way.”\n\nOffset runs away and Cardi’s back on her phone, handling her business with her talons and jiggling that leg up and down. If Atlanta is her new home, she’ll make it work, though she sometimes feels trapped in the castle, since she doesn’t know how to drive. But “my boo is very down-South,” and she needs to respect that. Offset doesn’t like the weather or the pace in New York, and wants to build an empire down here, not necessarily a Jay-Z-and-Beyoncé-style music empire, but one primarily made of straight cash. Cardi says they’ll invest in anything that “makes our money work,” like apps, Subway franchises or nail salons.\n\nWe talk about the news for a while: She’s disgusted by President Trump and wants her fans to vote in upcoming local elections. “Every artist has explained how harmful he is,” she says. “He has made divisions in this country – he almost made a crazy civil war between the blacks and the whites. He has proven himself to be a madman so many times, and proven himself to be disrespectful to women, and that still hasn’t gotten him impeached.” Then she adds, “Clinton got impeached for cheating on his wife, and it’s so clear that this nigga has sex with so many porn stars, and he’s just been shown to be a dickhead, and it’s like, ‘Nope.'”\n\nThis leads into a conversation about gun laws, which Cardi thinks should be stricter and involve mental evaluations, though she supports the right to bear arms. “God forbid, the government tries to take us over, and we can’t defend ourselves because we don’t have no weapons.” She adds, “How do you think American colonizers went to Africa and it was so easy for them to get those people? Because they had guns. No matter what weapon you have, you can’t beat a gun.” She shrugs. “They have weapons like nuclear bombs that we don’t have. So imagine us not having any weapons at all.”\n\nThis is straying far from baby talk, so we discuss how she’s going to deal with the infant on her upcoming tour (she will be opening for Bruno Mars for seven weeks beginning in September). Cardi is not sure about breast-feeding – she says her breasts are overly sensitive and she can’t imagine how she would deal with a little baby “milking” them – but she wants her kid to be with her constantly. “What I envision is my tour bus has my own personal room, and I just want to be with my baby,” she says. “Only time I don’t have my baby with me is when I’m getting my hair done, makeup done, performing.” She adds, dreamily, “I don’t want to miss one second. I don’t want to miss no smiles, I don’t want to miss no new movement, I don’t want the baby to confuse me and the babysitter.”\n\nCardi wants to be the same woman she is today after giving birth. “Just because I’m a mom, my street credibility’s not gone, my sex appeal’s not gone,” she declares. But how will she open her life up on social media, as she does, with a kid? She’s unsure. “I’m iffy about it,” she says of showing her kid online. “My feelings get hurt when people online talking about family members. I think I’ll kill somebody if somebody talking about my child like that.”\n\nCardi may not have planned her baby shower, but she has plans about how she’ll treat her child. Her mom was too strict, she thinks, and that’s part of why she rebelled. Cardi and her daughter are going to be best friends. She’s going to teach her English and Spanish, and wants her to start learning French by the time she’s four, and she’ll be a little genius. Maybe she’ll take ballet lessons, though toe shoes can mess up your feet. She’ll definitely put her in kid boxing lessons. “I don’t want my kid to get picked on and she don’t know how to defend herself,” says Cardi. “I have a little brother and I always put in his head, since he was two years old, ‘Somebody hit you, you kick, you kick, you kick.’ ”\n\nAnd when the baby gets older, Cardi will tell her about her mom’s crazy life. “I’m going to tell her everything. Everything,” she says, beginning a long soliloquy addressing her unborn child. “You have a choice. I could maintain you. I could spoil you if you go to college. Or if you want to be independent, go ahead. When you a teenager and you 18, 19, you can’t get no job that pays you more than $200 a week.” Her voice starts to rise. “You want to become a stripper? ‘Cause I became a stripper ’cause I ain’t have no choice. You gonna be getting your ass smacked by niggas that have less money than you, less of an education than you, but they going to feel like they better than you because they feel like you need them. You want to live like that?” She sits back, satisfied by the rant. “That’s how I’m going to talk to my kid.”\n\nSoon she pads across the living room in bare feet, making her way over to a beige chenille couch. Then she lies down on her side and neatly places a lime-green fleece blanket on top of her small shape. “I used to tell myself I would buy a house before I turn 25,” she says, before she dozes off, dreaming a million new dreams.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/07/cardi-B-opener.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-features%2Fcardi-b-and-offset-a-hip-hop-love-story-628750%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=628750", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/07/cardi-B-opener.jpg", "keywords": [], "authors": ["Vanessa Grigoriadis", "Vanessa Grigoriadis'S Most Recent Stories", "Cardi B", "Offset", "A Hip-Hop Love Story", "Kim Kardashian", "American Woman", "Inside Tinder S Hookup Factory", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-features/cardi-b-and-offset-a-hip-hop-love-story-628750/", "title": "Cardi B and Offset: A Hip-Hop Love Story", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Cardi B and Offset of Migos: Inside the lives of two chart-topping pop stars as they prepare their greatest collaboration yet: A baby girl.", "news_keywords": "Cardi B, Hip-Hop, Migos", "og": {"type": "article", "title": "Cardi B and Offset: A Hip-Hop Love Story", "url": "https://www.rollingstone.com/music/music-features/cardi-b-and-offset-a-hip-hop-love-story-628750/", "description": "Inside the lives of two chart-topping pop stars as they prepare their greatest collaboration yet: A baby girl", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/07/cardi-B-opener.jpg", "width": 1024, "height": 622}, "locale": "en_US"}, "article": {"published_time": "2018-06-20T12:00:00+00:00", "modified_time": "2018-07-02T16:23:24+00:00"}, "twitter": {"text": {"title": "Cardi B and Offset: A Hip-Hop Love Story"}, "image": "https://www.rollingstone.com/wp-content/uploads/2018/07/cardi-B-opener.jpg?w=1024", "card": "summary_large_image", "site": "@RollingStone", "title": "Cardi B and Offset: A Hip-Hop Love Story", "description": "Cardi B and Offset of Migos: Inside the lives of two chart-topping pop stars as they prepare their greatest collaboration yet: A baby girl."}, "generator": "WordPress 5.4", "author": "Vanessa Grigoriadis", "content_type": "Article", "post_id": 628750, "title": "Cardi B and Offset: A Hip-Hop Love Story", "published_at": "2018-06-20 12:00:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/07/cardi-B-opener.jpg?w=1024", "comment_count": 0, "tags": "Migos", "topics": "Music Features", "body": "One humid afternoon in Atlanta, Cardi B, the new princess of hip-hop, wakes up in an endless white mansion flanked by tall trees. This is her fiancé's castle – he's Offset from Migos – and there are enough six-figure cars parked outside to form a small-town parade. By the curved dark-wood door, his friends smoke blunts in tracksuits as bright as British guardsmen's jackets. Cardi, 25, and Offset, 26, are buying a new home shortly, and building a dream house too. But for now, this is the spot.\r\nWaking up late, Cardi pads around the house barefoot in a yellow cotton dress pulled tight over her swollen, nearly seven-and-a-half-months-pregnant belly. She eats a salad, manages the feat of typing on her phone with three-inch rhinestone-encrusted fake nails, and relaxes into a leather chair. Half zoning out, half watching Avatar, about a different princess and her race to save a far-off moon, she lets out a deep sigh. We are in the late stages of Cardi's pregnancy and she's finally wrapped the promotion for her first album, Invasion of Privacy, which topped the charts and set a record for the most first-week streams by a female artist on Apple Music. The exhausting pace of the past months – spent recording songs, perfecting a raft of lush videos and hiding her belly from the paparazzi – is receding now. All she needs to do is enjoy the next seven weeks before she becomes a mom.\r\nBut being Cardi, she can't quite do that. In her songs, she may seem like a 24/7 bad bitch, but today, her face scrubbed clean of makeup and unbrushed, Rapunzel-like blond wig hanging to her waist, she's a curious combination of raunchy extrovert and angst-plagued introvert. Right now, she's worrying about the upcoming baby shower for the girl inside her tummy, which she still hasn't planned. \"I've got to buy mad flights for my friends from New York,\" she says, jiggling her leg, a childhood habit that she indulges in when she's nervous. \"I haven't even sent the invitations.\" Her eyes dart around the room. \"I forget everything.\"\r\nSee behind the scenes of the Rolling Stone cover shoot with Cardi B and Offset\r\n\r\nShe's saying this to a couple of members of Offset's extended family who have dropped by for a visit, one of them carrying an infant in tiny white, spotlessly clean sneakers. They listen and nod along, then try to boost her confidence. \"You got it like that, you're a ballplayer,\" one says to her. \"Ballplayer, my ass!\" Cardi replies, shaking her head. She closes her eyes, contemplating her to-do list.\r\nThen they spring open. \"I want a lit baby shower,\" she declares, waving around a bejeweled finger that catches the light of a grand chandelier hanging behind her while echoing an earlier thought. \"My baby shower's not starting at no 5:00. My shit is going to start at 9 p.m. because that's how I celebrate, that's how Caribbean people celebrate.\" She lets out one of her trademark cackles. \"I don't like baby showers that be at 5 p.m. in the backyard, eating, cooking hors d'oeuvres. Nah.\" She gets a mischievous look on her face. \"Shit, I might even drink some red wine. Red wine's healthy, right?\"\r\nOffset's family was laughing, but this makes them stop. \"Don't let Mama see you drinking that red wine,\" says one of them, referring to Offset's mom. \"She's going to have a fit.\" Cardi laughs, but then appears to think this over. She's going to be a mother. She has responsibilities to assume.\r\nIn the year or so since she's become hip-hop's breakout star, Cardi has come to represent the best of what we value as a country: She's our irrepressibly cute, sexy, silly, filthy-mouthed Binderella who bootstrapped her way from the streets to celebrity. Once positioning herself as little more than a \"regular, degular, shmegular girl from the Bronx,\" she's transformed into a multimedia artist with powerful facets to her personality both on and off the stage. She's a Caribbean queen purveying the Latin-trap sound (see her Top 10 hit and song-of-the-summer candidate \"I Like It\"); she's an ex-stripper with butt injections who's after your money; she's a possible former member of the Bloods and such a city girl that she never got a driver's license and says today that she still carries a knife.\r\nGrowing up with a cab-driving Dominican dad and a strict Trinidadian mom who worked as a cashier, Cardi, born Belcalis Almanzar, rebelled early, fighting with her mom and misbehaving at school. By 19, she was living with a boyfriend who, she says, abused her. Stripping \"saved me,\" she has said, meaning the money made her independent. She started hosting parties (her job was to \"get things turnt up\") and gathered 80,000 followers as a hot girl with a wicked sense of humor on Instagram. She leveraged her role on VH1's Love & Hip-Hop to launch a rap career, which took off with the release of \"Bodak Yellow\" last June. \"I built the fan base,\" she declares, whipping a few blond locks over a shoulder. \"No record label, no money, nothing can make you. You make yourself.\"\r\nEven with her wild success, guileless personality and castle-dwelling lifestyle, Cardi in conversation still comes across as someone who might pull a knife on you if need be. She expresses genuine indignation toward people who look down on her for her accent and lack of education, and complains about trolls on the Internet: \"These people who want to take food out of my mouth, and my future child's mouth and my parents' mouth – for what?\" And when she looks back at her past, it's not through rose-colored glasses. She resents growing up without money and the limited choices that institutionalized poverty offered her, and uses that energy every day to propel forward her music and her dreams, especially her dreams for her baby.\r\nThe baby – that's all anyone is talking about here today. Bounding over with a beaming smile, Offset hands Cardi his phone, where his mom is waiting to talk to her on FaceTime. She wants to discuss whether Cardi should fly with Offset to New York soon, or if flying late in pregnancy is dangerous for the baby, and also, by the way, has she gone shopping for furniture for the new house yet? Cardi listens, nodding her head, polite, but when Offset hangs up the phone, she stares into space.\r\n\r\nBorn Kiari Kendrell Cephus, Offset has a rap sheet that includes gun and drug charges and an eight-month stint in jail, and has fathered three children with three different women. But the world knows him from Migos' platinum albums and the crossover success of \"Bad and Boujee\" (which he chalks up to \"people wanting the real shit!\"). Wearing a tight white T-shirt and multiple diamond chains wrapped around his neck, and speaking in a tender tone, he is dapper and handsome, a lady killer to Cardi's sex bomb. When I ask if he has a jewelry addiction, he says, \"I don't have an addiction, I have a fetish.\"\r\nFurniture has been moved out of the first-floor parlor room in this home so he can hang dozens of his outfits, paired with shoes, because he can't fit all his clothes in an upstairs closet; Cardi rolls her eyes at this and says, \"He's a boy.\" His hands are also cut up from a vicious accident with his green 2018 Dodge Challenger SRT Hellcat two weeks ago. Six stitches cover the front of a palm. When Cardi first saw him after the accident, covered in blood, she thought he was shot and almost lost her mind.\r\nTheir romance is a hip-hop love story – a first date at the Super Bowl in 2017 (\"That's a power move,\" Offset told Rolling Stone), followed about eight months later by his marriage proposal, on his knee with an eight-carat engagement ring, onstage during a Philadelphia concert. A couple of months later, there was a slight derailment in the tunnel of love: An iCloud hack allegedly caught Offset in a compromising position with another woman, but he and Cardi made amends, and he inked a new tattoo of Cardi's name on his neck. (Cardi defended her decision to forgive him, in part, by telling a magazine, \"I ain't no angel.\") In April, Cardi publicly debuted the baby bump on Saturday Night Live in a form-fitting white dress, followed by a video posted online of her jumping around backstage yelling, \"I'm finally free!\"\r\nAs the lovebirds chat, Cardi absentmindedly caresses Offset's arm, and later she says, \"People want to make fun of me, saying I'm the fourth baby mom,\" but \"I know I'm not having a baby with a shitty-ass man.\" Offset explains, \"We really love each other. She's real. I wanted real. I also wanted successful.\" He isn't threatened by his fiancée's success, as some men might be. \"My mama was the man of my household,\" he says, adding, almost as a proclamation, \"Guys, fellas! You'll lose your wife trying to stop them from being the best they can.\" These days, Offset is trying to take a page from Cardi and become more open and engaging in public, instead of portraying himself as hard. \"That's what I need to work on – my charisma in front of people,\" he says solemnly.\r\n\r\nMotherhood, the circumscribed world of diapers and bottles and putting up play swings – Cardi is looking forward to crossing into it. She has a strict mom, Offset has a tough mom, and she grew up with a Caribbean vision of motherhood that involves tending closely to your child and trying to keep them from \"eating in the streets.\" Of course, she's nervous, too, about her new responsibilities: \"I'm scared I won't be that kind of mom,\" she confesses.\r\nWas the baby planned? Well, no. Late last year, Cardi began to be grossed out by food and not feel quite right. She and Offset had had some sexy pillow talk about making a baby, but she didn't mean it – not right now. When a home pregnancy test came back positive, she immediately FaceTimed him. \"He was like, ‘What? Are you sure?' \" she says. \"I said, ‘Yeah.' And then he just started smiling really hard.\"\r\nAt first, she kept the pregnancy quiet, talking with Offset about what to do. \"He said, ‘What do you mean, what are you going to do? You're going to keep it.' \" She was consumed with worry. \"A lot of successful women have kids, and a lot of successful artists have kids, but not at the peak of their career,\" she says. And when she told her close friends and her team, they were apprehensive. \"It was like, ‘You can't do this. This might fuck up your career,' \" she declares, resting her hands on her lap.\r\nMaking Invasion of Privacy became a logistical puzzle. Even as Cardi was trying to sync competing demands – keeping club appearances and concerts she'd already booked, starting work on the album, lining up directors for her videos – word leaked to Atlantic, her label, that she was pregnant. \"The media didn't even let me tell people, and I hated that,\" she says. \"I really wanted to tell them [Atlantic Records] myself, to sit down with them and tell everybody that I am pregnant and I have a plan.\"\r\nThe label recommended that Cardi record far from New York, to avoid the distraction of friends and family. At four months pregnant, she says, she entered a studio in L.A. but was too drowsy from pregnancy hormones to concentrate. \"We were making green juice and coffee,\" she says. \"I used to tell God, ‘Please don't make me sleepy.' \" After confessing her pregnancy to her engineer, she asked him and producers to tag along with her, to where she had prebooked appearance dates, to record on the fly. \"All of the creative team kind of followed her around the country, from L.A. to Miami to Atlanta to New York, back to Atlanta,\" says Craig Kallman, the CEO of Atlantic Records. Some nights, she'd sleep in the studio; others, she would try to get a good night's rest to maintain her health for herself and the baby. \"I was blown away by her stamina,\" Kallman says, plus \"her inner strength and her creative instincts.\"\r\n\r\n\r\n\r\nOffset consulted with Cardi each step of the way. She has broken up with her manager Klenord \"Shaft\" Raphael, who is suing her and her new team for more than $10 million. She's not embarrassed about using \"co-writers\": Pardison Fontaine, who wrote the main verse of \"Be Careful,\" is a \"dope-ass artist,\" she says. Offset helped with Invasion of Privacy, he says, by, among other things, calling Chance the Rapper to collaborate on \"Best Life.\" \"She doesn't want to call and ask, ‘Can you do this song?' You don't think she's shy, but she don't like asking for no feature or no song, nothing. But I don't give a damn.\"\r\n\r\nInvasion of Privacy is the great album that Cardi didn't really need to make, converting her huge personality into hooks, laugh lines (\"Only thing fake is the boobs!\") and whispers about wanting a man who'll take care of her heart. It's the music version of her Instagram – all killer, no filler. Offset says their artistic instincts are mostly aligned, though he loves Auto-Tune, she hates it. She doesn't want to pretend, doesn't want to assume a generic voice. \"She wants you to hear the struggle, so you feel it,\" he says.\r\n\r\nOffset's musical ambitions are vast. He's considering putting out solo tracks this summer, including collaborations with 21 Savage and Metro Boomin. He wants the legacy of artists he idolized growing up: Michael Jackson, Sammy Davis Jr., James Brown and Prince, plus Lil Wayne and Lil Boosie (now Boosie Bad-azz). He was a standout dancer as a kid, putting on Jackson's dress shirt and socks to entertain his mom, and even performing behind Usher and Whitney Houston in music videos shot in Atlanta. \"Everything has to be tight,\" says Offset. \"It's got to be a masterpiece like Michael Jackson's, the same way he treated his music, his dance moves, his stage presence, his outfit, his hair, makeup, whatever it was.\"\r\n\r\nWhen I ask each of them what they do for fun, they laugh. They aren't into clubs (\"Too much bull,\" says Offset), or cooking (amply clear from a kitchen filled with takeout containers) or even binge-watching TV. What music do they listen to? Their own, mostly, both to enjoy it and to meditate on how to make it better. The previous week, Cardi even tweeted that she was amazed that Donald Glover and Childish Gambino look so much alike, not realizing they're the same person. \"When you look for him on Apple, his covers are not his face, so how the fuck am I supposed to know him?\" she says today of Gambino. \"Everybody's judging me and calling me stupid, and it's like\" – here comes the heavy Caribbean accent – \" ‘Fuck ya, leave me alone.' \"\r\n\r\nSumming up their lives together, Offset says, \"We work. With a day off, we'll be in bed all day, just enjoying each other's company. It ain't about going to no movie, no dinner, nothing. We can go eat McDonald's or Wendy's. She might want a chocolate Frosty.\" He adds, \"We done so much bizarre shit with each other – rings and cars and chains. We got that out of the way.\"\r\n\r\n\r\n\r\nOffset runs away and Cardi's back on her phone, handling her business with her talons and jiggling that leg up and down. If Atlanta is her new home, she'll make it work, though she sometimes feels trapped in the castle, since she doesn't know how to drive. But \"my boo is very down-South,\" and she needs to respect that. Offset doesn't like the weather or the pace in New York, and wants to build an empire down here, not necessarily a Jay-Z-and-Beyoncé-style music empire, but one primarily made of straight cash. Cardi says they'll invest in anything that \"makes our money work,\" like apps, Subway franchises or nail salons.\r\n\r\nWe talk about the news for a while: She's disgusted by President Trump and wants her fans to vote in upcoming local elections. \"Every artist has explained how harmful he is,\" she says. \"He has made divisions in this country – he almost made a crazy civil war between the blacks and the whites. He has proven himself to be a madman so many times, and proven himself to be disrespectful to women, and that still hasn't gotten him impeached.\" Then she adds, \"Clinton got impeached for cheating on his wife, and it's so clear that this nigga has sex with so many porn stars, and he's just been shown to be a dickhead, and it's like, ‘Nope.'\"\r\n\r\nThis leads into a conversation about gun laws, which Cardi thinks should be stricter and involve mental evaluations, though she supports the right to bear arms. \"God forbid, the government tries to take us over, and we can't defend ourselves because we don't have no weapons.\" She adds, \"How do you think American colonizers went to Africa and it was so easy for them to get those people? Because they had guns. No matter what weapon you have, you can't beat a gun.\" She shrugs. \"They have weapons like nuclear bombs that we don't have. So imagine us not having any weapons at all.\"\r\n\r\nThis is straying far from baby talk, so we discuss how she's going to deal with the infant on her upcoming tour (she will be opening for Bruno Mars for seven weeks beginning in September). Cardi is not sure about breast-feeding – she says her breasts are overly sensitive and she can't imagine how she would deal with a little baby \"milking\" them – but she wants her kid to be with her constantly. \"What I envision is my tour bus has my own personal room, and I just want to be with my baby,\" she says. \"Only time I don't have my baby with me is when I'm getting my hair done, makeup done, performing.\" She adds, dreamily, \"I don't want to miss one second. I don't want to miss no smiles, I don't want to miss no new movement, I don't want the baby to confuse me and the babysitter.\"\r\n\r\nCardi wants to be the same woman she is today after giving birth. \"Just because I'm a mom, my street credibility's not gone, my sex appeal's not gone,\" she declares. But how will she open her life up on social media, as she does, with a kid? She's unsure. \"I'm iffy about it,\" she says of showing her kid online. \"My feelings get hurt when people online talking about family members. I think I'll kill somebody if somebody talking about my child like that.\"\r\n\r\nCardi may not have planned her baby shower, but she has plans about how she'll treat her child. Her mom was too strict, she thinks, and that's part of why she rebelled. Cardi and her daughter are going to be best friends. She's going to teach her English and Spanish, and wants her to start learning French by the time she's four, and she'll be a little genius. Maybe she'll take ballet lessons, though toe shoes can mess up your feet. She'll definitely put her in kid boxing lessons. \"I don't want my kid to get picked on and she don't know how to defend herself,\" says Cardi. \"I have a little brother and I always put in his head, since he was two years old, ‘Somebody hit you, you kick, you kick, you kick.' \"\r\n\r\nAnd when the baby gets older, Cardi will tell her about her mom's crazy life. \"I'm going to tell her everything. Everything,\" she says, beginning a long soliloquy addressing her unborn child. \"You have a choice. I could maintain you. I could spoil you if you go to college. Or if you want to be independent, go ahead. When you a teenager and you 18, 19, you can't get no job that pays you more than $200 a week.\" Her voice starts to rise. \"You want to become a stripper? 'Cause I became a stripper 'cause I ain't have no choice. You gonna be getting your ass smacked by niggas that have less money than you, less of an education than you, but they going to feel like they better than you because they feel like you need them. You want to live like that?\" She sits back, satisfied by the rant. \"That's how I'm going to talk to my kid.\"\r\n\r\nSoon she pads across the living room in bare feet, making her way over to a beige chenille couch. Then she lies down on her side and neatly places a lime-green fleece blanket on top of her small shape. \"I used to tell myself I would buy a house before I turn 25,\" she says, before she dozes off, dreaming a million new dreams.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1529496000.0, "source": "https://www.rollingstone.com", "summary": ""}