{"url": "https://ag.ny.gov/press-release/ag-schneiderman-files-civil-rights-lawsuit-against-weinstein-companies-harvey", "text": "News from Attorney General Eric T. Schneiderman\n\nFOR IMMEDIATE RELEASE\n\nFebruary 11, 2018\n\nAttorney General’s Press Office / 212-416-8060\n\nnyag.pressoffice@ag.ny.gov\n\nTwitter: @AGSchneiderman\n\nA.G. SCHNEIDERMAN FILES CIVIL RIGHTS LAWSUIT AGAINST THE WEINSTEIN COMPANIES, HARVEY WEINSTEIN, AND ROBERT WEINSTEIN\n\nFour Month Investigation Reveals New and Egregious Examples of Sexual Misconduct By Harvey Weinstein and Repeated Violations of New York Law By Company Officials That Endangered Employees\n\nAG’s Lawsuit Alleges Company Executives and Board Repeatedly Failed to Protect Employees From Then-CEO Harvey Weinstein’s Unrelenting Sexual Harassment, Intimidation, and Discrimination\n\nAG Files Lawsuit to Ensure Victims Will Be Compensated, Employees Will Be Protected Moving Forward, and Parties Responsible For Egregious Misconduct Will Not Be Newly Empowered As Part of Any Future Sale\n\nNEW YORK – New York Attorney General Eric T. Schneiderman today filed suit against The Weinstein Company (“TWC”), Harvey Weinstein, and Robert Weinstein for egregious violations of New York’s civil rights, human rights, and business laws. The suit, filed today in New York County Supreme Court, includes new and extensive allegations about longtime company CEO Harvey Weinstein’s (“HW”) vicious and exploitative mistreatment of company employees. Today’s suit includes numerous employee-victim accounts of sexual harassment, intimidation, and other misconduct.\n\nAccording to the Attorney General’s (“OAG”) lawsuit, despite many complaints to TWC’s human resources department and widespread knowledge across the company’s leadership of HW’s persistent misconduct, TWC executives and the Board repeatedly failed to take meaningful steps to protect company employees or curb HW’s misconduct.\n\n“As alleged in our complaint, The Weinstein Company repeatedly broke New York law by failing to protect its employees from pervasive sexual harassment, intimidation, and discrimination,” said Attorney General Schneiderman. “Any sale of The Weinstein Company must ensure that victims will be compensated, employees will be protected going forward, and that neither perpetrators nor enablers will be unjustly enriched. Every New Yorker has a right to a workplace free of sexual harassment, intimidation, and fear.”\n\nToday’s lawsuit is the result of an ongoing four month investigation by the Office of the Attorney General (“OAG”). The investigation included interviews with multiple company employees, executives, and survivors of Harvey Weinstein’s sexual misconduct. The investigation also included an exhaustive review of company records and emails.\n\nSpecific examples of HW’s harassment, intimidation, assault, and a hostile work environment alleged in the complaint include, among many others:\n\nHW told several employees throughout the relevant time period that, in substance, “I will kill you,” “I will kill your family,” and “You don’t know what I can do,” or words to that effect. HW touted his connection to powerful political figures and asserted that he had contacts within the Secret Service that could take care of problems.\n\n\n\n\n\nAt HW’s direction, “TWC employed one group of female employees whose primary job it was to accompany HW to events and to facilitate HW’s sexual conquests…These women were described by some witnesses as members of HW’s TWC “roster” or his “wing women.” One of the members of this entourage was flown from London to New York to teach HW’s assistants how to dress and smell more attractive to HW…”\n\n\n\n\n\nA second group of predominantly female employees served as his assistants. HW’s assistants were compelled to take various steps to further HW’s regular sexual activity, including by contacting “Friends of Harvey” and other prospective sexual partners via text message or phone at his direction and maintaining space on his calendar for sexual activity.\n\n\n\n\n\nA third group of predominantly female TWC employees – a group of female executives – also were forced to facilitate HW’s sexual conquests. These female employees’ job responsibilities should have been confined to using their expertise to help TWC produce films and television projects. Yet despite their skills and stated job responsibilities, HW required them to meet with prospective sexual conquests in order to facilitate HW’s sexual activity, and to follow through on HW’s promise of employment opportunities to women who met with HW’s favor. This compelled service demeaned and humiliated them, contributing to the hostile work environment.”\n\n\n\n\n\nAs one [female] executive reported to TWC’s Human Resources department: “only female executives are put in these positions with actresses with whom HW has a ‘personal friendship,’ which to my understanding means he has either had or wants to have sexual relations with them. Female Weinstein employees are essentially used to facilitate his sexual conquests of vulnerable women who hope he will get them work.” TWC took no steps to investigate these allegations or to prevent future recurrence of such conduct.\n\n\n\n\n\nHW made quid pro quo offers or demands of sexual favors in exchange for career advancement at TWC, or to avoid adverse employment consequences at TWC.\n\n\n\n\n\nOn one occasion in 2015, HW asked a female TWC employee to go to his hotel room at the end of the day to set up his phone and devices for the next day or some other alleged work reason (work that TWC employees referred to as “turndown service,” and that was generally assigned to female TWC employees). Upon her arrival at HW’s hotel room, HW appeared naked under a bathrobe and asked the employee for a massage. When the employee said no, HW cajoled, badgered, and insisted until she relented and, against her wishes, submitted to massaging him out of fear of employment-based retaliation by HW. The incident was reported to Human Resources and to executives and Board members of the company in November 2015, but TWC took no action to formally investigate the complaint, to protect employees from HW, or to prevent future recurrence of such conduct.\n\n\n\n\n\nOn other occasions in 2014 and 2015, HW exposed himself to a female employee and made her take dictation from him while he leered at her, naked on his bed. That same employee described how HW would insist that she sit next to him in the back seat of his chauffeured vehicle and would place his hand on her upper thigh and buttocks near her genitalia and rub her body without her consent. When she attempted to place bags or other barriers between them to make it harder for him to reach her, he moved the barriers or repositioned himself so that the unwelcome sexual contact could continue. This employee, and other TWC employees, believed that they would face adverse employment consequences unless they acquiesced to such demands.\n\n\n\n\n\nOn one occasion, HW asserted that he might have to fire a female employee because his daughter (for whom the employee was providing assistance at HW’s direction) was angry with her, and he asked the employee what she was “prepared to do” to keep her job – a proposition that the female employee understood was a demand for quid pro quo sexual activity. The employee quit rather than submit to the demand for sex in exchange for continued employment.\n\n\n\n\n\nHW’s assistants were exposed to and required to facilitate HW’s sex life as a condition of employment.\n\n\n\n\n\nHW required his assistants to schedule “personals” for sexual activity both during the workday and after work. Upon arranging a “personal,” assistants were required to clear or adjust any and all other scheduled plans which potentially conflicted with the “personal.”\n\n\n\n\n\nAssistants possessed copies of a document known as the “Bible,” an assistant-created guide to working for HW which was passed down through Assistants. The document sat in hard copy on several Assistants’ desks, and was accessible to and known to exist by some TWC executives. The Bible included information about HW’s likes and dislikes, and a list of his “friends” with directions for assistants on how to arrange HW’s extensive and frequent “personals.”\n\n\n\n\n\nHW’s drivers in both New York City and Los Angeles were required to keep condoms and erectile dysfunction injections in the car at all times, in order to provide them to HW as needed.\n\nSpecific allegations of misconduct by company management include, among others:\n\nOn more than one occasion, upon forwarding a complaint or information about a complaint to the COO, the Human Resources Director was not involved in any investigation or resolution process. Based on documents obtained by the OAG to date, such matters were handled by the COO and other members of TWC senior management, as well as counsel retained to contact victims of misconduct.\n\n\n\n\n\nOn numerous occasions during the relevant time period, victims of HW’s misconduct complained to the Human Resources Director or to other TWC management about various aspects of the conduct described herein. On no occasion was HW subject to a formal investigation, nor to restrictions on his behavior or adverse employment consequences, as a result of any complaint.\n\n\n\n\n\nEvidence gathered during the course of the investigation reflects that the Human Resources Director was not empowered to take any steps address HW’s ongoing sexual harassment of female employees.\n\n\n\n\n\nOn certain occasions when individuals did complain to Human Resources, those complaints were not treated confidentially and investigated. For example, on one occasion, an assistant to HW wrote an email to Human Resources complaining of certain misconduct by HW. Soon thereafter, the assistant, who had access to HW’s email account due to her role at TWC, saw that her complaint had been forwarded directly to HW via HW’s email account.\n\n\n\n\n\nOn several occasions when TWC employees complained about serious misconduct by HW, TWC took steps to separate the employee from the company while securing an NDA that would prevent the employee from disclosing the misconduct to others or warning others about the misconduct.\n\n\n\n\n\nRobert Weinstein (“RW”), as co-owner, co-Chairman, and co-CEO, was responsible for maintaining a safe workplace, free of sexual harassment and other unlawful conduct. Yet instead of doing so, RW acquiesced in allowing HW to create a hostile work environment and engage in sexual misconduct that was known to him, or which he was responsible for preventing.\n\n\n\n\n\nRW also received by email in late 2014 and 2015, and was otherwise informed of, claims of repeated and persistent sexual harassment and misconduct, yet he took no measures to investigate further the claims of misconduct, to terminate HW’s employment, to restrict or prohibit HW from supervising women or having or seeking sexual contact with TWC employees or women seeking to do business with TWC, from having private meetings with employees or women seeking opportunities in hotel rooms or TWC office space, or any other concrete measure that may have prevented HW’s ongoing misconduct.\n\n\n\n\n\nIn response to the information obtained from TWC management, independent Board members sought to obtain access to HW’s personnel file so that counsel representing the Board could use the personnel file and other information to evaluate whether the Board would recommend renewal of HW’s contract. HW resisted the independent directors’ efforts to obtain a copy of his personnel file and otherwise investigate misconduct, on the purported grounds that the contents of the file would be leaked to the press if disclosed to the Board. There was no basis for this claim; instead, HW sought to prevent access to his personnel file to avoid discovery of the extent of his own misconduct. A majority of the Board refused to back the independent Directors’ efforts to obtain HW’s personnel file; thus, efforts that may have resulted in discovery of at least a portion of HW’s misconduct were not undertaken by the Board.\n\n\n\n\n\nHW’s contract extension also contained an unusual provision that effectively monetized, rather than prohibited, ongoing acts of sexual harassment and misconduct. In particular, it stated that, if TWC had to “make a payment to satisfy a claim that you [i.e., HW] have treated someone improperly in violation of the Company’s Code of Conduct,” he would face escalating financial penalties: $250,000 for the first such instance, “$500,000, for the second such instance, $750,000 for the third such instance, and $1,000,000 for each such additional instance.”\n\n\n\n\n\nThis contract contained no provision for any penalties if HW personally covered the costs of any payments necessary to satisfy claims of improper treatment, and it provided for no adverse employment consequences in the event that one, two, three, or even four or more such payments had to be made by TWC and/or HW as a result of HW’s sexual harassment or misconduct. Thus, pursuant to HW’s employment contract, HW could continue engaging in sexual harassment and misconduct with impunity, provided that he paid the costs of any settlements and that he avoided disclosure of misconduct that might risk causing “serious harm to the company.”\n\nBoard minutes reflect that the Board ratified HW’s new employment contract unanimously. No future efforts were undertaken by the Board to investigate HW’s misconduct or TWC’s practices concerning that conduct until HW’s termination in October 2017.\n\nAs detailed above, according to OAG’s investigation, none of the voluminous complaints filed with TWC Human Resources resulted in meaningful investigation or relief for victims, or consequences for HW. Instead, TWC Human Resources variously claimed there was “nothing” that could be done to address the misconduct; immediately informed HW of the complaint, thereby facilitating retaliation by HW against the complainant; or helped facilitate swift departure of the complainant from the company in connection with a settlement that contained an NDA at the direction of the HR Director’s superiors.\n\nTWC’s culture of harassment and intimidation remained shrouded in secrecy because of HW’s and TWC’s practice of securing silence through Non-Disclosure Agreements (“NDAs”) that prohibited individuals from speaking about their experiences at TWC. In October 2017, Attorney General Schneiderman opened an investigation after initial reports regarding HW – using the Attorney General’s investigative authorities, including investigative subpoena power, to begin removing that shroud of secrecy.\n\nWhile the Attorney General’s investigation remains ongoing, OAG is bringing suit today to seek court intervention in light of its investigative findings to date and the reported imminent sale of TWC – which OAG has a substantive basis to believe would leave victims without adequate redress, including a lack of a sufficient victims compensation fund. OAG also believes that the proposed terms of the sale would allow the perpetrators or enablers of the misconduct to see a windfall, and allow top officials at TWC who share responsibility for the misconduct to serve in executive positions of the new entity – where they would again oversee the adjudication of HR complaints, including those of sexual harassment, intimidation, and assault.\n\nThose who believe they were victims of or witnesses to the misconduct described in the complaint should call the Civil Rights Bureau hotline at 212-416-8250 or Civil.Rights@ag.ny.gov Email Complaint to Civil Rights.\n\nThe Civil Rights Bureau of the New York State Attorney General’s Office is committed to combating gender discrimination and sexual harassment faced by women across all industries. The Civil Rights Bureau encourages those who encounter such conduct to contact the office at 212-416-8250 or Civil.Rights@ag.ny.govSend Complaints to Civil Rights Email ID.\n\nThis case is being handled by Howard Master, Senior Enforcement Counsel, and by Anjana Samant, Assistant Attorney General, and Amanda Addision, volunteer Assistant Attorney General, in the Civil Rights Bureau and Investigator Lina Burgos. Lourdes Rosado is the Chief of the Civil Rights Bureau. The Civil Rights Bureau is part of the Division of Social Justice, which is led by Executive Deputy Attorney General Matthew Colangelo.", "images": ["https://ag.ny.gov/profiles/openpublic/themes/openpublic_theme/img/press-release-archive-banner.png", "https://ag.ny.gov/sites/default/files/default_images/oag_seal_1_1.png"], "top_img": "https://ag.ny.gov/sites/default/files/default_images/oag_seal_1_1.png", "keywords": [], "authors": [], "canonical_link": "https://ag.ny.gov/press-release/2018/ag-schneiderman-files-civil-rights-lawsuit-against-weinstein-companies-harvey", "title": "A.G. Schneiderman Files Civil Rights Lawsuit Against The Weinstein Companies, Harvey Weinstein, And Robert Weinstein", "meta_data": {"rating": "general", "generator": "Drupal 7 (http://drupal.org)", "og": {"type": "website", "url": "https://ag.ny.gov/press-release/2018/ag-schneiderman-files-civil-rights-lawsuit-against-weinstein-companies-harvey", "image": "https://ag.ny.gov/sites/default/files/default_images/oag_seal_1_1.png"}, "twitter": {"card": "summary_large_image", "site": "@newyorkstateag", "url": "https://ag.ny.gov/press-release/2018/ag-schneiderman-files-civil-rights-lawsuit-against-weinstein-companies-harvey", "image": "https://ag.ny.gov/sites/default/files/default_images/oag_seal_1_1.png"}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://ag.ny.gov", "summary": ""}