{"url": "www.bustle.com/p/what-does-fight-supremacy-want-bostons-free-speech-rally-is-overshadowed-by-counter-protestors-77658", "text": "The Boston Free Speech rally on Saturday has raised fears last weekend's white supremacist march on Charlottesville — and the ensuing violence — will play out in the Massachusetts capital, too. Groups of counter-protesters have gathered under a Fight Supremacy demonstration, including Antifa members, Black Lives Matter activists, and anti-racists across the board. But what does Fight Supremacy want, and what are their goals of the counter-protest?\n\nWell, for starters, the Facebook page for the Fight Supremacy counter-protest has over 14,000 marked as attending. So, in this case, gathering a crowd isn't an issue. As for the protest's objective, organizers shared a handful of clear intentions on the page. Understandably, one of the main intentions is to combat any possible repeat of the white supremacist violence in Charlottesville by organizing a coalition to march against the hate groups. There can be safety, or at least, solidarity in greater numbers.\n\n\"As we have seen with the events in Charlottesville and around the country, white nationalists are emboldened by the current political administration and growing police state. Rallies and marches organized by white supremacists are more prevalent than in recent years, and—as always—it is the most marginalized who are left vulnerable,\" read the Fight Supremacy event page.\n\nIn case violence breaks, the Boston Mayor Marty Walsh made it clear he's prepared to shut down the Free Speech rally. \"If anything gets out of hand, we will shut it down,” Walsh said at a news conference Friday. “We’re going to respect their right to free speech. In return, they must respect our city.\"\n\nIn preparation, there are already 500 police officers deployed to keep the peace. Although, given the fact that police officers stood by while a 20-year-old black man was beaten by white supremacists last weekend, their presence means little to those who need protection the most.\n\nBy noon on Saturday, there were already thousands of Fight Supremacy protesters gathered, greatly outnumber the amount of white supremacists who showed up.\n\n\"Resistance takes many forms. One of those forms is counter-protest. Counter-protests send a message to white supremacists that their hateful rhetoric, physical violence, and fear mongering will not go uncontested. It's also a show of solidarity and an opportunity for allies to \"show up\" and wield their privilege,\" wrote the Fight Supremacy mission statement.\n\nRegardless of how the events continue to unfold throughout the remainder of Saturday, it appears that Fight Supremacy organizers have already successfully gathered thousands to counter white supremacists. And that's a feat for such short notice.", "images": ["https://imgix.bustle.com/uploads/getty/2017/8/19/1748ee0e-31a2-42f9-ac17-6b2c35dad2bc-getty-835504526.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/1ce35950-cbb2-416a-86b0-4e77bc68a52d-getty-850216740.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/shutterstock/2020/2/25/ecf32f36-912f-4278-a361-9e98f3725a28-shutterstock-567871036.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/8/19/1748ee0e-31a2-42f9-ac17-6b2c35dad2bc-getty-835504526.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/14/dbe88d6a-87a9-4f82-bcd5-d073ebbd5cc8-getty-1208216637.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/8/1febd357-8200-4306-b45b-3529a40308c6-getty-1209376534.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/8/19/1748ee0e-31a2-42f9-ac17-6b2c35dad2bc-getty-835504526.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/what-does-fight-supremacy-want-bostons-free-speech-rally-is-overshadowed-by-counter-protestors-77658", "title": "What Does \"Fight Supremacy\" Want? Boston's Free Speech Rally Is Overshadowed By Counter-Protestors", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/what-does-fight-supremacy-want-bostons-free-speech-rally-is-overshadowed-by-counter-protestors-77658", "type": "article", "title": "Here's What The Boston \"Fight Supremacy\" Counter-Protest Really Wants", "description": "The Boston Free Speech rally on Saturday has raised fears last weekend's white supremacist march on Charlottesville — and the ensuing violence — will play out in the Massachusetts capital, too. Groups of counter-protesters have gathered under a…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/8/19/1748ee0e-31a2-42f9-ac17-6b2c35dad2bc-getty-835504526.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The Boston Free Speech rally on Saturday has raised fears last weekend's white supremacist march on Charlottesville — and the ensuing violence — will play out in the Massachusetts capital, too. Groups of counter-protesters have gathered under a…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}