{"url": "https://www.usatoday.com/story/news/nation-now/2018/07/25/april-giraffe-pregnant-again/832745002/", "text": "BINGHAMTON, N.Y. – After months of questions and rumors, Animal Adventure Park owner Jordan Patch announced Wednesday the news millions of worldwide giraffe fans have been waiting to hear: April the giraffe is pregnant again.\n\nLast month, the park announced it was sending 30 days worth of fecal samples to another zoo's laboratory for progesterone testing to confirm the pregnancy, 14 months after April gave birth to her calf, Tajiri on site at the park in April 2017.\n\nOn NBC's \"Today Show,\" followed by a news release, Patch announced the 16-foot-tall mother-to-be is months into her pregnancy and due to give birth in early spring 2019.\n\nTo confirm pregnancy, keeper Allysa Swilley had collected fecal samples from April's stall over the course of a month. The samples were secured in plastic bags, labeled and dated before being put in freezer storage, then sent out to the laboratory.\n\nJune 20:Is April the giraffe pregnant again? Animal park posts video\n\nOct. 16:April the giraffe cleared for pregnancy, but some people aren't happy\n\nApril's current pregnancy is her fifth, her second since arriving at Animal Adventure Park in 2015. Her fourth pregnancy, in 2017, sparked a worldwide frenzy, shining a spotlight on the park in Harpursville, New York.\n\nOn April 15, 2017, more than a million viewers tuned in to watch April give birth to a healthy, male calf named Tajiri.\n\nSince the start of the 2017 season weeks after the birth, admission to the park tripled and staff doubled. Patch also purchased 115 acres of land sitting directly across from the park.\n\nWhere to watch the giraffe\n\nFans will once again be able to follow April's progress throughout her pregnancy on social media, the park said Wednesday.\n\nIts YouTube page now has about 470,000 subscribers, and 1.7 million follow the park's Facebook page – April and Tajiri even have their own Twitter accounts. There's April the Giraffe merchandise and social media groups dedicated to discussion of the trio of giraffes.\n\nAbout 1,000 people tuned in Wednesday morning to catch a glimpse of the park's giraffe family.\n\nIn December 2016, scientists added giraffes to the list of threatened and endangered animals, according to the International Union for the Conservation of Nature, listing them as \"vulnerable to extinction.\"\n\nOn Wednesday, Patch said the park's top priority is \"preserving these beautiful, majestic creatures and increasing awareness of the threat giraffes are facing.\"\n\n“April’s prior pregnancy facilitated an immeasurable amount of education and appreciation for giraffes,\" Patch said in a news release. \"We’re very proud of our captive management and propagation program and eager to continue doing all we can to help bring this species awareness and tangible results towards conservation.”\n\nMay 2017:April the giraffe's baby calf gets a name: Tajiri\n\nApril 2017:As April the giraffe's calf grows, so will park they call home\n\nPart of the funding from a naming contest for Tajiri in 2017 was earmarked for giraffe conservation; the park sent its own gift of $30,000 to the cause, and with every trip to Animal Adventure Park – now a bucket list destination for children and adults worldwide – visitors are treated to the park's \"giraffe talk,\" a lesson on the anatomy, habits and global vulnerability of giraffes.\n\n\"With one video endeavor, we literally changed the way the world saw giraffes and conservation,\" Patch said a November 2017 interview. \"It provided sustainability for the park, but it also created an awareness about giraffes that conservationists and scientists and zoologists have tried to do for decades.\"\n\nFollow Katie Sullivan Borrelli on Twitter: @ByKatieSullivan\n\nApril 2017:1.2 million tune in as April the giraffe finally gives birth\n\nMarch 2017:Is April the giraffe still pregnant?\n\nMarch 2017:Yes, April the giraffe is still pregnant. And she may be a month past due\n\nMarch 2017:How long do I have to watch that giraffe before it has its baby?!\n\nFebruary 2017:Zoo: Live giraffe cam pulled for showing ‘nudity and sexual content’", "images": ["https://www.gannett-cdn.com/-mm-/706644a7b2ad0c1ca0d28f906f185d87ec3f5fbd/c=0-247-908-760/local/-/media/2017/04/15/USATODAY/USATODAY/636278476353081971-Screen-Shot-2017-04-15-at-10.05.54-AM.jpg?width=908&height=513&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/-mm-/b65c30255ed3be9e8fefa2172bd3dc38ceec4f0c/c=0-541-4500-3083&r=1280x720/local/-/media/2018/04/17/USATODAY/USATODAY/636595637458404429-EPA-epaselect-NETHERLANDS-ANIMALS-ZOO.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/bee521db67e0e9b9adbf5a68d60974a4b8b81d01/c=77-0-832-1006/local/-/media/2017/04/15/USATODAY/USATODAY/636278476353081971-Screen-Shot-2017-04-15-at-10.05.54-AM.jpg?width=300&height=400&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/706644a7b2ad0c1ca0d28f906f185d87ec3f5fbd/c=0-247-908-760/local/-/media/2017/04/15/USATODAY/USATODAY/636278476353081971-Screen-Shot-2017-04-15-at-10.05.54-AM.jpg?width=908&height=513&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.pressconnects.com/story/news/connections/2018/07/25/april-giraffe-pregnant-again-animal-adventure-2019/832532002", "title": "April the giraffe is pregnant again, and she's due next year", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "April the giraffe is pregnant again, and she's due next year", "description": "Animal Adventure Park owner Jordan Patch announced Wednesday the news millions of worldwide giraffe fans have been waiting to hear: April the giraffe is pregnant again.", "url": "https://www.pressconnects.com/story/news/connections/2018/07/25/april-giraffe-pregnant-again-animal-adventure-2019/832532002", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/706644a7b2ad0c1ca0d28f906f185d87ec3f5fbd/c=0-247-908-760/local/-/media/2017/04/15/USATODAY/USATODAY/636278476353081971-Screen-Shot-2017-04-15-at-10.05.54-AM.jpg?width=908&height=513&fit=crop&format=pjpg&auto=webp", "width": 908, "height": 513}, "type": "article"}, "article": {"author": "Katie Sullivan Borrelli", "content_tier": "free", "opinion": "false"}, "description": "Animal Adventure Park owner Jordan Patch announced Wednesday the news millions of worldwide giraffe fans have been waiting to hear: April the giraffe is pregnant again.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/706644a7b2ad0c1ca0d28f906f185d87ec3f5fbd/c=0-247-908-760/local/-/media/2017/04/15/USATODAY/USATODAY/636278476353081971-Screen-Shot-2017-04-15-at-10.05.54-AM.jpg?width=908&height=454&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "April the giraffe is pregnant again, and she's due next year", "description": "Animal Adventure Park owner Jordan Patch announced Wednesday the news millions of worldwide giraffe fans have been waiting to hear: April the giraffe is pregnant again."}}, "movies": [], "publish_date": 1532448000.0, "source": "https://www.usatoday.com", "summary": ""}