{"url": "https://people.com/tv/rhoa-kim-zolciak-biermann-got-death-threats-after-nene-leakes-called-her-a-racist/", "text": "The fallout from #RoachGate consumed Sunday’s episode of Real Housewives of Atlanta, as NeNe Leakes called Kim Zolciak-Biermann and her daughter Brielle Biermann “racist” after they claimed she lived in a “roach nest.”\n\nLeakes’ comments made headlines back in October when she posted them publicly, along with a video Brielle had taken months earlier of black bugs crawling in a bathroom at Leakes’ house.\n\nGet push notifications with news, features and more.\n\nAs fans saw in a February episode of RHOA, Kim, 39, had sent the video to the entire cast while they were in Barcelona as retaliation for Leakes’ claims that she lied about her health issues — saying Leakes was “sick” and “should be worried about karma.”\n\n“Kim & her daughter oops whole family are racists! What her daughter did at my home… was racist, learned behavior etc,” Leakes, 50, alleged in a comment on Instagram, adding, “Kim is a calculating bio polar racist with a horrible mouth, who uses black folks for her come up.”\n\nImage zoom NeNe Leakes, Brielle Biermann and Kim Zolciak-Biermann David Crotty/Patrick McMullan via Getty; Charles Sykes/Bravo/NBCU Photo Bank via Getty\n\nRELATED: ‘Close Your Legs to Married Men’: A Brief History of Kim Zolciak-Biermann & NeNe Leakes’ Rocky Friendship\n\nLooking back on Sunday at what happened, Leakes said that she called Kim and Brielle “racists” because of their use of the term “roaches.”\n\n“That word ‘roach’ just ain’t the word I needed to hear her saying,” Leakes said. “It sounds very racial when you are speaking to an African-American person and talk about roaches. Because people feel like you associated that with the ghetto or trash. Black people do not receive that very well.”\n\nWhile Leakes admitted the comments she made online “were purely out of anger,” she said she felt justified by statements Kim had previously made.\n\n“Do I believe Kim is a racist? Some of the things she has said would definitely make you go, ‘Hmmm,’ ” Leakes said, as a montage of questionable moments of Kim’s past time on the show played.\n\nImage zoom NeNe Leakes Alex Martinez/Bravo\n\nShe also stood by her attack of Brielle, 21 — who allegedly texted Leakes’ son Brentt, 18, and invited herself over for the party, claiming she was in the neighborhood looking at her old house.\n\n“I think Brielle is a beautiful girl. I’ve known this girl from growing up. Your kid cannot talk to an adult using fowl language and expect me to say nothing back,” Leakes said.\n\n“They really tried to do something to hurt me or discredit my home or how beautiful my home is. They wanted to discredit that,” Leakes added. “What she did was to mean and to be vicious and to be hateful. … It’s heartbreaking. Why [Kim] couldn’t just come in here and say she’s happy for me? Why she couldn’t just saying, ‘I’m happy for you girl. I’m glad that you even accomplished a goal.’ ”\n\nImage zoom Kim Zolciak-Biermann Alex Martinez/Bravo\n\nBut while Leakes said she felt attacked, Kim claimed she was the victim.\n\nThe mother of six claimed that after Leakes posted the video, she received death threats.\n\n“We’ve had to hire security. I’ve had people come to the gate at my house,” she told pal Shereé Whitfield.\n\n“She wants to pull the race card. That’s the devil, bitch,” Kim said. “She spent so many years trying to sabotage my name and I just let it roll. Now you’re f—— with my kids? ‘The whole family is racist, prejudice?’ My whole family? There’s not a racist bone in my body. Not me, my husband, or my children see color. Never have.”\n\nRELATED VIDEO: Shereé Whitfield on the Status of NeNe Leakes & Kim Zolciak Biermann’s Friendship: “I’m Not Sure They’ll Ever Be Where They Were”\n\nKim went on to explain that she sent Leakes a cease and desist, which she said cost her $20,000.\n\n“I don’t take this lightly. It’s one thing like I said to kind of banter back and forth and have an opinion,” Zolciak-Biermann told E!’s Daily Pop in October. “This is far beyond just having an opinion.”\n\n“It’s inappropriate. In this day and age, people are dying over racism,” said that same month on Larry King Now. “I’m on a show with all African-American women and I’m the only one that’s ever been on the show that’s Caucasian, so it’s the card that sometimes they play and it’s gross. And I won’t allow it.”\n\nLeakes’ response to receiving the cease and desist? “I burned it up with a lighter,” she said Sunday.\n\nImage zoom NeNe Leakes and Kim Zolciak-Biermann Charles Sykes/Bravo/NBCU Photo Bank via Getty Images; Paras Griffin/Getty Images\n\nWhile it Kim was upset, she made it clear that she didn’t regret sending the video in the first place.\n\n“It was a funny joke between Brielle and I. I’m her mom. She can send me whatever the f— she wants,” Kim told Kandi Burruss, saying once again that she wasn’t racist. “I don’t have this kind of drama. NeNe has portrayed me saying dumb s—. It’s nasty. I just am who I am.”\n\nIn the end, the whole cast seemed torn over who was right and who was wrong. But one thing was clear: it was going to take a lot to get these women back to the friendship they once had.\n\nThe Real Housewives of Atlanta airs Sundays (8 p.m. ET) on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fkim-zolciak1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-kim-brielle.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhoa-kim-zolciak-biermann-got-death-threats-after-nene-leakes-called-her-a-racist/", "title": "RHOA: Kim Zolciak Received Death Threats After RoachGate", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brielle Biermann,Kandi Burruss,Kim Zolciak Biermann,NeNe Leakes,News,Real Housewives,Real Housewives of Atlanta,Sheree Whitfield,TV", "news_keywords": "Brielle Biermann,Kandi Burruss,Kim Zolciak Biermann,NeNe Leakes,News,Real Housewives,Real Housewives of Atlanta,Sheree Whitfield,TV", "description": "The fallout from NeNe Leakes and Kim Zolciak-Biermann's #RoachGate feud consumed Sunday's all-new Real Housewives of Atlanta", "og": {"title": "RHOA's Kim Zolciak Says She Received Death Threats After NeNe Leakes Called Her 'Racist'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhoa-kim-zolciak-biermann-got-death-threats-after-nene-leakes-called-her-a-racist/", "description": "The fallout from #RoachGate consumed Sunday’s episode of&nbsp;Real Housewives of Atlanta,&nbsp;as&nbsp;NeNe Leakes&nbsp;called&nbsp;Kim Zolciak-Biermann&nbsp;and her daughter Brielle Biermann “racist” after they claimed she lived in a&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/rhoa-kim-zolciak-biermann-got-death-threats-after-nene-leakes-called-her-a-racist/", "description": "The fallout from NeNe Leakes and Kim Zolciak-Biermann's #RoachGate feud consumed Sunday's all-new Real Housewives of Atlanta", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhoa-kim-zolciak-biermann-got-death-threats-after-nene-leakes-called-her-a-racist/", "title": "RHOA's Kim Zolciak Says She Received Death Threats After NeNe Leakes Called Her 'Racist'", "description": "The fallout from NeNe Leakes and Kim Zolciak-Biermann's #RoachGate feud consumed Sunday's all-new Real Housewives of Atlanta", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}