{"url": "https://web.archive.org/web/20140715194931/http://blogs.rollcall.com:80/218/immigration-news-congress-changes-to-trafficking-law/?dcz=", "text": "GOP Task Force, Lone Democrat Eye Trafficking Law\n\nBy Emma Dumain\n\nThe House GOP task force charged with making recommendations to colleagues on the influx of unaccompanied, undocumented immigrant children at the U.S.-Mexico border might suggest controversial changes to a 2008 trafficking law — and at least one Democrat wants to go that route as well.\n\nRep. Henry Cuellar of Texas, a fiscally conservative Blue Dog Democrat who made headlines on Wednesday for blasting President Barack Obama’s failure to visit the border during a fundraising trip to the area, said he would soon introduce legislation to allow all children apprehended at the southwest border to qualify for “voluntary return” to their home countries.\n\nA law known as the “William Wilberforce Trafficking Victims Protection Reauthorization Act” gave that right only to children from counties “contiguous” to the United States, namely Mexico and Canada. Given the droves of unaccompanied minors trying to enter the country illegally from Honduras, Guatemala and El Salvador — among other parts of Central America — Cuellar said tweaking the 2008 act would ease conditions at the border, with fewer children having to wait long periods for deportation hearings at overcrowded detention centers if they would just as soon return to their homes on their own terms.\n\n“All the protections under the law would be kept in, asylum, credible fear, victim of a sex crime,” Cuellar told a group of reporters. ”The only thing we change is that aspect of it, that allows them to [be deported] on a voluntary basis.”\n\nMembers of the Republican task force also said in a statement late Wednesday that revisiting the act is one of their recommendations to remedy the border crisis.\n\n“We agree with the President that [children] must be returned to their home countries in the most humane way possible,” they wrote, “and that will require a revision of the 2008 Trafficking Victims Protection Reauthorization Act.”\n\nCuellar said that he had not yet begun to make the rounds to colleagues to garner co-sponsors for his bill, but that a certain senator from Texas with “a little bit of experience” — a nod to senior Texas Sen. John Cornyn, a Republican — would be moving forward with companion legislation on his side of the Capitol.\n\nObama has also said there should be some re-evaluation of the law, enacted in the waning days of the George W. Bush administration to protect children against sex trafficking.\n\nBut most Democrats are likely to bristle at the prospect of touching the law, fearful that any tinkering would leave young people vulnerable.\n\n“I think there’s ample evidence that children who are potential victims are being returned without adequate inquiry,” said Rep. Zoe Lofgren, D-Calif. “I think [Cuellar] has very few people in the Democratic caucus who would agree with him.”\n\nRep. Raúl M. Grijalva, D-Ariz., said that he and 10 other members of the Congressional Hispanic Caucus immigration task force met earlier on Wednesday — and dispersed with the resolve to be oppose any revisions to the trafficking law.\n\nHe said he had “suspected all along” that Cuellar might be cooking something up on his own. But the CHC task force meeting focused on the issue in the context of what changes Republicans might want to pursue, either in standalone legislation or more likely as a policy rider in Obama’s pending request for Congress to appropriate $3.8 billion to bolster resources at the southwest border.\n\n“We need to take a position that protects children,” Grijalva said, “and a Republican effort … to undo the 2008 law, that would be something we would fight.”\n\nRelated stories:\n\nPresident’s Party Asks Why He’s Avoiding the Border\n\nObama ‘Happy to Consider’ Sending National Guard to Border to get Votes on Supplemental\n\nA Tale of Two Congressional Visits to the Southwest Border\n\nObama’s Bill for Border Surge Gets Frosty Reception on the Right\n\nObama Asking Congress for $4.3 Billion for Border Crisis, Wildfires\n\nOn Climate Change, Landrieu Stands With Coal, Against Obama\n\nRoll Call Election Map: Race Ratings for Every Seat\n\nGet breaking news alerts and more from Roll Call in your inbox or on your iPhone.", "images": ["https://web.archive.org/web/20140715194931im_/http://cdn.rollcall.com/media/ui/pwLogoOverlay.jpg", "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/wp-content/themes/rollcall-blog-regular/images/comments-balloon-icon-mini.png", "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/themes/rollcall-blog-regular/images/comments-balloon-icon-mini.png", "https://web.archive.org/web/20140715194931im_/http://b.scorecardresearch.com/p?c1=2&c2=6036424&cv=2.0&cj=1", "https://web.archive.org/web/20140715194931im_/http://i1.wp.com/blogs.rollcall.com/218/wp-content/uploads/sites/2/2014/07/immigration005_070714.jpg?resize=445%2C304", "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/uploads/sites/2/2014/02/218_FinalThreeBloggers.png", "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/themes/rollcall-blog-regular/images/RC_logo-200px_horz.png", "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/uploads/sites/2/2014/07/immigration005_070714-445x304.jpg"], "top_img": "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/uploads/sites/2/2014/07/immigration005_070714-445x304.jpg", "keywords": [], "authors": ["Brenda Huddleston", "Charlene Weshley"], "canonical_link": "https://web.archive.org/web/20140715194931/http://blogs.rollcall.com/218/immigration-news-congress-changes-to-trafficking-law/", "title": "Immigration News: Congress Eyes Changes to Trafficking Law", "meta_data": {"apple-itunes-app": "app-id=433753469", "description": "A Republican task force responding to immigration news amid the child migrant crisis is recommending Congress revisit a 2008 trafficking law.", "twitter": {"card": "summary", "site": "@", "image": "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/goppers/wp-content/uploads/sites/2/2013/05/goppers-header-logo-faceless.png", "description": "A Republican task force responding to immigration news amid the child migrant crisis is recommending Congress revisit a 2008 trafficking law."}, "og": {"locale": "en_US", "title": "Immigration News: Congress Eyes Changes to Trafficking Law", "description": "A Republican task force responding to immigration news amid the child migrant crisis is recommending Congress revisit a 2008 trafficking law.", "url": "https://web.archive.org/web/20140715194931/http://blogs.rollcall.com/218/immigration-news-congress-changes-to-trafficking-law/", "site_name": 218, "type": "article", "image": "https://web.archive.org/web/20140715194931im_/http://blogs.rollcall.com/218/wp-content/uploads/sites/2/2014/07/immigration005_070714-445x304.jpg"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}