{"url": "https://www.usatoday.com/story/life/2017/05/02/2017-met-gala-clothing-spoke-louder-than-instagram-likes/101188668/", "text": "Cara Kelly\n\nUSA TODAY\n\nNEW YORK — Rei Kawakubo skittered up the stairs of the Metropolitan Museum of Art Monday night, only faintly glancing at the photographers and reporters chanting her name from the sides of the red, or rather, blue carpet. A stranger to the scene would have hardly known she was an important guest at the A-list circus that is the annual Costume Institute Gala, let alone the star of the whole show.\n\nThe reclusive designer, who founded label Comme des Garçons in 1969, is the focus of the museum’s latest exhibit and a rare bird in an industry full of peacocks. She scarcely gives interviews, doesn’t have personal social media accounts and won’t measure her success on praise from others.\n\nHer designs speak for themselves. And in that way, her ethos was the unifier of a disparate and relatively quiet blue carpet.\n\nGuests to the yearly fundraiser held in honor of the exhibit are encouraged to channel the subject of the new showcase, which typically happens with varying degrees of success. The attendees who best hit Monday's theme — channeling Kawakubo through her own creations or by working with another designer in attendance — made their way up the steps of the Met without much fuss. Helen Lasichanh, the wife of co-host Pharrell Williams, hit the carpet early in a look from one of Kawakubo’s most recent collections which experimented with silhouettes and bound the body without armholes. Like Kawakubo, she barely spoke to waiting reporters, because when wearing an outfit like that, what’s left to say?\n\nPharrell, also in pieces from the designer, focused on his love of the brand when speaking with reporters.\n\n\"What I feel is lucky and blessed to be able to do it, because its one of my heros,\" he said of co-hosting the night. \"Rei Kawakubo is the best of the best. Comme des Garçons is one of my favorite brands.\"\n\nRihanna climbed towards the Met entrance in another bulbous Comme des Garçons creation, and like Lasichanh, let what she was wearing do the communicating. Fans screamed but the Barbadian singer and fashionista kept mostly silent behind the blossoming, 3-D petals.\n\nBlack-ish’s Tracee Ellis Ross demurely acknowledged her cocoon-dress was also made by Comme des Garçons before striding inside, no time for interviews, her wrangler told waiting reporters.\n\nKaty Perry solemnly processed in a straight line to the museum's door, dragging her lengthy red Maison Margiela train and veil behind her.\n\nOthers likewise had success channeling the avant-garde dress code without wearing the band tee-shirt to the concert. Priyanka Chopra and Ralph Lauren had a clever play on Kawakubo's legacy.\n\n\"Everything that comes out of her is so androgynous and has no lines as far as gender, and this was sort of that,\" Chopra said. \"A trench gown.\"\n\nOthers were at least drawn out of their comfort zones. Claire Foy in Erdem, Candice Swanepoel in Topshop and Kate Bosworth in Tory Burch were among the many guests to say their ensembles for the evening were the most over-the-top they'd ever worn.\n\nBut if their choices spoke for themselves, so too did the starlets whose clothes alluded to the fact that they missed the entire concept.\n\n“I work around the figure, but I am never limited by what the figure has to be,” Kawakubo says in the guide to her exhibition.\n\nSo what would she think of the now-exhausted naked dress trend that showed up again on the likes of Kendall Jenner? One can only imagine she’d find the unfaltering obsession with figure-baring outfits to be limiting. Lingerie brand La Perla was behind the thin slip of a garment and black thong — in what could be called a poorly planned marketing splash, though the reality TV star’s Instagram followers likely ate it up.\n\nAnd therein lies a central reason to what makes Kawakubo's exhibit so refreshing. In the age of President Trump and constant self-promotion and validation on social media, a strong voice that's focused on what's new and never seen before is a mythical thing.", "images": ["https://www.gannett-cdn.com/-mm-/5590e8d56642131ca0af7f737949d082f4444665/c=0-430-2224-1686/local/-/media/2017/05/01/USATODAY/USATODAY/636292610516553866-MG006.JPG?width=2224&height=1256&fit=crop&format=pjpg&auto=webp", "http://videos.usatoday.net/Brightcove3/29906170001/201705/1044/29906170001_5418599873001_5418594980001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/5590e8d56642131ca0af7f737949d082f4444665/c=0-430-2224-1686/local/-/media/2017/05/01/USATODAY/USATODAY/636292610516553866-MG006.JPG?width=2224&height=1256&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2017/05/02/2017-met-gala-clothing-spoke-louder-than-instagram-likes/101188668/", "title": "At the 2017 Met Gala, the clothing spoke louder than the Instagram likes", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "At the 2017 Met Gala, the clothing spoke louder than the Instagram likes", "description": "The reclusive designer behind Comme des Garcon inspired a wide variety of red-carpet looks.", "url": "https://www.usatoday.com/story/life/2017/05/02/2017-met-gala-clothing-spoke-louder-than-instagram-likes/101188668/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5590e8d56642131ca0af7f737949d082f4444665/c=0-430-2224-1686/local/-/media/2017/05/01/USATODAY/USATODAY/636292610516553866-MG006.JPG?width=2224&height=1256&fit=crop&format=pjpg&auto=webp", "width": 2224, "height": 1256}, "type": "article"}, "article": {"author": "Cara Kelly", "content_tier": "free", "opinion": "false"}, "description": "The reclusive designer behind Comme des Garcon inspired a wide variety of red-carpet looks.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/5590e8d56642131ca0af7f737949d082f4444665/c=0-430-2224-1686/local/-/media/2017/05/01/USATODAY/USATODAY/636292610516553866-MG006.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "At the 2017 Met Gala, the clothing spoke louder than the Instagram likes", "description": "The reclusive designer behind Comme des Garcon inspired a wide variety of red-carpet looks."}}, "movies": [], "publish_date": 1493654400.0, "source": "https://www.usatoday.com", "summary": ""}