{"url": "https://people.com/movies/channing-tatum-jenna-dewan-tatum-split-signs-of-trouble/", "text": "Channing Tatum and Jenna Dewan Tatum‘s sudden split after nearly nine years of marriage came as a shock to fans, but there were signs the couple were drifting apart over the last few months.\n\nThe former couple announced the split in a joint statement exclusive to PEOPLE, saying, “We have lovingly chosen to separate as a couple.” They added, “There are no secrets nor salacious events at the root of our decision — just two best-friends realizing it’s time to take some space and help each other live the most joyous, fulfilled lives as possible.”\n\nGet push notifications with news, features and more.\n\nIn early March, Dewan, 37, walked the red carpet at the annual Vanity Fair Oscars after party without Tatum. When asked where the actor was, she told Entertainment Tonight he was home with their 4-year-old daughter Everly.\n\n“He is so happy to have a night off, yes,” she said. Not long after, Tatum, also 37, was spotted dining with a group of friends at Craig’s restaurant without Dewan Tatum.\n\nRELATED VIDEO: Channing Tatum & Jenna Dewan ‘Have Lovingly Chosen to Separate’ After Nearly 9 Years of Marriage\n\nBut the actress’s Oscars date night with BFF Emmanuelle Chriqui also wasn’t the only recent solo outing as of late.\n\nDays after the Oscars, Dewan spent the day practicing her magic with Everly at the Wizarding World of Harry Potter in Los Angeles.\n\nThe couple — who often gushed about each other on social media — were also uncharacteristically mum over the last few months on their accounts.\n\nHowever, as buzz of a split grew louder, they put on a united front and attended the Kids’ Choice Awards together with their daughter and also shared cute snaps of a recent pool and face painting day in March.\n\nIn February, Dewan opened up to Health about the perception that she and Tatum had a “perfect life,” saying instead that they worked hard to keep their relationship going.\n\n“When people say you guys have such a perfect life, I want to scream and tell them no one’s perfect,” she said. “I think there are such things as great fits. It is a great fit as long as you are growing together, and I think up until this point we’ve really grown together. Even if one starts to grow, the other catches up and vice versa.”\n\nDewan said while they always made sure to make time for one another, they still had days where they didn’t get along.\n\n“But I think a couple needs to be conscious and to want to do the work and be willing to look at the parts of you that need work. Both of us have been pretty aware and willing to do that,” she continued. “We’ve always had the same values. But we’re not perfect! Are you kidding? We fight like other couples, we disagree about things, we have days where we don’t really like each other.”\n\nMusing on the institution of marriage, Dewan said, “I don’t think there should be any expectation, any sort of ‘You’re bonded to me for the rest of your life,’ thick and thin. I think that’s an older generational thought.”\n\nAnd while the former couple was known for posting countless photos together on social media, Tatum last posted about Dewan in December. He celebrated the actress’ birthday with a heartfelt message.\n\n“This creature is one more year beautiful. The transformation she invoked this year has been something they only write about in books of fairytale and magic. Your strength and grace ever-evolving,” he wrote. “By doing so you make everything around you grow- everything. And I am so very grateful for your lessons. Happy life day my love.”\n\nThe two first met on the set of their 2006 movie Step Up, and began dating shortly after. They tied the knot in 2009.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1412&h=739&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1412&h=739&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum1.jpg", "keywords": [], "authors": ["Jodi Guglielmi"], "canonical_link": "https://people.com/movies/channing-tatum-jenna-dewan-tatum-split-signs-of-trouble/", "title": "Channing Tatum and Jenna Dewan Split: Signs of Trouble", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celeb Relationships,Channing Tatum,Couples,Jenna Dewan,Movie Celebrities,Movie News,News", "news_keywords": "Celeb Relationships,Channing Tatum,Couples,Jenna Dewan,Movie Celebrities,Movie News,News", "description": "The couple are ending their marriage after nine years", "og": {"title": "Channing Tatum and Jenna Dewan Split: Signs of Trouble", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/channing-tatum-jenna-dewan-tatum-split-signs-of-trouble/", "description": "Channing Tatum&nbsp;and Jenna Dewan Tatum‘s sudden split after nearly nine years of marriage came as a shock to fans, but there were signs the couple&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1412&h=739&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum1.jpg", "width": 1412, "height": 739}}, "pinterest": {"url": "https://people.com/movies/channing-tatum-jenna-dewan-tatum-split-signs-of-trouble/", "description": "The couple are ending their marriage after nine years", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/channing-tatum-jenna-dewan-tatum-split-signs-of-trouble/", "title": "Channing Tatum and Jenna Dewan Split: Signs of Trouble", "description": "The couple are ending their marriage after nine years", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1412&h=739&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}