{"url": "en.wikipedia.org/wiki/Justin_Theroux", "text": "American actor and screenwriter\n\nJustin Paul Theroux ( ; born August 10, 1971)[1] is an American actor, film producer, director, and screenwriter. He gained recognition for his work with director David Lynch in the mystery film Mulholland Drive (2001) and the thriller film Inland Empire (2006). He also appeared in the films American Psycho (2000), Charlie's Angels: Full Throttle (2003), The Girl on the Train (2016), and The Spy Who Dumped Me (2018).\n\nTheroux is further known as a screenwriter for films such as the action comedy Tropic Thunder (2008), the superhero film Iron Man 2 (2010), and the musical comedy-drama Rock of Ages (2012). He made his directorial debut with the romantic comedy film Dedication (2007).\n\nTheroux starred as Kevin Garvey in the HBO mystery drama series The Leftovers (2014–2017), for which he was nominated for the Critics' Choice Television Award for Best Actor in a Drama Series. He also starred as Dr. James Mantleray in the Netflix comedy-drama miniseries Maniac (2018).\n\nEarly life [ edit ]\n\nTheroux was born in Washington, D.C. His mother, Phyllis Grissim Theroux, is an essayist and author, and his father, Eugene Albert Theroux (born 1938), is a lawyer at Baker & McKenzie in Washington.[2][3] Theroux is the nephew of the travel writer and novelist Paul Theroux,[4][5] novelist and poet Alexander Theroux, author Peter Theroux, and novelist and educator Joseph Theroux; he is the cousin of British journalists and documentary filmmakers Louis and Marcel Theroux. His father is of half French-Canadian and half Italian descent. Through his mother, Theroux is a great-great-grandson of financier, banker and railroad magnate H. B. Hollins,[6][7] and of music critic and author Gustav Kobbé.[8][9][10]\n\nTheroux attended Lafayette Elementary School, Annunciation School, and the Field School.[11] He first started acting while in high school at the Buxton School, in Williamstown, Massachusetts. He graduated from Bennington College in 1993 with a B.A. in visual arts and drama.[12]\n\nCareer [ edit ]\n\nTheroux made his film debut in 1996 in Mary Harron's I Shot Andy Warhol. Since then he has performed both on Broadway, starring in Observe the Sons of Ulster Marching Towards the Somme; in numerous off-Broadway productions; and in comedy films such as Charlie's Angels: Full Throttle, The Baxter, Romy and Michelle's High School Reunion, Broken Hearts Club, and Zoolander.\n\nHe has also performed in more serious films such as American Psycho. He appeared in the film versions of the cult television shows Strangers With Candy and Michael Mann's Miami Vice. He starred in David Lynch's films Mulholland Drive and Inland Empire.\n\nIn 2003, he was featured in a music video for the British band Muse for their song \"Hysteria\". Theroux also has appeared on television, having starred in The District and appeared on episodes of shows such as Alias, Ally McBeal, Sex and the City (in which he guest starred in two episodes as different characters), and Six Feet Under (in which he played a recurring character in the third and fourth seasons).\n\nIn 2006, he directed his first film, Dedication, which premiered at the 2007 Sundance Film Festival. A fan of the band Deerhoof, Theroux chose them to score Dedication.[13] Theroux also had roles in two other films at the festival, Broken English and The Ten, in which he played Jesus Christ alongside Gretchen Mol. Theroux co-wrote the Ben Stiller film Tropic Thunder, and also appeared in the behind-the-scenes mockumentary Tropic Thunder: Rain of Madness.\n\nIn 2008, Theroux played John Hancock in the HBO miniseries John Adams. In 2009, Theroux made up part of the voice cast for Call of Duty: Modern Warfare 2. He also played Justin in Parks and Recreation. Theroux wrote the screenplay for the 2010 film Iron Man 2. Following Theroux's work on Tropic Thunder, actor Robert Downey Jr. recommended Theroux as a screenwriter to the film's director, Jon Favreau.\n\nTheroux returned to acting in the film Your Highness (2011), as Leezar, an evil wizard who kidnaps a princess. He starred in the 2012 comedy Wanderlust, playing the leader of a hippie commune. By August 2012, Theroux was hired to direct and rewrite the script for the comedy film Swear to God.[14]\n\nIn June 2013, Theroux was cast as the lead character in HBO's TV pilot The Leftovers,[15] which HBO ordered as a 10-episode season In September 2013.[16] The series, which premiered June 29, 2014, is based on a book of the same name by Tom Perrotta, which follows a group of people left behind in the suburban community of Mapleton after mysterious disappearances worldwide.[17]\n\nTheroux co-wrote the sequel Zoolander 2 (2016), and reprised his role, Evil DJ, in the film.[18]\n\nTheroux also voiced the character The Evil Lord Garmadon in the 2017 film The Lego Ninjago Movie.\n\nIn 2018, Theroux played savant neurochemist James Mantleray in the 2018 Netflix comedy-drama miniseries Maniac opposite Emma Stone and Jonah Hill.\n\nIn 2019, Theroux produced the ABC television event Live in Front of a Studio Audience alongside Norman Lear, Jimmy Kimmel and Will Ferrell. Theroux received a Primetime Emmy Award for Outstanding Variety Special (Live) for producing the event. He also voiced Tramp in the Disney+ live-action film Lady and the Tramp, a remake of the 1955 film with the same name.\n\nUpcoming projects [ edit ]\n\nTheroux is set to play Allie Fox in the Apple TV+ television series The Mosquito Coast, a television adaption from the 1981 novel of the same name written by Paul Theroux, Justin Theroux's uncle. Theroux will also serve as executive producer for the series.[19]\n\nPersonal life [ edit ]\n\nTheroux was in a relationship with stylist Heidi Bivens for 14 years until 2011.[20] Theroux began dating actress Jennifer Aniston in 2011, after working together on the film Wanderlust.[21] They became engaged in August 2012,[21] and wed on August 5, 2015.[22] On February 15, 2018, Theroux and Aniston announced in a statement to the Associated Press their separation at the end of 2017.[23]\n\nIn 2018, Theroux adopted a pit bull named Kuma, meaning bear in Japanese.[24]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo game [ edit ]\n\nYear Title Voice role 2009 Call of Duty: Modern Warfare 2 Additional Voice Talent\n\nAwards and nominations [ edit ]\n\nList of awards and nominations received by Theroux.[25]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Mulholland_drive%28lynch%29--.jpg/220px-Mulholland_drive%28lynch%29--.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Maniac_UK_premiere_%28Theroux%29.jpg/220px-Maniac_UK_premiere_%28Theroux%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/87/Maniac_UK_premiere_%28Theroux%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/87/Maniac_UK_premiere_%28Theroux%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Justin_Theroux", "title": "Justin Theroux", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/87/Maniac_UK_premiere_%28Theroux%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}