{"url": "time.com/5291492/harvey-weinstein-criminal-investigations/", "text": "Harvey Weinstein turned himself in for arrest in New York on Friday on charges of rape, criminal sex act, sex abuse and sexual misconduct in cases involving two women.\n\nAn attorney for Weinstein, who has always denied allegations of “any allegations of non-consensual sex,” said on Friday that Weinstein would plead not guilty to all charges filed by Manhattan District Attorney Cyrus Vance Jr. The charges come after a months-long investigation by the New York Police Department, which was launched after the New York Times and the New Yorker reported in October that dozens of women had accused the Hollywood mogul of sexual harassment and assault.\n\nThe allegations against Weinstein sparked the #MeToo movement and a nationwide discussion about sexual assault and harassment, compelling women and men to come forward with their own accusations against other prominent figures.\n\nThese are the first criminal charges against Weinstein, who has also been the subject of several civil suits. In October 2015, Vance Jr. declined to press charges after an investigation into whether Weinstein groped Italian model Ambra Battilana.\n\nSome said Friday that it was remarkable to see Weinstein face charges. Asia Argento, who said Weinstein sexually assaulted her, said on Friday: “We, the women, finally have real hope for justice.”\n\nThe New York charges are the first against Weinstein, even though several other cities opened up investigations into the producer in the wake of the reporting on the allegations.\n\nHere are the other probes:\n\nFederal probe into Weinstein allegations\n\nFederal prosecutors opened a criminal investigation into Weinstein’s alleged sex crimes, the Wall Street Journal reported earlier this week. The New York Times reported that the investigation will examine whether Weinstein violated federal stalking laws.\n\nThe investigation is being run by the U.S. District Attorney’s Office in the Southern District of New York. Weinstein’s attorney, Benjamin Brafman, told the Journal that he met with federal prosecutors to attempt “to dissuade them from proceeding.” According to the Journal, federal prosecutors had already been looking into Weinstein for potential fraud.\n\nLos Angeles probe into Weinstein allegations\n\nThe Los Angeles County District Attorney’s office is currently reviewing five investigations into Weinstein — two from the Beverly Hills Police and three from the Los Angeles Police department, according to the Los Angeles Times. Los Angeles Police Captain Billy Hayes confirmed on Oct. 19, 2017 that the department was investigating Weinstein after an unnamed woman told police that the Hollywood mogul sexually assaulted her in a hotel in 2013, according to the Times.\n\nNo charges have been filed against Weinstein in Los Angeles as of Friday. The Los Angeles Country District Attorney’s office did not immediately respond to TIME’s request for comment.\n\n“Mr. Weinstein’s criminal attorneys Blair Berk and Benjamin Brafman have said that a fair investigation of the allegations of criminal wrongdoing will prove they are without merit,” a spokesperson for Weinstein told the Los Angeles Times of the Los Angeles investigation.\n\nLondon probe into Weinstein allegations\n\nLondon’s Metropolitan Police confirmed in February 2018 that it was investigating Weinstein after 10 women came forward with sexual assault allegations, according to the Associated Press.\n\nNo charges have been filed against Weinstein in London as of Friday. The London Metropolitan Police did not immediately respond to TIME’s request for comment.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Samantha Cooney at samantha.cooney@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/michael-cohen-prison-coronavirus.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/04/crime-drop-coronavirus.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/05/harvey-weinstein-london.jpg?quality=85&w=1200&h=628&crop=1", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/05/harvey-weinstein-london.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Samantha Cooney"], "canonical_link": "https://time.com/5291492/harvey-weinstein-criminal-investigations/", "title": "Harvey Weinstein Could Face Even More Charges. Here Are All the Investigations Looking Into Sexual Assault Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Crime,sexual misconduct", "news_keywords": "Crime,sexual misconduct", "description": "Harvey Weinstein faces charges in New York for alleged sexual assault. Here are the three other criminal probes opened into the producer.", "og": {"title": "Harvey Weinstein Could Face Even More Charges. Here Are All the Investigations Looking Into Sexual Assault Allegations", "type": "article", "site_name": "Time", "url": "https://time.com/5291492/harvey-weinstein-criminal-investigations/", "description": "Two other cities opened probes into the producer", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/05/harvey-weinstein-london.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5291492/harvey-weinstein-criminal-investigations/", "description": "Harvey Weinstein faces charges in New York for alleged sexual assault. Here are the three other criminal probes opened into the producer.", "media": "https://api.time.com/wp-content/uploads/2018/05/harvey-weinstein-london.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5291492/harvey-weinstein-criminal-investigations/", "title": "Harvey Weinstein Could Face Even More Charges. Here Are All the Investigations Looking Into Sexual Assault Allegations", "description": "Two other cities opened probes into the producer", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/05/harvey-weinstein-london.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}