{"url": "https://www.mercurynews.com/2018/06/26/serena-williams-says-she-might-quit-tennis-if-she-were-to-have-a-second-baby/", "text": "Serena Williams is two victories shy of breaking the record for most individual tennis grand slams all-time. She’s been the dominant force of her sport for two decades, and it seems no one will be able to stand the way of her quest in overtaking Margaret Court’s 24 grand slams.\n\nExcept maybe for a second baby.\n\nIn an interview with In Style magazine, the 36-year-old new mom says a second child would possibly send her into retirement. But she’ll have to discuss it with husband Alexis Ohanian first.\n\n“I don’t know if I want to play if I have another baby, but you’re right. I need to talk to Alexis. We need a plan,” Williams said.\n\nShe also said, “If I weren’t working, I’d already be pregnant.”\n\nWilliams appears as the cover story for the magazine’s first-ever “Badass Women” issue. She talks about her first year of motherhood, how she and Reddit co-founder Ohanian hooked up, attending the royal wedding of Prince Harry and Meghan Markle and, of course, all things badass.\n\nWhich women does Williams place in the badass category? They would be Beyonce, Rihanna and Kate Middleton.\n\nAnd her own No. 1 badass moment involves her 10-month-old daughter, Olympia. Williams was nine weeks pregnant with Olympia in January 2017 when she won the Australian Open by ousting older sister Venus Williams in straight sets. It was Serena’s 23rd singles grand slam title.\n\n“I had a really tough first round and an even tougher second round. I thought, ‘I’m probably going to lose early. That’s OK. I have a good excuse for the first time.'”\n\nShe consulted with a doctor about withdrawing from the tournament, but she was cleared to play with a warning to be careful on hot days.\n\n“I was literally nine weeks by the end of the tournament. I was almost done with my first trimester,” she said. “Every day that passed I thought, ‘This is a dream.’ It was like an animated Disney movie. And by the time the quarterfinals came, I was like, ‘I know I can beat this girl,’ and at the semifinals I thought, ‘I know I can win this match.’ I didn’t think I would win the final, so when I won, it was like, ‘OK, this is crazy.'” Get more celebrity news and photos delivered to your inbox for free on weekdays. Sign up for our Coffee Break newsletter here.\n\nWilliams says tennis has been pushed to the background as she and Olympia have fallen into a daily routine.\n\n“So I feed her, and then she snuggles with me, which is the best part of my day,” she said. “Then we play, and after that I sneak away to practice, usually around 8 a.m. The only rule I have at practice is to be done at 1 p.m., because as much as I love tennis, I need to be with her.”\n\nRelated Articles Dr. Phil slammed for comments on coronavirus deaths — ‘bad examples’\n\nK-pop act Monsta X delivers new video from first all-English album\n\nCoronavirus: Napa Valley Film Festival postponed\n\n‘Disney Family Singalong’: Which number was your favorite?\n\n‘Jump Shot’: Steph Curry-produced film shines a light on basketball pioneer Williams also spoke about becoming fascinated by Silicon Valley because of Ohanian.\n\n“I didn’t know his world at all, but I’ve always been tech-savvy,” she said. “I had a few investments before I met him, and I wanted to know more. So we started talking, just as friends. Just casually chatting. I was getting hot when he was talking about it all. So after that we just continued talking, and then, I don’t know — I love his world.”", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/uploads/2018/06/serena.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://secure.gravatar.com/avatar/020bf2b94c0fb6ac1f396598e197cf31?s=85&d=mm&r=g", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/06/serena.jpg?w=1024&h=683", "keywords": [], "authors": ["Cicero Estrella", "Online Producer", "Cicero Estrella Is The Bay Area News Group'S Entertainment", "Lifestyles Producer. He Has Worked Previously As A Sports", "Features", "News Reporter."], "canonical_link": "https://www.mercurynews.com/2018/06/26/serena-williams-says-she-might-quit-tennis-if-she-were-to-have-a-second-baby/", "title": "Will Serena Williams quit tennis to make more babies with Alexis Ohanian?", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Tennis legend Serena Williams says giving up the sport to have more children with husband Alexis Ohanian is a possibility.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Will Serena Williams quit tennis to make more babies with Alexis Ohanian?", "url": "https://www.mercurynews.com/2018/06/26/serena-williams-says-she-might-quit-tennis-if-she-were-to-have-a-second-baby/", "description": "Tennis legend Serena Williams says giving up the sport to have more children with husband Alexis Ohanian is a possibility.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/06/serena.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-06-26T20:50:44+00:00", "modified_time": "2018-06-27T10:53:21+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Will Serena Williams quit tennis to make more babies with Alexis Ohanian?"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/06/serena.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1529942400.0, "source": "https://www.mercurynews.com", "summary": ""}