{"url": "nymag.com/nymetro/health/features/9909/index1.html", "text": "Photo: Katherine Wolkoff\n\nFourteen weeks pregnant with her first child, Margot Tenenbaum secretly wished she were a bit more nauseous. As it was, she controlled her mild bouts of queasiness with pasta and pizza, but if she’d been just a notch sicker every once in a while, she might have felt too bad to eat at all. Who knows? Maybe she would have even thrown up.\n\nThe thought occurred to her, she sheepishly concedes, at a celebratory brunch in Brooklyn with her husband and another couple who are expecting a child. The other mother-to-be, already a stick before she was pregnant, was telling the group how miserable her morning sickness had been and how she’d lost eight pounds so far in her first trimester.\n\n“And I was saying,” Tenenbaum recalls, “how that’s not my experience. And she said, ‘You should be grateful you’re not sick.’ Then she went on to say, ‘I never wore maternity clothes during my first pregnancy.’ ” Tenenbaum, who in neat, distressing symmetry had already gained eight pounds, hastens to note that she doesn’t think her friend was being rude. “I keep telling myself, We’re different body types. But it’s hard. I’m not thinking, It’s okay to get bigger. I’m pregnant. I’m thinking, This is depressing.”\n\nTo be clear, Margot Tenenbaum is not the fat girl. Though, at 38, she’s had “chubby periods,” for the past seven years or so, she’s been happy with her size-8 self (that’s at Barneys or Jeffrey, she clarifies; size 6 at Old Navy). Beyond that, Tenenbaum is the kind of New York woman other New York women get girl-crushes on. She’s exuberant and witty and sexy, managing to look like those Citizens of Humanity jeans aren’t fashiony but her own brilliant discovery, and she seems to know everybody. Raised in Savannah, Georgia, she’s friendly with the director Wes Anderson, who named The Royal Tenenbaums and the Gwyneth Paltrow character after Margot and her family. (Though she shares a uniquely cool style with her fictional doppelgänger, the real Margot is dark-haired, dark-eyed, and the opposite of laconic.) By day, she runs a mentoring program in Harlem; by night, she hangs out with a large circle of friends from the University of Wisconsin, when she’s not joining her family for one of their regular jaunts to the Breakers in Palm Beach or the Four Seasons in Maui.\n\nI’m not thinking, It’s okay to get bigger. I’m pregnant,” says one mother-to-be. “I’m thinking, This is depressing.” To be pregnant and obsess over your size in New York today, says another expecting mom, is to be, merely, “conscious.”\n\nAll this is to say that Tenenbaum is so confident, so popular, so evolved, that you wouldn’t think she’d waste much time obsessing over gaining weight … while pregnant. Then again, as Pam Berger, another expecting mom and a friend of Tenenbaum’s, said to her recently, to be pregnant and obsess over your size in New York in the year 2004 is to be, merely, “conscious.”\n\nPerhaps at no time and in no place in history have so many women been under so much pressure to stay thin and gorgeous while simultaneously producing a human life. You can still find the woman who welcomes pregnancy as a time “to let herself go,” but more common are those like Tenenbaum, who grabs her thighs and grimaces and confesses to nightmares of becoming a “dumpy, Pea-in-the-Pod woman.” Women fret endlessly about what they eat and how much they weigh from the moment they conceive—and earlier (some diet before they get pregnant to keep their ultimate weight total to a minimum). Julie Tupler, founder of Maternal Fitness and one of the city’s top pregnancy-exercise gurus, has seen her business grow from a few private clients in 1990 to twice-weekly classes that have to be booked weeks in advance, and moms-to-be sweating away at Equinox, Crunch, and New York Sports Club are as ubiquitous as Bugaboo strollers. Chic maternity shops, meanwhile, offer sizes and styles that are definitely not your mother’s muumuu. Comparing what sells most briskly at her Madison Avenue location with her Beverly Hills boutique, Liz Lange, the designer of the country’s first upscale maternity line, says, “We find that our New York women are the skinny minis who can fit into everything. We thought it was going to be the opposite—you think of L.A. as the capital of plastic surgery and skinniness.” Lange’s clothes used to start at size 1; now they begin at zero.\n\nOn New York’s UrbanBaby, a popular Website where women share and kvetch about everything from baby names to real estate to the intricacies of sonograms, “weight polls” regularly erupt:13 weeks, 4 lbs\n\n24 weeks, 20 lbs!\n\n13 weeks, 0 pounds (Okay, I might have gained a pound or two in the very beginning but that’s at most. Should I be concerned?)\n\nCheck with your doctor but probably fine… .\n\n13 weeks, 12 lbs! I feel like a hippo compared to you!\n\n25 weeks, 24 lbs! (No wait. Did the math wrong. 22 lbs. Wow. I feel better.)\n\n\n\nOccasionally, a naysayer will interrupt the endless flow: “148 weeks, three thousand pounds. Just f–kin’ eat, gain weight, get fat if you want, have a healthy baby, lose the weight if you want, get on with your life!!!” But libertines are quickly put in their place—“It sounds like somebody is unhappy about the weight she has gained”—and the expectant mothers happily return to plugging in their weeks and weight, weeks and weight.\n\nNo one has formally examined what pregnant New Yorkers are thinking about their bodies—or putting into them—but in a Johns Hopkins study published last year, 21 percent of the well-educated, affluent Baltimore-area women surveyed reported engaging in “weight-restrictive behavior”: trying not to look pregnant early in pregnancy, attempting to limit weight gain one month after they’d gained “too much” the month before, and fasting before visiting a doctor. The study also unearthed this disconcerting tidbit: Those who’d “undergained” (as measured by widely followed Institute of Medicine guidelines that say women of normal weight should add 25 to 35 pounds; those who are underweight, 28 to 40; and those who are overweight, about 15) had the most positive body images. If those are the numbers in Baltimore, imagine what’s happening on our narrow isle.\n\nOne telling rumor circulating in New York offices is that several of the city’s most fabulous mothers have had Cesarean sections early in the eighth month to avoid putting on the last extra dollop of fat. Removing a baby at that stage for a nonmedical reason would be malpractice, but in the era of the “cosmetic Cesarean”—in which the surgery is performed for women frantic about childbirth damaging their vaginal elasticity or appearance—who knows?\n\nMargot Tenenbaum, now 21 weeks pregnant. (Photograph by Katherine Wolkoff)\n\nManhattan, of course, has long been proudly gaunt, inhabited as it is by legions of celebrities, socialites, fashionistas, and those who would be them (remember Edith Wharton’s ethereal creatures, Lily Bart of the “long, light step” and the “slender pink nails”? Slender nails?). Only in the past few years, however, have the “bump,” the “basketball,” and the “belly on two sticks” entered the local lexicon. Blooming stars now strut the red carpet at the Oscars and pregnant supermodels flaunt their exposed bellies, while Us Weekly, People, and the Star intrepidly report on who has stayed admirably attenuated (Gwyneth Paltrow, Sarah Jessica Parker) and who has not (Debra Messing, Kate Hudson). In late spring, the hot gossip swirled around paparazzi shots of Paltrow emerging smilingly (triumphantly?) svelte from a London hospital. The conspiracy theory was that she hid out in the hospital for a few weeks after giving birth—there’s just no way she could’ve lost so much weight so quickly. The pregnant-celeb watch is about to reach a new peak this fall, as Julia Roberts waddles—she’s having twins; she can’t help it—toward a January due date. Toss into this roiling mix the Atkins and South Beach diets—the latest devotionals in New York’s Church of Divine Diminishment—and you’ve got a freshly minted group neurosis. You’ve also got an unnerving question: Are women starving their babies by starving themselves?\n\nWay back when, in the late fifties, a woman as tortured as Sylvia Plath could be at her sunniest when she was “cow-heavy and floral.” Today, the prevailing attitude toward the extra flesh of maternity verges on disgust. A sampling of what women tell me they do not want to be while pregnant: “a fat slob,” “a huge blob,” “sloppy,” “horrible like Kate Hudson,” “fucking gross.” Tenenbaum’s language is less harsh (“mushy” is her preferred pejorative), but she has the same fear of becoming almost offensive, of not measuring up. She keeps worrying, she says, about an upcoming vacation with her husband’s family. There’s no way she wants to expose her girth in a bathing suit, but then she wonders if they’ll think she’s “ashamed” of her body if she swims in shorts and a shirt. “And maybe I am ashamed,” she says.\n\nBerger sympathizes. “The last time I got weighed [at the OB’s], I was really pleased the nurse just wrote the number in my chart and didn’t say it out loud, because it was so … If you knew how much I weighed, you’d be like, ‘Oh, my God!’ ”\n\nIn conversations with several dozen more pregnant women and new mothers, I was repeatedly struck by how fixated they are on the new pregnancy ideal, how much they lap up the praise if they “achieve” it, how anxious they are if they don’t. It’s a jungle out there, and only the scrawniest survive.\n\nBeth Dorfman, a second-trimester periodontist, was so concerned about blowing up, and about eating healthy in general, that she consulted nutritionist Tanya Zuckerbrot early in her pregnancy (Zuckerbrot says she’s seen a significant increase in the number of women who come to her for weight-related reasons). “I remember shopping with my mother and I thought, ‘These random people walking past me on the street, I wonder if they think “Hmm, that girl might be pregnant,” or “That girl might just have eaten seventeen cupcakes an hour ago,” ’ ” Dorfman says.\n\nZuckerbrot advised Dorfman to eat more protein and fiber (pregnant women can go Atkins, by the way, as long as they eat some carbs) and turned her onto the miracle that is Scandinavian fiber crisps. “They’re like sixteen calories a cracker,” Dorfman says. “They’re not the tastiest—a nice bagel or bread would taste better—but they satisfy some of the craving and fill me up.” Dorfman promptly began eating three of the Scandinavian crisps topped with peanut butter and jelly for breakfast. Even her peanut butter is diet, she says. “It’s not Skippy Reduced Fat; it’s even lower fat than that, like 2.5 grams per serving.” All the calorie counting is a necessary evil, says Dorfman. “When you’re pregnant, you’re only supposed to eat 300 more calories per day,” she says, citing a common recommendation. “That’s not much. One of those Dannon Light ’n Fit yogurts, that’s 100 calories right there.”\n\nWhen it comes to exercise, so many women rhapsodized to me about spotting a sublimely trim pregnant woman exercising her butt off at the local Equinox that I began to wonder whether clever health-club marketers were fitting trainers with fat pads. Meredith Paley, a vice-president at Kenneth Cole whose daughter, Ava, was born in July, is one of those who attracted gawkers. Her pregnancy-workout schedule: spinning on Tuesdays, body sculpting Wednesdays, one or two other random gym visits a week, and five-mile Central Park runs on Wednesdays, Fridays, and both weekend days. Because Paley knows that doctors recommend that pregnant women keep their heart rates under 140 beats per minute (to keep sufficient oxygen flowing to the baby), she says she always wore a monitor and walked when the number got close. A serious runner, Paley volunteers several times that intense exercise is natural for her, what makes her feel good. Still, she says, “I’m the first to admit that I didn’t see pregnancy as an excuse to sit on my ass and let the pounds come.”\n\nOne maternity researcher says she ﬁnds her subjects’ weight-restrictive behaviors unnerving. “The pregnancy and delivery is all about them. If you can’t invest in your baby by gaining weight, I think it’s a harbinger for lack of investment in the child.”\n\nDorfman, also an avid exerciser, is frustrated by the heart-rate cutoff. “If the doctor says 140, I want to go to 137—that’s just the type of person I am. I’m not going to jeopardize the health of my child, but I’m on the treadmill like, God, I’m not even sweating. I feel like it’s not doing anything.”\n\nThis kind of superfit patient has become increasingly common, says Upper East Side obstetrician Shari Brasner, during the ten years she’s been in practice. She mentions a third-trimester patient who blew by her running in the park recently (“It was unbelievable”), and one who, after developing a painful nerve cluster in her foot, cut a hole in her sneaker rather than step off the treadmill. The doctor says it’s not hard to spot which patients are tormented by their expansion: “They take ten minutes to remove every last bit of clothing, down to the rubber band on their ponytail, before getting on the scale.”\n\nJulie Tupler disavows the idea that women should be skinny or diet during pregnancy, but there’s no denying that her classes attract those who are serious about flab. “You’re not supposed to gain ten pounds in the first trimester,” says Patty Surak, who was eight months along, “but I did.” On a recent Tuesday afternoon, Surak and five other very pregnant women were assembled for a Tupler session, outfitted in oversize T-shirts and black exercise pants. One staple of Tupler’s class is a sort of pregnancy-safe sit-up. The group’s homework is 500 a day.\n\n“What’s the magic word for next week?” Tupler asked.\n\n“One thousand,” the group replied in unison.\n\n“You can start doing these again right after the placenta comes out,” Tupler said. “I had one student who even did it before!”\n\nAs is probably obvious by now, it’s not just how much weight women gain but where they gain it. Like Dante’s levels of hell, there’s a hierarchy of bad to worse. Level 1: All extra adipose tissue is smartly confined to the stomach. (“That’s the baby’s body, not yours,” says mother and academic body watcher Susan Bordo, author of the recently rereleased Unbearable Weight: Feminism, Western Culture, and the Body.) Level 2: Your breasts get big, too, but nothing else. (“I know a lot of women who get pregnant who are very flat-chested, and it’s like heaven to them,” says Tenenbaum, who’s already well endowed and hasn’t felt the thrill, though her husband apparently can’t get enough: “He’s like, ‘Your boobs! They’re so big! It’s great!’ ”) Level 3: Your butt and thighs puff up, or become “rumply” (one UrbanBaby mother’s lament). And finally, Level 4: Your face and ankles swell, a fate that befell 34-year-old publicist Katie Pottinger. “My entire body widened. My face, I wouldn’t even say it was puffy; I mean, it really blew out. There was a thickening,” she says, “that happened all over.”\n\nThe skinny-pregnancy set also lives to be told they’re having a boy. Under the old anti-feminist canard straight out of Grimm’s, girls “steal” their mother’s looks. “I was like a preening peacock when people told me ‘You must be having a boy,’ ” says Kate Walsh, an associate editor for Metropolitan Home and the new mother of a very female Evelyn. Diana Becker, a soft-spoken 28-year-old legal secretary, got the other end of the deal: “You must be having a girl,” a neighbor lady informed her. “Why?” Becker naïvely asked. “Because people get fat all over when it’s a girl.”\n\nThe truly chic aim to avoid maternity clothes—even Liz Lange—for as long as possible. A fashion-marketer lady-who-lunches who asked me not to use her name led me from floor to floor of Barneys on a tour of what’s in her pregnant-waif’s wardrobe: clingy Missoni halter dresses, anything Diane Von Furstenberg, Pucci hot pants teamed with Hanes T-shirts, and terry-cloth Juicy dresses. At five months pregnant, she was wearing size-27 Seven jeans.\n\nProving that no one, no matter how tiny, is immune from wanting to be tinier, my Barneys guide also indulged in what I’ll call gestation-inflation. She said she’d gained nine pounds at six months, but when she gave me her due date, I discovered she was just over five. Now, I have no idea whether this was conscious, unconscious, or just bad math, but I recognized the move because I, too, was a fairly skinny pregnant person with my first baby, and I vaguely remember shaving off a few weeks here and there. I never planned to do it, but when asked for the umpteenth time “How far along are you?,” a rounded-up number just popped out of my mouth.\n\nKate Walsh never allowed her husband to remain in the examining room for her weigh-ins, and the effort to keep the top-secret number from him eventually reached sitcom-ish proportions. “Matt had no idea how much I’d put on until I was getting the epidural and the anesthesiologist asked, ‘How much do you weigh?’ I knew I couldn’t lowball, because then I wouldn’t get enough drugs, so in the middle of a contraction I’m trying to whisper the number to the doctor, and he’s saying, ‘What? I’m sorry, I can’t hear you.’ So I blurted it out and whipped around to see Matt’s reaction. He didn’t even blink, bless him.”\n\nSo to cut to the elephant in the room: Is all this downsizing hurting kids? While the medical literature is flecked with horrifying case histories of a bulimic vomiting immediately after delivery and tearing out her episiotomy, of another exercising so compulsively as to require hospitalization, the consensus is that women with actual eating disorders tend to get a grip on them while they’re pregnant. (Most true anorexics stop menstruating and can’t get pregnant in the first place.) “It’s almost like, ‘This foreign object in there—let me take care of it,’ ” says Mount Kisco psychotherapist Kristin Lore, an eating-disorders specialist. “But once the baby’s out of there, it’s about them again.”\n\nThe real question, then, is: Would gaining the bare minimum of recommended weight, or perhaps even a tad less, harm a developing child? The answer from obstetricians and nutritionists is, basically, no, though the topic has surprisingly controversial aspects. The goal isn’t to hit a specific weight, experts say, but to eat a well-balanced diet, including some carbs (Tenenbaum’s dreaded “white foods”). “Babies don’t need their mothers to gain that much,” says Mount Sinai maternal-fetal-medicine specialist Larry Rand, who’s been so struck by the anguish of new mothers left with a “big chunk of weight” that he’s launching a study to investigate the association between mild postpartum depression and gain during pregnancy. “The general gist you get in medical school is that even in times of famine, it’s never so bad.”\n\nWhat he means is that it practically takes a famine for things to get bad. The Ur-study on the subject of maternal weight gain is the Dutch famine project. Surveying the health of babies born to women pregnant during a Nazi-induced famine in the Netherlands in 1944–45, Columbia University husband-and-wife researchers Zena Stein and Mervyn Susser found that women exposed to the famine during the third trimester gave birth to babies who were on average 10.6 ounces lighter than others. (Fetuses exposed in the first or second trimesters were not born smaller; most fetal weight gain occurs in the third trimester.)\n\nNow, chopping ten ounces off average birth weights across a population is dangerous business. “Low birth weight” (under five pounds, eight ounces) and, worse, “very low birth weight” (under three pounds, five ounces) babies have higher rates of everything from cerebral palsy and blindness to infant mortality. Smaller babies also seem to have lower IQs, but only by a point or two. And, in a cruel irony for pregnant punys, there’s also a tentative finding that smaller babies are more likely to become obese adults. The theory is that the exquisitely malleable fetal brain adapts to some sort of prenatal nutritional deprivation that is then out of sync with the supersize American diet.\n\nWhat makes this all complex, however, is the extent to which—outside of famine—a mother’s caloric intake causes low birth weight. Most light babies, for one, are simply born too early, and the amount women eat doesn’t seem to be a major factor in prematurity, at least not in the United States. What’s more, a baby’s growth can be impaired by anything that alters blood flow through the placenta, such as smoking, maternal infections, and exposure to toxic substances like lead. Doctors also believe each child has a genetically set “optimal birth weight,” which may well be smaller for smaller mothers, yet there’s no way to know what that ideal is. Doctors and nutritionists also say genetics plays a part in how much weight an expectant mother gains. While there are no studies that pinpoint the degree of influence, the conventional wisdom is that some portion of weight gain is essentially out of women’s control. One thing is for sure, says Tufts maternal-nutrition expert David Rush: He knows of no successful attempt to “feed women up.” In one oft-cited example, he and Mervyn Susser tried to enrich the diets of poor African-American women in Harlem in the early seventies. “The [women] gained maybe a pound or two,” Rush says. “Trivial stuff.” With babies, he adds, “the typical increment we’ve been able to make, even with aggressive feeding, has been an ounce to an ounce and a half.” Rush’s fellow eminence in the field of maternal nutrition, McGill University pediatrician Michael Kramer, is no less convinced that a physician could get a woman to gain more than she’s predisposed to gain. “In the U.K., they don’t weigh women during pregnancy because there’s no evidence that knowing how much weight you’re gaining actually affects the outcome of the pregnancy. It has no effect, other than to make a woman feel bad.” So why the Institute of Medicine guidelines? “It’s helpful to recommend a range,” says Barbara Abrams, a University of California, Berkeley, public-health professor and co-author of the Institute of Medicine recommendations. “We owe women and their doctors as much guidance as possible.”\n\nFinally, is there any meaning behind the desire not to look too fat in pregnancy other than the desire not to look too fat in pregnancy? It’s a truism that everyone in New York came here to make it big (preferably metaphorically)—and women’s discomfort about the threat children pose to their identities can thus only be more acute. Larry Rand says he often hears this from patients: “I’ve waited until now to have this baby. I’m very accomplished, I’m fit, I go to the gym five times a week, and I really don’t want this pregnancy to change my life.” Going home from the hospital in the jeans you wore before you got pregnant becomes a “symbol,” he says: You’re the same person you used to be.\n\nI recognize in myself a certain resistance to letting a child change my life, and I hear glimmers of it from other women. “I want to look like myself again,” says Diana Becker. “Soon.”\n\nJohns Hopkins psychologist Janet DiPietro says she finds her subjects’ weight-restrictive behaviors unnerving. “The pregnancy and the delivery is all about them; it’s almost like they can’t see that they’re going to get a baby out of this deal,” she says. “If you can’t invest in your baby by gaining weight, I think it’s a harbinger for lack of investment in the child.”\n\nBut surely that is going too far, at least not without understanding each weight-worrying mother. Rand, in fact, believes the focus on staying thin is largely benign. “I don’t want to feed into the culture of ‘You must be skinny,’ ” says the self-described fat kid. “But I have a lot of empathy for what it feels like to lug around too much weight. If we lived in a world where nobody gave a crap … but we don’t.”\n\nIn her 1996 book Mother Love, Mother Hate: The Power of Maternal Ambivalence, British psychoanalyst Rozsika Parker observes that health professionals under the sway of Freud have treated “disliking the physical changes of pregnancy” and experiencing symptoms like nausea as a rejection of motherhood. The thesis of her book is that all women experience strong feelings of dislike and resentment toward their children, feelings that recede and advance, from conception to adolescence and beyond. But that doesn’t mean nobody’s a “good enough mother,” of course.\n\nNot long ago, I had breakfast with Margot Tenenbaum and Pam Berger. At one point, Tenenbaum began chastising herself for being preoccupied about her weight when there are so many more important things for a mother-to-be to be preoccupied about. Berger should know. She almost lost her first child, Louise, to a rare infection during pregnancy. Still, she told Tenenbaum she was being silly. “You can be deadly serious about wanting to have a healthy baby but also wanting to feel good in your own body,” Berger said. “Women’s brains are big enough to worry about two things at once.”\n\nSarah Bernard contributed to this story.", "images": ["https://pixel.nymag.com/imgs/nymag/nymlogo2.w1200.h630.png", "https://images.nymag.com/nymetro/news/features/perfectbump040920_1_175.jpg", "http://images.nymag.comhttp://www./nymetro/news/features/perfectbump040920_2_400.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/nymag/nymlogo2.w1200.h630.png", "keywords": [], "authors": [], "canonical_link": "https://nymag.com/nymetro/health/features/9909/", "title": "Pregnant and Still Thin", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Pregnant and Still Thin - Nymag", "url": "https://nymag.com/nymetro/health/features/9909/", "description": "Many of the city’s mothers-to-be are counting every carb and pushing their heart-rate monitors to the limit to stay skinny and sexy while pregnant. Is this harmless vanity? Or a New York obsession gone too far?", "image": "https://pixel.nymag.com/imgs/nymag/nymlogo2.w1200.h630.png", "site_name": "New York Magazine", "type": "Article"}, "twitter": {"title": "Pregnant and Still Thin - Nymag", "description": "Many of the city’s mothers-to-be are counting every carb and pushing their heart-rate monitors to the limit to stay skinny and sexy while pregnant. Is this harmless vanity? Or a New York obsession gone too far?", "image": "https://pixel.nymag.com/imgs/nymag/nymlogo2.w600.h315.2x.png", "card": "summary_large_image", "site": "@nymag"}, "description": "Many of the city’s mothers-to-be are counting every carb and pushing their heart-rate monitors to the limit to stay skinny and sexy while pregnant. Is this harmless vanity? Or a New York obsession gone too far?", "article": {"tag": "pregnancy, pregnant, sexy, thin, skinny, weightloss, Margot Tenenbaum, pregnancy fitness classes, weight gain", "publisher": "https://www.facebook.com/NewYorkMag"}, "sailthru.tags": "pregnancy, pregnant, sexy, thin, skinny, weightloss, Margot Tenenbaum, pregnancy fitness classes, weight gain", "fb": {"app_id": 120608177953522}, "type": "Article", "vertical": "New York Magazine", "apple-mobile-web-app-title": "nymag", "application-name": "nymag", "msapplication-TileColor": "#111", "msapplication-TileImage": "https://assets.nymag.com/media/sites/nymag/icon.144x144.png"}, "movies": [], "publish_date": 1095435660.0, "source": "http://nymag.com", "summary": ""}