{"url": "https://people.com/tv/jeff-varner-reacts-being-fired-after-outing-survivor-contestant-zeke-smith-transgender/", "text": "Survivor contestant Jeff Varner says he was “devastated” to lose his job as a North Carolina real estate agent following outrage and backlash for outing fellow tribemate Zeke Smith as transgender on the CBS reality competition last week.\n\nAccording to News & Record Greensboro, Varner was fired from his job the day after the episode aired in which Varner attempted to save himself from being eliminated by painting Smith as “deceitful.” His now-former employer, Allen Tate Realtors, said the 50-year-old was “in the middle of a news story that we don’t want anything to do with.”\n\nGet push notifications with news, features and more.\n\nThe three-time Survivor contestant, who first appeared during season two in 2001, told Entertainment Tonight that he was completely blindsided by his firing.\n\n“As I’m spending hours doing press [on Thursday], I discover I can’t access my email. Then the MLS association emails to say, ‘You’ve been terminated.’ I didn’t even find out from my company,” he said. “Suddenly my real estate license was inactive and my current clients [were] left in the dark. It took hours after my press junket to get anyone with the company on the phone to tell me personally, and even longer to calm my clients, all of whom, by the way, are coming with me to my new firm. It was an ugly day.”\n\nImage zoom Robert Voets/CBS via Getty; Monty Brinton/CBS via Getty\n\nVarner said he was dismissed in “what I felt was an ugly, knee-jerk reaction kind of way.”\n\n“I was devastated,” he added. “[I warned the company that headlines might be coming], but apparently not the people who needed to hear it.”\n\nThe openly gay North Carolina native, who previously worked as news anchor for CBS and Fox affiliates, said he looked forward to working for a firm that would support him during hard times.\n\n“I wasn’t even given the chance to explain or right the wrong,” Varner said. “In the real estate world, buyers and sellers want to know they’re signing up with a company that won’t dump them or turn their backs on them in time of trial. So I’m talking to several firms now that I know will care about and believe in their employees. I have had several reach out [and] I’m confident I’ll find a better home.”\n\nFROM COINAGE: Outed as Transgender on Reality TV: Survivor’s Zeke Smith\n\nThis season of Survivor, dubbed “Game Changers” for its 34th installment, had been filmed 10 months ago in the Mamanuca Islands of Fiji — though Varner couldn’t discuss what happened until the episode’s airing.\n\nDuring that time, he said he’s done a lot of growing.\n\n“I have spent 10 months stewing in this awful, horrible mistake I have made,” Varner told EW Morning Live (Entertainment Weekly Radio, SiriusXM, channel 105) on Thursday. “I have been through, I don’t know how much therapy. With the show’s therapist, with a local therapist. I have met with and spoken to several LGBT organizations — I’ve joined the board of a couple of them… this has changed me drastically.”\n\nAs tough as it’s been for him, Varner recognizes that Smith, 29, is the real victim in this situation.\n\n“This is about Zeke,” Varner said. “I can only profusely apologize. I have apologized to him — we’ve spoken several times on the phone. He continually forgives me. I am amazed and moved at his ability to do that. I know that forgiveness is difficult. I know that he has a lot of people in his ear. I know that watching this last night was traumatic not only for me and my family — I can only imagine what this was like for him and his friends and everybody who loves him.”\n\n“I hurt him,” Varner continued. “When we were in pain and we are in fair, we are dangerous people. We say things we don’t mean. And he’s calling me a bigot and full of hate and all kinds of stuff. I forgive him for that. I give him every inch of every room to feel and experience what he’s feeling. If he wants to take swings at me, I’m the one to hand him the bat. I deserve it. I deserve every bit of it. No one is going to beat me up worse than I have myself.”\n\nSmith, who is still in the game, told PEOPLE he was “shell-shocked” by Varner’s decision and struggles with forgiving him.\n\n“I think he hoped others would believe that trans people are dangerous and fraudulent,” he said. “That reasoning is infinitely worse than him outing me because it’s the same one used to discriminate against, attack and murder trans people. What’s great is that nobody bought it.”\n\n“It’s important people see he lost that fight,” he added. “The message should be clear that hate will always lose.”\n\nSurvivor airs Wednesdays (at 8 p.m. ET) on CBS.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjeff-varner-survivor.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fsurvivor-jeff-zeke-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjeff-varner-survivor.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/tv/jeff-varner-reacts-being-fired-after-outing-survivor-contestant-zeke-smith-transgender/", "title": "Jeff Varner Reacts to Being Fired After Outing Castmate", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "News,Survivor,TV,TV Watch", "news_keywords": "News,Survivor,TV,TV Watch", "description": "Jeff Varner, a three-time Survivor contestant, said he was completely blindsided by his firing from a real estate company", "og": {"title": "Jeff Varner Reacts to Being Fired After Outing Castmate", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/jeff-varner-reacts-being-fired-after-outing-survivor-contestant-zeke-smith-transgender/", "description": "Survivor&nbsp;contestant&nbsp;Jeff Varner&nbsp;says he was “devastated” to lose his job as a&nbsp;North Carolina real estate agent&nbsp;following&nbsp;outrage and backlash&nbsp;for&nbsp;outing fellow tribemate&nbsp;Zeke Smith&nbsp;as transgender&nbsp;on the CBS reality competition&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjeff-varner-survivor.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/jeff-varner-reacts-being-fired-after-outing-survivor-contestant-zeke-smith-transgender/", "description": "Jeff Varner, a three-time Survivor contestant, said he was completely blindsided by his firing from a real estate company", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjeff-varner-survivor.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/jeff-varner-reacts-being-fired-after-outing-survivor-contestant-zeke-smith-transgender/", "title": "Jeff Varner Reacts to Being Fired After Outing Castmate", "description": "Jeff Varner, a three-time Survivor contestant, said he was completely blindsided by his firing from a real estate company", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjeff-varner-survivor.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}