{"url": "https://www.elitedaily.com/entertainment/celebrity/pregnant-beyonce-costume-ideas/2068191", "text": "It's the most wonderful time of the year, kiddos. No... not Christmas... Halloween! October is right around the corner and as we gear up to trick-or-treat our asses all over town for the year's most chaotic, fun, and candy-filled holiday, it's impossible to not think about your costume. That being said, these pregnant Beyoncé costume ideas are pure, iconic, gold.\n\nLet's be real, it's been a crazy year in pop culture, so there are definitely tons of viable options out there for badass Halloween costumes. You could throw on a mask and go as Trump or Hillary; you could grab a guitar and some cowboy boots and go as one of the \"old\" Taylors; you could get crafty AF and go as Wonder Woman, or you could go big and go as your favorite character from Game of Thrones. While any of these ideas, if done well, would definitely win you a costume contest, none even compare to pregnant Beyoncé.\n\nBeyoncé has had some majorly iconic looks over the years, and, as an icon of our time, there's no way you would go unrecognized if you were to choose any of Mrs. Carter's legendary looks. Since her most popular look thus far this year has been pregnant Bey, though, that's definitely the way to go. And, I mean, what better way to honor our nation's royal family than by celebrating the heirs to the royal throne? Here are some costume ideas to help you pull off a flawless pregnant Bey look this year and have everyone at the party jealous.\n\n1. Pregnant VMAs Beyoncé\n\nKevin WInter/Getty Images\n\nTake it old school with this one and recreate Beyoncé's 2011 VMAs look. Perhaps one of the most legendary moments in VMAs history, this is the look where Bey famously announced she was pregnant with Blue Ivy while performing \"Love on Top.\"\n\nWhat you'll need:\n\nA blonde curly wig (unless you have the hair to pull this off, in which case, more power to you!) A white button-down shirt A pair of black pants A purple sequined blazer A microphone (optional)\n\nObviously, the most important part of this look is the iconic jacket, so any way you can pull that off works. If you want to add an extra little comedic flair to this, I suggest picking up a pair of orthopedic shoes — they'll be hilarious and they'll keep you comfortable all night.\n\n2. Pregnant Instagram Beyoncé\n\nGo big or go home with this one. This is probably Bey's most important look of the past year (maybe even decade). This is the look where she announced her second pregnancy on Instagram.\n\nWhat you'll need:\n\nA dark brown bra A pair of baby blue silk shorts or panties (depending on what kind of party this is) A mint green veil A flower crown\n\nThis is a pretty simple look to pull off, and the pay off will be huge. The flower crown isn't necessarily part of the original look here, but it will represent the bouquet behind Bey and it will serve to hold your veil in place all night.\n\n3. Pregnant Grammys Beyoncé\n\nTransform yourself into royal Bey with this look. This is Beyoncé's look from the 2017 Grammys. There's a lot to be in awe of here, but her beautiful pregnant belly is definitely front and center.\n\nWhat you'll need:\n\nA (fake) gold tiara, unless you can afford a real one, or a gold sheer veil A gaudy gold choker or bib necklace A gold sequined dress Gold bracelets Huge circular, gold earrings A fake Grammys trophy.\n\nFor added drama, make your friends carry you around in a chair all night.\n\n4. Pregnant Instagram Beyoncé (part 2)\n\nThis is a super simple way to pull off the pregnant Bey look, especially if you don't have much time to throw something together.\n\nWhat you'll need:\n\nMost of this stuff you might already have, which makes this pregnant Bey look super simple to put together last minute.\n\n5. Pregnant Wearable Art Gala Beyoncé (also known as Pregnant Instagram Beyoncé part 3)\n\nAnother quick way to pull off a classic pregnant Bey look this Halloween. Queen B wore this red number to the inaugural Wearable Art Gala in April and you really only need three things to pull it off.\n\nWhat you'll need:\n\nThe bigger the better with this one, but if you only have a little time, you can find (or make) a flower crown with stuff at any crafts store.\n\nThere ya have it, everything from the most complicated to the easiest pregnant Beyoncé looks. Now go out there and party all night long.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/elite-daily/2017/09/13113154/beyonce-pregnant-2011-vmas.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/09/13113154/beyonce-pregnant-2011-vmas.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.elitedaily.com/elite-daily/2017/09/13105351/beyonce-2011-vmas2.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/09/13113154/beyonce-pregnant-2011-vmas.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/pregnant-beyonce-costume-ideas/2068191", "title": "5 Pregnant Beyoncé Costume Ideas To Feel Like A Queen This Halloween", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/pregnant-beyonce-costume-ideas/2068191", "type": "article", "title": "5 Pregnant Beyoncé Costume Ideas To Feel Like A Queen This Halloween", "description": "It's the most wonderful time of the year, kiddos. No... not Christmas... Halloween! October is right around the corner and as we gear up to trick-or-treat our asses all over town for the year's most chaotic, fun, and candy-filled holiday, it's…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/09/13113154/beyonce-pregnant-2011-vmas.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It's the most wonderful time of the year, kiddos. No... not Christmas... Halloween! October is right around the corner and as we gear up to trick-or-treat our asses all over town for the year's most chaotic, fun, and candy-filled holiday, it's…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}