{"url": "https://www.elitedaily.com/entertainment/celebrity/kylie-jenner-breakup-with-tyga/2051713", "text": "Kylie Jenner, America's celebrity makeup mogul and reality star, is talking about Tyga and she's not holding back. In a recent episode of Life of Kylie on Sunday, Aug. 20, 2017, the superstar expressed her feelings about her breakup with Tyga, and it's everything you'd ever want to hear. Let's just say Kylie Jenner's life after her break up with Tyga seems way better. God, I love it when celebrities talk about their exes. It brings me great joy.\n\nJenner opened up about her relationship with Tyga while getting ready for the 2017 Met Gala and she really dug deep. The 20-year-old said, \"I've had more fun this past month than I have in, like, years.\" That's a great sign, girl. Sorry, Tyga.\n\nJenner, who's now dating rapper Travis Scott, also revealed this candid comment,\n\nLike, the last three years of my life were just like a blur. I just stayed in the house all day. Now it's like, I feel like I can be more myself. I feel way more free. I'm just like really, genuinely happy right now.\n\nIt's great Jenner is out of the house and living life to the fullest. At the same time, it's heartbreaking to know Jenner thinks the years she spent with Tyga by her side are \"like a blur.\" It's also sad to know she spent a majority of the time in the house instead of really living her life.\n\nJenner and Tyga were together for a long time, but Tyga made it clear last month that he didn't lose Jenner to Scott. He told Power 105.1,\n\nI mean, we started off as friends, and then we got into a relationship. It ain't a losing thing. When you make a decision to not be in a relationship with somebody, you make that decision, you split ways.\n\nIt's no wonder Jenner feels free after a breakup, considering she's under a lot of pressure pretty much all of the time. Travis Scott, you must treat her like gold!\n\nYou can catch the new episode of Life of Kylie at 9 p.m. ET.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/08/23093623/Kylie-Jenner-Red-Carpet1.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/elite-daily/2017/08/23093623/Kylie-Jenner-Red-Carpet1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://media.giphy.com/media/43sntZkSdP4Ry/giphy.gif", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/08/23093623/Kylie-Jenner-Red-Carpet1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/kylie-jenner-breakup-with-tyga/2051713", "title": "Kylie Jenner & Tyga's Breakup Helped 'Life Of Kylie' Star Feel \"Way More Free\"", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/kylie-jenner-breakup-with-tyga/2051713", "type": "article", "title": "Kylie Jenner Reveals Truth About Relationship With Tyga & It Will Break Your Heart", "description": "Kylie Jenner, America's celebrity makeup mogul and reality star, is talking about Tyga and she's not holding back. In a recent episode of Life of Kylie on Sunday, Aug. 20, 2017, the superstar expressed her feelings about her breakup with Tyga, and…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/08/23093623/Kylie-Jenner-Red-Carpet1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Kylie Jenner, America's celebrity makeup mogul and reality star, is talking about Tyga and she's not holding back. In a recent episode of Life of Kylie on Sunday, Aug. 20, 2017, the superstar expressed her feelings about her breakup with Tyga, and…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}