{"url": "https://en.wikipedia.org/wiki/O._J._Simpson_robbery_case", "text": "Criminal case of O. J. Simpson\n\nCourt Nevada District Court Full case name State of Nevada v. Orenthal James Simpson, et al. Decided October 3, 2008 ; 11 years ago ( ) Verdict Guilty on all 12 counts Case history Subsequent action(s) O. J. Simpson was sentenced to 33 years in prison with eligibility for parole in 9 years.\n\nHe was released from prison on October 1, 2017. Court membership Judge(s) sitting Jackie Glass\n\nThe O. J. Simpson robbery case (officially State of Nevada v. Orenthal James Simpson, et al.) was a criminal case prosecuted in 2007–2008 in the U.S. state of Nevada, primarily involving the retired American football player O. J. Simpson.\n\nOn the night of September 13, 2007, a group of men led by Simpson entered a room in the Palace Station hotel in Las Vegas, Nevada. Bruce Fromong, a sports memorabilia dealer, testified that the group broke into his hotel room and stole memorabilia at gunpoint.[1] Three days later, on September 16, 2007, Simpson was arrested and held without bail.[2] He admitted taking the items, which he said had been stolen from him, but denied breaking into the room. Simpson also denied the allegation that he or the people with him carried weapons.[3][4]\n\nOn October 3, 2008—exactly 13 years after he was acquitted of the murders of his ex-wife, Nicole Brown Simpson, and Ronald Goldman—Simpson was found guilty of all 12 charges. On December 5, 2008, Simpson was sentenced to 33 years in prison with eligibility for parole in nine years (in October 2017). On July 20, 2017, Simpson was granted parole,[5] and was freed on October 1, 2017.[6]\n\nRobbery [ edit ]\n\nAlfred Beardsley, a memorabilia dealer, contacted Tom Riccio, another memorabilia dealer, regarding a trove of O. J. Simpson items Beardsley had in Las Vegas. Riccio then informed Simpson of the items. Claiming that the memorabilia were stolen from him, Simpson, along with Riccio, devised a plan to confront the dealers and get them back. Simpson, who was already planning on going to Las Vegas for a wedding, recruited some wedding guests for the operation.[7] The robbery was planned at Palms Casino Resort.[8] Bruce Fromong, another memorabilia dealer and a friend of Simpson's, met with Beardsley and Riccio in room 1203 at the Palace Station, a room Riccio had rented. Beardsley had contacted Fromong about a client hoping to buy a large amount of O. J. Simpson memorabilia; Fromong was unaware the client was Simpson.[7][9] Riccio had Beardsley and Fromong move the items into the room and spread the memorabilia on the bed to create a display.[10] After a pre-wedding dinner, Simpson and five accomplices drove to the Palace Station, where they met Riccio in the lobby.[7][10] After some confusion over the room's location, Simpson's party entered the room at 7:38 PM.[7][8]\n\nWhen the group entered the room, Simpson ordered his group to not allow anybody to leave.[10] Simpson and Beardsley proceeded to argue over where the memorabilia came from.[7] During the confrontation, accomplice Michael McClinton threatened Fromong with a gun.[8] Simpson's group then stuffed O. J. Simpson memorabilia, along with autographed Pete Rose baseballs and Joe Montana lithographs, into pillowcases.[11][8] The party then returned to the Palms Casino Resort.[8] The confrontation lasted about six minutes.[12]\n\nInvolved parties [ edit ]\n\nO. J. Simpson: Sentenced to prison for 9 to 33 years.\n\nSimpson: Sentenced to prison for 9 to 33 years. Walter Alexander: Alleged accomplice of Simpson. Brought a gun into the room. Sentenced to probation. [13]\n\nClarence \"C. J.\" Stewart: Alleged accomplice of Simpson and driver of a Lincoln Navigator used to haul the items after the alleged incident. Stood by Simpson during the trial and did not negotiate a plea deal. Judge Jackie Glass sentenced Stewart, the only Simpson cohort who did not negotiate a plea deal, to 15 years in, eligible for parole after 7 and a 1/2 years. The conviction was later overturned because the verdict was tainted by Simpson's fame, and Stewart was released after a plea deal with time served. [13]\n\nRyan Braun: Alleged accomplice of Simpson. Introduced himself as a friend of Stewart's. Carried items out of the room. First met Simpson on the day of the robbery. Sentenced to probation. [13]\n\nCharles Ehrlich: Alleged accomplice of Simpson. Friend of Simpson's from South Florida. Pretended to be a buyer who would first check out the goods. Sentenced to probation. [13]\n\nMichael McClinton: Alleged accomplice of Simpson. Acquaintance of Alexander's and Stewart's. Brought a gun into the room. Also made an audio recording of events that was later used at trial. In the room, McClinton pulled out a .45-caliber Ruger and barked orders at the dealers, as Simpson reportedly told him to do. Afterward in the hallway McClinton secretly taped Simpson asking whether McClinton pulled out \"the piece.\" On the recording the participants are heard at a sushi restaurant laughing about the six-minute encounter. [13] Sentenced to probation. [13]\n\nSentenced to probation. Thomas Riccio: Auction owner and convicted felon [14] who informed Simpson about the stolen goods, and subsequently taped the whole event on a recorder. Riccio sold the tape for $150,000 to TMZ.com. [15] Riccio also testified that he was paid an additional $60,000 by television stations for appearances. Riccio was given total immunity for his testimony [16] by Clark County District Attorney David Roger after a negotiation with Riccio's attorney Stanley Lieber. [17]\n\nwho informed Simpson about the stolen goods, and subsequently taped the whole event on a recorder. Riccio sold the tape for $150,000 to TMZ.com. Riccio also testified that he was paid an additional $60,000 by television stations for appearances. Riccio was given total immunity for his testimony by Clark County District Attorney David Roger after a negotiation with Riccio's attorney Stanley Lieber. Bruce Fromong: Memorabilia dealer, later convicted of shoplifting. [18] [19]\n\nAlfred Beardsley: Memorabilia dealer, and convicted felon.[20]\n\nSimpson's attorneys [ edit ]\n\nYale Galanter was an attorney who had represented Simpson in Florida prior to this incident. According to Simpson, Galanter encouraged Simpson to retrieve his personal items. Galanter was with Simpson in Las Vegas prior to the robbery. The former star athlete said Galanter told him during a dinner discussion in Las Vegas, \"you have the right to get your stuff\", but cautioned he could not trespass on private property. Simpson said he told Galanter that if the suit he wore during his sensational 1990s murder trial was included among the memorabilia, he planned to burn it, and Galanter responded: \"You're not going to burn it, you're going to bring it to me.\"[21] In his testimony, Simpson stated that he gave the property stolen in Las Vegas to Galanter.[22] Simpson testified that he paid Galanter $125,000 to make a video montage for the appeal, but no video montage was ever made.[23] Simpson's attempt to secure a new trial centered around his claim that Galanter was incompetent and had a conflict of interest [24] but this argument was rejected by the trial court and the state Supreme Court.[25]\n\nGabriel L. Grasso, Galanter's former friend and co-counsel, said the lawyer complained during the case that he did not have money to hire investigators or an expert to analyze a critical audio recording from the night of the heist.[24]\n\nInvestigation and trial [ edit ]\n\nInvestigators initially named Simpson a suspect, but questioned him the next day and released him soon after. On September 15, one of the accomplices, Walter Alexander, was arrested and charged with two counts of robbery with a deadly weapon, one count of conspiracy to commit robbery with a deadly weapon, two counts of assault with a deadly weapon, and one count of burglary with a deadly weapon. Alexander was on his way to McCarran International Airport when he was approached by the police. Earlier in the day, two guns were recovered when the police executed a warrant at one of the men's homes.\n\nOn September 16, Simpson was arrested by Clark County, Nevada, authorities.[26] The celebrity gossip website TMZ.com published an audio recording of the incident which indicated Simpson and others shouted at the occupants of the room and demanded the return of various items.[27] On the audiotape, recorded by Thomas Riccio, Simpson is heard saying: \"Don't let nobody out of this room. ... Motherfucker, you think you can steal my shit and sell it?\"[28] An FBI expert witness claimed that the tapes had \"over-recordings\" and \"might\" have been altered.[15] Riccio reportedly said he tipped off Simpson to go to the hotel to look for his goods, and he reportedly said he deliberately planted the recording device to prove to Simpson that Beardsley and Fromong were fencing his stuff. Riccio considers Simpson a friend, and brought Simpson to the room and escorted him and the memorabilia out.[29]\n\nOn the day after the incident, in a 20-minute interview with the L.A. Times, Simpson brushed off the allegations saying, \"I'm O. J. Simpson. How am I going to think that I'm going to rob somebody and get away with it? Besides, I thought what happens in Las Vegas stays in Las Vegas... You've got to understand, this ain't somebody going to steal somebody's drugs or something like that. This is somebody going to get his private [belongings] back. That's it. That's not robbery.\" [30]\n\nIn an interview, Walter Alexander said he thought the whole incident was a setup to get Simpson. He does not \"understand what the big deal is\", or why Riccio would set this whole operation up, tape it and then sell the tape to the media.[31] Alexander's ex-wife gave an interview to the New York Times in which she said many people carry tape recorders with them around Simpson to try and catch him slipping so they can profit from it. During police questioning, Alexander said Simpson asked for guns to be carried to look tough but that the guns would not be used. He also added that McClinton impersonated a police officer and acted too rough to the surprise of the others, including Simpson. He claims Simpson repeatedly told McClinton to \"calm down, calm down.\"[32]\n\nSimpson appeared in court on September 19, 2007. Represented by attorneys from Florida and Nevada, Simpson was granted a bail of $125,000. Presiding Justice of the Peace Joe M. Bonaventure, Jr., stated that Simpson was not allowed to have any contact with any of the co-defendants, and must surrender his passport. Simpson did not enter a plea.[33][34] Both Clarence Stewart and O. J. Simpson were charged with:\n\nCount 1: Conspiracy to commit a crime\n\nCount 2: Conspiracy to commit kidnapping\n\nCount 3: Conspiracy to commit robbery\n\nCount 4: Burglary while in possession of a deadly weapon\n\nCount 5: 1st degree kidnapping with use of a deadly weapon (for Bruce Fromong)\n\nCount 6: 1st degree kidnapping with use of a deadly weapon (for Alfred Beardsley)\n\nCount 7: Robbery with use of a deadly weapon (for Bruce Fromong)\n\nCount 8: Robbery with use of a deadly weapon (for Alfred Beardsley)\n\nCount 9: Assault with a deadly weapon (for Bruce Fromong)\n\nCount 10: Assault with a deadly weapon (for Alfred Beardsley)\n\nCount 11: Coercion with a deadly weapon (for Bruce Fromong as an alternative to count 5)\n\nCount 12: Coercion with a deadly weapon (for Alfred Beardsley as an alternative to count 6)\n\nSimpson's order to not allow anybody to leave the room was the reason for the kidnapping charges.[35]\n\nThe trial began on September 8, 2008, in the court of Nevada District Court Judge Jackie Glass, before an all-white jury,[36] in stark contrast to Simpson's earlier murder trial.[37] On October 3, 2008, Simpson was found guilty of all charges. On October 10, 2008, Simpson's attorneys, Yale Galanter and Gabriel Grasso, PC, moved for new trial (trial de novo) on grounds of judicial errors (two jurors of the same race as Simpson were dismissed) and insufficient evidence. Clarence \"C. J.\" Stewart's attorney, E. Brent Bryson, also petitioned for new trial, alleging Stewart should have been tried separately, and cited perceived misconduct by the jury foreman. Galanter and Stewart later appealed to the Nevada Supreme Court after Judge Glass denied their motions, and the defendants were found guilty. In October 2010, the Nevada Supreme Court affirmed Simpson's convictions, while Stewart's appeal was accepted.[38] Stewart was released in January 2011 after entering an Alford plea and being sentenced to 9 months house arrest and 3 years probation.[citation needed] Galanter motioned for a rehearing of the Simpson appeal in November 2010, which was denied by the Nevada Supreme Court in February 2011.[citation needed]\n\nSimpson was sentenced on 5 December 2008. The judge ordered eight of the ten counts to run concurrently, with a maximum sentence of 33 years (until 2041) with parole possible after nine years in 2017 when Simpson became eligible at age 70. Simpson was incarcerated in the Lovelock Correctional Center until 1 October 2017, when he was released.[39][40]\n\nAudio tape [ edit ]\n\nAn audio tape recorded by Riccio, which was later sold to TMZ.com, was central to the trial and conviction. FBI audio examiner Kenneth Marr testified that he was not able to determine whether or not the files were altered. He said he found areas of over-recording on the device that he said \"might\" mean the audio files had been manipulated. Alfred Beardsley stated that he told District Attorney David Roger and another official that the audio had been doctored. \"There's a whole section (missing) … and I talked to you directly about that\".[15]\n\nMotion for retrial [ edit ]\n\nSimpson, represented by attorney Patricia Palm, filed a motion for retrial.[41] In May 2013, the motion was heard; the week-long hearing included testimony from witnesses and Simpson. Simpson was represented at the hearing by Palm, who was joined by attorneys Ozzie Fumo and Thomas Pitaro.[42] Simpson's main argument was ineffective assistance of counsel. Simpson alleged his counsel Yale Galanter did not tell him about alleged plea-bargain offers that would have resulted in substantially shorter sentences. Grasso testified that it was Galanter's decision not to have Simpson testify.[43]\n\nOn May 17, 2013, Yale Galanter testified. He stated that Simpson had confided to him that guns were brought to the hotel room, and admitted to Galanter that he messed up in doing that.[44] Galanter made this statement after he was reminded that Simpson had waived attorney-client privilege, enabling his former attorney to testify.[44] Galanter was photographed by the Associated Press laughing about Simpson's arguments on the witness stand.[44]\n\nGalanter confirmed that the night before the robbery he was dining at a restaurant with Simpson and a group of people. Galanter testified that Simpson casually mentioned his intent to retrieve \"his stuff,\" in what Simpson called a \"sting.\" Galanter testified that he asked Simpson, \"What are you doing?\" and advised against it, telling Simpson \"to call the police.\" Galanter testified: \"Mr. Simpson never told me he was going to go to the Palace (Station) hotel with a bunch of thugs, kidnap people and take property by force. To insinuate I, as a lawyer and officer of the court, would have blessed it is insane.\"[45] Galanter did accept that Simpson's conviction was Galanter's responsibility.\n\nIn regard to plea offers, Galanter testified his practice is to always communicate plea offers to the client. He denied that Simpson did not know about plea offers. Galanter testified that during the trial he informed Simpson that prosecutors were offering a plea with 2–5 years of prison time. Simpson instructed Galanter to go back to the DA with a counter-offer of one year, which the DA immediately refused; the trial proceeded with no further offers or counters.[45]\n\nTimeline [ edit ]\n\nSeptember 13, 2007 – Simpson and a group of men at a wedding party enter room number 1203 at the Palace Station hotel to retrieve sports memorabilia they claim were stolen. This is the same day that Simpson's book about his ex-wife's and Ron Goldman's murder is published.\n\nSeptember 14, 2007 – Simpson is questioned and released.\n\nSeptember 16, 2007 – Simpson is arrested and charged with six felony counts as well and is held in solitary confinement without bail.\n\nSeptember 17, 2007 – A hearing to determine bail is set for 7:45 am Wednesday before Clark County, Nevada Judge Ann Zimmerman. A third suspect, Clarence Stewart, is arrested and charged with six felony counts similar to Walter Alexander. [46]\n\nSeptember 18, 2007 – Several additional charges such as first-degree kidnapping and conspiracy kidnapping are filed against Simpson and the others. District Attorney filing. Bruce Fromong has a major heart attack and is in critical condition. [28] Thomas Riccio who set up and recorded the encounter is given immunity by the District Attorney and will be a witness for the prosecution. [47]\n\nThomas Riccio who set up and recorded the encounter is given immunity by the District Attorney and will be a witness for the prosecution. September 19, 2007 – Simpson is released on $125,000 bail. A hearing is set for October 22, 2007.\n\nOctober 15, 2007 – One of the accomplices Charles Cashmore agrees to plead guilty to a lesser offense and testify against Simpson. [48] Walter Alexander will testify against Simpson as well and is allowed to plead guilty to a reduced charge.\n\nWalter Alexander will testify against Simpson as well and is allowed to plead guilty to a reduced charge. October 17, 2007 – In his plea statement, Alexander says bringing guns to the room was Simpson's idea to look tough \"and act like we mean business\". [32]\n\nNovember 8, 2007 – Simpson attends a preliminary hearing to determine whether he should be tried for the charges. [49]\n\nNovember 14, 2007 – Justice of the Peace Joe M. Bonaventure Jr. announces that Simpson will stand trial for 12 charges, including kidnapping, armed robbery, and other felony charges. The trial is first set for April 7, 2008. [50]\n\nMay 23, 2008 – Court officers and attorneys announce on May 22, 2008, that long questionnaires with at least 115 queries will be given to a jury pool of 400 or more. Prosecutors and defense counsels disagree on at least three questions, and Clark County District Court Judge Jackie Glass schedule arguments on the June 20 hearing on pretrial motions. [51]\n\nSeptember 8, 2008 – Jury selection begins. [52]\n\nSeptember 10, 2008 – Blogger J.Son Dinant disrupts pre-trial hearings when he accidentally talks to potential jurors. [53] [54]\n\nSeptember 15, 2008 – Trial begins. [52]\n\nOctober 3, 2008 – The jury unanimously finds Simpson guilty on all 12 counts against him, including robbery and kidnapping charges. After the verdicts are read by courtroom clerk Sandra Jeter 11:00 pm local time (0600 GMT), Clark County District Court Judge Jackie Glass denies Simpson's bail petition and he is removed in handcuffs, facing life imprisonment. [55] [56] [57] [58]\n\nOctober 10, 2008 – Simpson files a motion for new trial. [59]\n\nNovember 7, 2008 – Simpson's motion for a new trial is denied. [60]\n\nDecember 5, 2008 – Simpson and Clarence Stewart were sentenced in Las Vegas, Nevada. Both will serve their sentences at the Lovelock Correctional Center in Lovelock, Nevada. [12] [61] Simpson was sentenced to a minimum of 9 years in prison (after which he would be eligible for parole) and a maximum of 33 years. [62] The state was seeking a minimum of 18 years in pre-sentencing report.\n\nSimpson was sentenced to a minimum of 9 years in prison (after which he would be eligible for parole) and a maximum of 33 years. The state was seeking a minimum of 18 years in pre-sentencing report. May 5, 2009 – Simpson appeals his conviction to the Nevada Supreme Court. [63]\n\nAugust 3, 2009 – A three-judge panel of the Nevada Supreme Court grants a rare \"after-the-fact\" bail hearing. [64]\n\nOctober 22, 2010 – The Nevada Supreme Court affirms Simpson's convictions. [38]\n\nMay 13, 2013 – Simpson testified in a Clark County District Court asking the Judge to grant him a new trial. Simpson's main theory was \"ineffective assistance of counsel,\" that trial and appeal counsel Yale Galanter mishandled his case. [65]\n\nJuly 31, 2013 – Simpson granted parole on the armed robbery convictions by the Nevada parole board; however, Simpson still must serve at least four more years unless he is granted a new trial on his latest appeal attempt. [66]\n\nJuly 20, 2017 - Simpson granted parole on the armed robbery convictions and is eligible for release as early as October 1, 2017. [5]\n\nOctober 1, 2017 – Simpson is released from prison, having served nine years.[67][68]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Seal_of_Nevada.svg/180px-Seal_of_Nevada.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Palace_Station%2C_Las_Vegas_NV.jpg/220px-Palace_Station%2C_Las_Vegas_NV.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Seal_of_Nevada.svg/1200px-Seal_of_Nevada.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Seal_of_Nevada.svg/1200px-Seal_of_Nevada.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/O._J._Simpson_robbery_case", "title": "O. J. Simpson robbery case", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Seal_of_Nevada.svg/1200px-Seal_of_Nevada.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}