{"url": "www.inquisitr.com/4906250/kim-kardashian-does-not-have-escape-plan-to-leave-kanye-west-debunked/", "text": "Kim Kardashian and Kanye West have seen their names mentioned in hundreds of rumors over the years and they aren’t slowing down. Amid the backlash that West is receiving for making controversial comments, reports are coming out that their marriage could be coming to an end soon. Most of those rumors also insinuate that Kardashian is planning to end the marriage.\n\nAccording to a recent report from Grazia, Kardashian is planning to leave West and even has an “escape plan” to leave him.\n\n“Things between her and Kanye are at a breaking point. The marriage has been under increasing pressure lately and she fears all the controversy Kanye is causing is reflecting negatively on her and her family. There’s concern this marriage is on borrowed time. Kim may come across as his long-suffering wife, but she has been ready to leave on a number of occasions and has had multiple exit strategies in place over the years.”\n\nGossip Cop has since debunked the rumor that Kardashian has “exit strategies” and an “escape plan” in place to get away from West. She has shown some frustration with his controversial comments, but the two seems to be doing just fine despite all of the rumors.\n\n“None of this adds up to a divorce. In fact, Kardashian’s rep has already gone on record to tell Gossip Cop it’s ‘false’ she’s intending end the marriage. That will be evident in a few days, when the couple marks their fourth wedding anniversary on May 24.”\n\nKardashian has come out and publicly joked that West is the cause of her first gray hair.\n\n“[Kanye] gave me my first gray hair this week, and I am blaming that on him.”\n\nThat is nothing to write home about as far as divorce rumors are concerned. She also went on to state that West is doing well and is out in Wyoming working on new music.\n\n“He’s doing really good. He’s in Wyoming recording, he has a couple of albums coming out, so he’s just focused on that.”\n\nWest even took to Twitter to post a picture of Kim with fire emoji’s as the only description. Obviously, he still finds his wife incredibly beautiful.\n\nRumors are going to continue swirling. Nothing is going to change on the fake report front when it comes to Kardashian and West, but this report can be ignored now that Gossip Cop has debunked it.", "images": ["https://secure.gravatar.com/avatar/4c4ef2327345d36a953414934ea55324?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/kim-kardshian-isnt-divorcing-kanye-west.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Evan Massey"], "canonical_link": "https://www.inquisitr.com/4906250/kim-kardashian-does-not-have-escape-plan-to-leave-kanye-west-debunked/", "title": "Kim Kardashian Does Not Have ‘Escape Plan’ To Leave Kanye West [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}