{"url": "https://www.allure.com/story/matt-damon-knew-harvey-weinstein-allegedly-harassed-gwyneth-paltrow", "text": "Many big Hollywood names have reacted to the news of Harvey Weinstein's alleged serial sexual misconduct with shock and horror, claiming they had no knowledge of the decades of harassment and assault, including rape, claimed by the producer's many accusers. But as it turns out, at least two A-listers have known about at least one case since the 1990s.\n\nOn Monday, Matt Damon said he knew that Weinstein had allegedly sexually harassed Gwyneth Paltrow, and that he'd learned of the alleged incident from Ben Affleck, whom Paltrow dated on and off from 1997 to 2000.\n\n\"I never talked to Gwyneth about it,\" he told ABC News. \"Ben told me, but I knew that they had come to whatever, you know, agreement or understanding that they had come to, she had handled it. She was, you know, the first lady of Miramax. And he treated her incredibly respectfully.\"\n\nPreviously, Damon had been accused of helping kill a 2004 New York Times story that would have exposed Weinstein's alleged sexual misconduct. Both New York Times editors and Damon have denied the accusation, which was made by reporter Sharon Waxman in a first-person piece on The Wrap.\n\nDamon admitted to the knowledge of Paltrow's story in an interview with ABC News's Michael Strahan, who was interviewing Damon and co-star George Clooney for their upcoming film, Suburbicon. When asked about the Weinstein scandal, both actors denied knowing about any longstanding history of \"sexual predation,\" although both acknowledged they'd known the ousted film producer was a \"womanizer.\"\n\n\"When people say like, 'Everybody knew,' Like, yeah, I knew he was an asshole,\" Damon said. \"He was proud of that. That's how he carried himself. I knew he was a womanizer. I wouldn't want to be married to the guy. But it's not my business really. But this level of criminal sexual predation is not something that I ever thought was going on. Absolutely not.\"\n\nClooney added that Weinstein would talk to him about women he'd had affairs with, although he didn't necessarily believe the producer because to do so \"would be to believe the worst of some actresses who were friends of mine.\" He said, \"And I didn't think they were going to have affairs with Harvey, quite honestly. And clearly, they didn't. But the idea that this predator, this assaulter, was out there silencing women like that is beyond infuriating.\"\n\nEarlier in the interview, Damon mentioned that Weinstein's reputation for strong-arming those in the industry was well-known. \"You had to spend about five minutes with him to know that he was a bully,\" he said. \"He was intimidating. Miramax was the place, really the place, that was making great stuff in the '90's. And it was like, 'Could you survive Harvey?'\"\n\nThe actors continued by pledging to end sexual misconduct on an interpersonal and systemic level. Damon said the \"most important thing\" would be to instill in his four daughters \"this sense of self-esteem\" so they could protect themselves.\n\nClooney, meanwhile, said it was everyone's responsibility to make incidents like Weinstein's alleged misconduct \"virtually impossible to take place.\" \"There has to be a comeuppance for all of this,\" he said. \"All of the people who are part of that chain. We have to make it safe for people to feel that they can talk about this. And in doing that, I think that'll scare away that kind of behavior.\"\n\nRead more about this story:\n\nNow, watch this:\n\nDon't forget to follow Allure on Instagram and Twitter.", "images": ["https://media.allure.com/photos/59ee27663c8dda559aea817a/16:9/w_1280,c_limit/GettyImages-631368526.jpg", "https://www.allure.com/verso/static/allure/assets/logo-header.95d6522119a7e0c0674f96017a219339528c048d.svg", "https://media.allure.com/photos/59ee275e3c8dda559aea8178/16:9/w_2560%2Cc_limit/GettyImages-613295138.jpg", "https://www.allure.com/verso/static/allure/assets/logo-reverse.7c3ec9af78d5f39e36d039cb1f9fef504150550e.svg"], "top_img": "https://media.allure.com/photos/59ee27663c8dda559aea817a/16:9/w_1280,c_limit/GettyImages-631368526.jpg", "keywords": [], "authors": ["Evelyn Wang", "Evelyn Wan"], "canonical_link": "https://www.allure.com/story/matt-damon-knew-harvey-weinstein-allegedly-harassed-gwyneth-paltrow", "title": "Matt Damon Admits He Knew Harvey Weinstein Allegedly Harassed Gwyneth Paltrow", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Evelyn Wang", "copyright": "Copyright (c) Condé Nast 2020", "description": "Matt Damon and George Clooney both knew Harvey Weinstein was a womanizer but not a predator, while Damon admits he knew about Gwyneth Paltrow's harassment.", "id": "59ee06b3a630e345ec99bf71", "keywords": "wellness,snd,matt damon,george clooney,harvey weinstein,sexual harassment,ben affleck", "news_keywords": "wellness,snd,matt damon,george clooney,harvey weinstein,sexual harassment,ben affleck", "robots": "index, follow", "content-type": "article", "parsely-post-id": "59ee06b3a630e345ec99bf71", "parsely-metadata": "{\"description\":\"Matt Damon and George Clooney both knew Harvey Weinstein was a womanizer but not a predator, while Damon admits he knew about Gwyneth Paltrow's harassment.\",\"image-16-9\":\"https://media.allure.com/photos/59ee27663c8dda559aea817a/16:9/w_1000,c_limit/GettyImages-631368526.jpg\",\"image-1-1\":\"https://media.allure.com/photos/59ee27663c8dda559aea817a/1:1/w_1000,c_limit/GettyImages-631368526.jpg\"}", "og": {"description": "And he learned about it from Ben Affleck.", "image": "https://media.allure.com/photos/59ee27663c8dda559aea817a/16:9/w_1280,c_limit/GettyImages-631368526.jpg", "site_name": "Allure", "title": "Matt Damon Admits He Knew Harvey Weinstein Allegedly Harassed Gwyneth Paltrow", "type": "article", "url": "https://www.allure.com/story/matt-damon-knew-harvey-weinstein-allegedly-harassed-gwyneth-paltrow"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@Allure_magazine", "description": "And he learned about it from Ben Affleck.", "domain": "https://www.allure.com", "image": {"src": "https://media.allure.com/photos/59ee27663c8dda559aea817a/16:9/w_1280,c_limit/GettyImages-631368526.jpg?mbid=social_retweet"}, "site": "@Allure_magazine", "title": "Matt Damon Admits He Knew Harvey Weinstein Allegedly Harassed Gwyneth Paltrow"}, "fb": {"app_id": 100614276777478, "pages": 24810773606}}, "movies": [], "publish_date": null, "source": "https://www.allure.com", "summary": ""}