{"url": "https://www.out.com/love-issue/2016/12/29/love-portfolio-samira-wiley-lauren-morelli", "text": "Photography by Roger Erickson. Styling by Michael Cook. Groomer: Mahfud Ibrahim for Exclusive Artists. Makeup for Wiley: Tim Mackay. Hair: Mahfud Ibrahim for Exclusive Artists. Prop Styling: Christopher Stone. Wiley: Shirt and pants by Lanvin. Morelli: Sweater by Lanvin. Pants by Bally.\n\nSamira Wiley, Actress: We met in December 2012. We were both working on Orange Is the New Black, our first big jobs in the industry. The cast would get every script to read, and with every new script came a new writer whom they’d fly out from Los Angeles to meet us. Lauren wrote episode six of the first season, one of the first scripts really featuring my character, Poussey. We spent four days in a row working together. Honestly, I thought she was gay the first time I met her.\n\nLauren Morelli, Writer-Producer: I’d already seen Samira’s audition tape and immediately had a crush on her — the complication being that I was married to a man at the time. I came to New York to shoot my first episode. I was on set, sitting in front of the monitors, and she and Lea DeLaria, who plays Big Boo, walked up to me. Our set is like a lesbian utopia, and I remember thinking, They’re flirting with me. For that episode I had to write these raps for Samira and Danielle Brooks, who plays Taystee, and I was so nervous because I was this little white girl.\n\nRelated | The Love Portfolio: Gus Kenworthy + Matt Wilkas and Samira Wiley + Lauren Morelli\n\nWiley: Lauren is an amazing rapper, but I kept coming up with questions to find a way to talk to her — bullshit like “I don’t know if I’d rhyme this word with this word.” I was trying to impress her, but I can’t rap. [Laughs] Then we were sitting in the prison cafeteria for a scene, eating some stale noodles, and like a kindergartner, I came and put a noodle on her ear — anything to see her smile.\n\nMorelli: I had started questioning my sexuality as a result of being in the writers’ room and talking about all the themes on the show. I was still very confused, but I knew the attraction between us felt magnetic. We spent a couple of weeks together before Christmas on that first episode, and then I came back to New York in February. On set it’s a bunch of women, so everyone’s hugging and touching. It’s a very affectionate place. I’d fallen into this alternate universe, but I thought I’d go home and it’d disappear. But Samira was still so present for me.\n\nWiley: I found out she was married — I assumed to a woman. It was a little dagger in my heart. I remember this whirlwind of me falling in love in those four days. I was also bartending, and I told my coworkers. They said I was crazy. She went back to L.A., and I thought I’d forget about her, but that Christmas I found myself talking to my mother about it. I never talk to her about anything like this, but I was completely open about how lost I felt. That was the real indicator for me: me talking to my mother about Lauren. Because Lauren was finding out who she was, I became a confidant to her. We’d talk on the phone, me sharing my own coming-out story and her talking about things she was discovering. My parents are pastors, and I have a real sense of the “right way” of doing things, so I was really cognizant of the fact that she was in a relationship. I loved her as a friend first, but after a while it was clear it was more than that.\n\nMorelli: I was very open with my husband and told him. That turned into a year of going to couples therapy. It felt like my whole world was falling apart. I had a few queer women around me, but not many I could talk to about such a huge, vulnerable thing. Samira became my outlet, and through that process I fell in love with her. But I thought, This will be the one that got away. Being with her felt too good to be true.\n\nWiley: I was scared to be the first to say “I love you,” so I did a little pussy version. I said, “I heart you,” which actually ended up in one of Lauren’s Orange scripts. I believe Alex says it to Piper. It felt safer than using the L word. It’s hard to step out on that limb. I thought I’d just be one of those people totally in love with her friend.\n\nMorelli: I’d finally separated from my husband and gotten my own place, and Samira and I had officially started dating. I remember walking down the street in New York and finally being able to hold her hand, and how huge that felt. Walking to the date was more romantic and mattered more than wherever we were going or whatever we were about to do. I’m very aware of being visible and how important that is. Even being in a liberal, safe place like New York, holding her hand while walking down the street still feels like a political choice. It had been such a journey to discover my sexuality, and to claim it in this public way was incredible for me.\n\nWiley: Maybe a year after we were officially together, we went on our first trip. We are so opposite in how we operate, so we’d bicker. We showed our true selves — maybe the ugliest, nastiest parts. We were out of our comfort zones. We were in Thailand riding elephants. We always say it’s amazing we survived that trip, but however horrible it was, it helped me know I want to be with her — because she could see all these parts of me and still want to be with me, and I could see all these parts of her and still want to be with her. I would rather have the worst day with Lauren than the best day with someone else.\n\nMorelli: The trip was a total disaster. It just exposed everything. I’m so neurotic, and Samira could not be more laid-back. But now it’s such a joy to laugh about me having a panic attack in the middle of the train station in Bangkok and Samira having to calm me down. And I have all these amazing pictures of her on top of an elephant looking petrified. She rode those elephants for me ’cause if I was doing anything in Thailand, I was riding an elephant.\n\nWiley: Right before Thailand, I flew to L.A. to see Lauren after she’d moved into her own apartment. It was the first time we could really be together. She got me a ring, which I now wear around my neck, and a card that said, “Will you be my girlfriend?” To sit in a house that was hers and have her give me that ring and card… I’m crying right now thinking about it. It felt like something that would never come.\n\nMorelli: Being able to write words for someone as talented as she is, watch her perform what I write, and then go to bed with her is the best thing. Last year, police brutality against black people in our country was something we were talking about a lot. It felt really important for the show to address it. Also, we hadn’t had this heartbreaking tragedy yet, and when Jenji [Kohan, Orange creator] came into the fourth season, that was her mandate. I was obviously honored to write the episode in which Poussey is killed. When I sat down to write that scene and typed the part when she dies, I just started sobbing. I called Samira sobbing so hard that I couldn’t get the words out. I’d never had the experience of not only killing a character, but killing a character played by my girlfriend.\n\nWiley: We’d planned this weekend in Palm Springs. I’m pretty laid-back: If it’s five in the afternoon and Lauren wants to beat the traffic, I’m just hanging around. That day, I wanted to be good and get my packing done. She got home and was just not ready to go, and I was confused. She asked me to sit next to her. Then she got me up, and we started dancing together, and she pulled a ring from behind the couch. Lauren has been married before, so I wanted her to tell me she was ready, her to be the one to propose. I didn’t know she was as ready as she was. I was completely shocked. I was crying uncontrollably and kept backing away from her. I asked her after, “Who knows about this?” and she said, “Oh, everyone. Your parents know.” We didn’t tell anyone else for a few days. That was really important to us — to have some time where it was just ours.\n\nMorelli: One of the good things about her no longer being on Orange was that she didn’t have to permanently be in New York anymore, so she moved to L.A. to be with me. We were coming up on our three-year anniversary, and I was like, I will wait until we have our three years and then propose. Then I thought, What am I waiting for if I know I want this woman to be my wife and I want to spend my life with her?\n\nI knew we were gonna be apart for a while — I was in New York shooting for Orange, and she was in Toronto for her new job on The Handmaid’s Tale — so we’d planned this trip to Palm Springs as a light at the end of the tunnel. I realized I could propose right before and then we’d have the weekend there to celebrate. I found a ring, and they shipped it to me, and it was as if someone had handed me a ball of fire and said, “Here, tend to this.” I was so nervous and terrified she knew it was coming, but she was so shocked that I couldn’t get her to stop crying. She was hyperventilating. I thought, Oh, this is not good. This has gone too far. She was very clear she’d wait for me to be ready, so to give her something I knew she wanted so much was incredible. It was the most magical day of my life.\n\nWiley: There’s this Sara Bareilles song we love called “I Choose You.” For so long in our relationship, I wasn’t “the one.” I was just waiting and being supportive of Lauren’s journey. To see her embrace her sexual orientation the way she has is like that song: “I choose this life as a gay woman, and we choose to spend this life together.” I think — I know — I would not be where I am without Lauren. When I was first being thrust into the public eye, I wouldn’t talk about my orientation. Being with Lauren taught me self-love.\n\nMorelli: She’d always tell me jokingly that she was just trying to get “chose.” She’d do the dishes, and I’d go, “Oh, thank you, that means a lot to me.” And she’d go, “Just tryna get chose, bae. Just tryna get chose.” So when I proposed, I made that the theme of the proposal: “I choose you.”\n\nLike what you see here? Subscribe and be the first to receive the latest issue of Out. Subscribe to print here and receive a complimentary digital subscription.", "images": ["https://www.out.com/sites/out.com/themes/out/images/search.gif", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/mike-galleryx750.jpg?itok=tEUwqjKw&timestamp=1586999227", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/pjimage_25_3.jpg?itok=Fuui9-O6&timestamp=1587227445", "https://www.facebook.com/tr?id=259124211325942&ev=PageView&noscript=1", "https://www.out.com/sites/out.com/files/2016/12/20/02-samira-wiley_lauren-morelli-750x563.jpg", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/pjimage_22_5.jpg?itok=1G_s9SMP&timestamp=1587091639", "https://www.out.com/sites/out.com/files/out_subbanner_750x211_3.jpg", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/henry-bethell-lead.jpg?itok=RKC5gm2T&timestamp=1587135922", "https://www.out.com/sites/out.com/themes/out/logo.png", "https://www.out.com/sites/all/modules/custom/heremedia_fb/images/twitter-share-button.jpg", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/lead_1.jpg?itok=wHpjfsLX&timestamp=1587150846", "https://www.out.com/sites/all/modules/custom/heremedia_fb/images/facebook-share-button.jpg", "https://www.out.com/sites/out.com/themes/out/images/mail-button.gif", "https://www.facebook.com/tr?id=1586530151593576&ev=PageView&noscript=1", "https://www.out.com/sites/out.com/themes/out/images/intgm-button.gif", "https://www.out.com/sites/out.com/themes/out/images/tumblr-Out.png", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/trip_1.jpg?itok=EqhzJngj&timestamp=1587233126", "https://www.out.com/sites/out.com/files/styles/image_style_360x203_1x/public/pjimage_23_6.jpg?itok=5PVPJn_Q&timestamp=1587151304", "https://www.out.com/sites/out.com/themes/out/images/Out-Logo300x107.svg", "https://www.out.com/sites/out.com/themes/out/images/tw-button.gif", "https://www.out.com/sites/out.com/themes/out/images/fb-button.gif", "https://www.out.com/sites/out.com/files/out290_april-may_mike_ruiz_cover_sm.jpg"], "top_img": "https://www.out.com/sites/out.com/files/2016/12/20/02-samira-wiley_lauren-morelli-750x563.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.out.com/love-issue/2016/12/29/love-portfolio-samira-wiley-lauren-morelli", "title": "The Love Portfolio: Samira Wiley + Lauren Morelli", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Out", "fb": {"app_id": 705953026218815, "page_id": 19799718480, "pages": 19799718480}, "description": "A rap session during the filming of Orange is the New Black set the scene for a true-life tale of love, loss, and new beginnings.", "og": {"type": "article", "url": "http://www.out.com/love-issue/2016/12/29/love-portfolio-samira-wiley-lauren-morelli", "title": "The Love Portfolio: Samira Wiley + Lauren Morelli", "updated_time": "2016-12-29T11:50:57-05:00", "image": "https://www.out.com/sites/out.com/files/2016/12/20/02-samira-wiley_lauren-morelli-750x563.jpg"}, "twitter": {"card": "summary_large_image", "site": {"identifier": "TheAdvocateMag", "id": 21692297}, "creator": {"identifier": "outmagazine", "id": 21692297}, "title": "The Love Portfolio: Samira Wiley + Lauren Morelli", "description": "A rap session during the filming of Orange is the New Black set the scene for a true-life tale of love, loss, and new beginnings."}, "article": {"published_time": "2016-12-29T11:03:52-05:00", "modified_time": "2016-12-29T11:50:57-05:00"}}, "movies": [], "publish_date": 1482940800.0, "source": "https://www.out.com", "summary": ""}