{"url": "https://web.archive.org/web/20090612062614/http://www.ustreas.gov:80/press/releases/tg162.htm", "text": "June 9, 2009\n\nTG-162 Treasury Announces $68 Billion in Expected CPP Repayments WASHINGTON – The U.S. Department of the Treasury announced today that 10 of the largest U.S. financial institutions participating in the Capital Purchase Program (CPP) have met the requirements for repayment established by the primary federal banking supervisors. Following consultation with the primary banking supervisor of each institution, Treasury has notified the institutions that they are now eligible to complete the repayment process. If these firms choose to do so, Treasury will receive $68 billion in repayment proceeds. Combined with repayments received to date from other institutions, Treasury will have received approximately $70 billion in repayments from CPP participants. More than 600 banks across the country have participated in the CPP, representing $199 billion in investments. \"These repayments are an encouraging sign of financial repair, but we still have work to do,\" said Secretary Tim Geithner. These repayments follow a period in which many banks have successfully raised equity capital from private investors. Also, for the first time in many months, these banks have issued long-term debt that is not guaranteed by the government. Under the CPP investment agreements, firms that repay their preferred stock have the right to repurchase the warrants Treasury holds in their firms at fair market value. In addition to Treasury's potential income from sale of the warrants, these 10 institutions have already paid dividends on the preferred stock totaling approximately $1.8 billion over the last seven months. Dividend payments received for all CPP participants are approximately $4.5 billion to date. Under the Emergency Economic Stabilization Act, proceeds from repayment will be applied to Treasury's general account. These repayments help to reduce Treasury's borrowing and national debt. The repayments also increase Treasury's cushion to respond to any future financial instability that might otherwise jeopardize economic recovery.\n\n###\n\n\n\n", "images": ["https://web.archive.org/web/20090612062614im_/http://www.ustreas.gov/press/images/banner_pr-535pix.gif", "https://web.archive.org/web/20090612062614im_/http://www.ustreas.gov/images/layout/spacer.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "TG-162: Treasury Announces $68 Billion in Expected CPP Repayments", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}