{"url": "https://www.bustle.com/articles/198228-gilmore-girls-star-matt-czuchry-knows-the-answer-to-the-revivals-biggest-mystery", "text": "The much-talked about ending of the Gilmore Girls revival left many perplexed, some vexed, and pretty much everyone wanting the mystery to be solved ASAP. Now that we know that the show's final words were (major spoiler alert) Rory saying \"I'm pregnant,\" the question of who Rory's baby's father is has left many fans freaking out, especially considering that the words have always been described as final, meaning the mystery might remain unsolved forever. To make matters even worse? One of Gilmore Girls' lead actors, Matt Czuchry, knows the answer — but he's not going to tell you it anytime soon.\n\nIn an interview with The Huffington Post published on Friday, Czuchry (who plays Logan Huntzberger) revealed that he and the show's creators, Amy Sherman-Palladino and Daniel Palladino, know who the father of Rory's child is. \"[Amy and Dan] did tell me who is the father of that baby,” Czuchry revealed. “If they ever want to reveal that, they can do that, but I think at this particular point, I think the purpose is ... to fast forward and say, what kind of mother would Rory be, what kind of grandmother would Lorelai be [and] in terms of whoever the father is would they be in that person’s life. Would it be different from Christopher or would it mirror that completely? Those stories aren’t told yet. I think the fun is for everybody to come up with those theories and play that out in their minds.”\n\nBUILD Series on YouTube\n\nCome on. That's too tantalizing, but alas, Czuchry is smart not to tell us the truth. Still, Palladino and Sherman-Palladino have addressed the final four words and the ambiguousness of the ending themselves before, and whether Rory will become a parent at all is less definite than Czuchry makes it sound. Sherman-Palladino has mentioned that Rory would consider an abortion, and in an interview with Entertainment Weekly, Palladino revealed that neither creator had a clear idea of Rory's future. \"There’s all sorts of options for her out there and actually,\" he said. \"Amy and I have not thought at all what would possibly happen to Rory beyond that moment.\"\n\nAnd if more Gilmore Girls episodes come one day, perhaps the mystery of the baby's pregnancy, and Rory's future, will be solved. Sherman-Palladino seems vaguely open to the possibility of more episodes, telling The Hollywood Reporter. “We really had a very specific journey in our minds and we fulfilled the journey... So to us, this is the piece that we wanted to do. And the whole thought about, ‘Is there more, is there more, is there more?’ — this has to go out into the universe now. We’ve got to put this to bed. And then whatever happens, happens.” So the baby's parentage could be revealed in a new Netflix season, in a future interview, or, quite possibly, not at all. Whatever happens, fans will be waiting eagerly to find out.\n\nImage: Netflix", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/12/4/b061043e-184b-4078-b601-20545cce870b.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/12/4/b061043e-184b-4078-b601-20545cce870b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/12/4/b061043e-184b-4078-b601-20545cce870b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/198228-gilmore-girls-star-matt-czuchry-knows-the-answer-to-the-revivals-biggest-mystery", "title": "'Gilmore Girls' Star Matt Czuchry Knows The Answer To The Revival's Biggest Mystery", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/198228-gilmore-girls-star-matt-czuchry-knows-the-answer-to-the-revivals-biggest-mystery", "type": "article", "title": "Logan Himself Knows The Big 'Gilmore Girls' Secret", "description": "The much-talked about ending of the Gilmore Girls revival left many perplexed, some vexed, and pretty much everyone wanting the mystery to be solved ASAP. Now that we know that the show's final words were (major spoiler alert) Rory saying \"I'm…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/12/4/b061043e-184b-4078-b601-20545cce870b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The much-talked about ending of the Gilmore Girls revival left many perplexed, some vexed, and pretty much everyone wanting the mystery to be solved ASAP. Now that we know that the show's final words were (major spoiler alert) Rory saying \"I'm…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}