{"url": "www.mercurynews.com/2018/08/29/angelina-jolie-takes-break-from-nasty-brad-pitt-divorce-fight-to-plead-for-syrian-refugees/", "text": "Angelina Jolie has not been enjoying very pleasant headlines lately — not since her divorce and custody battle with Brad Pitt took a dark turn earlier this month.\n\nIn the headlines, Jolie has stopped being the serene mother of six, glamorous movie star or compassionate United Nations High Commissioners for Refugees special envoy.\n\nMore and more, the 43-year-old Jolie has been accused of being the “crazy and manipulative” estranged wife who has become increasingly “unpopular in Hollywood.” She’s “out for blood” in the divorce fight, or she “wants to embarrass and punish” the seemingly affable Pitt by portraying him in court papers as a deadbeat dad, or by apparently trying to undercut his relationship with their children, as suggested by a family law judge.\n\nAlso damning: Page Six reported last week that Jolie had developed “an insane jealousy” jealous of Amal Clooney, the international human rights attorney and wife of George Clooney. Jolie believes “Amal has stolen her identity” as the world’s most glamorous, admired humanitarian, a source told Page Six.\n\nBut breaking through all these negative headlines Tuesday was a reminder from Jolie herself of her world-class humanitarian credentials. She published an opinion piece on behalf of the UN agency’s efforts to boost educational opportunities for refugee children.\n\nThe timing of the piece, published on CNN.com, could be coincidental, given headlines this week about how Jolie had hired a new, more aggressive legal team to help finalize her divorce.\n\nBut as Jolie noted, she wrote her piece to advance important news: The UNHRC is about to publish a report in which the UN agency warns about the rising numbers of refugee children who are not receiving an education.\n\nIn any case, Jolie brought her cinematic story-telling experience to share moving accounts of what education means to children — girls especially — whose lives and communities have been upended by the ongoing Syrian civil war.\n\nJolie said she had met these girls herself during her goodwill trips to refugee camps in the war-torn region. She described one girl who had given up her dream of going to school and becoming a doctor after her mother was killed in an airstrike and she was forced to take care of her five younger siblings, Jolie said. With no other choice, the girl married at 14, can’t read or write and has been “robbed of her childhood and the future she might have had.”\n\nThe other girl was able to go to a local high school while living in a barren Iraqi refugee camp, and is now studying dentistry at a local Iraqi university — while still living with her parents in the camp, Jolie said.\n\n“There are millions of young refugees with the energy and desire and commitment to study and work, who want to contribute to the societies that host them and ultimately help rebuild their home countries,” Jolie wrote. “There are millions of displaced parents who will make every sacrifice imaginable to help their children go to school.”\n\nJolie then argues how wealthier countries can help less fortunate countries rebuild after war: “Not with peace agreements and resolutions, as necessary as those are, but with millions of school report cards, exams passed, qualifications obtained, jobs acquired, and young lives turned to good purpose rather than spent languishing in camps.”\n\nJolie said she understands how overwhelming these refugee crises can seem to the outside world.\n\n“Hardly a day goes past without bleak news headlines about violence, suffering and the displacement of people, from Afghanistan to Yemen,” Jolie wrote. “It is difficult to find a single example of where we are succeeding as an international community in ending conflicts and securing peace.”\n\nBut Jolie said there is an answer in helping refugees in a “patient, long-term manner, guided by our values.” She concluded her piece by writing: “If we help refugees get an education, they themselves will take on the harder task of rebuilding the countries whose future peace and security is so important to our own. It is the wise as well as morally right course of action.”", "images": ["https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee6.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee2.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee3.jpg?w=1024&h=668"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee3.jpg?w=1024&h=668", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/08/29/angelina-jolie-takes-break-from-nasty-brad-pitt-divorce-fight-to-plead-for-syrian-refugees/", "title": "Angelina Jolie takes break from nasty Brad Pitt divorce fight to plead for Syrian refugees", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "As Angelina Jolie's divorce fight with Brad Pitt gets nasty, she stopped to remind the world of her concern for helping Syrian refugee children go to school.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Angelina Jolie takes break from nasty Brad Pitt divorce fight to plead for Syrian refugees", "url": "https://www.mercurynews.com/2018/08/29/angelina-jolie-takes-break-from-nasty-brad-pitt-divorce-fight-to-plead-for-syrian-refugees/", "description": "As Angelina Jolie’s divorce fight with Brad Pitt gets increasingly nasty nasty, she paused to remind the world of a humanitarian cause she cares about.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee3.jpg?w=1024&h=668", "width": 1024, "height": 668}, "locale": "en_US"}, "article": {"published_time": "2018-08-29T14:07:15+00:00", "modified_time": "2018-08-29T14:46:19+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Angelina Jolie takes break from nasty Brad Pitt divorce fight to plead for Syrian refugees"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/08/JolieRefugee3.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1535472000.0, "source": "http://www.mercurynews.com", "summary": ""}