{"url": "https://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "text": "Mr. Weinstein was fired Sunday night from his production company, the Weinstein Company, which issued a statement saying the decision was made “in light of new information about misconduct by Harvey Weinstein that has emerged in the past few days.” In its report, The Times found that Mr. Weinstein had reached at least eight settlements with women who had claimed sexual harassment.\n\nIn her statement, Ms. Streep also said Mr. Weinstein had been “respectful” during their working relationship, and challenged the widely repeated narrative that his misbehavior had been a longtime open secret in Hollywood.\n\nHere is Ms. Streep’s full statement:\n\nThe disgraceful news about Harvey Weinstein has appalled those of us whose work he championed, and those whose good and worthy causes he supported. The intrepid women who raised their voices to expose this abuse are our heroes. One thing can be clarified. Not everybody knew. Harvey supported the work fiercely, was exasperating but respectful with me in our working relationship, and with many others with whom he worked professionally. I didn’t know about these other offenses: I did not know about his financial settlements with actresses and colleagues; I did not know about his having meetings in his hotel room, his bathroom, or other inappropriate, coercive acts. And if everybody knew, I don’t believe that all the investigative reporters in the entertainment and the hard news media would have neglected for decades to write about it. The behavior is inexcusable, but the abuse of power familiar. Each brave voice that is raised, heard and credited by our watchdog media will ultimately change the game.\n\nGlenn Close: ‘I’m Angry’\n\nIn a statement to The Times, Ms. Close said that she felt “angry and darkly sad,” and that while Mr. Weinstein had been decent with her, she had heard rumors of inappropriate behavior toward women over many years.\n\nHer full statement:\n\nI’m sitting here, deeply upset, acknowledging to myself that, yes, for many years, I have been aware of the vague rumors that Harvey Weinstein had a pattern of behaving inappropriately around women. Harvey has always been decent to me, but now that the rumors are being substantiated, I feel angry and darkly sad. I’m angry, not just at him and the conspiracy of silence around his actions, but also that the “casting couch” phenomenon, so to speak, is still a reality in our business and in the world: the horrible pressure, the awful expectation put on a woman when a powerful, egotistical, entitled bully expects sexual favors in exchange for a job. Ours is an industry in which very few actors are indispensable and women are cast in far fewer roles than men, so the stakes are higher for women and make them more vulnerable to the manipulations of a predator. I applaud the monumental courage of the women who have spoken up. I hope that their stories and the reportage that gave them their voices represents a tipping point, that more stories will be told and that change will follow. The changes must be both institutional and personal. Men and women, in positions of power, must create a work environment in which people, whose jobs depend on them, feel safe to report threatening and inappropriate behavior, like that reported in the Times. No one should be coerced into trading personal dignity for professional success. I feel the time is long and tragically overdue for all of us in the industry, women and men, to unite — calmly and dispassionately — and create a new culture of respect, equality and empowerment, where bullies and their enablers are no longer allowed to prosper.\n\nKate Winslet: ‘Disgraceful and Appalling’\n\nIn a statement to Variety, Ms. Winslet said that Mr. Weinstein’s “behaviour is without question disgraceful and appalling and very, very wrong. I had hoped that these kind of stories were just made up rumours, maybe we have all been naïve. And it makes me so angry. There must be ‘no tolerance’ of this degrading, vile treatment of women in any workplace anywhere in the world.”\n\nMs. Winslet won a best actress Oscar in 2008 for her role in “The Reader,” which was released by the Weinstein Company.", "images": ["https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-articleInline.jpg?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-facebookJumbo.jpg"], "top_img": "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-facebookJumbo.jpg", "keywords": [], "authors": ["Cara Buckley"], "canonical_link": "https://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "title": "Meryl Streep, Kate Winslet and Glenn Close Speak Out on Harvey Weinstein", "meta_data": {"article": {"published": "2017-10-09T14:37:48.000Z", "modified": "2017-10-12T16:25:19.000Z", "section": "Movies", "author": "http://www.nytimes.com/by/cara-buckley", "tag": "Weinstein, Harvey", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 100000005486279, "nyt_uri": "nyt://article/60e2b28c-ed40-51b8-9cf6-209166d5d4d6", "pubp_event_id": "pubp://event/0e745dc9085a4f9e8f02934393147587", "description": "Ms. Streep called the news about Mr. Weinstein “disgraceful” but added, “Not everybody knew.” Her statement seemed to open the floodgates.", "image": "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-facebookJumbo.jpg", "byl": "By Cara Buckley", "thumbnail": "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-thumbStandard.jpg", "news_keywords": "Movies,Sexual harassment,Weinstein,Meryl Streep,Harvey Weinstein", "pdate": 20171009, "og": {"url": "https://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "type": "article", "title": "Meryl Streep, Kate Winslet and Glenn Close Speak Out on Harvey Weinstein", "image": {"identifier": "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-facebookJumbo.jpg", "alt": "Meryl Streep at the Golden Globes in January. In her statement, she said Mr. Weinstein had been “respectful” during their working relationship."}, "description": "Ms. Streep called the news about Mr. Weinstein “disgraceful” but added, “Not everybody knew.” Her statement seemed to open the floodgates."}, "twitter": {"url": "https://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "title": "Meryl Streep, Kate Winslet and Glenn Close Speak Out on Harvey Weinstein", "description": "Ms. Streep called the news about Mr. Weinstein “disgraceful” but added, “Not everybody knew.” Her statement seemed to open the floodgates.", "image": {"identifier": "https://static01.nyt.com/images/2017/10/10/arts/10meryl1/10meryl1-videoSixteenByNineJumbo1600.jpg", "alt": "Meryl Streep at the Golden Globes in January. In her statement, she said Mr. Weinstein had been “respectful” during their working relationship."}, "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/60e2b28c-ed40-51b8-9cf6-209166d5d4d6"}}, "site": "@nytimes"}, "CG": "movies", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/60e2b28c-ed40-51b8-9cf6-209166d5d4d6", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2017/10/09/movies/dench-close-streep-weinstein.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1507478400.0, "source": "https://www.nytimes.com", "summary": ""}