{"url": "www.rollingstone.com/music/music-news/ed-sheeran-weighs-in-on-taylor-swift-katy-perry-feud-193568/", "text": "Despite all the she-said, she-said in the Taylor Swift/Katy Perry feud, Ed Sheeran said in a recent interview that he thinks the back-and-forth is overblown.\n\n“I don’t think she needs [to be defended] at all,” he told People magazine at the 2017 Songwriters Hall of Fame 48th Annual Induction and Awards Gala. “I don’t think feud songs are a hot thing – there’s always been beef songs.” Sheeran specifically cited Carly Simon’s “You’re So Vain” as an example of a classic “diss track”; Simon revealed in 2015 that she penned the 1972 hit with Warren Beatty in mind.\n\nEarlier this year, Perry incurred the wrath of many Swift fans after the release of her hit “Swish Swish,” which many interpreted as a direct attack on the “Wildest Dreams” singer.\n\n“Don’t you come for me / No, not today / You’re calculated / I got your number / ‘Cause you’re a joker / And I’m a courtside killer queen,” one verse partly reads.\n\n(As though confirming that the song was indeed about Swift, Perry changed the lyrics to hold a more conciliatory tone during a live-streamed concert: “God bless you on your journey, baby girl.” Days earlier, Perry had delivered that same line when chatting with Arianna Huffington about Swift.)\n\n“I am ready to let it go,” she said at the time. “I forgive her and I’m sorry for anything I ever did, and I hope the same from here. I think it’s actually like, I think it’s time. There are bigger fish to fry, and there are real problems in the world. You know what I’m saying? … There’s a lot of other things out there in the world that people need to be focused on, and I truly, like God bless her on her journey. God bless her. Honestly.”\n\nEarlier this month, Swift seemed to make a not-so-subtle point when she announced the release of her entire back catalog on all streaming services – just as Perry dropped her fourth studio album, Witness.\n\nPerry and Swift’s fallout dates back to 2014, when Swift suggested in a Rolling Stone interview that Perry had once stolen backup dancers out from under her, effectively throwing a wrench in their friendship.\n\nSwift’s hit from that same year, “Bad Blood,” is widely assumed to be about Perry.\n\nAs for Swift and Sheeran, their platonic friendship is rock-solid. “We’ve gotten matching Scottish folds, made each other arts and crafts Christmas presents, vacationed with our families, and had each other’s backs,” Swift told Rolling Stone earlier this year. “He is the James Taylor to my Carole King and I can’t imagine a time when he wouldn’t be.”", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fed-sheeran-weighs-in-on-taylor-swift-katy-perry-feud-193568%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=193568", "https://www.rollingstone.com/wp-content/uploads/2018/06/ed-sheeran-weighs-in-katy-perry-taylor-swift-beef-4df11872-3670-46bd-86d4-3cebf6bc9c11.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/ed-sheeran-weighs-in-katy-perry-taylor-swift-beef-4df11872-3670-46bd-86d4-3cebf6bc9c11.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/ed-sheeran-weighs-in-on-taylor-swift-katy-perry-feud-193568/", "title": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Ed Sheeran says prolific BFF Taylor Swift doesn't need defending in her feud with Katy Perry", "news_keywords": "Ed Sheeran, Katy Perry, Taylor Swift", "og": {"type": "article", "title": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud", "url": "https://www.rollingstone.com/music/music-news/ed-sheeran-weighs-in-on-taylor-swift-katy-perry-feud-193568/", "description": "British singer/songwriter says prolific BFF Swift doesn’t need defending", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ed-sheeran-weighs-in-katy-perry-taylor-swift-beef-4df11872-3670-46bd-86d4-3cebf6bc9c11.jpg", "width": 1024, "height": 576, "alt": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud: 'There's Always Been Beef Songs'"}, "locale": "en_US"}, "article": {"published_time": "2017-06-19T15:34:00+00:00", "modified_time": "2018-06-25T16:17:27+00:00"}, "twitter": {"text": {"title": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ed-sheeran-weighs-in-katy-perry-taylor-swift-beef-4df11872-3670-46bd-86d4-3cebf6bc9c11.jpg?w=1024", "alt": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud: 'There's Always Been Beef Songs'"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud", "description": "Ed Sheeran says prolific BFF Taylor Swift doesn't need defending in her feud with Katy Perry"}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 193568, "title": "Ed Sheeran Weighs In on Taylor Swift, Katy Perry Feud", "published_at": "2017-06-19 15:34:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/ed-sheeran-weighs-in-katy-perry-taylor-swift-beef-4df11872-3670-46bd-86d4-3cebf6bc9c11.jpg?w=1024", "comment_count": 0, "tags": "Taylor Swift", "topics": "Music News", "body": "Despite all the she-said, she-said in the Taylor Swift/Katy Perry feud, Ed Sheeran said in a recent interview that he thinks the back-and-forth is overblown.\"I don't think she needs [to be defended] at all,\" he told People magazine at the 2017 Songwriters Hall of Fame 48th Annual Induction and Awards Gala. \"I don't think feud songs are a hot thing – there's always been beef songs.\" Sheeran specifically cited Carly Simon's \"You're So Vain\" as an example of a classic \"diss track\"; Simon revealed in 2015 that she penned the 1972 hit with Warren Beatty in mind. Earlier this year, Perry incurred the wrath of many Swift fans after the release of her hit \"Swish Swish,\" which many interpreted as a direct attack on the \"Wildest Dreams\" singer. \"Don't you come for me / No, not today / You're calculated / I got your number / 'Cause you're a joker / And I'm a courtside killer queen,\" one verse partly reads.(As though confirming that the song was indeed about Swift, Perry changed the lyrics to hold a more conciliatory tone during a live-streamed concert: \"God bless you on your journey, baby girl.\" Days earlier, Perry had delivered that same line when chatting with Arianna Huffington about Swift.)\"I am ready to let it go,\" she said at the time. \"I forgive her and I'm sorry for anything I ever did, and I hope the same from here. I think it's actually like, I think it's time. There are bigger fish to fry, and there are real problems in the world. You know what I'm saying? … There's a lot of other things out there in the world that people need to be focused on, and I truly, like God bless her on her journey. God bless her. Honestly.\"Earlier this month, Swift seemed to make a not-so-subtle point when she announced the release of her entire back catalog on all streaming services  – just as Perry dropped her fourth studio album, Witness.Perry and Swift's fallout dates back to 2014, when Swift suggested in a Rolling Stone interview that Perry had once stolen backup dancers out from under her, effectively throwing a wrench in their friendship. Swift's hit from that same year, \"Bad Blood,\" is widely assumed to be about Perry.As for Swift and Sheeran, their platonic friendship is rock-solid. \"We've gotten matching Scottish folds, made each other arts and crafts Christmas presents, vacationed with our families, and had each other's backs,\" Swift told Rolling Stone earlier this year. \"He is the James Taylor to my Carole King and I can't imagine a time when he wouldn't be.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1497886440.0, "source": "http://www.rollingstone.com", "summary": ""}