{"url": "https://www.thewrap.com/heres-what-the-oscars-have-done-to-avoid-another-envelope-disaster/", "text": "If you see any funny business with the envelopes at this year’s Oscars, it’ll be exactly that: funny business, a joke worked up by host Jimmy Kimmel’s team to poke fun at the fiasco that ended last year’s ceremony.\n\nThat’s because the chance that a presenter will receive the wrong envelope and announce the wrong winner this year is about the same as the chance that “The Boss Baby” will beat “Coco” for Best Animated Feature. Which is to say, it won’t happen.\n\nPwC, the Academy’s accounting firm through about 80 years and a few name changes, had a catastrophic failure last year — but with new people in charge, new procedures in place and everybody on high alert, it’s inconceivable that we’ll see a repeat of last year unless it’s engineered by Kimmel and crew.\n\nAlso Read: Oscars Stage Manager Details PwC Accountants' Incompetence: 'They Froze' (Exclusive)\n\nAnd make no mistake — even if the Academy and PwC didn’t do anything, they could still be almost certain that it wouldn’t happen again. It took a perfect storm of ineptitude to produce last year’s fiasco, starting with a money-saving envelope redesign that made the category name harder to read, particularly in the dark. The mistakes went on to include a pair of presenters in their ’70s, one of them (Warren Beatty) known for fooling around and the other (Faye Dunaway) perpetually surrounded by a certain level of chaos; a spot at the end of the show, when the wings fill up with people and things get more disorganized; a distracted and star-struck accountant (Brian Cullinan) who had been violating the rules by tweeting from backstage during the show, and who was reluctant to acknowledge that he’d given Beatty the wrong envelope and correct his error when it happened; and a second accountant (Martha Ruiz) equally reluctant to do her job, which was to immediately stop the show if an incorrect winner was announced.\n\nCullinan bears the brunt of the responsibility, but the damage would have been less if he had more legible envelopes, a less chaotic backstage environment, presenters who could have figured out the problem before announcing an incorrect winner, and a partner who reacted more quickly.\n\nPwC’s first move after last year’s show was to apologize profusely, and its second was to guarantee that neither Cullinan nor Ruiz would ever again work an Oscars show. (They both remain gainfully employed by the company.)\n\nThey also announced a few steps to prevent a recurrence last March, and then detailed additional steps to the AP in January.\n\nAlso Read: Academy Lets PwC Keep Its Job Despite Oscars Fiasco - But With Big Changes\n\nFor starters, the team that’ll replace Cullinan and Ruiz crucially includes PwC partner Rick Rosas, who served as a balloting leader of the Oscar team for 14 years (the last of those paired with Cullinan) before he relinquished his post to Ruiz in 2015. While Cullinan was known to throw an Oscar party the night before the big show, Rosas would just as soon finish counting and go play golf — because on the golf course, he once told me, “nobody is around to ask me anything.”\n\n(He also admitted that he “gets a perverse thrill” out of looking at people’s predictions on Oscar morning, when only he and his partners know all the winners.)\n\nRosas’ partner in the wings of the stage will be Kimberly Bourdon, a partner in PwC’s Banking and Capital Markets Industry Audit Practice who has been with the firm for more than 20 years. And a third balloting leader will be stationed in the control trailer behind the Dolby Theatre with the show’s director and producer: Mark Lobel, a PwC principal in the company’s cyber security and privacy practice, who has worked on the Oscars detail for more than five years.\n\nAll three will have the winners memorized – and Lobel in particular will be in position to immediately notify the production team if a mistake has occurred, something that didn’t happen last year.\n\nPwC’s chairman and senior partner, Tim Ryan, will also attend the show and oversee the process.\n\nAlso Read: See the Backstage Oscar Photo PwC Man Tweeted Just Before Handing Out Wrong Envelope (Photo)\n\nAnd while the new team members don’t sound like star-struck types — I can vouch that Rosas isn’t, and I suspect that the other two wouldn’t have gotten the gig if they had any Cullinan-esque tendencies — they’ll also be working under a new rule designed to eliminate distractions: no electronic devices backstage.\n\nAnother new rule says the team must attend rehearsals, which isn’t unusual; once the counting is done, the PwC reps typically show up at Oscar rehearsals on Saturday to check with the production team about which presenters will be entering from stage left and which from stage right. (One accountant is stationed on each side of the stage with a complete set of envelopes, so a logistical rundown tells them who is going to be giving out the envelopes to whom.)\n\nThis year, though, their rehearsal duties will also include participating in a rehearsal of how they’ll handle “possible onstage issues.”\n\nDuring the show, another new rule says that when the PwC rep hands an envelope to a presenter, both the presenter and the stage manager stationed on that side of the stage must confirm that it is for the correct category. Dency Nelson, a longtime Oscar stage manager who retired five years ago, routinely did this – but now it’s a hard-and-fast rule.\n\nTwo other factors are as yet unknown: Whether this year’s envelopes will be more readable than last year’s gold-on-red design, and who’ll be presenting the Best Picture award.\n\nThe Academy did not respond to TheWrap’s question about whether a new envelope design would be in place this year, and show producers Michael De Luca and Jennifer Todd are unlikely to spill the beans about the final presenters ahead of time.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/02/cullinan-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/uploads/2017/02/Jordan-Horowitz-Barry-Jenkins-Oscars-1-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2017/02/Jordan-Horowitz-Barry-Jenkins-Oscars-160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2013/10/StevePond.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "keywords": [], "authors": ["Steve Pond", "Joe Otterson", "Jeremy Fuster"], "canonical_link": "https://www.thewrap.com/heres-what-the-oscars-have-done-to-avoid-another-envelope-disaster/", "title": "Here’s What the Oscars Have Done to Avoid Another Envelope Disaster", "meta_data": {"parsely-title": "Here’s What the Oscars Have Done to Avoid Another Envelope Disaster", "parsely-link": "https://www.thewrap.com/heres-what-the-oscars-have-done-to-avoid-another-envelope-disaster/", "parsely-type": "post", "parsely-pub-date": "2018-02-27T15:02:33-08:00", "parsely-section": "awards", "parsely-author": "Steve Pond", "parsely-tags": "academy_awards, awards, brian-cullinan, martha-ruiz, oscars, pwc, rick-rosas", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "The chances of another Oscars envelope fiasco are about the same as the chances of \"The Boss Baby\" beating \"Coco\" in the Best Animated Feature category", "news_keywords": "academy awards, awards, brian cullinan, martha ruiz, oscars, pwc, rick rosas", "original-source": "https://www.thewrap.com/heres-what-the-oscars-have-done-to-avoid-another-envelope-disaster/", "og": {"locale": "en_US", "type": "article", "title": "Here's What the Oscars Have Done to Avoid Another Envelope Disaster", "description": "The chances of another Oscars envelope fiasco are about the same as the chances of \"The Boss Baby\" beating \"Coco\" in the Best Animated Feature category", "url": "https://www.thewrap.com/heres-what-the-oscars-have-done-to-avoid-another-envelope-disaster/", "site_name": "TheWrap", "updated_time": "2018-02-27T23:04:02-08:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "width": 618, "height": 411}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/steve.pond.399?ref=tn_tnmn", "tag": "Rick Rosas", "section": "Awards", "published_time": "2018-02-27T23:02:33-08:00", "modified_time": "2018-02-27T23:04:02-08:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "The chances of another Oscars envelope fiasco are about the same as the chances of \"The Boss Baby\" beating \"Coco\" in the Best Animated Feature category", "title": "Here's What the Oscars Have Done to Avoid Another Envelope Disaster", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "creator": "@stevepond"}, "generator": "WooFramework 6.2.0", "sailthru.title": "Here’s What the Oscars Have Done to Avoid Another Envelope Disaster", "sailthru.date": "2018-02-27T23:02:33+00:00", "sailthru.author": "Steve Pond", "sailthru.tags": "academy awards,oscars,pwc,rick rosas,awards,martha ruiz,brian cullinan", "sailthru.category": "awards,movies,steve pond", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-envelope-fiasco-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": ["https://www.youtube.com/embed/ZbDS_tMdMis", "https://www.youtube.com/embed/l0ODw2L-XpQ", "https://www.youtube.com/embed/EvegBo4TUdQ", "https://www.youtube.com/embed/XevUKl9UMO8", "https://www.youtube.com/embed/BqIkO96YYm0", "https://www.youtube.com/embed/h8PwzBGpEbY", "https://www.youtube.com/embed/MqiD0KTZrKE", "https://www.youtube.com/embed/aeZdR7zek14", "https://www.youtube.com/embed/uiV0Y6XjgnI"], "publish_date": 1519801353.0, "source": "https://www.thewrap.com", "summary": ""}