{"url": "github.com/hrldcpr/buzzfeed/blob/master/titles_two.txt", "text": "27 Reasons You Have The Urge To Hit The Road. 11 Foods Made With The Subway Yoga Mat Chemical. 22 Eating Fails That Prove You Should Always Eat Alone. 27 Astonishing Before-And-After Photos Of U.K. Flooding. 12 Valentine's Cards For The Science Nerd In Your Life. 20 Alcoholic Beverages You'll Never Be Able to Drink Again. 22 Conversations Every Cat Owner Has Had With Their Pet. 23 Gifts That Look Good Enough To Eat. 35 Nerdy Cards Against Humanity Cards To Add To Your Deck. 11 Romantic Destinations With No Cell Service. 22 Photos That Prove The Hanson Brothers Are Actually Smoking Hot. 21 Awesome Book Covers Illustrated By Erik Blegvad. 20 Signs You Grew Up In The Northern Territory. 11 (Unintentionally) Scary Vintage Dolls That Will Make Your Skin Crawl. 26 Signs You Grew Up On A Farm. 10 Pictures Of An Australian Brothel That Perfectly Capture The '90s. 15 Olympic Sports Any Twentysomthing Could Totally Win. 32 Important Things Every Fashion Week Party Needs. 21 Cole Porter Lyrics That Will Make You Fall In Love. 19 Fun Websites To Waste Time On Right Now. 8 Accurate Comics About Being An OkCupid-Loathing Single. 9 Reasons Shailene Woodley Is The Next Jennifer Lawrence. 24 Wonderful Things You Should Thank Your Dad For. 10 Ways Canada Has Already Won The Winter Olympics. 23 Derek Jeter Memories That Will Live Forever In Our Hearts. 16 Scientific Reasons Love Is Bad For You. 24 Simple Tricks To Reduce Your Anxiety. 7 Valentine's Day Cards Inspired By Tina From \"Bob's Burgers\". 36 Celebrities Who Are Flying Solo This Valentine's Day. 17 Faces That Will Make You Want To Adopt An Older Dog. 67 Things You Need To Know About This Year's Oscar Nominees. 44 Stock Photos That Hope To Change The Way We Look At Women. 26 Ways To Cook Dinner For Your Favorite Vegetarian. 17 New Slang Terms You Should Start Using Immediately. 12 Incredible Stories Of Life-Saving Organ Donations. 52 Hilarious #ActivistPickUpLines For Valentine's Day. 54 Photos Proving The U.S.A.-Canada Women's Hockey Rivalry Is Becoming The Best Part Of The Olympics. 20 Signs You Are Actually Jimmy Fallon. 14 Must-Read Works Of Chicano Literature. 12 Last-Minute Printable Valentines. 17 Cupids Who Will Murder You The Second You Close Your Eyes. 23 Insanely Romantic Ways To Say I Love You. 27 People Who Are Way Worse At Parenting Than You. 12 Spectacular Examples Of Media Conference Gobbledegook. 18 Optical Illusion Tattoos That Will Make You Take A Second Look. 16 Delightful Made-Up Words. 18 Female Artists Who Are Finally On Wikipedia. 30 Pictures Of Dogs Prancing Around At The 138th Westminster Kennel Club. 22 Olympics Photos That Will Destroy Your Faith In Gravity. 25 Famous Movies That Should Have Been About Cheese. 22 Unconventional Gifts To Show Someone You Love Them. 6 Bonus Songs From \"Frozen\" That You Need To Hear. 10 Greatest Anime Endings Of All Time. 29 People Who Will Make You Proud To Be Australian. 13 Of The Sickest Presidential Insults. 21 Ways To Celebrate Galentine's Day With Your BFFs. 12 Everyday Problems Of Blonde Girls. 26 Horrifyingly Awesome Figure Skating Fashions From The '80s. 12 Signs Being Ladylike Isn't Your Forte. 23 Bewitching Halloween-Themed Vintage Valentine’s Day Cards. 13 Lessons In Healthy Living You Learned From \"Sex And The City\". 21 Photos Of Your New Favorite Frenchie. 18 Australian Valentine's Day Cards To Give To Your Special Someone. 17 Reasons It's Better To Be Single This Valentine's Day. 19 Signs You're The Creepy Friend. 17 Celebrities You Forgot Were On \"Boy Meets World\". 22 Valentine's Day Children's Books To Warm Your Heart. 35 Old-School Latino Albums You Probably Forgot About. 21 Animals Who Totally Believe In You. 26 Super-Sexy Pairs Of Men's Underwear Totally Perfect For Valentine's Day. 21 Signs Pajamas Are Your Significant Other. 21 Things You Probably Didn't Know About Sonic The Hedgehog. 18 Kids Movies From The '90s You’ve Probably Forgotten About. 15 Reasons Valentine's Day Was Better In Elementary School. 27 Signs You've Found Yourself A Keeper. 28 Wardrobe Essentials For Female Gamers. 7 Leslie Knope Ways To Tell Your Bestie You Love Them This Galentine's Day. 21 Things Twitter Thinks Bob Costas' Gross Eyes Made Him Look Like. 27 Reasons Your Cat Makes The Best Valentine. 16 Things Johnny Weir Has Looked Like During His Time In Sochi. 18 Reasons Shirley Temple Was Basically The Coolest Kid Ever. 27 Real Struggles That Only RAs Will Understand. 22 Reasons \"House Of Cards\" Is The Only Valentine You Need. 29 Tasty Vegetarian Paleo Recipes. 11 Inspiring Stories Of People Who Left Normal Life And Embarked On An Adventure. 16 Legitimate Reasons Why Valentine's Day Is The Worst. 23 More Workout Tanks To Not Work Out In. 23 Reasons Why Greg Bretz Should Be Your Valentine This Year. 22 Struggles Only Bros Will Understand. 31 Love Stories In 140 Characters Or Less. 9 Ways Mizzou Stands With Michael Sam. 27 Chocolate Desserts That Make Valentine's Day Worth Celebrating. 19 Short Novels For The Shortest Month Of The Year. 17 Maya Angelou Quotes That Will Inspire You To Be A Better Person. 24 Signs You're So Done With College. 32 Pictures Of Britain As It Battles The Floods. 27 Signs You've Found The Perfect Roommate. 24 Amazingly Cute GIFs Of Shirley Temple As A Child To Remind Us What An Icon She Was. 26 Devilishly Clever Words You Never Knew You Could Get Away With In Scrabble. 15 Easy Tips For Scoring Your Dream Job In Your Twenties. 22 Magical Facts That Will Make You Want To Move To Norway. 7 Quick Dinners To Make This Week. 15 Highly Questionable Pieces Of Vintage Dating Advice. 19 Terrible Puns You Can Only Make During The Sochi Olympics. 20 Awkward Moments That Only Occur In Cars. 16 Spectacular Dicks On The Herald Sun. 8 Everyday Catastrophes For Shy People. 15 Things To Consider Before Renting Your First Apartment. 19 Reasons Tim Burton Is The King Of Romance. 13 Must See Movies At Sydney's Mardi Gras Film Festival. 23 Things All Servers Will Understand. 28 Sexy Brownies To Spend Valentine's Day With. 22 Absolutely Stunning Victorian Book Covers. 20 TV Shows That Need To Be On DVD ASAP. 31 Intellectual Breakthroughs From Inside The Shower. 30 Ways You And Louis C.K. Are The Same Person. 21 Songs To Share With Your Sweetheart This Valentine's Day. 10 Men's Shoes That Will Help You Win Valentine's Day Lead The Daily Links. 16 Reasons \"Camp Takota\" Should Be Your Date On Valentine's Day. 17 Ways You Are Older Than The Rest Of Your Friends. 15 Pitbull Valentines To Spread Your Love Like Mr. Worldwide. 23 Wildly Inappropriate Baby T-Shirts And Onesies. 23 Reasons Why Being Single Is The Healthiest Thing For Your Soul. 13 Awesome Gifts To Give On Valentine's Day Instead Of Flowers. 31 Impossibly Romantic Wedding Ideas. 16 Graphs And Charts That Perfectly Illustrate Twentysomething Life. 18 American Hotties Who Are Heating Up Sochi. 38 Winter Olympians Throughout History Reacting Triumphantly Upon Winning The Gold. 41 Scrumptious Ways To Make Scones For Your Sweetie. 31 Special Feelings That Every Dog Owner Is Familiar With. 21 Signs Your Relationship With Food Has Gotten Way Out Of Control. 17 Winter Sports Movies To Watch Instead Of The Winter Olympics. 10 DIY Ways To Treat Yo'self For Valentine's Day. 14 Incredible But Fake Viral Images — And The Twitter Account Debunking The Picspammers. 17 Things Only A Hyperactive Person Will Understand. 16 Cool And Creative Examples Of Post-It Note Art. 17 Gorgeously Geeky Posters Of Classic Film Interiors. 19 Delicious Spaghetti Dinners. 17 Pornhub Comments As Inspirational Quotes. 25 Snow Sculptures From Tokyo's Biggest Blizzard In Decades. 12 Works Of Art By The Michaelangelo Of Lego. 9 Super Romantic Dinners For Two. 40 Vintage Wedding Ring Details That Are Utterly To Die For. 32 Photos From The 2004 Teen Choice Awards That Will Make You Nostalgic. 50 New Jack Swing Jams That'll Take You Back. 21 Reasons Why TISM Are The Best Thing To Ever Come Out Of Australia. 10 Things Schapelle Corby May Not Know Exists. 33 Valentine's GIF Cards That Are Perfect For Your Tumblr Sweetheart. 14 Things That Prove Bees Are Actually Superheroes. 25 Adorable Gifts For Your Valentine For Under $25. 13 Of The Most Amazing Bed-And-Breakfasts In The World. 9 Videos You Can't Miss This Week. 22 Different Types Of Hangovers. 9 Feature Stories We're Reading This Week. 17 Things That Happen The Day After You Hook Up With Someone. 27 Staggering New Pictures Of The Somerset Levels Floods. 23 Stunningly Subtle Disney Tattoos. 29 Hidden Faces With Something Profoundly Important To Say. 26 Vegan Versions Of Your Favorite Comfort Foods. 17 Insanely Clever Ways To Use Your Phone's Camera. 29 Delicious Ways To Eat More Pears. 19 Of The Funniest Things Kids Have Ever Said. 15 Extraordinary Pictures Of Abandoned Buildings. 21 Reviews Of Flappy Bird In The iTunes App Store That Prove It's A Good Thing It's Been Taken Down. 21 Mindbending Pictures That Blend Reality And Fantasy. 21 Beautiful Pictures Of Empty Movie Theaters. 28 Announcements You Should Never Make On Facebook. 10 Pictures That Prove Bruno Mars Is Actually Powerline From \"A Goofy Movie\". 17 Reasons Why Anna Should Be Your Favorite Disney Princess. 8 PBR Facts Every Beer Drinker Should Know. 27 Weird And Creepy Vintage Valentine's Day Cards. 15 Vintage Board Games That Will Make '90s Kids Nostalgic. 11 Celebrity #TBT Photos You May Have Missed This Week. 18 Hilarious Artist Re-Interpretations Of Weird Things They See. 16 Things We Learned About The Vampire Academy Series From Author Richelle Mead. 24 Ways You're Already Acting Like An Old Lady. 8 Signs You're Wearing The Wrong Bra Size. 50 Reasons Why Australians Are The Luckiest People On Earth. 9 Potential World-Ending Ecological Disasters That Should Terrify You Right Now. 14 Bands You Probably Didn't Know Were Manufactured By TV Shows. 23 Moments That Make Being A Dad Totally Worth It. 16 Of The Dumbest Excuses For Pokémon. 17 Celebrity Instagrams You Need To See This Week. 19 Of The Most Senseless Crimes Ever Committed. 14 Celebrities Who Are Way Too Rich For Their Own Good Lead The Daily Links. 16 Of The Worst Ideas You Have In College. 13 Alarming Photos Of Landfills You Can't Unsee. 26 Songs You Totally Forgot About From The '00s. 4 Cavemen Who Are So Sick Of Paleo-Gentrification. 8 Weird Facts That Defy All Reason. 17 Photos That Will Give You Iceland Envy. 11 Simple Drinking Games You Need To Play Right Now. 19 Jokes You Should Send To Your Mom Right Now. 19 DIY Projects For The Travel Obsessed. 27 Totally Baffling Russian Signs. 15 Passive Aggressive Valentine's Day Cards. 17 Reasons You Should Love Bob Costas. 35 Times Mindy Kaling And B.J. Novak's Best Friendship Killed You In The Heart. 32 Things You Always Believed That Simply Aren't True. 12 Homemade Valentines That Won't Terrify Your Casual Hookup. 44 Things You Learn Very Quickly After Moving To NYC. 21 Pretty Pink And Red Drinks For Valentine's Day. 12 Reasons Coffee Is The Perfect Valentine. 20 Confessions Of A Struggling Workaholic. 17 Things That Would Only Get Reported In British Local Newspapers. 7 Budget-Friendly Weekend Cooking Projects. 16 Selfie Double Chins That Double Win. 18 People Who Can't Wait For The Weekend. 14 Photos That Prove That Skeleton Is The Most Badass Sport At Sochi. 64 Superb Vintage Pictures Of The Winter Olympics. 18 Amazing Places To Visit In Britain In 2014. 23 Signs You're An Awkward Individual. 16 Astounding Backpacking Trips To Add To Your Bucket List. 21 Sad Truths About Not Studying Abroad With Your Friends. 38 Powerful Pictures From The Sony World Photography Awards. 19 Glorious Shots Of Shoe Porn Starring Kylie Minogue. 9 Everyday Secrets Of Happy Couples. 18 Things You Should Never Say To A Bostonian. 23 Literal Gospels From The Mouth Of The Actual Angel Castiel. 33 Photographs Of The Most Magical Place On Earth. 19 Things That Are Totally Fine To Keep Forever. 16 Heavenly Cheese And Chocolate Fondues. 30 Animal Cupcakes Too Cute To Eat. 14 Things You Didn't Notice About \"The Brady Bunch Movie\" As A Kid. 21 Disturbing Examples Of Russia's Dill Addiction. 8 Audition Tapes Of Famous Actors Lead The Daily Links. 25 Incredibly Gay Things About Russia. 25 Critters That Will Kill You (With Their Cuteness). 21 Reasons Cooking Is Both Terrifying And Wonderful. 21 Truths You Only Know If You Met Your Significant Other Online. 23 Everyday Awkward Situations. 23 Lies You Tell Yourself While Traveling. 45 Things I Learned At The Creation Museum. 45 Stunning And Bleak Photos Of Life During The Soviet Union. 18 Things You Probably Didn't Know About Bob Marley That Have Nothing To Do With Marijuana. 18 Pieces Of Proof That Cam'ron And His Girlfriend Have The Perfect Relationship. 22 Of The Most Creative College Essay Questions From 2013. 15 Ways \"Cadet Kelly\" Was Secretly About Being Gay. 21 Pun Battles That Are Actually So Bad They're Good. 21 Reasons Miles Teller Should Be Your Next Celebrity Crush. 17 Signs You Might Be Really Obsessed With Your Cat. 27 British People Who Must Be Stopped. 19 Reasons Hermione Shouldn't Have Gotten Married At All. 10 Types Of Friends You Shouldn't Feel Bad Dumping. 25 Chai-Spiced Treats To Warm Your Winter Kitchen. 18 Important Things You Should Know About Your Raw Denim. 19 People Who Haven't Quite Worked Doors Out Yet. 21 Signs You're A Cat Lady In Training. 29 Problems Only Writers Will Understand. 27 Tiny Animals That Will Warm Your Heart Today. 25 Ridiculous Gum Flavors You Didn't Know Existed. 13 Reasons Why Australia Is The Daggiest Country. 7 Bananas That Would Make Gwen Stefani Proud. 12 Breathtaking Views From The World's Coolest Towers. 26 Pictures That Will Redefine Your Perceptions Of Tony Abbott. 25 Reasons To Give \"The Godfather Part III\" Another Shot. 17 Hot Canadian Athletes Who Will Literally Melt The Winter Olympics. 2 Cats Who Know The Secret To A Good Cuddle. 21 Punny Pop Star Mash-Ups. 36 Witches Ron Weasley Should Have Ended Up With. 16 Cats Who Are Getting A Jump On Spring Cleaning. 5 Last-Minute Vacation Ideas To Escape Winter Lead The Daily Links. 19 Dogs Standing Up To Sochi's Deplorable Treatment Of Stray Dogs. 9 Ways You Didn’t Know You Could Relieve Stress. 23 Reasons Shaun White Is The Perfect Valentine For You. 15 Classic Tales Wishbone Taught Better Than Your English Teacher. 27 Things You'll Never Forget If You Were A Teenage Girl In Taiwan. 7 GMO Foods That Will Blow Your Mind. 15 Of The Most Insane Airbnb Rental Listings. 19 Lovely Cupcakes To Make This Valentine's Day. 22 Reasons Why Thor Is The Most Underrated Avenger. 16 Actors Who Enjoy Doing Impressions Of Other Actors. 10 Expanded Universe Characters That Need To Be In \"Star Wars VII\". 27 Songs For Every Single Person On Valentine's Day. 26 Signs You're At An Italian-American Wedding. 21 Signs You're The Parent In The Office. 14 Actual Porn Comments Turned Into Valentines. 9 Beautiful Hand-Drawn Animations From Disney Films. 700 Words That Explain Exactly What It Feels Like To Do Heroin. 11 Emotionally Repressed Valentine's Cards For British People. 21 People Posing With Photos Of Their Younger, More Awkward Selves. 27 Adorable Valentine's Day Treats You Can Make. 15 Highly Anticipated Books From (Mostly) Small Presses. 22 Delicious Russian Foods For Your Sochi Olympics Party. 22 Messages From Creationists To People Who Believe In Evolution. 22 Messages For Creationists From People Who Believe In Evolution. 16 More Reasons To Root Against The Evil Canadians At The Winter Olympics. 17 Singers Who Really Don't Need Autotune. 20 Amazing Works Of Refrigerator Door Art. 9 Painful Steps Of Every Moving Process. 15 Indisputable Facts That Prove You Should Only Wear Professional Wrestling T-Shirts. 19 Reasons Why Arachnophobes Should Give Australia A Miss. 10 Biggest Dick Moves On Valentine's Day. 15 Clips You Really Have To Look At To Understand. 20 Reasons Why White People Can't Be Trusted. 21 Reasons Why CM Punk Is Loved By The WWE Universe. 8 Celebrity Tweets You Missed Today. 21 Signs You Were Raised By Lawyers. 37 Things @Jack May Or May Not Agree With. 20 Ways To Eat A Tim Tam. 29 Things People With Curly Hair Can Simply Never Do. 10 Celebrities Who Shared Their First Kiss With Another Celebrity Lead The Daily Links. 30 Country Songs For A Lonely Heart. 8 Valentines To Send To The Food You Love. 25 Problems Only Meat Lovers Would Understand. 24 Signs You're A Writer. 21 Ridiculously Adorable Vintage Valentine's Day Cards. 17 Photos Of The Furry Faces Olympians Have To Leave At Home. 12 Comics That Will Ruin Your Childhood. 21 Annoying Cartoon Characters Every '90s Kid Loved To Hate. 31 Grilled Cheeses That Are Better Than A Boyfriend. 17 Facts That Prove Toronto Is The Most Underrated City. 18 Things You Need To Know About California's Worst Drought In Centuries. 15 Works Of Nail Art Inspired By Your Favorite Children's Books. 21 Valentine's Day Gifts Every Twentysomething Really Wants. 20 Breathtaking Photographs From The Largest Pride March In Mumbai's History. 18 Valentines From Leonardo DiCaprio That Are Necessary For Your Loved One. 13 Of The Weirdest Monopoly Editions Ever Created. 19 Reasons Having A Sister Seems Awesome. 15 Eerie Pictures Of A Classic Car Graveyard In Sweden. 8 Stunning Pictures Of The World's Last Surviving Tribes. 39 Jaw-Dropping Vintage Nasa Photographs. 23 On-The-Go Breakfasts That Are Actually Good For You. 12 Beautifully Re-Coloured Vintage Pictures Of Celebrities. 17 Dogs Who Shockingly Lost Their Puppy Bowl Bets. 7 Alarming Facts About How British Hitmen Really Work. 27 Red Velvet Desserts That Want To Be Your Valentine. 16 Reasons Wollongong Is The Happiest City In Australia. 20 Reasons Why You're The Awkward One In The Relationship. 15 Singers You Might Not Know Were Immortalized As Barbies. 13 Reasons The Madden Bowl Was A Lot Better Than The Super Bowl. 13 Classic Russian Paintings Reimagined With The Simpsons. 20 Actresses Who Can Truly Belt It Out. 37 Signs You Grew Up In Australia In The '90s. 28 Valentine's Day Cards You Haven't Seen Since The '90s. 50 French Songs You Need To Hear Before You Die. 8 Reality Shows That D.C. Really Needs. 10 Confessions From People Who Had Raging Internet Crushes. 17 Things You Probably Didn't Know About Shakira. 25 Reasons Why Bra Shopping Is Just A Total Nightmare. 43 Demonstrators Were Arrested In Idaho For Protesting For LGBT Rights. 12 Times \"Flappy Bird\" Drove Human Beings Into A Black Maw Of Existential Despair. 12 Of The Best Places To Study Abroad. 21 Shining Examples Of The Educational System At Work. 43 Photos Of Seattle Seahawks Fans Celebrating Their First Super Bowl Title. 22 Dogs Who Freakin' Loved Watching The Puppy Bowl. 13 Literary Books That Young Adult Readers Will Love. 18 Celebrity Equations That Totally Add Up. 19 Penises You Need To Visit Before You Die. 17 Tiny Things The Writers Of “Criminal Minds” Need You To Know. 16 Reasons Why \"Misery\" Is The Perfect Valentine's Day Movie. 10 DIY Ways To Survive Six More Weeks Of Winter. 28 Delicious Things To Cook In February. 55 Things That Happened Inside Howard Stern's Birthday Bash. 60 Adorable Real Vintage Wedding Photos From The '60s. 23 Delicious Salads To Get You Through Winter. 12 Disney Valentines That Will Destroy Your Childhood. 13 Awesome Childhood Toys That Made Bath Time Great. 19 Signs You're Olaf From \"Frozen\". 9 Videos You Can't Miss This Week. 21 Things You Didn't Know About Mary Lambert, The Featured Singer On Macklemore's \"Same Love\". 6 Super Bowl Commercials That Will Make You Reach For The Tissues. 20 Times Peyton Manning Looked Super-Duper Sad During The Super Bowl. 7 Even Worse Places To Hold The Super Bowl Than East Rutherford, New Jersey. 21 Things You're Doing Wrong In The Bathroom. 17 Reasons The Denver Broncos Are The Least Hateable Team In The NFL Playoffs. 11 People Who've Had Their Lives Ruined By Flappy Bird. 23 Reasons Richard Sherman Is Actually One Of The Most Likable Players In The NFL. 15 Sweet Treats To Get Your New York Valentine. 16 Comics That Socially Nervous People Understand. 9 Feature Stories We're Reading This Week. 11 Things We Learned From The Cast Of \"Vampire Academy\". 42 Traditional Finnish Foods That You Desperately Need In Your Life. 31 Impossibly Fun Wedding Ideas. 21 Beauty Regrets That Happen To The Best Of Us. 17 Marijuana Snacks To Eat During The Stoner Bowl. 7 Quick Dinners To Make This Week. 21 Weird Things People Actually Believed As Kids. 10 Struggles Of Having A Big Booty. 9 Times The Beatles Proved They Were Cheeky. 27 Deep Dark Fears That Will Make Your Skin Crawl. 17 Feel-Good French Films You Should Definitely Stream On Netflix. 52 Wedding Dresses That Aren't Strapless. 20 Things That Will Help You Through Your Long Distance Relationship. 13 Things Only Perpetually Cold People Will Understand. 29 Delicious Vegan Breakfasts. 25 Reasons Katy Perry Is The Queen. 12 Things I Learned At A Beyoncé Dance Class. 13 Celebrity #TBT Photos You May Have Missed This Week. 20 Reasons To Be Thankful For The Perfection That Is Harry Styles. 13 Pinterest Cleaning Tips That Don't Actually Work (And How To Make Them Better). 16 Insightful Gems On \"Lord Of The Rings\" From The Cast. 24 Creative Ways To Decorate Your Place For Free. 22 Things Only Yogis Will Understand. 27 Angry Reactions To Australia's Shark Cull. 25 Brand Slogans That Are Way More Accurate. 200 Close Friends Threw An Early Prom For Their Friend Who Was Diagnosed With Brain Cancer. 21 Wicked Disney Valentine's Day Cards From Your Favorite Villains. 21 Things Every Traveler Wishes They Owned. 21 Things You Don’t Get About Young People If You Were Born Before 1980. 19 Totally Forgotten Celebrity Couples Of The '00s. 21 Revealing Sculptures Of Characters From Your Childhood. 14 Paperbacks That Are Reenacting Their Own Plots. 10 Short Stories You Should Read This Winter. 9 Board Games To Get Really Excited About This Year. 8 Types Of Friends You Want In Your Late Twenties. 26 Ridiculously Sweet Valentine's Day Nail Art Designs. 33 Budgie Smugglers You Cannot Unsee. 31 Reasons You Can't Wait For Baseball Season. 7 Reasons Why Jennifer Lawrence Would Be An Amazing Best Friend. 19 Pieces Of Advice From Tami Taylor That Will Make You A Better Person. 10 Times Seth Meyers Cracked Up At His Own Jokes Lead The Daily Links. 10 Upsides Of Long-Distance Relationships. 21 Experiences Only The Overly-Enthusiastic Know To Be True. 23 Gifts You Should Give Your Butt For Valentine's Day. 15 Molten Lava Cakes You Could Fall Hard For. 23 Things You Probably Didn't Know About The Plant Kingdom. 31 Vines That Are Guaranteed To Make You Laugh. 20 Signs You're Filburt From \"Rocko's Modern Life\". 15 DIY Pom-Pom Projects For Jazzing Up Everyday Items. 101 Relationship Statuses Facebook Needs In These Confusing Times. 40 DIY Valentine's Day Gifts They'll Actually Want. 22 Travel Trends To Look Forward To In 2014. 33 Perfect Justin Timberlake Moments In Celebration Of His 33rd Birthday. 15 Reasons Why You Should Adopt Chinese New Year. 17 Scrumptious Ways To Eat A Creme Egg. 23 Experiences Every Non-Football Fan Has On Superbowl Sunday. 37 Reasons Bobby Moynihan Deserves To Have The Best 37th Birthday Ever. 7 Delicious Ways To Eat Pomegranate. 15 Incredibly Creative Examples Of Coffee Cup Art. 23 Photos Of Same-Sex Couples That Will Warm Your Heart. 21 Statues Who Are Having A Worse Day Than You. 24 Gifts People In Long-Term Relationships Actually Want To Receive. 8 Accurate Comics About The Anxiety Of Writers. 61 Adorable Behind-The-Scenes Moments At Puppy Bowl X. 17 Kangaroos That Can Kick Your Butt. 20 Brightly-Hued Ways To Eat Blood Oranges. 23 Reasons Annie Was The Cooler Twin In \"The Parent Trap\". 22 Times Lana Del Rey Fell Asleep While Singing. 7 Things You Should Never Say To Women. 15 Reasons Why Being An Australian Beach Lifeguard Is The Best Job Ever. 19 Things You Probably Didn't Know About \"The Castle\". 20 Things Female Sports Fans Are Tired Of Hearing. 21 Stages Of Having A Shoe Addiction. 22 Reasons Why Everyone Loves The Sunflower State. 14 Ways Dumbledore Was The Sassiest Wizard Of All Time. 25 Times Cartoons Were In Love With Pizza. 21 Times Justin Timberlake Wore Some Very Cringeworthy Fashions. 23 Signs You're The Marnie Of Your Friend Group. 32 Pictures Of Katy Perry's Style Evolution. 13 Signs Pregnancy Has Turned You Into An 80-Year-Old Man. 22 Bill Murray Gifts For Your Quirky Valentine. 19 Signs You Are From Brooklyn. 21 Unexpected Side Effects Of Working 9 To 5. 17 Ways Disney Movie Scenes Could Have Gone Way, Way Worse. 42 Things That Happened During My Day With The Second Most Famous Pomeranian In The World. 24 Celebrity Bobs That Will Make You Wish You Had Shorter Hair. 11 Everyday Things That Once Could Have Killed You. 9 Times The \"American Horror Story: Coven\" Finale Borrowed From \"Asylum\". 25 Completely Scientific Reasons Why Women Live Longer Than Men. 13 Things The Cast Of \"Game Of Thrones\" Is Thinking In The New Season. 23 Things I Learned About Cable News By Hanging Out With CNN At State Of The Union. 22 Signs You're The Shoshanna Of Your Friend Group. 331 Things That Are Way More Exciting Than Actually Watching The Super Bowl. 16 New \"Game Of Thrones\" Season 4 Photos!. 9 Bizarre Patents That Prove The Past Was A Nightmare. 21 Celebs You Just Know You'd Be BFFs With. 30 Inspirational Bible Verse Tattoos. 11 Biggest Problems You'll Have Being An NFL Lineman In Congress. 14 Things We Learned From Bob Saget, John Stamos And Dave Coulier's Reddit AmA. 10 Ways Bacon Is Already The Winner Of 2014. 17 Dogs Who Know All About The Friend Zone. 15 Stories That Will Restore Your Faith In The Next Generation. 27 Men Who Were Defeated By Shopping. 32 Reasons Myrtle Snow Should Actually Be The Next Supreme. 26 Times \"One Tree Hill\" Kept You Up At Night. 10 Ways To Kick Your Shoe Addiction Lead The Daily Links. 7 Surprising And Noteworthy Artists That Performed At The Peach Pit After Dark. 8 Problems Only Dogs Understand. 22 Reasons Why Everyone Should Love The WWE's Daniel Bryan. 7 Ways The ABC Could Be More On Australia's Side. 18 Reasons You Should Date A Vegetarian. 11 Secrets Pilots Don't Want You To Know. 8 Celebrity Tweets You Missed Today. 17 Times Winston Churchill Proved He's The Prime Minister Of Burns. 22 Movies That Will Make You Happy To Be Single. 28 Reasons John Elway Was, Is, And Always Will Be A Badass. 40 Unconventional DIY Valentine's Day Cards. 15 Alleged Juicy Secrets About Your Favorite Reality Shows. 24 Foods You Hated As A Kid But Love Now. 21 Reasons You Should De-Friend Your Parents. 21 Things Introverts Are Tired Of Hearing. 51 Pictures Of Summer Across America To Help You Feel Warm. 17 Reasons Mr. Darcy Isn't Actually That Great. 16 Things Exploding In Slow Motion. 21 Powerful Portraits Of Afghan Refugee Children. 32 Reasons Why Lena Dunham Is Absolutely Brilliant. 19 Startling Photos Of The Snow In Florida. 21 Fantastic Oprah Winfrey Outfits From Her Early Career. 20 Things Every Woman Understands But Doesn't Want To Talk About. 18 Revelations From George Clooney's Reddit AMA. 9 Things Joe Biden Did At The State Of The Union That Were More Interesting Than Obama's Speech. 29 Gospels From The Mouth Of Daniel Radcliffe. 22 Struggles All Curvy Girls Know To Be True. 95 X-Men Members Ranked From Worst To Best. 15 Vintage Photos Of Pete Seeger, Bob Dylan, And Other Folk Legends From The '60s And '70s. 27 Ways Britney Spears' Career Could Have Been Totally Different. 21 Totally Adorable Homemade Valentines To Make With Kids. 21 Truly Insane Stories Behind Your Favorite Foods. 19 Ways Shoshanna From \"Girls\" Is An Inspiration. 20 Verra Verra Braw Reasons Why Sam Heughan Is The Perfect Jamie Fraser. 20 Of The Junkiest Books About Drugs You’ll Ever Read. 6 Foods You're Eating Wrong. 17 Things Only Kids Can Find Hilariously Entertaining. 29 Secret Anxieties Of Girls With Natural Hair. 12 Times \"Family Matters\" Was The Weirdest Show On TV. 21 Reasons Karl Stefanovic Is The Greatest Australian Journalist Of All Time. 19 Hilariously Dull British Postcards. 26 Signs You Were A Business Major. 26 Decisions That Are Incredibly Difficult For Third Culture Kids. 17 Signs You're In A Relationship With A Burrito. 23 Ways Long-Distance BFFs Survive. 21 Reasons Why Old People Are The Best People On The Internet. 18 Post-Super Bowl Episodes By The Numbers. 14 Dos And Don'ts Of Throwing A Bachelor Party. 22 Reasons Having A Brother Seems Awesome. 33 Ways That Mark Ruffalo's Character In \"13 Going On 30\" Ruined Men For You. 35 Frustrating Things About Playing Video Games In The '90s. 14 Tips For Preparing For Your First Magic: The Gathering Tournament. 19 Ways Steve Urkel Inspired You As A Kid. 8 Hot Celeb Food-Holes That Make You Question The Sanity Of Kissing. 21 Badass GIFs To Get You Amped For Slopestyle At The Sochi Olympics. 17 Terrible Puns To Brighten Your Day. 44 Amazing Places You Wish You Could Nap Right Now. 24 Ways To Tell You Don't Understand Work-Life Balance. 19 Genuinely Funny Ways To Tell The World You're Having A Baby. 17 Animals Saying Ha-Ay. 17 Things The Over-Forties Believe About The Under-Thirties. 21 Unexpected Side Effects Of Being In A Relationship. 22 Stunning Aerial Photos That Reveal A Beauty From Above. 90 Cows Exploded A Barn In Germany With Their Farts. 23 Reasons Nothing In This World Is More Disgusting Than Fish. 26 Things That Happen When You Move To Los Angeles. 9 Ridiculously Expensive Celebrity Wedding Registry Gifts. 10 Valentine's Day DIYs For Your Favorite People. 14 Reasons Your New Year's Resolution Diet Never Sticks. 4 Major Reasons Why People Are Protesting In Ukraine. 21 Reasons Why Peggy Hill Is An Inspiration To Womankind. 3 Things That Could Negatively Impact The U.S. Economy This Year. 20 Striking Portraits Created Through A Unique Father-Son Collaboration. 23 Invaluable Life Lessons You Learned From Jim Henson. 28 Problems Only Ridiculously Good-Looking People Have. 14 Weird Vintage Beauty Ads. 22 Reasons You Should Be In Chile Right Now. 17 Times Quinn Morgendorffer Was The Smartest Person On \"Daria\". 13 Weeds You Can Eat Without Dying. 15 Animals Who Are Terrible Hiders But Don't Tell Them Cuz They're So Cute About It. 9 Celebrity Tweets You Missed Today. 12 Manicures For Super Bowl XLVII. 11 Things You Should Never Say To People With Curly Hair Lead The Daily Links. 29 Reasons You Wish Mindy Lahiri Was Your Big Sister. 9 Brain Farts You Know Too Well. 16 Common Surnames With Awesome Secret Meanings. 20 People Who Desperately Need Your Love. 42 Ridiculous Out-Of-Context Panels From Anime And Manga. 19 Things Only New Yorkers Are Weird Enough To Do. 21 Things Only People With No Butt Whatsoever Understand. 21 Stars Who Skipped The Grammys And Went Straight To The Grammy After-Parties. 39 Absolutely Perfect Comic Sans Valentine's Day Cards. 16 Signs You Are So Over Winter. 21 People You'll Meet In Every Pub. 16 Social Theories And Relationship Rules From \"How I Met Your Mother\". 21 Celebrity Instagrams From The Grammys That You Need To See. 19 Names For Oddly Specific Phobias. 25 Boy Band Songs To Help Get You Through The Day. 25 Behind-The-Scenes Photos You Missed From The Grammys. 5 Reasons You Shouldn't Get Mad About Macklemore Winning So Many Grammys. 23 Kids You Meet As A Parent. 25 Reasons Drinking When You're Underage Is The Worst. 24 Utterly Bizarre Japanese Ice Cream Flavors. 19 Reasons The Grammys Were Just The Jay Z And Beyoncé Show. 15 Perfectly Pleasing Symmetrical Breakfasts. 23 People Tackling A Muddy Assault Course Who Will Make Your Monday Seem Bearable. 7 Photos From One Of The Only Gay Bars In Sochi. 11 Extraordinarily Racy Works Of Vintage Erotica. 33 Things Pharrell Is Hiding Under His Hat. 19 Essential Cleaning Hacks For The Workout Addict. 11 Reasons Your Next Trip Should Be To Cinque Terre. 34 Couples Got Married During Macklemore And Ryan Lewis' Grammys Performance. 12 Things More Likely To Kill You Than A Shark. 8 People Madonna Looked Like At The Grammys. 12 Things Katy Perry Looked Like At The Grammys. 11 Celebrities Who Wanted To Be The Next Supreme At The Grammys. 24 Reasons Why P!nk Is The Role Model Every Girl Should Have. 23 Epic Literary Love Tattoos. 12 Grammy Facts That Prove The Awards Kind Of Mean Nothing. 31 Last-Minute Super Bowl Party Tips That Will Make Your Life Easier. 34 Couples To Marry At The Grammys During Macklemore's \"Same Love\". 8 Awesome Kids With Awesome Pets. 16 Hotels That Are So Cool You'll Want To Stay Forever. 9 Feature Stories We're Reading This Week. 23 Embarrassingly Ironic Complaints On Twitter. 17 Reasons To Fill Up On Bread. 15 Very Unique Ryan Gosling Items You Can Buy On Etsy. 19 Cartoon-Themed Foods And Snacks From The '90s You Might Not Remember. 9 Videos You Can't Miss This Week. 38 Breathtaking Pictures From The Early Days Of The London Underground. 32 Massive Pictures Of The World's Biggest Aircraft. 23 Cute Football Snacks For Your Super Bowl Party. 21 Reasons Birthday Cake Is, And Always Will Be, Better Than Cupcakes. 33 Scary Things Our Moms Didn't Know They Had To Be Afraid Of. 14 Alternative Australian Flags That Don't Feature Britain's Flag Too. 33 Ways You Know You're Australian. 16 Tasty Twists On Classic Aussie Treats. 22 Reasons Why Straight White Boys Are Actually The Worst. 30 Things To Avoid Before The Age Of 30. 27 Awesome Nail Art Designs For Australia Day. 17 Things Celebrities Did This Week. 16 Things Australians Take For Granted. 21 Mutts Muggin'. 23 Things You May Not Know About Tim Burton And His Movies. 21 Sundance Movies You Need To Know About. 31 Cuddly And Delicious Beds Of Polenta. 26 Reasons You Don't Need Meat At Your Super Bowl Party. 10 Super Bowl Facts You Should Know. 13 Easy Steps To Understanding Bitcoins From Hannah Hart. 30 Punny Valentines For Everyone You Love. 52 Things Only '90s Teenage Guys Can Understand. 33 Moments In Life That Are More Important Than You Think. 29 Denim Brands You Totally Forgot Existed. 9 Secret Uses For Your Everyday Bathroom Products. 21 Pointlessly Gendered Products. 27 Truly Magnificent Peanut Butter Desserts. 8 Celebrity Tweets You Missed Today. 11 Celebrity #TBT Photos You May Have Missed This Week. 13 Of The Most Adorable Little Princesses At Disneyland. 7 Beautifully Bizarre Marriage Proposal Locations Lead The Daily Links. 8 Reasons Why \"Outside Mullingar\" Is Debra Messing's Best Gig Yet. 25 Signs You Drink Too Much Wine. 8 Reasons A Catcall Is Not A Compliment. 14 Reasons You Should Visit Your Local Sex Shop. 28 Reasons Why Bruce Lee Was Better Than Your Favorite Superhero. 15 Young People Convinced They Are Super Old. 19 Highly Important Zoo Animal Reviews. 21 Things Your White Boyfriend Needs To Hear According To Twitter. 27 Reasons Anne Hathaway Is Actually America's Sweetheart. 12 Mind-Bending Facts About Your Brain. 9 Weirdly Plausible Fake \"New Scientist\" Headlines. 25 Ways Trains Are The Most Glorious Way To Travel. 29 Struggles That Only People With Big Butts Will Understand. 6 Enlightening Revelations From A Porn Star Training Video. 13 Times People Were Batman In Real Life. 10 Things We Learned From Katy Perry In Her GQ Interview. 19 Paradoxical Statements That Perfectly Describe Your Life. 26 Reasons The NBA In The '90s Was Awesome. 21 Times Kelly Kapowski Taught Us How To Live. 16 Tricks Women Can Use To Master Public Speaking. 11 Delicious And Sexy Martinis For Winter Nights. 15 Things All Metalheads Will Appreciate. 12 Delightfully Passive Aggressive Comics. 16 Signs You Were An English Major. 19 Songs To Warm You Up On A Chilly Day. 24 Kick-Ass Ways To Cook Homemade Seitan. 14 Urinals You Have To Pee In Before You Die. 17 Fictional Characters Who'd Make Terrible Real-Life Friends Lead The Daily Links. 23 Sexy Actors Who Could Serenade You To Sleep. 10 Most Random Avengers Of All Time. 17 Reasons Why Catdance Is Better Than Sundance. 17 Signs You're Not A Makeup Person. 10 Reasons That Social Skills Are Important In Running A Mercenary Company. 9 Unretouched Photos Of Disney Princesses That Disney Didn't Want You To See. 15 Quintessentially New York City Terms. 10 Signs You're A Total Aquarius. 17 Hilariously Terrible Movies Everyone Should See. 11 Reasons Wonder Woman Is The Real Star Of The Justice League. 19 Signs Your Best Friend Might Be A Serial Killer. 15 Things That Happen When You Fall In Love With A Big Can Of Soup. 2 GIFs Of Justin Bieber's Mugshot Morphing Into Miley Cyrus' Face That Prove They Look Identical. 25 Mouthwatering Facts About Fish And Chips. 32 Celebrities Who Have Been Arrested For DUIs. 13 Young, Secular People Who Also Believe Abortion Is Wrong. 12 Other Crimes Against Humanity That Justin Bieber Has Committed. 19 Things That The New York Times Magazine \"Planet Hillary\" Cover Looks Like. 19 Scientific Reasons Why You Should Take More Naps. 17 Most Shocking Moments From The First 99 Episodes Of \"The Vampire Diaries\". 27 Signs You Are A Shiba Inu. 27 Reasons Perkins Is The Holiest & Most Perfect Of Restaurants. 21 Things No One Tells You About Having A Baby. 14 Jaw-Droppingly Gorgeous Celebrity Portraits. 7 \"Facts\" About The Brain That Are Not True. 31 GIFs So Perfectly Looped That It's Physically Gratifying. 30 Products That Will Save Your Sensitive Skin. 18 Things That Happen When You Move A Lot. 17 Atmospheric Pictures Of The London Underground With No-One Around. 25 Reasons Andy Dwyer From \"Parks & Recreation\" Should Be Your Life Coach. 26 Moments When You Were Too Romantic For Your Own Good. 14 Books Every Food Lover Should Read. 28 Rules To Be The Quintessential Mexican Charro. 23 Essential Snacks Every Super Bowl Party Should Have. 15 U.S. Olympians Posing With A Siberian Husky Puppy Is The Cutest Thing You'll See Today. 23 People Who Aren't Afraid Of A Little Snow. 37 Super Bowl Snacks Better Than Hot Wings. 10 Pieces Of Photographic Evidence That Roger Federer Is Back Kicking Ass And Taking Names. 17 Reasons Betty Who Will Blow Up The Music Scene In 2014. 16 Quotes That Will Make You Want To Cuddle Up With A Book. 34 Reasons Why Lily Allen Is The Queen Of Nail Art. 1 Tiny Dog Face That Will Leave You Breathless And Melt Your Heart Until You're In The Emergency Room Begging God To Spare Your Life. 12 Recipes Everyone Needs For Romance. 9 Video Games Based On Classic Literature. 15 Things That Happen When You Date A Southerner. 23 Things That Would Happen If Knitters Ran The World. 21 Ways To Take Mashed Potatoes To The Next Level. 12 Historic Bars Every Book Nerd Needs To Visit. 28 Problems Only Chicago Drivers Will Understand. 10 Things Only People With Attention Problems Understand. 9 Banned iPhone Apps. 8 Celebrity Tweets You Missed Today. 15 Ways Dr. Mindy Lahiri Has Stepped Up The Fashion Game. 4 Easy Pranks You Can Pull Right Now. 23 Moments When Nick Miller Is Ridiculously Relatable. 22 Times \"The Vampire Diaries\" Had The Answer. 24 Musicians Who Somehow Don't Have Grammy Awards Lead The Daily Links. 35 Unanswered Questions From Jesse And The Ripper’s \"Forever\" Music Video. 13 Ways Lindsay Lohan Is An Instagram Expert. 15 Reasons Logan Echolls Was The Best Part Of \"Veronica Mars\". 19 Things That Are Guaranteed To Ruin Any Date. 23 Things That Suck About Living In A Small Town In Rural America. 11 Comics Every Introvert Will Understand. 17 Brutally Honest Greeting Cards Every Married Couple Needs. 27 Struggles Only Film Students Understand. 27 Stages You Have To Go Through To Find A New Flatmate. 24 Signs You're More Mature Than You Think. 17 Reasons J.K. Rowling Should Seriously Consider Publishing A \"Harry Potter\" Prequel. 23 Delicious Ways To Cook A Pork Shoulder. 21 Corgis Who Will Make You Say \"Dat Ass\". 29 Astounding Soviet Propaganda Images Promoting Racial Equality. 10 Awesome DIY Projects For Bloggers. 30 Things Guys In Their Thirties Are Afraid To Admit. 11 Pairs Of Meggings That Prove That Meggings Should Not Exist. 14 Reasons Sara Bareilles Deserves To Win \"Album Of The Year\". 25 Vegan Recipes For Super Bowl Sunday. 25 Easy Party Dips You Can Make In 20 Minutes. 23 Signs You Work In Sales. 33 Flawless Texts From The Whedonverse. 11 Facts Everyone Should Know About Orca Captivity. 24 Ways To Get Siri To Bring Out Her True Sassiness. 18 Celebrities You Didn't Know Were Really Short. 15 Signs You're Ready To Go Back To College After Winter Break. 14 Rejected 'Lucas Uses Venmo' Ads. 18 Teachers Who Are Real Life Heroes. 18 Cures For The Obesity Epidemic, As Told By Disney's \"Heavyweights\". 20 Kids At This Year's Sundance Film Festival Who Totally Stole The Show. 18 Cartoons From The ‘90s You Probably Forgot Existed. 13 Times We Knew Bennifer Couldn't Last. 21 Clever Tricks To Make Any Wedding So Much Easier. 24 Reasons Why Growing Up In The Countryside Sucks. 18 Novels That Speak Truth To Prejudice. 15 Wonderful Ways To Improve Your Closet. 18 Incredibly Simple Things Any Man Can Do To Look Better. 27 Moments To Remember From The Season Finale Of \"The Following\". 30 Reasons \"Now And Then\" Was A Defining Childhood Movie For Girls. 16 Things Teen Girls Wore In The Winter Of 1996. 10 Weird Superstitions About Death. 23 Ways Your Wedding Could Be Ruined. 9 Feature Stories We're Reading This Week. 33 Insanely Clever Things Your Small Apartment Needs. 15 Iconic People You Had No Idea Were The Same Age. 9 Videos You Can't Miss This Week. 30 Songs You'd Probably Hear In Eric Forman's Basement. 17 Revealing Facts About Shaun White. 14 Everyday Items That Just Can't Take It Anymore. 18 Penguins Falling Over. 17 Things Celebrities Did This Week. 15 Pictures Of Grilled Cheeses That Will Bring Out The Closet Foodie In You. 13 Celebrity #TBT Photos You May Have Missed This Week. 24 Oscar Nominees You Can Watch Online Now. 18 Ways You Know Cleaning Just Isn't For You. 23 Random Juxtapositions That Probably Shouldn't Exist. 21 Desserts That Are Really Excited To See You. 14 Reasons School Is Basically Torture For Left-Handed People. 23 Mind-Blowing Assembly Line GIFs Lead The Daily Links. 13 Things You Can Get For Free Right Now. 9 Reasons Why Everyone In Washington Should Miss Tom Coburn. 18 Awesome Benefits Of Having A Jewish Best Friend. 7 Reasons Women Should Not Give A Flying F*** About Queefing. 50 Gorgeous Wedding Dress Details That Are Utterly To Die For. 21 Amazing Parenting Apps That Will Make Your Life Easier. 21 Chickens Just Doin' Chicken Stuff. 22 Side Effects Of Working A Boring Job. 15 Things Flat-Chested Girls Will Understand. 21 Ways Naming A Baby Will Drive You Crazy. 18 Celebrity Instagrams You Need To See This Week. 23 Oddly Specific Netflix Categories That Only Have One Show You Can Watch. 10 Formative Books Every Young Gay Man Should Read.. 28 Famous People Who Are Good At Something Besides Being Famous. 8 Signs You're Too Old To Be Watching \"Teen Wolf\". 19 Things People Swear They'll Never Do Until They Have Kids. 16 Old-Fashioned Things '80s And '90s Girls Loved. 18 Problems Only Men With Large Members Will Understand. 22 Brilliantly British Board Games. 50 Highly Anticipated Films At The 2014 Sundance Film Festival. 7 Most Exciting Moments From \"The Walking Dead\" Season 4 Trailer. 13 Of The Funniest Things Kids Have Said To Their Teachers. 19 Signs You're As Supreme As Jessica Lange. 10 Signs Your Parents Are Overinvolved In Your Life. 22 Things That Can Easily Ruin Any Man's Day. 15 Inspiring Pieces Of Life Advice From Amy Poehler. 19 Things Only Geminis Understand. 25 Monstrously Huge Novels That Are Totally Worth Your Time Lead The Daily Links. 21 Hilarious And Important Things Zooey Deschanel Has Tweeted. 15 Reasons To Love Brandi From \"The Real Housewives Of Beverly Hills\". 10 Breathtaking Photos Of The Northern Lights, Taken On A Scottish Island. 21 Animals Preparing For The Winter Olympics. 8 Celebrity Tweets You Missed Today. 24 Reasons You Were Obsessed With Women's Figure Skating In The '90s. 19 Reasons Lisa Rinna Is Gravely Underrated On Twitter. 14 Reasons Peyton Manning And Tom Brady Are Exactly The Same Person. 22 Reasons Why Commas Are The Most Important Things In The World. 16 Reasons Why The San Francisco 49ers Are The Most Fearsome Team In The Playoffs. 17 Book-Inspired Accessories You'll Want Immediately. 25 People Who Prove The Thirst Is Truly Real. 8 Things You Learn To Appreciate After Moving Back Home. 12 Reasons Why \"Parenthood\" Is The Realest Show On TV. 10 Awkward Moments When You're Unemployed. 28 Signs You Were A High School Choir Geek. 13 Rad Ideas For A Tattoo-Inspired Wedding. 16 British Chocolates That Will Make You Want To Move To The U.K. Immediately. 10 Embarrassing Early Roles Of Oscar Nominees. 26 Food Swaps To Make You Healthier. 16 Random Jelly Belly Combinations That Totally Work. 39 Dogs Who Will Make You Question Evolution. 25 Foods You Probably Haven't Eaten Since You Were A Kid. 8 Terrifying True Facts About Dentists. 12 Fundamentals Of Writing \"The Other\" (And The Self). 10 Things You Didn't Know About Girl Scout Cookies Lead The Daily Links. 37 People Trying Not To Melt In The Hottest Place On Earth. 29 Things That Can Easily Ruin A Woman's Day. 9 Celebrity Tweets You Missed Today. 10 Movies That Define Pittsburgh. 11 Reasons You Should Love Clowns. 19 Things You Don't Miss After Graduating College. 12 Signs You're Deadpool. 21 Signs Working Out Just Isn't For You. 21 Signs You Were Raised By A Television. 36 White People Who Need To Be Stopped. 10 Revealing Facts About Your Behavior. 30 Awful Things About Riding Public Transportation Every Day. 21 Reasons Target Is A Midwestern Utopia. 29 Confessions From The Gaming Widows Of Whisper. 28 Things That People With Big Boobs Can Simply Never Do. 26 Reasons \"Peep Show\" Is Pretty Much Your Life. 16 Reasons Being Petite Is The Cutest Thing Ever. 11 Reasons Why Migraines Aren’t Regular Headaches. 21 Things That Happen When You Don't Eat Meat. 15 \"Harry Potter\" Deleted Scenes That Will Give You All The Feels. 22 Things You'll Understand If You Were Raised By Two Moms. 25 Struggles Only The Perpetually Weepy Will Understand. 17 Horrifying Middle Class Injuries. 23 Things You Probably Didn't Know About Pokémon. 20 Reasons To Be Legitimately Terrified Of Space. 28 Reasons To Worship Louise Brealey, AKA Molly From \"Sherlock\". 15 Surprising Facts About Birth Control. 9 Dream Castings For \"Frozen: The Musical\". 7 Bands You Should See At 'Big Day Out' That Aren't Headlining. 19 Things That Happen When You Don't Wear Makeup. 11 Reasons Blair Waldorf Is The Baddest Bitch In NYC. 18 Powerful Photos Of The Forgotten Indigenous Soldiers Of World War I. 16 Wedding Gifts You Will Get No Matter What. 26 Lessons You Only Learn In Progressive School. 13 Lessons We Could Learn From Miley Cyrus And Her Mom. 13 Things You Can't Do With A Broken Arm. 38 Pets Who Celebrated \"Dress Your Pet Up Day\" In Style. 19 Inexplicable Moments From Japanese Game Shows. 44 Classic French Meals You Need To Try Before You Die. 8 Celebrity Tweets You Missed Today. 15 Reasons Dating In Your Early Twenties Is Nearly Impossible. 28 Actors Who Started On \"Law & Order\" Lead The Daily Links. 24 Foods You Can Eat After Getting Your Wisdom Teeth Out. 25 Things You Didn't Know About The Movie \"Titanic\". 10 Ramen Foods Even Crazier Than The Ramen Burger. 14 Online Comics Censored In China. 35 Amazing Behind-The-Scenes Photos From The Original \"Star Wars\" Trilogy. 16 Signs You Are At A South Asian Wedding. 19 Questions New Yorkers Ask When Visiting Los Angeles. 25 Reasons Rihanna Is The King Of Instagram Replies. 20 Things You Didn't Know About \"Pulp Fiction\". 13 \"Adventure Time\" Quotes To Get You Through A Rough Day. 30 Reasons Greyhounds Are Gentle Giants And You Should Adopt One. 26 Delightful Pictures Of The London Underground In The '70s And '80s. 15 Majestic Pictures Of Peter Capaldi Owning His New \"Doctor Who\" Role. 20 Things Every Modern Office Should Have In 2014. 60 Things That Defined Your Childhood In India. 8 Sexiest Bachelors Of Congress. 12 Astonishing Facts About Your Body. 8 Reasons To Miss Gray's Papaya In The West Village. 14 Emotions You'll Feel While Job Hunting As Told By \"Mean Girls\". 10 Paleo Cookie Recipes That Will Blow Your Mind. 16 Supposedly Healthy Foods With More Sugar Than A Snickers Bar. 13 Reasons The Ocean Might Never Be The Same. 15 Whimsically Surreal GIFs To Get Lost In. 6 Informative Illustrations Of Poets And Their Homes. 20 Times Your Parents Embarrassed You In High School. 33 \"Clueless\" References You Missed As A Kid. 9 Celebrity Tweets You Missed Today. 10 Ways Sherlock And Sheldon Cooper Are The Exact Same Person. 23 Uniquely Australian Status Updates. 19 Things You Didn't Know About The Movie \"The Birdcage\". 21 Delightful Reasons To Have More Sex. 16 More Little Books For Long Journeys. 15 Ways To Eat More Feta And Be Happier In Life. 7 Struggles Every Pale Person Can Understand. 27 Ways The Capybara Is The Life Of The Party. 10 Comics That Capture The Anxiety Of Graduation. 21 People Who Are Secretly Poetic Geniuses. 19 Things You Miss After Graduating College. 15 Reasons Camels Are Nightmare Creatures From Hell. 22 Things That Are F**king Metal. 5 Helpfully Unhelpful Life Advice. 10 DIY Ways To Brighten Up Winter. 21 Important Lessons Lumpy Space Princess Taught Us About Feminism. 19 Signs You're In A Relationship With Hummus. 38 Excellent Photos From Golden Globe After Parties. 11 Tremendously Geeky Facts About \"Goldeneye\" On The N64. 15 Best Dressed Men At The Golden Globes. 29 Celebrity Instagrams From The Golden Globes That You Need To See. 19 Things From 2004 That Will Make You Feel Old. 26 Tell-Tale Symptoms That Show You're Suffering From Writer's Block. 17 Things You Should Know Before Going To Mars. 117 Buffyverse Characters, Ranked From Worst To Best. 14 Things Celebrities Looked Like At The Golden Globes. 14 Movies In 2014 That Aren't Sequels, Prequels, Reboots, Or Adaptations. 20 Ways To Hold A Golden Globe. 20 Hilarious And Ridiculous Knock-Off Toys. 19 Absolutely Necessary Products For Lazy People. 20 Signs You're Obsessed With Awards Season. 16 Books To Read Before They Hit Theaters This Year. 50 Clever DIY Ways To Organize Your Entire Life. 21 Reasons To Be Thankful For The Godly Gift That Is Zayn Malik. 15 Reasons Coconut Oil Is Your Best Friend. 21 Painfully Honest Cakes For Every Occasion. 23 Movies That Are Turning 20 Years Old In 2014. 11 Terrifyingly Violent Illustrations Of Classic Childhood Characters. 22 Simple Ways To Start Eating Healthier This Year. 19 Things You Probably Didn't Know About \"Pretty Woman\". 12 Ways Fast Food Companies Trick You Into Eating More Junk. 21 Wonderful Behind-The-Scenes Photos Of \"I Love Lucy\". 9 Videos You Can't Miss This Week. 9 Feature Stories We're Reading This Week. 19 Breathtaking Pieces Of SWAG Available At The U.S. Senate Gift Shop. 11 Quotes Said To Sexual Assault Survivors By Their Family Members. 25 Cats Trying To Make It Through Their Twenties. 30 Times You Wanted To Smack The Smug Off The New England Patriots' Faces. 18 Of The Dopest Rhymes From '90s Kid's Commercials. 23 Vintage Video Games You Won't Believe Exist. 10 Weird Facts That Will Make You Question Everything. 10 Facts You Thought Were B.S. But Are Actually True. 6 Mildly Rude Things You Would(n't) Consider Doing On A Bad Day. 19 Basic Life Skills They Should Teach In School. 21 Meals With Tons Of Protein And No Meat. 17 Things That Scare You About Babies Before You Have One. 13 Pieces Of Witchcraft That Are Actually Science. 23 Football Logos Redesigned In The Style Of European Soccer Logos. 16 Monstrosities From The World's Worst Waxwork Museum. 24 Reasons Husbands Can't Be Trusted To Do Anything Right. 3 Exciting Ways To Add Whole Grains To Your Breakfast. 17 Things Only Virgos Know To Be True. 19 Problems Only People With Straight Hair Will Understand. 23 Things The New Person You're Dating Is Hiding. 19 Celebrity Instagrams You Need To See This Week. 15 Crucial Items You Need On Your Wedding Day, According To Pinterest. 18 Things The Cat Of A Twentysomething Is Thinking. 32 Reasons Kate Middleton Is The Most Perfect Human Being Alive. 7 Car Hacks That Will Change Your Life. 40 Movies That Define Los Angeles. 12 Books To Read While Getting Sober. 17 Things Twentysomethings Wish Were True. 7 Sexy Things Guys Do Without Realizing It. 15 Grooming Hacks That Will Make Your Life Easier. 25 Awesomely Illustrated Netflix Envelopes. 15 Reasons January Is Actually The Best Month Of The Year. 29 Signs You've Studied Abroad In Barcelona. 17 Things You're Tired Of Hearing If You're An Only Child. 18 Whisper App Confessions That Are A Window To The Soul. 24 Things You Wish You Could Put On Your Resumé. 25 Awesome Demolition GIFs. 23 Of The Weirdest Songs On Soundcloud. 27 Signs We Are All Tina Belcher From \"Bob's Burgers\". 10 \"Girls\" Parodies Worth Watching. 7 Problems Women Have With India's First Gun For Women. 25 Things You Didn't Know About The Movie \"Fight Club\". 28 Reasons Clair Huxtable Is Perfection Embodied. 5 Reasons Beer Pong Is Stupid, According To Charles Barkley. 16 Brutally Honest Greeting Cards Every Twentysomething Needs. 11 Downton Abbey Crafts Fit For A Castle. 28 People Who Revealed Their Greatest Insecurities In A Powerful Photography Project. 33 Reasons To Love The Cats Of The Middle East. 15 Signs You Go To A \"Ring By Spring\" School. 24 Expensive Things That Aren't Worth The Money. 23 Movie Moments That Scarred You For Life As A Child. 6 Ways Cats Show Their Appreciation For You. 14 Of The Most Baffling Journalist Requests Ever. 24 Ways You Might Be A Hoarder. 14 Things You Didn't Even Realize You Stopped Doing. 20 Signs You're Obsessed With Your Cat. 19 Perfect Minimalist Rap Posters. 20 Things You Probably Didn't Know About The Wizarding World Of Harry Potter. 25 Beautiful Quotes About Snow. 22 Reasons You Should Never Step Into An MMA Ring. 8 Times 'A Current Affair' Changed The Way We Look At The World. 24 Early Britney Outfits You Can't Unsee. 27 Baby Animals That Will Instantly Make Your Day Better. 12 Wickedly Beautiful Perfume Bottles Inspired By Iconic Disney Villains. 21 Signs You Are In \"Scandal\" Withdrawal. 20 Things You Should Probably Have Stopped Doing By Now. 38 Of The Most Hilarious Fast Food Sign Fails Lead The Daily Links. 2016 GOP Contenders And Their Biggest Scandals To Date. 16 Works That Ernest Hemingway Thought A Young Writer Should Read. 23 Reasons You Wish Danny Castellano Were Your Boyfriend. 27 Signs You Suffer From Shy Girl Syndrome. 19 Reasons Why Being A Knicks Fan Is Worse Than Being Eaten Alive By Werewolves. 38 Reasons The FBI Needs To Leave Juggalos Alone. 18 Reasons You Should Switch To The Menstrual Cup. 39 Times Neal Caffrey Was The Sexiest Man On TV. 23 Animals Who Are Completely Over Their New Years Resolutions. 20 Things Germaphobes Are Terrified Of. 21 Truly Upsetting Vintage Recipes. 9 TV Shows You Can Stream Only On Amazon Prime. 21 Things You Should Throw Away Right Now. 22 Awesome Things About Being 22. 27 Reasons Cauliflower Deserves Your Love And Loyalty. 19 Lingering Questions From Archie Comics. 42 Ways To Up Your Pancake Game. 20 Steps To Living Your Life Like Lily Tomlin. 19 Reasons Living Alone Is The Best. 26 Things That Happen When Your Significant Other Is Out Of Town. 23 Things You Missed At The People's Choice Awards. 18 Ways Juicing Is Taking Over Your Life. 21 Dogs Perfecting The Art Of Air Swimming. 18 Surefire Signs You Are A Psychology Major. 12 Vintage Photos Of NYC In Winter That Will Warm Your Heart. 9 Ways To Protect Yourself In The Event Of Alien Abduction. 6 Awesome Songs That Make 6 New Movies Better. 16 Vietnamese Restaurants Obsessed With Puns. 28 Things You're Only Afraid Of If You Live In Chicago. 25 Things You'll Experience Working A Ski Season. 15 Photos That Prove Ja'mie King Can Do Anything. 26 Things You Need To Do Before You Graduate High School. 9 Surprising Facts About eBay. 18 Body Positive Style Bloggers You Should Be Following. 18 Ways To Get Involved At Your Kid’s School. 22 Reasons Rachel From \"Friends\" Would Make An Awesome BFF. 18 Ways To Make The Best Of Your Twenties. 47 Signs You'll Only See In Australia. 13 Steps Of Conflict Resolution With Bravo's Biggest Divas. 10 Things Orlando Jones Would Give You If He Were Oprah. 29 Delicious Whole Wheat Pasta Dishes. 20 Californians Throwing The Good Weather In Everyone Else's Face. 35 Foods From Your Childhood That Are Extinct Now. 7 Reasons Why Tim Tebow Is Actually A Great Fit For ESPN. 24 Crazy Things That Have Already Happened This Year In Florida. 13 Lies You Believe Until You Examine Your Finances. 12 Ways You'll Actually Enjoy Eating More Greens In 2014. 11 Highly Accurate Comics About Smartphones. 33 Things You Probably Didn't Know About Disney Parks. 13 Images Showing What Life Is Like For Gay And Lesbian Russians. 21 Cats Who Are Secretly Excellent Readers. 12 Life Lessons We Can Learn From Dolphins. 18 Things (And 3 Penises) You Can Draw While Running. 7 Movie Posters Improved By One-Star Amazon Reviews. 7 Movies That Should Have Starred Orlando Jones. 11 Things I Learnt At My First Voga (That's Yoga + Voguing) Class. 18 Questions I Asked Myself When I Watched \"The Simpsons\" For The First Time. 28 Fruits And Vegetables That You Had No Idea Grew Like That. 22 Things From 1994 That Will Make You Feel Old. 28 Ways We Can All Be More Like Ja'mie King. 38 Things To Drink Instead Of Booze. 26 Hilarious French Translations Of Hollywood Movie Titles. 9 Special Collectibles From Disgraced Companies You Can Buy On eBay. 10 Movies To Get You Hooked On Something Weird Video. 21 Things That Made You Anxious As Hell When You Were A Kid. 16 Things Russians Do That Americans Might Find Weird. 14 Celebrities Who Don't Necessarily Want Kids. 8 Jaw-Dropping Pictures Of The Polar Vortex. 19 Unforgettable Moments From The Ultimate Karl Stefanovic Fan Fiction. 20 Things College Freshmen Struggle With. 20 Things That Are Colder Than You Right Now. 8 Celebrity Tweets You Missed Today. 15 Australian Sports Stars That Look Like Shar Pei. 25 Times Anna Kendrick Was Painfully Accurate. 25 Best Things That Could Possibly Happen To Someone From Los Angeles. 18 People Who Became Sudden Geniuses While High. 23 Symptoms Of Study Abroad Withdrawal. 21 Google Book Scans That Bring Surprising Intimacy To The Digital Book World. 20 Videos Of Bubbles Crystalizing In Freezing Temperatures. 13 Returning TV Shows To Get Excited About. 21 Of The Most Los Angeles Books Ever. 14 LGBT Films That Need To Be Added To Netflix Instant Streaming Right Now. 50 Reasons Why Nicolas Cage Is The Greatest Creature Who Has Ever Lived. 17 Signs Winter Is Killing You Softly. 16 White Men That Could, In Fact, Jump. 7 Google Secrets You Need To See. 16 Little Books To Read On Long Journeys. 15 Reasons Arizona Should Take Steven Seagal Seriously As A Candidate For Governor. 15 Things That Really Deserve The Name \"Polar Vortex\". 31 Things To Warm Your Heart On This Cold Day. 27 Unspoken Suit Rules Every Man Should Know. 17 Nicolas Cage-Inspired Items You Deserve To Own. 27 Everyday Situations That Are Excruciatingly Difficult For Shy People. 17 Steps To Having A Perfect Textual Relationship. 24 Signs You Were A Teenage Boyzone Obsessive. 11 Bulletproof Ways To Get Through Diet Season. 9 Brilliant Video Game Inventions You Wish Existed In Real Life. 5 Ways To Survive A Panic Attack. 12 Unsettling Retro Ads Featuring Kids. 14 People Stuck In Really Stupid Places. 19 Problems Only People Who Don't Eat Cheese Will Understand. 5 Fad Diets To Avoid This January. 19 Most Bizarre Moments From \"Secrets Of The Living Dolls\". 15 Reasons College Football's Championship Game Should Always Be Played At The Rose Bowl. 18 Signs You're The Youngest Person In The Office. 31 GIFs Of Hot Guys Cuddling Puppies To Make You Smile. 21 Pick-Up Lines That Would Totally Work On You. 17 Things You Swore You'd Never Say When You Had Kids. 17 Magical Lifehacks To Learn From Disney Movies. 11 Great Bookstore Names And How They Got Them. 27 Overwhelming Feelings Every College Senior Has In The Spring. 12 Worst Types Of Kisses. 8 Celebrity Tweets You Missed Today. 29 Actors That Prove Everything Is Hotter Down Under. 19 Hilarious Pictures Of People Posing On Splash Mountain. 32 Signs You're Graduating In May. 19 Things Pop Culture Addicts Know To Be True. 27 Crucial Wardrobe Items You'll Need To Start Your Very Own Boy Band. 25 Things That Happen When You're 25. 29 Signs You're A Warhammer Player. 16 Problems Only Invisible People Will Understand. 5 Kids Movie Pranks That Went Way Too Far Lead The Daily Links. 14 Alternate \"Catcher In The Rye\" Covers. 8 Reasons This Was Actually The Best Cable News Network That Ever Existed. 47 Famous People Who Went To Catholic School. 36 Photos Of Norman Reedus That Will Give You A Zombie Boner. 18 Things To Look Forward To In 2014. 20 Beautifully Illustrated Quotes From Your Favorite Authors. 13 Times You Have Been Exactly Like Ichabod Crane. 27 Signs You're In Love With The Beach. 18 Reasons Why You Want Marshall Eriksen From \"How I Met Your Mother\" To Be Your Best Friend. 16 Examples Of Disney Nail Art That Will Render You Speechless. 26 Reasons K-Pop Is Better Than American Pop. 27 Things That Happen On Every Episode Of \"Four Weddings\". 8 Scientific Reasons Why Having A Female Boss Is The Best. 20 Reasons A Twentysomething Would Never Survive \"The Hunger Games\". 14 Fierce Contributions Miranda Priestly Has Made To GIF Culture. 17 Surprising Pictures Of A Young Russell Brand. 16 Fails That Will Make You Glad It's Finally A New Year. 13 Problems Only Uncoordinated People Understand. 10 DIY Tips For Keeping Your New Year's Resolutions. 31 Signs You're A Florida State Seminole. 29 Unexpectedly Awesome Things About Being Pregnant. 34 American Lady Scientists Who Changed The World. 18 Reasons To Love Literary Dublin. 34 Ingenious Ways To De-Clutter Your Entire Life. 21 Little Lifestyle Changes That Will Help You Get Healthier. 21 Jerk Moves Other Parents Make. 17 Warm And Cozy Breads To Bake When It's Cold Outside. 19 Pups Who Know How A Snow Day Is Done. 29 Problems Only Procrastinators Understand. 19 Mind-Blowing Tricks Every iPhone And iPad User Should Know. 25 Things Nobody Tells You About Your First Apartment. 23 Animals Who Are Tired Of This Snow Day Already. 12 Surprising Facts About Netflix. 66 New Movies And TV Shows To Be Really Excited About In 2014. 15 Amazing Ways To Spike Hot Chocolate. 29 Photos Of The Cast Of \"Downton Abbey\" Being Totally Un-Downton-Like. 36 Albums That Turn 20 In 2014. 29 Awesome Things About Being 29. 15 People Who Are Way Worse At Interior Decorating Than You. 17 Insanely Helpful Workout Tips For Beginners. 31 Insanely Beautiful Colleges You Can Get Married At. 33 Songs That Will Turn 10 In 2014. 22 Of The Best Extreme Selfies. 12 Rolling Stone Covers That Immortalized 2004 In Pop Culture. 9 Videos You Can't Miss This Week. 22 Things Only SoulCycle Fans Will Understand. 19 Animals Who Can't Believe Their Eyes Right Now. 9 Feature Stories We're Reading This Week. 23 Photos That Prove Hairless Cats Are Actually Adorable. 22 Masterfully Sculpted Heinies. 42 Bear GIFs That Will Give You Life In 2014. 21 Things That Inevitably Happen When You Work In An Office. 29 Healthy Versions Of Your Favorite Comfort Foods. 20 Sigur Rós Songs To Celebrate 20 Years Of Sigur Rós. 11 Surprising Facts About Creativity. 22 Signs You Were An International School Kid. 17 Names That Are Impossible For Babies To Have. 7 Questions MTV's \"Girl Code\" Had About Lesbians. 12 Outdated Items Every Twentysomething Should Own. 23 Photos That Prove New England Is The Ultimate Winter Wonderland. 23 Animals Really Enjoying Colorado's New Marijuana Law. 16 Awesome Instagram Accounts From Deep In The Heart Of Texas. 17 New Year's Resolutions Every Homebody Should Make. 36 Things That Are Going To Make You Feel Ancient. 5 Disney Films That Have The Most Drinking. 22 Artists Who NEED To Put Out A New Album In 2014. 31 Insanely Clever Remodeling Ideas For Your New Home. 23 Reasons Zoe Hart And Wade Need To Get Back Together. 24 Signs You're Addicted To Beauty Products. 36 Genius Ways To Hide The Eyesores In Your Home. 19 Conversation Tips For The Awkward. 22 Signs You've Grown Too Comfortable With Your Internet Addiction. 19 Reasons Rapunzel And Flynn Rider Are The Best Disney Couple. 13 Times Jazz Got Thrown Out On \"The Fresh Prince Of Bel Air\". 39 Reasons To Be Happy Every Day For 100 Days. 16 Reasons You Should Be Rooting For The Seattle Seahawks To Win The Super Bowl. 18 Celebrity Instagrams You Need To See This Week. 19 Signs You Are Really Impatient. 25 Photos Of James Marsden That Will Help You Get Through This Blizzard. 24 Next Level Bonkers Science GIFs. 27 Geektastic Keychains For All Your Favorite Fandoms. 19 Things That Happen When You Get Drunk For The First Time. 20 Bold, Insane Sports Predictions For 2014. 21 Times \"Community\" Got Its Groove Back. 18 Things Celebrities Did This Week. 24 Invaluable Skills To Learn For Free Online This Year. 22 Powerful Images By Dreamers: A Window Into Life As An Undocumented Immigrant In America. 16 Creative Ways To Work Out If You Live In NYC. 15 Helpful Charts Every New Yorker Needs. 31 Healthy And Delicious Ways To Cook With Chia Seeds. 17 Things To Look Forward To Now That The Holidays Are Over. 16 Reasons You Wish You Could Watch Tom Daley's \"Splash!\". 25 Universal Horrors Of Hair Removal. 15 Photos Of The East Coast Snowstorm That Will Make You Forget It Was Actually Terrible. 17 Struggles Of Having A Common Name. 19 Perks Of Having An Artsy Best Friend. 29 Cozy And Delicious Things To Make On A Snowy Weekend. 28 Beautiful Quotes About Libraries. 23 DIY Projects Inspired By Snow. 15 Wonderful New Netflix Additions To Watch When You're Stuck Inside. 15 Times French President Francois Hollande Messed Up A Handshake. 18 Gorgeous Time Lapse Videos From Across The Globe. 8 Celebrity Tweets You Missed Today. 11 Natural Geological Formations That Are Absolutely Too Weird To Be Real. 13 Things Scott Disick Could Teach Us About Self-Confidence. 8 Incredible Snowmen You Wish Were In Your Yard Lead The Daily Links. 6 Comics About Difficult Truths. 24 Signs Dating Isn't For You. 28 Pictures Of Your New Favorite Instagram Duo. 19 Grievances That Only People Who Work In Retail Will Understand. 13 Episodes Of \"Community\" To Watch Before The End Of The Day. 15 Stages Of Finding Out You Are Gluten Intolerant. 28 Things Only A Mother Can Do. 9 Reasons You Are Already Breaking Your New Year's Resolution. 33 Instagrams Of Musicians Ringing In 2014. 29 Breathtaking Photos From Hockey's Snowtastic Winter Classic. 27 Clever New Ways To Use Your Kitchen Appliances. 18 Of The Worst Photoshop Fails. 6 Alan Partridge TV Shows That Ought To Exist By Now. 17 Reasons Why Cheese And Alcohol Are The Best Couple Of All Time. 16 Books To Read If You Love San Francisco. 14 Quotes To Inspire Your New Year's Resolutions For 2014. 10 Twitter Gems From Neil Gaiman Before His Sabbatical. 17 Facts About E-Cigarettes That Might Surprise You. 17 Strange And Creepy Vintage New Years Cards. 37 Times In 2013 Benedict Cumberbatch Proved He Was King Of The Internet. 23 Animals Who Understand Exactly How You Feel Today. 35 Movies That Are Turning 10 Years Old In 2014. 25 Secrets About “Downton Abbey” Season 4. 4 Steps To Get A Better Butt. 21 Parenting Resolutions For The New Year. 18 Dance Moves We Learned In 2013. 31 Delicious Things To Cook In January. 33 Next-Level Tips For A Bloody Mary Bar. 17 Signs You're A Board Game Bully. 12 Things You Probably Didn't Know About New Year's Eve In Times Square. 20 Thoughts That Go Through Your Mind On A Shopping Day. 14 Ways Cheese Will Destroy Your New Year's Resolutions This Year. 29 Reasons We Fell In Love With Tom Hiddleston In 2013. 23 Signs You Love Latin Food. 30 Years Of New Years In Two Minutes. 59 Famous People Who Are Left-Handed. 14 Reasons Why Airline Companies Need To Delete Their Twitter Accounts Immediately. 13 Works Of Nonfiction And Memoir That We Loved In 2013. 13 Sumptuous Quotes About Falling In Love From Famous Authors. 19 Reasons To Watch \"Can't Hardly Wait\" With Ethan Embry Tonight. 21 Animals Who Will Definitely Not Stay Up Until Midnight. 15 Revolting Hangover Cures From History. 40 Astonishing Photos That Won Awards In 2013. 13 Creative And Clever Adverts From 2013. 11 Magical Photos Of Edinburgh Preparing For New Year's Eve. 21 Fun Ways To Have A Fancy And Delicious New Year's Eve. 15 TV Show Marathons To Watch Over New Year's. 14 Things That Have Already Happened In 2014. 21 Indispensable Life Lessons From \"Queer Eye For The Straight Guy\". 26 Outraged Reactions To The Cancellation Of The NYE Festival. 11 Rooftop Bars For The Perfect Midnight Rendezvous Abroad. 10 Simple DIY Ways To Get Organized In 2014. 19 Things All Children Of Deaf Adults Are Tired Of Hearing. 20 Scrumptious Asian Inspired Cocktails To Ring In The New Year With. 19 Ways To Tell If You Are A Germaphobe. 25 Truths About Living In NYC, As Told By Don Draper. 33 Reasons Miley Cyrus Was Actually The Best Thing To Happen To 2013. 21 Appropriately Dark And Subversive Tweets From #BuzzFeedEgypt. 15 Delicious Book Covers Inspired By #CandyLit. 13 Life Lessons To Learn From Bo Burnham's Latest Comedy Special. 23 People Who Have Life Figured Out. 17 People You'll Run Into On New Year's Eve. 8 New Year's Resolutions Hollywood Should Make For 2014. 21 Interesting Things That Al-Qaeda Spent Money On. 10 NFL Head Coaches Who Had A Rough 2013. 13 Times Ellen DeGeneres Won At Photoshop In 2013. 12 Healthy New Year's Resolutions You Could Actually Stick To. 31 Tips To Make Sure You Enjoy Your Wedding Day. 27 Cats Who Completely Forgot About Their New Years Resolutions In 2013. 27 Incredible Examples Of Lunch Paper Bag Art. 14 Beauty Resolutions That Are Actually Worth Keeping In 2014. 45 Moments That Reminded Us How Much We Love Ellen DeGeneres In 2013. 11 Things You Need To Know About Auld Lang Syne. 13 Ways DIY Science Triumphed In 2013. 26 Things That Defined Music In 2013. 16 Instagram Accounts That Will Make You Want To Grow A Beard And Move To The Pacific Northwest. 17 Relationship Tips We Can All Learn From \"House Hunters\". 14 Things That Happen On Every Conference Call. 13 Reasons Why Not Fitting In As A Kid Makes You An Awesome Adult. 20 Signs You're Home For Winter Break. 17 Of The Most Unforgettable Cover Versions Of 2013. 13 Companies That Did Social Media Right This Year. 23 Signs You Should Just Hibernate For The Rest Of The Winter. 15 Important Tips For Having The Healthiest Nails Ever. 20 Times That Art And Design Inspired Awe In 2013. 5 Unbelievable Images Of A Volcano Erupting In El Salvador. 20 Post-Holiday Mall Moments That Will Test Your Will To Live. 23 Ways To Up Your Makeup Game For New Year's Eve. 7 Things We Wish Dad Would Stop Doing. 50 Best BuzzFeed Posts From Community Members In 2013. 21 Ways To Make This New Year's Eve So Much Better. 19 Times Expectations Didn't Match Reality In 2013. 52 Hilarious And Spot-On Tweets From #BuzzFeedPakistan. 32 Photos That Prove The Rock Turned Into An Actual Super Human In 2013. 18 Resolutions To Help You Have A Better 2014. 17 Signs You're Gunther From \"Friends\". 16 New Year's Resolutions You Make And Break Every Year. 16 Reasons Why We Love Stan Lee. 35 Vines From 2013 That You Watched Over And Over Again. 27 People Harry Styles Dated This Year. 22 Of The Most Heart-Melting Love Songs From 2013. 27 Times In 2013 Neil Patrick Harris' Family Was Cuter Than Yours. 23 Times Miranda Proved She Was The Most Empowering Character On \"Sex And The City\". 15 Cartoons From The ‘80s You Probably Forgot Existed. 21 Reasons Why Andrew Garfield And Emma Stone Were The Cutest Couple Of 2013. 27 Times Kate Middleton Proved She Was The Most Flawless Human Of 2013. 17 Reasons To Bring Back \"The L Word\" And 5 Reasons To Just Let It Go. 28 Important New Year's Resolutions Every Twentysomething Should Make. 22 Cult Beauty Products From Asia You Didn't Know Existed. 31 Biggest Dog Fails Of 2013. 31 Delicious Low-Carb Breakfasts For A Healthy New Year. 12 Objects That Defined The Year In Television. 26 Resolutions To Keep You Organized In 2014. 3 Recipes For A Delicious, Meat-Free New Year's Celebration. 23 Problems Only Parents Will Understand. 28 Clever Products You Need To Get In Shape For 2014. 12 Important Things No One Teaches You When Learning A Language. 14 \"Healthy\" Foods You've Been Lied To About. 6 Perfect Sentences. 19 Fascinating Facts About \"The Exorcist\". 10 Problems Only Short Girls Understand. 17 Celebrity Instagrams You Need To See This Week. 23 Resolutions That Are On Every Twentysomething Girl's List. 17 Heartwarming Photos Of Soldiers In Afghanistan Celebrating Christmas. 13 Things Celebrities Did This Week. 15 Reasons Philip Rivers Is Undoubtedly A Child Trapped In A Man's Body. 34 Characters We Loved In Film And TV In 2013. 24 Theses Summarized In One Sentence Each. 24 Signs You Grew Up In Suburbia. 12 Ridiculous Moments From Pussy Riot's First TV Interview. 23 Instagrams To Follow To Travel The World In 2014. 19 Things That You'll Never See The Same Way Again. 14 Reasons 2013 Was A Bad Year For Jose Canseco's Goats. 10 Midwest Cities You Should Visit. 10 Celebrity Mascots For Popular Travel Destinations. 10 Signs You Studied Abroad In Australia. 7 Of The Best Airports To Be Stuck In. 22 Ways To Keep Your Kids Happy When It's Cold And Icky Outside. 14 Animals Who Melted Our Hearts In 2013. 21 People Who Got Creative With Their Gift Wrapping. 20 Songs From Around The World That You Might Have Missed In 2013. 15 Women Who Made Vine Hilarious In 2013. 10 Signs You're A Total Capricorn. 16 Celebrity Couples We Lost In 2013. 25 Times '90s Teen Heartthrobs Photos Failed. 14 Reactions Only Brownie Enthusiasts Would Understand. 7 Times TV Made Me Cry In 2013. 31 Hedgehogs Who Had A More Miserable Christmas Than You. 15 Reasons You're Feeling Extra Single This Holiday Season. 9 Celebrity Tweets You Missed Today. 15 Snowmen That Are In Dire Need Of A Makeover. 21 Cats Celebrating Boxing Day. 17 Red Lobster Recipes In Case The Seafood Chain Goes Away Forever. 23 Reasons Harris Teeter Is A Veritable Grocery Store Paradise. 22 Christmas Instagrams From Musicians. 13 Citrus Recipes To Brighten Up Your New Year. 23 Sordid Tales From The Sex Lives Of Some Of Your Favorite Gay Authors And Artists. 14 Books From 2013 Every Music Lover Should Read. 17 People Who Got Weed For Christmas. 16 Things You Only Notice Between Boxing Day And New Year's Eve. 22 Of The Coolest Places To Get Married In America. 51 Reasons 2013 Was The Best Year Ever To Be A Nerd. 37 WTF Moments From The \"Full House\" Christmas Episode. 13 Reasons Why Australia Won Christmas Day 2013. 16 Artists You Didn't Know Had An Album Out This Year. 20 Unbelievable Gingerbread Houses You'll Want To Live In. 28 People Who Got A Gun For Christmas This Year. 17 Reasons People Who Don’t Celebrate Christmas Are Having The Best Day Ever. 17 Of The Biggest Dick Moves At Christmas. 31 Reasons You'll Miss Matt Smith On \"Doctor Who\". 17 Questions Jews Are Tired Of Being Asked About Christmas. 18 WTF Vintage Christmas Cards. 30 Jewish Movies To Watch On Christmas. 9 Christmas Ornaments That Will Destroy Your Holiday Spirit. 16 Hits From 2013 You Wish You Could Never Hear Again. 13 Unusual Christmas Traditions To Steal For Yourself. 33 Ways To Fill Your Life With Streusel. 17 Moody Cats Dressed Up As Santa. 10 Hilarious Kitchen Tips From Terrible Cooks. 8 Lessons We Learned On Vine In 2013. 12 Commercials Guaranteed To Make You Cry. 15 Reasons 2013 Was A New Golden Age For Punk. 17 Dogs All Cozy In Their Christmas Pajamas. 30 Feel-Good Movies To Get You Through The Holiday Blues. 8 Celebrity Tweets You Missed Today. 16 Ways Being Home For The Holiday Turns You Into A Child. 30 Videos That Will Make You A Fan Of The Graham Norton Show. 11 Celebs Who Think \"Mandela\" Is Going To Be \"Amazing\" And Want You To Buy Tickets. 15 Ways You've Been Shampooing Your Hair Wrong. 13 Absolutely Last-Minute Christmas Gifts. 15 Things You Might Not Know About Christmas Music. 55 Incredible Images Of The World Celebrating Christmas. 31 Excellent Records You Might Have Missed In 2013. 15 Old-Timey Candies You Never Knew Existed. 15 Obscure Christmas Songs That You Need To Hear. 21 Reasons Blue Ivy Carter Was Infinitely Cooler Than Everyone Else In 2013. 45 Moving Moments From The First Days Of Marriage Equality In Utah. 23 Signs You're Obsessed With Christmas. 18 Extremely Awkward Celebrity Christmas Photoshoots. 19 Whovians Whose Christmas Game Is Too Strong. 12 Sad Christmas Stories for Holiday Wallowing. 17 Animals Who Look More Fab In Their Christmas Sweaters Than You Ever Will. 20 Signs You Are A Cartoon Villain. 21 Things You Should Never Say To Asians. 5 Questions About Garth Brooks' Christmas Album Cover. 16 Cats Who Care Even Less Than You Do. 9 Celebrity Tweets You Missed Today. 17 Magical Christmas Characters Of Congress. 15 Movie Marathons To Watch On TV This Christmas. 13 Great Geeky Christmas Specials To Watch While You Are Waiting For Santa. 30 Ways Interns Are Just Like Minions. 25 Moments Of Pride In 2013. 9 Facts About Reindeer That Will Blow Your Mind. 21 Universal Problems Of Spending The Holidays With Your Family. 30 Delicious Indonesian Dishes You Need To Try. 37 Delicious Things To Make For A Holiday Brunch. 20 Reasons We Still Love \"How to Lose a Guy in 10 Days\". 18 Captivating Photos By The Mysterious Nanny-Photographer Of The Mid-Century. 21 Signs You Suck At Math. 15 Questionable Christmas Album Covers. 17 Important Things Science Taught Us In 2013. 11 Excellent Moments From \"Morning Joe's\" Christmas-Themed Pajama Party Episode. 21 Dogs Who Just Realized Mall Santa Is Huge A Phony. 19 Last-Minute Christmas Presents You Can Only Buy From The Government. 23 Santas Who Forgot How To Santa. 35 Celebrities As Classic Paintings. 10 Cool Things NASA Did In 2013. 23 Dogs Who Are As Excited For Christmas As You Are. 10 Ways Wall Street Is Just Like \"Sesame Street\". 50 Adorable Reasons That 2013 Was The Year Of The French Bulldog. 15 Unexpected Products That Could Magically Cure Your Body Emergencies. 27 Shocking And Unexpected Facts You Learn In Your Twenties. 29 Heavenly Christmas Foods From Around The World. 21 Things For People Who Are Sick Of Christmas. 23 Real Struggles That Anyone With Jet Lag Will Understand. 9 Longform Stories We're Reading This Week. 17 Epic Business Fails To Avoid In 2014. 10 Party Moments Only Sober People Understand. 9 Videos You Can't Miss This Week. 21 Insanely Helpful New Ways To Use Your Hair Conditioner. 31 Perfect People You Wanted To Date In 2013. 33 Festive And Beautiful Foods To Make For Christmas. 33 Real Lines From \"Supernatural\" That You Can't Believe Aired On TV. 12 Surprising Facts About Google. 15 Things Celebrities Did This Week. 23 Of The Most Painfully Awkward Lyrics From 2013. 6 Maps That Show How The United States Has Changed Since 1990. 17 Hilariously Tragic Holiday Baking Fails. 38 Clever Christmas Hacks That Will Make Your Life Easier. 11 Charitable Ways To Get Rid Of Things You Don't Want. 33 Super-Fancy Ways To Eat More Nutella. 15 Signs You're Ready To Start Your Vacation. 32 Reasons Why Christmas Was Better In The '90s. 14 Political Prisoners Spending The Holidays In Jail. 31 Awesome ’90s Toys You Never Got, But Can Totally Buy Today. 26 Beauty Products Only A Genius Could Have Invented. 12 Retro Christmas Ads To Remind You That A Woman's Place Is In The Home. 12 Reasons Yukon Cornelius Is The Most Badass Christmas Character Of All Time. 10 Types Of People You Just Can't Deal With While Traveling. 17 Celebrity Instagrams You Need To See This Week. 15 Christmas Stock Photos That Will Haunt Your Dreams. 15 Questions \"White Christmas\" Left Unanswered. 7 Music Stars Who Have Performed For Dictators Lead The Daily Links. 21 Joys Of Having A Work BFF. 5 Hoaxes You Fell For In 2013. 26 Reasons Country Music Was Great In 2013. 35 Reasons \"The Onion\" Won 2013. 20 Photos Proving That Zimbabwe Is A Gorgeous Place To Get Married. 20 Recipes That Won Pinterest In 2013. 33 Times Joseph Gordon-Levitt Charmed Your Pants Off In 2013. 23 Next-Level Ways To Make Baked Brie. 36 Legendary Oprah-Grams From 2013. 28 Delicious Vegan Holiday Recipes. 41 Cats Who Had A Worse Year Than You. 17 Books We Loved In 2013. 9 Things Will Graham Is Thinking In The Season 2 \"Hannibal\" Poster. 15 Signs You're A Last-Minute Shopper. 30 Last-Minute Amazon Prime Gifts For Everyone In Your Life. 33 Animal GIFs That Are Guaranteed To Make You Laugh. 13 Things That Can Go Wrong At Work Christmas Parties. 27 Reasons Singapore Is The Most Delicious Place On Earth. 50 Times Beyoncé Ran The World In 2013. 21 Things That New Yorkers Waited For In 2013. 13 Magical Vintage Photos Of Paris At Christmastime. 23 Years Of Awesomely Geeky Lucasfilm Christmas Cards. 29 Things You Learn At Your First Real Job. 18 Important Things We Learned Through Awkward Facebook Posts. 21 Of The Strangest And Most Unique Buildings From Around The World. 21 Signs That Tumblr Is Slowly Ruining Your Life. 9 Sticky Buns & Cinnamon Rolls To Make Christmas Morning Delicious. 14 Emotional Stages Of Sending A Snapchat To Friends. 10 Ingredients All Vegans Should Know About. 15 Questions About *NSYNC's \"Merry Christmas, Happy Holidays\" Video. 17 Christmas Gifts You Could Buy Each American With The Mega Millions Jackpot. 15 People You'll Encounter At The Airport That Will Make You Want To Cancel Your Trip. 35 Spectacular Photos That Highlight The Importance Of Saving The Great Barrier Reef. 27 Times Richard Simmons Was Fabulous In 2013. 21 Times Drake Made New Friends In 2013. 15 French Fast Foods That Shouldn't Look As Good As They Do. 21 Ways You Know You're A Bogan. 17 Ways Jiff The Pomeranian Celebrated The Holidays. 21 Times Drita On \"Mob Wives\" Was The Biggest Badass To Walk The Earth. 33 GIFs From 2013 That Will Make You Laugh Every Time. 12 Celebrities Whose Homophobia We Really Didn't Have Time For In 2013. 21 Incredible Altered \"Magic: The Gathering\" Cards. 16 Ways Building A Startup Is Just Like Dating. 13 Magnificent Metal Records That Ruled 2013. 30 Times Harry Styles Was The Most Perfect Member Of One Direction In 2013. 51 Times In 2013 Jennifer Lawrence Proved She Was Master Of The Universe. 21 Gifts Every Thirtysomething REALLY Wants. 30 Times Zayn Malik Was The Most Perfect Member Of One Direction In 2013. 15 Easy Ways To Start Working Out Before The New Year. 30 Times Niall Horan Was The Most Perfect Member Of One Direction In 2013. 25 Cats That Could Be Having A Better Day. 30 Times Liam Payne Was The Most Perfect Member Of One Direction In 2013. 21 Impossibly Difficult Situations For An Indecisive Person. 30 Times Louis Tomlinson Was The Most Perfect Member Of One Direction In 2013. 32 People Who Absolutely Nailed It In 2013. 27 Dogs Who Woke Up Like This. 15 Reasons Every Single American Should Be Rooting For The Portland Trail Blazers. 10 Countries With The Most Imprisoned Journalists. 16 Important Moments From One Direction's \"This Is Us\" Extra Footage. 3 Comics That Understand Your Worries About Christmas. 16 Other Songs To Listen To If You Love The New Beyoncé Album. 21 Signs You Were Raised By A Nurse. 16 Times The World's Craziest Scientist Won At Instagram. 21 Reasons Buying Gifts For The Holidays Is The Worst. 29 Books To Get You Through Your Quarter-Life Crisis. 12 Brazilian Songs From 2013 That You Need To Hear. 25 Signs You're In A Romantic Relationship With Your Sandwich. 15 Children's Books Re-Envisioned For College Students. 23 Outrageously Delicious Cookies To Bake Right Now. 9 Celebrity Tweets You Missed Today. 30 Unexpected Things You Learn In Your Thirties. 53 Pet Adoption Stories That Will Warm Your Heart. 19 Reasons Why \"The Voice\" Was The Best Reality Show Of 2013. 26 Peeves Gym Junkies Know Too Well. 32 College Basketball Players And Coaches Try To Draw Their School's Mascot. 31 Cats Who Overdid It On The Eggnog. 22 Reasons Why Having A Quiet New Year's Eve Is Secretly The Best. 21 Donuts That Were Flawless In 2013. 24 Pictures Of The Olympic Flame's Trip Around, Over, And Under Russia. 18 People Complaining About L.A. Weather. 20 Of The Best Children’s Books Of 2013. 9 Beautiful Handmade Christmas Cards Sent By WW1 Soliders. 33 Rocking Pictures To Celebrate Keith Richards' 70th Birthday. 24 Fierce Gowns That Scream World Domination. 33 Delicious No-Cook Dishes To Bring To A Holiday Party. 15 Sexy Pandas, Otters, And Forest Animals. 26 Times ESPN Made You Say WTF In 2013. 8 Phrases You Need To Know In American Sign Language. 17 Beautifully Festive African-American Christmas Cards From The 1950s And '60s. 29 Problems Only Australians Can Understand. 10 Reasons Mommy Should Stop Kissing Santa Claus. 19 Facts We Learned About \"Millennials\" In 2013. 20 Things Latina Moms Love. 7 Advocates Working To Change Marijuana Laws In New York City. 51 Times Rihanna Was The Most Fashionable Celebrity In 2013. 15 Reasons Why San Lorenzo De Almagro Has To Be Your Favorite Soccer Team In 2014. 13 Ways You're Wrong About Los Angeles. 15 Fashion Tips From Days Of Yore. 13 Reasons To Be Thankful For The Existence Of Billie Jean King. 18 Reasons Being Single During The Holidays Is Pretty Great. 23 Missed Connections You'll Be Glad To Miss. 25 Life Shortcuts You Can Learn From Lazy People. 22 Times Patrick Stewart And Ian McKellen Proved They Are The Greatest Best Friends Of 2013. 50 Unexpected Wreaths You Can Make Out Of Anything. 100 Reasons To Be Proud In 2013. 21 Bathroom Crimes That Should Never Be Forgiven. 37 Things You’ll Regret When You’re Old. 17 Tender Moments In Katy Perry And John Mayer's Music Video. 20 Reasons Why Self-Service Checkouts Are Just The Worst. 19 Hairstyles Every '00s Girl Dreamed Of Having. 17 Famous People Re-Imagined As \"Star Wars\" Characters. 14 Things All Coffee Lovers Should Know. 19 Things You Should Know About Anchorman's Very Own Baxter. 15 Times Legolas Was The Best Part Of LOTR. 22 Amazing Hidden Gems To Uncover In Hawaii. 10 Very-Last-Minute DIY Gift Ideas. 13 Times John Boehner Looked Really, Really Surprised In 2013. 21 Extremely Excited Reactions As Australia Win The Ashes. 12 Reasons Jack Dawson Would Actually Make A Terrible Boyfriend. 18 Struggles Of Being The Only Punctual Person In Your Friend Group. 27 Things You Only Know If You Grew Up In Queensland. 17 Reasons To Smoke More Weed. 15 Things Every Kick-Ass Uncle Knows To Be True, As Told By Jesse And Joey. 12 Things All Stage Managers Understand. 16 Disney Holiday Specials To Bring You Joy This Season. 27 Versions Of Wham!'s \"Last Christmas\" Sung By Artists Around The World. 21 Bachelor Pad Tricks That Will Up Your Game. 23 Convincing Reasons \"Surprise, Bitch\" Is Actually The Best Meme Of 2013. 17 Miley Cyrus \"Wrecking Ball\" Ornaments That Are Works Of Christmas Tree Art. 18 Things Only Midwesterners Understand About Winter. 17 Diagrams That Will Help You Draw (Almost) Anything. 19 Things Every College Kid Wants For Christmas This Year. 26 People Who Should Not Be Allowed On Instagram. 19 Awesomely Designed Books From 2013 That Prove Print Isn’t Dead. 19 Signs You Are A Netflix Junkie. 18 Most Remarkable World Records Broken In 2013. 50 Indie Songs For Each Of The 50 States. 22 Boops That Changed The World In 2013. 15 Times Paris Hilton Attempted A Comeback In 2013. 39 Things Only Americans Who Study Arabic Will Understand. 23 Ways To Celebrate Christmas Like A Dad. 35 People Who Gave Up On \"Homeland\" Last Night. 9 Reactions Of People Realizing They're In A Beyoncé Video Right Now. 9 Common Household Items That Are Extremely Flammable. 9 Beautifully Atmospheric Photos Of Foggy London. 27 Transcendent Beauty Products To Look Out For In 2014. 19 Totally Amusing Christmas Decorations. 28 Pieces Of Jewelry That Look More Expensive Than They Are. 7 Endangered NYC Foods You Should Eat Before They Disappear Forever. 27 Moments In \"Homeland\" Season 3 That Made You Scream. 18 Happy Little Foods That Believe In You. 37 Awesome Christmas Card Ideas You Should Steal. 30 Women Who Kicked Ass In 2013. 19 Fandom Moments We Should All Just Forget Happened In 2013. 10 New Animals Discovered In 2013. 27 Things Jewish Moms Love. 9 Longform Stories We're Reading This Week. 16 Things Celebrities Did This Week. 19 Products That Will Make Your Life So Much Better In 2014. 32 Easy And Inexpensive Ways To Keep Kids Entertained This Holiday Season. 30 Cute Stocking Stuffers For Everyone In Your Life. 25 Animated GIFs That Are Actually Just The Same JPEG Of Carrot Top. 31 Unusual Gifts To Give A Design Lover. 31 Delicious Things You Need To Eat In NYC This Winter. 28 Insanely Easy Christmas Decorations To Make In A Pinch. 9 Web Videos You Can't Miss This Week. 14 Things You're Doing Wrong To Your Skin. 28 People Having A Way Worse Holiday Than You. 23 Delicious Dips For A Veggie Platter. 25 Reasons To Love The Women Of \"American Horror Story: Coven\". 21 Celebrity Instagrams You Need To See This Week. 14 Christmas Horror Movies To Watch This Holiday Season. 21 People Robert Pattinson Dated This Year. 21 Parents You Meet After Having Kids. 24 Cute And Clever Ways To Give A Gift Card. 14 Celebrity Instagrams You May Have Missed This Week. 31 Tumblr Users That Are Not Okay. 25 Awesome ’80s Toys You Never Got But Can Totally Buy Today. 21 Fascinating Things You Might Not Know About \"Mary Poppins\". 20 Most Painfully Awkward Moments Of Having \"The Talk\" With Your Kid. 30 Fashionable Gifts Under $100 That Every Guy Needs. 20 Secret Santa Gifts You Won't Believe Actually Exist. 11 Famous Artists Who Created Gorgeous \"Vogue\" Covers. 24 Hilarious Puns That Only English Nerds Will Understand. 24 Reasons Why Hockey Players Are Actually Big, Cuddly Sweethearts. 11 Totally Bonkers Miss Universe Outfits And The Birds That Inspired Them. 6 Quotes From Author Umberto Eco On Why People Love Lists. 9 Celebrity Tweets You Missed Today. 6 Studly Fabrics To Give To Those On Your Naughty List. 24 Reasons To Love Folk Music In 2013. 40 Of The Most Perfectly Timed Unlucky Photos Lead The Daily Links. 25 Most Reblogged Korean Pop Groups On Tumblr. 23 Snowmen Having A Worse Finals Week Than You. 28 Heartwarming Photos Of Indians Being #GayForADay To Protest The Ban On Same-Sex Intercourse. 24 Times Cher Opened Up A Can Of Whoop Ass. 24 Things That Will Go Down As The Most Poorly Designed Of Our Time. 33 Reasons Why Aliens Will Never Talk To Us. 17 Holiday Drinks That Are Even Better Than Eggnog. 32 Incredible Pictures Of A Rare Snowstorm In Jerusalem. 9 Movie Moments That Will Make You Cry Unattractively This Christmas. 22 Beautiful Places You Will See On The Camino De Santiago. 8 Most Badass Santas In The World. 31 Cute Animals To Look At Instead Of Studying. 13 Simple Tips And Tricks For Beating The Winter Blues. 6 Things More Likely To Happen Than Ellen DeGeneres And Portia De Rossi Breaking Up. 9 Songs That Blatantly Ripped Off Other Songs In 2013. 8 Pictures Of Mary-Kate Olsen And Her Future Fiancé That Will Make You Feel Weird. 23 Puppies Who Are Way Turnt Up. 25 Dance Records That Gave Us Life In 2013. 17 Amazing Food Subscriptions You'll Wish Someone Would Get You. 16 People Who Needed Medical Care Because Of Beyoncé. 16 Profound Literary Quotes About Getting Older. 15 Heartening Ways Indian Brands And Bollywood Stars Are Fighting For LGBT Rights. 25 Questions \"It's A Wonderful Life\" Left Unanswered. 22 Unnecessary Kitchen Accessories You Never Knew You Needed. 8 Things You Didn't Know About \"The Hobbit\". 12 Reasons Why Commander Riker Should Be Number One On Your Holiday Party Guest List. 40 Signs You're A Binge Thinker. 34 Reasons Australia Is The Most Beautiful Place On Earth. 13 Cringe-Worthy \"LOTR\" Pick-Up Lines To Get You In The Mood For \"The Desolation Of Smaug\" Premiere. 6 Anthill Art Sculptures That Will Blow Your Mind. 25 Problems Only People With ADHD Understand. 19 Unexpected Benefits Of Having An Indian Best Friend. 15 Older Models Who Are Absolutely Beautiful. 21 Gifts You Need To Get Your Pet This Holiday Season. 8 Magazine Gift Guides That Assume You're A Billionaire Lead The Daily Links. 20 Questions Texans Are Tired Of Hearing. 36 Adorable DIY Ornaments You Can Make With The Kids. 14 Things You Didn't Know About \"The Muppet Christmas Carol\". 44 Movies You Probably Missed In 2013, But Definitely Need To See. 30 Most Earth-Shattering Foods Born In 2013. 41 Moments That Made Cable News Fun To Watch In 2013. 13 Savory Dishes To Make With Roasted Pumpkin. 19 Types Of Selfie We Hope To See Less Of In 2014. 23 Times Gael García Bernal And Diego Luna Were Adorable Together. 13 Times Background Legolas Was The Most Important Part Of \"The Lord Of The Rings\" Movies. 22 Indications That Your Competitiveness Is Out Of Control. 35 Things Puerto Ricans Know To Be True. 17 TV Restaurants You Wish You Could Eat At. 23 Golden Globe Snubs And Surprises. 13 News Organizations Sent A Letter To Syrian Rebels Asking Them To Stop Kidnapping Journalists. 9 Scientific Terms We Don't Want To See In Adverts Anymore. 15 Wedding Announcements From Couples With Deeply Unfortunate Names. 17 Questions \"Elf\" Left Unanswered. 9 Ideas For Random Acts Of Literary Kindness. 20 Ecstatic Shelter Dogs On Their Way Home For The First Time. 26 Amazing Gifts To Empower Little Girls. 21 Questions New Jerseyans Are Tired Of Hearing. 26 Angry Reactions As Australia's High Court Throws Out Same-Sex Marriages. 25 Things Every Married Man Knows To Be True. 7 Cheeky Vintage Photos Of Typewriter Erotica. 24 Amazing Things That Have Come Out Of Australia. 21 Daily Struggles Of Having Separation Anxiety. 22 Signs You Are Addicted To Candy. 8 Places That Are Nearly Impossible To Get To (And How To Get To Them). 10 Signs Your Team's Season Has Gone To Hell. 17 Photos That Define Michael Cera. 12 Shocking But True SantaCon Horror Stories Lead The Daily Links. 11 Reasons You Should Travel Alone At Least Once. 12 Versions Of \"The 12 Days Of Christmas\" You Need On Your Yuletide Playlist This Year. 12 Pieces Of Art That Will Change The Way You Look At Emojis. 15 Signs You’re Celebrating Christmas In A Blended Family. 10 Easy Steps You Should Follow To Confirm If A Famous Person Just Joined Twitter. 20 Of The Best Christmas Moments From \"Friends\". 24 Of The Most Brilliant Music Videos From 2013. 24 Heartbreaking Responses To India's Ban On Same-Sex Intercourse. 20 Last-Minute Gifts For People You Don't Care About. 34 Cute Chicks In Nothing But Hats. 22 Instagram Accounts Fashionistas Should Follow In 2014. 19 Most Entertaining Celebrity Vine Accounts Of 2013. 21 Questions Greek People Are Sick Of Answering. 16 Female TV Characters Who Were Cyberbullied In 2013. 13 Extremely Frustrating Things You'll Only Understand If You Play QuizUp. 8 Comics That New Parents Will Identify With. 15 R Kelly Lyrics As Inspirational Quotes. 15 Questions Irish People Are Sick Of Answering. 17 Incredibly Depressing Office Christmas Decorations. 19 Reasons Thranduil Is The Real Star Of \"The Desolation Of Smaug\". 17 Santa Claus Photos That Will Make Your Skin Crawl. 16 Wintry Christmas Decorations Made From Twigs. 10 Outfits That Reveal Kyary Pamyu Pamyu Is Still Just As Crazy As Lady Gaga. 14 Places To Talk To A Stranger About Books. 12 Musicals We Hope And Dream NBC Will Turn Into A Live Theatrical Event. 21 Compelling Reasons Why You Should Smoke Weed On Christmas. 28 Everyday Decisions That College Students Are Terrible At Making. 23 Signs You're Obsessed With Taking Pictures. 23 Puppies Who Couldn't Wait Until Christmas Morning. 14 TV Episode Descriptions That Are Shockingly Bad. 21 Reasons You'd Be Better Off In Slytherin. 31 Ridiculous Things That Could Only Happen In The Northern Territory. 10 Celebrity Tweets You Missed Today. 17 Movie-Worthy Inspirational Moments That Actually Happened In Real Life. 14 Athletes Who Prove It's Okay To Fail. 9 People Who Had A Brutal 2013 Lead The Daily Links. 32 Things Every American Thinks When Visiting Australia The First Time. 8 People Who Make A Strong Case For Aliens. 16 Ke$ha Aphorisms We Should Live By. 15 Times K-Pop Quietly Owned The World In 2013. 17 Glorious Food Typography Photos That Look Good Enough To Eat. 23 Times Bryan Cranston And Aaron Paul Blessed The World In 2013. 19 Signs You Live With Spine-Crippling FOMO. 21 Reasons Why You Need To Move To Uruguay In 2014. 33 Of The Greatest Things That Happened On Tumblr In 2013. 19 Things Mitt Romney Did In 2013 Instead Of Being President. 10 Reasons Holiday Birthdays Are The Worst. 23 Ways Music Made You Feel Old In 2013. 14 Signs Your Cat Is More Excited About Christmas Than You Are. 17 Reasons Why The Grove Is Simply The Worst During The Holidays. 29 Clever Gifts For People Who Love To Drink. 16 Messages Of Support And Solidarity For Survivors Of Sexual Assault. 18 Breakout Stars Of 2013, According To The Internet. 27 Reasons \"Hook\" Is Actually The Perfect Holiday Movie. 16 Pictures We Can Probably Stop Tweeting In 2014. 29 Street Signs That Will Make You Look Twice. 4 Things To Know About Mary Barra, GM's First Female CEO. 30 Powerful Moments From Nelson Mandela's Memorial Service. 13 Photographs That Will Make You Think Twice About Homelessness. 23 Times Orlando Jones Won The Internet. 16 Items That Are On The Christmas List Of Your Nerdy Dreams. 17 Bizarre Christmas Celebrations From Around The World. 21 Fans Who Restored Your Faith In Alcohol In 2013. 15 Perfect Smiles You Can't Help But Fall In Love With. 8 Leather Bears That Are More Fashionable Than You. 20 Things Extroverts Love. 18 Reasons Why Christmas In L.A. Is Actually Magical. 15 Things You Didn't Know About \"White Christmas\". 9 Celebrity Tweets You Missed Today. 37 Signs It's Summer In Australia. 20 Unavoidable Questions That Come With Meeting Your Significant Other's Family During The Holidays. 32 Mind-Blowing Snow Sculptures Made Of Actual Snow Lead The Daily Links. 12 Movies You Forgot Revolved Around Christmas. 31 Ways 2013 Was The Most Boston Year Ever. 21 Songs You've Totally Heard, But Never Knew The Names Of. 15 Pieces Of Glass Art That You Wouldn't Believe Are Pipes. 15 Ways Working A Service Job Makes You A Better Person. 24 Money-Saving Hacks For The Holidays. 24 Delicious Food Gifts That Will Make Everyone Love You. 21 Racial Microaggressions You Hear On A Daily Basis. 16 Glorious Ways To Make Mac 'N' Cheese. 17 Animals That Are Not OK With Sweater Weather. 10 DIY Ways To Make Traveling Suck Less. 21 Things Introverts Love. 19 Exciting New Pictures From The \"Doctor Who\" Christmas Special. 19 Struggles You'll Only Understand If Your Parents Have Facebook. 16 Tweets That Prove Dylan O'Brien Is The Best At Twitter. 41 Little Things That Made Us Smile In 2013. 11 Incredibly Powerful Letters From History. 21 Things You're Only Afraid Of If You Live In Philly. 21 Signs You Had A Skater Phase. 22 Instagram Accounts Food Lovers Should Follow In 2014. 13 Awesome Subscription Boxes For Everyone You Know. 20 Christmas Trees That Went Beyond Their Call Of Duty. 10 Reasons To Fall In Love With Josh Hutcherson. 31 Worldly Ways To Say \"I Love You\". 16 Things Bruce Jenner's Hair Looked Like In 2013. 23 Most YOLO Pastas Of 2013. 22 Things You Learn When You Get Your First 'Real' Job. 10 Ridiculously Creative YouTube Musicians You Should Know About. 22 Whales Stranded In The Everglades Have Died. 9 Web Videos You Can't Miss This Week. 21 Cute Ways To Channel Christmas Without Being Tacky. 14 Awesome, Surreal Images From The NFL's Day Of Blizzard Games. 23 Men's Grooming Products That Actually Work. 19 Audacious Ways To Make Pigs In A Blanket. 7 Fun Things We Recently Learned About Lena Dunham And Judy Blume. 15 Times Leonardo DiCaprio Completely Lost It. 9 Longform Stories We're Reading This Week. 21 Questions Asian People Are Si", "images": ["https://avatars3.githubusercontent.com/u/796849?s=400&v=4", "https://github.githubassets.com/images/spinners/octocat-spinner-32-EAF2F5.gif", "https://github.githubassets.com/images/search-key-slash.svg"], "top_img": "https://avatars3.githubusercontent.com/u/796849?s=400&v=4", "keywords": [], "authors": [], "canonical_link": "https://github.com/hrldcpr/buzzfeed/blob/master/titles_two.txt", "title": "two.txt at master · hrldcpr/buzzfeed · GitHub", "meta_data": {"viewport": "width=device-width", "description": "Contribute to hrldcpr/buzzfeed development by creating an account on GitHub.", "fb": {"app_id": 1401488693436528}, "twitter": {"image": {"src": "https://avatars3.githubusercontent.com/u/796849?s=400&v=4"}, "site": "@github", "card": "summary", "title": "hrldcpr/buzzfeed", "description": "Contribute to hrldcpr/buzzfeed development by creating an account on GitHub."}, "og": {"image": "https://avatars3.githubusercontent.com/u/796849?s=400&v=4", "site_name": "GitHub", "type": "object", "title": "hrldcpr/buzzfeed", "url": "https://github.com/hrldcpr/buzzfeed", "description": "Contribute to hrldcpr/buzzfeed development by creating an account on GitHub."}, "request-id": "8637:5E25:2415A2:30B2BC:5E9ACA18", "html-safe-nonce": "0d7cd13ca8acbfcd740a38630ad89cc6a749ae2d", "visitor-payload": "eyJyZWZlcnJlciI6IiIsInJlcXVlc3RfaWQiOiI4NjM3OjVFMjU6MjQxNUEyOjMwQjJCQzo1RTlBQ0ExOCIsInZpc2l0b3JfaWQiOiI3MzI2NzU5MTEzODI4NTE4NDI0IiwicmVnaW9uX2VkZ2UiOiJzZWEiLCJyZWdpb25fcmVuZGVyIjoic2VhIn0=", "visitor-hmac": "4b2349bf783fc890f51084beccc970ede2cf8ed01353de5638b8292034aa18a0", "github-keyboard-shortcuts": "repository,source-code", "selected-link": "repo_source", "google-site-verification": "GXs5KoUUkNCoaAZn7wPN-t01Pywp9M3sEjnt_3_ZWPc", "octolytics-host": "collector.githubapp.com", "octolytics-app-id": "github", "octolytics-event-url": "https://collector.githubapp.com/github-external/browser_event", "analytics-location": "/<user-name>/<repo-name>/blob/show", "google-analytics": "UA-3769691-2", "dimension1": "Logged Out", "hostname": "github.com", "expected-hostname": "github.com", "enabled-features": "MARKETPLACE_SOCIAL_PROOF_CUSTOMERS,MARKETPLACE_TRENDING_SOCIAL_PROOF,MARKETPLACE_RECOMMENDATIONS,MARKETPLACE_PENDING_INSTALLATIONS,RELATED_ISSUES", "go-import": "github.com/hrldcpr/buzzfeed git https://github.com/hrldcpr/buzzfeed.git", "octolytics-dimension-user_id": 796849, "octolytics-dimension-user_login": "hrldcpr", "octolytics-dimension-repository_id": 16812097, "octolytics-dimension-repository_nwo": "hrldcpr/buzzfeed", "octolytics-dimension-repository_public": "true", "octolytics-dimension-repository_is_fork": "false", "octolytics-dimension-repository_network_root_id": 16812097, "octolytics-dimension-repository_network_root_nwo": "hrldcpr/buzzfeed", "octolytics-dimension-repository_explore_github_marketplace_ci_cta_shown": "false", "browser-stats-url": "https://api.github.com/_private/browser/stats", "browser-errors-url": "https://api.github.com/_private/browser/errors", "theme-color": "#1e2327"}, "movies": [], "publish_date": null, "source": "http://github.com", "summary": ""}