{"url": "https://people.com/tv/gossip-girl-10-anniversary-interview/", "text": "Image zoom K.C. Bailey/AP Photo/The CW\n\nHey, Upper East Siders. Gossip Girl, here.\n\nIt’s been 10 years since the titular online menace from the CW’s teen drama first began wreaking havoc on the fictional teen members of Manhattan’s elite, and Vanity Fair is taking a look back on the beloved series.\n\nGet push notifications with news, features and more.\n\nIn a lengthy new interview, the Gossip Girl creators and cast – including Blake Lively, Leighton Meester, Ed Westwick, Chace Crawford and Penn Badgley – share behind-the-scenes secrets, reflect on the show’s meteoric rise and reveal if they’ll ever reunite on screen again.\n\nHere are the 10 biggest revelations from Vanity Fair’s Gossip Girl 10th anniversary interview.\n\n1. Meester and Lively were not exactly friends, but there was no drama.\n\nThough they played frenemies Blair Waldorf and Serena van der Woodsen, respectively, onscreen, Meester and Lively kept their relationship professional.\n\n“Blake and Leighton were not friends,” executive producer Joshua Safran said. “They were friendly, but they were not friends like Serena and Blair. Yet the second they’d be on set together, it’s as if they were.”\n\nThe divide was mostly because of the actresses’ differing personalities, said Safran, who described Lively as “very in the moment,” while Meester was “very removed and very quiet” on set.\n\nThough the pair weren’t pals, castmate Michelle Trachtenberg – who played Gossip Girl baddie Georgina Sparks – insisted there was no drama between the women: “We were all chill. It was cool.”\n\n2. Gossip Girl stopped Lively from quitting acting.\n\nLively, then 18, was eyeing an exit from Hollywood when first approached about the series. Best known at the time for her role in the Sisterhood of the Traveling Pants films, Lively told showrunners she wanted to go to college.\n\n“They said, ‘O.K., you can go to Columbia [University] one day a week. After the first year [of the show], it’ll quiet down. Your life will go back to normal and you can start going to school. We can’t put it in writing, but we promise you can go,’ ” explained Lively. “So that’s why I said, ‘O.K. You know what? I’ll do this.’ ”\n\nOf course, the arrangement didn’t work out as “the show didn’t slow down.” Said Lively, laughing, “This is advice to anyone: when they say, ‘We promise, but we can’t put it in writing,’ there’s a reason they can’t put it in writing.”\n\nImage zoom Giovanni Rufino/Landov\n\n3. Badgley and Lively kept their breakup a secret from the cast and crew for months.\n\nLively and her on-screen love interest dated in the early years of Gossip Girl‘s run, going public with their relationship in 2008 before ultimately splitting in 2010.\n\nWhen the romance ended, though, Lively and Badgley didn’t tell anyone.\n\n“The shocking thing was, I found out on the set of the season two finale that Blake and Penn had broken up months before,” Safran told Vanity Fair. “They kept the breakup hidden from the crew, which you could never do now. I don’t even know how they did it. They kept it from everybody which is a testament to how good they are as actors. Because they did not want their personal drama to relate to the show.”\n\n4. Ivanka Trump and Jared Kushner made a cameo.\n\nBefore they were firmly situated in their White House roles, First Daughter Ivanka Trump and her husband Jared Kushner appeared on the popular series.\n\nJoked series co-creator Josh Schwartz, “They did it for the money.”\n\n5. Badgley had a lot in common with Dan.\n\nBadgley – one of the few series regulars not to speak with Vanity Fair for the article – “didn’t like” being on the series as Dan Humphrey, Safran said.\n\n“He was Dan. He may not have liked it, but [his character] was the closest to who he was,” he said.\n\nImage zoom Neilson Barnard/Getty Images\n\n6. Westwick and Crawford were roommates when the show started.\n\nThe real-life Nate Archibald and Chuck Bass bunked up as rising stars, sharing a two-bedroom apartment together in Manhattan’s Chelsea neighborhood.\n\nTogether, they first encountered the fame that was to come when they attended a concert. “We had these girls coming up to us, and they were kind of freaking out about it: ‘Oh, we love the books,’ ” Crawford recalled. “[Ed and I] kept looking at each other like, s—, man.”\n\nRELATED VIDEO: Watch Blake Lively Remember the Night Ryan Reynolds Fell for Her\n\n7. Fans were so crazed at one point that they tried to stroke the stars’ hair.\n\nThe show’s men weren’t the only ones to deal with Gossip Girl‘s fandom. Trachtenberg said she remembered viewers trying to “pet [her] hair” while she walked around the N.Y.C. set.\n\nShe added, “I opened up my trailer door to see, literally, on my first day, I think 40 paparazzi. That’s when I was like, ‘O.K., I need my own bodyguard.’ ”\n\n8. Westwick still doesn’t know who Gossip Girl was.\n\nThough the identity of the show’s main character has long since been revealed (spoiler alert!) as Badgley’s Dan, Westwick told Vanity Fair over email, “I still am not sure who GG was lol.”\n\nThe show’s crew said that Lonely Boy wasn’t always the frontrunner for the mean-spirited blogger, noting that both Nate and Serena’s brother Eric were once considered.\n\nAs Badgley told PEOPLE in 2015, “It doesn’t make sense at all!”\n\nImage zoom The CW/KC Bailey\n\n9. The cast still gets approached by fans about the show.\n\nThough the finale aired in 2012, with today’s online streaming, the show has found a whole new audience.\n\n“It’s so weird how the same demographic has been frozen in time,” Crawford said. “Fourteen- to 20-year-olds still come up to me freaking out and it’s because they binge [the show] on Netflix.”\n\n10. The stars are open to a reunion.\n\nThe series neatly ended with a look at all the characters’ futures, but the stars aren’t opposed to revisiting their endings.\n\nKelly Rutherford, who played Lily van der Woodsen, Serena’s mother, said she would be “completely on board” for a reunion. “And I think they should do it soon,” she added.\n\n“Of course. I’m open to anything that’s good, that’s interesting, and that sort of feels necessary,” Lively said. “I imagine we all would [consider it]. I can’t speak for everyone else, but we all owe so much to this show, and I think that it would be silly not to acknowledge that.”\n\nAs for Meester? “I don’t want to say, ‘No, never . . .’ ” she said.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20122'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1427&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fgettyimages-133531304-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fblake-lively1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F10%2F24016361_h11417522.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1427&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg", "keywords": [], "authors": ["Lindsay Kimble"], "canonical_link": "https://people.com/tv/gossip-girl-10-anniversary-interview/", "title": "Gossip Girl: Revelations from Blake Lively, More Stars", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Blake Lively,Chace Crawford,Ed Westwick,Gossip Girl,Leighton Meester,News,Penn Badgely,TV,TV Watch", "news_keywords": "Blake Lively,Chace Crawford,Ed Westwick,Gossip Girl,Leighton Meester,News,Penn Badgely,TV,TV Watch", "description": "In a lengthy new interview, the Gossip Girl creators and cast – including Blake Lively, Leighton Meester, Ed Westwick, Chace Crawford and Penn Badgley – share a variety of behind-the-scenes secrets, wax on the show's meteoric rise and open up about if they'll ever reunite on screen again", "og": {"title": "Gossip Girl: Revelations from Blake Lively, More Stars", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/gossip-girl-10-anniversary-interview/", "description": "Hey, Upper East Siders. Gossip Girl, here. It’s been 10 years since the titular online menace from the CW’s teen drama first began wreaking havoc&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1427&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg", "width": 1427, "height": 747}}, "pinterest": {"url": "https://people.com/tv/gossip-girl-10-anniversary-interview/", "description": "In a lengthy new interview, the Gossip Girl creators and cast – including Blake Lively, Leighton Meester, Ed Westwick, Chace Crawford and Penn Badgley – share a variety of behind-the-scenes secrets, wax on the show's meteoric rise and open up about if they'll ever reunite on screen again", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/gossip-girl-10-anniversary-interview/", "title": "Gossip Girl: Revelations from Blake Lively, More Stars", "description": "In a lengthy new interview, the Gossip Girl creators and cast – including Blake Lively, Leighton Meester, Ed Westwick, Chace Crawford and Penn Badgley – share a variety of behind-the-scenes secrets, wax on the show's meteoric rise and open up about if they'll ever reunite on screen again", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1427&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F07%2Fgossip-girl.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}