{"url": "www.travelandleisure.com/travel-tips/celebrity-travel/kate-william-no-pda-in-public", "text": "Prince William and Kate Middleton had a fairytale wedding that ended in a passionate kiss in church, along with a small show of affection as they smooched on the balcony at Buckingham Palace in front of millions of well-wishers across the globe. But that is where their public displays of affection started and quickly ended.\n\nSince their wedding day, the couple has welcomed two beautiful children and announced a third on the way, so we know there is, um, some romance happening somewhere — it just isn’t happening in the form of hand-holding, kissing, or hugging in the public eye. And that is exactly how the royal family likes it.\n\n“There is no actual etiquette or royal protocol that says the couple must refrain from PDA,” Myka Meier, a royal etiquette expert and founder and director of Beaumont Etiquette, told People in 2016. “The couple are likely to show very little PDA, if any, to remain professional during their designated roles abroad.”\n\nBeyond looking professional, Robin Kermode, a body language expert, told the Daily Mail that the couple may also refrain from any displays of affection because the Queen herself told them to.\n\n“The Queen rarely holds hands with her husband in public and this seems to have set an unwritten precedent for the other royals,” Kermode said.\n\nAnd don’t let this refusal to hold hands in front of the world confuse you or make you think the royal couple isn’t as strong, committed, and loving as the rest of us. As Kermode noted, “It is very clear that William and Kate are emotionally close, however, they do not seem to feel the need to prove their love – particularly when on official state business.”\n\nThe expert added, “They come across as a strong, independent couple and while they are always on show, they do not feel the need to ‘show’ their love for each other to the world.”\n\nAnd while this royal pair is semi-banned from being lovey-dovey in public, there is at least one royal couple who isn’t: Prince Harry and his girlfriend, Meghan Markle.\n\nImage zoom Chris Jackson/Getty Images\n\nAs Vogue noted, Harry and Meghan have been showing their love for each other all over the 2017 Invictus Games, with photos showing the couple holding hands, kissing, and smiling at one another. (Although they have reportedly been pulling off secret, incognito airport pick-ups for quite some time.)\n\nImage zoom Chris Jackson/Getty Images\n\nSo why can they show off their love but Will and Kate can’t? It’s simple: it all comes down to Harry’s place in the line of royal succession.\n\nAs Vogue noted, Harry will soon become the sixth in line for the throne. This means his royal duties will ultimately come to an end. And while we will undoubtedly love the ginger-haired royal forever, he will no longer be responsible for holding up royal decorum in the way his brother, sister-in-law, and nieces and nephews will be expected to. So perhaps Harry, the “spare heir,” really did win out in the end.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2019%2F12%2Farequipa-peru-WHERETOGO2020.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2017%2F07%2F1-gibbs-farm-WBSAFLODAF0517-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2017%2F10%2Fprince-william-catherine-middleton-ROYALPDA1017.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2017%2F10%2Fprince-harry-meghan-markle-ROYALPDA1017.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2018%2F01%2Feagle-beach-aruba-365BEACHESH1217-150x150.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined", "keywords": [], "authors": ["Stacey Leasca"], "canonical_link": "https://www.travelandleisure.com/travel-tips/celebrity-travel/kate-william-no-pda-in-public", "title": "Why Kate Middleton and Prince William Can't Show PDA Like Prince Harry and Meghan Markle", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Travel and Leisure", "news_keywords": "Travel and Leisure", "description": "You likely haven't seen them kiss since their wedding day.", "og": {"title": "Why Kate Middleton and Prince William Can't Show PDA Like Prince Harry and Meghan Markle", "type": "article", "site_name": "Travel + Leisure", "url": "https://www.travelandleisure.com/travel-tips/celebrity-travel/kate-william-no-pda-in-public", "description": "Prince William and Kate Middleton had a fairytale wedding that ended in a passionate kiss in church, along with a small show of affection as&hellip;", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined"}, "pinterest": {"url": "https://www.travelandleisure.com/travel-tips/celebrity-travel/kate-william-no-pda-in-public", "description": "You likely haven't seen them kiss since their wedding day.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fwww.travelandleisure.com%2Fimg%2Fmisc%2Fog-default.png"}, "twitter": {"card": "summary", "url": "https://www.travelandleisure.com/travel-tips/celebrity-travel/kate-william-no-pda-in-public", "title": "Why Kate Middleton and Prince William don't show PDA like Prince Harry and Meghan Markle", "description": "You likely haven't seen them kiss since their wedding day.", "site": "@TravelLeisure", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined"}, "fb": {"app_id": 1186687021348564, "pages": 25440929072}, "article": {"opinion": "false"}}, "movies": ["https://www.youtube.com/embed/c38lPvrPuT4"], "publish_date": null, "source": "http://www.travelandleisure.com", "summary": ""}