{"url": "https://www.theguardian.com/music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video", "text": "The visuals for Look What You Made Me Do offer a manic set of self-referential images that find the pop star commenting on the fall of her reputation\n\nCelebrities are often accused of lacking self-awareness. And no one’s been on the receiving end of that criticism more than Taylor Swift. Despite a lengthy catalogue of hits in which she plays scorned exes and lovelorn balladeers, the country singer turned pop superstar has been seen less as a victim than as a purveyor of victimhood, using her prodigious songwriting talents and natural affability to become a megaphone for perceived injustice.\n\nSo what does Taylor Swift do to prove to us she’s aware of this narrative (the one, of course, from which she’d like to be excluded)?\n\nAcid gossip that borrows from better songs – Taylor Swift: Look What You Made Me Do review Read more\n\nRelease a music video – for her new single, Look What You Made Me Do – that’s practically boiling over with meta-commentary and self-referential detail, from an ongoing visual snake motif to a tombstone that literally reads “Taylor Swift’s reputation”. Yes, it’s painfully on-the-nose, but Swift’s brand hasn’t exactly been built on subtlety.\n\nLook What You Made Me Do – or LWYMMD, as its Twitter hashtag dictates – is well on its way to smashing streaming records, but the song hasn’t been as well received by critics. Continuing in the tradition of her last album, 1989, which marked Swift’s official evolution into pop music behemoth, it largely abandons that which made her a household name – singable melodies; sharp, specific lyricism; grand tales of romantic enchantment – in favor of radio-engineered pop and glib proclamations of vengeance. Near the end of the song, she answers a phone call; someone’s asking to speak with Taylor Swift. “She can’t come to the phone right now,” Swift 2.0 says. Why? “Because she’s dead.”\n\nIn the battle between Swifts, my allegiance is with the deceased version, a shrewd chronicler of young-adult courtship and seasoned, starry-eyed songwriter. So much so that hearing her new single made me nostalgic for the days of Fearless and Red. But the Old Swift be damned; this new one is all about retribution and, as the title of her forthcoming album suggests, reputation.\n\nThe music video for LWYMMD, which premiered during Sunday night’s VMAs, sees Swift double down on her vengeful streak, making theatre of her scandal-laden career in an attempt to communicate a self-awareness that’s mostly eluded her. The video is good fun, if a little bit mad; it’s certainly the most brazen and ambitious pop music video since Beyoncé dropped Lemonade in the spring of last year, replete with pyrotechnics and dozens of costume changes. But it doesn’t amount to much more than a succession of disconnected images. And if the images could talk, they might say, “I know what you think of me”, or, perhaps, in the words of Joanne the Scammer: “I’m a messy bitch who lives for drama.”\n\n\n\nBut still, in all those images, Swift left a lot to be decoded. A connoisseur of the tongue-in-cheek (remember the capitalized letters in her lyric booklets that spelled out clues about a song’s subject?), it begins with a zombified T-Swift digging her own grave.\n\nGet it? The Old Swift is dead, dunzo, kaput, resigned to the graveyard of pop culture history. First, we see the aforementioned tombstone, where Swift’s reputation lies, but also a second one, reading “Nils Sjoberg”, the pseudonym Swift used as a co-writer on her ex-boyfriend Calvin Harris’s song, This Is What You Came For, a collaboration widely assumed to have contributed to their breakup. Swift’s writing credit was supposed to be kept secret, but when her team revealed that she had, in fact, written the Harris-Rihanna hit, her ex went on a tweetstorm about how Swift was looking for “someone new to try and bury”. So she buried the fictitious Mr Sjoberg.\n\nIn the next shot, Swift luxuriates in a tub of diamonds, where there sits a single dollar bill, a possible reference to the symbolic dollar she earned in last month’s sexual assault case against the radio DJ who groped her in 2013. Internet conspiracists, too, ran with this as a visual reference to Melania Trump, who could be seen forking diamond necklaces like spaghetti in a Vanity Fair spread last year. But those were the same people insistent that Swift, who kept mum during last year’s presidential campaigns, is a closeted Trump supporter. That the election coincided with Swift’s period of self-imposed exile did little to get her back in the public’s good graces; but diamonds, unlike gilded toilet seats, do not a Trump reference make.\n\nThis next one is a dead giveaway: Swift sits atop a throne as dozens of snakes slither at her feet. One even serves her what we can only assume is piping hot tea, the kind Kim Kardashian dished out when she released audio of Swift, who publicly disputed Kanye West’s lyric about her in Famous, appearing to sign off on those same lyrics in a phone conversation with West. Afterwards, Swift’s reputation as a snake in sheep’s clothing took off; Kardashian helped further that image by tweeting a bunch of snake emojis on international snake day. More than a year later, it seems Swift’s ready to embrace the title: ahead of the single’s release, she dropped cryptic reptilian teaser videos. And now, the snake has shed her skin.\n\nThere’s also an inscription on Swift’s gold throne that reads “Et Tu Brute”, the Latin phrase used in William Shakespeare’s Julius Caesar when Caesar is being assassinated by his friend Brutus. It’s a far cry from the Swift of yesteryear, whose Shakespeare references were more Romeo and Juliet than Julius Caesar. But she’s dead, remember?\n\nIt was at the 2016 Grammys, when 1989 beat Kendrick Lamar’s To Pimp a Butterfly for album of the year, that Swift first began to truly test the public’s patience. That was also where she publicly rebuked West’s lyric about her in her acceptance speech.\n\nSo in the next shot, as the chorus begins, Swift rams a shiny gold car into a storefront where paparazzo are lurking. She opens the door, a cheetah in tow, to show off none other than her Grammy award. She proceeds to display and caress it in one of the video’s most bewildering moments.\n\nSwift’s love of cats is well documented. Here, she’s surrounded by stacks of cash and a Girl Squad of masked felines, wielding a baseball bat and a sweater that says “Blind for Love”. In the next scene, the masked marauders can be seen robbing a music streaming company. Swift, if you remember, boycotted Spotify for years due to its dismal compensation of artists. She also wrote an open letter to Apple Music in 2014 arguing on behalf of increased artists compensation and then took to Tumblr, in June 2015, blasting Apple’s decision to give users three-month free trials. And now she’s back to rob them, cat imagery to boot.\n\nSwift first assembled her Girl Squad in the music video for Bad Blood, supposedly a shot at rival Katy Perry. She then spent her 1989 world tour parading her besties around in different cities, throwing parties for her supermodel coterie and bringing them to red carpets. This didn’t work out great for Swift, adding to the perception that she surrounds herself only with similarly alpine, Aryan beauties such as Karlie Kloss, Martha Hunt and Gigi Hadid.\n\nBut she knows you think that, alright? So here’s a factory of fembots united like the sentient hosts of Westworld. Swift stands before them in leather and latex, the ringleader of scorned Girl Squads the world over.\n\nThis next still made waves for its apparent resemblance to a shot from Beyoncé’s Formation video. But the real hidden gem is the backup dancers’ belly shirts, which read “I Heart TS”. Tom Hiddleston, one of Swift’s ex-boyfriends, was caught in a similar shirt when splashing around the beaches of Rhode Island with Swift. All of which seems to suggest that Swift surrounds herself only with those who emblazon their love for her on T-shirts. Or, she’s commenting on the fact that you think she does that.\n\nAs we get closer to the finale, we see Swift standing before a bunch of former Swifts: the lovesick high-schooler from the You Belong With Me music video, the one in a silver flapper dress who was interrupted on the VMA stage by Kanye West, the innocent, bespectacled one wearing pajamas, the one dressed as a white swan from the Shake It Off music video. They claw at her feet, aching to be resurrected. But Swift 2.0, wearing a black shirt that says “Rep”, banishes them all and declares the “old Taylor” dead.\n\nThis segues into the video’s utterly cringeworthy dance break which, for all I know, is more Swift meta-commentary on how bad of a dancer everyone thinks she is (an, ahem, reputation corroborated by all the times awards show cameras have panned awkwardly to Swift in the audience during a performance, writhing around like the inflatable tube men at gas stations).\n\nFinally, the Swifts both old and new assemble before an airplane, where the word “reputation” appears again. Here, Swift on Swift reaches its thematic apex: Zombie Swift tells You Belong With Me Swift to “stop making that surprised face, it’s so annoying”. White Swan Swift adds: “You can’t possible be that surprised all the time”. Top-hat Swift tells Cowboy Boots Swift that she’s “so fake”. Cowboy Boots Swift bursts into tears. “There she goes, playing the victim again,” responds another Swift, wearing spiked leather. Leopard-clad Swift holds up her phone and announces she’s “getting receipts” – and that she’ll “edit them” too, a reference to Swift’s belief that Kardashian artfully edited that incriminating audio of her. And finally, 2009 VMAs Swift, holding her Moonman, announces she would “very much like to be excluded from this narrative”.\n\nAnd with that – as old Swifts expire and a new one is born – the narrative lives to see another day.", "images": ["https://i.guim.co.uk/img/media/6cdcf2bbda46d3460ee23f5df30dad5daf5df2a7/156_0_1127_676/master/1127.png?width=300&quality=85&auto=format&fit=max&s=6acbe9e6591b7f87ede519743b71901a", "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9e2ca901cc9d4fa9ebe8489378c8970", "https://i.guim.co.uk/img/media/2848e97d4d283b278d1f6e109607ecd88b3b261a/146_0_1120_672/master/1120.png?width=300&quality=85&auto=format&fit=max&s=28056d9c12a05102a44342ef483160e8", "https://i.guim.co.uk/img/media/e8585cc2a74b6c9830ac61d6edd64eace2182d8f/0_0_1120_672/master/1120.png?width=300&quality=85&auto=format&fit=max&s=0b99abe5189baa40d3dd544e23d12148", "https://i.guim.co.uk/img/media/6d6590d47caca2f3df5e822d76f635632034b1c6/99_0_1117_670/master/1117.png?width=300&quality=85&auto=format&fit=max&s=b1a55840ce045e7439f4df9cebe5f781", "https://i.guim.co.uk/img/media/263b5dd766b3500ce93f30d94a658d0bb0deb7e6/266_0_1120_672/master/1120.png?width=300&quality=85&auto=format&fit=max&s=0eed4c17262813ea5755ef4a39ee0254", "https://i.guim.co.uk/img/media/7fc4e16f17f49f544f1289943decba5d3a81888a/170_0_1118_671/master/1118.png?width=300&quality=85&auto=format&fit=max&s=b888b3771d612d128112b2f40d4dc425", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Taylor+Swift%2CMusic%2CCulture%2CKim+Kardashian+West%2CKanye+West%2CKaty+Perry%2CPop+and+rock", "https://i.guim.co.uk/img/media/125d8c9cce2b2ccb65696eb2371392dcebd332e2/155_0_1125_675/master/1125.png?width=300&quality=85&auto=format&fit=max&s=3a81cfe21b45b937d01172b1f5f1c328", "https://i.guim.co.uk/img/media/83bf7d3bf5db40b81db988f1ef5f368c28e8e6c9/157_0_1117_670/master/1117.png?width=300&quality=85&auto=format&fit=max&s=502cc3ad18a9be6eda2763fefe23ce44", "https://i.guim.co.uk/img/media/6379d3b09dabafee8971c1dea70df3f4acea6057/162_0_1115_669/master/1115.png?width=300&quality=85&auto=format&fit=max&s=39473ae22a05e12540a509e449928a63", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=300&quality=85&auto=format&fit=max&s=c34d35da5980817ddad69c8886bc1166"], "top_img": "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9e2ca901cc9d4fa9ebe8489378c8970", "keywords": [], "authors": ["Jake Nevins"], "canonical_link": "https://www.theguardian.com/music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video", "title": "Look what you made her do: decoding the disses of Taylor Swift's new video", "meta_data": {"description": "The visuals for Look What You Made Me Do offer a manic set of self-referential images that find the pop star commenting on the fall of her reputation", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Jake Nevins", "thumbnail": "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=620&quality=85&auto=format&fit=max&s=5e4c996307314fe1d405ebd78467e28a", "keywords": "Taylor Swift,Music,Culture,Kim Kardashian West,Kanye West,Katy Perry,Pop and rock", "news_keywords": "Taylor Swift,Music,Culture,Kim Kardashian West,Kanye West,Katy Perry,Pop and rock", "og": {"url": "http://www.theguardian.com/music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video", "image": "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9e2ca901cc9d4fa9ebe8489378c8970", "description": "The visuals for Look What You Made Me Do offer a manic set of self-referential images that find the pop star commenting on the fall of her reputation", "type": "article", "title": "Look what you made her do: decoding the disses of Taylor Swift's new video", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/jake-nevins", "publisher": "https://www.facebook.com/theguardian", "section": "Music", "published_time": "2017-08-28T19:20:15.000Z", "tag": "Taylor Swift,Music,Culture,Kim Kardashian West,Kanye West,Katy Perry,Pop and rock", "modified_time": "2018-04-23T09:35:43.000Z"}, "al": {"ios": {"url": "gnmguardian://music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video", "iphone": "gnmguardian://music/2017/aug/28/taylor-swift-look-what-you-made-me-do-music-video?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/e143ae5d69ee7e630086facc94fcdea8ddb7e849/158_0_1118_671/master/1118.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=2057f3c4d7c581c29276e3d1a7d4f504", "site": "@guardian", "card": "summary_large_image", "creator": "@jhnevins", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/3tmd-ClpJxA?wmode=opaque&feature=oembed"], "publish_date": 1503849600.0, "source": "https://www.theguardian.com", "summary": ""}