{"url": "https://web.archive.org/web/20150816005009/http://www.hillaryclinton.com:80/briefing/factsheets/2015/07/13/email-facts/", "text": "Factsheets\n\nUpdated: The Facts About Hillary Clinton’s Emails\n\nWe’ve put all of the information about Hillary Clinton’s State Department emails here. Just the facts, all in one place.\n\nWhy did Clinton use her own email account?\n\nWhen Clinton got to the Department, she opted to use her personal email account as a matter of convenience. It enabled her to reach people quickly and keep in regular touch with her family and friends more easily given her travel schedule.\n\nThat is the only reason she used her own account.\n\nHer usage was widely known to the over 100 State Department and U.S. government colleagues she emailed, consistent with the practice of prior Secretaries of State and permitted at the time.\n\nAs Clinton has said, in hindsight, it would have been better to just have two accounts. While she thought using one account would be easier, obviously, that has not been the case.\n\nWas it allowed?\n\nYes. The laws, regulations, and State Department policy in place during her tenure permitted her to use a non-government email for work.\n\nThe 2009 National Archives regulation in place during her tenure required that \"[a]gencies that allow employees to send and receive official electronic mail messages using a system not operated by the agency must ensure that Federal records sent or received on such systems are preserved in the appropriate agency recordkeeping system.\" The regulation recognizes the use of non-government email accounts.\n\nAs she has stated, Clinton's practice was to email government officials on their \".gov\" accounts, so her work emails were immediately captured and preserved. In fact, more than 90% of those emails should have already been captured in the State Department’s email system before she provided them with paper copies.\n\nA Politifact analysis also confirmed that Clinton's practices complied with laws and regulations, including support from the former director of a prominent government accountability organization: \"In Clinton's defense, we should note that it was only after Clinton left the State Department, that the National Archives issued a recommendation that government employees should avoid conducting official business on personal emails (though they noted there might be extenuating circumstances such as an emergency that require it). Additionally, in 2014, President Barack Obama signed changes to the Federal Records Act that explicitly said federal officials can only use personal email addresses if they also copy or send the emails to their official account. Because these rules weren't in effect when Clinton was in office, 'she was in compliance with the laws and regulations at the time,' said Gary Bass, founder and former director of OMB Watch, a government accountability organization.\"\n\nClinton said she did not use her email to send or receive classified information, but the State Department and two Inspectors General said some of these emails do contain classified information. Was her statement inaccurate?\n\nClinton only used her account for unclassified email. No information in Clinton's emails was marked classified at the time she sent or received them.\n\nWhen information is reviewed for public release, it is common for information previously unclassified to be upgraded to classified if the State Department or another agency believes its public release could cause potential harm to national security, law enforcement or diplomatic relations.\n\nAfter reviewing a sampling of the 55,000 pages of emails, the Inspectors General have proffered that a small number of emails, which did not contain any classified markings and/or dissemination controls, should have been classified at the time they were sent. The State Department has said it disagrees with this assessment.\n\nClinton hopes the State Department and the agencies involved in the review process will sort out as quickly as possible which of the 55,000 pages of emails are appropriate to share with the public.\n\nHow did Clinton receive and consume classified information?\n\nThe Secretary's office was located in a secure area. Classified information was viewed in hard copy by Clinton while in the office. While on travel, the State Department had rigorous protocols for her and traveling staff to receive and transmit information of all types.\n\nA separate, closed email system was used by the State Department for the purpose of handling classified communications, which was designed to prevent such information from being transmitted anywhere other than within that system.\n\nIs Department of Justice conducting a criminal inquiry into Clinton’s email use?\n\nNo. As the Department of Justice and Inspectors General made clear, the IGs made a security referral. This was not criminal in nature as misreported by some in the press. The Department of Justice is now seeking assurances about the storage of materials related to Clinton’s email account.\n\nIs it true that her email server and a thumb drive were recently turned over to the government? Why?\n\nAgain, when information is reviewed for public release, it is common for information previously unclassified to be upgraded to classified if the State Department or another agency believes its public release could cause potential harm to national security, law enforcement or diplomatic relations.\n\nClinton hopes that State and the other agencies involved in the review process will sort out as quickly as possible which emails are appropriate to share with the public, and that the release will be as timely and as transparent as possible.\n\nWhen the Department upgraded some of the previously unclassified email to classified, her team worked with the State Department to ensure copies of her emails were stored in a safe and secure manner. She also directed her team to give her server that hosted her email account while she was Secretary to the Department of Justice, as well as a thumb drive containing copies of her emails that already had been provided to the State Department. Clinton has pledged to cooperate with the government's security inquiry.\n\nWould this issue not have arisen if she used a state.gov email address?\n\nEven if Clinton's emails had been on a government email address and government device, these questions would be raised prior to public release.\n\nWhile the State Department's review of her 55,000 emails brought the issue to the Inspectors Generals' attentions, the emails that recently were upgraded to classified prior to public release were on the unclassified .gov email system. They were not on the separate, closed system used by State Department for handling classified communications.\n\nHave Clinton's State Department aides also been asked to provide the Department and Congress with emails from their personal accounts?\n\nWe understand that members of her State Department staff were recently asked to assist the Department in its record-keeping by providing any work-related emails they may have on personal accounts. They have received requests from Rep. Gowdy as well.\n\nClinton is proud of the work of all the dedicated public servants that were part of her team at the State Department. She was proud of her aides then and is proud of them now, as they have committed - as she has - to being as helpful as possible in responding to requests.\n\nPress reports say she used multiple devices – a Blackberry and an iPad – is that true?\n\nClinton relied on her Blackberry for emailing. This was easiest for her. When the iPad came out in 2010, she was as curious as others and found it great for shopping, browsing, and reading articles when she traveled. She also had access to her email account on her iPad and sometimes used it for that too.\n\nWas she ever provided guidance about her use of a non-\".gov\" email account?\n\nThe State Department has and did provide guidance regarding the need to preserve federal records. To address these requirements, it was her practice to email government employees on their \".gov\" email address. That way, work emails would be immediately captured and preserved in government record-keeping systems.\n\nWhat did Clinton provide to the State Department?\n\nOn December 5, 2014, 30,490 copies of work or potentially work-related emails sent and received by Clinton from March 18, 2009, to February 1, 2013, were provided to the State Department. This totaled roughly 55,000 pages. More than 90% of her work or potentially work-related emails provided to the Department were already in the State Department's record-keeping system because those e-mails were sent to or received by \"state.gov\" accounts.\n\nEarly in her term, Clinton continued using an att.blackberry.net account that she had used during her Senate service. Given her practice from the beginning of emailing State Department officials on their state.gov accounts, her work-related emails during these initial weeks would have been captured and preserved in the State Department's record-keeping system. She, however, no longer had access to these emails once she transitioned from this account.\n\nWhy did the Select Committee announce that she used multiple email addresses during her tenure?\n\nIn fairness to the Committee, this was an honest misunderstanding. Clinton used one email account during her tenure at State (with the exception of her initial weeks in office while transitioning from an email account she had previously used). In March 2013, a month after she left the Department, Gawker published the email address she used while Secretary, and so she had to change the address on her account.\n\nAt the time the printed copies were provided to the Department in 2014, because it was the same account, the new email address established after she left office appeared on the printed copies as the sender, and not the address she used as Secretary. In fact, this address on the account did not exist until March 2013. This led to understandable confusion that was cleared up directly with the Committee after its press conference.\n\nWhy didn't Clinton provide her emails to the State Department until December 2014?\n\nIn 2014, after recognizing potential gaps in its overall recordkeeping system, the State Department asked for the help of the four previous former Secretaries in meeting the State Department's obligations under the Federal Records Act.\n\nClinton responded to this request by providing the State Department with over 55,000 pages of emails. As it was Clinton's practice to email U.S. government officials on their .gov accounts, the overwhelming majority of these emails should have already been preserved in the State Department’s email system.\n\nIn providing these emails to the Department, Clinton included all she had that were even potentially work-related—including emails about using a fax machine or asking for iced tea during a meeting—erring on the side of over-inclusion, as confirmed by the Department and National Archives' determination that over 1250 emails were \"personal\" records (which they have indicated will be returned to her).\n\nAfter providing her work and potentially work-related emails, she chose not to keep her personal, non-work related emails, which by definition, are not federal records and were not requested by the Department or anyone else.\n\nWhy did the State Department ask for assistance in collecting records? Why did the State Department need assistance in further meeting its requirements under the Federal Records Act?\n\nThe State Department formally requested the assistance of the four previous former Secretaries in a letter to their representatives dated October 28, 2014, to help in further meeting the Department’s requirements under the Federal Records Act.\n\nThe letter stated that in September 2013, the National Archives and Records Administration (NARA) issued new guidance clarifying records management responsibilities regarding the use of personal email accounts for government business.\n\nWhile this guidance was issued after all four former Secretaries had departed office, the Department decided to ensure its records were as complete as possible and sought copies of work emails sent or received by the Secretaries on their own accounts.\n\nWhy did Clinton decide not to keep her personal emails?\n\nAs Clinton has said before, these were private, personal messages, including emails about her daughter's wedding plans, her mother's funeral services and condolence notes, as well as emails on family vacations, yoga routines, and other items one would typically find in their own email account, such as offers from retailers, spam, etc.\n\nDid Clinton delete any emails while facing a subpoena?\n\nNo. As noted, the emails that Clinton chose not to keep were personal emails—they were not federal records or even work-related—and therefore were not subject to any preservation obligation under the Federal Records Act or any request. Nor would they have been subject to the subpoena—which did not exist at the time—that was issued by the Benghazi Select Committee some three months later.\n\nRep. Gowdy's subpoena issued in March 2015 did not seek, and had nothing to do with, her personal, non-work emails nor her server nor the request by State Department last year for her help in their own record-keeping. Indeed in his March 19th letter, Rep. Gowdy expressly stated he was not seeking any emails that were \"purely personal in nature.\"\n\nIn March 2015, when Rep. Gowdy issued a subpoena to Clinton, the State Department had received all of Clinton's work-related emails in response to their 2014 request, and indeed, had already provided Clinton's relevant emails to Rep. Gowdy’s committee.\n\nRep. Gowdy, other Republicans, and some members of the media have seized on a CNN interview with Clinton to question her on this point. Rep. Gowdy has even gone so far as to say Clinton is lying. But he and the others are clearly mistaken.\n\nAs Vox reported, \"[S]he didn't lie about the subpoena. … Clinton clearly wasn't responding to the question of whether she'd ever been subpoenaed by the Benghazi Committee but whether she'd been subpoenaed before she wiped the emails from her server.\" Additionally, Factcheck.org said in its analysis, \"Clinton's denial came in response to a question about deleting emails 'while facing a subpoena,' and Clinton objected to Keilar's 'assumption.' Clinton’s campaign said that the emails were deleted before she received the subpoena and that was the point Clinton was making.\" Politifact added, \"Suggesting that Clinton deleted emails while facing a subpoena contradicts what we know about the controversy so far.\"\n\nVox went on to further decry Rep. Gowdy's reaction, saying, \"[T]his one's a particularly absurd gimmick, even for a committee that is selectively leaking from depositions and documents to justify its existence. If there was a more extreme category of dissembling than 'pants on fire,' now would be the time for Politifact to roll it out on the House Republicans.\"\n\nWhy was the State Department given printed copies?\n\nThat is the requirement. The instructions regarding electronic mail in the Foreign Affairs Manual (the Department's policy manual) require that \"until technology allowing archival capabilities for long-term electronic storage and retrieval of email messages is available and installed, those messages warranting preservation as records (for periods longer than current E-mail systems routinely maintain them) must be printed out and filed with related records.\" [5 FAM 443.3].\n\nWere any work items deleted in the course of producing the printed copies?\n\nNo.\n\nHow many emails were in her account? And how many of those were provided to the State Department?\n\nHer email account contained a total of 62,320 sent and received emails from March 2009 to February 2013. Based on the review process described below, 30,490 of these emails were provided to the Department, and the remaining 31,830 were private, personal records.\n\nHow and who decided what should be provided to the State Department?\n\nThe Federal Records Act puts the obligation on the government official to determine what is and is not a federal record. The State Department Foreign Affairs Manual outlines guidance \"designed to help employees determine which of their e-mail messages must be preserved as federal records and which may be deleted without further authorization because they are not Federal record materials.\" [5 FAM 443.1(c)].\n\nFollowing conversations with State Department officials and in response to the State Department's 2014 letter to former Secretaries, Clinton directed her attorneys to assist by identifying and preserving all emails that could potentially be federal records. This entailed a multi-step process to review each email and provide printed copies of Clinton's emails to the State Department, erring on the side of including anything that might be even potentially work-related.\n\nA search was conducted on Clinton's email account for all emails sent and received from 2009 to her last day in office, February 1, 2013.\n\nAfter this universe was determined, a search was conducted for a \".gov\" (not just state.gov) in any address field in an email. This produced over 27,500 emails, representing more than 90% of the 30,490 printed copies that were provided to the State Department.\n\nTo help identify any potential non-\".gov\" correspondence that should be included, a search of first and last names of more than 100 State Department and other U.S. government officials was performed. This included all Deputy Secretaries, Under Secretaries, Assistant Secretaries, Ambassadors-at-Large, Special Representatives and Envoys, members of the Secretary's Foreign Policy Advisory Board, and other senior officials to the Secretary, including close aides and staff.\n\nNext, to account for non-obvious or non-recognizable email addresses or misspellings or other idiosyncrasies, the emails were sorted and reviewed both by sender and recipient.\n\nLastly, a number of terms were specifically searched for, including: \"Benghazi\" and \"Libya.\"\n\nThese additional three steps yielded just over another 2,900 emails, including emails from former Administration officials and long-time friends that may not be deemed by the State Department to be federal records. And hundreds of these emails actually had already been forwarded onto the state.gov system and captured in real-time.\n\nWith respect to materials that the Select Committee has requested, the State Department has stated that just under 300 emails related to Libya were provided by the State Department to the Select Committee in response to a November 2014 letter, which contained a broader request for materials than prior requests from the House Oversight and Government Reform Committee.\n\nGiven Clinton's practice of emailing State Department officials on their state.gov addresses, the State Department already had, and had already provided, the Select Committee with emails from Clinton in August 2014 – prior to requesting and receiving printed copies of her emails.\n\nThe review process described above confirmed Clinton's practice of emailing State Department officials on their .gov address, with the vast majority of the printed copies of work-related emails Clinton provided to the State Department simply duplicating what was already captured in the State Department's record-keeping system in real time.\n\nDid Clinton use this account to communicate with foreign officials?\n\nDuring her time at State, she communicated with foreign officials in person, through correspondence, and by telephone. The review of all of her emails revealed only one email with a foreign (UK) official.\n\nDid she withhold any work emails? What about the 15 emails that Sid Blumenthal provided to the Select Committee that she did not provide to the State Department?\n\nShe provided the State Department with all work and potentially work-related emails that she had, including all of her correspondence with Sid Blumenthal. We understand that Mr. Blumenthal had some emails that Clinton did not have, and Clinton had some emails that Mr. Blumenthal did not have, but it is important to note that none of those emails provide any new insights on the attack on our facilities in Benghazi.\n\nDo you think a third party should have been allowed to review what was turned over to the State Department, as well as the remainder that was not?\n\nThe Federal Records Act puts the obligation on the government official, not the agency or a third party, to determine what is and is not a federal record. The State Department Foreign Affairs Manual outlines guidance \"designed to help employees determine which of their e-mail messages must be preserved as federal records and which may be deleted without further authorization because they are not Federal record materials.\" [5 FAM 443.1(c)].\n\nClinton responded to the State Department's request by providing approximately 55,000 pages of her work and potentially work-related emails. She has also taken the unprecedented step of asking that those emails be made public. In doing so, she has sought to support the State Department's efforts, fulfill her responsibility of record-keeping, and provide the chance for the public to assess the work she and officials at the State Department did during her tenure.\n\nAfter her work-related emails were identified and preserved, Clinton chose not to keep her private, personal emails that were not federal records, including emails about her daughter's wedding plans, her mother's funeral service, family vacations, etc.\n\nGovernment officials are granted the privacy of their personal, non-work related emails, including personal emails on .gov accounts. Clinton exercised her privilege to ensure the continued privacy of her personal, non-work related emails.\n\nCan't she release the emails she provided to the State Department herself?\n\nBecause the printed copies of work-related emails she provided to the State Department include federal records of the Department, the Department needs to review these emails before they can be made public. She called for them to be made available as soon as possible, and is glad to see the Department has begun releasing them.\n\nSome of the emails released show Clinton emailed aides at times on their personal, rather than .gov accounts. Was she trying to hide these communications?\n\nAs Clinton has said before, it was her practice to email U.S. government officials on their .gov accounts if it was work-related. This is evidenced in the emails released so far. In reviewing her emails in 2014, there was a fraction of emails with work-related information sent to U.S. government officials’ personal accounts, and those were provided to the State Department. The overwhelming majority of her work-related emails were to .gov accounts.\n\nWhere was the server for her email located?\n\nThe server for her email was physically located on her property, which is protected by U.S. Secret Service.\n\nWhat level of encryption was employed? Who was the service provider?\n\nThe security and integrity of her family's electronic communications was taken seriously from the onset when it was first set up for President Clinton's team. While the curiosity about the specifics of this set up is understandable, given what people with ill intentions can do with such information in this day and age, there are concerns about broadcasting specific technical details about past and current practices. Suffice it to say, robust protections were put in place and additional upgrades and techniques employed over time as they became available, including consulting and employing third party experts.\n\nWas the server ever hacked?\n\nNo, there is no evidence there was ever a breach.\n\nWas there ever an unauthorized intrusion into her email or did anyone else have access to it?\n\nNo.\n\nWhat was done after her email was exposed in February 2013 after the hacker known as \"Guccifer\" hacked Sid Blumenthal’s account?\n\nWhile this was not a breach of Clinton's account, because her email address was exposed, steps were taken at that time to ensure the security and integrity of her electronic communications, including changing her email address.\n\nWas the State Department able to respond to requests related to FOIA or Congressional requests before they received printed copies of her work-related emails?\n\nYes. As the Select Committee has said, the State Department provided the Committee with relevant emails it already had on the state.gov system before the State Department requested any printed copies from former Secretaries, and four months before the State Department received the printed copies.\n\nFor example, in the well-publicized hack of Sid Blumenthal's email account, a note he sent Clinton on September 12, 2012, was posted online. At first blush, one might not think this exchange would be captured on the state.gov system. But in fact, Clinton forwarded the email, that very same day, onto the state.gov system. And the email was produced by the State Department to the Select Committee, and acknowledged by the Select Committee, in August 2014.\n\nThis example illustrates: 1) when an email from a non-\".gov\" sender had some connection to work or might add to the understanding of State Department officials, it was Clinton’s practice to forward it to officials at their \"state.gov\" address; and 2) the State Department was able to search and produce Clinton’s emails when needed long before, and unrelated to, receiving the printed copies as they were already captured on state.gov accounts.", "images": ["https://web.archive.org/web/20151213153516im_/https://a.hrc.onl/p/briefing2015-07-12-the-briefing1-1024x538.jpg", "https://web.archive.org/web/20151213153516im_/https://m.hrc.onl/briefing/2015-07-12-the-briefing1-1024x538.jpg", "https://web.archive.org/web/20151213153516im_/https://a.hrc.onl/p/briefing/img/briefing.svg"], "top_img": "https://web.archive.org/web/20151213153516im_/https://a.hrc.onl/p/briefing2015-07-12-the-briefing1-1024x538.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20151213153516/https://www.hillaryclinton.com/briefing/factsheets/2015/07/13/email-facts/", "title": "Updated: The Facts About Hillary Clinton’s Emails", "meta_data": {"ROBOTS": "NOODP", "google-site-verification": "Kc6DaPL_oFekjW2NlvsUXLwlbQXXtXlAZoIYqNgrhYk", "viewport": "initial-scale=1", "fb": {"app_id": 1032794403401651}, "og": {"title": "Updated: The Facts About Hillary Clinton’s Emails", "description": "We've put all of the facts regarding Hillary Clinton’s emails during her tenure at the State Department in one place as a resource for those seeking this information.", "type": "website", "image": "https://web.archive.org/web/20151213153516im_/https://a.hrc.onl/p/briefing2015-07-12-the-briefing1-1024x538.jpg", "url": "https://web.archive.org/web/20151213153516/https://www.hillaryclinton.com/briefing/factsheets/2015/07/13/email-facts/"}, "twitter": {"title": "Updated: The Facts About Hillary Clinton's Emails", "card": "summary", "image": {"src": "/web/20151213153516im_/https://www.hillaryclinton.com/briefing/factsheets/2015/07/13/email-facts/"}, "url": "https://www.hillaryclinton.com/briefing/factsheets/2015/07/13/email-facts/", "site": "@"}}, "movies": [], "publish_date": 1436716800.0, "source": "https://web.archive.org", "summary": ""}