{"url": "http://www.whitehouse.gov/the-press-office/2013/07/24/remarks-president-economy-knox-college-galesburg-il", "text": "Knox College\n\nGalesburg, Illinois\n\n12:13 P.M. CDT\n\n\n\nTHE PRESIDENT: Hello, Galesburg! (Applause.) Well, it’s good to be home in Illinois! (Applause.) It is good to be back. It’s good to be back. Thank you. Thank you so much, everybody. (Applause.) Thank you. Everybody, have a seat, have a seat. Well, it is good to be back.\n\n\n\nI want to, first of all, thank Knox College -- (applause) -- I want to thank Knox College and your president, Teresa Amott, for having me here today. Give Teresa a big round of applause. (Applause.) I want to thank your Congresswoman, Cheri Bustos, who’s here. (Applause.) We've got Governor Quinn here. (Applause.) I'm told we've got your Lieutenant Governor, Sheila Simon, is here. (Applause.) There she is. Attorney General Lisa Madigan is here. (Applause.)\n\n\n\nI see a bunch of my former colleagues, some folks who I haven't seen in years and I'm looking forward to saying hi to. One in particular I've got to mention, one of my favorites from the Illinois Senate -- John Sullivan is in the house. (Applause.) John was one of my earliest supporters when I was running for the U.S. Senate, and it came in really handy because he’s got, like, 10 brothers and sisters, and his wife has got 10 brothers and sisters -- (laughter) -- so they’ve got this entire precinct just in their family. (Laughter.) And they all look like John -- the brothers do -- so he doesn’t have to go to every event. He can just send one of his brothers out. (Laughter.) It is good to see him.\n\n\n\nDick Durbin couldn’t make it today, but he sends his best. And we love Dick. (Applause.) He’s doing a great job. And we’ve got one of my favorite neighbors, the Senator from Missouri, Claire McCaskill, in the house, because we’re going to Missouri later this afternoon. (Applause.)\n\n\n\nAnd all of you are here, and it’s great to see you. (Applause.) And I hope everybody is having a wonderful summer. The weather is perfect. Whoever was in charge of that, good job. (Laughter.)\n\n\n\nSo, eight years ago, I came here to deliver the commencement address for the class of 2005. Things were a little different back then. For example, I had no gray hair -- (laughter) -- or a motorcade. Didn’t even have a prompter. In fact, there was a problem in terms of printing out the speech because the printer didn’t work here and we had to drive it in from somewhere. (Laughter.) But it was my first big speech as your newest senator.\n\n\n\nAnd on the way here I was telling Cheri and Claire about how important this area was, one of the areas that I spent the most time in outside of Chicago, and how much it represented what’s best in America and folks who were willing to work hard and do right by their families. And I came here to talk about what a changing economy was doing to the middle class -- and what we, as a country, needed to do to give every American a chance to get ahead in the 21st century.\n\n\n\nSee, I had just spent a year traveling the state and listening to your stories -- of proud Maytag workers losing their jobs when the plant moved down to Mexico. (Applause.) A lot of folks here remember that. Of teachers whose salaries weren’t keeping up with the rising cost of groceries. (Applause.) Of young people who had the drive and the energy, but not the money to afford a college education. (Applause.)\n\n\n\nSo these were stories of families who had worked hard, believed in the American Dream, but they felt like the odds were increasingly stacked against them. And they were right. Things had changed.\n\n\n\nIn the period after World War II, a growing middle class was the engine of our prosperity. Whether you owned a company, or swept its floors, or worked anywhere in between, this country offered you a basic bargain -- a sense that your hard work would be rewarded with fair wages and decent benefits, the chance to buy a home, to save for retirement, and most of all, a chance to hand down a better life for your kids.\n\n\n\nBut over time, that engine began to stall -- and a lot of folks here saw it -- that bargain began to fray. Technology made some jobs obsolete. Global competition sent a lot of jobs overseas. It became harder for unions to fight for the middle class. Washington doled out bigger tax cuts to the very wealthy and smaller minimum wage increases for the working poor.\n\n\n\nAnd so what happened was that the link between higher productivity and people’s wages and salaries was broken. It used to be that, as companies did better, as profits went higher, workers also got a better deal. And that started changing. So the income of the top 1 percent nearly quadrupled from 1979 to 2007, but the typical family’s incomes barely budged.\n\n\n\nAnd towards the end of those three decades, a housing bubble, credit cards, a churning financial sector was keeping the economy artificially juiced up, so sometimes it papered over some of these long-term trends. But by the time I took office in 2009 as your President, we all know the bubble had burst, and it cost millions of Americans their jobs, and their homes, and their savings. And I know a lot of folks in this area were hurt pretty bad. And the decades-long erosion that had been taking place -- the erosion of middle-class security -- was suddenly laid bare for everybody to see.\n\n\n\nNow, today, five years after the start of that Great Recession, America has fought its way back. (Applause.) We fought our way back. Together, we saved the auto industry; took on a broken health care system. (Applause.) We invested in new American technologies to reverse our addiction to foreign oil. We doubled wind and solar power. (Applause.) Together, we put in place tough new rules on the big banks, and protections to crack down on the worst practices of mortgage lenders and credit card companies. (Applause.) We changed a tax code too skewed in favor of the wealthiest at the expense of working families -- so we changed that, and we locked in tax cuts for 98 percent of Americans, and we asked those at the top to pay a little bit more. (Applause.)\n\n\n\nSo you add it all up, and over the past 40 months, our businesses have created 7.2 million new jobs. This year, we’re off to our strongest private sector job growth since 1999.\n\n\n\nAnd because we bet on this country, suddenly foreign companies are, too. Right now, more of Honda’s cars are made in America than anyplace else on Earth. (Applause.) Airbus, the European aircraft company, they’re building new planes in Alabama. (Applause.) And American companies like Ford are replacing outsourcing with insourcing -- they’re bringing jobs back home. (Applause.)\n\n\n\nWe sell more products made in America to the rest of the world than ever before. We produce more natural gas than any country on Earth. We’re about to produce more of our own oil than we buy from abroad for the first time in nearly 20 years. (Applause.) The cost of health care is growing at its slowest rate in 50 years. (Applause.) And our deficits are falling at the fastest rate in 60 years. (Applause.)\n\n\n\nSo thanks to the grit and resilience and determination of the American people -- of folks like you -- we’ve been able to clear away the rubble from the financial crisis. We started to lay a new foundation for stronger, more durable economic growth. And it's happening in our own personal lives as well, right? A lot of us tightened our belts, shed debt, maybe cut up a couple of credit cards, refocused on those things that really matter.\n\n\n\nAs a country, we’ve recovered faster and gone further than most other advanced nations in the world. With new American revolutions in energy and technology and manufacturing and health care, we're actually poised to reverse the forces that battered the middle class for so long, and start building an economy where everyone who works hard can get ahead.\n\n\n\nBut -- and here's the big “but” -- I’m here to tell you today that we're not there yet. We all know that. We're not there yet. We've got more work to do. Even though our businesses are creating new jobs and have broken record profits, nearly all the income gains of the past 10 years have continued to flow to the top 1 percent. The average CEO has gotten a raise of nearly 40 percent since 2009. The average American earns less than he or she did in 1999. And companies continue to hold back on hiring those who’ve been out of work for some time.\n\n\n\nToday, more students are earning their degree, but soaring costs saddle them with unsustainable debt. Health care costs are slowing down, but a lot of working families haven’t seen any of those savings yet. The stock market rebound helped a lot of families get back much of what they had lost in their 401(k)s, but millions of Americans still have no idea how they’re going to be able to retire.\n\n\n\nSo in many ways, the trends that I spoke about here in 2005 -- eight years ago -- the trend of a winner-take-all economy where a few are doing better and better and better, while everybody else just treads water -- those trends have been made worse by the recession. And that's a problem.\n\n\n\nThis growing inequality not just of result, inequality of opportunity -- this growing inequality is not just morally wrong, it’s bad economics. Because when middle-class families have less to spend, guess what, businesses have fewer consumers. When wealth concentrates at the very top, it can inflate unstable bubbles that threaten the economy. When the rungs on the ladder of opportunity grow farther and farther apart, it undermines the very essence of America -- that idea that if you work hard you can make it here.\n\n\n\nAnd that’s why reversing these trends has to be Washington’s highest priority. (Applause.) It has to be Washington's highest priority. (Applause.) It’s certainly my highest priority. (Applause.)\n\n\n\nUnfortunately, over the past couple of years, in particular, Washington hasn’t just ignored this problem; too often, Washington has made things worse. (Applause.)\n\n\n\nAnd I have to say that -- because I'm looking around the room -- I've got some friends here not just who are Democrats, I've got some friends here who are Republicans -- (applause) -- and I worked with in the state legislature and they did great work. But right now, what we’ve got in Washington, we've seen a sizable group of Republican lawmakers suggest that they wouldn’t vote to pay the very bills that Congress rang up. And that fiasco harmed a fragile recovery in 2011 and we can't afford to repeat that.\n\n\n\nThen, rather than reduce our deficits with a scalpel -- by cutting out programs we don’t need, fixing ones that we do need that maybe are in need of reform, making government more efficient -- instead of doing that, we've got folks who’ve insisted on leaving in place a meat cleaver called the sequester that's cost jobs. It's harmed growth. It's hurt our military. It's gutted investments in education and science and medical research. (Applause.)\n\n\n\nAlmost every credible economist will tell you it's been a huge drag on this recovery. And it means that we're underinvesting in the things that this country needs to make it a magnet for good jobs.\n\n\n\nThen, over the last six months, this gridlock has gotten worse. I didn't think that was possible. (Laughter.) The good news is a growing number of Republican senators are looking to join their Democratic counterparts and try to get things done in the Senate. So that's good news. (Applause.) For example, they worked together on an immigration bill that economists say will boost our economy by more than a trillion dollars, strengthen border security, make the system work.\n\n\n\nBut you've got a faction of Republicans in the House who won’t even give that bill a vote. And that same group gutted a farm bill that America’s farmers depend on, but also America's most vulnerable children depend on.\n\n\n\nAUDIENCE MEMBER: Booo --\n\n\n\nTHE PRESIDENT: And if you ask some of these folks, some of these folks mostly in the House, about their economic agenda how it is that they'll strengthen the middle class, they’ll shift the topic to “out-of-control government spending” –- despite the fact that we've cut the deficit by nearly half as a share of the economy since I took office. (Applause.)\n\n\n\nOr they’ll talk about government assistance for the poor, despite the fact that they’ve already cut early education for vulnerable kids. They've already cut insurance for people who’ve lost their jobs through no fault of their own. Or they’ll bring up Obamacare -- this is tried and true -- despite the fact that our businesses have created nearly twice as many jobs in this recovery as businesses had at the same point in the last recovery when there was no Obamacare. (Applause.)\n\n\n\nAUDIENCE MEMBER: My daughter has insurance now!\n\n\n\nTHE PRESIDENT: I appreciate that. (Applause.) That’s what this is about. That’s what this is about. (Applause.) That’s what we've been fighting for.\n\n\n\nBut with this endless parade of distractions and political posturing and phony scandals, Washington has taken its eye off the ball. And I am here to say this needs to stop. (Applause.) This needs to stop.\n\n\n\nThis moment does not require short-term thinking. It does not require having the same old stale debates. Our focus has to be on the basic economic issues that matter most to you, the people we represent. That’s what we have to spend our time on and our energy on and our focus on. (Applause.)\n\n\n\nAnd as Washington prepares to enter another budget debate, the stakes for our middle class and everybody who is fighting to get into the middle class could not be higher. The countries that are passive in the face of a global economy, those countries will lose the competition for good jobs. They will lose the competition for high living standards. That’s why America has to make the investments necessary to promote long-term growth and shared prosperity -- rebuilding our manufacturing base, educating our workforce, upgrading our transportation systems, upgrading our information networks. (Applause.) That’s what we need to be talking about. That’s what Washington needs to be focused on.\n\n\n\nAnd that’s why, over the next several weeks, in towns across this country, I will be engaging the American people in this debate. (Applause.) I'll lay out my ideas for how we build on the cornerstones of what it means to be middle class in America, and what it takes to work your way into the middle class in America: Job security, with good wages and durable industries. A good education. A home to call your own. Affordable health care when you get sick. (Applause.) A secure retirement even if you’re not rich. Reducing poverty. Reducing inequality. Growing opportunity. That’s what we need. (Applause.) That’s what we need. That’s what we need right now. That’s what we need to be focused on. (Applause.)\n\n\n\nNow, some of these ideas I’ve talked about before. Some of the ideas I offer will be new. Some will require Congress. Some I will pursue on my own. (Applause.) Some ideas will benefit folks right away. Some will take years to fully implement. But the key is to break through the tendency in Washington to just bounce from crisis to crisis. What we need is not a three-month plan, or even a three-year plan; we need a long-term American strategy, based on steady, persistent effort, to reverse the forces that have conspired against the middle class for decades. That has to be our project. (Applause.)\n\n\n\nNow, of course, we’ll keep pressing on other key priorities. I want to get this immigration bill done. We still need to work on reducing gun violence. (Applause.) We’ve got to continue to end the war in Afghanistan, rebalance our fight against al Qaeda. (Applause.) We need to combat climate change. We’ve got to standing up for civil rights. We’ve got to stand up for women’s rights. (Applause.)\n\n\n\nSo all those issues are important, and we’ll be fighting on every one of those issues. But if we don’t have a growing, thriving middle class then we won’t have the resources to solve a lot of these problems. We won’t have the resolve, the optimism, the sense of unity that we need to solve many of these other issues.\n\n\n\nNow, in this effort, I will look to work with Republicans as well as Democrats wherever I can. And I sincerely believe that there are members of both parties who understand this moment, understand what’s at stake, and I will welcome ideas from anybody across the political spectrum. But I will not allow gridlock, or inaction, or willful indifference to get in our way. (Applause.)\n\n\n\nThat means whatever executive authority I have to help the middle class, I’ll use it. (Applause.) Where I can’t act on my own and Congress isn’t cooperating, I’ll pick up the phone -- I’ll call CEOs; I’ll call philanthropists; I’ll call college presidents; I’ll call labor leaders. I’ll call anybody who can help -- and enlist them in our efforts. (Applause.)\n\n\n\nBecause the choices that we, the people, make right now will determine whether or not every American has a fighting chance in the 21st century. And it will lay the foundation for our children’s future, our grandchildren’s future, for all Americans.\n\nSo let me give you a quick preview of what I’ll be fighting for and why. The first cornerstone of a strong, growing middle class has to be, as I said before, an economy that generates more good jobs in durable, growing industries. That's how this area was built. That's how America prospered. Because anybody who was willing to work, they could go out there and they could find themselves a job, and they could build a life for themselves and their family.\n\n\n\nNow, over the past four years, for the first time since the 1990s, the number of American manufacturing jobs has actually gone up instead of down. That's the good news. (Applause.) But we can do more. So I’m going to push new initiatives to help more manufacturers bring more jobs back to the United States. (Applause.) We’re going to continue to focus on strategies to make sure our tax code rewards companies that are not shipping jobs overseas, but creating jobs right here in the United States of America. (Applause.)\n\n\n\nWe want to make sure that -- we’re going to create strategies to make sure that good jobs in wind and solar and natural gas that are lowering costs and, at the same time, reducing dangerous carbon pollution happen right here in the United States. (Applause.)\n\n\n\nAnd something that Cheri and I were talking about on the way over here -- I’m going to be pushing to open more manufacturing innovation institutes that turn regions left behind by global competition into global centers of cutting-edge jobs. So let’s tell the world that America is open for business. (Applause.) I know there’s an old site right here in Galesburg, over on Monmouth Boulevard -- let’s put some folks to work. (Applause.)\n\n\n\nTomorrow, I’ll also visit the Port of Jacksonville, Florida to offer new ideas for doing what America has always done best, which is building things. Pat and I were talking before I came -- backstage -- Pat Quinn -- he was talking about how I came over the Don Moffitt Bridge. (Applause.) But we’ve got work to do all across the country. We’ve got ports that aren’t ready for the new supertankers that are going to begin passing through the new Panama Canal in two years’ time. If we don’t get that done, those tankers are going to go someplace else. We’ve got more than 100,000 bridges that are old enough to qualify for Medicare. (Laughter and applause.)\n\n\n\nBusinesses depend on our transportation systems, on our power grids, on our communications networks. And rebuilding them creates good-paying jobs right now that can’t be outsourced. (Applause.)\n\n\n\nAnd by the way, this isn’t a Democratic idea. Republicans built a lot of stuff. This is the Land of Lincoln. Lincoln was all about building stuff -- first Republican President. (Applause.) And yet, as a share of our economy, we invest less in our infrastructure than we did two decades ago. And that’s inefficient at a time when it’s as cheap as it’s been since the 1950s to build things. It’s inexcusable at a time when so many of the workers who build stuff for a living are sitting at home waiting for a call.\n\n\n\nThe longer we put this off, the more expensive it will be and the less competitive we will be. Businesses of tomorrow will not locate near old roads and outdated ports. They’ll relocate to places with high-speed Internet, and high-tech schools, and systems that move air and auto traffic faster, and not to mention will get parents home quicker from work because we’ll be eliminating some of these traffic jams. And we can watch all of that happen in other countries, and start falling behind, or we can choose to make it happen right here, in the United States. (Applause.)\n\n\n\nIn an age when jobs know no borders, companies are also going to seek out the countries that boast the most talented citizens, and they’ll reward folks who have the skills and the talents they need -- they’ll reward those folks with good pay.\n\n\n\nThe days when the wages for a worker with a high school degree could keep pace with the earnings of somebody who got some sort of higher education -- those days are over. Everybody here knows that. There are a whole bunch of folks here whose dads or grandpas worked at a plant, didn’t need a high school education. You could just go there. If you were willing to work hard, you might be able to get two jobs. And you could support your family, have a vacation, own your home. But technology and global competition, they’re not going away. Those old days aren’t coming back.\n\n\n\nSo we can either throw up our hands and resign ourselves to diminishing living standards, or we can do what America has always done, which is adapt, and pull together, and fight back, and win. That’s what we have to do. (Applause.)\n\n\n\nAnd that brings me to the second cornerstone of a strong middle class -- and everybody here knows it -- an education that prepares our children and our workers for the global competition that they’re going to face. (Applause.) And if you think education is expensive, wait until you see how much ignorance costs in the 21st century. (Laughter and applause.)\n\n\n\nIf we don’t make this investment, we’re going to put our kids, our workers, and our country at a competitive disadvantage for decades. So we have to begin in the earliest years. And that’s why I’m going to keep pushing to make high-quality preschool available for every 4-year-old in America. (Applause.) Not just because we know it works for our kids, but because it provides a vital support system for working parents.\n\n\n\nAnd I’m going to take action in the education area to spur innovation that don’t require Congress. (Applause.) So, today, for example, as we speak, federal agencies are moving on my plan to connect 99 percent of America’s students to high-speed Internet over the next five years. We’re making that happen right now. (Applause.) We’ve already begun meeting with business leaders and tech entrepreneurs and innovative educators to identify the best ideas for redesigning our high schools so that they teach the skills required for a high-tech economy.\n\n\n\nAnd we’re also going to keep pushing new efforts to train workers for changing jobs. So here in Galesburg, for example, a lot of the workers that were laid off at Maytag chose to enroll in retraining programs like the one at Carl Sandburg College. (Applause.) And while it didn’t pay off for everyone, a lot of the folks who were retrained found jobs that suited them even better and paid even more than the ones they had lost.\n\n\n\nAnd that’s why I’ve asked Congress to start a Community College to Career initiative, so that workers can earn the skills that high-tech jobs demand without leaving their hometown. (Applause.) And I’m going to challenge CEOs from some of America’s best companies to hire more Americans who’ve got what it takes to fill that job opening but have been laid off for so long that nobody is giving their résumé an honest look.\n\n\n\nAUDIENCE MEMBER: More talent!\n\n\n\nTHE PRESIDENT: That, too.\n\n\n\nI’m also going to use the power of my office over the next few months to highlight a topic that’s straining the budgets of just about every American family -- and that’s the soaring cost of higher education. (Applause.) Everybody is touched by this, including your President, who had a whole bunch of loans he had to pay off. (Laughter.)\n\n\n\nThree years ago, I worked with Democrats to reform the student loan system so that taxpayer dollars stopped padding the pockets of big banks, and instead helped more kids afford college. (Applause.) Then, I capped loan repayments at 10 percent of monthly incomes for responsible borrowers, so that if somebody graduated and they decided to take a teaching job, for example, that didn’t pay a lot of money, they knew that they were never going to have to pay more than 10 percent of their income and they could afford to go into a profession that they loved. That’s in place right now. (Applause.) And this week, we’re working with both parties to reverse the doubling of student loan rates that happened a few weeks ago because of congressional inaction. (Applause.)\n\n\n\nSo this is all a good start -- but it isn’t enough. Families and taxpayers can’t just keep paying more and more and more into an undisciplined system where costs just keep on going up and up and up. We’ll never have enough loan money, we’ll never have enough grant money, to keep up with costs that are going up 5, 6, 7 percent a year. We’ve got to get more out of what we pay for.\n\n\n\nNow, some colleges are testing new approaches to shorten the path to a degree, or blending teaching with online learning to help students master material and earn credits in less time. In some states, they’re testing new ways to fund college based not just on how many students enroll, but how many of them graduate, how well did they do.\n\n\n\nSo this afternoon, I’ll visit the University of Central Missouri to highlight their efforts to deliver more bang for the buck to their students. And in the coming months, I will lay out an aggressive strategy to shake up the system, tackle rising costs, and improve value for middle-class students and their families. It is critical that we make sure that college is affordable for every single American who’s willing to work for it. (Applause.)\n\n\n\nNow, so you’ve got a good job; you get a good education -- those have always been the key stepping stones into the middle class. But a home of your own has always been the clearest expression of middle-class security. For most families, that’s your biggest asset. For most families, that’s where your life’s work has been invested. And that changed during the crisis, when we saw millions of middle-class families experience their home values plummeting. The good news is over the past four years, we’ve helped more responsible homeowners stay in their homes. And today, sales are up and prices are up, and fewer Americans see their homes underwater.\n\n\n\nBut we’re not done yet. The key now is to encourage homeownership that isn’t based on unrealistic bubbles, but instead is based on a solid foundation, where buyers and lenders play by the same set of rules, rules that are clear and transparent and fair.\n\n\n\nSo already, I’ve asked Congress to pass a really good, bipartisan idea -- one that was championed, by the way, by Mitt Romney’s economic advisor -- and this is the idea to give every homeowner the chance to refinance their mortgage while rates are still low so they can save thousands of dollars a year. (Applause.) It will be like a tax cut for families who can refinance.\n\n\n\nI’m also acting on my own to cut red tape for responsible families who want to get a mortgage but the bank is saying no. We’ll work with both parties to turn the page on Fannie Mae and Freddie Mac, and build a housing finance system that’s rock-solid for future generations.\n\n\n\nSo we’ve got more work to do to strengthen homeownership in this country. But along with homeownership, the fourth cornerstone of what it means to be middle class in this country is a secure retirement. (Applause.) I hear from too many people across the country, face to face or in letters that they send me, that they feel as if retirement is just receding from their grasp. It’s getting farther and farther away. They can't see it.\n\n\n\nNow, today, a rising stock market has millions of retirement balances going up, and some of the losses that had taken place during the financial crisis have been recovered. But we still live with an upside-down system where those at the top, folks like me, get generous tax incentives to save, while tens of millions of hardworking Americans who are struggling, they get none of those breaks at all. So as we work to reform our tax code, we should find new ways to make it easier for workers to put away money, and free middle-class families from the fear that they won't be able to retire. (Applause.)\n\n\n\nAnd if Congress is looking for a bipartisan place to get started, I should just say they don’t have to look far. We mentioned immigration reform before. Economists show that immigration reform makes undocumented workers pay their full share of taxes, and that actually shores up the Social Security system for years. So we should get that done. (Applause.)\n\n\n\nGood job; good education for your kids; home of your own; secure retirement.\n\n\n\nFifth, I'm going to keep focusing on health care -- (applause) -- because middle-class families and small business owners deserve the security of knowing that neither an accident or an illness is going to threaten the dreams that you’ve worked a lifetime to build.\n\n\n\nAs we speak, we're well on our way to fully implementing the Affordable Care Act. (Applause.) We're going to implement it. Now, if you’re one of the 85 percent of Americans who already have health insurance either through the job or Medicare or Medicaid, you don’t have to do anything, but you do have new benefits and better protections than you did before. You may not know it, but you do. Free checkups, mammograms, discounted medicines if you're on Medicare -- that’s what the Affordable Care Act means. You're already getting a better deal. No lifetime limits.\n\n\n\nIf you don’t have health insurance, then starting on October 1st, private plans will actually compete for your business, and you'll be able to comparison-shop online. There will be a marketplace online, just like you’d buy a flat-screen TV or plane tickets or anything else you're doing online, and you'll be able to buy an insurance package that fits your budget and is right for you.\n\n\n\nAnd if you're one of the up to half of all Americans who’ve been sick or have a preexisting condition -- if you look at this auditorium, about half of you probably have a preexisting condition that insurance companies could use to not give you insurance if you lost your job or lost your insurance -- well, this law means that beginning January 1st, insurance companies will finally have to cover you and charge you the same rates as everybody else, even if you have a preexisting condition. (Applause.) That’s what the Affordable Care Act does. That’s what it does. (Applause.)\n\n\n\nNow, look, I know because I've been living it that there are folks out there who are actively working to make this law fail. And I don’t always understand exactly what their logic is here, why they think giving insurance to folks who don’t have it and making folks with insurance a little more secure, why they think that’s a bad thing. But despite the politically motivated misinformation campaign, the states that have committed themselves to making this law work are finding that competition and choice are actually pushing costs down.\n\n\n\nSo just last week, New York announced that premiums for consumers who buy their insurance in these online marketplaces will be at least 50 percent lower than what they're paying today -- 50 percent lower. (Applause.) So folks' premiums in the individual market will drop by 50 percent. And for them and for the millions of Americans who’ve been able to cover their sick kids for the first time -- like this gentlemen who just said his daughter has got health insurance -- or have been able to cover their employees more cheaply, or are able to have their kids who are younger than -- who are 25 or 26 stay on their parents' plan -- (applause) -- for all those folks, you'll have the security of knowing that everything you’ve worked hard for is no longer one illness away from being wiped out. (Applause.)\n\n\n\nFinally, as we work to strengthen these cornerstones of middle-class security -- good job with decent wages and benefits, a good education, home of your own, retirement security, health care security -- I’m going to make the case for why we've got to rebuild ladders of opportunity for all those Americans who haven't quite made it yet -- who are working hard but are still suffering poverty wages, who are struggling to get full-time work. (Applause.)\n\n\n\nThere are a lot of folks who are still struggling out here, too many people in poverty. Here in America, we’ve never guaranteed success -- that's not what we do. More than some other countries, we expect people to be self-reliant. Nobody is going to do something for you. (Applause.) We've tolerated a little more inequality for the sake of a more dynamic, more adaptable economy. That's all for the good. But that idea has always been combined with a commitment to equality of opportunity to upward mobility -- the idea that no matter how poor you started, if you're willing to work hard and discipline yourself and defer gratification, you can make it, too. That's the American idea. (Applause.)\n\n\n\nUnfortunately, opportunities for upward mobility in America have gotten harder to find over the past 30 years. And that’s a betrayal of the American idea. And that’s why we have to do a lot more to give every American the chance to work their way into the middle class.\n\n\n\nThe best defense against all of these forces -- global competition, economic polarization -- is the strength of the community. So we need a new push to rebuild rundown neighborhoods. (Applause.) We need new partnerships with some of the hardest-hit towns in America to get them back on their feet. And because no one who works full-time in America should have to live in poverty, I am going to keep making the case that we need to raise the minimum wage -- (applause) -- because it's lower right now than it was when Ronald Reagan took office. It's time for the minimum wage to go up. (Applause.)\n\n\n\nWe're not a people who allow chance of birth to decide life’s biggest winners or losers. And after years in which we’ve seen how easy it can be for any of us to fall on hard times -- folks in Galesburg, folks in the Quad Cities, you know there are good people who work hard and sometimes they get a bad break. A plant leaves. Somebody gets sick. Somebody loses a home. We've seen it in our family, in our friends and our neighbors. We've seen it happen. And that means we cannot turn our backs when bad breaks hit any of our fellow citizens.\n\n\n\nSo good jobs; a better bargain for the middle class and the folks who are working to get into the middle class; an economy that grows from the middle out, not the top down -- that's where I will focus my energies. (Applause.) That's where I will focus my energies not just for the next few months, but for the remainder of my presidency.\n\n\n\nThese are the plans that I'll lay out across this country. But I won’t be able to do it alone, so I'm going to be calling on all of us to take up this cause. We’ll need our businesses, who are some of the best in the world, to pressure Congress to invest in our future. And I’ll be asking our businesses to set an example by providing decent wages and salaries to their own employees. And I’m going to highlight the ones that do just that.\n\n\n\nThere are companies like Costco, which pays good wages and offers good benefits. (Applause.) Companies like -- there are companies like the Container Store, that prides itself on training its employees and on employee satisfaction -- because these companies prove that it’s not just good for the employees, it’s good for their businesses to treat workers well. It’s good for America. (Applause.)\n\n\n\nSo I’m going to be calling on the private sector to step up. I will be saying to Democrats we’ve got to question some of our old assumptions. We’ve got to be willing to redesign or get rid of programs that don't work as well as they should. (Applause.) We’ve got to be willing to -- we’ve got to embrace changes to cherished priorities so that they work better in this new age. We can't just -- Democrats can't just stand pat and just defend whatever government is doing. If we believe that government can give the middle class a fair shot in this new century -- and I believe that -- we’ve an obligation to prove it. And that means that we’ve got to be open to new ways of doing things.\n\n\n\nAnd we’ll need Republicans in Congress to set aside short-term politics and work with me to find common ground. (Applause.)\n\n\n\nIt’s interesting, in the run-up to this speech, a lot of reporters say that, well, Mr. President, these are all good ideas, but some of you’ve said before; some of them sound great, but you can't get those through Congress. Republicans won’t agree with you. And I say, look, the fact is there are Republicans in Congress right now who privately agree with me on a lot of the ideas I’ll be proposing. I know because they’ve said so. But they worry they’ll face swift political retaliation for cooperating with me.\n\n\n\nNow, there are others who will dismiss every idea I put forward either because they’re playing to their most strident supporters, or in some cases because, sincerely, they have a fundamentally different vision for America -- one that says inequality is both inevitable and just; one that says an unfettered free market without any restraints inevitably produces the best outcomes, regardless of the pain and uncertainty imposed on ordinary families; and government is the problem and we should just shrink it as small as we can.\n\n\n\nIn either case, I say to these members of Congress: I’m laying out my ideas to give the middle class a better shot. So now it’s time for you to lay out your ideas. (Applause.) You can't just be against something. You got to be for something. (Applause.)\n\n\n\nEven if you think I’ve done everything wrong, the trends I just talked about were happening well before I took office. So it’s not enough for you just to oppose me. You got to be for something. What are your ideas? If you’re willing to work with me to strengthen American manufacturing and rebuild this country’s infrastructure, let’s go. If you’ve got better ideas to bring down the cost of college for working families, let’s hear them. If you think you have a better plan for making sure that every American has the security of quality, affordable health care, then stop taking meaningless repeal votes, and share your concrete ideas with the country. (Applause.)\n\n\n\nRepealing Obamacare and cutting spending is not an economic plan. It’s not.\n\n\n\nIf you’re serious about a balanced, long-term fiscal plan that replaces the mindless cuts currently in place, or if you’re interested in tax reform that closes corporate loopholes and gives working families a better deal, I’m ready to work. (Applause.) But you should know that I will not accept deals that don’t meet the basic test of strengthening the prospects of hardworking families. This is the agenda we have to be working on. (Applause.)\n\n\n\nWe’ve come a long way since I first took office. (Applause.) As a country, we’re older and wiser. I don’t know if I’m wiser, but I’m certainly older. (Laughter.) And as long as Congress doesn’t manufacture another crisis -- as long as we don’t shut down the government just because I’m for keeping it open -- (laughter) -- as long as we don’t risk a U.S. default over paying bills that we’ve already racked up, something that we’ve never done -- we can probably muddle along without taking bold action. If we stand pat and we don’t do any of the things I talked about, our economy will grow, although slower than it should. New businesses will form. The unemployment rate will probably tick down a little bit. Just by virtue of our size and our natural resources and, most of all, because of the talent of our people, America will remain a world power, and the majority of us will figure out how to get by.\n\n\n\nBut you know what, that’s our choice. If we just stand by and do nothing in the face of immense change, understand that part of our character will be lost. Our founding precepts about wide-open opportunity, each generation doing better than the last -- that will be a myth, not reality. The position of the middle class will erode further. Inequality will continue to increase. Money’s power will distort our politics even more.\n\n\n\nSocial tensions will rise, as various groups fight to hold on to what they have, or start blaming somebody else for why their position isn’t improving. And the fundamental optimism that’s always propelled us forward will give way to cynicism or nostalgia.\n\n\n\nAnd that’s not the vision I have for this country. It’s not the vision you have for this country. That’s not the America we know. That’s not the vision we should be settling for. That’s not a vision we should be passing on to our children.\n\n\n\nI have now run my last campaign. I do not intend to wait until the next campaign or the next President before tackling the issues that matter. I care about one thing and one thing only, and that’s how to use every minute -- (applause) -- the only thing I care about is how to use every minute of the remaining 1,276 days of my term -- (laughter) -- to make this country work for working Americans again. (Applause.) That’s all I care about. I don’t have another election. (Applause.)\n\n\n\nBecause I’ll tell you, Galesburg, that’s where I believe America needs to go. I believe that’s where the American people want to go. And it may seem hard today, but if we’re willing to take a few bold steps -- if Washington will just shake off its complacency and set aside the kind of slash-and-burn partisanship that we’ve just seen for way too long -- if we just make some common-sense decisions, our economy will be stronger a year from now. It will be stronger five years from now. It will be stronger 10 years from now. (Applause.)\n\n\n\nIf we focus on what matters, then more Americans will know the pride of that first paycheck. More Americans will have the satisfaction of flipping the sign to “Open” on their own business. More Americans will have the joy of scratching the height of their kid on that door of their brand-new home. (Applause.)\n\n\n\nAnd in the end, isn't that what makes us special? It's not the ability to generate incredible wealth for the few; it's our ability to give everybody a chance to pursue their own true measure of happiness. (Applause.) We haven’t just wanted success for ourselves -- we want it for our neighbors, too. (Applause.)\n\n\n\nWhen we think about our own communities -- we're not a mean people; we're not a selfish people; we're not a people that just looks out for “number one.” Why should our politics reflect those kinds of values? That’s why we don’t call it John’s dream or Susie’s dream or Barack’s dream or Pat's dream -- we call it the American Dream. And that’s what makes this country special -- the idea that no matter who you are or what you look like or where you come from or who you love, you can make it if you try. (Applause.) That’s what we're fighting for.\n\n\n\nSo, yes, Congress is tough right now, but that’s not going to stop me. We're going to do everything we can, wherever we can, with or without Congress, to make things happen. We're going to go on the road and talk to you, and you'll have ideas, and we want to see which ones we can implement. But we're going to focus on this thing that matters.\n\n\n\nOne of America’s greatest writers, Carl Sandburg, born right here in Galesburg over a century ago -- (applause) -- he saw the railroads bring the world to the prairie, and then the prairie sent out its bounty to the world. And he saw the advent of new industries, new technologies, and he watched populations shift. He saw fortunes made and lost. And he saw how change could be painful -- how a new age could unsettle long-held customs and ways of life. But he had that frontier optimism, and so he saw something more on the horizon. And he wrote, “I speak of new cities and new people. The past is a bucket of ashes. Yesterday is a wind gone down, a sun dropped in the west. There is only an ocean of tomorrows, a sky of tomorrows.”\n\n\n\nWell, America, we’ve made it through the worst of yesterday’s winds. We just have to have the courage to keep moving forward. We've got to set our eyes on the horizon. We will find an ocean of tomorrows. We will find a sky of tomorrows for the American people and for this great country that we love.\n\n\n\nSo thank you. God bless you. And God bless the United States of America. (Applause.)\n\n\n\nEND\n\n1:17 P.M. CDT", "images": ["https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "https://obamawhitehouse.archives.gov/profiles/forall/modules/custom/gov_whitehouse_www/images/icons/wh_logo_seal.png"], "top_img": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "keywords": [], "authors": [], "canonical_link": "https://obamawhitehouse.archives.gov/the-press-office/2013/07/24/remarks-president-economy-knox-college-galesburg-il", "title": "Remarks by the President on the Economy -- Knox College, Galesburg, IL", "meta_data": {"msapplication-square70x70logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-TileImage": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-square150x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x150.png", "msapplication-square310x310logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x310.png", "msapplication-TileColor": "#003C80", "application-name": "Whitehouse", "msapplication-config": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/browserconfig.xml", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "whitehouse.gov", "type": "article", "title": "Remarks by the President on the Economy -- Knox College, Galesburg, IL", "url": "https://obamawhitehouse.archives.gov/the-press-office/2013/07/24/remarks-president-economy-knox-college-galesburg-il", "description": "Knox College Galesburg, Illinois", "updated_time": "2013-07-24T15:51:57-04:00", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "secure_url": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "type": "image/jpeg", "width": 240, "height": 240}}, "twitter": {"card": "summary", "site": "@WhiteHouse", "creator": "@WhiteHouse", "title": "Remarks by the President on the Economy -- Knox College, Galesburg, IL", "url": "https://obamawhitehouse.archives.gov/the-press-office/2013/07/24/remarks-president-economy-knox-college-galesburg-il", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "width": 240, "height": 240}}, "article": {"published_time": "2013-07-24T15:44:00-04:00", "modified_time": "2013-07-24T15:51:57-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width"}, "movies": [], "publish_date": 1374595200.0, "source": "http://www.whitehouse.gov", "summary": ""}