{"url": "https://www.elitedaily.com/p/rachel-lindsays-advice-to-arie-luyendyk-jr-is-the-simplest-thing-ever-6774935", "text": "If you have seen the recent promos for The Bachelor, you know that we'll all be walking into 2018 with Janu-Arie. *Cough, cough.* Cheesiness aside, Arie Luyendyk Jr. will start his journey to find love promptly on Jan. 1, 2018. While having dozens of women vying for your heart on national television seems like it could be fun, it can also be pretty daunting. Luckily, former Bachelorette and national sweetheart Rachel Lindsay swooped in with simple and sound advice. Rachel Lindsay's advice to Arie is honestly so obvious I wish I would've tweeted it first.\n\nRachel and her Miami-raised fiancé, Bryan Abasolo, were recently on the red carpet for KIIS FM's 2017 iHeartRadio Jingle Ball. The first couple of reality television generously unveiled their best tips for Arie and the new adventure he's about to embark on. Rachel told E! News,\n\nWe're just like 'Be yourself.' You can't go wrong with that.\n\nSuch clear and straightforward advice. It may seem effortless for someone like Rachel who is beautiful, smart, and classy, but what if \"being yourself\" doesn't come as easily to Arie? Bryan luckily had a few more tidbits to share. He said,\n\nPut your heart on your sleeve. Just lay it out there. Get those emotions out of everybody and make the most out of every relationship you have with each woman.\n\nE! Live from the Red Carpet on YouTube\n\nThese two are obviously the experts in finding love in unexpected and (some would say) hopeless places. The two have been going strong since Bryan's proposal at the end of Rachel's season.\n\nThe feelings of love seem to be so, so real between the two. After the engagement secret was out, Bryan took to Instagram to gush over his bride-to-be. He said in the Aug. 8 post,\n\n@rachellindsay Rachel my love my rock!! It's felt like forever, but the wait is finally over!!! No longer do I have to hide the fact that you are and always have been the one for me! No longer do I have to keep secret how in love w you I truly am from the rest of the world! Hearing you say \"yes\" on the top of that castle in Spain was the greatest moment of my life! I was optimistic about what could be prior to stepping out of that limo but never in my wildest dreams could I had foreseen us building such a strong foundation and deep bond in the last 6 months. Every single day literally gets better and better with you and reaffirms that God placed you in my path for a reason. We've gone through so much...the ups, the downs, the challenges...but in the end, what shines above all else is the deep love, loyalty, respect and admiration we have for each other and that's what will continue to carry us through into our future. I can't wait to start our new life together full of fun and adventure! I am so blessed and lucky to have you and I promise to cherish you forever! I love you baby! #whenyouknowyouknow#thebacheloretteabc #bachelornation\n\nWhile most people are skeptical when it comes to finding love on reality television, Rachel and Bryan have seemingly found the secret to making it work.\n\nCindy Ord/Getty Images Entertainment/Getty Images\n\nThere was some controversy when fans thought Rachel made the wrong choice and should have ended up with Peter Kraus. I totally thought that the same thing at one time, too. However, after seeing Rachel and Bryan together and listening to a lot of interviews with them — they honestly seem like a great couple. I have even rewatched their proposal, and it's so much better than people give it credit for. During Bryan's proposal he said,\n\nThat first night, it was like a chemistry bomb. You are everything I could ever want in a woman, a wife, a person. I am totally head over heels in love with you. I just hope you feel the same.\n\nRachel then said,\n\nMy heart has never been more confused. I've always been drawn to gambling my feelings on complicated relationships. … Right here in this moment, I see my forever. I just want to tell you that I love you, and I can't imagine spending my life without you.\n\nIf you take one thing away from this article it should be that Bryan and Rachel are awesome. Also, being yourself is apparently the best thing you can do, according to Rachel. Great advice. I LOVE YOU, RACHEL, CALL ME.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2017/12/4/4814391b-9e71-49ba-9c4e-494fbe0b4104-getty-884092020.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2017/12/4/4814391b-9e71-49ba-9c4e-494fbe0b4104-getty-884092020.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/3/30/48da1b77-8b6c-4358-b40d-8f225a278850-getty-1166319954.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/7/79039556-36c4-4922-b83d-ab2333995aae-getty-1200238651.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2017/12/4/2e40dab6-925d-4197-bce1-611120376400-getty-845706470.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/7/9d677fca-2cdd-4b47-86ea-ab896b987684-getty-1206495955.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/12/4/4814391b-9e71-49ba-9c4e-494fbe0b4104-getty-884092020.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/rachel-lindsays-advice-to-arie-luyendyk-jr-is-the-simplest-thing-ever-6774935", "title": "Rachel Lindsay's Advice To Arie Luyendyk Jr. Is The Simplest Thing Ever", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/rachel-lindsays-advice-to-arie-luyendyk-jr-is-the-simplest-thing-ever-6774935", "type": "article", "title": "'Bachelorette' Rachel Lindsay Gave The Simplest Advice To New 'Bachelor' Arie", "description": "If you have seen the recent promos for The Bachelor, you know that we'll all be walking into 2018 with Janu-Arie. *Cough, cough.* Cheesiness aside, Arie Luyendyk Jr. will start his journey to find love promptly on Jan. 1, 2018. While having dozens…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/12/4/4814391b-9e71-49ba-9c4e-494fbe0b4104-getty-884092020.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "If you have seen the recent promos for The Bachelor, you know that we'll all be walking into 2018 with Janu-Arie. *Cough, cough.* Cheesiness aside, Arie Luyendyk Jr. will start his journey to find love promptly on Jan. 1, 2018. While having dozens…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}