{"url": "http://www.eternallifestyle.com/living/famous-young-hollywood-stars-then-and-now-fb/", "text": "Natalie Portman Natalie Portman made her first movie debut at the young age of 13 when she appeared alongside Jean Reno in Leon: The Professional. After her initial on-screen appearance, Portman soon grabbed the attention of high-profile casting agents and landed herself major roles in Beautiful Girls and George Lucas’s Star Wars prequel trilogy, as Padme Amidala. Today, Portman is still one of the biggest names in Hollywood and has recently starred as the First Lady, Jacqueline Kennedy in Pablo Larrain’s bio-drama, Jackie.\n\nJennifer Love Hewitt Jennifer Love Hewitt got her big break at 10-years-old after she was chosen to star on Disney’s Kids Incorporated. After this initial stint, she went on to star in Sister Act: Back in the Habit, I Know What You Did Last Summer, Time of Your Life, and more recently, starred in Criminal Minds from 2014 to 2015 as Kate Callahan.\n\nZac Efron Zac Efron is one of the most prominent child stars of recent years and began acting during his adolescent years with guest roles on numerous TV shows such as ER. However, he got his big break in the movie franchise and everyone’s favorite guilty pleasure, High School Musical when he was just 18-years-old, which skyrocketed his career, and made him the biggest heart-throb for young girls worldwide. He has recently appeared in Bad Neighbors 1 and 2, and Baywatch and is due to start shooting a new movie, in which he stars as the serial killer, Ted Bundy.\n\nEmma Watson With the brains, the talents and the looks Emma Watson has everything. Watson shot to fame at the age of 9-years-old, when she was cast in the hugely popular Harry Potter film as Hermione Granger. Outside of the magical world, Watson made her second Hollywood debut in 2013 in Perks of Being a Wallflower and The Bling Ring. More recently, she appeared in the 2017 live-action adaptation of Beauty and the Beast and continues her work with the UN as a UN Women Goodwill Ambassador. She is an advocate for women’s rights.\n\nTaylor Swift Everyone has heard of T-Swizzle, whether you like pop and country music or not. At the age of 14, Swift and her family moved to Nashville to pursue her music career – and it definitely paid off! That same year, Swift was offered a recording contract and became the youngest ever artist to be signed by Sony/ATV. Nowadays, Taylor Swift has sold over 40 million albums worldwide, received 21 Billboard Music Awards, 10 Grammy Awards, 11 Country Music Awards and much more.\n\nTaylor Lautner Although he began appearing in small roles from the age of 9, Taylor Lautner first graced the big screen with his adorable face in 2005 in The Adventures of Sharkboy and Lavagirl – little did he know his career had barely started. In 2007, he was cast as Jacob Black in The Twilight saga and became everyone’s teen heartthrob (if you were Team Jacob, of course). From that moment on his life changed. Now, he spends most of his time working on TV shows such as Cuckoo and Scream Queens.\n\nAlexa Vega Alexa Vega was one of our favorite child stars. Vega was cast in the first Spy Kids movie at the age of 13, and appeared in the subsequent sequels – and she did all of her own stunts! After saving the world, Alexa was in high demand, with many casting agencies looking for everything this child star had to offer. Since her child star days, Alexa’s career has dwindled, but she did appear on Dancing With The Stars in 2015. Pretty cool.\n\nAlyssa Milano You probably recognize Alyssa Milano from the awesome TV show, Charmed. But before she started using the Power of Three, Milano had a hugely successful child acting career. At just 12-years-old, Milano was cast in ABC’s sitcom, Who’s the Boss? After taking a little break from acting to focus on her family life, Milano will be returning with a bang to star in the 2017 reboot, Wet Hot American Summer: Ten Years Later.\n\nBonnie Wright Wright rose to fame at just 10-years-old in her first professional acting debut in Harry Potter and the Philosopher’s Stone. Despite the fact she only had a small role in the first movie, Wright soon became a huge player in the franchise, and even ends up marrying Harry Potter himself! After her time on Harry Potter, Bonnie starred in numerous TV shows and movies but spends most of her time creating and producing movies for her own company, Bon Bon Lumiere.\n\nJustin Timberlake Before he became a singing sensation and pop idol, Justin rose to fame as child actor and singer in The All-New Mickey Mouse Club at the age of 13, alongside Christina Aguilera, Ryan Gosling, and JC Chasez. Since then, JT has been in the public limelight for all of his life, throughout his time in NSYNC, and his current role as both a musician and an actor. His next movie role will be in Woody Allen’s Wonder Wheel. He is married to the beautiful actress Jessica Biel and has a son.\n\nChristina Ricci Christina Ricci snapped up her first acting debut at the age of 10 in the 1990 movie, Mermaids along side the legendary Cher. Later appeared in Cher’s ‘Shoop Shoop Song’ music video. The next year, Ricci was cast as the ominous Wednesday Addams in The Addams Family. After this, she appeared in the live-action Caspar, as well as Buffalo ‘66, Sleepy Hollow and more. She currently stars as Zelda Fitzgerald in the Amazon period drama, Z: The Beginning of Everything.\n\n\n\nHilary Duff Hilary Duff/Lizzie McGuire was a teen idol for many growing up in the 90’s. The singer and actress scored her lead acting gig at the age of 14 and soon went on to star in Cheaper by the Dozen, Agent Cody Banks, A Cinderella Story and more – as well as launching her solo music career. She now focuses on raising her son and acts in the hugely popular TV show Younger.\n\nNicholas Hoult Baby-faced Nicholas Hoult made his first professional acting debut at the age of 7 in Intimate Relations but received international recognition for his portrayal of the bullied schoolboy, Marcus Brewer in the British-American movie, About A Boy. After this, he appeared on the popular British television show Skins. He is now taking over the world of Hollywood and has starred in the recent X-Men films, as well as Mad Max: Fury Road. He also stars in the upcoming movie, The Current War, which sees Hoult play Nikola Tesla.\n\nMichelle Trachtenberg You may know her as the hated Georgina Sparks from Gossip Girl, but before Michelle was ruining the lives of those on the Upper East Side, she was a hugely popular child actress. From an early age Michelle appeared in hundreds of TV commercials, before landing her first breakout role in Harriet and the Spy in 1996. Since then, Michelle has worked on Buffy The Vampire Slayer, Black Christmas and 17 Again. She hasn’t appeared on our screens since 2016, so we hope to see her soon!\n\nKristen Stewart At just 12-years-old, Kristen was cast alongside Jodie Foster in the hit movie, Panic Room. Nowadays, Stewart is most known for her role of Bella in the Twilight Saga but has since branched out into more independent and unique movies, like Clouds of Sils Maria, Adventureland, and Into The Wild. She currently has a few new movies in the works.\n\nDakota Fanning Dakota Fanning is perhaps one of the most well-known child stars out there, and started off pretty young – at just 7-years-old! She was first cast in the movie, I Am Sam, and then went to star in The Cat in the Hat, Uptown Girls, Charlotte’s Web, Coraline, the Twilight Saga, and more. Fanning is currently filming a movie adaptation of the classic novel, The Bell Jar, and has also joined the cast of the 2018 movie, Ocean’s Eight.\n\nPaul Butcher Paul has grown up to be a dashing lad. He first rose to fame from a young and extremely cute age, as Dustin Brooks on the popular Disney show, Zoey 101. Since then, he has had a rather slow and steady acting career, appearing in guest roles on Criminal Minds, Comedy Bang Bang and King of the Hill. He is currently in his final year of study at the University of California, we wonder if he will have any more breakout roles soon.. we hope so.\n\nShia LaBeouf Controversy is never far away from the Shia LaBeouf name, even when he was a child star! Shia made debuted his acting talents in the early 2000s as Louis Stevens on the popular Disney show, Even Stevens. Since then, Shia has appeared in major movies such as Indiana Jones and the Kingdom of the Crystal Skull, I, Robot and Transformers, but is mostly known for his political views and activism – which he definitely doesn’t keep quiet! Let’s just say he’s been arrested a fair few times. He recently has had many outbursts in front of paparazzi and the public, and even declared that he quit acting.\n\n\n\nJonathan Lipnicki Jonathan Lipnicki made his debut at the tender age of 6 alongside Renee Zellweger in Jerry Maguire but is best known for playing George Little in the family favorite, Stuart Little. After this role, Lipnicki’s movie career dwindled, and he now spends most of his time practicing his mixed martial arts skills and appearing in independent films. Lipnicki also spends time working with animal rights charities and groups. Look at the physique!\n\nJerry O’Connell Jerry O’Connell landed his first acting role on Stephen King’s Stand By Me at just 11 years old and has since appeared in the likes of Calendar Girl, Camp Wilder, Jerry Maguire, Kangaroo Jack and so much more. More recently, O’Connell has moved from movies to musicals and has worked as a ghostwriter and performer on Broadway plays.\n\nLee Norris Lee Norris was often stereotyped into the ‘nerd’ category during his acting years from a young age. Norris first appeared on our screens in Boy Meets World. After this, Norris was awarded a main role in the hit teen series, One Tree Hill. Norris is still acting today, having recently appeared in five episodes of the Boy Meets World spin-off show, Girl Meets World.\n\nNicole Richie As the daughter of music legend, Lionel Richie, Nicole was used to the limelight – but didn’t really get a lot of it during her child star days. While appearing on the reality show, The Simple Life, Nicole’s co-star and best friend, Paris Hilton often overshadowed her. After five seasons, the show was scrapped and has since worked on her own reality TV show. Along with her husband, Joel Madden, they have also created their own children’s foundation called The Richie Madden Children’s Foundation. She has her own clothing line House Of Harlow, named after her daughter.\n\n\n\nAnna Chlumsky She’s our girl. Child star, Anna Chlumsky was offered her first acting gig at 11-years-old as the lead role, Vada Sultenfuss, in My Girl, and later My Girl 2. She then starred in Trading Mom in 1994, before taking a break from acting to focus on her studies. Chlumsky returned to the world of acting in 2006 and has since worked on TV and on the stage. She will soon be appearing on season four of Halt and Catch Fire. We loved My Girl, it will always be a classic.\n\nCandace Cameron-Bure Candace became one of the most notable child stars in the business – after appearing as DJ Tanner on Full House. Post Full House, Candace used her status as DJ Tanner to appear on a plethora of TV shows, including That’s So Raven, Boy Meets World and Make It Or Break It. In 2015, Candace returned to her role as DJ Tanner on the Netflix spin-off, Fuller House.\n\nLindsay Lohan The actress made her first movie debut at the age of 11 in Disney’s 1998 The Parent Trap. After this, Lohan’s career was set – and she soon landed major movie roles in Freaky Friday, Mean Girls, and Herbie Fully Loaded. Growing up she was one of the hottest celebs in Hollywood and landed many magazine covers and even recorded her own album. However, the actress began to struggle with the pressures of fame. She may have fallen off the bandwagon, but she is slowly building back up her reputation and is starring in television shows this year.\n\nAbigail Breslin After appearing in commercials, Breslin had small roles in Signs and the Princess Diaries 2, but her breakout role came in 2006 in the film, Little Miss Sunshine, in which she was the lead role and was nominated for numerous awards. She touched our hearts in this movie. Recently, Breslin has appeared in Scream Queens and was cast as ‘Baby’ in the 2017 remake of Dirty Dancing.\n\nJaleel White Jaleel White landed his most notable acting job at the age of 12, as a guest star on Family Matters. Appearing as funny-man Steve Urkel, Jaleel was only meant to be on just one episode but proved so popular that producers kept him on as a regular! After the show, Jaleel worked on Grown Ups and provided the voice for Sonic in the Sonic the Hedgehog video games. He has since been pretty quiet on the acting front but has written a comedy sketch show which will make its debut in the fall of 2017.\n\nKelly Osbourne Well, she’s certainly ditched the eyeliner! As the daughter of the legendary Ozzy Osbourne and Sharon Osbourne, Kelly was brought up surrounded by TV cameras – especially during the filming of their reality show, The Osbournes. Nowadays, Kelly can be found presenting TV shows such as Project Runway Junior and judging on the panel of Australia’s Got Talent, as well as building her own fashion line. Most recently, she’s had her own character in the 2017 Captain Underpants movie! She has definitely strayed from her rocker Emo days.\n\nKeke Palmer At just 9-years-old, Keke Palmer was already a huge name in the acting and singing world, Palmer recorded songs for movie soundtracks and even appeared in them. However, her breakthrough role came in 2006, when she starred as the lead spelling bee champ in Akeelah and the Bee. Since then, Palmer’s career has been non-stop, continuing her singing, acting, and hosting duties.\n\nKirsten Dunst Dunst was no stranger to fame from a young age, appearing in TV commercials from the age of three. Three years later, Dunst broke into the movie business, when she appeared in Woody Allen’s Oedipus Wrecks. Since then, she has bombarded the world of Hollywood with her talents in the likes of Bring It On, Spider-Man, Jumanji, Marie Antoinette, and more. This year, she will star in The Beguiled, and Woodshock. She will always be our favorite cheerleader.\n\n\n\nMatthew Lewis Matthew Lewis began acting at 5-years-old but earned his first major role in 2001 as Neville Longbottom in the Harry Potter franchise. Throughout the franchise, fans watched him grow up into the good looking man he is today. Recently, he has starred in the hit movie, Me Before You, and appeared in popular BBC television series, such as Bluestone 42 and The Syndicate.\n\nNicola Peltz If you’re a fan of The Last Airbender you’ll recognize Nicola Peltz as Katara. Katara bagged the role at the age of 11 and has since become one of the most promising young actresses in Hollywood. Peltz has recently starred in Bates Motel, Transformers: Age of Extinction and Youth in Oregon, and is currently in the post-production process of two new movies – Our House, and Alex Pettyfer’s directorial debut, Back Roads.\n\nAdrian Grenier Who knew, Grenier has actually been acting for over 20 years! Adrian made his debut in the indie film, Arresting Gena and impressed casting directors so much he then starred alongside Melissa Joan Hart in Drive Me Crazy. Since then, Grenier has continued to wow us with his roles in the movie adaptation of Entourage, and The Devil Wears Prada. He is a Hollywood hunk that so many women swoon over.\n\nFreddie Highmore It was no surprise when Freddie Highmore made his acting debut at 7-years-old, considering his whole family work within show business! As a child star, Highmore appeared in Women Talking Dirty, Charlie and the Chocolate Factory, Jack and the Beanstalk: The Real Story and more. Recently, Highmore has taken a step behind the camera, and has delved into the world of screenwriting – and has even written numerous episodes for the show in which he stars, Bates Motel.\n\nAlex D. Linz Alex D. Linz was just 7-years-old when he made his professional acting debut on the popular TV series, Cybill. Throughout the ‘90s, Linz also took over from Macauley Culkin in Home Alone 3 and even voiced the character of Tarzan in the 1999 animated movie! Despite his pretty impressive career as a child actor, Alex D. Linz has now left the acting world and hasn’t been in any TV show or movie since 2007.\n\nKylie Jenner If you keep up with the Kardashians, you’ll know that Kylie Jenner is the youngest sibling in the Kardashian/Jenner clan. As the daughter of Olympic medalist Bruce Jenner (now Caitlyn Jenner) and Kris Kardashian, Kylie first appeared on our screens at the age of 10 on their popular reality TV show, Keeping Up With the Kardashians. Kylie is a mogul in her own right, she has created her own career through her impressive social media profile and built up her own brand with a makeup line, and a clothing line with her sister Kendall. She is also known for plumping up her lips and bra size….\n\nJosh Peck Peck is know for the funny Nickelodeon show Drake and Josh, but he actually made his first professional acting debut at the age of 13, where he appeared on The Amanda Show. Since his younger years, Peck has slimmed down and starred in Ice Age: Continental Drift and Ice Age: Collision Course as well as the upcoming Netflix original movie, Take the 10. He’s also recently tied the knot. Congrats, Josh! We wonder if Drake was invited….\n\nNeil Patrick Harris One of Neil Patrick Harris’s earliest bookings as a child actor was on the popular TV show, Doogie Howser, M.D in which he played the coolest child doctor – and even gained a Golden Globe Award nomination! After this, Harris’s cute-as-a-button face was snapped up to star in numerous TV and film roles, and he soon smoothly transitioned into one of the best actors in the world of adult acting, both on screen and on the stage. He is currently starring in Netflix’s Series of Unfortunate Events reboot as the evil Count Olaf.\n\nMacauley Culkin\n\nMark-Paul Gosselaar Unsurprisingly, Mark-Paul Gosselaar still looks amazing. We were a little heartbroken when he went brunette, but we’ve gotten used to his new look and we love it. He may always remain Zack Morris to us, but MPG did go on to create another name for himself. For four seasons he was on Franklin & Bash with another former ’90s star, Breckin Meyer. He stars in the NBC show People Are Talking.\n\nTiffani-Amber Thiessen As we all might remember, after Saved By The Bell, Tiffani went on to star on Beverly Hills, 90210 for a few seasons as Valerie Malone, a very different character from Kelly Kapowski. In 2005 she married Brady Smith and the couple have two children together. Some of her more recent work includes voicing Misty the Mermaid on Jake and the Neverland Pirates and playing Elizabeth Burke on White Collar.\n\nElizabeth Berkley Jessie from Saved By The Bell, went on to star in Show Girls back in the mid ’90s. So it was no surprise to us when Elizabeth appeared on season 17 of Dancing With The Stars. Despite her excellent judges’ scores, she was voted off early and finished in 6th place. She’s sticking with dancing now, recently rehearsing in the studios with some of the So You Think You Can Dance crew. She also runs the website Ask Elizabeth, which is a self help resource meant for teenage girls.\n\nDustin Diamond Unlike some of his former Saved By The Bell cast members, Dustin Diamond hasn’t had the most glamorous career post Saved By The Bell. In 2006 he released his own sex tape, Screeched – Saved By The Smell, though he later tried to claim he used a stunt double in the tape. In 2009 he released Behind The Bell, his point-of-view from his SBTB days, featuring some very unflattering stories about his former friends. Around Christmas in 2014, he got into a bar fight and apparently stabbed someone. In June of 2015, he was sentenced to 4 months in jail for this incident.\n\nMara Wilson Mara Wilson played the bright, supernaturally gifted and often mistreated title character in ‘Matilda.’ Wilson was already an established actress at the time of the film’s release, having starred in ‘Miracle on 34th Street’ and ‘Mrs. Doubtfire.’ Wilson’s last mainstream role was 2000’s ‘Thomas and the Magic Railroad.’ She graduated from New York University in 2009 and has stated she stopped acting. These days Wilson is a writer, and her home is the blog ‘Mara Wilson Writes Stuff.’", "images": ["https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124951/135.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124921/219.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09120755/Screen-Shot-2018-05-09-at-3.07.28-PM-1024x692.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124955/156.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125011/236.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124952/146.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125046/382.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125016/256.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125036/332.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124958/176.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09120041/Screen-Shot-2018-05-09-at-2.59.42-PM-1024x681.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125047/392.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125002/196.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125048/402.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124946/119.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125000/186.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124956/165.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125040/352.jpg", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_footer.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09120025/Screen-Shot-2018-05-09-at-2.59.14-PM-1024x596.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125027/296.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124925/317.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125029/306.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124943/106.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125007/2110.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125020/274.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09120013/Screen-Shot-2018-05-09-at-2.59.06-PM-1024x667.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125032/318.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09120033/Screen-Shot-2018-05-09-at-2.59.25-PM-1024x676.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124932/66.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124917/118.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124948/125.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125034/322.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124928/416.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124938/86.jpg", "https://www.facebook.com/tr?id=382791848977127&ev=PageView&noscript=1", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124941/95.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125044/372.jpg", "http://trc.taboola.com/1021215/log/3/unip?en=page_view", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125042/362.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/09115828/Screen-Shot-2018-05-09-at-2.57.52-PM-1024x670.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125004/206.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124935/75.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125009/225.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124930/512.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125014/245.jpg", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125018/266.jpg", "https://www.eternallifestyle.com/wp-content/themes/unified/images/logo_v2.png", "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125023/286.jpg"], "top_img": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124917/118.jpg", "keywords": [], "authors": ["Mark Parker", "Elizabeth Bartov", "John Brooks", "Becca Bridges", "Brandon Strauss"], "canonical_link": "https://www.eternallifestyle.com/living/famous-young-hollywood-stars-then-and-now-fb/", "title": "Famous Young Hollywood Stars: Then And Now", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "Famous Young Hollywood Stars: Then And Now | EternalLifestyle", "description": "Natalie Portman made her first movie debut at the young age of 13 when she appeared alongside Jean Reno in Leon: The Professional.  After her initial on-screen appearance, Portman soon grabbed the attention of high-profile casting agents and landed herself major roles in Beautiful Girls and George Lucas’s Star Wars prequel trilogy, as Padme Amidala. …", "url": "https://www.eternallifestyle.com/living/famous-young-hollywood-stars-then-and-now-fb/", "site_name": "EternalLifestyle", "updated_time": "2018-05-09T12:09:14+00:00", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28125048/402.jpg"}, "article": {"section": "Living", "published_time": "2018-05-07T14:46:31+00:00", "modified_time": "2018-05-09T12:09:14+00:00"}, "twitter": {"card": "summary", "description": "Natalie Portman made her first movie debut at the young age of 13 when she appeared alongside Jean Reno in Leon: The Professional.  After her initial on-screen appearance, Portman soon grabbed the attention of high-profile casting agents and landed herself major roles in Beautiful Girls and George Lucas’s Star Wars prequel trilogy, as Padme Amidala. […]", "title": "Famous Young Hollywood Stars: Then And Now | EternalLifestyle", "image": "https://d1v3t0rdobjdgs.cloudfront.net/wp-content/uploads/2017/09/28124917/118.jpg"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1525704391.0, "source": "http://www.eternallifestyle.com", "summary": ""}