{"url": "https://themuse.jezebel.com/when-iggy-azalea-met-the-hollywood-medium-nightmares-c-1823789536", "text": "No offense to all the dead people out there, but you all have some washed-up friends. That’s at least what the evidence suggests by the typically C-to-F-list caliber talent Hollywood Medium with Tyler Henry attracts, celebs who are seemingly hard-up for work if they aren’t somehow E! adjacent (like Wednesday’s guest Chrissy Metz of This Is Us on NBC, which like E! is owned by NBCUniversal). There are, of course, some notable exceptions like RuPaul.\n\nAdvertisement\n\nI bring this up because Iggy Azalea, fresh from her thus unsuccessful pivot to Latina, was also on Wednesday’s show and to hear her talk, you’d never guess that her commercially viable days are in all likelihood behind her. “I’ve had a lot of hits,” she boasted, rattling off names, some more memorable (“Fancy,” “Problem” with Ariana Grande) than others (“Booty” with J. Lo, “Pretty Girls” with Britney Spears). She told Henry, “I feel like in my mind you jam out to me,” which I totally believe she does feel. (I also believe she says this to a lot of people and will continue saying this for decades even if she ends up living in a bedroom with her mother in a crumbling mansion. Especially that, actually.) Henry did not pretend to not know who she was, as he often has in the past when pulling up to a celebrity’s house (he said he thought Larry Birkhead was Keith Urban).\n\nNo dead people from Azalea’s past felt like talking to Henry, I guess, so he instead advised Azaela on her love life and career and it was like...what does this guy even do anyway? Now he’s clairvoyant thanks to “them”? He promised Iggy she’d have new springtime career opportunities and then have time for love. It’s exciting that the days are getting longer, the weather is getting warmer, and we’ll be able to check against Henry’s prediction soon enough.\n\nHe spoke of the failing health of someone close to Azeala, whom she eventually identified as her grandfather. Henry said he was receiving “a symbol of a water balloon and a bunch of holes being poked in the water balloon. And it’s like we stop one hole and water comes out the other. We have to stop that hole but it’s like water comes out the other. And it’s basically their way of acknowledging this person’s health, like we’re dealing with this and this other thing comes up.” You’d think that “they” would come up with better metaphors, being of the spirit realm and having nothing better to do than float around all day until some nosy little towheaded Hogwart’s reject starts poking around for inter-dimensional gossip.\n\n“They’re just having me keep in mind his prostate...they’re having me go to like lower, rectal, prostate area,” he said.\n\nAnd again it was like, what do you do, man???\n\nAt the end of her segment, Iggy pointed out how the facts contained in this reading were not Googleable, to underscore Henry’s legitimacy. A cursory look confirms that she’s right, which means she could have told this information to producers or Henry himself and then he spit it back at her and she said, “Oh wow, yes, yes,” while thinking, “I’m so glad to be on television,” or, “It’s nice that someone is at least pretending to want to talk to me.”\n\nAt the end of the episode, Henry brought out his mother, whom he called a “rapper fan” on multiple references. So...like any rapper? Indeed, she seemed thrilled to be in the presence of Azalea. Henry shared that they used to listen to Azalea’s track “Murda Bizness” together. It sounded like he pronounced it “bidness,” and if that doesn’t make you cringe, well, check out his accompanying dance move.\n\nThough Henry didn’t communicate with a dead person from Azalea’s past, he testified to the camera, “I was still about to give a reading to Iggy today but it focused on living matters on living people.” Wow, I can’t believe that worked out for him on his own show. What a gift.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/aptzh9tcugsa62ng48da.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/aptzh9tcugsa62ng48da.jpg", "keywords": [], "authors": [], "canonical_link": "https://themuse.jezebel.com/when-iggy-azalea-met-the-hollywood-medium-nightmares-c-1823789536", "title": "When Iggy Azalea Met the Hollywood Medium, Nightmares Collided", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/auj4p7qsrkznkdstuufo.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/auj4p7qsrkznkdstuufo.png", "keywords": "Bullshit, Tyler Henry, The Hollywood Medium, Iggy Azalea, The Muse", "news_keywords": "Bullshit, Tyler Henry, The Hollywood Medium, Iggy Azalea, The Muse", "twitter": {"url": "https://themuse.jezebel.com/when-iggy-azalea-met-the-hollywood-medium-nightmares-c-1823789536", "card": "summary", "site": "@jezebel", "title": "When Iggy Azalea Met the Hollywood Medium, Nightmares Collided", "description": "No offense to all the dead people out there, but you all have some washed-up friends. That’s at least what the evidence suggests by the typically C-to-F-list caliber talent Hollywood Medium with Tyler Henry attracts, celebs who are seemingly hard-up for work if they aren’t somehow E! adjacent (like Wednesday’s guest Chrissy Metz of This Is Us on NBC, which like E! is owned by NBCUniversal). There are, of course, some notable exceptions like RuPaul.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/aptzh9tcugsa62ng48da.jpg"}, "description": "No offense to all the dead people out there, but you all have some washed-up friends. That’s at least what the evidence suggests by the typically C-to-F-list caliber talent Hollywood Medium with Tyler Henry attracts, celebs who are seemingly hard-up for work if they aren’t somehow E! adjacent (like Wednesday’s guest Chrissy Metz of This Is Us on NBC, which like E! is owned by NBCUniversal). There are, of course, some notable exceptions like RuPaul.", "og": {"title": "When Iggy Azalea Met the Hollywood Medium, Nightmares Collided", "type": "article", "url": "https://themuse.jezebel.com/when-iggy-azalea-met-the-hollywood-medium-nightmares-c-1823789536", "description": "No offense to all the dead people out there, but you all have some washed-up friends. That’s at least what the evidence suggests by the typically C-to-F-list caliber talent Hollywood Medium with Tyler Henry attracts, celebs who are seemingly hard-up for work if they aren’t somehow E! adjacent (like Wednesday’s guest Chrissy Metz of This Is Us on NBC, which like E! is owned by NBCUniversal). There are, of course, some notable exceptions like RuPaul.", "locale": "en_US", "site_name": "The Muse", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/aptzh9tcugsa62ng48da.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://themuse.jezebel.com", "summary": ""}