{"url": "en.wikipedia.org/wiki/American_Idol_(season_16)", "text": "The sixteenth season of American Idol premiered on March 11, 2018, on the ABC television network. It is the show's first season to air on ABC, after 15 years on Fox. Ryan Seacrest continued his role as the show's host, while Katy Perry, Luke Bryan, and Lionel Richie joined as judges. Maddie Poppe from Clarksville, Iowa won the season on May 21, 2018, while her boyfriend Caleb Lee Hutchinson was the runner-up, and Gabby Barrett finished in third place. Poppe was the first female winner since Candice Glover in season twelve.\n\nBackground [ edit ]\n\nIn early 2017, Variety reported that FremantleMedia was in talks to revive the show for NBC or for its original network, Fox.[2] A dispute between Fremantle and Core Media Group derailed these plans.[3] Then, in May 2017, it was announced that ABC was making a bid to revive the program.[4] Later, ABC announced that it had acquired the rights to the series, and that American Idol would return for the 2017–18 television season.[5][6] On November 6, 2017, it was announced that the revival season would premiere on March 11, 2018.[7]\n\nOn July 20, 2017, it was announced on Live with Kelly and Ryan, that Ryan Seacrest would be returning as the host for the revival season.[8] On May 16, 2017, Katy Perry was the first judge to be announced by ABC.[9] On September 24, 2017, Luke Bryan was the second judge to be announced for the revival season.[10] On September 29, 2017, Lionel Richie was the third and final judge to be announced.[11] On February 21, 2018, it was announced that iHeartRadio radio personality Bobby Bones would be the mentor for the Top 24 this season.[12]\n\nOn April 23, 2018, ABC announced that the April 29, May 6, and May 13 live shows of the season would air across all mainland U.S. time zones, a first for American Idol.[13] Radio Disney also broadcast its first season of American Idol Insider.[citation needed]\n\nRegional auditions [ edit ]\n\nIn June 2017, it was announced that American Idol would begin two bus tours in 19 cities, later increased to 22, for audition starting August 17, 2017.[14][15] Those who passed their first audition would go in front of the producers where they would be selected to appear before the judges in different cities. Instead of focusing on a city in each aired episode as in previous seasons, this season each episode showed a compilations of auditions from different cities.[16]\n\nDuring the live broadcast of the 2017 American Music Awards, three contestants who did not pass the audition in front of the judges were given one more chance to allow the public to vote for them.[20] The three candidates were Maris, Britney Holmes and Dominique Smith. The winner of the golden ticket to Hollywood was then revealed the following night on an episode of Dancing with the Stars. Lionel Richie appeared in the show announcing that the public vote was in favor of Britney Holmes, a 28-year-old vocal coach from Texas, who is headed to Hollywood as the first declared semifinalist of the season.[21]\n\nHollywood Week [ edit ]\n\nHollywood Week aired over two episodes on March 26 and April 1. It featured three rounds: Lines of 10, Group Round, and Solo Round. In the first round, each contestant sang individually, and after ten sang, they gathered in a line. Those who impressed the judges and the producers advanced to the next round where the contestants performed in groups of four or five, singing a song together.[22] The remaining auditionees who passed the group rounds performed their final solos to advance in the Showcase Round.\n\nShowcase Round [ edit ]\n\nThe Showcase Round aired on April 2, which featured the top 50 performing for the judges and a live audience at Exchange LA, a nightclub in Los Angeles. The following day, the judges narrowed the number of contestants down from 50 to 24 in the Final Judgement. The top 24 contestants then moved on to perform solos and celebrity duets.[23][24][25]\n\nThe following is a list of the contestants who reached the Top 24 and the song they performed at the Showcase:\n\nColor key:\n\nMale contestant Female contestant\n\nTop 24 [ edit ]\n\nThe Top 24 contestants were split into two groups of twelve. Prerecorded performances at the Academy in the Heart of LA of the first group aired on April 8 and the second group on April 15. On the following day each week, prerecorded performances of each contestant's duet aired, as did the judges' selection of seven contestants from each group to advance to the Top 14. Idol contestants were paired with celebrity singers as their duet partners. The artists who duetted with the Top 24 included: Banners, Aloe Blacc, Bishop Briggs, Cam, Colbie Caillat, Luis Fonsi, Andy Grammer, Lea Michele, Patrick Monahan, Rachel Platten, Bebe Rexha, Sugarland, and Allen Stone.[27]\n\nColor key:\n\nContestant was chosen by the judges to move on to the live shows Contestant was eliminated\n\nGroup 1 [ edit ]\n\nGroup 2 [ edit ]\n\nTop 14 (April 22 and 23) [ edit ]\n\nThe Top 14 performances were taped on April 21, 2018, and aired on Sunday, April 22, followed with the live results on Monday, April 23.[citation needed]\n\nColor key:\n\nContestant received the top six highest number of votes and directly advanced to the Top 10 Contestant was not chosen by the public and was left to perform again for the judges Contestant was immune from elimination and performed a \"victory song\" Contestant was chosen by the judges to advanced to the Top 10 Contestant was eliminated\n\nLive shows [ edit ]\n\nColor key:\n\nContestant was saved by America's vote Contestant was eliminated\n\nWeek 1 Top 10 – Disney Night (April 29) [ edit ]\n\nThe Top 10 performed Disney songs on Sunday, April 29, 2018. Idina Menzel served as a guest mentor.[37]\n\nWeek 2: Top 7 – Prince/Birth Year Night (May 6) [ edit ]\n\nThe Top 7 performed tribute performances to the late Prince and songs from their birth years.[39] Nick Jonas served as a guest mentor.\n\nWeek 3: Top 5 – Carrie Underwood/Mothers' Day Dedications (May 13) [ edit ]\n\nThe Top 5 performed songs by Carrie Underwood and songs dedicated to their mothers. Underwood served as mentor for the week and performed with the contestants.\n\nNon-competition performances Order Performer(s) Song 17.1 Carrie Underwood and the Top 5 \"See You Again\" 17.2 Carrie Underwood \"Cry Pretty\"\n\nWeek 4: Finale – Winner's Song/Reprise Song/Hometown Dedication (May 20 and 21) [ edit ]\n\nColor key:\n\nContestant finished in 3rd place. Contestant finished as the runner-up. Contestant won the season.\n\nThe Top 3 performed their winner’s song, a reprise of their favorite performance of the season and a song dedicated to their hometowns, which they visited. Bobby Bones returned as mentor this week.\n\nElimination chart [ edit ]\n\nColor key:\n\nFemales Males Top 24 Not Chosen Third place Runner-up Winner Did Not Perform Public's vote Judge's save Immune Eliminated Results per stage Place Contestant Top 24 (Gr. 1) Top 24 (Gr. 2) Top 14 Wildcard Top 10 Top 7 Top 5 Finale 4/9 4/16 4/22 4/23 4/29 5/6 5/13 5/21 1 Maddie Poppe N/A Safe Safe Immune Safe Safe Safe Winner 2 Caleb Lee Hutchinson N/A Safe Safe Immune Safe Safe Safe Runner-up 3 Gabby Barrett Safe N/A Safe Immune Safe Safe Safe 3rd place 4–5 Cade Foehner Safe N/A Safe Immune Safe Safe Eliminated Michael J. Woodard Safe N/A Safe Immune Safe Safe 6–7 Jurnee N/A Safe Not Chosen Safe Safe Eliminated Catie Turner Safe N/A Safe Immune Safe 8–10 Dennis Lorenzo Safe N/A Not Chosen Safe Eliminated Michelle Sussett Safe N/A Not Chosen Safe Ada Vox N/A Safe Not Chosen Safe 11–14 Jonny Brenns Safe N/A Not Chosen Eliminated Marcio Donaldson N/A Safe Not Chosen Garrett Jacobs N/A Safe Not Chosen Mara Justine N/A Safe Not Chosen 15–24 Ron Bultongez N/A Eliminated Amelia Hammer Harris N/A Shannon O'Hara N/A Effie Passero N/A Alyssa Raghu N/A Kay Kay Alexis Eliminated Brandon Diaz Trevor McBane Dominique Posey Layla Spring\n\nTop 10 contestants [ edit ]\n\nMaddie Poppe\n\nGabby Barrett\n\nCade Foehner\n\nContestants who appeared on other seasons/shows [ edit ]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nNo. Title Air date Timeslot (ET) Rating/share\n\n(18–49) Viewers\n\n(millions) DVR\n\n(18–49) DVR viewers\n\n(millions) Total\n\n(18–49) Total viewers\n\n(millions) 1 \"Auditions, Part 1\" March 11, 2018 Sunday 8:00 p.m. 2.3/8 10.48[72] 0.4 1.35 2.7 11.84[73] 2 \"Auditions, Part 2\" March 12, 2018 Monday 8:00 p.m. 1.8/7 8.41[74] 0.4 1.36 2.2 9.77[75] 3 \"Auditions, Part 3\" March 18, 2018 Sunday 8:00 p.m. 1.8/6 7.81[76] 0.4 1.38 2.2 9.19[75] 4 \"Auditions, Part 4\" March 19, 2018 Monday 8:00 p.m. 1.6/6 7.68[77] 0.5 1.94 2.1 9.59[78] 5 \"Auditions, Part 5\" March 25, 2018 Sunday 8:00 p.m. 1.7/6 7.51[79] 0.5 N/A 2.2[78] N/A 6 \"Hollywood Week, Part 1\" March 26, 2018 Monday 8:00 p.m. 1.7/6 7.80[80] 0.3 1.33 2.0 9.14[81] 7 \"Hollywood Week, Part 2\" April 1, 2018 Sunday 8:00 p.m. 1.6/6 7.48[82] 0.5 1.42 2.1 8.90[81] 8 \"Showcase Round & Final Judgment\" April 2, 2018 Monday 8:00 p.m. 1.4/5 7.16[83] 0.4 1.53 1.8 8.69[84] 9 \"Top 24 Solos, Part 1\" April 8, 2018 Sunday 8:00 p.m. 1.5/6 7.23[85] 0.4 1.32 1.8 8.55[84] 10 \"Top 24 Celebrity Duets, Part 1\" April 9, 2018 Monday 8:00 p.m. 1.6/6 7.72[86] 0.3 1.39 1.9 9.11[87] 11 \"Top 24 Solos, Part 2\" April 15, 2018 Sunday 8:00 p.m. 1.3/5 6.35[88] 0.4 1.28 1.7 7.63[87] 12 \"Top 24 Celebrity Duets, Part 2\" April 16, 2018 Monday 8:00 p.m. 1.4/5 6.97[89] 0.2 1.15 1.6 8.12[90] 13 \"Top 14 Perform\" April 22, 2018 Sunday 8:00 p.m. 1.5/6 7.46[91] 0.3 1.24 1.8 8.71[90] 14 \"Top 10 Reveal\" April 23, 2018 Monday 8:00 p.m. 1.4/5 7.61[92] 0.2 1.14 1.6 8.77[93] 15 \"Top 10 Perform: Disney Night\" April 29, 2018 Sunday 8:00 p.m. 1.9/7 8.77[94] 0.5 1.18 2.4 9.95[93][95] 16 \"Top 7 Perform\" May 6, 2018 1.8/7 8.65[96] N/A N/A N/A N/A 17 \"Top 5 Perform\" May 13, 2018 1.7/7 8.53[97] 0.3 1.23 2.0 9.76[98] 18 \"Performance Finals\" May 20, 2018 1.3/5 7.47[99] N/A N/A N/A N/A 19 \"Grand Finale\" May 21, 2018 Monday 9:00 p.m. 1.6/6 8.63[100] 0.3 1.27 1.9 9.95[101]\n\nCritical response [ edit ]\n\nOn the review aggregation website Rotten Tomatoes, the premiere episode holds an approval rating of 70% based on 20 reviews, with an average rating of 6.51/10.[102] Metacritic, which uses a weighted average, assigned the season a score of 60 out of 100 based on eight reviews, indicating \"mixed or average reviews.\"[103]\n\nConcert tour [ edit ]\n\nThe top 7 finalists performed for the summer tour along with season 8 winner Kris Allen.", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/c/c7/Maddie_Poppe%2C_winner_of_American_Idol_2018.jpg/150px-Maddie_Poppe%2C_winner_of_American_Idol_2018.jpg", "https://upload.wikimedia.org/wikipedia/en/5/51/American_Idol_ABC_logo.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Cade_Foehner.jpg/110px-Cade_Foehner.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/c/c7/Maddie_Poppe%2C_winner_of_American_Idol_2018.jpg/110px-Maddie_Poppe%2C_winner_of_American_Idol_2018.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Gabby....jpg/110px-Gabby....jpg", "http://upload.wikimedia.org/wikipedia/en/5/51/American_Idol_ABC_logo.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/51/American_Idol_ABC_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Idol_(season_16)", "title": "American Idol (season 16)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/51/American_Idol_ABC_logo.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}