{"url": "www.yourtango.com/2018313302/5-awkward-details-about-blake-shelton-and-gwen-stefanis-relationship-and-rumors-about", "text": "There are rumors of a baby on the way.\n\nBlake Shelton and Gwen Stefani is the couple we never saw coming, but as they say, \"opposites attract\" — and this couple couldn't be any more opposite.\n\nThe country crooner and the No Doubt rocker first fell in love after working together as judges on the popular TV singing competition show The Voice in 2014. The two seemed to connect quickly after both becoming separated from their previous spouses around the same period of time in 2015.\n\nThey tried to deny rumors of their budding romance for months, but fans and the media were quick to notice the undeniable chemistry between the singers.\n\nAccording to E! News, The \"Hollaback Girl\" told Ryan Seacrest on his radio show in 2015 that she thought Blake was \"really hot.\" When Seacrest asked if the rumors about them dating at the time were true, Stefani didn't give a straight answer. \"I'm not going to answer that right now, Ryan, I think I've given up enough of myself this morning to you.\" Stefani not-so-subtly added, \"I think he's hot, don't you?\"\n\nAlthough at the outset they're an odd pairing, people have come to accept the duo and have grown to love them. But as with every other celebrity couple, they have their fair share of gossip and drama.\n\n1. They got divorced within two months of each other.\n\nPhotos: Vanity Fair/ Rolling Stone\n\nGwen was previously married to singer Gavin Rossdale for 13 years. The former couple shares three sons together, Kingston (11), Zuma (9), and Apollo (4). They announced their drama-filled separation in August 2015.\n\nBlake was previously wed to country singer Miranda Lambert. They announced their divorce in July 2015 with a shared joint statement that said, \"This is not the future we envisioned. And it is with heavy hearts that we move forward separately. We are real people, with real lives, with real families, friends, and colleagues. Therefore, we kindly ask for privacy and compassion concerning this very personal matter.\"\n\n2. Gwen revealed one of Blake's exes is a huge fan of hers.\n\nGwen appeared on an episode of Jimmy Kimmel Live! where she revealed that Blake confessed he once dated a girl who was a big fan of Gwen... like, a really big fan. She stated, “He did tell me that he dated a girl for like three months that had my face all plastered over her whole bedroom so that’s kind of weird, right?\"", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/blake_0.png?itok=9bW0tW9w", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/gwen1.0.jpg", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/blake_0.png?itok=FYpw818L", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/blake_0.png?itok=9bW0tW9w", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018313302/5-awkward-details-about-blake-shelton-and-gwen-stefanis-relationship-and-rumors-about", "title": "5 Awkward Details About Blake Shelton And Gwen Stefani's Relationship, Including What She's Said About Marrying Him", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Blake Shelton, gwen stefani, celeb, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/brittany-white", "published_time": "2018-06-19T16:39:27", "modified_time": "2018-06-19T16:39:27"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018313302/5-awkward-details-about-blake-shelton-and-gwen-stefanis-relationship-and-rumors-about", "title": "5 Awkward Details About Blake Shelton And Gwen Stefani's Relationship, Including What She's Said About Marrying Him", "description": "There are rumors of a baby on the way.", "updated_time": "2018-06-19T16:39:27", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/blake_0.png?itok=9bW0tW9w", "width": 620, "height": 309}}, "description": "Celeb couples face a lot of relationship scrutiny — especially when the relationships are rumored to be born out of infidelity. Here are the most awkward details about Blake Shelton and Gwen Stefani's relationship, including cheating, marriage, and pregnancy rumors.", "abstract": "Blake Shelton and Gwen Stefani are the couple we never saw coming, but as they say 'opposites attract' and this couple couldn't be any more", "robots": "follow, index, noodp, noydir", "news_keywords": "blake shelton, gwen stefani, relationships, relationship, miranda lambert", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018313302/5-awkward-details-about-blake-shelton-and-gwen-stefanis-relationship-and-rumors-about", "title": "5 Awkward Details About Blake Shelton And Gwen Stefani's Relationship, Including What She's Said About Marrying Him", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/blake_0.png?itok=9bW0tW9w", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/qEs9uh9GIPs"], "publish_date": 1529397567.0, "source": "http://www.yourtango.com", "summary": ""}