{"url": "https://www.womenshealthmag.com/beauty/a19914545/how-to-use-a-curling-iron/", "text": "There's nothing worse than spending tons of time meticulously curling your hair before an event, only to end up with frizzy curls, weird pieces sticking out, an embarrassingly outdated style, or worse...limp locks because your curls didn't even last half an hour. Luckily, we've compiled a list of curling iron errors to avoid so you can achieve gorgeous waves this summer.\n\nMistake: Not Prepping Your Hair\n\nIn order to get a good curl, you need to prep your hair first. \"It's like building a house,\" says celebrity hairstylist Patrick Melville. \"You have to create a good foundation for it to hold.\" To do this, first use a heat-protecting product (it's essential to prevent damage), then blow-dry your hair completely. This will close the cuticle and help hold your curls, as well as avoid heat damage from using the iron on damp hair. Melville also suggests using a styling glaze pre-ironing (he likes Hantz Professional Styling Glaze, $10 hantzprofessional.com) for control and texture. Also, if you know your hair has a really hard time holding a curl, go ahead and mist your hair with a little hairspray before you use the iron.\n\nMistake: Curling Your Hair in the Wrong Direction\n\nMake your desired part before you start curling, as this will help determine which way you curl the hair. For a more natural look, you'll want to curl your hair away from your face. This means winding the hair down and around the wand of the curling iron in a clockwise direction on the right side of your face and a counter-clockwise direction on the left side.\n\nThis is the right way to curl your hair:\n\nMistake: Twirling the Iron Instead of Your Hair\n\nMost women clip their ends into the iron, then twist the iron in toward their head. According to Melville, this will give you more of a barrel curl (think Shirley Temple) or flip (think Farrah Fawcett), rather than the more natural-looking wave you were probably going for. To achieve that, hold the iron so the barrel (the hot part) is facing down toward the floor, then wrap your hair around it, starting from the roots and locking your ends in last. This will not only make your curls last longer, but it will also give you more volume at the roots. Also, make sure you don't twist the hair at all before winding it around the barrel, as this will prevent the heat from distributing evenly on the hair. Think of your hair as a ribbon, and lay it flat over the curling iron as you wind.\n\nMistake: Using an Iron That's Too Large\n\nYou might own four different-sized curling irons, thinking you need each one to achieve a range of tighter or looser curls. The truth is, you really only need one. \"You can do a lot more with a one-inch barrel than you can do with a larger one,\" says Melville. \"It's more universal. If you want a looser wave, just take a slightly larger section of hair.\"\n\nMistake: Curling Too Much Hair at a Time\n\nWhile taking a slightly larger section of hair may provide you with a looser wave, curling too much hair at a time isn't a good idea, either, says Melville. You won't get an even distribution of heat throughout that section, which can cause your curls to do a disappearing act. For the most natural look, wrap small sections of hair around the barrel of your iron using the technique described above (and make sure the sections aren't all exactly the same size—your curls will look more natural this way).\n\nMistake: Buying a Curling Iron That's on Clearance\n\nIf you curl your hair frequently, you should invest in a good iron with a ceramic barrel. Also, there's a difference between spring hinge irons and marcel irons with a swivel handle. Even though it might take some getting used to, Melville recommends going for a marcel iron because the clip on a spring can cause unwanted creases in your curls. The marcel iron can also stand in for those wand-like curling irons with no clip at all—just wind your hair around the iron and hold it by the ends. Melville recommends leaving the ends out of the iron completely to get a more natural \"undone\" look.\n\nMistake: Holding Your Hair in the Iron Too Long\n\nObvious alert: Curling irons are hot. Some irons can reach up to 450°F, which can cause some serious damage, depending on your hair's condition and texture. Melville recommends using a low or medium setting on finer, more fragile hair and leaving your hair wrapped around it for no more than two to three seconds. You can use the hottest setting if your hair is strong, coarse, and thick, but be careful not to leave it on any longer than you need to.\n\nMistake: Touching Your Hair Right Away\n\nAlways allow your hair to cool down for a couple of minutes so the curl has a chance to set. Touching or running your fingers through your curls immediately after curling it can cause unwanted frizz or make your curls droop. After that waiting period, you can help keep your style in place by spraying your curls and your hands with a finishing spray (Melville recommends Osis Session Finish Hairspray, $19 ulta.com) and crunching the ends. To get a more natural, slightly messy curl, break up your finished curls with your fingers at this point. Alternatively, you can brush them lightly for a smoother wave. This will also help you distribute product evenly throughout your strands.\n\nFinally, make sure to remember that many curly styles can be created by using variations on these techniques. If you have a specific look in mind that you want to try, ask your stylist to show you how to recreate it the next time you visit the salon. They'll appreciate the chance to give you a tutorial, and you'll get a hairstyle that works with your specific cut and texture.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=1xw:0.626xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=1xw:0.626xh;center,top&resize=1200:*", "keywords": [], "authors": ["Sandra Roldan"], "canonical_link": "https://www.womenshealthmag.com/beauty/a19914545/how-to-use-a-curling-iron/", "title": "8 Ways You're Probably Using Your Curling Iron Wrong", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Women's Health", "title": "8 Ways You're Probably Using Your Curling Iron Wrong", "description": "Nix these mistakes for perfect waves every time.", "url": "https://www.womenshealthmag.com/beauty/a19914545/how-to-use-a-curling-iron/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=1xw:0.626xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "modified_time": "2019-06-11 07:32:40", "published_time": "2014-06-18 10:39:07", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@WomensHealthMag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=1xw:0.626xh;center,top&resize=640:*"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "title": "8 Ways You're Probably Using Your Curling Iron Wrong", "description": "Nix these mistakes for perfect waves every time.", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=0.798xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty,pro beauty secrets,hair", "sailthru.date": "2014-06-18T22:39:07Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=1xw:0.626xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/images/curling-iron-wrong-0-1516305602.jpg?crop=0.798xw:1xh;center,top", "sailthru.socialtitle": "8 Ways You're Probably Using Your Curling Iron Wrong", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1403059147.0, "source": "https://www.womenshealthmag.com", "summary": ""}