{"url": "https://www.hollywoodreporter.com/live-feed/ryan-murphy-confirms-ahs-cult-mass-shooting-scene-will-be-edited-1046828", "text": "Series creator Ryan Murphy first shared the news over the weekend, saying he made the decision to honor victims' rights.\n\nTuesday's episode of American Horror Story: Cult, which was set to feature a scene in which a mass shooting occurs, has been edited to be less graphic following the deadly Las Vegas shooting in which 58 people were killed and hundreds more injured.\n\nRyan Murphy, co-creator and showrunner of the FX horror anthology, first made the comments Saturday during a New Yorker Festival discussion. The scene in question was filmed before the shooting in Las Vegas occurred, with Murphy explaining that they shot the sequence in September even though they're still filming this season (several of the actors have already wrapped). \"I just made the decision that I'm going to have all of that violence be shown for the most part off camera,\" he said of editing the episode after it was in the can and locked before the tragedy in Vegas.\n\nOn Monday, FX confirmed the episode would see \"substantial\" edits for Tuesday's telecast but that the original unedited episode would then be released on VOD and streaming platforms.\n\n\"In light of the tragedy last week in Las Vegas, Ryan Murphy and the producers of American Horror Story: Cult have chosen to make substantial edits to the opening scene of [Tuesday] night’s episode,\" FX said in a statement. \"This opening, which was filmed two months ago and which portrays an occurrence of gun violence that has sadly become all too common in our country, contains a sequence that some viewers might find traumatic.\"\n\nThe network says the edited episode will air on the FX linear channel, while the unedited and original version will be available on the VOD platform of cable, satellite or telco providers, as well as on the FX Networks non-linear platforms, FXNOW and FX+.\n\nWhen speaking about the decision on Saturday with the New Yorker TV critic Emily Nussbaum, Murphy said he felt a \"responsibility\" to victims of gun violence.\n\n\"Nobody ever talks about victims' rights. That's sort of a weird emotional discussion that's never bridged,\" Murphy added. \"But I felt great sympathy for people who were affected, certainly, and family members and loved ones and people who are upset about the way the world is.\"\n\nMurphy explained that there was a conversation about what to do with the AHS episode in the wake of the shooting: \"Should you air it? Should you not air it? How do you be sensitive?\"\n\n\"My point of view was I believe I have the right to air it, but I also believe in victims' rights, and I believe that now is probably not the week to have something explosive or incendiary in the culture because someone who was affected might watch that and it could trigger something or make them feel upset. So our decision was to re-edit it and I felt that that was the right move,\" he said.\n\nThe scene was graphic, Murphy said, in order to make \"an obvious anti-gun warning about society.\"\n\nThe seventh season of the horror anthology show, which stars Sarah Paulson and Evan Peters, follows the rise of a cult led by Peters' fictional character. The post-election set season explores how someone can rise within a disenfranchised community. Throughout the season, Peters will embody five other notorious real-life cult leaders, from Charles Manson to David Koresh.\n\nThis is not the first time a show has had to change a scene or delay the viewing of an episode in response to real-world events. USA's Mr. Robot delayed its season-one finale, which featured a character killing themselves on television, similar to the events of the Virginia TV shooting in which a reporter was killed on-air.\n\nSimilarly, USA delayed the premiere of its Ryan Phillippe-starrer Shooter in the wake of a deadly Black Lives Matter protest in Dallas where a sniper attack by a disgraced military vet killed five police officers.\n\nMurphy's comments were part of a wide-ranging discussion of his career and many TV series, past, present and future. He revealed the fate of the Cult episode as part of a response to a question from Nussbaum about people being offended by things on his shows and what offends him.\n\nOct. 9, 10:15 a.m.: Updated with Monday FX statement", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/09/evan_basement_0283_rgb_f-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/09/evan_basement_0283_rgb_f-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/08/laurenpic1-cropped.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/09/evan_basement_0283_rgb_f-h_2017.jpg", "keywords": [], "authors": ["Hilary Lewis", "Jackie Strause Lauren Huff", "Jackie Strause", "Lauren Huff", "Thrnews Thr.Com", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/ryan-murphy-confirms-ahs-cult-mass-shooting-scene-will-be-edited-1046828", "title": "'American Horror Story: Cult' Mass Shooting Episode Edited in Wake of Las Vegas", "meta_data": {"viewport": "width=device-width", "description": "'American Horror Story' series creator Ryan Murphy first shared the news at a New Yorker Festival panel over the weekend.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/ryan-murphy-confirms-ahs-cult-mass-shooting-scene-will-be-edited-1046828", "domain": "https://www.hollywoodreporter.com/", "title": "'American Horror Story: Cult' Mass Shooting Episode Edited in Wake of Las Vegas", "description": "Series creator Ryan Murphy first shared the news over the weekend, saying he made the decision to honor victims' rights.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/09/evan_basement_0283_rgb_f-h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'American Horror Story: Cult' Mass Shooting Episode Edited in Wake of Las Vegas", "description": "Series creator Ryan Murphy first shared the news over the weekend, saying he made the decision to honor victims' rights.", "url": "https://www.hollywoodreporter.com/live-feed/ryan-murphy-confirms-ahs-cult-mass-shooting-scene-will-be-edited-1046828", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/09/evan_basement_0283_rgb_f-h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'American Horror Story: Cult' Mass Shooting Episode Edited in Wake of Las Vegas", "sailthru.description": "Series creator Ryan Murphy first shared the news over the weekend, saying he made the decision to honor victims' rights.", "sailthru.author": "Hilary Lewis ,Jackie Strause,Lauren Huff", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-10-07 14:25:26", "sailthru.tags": "Live Feed, Television, Ryan Murphy, American Horror Story, American Horror Story: Cult, autoplay, Las Vegas Shooting"}, "movies": [], "publish_date": 1507357526.0, "source": "https://www.hollywoodreporter.com", "summary": ""}