{"url": "en.wikipedia.org/wiki/Efforts_to_impeach_Donald_Trump", "text": "Talks and activities of attempted approaches into the possible impeachment of Donald Trump\n\nVarious people and groups assert that U.S. president Donald Trump has engaged in impeachable activity both before and during his presidency,[1][2] and talk of impeachment began before he took office.[3][4] Formal efforts were initiated by representatives Al Green and Brad Sherman, both Democrats, in 2017, the first year of his presidency.[5][6] On September 24, 2019, Speaker of the House of Representatives Nancy Pelosi announced that six committees would undertake formal impeachment inquiries after reports about controversial interactions between Trump and the country of Ukraine.[7]\n\nGrounds asserted for impeachment have included possible violations of the Foreign Emoluments Clause of the Constitution by accepting payments from foreign dignitaries; alleged collusion with Russia during the campaign for the 2016 United States presidential election; alleged obstruction of justice with respect to investigation of the collusion claim; and accusations of \"Associating the Presidency with White Nationalism, Neo-Nazism and Hatred\", which formed the basis of a resolution for impeachment brought on December 6, 2017. Since the Republicans controlled both the House and the Senate during 2017 and 2018, the likelihood of impeachment during that period was considered by all to be low.[8][9] A December 2017 resolution of impeachment failed in the House by a 58–364 margin.[10] The Democrats gained control of the House in 2019 and launched multiple investigations into Trump's actions and finances. Speaker Nancy Pelosi initially resisted calls for impeachment. In May 2019 she indicated that Trump's continued actions, which she characterized as obstruction of justice and refusal to honor congressional subpoenas, might make an impeachment inquiry necessary. An increasing number of House Democrats and one Republican were requesting such an inquiry.\n\nIn December 2016, Democratic senators Elizabeth Warren, Dick Durbin, Chris Coons, Ben Cardin, and Jeff Merkley introduced a bill that would require the president of the United States to divest any assets that could raise a conflict of interest, including a statement that failure to divest such assets would constitute high crimes and misdemeanors \"under the impeachment clause of the U.S. Constitution\".[3] Vanity Fair characterized this as a preemptive effort to lay the groundwork for a future impeachment argument.[3] Concerns had previously been expressed that Trump's extensive business and real estate dealings, especially with respect to government agencies in other countries, may violate the Foreign Emoluments Clause of the Constitution,[4] sparking debate as to whether that is the case.[11][12]\n\nImmediately after his inauguration, The Independent and The Washington Post each reported on efforts already underway to impeach Trump, based on what the organizers regard as conflicts of interest arising from Trump's ability to use his political position to promote the interests of \"Trump\"-branded businesses, and ongoing payments by foreign entities to businesses within the Trump business empire as a violation of the Foreign Emoluments Clause.[1][2] In March 2017, China provisionally granted 38 \"Trump\" trademark applications set to take permanent effect in 90 days, which were noted to come in close proximity to the president's making policy decisions favorable to China.[13]\n\nThe Washington Post further noted the creation of ImpeachDonaldTrumpNow.org by Free Speech For People and RootsAction, two liberal advocacy groups.[2] On February 9, Congressman Jerrold Nadler (D, NY) had filed a resolution of inquiry titled \"H.Con.Res. 5\" to force the Trump administration to turn over documents relating to potential conflicts of interest and to ties with Russia.[14] Some sources identified this as the first step in the process of impeaching Trump.[15][16] Fox News outlined two potential bases for impeachment, one being the Emoluments Clause and the other being complicity with Russian interference in the 2016 United States presidential election.[17] On March 21, it was widely reported that Congresswoman Maxine Waters tweeted \"Get ready for impeachment,\" which Waters explained was in reference to the allegations of collusion with Russian interference in the election.[18]\n\nOn January 17, 2019, new accusations involving Trump surfaced, claiming he instructed his long-time lawyer, Michael Cohen, to lie under oath surrounding Trump's involvement with the Russian government to erect a Trump Tower in Moscow.[19] This also sparked calls for an investigation and for the president to \"resign or be impeached\" should such claims be proven genuine.[20] The Mueller Report was released on April 18, 2019, and Robert Mueller himself made follow-up comments on May 29. The report reached no conclusion about whether Trump had or had not committed criminal obstruction of justice.[21] Mueller strongly hinted that it was up to Congress to make such a determination. Congressional support for an impeachment inquiry increased as a result.[22]\n\nA formal impeachment inquiry was launched on September 24, 2019, as a response to the Trump–Ukraine scandal, in which Trump and his personal attorney Rudy Giuliani pressed the Ukrainian government repeatedly since at least May 2019 to investigate Hunter Biden, the son of 2020 presidential candidate Joe Biden.[23][24][25][26][27] The purpose of the requested investigation was alleged to be to hurt Biden's campaign for President.[28][29] In July Trump issued a hold on military aid scheduled to be sent to Ukraine, releasing it in September after controversy arose. There was widespread speculation that the withholding of the aid was intended to force Ukraine to investigate Biden; Giuliani seemed to confirm that there was such a connection.[30]\n\nIn an October 8, 2019 letter to House Democratic leaders, the White House stated it would not cooperate with \"[their] partisan and unconstitutional inquiry under these circumstances.\"[31] The eight-page letter was widely interpreted by legal analysts as containing political rather than legal arguments.[32][33][34][35][36]\n\nOn December 18, 2019, the House of Representatives impeached Donald Trump almost entirely along party lines.[37][38][39][40]\n\nTimeline [ edit ]\n\nFebruary 2017 [ edit ]\n\nThe Impeach Trump Leadership PAC was started by California Democratic Party congressional candidate Boyd Roberts.[41]\n\nMay 2017 [ edit ]\n\nActions and revelations [ edit ]\n\nFollowing Trump's dismissal of FBI director James Comey, multiple Democratic members of Congress discussed an \"impeachment clock\" for Trump, saying that he was \"moving\" toward impeachment and raising the future possibility of bringing forth articles of impeachment for obstruction of justice and criminal malfeasance, if proof of illegal activity were found.[42][43] Senator Richard Blumenthal of Connecticut said in an interview: \"It may well produce another United States v. Nixon on a subpoena that went to United States Supreme Court. It may well produce impeachment proceedings, although we're very far from that possibility.\"[44]\n\nLater in May, news of Trump's disclosure of classified information to Russia led to further discussions about the possibility of impeachment, with Representative Maxine Waters (D-CA) alluding to the possibility,[45] along with writer Benjamin Wittes, legal scholar Jack Goldsmith, and others.[46]\n\nAround the same time in May, the revelation that the president had asked Comey to drop the investigation of Michael Flynn led still more observers, including Senator Angus King (I-ME), to say impeachment might be in the offing.[47]\n\nThe developments led Senator John McCain (R-AZ) to venture that matters had reached \"Watergate scope and size\".[48]\n\nPreparations for possible proceedings [ edit ]\n\nCongressman Al Green 's Floor Speech on the Impeachment of President Trump\n\nCongressman Luis Gutierrez : \"It is the Judiciary Committee in the House where impeachment begins.\"\n\nImpeachment proceedings begin with a resolution being introduced in the House of Representatives. The first two Representatives to publicly suggest such an action were Pramila Jayapal (D-WA)[49] and Al Green (D-TX).[50]\n\nTwo Republican representatives, Justin Amash (R-MI) and Carlos Curbelo (R-FL), called for impeachment on the grounds that obstruction of justice charges against Trump were proven true.[51] Curbello was defeated in his bid for reelection in 2018,[52] but Amash was reelected, and following his reading of the redacted Mueller Report, reaffirmed his position, stating the evidence supported the conclusion that Trump had committed impeachable offenses.[53] In July 2019, Amash left the Republican Party to become an independent member of Congress.[54]\n\nOn May 17, Representative Green made a call for impeachment on the house floor[55][56] and House Oversight Committee chairman Jason Chaffetz (R-UT) announced that he was issuing subpoenas on the memo FBI director James Comey wrote detailing possible obstruction of justice by the president.[57] On May 24, Green told CSPAN in an interview that he was drafting articles of impeachment and would shortly submit them as a privileged resolution, to begin the formal impeachment process.[58]\n\nHowever, some major Democratic figures stressed the need for caution, patience and bipartisanship in any potential impeachment process.[59]\n\nAdministration officials said that White House lawyers were indeed researching impeachment proceedings and how to deal with them.[60][61]\n\nIndependent counsel appointment [ edit ]\n\nOn May 17, former FBI director Robert Mueller was appointed special counsel by Deputy Attorney General Rod Rosenstein, acting after the recusal of Attorney General Jeff Sessions, to lead a Special Counsel investigation to investigate Russian interference in the 2016 presidential election,[62] and any cover-up related to it by Trump or any White House officials.[63][64] According to sources close to the White House, the Trump administration is considering using various obscure legal means to slow down the investigation and undermine the special counsel.[65][66]\n\nJune 2017 [ edit ]\n\nFormer FBI director James Comey agreed to testify before the Senate Intelligence Committee on June 8.[67] Some legal experts and politicians, such as Representative Eric Swalwell of California, argued that Trump's numerous comments in news interviews and on Twitter regarding the subjects Comey would testify on (such as whether or not Trump tried to improperly influence or coerce Comey and the reasons why Trump fired him) may well have voided the validity of an executive privilege claim in this instance.[68]\n\nOn June 7, an advance copy of Comey's prepared congressional testimony was submitted to the Senate Intelligence Committee[69] in which he said the president attempted to persuade him to \"let go\" of any investigation into Michael Flynn on February 14.[70] He added that Trump had requested his personal loyalty, to which Comey replied he would give his \"honest loyalty\" to the president.[71] Comey said Trump on several occasions inquired whether there were an investigation into the president himself and Comey replied each time there was not.[72] Comey states that Trump requested he publicly declare this so Trump's image could be improved, but Comey says he told the president he would need to have approval from the attorney general's office for reasons of legality.[73]\n\nComey recounted his final conversation with President Trump on April 11:\n\nOn the morning of April 11, the President called me and asked what I had done about his request that I \"get out\" that he is not personally under investigation. I replied that I had passed his request to the Acting Deputy Attorney General, but I had not heard back. He replied that \"the cloud\" was getting in the way of his ability to do his job. He said that perhaps he would have his people reach out to the Acting Deputy Attorney General. I said that was the way his request should be handled. I said the White House Counsel should contact the leadership of DOJ to make the request, which was the traditional channel. He said he would do that and added, \"Because I have been very loyal to you, very loyal; we had that thing you know.\" I did not reply or ask him what he meant by \"that thing\". I said only that the way to handle it was to have the White House Counsel call the Acting Deputy Attorney General. He said that was what he would do and the call ended. That was the last time I spoke with President Trump.[71]\n\n\"Impeaching Donald John Trump, President of the United States, for high crimes and misdemeanors\" by Congressman Brad Sherman\n\nOn June 7, Congressman Al Green announced that Congressman Brad Sherman would join with him in drafting articles of impeachment against President Trump.[5] On June 12, Sherman began circulating an article of impeachment among his colleagues.[6] Sherman said: \"I'm not going to be deterred.\"[5] Green stated: \"In the spirit of keeping the republic, I have concluded that the president has obstructed justice and in so doing, the remedy for obstruction of justice is impeachment. The president will not be indicted while he is in office, and while there is some merit in talking about the judicial process, the impeachment process is the one that will bring him before the bar of justice.\"[5]\n\nFormer United States attorney Preet Bharara said in a June 11 interview with ABC News that \"there's absolutely evidence to begin a case\" regarding obstruction of justice by Trump.[74] Bharara went on to note: \"No one knows right now whether there is a provable case of obstruction. [But] there's no basis to say there's no obstruction.\"[74]\n\nOn June 14, The Washington Post reported that Trump was being investigated by Special Counsel Robert Mueller for possible obstruction of justice relating to his actions in regard to the investigation into Russia.[75]\n\nJuly 2017 [ edit ]\n\nOn July 12, Congressman Sherman formally introduced in the House of Representatives an Article of Impeachment (H.Res. 438),[76] accusing the president of obstructing and impeding the investigation of justice, regarding the investigation of Russian interference in the 2016 presidential election.[77]\n\nDemocrats in the House Judiciary committee demanded that hearings begin as soon as possible,[78] but the Republicans demurred, rewriting the request in favor of investigations into Hillary Clinton's emails.[citation needed]\n\nAugust–November 2017 [ edit ]\n\nRepresentative Steve Cohen introduced articles of impeachment in November 2017.\n\nIn August 2017, following controversial comments by Trump about the Unite the Right rally in Charlottesville, Virginia, Representative Steve Cohen announced he would introduce articles of impeachment because Trump had \"failed the presidential test of moral leadership\".[79][80]\n\nThere was a brief debate about impeaching the president before a privileged resolution introduced by Representative Al Green was withdrawn.[81][82] In late October, progressive activist hedge-fund manager Tom Steyer funded an impeachment campaign that quickly garnered 1.3 million signatures.[83] By mid-November, the campaign had garnered over 1.9 million signatures.[84] As of December 2018, the campaign's signature count is over 6.5 million.[85]\n\nOn November 15, six Democrats including Cohen introduced H.Res. 621 with five articles of impeachment.[86] Cohen said that Trump's \"train of injuries to our Constitution must be brought to an end\".[87] The five accusations were \"obstruction of justice,\" \"violation of the foreign emoluments clause,\" \"violation of the domestic emoluments clause,\" \"undermining the independence of the federal judiciary\" and \"undermining the freedom of the press\".[86] Many Democrats opposed this action.[87]\n\nA survey showed nearly 40% of American citizens were in favour of impeachment (up from 30% in February), with almost 75% of Democrats and 7% of Republicans supporting possible impeachment, although Trump's approval rating among Republicans fell from 91% in June to 79% in November.[86] For impeachment to occur, a simple majority is needed in the House and for conviction/removal from office to occur a two-thirds majority is needed in the Senate. At the time both the House and Senate were controlled by Republicans. At this date, 12 Republican senators had individually indicated a willingness to take action against Trump's presidency: if supported by all 48 Democratic senators, 8 more Republican senators would be needed to successfully remove the president.[86]\n\nDecember 2017 and January 2018 House votes [ edit ]\n\nOn December 6, a second privileged resolution on articles of impeachment, H.Res. 646, was brought on the floor by Representative Al Green, Democrat of Texas. The resolution listed two articles, i.e. proposed reasons for impeachment: \"Associating the Presidency with White Nationalism, Neo-Nazism and Hatred\" and \"Inciting Hatred and Hostility\".[88] House majority leader Kevin McCarthy, Republican of California, moved for the resolution to be defeated (\"tabled\"), which was agreed to by a 364–58 vote with four members voting present.[10]\n\nAmong Republicans, 238 voted to table the articles of impeachment and one did not vote. Among Democrats, 126 voted to table the articles of impeachment, 58 voted against tabling the articles of impeachment, four voted \"present\" and five did not vote.[89]\n\nGreen's effort did not receive the support of Democratic leadership. House minority leader Nancy Pelosi and minority whip Steny Hoyer issued a statement saying that \"[l]egitimate questions have been raised about [Trump's] fitness to lead this nation,\" but \"[n]ow is not the time to consider articles of impeachment\" given ongoing investigations by congressional committees as well as the investigation by the special counsel.[10]\n\nOn January 19, 2018, Green brought up the resolution a second time. On this attempt his motion was defeated by a vote of 355–66. 234 Republicans and 121 Democrats voted against the motion. All the votes for the motion were from Democrats: three Democrats voted present and three Republicans and three Democrats did not cast a vote.[90][91]\n\n2018 midterm elections [ edit ]\n\nThe matter became an issue, primarily for Republicans, in the midterm elections,[92][93] with both conservatives and the president himself warning of dire consequences if he is impeached.[94][95] The Democrats won control of the House, and they have promised to launch investigations into various actions by Trump and his administration, but Democratic leaders were reported as reluctant to address impeachment, at least until after the report of the special counsel is released.[96]\n\nAfter the 2018 midterm elections [ edit ]\n\nOn March 11, 2019, Nancy Pelosi said, \"I'm not for impeachment, Impeachment is so divisive to the country that unless there's something so compelling and overwhelming and bipartisan, I don't think we should go down that path, because it divides the country. And he's just not worth it. No. I don't think he is. I mean, ethically unfit. Intellectually unfit. Curiosity wise unfit. No, I don't think he's fit to be president of the United States.\" She then scolded herself for \"coming across too negatively\".[97][98][99]\n\nWith the Democrats in control of the House, and with a direct impeachment inquiry deemed somewhat toxic,[100] the work of investigations into Trump's possible crimes were divided into several committees while waiting for some outside force, such as the Mueller probe or the Southern District to force the Democratic leadership's hands.\n\nHearings and investigations: December 2018–February 2019 [ edit ]\n\nFebruary 27: Michael Cohen hearings [ edit ]\n\nOn February 27, 2019, Cohen publicly testified before the House Oversight committee on possible high crimes and misdemeanors committed by President Trump both before and after taking office.[112][113] His testimony occurred under oath, which also means additional criminal charges of perjury could be filed if it were proven that he had lied.[114] In his opening remarks, obtained in advance by The New York Times, he expresses his regret and shame at lying to Congress and working for a \"racist\" and a \"con man\", and accuses Trump of numerous lies and illegal actions. White House officials dismissed the credibility of his testimony in advance, calling him a \"disgraced felon\" and \"convicted liar\".[115]\n\nDuring his testimony, Cohen described how he protected Trump from potential scandals during the 2016 campaign through payoffs.[116] He said he and National Enquirer owner David Pecker had conspired to \"catch and kill\" potentially damaging stories about Trump and that Trump also was concerned that allegations by Stormy Daniels and other women would result in the general public's being reminded of a tape which aired on Access Hollywood at the beginning of October 2016 where Trump was caught a decade prior discussing how he groped, grabbed and kissed women without their permission.[116] He also said Trump would inflate his personal wealth for financial benefits, such as a failed bid to buy the Buffalo Bills,[117] and that he and Trump conspired with Trump Organization CFO Allen Weisselberg and the president's son Donald Trump Jr. to organize more payoffs in 2017.[116] Cohen also showed lawmakers a check for $35,000 which the president wrote to him on August 1, 2017, and said it was used as a part of a hush money payoff to Stormy Daniels as well.[116]\n\nThe testimony implicated the President as committing a minimum of 11 impeachable offenses.[118][119]\n\nHearings and investigations: February–April 2019 [ edit ]\n\nFebruary 28: Cohen testifies in private before the House Intelligence Committee.\n\nCohen testifies in private before the House Intelligence Committee. March 3: House Judiciary Committee Chairman Jerrold Nadler announces requests for over sixty documents from the White House and other sources in his oversight investigations. [120]\n\nHouse Judiciary Committee Chairman Jerrold Nadler announces requests for over sixty documents from the White House and other sources in his oversight investigations. March 4: The House Judiciary issues requests to 81 people for documents and testimony in a \"pre-impeachment\" investigation into obstruction of justice and other alleged threats to the rule of law. [121] [122] [121]\n\nThe House Judiciary issues requests to 81 people for documents and testimony in a \"pre-impeachment\" investigation into obstruction of justice and other alleged threats to the rule of law. March 6: Cohen finishes testimony at the HIC. [123]\n\nCohen finishes testimony at the HIC. March 22: Mueller Report is delivered to Attorney General William Barr. [124]\n\nMueller Report is delivered to Attorney General William Barr. March 24: According to Barr, the investigation \"did not find evidence to charge other Americans (including Trump associates) in conspiring with Russia in 2016,\" and did not come to a conclusion about obstruction of justice. [124]\n\nAccording to Barr, the investigation \"did not find evidence to charge other Americans (including Trump associates) in conspiring with Russia in 2016,\" and did not come to a conclusion about obstruction of justice. March 27: While the Congress is waiting for the Mueller report to drop, Rep. Rashida Tlaib (D-MI) introduces another resolution, H.Res. 257, calling for a formal impeachment investigation of the president, [125] which was referred to the Committee on Rules.\n\nWhile the Congress is waiting for the Mueller report to drop, Rep. Rashida Tlaib (D-MI) introduces another resolution, H.Res. 257, calling for a formal impeachment investigation of the president, which was referred to the Committee on Rules. April 18: The Mueller Report is made public. In it, Mueller lists multiple actions by Trump that could be considered obstruction of justice, but chooses for several reasons not to accuse the president of any crime, indicating that Congress should make that decision.[126][127]\n\nMueller Report and impeachment debate [ edit ]\n\nA Department of Justice spokesperson called Nadler's subpoena \"premature and unnecessary,\" detailing that the publicly released version of the report had \"minimal redactions\" and that Barr had made arrangements for Nadler and other lawmakers to review a version of the final report with fewer redactions.[128][129]\n\nHouse majority leader Steny Hoyer said, \"Based on what we have seen to date, going forward on impeachment is not worthwhile at this point.\"[130] while Speaker Nancy Pelosi was more noncommittal, telling the majority caucus: \"We will update you on the next steps that must be taken. The caucus held a conference call on April 22 to discuss the matter.[131] It was decided to go full bore on the investigations and deal with actual impeachment later.[132]\n\nAfter reading the report, Representative Justin Amash (R-MI) in May 2019 became the first Republican member of Congress to call for Trump's impeachment, saying Trump had engaged in \"impeachable conduct\". Amash was also critical of Attorney General Barr, stating that he felt Barr had deliberately misrepresented the contents of the report.[133] Shortly thereafter, former long-serving Republican congressman Tom Coleman (R-MO) also called for Trump's impeachment.[134] In addition, conservative attorney George Conway, husband of Kellyanne Conway, called for Trump's impeachment.[135]\n\nThe Mueller Report was released on April 18, 2019, and Robert Mueller himself made follow-up comments on May 29. The report described ten actions by the president which could be construed as obstruction of justice. Investigators reached no conclusion about whether those actions amounted to a crime, indicating the evidence they had obtained presented \"difficult issues\" that prevented them from \"conclusively determining\" Trump committed no criminal obstruction.[136] Mueller added, \"The Constitution requires a process other than the criminal justice system to formally accuse a sitting president of wrongdoing,\" which was taken as meaning that it would be up to Congress to make such a determination.[137] Congressional support for at least an impeachment inquiry increased as a result.[22] Near the end of April 2019, the hashtag #RepublicansForImpeachment went viral, on one day being used an average of every 3.8 seconds; the hashtag was created by a group seeking Republican grassroots support for impeachment \"for us to have a chance of conviction in the Senate\".[138]\n\nImpeachment resolutions in the 116th Congress [ edit ]\n\nH.Res.13 Introduced March 1, 2019 by Rep. Brad Sherman (D-CA) [139] on the grounds of obstruction of justice during the Mueller investigation\n\nIntroduced March 1, 2019 by Rep. Brad Sherman (D-CA) on the grounds of obstruction of justice during the Mueller investigation H.Res.257 Introduced March 27, 2019 by Rep. Rashida Tlaib (D-MI) [140] for opening an investigation with no specific accusation made\n\nIntroduced March 27, 2019 by Rep. Rashida Tlaib (D-MI) for opening an investigation with no specific accusation made H.Res.396 Introduced May 25, 2019 by Rep. Shelia Jackson Lee (D-TX) [141] which named several areas of concern, including: Violations of the Domestic Emoluments Clause Violations of the Foreign Emoluments Clause Obstruction of justice Inappropriately disclosing classified information Destruction of public records Payment of ransom with federal funds in violation of international law Authorizing security clearances for people who are known security risks Failure to protect U.S. elections from foreign interference Campaign finance law violations Condoning white nationalism Using law enforcement to punish political enemies Attacking the press as \"enemies of the people\" Mismanagement by failing to fill vacancies Separation of immigrant children from their families\n\nIntroduced May 25, 2019 by Rep. Shelia Jackson Lee (D-TX) which named several areas of concern, including: H.Res.498 Introduced July 17, 2019 by Rep. Al Green (D-TX-9)[142] on the grounds of being unfit for office after various racist remarks\n\nHearings and investigations: April–July 2019 [ edit ]\n\nMueller hearings [ edit ]\n\nOn July 24, 2019, Robert Mueller and several of his aides testified about the investigation's consequences before both the House Judiciary and House Intelligence committees. Both sessions were open and televised for the public.\n\nThe over seven hours of hearings averaged 12.98 million viewers on ABC, CBS, NBC, CNN, Fox News, and MSNBC.[164]\n\nFormal impeachment proceedings [ edit ]\n\nThe impeachment process by the full House proceeded from summer 2019 to December 18, 2019, when the House voted to impeach Trump.[39][38][40]\n\nEarly hearings [ edit ]\n\nIn the late summer and fall of 2019, the House Judiciary Committee held a series of hearings and filed a number of lawsuits associated with drafting possible articles of impeachment.\n\nStart of formal impeachment proceedings [ edit ]\n\nThe start of official proceedings was first revealed to the public in a court filing dated July 26, 2019.[165]\n\nThis assertion was repeated in another court filing in a suit seeking to compel the testimony of former White House Counsel Don McGahn,[166] stating:\n\nThe Judiciary Committee is now determining whether to recommend articles of impeachment against the president based on the obstructive conduct described by the special counsel, [...] But it cannot fulfill this most solemn constitutional responsibility without hearing testimony from a crucial witness to these events: former White House counsel Donald F. McGahn II.\n\nLater that day, Chairman Jerrold Nadler went on both CNN and MSNBC and said proceedings had indeed begun and that impeachment hearings would begin in September.[167]\n\nPolitico reported that during August, Nadler and other majority members of the HJC had been drafting a formal document delineating the legal parameters of an official inquiry and that this would be voted on September 11, 2019.[168]\n\nThe draft resolution was released to the public on September 9, 2019,[169] and approved on a party-line vote two days later.[170]\n\nImpeachment hearings [ edit ]\n\nTestimony of Lewandowski [ edit ]\n\nThe first hearings against a president in 21 years took place on September 17, 2019, and featured the testimony of former Trump campaign manager Corey Lewandowski. Lewandowski exhibited a letter from President Trump stating that he was forbidden to answer questions due to executive privilege, even though he had never worked in the White House and was not entitled to it. Several Republican members of the committee attempted to use a number of procedural laws but were ignored by democrats[clarification needed] to continue the proceedings. Lewandowski, however, did admit to doing the things he was stated as doing in the Mueller Report.[171]\n\nThere were two other witnesses scheduled that day, and President Trump directed former top aides, Rob Porter and Rick Dearborn, not to appear to testify before Congress, which they did not.[172]\n\nEmoluments [ edit ]\n\nOn September 23, 2019, the House Judiciary Committee was scheduled to hear the testimony of those suing the president over alleged violation of the Emoluments Clause.[173] However, it was indefinitely postponed.[174]\n\nUkraine: Pelosi agrees to proceedings [ edit ]\n\nIn July 2019 a whistleblower complaint was filed by a member of the intelligence community, but the Director of National Intelligence refused to forward it to Congress as required by law, saying he had been directed not to do so by the White House and the Department of Justice.[175] Later reporting indicated that the report involved a telephone conversation with a foreign leader and that it involved Ukraine. Trump and his personal attorney, Rudy Giuliani, had been trying for months to get Ukraine to launch an investigation into former vice president and current presidential candidate Joe Biden as well as his son Hunter Biden.[176] Trump had discussed the matter in a telephone call with the president of Ukraine in late July. It was also revealed that Trump had blocked distribution of military aid to Ukraine, although he later released it after the action became public.[175] The controversy led House Speaker Nancy Pelosi to announce on September 24 that six House committees would commence an impeachment inquiry against Trump.[7]\n\nImpeachment vote by full House [ edit ]\n\nOn December 18, 2019, the House passed two articles of impeachment against president Donald Trump.[39][38][40] The trial took place in January and February of 2020. On February 5th 2020, Trump was acquitted by the Senate of all charges.\n\nSubpoenas and lawsuits [ edit ]\n\nSeveral committees in the House of Representatives have issued subpoenas for materials and testimonies from people and institutions within the Trump administration as well as external entities. The president's personal lawyers have issued letters saying all such requests will be ignored or opposed[146] and have filed several lawsuits to prevent the release of any information to Congress.\n\nUnredacted version of Mueller report [ edit ]\n\nThe House Judiciary Committee has subpoenaed the unredacted Mueller report and Attorney General Barr has rebuffed this,[177] leading to a contempt citation from the committee. A lawsuit is also contemplated.[178]\n\nOn July 26, 2019, the Judiciary Committee asked federal judge Beryl Howell, who oversaw the Mueller grand juries, to unseal the secret testimony because the Committee is \"investigating whether to recommend articles of impeachment\" to the full House.[165] Howell ruled in favor of the request on October 25, 2019, finding the impeachment investigation legitimate.[179]\n\nOn November 18, 2019, The House counsel filed a brief with Judge Howell to release the materials immediately, as redacted grand jury testimony appeared to show the President perjured himself before the Mueller probe and it was part of the impeachment inquiry.[180]\n\nOn December 16, another brief by the HJC, said that they still needed the materials, as some redacted materials appear to be related to the Ukraine matter[181] Previously, an appellate court had scheduled oral arguments in the case for January 3, 2020.[182]\n\nTrump et al v. Mazars et al [ edit ]\n\nThe House Oversight Committee issued a subpoena to the Mazars accounting firm for Trump's financial information from before his election to the presidency. The President and his lawyers have tried to delay or prevent this information from getting to the committee by seeking a court injunction against both the committee's leadership and Mazars.[183][184]\n\nOn April 23, 2019 U.S. district judge Amit Mehta set a May 14 date for the preliminary hearing,[185] although several weeks later he decided the entire suit would be heard on that date.[186] May 20, Mehta ruled that accounting firm Mazars had to provide its records of Donald Trump's accounts from before his presidency to the House Oversight Committee in response to their subpoena.[187] In a 41-page opinion, he asserted that Congress has the right to investigate potential illegal behavior by a president, including actions both before and after the president assumed office.[188] The ruling was appealed by Trump's personal legal team[188] and briefs for such were due by no later than July 12, 2019,[189] when oral arguments were scheduled.[190]\n\nTrump's attorneys filed an appeal brief with the Court of Appeals for the DC Circuit on June 10, 2019, contending that Congress may not investigate a president for criminal activities except in impeachment proceedings. The brief asserted Congress's investigation was an \"exercise of law-enforcement authority that the Constitution reserves to the executive branch\".[191] In an opinion piece two days later, attorneys George Conway and Neal Katyal called the brief \"spectacularly anti-constitutional,\" arguing it places the president above the law while noting that Congress routinely investigates criminal matters.[192]\n\nOral arguments took place on July 12, 2019, before a three-judge panel consisting of Neomi Rao, David Tatel, and Patricia Millett. On August 8, the Justice Department filed a brief supporting the president's position.[193] On October 11, 2019, the appeal panel affirmed the ruling 2–1 with Neomi Rao dissenting.[194]\n\nOn November 18, The US Supreme Court blocked the transfer of the subpoenaed materials temporarily and required the HJC to submit a response to the president's appeal by Friday, November 22, so they could have the full arguments before deciding to take the case on an emergency basis.[195][196]\n\nTrump et al v. Deutsche Bank et al [ edit ]\n\nThe House Financial Services and Intelligence committees issued subpoenas to Deutsche Bank and Capital One Bank asking for financial records relating to Trump, his adult children, and his businesses. Trump's personal attorneys tried to delay or prevent the information from being given to the committees by getting a court injunction. Although the defendants are Deutsche Bank and Capital One Bank, U.S. district judge Edgardo Ramos permitted representatives of the House committees to take part.[197] Ramos canceled a May 9 preliminary hearing when the committees agreed to hand over \"substantial portions\" of the subpoenas to the plaintiffs.[198] On May 22, Ramos affirmed the validity of the subpoenas. Trump's lawyers had asked Ramos to quash the subpoenas, but Ramos said such a request was \"unlikely to succeed on the merits\".[199] The committees later reached an agreement with Trump's lawyers to delay enforcement of the subpoenas while an appeal is filed, provided the appeal is filed in an \"expedited\" manner.[200] On May 28, Ramos granted Trump's attorneys their request for a stay so they could pursue an expedited appeal through the courts.[201] and briefs for it were due by no later than July 12.[189] On June 18, The Trump legal team filed a brief similar to the one in the Mazars case.[202]\n\nOral arguments began on August 23.[203]\n\nOn August 8, 2019, it was reported by The Wall Street Journal that Deutsche Bank, as well as others, had complied with the subpoenas despite the suit, handing over thousands of documents.[204]\n\nSuits filed by Trump opponents [ edit ]\n\nMany of the lawsuits filed against Trump ask for declaratory relief. A court's declaratory judgment compels no action as it simply resolves a legal question. A declaration that the president has accepted emoluments would make the work of House Managers easier in an impeachment.[205] Blumenthal v. Trump asks for declaratory relief as to emoluments. In CREW and National Security Archive v. Trump and EOP, a declaratory finding that the administration willfully failed to retain records would support a charge of obstruction of justice.[206] The CREW v. Trump case was dismissed in December 2017 for lack of standing, but in September 2019 this ruling was vacated and remanded upon appeal.[207][208] Blumenthal v. Trump, on the other hand, was not.[209]\n\nStatements by Trump [ edit ]\n\nDuring an August 2018 Fox & Friends interview, Trump was asked about the possible ramifications of him being potentially impeached after his ex-lawyer Michael Cohen pleaded guilty to charges and implied he had done so by Trump's direction. Trump said, \"I don't know how you can impeach someone who's done a great job. I tell you what, if I ever got impeached, I think the market would crash, I think everybody would be very poor. Because without this [points at his head, referring to his brain and his thinking], you would see numbers that you wouldn't believe in reverse.\"[210]\n\nIn a January 2019 tweet, Trump expressed bewilderment at the possibility, saying among other things, \"How do you impeach a president who ... had the most successful first two years of any president?\"[211]\n\nIn late April 2019, Trump vowed to take a possible impeachment to the Supreme Court,[212] even though the Supreme Court has twice ruled that the judiciary has no power over the process.[213] On May 30, 2019, Trump stated, \"I can't imagine the courts allowing [his impeachment].\"[214]\n\nOn May 22, Trump walked out of a planned White House meeting about infrastructure with Pelosi and Majority Leader Chuck Schumer, because he said Pelosi had earlier that morning met with the House Democratic Caucus \"to talk about the I-word\" and because Pelosi had accused him of carrying out a cover-up.[215] He said he would refuse to work with the Democrats on infrastructure or anything else until they end all investigations into him.[216]\n\nStatements by Democrats [ edit ]\n\nOn March 11, 2019, at the time, House speaker Nancy Pelosi in an interview with the Washington Post's Joe Heim said that \"I’m not for impeachment. This is news,\" breaking away from other Democrats wanting impeachment.[217][218] \"I’m going to give you some news right now because I haven’t said this to any press person before. But since you asked, and I’ve been thinking about this: Impeachment is so divisive to the country that unless there’s something so compelling and overwhelming and bipartisan, I don’t think we should go down that path, because it divides the country. And he’s just not worth it.\"[217][219]\n\nIn May 2019, House Pelosi suggested that Trump is goading House Democrats to impeach him \"to solidify his base\".[220][221] She said his recent actions are \"almost self-impeaching ... he is every day demonstrating more obstruction of justice and disrespect for Congress' legitimate role to subpoena.\"[222] She added, \"That's where he wants us to be ... The White House is just crying out for impeachment\" to divide Democrats and distract from Trump's policies.[223][224][225][226]\n\nBy May 2019, an increasing number of Democrats and one Republican member of Congress were concluding that impeachment, or at least an impeachment inquiry, could be the only alternative should Trump continue to \"stonewall\" their demands for information and testimony.[227][228]\n\nOn September 22, 2019, Pelosi wrote a letter addressing Congress about an anonymous whistleblower complaint about Trump's call to Ukraine's leader, stating \"[i]f the administration persists in blocking this whistle-blower from disclosing to Congress a serious possible breach of constitutional duties by the president, they will be entering a grave new chapter of lawlessness which will take us into a whole new stage of investigation ...\"[229]\n\nSome analysts have speculated that Trump actually wants to be impeached, in order to remain the focus of national attention, rally his supporters, and obtain a perceived political advantage.[230][220][231][232] Juan Williams suggested Trump would consider being impeached by the House but acquitted in the Senate a victory, allowing him to reiterate that all accusations against him are false.[231] Greg Gutfeld suggested that Trump might feel it would actually add to his legacy, and to be impeached while the economy was doing well would elevate him to the status of folk hero.[231] Rich Lowry, writing for Politico, has argued that Trump would relish the drama of an impeachment fight and is temperamentally better suited to engage in that than to engage in governance.[232]\n\nIf Trump is impeached but is acquitted by the Senate and then goes on to win a second term in the 2020 election, it would be unprecedented in U.S. history. Axios interviewed legal and political experts who concluded that if that happened, it might be politically impossible to impeach Trump again because of the political blowback.[233]\n\nOther proposed reasons for impeachment [ edit ]\n\nSome commentators have argued that Trump has abused the Presidential pardon power,[234] specifically offering to pardon federal officials who commit crimes such as violating the rights of immigrants[235] and any necessary to build the Trump border wall before the next presidential election.[236] Trump also declared he had an \"absolute right\" to pardon himself.[237] Controversial Trump pardons include those of Joe Arpaio, convicted of ignoring a court order to stop police misconduct with regard to immigration enforcement; Dinesh D'Souza, convicted of campaign finance violations;[238] and three military servicemembers convicted of war crimes.[239] Impeachment has notably been suggested as a remedy for abuse of pardon power by James Madison during the debate over ratification of the U.S. Constitution,[240] and William Howard Taft in a 1925 Supreme Court decision.[241]\n\nSymbolic municipal resolutions [ edit ]\n\nCity councils that have made formal resolutions calling for the impeachment of President Trump include those in the San Francisco Bay Area cities of Alameda, Berkeley, Oakland and Richmond[242][243][244] as well as the city of Los Angeles.[245] On the East Coast, the Cambridge, Massachusetts city council passed a policy order to support a House resolution to investigate Emoluments Clause conflicts.[246]\n\nPublic opinion polling on impeachment [ edit ]\n\nPublic opinion is a key factor in impeachment proceedings, as politicians including those in the House of Representatives look to opinion polls to assess the tenor of those they represent.[247][248][249] Any action would have to be based on the requisite legal grounds for impeachment, but such action is more likely to be taken in the face of support from public opinion.[247][248][249]\n\nAs of January 26, 2017, Public Policy Polling reports that 35% of voters supported the impeachment of President Trump, while 50% opposed.[250] By the following week, after the controversial rollout of Executive Order 13769, which barred people from seven majority-Muslim countries from entering the United States, support for impeachment had grown to 40%.[251] The following week, support for impeachment reached 46%, matching opposition to impeachment.[252]\n\nIn May 2017, after the firing of James Comey, for the first time more Americans supported impeaching Trump (48%) than opposed impeaching Trump (41%), with 11% not sure.[253] At the beginning of August 2017, one poll showed that number falling substantially with 53% of people being opposed to impeachment and 40% in favor, according to PRRI studies,[254] but by the end of August 2017 and following political fallout from the Unite the Right rally in Charlottesville, Virginia, 48% of people were again in favor of impeachment and 41% were opposed.[255] In December 2017, Public Policy Polling conducted the first public poll showing majority support for impeachment (51% support, 42% oppose, 7% not sure).[256]\n\nIn March 2019, a CNN Poll found that 36% of respondents support the impeachment.[257]\n\nIn May 2019, a NBC/WSJ poll with Republican pollster Bill McInturff found that 17% thought enough evidence existed for the House to begin impeachment hearings, 32% wanted Congress to continue investigating and decide on impeachment later, and 48% said the House should not pursue impeachment.[258][259] A Reuters/Ipsos poll taken in the same month found 45% of Americans supported impeachment, while 42% opposed.[260]\n\nOn June 16, 2019, Trump tweeted, \"Almost 70% in new Poll say don't impeach.\"[261] According to NBC News, Trump was apparently referring to their poll, according to which 27% of Americans believe there is now sufficient evidence to begin impeachment hearings.[262] Later that day, Fox News released a poll showing 43% of registered voters supported Trump's impeachment and removal from office, while 48% opposed impeachment.[263]\n\nAfter Nancy Pelosi formally announced an impeachment inquiry into Trump on September 24, 2019, several opinion polls reflected an increase in support for an impeachment inquiry. According to a Morning Consult poll, 43% of Americans support impeachment proceedings, a 7-point increase, tying with Americans who do not support such proceedings.[264] Additionally, an NPR/PBS NewsHour/Marist poll showed support for an impeachment inquiry into Trump at 49%, while 46% opposed.[265]\n\nAn analysis of polls showed that through mid-December, Americans remained sharply divided on whether Trump should be removed from office.[266] According to a CNN poll taken on December 12–15, 45% of Americans support the impeachment and removal of Trump from office, while 47% oppose impeachment.[267]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Donald_Trump_official_portrait_%28cropped%29.jpg/100px-Donald_Trump_official_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Donald_Trump_Signature.svg/150px-Donald_Trump_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Congressman_Al_Green%27s_Floor_Speech_on_the_Impeachment_of_President_Trump.webm/220px--Congressman_Al_Green%27s_Floor_Speech_on_the_Impeachment_of_President_Trump.webm.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Johnny-automatic-scales-of-justice.svg/32px-Johnny-automatic-scales-of-justice.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/100px-Seal_of_the_President_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/df/2017_July_-_Impeaching_Donald_John_Trump%2C_President_of_the_United_States%2C_for_high_crimes_and_misdemeanors.pdf/page1-220px-2017_July_-_Impeaching_Donald_John_Trump%2C_President_of_the_United_States%2C_for_high_crimes_and_misdemeanors.pdf.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/0/01/A_coloured_voting_box.svg/28px-A_coloured_voting_box.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/70px-Seal_of_the_President_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/220px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Rep._Gutierrez_%27It_is_the_Judiciary_Committee_in_the_House_where_impeachment_begins.%27_%28C-SPAN%29.webm/220px--Rep._Gutierrez_%27It_is_the_Judiciary_Committee_in_the_House_where_impeachment_begins.%27_%28C-SPAN%29.webm.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Stevecohen.jpeg/170px-Stevecohen.jpeg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Donald_Trump_official_portrait_%28cropped%29.jpg/75px-Donald_Trump_official_portrait_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Efforts_to_impeach_Donald_Trump", "title": "Efforts to impeach Donald Trump", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Trump-Inauguration2017-1050707_%2832392343466%29.jpg/1200px-Trump-Inauguration2017-1050707_%2832392343466%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}