{"url": "https://www.independent.co.uk/royalwedding/prince-harry-age-net-worth-earnings-royal-family-wedding-meghan-markle-latest-news-a8291866.html", "text": "Prince Harry will be embarking on one of life’s great adventures by tying the knot with humanitarian and actress Meghan Markle.\n\nLast month, thousands of people signed a petition demanding that the royal family fund the wedding themselves and not take any money from the British taxpayer.\n\nWith that in mind, the net worth of the royal family and Prince Harry have becoming interesting topics of conversation.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nHere’s everything you need to know about Prince Harry’s age, royal status and net worth as he prepares to welcome Ms Markle into the fold.\n\nWhat’s his royal status and occupation?\n\nPrince Harry, who was born Henry Charles Albert David on September 15 1984, is formally known as Prince Henry of Wales. He’s currently 33 years old.\n\nHe’s sixth in line to the throne behind his father the Prince of Wales, his older brother the Duke of Cambridge, his nephew Prince George, his niece Princess Charlotte and the Duke and Duchess of Cambridge’s third child, who is expected to arrive later this month.\n\nPrince Harry began his military career when he entered the Royal Military Academy Sandhurst in 2005.\n\nHe’s since served in the British Army and ventured to Afghanistan with the Army Air Corps for a 20-week deployment from 2012 to 2013.\n\nIn 2014, Prince Harry launched the Invictus Games to celebrate wounded, injured or sick members of the armed forces from around the world.\n\nIn addition to being a patron for the Invictus Games Foundation, Prince Harry is also a patron for the HALO Trust, the London Marathon Charitable Trust and Walking With The Wounded.\n\nWhat’s his net worth?\n\nAs can be expected as a member of the royal family, Prince Harry doesn’t have to worry about much when it comes to his finances.\n\nPrince William and Prince Harry both have an estimated net worth of approximately £28m, according to The Richest.\n\nWhen the royal turned 30 in 2014, he inherited a trust of around £10m from his late mother, Diana, Princess of Wales, as stated by royal expert Marlene Koenig.\n\nPrince William and Prince Harry also jointly inherited their late mother's estate, in addition to her private jewellery collection.\n\nAccording to Forbes, Prince William and Prince Harry received annual dividends of around £321,313 per year from the age of 25.\n\nPrince Harry is also taken care of by the Duchy of Cornwall, as son of Prince Charles, the Duke of Cornwall.\n\nThe Duchy of Cornwall is a private estate that was established in 1337 by King Edward III.\n\nIt’s currently overseen by Prince Charles and continues to cover expenses for Prince William and Prince Harry.\n\nHow does he earn money?\n\nWhile Prince Harry has inherited a dear amount of money, he has also earned his fair share from his previous role within the army. Prince Harry officially left the army in 2015.\n\nWhile serving as an officer in the Army Air Corps, he was reportedly granted a salary of around £32,134 per year, as stated by Fortune.\n\nHowever, Forbes has also claimed that Prince Harry received between £35,704 and £37,840 while working as a helicopter pilot for the Army Air Corps.\n\nThis article has been updated. It was originally published in April 2018.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/13/prince-harry-net-worth.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/13/prince-harry-net-worth.jpg", "keywords": [], "authors": ["Sabrina Barr"], "canonical_link": "https://www.independent.co.uk/royalwedding/prince-harry-age-net-worth-earnings-royal-family-wedding-meghan-markle-latest-news-a8291866.html", "title": "How old is Prince Harry and what is his net worth?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/royalwedding/prince-harry-age-net-worth-earnings-royal-family-wedding-meghan-markle-latest-news-a8291866.html", "title": "This is how much Prince Harry is worth and how he earns his money", "description": "Here’s everything you need to know about Prince Harry’s age, royal status and net worth as he prepares to welcome Ms Markle into the fold", "updated_time": "2018-05-18T14:16:40+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/13/prince-harry-net-worth.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5786484064001_5762249493001.mp4?pubId=624246174001&videoId=5762249493001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8291866"}, "description": "Prince Harry will be embarking on one of life’s great adventures by tying the knot with humanitarian and actress Meghan Markle. Last month, thousands of people signed a petition demanding that the royal family fund the wedding themselves and not take any money from the British taxpayer. With that in mind, the net worth of the royal family and Prince Harry have becoming", "keywords": "Prince Harry, Royal family, net worth, Royal Wedding", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Prince Harry", "published_time": "2018-05-18T14:15:00+01:00", "modified_time": "2018-05-18T14:16:40+01:00", "section": "Royal Wedding", "subsection": "Video", "author_name": "Sabrina Barr", "content_type": "story", "word_count": 606, "image_count": 3, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 8}, "twitter": {"title": "This is how much Prince Harry is worth and how he earns his money", "description": "Prince Harry will be embarking on one of life’s great adventures by tying the knot with humanitarian and actress Meghan Markle. Last month, thousands of people signed a petition demanding that the", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1526649300.0, "source": "https://www.independent.co.uk", "summary": ""}