{"url": "https://people.com/awards/golden-globes-2018-what-you-didnt-see-on-tv/", "text": "While many tuned in to watch Seth Meyer‘s hilarious monologue and all the winners at the 2018 Golden Globe Awards on Sunday, PEOPLE was watching for the action off-camera, backstage and on the red carpet. From many big moments for the Big Little Lies cast to the friendly catchup sessions between A-listers, we caught every moment not shown on TV.\n\nHere are the best backstage moments you didn’t see.\n\nGet push notifications with news, features and more.\n\nOn the Red Carpet\n\nMany actresses — including Eva Longoria, Tracee Ellis Ross, Emma Stone, Meryl Streep and Kerry Washington — in support of the Time’s Up movement posed for a group photo with its founders just before making their way inside the Beverly Hilton.\n\nTo donate to the Time’s Up Legal Defense Fund, which will provide subsidized legal support to women and men in all industries who have experienced sexual harassment, assault, or abuse in the workplace, visit its GoFundMe page. Learn more about Time’s Up, an organization of women in entertainment combating sexual harassment and inequality, on its website.\n\nAmy Poehler and Aziz Ansari had a mini Parks and Recreation reunion on the red carpet!\n\nInside the Show\n\nLate Night host — and first-time Golden Globes host! — Seth Meyers kicked off the show with an opening monologue heavily focused on Hollywood’s sexual harassment scandals. Meyers received a huge reaction from the star-studded crowd with many resounding “ooh’s” when the emcee made the joke about Harvey Weinstein being included in the In Memoriam section of the show in 20 years.\n\nDuring the first commercial break, Tom Hanks was spotted at the lobby bar getting drinks for The Post table. This Is Us creator Dan Fogelman perfectly captured the moment Hanks returned to his table with a tray of martinis for his cast.\n\nBe sure to check out PEOPLE’s full Golden Globes coverage to get the latest news on Hollywood’s big night.\n\nSterling K. Brown‘s historic win was loudly applauded by many in the room, including his People v. O. J. Simpson: American Crime Story costar Sarah Paulson who jumped out of her seat and sat on the stage stairs to enjoy the moment. “It’s time!” she yelled at him before hugging and kissing him offstage after his acceptance speech.\n\nAngelina Jolie and son Pax enjoyed their mother-son night, sitting next to Chris Hemsworth and bowing their heads in conversation throughout the night.\n\nImage zoom\n\nMeanwhile, Paulson and Jennifer Aniston celebrated Sam Rockwell‘s award for best supporting actor in a motion picture. “I was screaming like a banshee!” Paulson told Rockwell as Aniston gave him a congratulatory hug.\n\nRELATED: See the Full List of the Golden Globes 2018 Winners\n\nMariah Carey had an interesting encounter in the bathroom with director Steven Spielberg as announced by her tweet. “Got caught mingling on the way to the loo during a commercial break.. took the first seat available, happens to be right next to Steven Spielberg Cut to next commercial break, guess who comes back to her seat,” Carey wrote before the follow-up tweet: “Dear Meryl, please forgive me!!! (MERYL STREEP) You can take my seat any time!”\n\nKerry Washington was spotted FaceTiming her two children, 15-month-old son Caleb Kelechi and 3-year-old daughter Isabelle Amarachi, outside the men’s bathroom.\n\nAnother reunion of the night was A Fault In Our Stars actors Shailene Woodley and Ansel Elgort.\n\nImage zoom Stefanie Keenan/Getty\n\nPresenters Helen Mirren and Seth Rogen are the last celebrities to leave the event ballroom.\n\nRELATED VIDEO: Dwayne ‘The Rock’ Johnson’s Daughter Simone Honored as First ‘Golden Globe Ambassador’ — ‘[It] Makes Me So Happy’\n\nBackstage\n\nBackstage\n\nElisabeth Moss ran off stage after accepting the award for best performance by an actress in a television series, drama, for The Handmaid’s Tale and was approached by nominee Emma Stone, who happily asked her: “How does it feel to win a Golden Globe?!”\n\nFollowing James Franco‘s win for best actor in a motion picture, musical or comedy, Sharon Stone gave him a huge congratulatory hug after he walked off the stage. The actress also hugged Dave Franco, who stars alongside his brother in The Disaster Artist.\n\nRELATED PHOTOS: Making a Statement — See the Stars Wearing Black at the Golden Globes\n\nJessica Chastain walked Saoirse Ronan off the stage after the Lady Bird star won best actress in a musical or comedy, asking her if she wanted to keep the envelope, with Ronan happily saying yes.\n\nOutside the press room, Chastain congratulated Reese Witherspoon for her best limited series or television movie win: “I’m so proud of you!”\n\nWitherspoon did an epic impression of Oprah Winfrey after she received the Cecil B. Demille honor. “You get a Globe, you get a Globe, you get a Globe!” Witherspoon said, lovingly mimicking her A Wrinkle in Time costar’s unforgettable 2004 moment when she awarded a studio audience with brand-new Pontiac G6 sedans.\n\nImage zoom Steve Granitz/WireImage\n\nAt the Afterparties\n\nThis Is Us star Brown posed for photos at the HFPA party with his new trophy while waiting to get it engraved. Brown tells PEOPLE that his trophy will be going into the garage, which is now a man cave filled with all his trophies. Later at the Fox party, the actor danced to “Catchin’ Feels” at the bar.\n\nMatt Damon walked hand-in-hand with his wife Luciana at the HFPA party while stopping to talk to fans and pose for selfies. It was clearly date night for them as he affectionally gave her derrière a slight squeeze.\n\nAlso at the HFPA party was Handmaid’s Tale star Alexis Bledel who tells PEOPLE that her decision to wear pants instead of a gown was to feel “comfortable and pretty.”\n\nKendall Jenner was hanging out with Drake at the HFPA party.\n\nAcross the way at the InStyle party (where the stars sipped on Perrier-Jouët Belle Epoque Champagne), Witherspoon was joined by daughter Ava Phillippe. At the same soirée, Vanessa Hudgens, Julianne Hough and Nina Dobrev were having a great time on the dance floor.\n\nAlso inside the InStyle party, Diane Kruger made a quick outfit change into a white top and black pant while her boyfriend and Walking Dead star Norman Reedus met up with their mutual friends. Call Me By Your Name’s Armie Hammer congratulated James Franco on his best movie actor win, saying, “I’m so happy for you!”\n\nImage zoom Michael Kovac/Getty\n\nWhile at the HBO party, Nicole Kidman and husband Keith Urban were welcomed by Mirren who gave her a big congratulatory hug.\n\nInside the Netflix party, The Crown‘s Claire Foy celebrated the night dancing to Ol’ Dirty Bastard’s “Got Your Money.”\n\nAnd at the Amazon party, good friends Damon and Chris Hemsworth laughed and talked near Mark Ronson’s DJ booth.\n\nThe 75th annual Golden Globes were presented live on NBC from the Beverly Hilton in Beverly Hills, California, on Sunday.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Foprah-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fansel-shailene-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fangelina-jolie3.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/awards/golden-globes-2018-what-you-didnt-see-on-tv/", "title": "What You Didn't See on TV at the 2018 Golden Globes", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Awards Shows,Golden Globe Awards,Movie News,News,Seth Meyers,TV", "news_keywords": "Awards Shows,Golden Globe Awards,Movie News,News,Seth Meyers,TV", "description": "The 75th annual Golden Globes were presented live on NBC from the Beverly Hilton in Beverly Hills, California, on Sunday", "og": {"title": "What You Didn't See on TV at the 2018 Golden Globes", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/awards/golden-globes-2018-what-you-didnt-see-on-tv/", "description": "While many tuned in to watch&nbsp;Seth Meyer‘s hilarious monologue and all the winners at the 2018 Golden Globe Awards&nbsp;on Sunday, PEOPLE was watching for the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/awards/golden-globes-2018-what-you-didnt-see-on-tv/", "description": "The 75th annual Golden Globes were presented live on NBC from the Beverly Hilton in Beverly Hills, California, on Sunday", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/awards/golden-globes-2018-what-you-didnt-see-on-tv/", "title": "What You Didn't See on TV at the 2018 Golden Globes", "description": "The 75th annual Golden Globes were presented live on NBC from the Beverly Hilton in Beverly Hills, California, on Sunday", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fjessica-chastain7.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}