{"url": "www.inquisitr.com/4908197/gwyneth-paltrow-reportedly-planning-for-a-baby-with-brad-falchuk/", "text": "Gwyneth Paltrow and her fiance, Brad Falchuk, are reportedly making some big plans. The couple are not only preparing to tie the knot, but they are also allegedly making room in their lives for a baby.\n\nAccording to a May 21 report by Radar Online, Gwyneth Paltrow and Brad Falchuk are planning for a baby. Paltrow, 45, already shares two children, Apple, 14, and Moses, 12, with her ex-husband, Coldplay frontman Chris Martin. However, she’s ready to build a brand new life with Falchuk and the two are reportedly looking into the adoption process.\n\nSources tell the outlet that Gwyneth and Brad were exploring the possibility of IVF to conceive their own biological child, but changed their minds. The insider also claims that the pair seriously considered using a surrogate to have a child, much like Kanye West and Kim Kardashian recently did. However, after much consideration they came to the conclusion that they would like to adopt a child. Paltrow is close to Charlize Theron and Sandra Bullock, both of whom have adopted children, and they’ve given her some very inspiring food for thought when it comes to the process.\n\nHowever, sources tell Gossip Cop that Gwyneth and Brad are not planning to start a family together, the actress is not pregnant nor is she considering adoption at the moment.\n\nMeanwhile, a wedding and a new child aren’t the only things that Gwyneth Paltrow and Brad Falchuk are planning together. The couple are reportedly combining many of their assets as their wedding day approaches, and are ready to open a brand new production company together.\n\nLast month, Paltrow and Falchuk threw a star-studded engagement party. Jennifer Aniston, Julia Roberts, Demi Moore, and many more of their family and friends were in attendance at the black tie affair, which some believed could have been their secret wedding. While the couple have not confirmed whether or not they are currently married, some fans believe they may have tied the knot under the radar.\n\nMeanwhile, Gwyneth Paltrow’s ex-husband, Chris Martin, has also moved on from their marriage. He has had multiple relationships since the divorce, including one with actress Jennifer Lawrence. However, he is currently dating Fifty Shades of Grey star Dakota Johnson. The couple have been spotted together multiple times, but are keeping their relationship as private as possible for the time being.", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/01/Gwyneth-Paltrow-Goop.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4908197/gwyneth-paltrow-reportedly-planning-for-a-baby-with-brad-falchuk/", "title": "Gwyneth Paltrow Reportedly Planning For A Baby With Brad Falchuk", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}