{"url": "www.theatlantic.com/entertainment/archive/2012/03/own-rearranges-deck-chairs-malia-obamas-redacted-spring-break/330368/", "text": "Duck bacon enthusiast Gwyneth Paltrow has taken to Facebook to let the world know she did not enlist the services of a ghostwriter on her 2011 cookbook My Father's Daughter. That runs contrary to the version of events given last week in a New York Times essay about the sometimes hard-scrabble literary life of the cookbook ghostwriter by Julia Moskin, who claimed that a writer named Julia Turshen worked in \"collaboration\" with Paltrow on the 2011 title, and apparently will soon be starting work on a second book with the actress. Paltrow suggests Moskin's \"facts need checking,\" and claims she wrote \"every word\" of the cookbook. Both accounts do seem like they could be kind of right, and hinge mainly on semantic points about the difference between ghostwriting, collaborating, and just hanging around and helping out. In the author's acknowledgements section of My Father's Daughter, Paltrow praises, \"the tireless, artful assistance of Julia Turshen, who stood over my shoulder at the stove and chopping block for the better part of a year, bringing a method to my freestyling madness,\" which certainly makes Turshen sound like a valuable member of the team, though not exactly Paltrow's Nom de Viking Range. Page Six notes previous articles about the book have credited Turshen as Paltrow's \"kitchen assistant,\" which seems fair enough. [Facebook and Page Six]\n\nMay 25. That's going to be Beyoncé's first live show since giving birth to registered trademark Blue Ivy Carter. The performance is part of a trio of shows the singer has booked for Atlantic City over Memorial Day. Fans should be delighted, as long as they don't accidentally stumble into a roofer's conference, instead of the Revel Resort nightclub. [New York Post]\n\nIt sounds like Robert De Niro turned in his least mailed-in performance since Jackie Brown last night during a fundraiser at his Tribeca restaurant Locanda Verde, with First Lady Michelle Obama on-hand as the guest of honor. America's greatest living actor even did a little pre-planned bit, telling the crowd in the restaurant's back room. \"Callista Gingrich. Karen Santorum. Ann Romney. Now do you really think our country is ready for a white first lady?\" At which point somebody apparently yelled \"No!\" and De Niro responded, \"Too soon, right?\" Hi-larious. Tickets for the 85-person event cost $5,000 and benefitted the Obama Victory Foundation. Other boldfaced names in attendance included Ben Stiller, Gayle King, Harvey Weinstein, Beyoncé Knowles, Whoopi Goldberg, Star Jones and Angela Bassett. [Politico]\n\nThere's a rumor making the rounds that Jennifer Aniston spends $8,000 a month on various unguents, pumice stones and free-range lip gloss, in order to continue looking like the Jennifer Aniston Americans adored on TV and haven't really given much thought to in movies. According to the actress, the $8,000 monthly makeup tab is way off. “Although I am a sucker for an amazing moisturizer, love a great facial, have been using the same cleansing bar since I was a teenager and have always been a dedicated tooth-brusher,\" she told People, \"reports that I am spending eight thousand a month on a beauty regime are greatly exaggerated.\" So what's a more accurate number? \"By my tally,” Aniston, “this month I’m in for about two hundred bucks.\" More reasonable, though we'd note that is still quite a bit of cheddar and the month is only a little more than halfway done. [People]", "images": ["https://cdn.theatlantic.com/thumbor/w7Mp36fcMz2vqG9pIHygJ3Wtsj0=/0x112:3500x1935/960x500/media/old_wire/img/upload/2012/03/20/RTXWAFZ_1/original.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://cdn.theatlantic.com/assets/media/img/wire/logo.png?v=3", "https://cdn.theatlantic.com/media/old_wire/img/upload/2012/03/20/mr_72e31a08ed9e6f.jpeg", "https://atlanticmedia.122.2o7.net/b/ss/atlanticprod/1/H.22--NS/0"], "top_img": "https://cdn.theatlantic.com/thumbor/w7Mp36fcMz2vqG9pIHygJ3Wtsj0=/0x112:3500x1935/960x500/media/old_wire/img/upload/2012/03/20/RTXWAFZ_1/original.jpg", "keywords": [], "authors": ["Ray Gustini"], "canonical_link": "https://www.theatlantic.com/culture/archive/2012/03/own-rearranges-deck-chairs-malia-obamas-redacted-spring-break/330368/", "title": "OWN Rearranges the Deck Chairs; Malia Obama's Redacted Spring Break", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "Also: Gwyneth Paltrow insists she knows how to write a cookbook.", "theme-color": "#000000", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "referrer": "unsafe-url", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "OWN Rearranges the Deck Chairs; Malia Obama's Redacted Spring Break", "type": "article", "url": "https://www.theatlantic.com/culture/archive/2012/03/own-rearranges-deck-chairs-malia-obamas-redacted-spring-break/330368/", "image": "https://cdn.theatlantic.com/thumbor/w7Mp36fcMz2vqG9pIHygJ3Wtsj0=/0x112:3500x1935/960x500/media/old_wire/img/upload/2012/03/20/RTXWAFZ_1/original.jpg", "description": "Also: Gwyneth Paltrow insists she knows how to write a cookbook."}, "fb": {"pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933", "admins": "577048155,17301937", "app_id": 100770816677686}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image", "image": {"src": "https://cdn.theatlantic.com/thumbor/w7Mp36fcMz2vqG9pIHygJ3Wtsj0=/0x112:3500x1935/960x500/media/old_wire/img/upload/2012/03/20/RTXWAFZ_1/original.jpg"}}, "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix/apple-touch-icon-iphone.50541ad29f2c.png", "ROBOTS": "INDEX, FOLLOW", "krux": {"title": "OWN Rearranges the Deck Chairs; Malia Obama's Redacted Spring Break", "description": "Also: Gwyneth Paltrow insists she knows how to write a cookbook."}, "author": "Ray Gustini", "ia": {"markup_url": "https://www.theatlantic.com/facebook-instant/article/330368/"}, "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "entertainment", "section": "Culture", "published_time": "2012-03-20T08:06:42-04:00", "modified_time": "2013-10-30T12:11:29-04:00"}, "keywords": "New York, International Business Times, New York Times, Gwyneth Paltrow, Huffington Post, Malia Obama, enthusiast Gwyneth Paltrow, Huffington Post page, Huffington Post homepage, New York Post, Politico media reporter, Obama White House, Business Times story, York Times essay, original AFP story, longtime Discovery executive, spring break trip, Washington Post, Daily Mail, Lady Michelle Obama, multiple format changes, Los Angeles, Amanda Seyfried, Obama Victory Foundation, Capital New York, various news agencies, online news media, Julia Turshen, major media companies, Daily Beast, hard-scrabble literary life, chief operating officer, chief financial officer, Secret Service agents, notes previous articles, Tribeca restaurant Locanda, public-affairs cable juggernaut, Josh Hartnett, little pre-planned bit, Jennifer Aniston Americans, Revel Resort nightclub, Wall Street Journal, 85-person event cost, Sunday night interview, registered trademark Blue, free-range lip gloss, CEO Brian Lamb, Los Angeles broker, media desk, NYT Mag tick-tock", "news_keywords": "New York, International Business Times, New York Times, Gwyneth Paltrow, Huffington Post, Malia Obama, enthusiast Gwyneth Paltrow, Huffington Post page, Huffington Post homepage, New York Post, Politico media reporter, Obama White House, Business Times story, York Times essay, original AFP story, longtime Discovery executive, spring break trip, Washington Post, Daily Mail, Lady Michelle Obama, multiple format changes, Los Angeles, Amanda Seyfried, Obama Victory Foundation, Capital New York, various news agencies, online news media, Julia Turshen, major media companies, Daily Beast, hard-scrabble literary life, chief operating officer, chief financial officer, Secret Service agents, notes previous articles, Tribeca restaurant Locanda, public-affairs cable juggernaut, Josh Hartnett, little pre-planned bit, Jennifer Aniston Americans, Revel Resort nightclub, Wall Street Journal, 85-person event cost, Sunday night interview, registered trademark Blue, free-range lip gloss, CEO Brian Lamb, Los Angeles broker, media desk, NYT Mag tick-tock"}, "movies": [], "publish_date": 1332245202.0, "source": "http://www.theatlantic.com", "summary": ""}