{"url": "https://www.teenvogue.com/story/alyson-stoner-when-its-right", "text": "Do it. Just say something. No, don’t. Don’t stare. Side-hug and leave. No. Ask for her number. Why are you panicking? She’s just a girl.\n\nA girl who changed everything I knew about myself as a woman, human being, and performer. Each song I write is a time capsule for how deeply I’ve explored my story to that point. My lyrics and melodies before I met her feel light-years away because of her profound effect on me. My new single “When It’s Right” is the first painting of a vivid new world I now call home, and she’s the main inspiration. So who is she?\n\nMy friend invited me to a trial dance workshop experimenting with floor work and learning to utilize the ground in freestyle and choreography. I was running late and tiptoed to the back as everyone drilled the first move. I skimmed the room to find the instructor.\n\nThere she was, wearing loose jeans and a backward snapback. She flipped and rolled her body around with adventure and total abandon. As a Type A perfectionist, I was mesmerized and intimidated.\n\n\"I saw you color the air around you. You heard the music a different way.\"\n\nAfter I dizzied myself from doing knee spins, she walked toward me to correct my form. My heart raced wildly and my body grew hot. Was I nervous to fail in front of an expert? Was I breathing heavily from being out of shape? Her smile was the most electrifying thing I’d ever seen.\n\nI left the workshop and texted my mother and best friend, saying, “I met a woman today, I’m not sure who she is or what I’m feeling, but I think she’s going to be in my life for a very long time.” I stayed in touch with her casually, if casually means texting most days for hours at a time. Our banter was natural, and we had a huge crossover of interests and passions, yet wildly different upbringings and beliefs. The question of whether she was a cool new friend or more kept me awake in wonderment and dread. I tried to be patient and stifle the emotions so I could think objectively. Our bond didn't feel quite sisterly or platonic. Flashes of her smile progressed to flashes of her wavy hair followed by the curve of her hips through her straight-leg pants. I realized I had never fantasized about a guy this way, nor really ever felt comfortable dating guys. Come to think of it, I stared at women’s bodies more than anything. But wasn’t that just societal conditioning or the unattainable beauty standards that fuel comparison and objectification? I refused to entertain other possibilities.\n\nShe and I continued to hang out and began sending good morning texts. Then we made dinner and watched Orange Is the New Black. Then we vented and supported each other. Then cuddled. Then kissed and kissed some more. OK, we were in a relationship. I fell in love with a woman.", "images": ["https://assets.teenvogue.com/photos/5abd4067f5df8c56b00b7051/16:9/w_1280,c_limit/FBALT.png", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5abd4031d913cb5d3306bece/master/w_1600%2Cc_limit/2018untitled%252520shoot-719-1.jpg", "https://assets.teenvogue.com/photos/5abd40321d5fe850a645a19f/16:9/w_2560%2Cc_limit/2018untitled%252520shoot-482-1-2.jpg"], "top_img": "https://assets.teenvogue.com/photos/5abd4067f5df8c56b00b7051/16:9/w_1280,c_limit/FBALT.png", "keywords": [], "authors": ["Alyson Stoner", "Alyson Stone"], "canonical_link": "https://www.teenvogue.com/story/alyson-stoner-when-its-right", "title": "Alyson Stoner: How I Embraced My Sexual Identity", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Alyson Stoner", "copyright": "Copyright (c) Condé Nast 2020", "description": "In this essay, actor and dancer Alyson Stoner opens up about falling in love with a woman and embracing her sexual identity.", "id": "5abb943833080b2feacae225", "keywords": "sexual health + identity,alyson stoner,lgbtq, lgbtq", "news_keywords": "sexual health + identity,alyson stoner,lgbtq, lgbtq", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5abb943833080b2feacae225", "parsely-metadata": "{\"description\":\"In this essay, actor and dancer Alyson Stoner opens up about falling in love with a woman and embracing her sexual identity.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5abd40321d5fe850a645a19f/16:9/w_1000,c_limit/2018untitled%20shoot-482-1-2.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5abd40321d5fe850a645a19f/1:1/w_1000,c_limit/2018untitled%20shoot-482-1-2.jpg\"}", "og": {"description": "\"In its purest sense, I felt awakened, more compassionate, and like my truest self.\"", "image": "https://assets.teenvogue.com/photos/5abd4067f5df8c56b00b7051/16:9/w_1280,c_limit/FBALT.png", "site_name": "Teen Vogue", "title": "Alyson Stoner: What It Was Like to Fall in Love With a Woman", "type": "article", "url": "https://www.teenvogue.com/story/alyson-stoner-when-its-right"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "\"In its purest sense, I felt awakened, more compassionate, and like my truest self.\"", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5abd4067f5df8c56b00b7051/16:9/w_1280,c_limit/FBALT.png?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Alyson Stoner: What It Was Like to Fall in Love With a Woman"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}