{"url": "https://web.archive.org/web/20170823223242/http://forfreedomworld.com/2017/08/20/breaking-rosa-parks-daughter-praises-trumps-response-to-charlottesville/", "text": "Liberals love to call President Trump a racist, but you know who doesn’t think that? The daughter of legendary civil rights activist Rosa Parks.\n\nTrump, who stood side by side with Rosa Parks while she was still alive and received praise for his work improving the community for black youths, recently condemned the violence on “many sides” – both the ironically named “antifa” who showed up to create problems at the “Unite the Right” rally and those who overreacted to the violent Communists attacking them.\n\nFor some, this isn’t good enough but Muriel Parks-Rosenberg stepped in on Friday to drop a truth bomb on liberals.\n\n“President Trump’s reaction has been criticized by the Left, but I don’t see what he did wrong,” she said in a speech at the Kennedy Center. “He strongly spoke out against hate both from those who make racial animus their primary cause and anarchists who showed up hoping to watch the world burn.”\n\n“My mother would have been proud of the President’s words,” she told the crowd of about 500 people. “Liberals who seek to use this rally to further their cause and attack President Trump need to go away and never come back.”", "images": ["https://web.archive.org/web/20170823223242im_/http://forfreedomworld.com/wp-content/uploads/2017/08/lol-800x445.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170823223242/http://forfreedomworld.com/2017/08/20/breaking-rosa-parks-daughter-praises-trumps-response-to-charlottesville/", "title": "BREAKING: Rosa Parks’ Daughter Praises Trump’s Response to Charlottesville – forfreedomworld", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "noindex,follow", "generator": "WordPress 4.8.1", "fb": {"pages": 258406767929581}, "ia": {"markup_url_dev": "http://forfreedomworld.com/2017/08/20/breaking-rosa-parks-daughter-praises-trumps-response-to-charlottesville/?ia_markup=1"}}, "movies": [], "publish_date": 1503158400.0, "source": "https://web.archive.org", "summary": ""}