{"url": "www.vh1.com/news/286418/dating-a-guy-with-pregnant-ex/", "text": "We all have baggage, but how much is too much?\n\nWhat Would You Do If Your New Man Has a Baby on the Way?\n\nBy: Taylor Davis\n\nLast night the Cleveland Cavaliers were given their championship rings for winning the NBA title in June. Not sure why it takes that long, but whatever. This is less about the belated ceremony and more about what happened after it was over. Khloe Kardashian took to Instagram to post a picture commemorating the night. She was stuntin’ for the ’Gram with her new bae, Cavs star Tristan Thompson. This raised a whole lot of questions for me.\n\nFor the past few weeks Khloe and her new man, Tristan, have been boo-lovin’ all over Snapchat but this was his first appearance on her Instagram. They reportedly met at Kevin Hart’s wedding this August when Tristan showed up with his pregnant girlfriend, Jordan Craig.\n\nSo, now the internet is abuzz with questions about the situation: Did Tristan leave a pregnant Jordan for Khloe? How is Khloe cool with all of this?\n\nSplash\n\nWe don’t really know how or why Tristan and Jordan broke up, but it happens, right? But should Khloé accept this as baggage and continue to pursue the man she’s really digging? Or, does she walk away because this complicates a very new relationship? This is way bigger than choosing locations for dinner and a movie on our fifth date.\n\nAll I want to know is, Khloe Alexandra Kardashian what are you doing girl? I’m just trying to figure out how to be mentally built like that. I don’t want to be savage like Rihanna, cause there’s levels to this ish, but I’m currently too fuccboiphobic to play around in this rather mature arena.\n\nI could meet a man tomorrow, who’s fine, smart, funny and believes that I’m his soulmate but as soon as he forms his mouth to say, “But I’m having a baby in three months with my ex!” there’s only one thing left for me to say: “I’m dipping out like Straight Up #g2g.”\n\nWhile everyone has baggage and there’s nothing to be mad or salty about, there would just be too many unknowns for me as I’m trying to establish something with someone. Let’s be clear, this is very different from dating someone that already has kids or a man that cheated on you and got someone else pregnant like Love and Hip Hop New York’s ultimate love triangle Peter Gunz , Tara Wallace and Amina Buddafly .\n\nMy biggest concern is how do I fit in as a new girlfriend to two people co-parenting their first child? There’s always going to be a discussion around my levels of comfort in terms of his interactions with his ex. I know he’s going to have to do things like go to doctor’s appointments but if she asks anything more and that’s not okay with me, am I allowed to express it or do I just have to accept whatever her demands are of him for the sake of their child? Irregardless, every step of the way, there’s a new obstacle.\n\nWhat if I’m put in the middle of disputes between two first time parents like Kehlani was when Kyrie Irving’s ex called her out on Instagram for not pushing him to spend more time with their daughter?\n\nHow can I trust that they are completely over each other and won’t start rekindling anything like Nick Young and his baby mama?\n\nAm I prepared to be involved (in someway) of raising a child with a man that I went on my first date with a few weeks ago like Khloe and Tristan?\n\nKhloe just wants to have fun without any drama, but what part of this sounds like fun or drama-free? I don’t think I could date a first time parent-to-be with a baby on the way with their ex because this doesn’t seem like a fun way to get to know someone. No judgement here, that’s just me.\n\nEither way, Jordan doesn’t seem stressed.\n\nWhat would you do in this situation? Let us know in the comments below.", "images": ["http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:464738?quality=0.8&format=jpg&width=480&height=270", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:410474?quality=0.8&format=jpg&width=110&height=110", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:664088?quality=0.8&format=jpg&width=110&height=110", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:669222?quality=0.8&format=jpg&width=110&height=110", "http://vh1.mtvnimages.com/uri/mgid:file:http:shared:vh1.com/news/uploads/sites/2/2016/10/spl1356658_001-1477338307.jpg?quality=0.85&format=jpg&width=480", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:668067?quality=0.8&format=jpg&width=110&height=110", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:464738?quality=0.8&format=jpg&width=1440&height=810&.jpg", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:456682?quality=0.8&format=jpg&width=150&height=110", "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:668071?quality=0.8&format=jpg&width=110&height=110"], "top_img": "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:464738?quality=0.8&format=jpg&width=1440&height=810&.jpg", "keywords": [], "authors": ["Taylor Davis"], "canonical_link": "http://www.vh1.com/news/286418/dating-a-guy-with-pregnant-ex/", "title": "What Would You Do If Your New Man Has a Baby on the Way?", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0", "reporting": {"beacon_url": "http://mb.mtvnservices.com/data/collect/v1/mb.gif", "beacon_topic": "vh1.com"}, "ao": {"mgid": "mgid:wordpress:post:articles.vh1.com:286418"}, "og": {"site_name": "VH1 News", "title": "What Would You Do If Your New Man Has a Baby on the Way?", "url": "http://www.vh1.com/news/286418/dating-a-guy-with-pregnant-ex/", "image": {"identifier": "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:464738?quality=0.8&format=jpg&width=1440&height=810&.jpg", "width": 1440, "height": 810}, "type": "article", "description": "Khloe Kardashian and Tristan Thompson are an item while he has a baby on the way with his ex-girlfriend."}, "fb": {"app_id": 709094809266522}, "twitter": {"description": "Khloe Kardashian and Tristan Thompson are an item while he has a baby on the way with his ex-girlfriend.", "title": "What Would You Do If Your New Man Has a Baby on the Way?", "image": "http://vh1.mtvnimages.com/uri/mgid:ao:image:mtv:464738?quality=0.8&format=jpg&width=500&height=375", "url": "http://www.vh1.com/news/286418/dating-a-guy-with-pregnant-ex/", "card": "summary_large_image"}, "description": "Khloe Kardashian and Tristan Thompson are an item while he has a baby on the way with his ex-girlfriend.", "thumbnail": "http://vh1.mtvnimages.com/uri/mgid:file:http:shared:vh1.com/news/uploads/sites/2/2016/10/KhloeK2012-1477513806-191x300.jpg?quality=0.8&format=jpg"}, "movies": [], "publish_date": null, "source": "http://www.vh1.com", "summary": ""}