{"url": "www.newidea.com.au/prince-harry-and-meghan-markle-baby-joy", "text": "Getty\n\nMeghan has been looking a bit peaky at the last few events.\n\n‘She’s usually so full of energy and very lively – but she definitely seems tired and withdrawn at the moment,’ says a source. ‘Of course, all the baby whispers would explain why she’s not herself and seems so pale.’\n\nThe exciting development comes just weeks after Meghan described being married as ‘wonderful’, before adding Harry is ‘the best husband ever’.\n\nThe news was first shared with the Queen the same day, just before Meghan boarded the train to Cheshire.\n\n‘It gave the Queen and Meghan a lot to talk about during their journey on the Royal Train together and there was lots of baby talk,’ reveals a source.\n\nAccording to the insider, Harry has always been the Queen’s favourite and she’s taken a definite liking to Meghan – she sees a lot of herself in Meghan’s strength and tenacity.\n\nRelated: Meghan Markle and Prince Harry 'actively trying' to start a family\n\nRelated: Meghan Markle and Prince Harry reportedly 'having twins'\n\nAnd to hear that they’re to be parents is exciting for Her Majesty.\n\n‘We haven’t seen the Queen that happy and that excited in a long time – it was wonderful to see,’ the insider revealed.\n\nThe source went on to say the mood has really continued throughout the palace since they returned. And no-one could be happier.\n\n‘Meghan’s still in the early stages of her pregnancy, but the palace is already working on announcements. This is the news the world has been waiting for.’\n\nThe royal couple, who are set to carry out a tour of Australia, New Zealand, Fiji and Tonga in October, are making sure to cram in as many overseas tours as they can before Meghan is too big to travel.\n\n‘Harry and Meghan wanted to get a few visits in so that she could get to know the Commonwealth countries and start making a contribution to the royal family,’ revealed a source. ‘But the Queen understands that their main priority is to start a family.’\n\nMeanwhile, royal fans in the UK have been madly placing bets on Meghan and Harry announcing their pregnancy in 2018, with Ladbrokes giving the odds a 4/6 chance.\n\nLast month a friend close to the couple also told The Mirror: ‘They’re desperate to have a family as soon as possible’.\n\nSo keen are Harry and Meghan to have children, sources also claimed that the couple actually started trying for a baby before they got married.\n\nGetty\n\nGiven the fact that Meghan is 36 and her biological clock is ticking, the couple didn’t want to wait to start a family.\n\n‘They actually stopped using protection over two months ago, although they abstained from sex in the weeks leading up to the wedding,’ a source told Hollywood Life.\n\nAnd Harry previously talked about wanting kids before he even met Meghan. ‘I’ve longed for kids since I was very, very young,’ he said back in 2012.\n\n‘I’m waiting to find the right person. Someone who is willing to take on the job.’\n\nIn their sit-down interview with the BBC Harry expressed his desire to have children sooner rather than later: ‘We will start a family in the near future,’ he said.\n\nThankfully, according to royal expert Katie Nicholl, his wife is the perfect mother-to-be.\n\n‘Meghan is very doting with children. She is very maternal and she was thrilled to meet George and Charlotte. I think one of the lovely things that I discovered [while writing] the book was it was actually a moment involving children when Meghan really fell for Prince Harry,’ she said.\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/media/29282/harry-meghan.jpg", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/29282/harry-meghan.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/prince-harry-and-meghan-markle-baby-joy", "title": "Meghan and Harry: Our baby joy", "meta_data": {"language": "en-us", "description": "It’s the news royal watchers around the world have been eagerly waiting for: a royal cameraman tells New Idea exclusively that a royal baby is on its way, with Meghan and Harry soon welcoming the pitter-patter of tiny feet.", "news_keywords": "Prince Harry, Meghan Markle, prince Harry meghan markle, prince harry meghan markle twins, celeb babies, celebrity babies, royals, royal babies, the royals, royal family, royal family news, latest royal family news, the royal family, royal family babies, royal baby, meghan markle pregnant, meghan", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/prince-harry-and-meghan-markle-baby-joy", "title": "Meghan and Harry: Our baby joy", "description": "It’s the news royal watchers around the world have been eagerly waiting for: a royal cameraman tells New Idea exclusively that a royal baby is on its way, with Meghan and Harry soon welcoming the pitter-patter of tiny feet.", "image": {"identifier": "http://www.newidea.com.au/media/29282/harry-meghan.jpg", "width": 1500, "height": 1000}}, "twitter": {"title": "Prince Harry and Meghan Markle's baby joy", "description": "It’s the news royal watchers around the world have been eagerly waiting for: a royal cameraman tells New Idea exclusively that a royal baby is on its way, with Meghan and Harry soon welcoming the pitter-patter of tiny feet.", "image": "http://www.newidea.com.au/media/29282/harry-meghan.jpg", "url": "https://www.newidea.com.au/prince-harry-and-meghan-markle-baby-joy"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1529863544.291, "source": "http://www.newidea.com.au", "summary": ""}