{"url": "http://time.com/4523755/donald-trump-leaked-tape-impact/", "text": "The bombshell dropped on the Washington Post’s website just after 4 p.m.: a video of Donald Trump, in 2005, using extremely vulgar language to describe women, detailing his attempt to bed a married woman and bragging that he can grope women because he is a celebrity. Less than an hour later, Wikileaks published more than 2,000 emails from what appeared to be the personal account of the chairman of Hillary Clinton’s presidential campaign.\n\nBut not even John Podesta’s private and largely inside-baseball notes to Clinton could save Trump the lashing that was coming his way.\n\nRepublicans lined up to criticize Trump’s language and attitudes toward women. His advisers worried about what else might be out there to sink their chances with just over a month until Election Day. Trump Tower was in full meltdown mode again, with some advisers urging him to make another apology and others just trying to make him see that there was a serious problem. And Trump’s Sunday night’s debate against the first woman to lead a major-party presidential ticket just became that much more of a draw in a cycle that has already broken television records.\n\nTrump initially issued a brief statement that claimed Bill Clinton had said far worse things as the pair played golf. Republicans’ freak-out did not slow, and he dropped plans to campaign in Wisconsin with House Speaker Paul Ryan. Shortly after midnight, Trump tried the apology again. “These words don’t reflect who I am. I said it. I was wrong. And I apologize,” Trump said in a straight-to-camera address that he released on social media. He likened the archived video to a distraction from the campaign he is fighting against Clinton.\n\nThen, against allies’ advice, he returned to Bill and Hillary Clinton’s marriage. “Bill Clinton has actually abused women. And Hillary has bullied, attacked, shamed and intimidated his victims. We will discuss this more in the coming days,” Trump said.\n\nIt wasn’t exactly the advice many of his supporters were seeking. “Donald Trump needs to humble himself,” Trump adviser Kayleigh McEnany said on CNN, perhaps recognizing that Trump tends to listen to the talking heads on TV more than the people in his penthouse. Hearing someone who might be the next President of the United States say some of Trump’s words was too galling to notions of how one behaves in the Oval Office. “There have to be dozens of tapes like this when a candidate has diarrhea of the mouth,” Republican strategist and Trump critic Katie Packer said. Added veteran Republican Stuart Stevens: “How does any woman work for Donald Trump?”\n\nIt made for a remarkable evening in an already remarkable campaign. The dueling releases came on the same day the U.S. government officially said what has been deeply suspected for a long while: Russia was looking to interfere with America’s election. In the midst of all this, the State Department’s release of more of Clinton’s own emails from her time as the nation’s top diplomat were largely an afterthought, as were Trump’s continued incorrect claims about the Central Park Five.\n\nAs Trump’s candidacy appeared—yet again—to teeter on implosion, rabble-rouser hacktivist Julian Assange opened up Podesta’s Gmail account in an attempt to distract from the Trump fiasco. Trump made a feeble attempt at apologizing while his son tried to distract attention to Clinton’s emails, which he called an “October Surprise” on Twitter. All eyes stayed on Trump’s words, however. “Women have the power to stop Trump,” Clinton tweeted and posted a video of his worst statements about women.\n\nIn an election that has already tested the norms of politics and the collective stomach of its voters, the distinct events—and the responses—would affect specific blocs of voters that each candidate is struggling to lock down. For Trump, his standing with female voters was at risk well before the video emerged that includes him bragging about getting away with groping women because he is a celebrity. Hearing him say “When you’re a star, they let you do it” hardly inspires the same feelings the country had for Barack Obama or Ronald Reagan.\n\n“He is talking about sexual assault. There’s no other way to frame this,” Republican strategist Amanda Carpenter told CNN, where she is a contributor.\n\nFor Clinton, her top aide’s emails offered an embarrassing window into both her political calculations in private and highlights from paid speeches—a sore spot for younger voters who spent months being told by Clinton’s one-time rival Bernie Sanders that she couldn’t be trusted. In one email, sent just before Iowa’s lead-off caucuses this year, the top communications aides were brought up to speed on what Clinton had said behind closed doors. The worst possible headlines? “Clinton admits she is out of touch,” “Clinton suggests she is a moderate” and “Clinton says you need to have a private and public position on policy.”\n\nAnother potential pickle is this headline: “Clinton is aware of security concerns around BlackBerries.” Republicans are obsessed with Clinton’s use of a private email server as Secretary of State, and anything involving email is likely to overshadow any of Trump’s woes in the echo chamber of conservative Twitter.\n\nYet, as a whole, Trump’s video was more damning. Here was the candidate, on tape, engaging in what Trump himself would later call “locker-room banter” laughing about trying to bed a married woman, describing women’s appearance in crass terms and popping breath mints in case he could woo an actress, just months after his own wedding. There was no excuse for the behavior, and Republicans were not rushing to provide one.\n\nRepublican National Committee Chairman Reince Priebus, who has tried to guide Trump to more respectable ground, released a statement: “No woman should ever be described in these terms or talked about in this manner. Ever.” The 2012 Republican nominee, Mitt Romney, tweeted that “such vile degradations demean our wives and daughters and corrupt America’s face to the world.” Sen. Mark Kirk or Illinois called Trump “a malignant clown.” Sen. Kelly Ayotte of New Hampshire called the remarks”totally inappropriate and offensive.” Sen. Jeff Flake of Arizona said “America deserves far better” than Trump. Trump’s vanquished rival for the GOP nomination Jeb Bush said “no apology can excuse away Donald Trump’s reprehensible comments degrading women.”\n\nTrump loyalists merely said Clinton was behind the release of Trump’s video. “They did their opposition research. This is what they had,” former Rep. Michele Bachmann told MSNBC. “She has to change the narrative.” Pressed by host Chris Matthews, Bachmann said she had no evidence to back up her claim. Faith and Freedom Coalition Chairman Ralph Reed told CNN that abortion and the economy would keep Trump’s supporters firmly in their camp. “A 10-year-old tape of a private conversation with a TV talk show host ranks pretty low on their hierarchy of their concerns,” he said.\n\nThat thinking might help some of Trump’s backers to justify their continued support. After all, Hillary Clinton is hardly a beloved figure after decades in public life, and antipathy runs deep in conservative circles. The release of her campaign chairman’s stolen emails will give her critics yet more fodder.\n\nBut there’s a fundamental difference between aides deliberating which joke to use in a speech and the candidate himself using foul language to talk about unwanted sexual advances. If Friday night’s competing and unexpected releases are a preview of what voters should anticipate for the next month, it will be a very long October.\n\nGet our Politics Newsletter. Sign up to receive the day's most important political stories from Washington and beyond. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Philip Elliott at philip.elliott@time.com.", "images": ["https://api.time.com/wp-content/uploads/2016/10/trump-apologizes.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2016/10/gettyimages-461840086.jpg?quality=85&w=594", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2016/10/donald-trump-02.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2016/10/trump-apologizes.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Philip Elliott"], "canonical_link": "https://time.com/4523755/donald-trump-leaked-tape-impact/", "title": "Donald Trump, Billy Bush: Interview Scrambles Race", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "2016 election, donald trump, hillary clinton, donald trump billy bush, donald trump kissing, donald trump grabbing pussy, donald trump women", "news_keywords": "2016 election, donald trump, hillary clinton, donald trump billy bush, donald trump kissing, donald trump grabbing pussy, donald trump women", "description": "Tape of Donald Trump's lewd talk could upend the final month of the presidential race. Not even leaked Clinton aides' emails could save him.", "og": {"title": "How Friday Night Scrambled the Presidential Race", "type": "article", "site_name": "Time", "url": "https://time.com/4523755/donald-trump-leaked-tape-impact/", "description": "Dueling October surprises.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2016/10/trump-apologizes.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4523755/donald-trump-leaked-tape-impact/", "description": "Tape of Donald Trump's lewd talk could upend the final month of the presidential race. Not even leaked Clinton aides' emails could save him.", "media": "https://api.time.com/wp-content/uploads/2016/10/trump-apologizes.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4523755/donald-trump-leaked-tape-impact/", "title": "How Friday Night Scrambled the Presidential Race", "description": "Dueling October surprises.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2016/10/trump-apologizes.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}