{"url": "www.washingtonpost.com/news/morning-mix/wp/2017/05/09/richard-simmons-is-not-transgender-but-national-enquirer-claimed-he-is-now-hes-suing/", "text": "AD\n\nAccompanying these stories were several photographs, including those of Simmons wearing a black dress and a coral wig. Simmons, of course, is well-known for wearing outrageous outfits.\n\nAD\n\nRichard Simmons says he did not get a sex change.\n\nOn Monday, he filed a libel lawsuit in Los Angeles Superior Court against American Media, the owner of National Enquirer and Radar Online, for these “cruel and malicious” articles. He is seeking compensatory and punitive damages along with a retraction of the stories, an apology and an injunction.\n\nThe lawsuit claimed the publications “cheaply and crassly commercialized and sensationalized an issue that ought to be treated with respect and sensitivity.”\n\nAD\n\nThe suit claims the publications chose to paint Simmons as transgender because his history of supporting the LGBT community would make it more difficult for him to sue. (Simmons has never spoken openly about his own sexual identity. He has danced around the issue, though, such as when he told Wendy Williams that “any moment I could just go right up in flames.”)\n\nAD\n\nIf he were to deny such a rumor, therefore, it might appear that Simmons thought being transgender was a negative thing.\n\n“For Mr. Simmons to sue, the National Enquirer and Radar Online have cynically calculated, will make Mr. Simmons appear to maintain that there is something wrong with transitioning from one gender to another,” the lawsuit stated. “To remain passive and do nothing, the calculation continues, will be seen as tacitly conceding the truth of the stories, encouraging more of them.”\n\nAD\n\nIt continued, “National Enquirer and Radar Online have miscalculated.”\n\nIndeed, Simmons made a rare public statement against the stories as early as June 2016. In a Facebook post, he reaffirmed his own support of the LGBT community and asked his followers to join him — particularly in the wake of the June 12, 2016, Orlando Pulse nightclub shooting.\n\nAD\n\n“Although I am not transitioning, I have and always will be supportive of those who are going through their journey,” he wrote. “We should not lose focus on showing love, strength and compassion to all of the LGBT community during these tragic times. My broken heart and healing thoughts are with the people of Orlando and all other victims of prejudice, bigotry and hate.”\n\nAD\n\nThe publications defended themselves in a statement claiming that for Simmons to say “his privacy has been invaded is hypocritical when his entire livelihood is based upon the public consumption of his image.”\n\nIt added that Simmons’s retreat from public life is “a legitimate news story that demands coverage.”\n\n“Indeed, it is ironic that Mr. Simmons claims to be an avid supporter of the LGBTQ community while at the same time alleges that he was defamed by report that he had transitioned into a female,” the statement continued.\n\nAD\n\nThe statement concluded that the stories were “based on credible sources who were in Mr. Simmons’ inner circle.”\n\nThat source, according to Simmons’s lawsuit, is Mauro Oliveira, a man who for years “blackmailed, extorted, and stalked” Simmons, beginning in May 2015, “with the intention of destroying career and reputation.”\n\nAD\n\n“Mr. Oliveira contacted the National Enquirer on at least three separate occasions offering three separate stories as to why Mr. Simmons has been absent from the media in the past few years,” the lawsuit stated.\n\nThe first story said Simmons was “frail, weak and spiritually broken” and “in desperate need of help.” The second claimed Simmons was being held hostage by his housekeeper who engaged in witchcraft — a rumor repeated on the hit podcast about his disappearance.\n\n“While pitching around these ideas, Mr. Oliveira was simultaneously blackmailing Mr. Simmons, sending him emails and threatening to destroy his reputation with damaging press coverage unless Mr. Simmons paid Mr. Oliveira to stop,” the lawsuit stated.\n\nAD\n\nAD\n\n(Oliveira responded to People magazine: “The allegations are false, and the real story about Richard Simmons will come out eventually.)\n\nAmerica Media is no stranger to lawsuits. The company remains in a legal battle with Phil McGraw (Dr. Phil) and his wife, Robin, who sued the National Enquirer for $250 million after the publication claimed that McGraw abused his wife.\n\nNonetheless, the company announced it will continue its investigation into Simmons.\n\n“We stand by our reporting about Mr. Simmons, and intend to vigorously defend this lawsuit and win public vindication of our reports,” it said in a statement. “We will also aggressively pursue our ongoing investigation into his life and who is really behind this bizarre and meritless lawsuit.”\n\nAD\n\nMore from Morning Mix", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7G4WWAN7AEY3HBLH2PHCS37KQA.jpg&w=150", "https://www.washingtonpost.com/resizer/cJG-kTMYTBLznUCFxgN35K2DG_E=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7G4WWAN7AEY3HBLH2PHCS37KQA.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/611eba8a-306c-4ad4-9628-68035a07276e.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/cJG-kTMYTBLznUCFxgN35K2DG_E=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7G4WWAN7AEY3HBLH2PHCS37KQA.jpg", "keywords": [], "authors": ["Travis M. Andrews", "Pop Culture Reporter Covering Music", "Movies", "Tv", "Comedy", "Celebrity Culture"], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2017/05/09/richard-simmons-is-not-transgender-but-national-enquirer-claimed-he-is-now-hes-suing/", "title": "National Enquirer claimed Richard Simmons was transgender. Now he’s suing.", "meta_data": {"description": "\"We will … aggressively pursue our ongoing investigation into his life and who is really behind this bizarre and meritless lawsuit,” the publication responded.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/05/09/richard-simmons-is-not-transgender-but-national-enquirer-claimed-he-is-now-hes-suing/", "image": "https://www.washingtonpost.com/resizer/cJG-kTMYTBLznUCFxgN35K2DG_E=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7G4WWAN7AEY3HBLH2PHCS37KQA.jpg", "title": "National Enquirer claimed Richard Simmons was transgender. Now he’s suing.", "description": "\"We will … aggressively pursue our ongoing investigation into his life and who is really behind this bizarre and meritless lawsuit,” the publication responded."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "National Enquirer claimed Richard Simmons was transgender. Now he’s suing.", "description": "\"We will … aggressively pursue our ongoing investigation into his life and who is really behind this bizarre and meritless lawsuit,” the publication responded."}, "last_updated_date": "2019-04-29T23:02:29.648Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1494259200.0, "source": "http://www.washingtonpost.com", "summary": ""}