{"url": "https://www.masslive.com/entertainment/index.ssf/2011/04/royal_wedding_fashion_dos_and_donts.html", "text": "NEW YORK — The biggest fashion faux pas for a wedding guest — to any wedding — would be to upstage the bride.\n\nOf course, with all the attention and speculation surrounding Kate Middleton's gown for Friday's royal wedding in London, that would be nearly impossible to do.\n\nBut there are other unwritten rules for guests to consider: Don't wear white, anything too revealing or a hat so wide or tall it would block the view of the person behind you.\n\nYou can wear tasteful black, and be sure to cover your arms.\n\n\"This is not a place to make a fashion statement for yourself,\" said Sally Kilbridge, deputy editor of Brides magazine. She ticks off more don'ts, including no miniskirts, plunging necklines and novelty socks, which have become a surprising trend at least among guests at American weddings.\n\nThe attire worn to a British royal wedding is appropriate daytime wedding attire kicked up many, many notches, Kilbridge said. Everyone's outfit should be chic, elegant and suit the very formal, traditional occasion while not letting glitzy, black-tie, eveningwear trappings creep in, she advises.\n\nDesigner Reem Acra, who makes both red-carpet and bridal gowns, thinks Westminster Abbey could be the place for cocktail frocks, though. (Celebrities and fashion editors, after all, have long found reason to wear them before noon.)\n\nRelated stories\n\n\"The female guests should wear cocktail dresses to the upcoming wedding,\" she said. \"It's a very understated and classical look but very young and modern at the same time.\"\n\nThe fashion role model here should be \"high society's ladies who lunch\" in well-cut, luxe-fabric skirt suits for the older women, while Middleton's younger friends could pull off slightly retro, Hitchcock-inspired sheaths or pencil skirts paired with nipped-waist jackets, suggested celebrity stylist George Kotsiopoulos, co-host of E!'s \"Fashion Police\" on TV.\n\nHe expects a lot of hats, but, he says, he hopes they'll be toned-down cloches or a pillbox with a veil. \"I hope they're not cartoon-y, but I do think we'll see some cartoon-y hats.\"\n\nBritish milliner Vivien Sheriff, who has made several dozen custom headpieces for wedding guests, said many guests will follow the lead of Middleton's mother, Carole — a fan of substantial hats.\n\nThe hats Sheriff has made feature some feathers and crystals — and are quite celebratory, she described — but they're not oversized. \"You can't show off too much. You don't want to overdo it, but there is a lot of expression in the headpieces.\"\n\nSheriff added, \"People aren't going to want to hide their faces, so the brims won't cover them. This way, everyone can get good photos and you can greet other guests looking them in the eye.\"\n\nThere is going to be more black than one might expect, Sheriff said. She certainly had more orders for black than she expected. \"I guess fashion has changed and a lot of young guests want to wear black.\"\n\nMiddleton herself was photographed earlier this year attending a wedding in a black outfit.\n\nBlack is fine as long as it's not funereal, according to Brides' Kilbridge, although you won't see the Middleton family wearing it. Prince Charles' wife Camilla won't wear it either, she predicted.\n\nCamilla will likely pluck something she already had in her closet, Kilbridge said, probably something not unlike the tailored dress and lovely coat she wore to her own wedding.\n\nMost of the male guests will likely don a navy or gray morning suit, which is basically the daytime equivalent of a tuxedo including a vest or waistcoat, and all of William's military friends of will be in uniform, she said.\n\nKotsiopoulos notes this is a chance for London's famous Saville Row to show off the fine, crisp tailoring it has long been known for. \"If there was ever a place to get a great suit, this is it.\"\n\nA guest with a well-known personal style, however, has a little more flexibility, said Kilbridge. It would be perfectly acceptable for Elton John, for example, to wear a flashy, embroidered vest under his jacket.\n\nFashion fans will be eager to see David and Victoria Beckham, and Kilbridge thinks they won't disappoint, although she wonders how Victoria Beckham will dress her baby bump. \"They've had some crazy fashion moments, but this won't be one of them. She'll probably look fantastic. They want to create the impression that she belongs there. I think most people will be striving to look like they belong.\"\n\nThat might have singer Joss Stone, who is famously barefoot almost everywhere she goes, digging to the bottom of her closet looking for a pair of shoes.", "images": ["https://www.masslive.com/pf/resources/images/common/icons/sign-out-lock.svg?d=235", "https://www.masslive.com/pf/resources/images/masslive/logos/logo_main_sm.svg?d=235", "https://www.masslive.com/pf/resources/images/footer-logo-advance.svg?d=235", "http://media.masslive.com/entertainment/photo/9524579-large.jpg", "https://www.masslive.com/pf/resources/images/common/ps-images/ad-choices-arrow.png?d=235", "https://www.masslive.com/resizer/aB9xHsZ6IWXSxfe9I3LZGtBCK-w=/1280x0/smart/advancelocal-adapter-image-uploads.s3.amazonaws.com/image.masslive.com/home/mass-media/width2048/img/entertainment/photo/royal-wedding-fashion-9364653a63811a86.jpg", "https://www.masslive.com/pf/resources/images/common/icons/Arrow_back.svg?d=235", "https://www.masslive.com/pf/resources/images/masslive/logos/logo_main.svg?d=235"], "top_img": "https://www.masslive.com/resizer/aB9xHsZ6IWXSxfe9I3LZGtBCK-w=/1280x0/smart/advancelocal-adapter-image-uploads.s3.amazonaws.com/image.masslive.com/home/mass-media/width2048/img/entertainment/photo/royal-wedding-fashion-9364653a63811a86.jpg", "keywords": [], "authors": ["The Associated", "The Associated Press", "Associated Press"], "canonical_link": "https://www.masslive.com/entertainment/2011/04/royal_wedding_fashion_dos_and_donts.html", "title": "Royal Wedding fashion dos and don'ts for wedding guests", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "fb": {"admins": 100000302287435, "app_id": 128638450487680}, "title": "Royal Wedding fashion dos and don'ts for wedding guests", "og": {"title": "Royal Wedding fashion dos and don'ts for wedding guests", "url": "https://www.masslive.com/entertainment/2011/04/royal_wedding_fashion_dos_and_donts.html", "site_name": "masslive", "type": "article", "description": "The attire worn to a British royal wedding is appropriate daytime wedding attire kicked up many, many notches.", "image": {"identifier": "https://www.masslive.com/resizer/aB9xHsZ6IWXSxfe9I3LZGtBCK-w=/1280x0/smart/advancelocal-adapter-image-uploads.s3.amazonaws.com/image.masslive.com/home/mass-media/width2048/img/entertainment/photo/royal-wedding-fashion-9364653a63811a86.jpg", "width": 1280}}, "article": {"published_time": "2011-04-28T18:08:52Z", "modified_time": "2011-04-28T14:08:52Z", "section": "Entertainment", "tag": "royal-wedding"}, "twitter": {"title": "Royal Wedding fashion dos and don'ts for wedding guests", "site": "@masslivenews", "card": "summary_large_image", "description": "The attire worn to a British royal wedding is appropriate daytime wedding attire kicked up many, many notches.", "image": "https://www.masslive.com/resizer/aB9xHsZ6IWXSxfe9I3LZGtBCK-w=/1280x0/smart/advancelocal-adapter-image-uploads.s3.amazonaws.com/image.masslive.com/home/mass-media/width2048/img/entertainment/photo/royal-wedding-fashion-9364653a63811a86.jpg"}, "article_publication_name": "https://www.masslive.com/entertainment/2011/04/royal_wedding_fashion_dos_and_donts.html", "article_date_original": "Thursday, April 28, 2011, 02:08 PM", "article_date_updated": "Thursday, April 28, 2011, 10:08 AM", "sailthru.tags": "entertainment,luxury,celebrity,fashion,royal-wedding,joss stone,reem acra,wedding", "sailthru.date": "Thursday, April 28, 2011, 02:08 PM", "sailthru.title": "Royal Wedding fashion dos and don'ts for wedding guests", "sailthru.author": "the-associated-press", "sailthru.description": "The attire worn to a British royal wedding is appropriate daytime wedding attire kicked up many, many notches.", "sections": "entertainment", "byline": "The Associated Press | MassLive", "subscriber_only": "false", "Description": "The attire worn to a British royal wedding is appropriate daytime wedding attire kicked up many, many notches.", "article_author": "The Associated |"}, "movies": [], "publish_date": 1304014132.0, "source": "https://www.masslive.com", "summary": ""}