{"url": "https://web.archive.org/web/20100330081658/http://switchboard.nrdc.org:80/blogs/bfinamore/chinas_carbon_intensity_target.html", "text": "China yesterday announced that Premier Wen Jiabao will attend the Copenhagen climate summit and that he will bring with him a target for China of reducing carbon intensity by 40 to 45 percent from 2005 levels by 2020. Coming a day after the announcement across the Pacific that President Obama will attend the beginning of the summit, bringing a commitment to reduce U.S. emissions \"in the range of 17%\" from 2005 levels by 2020, this means that we now know what the world's two largest emitters will be bringing to the table when the world's countries gather in Copenhagen.\n\nThe official announcement (in Chinese here) notes that on November 25, Premier Wen Jiabao and the State Council standing committee met and decided upon the 2020 target and corresponding measures to achieve it. Of note are the following points:\n\n1.) What exactly does the carbon intensity target cover? China will reduce its carbon intensity, the CO2 emitted per unit GDP, by 40 to 45 percent from 2005 levels by 2020. This carbon intensity target will measure only the CO2 emissions from energy consumption and industrial activity, the source of most of China's emissions, and does not take into account efforts to reduce emissions or increase sinks from land use and forestry. This makes sense given that estimating emissions from land use and forestry is less precise than measuring emissions from fuel combustion and industrial activity, both of which are also more tightly linked to GDP than land use and forestry.\n\nChina will reduce its carbon intensity, the CO2 emitted per unit GDP, by 40 to 45 percent from 2005 levels by 2020. This carbon intensity target will measure only the CO2 emissions from energy consumption and industrial activity, the source of most of China's emissions, and does not take into account efforts to reduce emissions or increase sinks from land use and forestry. This makes sense given that estimating emissions from land use and forestry is less precise than measuring emissions from fuel combustion and industrial activity, both of which are also more tightly linked to GDP than land use and forestry. 2.) How will this be implemented? In order to measure the progress it is making in achieving this target, China will include the carbon intensity target in its medium and long-term social and economic development plans and develop corresponding statistics, monitoring and evaluation systems to measure progress. Thus, we can expect that the next five year plan (2010-2015) will include systems for monitoring and evaluating officials' and enterprises' performance in meeting the specific carbon intensity reduction targets allocated to them, similar to how the government implemented its target setting and official evaluation system for the twenty percent energy intensity reduction target in the current 11th Five Year Plan.\n\nIn order to measure the progress it is making in achieving this target, China will include the carbon intensity target in its medium and long-term social and economic development plans and develop corresponding statistics, monitoring and evaluation systems to measure progress. Thus, we can expect that the next five year plan (2010-2015) will include systems for monitoring and evaluating officials' and enterprises' performance in meeting the specific carbon intensity reduction targets allocated to them, similar to how the government implemented its target setting and official evaluation system for the twenty percent energy intensity reduction target in the current 11th Five Year Plan. 3.) Will the target be binding internationally? At the moment, the carbon intensity target is only a voluntary action and is not intended to be binding internationally. However, the carbon intensity reduction targets will be mandatory (\"约束性\") domestically for provinces and enterprises within China, similar to how the current energy intensity targets are mandatory, with consequences for officials of provinces and enterprises who do not meet their assigned targets.\n\nAt the moment, the carbon intensity target is only a voluntary action and is not intended to be binding internationally. However, the carbon intensity reduction targets will be mandatory (\"约束性\") domestically for provinces and enterprises within China, similar to how the current energy intensity targets are mandatory, with consequences for officials of provinces and enterprises who do not meet their assigned targets. 4.) Is the 40 - 45% target significant? Although there is debate about how much of a reduction this 40 to 45 percent carbon intensity reduction target is from a \"business as usual\" scenario, we should keep in mind a few points. First, how we define \"business as usual\" matters. As part of its current 11th Five Year Plan, China took on a goal of reducing its energy intensity by 20% from 2006-10, which has led to a coordinated energy efficiency program that includes actions such as closing down smaller, inefficient power plants and outdated, inefficient iron and steel, cement and other manufacturing capacity, and improving the efficiency of the Top 1,000 energy consuming enterprises. If China succeeds in reducing its energy intensity by 20% by 2010, this would result in the avoidance of a billion tons of CO2 emissions. China should be given credit for these efforts and not penalized for taking early action.\n\nSecond, the International Energy Agency has noted that the commitments from China and the US are roughly in line with the actions they have estimated to be necessary to reach a concentration of 450 parts CO2 per million, what scientists have deemed is necessary to keep global temperatures from rising more than two degrees Celsius. While we would hope that both China and the U.S. will seek to raise the level of their ambition, both proposals are substantial and require real improvements in energy efficiency and low-carbon energy to achieve.\n\nThe other important thing to remember is the significance of the carbon intensity target for creating the proper framework and incentives for reducing emissions. As noted above, a carbon intensity target will require each province and major enterprise to measure, report and reduce their CO2 emissions and energy consumption, year-on-year, acting as a driver for greater efficiency and renewables. In this way, the carbon intensity target is similar to the US greenhouse gas mandatory reporting rule or the cap-and-trade system in the current climate legislation before Congress, which put in place the proper incentives and systems to transition to a low-carbon, clean energy economy. Provinces, local governments and enterprises will need to establish and improve systems for measuring and reporting emissions, and there will be increasing pressure on these enterprises and provinces to enact measures within their development plans for making continuous improvements in energy efficiency and renewable energy. At the national level, China will need to continue and accelerate its policies to boost energy efficiency and renewables, and it will need to build its capacity to measure and report emissions for its national greenhouse gas inventory on a yearly basis (something which EPA and China's National Development and Reform Commission have recently agreed to cooperate on).\n\nJust as important as the targets they have set for themselves, China and the US must continue to accelerate their efforts to develop low carbon economies based on energy efficiency, renewables, and the development of clean technologies such as smart grids and electric vehicles. Both countries stand to benefit from the transition to a clean energy economy, by growing new clean industries and jobs, reducing their independence on dirty fossil fuels, and reducing their contribution to climate change and environmental damage. China can achieve a substantial reduction in its carbon intensity while continuing to grow its economy and providing an improved standard of living and a better environment for its citizens.\n\nChina's carbon intensity target is certainly a step in the right direction, and it provides the right incentives for future improvements in reducing emissions. Following the U.S.'s own emissions reduction announcement and the recent bilateral clean energy initiatives announced during President Obama's visit, we are beginning to see the outlines for a meaningful framework agreement in Copenhagen and a foundation for both countries to demonstrate leadership in addressing climate change.", "images": ["https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/graphic-cleanenergy.gif", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/header-greenlight.gif", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/logo-nrdc.gif", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/icon-twitter.png", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/photo-bfinamore-contributor.jpg", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/logo-switchboard.gif", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/icon-feed.gif", "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/banner.jpg"], "top_img": "https://web.archive.org/web/20100330081658im_/http://switchboard.nrdc.org/media/graphic-cleanenergy.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Switchboard, from NRDC :: Barbara Finamore's Blog :: China’s Carbon Intensity Target", "meta_data": {"tag": "globalwarming", "robots": "all", "MSSmartTagsPreventParsing": "true", "google-site-verification": "Oltu4dAiZBys24QcOEIGawc1kFOEfkuDNShcmUzoobE"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}