{"url": "www.etonline.com/news/221194_did_ben_affleck_and_lindsay_shookus_hook_up_while_still_married_timeline_of_their_romance", "text": "Some reports suggest Ben Affleck and girlfriend Lindsay Shookus' relationship may have been going on even while they were still married to their respective spouses.\n\nA source tells ET that Affleck first saw Shookus while he was still married to Jennifer Garner, and Shookus was married to Kevin Miller -- a fellow Saturday Night Live producer. According to the source, Affleck and Shookus were seeing one another as far back as late 2014, months before news broke that he had an alleged fling with his children's nanny, Christine Ouzounian. Affleck's reported dalliance with the nanny happened in the summer of 2015, and was short-lived, our source says.\n\nHowever, a source close to 44-year-old Affleck disputes that the actor and Shookus got together while both were married, although the two were friendly. The source says the two got romantic after his separation from Garner in 2015.\n\nWATCH: 6 Things We Know About Ben Affleck's New Girlfriend Lindsay Shookus\n\nLet's take a look back at Affleck and Shookus' alleged relationship timeline.\n\n\n\n2013:\n\n\n\nAccording to People, Affleck and Shookus started seeing one another in 2013, two years before Affleck and 45-year-old Garner announced their separation. Affleck last appeared on SNL in May 2013.\n\nInterestingly enough, Garner made an appearance during Affleck's monologue at the time, to celebrate the actor hosting the show for the fifth time. The two joked about Affleck's Best Picture acceptance speech for Argo at the Oscars, in which he said that his and Garner's marriage took \"work.\" Affleck publicly thanked Garner for all her support onstage, and the two sweetly shared a kiss.\n\nOne month later, eyewitnesses reportedly spotted Affleck and Shookus looking flirty at The Heat premiere after-party in NYC.\n\n\"He definitely looked interested in her,\" a partygoer told People at the time. The two later left together with other friends and headed to the nearby Mandarin Oriental hotel bar.\n\nOver the years, their relationship allegedly continued, though a source close to Affleck says the two did not get romantic until after his separation from Garner in 2015.\n\nAffleck and Shookus \"full-on had an affair,\" claims a source cited by People. \"They would fly back and forth, but he would mostly visit her in New York. They didn't hide.\"\n\n\"Both of them were married at the time. They were having secret rendezvous every time he came in to New York City and other places, too,\" claims a second source the magazine quotes. \"Both of them were cheating on their spouses so they were very careful about it,\" the source alleges.\n\nX17online.com\n\nAccording to Us Weekly, the romance began just a few months after Shookus became a mom to her daughter with Miller. \"[Affleck and Shookus] were sleeping together, sending each other cute texts and meeting up whenever they could,\" an insider close to Garner and Affleck reportedly claims to the outlet.\n\n\n\n2015:\n\n\n\nAccording to Us Weekly, Garner and Miller found out about the Affleck and Shookus' alleged relationship at the same time in 2015.\n\n\"They were devastated when they found out about the affair,\" a source claims according to the magazine.\n\nHowever, a source close to Affleck tells Us Weekly, \"Lindsay was not what led to the end of their marriage. They had a ton of other problems.\"\n\n\n\nJune 2015 -- Affleck and Garner separate\n\n\n\nAffleck and Garner announced their split on June 30, 2015.\n\n\"After much thought and careful consideration, we have made the difficult decision to divorce,\" the two said in their joint statement to ET. \"We go forward with love and friendship for one another and a commitment to co-parenting our children whose privacy we ask to be respected during this difficult time. This will be our only comment on this private, family matter. Thank you for understanding.\"\n\n\n\nJuly 2015 -- The nanny scandal\n\n\n\n\n\nUs Weekly broke the story on July 29, claiming that Affleck had secretly been dating Ouzounian, and that the two frequently texted and emailed after she was let go as his children's nanny.\n\nEarlier that month, Ouzounian tipped off the paparazzi, telling them she'd be at the L.A.-area rental house that Affleck was staying in at the time, a source later told ET. The former nanny was seen smiling wide as she handed Affleck a bottle of champagne during their late-night meetup. She also arrived at Affleck's in his Lexus, which she had also been seen driving earlier in the day while running errands.\n\nAffleck's rep slammed the reports, telling ET that \"all allegations of a romantic relationship are baseless and untrue\" and that they are considering legal options. \"The story is complete garbage and full of lies,\" his rep stated.\n\n\n\nApril 2017 -- Garner and Affleck officially file for divorce\n\n\n\nAffleck and Garner legally filed for divorce in April 2017, after a two-year separation. Still, the pair have made it clear that their three children -- Violet, Seraphina and Samuel -- remain their priority.\n\nJust one month earlier, Affleck thanked Garner for her support after announcing that he had just completed treatment for alcohol addiction.\n\n\"I'm lucky to have the love of my family and friends, including my co-parent, Jen, who has supported me and cared for our kids as I've done the work I set out to do,\" he wrote in his statement on Facebook.\n\n\n\nJuly 2017 -- Affleck steps out with Shookus\n\n\n\nAffleck was photographed with Shookus for the first time on July 6, when the two had dinner at Giorgio Baldi restaurant in Los Angeles.\n\nA source tells ET that Affleck's new relationship works \"really well,\" because Shookus \"has had experience with the Hollywood world.\"\n\n\"[She] knows what is expected of Ben, and how much of their relationship they can share publicly,\" the source explains. \"It puts Ben at ease knowing that Lindsay understands who he is. They have kept their relationship very low key and private.\"\n\nAnother source also tells ET that much like Affleck and Garner, Shookus and her ex -- whom she married in 2010 -- are also \"extremely amicable.\"\n\n\n\n\"They live separately but are extremely amicable,\" the source says of Miller and Shookus, who met during Shookus' first day at SNL in 2002. \"They split a while ago. They realized that they were stronger as friends.\"\n\n\"It's not uncommon, even now, to see them together getting coffee in the building, talking in the hallways, grabbing lunch, visiting each other on different floors,\" the source claims, adding that the pair are such good friends that Miller -- now a supervising producer on Late Night With Seth Meyers -- knew Shookus was dating Affleck before news broke of the relationship.\n\nWATCH: EXCLUSIVE -- Ben Affleck's New Girlfriend Lindsay Shookus Split From Husband 'A While Ago,' Source Says\n\nMeanwhile, the source describes Shookus as \"an extremely nice, normal person.\" As for her relationship with Affleck, the source shares \"they are just enjoying each other's company right now.\"\n\nWatch the video below for more on Affleck and Shookus' relationship.\n\n\n\n-- Reporting by Jen Peros\n\n", "images": ["http://www.etonline.com/themes/custom/et/img/watch-now.png", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-07/850__lindsay_shookus_studio_071017_06.jpg?itok=-uy5x3M5", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "http://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-07/1280_ben_affleck_lindsay_shookus_split_071017.jpg?itok=9mPf_IT6", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_ben_affleck_lindsay_shookus_split_071017.jpg?itok=1aGuk1TA", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_ben_affleck_lindsay_shookus_split_071017.jpg?itok=1aGuk1TA", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/news/221194_did_ben_affleck_and_lindsay_shookus_hook_up_while_still_married_timeline_of_their_romance", "title": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "meta_data": {"article": {"opinion": "false"}, "title": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/221194_did_ben_affleck_and_lindsay_shookus_hook_up_while_still_married_timeline_of_their_romance", "title": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "description": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_ben_affleck_lindsay_shookus_split_071017.jpg?itok=1aGuk1TA", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "title": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno", "url": "https://www.etonline.com/news/221194_did_ben_affleck_and_lindsay_shookus_hook_up_while_still_married_timeline_of_their_romance", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_ben_affleck_lindsay_shookus_split_071017.jpg?itok=1aGuk1TA"}, "description": "When Did Ben Affleck and Lindsay Shookus Start Dating? The Complicated Timeline of Their Romance", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Ben Affleck, Jennifer Garner", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}