{"url": "https://people.com/tv/rhobh-camille-grammer-squamous-cell-carcinoma-diagnosis-surgery/", "text": "Image zoom Camille Grammer/Instagram\n\nCamille Grammer has been diagnosed with cancer again.\n\nThe 49-year-old Real Housewives of Beverly Hills star spoke to PEOPLE exclusively on Thursday after revealing on Instagram she had received a Squamous Cell Carcinoma diagnosis and was recovering from surgery, having “those pesky cancer cells” removed.\n\nGet push notifications with news, features and more.\n\nIt’s the second time the former dancer and model has battled cancer. In 2013, she was diagnosed with Stage 2 Endometrial Cancer and underwent a radical hysterectomy. She is currently in remission and has dedicated the past few years to spreading awareness about the below-the-belt cancers as a spokesperson for the Foundation for Women’s Cancer.\n\nLike her Endometrial Cancer, Grammer’s Squamous Cell Carcinoma (SCC) was found below the belt as well.\n\n“Cancer really stinks,” Grammer told PEOPLE. “It’s unfortunate it runs in my family. I was diagnosed with Lynch Syndrome 15 years ago, so I have a genetic disposition to cancer. My mom had it also and her mom and unfortunately, these cancers seem to come along with the territory.”\n\n“Early detection is key,” Grammer added, explaining that SCC can show up anywhere from the skin to the lung to your throat. “Many people, if something shows up like this, they’ll ignore it. They’ll think, ‘Oh it’s a mole, it’s a pimple, it’s a rash, it’s an ingrown hair from shaving.’ … This isn’t an aggressive cancer, but if it goes undetected, it could spread and metastasize to the lymph nodes and other organs close to the area. I’m lucky we found it early.”\n\nImage zoom Camille Grammer Tommy Garcia/Bravo\n\nWhile she admitted the location of her latest scare was “a little embarrassing to talk about,” Grammer made it clear she wanted to “lift the vail of shame” from below-the-belt cancers.\n\n“It’s so important for women to go for check-ups,” she explained. “We can’t ignore these symptoms. We can’t ignore signals that our bodies are giving us when something is wrong. I’m a spokesperson, and advocate of awareness. So when anything comes up on our bodies — if it’s skin cancer or a bump or something we’re not certain of — we need to see our doctors. Go in, make an appointment, see our physicians, and don’t ignore these symptoms. When they present, don’t sweep them under the rug like so many of us do.”\n\nRELATED VIDEO: Tamra Judge Delays Bodybuilding Competition After Discovering More Skin Cancer: ‘Get Your Skin Checked’\n\nSquamous Cell Carcinoma, or SCC, is the second most common from of skin cancer, the Skin Cancer Foundation reports — and it is usually caused by cumulative ultraviolet exposure over the course of a lifetime. SCCs often appear as scaly red patches or elevated growths. More than 1 million cases of squamous cell carcinoma are diagnosed each year in the U.S., and (depending on different estimates) as many as 8,800 people die from the disease.\n\n“I don’t know how exactly I got it, but listen — I used to go to tanning beds. As a teenager, those were so popular,” Grammer said, clarifying that she’ll have to wait about a week for pathology reports to come back to learn whether the SCC falls under the Lynch Syndrome umbrella,. “I’m not saying that’s the cause, I don’t know what the cause is. Some people think it’s from the HPV, but my pap-smear came up negative for HPV. Again, there’s no clear certain reason why this showed up in this case. But it’s better to get checked.”\n\nOn Thursday morning, Grammer shared a photo of herself at Cedars-Sinai hospital smiling next to her “amazing” surgeon Dr. Beth Karlan. “My cancer was removed and I’m resting at home,” she wrote. “Ladies listen to your bodies. If something doesn’t seem right go for a checkup. Don’t put it off. Annual check ups are important.”\n\nImage zoom Camille Grammer and David. S. Meyer Camille Grammer\n\nWhile she waits two weeks to heal and resume physical activity, Grammer will have a strong place of support by her side: fiancé David C. Meyer — whom she has been dating for more than a year after meeting him in Malibu, where Meyer lives and works as a lawyer (He popped the question back in October).\n\nTurns out, Meyer too recently had an SCC removed from his temple. “We were both laughing about this,” Grammer told PEOPLE. “With sun exposure, be careful. Protect yourself from the sun and get checkups!”\n\nThis will be the second marriage for both. Grammer (née Camille Donatacci) wed Frasier actor Kelsey Grammer in August 1997; their divorce was finalized in February 2011. The Grammers share two children: daughter Mason, 16, and son Jude, 13.\n\nGrammer is also returning to RHOBH on Tuesday as a friend of the Housewives for the season 8 premiere, something she said she’s excited about because she gets to use the platform to help education more women about fighting cancer.\n\n“Being a spokesperson for cancer awareness has been a passion of mine,” Grammer said. “It helps me in my recovery but also helps others. I’m very proud to be a part of this movement.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcamille-grammer.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2099'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fnup_179918_0020-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhobh-camille-grammer-squamous-cell-carcinoma-diagnosis-surgery/", "title": "Camille Grammer Opens Up About Second Cancer Diagnosis After Surgery: 'Cancer Really Stinks'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Camille Grammer,News,Real Housewives,Real Housewives of Beverly Hills,TV", "news_keywords": "Camille Grammer,News,Real Housewives,Real Housewives of Beverly Hills,TV", "description": "RHOBH's Camille Grammer tells PEOPLE exclusively about being diagnosed with Squamous Cell Carcinoma, hours after revealing she was in recovery from surgery for getting the skin cancer cells removed", "og": {"title": "Camille Grammer Opens Up About Second Cancer Diagnosis After Surgery: 'Cancer Really Stinks'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhobh-camille-grammer-squamous-cell-carcinoma-diagnosis-surgery/", "description": "Camille Grammer&nbsp;has been diagnosed with cancer again. The 49-year-old&nbsp;Real Housewives of Beverly Hills star spoke to PEOPLE exclusively on Thursday after revealing on Instagram she&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg", "width": 1080, "height": 565}}, "pinterest": {"url": "https://people.com/tv/rhobh-camille-grammer-squamous-cell-carcinoma-diagnosis-surgery/", "description": "RHOBH's Camille Grammer tells PEOPLE exclusively about being diagnosed with Squamous Cell Carcinoma, hours after revealing she was in recovery from surgery for getting the skin cancer cells removed", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhobh-camille-grammer-squamous-cell-carcinoma-diagnosis-surgery/", "title": "Camille Grammer Opens Up About Second Cancer Diagnosis After Surgery: 'Cancer Really Stinks'", "description": "RHOBH's Camille Grammer tells PEOPLE exclusively about being diagnosed with Squamous Cell Carcinoma, hours after revealing she was in recovery from surgery for getting the skin cancer cells removed", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1080&h=565&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcamille-grammer.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}