{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "text": "Here's the thing: Despite what that shampoo commercial might be telling you, frizz is 100 percent natural and beautiful. Your hair doesn't need to be \"tamed\" or \"handled\" or \"conquered,\" k? That said, there's nothing wrong with wanting to try a sleek, flyaway-free hairstyle sometimes—because at the end of the day, it's your hair and you can do whatever you damn please with it.\n\nBefore I get into a few frizzy-hair solutions, though, it's important to know what you're working with. When your hair is damaged, dry, or chemically treated, the outer layer of the strand (called the cuticle) rises, allowing for moisture to enter the strand, fatten it up, and create frizz. The fix? Make sure your hair cuticles are as soft and smooth as possible. Ahead, six celebrity hairstylists offer up their expert tricks, hacks, and product recs for helping you get the smoothest, flyaway-free hair of all time. Consider this your ultimate guide to sleek-AF hair.\n\n1. Use frizz-smoothing hair sheets\n\nSooo you've decided you want to wear your hair sleek and smooth but the weather says otherwise. Help keep your flyaways from popping back up the second you step outside by keeping a smart little arsenal of products with you at all times. My personal favorite? These frizz-smoothing sheets from Ouai. Not only are they small enough to pop into your bag, but they're also spiked with hydrating ingredients like coconut oil and shea butter that keep your hair soft, shiny, and static-free.\n\n2. Use heat protectant to prevent frizzy hair\n\nSeriously, don't skimp on the heat sprays, not even if you're in a huge rush or you're lazy AF. Fried, sizzled strands are way more prone to frizz and flyaways than soft and healthy hair, so if you know you're using a hot tool, make sure you've got a solid heat protectant on hand. This one from Cantu shields hair from heat up to 425 degrees while also hydrating and smoothing it with shea butter. Not bad for $4.\n\n3. Ditch harsh shampoos that cause frizz\n\n“Find a shampoo that is sulfate-free to prevent frizz,” says celebrity hairstylist Laura Rugetti, who works with Tori Spelling, Teddi Mellencamp, Audrina Patridge, and Lisa Rinna. Shampoos with sulfates can strip and damage your hair over time, which will mess with your hair cuticle and leads to frizz. “My favorite gentle shampoo is —it's super moisturizing and leaves your hair feeling silky,\" she says.\n\n4. Load your frizzy hair up with glycerin\n\nAlong with cutting out the sulfates, look for a shampoo with glycerin as one of the first ingredients (the closer the ingredients are to the top of the list, the more concentrated they are in the formula). Not only does glycerin help combat frizz by penetrating the hair shaft and hydrating it from the inside out, but it also creates a protective coating on the strand, helping mitigate damage, says celebrity hairstylist Mark Townsend, who works with Elizabeth Olsen, Jennifer Lawrence, and virtually every other celeb you love.\n\n5. Smooth frizz with a rich conditioner\n\n“Clients often ask me if they need conditioner, and the answer is absolutely,” says Giovanni Vaccaro, hairstylist and artistic director at Glamsquad. “Conditioner is your number-one weapon in dealing with frizz.” Try Biolage SmoothProof Conditio ne r (Vaccaro's favorite), or Aveda Cherry Almond Softening Conditioner (my favorite). Apply it from mid-shaft down to your ends, keeping it away from your roots, and wait at least five full minutes—yes, really—before rinsing it out.\n\n6. Shampoo less curb the frizz\n\nYou might think your hair needs to be shampooed several times a week, but it really doesn't, especially if you have coarse or curly hair. So every two days, rinse your hair with only conditioner (conditioner contains a small amount of cleansers, so it will still lightly clean your hair without stripping it) or a co-wash. Hairstylist Mark Garrison suggests using a lightweight conditioner if you have fine hair, like Nexxus Hydra-Light Weightless Moisture Conditioner . If you have thick and coarse hair, you can use a richer formula, like .\n\n7. Mask weekly to heal frizzy hair\n\nDoing a deep-conditioning treatment at least once a week, especially in the colder months, will help fill any gaps in your hair shaft (gaps and spaces contribute to frizz). Rugetti suggests to keep hair feeling soft and moisturized. For even deeper hydration, try applying your mask to dry hair—yes, dry—and leave it on for at least 30 minutes before hopping in the shower and rinsing it off.\n\n8. Ditch your hair towel if you've got frizz\n\nAs you know, your hair is at its most vulnerable state when it’s wet. So, using the wrong towel can literally make (or break) your hair, making your fabric choice that much more important. “Cotton towels create friction with your hair, leading to frizz and breakage,” says Vaccaro. “I love and always recommend to dry your hair—they have a microfiber technology that prevents friction and helps dry hair faster.”\n\n9. Smooth frizzy hair with a layer of dry oil\n\nWhile your hair is still wet, rake a few drops of a moisture-locking dry oil, like , from your mid-lengths to ends. Why? Oil acts as a barrier, keeping humidity from penetrating and causing flyaways. Once your hair is 90 percent dry, blow-dry your hair with a (the plastic bristles pick up the hair and pull it taught, and the boar bristles help make your hair super straight) to seal the cuticle for a smooth finish. You can also flat-iron your hair after it's dry—nothing will seal the cuticle like intense heat, Garrison says.\n\n10. Get frizz-free waves with buns\n\nAlthough hot tools are ideal for sealing a cuticle, you shouldn't have to mess with your natural texture if you don't want to. So if you want waves but have curly hair, try twisting your damp hair (use a leave-in conditioner, first) into two low buns while it dries, tying them off with scrunchies to prevent kinks. As your hair dries, your curls will slightly stretch and your cuticle will close. Smooth a dab of dry oil (see above) through your dry hair in the morning to lay down any frizz.\n\n11. Define frizz with a good curl cream (or gel)\n\nCurls are naturally drier and, in turn, naturally more prone to frizz. To keep your hair defined, rake and squeeze a dollop of curl cream through your sopping-wet curls after shampooing and conditioning. Then, twirl small sections of curls around your fingers to shape them and define them, before letting them air-dry. To speed up the drying process and get extra volume, diffuse your curls on low speed, high heat (avoid touching your hair as much as possible or it'll frizz) until it's 80 percent dry.\n\n12. Touch up frizz with a toothbrush\n\nWhile you may think you need a layer of oil to smooth flyaways around your hairline, Vaccaro likes to opt for a hairspray instead, as \"these guys need a stronger solution,\" he says. Instead of blasting your hair with a layer of spray, opt for a lighter touch: Spritz a clean toothbrush with hairspray (try Glamsquad’s Take Hold Hairspray—yes, it's Vaccaro's own line, but it's legit good), then brush it over your hairline or part to keep those wisps down.\n\n13. Use nice heat tools to prevent frizz-causing damage\n\nSure, you may think that your flat iron from 2011 works just fine, but it might actually be causing more damage and frizz than you realize. Hairstylist Jessica Shakir swears by the for her clients. \"It has this negative ion conditioning technology that seals the hair’s cuticle to keep it smooth,\" she says. “I also spritz a lightweight heat-protectant spray over damp hair before I use any hot tool to help prevent frizz, and I'll also use it to smooth any flyaways on dry hair later in the day.”\n\n14. Apply leave-in to your hair before working out\n\nWeird side effect of your spin class (other than a really good butt): dry hair. The sodium in your sweat can actually dehydrate your hair, making it extra prone to frizz and breakage. So before you tie back your hair, spray it with a leave-in conditioner to protect your hair during your sweat session. Also, if you have type-4 hair and normally work out in a silk scarf, swap it for a cotton handkerchief—cotton absorbs moisture, and you want the fabric to soak up the sweat, not trap it in.\n\n15. Clamp down your frizz with accessories\n\nAccording to Garrison, serums aren't ideal or strong enough for smoothing flyaways, since they don't have any holding power. So if your updo tends to get frizzy, stick to cute and hairspray to help slick down those flyaways while also looking Insta-worthy.\n\n\n\n16. Sleep on a silk pillowcase for smoother hair\n\nIf you're still sleeping on cotton and dealing with frizz, now is officially the time to switch to a silk pillowcase. “Silk really helps protect your hair while you sleep,” says Vaccaro. “It maintains your hair's natural oils, which is especially important if your hair is fragile from chemical treatments.\"\n\n17. Treat frizzy hair with an in-salon smoother\n\nListen, I get it. Sometimes, DIYs and at-home hacks simply aren’t powerful enough if you're really not feelin' your frizz. In that case, Rugetti suggests trying an in-salon treatment: “I really love the Pura Luxe straightening treatment—it's similar to the new-and-improved keratin treatments, but it’s non-toxic.\" Call your salon ahead of making your appointment to see which smoothing treatments they recommend, especially if you have curly hair.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ultra-hydrating-shampoos-1567616169.png?crop=0.777xw:0.779xh;0.0994xw,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Beauty Editor", "Ruis The Beauty Editor At Cosmopolitan", "Where She Covers Beauty Across Print"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/a33187/how-to-defrizz-your-hair/", "title": "How to De-Frizz Your Hair: 15 Best Products to Fix Frizzy Flyaways 2020", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "These Are the 17 *Exact* Products You Need for Your Flyaways", "description": "\"So sleek! So smooth!\" = you looking in the mirror.", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2020-03-10 04:48:40", "published_time": "2020-03-03 06:20:00", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "How to De-Frizz Your Hair: 15 Best Products to Fix Frizzy Flyaways 2020", "description": "There's nothing wrong with frizz or flyaways, but they can certainly be annoying. We found 15 solutions to help you have your best hair day yet.", "keywords": "frizzy hair, best products for frizzy hair, best shampoo for frizzy hair, best conditioner for frizzy hair, hairstyles for frizzy hair, how to tame frizzy hair", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty,shopclick,Mark Garrison,how to defrizz,defrizz,Mark Townsend", "sailthru.date": "2020-03-03T18:20:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flyaways-1583254525.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "These Are the 17 *Exact* Products You Need for Your Flyaways", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1583187600.0, "source": "https://www.cosmopolitan.com", "summary": ""}