{"url": "http://time.com/money/4960755/hugh-hefner-death-playboy-launch-loan-mom/", "text": "Hugh Hefner, founder of Playboy Enterprises, died on Wednesday of natural causes at the age of 91.\n\nAt the time of his death, Hefner’s net worth was estimated to be in the neighborhood of $45 million in liquid assets, according to Wealth-X, and his four children were reportedly promised his fortune after his death. But that doesn’t include the value of his home, the famous Playboy Mansion. Hefner listed the Playboy mansion for sale with a $200 million asking price in early 2016, and it sold that summer for $100 million, with the stipulation that Hefner could still live there and the transaction would not be complete until Hefner’s death.\n\nHefner purchased the Playboy mansion for $1.1 million in 1972, which was then the highest private home sale ever in Los Angeles. This purchase occurred during what was arguably the height of Hefner’s fame and fortune, when a single issue of Playboy magazine sold seven million copies and his net worth reportedly hit upwards of $200 million, which would be the equivalent of more than $1 billion in today’s dollars.\n\nHefner’s Playboy empire, which went on to include hotels, nightclubs, cable channels, and reality TV shows in addition to the magazine, came from extremely humble beginnings.\n\nHefner created comic strips and published his own local newspaper as a child, and served as editor of a humor magazine in college. He was also frustrated by how straitlaced and prudish American society was in the 1950s.\n\n“When I came out of [World War II], I expected something similar to the Roaring ’20s — a celebration,” Hefner recounted to Fortune in 2003. “Of course, what we got was the opposite. It was a very conservative time, a repressive time—politically, socially, and sexually.”\n\nBy the early 1950s, Hefner was also frustrated with his career. He was a promotion copywriter for Esquire, and when the magazine moved from Chicago to New York, Hefner was making $60 a week. He asked for a $5-a-week raise, but Esquire declined. So Hefner stayed behind—and in 1953 decided to launch his own magazine devoted to his true passions.\n\n“The problem was that I had no money,” Hefner explained to Fortune. So he borrowed what he could, and family and friends came to his aide. Playboy‘s list of early investors included Hefner’s mom, who handed her son $1,000 because she believed in him, if not the idea of a magazine that celebrated sexuality and nudity. As Hefner told Fortune:\n\nI got a $600 loan against my furniture from the local bank. I went to my family and asked if I could borrow some money from them, or whether they would invest in the magazine. My father declined. He was an accountant, and he didn’t feel that a magazine was a good business investment. My mother took me aside and said that she had some money of her own, and she would give me $1,000. She didn’t believe in the magazine, but she believed in her son. My brother Keith, who was working in Baltimore and New York City as a children’s TV show host named Johnny Jellybean, sent a couple of hundred dollars every week, investing a total of $1,000. That money and the $1,000 I got from my mother were my two largest investments. The total investment that launched Playboy was $8,000. You don’t start a national magazine with that kind of money. Of course, I didn’t know that I couldn’t do that, so I went ahead and did it.\n\nAccording to the Chicago Tribune, Hefner spent $200 to rent a naked picture of Marilyn Monroe from a calendar for that first issue of Playboy. “Hefner put together the first issue of Playboy on his kitchen table,” the Tribune reported. “The first issue had no date because Hefner wasn’t sure there would be a second.”\n\nBut that first issue sold out all of its roughly 50,000+ copies within two weeks, and a success story was born.\n\nHefner remains tied to fellow icon Marilyn Monroe to this day. In 1992, he paid $75,000 the gravesite next to Monroe at Westwood Village Memorial Park Cemetery in Los Angeles, and it is believed Hefner will be buried there.\n\nIn retrospect, Hefner seems to have gotten a great deal on the 1992 purchase. Since then, burial plots near Monroe have been put on the market for $700,000, and the vault directly above Monroe sold on eBay in 2009 for a whopping $4.6 million.", "images": ["https://moneydotcomvip.files.wordpress.com/2017/09/hughhefnerdeathloanmom-em-463118931.jpg?quality=85", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "http://time.com/img/navigation/subscribe-icon.svg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2017/09/hughhefnerdeathloanmom-em-463118931.jpg?quality=85", "keywords": [], "authors": ["Brad Tuttle"], "canonical_link": "https://money.com/hugh-hefner-death-playboy-launch-loan-mom/", "title": "Hugh Hefner Net Worth: How He Built His Playboy Fortune", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Culture,Entrepreneurs,Hugh Hefner,Hugh Hefner net worth,magazines,Playboy", "news_keywords": "Hugh Hefner, Hugh Hefner net worth, Hugh Hefner fortune, Hugh Hefner death, Hugh Hefner death, Playboy, Playboy magazine, Playboy mansion", "description": "Hugh Hefner launched Playboy in 1953 with a mere $8,000, including a loan of $1,000 from Hefner's mom. His fortune eventually topped $200 million.", "og": {"title": "Hugh Hefner Launched Playboy With a $1,000 Loan From His Mom", "type": "article", "site_name": "Money", "url": "https://money.com/hugh-hefner-death-playboy-launch-loan-mom/", "description": "And here's how much he was worth when he died.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2017/09/hughhefnerdeathloanmom-em-463118931.jpg?quality=85", "width": 1024, "height": 730}}, "pinterest": {"url": "https://money.com/hugh-hefner-death-playboy-launch-loan-mom/", "description": "Hugh Hefner launched Playboy in 1953 with a mere $8,000, including a loan of $1,000 from Hefner's mom. His fortune eventually topped $200 million.", "media": "https://moneydotcomvip.files.wordpress.com/2017/09/hughhefnerdeathloanmom-em-463118931.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/hugh-hefner-death-playboy-launch-loan-mom/", "title": "Hugh Hefner Launched Playboy With a $1,000 Loan From His Mom", "description": "And here's how much he was worth when he died.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2017/09/hughhefnerdeathloanmom-em-463118931.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}