{"url": "www.nme.com/news/music/justin-bieber-starting-church-2116040", "text": "Following the cancellation of his tour, rumour has now spread that Justin Bieber may be planning to start up his own church.\n\nLast night saw Bieber cancel his world ‘Purpose’ tour, months before it was due to end – citing claiming to be ‘burned out’ and exhausted from the months on the road.\n\nNow, sources claim that Bieber may be turning his attention to ‘reconnecting with his faith’ and starting up his own church.\n\nAdvertisement\n\n“I am led to believe that the real reason he has come off the road is because he wants to reconnect with his faith and he may be even planning to start his own church,” celebrity journalist Richard Wilkins told Today Extra – after speaking to sources close to him at the annual Hillsong Church Conference in Sydney.\n\n“We know that he was in the country a few weeks ago having meetings and attending the big Hillsong convention that they had here. [He’s] very close to a lot of the Hillsong people. Whether he’s looking at teaming up with them in something of a more permanent situation or doing some sort of religious activity on his own – starting his own church – we’re not quite sure, but that’s the word from an inside source.”\n\nApologising to his fans via TMZ for cancelling his upcoming shows, Bieber said: “I love you guys, I think you guys are awesome. Sorry for anyone who feels disappointed or betrayed, it’s not in my heart [or] anything, and have a blessed day.”\n\nThe cancellation was announced via a statement on his website, which reads: “Due to unforeseen circumstances, Justin Bieber will cancel the remainder of the Purpose World Tour concerts. Justin loves his fans and hates to disappoint them. He thanks his fans for the incredible experience of the Purpose World Tour over last 18 months. He is grateful and honoured to have shared that experience with his cast and crew for over 150 successful shows across 6 continents during this run.” Advertisement Meanwhile, Bieber has also reportedly been banned from China – while ‘Game Of Thrones’ star Sophie Turner has tipped him to be the next music cameo in the show following on from Ed Sheeran. “That was fun because Maisie loves Ed Sheeran and [creators] David [Benioff] and Dan [Weiss] had it as, like, a surprise for her,” said Turner at Comic-Con. “So they just, they didn’t tell her. I told her by accident! I was like, ‘Oh, when’s Ed Sheeran coming on the show?’ But yeah, they kind of did it as a surprise.” She continued: “I was kind of mad because I’ve been talking about [Justin] Bieber coming on the show for a while now. But it’s fine, I’m over it.”", "images": ["https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000-696x442.jpg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg", "https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000.jpg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2015/12/2015JustinBieber_2_DC_131115.jpg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000.jpg", "keywords": [], "authors": ["Andrew Trendell"], "canonical_link": "https://www.nme.com/news/music/justin-bieber-starting-church-2116040", "title": "Is Justin Bieber starting up his own church?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Following the cancellation of his tour, rumour has now spread that Justin Bieber may be planning to start up his own church", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "Is Justin Bieber starting up his own church? | NME", "description": "Following the cancellation of his tour, rumour has now spread that Justin Bieber may be planning to start up his own church", "url": "https://www.nme.com/news/music/justin-bieber-starting-church-2116040", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000.jpg", "width": 1000, "height": 635}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "section": "Music News", "published_time": "2017-07-25T08:02:55+00:00"}, "twitter": {"card": "summary_large_image", "description": "Following the cancellation of his tour, rumour has now spread that Justin Bieber may be planning to start up his own church", "title": "Is Justin Bieber starting up his own church? | NME", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2017/07/GettyImages-805742236_BIEBER_CHURCH_1000.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1500969775.0, "source": "http://www.nme.com", "summary": ""}