{"url": "people.com/music/kanye-west-explosive-fights-kris-jenner-kim-kardashian-control/", "text": "The last week has been a difficult one for the Kardashian-West family.\n\nAccording to multiple sources, Kanye West has cut off contact with multiple people in his inner circle, including his managers, lawyers and closest friends — and he’s also had multiple arguments with his mother-in-law Kris Jenner.\n\nGet push notifications with news, features and more.\n\n“He’s had huge blow-ups with Kris. She sees how erratic he’s acting and is most concerned about her daughter’s brand. She’s also trying to be a good mother-in-law, so he’s having explosive issues with her too,” a source close to the situation tells PEOPLE exclusively. “Everyone is really, really worried.”\n\n(However, another insider tells PEOPLE that “Kanye and Kris have never had a fight,” adding, “Just because Kanye is having a strong opinion does not mean that he is mentally ill or headed for a breakdown. It’s unfair.”)\n\nRELATED: Kanye West ‘Seems to Be on the Edge’ and ‘Is Very Hard to Deal with Right Now’: Sources\n\nThe rapper returned to Twitter but has been posting tweets that are increasingly worrisome to some of his loved ones. In one recent tweet, West suggested the need to “get rid of everything.”\n\nA source close to the rapper contends that while West can be “eccentric and erratic,” not everyone sees his latest actions as cause for concern. Says the source: “A lot of this is just Kanye. He’s always been like that. He stirs the pot.”\n\nRELATED VIDEO: Kim Kardashian Has Fun with Kanye’s Advice That ‘Sometimes You Need to Get Rid of Everything’\n\nKardashian West playfully responded to her husband on social media, but the source close to the situation says it was an attempt to take charge. “Kim is trying to control him and the situation, but he can’t be controlled,” says the source about the couple, who are parents to 3-month-old Chicago, Saint, 2, and North, 4½. “She’s trying her best to support him on social media and show a different side of things, but it’s just not working.”\n\n“He genuinely believes he’s God and a genius and that he can do everything on his own. He has a great love for Kim, but in his mind he doesn’t think Kim is a genius, and he’s telling her he knows what he’s doing,” adds the source.\n\nWant to keep up with the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nThe source close to West, however, counters the notion that Kardashian West waded in on Twitter to “divert people.” Rather, “it’s more like [she’s saying] ‘You guys are off,'” says the source, who adds that the musician has been busy in the studio. “She is always loving towards Kanye, always concerned with whatever he’s concerned about, always in his corner.”\n\nWest also had an uncomfortable call recently with Hot 97 host Ebro Darden, who claims West reiterated his support for President Donald Trump and discussed anti-Black Lives Matter commentator Candace Owen’s appeal. In audio released Tuesday morning by Hot 97, West can be heard telling Ebro “I love you” repeatedly.\n\nA West insider says the entertainer, 40, is “sleeping very little” and “texting at all hours of the day or night” and has been exhausting those around him.\n\nImage zoom Gilbert Carrasquillo/Getty\n\n“It’s very hard to deal with,” says the insider. “He’s all over the place. If you can’t be part of his creative genius, he’ll cut you loose. That’s what he says.”\n\nThe source close to West — who says the rapper “seemed great” and “super positive” on the phone last week — acknowledges the star is someone who “revs really high and is really active and expends a lot of energy” on his projects, but insists that’s just how he is.\n\n“That’s part of being Kanye,” says the source, who feels West was recently taken advantage of for radio publicity. “He’s willing to take risks with his public persona. He doesn’t take it as serious as the internet takes it.”\n\nRELATED: Kanye West and Daughter North Dance (with Dolls!) to Michael Jackson’s Songs ‘All Morning’\n\nIn late 2016, West was hospitalized for exhaustion after canceling his Saint Pablo tour. Fans saw Kardashian West, 37, break down on Keeping Up with the Kardashians earlier this year as footage from that trying time finally aired.\n\n“I don’t even know what’s going on right now, it’s getting pretty hectic at home,” Kim said on the show. “Everyone is just getting really worried.”\n\nImage zoom Kim Kardashian Instagram\n\n“I’m not in the mood to get into it right now… but it will be okay,” she told her family. “Everything will be okay. It’s forcing him to take much-needed time off, which he needs. I think that will be really good for him. I feel a sense of responsibility just with the pressure of taking care of everything. Even after the robbery and everything, it’s just I’ve been staying home and I’ve been looking to him to just take care of everything while I stay home.”\n\n“He just never takes time off,” she continued. “I’m just so drained. There was one moment where I just sat there and took deep breaths.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1814&h=950&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-kanye-west-plane-1.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1814&h=950&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg", "keywords": [], "authors": ["Melody Chiu", "Steve Helling"], "canonical_link": "https://people.com/music/kanye-west-explosive-fights-kris-jenner-kim-kardashian-control/", "title": "Kanye West Has Had 'Explosive' Fights with Kris Jenner", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kanye West,Keeping Up with the Kardashians,Kim Kardashian,Kris Jenner,News", "news_keywords": "Kanye West,Keeping Up with the Kardashians,Kim Kardashian,Kris Jenner,News", "description": "The rapper has cut off members of his inner circle and even wife Kim Kardashian West can't \"control\" him, multiple sources tell PEOPLE", "og": {"title": "Kanye West Has Had Fights with Kris Jenner & Kim Kardashian Can't 'Control' Him: Sources", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/kanye-west-explosive-fights-kris-jenner-kim-kardashian-control/", "description": "The last week has been a difficult one for the Kardashian-West family. According to multiple sources, Kanye West has cut off contact with multiple people&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1814&h=950&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg", "width": 1814, "height": 950}}, "pinterest": {"url": "https://people.com/music/kanye-west-explosive-fights-kris-jenner-kim-kardashian-control/", "description": "The rapper has cut off members of his inner circle and even wife Kim Kardashian West can't \"control\" him, multiple sources tell PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/kanye-west-explosive-fights-kris-jenner-kim-kardashian-control/", "title": "Kanye West Has Had Fights with Kris Jenner & Kim Kardashian Can't 'Control' Him: Sources", "description": "The rapper has cut off members of his inner circle and even wife Kim Kardashian West can't \"control\" him, multiple sources tell PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1814&h=950&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/w9PkRku5srg"], "publish_date": null, "source": "http://people.com", "summary": ""}