{"url": "https://www.cheatsheet.com/health-fitness/heres-everything-you-need-to-know-about-the-ivanka-trump-plastic-surgery-trend.html/", "text": "Ivanka Trump fans have taken things a bit far — so far, in fact, that they’ll go under the knife to look like the 36-year-old businesswoman. For these women, shopping Ivanka’s clothing line and visiting Trump Towers just won’t cut it.\n\nIvanka’s features have sparked a fairly recent plastic surgery trend that has surgeons and the media alike taking notice. In fact, there’s only one celebrity whose features are arguably more sought-after (page 6). Here’s everything you need to know about the thousand-dollar trend that the first daughter inspired.\n\n1. People started requesting ‘the Ivanka’ in 2016\n\nIvanka Trump’s pretty features are really south after. | Sean Gallup/Getty Images Ivanka Trump’s pretty features are really south after. | Sean Gallup/Getty Images\n\nNew York plastic surgeon Norman Rowe noted that since the 2016 Republic primaries, he’s seen an influx of patients request to look like Ivanka Trump. “I never saw [anyone drawing inspiration from Ivanka’s face] before the primary,” said Dr. Rowe, “since the summer of ’16 . . . [it’s been] maybe four a month; one a week.”\n\nSince the summer of 2016, nearly 50 clients have asked Dr. Rowe to give them the Ivanka look. Rowe has a theory on what draws his clients to Ivanka’s elegant features. “Maybe they just like the look, but also that [Ivanka’s] a powerful woman, self-confident, part of the first family. Do they want to be her? Yes, deep down, maybe.”\n\nNext: Party lines are irrelevant on this matter\n\n2. Both Democrats and Republicans want to look like the first daughter\n\nJenny Stuart has undergone many procedures to mimic the look of Ivanka Trump. | ABC via YouTube Jenny Stuart has undergone many procedures to mimic the look of Ivanka Trump. | ABC via YouTube\n\nPolitical affiliation seems to have little influence when it comes to plastic surgery. While New Yorkers notoriously vote blue, that doesn’t stop them from going for Ivanka’s look. “I don’t think it plays a role in the least,” Dr. Rowe said. “I think it has to do with somebody who you respect the way they look, and I don’t think it’s anything to do with whether you’re blue or red.”\n\nJenny Stuart, an IT headhunter in Texas, admitted to the irony behind her $30,000 Ivanka transformation. “… I’ve spent all this time and money to try and look like Ivanka, who I still adore … but I don’t associate her with father,” Stuart told ABC’s Nightline, “… so I voted for Hillary.”\n\nNext: You won’t believe how long it took one person to look like Ivanka.\n\n3. It took this woman 13 surgeries to get her look\n\nMany women are spending boatloads of money to look just like the First Daughter. | E Online Many women are spending boatloads of money to look just like the First Daughter. | E Online\n\nRowe described Ivanka’s look to Page Six as widened cheekbones, a slender nose, and large eyes. Achieving these features takes clients multiple surgeries, depending on their original facial structure.\n\nThe procedures can include Botox, cheek implants, and rhinoplasty, the medical term for a nose job. To achieve what Dr. Rowe calls the “Permanent Ivanka,” patients will likely need all three. Botched patient Tiffany Taylor had 13 surgeries in one year before appearing on the show and asking the doctors to make her look more like her idol.\n\nNext: It costs thousands to look like the millionaire.\n\n4. It costs $50,000 to look like Ivanka\n\nLeft: Tiffany Taylor has undergone many surgeries and procedures to imitate the look of Ivanka Trump. | ABC via YouTube, Right: Ivanka Trump smiling brightly at an event. | Sean Gallup/Getty Images Left: Tiffany Taylor has undergone many surgeries and procedures to imitate the look of Ivanka Trump. | ABC via YouTube, Right: Ivanka Trump smiling brightly at an event. | Sean Gallup/Getty Images\n\nThe surgeries can cost anywhere between $30,000 and $50,000. Clients who spend between $30-40,000 can achieve the look with temporary fillers and Botox, while others throw down $45-50,000 for a permanent Ivanka appearance.\n\nTaylor told ABC’s Nightline that she’d already had breast augmentation, a nose job, cheek injections, a “mini” eye lift, liposuction, and fat grafts added to her cheeks and planned to continue her surgeries. She had spent around $60,000 by the time she talked with Nightline.\n\nNext: There are tons of health risks associated with the surgeries.\n\n5. Some people risked everything just to get the surgery\n\nWomen really look up to the busy career woman. | Drew Angerer/Getty Images Women really look up to the busy career woman. | Drew Angerer/Getty Images\n\nWhile these women had fairly successful Ivanka transformations (we — sort of — see the resemblance), going under the knife isn’t something to take likely. There are plenty of health risks associated with plastic surgeries including hematomas, nerve damage, and infection.\n\nSurgical procedures like breast augmentation commonly lead to numbness, which can be a sign of nerve damage. Fifteen percent of women permanently lose nipple sensation. While relatively uncommon, you still face the risk of developing a pulmonary embolism, or blood clot, which can be fatal.\n\nNext: The only celebrity with a more popular face than Ivanka\n\n6. Kylie Jenner is the only celebrity face more popular than Ivanka’s\n\nKylie Jenner at an event. | Nicholas Hunt/Getty Images for Huffington Post Kylie Jenner at an event. | Nicholas Hunt/Getty Images for Huffington Post\n\nKing Kylie still holds the crown as the most sought-after celebrity face. Dr. Rowe told Page Six that Ivanka’s look is beginning to rival Kylie Jenner’s, the 20-year-old makeup mogul with noticeably enviable lips.\n\nDr. Simon Ourian, who performed Kylie Jenner’s lip implants, told Entertainment Tonight that most people request her lips when they’re looking to get something done. Jenner’s pout sparked the “Kylie Jenner lip challenge,” where people suctioned their lips to create a swollen, heavier lip look. Dr. Ourian warned against the challenge, saying, ” It could cause infections. It could cause bleeding. It could cause bruising that could be permanent.”\n\nNext: The Ivanka Trump surgery trend didn’t extend to her father.\n\n7. No one has requested to look like Donald\n\nMen are not doing the same with her father. | Mario Tama/Getty Images Men are not doing the same with her father. | Mario Tama/Getty Images\n\nAccording to Vanity Fair, In 1990, Ivana Trump said under oath that Donald flew into a fit of rage due to the pain from a scalp reduction surgery he’d had performed in 1989. The surgery was intended to correct balding. While our current president has allegedly gone under the knife, he doesn’t have many people vying for his look.\n\nDr. Rowe confirmed this, saying, “No, I’ve never had anybody come in and say, ‘Make me into a Donald!'”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/11/Ivanka-Trump-surgery-640x430.jpeg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Kylie-Jenner-1024x682.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/11/Jenny-stuart-640x282.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-phone-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-642093036-640x473.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/02/ivanka-trump-plastic-surgery.png?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg", "keywords": [], "authors": ["Emma Bleznak"], "canonical_link": "https://www.cheatsheet.com/health-fitness/heres-everything-you-need-to-know-about-the-ivanka-trump-plastic-surgery-trend.html/", "title": "Here’s Everything You Need to Know About the Ivanka Trump Plastic Surgery Trend", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/heres-everything-you-need-to-know-about-the-ivanka-trump-plastic-surgery-trend.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Requests for plastic surgery to look more like Ivanka Trump have skyrocketed since Donald Trump became president. Here's everything you need to know about this trend.", "og": {"locale": "en_US", "type": "article", "title": "Here's Everything You Need to Know About the Ivanka Trump Plastic Surgery Trend", "description": "Requests for plastic surgery to look more like Ivanka Trump have skyrocketed since Donald Trump became president. Here's everything you need to know about this trend.", "url": "https://www.cheatsheet.com/health-fitness/heres-everything-you-need-to-know-about-the-ivanka-trump-plastic-surgery-trend.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-03-23T19:17:06-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Ivanka Trump", "section": "Health & Fitness", "published_time": "2018-03-23T19:17:00-04:00", "modified_time": "2018-03-23T19:17:06-04:00"}, "twitter": {"card": "summary_large_image", "description": "Requests for plastic surgery to look more like Ivanka Trump have skyrocketed since Donald Trump became president. Here's everything you need to know about this trend.", "title": "Here's Everything You Need to Know About the Ivanka Trump Plastic Surgery Trend", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/10/ivanka-trump-clapping-640x427.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1521847020.0, "source": "https://www.cheatsheet.com", "summary": ""}