{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/28/i-got-played-demario-jackson-reacts-to-bachelor-in-paradise-controversy/", "text": "Details surrounding the incident, which allegedly took place in a pool between Jackson and Olympios on June 4, are murky. Though production has continued, E! News reports that Olympios’s legal team will continue to investigate based on new witnesses. Olympios initially released a statement June 14 announcing that she had hired an attorney.\n\nAD\n\nAD\n\n“As I pursue the details and facts surrounding that night and the immediate days after, I have retained a group of professionals to ensure that what happened on June 4 comes to light and I can continue my life,” the statement read, “including hiring an attorney to obtain justice and seeking therapy to begin dealing with the physical and emotional trauma stemming from that evening.”\n\nCareful not to blame Olympios specifically, Jackson said in the E! interview that he feels “played” by the entire situation.\n\n“I’m not sure by who,” he said. “But I got played.”\n\nJackson walked Bromley through his account of the night in question. The two cast members chatted at the bar, he said, “complimenting each other on being villains.” (Olympios made it to last season’s final four on “The Bachelor,” opposite Nick Viall, and was known for being aggressive to castmates. Jackson was recently eliminated on the current season of “The Bachelorette” after a woman appeared on set and claimed to be his girlfriend.)\n\nAD\n\nAD\n\n“We were like, ‘We’re about to dominate “Paradise,” ‘” Jackson said. “Homie stuff, like friends.”\n\nAt that point, according to Jackson, Olympios suggested they head to the pool.\n\n“I was like, ‘Hell yeah,’” he said. “I don’t think any single man — some married ones — wouldn’t turn down Corinne. She’s a beautiful woman.”\n\nJackson said the situation seemed “too perfect in a sense,” and that he made sure cameras followed the pair to the pool.\n\n“It’s crazy because when you’re a man — mostly African-American man — no matter where you’re at, you always look for things that can help you out,” he said.\n\nAfter calling Olympios “the aggressor,” Jackson confirmed that the pair had oral sex, calling it “probably the wildest night of my life.” He told Bromley that Olympios didn’t seem too drunk to consent and that the two were friendly the next morning.\n\nAD\n\nAD\n\nProduction continued after that night, according to E! News, until an unnamed producer pulled Jackson aside three days later and told him to head home. Warner Bros. released its initial statement the following Sunday.\n\n“I got a call by a producer that was just like, ‘Hey, s—’s about to get real, real fast,’” Jackson said. “I hang up my phone, and holy s—. My group chat was on fire, like, ‘What did you and Corinne do?’”\n\nThough the studio didn’t reveal much in the statement, rumors began to fly. Accusations were flung at both Jackson and Olympios, he said, and conversations circled the possibility of sexual assault.\n\n“No man wants to be attached to that,” Jackson said. “That ruins you for life … That’s not who I am.”\n\nAD\n\n(A Warner Bros. representative told The Post in an email on Wednesday afternoon that the studio had no details to confirm.)\n\nAD\n\nJackson said he senses a “conspiracy,” but others on set have been supportive.\n\n“It’s been humbling that you can meet people for three days — I knew them for less than 72 hours — and in that time frame, they went to bat for me and they spoke on my integrity and who I was as a man and what I did on set,” Jackson said. “I went into this as the ‘villain,’ quote-unquote, and they got a chance to see the real me.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9624aab6-2742-4553-9ae0-96a331f3e138.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OUZDU4NELE32LBP5U575BC7V4Y.jpg&w=150", "https://www.washingtonpost.com/resizer/XRE9Afc5SPeg246TYaUq2RTh92s=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OUZDU4NELE32LBP5U575BC7V4Y.jpg"], "top_img": "https://www.washingtonpost.com/resizer/XRE9Afc5SPeg246TYaUq2RTh92s=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OUZDU4NELE32LBP5U575BC7V4Y.jpg", "keywords": [], "authors": ["Sonia Rao", "Pop Culture Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/28/i-got-played-demario-jackson-reacts-to-bachelor-in-paradise-controversy/", "title": "‘I got played’: DeMario Jackson reacts to ‘Bachelor in Paradise’ controversy", "meta_data": {"description": "Jackson told E! News about Olympios, “I love her and I'm here for her.”", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/28/i-got-played-demario-jackson-reacts-to-bachelor-in-paradise-controversy/", "image": "https://www.washingtonpost.com/resizer/XRE9Afc5SPeg246TYaUq2RTh92s=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OUZDU4NELE32LBP5U575BC7V4Y.jpg", "title": "‘I got played’: DeMario Jackson reacts to ‘Bachelor in Paradise’ controversy", "description": "Jackson told E! News about Olympios, “I love her and I'm here for her.”"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘I got played’: DeMario Jackson reacts to ‘Bachelor in Paradise’ controversy", "description": "Jackson told E! News about Olympios, “I love her and I'm here for her.”"}, "last_updated_date": "2019-04-21T21:32:56.262Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1498579200.0, "source": "https://www.washingtonpost.com", "summary": ""}