{"url": "http://www.cnn.com/TRANSCRIPTS/1611/13/sotu.01.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nSTATE OF THE UNION\n\nInterview With Speaker of the House Paul Ryan; Interview With Former New York Mayor Rudy Giuliani; Donald Trump Ignored Muslim Ban Question; Interview With Michael Moore. Aired 9-10a ET\n\nAired November 13, 2016 - 09:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\n[09:00:05]\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nJAKE TAPPER, CNN ANCHOR (voice-over): President-elect Trump heads to the White House after an earthquake election few expected.\n\n\n\nDONALD TRUMP (R), PRESIDENT-ELECT: Now it's time for America to bind the wounds of division.\n\n\n\nTAPPER: Some say, not so fast, as protesters take to the streets in uproar.\n\n\n\nUNIDENTIFIED PROTESTERS: Not my president!\n\n\n\nTAPPER: What will Donald Trump's America and his White House look like? Top adviser and potential Cabinet pick Rudy Giuliani will be here.\n\n\n\nPlus, Trump made big campaign promises, from Obamacare.\n\n\n\nTRUMP: Repealing and replacing Obamacare.\n\n\n\nTAPPER: To immigration.\n\n\n\nTRUMP: There will be no amnesty.\n\n\n\nTAPPER: And, of course:\n\n\n\nTRUMP: We will build a great wall.\n\n\n\nTAPPER: But he seems to be already backing off some of his signature lines. What will really get done? And can he work with Congress? An exclusive interview with House Speaker Paul Ryan.\n\n\n\nPlus, Clinton concedes.\n\n\n\nHILLARY CLINTON (D), FMR. PRESIDENTIAL CANDIDATE: This is not the outcome we wanted or we worked so hard for.\n\n\n\nTAPPER: As Democrats lick their wounds.\n\n\n\nCLINTON: I'm not going to sugarcoat it. These have been very, very tough days. TAPPER: Should they have seen it coming? Michael Moore did -- what he says liberals must do now.\n\n\n\nPlus, the best political minds will be here with insights on this historic election.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: Hello. I'm Jake Tapper in Washington, where the state of our union is in transition.\n\n\n\nDonald Trump is now president-elect Trump. And the world is watching with bated breath to see just what he has in store for America. Protests against his election, of course, continue this weekend across the country, most of them peaceful, although the mayor of Portland, Oregon, is asking protesters to stand down in the wake of violence against police in that city.\n\n\n\nThere are some reports of violence against Trump supporters. In Connecticut, two men were arrested for allegedly beating a man holding a Trump sign. Meanwhile, civil rights groups in school districts across the country report an uptick in incidents of intimidation and harassment of minority groups and girls and women.\n\n\n\nGraffiti in North Carolina reads: \"Black lives doesn't matter and neither does your votes.\"\n\n\n\n\"Go back to Africa. Make America great again\" was written in a high school bathroom in Minnesota.\n\n\n\nTensions are high and tempers are flaring across the country. The country, of course, may be divided, but the government in Washington, D.C., is not. Republicans now control the U.S. House, the U.S. Senate, and, soon, the White House.\n\n\n\nSo what is on the Trump agenda and how quickly can it get done?\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nTAPPER: Joining me now from Janesville, Wisconsin, is House Speaker Paul Ryan.\n\n\n\nMr. Speaker, thanks so much for joining us.\n\n\n\nBefore we begin talking about legislation and moving forward, I'm just wondering, there are millions of Americans out there, as I'm sure you know, who are frankly terrified about what this America under President Trump will mean for them.\n\n\n\nIs there anything that you, as speaker of the House, one of the leaders of the nation, want to say to them?\n\n\n\nREP. PAUL RYAN (R-WI), SPEAKER OF THE HOUSE: Sure.\n\n\n\nFirst of all, I hate it that people feel this way. And, second of all, they should not. I think people should be rest assured. America is a pluralistic, inclusive country. It has, it has been, and it will continue to be.\n\n\n\nSo, I really think that people should put their minds at ease. We're going to get to work on solving the big country's problems, getting this economy growing, fixing our national security, you know, fixing our health care problems, getting our budget put together, the things that we have been talking about.\n\n\n\nSo, I think people should just really put their minds at ease. We are pluralistic. We're inclusive. That's the kind of country we want. That's the country we are. And that's the country we're still going to have.\n\n\n\nTAPPER: But just to accept and acknowledge that there are these incidents taking place all over the country...\n\n\n\nRYAN: Well, first, yes, I heard your lead-in there. That's terrible. That's awful.\n\n\n\nBy the way, that's not Republicans. We are the party of Lincoln. People who espouse those views, they're not Republicans. And we don't want them in our party, even if they're thinking about it. And I'm confident Donald Trump feels the same way.\n\n\n\nSo, there's no place for that. And protests, as long as protests are peaceful, if people want to express themselves that way, that's what we can do in this country. That's what the First Amendment is all about.\n\n\n\nTAPPER: Let's move forward to some of the action items.\n\n\n\nObviously, repealing and replacing Obamacare is one of the big items that president-elect Trump and you want to tackle. President-elect Trump recently said there are elements of Obamacare he wants to keep. This is what he to say to \"60 Minutes.\" Take a listen.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nQUESTION: Let me does you about Obamacare, which you say you're going to repeal and replace. When you replace it, are you going to make sure that people with preconditions are still covered?\n\n\n\n[09:05:01]\n\n\n\nTRUMP: Yes, because it happens to be one of the -- strongest asset.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: Now, your Better Way agenda talks about spending $25 billion on high-risk pools that would help those with preexisting conditions afford insurance. Where would that $25 billion come from?\n\n\n\nRYAN: Well, we actually have it paid for in our bill. You really want me to give you a technical answer to this? It gets a little technical.\n\n\n\nThe point is, we have in our plan pay for doing that. Here's the bigger point, Jake. We agree. It's in our plan. Donald Trump agrees with this. We need to have a solution for people with preexisting conditions.\n\n\n\nIn our plan is allowing younger people up to the age of 26 to stay on their parents' plan. So, there are aspects that we have all along agreed to.\n\n\n\nTAPPER: Under Obamacare, as you know, millions of people were able to get health insurance for the first time through the expansion of Medicaid.\n\n\n\nWhat is going happen to those people? Will they lose coverage under your plan?\n\n\n\nRYAN: Well, if you go -- what I encourage people to do is go to Better.GOP. It's number five on our plan. We put the most detail out of anybody that has put out an Obamacare replacement plan.\n\n\n\nAnd it is to have an answer for everyone with preexisting conditions, people who are the uninsured. The point I would say is this, Jake. We can have a health care system in America where everyone, regardless of income or health condition, can get affordable health insurance, get affordable health care.\n\n\n\nThis is what we propose. We think a patient-centered system is the right way to do that. And you can have the system without a costly government takeover, like Obamacare, that is cranking up premiums, that is making deductibles so high. Doesn't even feel like you have health insurance. Obamacare is failing. It must replaced.\n\n\n\nWe're going to do that. We're excited about it. And the point I would put people's minds at ease is, we can fix these problems. We can fix what was broken in health care without breaking what was working in health care. And that's exactly what we're proposing.\n\n\n\nAnd if you want to get any level of detail on this, just go to Better.GOP and see what we have already offered.\n\n\n\nTAPPER: Well, as you know, the Medicaid expansion is providing government-paid health insurance to individuals. I mean, that's what it does. So, if you repeal Obamacare, does it repeal also the Medicaid expansion, or would that part of it stay?\n\n\n\nRYAN: For example, we propose to replace that with refundable tax credits for people to buy affordable health care insurance.\n\n\n\nSo, the kinds of reforms that we're talking about will lower the cost of insurance itself. And then a person would have, such as our proposal calls for, a refundable tax credit, like a voucher, to go buy health insurance.\n\n\n\nThat's much cheaper, much more affordable. And, more importantly, you get to buy what you want to buy, not what the government is making you buy.\n\n\n\nTAPPER: Obamacare also provides birth control to women at no cost. Is that going to end or will that remain?\n\n\n\nRYAN: Look, I'm not going to get into all the nitty-gritty details of these things.\n\n\n\nTAPPER: With all do respect, I don't know that the average woman of child-bearing years out there who relies upon contraception provided by health insurance mandated by the Affordable Care Act, I don't know that she would think that that's just a nitty-gritty detail. That's...\n\n\n\nRYAN: You're asking me detail...\n\n\n\nTAPPER: Well, what do you think? Is it important to you?\n\n\n\nRYAN: Jake, you're asking me details about legislation -- you're asking me details about legislation that hasn't been written yet.\n\n\n\n(CROSSTALK)\n\n\n\nTAPPER: Right. But is it important to you? Would that be a principle? Would that be a principle of whatever replaces it, because...\n\n\n\nRYAN: I'm not going to get into -- I'm not going to get into hypotheticals about legislation that hasn't even been drafted yet.\n\n\n\nTAPPER: Let me ask you a question about improving security at the border. You and Donald Trump both agree you want to improve security at the border. You obviously have different views when it comes to the 10 to 11 million undocumented immigrants currently living in the United States.\n\n\n\nThis is what you said to say back in April during a town hall at Georgetown University:\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nRYAN: I'm a person who believes that, for the undocumented, we have to come up with a solution that doesn't involve mass deportation, that involves giving people the ability to get right with the law to come and earn a legal status while we fix the rest of legal immigration.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: Now take a listen to what president-elect Trump said on \"Morning Joe\" last year.\n\n\n\n(BEGIN VIDEO CLIP, \"MORNING JOE\")\n\n\n\nTRUMP: We're going to have a deportation force. And you're going to do it humanely\n\n\n\nQUESTION: How are you going to pay for this?\n\n\n\nTRUMP: It's very inexpensive.\n\n\n\nQUESTION: Are they going to be ripped out of their homes? How?\n\n\n\nTRUMP: Can I tell you, they're going back where they came. If they came from a certain country, they're going to be brought back to that country. That's the way it's supposed to be.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: So, Congress writes the laws and controls the purse strings\n\n\n\nIs there going to be mass deportation or not? And this isn't just a nitty-gritty detail. There are millions of people who are very worried about this.\n\n\n\nRYAN: Sure. Sure.\n\n\n\nAnd I think we should put people's minds at ease. That is not what our focus is. That is not what we're focused on. We're focused on securing the border.\n\n\n\nWe think that's first and foremost. Before we get into any other immigration issue, we have got to know who's coming and going in the country. We have got to secure the border. So, we believe an enforcement bill, a border security enforcement bill, is really the first priority. And that's what we're focused on.\n\n\n\nTAPPER: OK, so it's not a top priority, mass deportation. But, obviously, president-elect Trump thinks it is.\n\n\n\nRYAN: No, securing the border is our...\n\n\n\nTAPPER: Right.\n\n\n\nRYAN: Securing the border is our top priority.\n\n\n\nTAPPER: Right, but about what in year two, year three, year four?\n\n\n\nRYAN: That's why I'm saying we're not focused on -- we are not planning on erecting a deportation force. Donald Trump's not planning on that.\n\n\n\n[09:10:03]\n\n\n\nTAPPER: Well, let me ask you, and does the fact that Hillary Clinton won the popular vote, does that impact in any way your sense of mandate or how far you should be willing to go, considering that the woman who lost actually got more votes?\n\n\n\nRYAN: I'd say two things.\n\n\n\nLook at the expectations going into this. Look at what all the public polling said. Look at what all the prognosticators were saying like the day of the election. He beat all the odds.\n\n\n\nLook, what I think people need to stop doing is stop underestimating Donald Trump. A lot of us did that. I think he's very much of the mind-set that there is a need to unify this country, to heal the division in this country, but also there's a mandate and a desire and a commitment to fix the problems as we have laid the solutions out.\n\n\n\nSo, we all laid out very concrete solutions for why we need to get this country back on track. We're now going to implement the solutions. And we think this is good. We think this is going to help people get out of poverty. We think this is going to grow the economy, make our country more secure, make our border secure, help the military go on offense against ISIS, clean up the red tape that is strangling small businesses, so they can hire people again.\n\n\n\nThese are good things that we have in store that we're really excited about getting to work on doing for the American people.\n\n\n\nTAPPER: One of the things that you don't mention -- and I can certainly understand why -- when you talk about the path forward with president-elect Trump is one of the biggest differences between yourself and Donald Trump policy-wise, having to do with the issue of trade.\n\n\n\nIn his contract with the American voter, he promised in his 100 days to establish tariffs to discourage companies from laying off workers. Will you pass those tariffs in your first 100 days?\n\n\n\nRYAN: Well, I think there's a better way of dealing with that particular issue.\n\n\n\nAnd if you go to number six on our Better Way agenda and you look at the tax reform, this is something that Donald also talked about during the campaign, which is to fix our taxes on border adjustments, which we believe is a smarter way, which is what all the other countries, which is not tariffs, not trade wars.\n\n\n\nSo, we think there are better ways of dealing with making American products and workers more competitive, and really it's fixing our tax code.\n\n\n\nTAPPER: Throughout the campaign, as you know, president-elect Trump talked about tariffs. It could be as high as 35 percent, 45 percent.\n\n\n\nRYAN: Yes.\n\n\n\nTAPPER: If he comes to you and says, this is what we're doing, what are you going say?\n\n\n\nRYAN: The point I'm trying to make is, I think we can achieve what he's trying -- he's trying to make America more competitive. He's trying to make the American worker more competitive. He's trying to make it so that American businesses stay in America.\n\n\n\nAnd we believe the smartest and best way to do that is comprehensive tax reform, which actually makes America much more competitive without any adverse effects, without any collateral damage to the economy.\n\n\n\nTAPPER: A minute ago, you were talking about how Donald Trump, the president-elect, expressed concerned to you he wanted to -- or expressed a desire to you that he wanted to unify the country. On that note, I want to turn to staffing at the Trump White House. A\n\n\n\nlot of people, including many conservatives, are concerned that Steve Bannon, who is the CEO of the Trump campaign and the chief executive of Breitbart News, that he used Breitbart News to, in their view, the view of conservatives, the view of Republicans, to mainstream white supremacist views, anti-Semitic views, racist views.\n\n\n\nDo you have any concerns about Steve Bannon being in the White House?\n\n\n\nRYAN: No, I don't have concerns. I have never met the guy. I don't know Steve Bannon, so I have no concerns.\n\n\n\nI believe -- I trust Donald's judgment. I think he's going to pick who he thinks will best serve him. And I'm sure we will work well with whoever his chief of staff is, whoever his staff is.\n\n\n\nSo, I believe that Donald is going to have a great set of choices to make for staffing. I'm also very own encouraged by the fact that my friend, a great conservative from -- a man whose shown he's a true leader, Mike Pence, is going to be running the transition team.\n\n\n\nSo, I think between Pence running the transition team -- look, Donald is a multibillionaire who has had lots of companies, who has run extremely successful businesses. So, he's done things like this before. He's staffed up. He's run major organizations. He's a successful person. He surrounds himself with successful people.\n\n\n\nSo, I'm confident he's going to do the same here.\n\n\n\nTAPPER: You sound very optimistic and positive about him, but during the campaign, you said that one of the things he said about Judge Curiel fit the textbook definition of racism.\n\n\n\nRYAN: Look, I'm not going to relitigate the past. I'm looking for the future.\n\n\n\nAnd I want I mean when I say unifying, getting people back to work, fixing welfare so people -- fixing welfare so people can go from welfare to work, replacing this horrible health care law that is really hurting families, putting health care providers out of business, and replacing it with patient-centered health care, rebuilding our national security so we're safe again, cleaning up the regulatory state, following the Constitution.\n\n\n\nI mean, these are all good things for our country that we are now working on putting in place the plan to do just that. That's transformational. That's positive. That's good.\n\n\n\n[09:15:01]\n\n\n\nTAPPER: The pride of Janesville, House Speaker Paul Ryan, thank you so much for joining us. We appreciate it.\n\n\n\nRYAN: All right, thank you Jake. Take care.\n\n\n\n(END VIDEOTAPE) TAPPER: The Trump transition team has been huddled inside Trump Tower all weekend as they work to create an administration, Cabinet nominees, White House staff.\n\n\n\nKellyanne Conway telling reports yesterday that Trump's choice for chief of staff is imminent. That and other picks could tell us a lot about how president-elect Trump plans to govern.\n\n\n\nLet's talk about the new Trump administration with top adviser Rudy Giuliani, who is himself rumored to be a contender for several top jobs.\n\n\n\nMr. Mayor, thanks for joining us. And congratulations.\n\n\n\nRUDY GIULIANI (R), FORMER MAYOR OF NEW YORK: Thank you, Jake.\n\n\n\nTAPPER: So, I know you're not going to answer...\n\n\n\nGIULIANI: Thank you very, very much, Jake.\n\n\n\nTAPPER: I know you're not going to answer any questions I have about what jobs you're being considered for.\n\n\n\n(LAUGHTER)\n\n\n\nTAPPER: So, let me just set that aside.\n\n\n\nThere's a big issue...\n\n\n\nGIULIANI: Thank you.\n\n\n\n(LAUGHTER)\n\n\n\nTAPPER: There's a big issue at play here as you prepare for the Trump administration.\n\n\n\nI know you're more than cognizant of the fact that Donald Trump has hundreds of millions, if not billions of dollars in businesses and business interests around the nation and throughout the world. During the campaign, he was asked what he would do with his businesses if he won.\n\n\n\nTake a listen.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nTRUMP: If I become president, I couldn't care less about my company. It's peanuts. I have Ivanka and Eric and Don sitting there.\n\n\n\nRun the company, kids. Have a good time. I'm going to do it for America, OK?\n\n\n\n(CHEERING AND APPLAUSE)\n\n\n\nTRUMP: So, I would be willing to...\n\n\n\nQUESTION: So, you will put your assets in a blind trust?\n\n\n\nTRUMP: I would put it in a blind trust.\n\n\n\nWell, I don't know if it's a blind trust if Ivanka, Don, and Eric run it, but -- is that a blind trust? I don't know.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: I will answer that question. That's not a blind trust. If your kids run your businesses, it's not a blind trust.\n\n\n\nIn a blind trust, there is an independent trustee who takes over your portfolio and directs it without your input or any input from anyone around you.\n\n\n\nDo you think that to avoid any conflicts of interest, not to many questions by the public as to whether he's making decisions at least in part for his own financial reasons, do you think it would be best for Mr. Trump to set up a true blind trust with no involvement from him or his kids?\n\n\n\nGIULIANI: Well, first of all, you realize that those laws don't apply to the president, right? So, the president doesn't have to have a blind trust. For some reason, when the law was written, the president was exempt.\n\n\n\nI think he's in a very unusual situation. He would basically put his children out of work if -- and they'd have to go start a whole new business, and that would set up the whole -- set up new problems.\n\n\n\nSo, it would seem to me that if he set up a situation in which the children were running it, there was a legal or clear document that meant that he would not be involved, he would have no interest in it, he would have no input into it, he would just have a passive interest, that would be the kind of thing that would work here.\n\n\n\nIt's kind of unrealistic to say, you're going to take the business away from the three people who are running it, and give it to some independent person. And, remember, they can't work in the government because of the government rule against nepotism.\n\n\n\nSo, you would be putting them out of work. So, I think you're going to have to fashion something that is very comfortable, something that's fair, something that assures the American people, as he said, he has no interest in what's going on in the business, and that his children get to run the business they know how to run.\n\n\n\nTAPPER: Right.\n\n\n\nGIULIANI: And stay out of all government matters.\n\n\n\nTAPPER: Well, but, Mr. Mayor, I mean, his children are -- as I don't need to tell you, they are a huge part of his advisory committee. They are advising the transition, Ivanka, Don Jr., and Eric.\n\n\n\nJared Kushner, Ivanka's husband, is being talked about as coming on board and working at the White House, even if he's not paid for it.\n\n\n\nIf he does not set up a truly blind trust, how can the American people have confidence that, when he makes a decision, that he isn't at least partly making it to enrich himself?\n\n\n\nGIULIANI: Well, even if he turned it over to an independent trustee and it was the Trump Corporation, you can't -- I mean, there's no perfect way to do this.\n\n\n\nYou have to have some confidence in the integrity of the president. The man is an enormously wealthy man. I don't think there's any real fear of suspicion that he's seeking to enrich himself by being president. If he wanted to enrich himself, he wouldn't have run for president.\n\n\n\nSo, I think there can be a way to do this. And, by the way, Jared Kushner has his own company, completely independent of Trump, that is a very, very successful real estate company. He's maybe, you know, one of the biggest in New York. He -- so, Jared is a kind of different, different situation.\n\n\n\nTAPPER: Well, I will just say this. And then you can dismiss it as you want. But I'm putting a flag in it right now.\n\n\n\nIf a blind trust is not set up, this is going to be Donald Trump for the duration of his presidency, because every decision he makes, whether it's the pipeline in North Dakota, or business relationships in Turkey, everything is going to be under the lens of, well, what is the effect of this on his wealth and his family's wealth?\n\n\n\n[09:20:07]\n\n\n\nI get that you think that that's not a consideration or not as serious a consideration as...\n\n\n\nGIULIANI: No, no, no.\n\n\n\nWhat I'm telling you is, the blind trust solution isn't much better, meaning an independent trustee would run it. And any decision that he made, even if he didn't know it, that helped him, somebody would run it down and say, oh, my goodness, he may have made it for that reason.\n\n\n\nSo, blind trusts aren't perfect either. This is a very special kind of situation.\n\n\n\nTAPPER: I think it's far better than -- it's far better than people in his family advising him and then also working on his business. I think...\n\n\n\nGIULIANI: But they're not -- once he gets into government, they will not be -- they will not be -- they will not be advising him.\n\n\n\nThere will be -- there will have to be a wall -- there will have to be a wall between them with regard to government matters and something I'm very familiar with from my days in the Justice Department, which is recusing yourself from decisions that involve you or any financial matter involving you.\n\n\n\nTAPPER: All right.\n\n\n\nWell, if you thought the issues between the Clinton Foundation and Hillary Clinton's State Department were big, fasten your seat belts. But let's move on.\n\n\n\nMr. Trump shook up the Republican primary by...\n\n\n\nGIULIANI: Oh, I think, I think, Jake, Jake, Jake, I think that's a very unfair suggestion.\n\n\n\nThere, you were talking about enormous amounts of cash. I'm counting up to about $230 million that went for specific actions like talking to the IRS. And I don't -- I don't see that happening in a Trump administration.\n\n\n\nThis man didn't run for president because he wants to get rich. He's rich already.\n\n\n\nTAPPER: All right.\n\n\n\nGIULIANI: So, I don't think you're going to have that happen unless you try to make it happen.\n\n\n\nTAPPER: All right.\n\n\n\nMr. Trump shook up the Republican primary back in December when he made this promise. Take a listen.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nTRUMP: Donald J. Trump is calling all and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is doing on.\n\n\n\n(CHEERING AND APPLAUSE)\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: So, just a simple question. Is that policy still operative?\n\n\n\nGIULIANI: Well, you know, twice, you used things that he changed during the campaign. He did say that. That is correct.\n\n\n\nActually, within a day or two of his saying that, he called me and asked me to put a little group together that included Congressman McCaul, General Flynn -- I can't remember who else, a few other people. We wrote a paper for him. And he amended it to the ban would be restricted to particular countries, and it would not be a ban.\n\n\n\nIt would involve extreme vetting. The one -- the one place in which he would not let anyone in, unless it was an extraordinary circumstance, would be Syrian refugees. All the rest from countries that contain dangerous populations of radical Islamic extremists, he will subject them to extreme vetting, but not a ban. So, he said that about 100 times during the campaign from the time\n\n\n\nthat he made that -- from the time that he made that statement.\n\n\n\nTAPPER: Yes, he said that was an expansion.\n\n\n\nGIULIANI: So, you can go back.\n\n\n\nTAPPER: He said it was an expansion of his original proposal.\n\n\n\nBut let's talk about what you're talking about, specifically, Mr. Trump wanting to suspend immigration from terror-prone regions where vetting cannot safely occur and also extreme vetting.\n\n\n\nBack in June, when Senator Jeff Sessions, a strong supporter and adviser of president-elect Trump, when Senator Sessions was on the program, he identified six countries that might fall into that category, Pakistan, Egypt, Syria, Iraq, Afghanistan, and Yemen.\n\n\n\nSo, now that Mr. Trump has been elected president, can you tell us if those are the six countries that will see a suspension of immigration?\n\n\n\nGIULIANI: Well, I would say that those countries are certainly countries where we would have to be very careful.\n\n\n\nNow, let's take Egypt, for example. Egypt, we could probably do some pretty good vetting. The Sisi government is a strong ally. It has a pretty good hold on the Muslim Brotherhood. I'm not saying perfect, but they have done a lot of work in reducing the power of the Muslim Brotherhood. They have a very, very mature and really strong army. You could do vetting in Egypt.\n\n\n\nYemen, a lot more volatile, a lot more difficult to do vetting. So, I think this is going to be a country-by-country decision. Pakistan, you can do pretty good vetting. So, a lot of this is going to depend on, you know, how cooperative is the country we're talking about? How many records can we get?\n\n\n\nThe reason the Syrian problem was so bad, the Syrian refugees, it's not just that you can't vet them, which actually Director Comey and I think about five members of the Obama administration have made clear, that you can't vet these people, these refugees from Syria.\n\n\n\n[09:25:12]\n\n\n\nThe problem also is that Baghdadi has said he is going to put terrorist operatives in with the refugee population. He's told us he's going to do this.\n\n\n\nTAPPER: Right.\n\n\n\nGIULIANI: So, we would be foolish -- we would be foolish to allow these people to come into the United States.\n\n\n\nWe're sort of being warned that he's bringing more people into attack us. We already have 1,000 investigations of radical Islamic terrorists in the United States. We can't add another whole group to that.\n\n\n\nTAPPER: I want to ask you. Russia's deputy foreign minister, Sergei Ryabkov, was quoted as saying that the Russian government maintained contacts with members of Trump's -- quote -- \"immediate entourage\" during the presidential campaign.\n\n\n\nWhat can you tell us about those contacts?\n\n\n\nGIULIANI: I know of no such contacts with the Russian government.\n\n\n\nI was pretty deeply involved in the campaign. I was with Donald Trump, you know, day and night for about 100 days actually at one period. So, if that's going on, it's going on somewhere where I didn't see it.\n\n\n\nIt is true that I think Donald Trump wants to engage Russia in areas where we can work together in a way that Hillary Clinton and John Kerry and Barack Obama failed to do. But, remember, he's going to do it from a different point of view.\n\n\n\nYou're forgetting his campaign promise of increasing dramatically the size of the military and doing away with the sequester. We're going to go up to 550,000 troops, where we're going down to 420,000.\n\n\n\nTAPPER: Well, let me ask you a quick question about troops.\n\n\n\nGIULIANI: We're going to go up to 350 ships.\n\n\n\nTAPPER: Putin...\n\n\n\nGIULIANI: We're going to go up to 350 troops (sic). Let me finish.\n\n\n\nTAPPER: Yes.\n\n\n\nGIULIANI: We're going to go up to 1,200 modern aircraft. And we're going to increase the size of the Marines from about 27 battalions to 36.\n\n\n\nSo, he's going to be facing, Putin, with a country that is not diminishing its military, but a country that is dramatically increasing it to Reagan-like levels, so that he can negotiate -- and he talked about this a lot during the campaign -- he's going to negotiate for peace, but with strength, not with a diminishing army.\n\n\n\nTAPPER: A spokesman for Putin said that one of the first things that Trump can do as president is to convince NATO to pull back troops from near the Russian border.\n\n\n\nDo you have any idea if any decision has been made along those lines?\n\n\n\nGIULIANI: No. No decision like that has been made, thought about.\n\n\n\nIn fact, during the campaign, Donald Trump talked about forward positioning of some troops in NATO as kind of a bargaining chip with some of the NATO countries that are not putting in their fair share, their 2 percent. TAPPER: OK.\n\n\n\nGIULIANI: And I think you're going see something more like that.\n\n\n\nI think a President Trump would want to increase the impact of NATO, but make sure that these countries are participating. You know, when we were fighting in Iraq and we had some of these countries participating, their armies weren't fighting. They were watching us, the U.K., and Canada fight, and they were just observing.\n\n\n\nWell, it can't work that way.\n\n\n\nTAPPER: All right.\n\n\n\nGIULIANI: They have got to be full participants. And we have to be full participants.\n\n\n\nTAPPER: Mr. Mayor, thank you so much. And congratulations again.\n\n\n\nGIULIANI: Thank you.\n\n\n\nTAPPER: Donald Trump used the power of social media to help propel him into the White House. He instantly was able to fight back against critics, reporters, even members of his own party if they challenged him, which begged the question, what will President Trump' Twitter feed look like?\n\n\n\nWe now have his answer.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nTRUMP: I'm going to do very restrained, if I use it at all. I'm going to be very restrained.\n\n\n\nI find it tremendous. It is a modern form of communication. There should be nothing you should be ashamed of. It's -- it's where it's at.\n\n\n\nI do believe this. I really believe that the fact that I have such power in terms of numbers with Facebook, Twitter, Instagram, et cetera, I think it helped me win all of these races where they're spending much more money than I spent. And I won.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: President Obama is going to have to hand over the @POTUS Twitter handle to president-elect Trump.\n\n\n\nWhat should we expect from @POTUS when he enters the Oval Office?\n\n\n\nJoining me now is our panel, Republican National Committee chief strategist and communications director Sean Spicer, CNN politics reporter Sara Murray, CNN senior political reporter Nia-Malika Henderson, and House Democratic Caucus Leader Congressman Xavier Becerra of California.\n\n\n\nSean, let me start with you.\n\n\n\nIn the final stretch of the campaign, it was reported that some of president-elect Trump's top aides had to wrest his phone away from him, so as to not have one of these sudden outbursts in the middle of the night or whatever.\n\n\n\n[09:30:10]\n\n\n\nWhat do you see going forward for the POTUS account?\n\n\n\nSEAN SPICER, RNC CHIEF STRATEGIST, COMMUNICATIONS DIRECTOR: Well, I think there's always a transition from campaigning to governing. You've seen it both with his speech Wednesday morning when he accepted that victory that he won for the American people. And then his comments when he was in Washington, D.C. with the president and others.\n\n\n\nHe understands that. He understands the role of the president in the words that he uses and the tweets that he sends will impact the country in a much different way than they do during a campaign.\n\n\n\nTAPPER: Good enough for you, congressman?\n\n\n\nREP. XAVIER BECERRA (D), CALIFORNIA: No, because we've heard all sorts of words from Donald Trump.\n\n\n\nAs a candidate you can say all you want, as a president, one word you say can affect not just markets, but the American people. So interest rates have already spiked. They are not sure what's going to happen in the markets since -- so today we try to buy a house as an American, it costs you more for the mortgage than it did two weeks ago. And so it will make a difference what he says. More importantly what he does.\n\n\n\nTAPPER: Sara, you covered Trump for the last year and a half. He has since winning, there has been one kind of stray tweet in which he got mad at protesters and then I don't know what happened behind the scenes, but then he corrected it and celebrated their right to protest.\n\n\n\nHow do you see this holding, this quote/unquote \"Presidential Trump\"?\n\n\n\nSARA MURRAY, CNN POLITICAL REPORTER: Well, he's already tweeting this morning attacks at \"The New York Times.\"\n\n\n\nSo I think the notion that all the sudden Donald Trump has woken up and realized that his weight carry or his words carry a lot more weight doesn't always stand. I think there are aides around him who remind him that you need to recalibrate your tone. I think that's what we saw from the two different tweets about protesters. One going after them and then one saying I love to see passionate people expressing their belief. That to me was a good indication that someone talked to him and said words matter more now, but the fact is, he still does have control of his Twitter. And there doesn't seem to be anyone who's sitting with him this morning. So I still think it is an open question of how he behaves and if he does realize that there are millions and millions of people following him there. And there already even more once he takes over the POTUS Twitter handle.\n\n\n\nTAPPER: This is a silly question on its face but I actually mean it very seriously. Do you think that -- I mean, obviously there were tweets sent out under his name by him and there are ones sent out by his campaign, you can actually tell ones were which by which device it was sent by.\n\n\n\nNIA-MALIKA HENDERSON, CNN SENIOR POLITICAL REPORTER: Yes.\n\n\n\nTAPPER: Do you think it is up to Kellyanne Conway or whomever in his inner circle to change his password so he no longer has access to his Twitter feed?\n\n\n\nHENDERSON: You would hope something like that happens. I don't even know the way in which he tweets if he's just firing them off, dictating them to somebody else who fires them off but this is going to be a problem.\n\n\n\nPrimarily because Donald Trump has made the best argument for why he should keep tweeting in the same way, and that is, oh, he won. And it didn't harm him throughout the primaries. It didn't harm him in the general election. He actually believes it's helped him.\n\n\n\nAnd I also think, if you look at the people who support Donald Trump, they like that bombast. They like that rhetoric. That -- they like the fact that he isn't some sort of P.C. blow-dried politician. So in that way, I think it's going to be hard to rest some of the -- not only the Twitter account from him, but the way he engages with the public, the way he engages with the media, the way he engages with his own party and the folk that he is doesn't like, whether it's Ted Cruz or Ted Cruz or Ted Cruz's wife or whoever. I think this is going to be an issue and I'm not so sure that it's going to be -- we see another Donald Trump once he assumes the office.\n\n\n\nTAPPER: Sara, we were talking before the show about how the Trump people are constantly trying to act as though he didn't propose banning all Muslims from entering the United States until a total complete shutdown until we figure out just what the hell is going on.\n\n\n\nYou heard Mayor Giuliani say that he basically walked that back although as you know he expanded it -- he described it as an expansion. Take a listen to what Mr. Trump -- president-elect Trump had to say about the issue just a few days ago.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nUNIDENTIFIED FEMALE REPORTER: Are you going to ask Congress to ban Muslims from entering the country?\n\n\n\nTRUMP: Thank you, everybody. Thank you.\n\n\n\n(END VIDEO CLIP) TAPPER: So where is this policy?\n\n\n\nMURRAY: That's a great question. I think this is going to be a question for a lot of Donald Trump's policies. Because we put a lot out there on the campaign trail. That he didn't necessarily flush out entirely and that he sort of walked back at points and then doubled down at points. That's what we saw with the Muslim ban.\n\n\n\nThe last thing we heard from Donald Trump was that when he talked about extreme vetting which at times included a religious test that to him was an expansion of the Muslim ban. But I think we saw the same thing when you talked to Paul Ryan about the notion of a deportation force and Donald Trump on a deportation force. Maybe they're not calling it a deportation force anymore. Maybe that's not what Donald Trump's calling it. Maybe that's not what House Speaker Paul Ryan is calling it.\n\n\n\nBut he has called for 5,000 additional border control agents. He has called for tripling the number of ICE officers. So there is certainly some sort of bolstering of these forces that would allow for increased deportation which is something Donald Trump promised.\n\n\n\n[09:35:01]\n\n\n\nBut I think everyone is kind of waiting to see how these things Donald Trump talks about on the campaign trail will turn into actual policy when he's in the White House and when he's dealing with Capitol Hill.\n\n\n\nTAPPER: There does seem to be, Sean, a certain degree of people who are within the Trump orbit acting as though he didn't make certain proposals during the campaign that are on videotape or on the Donald J. Trump website. I mean, why is it an unreasonable question to ask if the Muslim ban is actually going to happen or a deportation --\n\n\n\n(CROSSTALK)\n\n\n\nSPICER: It's not unreasonable question.\n\n\n\nBut I think that there's going to be a time between now and January 20th where he will assemble a team and his priorities of how he's going to get things done. He's got to work with Congress. And I think those conversations that started the other day have to continue in terms of this isn't a dictatorship. This is democracy. We have to work with the House and the Senate. He will continue his discussions with Speaker Ryan and Leader McConnell to layout the priorities of the sequencing but then also the exact -- the details of those policies.\n\n\n\nTAPPER: Congressman Becerra, we talked -- I talked to you on the beginning of the show with Speaker Ryan about the fears that many Americans feel.\n\n\n\nYou represent a district with a large Latino population in California. What are people feeling in your district?\n\n\n\nBECERRA: I've heard everything from kids afraid to go to school because they're not sure their parents will be home when they get there. I've heard some families talk about not going to work. I've heard some people afraid to walk the streets because they may look like they're Muslim. I've heard everything and there is a great deal of apprehension.\n\n\n\nBe a great time right now. This is a prime time now for Donald Trump. It would be great time for him to get out there and say some words that would calm people to make sure that everyone feels comfortable going out. Whether it's to demonstrate civilly or whether it's just to go to school, but this is prime time now. And Donald Trump's words will make a big difference because so much of his talk during the campaign was so harsh and for many people, frightening.\n\n\n\nTAPPER: And Nia-Malika, take a look at this. This is from York, Pennsylvania, where students were caught on camera holding a Trump sign while another student shouted, white power.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nUNIDENTIFIED MALE: White power. White power. White power.\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: So that's a -- I don't know if that's a vine. It's a loop of some sort. But in any case, there's an investigation going on there, minority students have said they experienced more harassment since this election started.\n\n\n\nNow as I mentioned at the top of the show, there has also been violence against Trump supporters. But in the schools of America anecdotally it seems to be a lot of this. Do you think that president-elect Trump and in addition, perhaps even President Obama and Hillary Clinton have an obligation to come out and try to calm things?\n\n\n\nHENDERSON: I think they do.\n\n\n\nYou heard some of that from Donald Trump in his Wednesday morning address when he talked about binding America's wounds. And you've heard that from also Paul Ryan talking about the Republican Party being the party of Lincoln and being and inclusive party.\n\n\n\nI do think it's incumbent on Donald Trump to shift his rhetoric, to continue the rhetoric about unity. I do think he probably has a steeper heel to climb. Because I think just plainly, there are a lot of Americans who think that Donald Trump is a bigot and they don't think he's a bigot because they have any sort of prejudged notions about a Republican president, they think that because of some of the things he said during the campaign.\n\n\n\nSo the question is, can he give a sort of Bob Dole speech, the kind of speech he gave in the 1996 convention where he said, we're not a party of racists, talking about Republicans. Can he give that speech? And will people believe him? I think that's the question.\n\n\n\nYou know, I've heard from friends too. I've got a friend who's a middle school teacher. He said the Latino students were lined up at his door on Wednesday morning. Some of them weren't even his students. And they were incredibly afraid about what this president, he would look like, and what it would mean for them and their families.\n\n\n\nTAPPER: Big challenge for president-elect Trump going forward. Thank you so much one and all.\n\n\n\nComing up protests against Donald Trump's election continue across the country this weekend. On the frontlines at Trump Tower, Michael Moore who predicted a Trump win. He'll be here live, next.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\n[09:43:16]\n\n\n\nTAPPER: Welcome back to STATE OF THE UNION. I'm Jake Tapper.\n\n\n\nIn the days since her defeat by Donald Trump, Hillary Clinton has been pretty busy. She was spotted walking her dog in the woods of Chappaqua. She handed out thousands of red roses to her campaign staff to thank them. And she at least partially pinned the blame for her loss on the FBI director.\n\n\n\nClinton telling donors on a conference call yesterday that the first letter released by Director Comey stopped the momentum she had built after the debates and the release of Trump's Access Hollywood tape. And that it was too much for her to overcome.\n\n\n\nLet's talk about that and much more with filmmaker Michael Moore who tried to warn his fellow Democrats of a Trump win on this show, on his blog and elsewhere.\n\n\n\nThanks so much for joining us, Michael\n\n\n\nMICHAEL MOORE, FILMMAKER: Thanks for having me, Jake.\n\n\n\nTAPPER: So what do you make of Hillary Clinton telling donors on Saturday that FBI Director Comey is at least largely to blame for her loss? Do you agree? Is she is in denial, what's your take?\n\n\n\nMOORE: I think it's part of it, absolutely. And I would -- I've actually called upon President Obama to appoint a special prosecutor, as soon as possible, to investigate how it is that the FBI director was able to interfere with an election, which I believe is not legal and help to tip the balance in what was going to be a very close election. I think that not only should people speak about it, it needs to be investigated.\n\n\n\nTAPPER: But, let's talk about one of the other weaknesses clearly of her campaign which you were talking about months ago which is the fact that there wasn't really any sort of direct economic outreach or plan to working class white voters in places like Michigan where you're from.\n\n\n\nEd Rendell, the former governor of Pennsylvania telling the \"New York Times\" that the Clinton campaign failed to spread its best resources outside Philadelphia and Pittsburgh.\n\n\n\n[09:45:04]\n\n\n\nHe wanted the Clinton campaign doing more in the rural white pockets of the state saying quote, \"We had the resources to do both. The campaign -- and this was coming from her campaign headquarters in Brooklyn -- didn't want to do it.\"\n\n\n\nDo you think that this is also a large part of what happened?\n\n\n\nMOORE: Yes. I think that also is part of it.\n\n\n\nI think how many months was it before she hadn't been to Wisconsin? I know she hadn't been to Michigan. There was a rush trip at the end there to Grand Rapids.\n\n\n\nBut, you know, I mean, where I come from -- I live in Michigan, so we're used to both parties. The Republican Party, which controls the state House and the governor in Michigan has contributed to poisoning the people of Flint and still hasn't fixed the problem. So we're used to the treatment of that party.\n\n\n\nWe're also used to the neglect, the benign neglect from Democrats or I should say the old school Democrats who basically -- once they get in have a hard time dealing with, especially cities that have large minority populations or in the cases of say Flint or Detroit, these are majority black cities and they largely go ignored (ph). They get a lot of lip service.\n\n\n\nAnd the funny thing is that Donald Trump kind of saw that and made that point, even though he will be the last person to visit Detroit or Flint to help us. And I think that the people that voted for him in Michigan are going to again be up for another rude awakening when they realize he's going to not do a damn thing to make the situation better and probably will make it worse.\n\n\n\nTAPPER: Obviously a lot of people who supported Hillary Clinton are trying to deal with this new world order. Oprah Winfrey, for example, making headlines angering a lot of Clinton supporters with comments that she made about Trump and Obama.\n\n\n\nTake a listen.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nOPRAH WINFREY, TALK SHOW HOST: I just saw president-elect Trump with president Obama in the White House, and it gave me hope.\n\n\n\nUNIDENTIFIED FEMALE: OK.\n\n\n\nWINFREY: It gave me hope. I mean, I have to say, just to hear president-elect Trump say that he had respect for President Obama, it felt that he had reached a moment where he was actually humbled by that experience. I think everybody can take a deep breath.\n\n\n\n(END VIDEO CLIP) TAPPER: What do you think?\n\n\n\nMOORE: Well, that's why we love Oprah.\n\n\n\nSomebody needs to say that. We do need hope. I was hope. I was hopeful when I saw the two of them there because Trump looked like he didn't belong there. And he felt so uncomfortable in his own skin sitting there in that chair, you know, just like -- and Obama, I think we counted 15 o 16 ums as he was trying say something nice.\n\n\n\nLook, that's the side show that has to happen in a week like this. But frankly, you know, Democrats would be better off if they ran Oprah or Tom Hanks or -- why don't we run beloved people? We have so many of them.\n\n\n\nThe Republicans do this. They run Reagan and the terminator and other people. Why don't we, why don't we run somebody that the American people love? That they are really drawn to and they're smart and have good politics and all that. Why don't Democrats do that?\n\n\n\nI'm telling you, Jake, my sincere hope is that the DNC that there is a clean sweep in this party. They all have to go, and they have to make room for the progressive Democrats who are going to come in here, are going to be needed to fight the things that Trump is going to do to the people of this country and the world. And we need young people, and women, and others who are going to really be the voice of this party.\n\n\n\nNot the same old, same old -- clearly people wanted change. I think everybody has admitted that and clearly Bernie Sanders represented that. And you know, I was -- I was at the demonstration yesterday and there were Trump people there on the sidewalk. And I went over and talked to them and I said, you know, would you have considered voting for Bernie Sanders? And they said yes, they were just mad at the system.\n\n\n\nTAPPER: Well let me ask you this, so that's the big question, what did Democrats do going forward organizationally, do they double down on progressive views the kind espoused by Bernie Sanders? Do they try to reach out to somebody who understands the working class white voters that voted for Donald Trump in droves? A fight already under way for the DNC chair. Several people have put their names forward including Howard Dean, Martin O'Malley, Congressman Keith Ellison who has the support of Bernie Sanders and Chuck Schumer.\n\n\n\nWho do you think the party should go with?\n\n\n\nMOORE: Keith Ellison. That is the exact way to go. That is the future.\n\n\n\n[09:50:01]\n\n\n\nWe live -- we live -- the fear that I think a lot of white voters have is that they know the truth, which is that as the census bureau says, before 2050, white people are going to be the minority in this country. MOORE: For the last two Septembers now, the majority of kindergartners entering school in America are not white. That's the new America and we need to have a party that's going to represent the majority here that's in the future and not the past.\n\n\n\nTAPPER: All right.\n\n\n\nMOORE: So I hope that that happens. But people need to be out in the streets and not -- it's not just about the white working class. Right now all white people need to be concerned about how afraid Muslims, African-Americans, Hispanics are right now.\n\n\n\nTAPPER: I need to cut you off, I'm sorry.\n\n\n\nMOORE: I know. I'm so sorry. No, no. I just wanted to make that appeal because...\n\n\n\nTAPPER: OK.\n\n\n\nMOORE: ... I worry about what's ahead.\n\n\n\nTAPPER: A lot of people out there are very worried. Donald Trump -- thank you so much, Michael Moore. We appreciate it.\n\n\n\nMOORE: Thank you.\n\n\n\nTAPPER: Donald Trump spent the last year and a half running an unconventional campaign. Should we expect the same from his inauguration. The pump (ph), the circumstance, the \"State of the Cartoonion\" coming up next.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\n[09:55:12]\n\n\n\nTAPPER: Welcome back. President-elect Trump is preparing for the Oval Office and his inauguration, so what should we expect when he takes the oath? It's the subject of this week's \"State of the Cartoonion.\"\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nTAPPER (voice-over): As the returns came in, election night, the nation began trying to envision just what a Trump presidency might look like.\n\n\n\nUNIDENTIFIED MALE: Congratulations, Mr. President.\n\n\n\nTAPPER: Sixty-eight days from now, after all, Mr. Trump will be sworn in as the 45th president of the United States of America. Now, you can bet that Beyonce will not be there serenading him on the steps of the Capitol as she did back in 2013.\n\n\n\nTRUMP: I don't need Beyonce.\n\n\n\nTAPPER: You're more likely, in fact, to see Trump supporter Ted Nugent.\n\n\n\nTED NUGENT, MUSICIAN: I've got your blue state right here, baby.\n\n\n\nTAPPER: The fact that the inaugural parade usually heads straight down Pennsylvania Avenue from the Capitol to the White House means the president-elect will march right by his new Trump hotel. It's already sold out for inauguration day as the hotel website promises \"Washington will never be the same.\"\n\n\n\n(END VIDEOTAPE)\n\n\n\nTAPPER: Thanks for watching.\n\n\n\n\"FAREED ZAKARIA GPS\" is next.\n\n\n\n", "images": ["http://cdn.cnn.com/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "http://i.cnn.net/cnn/images/1.gif", "http://i.a.cnn.net/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "http://cdn.cnn.com/cnn/1.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://www.cnn.com", "summary": ""}