{"url": "http://tasteofcountry.com/luke-bryan-metlife-stadium-review-2018/", "text": "Luke Bryan performed for more than 50,000 country fans on Saturday night (June 2). The MetLife Stadium show in New Jersey was his biggest stadium performance to date. For two hours Bryan ran through his lengthy catalog of hits, backed by a fireworks display.\n\nBryan kicked off his two-hour What Makes You Country Tour set with his signature song, \"Country Girl (Shake It for Me).\" With plenty of hip shaking, what we can assume was a caffeine rush (and those fireworks), he got the audience energized for what would be a memorable night of music. Some lucky fans were seated close, thanks to Verizon's customer rewards program, Verizon Up, and got to take in the shaking in all its glory.\n\n\"Where them country girls at?\" Bryan asked the humongous crowd at the start of his set. \"We're going to get you shaking right off the bat.\"\n\nHe wasn't lying. The New Jersey audience was dancing right along with him, including a young boy Bryan brought onstage who imitated the Backpack Kid dance. Later in the set, the superstar would invite two girls up after noticing a sign that read, \"It's my 8th birthday. Can I dance with you, Luke?\"\n\nWhile performing his 2007 single \"All My Friends Say,\" he grabbed several beers from a cooler placed onstage. After taking a sip from each one, he'd hand them out to fans in the crowd — a much-appreciated gesture. Bryan admitted that drinking too much beer gets in the way of his figure, unlike Sam Hunt, who opened the MetLife Stadium show.\n\n\"You know what, he works out a lot. I cannot compete with that sh--!\" Bryan joked. \"I just don't want to give up drinking. I mean, I work out a little bit, but I ain't giving up no damn cold beer on a Sunday.\"\n\nHe added, \"I got the right kind of six-pack. That's a song idea!\" He came up with the lyrics on the spot, singing: \"I got the right kind of six-pack. I got the right kind of six-pack. I got a little in the front, little in the back. I got the right kind of six-pack.\"\n\nThroughout the night, it was obvious that Bryan was in his element. As he ran around the catwalk he'd often interact with the fans below, making faces, showcasing his dance moves or simply pointing and smiling at them. His energy never wavered on songs like \"I Don't Want This Night to End,\" \"Move\" and \"Kick the Dust Up.\" On the slower ballads, he still captivated — highlights included his three-week No. 1 \"Most People Are Good,\" the sultry \"Strip It Down\" and the poignant \"Drink a Beer,\" during which he urged fans to take a sip of their drink to remember those they have lost.\n\nMid-set Bryan returned to center-stage alone, with just a microphone and his guitar, and admitted that he never gets to play guitar and sing by himself anymore. He segued into a snippet of his first No. 1 hit, \"Do I,\" before beginning \"Home Alone Tonight,\" his 2015 duet with Little Big Town's Karen Fairchild. Remarking that he needed a duet partner, he asked if any women in the audience would be able to sing with him. One woman, a pediatric nurse named Michelle, eagerly volunteered herself, but once she got to the stage admitted that she can't sing.\n\n\"You can't actually sing, but you can try? You sing karaoke? That's a little different than this sh-- going on right now,\" Bryan told her. \"I need some damn help. You realize I've been judging American Idol for like six months so if you can't, I'm going to call you out in front of 50,000 people.\"\n\nMichelle was forthcoming — she began to sing Fairchild's part and the crowd responded with unfortunate boos. Bryan came to her rescue, though, telling everyone to settle down, and the two eventually finished the song together. It was a comedic part of Bryan's two-hour show that showcased the singer's good-natured spirit and exactly why he's become a household name.\n\n\"Right here tonight, of all the stadiums I've had the privilege of playing, this is the biggest crowd I've ever played for,\" Bryan marveled as he looked out on 50K people. \"Right here, y'all made it happen. Thank you!\"\n\nSam Hunt, Jon Pardi and Morgan Wallen kicked off the show. Hunt — a superstar himself — delivered an impressive hour-long set which included his massive hits \"Body Like a Back Road,\" \"Break Up in a Small Town,\" \"House Party\" and \"Make You Miss Me\" as well as new single \"Downtown's Dead\" and \"Drinkin' Too Much.\" Ahead of performing his cut for Billy Currington, \"We Are Tonight,\" Hunt talked about how he started out as a struggling musician. In 2013 he was broke and living off gas station pizza while trying to get his career off the ground.\n\nWhen Currington cut his song, everything changed. \"He helped me put a little change in my pocket, keep these boys fed, and kept enough gas in the van and on the road to MetLife Stadium,\" Hunt shared.\n\nHunt's set included a stripped-down medley of old-school country hits to \"bring the Nashville honky-tonk experience to New Jersey.\" His covers included Brooks & Dunn's \"Brand New Man,\" Jo Dee Messina's \"Heads Carolina, Tails California,\" the Dixie Chicks \"Goodbye Earl,\" Tim McGraw's \"Where the Green Grass Grows\" and Garth Brooks' \"Ain't Goin' Down ('Til the Sun Comes Up).\"\n\nBryan's What Makes You Country Tour continues through the summer, with more stadium and amphitheater stops planned.\n\nEditor's Note: Verizon Up offers unique music experiences to Verizon members. Ahead of the show, a backstage tour was provided to Taste of Country, and a member of Bryan's team shared a behind-the-scenes look at the star's current tour. Throughout the concert, Verizon customers were given special seating in the Verizon Up Members Section, which was located near the catwalk of Bryan's stage. Music fans interested in a similar experience can earn rewards by enrolling with the My Verizon app.", "images": ["https://townsquare.media/site/204/files/2018/06/Luke-Bryan-What-Makes-You-Country-Tour.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "http://townsquare.media/site/204/files/2018/04/toc-logo-high-rez.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1"], "top_img": "https://townsquare.media/site/204/files/2018/06/Luke-Bryan-What-Makes-You-Country-Tour.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Annie Reuter"], "canonical_link": "https://tasteofcountry.com/luke-bryan-metlife-stadium-review-2018/", "title": "Luke Bryan Performs for Biggest Stadium Crowd Yet", "meta_data": {"instagram_profile": "tasteofcountry", "description": "Luke Bryan performed for more than 50,000 country fans on Saturday night (June 2). The MetLife Stadium show in New Jersey was his biggest stadium performance to date.", "keywords": "luke bryan, luke bryan tour, luke bryan what makes you country tour, luke bryan stadium tour", "fb": {"app_id": 193351250697247, "admins": 8802808, "pages": 173910492638623}, "og": {"title": "Luke Bryan Performs for Biggest Stadium Crowd Yet", "description": "Luke Bryan performed for more than 50,000 country fans on Saturday night (June 2). The MetLife Stadium show in New Jersey was his biggest stadium performance to date.", "url": "https://tasteofcountry.com/luke-bryan-metlife-stadium-review-2018/", "site_name": "Taste of Country", "type": "article", "image": "https://townsquare.media/site/204/files/2018/06/Luke-Bryan-What-Makes-You-Country-Tour.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@tasteofcountry"}, "sailthru.description": "Luke Bryan performed for more than 50,000 country fans on Saturday night (June 2). The MetLife Stadium show in New Jersey was his biggest stadium performance to date.", "sailthru.date": "2018-06-04 10:25:20", "sailthru.title": "Luke Bryan Performs for Biggest Stadium Crowd Yet at New Jersey Tour Stop", "sailthru.tags": "tsmsite-tasteofcountry, tsmmarket-national, tsmtype-national, luke-bryan, sam-hunt, country-music-news, reviews", "sailthru.author": "anniereuter", "sailthru.image.full": "https://townsquare.media/site/204/files/2018/06/Luke-Bryan-What-Makes-You-Country-Tour.jpg", "sailthru.image.thumb": "https://townsquare.media/site/204/files/2018/06/Luke-Bryan-What-Makes-You-Country-Tour.jpg", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "google-site-verification": "e19BTQtucrkVk-O5axdlPIIJWMrqGU-QRWcldJZvxnA", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1528079120.0, "source": "http://tasteofcountry.com", "summary": ""}