{"url": "http://time.com/4715786/big-little-lies-finale-recap/", "text": "This post includes spoilers for Big Little Lies episodes 1-7 and does not factor in Liane Moriarty’s novel of the same name, on which the show is based.\n\nIn the Big Little Lies finale titled “You Get What You Need,” we finally find out who died—as well as the identity of the killer. During an intense argument on the roof of the school, Bonnie (Zoë Kravitz) shoves Perry (Alexander Skarsgård), causing him to plummet to his death.\n\nThis ending was the culmination of a narrative that kept Monterey’s most glamorous moms and dads in the dark about Perry’s behavior. Until that night, no one knew that he abused his wife, Celeste (Nicole Kidman), and sexually assaulted Jane (Shailene Woodley), resulting in the birth of her son.\n\nA rapid chain of events on the night of the least fun trivia night in history all led to Perry’s demise. Here’s a rundown of exactly what happened.\n\nCeleste’s choice:\n\nCeleste learns that her son Max was bullying Amabella, tragically emulating his father’s abusive behavior. (Remember the stuffed animal’s missing limb?) This revelation is the pivotal crack in her denial that the twins were safe from Perry’s violence. Later on, Perry discovers that as he feared, Celeste is leaving him. She scrambles to set her hastily prepared escape plan in motion before the party.\n\nIll-advised karaoke:\n\nDuring Ed’s (Adam Scott) cringe-inducing song to Madeline (Reese Witherspoon), she’s so overcome by guilt about cheating on him that she races to the caution-taped site of her affair with Joseph. Jane runs after her, and consoles her. Sporting the most elaborate Audrey Hepburn costume ever, Renata (Laura Dern) interrupts and apologizes to Jane for mistreating her. Celeste joins them. Perry arrives soon after, ordering her to the car. She refuses to go, insisting on staying with her friends. Bonnie hangs back and surveils the scene from a level above everyone.\n\nShailene Woodley and Reese Witherspoon in Big Little Lies. Hilary Bronwyn Gayle—HBO\n\nThe struggle:\n\nIn a chilling moment, Perry is revealed to be Jane’s rapist, as the horror on her face registers at the sight of him. Celeste quickly puts this information together as well. Enraged, Perry hits Celeste. Madeline and Renata try to restrain them, but he lashes out at them too. Bonnie races to the scene and shoves him, ultimately costing Perry his life. He tumbles down the concrete stairs to his death.\n\nThe end:\n\nThe show caps off with coordinated testimonies proving the core group doesn’t rat out Bonnie, who a detective says could potentially face community service for involuntary manslaughter. Perry’s death leaves his family on the road to recovery with a little help from the other moms. And help, the curtain dropper assures fans, is something that each mom will have. In this tidy ending, they all play at the beach, moving on together.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Ashley Hoffman at Ashley.Hoffman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/03/big-little-lies.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Ashley Hoffman"], "canonical_link": "https://time.com/4715786/big-little-lies-finale-recap/", "title": "Let's Talk About Who Died on Big Little Lies", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "big little lies, big little lies finale, big little lies final episode, big little lies episode 7, big little lies bonnie, big little lies death, who is dead in big little lies, zoe kravitz, Alexander Skarsgard, big little lies recap", "news_keywords": "big little lies, big little lies finale, big little lies final episode, big little lies episode 7, big little lies bonnie, big little lies death, who is dead in big little lies, zoe kravitz, Alexander Skarsgard, big little lies recap", "description": "In the final episode of Big Little Lies titled “You Get What You Need,” we finally out who died—as well as the identity of the killer.", "og": {"title": "Let's Talk About Who Died on 'Big Little Lies'", "type": "article", "site_name": "Time", "url": "https://time.com/4715786/big-little-lies-finale-recap/", "description": "Spoilers ahead!", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4715786/big-little-lies-finale-recap/", "description": "In the final episode of Big Little Lies titled “You Get What You Need,” we finally out who died—as well as the identity of the killer.", "media": "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4715786/big-little-lies-finale-recap/", "title": "Let's Talk About Who Died on 'Big Little Lies'", "description": "Spoilers ahead!", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/02/big-little-lies-hbo-kidman-witherspoon-woodley1.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}