{"url": "www.businessinsider.com/prince-harry-meghan-markle-giving-up-career-2018-5", "text": "Prince Harry and Meghan Markle will wed on Saturday.\n\nThat means Markle will leave behind both her acting career and her political pursuits.\n\nSuccessful people say your choice of spouse is the most important career decision you can make — and it seems like Prince Harry and Markle have spent time thinking about how they can jointly change the world.\n\n\n\nThe royal wedding is (almost) upon us. Prince Harry and Meghan Markle will tie the knot on Saturday, about two years after they were set up on a blind date by a mutual friend.\n\nMarkle's new life will look drastically different from her life before she met her future husband. Not only will she move from the United States to the United Kingdom and become a British citizen; she'll also transition from an acting career to being full-time royalty.\n\nIn the couple's first interview after announcing their engagement, Markle, who is 36 years old, addressed her decision: \"I don't see it as giving anything up, I just see it as a change.\"\n\nShe added that she had already been working on the television series \"Suits\" for seven years. \"So we're very, very fortunate to be able to have that sort of longevity on a series and for me, once we hit the 100-episode marker, I thought, 'You know what? I have ticked this box and I feel really proud of the work I've done there and now it's time to, as you [Harry] said, work as a team with you.\"\n\nIn addition to playing Rachel Zane on \"Suits,\" Markle also appeared on the soap opera \"General Hospital.\" She's been everything from a United Nations women's advocate to a freelance calligrapher, and she recently shut down her lifestyle blog, \"The Tig.\"\n\nWhile nothing will expressly prohibit Markle from acting, INSIDER's Kristin Salaky and Talia Lakritz reported that royals are forbidden from being politically active and from publicly discussing their political views.\n\nMarkle and Prince Harry say they're on the same page about wanting to change the world\n\nMarkle's experience marrying into royalty isn't something most of us can relate to. But the general theme of making big life changes for your partner is universal.\n\nAs Facebook COO Sheryl Sandberg frequently tells young women, \"The most important career choice you'll make is who you marry.\"\n\nLegendary investor Warren Buffett said much the same thing in a conversation with Bill Gates at Columbia University. He told the audience: \"The most important decision many of you will make, not all of you, will be the spouse you choose,\" since \"you will move in the direction of the people that you associate with.\"\n\nINSEAD professor Jennifer Petriglieri said on an episode of the Harvard Business Review's podcast \"Women at Work,\" that couples, in order to maximize both partners' satisfaction, should have a conversation twice yearly about what they're \"aiming for individually and together\" in the near future.\n\nIn fact, in the post-engagement interview, Markle mentioned that she and Prince Harry had had this type of conversation on an early date: \"It was really one of the first things we connected on, it was one of the first things we started talking about when we met, was just the different things that we wanted to do in the world and how passionate we were about seeing change.\"\n\nIn the same interview, Prince Harry responded to a question about whether he feels a sense of responsibility for Markle leaving acting behind. \"Of course,\" he said, adding that, \"I still have to have some pretty frank conversations with her to say, you know what you're letting yourself in for, it's a big deal, and it's not easy for anybody.\"\n\nPrince Harry went on: \"Whatever we have to tackle together or individually, will always be us together as a team.\"\n\nMore on the royal wedding:", "images": ["http://www.businessinsider.com/prince-harry-meghan-markle-giving-up-career-2018-5?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a993e63487ff91c008b45ad?width=1200&format=jpeg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5a7346c5dd484a4c008b474c?width=24&format=jpeg&auto=webp", "https://i.insider.com/5a7346c5dd484a4c008b474c?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5a993e63487ff91c008b45ad?width=1200&format=jpeg", "keywords": [], "authors": ["Shana Lebowitz"], "canonical_link": "https://www.businessinsider.com/prince-harry-meghan-markle-giving-up-career-2018-5", "title": "The most important career decision you can make is who you marry — here's what that means for Meghan Markle", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "The most important career decision you can make is who you marry — here's what that means for Meghan Markle", "date": "2018-05-18", "news_keywords": "Prince Harry, Prince Harry and Meghan Markle, Meghan Markle, Meghan and Harry, Meghan Markle Prince Harry engagement, Royal Wedding, Royal Wedding 2018, Marriage, BIStrategy, BI Prime, BI Prime Archive, Shana Lebowitz", "description": "Choosing Prince Harry as her husband means Meghan Markle is relinquishing both her acting carer and her political pursuits, since royal couples do not typically work.", "author": "Shana Lebowitz", "article": {"publisher": "businessinsider", "content_tier": "locked", "opinion": "false"}, "tbi-vertical": "Life", "og": {"title": "The most important career decision you can make is who you marry — here's what that means for Meghan Markle", "description": "Choosing Prince Harry as her husband means Meghan Markle is relinquishing both her acting carer and her political pursuits, since royal couples do not typically work.", "type": "article", "url": "https://www.businessinsider.com/prince-harry-meghan-markle-giving-up-career-2018-5", "image": "https://i.insider.com/5a993e63487ff91c008b45ad?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "The most important career decision you can make is who you marry — here's what that means for Meghan Markle", "sailthru.date": "2018-05-18", "sailthru.tags": "Prince Harry, Prince Harry and Meghan Markle, Meghan Markle, Meghan and Harry, Meghan Markle Prince Harry engagement, Royal Wedding, Royal Wedding 2018, Marriage, BIStrategy, BI Prime, BI Prime Archive, Shana Lebowitz", "sailthru.description": "Choosing Prince Harry as her husband means Meghan Markle is relinquishing both her acting carer and her political pursuits, since royal couples do not typically work.", "sailthru.author": "Shana Lebowitz", "sailthru.verticals": "thelife, careers, prime", "sailthru.image.full": "https://i.insider.com/5a7346c5dd484a4c008b474c?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5a7346c5dd484a4c008b474c?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@LifeInsider"}, "should-hide-ads": "true", "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "control", "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "control", "subscribe-smallest-price": "variant"}, "viking-id": "5afdc6ed83387a2d008b4c62", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1526572800.0, "source": "http://www.businessinsider.com", "summary": ""}