{"url": "https://web.archive.org/web/20170506084140/https://www.newbeauty.com/hottopic/blogpost/9737-the-reason-mama-june-was-denied-surgery-after-massive-weight-loss/", "text": "Brittany Burhop , Senior Editor | March 31, 2017\n\n**UPDATE March 31, 2017\n\n\n\nThe final reveal is here! After numerous surgeries, Mama June is now showing off her new body. “I’ve worked my ass off, working out getting healthy,” she said during the finale of From Not to Hot. “And now I feel like becoming the person on the outside that I always felt like on the inside.” Daughter Honey Boo Boo calls her a \"Marilyn Monroe.\"\n\nA post shared by wetv (@wetv) on Mar 31, 2017 at 7:04pm PDT\n\nIn an exclusive clip for an upcoming episode of Mama June: From Not to Hot, Mama June's weight loss transformation is finally revealed.\n\nYou know her from the reality show Here Comes Honey Boo Boo, which America went nuts over back in 2012. And although the show has since been canceled, Mama June, 37, (her real name is June Shannon) has continued to draw attention on social media, where she's been praised for her dramatic weight-loss success.\n\nAs Entertainment Tonight reports, Mama June started her weight-loss journey at 460 pounds, and her new WEtv show Mama June: From Not to Hot, which debuts tomorrow—teases that she's now a size 4.\n\nYou May Also Like: How This Woman Lost 75 Pounds and 6 Dress Sizes\n\n\n\nAfter gastric bypass surgery, Mama June underwent another surgery to remove the excess skin that was left behind after the weight was gone. Then, as her 17-year-old daughter, Pumpkin, tells ET, she \"got her boobies done. She got them from a 44 long to 36 up.\"\n\n\"I think that her biggest thing [she has to] overcome is that fact that she still thinks of herself as a bigger person, because, even to this day, like, a couple of days ago we had a conversation, and...she looked in the mirror and was like, 'I'm still fat.' And I guess because she's seen herself as a bigger person all these years, she doesn't realize how small she is.\"\n\nMama June's trainer on the show, Kenya Crooks, also weighed in: \"That's what she's used to doing, and when you're a bigger person, that's how you disguise all of that—through wearing bigger clothes. So, now, we're having to transform her mind even more so...because she has curves now, she looks awesome.\"\n\nPictures of Mama June's makeover have yet to surface—our bet is that the big reveal will happen on the show—but we're keeping our eyes peeled and will update this post as soon we have them. WEtv has referred to her weight loss as \"the most shocking transformation in reality TV history.\"\n\n**UPDATE January 25, 2017\n\nBack in August, 2016 (as originally reported on below), Mama June was denied surgery to remove her excess skin that remained after extreme weight loss because she hadn't lost enough weight (even after losing 150 pounds in one year) to become a candidate. Determined to shed the remaining 75 pounds and prep her body for the surgery, the reality TV star has been documenting her diet and fitness journey, which will air in a new show called Mama June: From Not to Hot.\n\nDebuting February 24 on WEtv, the \"docu-dramedy,\" as it's being called, will include seven one-hour episodes that spotlight Mama June's incredibly emotional and physical transformation, as well as her intensive plastic surgery procedures to finally remove her excess skin and reveal a whole new look.\n\n\n\nIn a sneak peek of the upcoming show, exclusive to People, Mama June said, “After the weight-loss surgery, I’m going to look completely different. I’m scared, too. When I’m done, I’m not even going to recognize my own self in the mirror.\"\n\n\n\n\n\n\n\n\n\n**Originally Published August 4, 2016\n\nAfter massive weight loss, there's typically a lot of excess skin left behind that doctors can remove with surgery, which is what Mama June (currently 245 pounds) had expected to undergo. This week, she appeared on the season finale of the E! reality show Botched, where she revealed issues with the C-section she had when she gave birth to her daughter Alanna (aka Honey Boo Boo) 10 years ago. The doctor cut too deep and left her with an incredible amount of scar tissue on her abdomen that can only be removed with surgery.\n\nYou May Also Like: The Doctors of Botched Are Back to Do Surgery Like You’ve Never Seen Before\n\nThe combination of extreme weight loss and a flubbed C-section surgery have left Mama June desperate to fix her figure flaws. But just when she thought the time had come, her surgeon, Terry Dubrow, delivered some bad news. Her BMI (Body Mass Index; an indirect measure of body fat) was still too high, 39 to be exact, and she needs to be closer to a 28 in order for the body-contouring procedure to be successful. This means she needs to lose about 75 more pounds.\n\nImages/Getty\n\nBut what is the reasoning behind this, and is BMI really that critical in this case? We turned to San Diego plastic surgeon Joseph L. Grzeskiewicz, MD, for the answer. \"Like most other doctors, I have some criteria that I use to determine candidacy for removal of excess tissue after weight loss. One of the most important criteria is that I would like to see a sufficient amount of time with a stable weight—preferably a year. That does not mean the time since weight loss commenced, or the time that the patient first hit their target weight, but rather it is a year of remaining at the same stable weight that is healthy and appropriate for their age and height. The next criterion I use is the BMI. I consider a BMI of 26–28 to be the upper limit of the safe range for body contouring surgery, but I don’t like to rely on this as a hard fast rule because there are borderline cases (for example, bodybuilders with larger muscle mass and denser bone structure).\"\n\nAnother thing Dr. Grezeskiewicz says is important to note if you're considering this procedure: your medical history. \"Being in good health is crucial (any issues like cardiovascular problems or diabetes need to be under control), and I will never do this type of surgery on a smoker or someone who uses nicotine in any form because it can cause serious healing problems and tissue loss.\"\n\nYou May Also Like: New Study Says BMI is Inaccurate Way to Measure Health\n\nIf a surgery like this is performed on someone who is still too heavy or not in good health, there can be scary repercussions. According to Dr. Grzeskiewicz, the biggest and most serious consequences are medical complications, some of which can lead to severe problems or even death. \"Issues like blood clots in veins that can travel to the lungs (pulmonary emboli), heart attacks, kidney failure, strokes, wound-healing problems and tissue loss are all possible complications in people who are poor candidates for this kind of surgery. In addition, if a person is a diabetic with poor control, the infection risk is significantly elevated.\"\n\nAesthetic issues are also much more prone to happen in someone who is too heavy still for surgery. \"Contour irregularity, unevenness of form, asymmetry and irregular, thick or poorly positioned scars are all things that happen more frequently when this is the case, and they can lead to the need for further surgery,\" says Dr. Grzeskiewicz.\n\nThrough thorough consultation and testing, doctors can safely perform these body-contouring surgeries and continue to transform lives. \"The patients who undergo this type of surgery after massive weight loss are some of our happiest patients,\" says Dr. Grzeskiewicz. We hope Mama June reaches her goal!", "images": ["https://web.archive.org/web/20170506084140im_/http://b.scorecardresearch.com/p?c1=2&c2=21004701&cv=2.0&cj=1", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/74325-TightArms.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/75339-sephorapng.png.204x150_q80_crop-smart.png", "https://web.archive.org/web/20170506084140im_/https://s3.amazonaws.com/media.newbeauty.com/photos/39199-majpg.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/28149-flatstomachjpg.jpg.383x305_q80_crop-smart_upscale.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/233-hairproductspng.png.204x150_q80_crop-smart.png", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/29365-ma2jpg.jpg.660x0_q80_crop-scale_upscale.jpg", "https://web.archive.org/web/20170506084140im_/https://www.newbeauty.com/static/images/tt_banner_left.jpg?v=2", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/26656-shutterstock_569215900jpg.jpg.204x150_q80_crop-smart.jpg", "https://web.archive.org/web/20170506084140im_/https://www.newbeauty.com/static/images/tt_banner_right.jpg?v=2", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/71808-trajpg.jpg.383x305_q80_crop-smart_upscale.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/36264-hair-zoomed.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/3440-lipinjectionspng.png.300x300_q80_crop-smart_upscale.png", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/29989-youngerskinpng.png.204x150_q80_crop-smart.png", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/14106-Oxygen-Facial-By-Luzern-at-The-Spa-at-Thompson-Miami-Beach.jpg.256x195_q80_crop-smart.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/77225-Screen Shot 2015-08-21 at 2.24.23 PM.png.256x195_q80_crop-smart.png", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/90080-bodyfatpng.png.383x305_q80_crop-smart_upscale.png", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/29365-ma2jpg.jpg", "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/14407-birthcontrolherojpg.jpg.204x150_q80_crop-smart.jpg"], "top_img": "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/29365-ma2jpg.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170506084140/https://www.newbeauty.com/hottopic/blogpost/9737-the-reason-mama-june-was-denied-surgery-after-massive-weight-loss/", "title": "Mama June's Body Transformation Will Shock You", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"title": "Mama June Is Now a Size 4", "site_name": "NewBeauty", "image": "https://web.archive.org/web/20170506084140im_/https://d53l9d6fqlxs2.cloudfront.net/photos/29365-ma2jpg.jpg", "url": "https://web.archive.org/web/20170506084140/http://www.newbeauty.com/hottopic/blogpost/9737-the-reason-mama-june-was-denied-surgery-after-massive-weight-loss/", "description": "And the transformation photo is here.", "locale": "en_US", "type": "article"}, "twitter": {"card": "summary_large_image", "site": "@NewBeauty", "creator": "@NewBeauty", "title": "Mama June Is Now a Size 4", "description": "<p>And the transformation photo is here.</p>", "image": {"src": "https://d53l9d6fqlxs2.cloudfront.net/photos/29365-ma2jpg.jpg"}}}, "movies": ["https://web.archive.org/web/20170506084140if_/https://www.youtube.com/embed/AmKs6of5muY", "https://web.archive.org/web/20170506084140if_/https://www.youtube.com/embed/UW468cwKpdE"], "publish_date": 1490889600.0, "source": "https://web.archive.org", "summary": ""}