{"url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/08/28/AR2009082803158.html", "text": "With polls showing that President Obama is losing ground, The Post asked political experts what he could do to regain the initiative. Below are contributions from Scott Keeter, Michael S. Berman, Newt Gingrich, Donna Brazile, Robert J. Blendon, Christine Todd Whitman, Dan Schnur, Ed Rogers, Harold Ford Jr. and Ed Gillespie.\n\nSCOTT KEETER\n\nDirector of survey research at Pew Research Center\n\nPresident Obama had a better honeymoon with the public than either Bill Clinton or George W. Bush. But it's over now. His ratings are approaching his electoral margin.\n\nThis summer slump is a product of his own actions and political forces outside his control. Obama campaigned for strong government action on the economy and health care, and most of his voters agreed with this direction. But Obama's efforts to expand the role of government have alienated many of those who did not vote for him but nonetheless gave him high marks when first he took office.\n\nPew Research's political values survey this spring showed no surge in public demand for more government. Indeed, anti-government sentiment, which had been building for years, was heightened by the financial bailout and stimulus program. Moreover, it was inevitable that Obama eventually would have to take responsibility for the economy, which -- despite a few \"green shoots\" -- remains grim.\n\nThe health-care debate has taken a toll on the president's popularity as well as that of his party. Americans remain ambivalent, desiring most of the major elements in the reform proposals but simultaneously worrying about too much government control of health care. Obama can influence whether and how reform passes, and whether it passes at all will affect his approval rating. Democrats in Congress fear that passing an unpopular health care package will be politically costly, but as Clinton's 1994 experience demonstrated, they have good reason to fear that failure on health care could also be costly.\n\nMICHAEL S. BERMAN\n\nPresident of the Duberstein Group; former counsel and deputy chief of staff to Vice President Walter Mondale\n\nFirst, the president should not over-read or over-rely on polls. To get some perspective, check out the Aug. 26 piece by Jeremy Rosner of Greenberg, Quinlan, Rosner Research entitled \"A Pollster's Advice: Don't Trust the Polls on Health Reform's Demise.\"\n\nSecond, Obama should show that he understands that people are being asked to accept changes in the health-care system while they are in the throes of actual or potential crisis in their personal financial \"systems.\" And that he has heard the concerns raised by affected Americans nationwide. While the media attention to various town halls was in the best tradition of \"if it bleeds it leads,\" most of the people who came out did so out of a real need and interest to learn more about health-care reform proposals.\n\nThird, invite House Speaker Nancy Pelosi and Majority Leader Harry Reid to a meeting, just the three of them, and work through with them a plan for going forward. Work \"with\" the congressional leadership to come up with a single bill that represents the doable, sans the wish list of every idea for changing health care that has been suggested in the past several decades. And get to that bill before the process kind of stumbles on to it.\n\nFinally, choose a dramatic forum, perhaps a joint session of Congress, to lay out a bill that includes core changes but reflects having heard what is bothering the people he was elected to lead.\n\nNEWT GINGRICH\n\nFormer Republican speaker of the House of Representatives\n\nWhen he returns from vacation, the president's most important assignment should be to take a deep breath and get a long-term view of the country's reaction to his policies.\n\nSince World War II, only Gerald Ford and Bill Clinton have had worse ratings after seven months than President Obama. His economic policies are not creating jobs. His energy tax is unlikely to pass the Senate. There is an overwhelming rejection of his spending policies.\n\nOn the international front, Afghanistan is proving much harder than expected. Iran is showing no signs of giving up its nuclear program and North Korea is still unyielding.\n\nIn this setting, the left's health program is bitterly dividing the country. Several polls have shown that more Americans expect their personal health-care situation to get worse than to get better under the plan being considered in Congress.\n\nStill, Obama's left-wing advisers want him to undertake the revolutionary act of ramming through massive change for 17 percent of the economy under a narrow budgetary provision. This would be a statement of absolute defiance of the vast majority of Americans.\n\nObama faces a choice: He can attempt to run a left-wing government against the American people. Or he can govern from the center with a large majority of Americans supporting him. He can have either his left angry or the American people angry. We will know in September which choice he has made.\n\nDONNA BRAZILE\n\nAuthor and political commentator; manager of Al Gore's 2000 presidential campaign\n\nPresident Obama must reset the national debate and narrow his focus on passing health-insurance reform with or without Republicans. To do this, the president must convince deficit-weary voters that reform will not send the national debt soaring and that higher taxes on the middle class are not just around the corner.\n\nWith everything in his inbox still marked urgent, the president needs to prioritize more and stop trying to do everything at once without also reminding Americans of the sacrifices involved. He should repeat: \"Remember, we're all in this together.\"\n\nObama must also take a chapter from his campaign and begin to work on the \"new politics\" that would allow him to reach bipartisan consensus on a host of major challenges.\n\nMuch of the real anger we are seeing is economic anxiety that ordinary people are experiencing in this jobless recession. The economy is doing better, according to statistics, but nobody feels it yet. That makes for a lot of fear and worry.\n\nThe administration should also keep an eye on the stimulus spending: target funds, track job creation, rebuild the safety net, and eliminate waste and duplicity. With money so tight, no one wants to see the government spending frivolously.\n\nROBERT J. BLENDON\n\nProfessor of health policy and political analysis at Harvard's School of Public Health and its Kennedy School of Government\n\nMost Americans do not see the president's economic policies as having been particularly successful for people like themselves, and this is leading to some skepticism about health-care reform. In fact, recent polls show most Americans do not anticipate any aspect of their health care improving if the president's health-reform proposals were enacted.\n\nTo shift this thinking requires two things: The administration's message has to change sharply, focusing on more concrete, practical aspects of reform and how it will improve typical Americans' experiences with health care. Obama needs to present over and over again five specific changes in the legislation that will help the average family, and how they will be paid for. For example, explain why changing the system so families cannot lose their insurance coverage and enacting tough insurance reforms helps families who have coverage today.\n\nSecond, the president needs to make a clear decision this fall about whether he supports a public option competing with private insurance. If so, he must explain how it would function in practice. Americans in the political center are turned off by ideological debates. After all these months, they want him to explain if it is essential and then move on to other issues they see as important.\n\nCHRISTINE TODD WHITMAN\n\nChair of the Republican Leadership Council; governor of New Jersey from 1994 to 2001\n\nIf he wants to regain ground on the health-care debate, climate change and the other legislative initiatives he has identified, President Obama needs to start by rebuilding some bridges within his party. The squabbling among Democrats is bitter, with the attacks from the more liberal end of the party on the more moderate \"Blue Dog\" Democrats reaching a fever pitch. Obama might keep in mind the legacy of Sen. Edward Kennedy and reach out to those Blue Dog Democrats as well as moderate Republicans to find common ground. Kennedy was an ardent partisan with a 90 percent liberal lifetime voting rating from the liberal watchdog group Americans for Democratic Action. No one questioned his commitment to the liberal agenda or his party. Yet few senators have ever authored more bipartisan bills and were known for so consistently reaching across the aisle. The president should refuse to push through legislation on strictly partisan votes and should seek the types of bipartisan compromise he promised to broker.\n\nDAN SCHNUR\n\nDirector of the University of Southern California's Unruh Institute of Politics; communications director for John McCain's 2000 presidential campaign\n\nEveryone is drawing political lessons from the life and legacy of Ted Kennedy. But there is one missed opportunity in particular from Kennedy's career that Barack Obama can reflect on to get himself and his administration back on track.\n\nKennedy famously cited his decision to reject President Richard Nixon's health-care reform package as his greatest regret. Although Nixon's proposal was not nearly as ambitious as Kennedy would have preferred, the senator realized over the years that working with Nixon would have led to significant advancements toward his larger goals.\n\nFast-forward to today's battle over health care. It's clear that Obama deserves credit for moving the debate forward and achieving consensus on a number of previously intractable issues. Set aside, for now, the brawls about end-of-life counseling and a publicly funded option. If Obama signed a bill that allows individuals who change jobs to keep their insurance, forbids the denial of coverage for preexisting conditions, and deals with a lifetime cap on benefits, people will throw rose petals at his feet.\n\nImportant progress can be made now on health care; after the most significant reforms in a generation are signed into law, he can still come back to the negotiating table and continue to move forward.\n\nED ROGERS\n\nChairman of BGR Group; White House staffer to Ronald Reagan and George H.W. Bush\n\nWhile the president's effectiveness is eroding, the situation is not dire. He can regain the initiative, but an eloquent speech won't do it. I assume he will not convert to conservatism and abandon his flawed plans, but he should cut his losses and get back to reality.\n\nOccasionally all White Houses contort themselves into situations where they begin to say things they know are not true. The more you say such things, the more you have to keep saying them to try and make them true. But the Obama administration needs to face it: The president's energy bill is not a jobs bill! His health-care plans will lead to government bureaucratic decisions about individuals' heath care and will cost a fortune. The deficit is not under control. The administration should not deny the obvious or defend the indefensible. White House officials know they are losing the public debate on these issues and must scale back to what is possible and credible given America's economic circumstances -- or use brute force in Congress to pass unpopular, harmful and vast new programs.\n\nEven if he did use his congressional majorities to win these battles, the president would lose the war by slowing economic growth, only resulting in more political pain for himself and his party. Obama doesn't have any political problems that a couple of years of 4 percent GDP growth won't solve. But he has to want it, and he needs honest policies to achieve it. Now, though, he is on a course that terrifies his political handlers and his party's candidates.\n\nHAROLD FORD JR.\n\nChairman of the Democratic Leadership Council\n\nEvery president faces a time when poll numbers slide. It's easy to advise a president to ignore the numbers and plow ahead. It's not wise for a president to heed that advice blindly. Thankfully, President Obama knows that politics is about the art of the possible.\n\nObama is battling a stubborn recession, a Republican Congress hell-bent on defeating health reform and a resurgent Taliban in Afghanistan. When he returns to Washington the president should forge a consensus in Congress to pass what \"is possible\" on health reform, redouble his efforts to stimulate job creation, clearly articulate our mission objectives in Afghanistan, and redefine and revive energy and financial services reform.\n\nFirst he needs to win on health reform. Obama has been patient, committed and focused on leading Congress to a consensus. At his core, this president is a pragmatist. In the spirit of the late Sen. Ted Kennedy, Obama should work toward winning a compromise here before taking on new reform challenges.\n\nThe compromise should be built around insurance reform, such as prohibiting companies from denying coverage based on preexisting conditions, and guaranteeing coverage for every child in America. Such substantive health reform would put us firmly on path to solving the uninsured problem in this country when our economy gets back on track.\n\nED GILLESPIE\n\nCounselor to President George W. Bush\n\nBarack Obama faces a fundamental decision about the direction of his presidency: Try to muscle through with Democratic votes a much more liberal agenda than many of his voters expected of him, or seek more consensus-oriented policies that attract at least a slice of the House and Senate Republicans by sacrificing core liberal elements of his policies.\n\nIf he chooses the former, he risks spectacular failure or a victory that eliminates the \"postpartisan\" persona that is a critical component of his personal approval ratings. This would make it much more difficult to achieve future legislative goals, in the same way the rushed, forced passage of the stimulus bill has made his health-care policy harder to achieve. And once that critical attribute is lost, it's all but impossible to get back.\n\nTo pull his young presidency back from the brink, and protect his greatest asset, President Obama would be wise to tack back to the center and pull his congressional leadership with him. He can then return his focus to the central issue on which voters are looking to him for leadership -- turning our economy around.", "images": ["http://media3.washingtonpost.com/wp-srv/article/images/font_resize_large.gif", "http://media3.washingtonpost.com/wp-srv/article/images/font_resize_medium.gif", "http://media3.washingtonpost.com/wp-srv/article/images/font_resize_small.gif", "http://www.washingtonpost.com/wp-dyn/content/graphic/2008/07/25/GR2008072502521.gif", "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg"], "top_img": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.washingtonpost.com/wp-dyn/content/article/2009/08/28/AR2009082803158.html", "title": "Topic A: How Can President Obama Regain His Political Footing?", "meta_data": {"description": "With Obama losing ground, The Post asked experts how he could regain the initiative.", "DC.date.issued": "2009-08-30", "og": {"type": "article", "title": "Topic A: How Can President Obama Regain His Political Footing?", "url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/08/28/AR2009082803158.html", "image": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg"}, "canonical_url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/08/28/AR2009082803158.html", "profile_description": "With Obama losing ground, The Post asked experts how he could regain the initiative.", "profile_picture": "http://media3.washingtonpost.com/wp-srv/images/twp-50x50.jpg", "fb": {"app_id": 41245586762}}, "movies": [], "publish_date": 1251388800.0, "source": "http://www.washingtonpost.com", "summary": ""}