{"url": "https://people.com/tv/rhony-colombia-boat-ride-from-hell-exclusive/", "text": "Cast members of The Real Housewives of New York City are home safe after a tumultuous trip to Colombia, where they found themselves on a “boat ride from hell” that sources tell PEOPLE left them “crying out for their lives” when the ship’s anchor caught mid-trip and the vessel started taking on water.\n\nBravo is investigating the incident, which occurred during the show’s annual girls trip, the network told PEOPLE.\n\nGet push notifications with news, features and more.\n\nBethenny Frankel, Ramona Singer, Carole Radziwill, Luann de Lesseps, Sonja Morgan, Dorinda Medley and Tinsley Mortimer had traveled to the South American country earlier this month — the network’s cameras filming their getaway for RHONY‘s upcoming 10th season.\n\nThough the New York Housewives expected luxury, a source close to production says they experienced quite the opposite during their time in Colombia. The worst of it included a disastrous boat ride to Cartagena that was sold to the women as “a sun-soaked cruise on a 5-star yacht.”\n\n“The boat was old, beaten up and falling apart,” the insider says. “There were no amenities, no food, and a crew that didn’t know what they were doing. I mean, the anchor had to be sawed off before they made it home because it was so rusty and tangled. That’s how bad this was!”\n\nImage zoom Tinsley Mortimer, Sonja Morgan, Bethenny Frankel, Ramona Singer, Dorinda Medly, Luann de Lessepts, Carole Radziwill Patrick Ecclesine/Bravo\n\nThey didn’t want to board the ship to ho home initially, “complaining right off the bat.” But production “pushed them to continue because they knew it would make good TV.”\n\nThings got worse when the boat finally left the dock. Turbulent seas caused several people to get sick. And when the boat’s anchor caught mid-ride, the reality stars were left terrified.\n\n“It was a disaster,” the source said. “The vessel was so shaky and the waters so rocky that the women got really sick. Things began flying off the boat. The engine caught on fire. None of the crew spoke English. None of the women felt safe. Carole got sick and was throwing up overboard. The others were all screaming for help. They were all scared out of the minds. They thought they were going to die out there.”\n\nImage zoom Ramona Singer and Sonja Morgan Heidi Gutman/Bravo\n\nA second source close to the cast calls it “the boat ride from hell,” telling PEOPLE, “these women survived a horror show.”\n\n“They were soaked to the bone, scared s——-, and sick by the end,” the insider explains. “They were crying out for their lives. When smoke started coming form the ship, they thought it was over.”\n\nEventually, a second boat came and recused them and the women were able to continue on with their vacation, but “the experience really put a damper on the rest of the trip,” the production source says. “The whole thing was a mess.”\n\n“If anything the experience brought them together,” the cast source adds. “Any feuds that have been carrying through the season were thrown aside. They’re furious with production for putting them in that situation to begin with.”\n\nPage Six was first to report the incident.\n\nRELATED VIDEO: Bethenny Frankel Talks Real Housewives of New York City and Luann De Lesseps Returning After Arrest\n\nA Bravo spokesperson tells PEOPLE in a statement, “The Real Housewives of New York City cast was recently on a boat in South America and encountered turbulent water. Thankfully, everyone is fine and was able to continue their vacation as planned. The safety of our cast and crew is paramount and, to that end, we are doing a full investigation.”\n\nMeanwhile, that’s not all that went down in Colombia. According to sources, one cast member found herself sick with a parasite and “had to wear a diaper.” Singer was also spotted in a wheelchair at the airport.\n\n“It’s going to make great TV,” a source says.\n\nThe Real Housewives of New York City is expected to return this spring on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Fnup_176320_0158.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/rhony-colombia-boat-ride-from-hell-exclusive/", "title": "RHONY Cast 'Thought They Were Going to Die' During Dangerous Boat Trip on Colombian Getaway", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bethenny Frankel,Carole Radziwill,Luann de Lesseps,Ramona Singer,Real Housewives,Real Housewives of New York City,Sonja Morgan,Tinsley Mortimer,TV", "news_keywords": "Bethenny Frankel,Carole Radziwill,Luann de Lesseps,Ramona Singer,Real Housewives,Real Housewives of New York City,Sonja Morgan,Tinsley Mortimer,TV", "description": "Cast members of The Real Housewives of New York City are home safe after a tumultuous trip to Colombia, which included a boat ride sources tell PEOPLE left them \"crying out for their lives\"", "og": {"title": "RHONY Cast 'Thought They Were Going to Die' During Dangerous Boat Trip on Colombian Getaway", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/rhony-colombia-boat-ride-from-hell-exclusive/", "description": "Cast members of&nbsp;The Real Housewives of New York City&nbsp;are home safe after a tumultuous trip to Colombia, where they found themselves on a “boat ride&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/rhony-colombia-boat-ride-from-hell-exclusive/", "description": "Cast members of The Real Housewives of New York City are home safe after a tumultuous trip to Colombia, which included a boat ride sources tell PEOPLE left them \"crying out for their lives\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/rhony-colombia-boat-ride-from-hell-exclusive/", "title": "RHONY Cast 'Thought They Were Going to Die' During Dangerous Boat Trip on Colombian Getaway", "description": "Cast members of The Real Housewives of New York City are home safe after a tumultuous trip to Colombia, which included a boat ride sources tell PEOPLE left them \"crying out for their lives\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2F640033-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}