{"url": "https://people.com/tv/sterling-k-brown-2017-emmy-awards-drama-actor-this-is-us/", "text": "Sterling K. Brown won the Emmy for outstanding lead actor in a drama series at the 2017 Emmys on Sunday night.\n\nThe This Is Us star won his second Emmy, much to the excitement of the crowd.\n\nGet push notifications with news, features and more.\n\nBrown paid tribute to his fellow nominees during his acceptance speech, saying he was a fan of all of them. “Before anything like this happened for your boy, I was a fan first, last and always a fan. So to my fellow nominees, I’m a fan. I love y’all,” Brown said.\n\nWith the Emmy in his hand, Brown was blown away by those who held it before him. “This joint right here, like Walter White held this joint here. Dick Whitman held this joint. I may have lost some of y’all but you know, Google it. And 19 years ago Detective Frank Pembleton held this joint, as impeccably played by Andre Braugher,” he continued.\n\n“I want to thank my cast, Milo [Ventimiglia], Mandy [Moore], Justin [Hartley], Chrissy [Metz]: you are the best white TV family that a brother has ever had. Better than Mr. Drummond, better than the white folks that raised Webster.”\n\nBrown had so much to say that the music began playing during his speech and his microphone was eventually turned down, which was met with boos by the audience.\n\nDon’t miss People and EW’s This Is Us LIVE viewing party! Go to People.com and EW.com during the premiere episode on NBC, Tuesday, Sept. 26 at 9 p.m. ET for our experts’ insight and the can’t-miss social buzz. Plus, we’ll bring you exclusive access to the This Is Us season 2 premiere party – with all the scoop from your favorite cast.\n\nAfterwards, in the press room, Brown was able to finish his speech:\n\n“I wanted to thank our writers. A show doesn’t get seven acting nominations without some impeccable, beautiful, thoughtful writing. You guys are our life’s blood, so I want to thank you so much. To our producers and directors, in particular, John Requa, Glenn Ficarra, and the crazy cool Ken Olin. I thank you for your guidance and friendship. And I wanted to thank Dan Fogelman — he is the Hebrew hammer with which our house was built. He makes me laugh and cry in equal parts and keeps me coming back for more, and in his own little small special way. He’s not trying to make America great again, he’s trying to make it the best that it’s ever been and I love him for taking me on this journey. And to my wife, I can’t believe they cut me off before I got to thank my wife, Ryan Michelle Bathe. You’re everything. You make my life worth living. You gave me two of the most beautiful things that God has ever put on this planet: my sons Andrew Jason Sterling Brown and Amaré Michael Ryan Christian Brown. Your daddy loves you with the strength of a thousand suns. I’ll see you Monday after work.”\n\nWATCH: ‘This Is Us’ Stars Open up about Adjusting to the Show’s Mega Success\n\nWatch the full episode of People & Entertainment Weekly Red Carpet Live, streaming now on PeopleTV. Go to People.com/peopletv, or download the app on your favorite streaming device.\n\nThe actor faced stiff competition in the category as he was up against both fan favorites and screen legends.\n\nBrown’s costar Milo Ventimiglia also earned a nod, while Kevin Spacey (House of Cards) and Anthony Hopkins (Westworld) were nominated for their respective dramas. The Americans’ Matthew Rhys, Better Call Saul‘s Bob Odenkirk and Ray Donovan‘s Liev Schreiber rounded out the category.\n\nWATCH: Bob Odenkirk Looks Back on the Waiter Job Where He Couldn’t Stop Scaring Customers\n\nFor full Emmys coverage, click here.\n\nThe 69th Primetime Emmy Awards, hosted by Stephen Colbert, aired live on CBS from the Microsoft Theater in Los Angeles.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown4.jpg", "keywords": [], "authors": ["Ale Russian", "Brianne Tracy"], "canonical_link": "https://people.com/tv/sterling-k-brown-2017-emmy-awards-drama-actor-this-is-us/", "title": "Sterling K. Brown Played Off at the Emmys: His Full Speech", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Awards Shows,Emmy Awards,News,Sterling K. Brown,TV,TV Watch", "news_keywords": "Awards Shows,Emmy Awards,News,Sterling K. Brown,TV,TV Watch", "description": "Sterling K. Brown won his second Emmy, much to the excitement of the crowd", "og": {"title": "Sterling K. Brown Played Off at the Emmys: His Full Speech", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/sterling-k-brown-2017-emmy-awards-drama-actor-this-is-us/", "description": "Sterling K. Brown won the Emmy for outstanding lead actor in a drama series at the 2017 Emmys on Sunday night. The This Is Us&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown4.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/sterling-k-brown-2017-emmy-awards-drama-actor-this-is-us/", "description": "Sterling K. Brown won his second Emmy, much to the excitement of the crowd", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown4.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/sterling-k-brown-2017-emmy-awards-drama-actor-this-is-us/", "title": "Sterling K. Brown Played Off at the Emmys: His Full Speech", "description": "Sterling K. Brown won his second Emmy, much to the excitement of the crowd", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown4.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}