{"url": "https://abcnews.go.com/GMA/story?id=126760&page=1", "text": "L O S A N G E L E S, Aug. 17, 2001 -- Penélope Cruz has been acting for years, but she's never been the center of the American spotlight until now. This week she showed up at her new film's premiere with the oh-so recently divorced Tom Cruise.\n\nBut few Hollywood watchers were discussing the film; Cruz won more attention for her escort than the screening of Captain Corelli's Mandolin.\n\nIt was the first public \"event\" for Cruz and her new boyfriend, whose headline-making divorce from actress Nicole Kidman was barely a week old.\n\nInternational Beauty Goes Hollywood\n\nCruz, 27, now the \"it girl\" of the moment, told ABCNEWS' Good Morning America she was happy to share the spotlight with Cruise at the premiere.\n\n\"He came and shared it with me,\" the Spanish actress said of her opening night. \"It was special for me that he wanted to share it with me that way.\"\n\nThe exotic beauty, who played Johnny Depp's drug-addicted wife in the film Blow earlier this year, landed the role of Nicolas Cage's love interest in the romance Captain Corelli's Mandolin.\n\nThere were reports she was involved with Cage early last year, but Cruz said the rumors were untrue. At the time, Cage was still married to actress Patricia Arquette. He's now linked with Lisa Marie Presley.\n\nPrivacy Over Popularity\n\nCruz, a huge star in her homeland, said she is happy personally and professionally now, even though she wants to keep at least some of her private life, well, private.\n\nIt's been reported, and substantiated by Cruise's publicist (both Cruise and Cruz are clients of the same public relations firm) that the actors have been seeing each other for about a month. Their first known date was at the trendy Beverly Hills restaurant Spago.\n\nThey shot some passionate scenes for the upcoming film Vanilla Sky last November, but they say they weren't involved at that time, when Cruise was still married to Kidman.\n\n\"There's nothing to hide and it's a good thing,\" Cruz said of their relationship. She calls Cruise the most generous person she has ever met.\n\nAnd though she said Cruise \"has a huge heart,\" she didn't elaborate on their romance.\n\n\"The stuff that is personal is personal, like the situation now there is nothing to hide,\" Cruz said. \"Everything that had to be said has been said. We are not going to give details of it, but I think people understand that.\"\n\nIn her latest film, the actress must choose between Cage's character and another good-looking guy in the middle of World War II in her Greek village.\n\nCruz even spends her time offscreen proving she's not just another pretty face. She does charity work at Mother Teresa's missions in Calcutta, India, and speaks for a foundation to save abandoned children there.\n\n\"I talk about how the lives of these girls have changed through the help of all of the people in Spain who have helped us,\" Cruz said.\n\nThe actress said she has seen small babies being abandoned on the streets of India. \"They were in the street and they had nothing and no one,\" she said. \"We're getting a lot of help, but there is still more needed.\"", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://abcnews.go.com/GMA/null"], "top_img": "https://abcnews.go.com/GMA/null", "keywords": [], "authors": ["Abc News", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/GMA/story?id=126760&page=1", "title": "Penelope Cruz Talks About Tom Cruise", "meta_data": {"keywords": "Penelope Cruz, Captain Corelli's Mandolin, Tom Cruise, Nicholas Cage, actress", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Penelope Cruz Talks About Tom Cruise", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/GMA/story?id=126760&page=1", "title": "Penelope Cruz Talks About Tom Cruise", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2006-01-06T11:44:33Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,126760", "ipad": "abcnewsipad://link/story,126760", "googleplay": "https://abcnews.go.com/GMA/story?id=126760&page=1"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Penelope Cruz Talks About Tom Cruise", "url": "https://abcnews.go.com/GMA/story?id=126760&page=1", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,126760", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,126760", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/GMA/story?id=126760&page=1", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/GMA/story?id=126760&page=1"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}