{"url": "https://usefullyuselessinfo.wordpress.com/tag/amy-poehler/", "text": "And now on to Season 27; living proof of the old saying “Comedy Equals Tragedy Plus Time”…in this case, FAR TOO LITERALLY . Between 9/11 happening before that season’s premiere, an anthrax attack at 30 Rock in the middle of a show week, overall chaos in both the City and the Country, and Ryan Adams as a musical guest; this was one of the more mentally tough years for the cast to get through—but get through it they did, and they were able to make the most out of some dark situations and rally on both New York and America at the same time….or at least that seemed to be the case in the first half of the season. By the time 2002 rolled around, the show was all but back to some version of “Normal” (and BTW, I’m going to be throwing that word around a LOT today, So get comfy, Kids!); everybody hit the high marks, and even the weakest episodes of that year had strong points that made us forget just how weak the episodes were………And THEN Will Ferrell up and quit–rightfully so, he was becoming a big fish in a small pond by that time. So looking back on the season, maybe that’s why everybody fired on all cylinders; knowing that their Alpha Star was about to exit, they had to get the most mileage they could before they ventured into uncharted territory. That said, back when I was a soon-to-be-graduating High School Senior, I thought this was the apex of comedy (keeping in mind, I wouldn’t get cable for Another 7 years…I lived in the sticks, so sue me!). Let’s see how right and how Wrong I was in some places.\n\nLooking at how this was formatted, this is gonna be similar to the Season 26 recap; a number of mini-lists and mini-critiques to go with them. However, since these thoughts were posted at the end of the season, this does have the benefit of speaking on behalf of the ENTIRE Season 27, not just the first half. Also, this was the year—as an episode reviewer—where I started to get a little “Gimmicky” with what I wrote…still didn’t quite reach maturity as of yet, but at least it’s not as vague as the previous two “SNLenium” pieces. So with that…\n\nANNOUNCER: From Television city in Hollywood, it’s the “Golden Lorne Awards” And now, ladies and gentlemen… “THE DOC!” Thank you, welcome to the “Golden Lorne Awards”! Where we cheer for the favorites, and piss on the rest. Our first award is… Performer (Cast member) of the year: Bronze Doumanian: Daryll Hammond\n\nSilver Ebersol: Jimmy Fallon\n\nGolden Lorne: WILL FERRELL\n\nDARRELL HAMMOND: Now HERE’S Somebody I should’ve spoken about at great lengths by now. Up until Kenan Thompson, he was the longest serving cast member ever—you can’t deny that wherever there was a hole that needed to be filled on the show, especially that of the “Middle-aged” variety, Hammond was there to plug it up………and yes, I realize I could be phrasing this better. But the point is that among those who can be considered “Glue” or “Utility” or “Swiss Army” type cast members, Hammond probably deserves a little more recognition for his efforts these days…or at least, more recognition for his first 7 years on the show; anything he did after that reached overkill by the time he eventually left in 2009, save for a few sporadic cameos here and there over the years, and then ultimately permanently filling in for Don Pardo in 2014 (because remember, Pardo can never truly be “Replaced”). As far as this season goes; this was Hammond at his peak—from a memorable (albeit questionable) commentary as Jesse Jackson in the season premiere, to his reliable stable of impressions; Clinton, Koppel, Chris Matthews, Dan Rather, 90% of Bush Jr’s Cabinet (including a much improved Dick Cheney); even adding a few new ones this year like George Lucas and Geraldo Rivera. Say what you will about how dull he wound up being later on, the guy was (and in the case of him announcing the show, Still Is) a team player.\n\nJIMMY FALLON: I don’t really have too much to add here; Like I said in the last piece, he & Will Ferrell probably should’ve been neck & neck in terms of popularity; Ferrell being the established star, Fallon being the rising star thanks to “Update”. Season 27 saw a slight fade in the halo effect; Fallon was still popular, and he also took a chance at some non-Update roles; but by now, the audience started to catch on a little that MAYBE Fallon was a little too immature in some places…ESPECIALLY whenever he teamed up with Horatio Sanz. Then again, he remained someone the 18 to 49 demographic was looking for; young, energetic, (mostly) funny, and (if you’re among the female audience) easy on the eyes. Regardless, this was the point when Fallon Plateaued—or at least started to. On the flipside, “Jarrett’s Room” started to gain a significant following thanks to the young crowd watching.\n\nWILL FERRELL: Considering this was his last year as a cast member, him being at the top of the list was pretty much a foregone conclusion…but looking back on it now, did Ferrell truly “Earn” it, or was he just going through Senioritis by the time the season ended? Save for his last show where he pulled off the rare task of appearing in 95% the episode–even bit parts with only one or two lines—I’m gonna say (*CONTROVERSIAL OPINION ALERT*) that he probably stayed on a year longer than he should’ve in hindsight; but to his credit, at least he still left just in time…unlike Hammond who practically took up residency there into the decade. Still, Ferrell treated the year just like any other; turning in performances that bordered on the absurd, while at the same time maintaining an aura of professionalism. You’ll see a number of sketches further down that showcase just how fearless and willing Ferrell was to play even the most minor of roles, and we’ll talk a little more about his years on the show altogether a little later; as for this season alone, he was one of the very few cast members to leave on top—all the while, he still remained just one piece of an already strong ensemble…Of course, by the time the next season came around, the cast would realize just how important that missing piece would be. Now I’d like to speak a little about Ferrell over his 7 years altogether that (hopefully) other people haven’t said already. I don’t think it goes beyond the realms of hyperbole to say that Will Ferrell did to the show in the mid-90s what Eddie Murphy did for the show in the Early 80s. He not only helped save the show; but more importantly, he made it worth talking about again—of course, the biggest difference between Ferrell and Murphy is that Murphy practically did it single-handedly give or take a Piscopo assist, Ferrell was just one really talented member of a larger team of talent. You know that old saying about “The Company you Keep”? Ferrell was very fortunate to be surrounded by a lot of good company during his run as a cast member; and because everybody played so well off of each other, that could explain why Ferrell excelled so much—everybody else was giving off the energy, Ferrell was practically feasting off of it so that he could produce his own.\n\nBest New Guy: SETH MEYERS\n\nTo all of the fans of Amy Poehler All over the World, my sincerest apologies. I clearly didn’t know better back then…Not that Seth didn’t at least try to make an impact in his first year at bat (I still think “Lil Sleuths” should’ve been a bigger thing than it wound up being), but he was not and will never be the same caliber of talent that longtime partner in crime Amy was when she started (Hell, she got promoted mid-way through the season); though to be fair, he eventually forged his own path, and whether you love him or hate him, at least he was durable for most of his run on the show. Quite honestly, back then I thought he was gonna be Fallon 2.0 when he first started—sure enough, he would be in at least One way much later on—he seemed likable, had a lot of energy, HE DIDN’T GIGGLE, I thought he had all the earmarks of a decent future utility player…then again, what do they say about books by their cover? For the most part, Seth at least put in more effort than fellow newbie Dean Edwards (though not as much as Jeff Richards did); he just didn’t realize that his talents were best left behind the scenes yet.\n\nThe “Tarnished Lorne” for worst cast member: CHRIS KATTAN\n\nYeah, sorry to do this again, but you can take the Guy out of the Spaz, but you can’t take the Spaz out of the guy…To make matters worse, thanks to Amy Poehler joining the cast, this meant the beginning of the “White Trash Couple” sketches as well as the beginning of him wearing even shorter shorts than Mango…Speaking of which; on the plus side, after that season’s finale, we would Never See Mango Again…until Kattan’s last episode the next season when he briefly popped up in Update. I already made my thoughts clear all over the place, let’s not overstay our welcome…\n\n\n\nHost of the year: Bronze Doumanian: Jon Stewart\n\nSilver Ebersol: Ellen Degeneres\n\nGolden Lorne: IAN McKELLEN\n\nJON STEWART: During a year like this, it only seems fitting for one of the Tri-State area’s elder statesmen to show up; and especially after his own post 9/11 Daily Show monologue where he transformed the show from simple comedy show to cold splash of water in our faces (sometimes), perhaps it was time for Stewart to regain his own sense of “Normal”……That being said, maybe the inclusion here was more because it was the sight of a comforting figure among the young demographic being on the show, and less for anything he actually did on the episode—The monologue here was Stewart in his natural element—almost a pre-requisite; but for the rest of the episode, he either played versions of “Himself”, or he attempted to act—and considering Stewart had his own qualms about acting in the past, maybe he just wanted to get whatever was left out of his system while at the same time helping to rally New York. Still though, it was nice to see him outside of a cable subscription for one night.\n\nELLEN DEGENERES: If SNL can do something consistent most of the time, it’s put on a good Christmas show—Ellen hosted this season’s show, fresh off of hosting an Emmy Awards that was pre-empted not once, but twice by varying atrocities in the world, and she handled the task like a champ…the same can not only be said for her appearance here, but she is also one of a seemingly endless amount of people that I wish hosted a 2nd time—Hell, about half of the hosts this year I wish made a 2nd appearance…note to self, a list on THAT subject in the future. In this season’s quest for stability, Ellen fit in deftly—From an appearance with The Culps (unavailable because, Screw You, BMI/ASCAP!), to riffing on “Alias” (Sort Of), even trying to be the put-upon father’s girlfriend to Seth & Amy; she tops her appearance by throwing shade at those who criticized her (then) recent coming out, but doing so in a way that was classic Ellen—kindhearted, but with a dash of needling. Of course, even if she didn’t do well in the eyes of others, at least this was the show with the legendary “Narrator that Ruined Christmas” short.\n\nIAN MCKELLEN: Full disclosure; even though McKellen is one of the Gods of acting, the idea of him winning (or even being nominated for) the Oscar for ANY of his appearances in the LOTR/Hobbit movies would’ve made as much sense as Alec Guinness winning as Obi-Wan Kenobi; Cool for the fan boys, but baffling for everybody else in the real world. One award McKellen SHOULD’VE won though was an Emmy for his hosting gig; exceeding not just the expectation that he could do comedy, but the fact that a show that’s notorious for having “Young and Hip” hosts took a rather sizable chance here—Sure, they COULD’VE got Elijah Wood to host at this time (though that wouldn’t happen until Xmas ’03), or Sean Astin, or Orlando Bloom, or Liv Tyler, or Viggo Mortensen or anybody else not carrying an AARP card (though Christopher Lee COULD count retroactively). Nevertheless, Gandalf the Grey poured on the charm big time here; particularly in Two gems I’ve long forgotten about until now; First, “Hot Air Balloon Theater”; it’s about as ridiculous as it sounds, but McKellen’s gravitas makes it work. Second; “One Man Show”—if not for how chameleon-esque McKellen slips into every role, but also for the fact that there’s a stark difference between Live Theater and Live TV, and all the quick changes may be handled with all the grace of a Rhino, but McKellen at least tries to upgrade it to a gazelle. Still another in a long line of people who should’ve hosted more than once.\n\nThe “Tarnished Lorne” for worst host: JONNY MOSLEY\n\nAs is the case with 99.9999999999999999999999% of the Celebrities I tend to snipe at around here, I’m certain that they are perfectly good people in real life and do not deserve such scorn. Such is the case with Olympic hopeful Jonny Mosely; who certainly had the energy to host, but he also had neither the charisma nor the acting chops to pull off the job 100%…That, and I have a feeling he was asked to host the show at the very last minute, so perhaps his ill-preparedness wasn’t entirely his fault. IIRC, we had no idea who would be hosting this show until Well after the Winter Olympics that year; and in an era where Googling someone was still primitive, there was a lot of “Uh….” And “Who…?” among the crowd. I mean, if you’re gonna get a Winter Olympian to host, at least go for someone who had a little more popularity back then…like Michelle Kwan or Apollo Anton Ohno…or those Canadian skaters that got screwed by the judges—unfortunately, I think the show was still trying to learn its lesson about athlete hosts after Nancy Kerrigan & George Foreman c1994. SNL clearly wanted to cater to the “Brahs”…probably a little too hard that week. Again, I’m sure Mosely is a good guy, but with few exceptions, there’s a good reason why athletes should stay away from hosting the show. One MAJOR plus side, at least this episode welcomed back Chris Parnell with open arms.\n\nSketch of the year: Bronze Doumanian: “Christmas Kangaroo” (Hugh Jackman)\n\nSilver Ebersol: “Happy Birthday Rock Opera” (Jack Black)\n\nGolden Lorne: The “Update” where Ian McKellen Kisses Jimmy (IAN McKELLEN)\n\nCHRISTMAS KANGAROO: I mentioned this one a long time ago (See: Late July 2016), but it stands to reason that in a season tinged with a National Tragedy, the audience was hungry for some sort of catharsis that would help them forget about it (at least for a little while) and that everything is gonna be OK…though watching Will Ferrell getting raped by a Kangaroo would actually be far from the radar, at this point in life, just about anything considered “outrageous” could also be considered a welcome relief from the doom & gloom.\n\nHAPPY BIRTHDAY ROCK OPERA: From the moment Ferrell stepped out on stage with a ridiculous bowl-head haircut, I had a feeling we were in for something insane…and Ferrell isn’t even the main focus of the sketch. No, this moment belongs lock, stock and barrel to Jack Black; who takes the common and dull “Happy Birthday” song and transforms it into a medieval mini-rock opera/showstopping number. So amazing was this performance to me that To this day, I send the video of the sketch to Facebook Friends…if that doesn’t explain the sketch’s lasting impact, I don’t know what will.\n\nUPDATE (3/23/2002): And once again, we use “Update” as a way to cheat our way out of a list; but to give credit where credit is due, I don’t think the ENTIRE Update was worthy of being included, just this moment when McKellen (dressed as Dame Maggie Smith) planted one on Jimmy, which back then was more of a Shock and a Surprise, unlike later years in the show where such a thing becomes a crutch. The kiss leads to one of the show’s best quips afterward from Fallon, and it still turned out to be a very “Spur of the moment” thing that a lot of the viewers enjoyed………But let’s be honest, we can all agree that an Update commentary should not count as a sketch; and that the REAL Choice for sketch of the year should be obvious…\n\nI mentioned this one on the 15th anniversary of 9/11, so forgive me for plucking a few talking points from that—In short, the wound was still fresh in the people’s minds; and by this point in the proceedings, we were all looking for something to truly laugh about. And while the previous week’s show with Witherspoon felt like a comforting sort of “Everything’s gonna be OK” moment, This sketch the week after was more like a sub-zero splash of water back to normal…at least for a little while. The ironic part of the whole thing is that the short shorts are not 100% what makes this a classic, but rather the matter-of-fact way Ferrell plays it off as though it was an average Monday, followed by a Pseudo-patriotic rhetoric where the crowd is on his side for just a nanosecond…………Only for Ferrell’s character to piss it away with yet another inappropriate bend. If EVER there was a case of making the most of a Dark situation, Will Ferrell in a Star-Spangled thong should be the wood carved drawing in an Encyclopedia somewhere.\n\n\n\nThe “Tarnished Lorne” for Worst Sketch: THE GIRL WITH NO GAYDAR\n\nThis is now the THIRD Time I’ve had to say FUCK THIS SKETCH! On the flipside, This is also the umpteenth time that I have to remind you that I’m “Not Gay, but Supportive”, and this is also the eleventy-billionth time I have to push the JERRY BUTTON. But as a reminder, I don’t hate the sketches because of the homosexual themes; I hate them because not only is there exactly one joke to be seen in each of these pieces, but the fact that they saw it fit to repeat that same joke over and over, over a span of 4 Sketches. This was a sketch that was, at best, supposed to have been done just one time; yet for whatever reason, it just stuck around. Bad sketch, bad concept, run into the ground worse than a tapped out oil derrick. Moving On…\n\n\n\nShow of the year: Bronze Doumanian: Gwenith Paltrow/Ryan Adams\n\nSilver Ebersol: Reese Witherspoon/Alicia Keys\n\nGolden Lorne: JACK BLACK/THE STROKES\n\nThis section is gonna be a little tricky since I’m talking about FULL Episodes in small doses, but I’m gonna try my best.\n\nPALTROW/ADAMS: Skeevy MG aside (Even if he is singing a rally cry for New York City), this episode was a formative step in the show feeling “Normal” again—then again, a lot of the people who hosted this year were hosting veterans; so naturally, having familiar faces on was a plus. In this case, It had a friend of the show in Ms. Goop, and it also had the usual stable of good moments and recurring characters; including the Boston Teens, a sequel to the legendary “I DRIVE A DODGE STRATUS!” sketch, Horatio Sanz’s Not!Dirty cartoonist Jasper Hahn, a TV Funhouse that used Pat Robertson as a Punching bag; hell, even Mango…Frickin’ MANGO for God’s sake (unavailable due to rampant use of a song from “Grease”), was a welcome relief to watch after wondering how many gas masks we have to wear on alternate days of the week…Of course, that was nearly 20 years ago—and looking back at some of the sketches, time hasn’t exactly been friendly to a number of them…Especially that TV Funhouse bit that not only focuses on Stem Cells, but was also co-written by Louis CK…make up your own interpretation there. In other words, were this show to air in any other year before or since, this would actually be par for the course—but NOT the top 3.\n\nWITHERSPOON/KEYS: Whereas Paltrow was a step in feeling “Normal” again, The Season Premiere–18 days after the events of 9/11—proved to be one of the show’s ultimate tests; namely “Can the show be Funny?” To quote one of my favorite Simpsons quotes “Short answer; yes with an if, Long answer No, with a But”. As a long standing New York based Television institution, having the show make a response of some kind was a foregone conclusion—especially since all the other ones; Dave, Conan, Jon Stewart et. al. already did so…Given the circumstances, SNL HAD To do it, and they did it with equal parts dignity, civility and jokes about fish genitals. Yeah, if things were dour for 100% of the episode, then there would be a problem—the country had to laugh again, and dammit they tried (even if it meant resorting to using a farting baby to do so)! Of course, no matter how much humor they tried to spoon feed us, all of the sketches paled in comparison to the somber opening, where a Then Sane Rudy Giuliani and various members of the NYPD & FDNY stand solemnly while the indispensable Paul Simon performs one of the city’s unofficial anthems in the form of “The Boxer”…which, now that I think of it is KINDA Questionable. Yes, the song is very much about the grit and the guts of New York and its residents (especially back then), but does a disaster of 9/11’s magnitude really warrant a mention of the “come-ons from the whores of 7th Avenue”? That, and those close ups of the Mayor seems a little creepy in hindsight. Nevertheless, despite how weak the actual comedy was in hindsight, this was still an important episode for the show to do—and given the gravity/nature of everything, this show should probably be #1 by default…This is despite discussing the Inter-species ramifications of “The Little Mermaid” and the joys of raising a farting baby. But at least Hammond’s Jesse Jackson was there to talk about the Taliban Banana.\n\nBLACK/STROKES: In hindsight, this is probably NOT the show of the year even by the lightest of standards (Like I said; Witherspoon’s show is a given for this spot, but This show should take Paltrow’s spot and Ian McKellen’s show should take 2nd); to me, a high school senior looking for some relief after hearing about some friends of friends and family losing their lives in a major attack, this show was the moment where things felt “Normal” once again. Yes, there was still a lot of post 9/11 tension in the air; but after 4 months into the season it was time to put 2001 behind us and direct our attention to 2002. With that said, there were a lot of good things going for this episode. First, Fallon gives us his first LFNY—don’t know why, but I just felt very happy for him when he did that, especially after being on for 4 years by this point. Second, the majestic energy of Black himself pretty much carrying even the dumbest of sketches. Third, and most importantly, this appearance helped us both remember AND forget his awkward 1998 “Special Guest” shot alongside partner Kyle Gass as Tenacious D; “Remember” because when I saw this episode and subsequent Update commentary, my immediate reaction was OH SHIT, HE’S THAT GUY?! (In all seriousness, I probably didn’t even realize who JB was in ’98). But then “Forget”, because by that point in the episode we saw a completely different Jack Black than the one we saw 4 years earlier; A more confident Jack, a more captivating one, one that could command attention the way hair metal bands did in the 80s. Realizing this was the same person as the one who disappointed us in ’98 almost felt akin to finding out that Clark Kent is Superman to the average passer-by. I gained a newfound respect for Black after this show, and He too is one that I wish hosted more frequently (though unlike others I’ve mentioned so far, he at least hosted 3 times). Altogether, this was simply a “Feel Good” show, so much so that when we come back from our Next break, this will be the next Retro Review that I will do, there’s simply too much to talk about in just one paragraph.\n\nSo concludes the SNLenium series…mostly because I didn’t write a year in review at any point during Season 28 (my last “Original” year as an episode reviewer), but also because it’s probably best that this was a Trilogy anyway, you know how movies with four parts have turned out historically.\n\nNEXT TIME: We go into the 80s for the next chapter in our “Saturday Night Soundtrack” series.", "images": ["https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_mosley.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_fallon.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_mckellen.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_stewart.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_UPDATE.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_COVER1.jpg?w=820&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_SMURFETTE.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_sudiekis.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_barkley.jpg?w=620", "https://s0.wp.com/i/blank.jpg", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_bush.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_ashlee.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_birthday.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_witherspoon.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_timberlake.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_pole.jpg?w=399&h=299", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_mono.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2017/11/murphy_update.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_homebase.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_black.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_update.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2016/06/base.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_joe.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_titles.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_cover.png?w=600&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_career.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_wuwt.jpg?w=620", "https://pixel.wp.com/b.gif?v=noscript", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_debbie.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_riggle.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_PHIL.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_christina.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_bud.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_hamm.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_bush.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_cover.jpg?w=700&h=250&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_update.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_cover2.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_bow.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_putnam.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_now.png?w=443&h=443", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_il.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_ferrell.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_meyers.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_busey.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_rose.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_IRAQ.jpg?w=377&h=283", "https://usefullyuselessinfo.files.wordpress.com/2018/11/worsts_fish.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_trash.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_CHENEY.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_cover2.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_fellows.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/02/season26_kattan.jpg?w=325&h=391", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_novel.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_COVER2.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_ROBOT.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_ross.jpg?w=396&h=297", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_mono.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_white.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_armisenforte.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_cover1.jpg?w=820&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_NRA.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_MONO.jpg?w=429&h=322", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_NUTRIQUICK.jpg?w=419&h=314", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_cover2.png?w=797&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_finale.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_lovah.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_maggie.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_hammond.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/12/s30_cover.jpg?w=600&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_degeneres.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_cover.jpg?w=550&h=312&crop=1", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_paltrow.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/04/black_virgin.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_HANIBAL.jpg?w=439&h=329", "https://usefullyuselessinfo.files.wordpress.com/2017/11/murphy_gaydar.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_kenan.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/gordon_update.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s35_jgl.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/03/season27_ferrell.jpg?w=620", "https://usefullyuselessinfo.files.wordpress.com/2018/12/DAMON_SULLY.jpg?w=455&h=341", "https://usefullyuselessinfo.files.wordpress.com/2016/12/smigel_friends.png?w=620", "https://usefullyuselessinfo.files.wordpress.com/2019/11/s29_roddick.jpg?w=620"], "top_img": "https://s0.wp.com/i/blank.jpg", "keywords": [], "authors": [], "canonical_link": "https://usefullyuselessinfo.wordpress.com/tag/amy-poehler/", "title": "Amy Poehler – Usefully Useless Information", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress.com", "og": {"type": "website", "title": "Amy Poehler – Usefully Useless Information", "url": "https://usefullyuselessinfo.wordpress.com/tag/amy-poehler/", "site_name": "Usefully Useless Information", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "twitter": {"creator": "@TelehellPodcast", "site": "@TelehellPodcast"}, "fb": {"app_id": 249643311490}, "theme-color": "#f0f0f0", "application-name": "Usefully Useless Information", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Home of S.O.S.N.L & Making sense out of aboslutely nothing since 2016", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s1.wp.com/i/favicon.ico", "description": "Posts about Amy Poehler written by Usefully Useless Info"}, "movies": ["https://www.youtube.com/embed/Gvr0YNJwE0c?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/3mLsU46h8IA?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": null, "source": "https://usefullyuselessinfo.wordpress.com", "summary": ""}