{"url": "https://variety.com/2017/tv/news/american-horror-story-recap-season-7-episode-2-dont-be-afraid-of-the-dark-ahs-cult-1202552659/", "text": "SPOILER ALERT: Do not read on unless you’ve seen Season 7, episode 2 of “American Horror Story,” titled “Don’t Be Afraid of the Dark,” which aired on Sept. 12.\n\nThe premiere of “American Horror Story: Cult” found Ally (Sarah Paulson) to be, well, a mess after the election. As Donald Trump is voted into office, her old phobias rear their ugly heads once again, but in the second episode of the season, “Don’t Be Afraid of the Dark,” it only gets much, much worse. In fact, her fears become fatal in the last shot of the episode, one of the most unsettling scenes yet.\n\nBut first, we pick up where we left off — with Ally in bed with one of the dreaded clowns. She screams and runs for Ivy (Alison Pill), who rushes to protect her and is as sweet and patient as ever. When she finds no such clown in the bedroom, however, despite Ally’s protests, Ivy admits again that Ally’s anxiety has taken its toll on her. Ally finally resigns to her state, saying, “I think there might be something wrong with me.” (But hey: Just because she’s paranoid, it doesn’t mean someone isn’t out to get her.)\n\nMeanwhile, we see that Kai’s (Evan Peters) nefarious plans from the last episode have been working out swimmingly for him. After he provoked a band of construction workers by yelling racial slurs at them and chucking over a condom full of his urine, they unleashed a beatdown on him… while someone filmed on a cell phone nearby. Now it’s a local news story, and of course it takes a political turn: some of the construction workers have been taken into the custody of ICE. In announcing his run for city council — a seat that was vacated by the murder of councilman Chang — he quotes Trump’s “rapists and criminals” line, yelling, “Look at my face, Michigan!”\n\nSpeaking of the Changs, the Mayfair-Richards already have new neighbors. After a rather creepy scene where Winter (Billie Lourd) engages in the most serious pinky swear ever with Oz, vowing to take his fear for him, she allows him to go next door to play with the new residents. Ally and Ivy get home and immediately freak out over this (how have they not fired Winter yet? Seriously?) and rush over to find Oz playing with bees. Yes, in a blatant reference to the “hive mind” theme of this season, one of the new neighbors is actually a beekeeper.\n\nAnd this also means that Billy Eichner and Leslie Grossman’s characters have been revealed. Harrison and Meadow are married, but not a couple — in fact, Harrison is gay. They just got married based on a pact they made when they were younger. Harrison gets one night a week to go out on the town and satisfy his needs, while Meadow, because of her past case of skin cancer, doesn’t like to be touched, so it all works out pretty nicely for them. They’re a blunt pair, which takes Ivy and Ally aback, but Harrison notes that that’s just “the way of the world now.” Indeed, Harrison.\n\nAlly — surprise! — is skeptical of them, especially of the mysterious barrels they keep at their home, and the fact that they moved into the Chang’s old house so soon after the murders. But she’ll soon learn that they’re the least of her worries. Something’s tripped the alarm system back at their restaurant, and though Ivy offers to go, Ally insists that she can and that she’s “got this.” One has the sense, however, that she does not, in fact, got this. When she gets there, she makes a gruesome discovery: one of her restaurant’s managers hanging from a meat hook, just barely alive. As we learn later, Ally had to be the one to kill him.\n\nUnsurprisingly, there’s an investigation, but there’s a political twist now: a worker at the restaurant is a suspect, due to an argument with the deceased that turned weirdly racial at the top of the episode. When a police officer, played by “AHS” newcomer Colton Haynes, asks Ally and Ivy about his immigration status, Ivy indignantly insists that “he’s American.” Other repercussions of the murder, of course, lie in Ally’s psyche. She gets a gun from Harrison, who has a troubling stockpile of them as he started to collect them, in a sense, when Barack Obama became president. Harrison goads on Ally’s fears, telling her, it’s “the only thing that will make you feel safe again.”\n\nIvy, concerned, invites Ally’s therapist, Dr. Rudy Vincent (Cheyenne Jackson) for a home call. Here, Ally tells him that she feels “vindicated” by her phobias and that they keep her safe, which… is one way to go. “The world is f—ed up,” she tells him. “The election made it worse.” She shows him her new gun, and while he’s worried, he’s unable to tell Ivy because of doctor-patient confidentiality, Ally notes.\n\nLater, after Ally’s fortified her house, she gets an unwelcome visit from Kai, who she best knows currently as the man who dumped coffee all over her and Ivy in the last episode. He’s making a visit to campaign for office, and in a chilling scene, we see right rhetoric v. left rhetoric in full form. Ally, ironically from behind her newly installed bars, tells Kai that she’s interested in “building bridges, not walls.” Kai asks if he can get a drink of water, and Ally refuses to let him in and threatens to call the cops. Crazed, Kai yells, “It’s so easy until it’s you they’re coming for!”\n\nThis does not help Ally’s mental status. Later, as Ivy’s gone at the restaurant, Ally stares reluctantly at her pills. Winter picks up on this — she encourages Ally to have some wine and a bath to unwind, instead of taking her medication. Winter goes so far as to draw a bath for her, and when Ally’s relaxing, she reappears. While Ally is surprised at first, Winter starts to help wash her off. It’s clearly a seduction technique, and it’s kind of genius: she knows Ally’s stressed, and therefore relaxes her into seduction. But nothing ruins the mood like crazed clown murderers.\n\nSuddenly, the power goes out, and with it, so does Winter, exclaiming that she has to go home to save her laptop. Harrison appears at her window to yell one of the best lines of the episode: “Lesbians! We’re under attack!” It’s interesting that he goes political, telling Ally that it could be Russians or “those crazy freaks in North Korea,” seemingly playing on her fears. Ally panics and calls Ivy, who’s dealing with the power outage at the restaurant too. When Ally’s phone dies, Ivy sends Pedro — the employee currently under investigation for murder — with some supplies for her.\n\nMeanwhile, Ally’s lost it. She finds that someone’s cut the cords in her fusebox, and even sees a few of the masked murderers. When she runs upstairs to grab Oz, she has to throw one off of from the top of the stairs (and though it could mean nothing, it’s worth noting: there’s no thump to be heard when the assailant hits the ground). With her gun in hand, she rushes Oz to the door and instructs him to run to the neighbors’ house. When she opens the door, however, someone’s standing there, and in her panic, she shoots him. But lo and behold, it was Pedro there to help her — and now, he could very well be dead.\n\nNow, not only has Ally committed a murder and lost another friend, but my guess is Kai will try to use this to his advantage. Maybe his fear-mongering is working — on Ally, at least.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2017/09/american-horror-story-cult1.jpg?w=942", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Famerican-horror-story-recap-season-7-episode-2-dont-be-afraid-of-the-dark-ahs-cult-1202552659%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202552659&comment_count=8"], "top_img": "https://pmcvariety.files.wordpress.com/2017/09/american-horror-story-cult1.jpg?w=942", "keywords": [], "authors": ["Alex Stedman"], "canonical_link": "https://variety.com/2017/tv/news/american-horror-story-recap-season-7-episode-2-dont-be-afraid-of-the-dark-ahs-cult-1202552659/", "title": "‘American Horror Story’ Recap: Meet the New Neighbors in ‘Don’t Be Afraid of the Dark’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "This week's \"American Horror Story: Cult\" begins with the consequences of the premiere, and ends with a truly chilling development.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202552659, "author": "Alex Stedman", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-09-12T20:00:47"}, "pmc-tag": "American Horror Story,American Horror Story: Cult", "title": "‘American Horror Story’ Recap: Meet the New Neighbors in ‘Don’t Be Afraid of the Dark’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘American Horror Story’ Recap: Meet the New Neighbors in ‘Don’t Be Afraid of the Dark’", "url": "https://variety.com/2017/tv/news/american-horror-story-recap-season-7-episode-2-dont-be-afraid-of-the-dark-ahs-cult-1202552659/", "description": "SPOILER ALERT: Do not read on unless you’ve seen Season 7, episode 2 of “American Horror Story,” titled “Don’t Be Afraid of the Dark,” which aired on Sept. 12. T…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/american-horror-story-cult1.jpg?w=942", "width": 942, "height": 530, "alt": "American Horror Story Cult"}, "locale": "en_US"}, "article": {"published_time": "2017-09-13T03:00:47+00:00", "modified_time": "2017-09-13T03:00:48+00:00"}, "twitter": {"creator": "@https://twitter.com/a_sted?lang=en", "site": "@variety", "text": {"title": "‘American Horror Story’ Recap: Meet the New Neighbors in ‘Don’t Be Afraid of the Dark’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/american-horror-story-cult1.jpg?w=942", "alt": "American Horror Story Cult"}, "card": "summary_large_image", "title": "‘American Horror Story’ Recap: Meet the New Neighbors in ‘Don’t Be Afraid of the Dark’", "description": "This week's \"American Horror Story: Cult\" begins with the consequences of the premiere, and ends with a truly chilling development."}, "author": "Alex Stedman", "content_type": "Article", "post_id": 1202552659, "title": "'American Horror Story' Recap: Meet the New Neighbors in 'Don't Be Afraid of the Dark'", "published_at": "2017-09-12 20:00:47", "image": "https://pmcvariety.files.wordpress.com/2017/09/american-horror-story-cult1.jpg?w=942", "comment_count": 8, "tags": "American Horror Story: Cult", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read on unless you've seen Season 7, episode 2 of \"American Horror Story,\" titled \"Don't Be Afraid of the Dark,\" which aired on Sept. 12.\r\n\r\nThe premiere of \"American Horror Story: Cult\" found Ally (Sarah Paulson) to be, well, a mess after the election. As Donald Trump is voted into office, her old phobias rear their ugly heads once again, but in the second episode of the season, \"Don't Be Afraid of the Dark,\" it only gets much, much worse. In fact, her fears become fatal in the last shot of the episode, one of the most unsettling scenes yet.\r\n\r\nBut first, we pick up where we left off -- with Ally in bed with one of the dreaded clowns. She screams and runs for Ivy (Alison Pill), who rushes to protect her and is as sweet and patient as ever. When she finds no such clown in the bedroom, however, despite Ally's protests, Ivy admits again that Ally's anxiety has taken its toll on her. Ally finally resigns to her state, saying, \"I think there might be something wrong with me.\" (But hey: Just because she's paranoid, it doesn't mean someone isn't out to get her.)\r\n\r\n\r\n\r\nMeanwhile, we see that Kai's (Evan Peters) nefarious plans from the last episode have been working out swimmingly for him. After he provoked a band of construction workers by yelling racial slurs at them and chucking over a condom full of his urine, they unleashed a beatdown on him... while someone filmed on a cell phone nearby. Now it's a local news story, and of course it takes a political turn: some of the construction workers have been taken into the custody of ICE. In announcing his run for city council -- a seat that was vacated by the murder of councilman Chang -- he quotes Trump's \"rapists and criminals\" line, yelling, \"Look at my face, Michigan!\"\r\n\r\nSpeaking of the Changs, the Mayfair-Richards already have new neighbors. After a rather creepy scene where Winter (Billie Lourd) engages in the most serious pinky swear ever with Oz, vowing to take his fear for him, she allows him to go next door to play with the new residents. Ally and Ivy get home and immediately freak out over this (how have they not fired Winter yet? Seriously?) and rush over to find Oz playing with bees. Yes, in a blatant reference to the \"hive mind\" theme of this season, one of the new neighbors is actually a beekeeper.\r\n\r\nAnd this also means that Billy Eichner and Leslie Grossman's characters have been revealed. Harrison and Meadow are married, but not a couple -- in fact, Harrison is gay. They just got married based on a pact they made when they were younger. Harrison gets one night a week to go out on the town and satisfy his needs, while Meadow, because of her past case of skin cancer, doesn't like to be touched, so it all works out pretty nicely for them. They're a blunt pair, which takes Ivy and Ally aback, but Harrison notes that that's just \"the way of the world now.\" Indeed, Harrison.\r\n\r\nAlly -- surprise! -- is skeptical of them, especially of the mysterious barrels they keep at their home, and the fact that they moved into the Chang's old house so soon after the murders. But she'll soon learn that they're the least of her worries. Something's tripped the alarm system back at their restaurant, and though Ivy offers to go, Ally insists that she can and that she's \"got this.\" One has the sense, however, that she does not, in fact, got this. When she gets there, she makes a gruesome discovery: one of her restaurant's managers hanging from a meat hook, just barely alive. As we learn later, Ally had to be the one to kill him.\r\n\r\nUnsurprisingly, there's an investigation, but there's a political twist now: a worker at the restaurant is a suspect, due to an argument with the deceased that turned weirdly racial at the top of the episode. When a police officer, played by \"AHS\" newcomer Colton Haynes, asks Ally and Ivy about his immigration status, Ivy indignantly insists that \"he's American.\" Other repercussions of the murder, of course, lie in Ally's psyche. She gets a gun from Harrison, who has a troubling stockpile of them as he started to collect them, in a sense, when Barack Obama became president. Harrison goads on Ally's fears, telling her, it's \"the only thing that will make you feel safe again.\"\r\n\r\n\r\n\r\nIvy, concerned, invites Ally's therapist, Dr. Rudy Vincent (Cheyenne Jackson) for a home call. Here, Ally tells him that she feels \"vindicated\" by her phobias and that they keep her safe, which... is one way to go. \"The world is f---ed up,\" she tells him. \"The election made it worse.\" She shows him her new gun, and while he's worried, he's unable to tell Ivy because of doctor-patient confidentiality, Ally notes.\r\n\r\nLater, after Ally's fortified her house, she gets an unwelcome visit from Kai, who she best knows currently as the man who dumped coffee all over her and Ivy in the last episode. He's making a visit to campaign for office, and in a chilling scene, we see right rhetoric v. left rhetoric in full form. Ally, ironically from behind her newly installed bars, tells Kai that she's interested in \"building bridges, not walls.\" Kai asks if he can get a drink of water, and Ally refuses to let him in and threatens to call the cops. Crazed, Kai yells, \"It's so easy until it's you they're coming for!\"\r\n\r\nThis does not help Ally's mental status. Later, as Ivy's gone at the restaurant, Ally stares reluctantly at her pills. Winter picks up on this -- she encourages Ally to have some wine and a bath to unwind, instead of taking her medication. Winter goes so far as to draw a bath for her, and when Ally's relaxing, she reappears. While Ally is surprised at first, Winter starts to help wash her off. It's clearly a seduction technique, and it's kind of genius: she knows Ally's stressed, and therefore relaxes her into seduction. But nothing ruins the mood like crazed clown murderers.\r\n\r\nSuddenly, the power goes out, and with it, so does Winter, exclaiming that she has to go home to save her laptop. Harrison appears at her window to yell one of the best lines of the episode: \"Lesbians! We're under attack!\" It's interesting that he goes political, telling Ally that it could be Russians or \"those crazy freaks in North Korea,\" seemingly playing on her fears. Ally panics and calls Ivy, who's dealing with the power outage at the restaurant too. When Ally's phone dies, Ivy sends Pedro -- the employee currently under investigation for murder -- with some supplies for her.\r\n\r\nMeanwhile, Ally's lost it. She finds that someone's cut the cords in her fusebox, and even sees a few of the masked murderers. When she runs upstairs to grab Oz, she has to throw one off of from the top of the stairs (and though it could mean nothing, it's worth noting: there's no thump to be heard when the assailant hits the ground). With her gun in hand, she rushes Oz to the door and instructs him to run to the neighbors' house. When she opens the door, however, someone's standing there, and in her panic, she shoots him. But lo and behold, it was Pedro there to help her -- and now, he could very well be dead.\r\n\r\nNow, not only has Ally committed a murder and lost another friend, but my guess is Kai will try to use this to his advantage. Maybe his fear-mongering is working -- on Ally, at least.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1505271647.0, "source": "https://variety.com", "summary": ""}