{"url": "https://www.bbc.com/news/world-us-canada-42725339", "text": "Media playback is unsupported on your device Media caption What it was like to testify against Larry Nassar\n\nFormer Olympic doctor Larry Nassar has been handed a jail sentence of 175 years in Michigan for abusing female athletes he was supposed to be treating.\n\nHere, the BBC's Rajini Vaidyanathan, who was in court, and Roland Hughes detail the extraordinary testimony given in court by the survivors of his abuse.\n\nThis article contains graphic details of sexual abuse\n\nOne hundred and fifty-six young women - mothers, sisters, daughters, Olympians.\n\nAll say they were abused by the same man: former Team USA gymnastics doctor Larry Nassar.\n\nOver seven days, they took to the stand one by one to do what few survivors of sexual abuse ever get the chance to do - directly confront their attacker.\n\nNassar had already pleaded guilty to 10 counts of sexual assault for abusing young girls under the guise of medical treatment.\n\nWomen who filed criminal complaints against Nassar spoke out at his sentencing hearing in Lansing. But they were followed by close to 150 others, many of whom chose to do so without the anonymity to which they were entitled.\n\nKyle Stephens was the first to tell her story.\n\nFor years she was known only as Victim ZA, but as she stood before Judge Rosemarie Aquilina, she calmly shared her name.\n\nIn doing so, she waived her anonymity in public just as she was about to testify to the damage her abuser had done.\n\n\"I was ready to speak,\" Kyle said in an interview with the BBC after her testimony. \"I think it was really empowering to get up there and give my story from start to finish.\"\n\nFor decades, Larry Nassar abused young women. It was Kyle's call to police that led to him finally being arrested.\n\nUnlike many of the other women who shared their stories in this case, Kyle wasn't a gymnast and a patient of Nassar's. Her parents were friends with his family.\n\nAs she stood in the small courtroom, photos of her as a smiling child were projected on to a screen. Nassar first abused her when she was six, \"when I still had not lost all my baby teeth\".\n\nImage copyright Kyle Stephens Image caption Images of Kyle Stephens as a child were projected on to a screen in court\n\nIt began with him exposing himself. Later, he would masturbate before her. Then, he physically abused her - all while both their families were in the same house.\n\nWhen Kyle, aged 12, told her parents that Nassar would rub his erect penis on her bare feet, he denied it. Back then, her parents did not believe her, and urged her to apologise to him.\n\n\"He forced me to grow up really fast,\" Kyle told the BBC after the hearing. \"It was such a benign action until you grow up and realise it was a vile thing.\"\n\nImage copyright AFP/Getty Images Image caption Kyle Stephens addressed Nassar (foreground) in court\n\nSeven minutes into her testimony, delivered alongside her mother, Kyle looked up at Judge Rosemarie Aquilina and politely asked if she could address Nassar directly.\n\nShe reminded him of how her parents invited him round to their home after she had accused him. Sitting in her living room, he had denied abusing her and had said that if she was ever really abused, she should remember to report it.\n\n\"Well Larry, I'm here,\" she told him in court. \"Not to tell someone, but to tell everyone.\n\n\"Perhaps you have figured it out by now, but little girls don't stay little forever. They grow into strong women who return to destroy your world.\"\n\nIn her teens, Kyle was asked to babysit Nassar's two daughters. Doing so helped her protect them, she told the court, and allowed her to save enough money to pay for counselling.\n\nHaving reached a point where she had started to question whether the abuse had indeed occurred, she tried again to explain to her parents what had happened.\n\nThis time, they believed her.\n\nNassar, 54, graduated from the University of Michigan in 1985 and joined the medical staff of the US national gymnastics team based in Indianapolis a year later.\n\nIn 1997, alongside his work with the national gym team, he began working as a team physician at Michigan State University (MSU). He began abusing Kyle Stephens a year later.\n\nHe worked for the US gymnastics team in four Olympic Games, regularly rushing to the help of gymnasts who might have fallen awkwardly.\n\nImage copyright IOP/AFP/Getty Images Image caption Many of Nassar's victims cited the moment he helped injured gymnast Kerri Strug at the 1996 Olympics, a moment that boosted his reputation as a caring, well-respected doctor\n\nCarrie Hogan, a former softball player at MSU, told the court it was seen as a \"privilege\" to be treated by Nassar. Successful treatment could make a difference to the university's stars on the brink of a sports career.\n\n\"I was very aware of the signed photographs of the Olympic gymnasts he had treated,\" she said. \"He was the best of the best.\" Others said he was seen as a \"god\" in the gymnastics world.\n\nIn an episode of a gymnastics podcast broadcast in December 2013, Nassar spoke about how important it was to look after young athletes.\n\n\"Not just physically but mentally, you have to protect your athletes,\" he told GymCastic, speaking uncharacteristically slowly. \"You have to let them know they will be cared [for].\"\n\nHe also warned of the danger of mental injury to athletes, saying \"the physical injuries almost always they can recover from. The mental injury leaves the scars that keep coming back and haunt them later.\"\n\nMany of the women who spoke in court said that after he abused them, they were intimidated by his powerful status.\n\nReporting the offence - if they understood that they had been subject to an offence at all - felt almost impossible.\n\nNassar had a strikingly similar pattern of how he abused young women, the vast majority of whom were gymnasts.\n\nThey came to him often in pain, looking for help.\n\nAt their most vulnerable moment, he tried to convince them what he was doing was normal - even talking about everyday life and joking as he touched them.\n\nMedia playback is unsupported on your device Media caption Former gymnast Jeanette Antolin: 'You made me believe you were my friend'\n\nBy projecting a sense of normality from his position of authority, Nassar made his victims feel they were wrong to believe this was abuse, and that they would be in the wrong if they complained.\n\n\"I remember having the option of keeping my spandex on, which I was very grateful for and chose,\" said Jennifer Rood Bedford, a volleyball player at MSU between 2000 and 2003.\n\n\"He had me lay down face down on the medical table. When he started treatment, I remember him saying his treatment relied upon applying pressure to areas around the pelvis and that this was normal.\n\n\"So when he went down there, I just told myself it was normal, that he knows what he's doing and don't be a baby.\n\n\"I remember laying there and thinking 'Is this OK? This doesn't seem right'.\"\n\nRachael Denhollander, a former gymnast from Michigan, was the first victim to speak up publicly in 2016.\n\nShe told the BBC that Nassar abused her during every visit she made to his clinic over a year after she turned 15.\n\nNassar would position Rachael's mother at the head of the table so she was not able to see what he was doing.\n\nWith one hand, he would carry out sports massage. With the other, covered by a towel, he would insert his fingers into Rachael's vagina or anus. In one of their last sessions, he unhooked her bra and fondled her breast - the only time Rachael said she knew she was definitely being assaulted and not treated.\n\nMedia playback is unsupported on your device Media caption Nassar reacts as former gymnast Gwen Anderson testifies\n\nMany of the women said their trust in male relatives, partners, doctors, strangers, friends and teachers was destroyed as a result of Nassar's actions.\n\n\"My first reaction was to question myself, to blame myself,\" said Jennifer Rood Bedford.\n\n\"I wanted to believe the best in people, but no matter how much I rationalised - he's a doctor, he's treating you, he didn't mean for that to happen - I couldn't shake the voice in my head that something wasn't right.\"\n\nIf you have been affected by child sexual abuse, sexual abuse or violence, help and support is available.\n\nIf you are in the UK, you can find links here: BBC Action Line\n\nIf you are in the US, you can contact Rainn, the national sexual abuse hotline, here, or by calling 800.656.HOPE\n\nFor Gwen Anderson, a former gymnast who competed for her state of Michigan, the abuse began when she was just 12.\n\nNow, as a teacher to girls of the same age, she says she sees Nassar's actions in an even starker light.\n\n\"I teach 12, 13, 14-year-olds every day,\" she told the court. \"And every single day, when I look at them, I am faced with the reality of how young and defenceless we were when you molested us.\n\n\"I look at them every single day and I think to myself 'I am their safe place. I am their protector. I am their encouragement. I am their motivator. I am their rock'.\"\n\nIt is unclear when and how Nassar's abuse of his patients started, though the first allegations date to 1994.\n\nIn August 2016, the Indianapolis Star published a story detailing allegations of sexual abuse committed by coaches working for USA Gymnastics. It claimed that the sporting body did not report allegations of abuse to relevant authorities.\n\nThe initial article did not name Nassar. But after it was published, Rachael Denhollander realised this was her chance to speak up.\n\nThe newspaper published allegations against him from two named former gymnasts, including Rachael, a month later.\n\n\"I knew this was how it was going to have to be done,\" she told the BBC outside court. \"When you have a predator who is surrounded by two very powerful institutions, one anonymous voice is never going to be enough.\n\n\"When you have a predator who is manipulative, gregarious and as engaging as Larry is, you have to be willing to meet him where he is the most comfortable - on very public ground. And never flinch.\"\n\nMedia playback is unsupported on your device Media caption Gold medallists Raisman and Wieber face their abuser\n\nRachael's bravery helped encourage other women to come forward. In the corridors outside the sentencing hearing, countless women cited Rachael's actions as inspiration for their own decision to speak up.\n\nAs a result, instead of 90 survivors sharing their stories of abuse over four days - as had been expected at the start of the hearing - 156 women and girls ended up doing so over seven days.\n\nThe feeling in the courtroom throughout was one of collective empowerment and solidarity built through a shared experience of horror.\n\nFour-time Rio Olympic champion Simone Biles issued a statement to say she too had been abused by Nassar. Then, Olympic gold medallists Aly Raisman and Jordyn Wieber came to court to detail what he did to them during the 2012 Games in London.\n\nNassar was eventually arrested on 21 November, 2016.\n\nHe was sentenced to 60 years in jail a year later for three counts relating to child sex abuse images on his computer.\n\nHe then pleaded guilty to molesting females at his home, at a gymnastics club and in his MSU office, a plea that led to the 156 pre-sentence testimonies.\n\n\"I realise what I am feeling pales in comparison to the pain, trauma and emotional disturbance that I have wreaked,\" Nassar told the survivors as the hearings drew to a close.\n\n\"There are no words that can describe the depth and breadth of how sorry I am for what has occurred.\n\n\"I will carry your words with me for the rest of my days.\"\n\nAt the start of the hearings, Nassar had stared blankly down at his hands, avoiding eye contact with all those who came forward to speak.\n\nHis former colleague, gym coach Tom Brennan, stood alongside Gwen Anderson while she was testifying. \"Look at her,\" he yelled at the man he called his former mentor, ordering him to pay attention to the women as they testified.\n\nAfter that, Nassar appeared to look up and listen to the survivors with greater frequency.\n\nThe question of how repentant he was remained unanswered at the end of the hearings, however: Judge Aquilina read excerpts of a letter he sent her, saying he was a good doctor, and that the media had convinced the young women to believe he had acted wrongly.\n\nMedia playback is unsupported on your device Media caption Judge Aquilina: 'I have just signed your death warrant'\n\nJudge Aquilina's role in this case was crucial. Almost every testimony began with survivors thanking her for her support and encouragement.\n\nGiven that Nassar had admitted his guilt months before, Judge Aquilina had no obligation to be impartial. As she took on the role of therapist, advocate and friend to the women who stood before her, she condemned his actions.\n\n\"The monster who took advantage of you is going to wither, much like the scene in the 'Wizard of Oz' where the water gets poured on the witch and the witch withers away,\" she told one woman after her testimony.\n\nShe also encouraged a number of the abuse survivors not to kill themselves when they said they had considered suicide - taking their own lives would hand Nassar victory, she said.\n\n\"I know you're a little nervous, pretend you're talking to me and your mum,\" she told another woman as she prepared to deliver her testimony.\n\nA crime writer in her spare time, Judge Aquilina's words were a powerful force throughout the hearing. She described the women as \"sister survivors\" and \"warriors\" who had demonstrated \"superwoman steel.\"\n\n\"I didn't want even one victim to lose their voice,\" she told the court, as she explained why she was prepared to let the hearing go on for as long as it took to hear all of the survivors who wanted to speak.\n\nThe survivors, in turn, responded. One after the other waived their anonymity and came to realise this was a chance to take charge of their own story.\n\nMedia playback is unsupported on your device Media caption Tiffany Thomas Lopez: \"You created an army when you violated us\"\n\nNot all the women knew each other, but many acknowledged the invisible bond between them, and the strength they had gained from the others who had spoken in court.\n\nOne former MSU softball player, Tiffany Thomas Lopez, told Nassar she was part of \"the army you created when you violated us\", going on to say: \"Your actions have had me by the throat for years. I'm ready to be released from your clench.\"\n\nAs the hearings went on past the four days that were initially scheduled, anger gradually built towards the institutions where Nassar worked.\n\nAly Raisman, part of the gold medal-winning gymnastics team in the 2012 Olympics, demanded an independent investigation into how Nassar was allowed to continue abusing girls even after complaints were made.\n\nShe attacked both USA Gymnastics - an organisation she said was \"rotting from the inside\" - and the US Olympic Committee for their lack of support. Three senior USA Gymnastics board members subsequently quit.\n\nThe focus has now shifted on to who knew what, and when.\n\nImage copyright Reuters Image caption Rachael Denhollander, \"the five-star general in the army of survivors\"\n\nThe Lansing State Journal newspaper reports that seven women or girls made complaints about Nassar to coaches, trainers, police or university officials between 1997 and 2015.\n\nIn 2014, an investigation by MSU even cleared Nassar of wrongdoing after a recent graduate accused him of molesting her. Two years later, he was under arrest.\n\nThe university has put aside $10m (£7.2m) to reimburse former students for counselling, but is being sued by about 140 women. MSU President Lou Anna Simon has also quit.\n\nMeanwhile, MSU's board of trustees asked the Michigan attorney general's office to conduct an outside review into how it handled the allegations.\n\nAs Nassar starts his jail sentence - brought about by a team of female investigators, prosecutors and judges - the battle to seek answers from the authorities is only just starting. Why did they not listen to survivors' stories sooner?\n\nRachael Denhollander, now a mother of three and a lawyer, was the last to give her testimony. Judge Aquilina called her \"the five-star general in the army of survivors\".\n\nFor Rachael, the sentence has been a vindication of her decision to speak out publicly 16 months ago.\n\n\"I'm so deeply grateful for where we are,\" she told the BBC. \"But it's absolutely heartbreaking to me.\n\n\"To know that the vast majority of those little girls could have been saved from what they went through is devastating.\"\n\nIf you have been affected by child sexual abuse, sexual abuse or violence, help and support is available.\n\nIf you are in the UK, you can find links here: BBC Action Line\n\nIf you are in the US, you can contact Rainn, the national sexual abuse hotline, here, or by calling 800.656.HOPE", "images": ["https://ichef.bbci.co.uk/images/ic/720x405/p05vgysp.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/images/ic/720x405/p05v60k0.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::us_and_canada::news.world.us_and_canada.story.42725339.page&x1=[urn:bbc:cps:bfd64fe7-c891-ed40-ab1d-6d55bd2bc6d9]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ichef.bbci.co.uk/images/ic/720x405/p05vzy18.jpg", "https://ichef.bbci.co.uk/images/ic/720x405/p05vzcfj.jpg", "https://ichef.bbci.co.uk/images/ic/720x405/p05v652b.jpg", "https://ichef.bbci.co.uk/images/ic/1024x576/p05vzy18.jpg", "https://ichef.bbci.co.uk/images/ic/720x405/p05v6201.jpg"], "top_img": "https://ichef.bbci.co.uk/images/ic/1024x576/p05vzy18.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/world-us-canada-42725339", "title": "Larry Nassar case: The 156 women who confronted a predator", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Ex-Olympic doctor Larry Nassar has received a 175-year sentence for abuse. This is his victims' story.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 115419847, "og": {"title": "The 156 women who confronted a predator", "type": "article", "description": "Ex-Olympic doctor Larry Nassar has received a 175-year sentence for abuse. This is his victims' story.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-us-canada-42725339", "image": {"identifier": "https://ichef.bbci.co.uk/images/ic/1024x576/p05vzy18.jpg", "alt": "BBC News. Victim Emily Morales is hugged after speaking at the sentencing hearing for Larry Nassar - 23 January 2018"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "US & Canada"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "The 156 women who confronted a predator", "description": "Ex-Olympic doctor Larry Nassar has received a 175-year sentence for abuse. This is his victims' story.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/images/ic/1024x576/p05vzy18.jpg", "alt": "Victim Emily Morales is hugged after speaking at the sentencing hearing for Larry Nassar - 23 January 2018"}, "domain": "www.bbc.com"}, "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}