{"url": "https://www.bustle.com/p/greys-anatomy-changed-its-midseason-premiere-episode-title-to-highlight-domestic-abuse-7909142", "text": "Grey's Anatomy's midseason premiere is set to air this Thursday, Jan. 18, and the show is already tackling an important issue on and off-screen with the premiere episode's recent title change, as reported by Us Weekly. The episode was originally titled \"Four Seasons in One Day,\" though that has since been changed to \"1-800-799-7233\" — the number for the National Domestic Violence Hotline.\n\nKrista Vernoff, a writer for the series, confirmed the news in a tweet published on Thursday night. Vernoff quoted a tweet with a press release announcing the title change before attributing the \"brilliant\" and \"important\" idea to Giacomo Gianniotti, who plays DeLuca on the show. Vernoff wrote, \"Giving credit where it's due: this title change was pitched to me by @GiacomoKG Brilliant idea. Important. Thank you!\"\n\nGianniotti later responded to the writer's shoutout saying, \"Thank you @KristaVernoff glad it made the cut! Very honoured to be apart of this story.\"\n\nIn case you don't recall, the Season 14 midseason finale's biggest reveal turned out to be the return of Jo's estranged, abusive husband, Paul Stadler (played by Matthew Morrison). Paul's return is something that's been foreshadowed and hinted at on the show for a while, and viewers were even able to get their first glimpse of him in a Season 13 episode that sees Alex making his way to Los Angeles for a medical conference where he briefly comes face to face with Paul and fantasizes about confronting him. Once Alex walked away from the situation, it's likely that viewers thought that would be the first and last time they'd see Paul. But the character eventually shows up at Grey Sloan during the last minute of the finale, and the chilling surprise left many fans questioning what's next for Jo (Camila Luddington), who's been in hiding throughout her time on the show, even changing her name so that Paul wouldn't be able to find her.\n\nThough we're entering a pretty dark part of the show's storyline, it'll be interesting to see what comes next for Jo and how the show handles filling in the blanks of her story.\n\nVernoff sat down with TV Line after the midseason finale to discuss Paul's return and why she felt that it was an important bit to add to Jo's storyline. She explained,\n\n\"I've talked a lot about how this season [we're refocusing the show on] fun and joy and laughter, and my commitment has been to make sure there's laughter in every episode — even the ones where the stories that we're telling are quite painful and quite dark. And my hope is that women will come out of this story feeling empowered. I'm really proud of this story. I'm really proud of the work that we're doing.\"\n\nGrey's Anatomy has never been a show to shy away from discussing social and political issues. The episode's title change may seem like a small move, but it's a brilliant one that was important for the show's writers to make. The show hasn't spent much time tackling domestic abuse, but now that it is, it's important for Grey's to reiterate to viewers that violence against women is so much more than just a storyline, but something that millions of women experience daily. Jo's story may be something for fans to tune into once a week, but it's a reality for so many women who might not be aware that there are resources they can turn to for help.\n\nWe won't know what to expect from Paul's return until the midseason premiere airs, but it'll be exciting to see how Grey's chooses move forward in telling Jo's story. Judging by the title change, the show is already off to a good start.", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/8/6278aeea-0eb2-4325-8f2c-32eebd20b766-155070_0096.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/b15d0da0-1957-43cc-bd17-3de454893e27-154581_0926.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/1df58b0f-7e97-4da7-b09c-01b0c86413a1-getty-1209315144.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/14/2cea261f-221d-4c14-8796-78e3b1d00383-155251_9180.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/14/1d168840-8c21-4f1c-8c9c-324f4621db1d-jo-greys.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/14/1d168840-8c21-4f1c-8c9c-324f4621db1d-jo-greys.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/1/14/1d168840-8c21-4f1c-8c9c-324f4621db1d-jo-greys.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/greys-anatomy-changed-its-midseason-premiere-episode-title-to-highlight-domestic-abuse-7909142", "title": "'Grey's Anatomy' Changed Its Midseason Premiere Episode Title To Highlight Domestic Abuse", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/greys-anatomy-changed-its-midseason-premiere-episode-title-to-highlight-domestic-abuse-7909142", "type": "article", "title": "'Grey's Anatomy' Just Changed Its Midseason Premiere Episode Title To Highlight Domestic Abuse", "description": "Grey's Anatomy's midseason premiere is set to air this Thursday, Jan. 18, and the show is already tackling an important issue on and off-screen with the premiere episode's recent title change, as reported by Us Weekly. The episode was originally…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/1/14/1d168840-8c21-4f1c-8c9c-324f4621db1d-jo-greys.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Grey's Anatomy's midseason premiere is set to air this Thursday, Jan. 18, and the show is already tackling an important issue on and off-screen with the premiere episode's recent title change, as reported by Us Weekly. The episode was originally…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}