{"url": "http://www.cnn.com/2009/LIVING/12/08/cheating.spouses.lawsuits/index.html", "text": "Atlanta, Georgia (CNN) -- The next time a married man or woman glances your way, you might think twice before acting on impulse and frolicking between satin sheets. The scorned spouse could sue you.\n\nYes, you read that right. You, the paramour, can get hit with a lawsuit that could cost you hundreds of thousands of dollars.\n\nThey're known as \"alienation of affection\" suits, when an \"outsider\" interferes in a marriage. The suits are allowed in seven states: Hawaii, Illinois, Mississippi, New Mexico, North Carolina, South Dakota and Utah.\n\nThe law allowing such legal action dates back to antiquated times when a wife was considered the property of a husband. A broken-hearted hubby could go after his wife's lover -- not with a gun, but with the law.\n\nIn modern times, the suits are filed for two reasons: money and revenge. Juries in North Carolina have handed out awards in excess of $1 million on multiple occasions.\n\n\"If your spouse is going to cheat, you really would like them to cheat with somebody who has a lot of money,\" says Lee Rosen, a North Carolina divorce attorney who deals with alienation of affection cases on a daily basis.\n\nAnd that's why many legal experts are paying close attention to the Tiger Woods saga. Will his wife go after an alleged mistress?\n\nWere any of his \"transgressions\" with someone who is married? If so, the jilted hubby might be able to go after the world's richest golfer.\n\nIt doesn't matter that Woods lives in Florida, a state where the suits aren't allowed, legal experts say. If any of Woods' professed \"sins\" took place in an alienation of affection state, look out.\n\n\"If he had been dating a married woman, there could be the potential for a lucrative recovery,\" Rosen says. \"You've got to have a really affluent paramour that makes for a good target.\"\n\nThe suits rarely make it to trial. Usually, just the threat of such a lawsuit is enough for an out-of-court settlement.\n\nClick through a gallery of famous sex scandals\n\n\"When folks are getting divorced, the threat of having the person's new boyfriend, girlfriend, husband or wife dragged into court and the dirty laundry aired ... causes enormous pressure,\" says Matt Steffey, a law professor at Mississippi College School of Law.\n\nMississippi has been rocked by a high-profile suit, filed this summer, involving everything from allegations of ski resort trysts to a secret journal ordered kept under seal by a judge.\n\nBetter yet, it involves a congressman who once co-sponsored legislation for President George W. Bush to declare 2008 the \"National Year of the Bible.\"\n\nThe son of a prominent federal judge in Mississippi, Chip Pickering was the rising GOP star of the state -- hand-picked to succeed Trent Lott in the U.S. Senate. Then, everything unraveled.\n\nPickering decided not to run for re-election in 2008 after 12 years in the House. At the time, he said he wanted to spend more time with his family. He's married with five children.\n\nLike a tale from William Faulkner, who penned many a book on Mississippi elite with personal flaws, Pickering's tumble has been staggering.\n\n\"Chip Pickering has fallen far faster than the surrender of Vicksburg,\" Steffey says, referring to a key turning point in the Civil War, when Confederates gave up the Mississippi River town.\n\nThe real doozy came July 14, when Leisha Pickering filed the alienation of affection suit against her husband's alleged lover, a socialite named Elizabeth Creekmore-Byrd.\n\n\"As a direct and proximate result of the negligent, wrongful and reckless misconduct and behavior of Creekmore-Byrd with Pickering,\" the suit says, \"plaintiff has suffered damage to the affection and consortium with her husband.\"\n\nSo hush-hush is the case, lawyers on both sides have reached a confidential agreement to not discuss the case publicly.\n\nThe suit, in effect, has branded the once-proud congressman with a Scarlet \"A.\" \"He had certainly fallen from the pinnacle of his professional life and his public life, but it had not yet become a public disgrace,\" Steffey says. \"And what this lawsuit did is it turned a fall into a disgrace.\"\n\n\"There's a particular cast of tragedy when people are undone, not by accidental misfortune, but by their own character defects.\"\n\nWatch: Are men programmed to cheat?\n\nMost states have abolished alienation of affection lawsuits. Proponents in the holdout states say the threat of such legal action helps protect the sanctity of marriage.\n\nBut, Steffey and Rosen say, alienation of affection suits do just the opposite: They result in already contentious divorces getting even more heated, and they leave behind a public trail of personal shortcomings and wild tales of infidelity.\n\n\"To allow these suits to go forward,\" Steffey says, \"is destructive to family life.\"\n\n\"It's much like dropping a nuclear bomb on a family,\" Rosen says. \"It really does damage the relationship between spouses. If there are children involved, it's devastating for them.\"\n\nIt would require legislative action for states to change the law. And anyone who tries that in a conservative state could get painted as a pro-divorce lawmaker who holds cheaters less accountable.\n\n\"It's a very delicate matter legislatively,\" Steffey says.\n\nAnd as long as the law remains on the books, Rosen says, he'll keep busy: \"We have an obligation to pursue our clients' rights.\"\n\nThere is one way to avoid such suits: Respect marital vows.", "images": ["http://i.cdn.turner.com/cnn/.element/img/3.0/global/misc/advertisement.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/1px.gif", "http://cdn.cnn.com/cnn/images/1.gif", "http://www.cnn.com/video/bestoftv/2009/12/04/tsr.ca.movement.to.ban.divorce.cnn.640x360.jpg", "http://i.cdn.turner.com/cnn/2009/LIVING/12/08/cheating.spouses.lawsuits/story.monogamy.gi.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/icons/btn_close.gif", "http://i2.cdn.turner.com/cnn/2009/images/12/08/stacks.sex.scandals.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/mosaic/15x15_PLUS_bt.jpg", "http://i.cdn.turner.com/cnn/.element/img/3.0/mosaic/bttn_close.gif", "http://cdn.cnn.com/cnn/1.gif", "http://i.cdn.turner.com/cnn/images/1.gif", "https://i.cdn.turner.com/cnn/.element/img/3.0/global/misc/apple-touch-icon.png", "http://www.cnn.com/video/bestoftv/2009/12/04/joy.behar.nick.dipaolo.cnn.640x360.jpg"], "top_img": "https://i.cdn.turner.com/cnn/.element/img/3.0/global/misc/apple-touch-icon.png", "keywords": [], "authors": ["Wayne Drash"], "canonical_link": "http://www.cnn.com/2009/LIVING/12/08/cheating.spouses.lawsuits/index.html", "title": "Beware cheaters: Your lover's spouse can sue you", "meta_data": {"TITLE": "Beware cheaters: Your lover's spouse can sue you - CNN.com", "description": "The next time a married man or woman glances your way, you might think twice before acting on impulse and frolicking between satin sheets. The scorned spouse could sue you.", "AUTHOR": "By Wayne Drash, CNN", "SECTION": "LIVING", "fb": {"admins": 690014395, "app_id": 80401312489, "page_id": 129343697106537}, "og": {"type": "article"}, "viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.cnn.com", "summary": ""}