{"url": "www.independent.co.uk/royalwedding/meghan-markle-age-net-worth-family-mother-parents-latest-news-royal-wedding-prince-harry-a8292356.html", "text": "Meghan Markle will soon become an official member of the royal family when she exchanges vows with Prince Harry.\n\nLiving a real-life fairytale, Ms Markle will leave her American roots and career behind and join her new husband in London.\n\nBut as the upcoming royal wedding becomes an increasingly popular topic of conversation, many are wondering who exactly will be footing the bill, how much money the actress has - and who pays for her expansive wardrobe.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nAs it turns out, the former actress and philanthropist is much more than just a future royal - and she has a pretty impressive net worth in her own right.\n\nHere’s everything you need to know about Meghan Markle’s age, future royal status, net worth and family.\n\nWhat is her age?\n\nSurprisingly, Meghan Markle is actually three years older than her future prince - and her real name is Rachel Meghan Markle.\n\nMs Markle was born on August 4 1981 in Los Angeles, California. She is currently 36 years old.\n\nWhat is her net worth?\n\nBefore finding her prince charming, Markle was successful in her own right.\n\nAlthough much less than her fiancé’s, it is estimated that she has a net worth of £3.5m ($5m).\n\nShe has worked numerous jobs, including as a calligrapher before becoming a successful actress in Hollywood.\n\nPrior to making it big, Markle had multiple small guest roles on television, including spots on General Hospital, Century City, The War at Home, and CSI: NY.\n\nIn 2011, Markle’s big acting break came when she was cast as Rachel Zane on the show Suits, which she played for seven seasons, until finishing in late 2017.\n\nFor her role on Suits, Fortune magazine estimated she was paid £35,500 ($50,000) per episode or an annual income of £319,400 ($450,000).\n\nMarkle also worked as the editor-in-chief of lifestyle website, The Tig, and created a line of women’s workwear alongside Canadian clothing company Reitmans. From these ventures and related sponsorships, Markle received an estimated annual income of £56,800 ($80,000).\n\nAnd in 2010, Markle was paid £132,750 ($187,000) for her role in the film Remember Me and £121,697 ($171,429) for her role in the short film The Candidate.\n\nAs for the future royal’s clothes, she currently pays for her own wardrobe, according to People magazine.\n\nBut once she ties the knot, Markle’s clothing budget for official outings will be covered by the money Prince Charles gives to Prince William, Kate Middleton, and Prince Harry from his Duchy of Cornwall income.\n\nWho is her family?\n\nAlthough Ms Markle wasn’t raised a royal, her early life was certainly not without its perks.\n\nHer mother, Doria Loyce Ragland, is a social worker and a yoga instructor who lives in California. And her father, Thomas Markle Sr, is an Emmy award-winning lighting director who lives in Mexico.\n\nMarkle’s parents divorced when she was six years old and although she was their only child, she has two older paternal half-siblings.\n\nShe was educated in private schools and attended Northwestern University in theatre and international studies in 2003.\n\nHer mother is African American and her father is Caucasian, a background that Markle has embraced and discussed throughout her career.\n\nIn addition to a successful career, Markle’s father Tom, 72, once won the lottery, winning an estimated £532,222 ($750,000), according to the Daily Mail.\n\nBoth her parents are expected to attend her wedding on May 19 at St George’s Chapel, Windsor Castle.\n\nThis article has been updated. It was originally published in April 2018.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/16/gettyimages-937001578.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/16/gettyimages-937001578.jpg", "keywords": [], "authors": ["Chelsea Ritschel"], "canonical_link": "https://www.independent.co.uk/royalwedding/meghan-markle-age-net-worth-family-mother-parents-latest-news-royal-wedding-prince-harry-a8292356.html", "title": "How old is Meghan Markle, what is her net worth, and who are her parents?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/royalwedding/meghan-markle-age-net-worth-family-mother-parents-latest-news-royal-wedding-prince-harry-a8292356.html", "title": "This is how much Meghan Markle is worth", "description": "Here's everything you need to know about Meghan Markle's age, former career and net worth, and her family", "updated_time": "2018-05-19T08:54:36+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/06/16/gettyimages-937001578.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5733632148001_5733627746001.mp4?pubId=624246174001&videoId=5733627746001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8292356"}, "description": "Meghan Markle will soon become an official member of the royal family when she exchanges vows with Prince Harry. Living a real-life fairytale, Ms Markle will leave her American roots and career behind and join her new husband in London. But as the upcoming royal wedding becomes an increasingly popular topic of conversation, many are wondering who exactly will be footing the", "keywords": "Meghan Markle, Royal family, net worth, Royal Wedding", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Meghan Markle", "published_time": "2018-05-19T08:45:00+01:00", "modified_time": "2018-05-19T08:54:36+01:00", "section": "Royal Wedding", "subsection": "Video", "author_name": "Chelsea Ritschel", "content_type": "story", "word_count": 604, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 5}, "twitter": {"title": "This is how much Meghan Markle is worth", "description": "Meghan Markle will soon become an official member of the royal family when she exchanges vows with Prince Harry. Living a real-life fairytale, Ms Markle will leave her American roots and career", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1526715900.0, "source": "http://www.independent.co.uk", "summary": ""}