{"url": "https://www.emirates247.com/entertainment/kuwtk-khloe-kardashian-is-still-undecided-about-her-future-with-tristan-thompson-2018-10-31-1.674036", "text": "By Bang\n\nThe 34-year-old reality TV star was recently spotted supporting the NBA player at a basketball game in Cleveland, but the 'Revenge Body' host - who has six-month-old daughter True with Tristan - still isn't sure how long she wants to stay in the city with the sports star or whether she thinks her long-term future remains in Los Angeles.\n\nA source told 'Entertainment Tonight': \"Khloe and Tristan are still working on things, but know whatever they decide to do moving forward, it will be whatever is best for their daughter, True.\n\n\"Khloe isn't certain how long she will be in Cleveland and may fly back for her mom, Kris Jenner's, birthday next week, but isn't sure. A lot is dependent on how things go with her and Tristan.\"\n\nKhloe's relationship with Tristan has reportedly been on the rocks ever since he was accused of having relations with another woman shortly before she gave birth to their daughter in April.\n\nAnd Khloe recently admitted it's been \"very hard\" to relive Tristan's alleged infidelity on 'Keeping Up With the Kardashians'.\n\nThough the Good American founder finds it hard to watch the footage back, she also accepts that being on the programme means she cannot escape her real-life dramas.\n\nA Twitter user recently posted: \"I feel so bad for @khloekardashian had to go through what Tristan did while filming #KUWTK. If I'm not wrong, next episode will be insane. You're so strong to put that personal issue as part of the show knowing millions of ppl will watch it. I wouldn't be able to do it.\"\n\nAnd Khloe replied: \"Sadly, it will. I signed up to show the for the good and the bad, right? The bad is very hard to relive but it's life.\"\n\nKourtney Kardashian and Luka Sabbat split\n\nKourtney Kardashian has split from Luka Sabbat, but the reality star isn't thought to be upset because their romance was just a \"fun fling\".\n\nThe 39-year-old reality star - who has Mason, eight, Penelope, five, and Reign, three, with former partner Scott Disick - had never confirmed her reported romance with Luka, 20, but it now seems she's put an end to their \"fun fling\" as the pair are no longer seeing each other.\n\nA source told People magazine: \"Kourtney is no longer seeing Luka. It was a fun fling for her, but not a big deal. She has more important things to focus on, like her kids and work. Kourtney is doing great. She is looking forward to all the fun holidays.\"\n\nThe 'Keeping Up with the Kardashians' star began seeing Luka following her split from Younes Bendjima, and although they shared an age gap of almost two decades, Kourtney's friends were said to be a fan of Luka.\n\nAn insider previously said: \"All of their friends know she's head over heels for Luka. None of her friends liked Younes, and they all love Luka even though he's only 20! They think he's good for her, and he's a very down-to-earth and good guy.\"\n\nKourtney's romance with Luka was said to be a nice change of pace for the star, who had \"distanced herself from her sisters\" during her romance with 25-year-old Younes.\n\nA source said: \"Kourtney was always so private and closed off when it came to Younes, and that really distanced herself from her sisters. Things are fine with them now and I'm sure they'll get even more back to normal now that it seems he's out of the picture for good.\n\n\"This could be a really positive thing for her relationship with her family.\"\n\nKourtney split with Younes in August following a year and a half long romance which began in December 2016. Before that, she had dated Scott Disick on and off for almost a decade, from 2006 to 2015.\n\nKylie Jenner and Travis Scott splash out $13m\n\nThe 'Keeping Up With The Kardashians' star and her beau have splashed out on a luxurious home in the Beverly Hills Post Office neighborhood of Los Angeles and are listed as joint tenants.\n\nThe master bedroom alone is 2,300 square foot as well as a swimming pool and stunning views over the surrounding landscape, TMZ reports.\n\nMeanwhile, it was previously reported that Kylie and Travis have reportedly been discussing marriage.\n\nA source explained: \"Kylie and Travis have been inseparable lately, and their love for Stormi just seems to bring them closer every day ... When Kris sees Kylie and Travis together, she's convinced they're on the right path. At first she worried about Kylie starting a family so young because she felt she had no say. Kris knows Kylie does what Kylie wants, so Kris just had to hope for the best ... Kim, Khloe and Kourtney are pleasantly surprised by how involved Travis has become in his daughter's life. They know he has a huge career, but he is clearly taking the time to be there for both Kylie and Stormi.\"\n\nPhoto: Instagram\n\nKylie has made a concerted effort to keep her relationship with Travis low-key.\n\nShe previously explained: \"Like, if we were in LA, I feel like it would've been way different. Everything happened for a reason. We weren't going out as 'Kylie and Trav.' We would just be in Cleveland, walking the street for hours. We would go on walks, and no one would bother us.\"\n\nKim Kardashian West 'let go' of independence marrying Kanye\n\nKim Kardashian West has admitted she feels less \"independent\" since marrying Kanye West.\n\nThe 38-year-old reality star has opened up about how her life has changed since tying the knot with the 41-year-old controversial rapper - with whom she has North, five, Saint, two, and Chicago, nine months - four years ago.\n\nAppearing on 'The Alec Baldwin Show', she admitted: \"I think being with a man like Kanye, you have to learn how to be a little bit not-so-independent.\n\n\"I've always been so independent and working, and [had a] schedule, and when you get married and have a husband that has their career and then have kids, your independence ... you have to let it go.\n\n\"I had to learn that being with a man like Kanye.\"\n\nThe 'All Day' hitmaker has strong political views - evident in his lyrics - and is close friends with US President Donald Trump.\n\nKim says she lets her other half have the freedom to be himself and has an \"open mind\" when it comes to his views.\n\nShe said: \"I let [Kanye] be who he wants to be. I let him have his own views and opinions, even if they're different than mine.\n\n\"I think it's just having an open mind. I love to let my husband be who he is.\n\n\"We definitely have conversations if I don't understand something in private and talk about that.\"\n\nKanye recently ranted about \"mind control\" on Twitter after reactivating his account.\n\nThe outspoken rap star ended his self-imposed exile from the micro-blogging website by posting a series of behind-the-scenes videos in Uganda, where he's been recording his new album, and then launching into a rant about the influence of social media on the brain.\n\nIn one of the videos, Kanye - who described himself as having a Mensa-level IQ - said \"You know, when people try to influence you through social media and try to tell you what to do or if you post something that's positive on Instagram and it gets taken down if it's not part of a bigger agenda, you know, that's like mind control.\n\n\"That's the echo chamber. That's trying to control you based off of incentivising you and based off of you getting enough likes, and that's the poison that's happening with social media.\"\n\nThe rant came shortly after he claimed that wearing a 'Make America Great Again' cap made him feel like \"Superman\".\n\nHe told Trump during their meeting: \"I love Hillary, I love everyone, right, but the campaign 'I'm With Her' just didn't make me feel, as a guy that didn't get to see my dad all the time, like a guy that could play catch with his son.\n\n\"It was something about when I put this hat on, it made me feel like Superman. You made a Superman. That's my favourite superhero. You made a Superman cape for me.\"\n\nKendall Jenner slams media for 'putting her life in danger'\n\nKendall Jenner has slammed media outlets for \"putting her life in danger\" by sharing her location after it was reported her alleged stalker was arrested at her home.\n\nThe 22-year-old model took to social media on Thursday to slam the news outlet after it reported that a man named John Ford had been taken into police custody after he was found sitting outside her house for the second time in a week.\n\nKendall accused the publication of posting pictures of her home and sharing her location, making it easier for \"terrifying people\" to find her address.\n\nQuoting the link to TMZ's story, Kendall wrote on Twitter: \"and how do you guys think these terrifying people know where my house is? cuz you release not only photos but my location. it is so beyond unsafe. is this not our one ounce of privacy we can get???\n\n\"i understand what i've signed up for but when you release the exact location to where i live THAT is when you're putting my life in danger. your home is your safe haven, but for me, cuz of outlets like you, my home is anything BUT. you should be ashamed of yourself. (sic)\"\n\nHer scathing comments come after 37-year-old John - who was arrested last month for breaking into a gated community which has been home to the likes of the 'Keeping Up With the Kardashians' star, Britney Spears, Slash, Christina Aguilera, Paris Hilton and Charlie Sheen - scaled the mountainside at the back of the complex last week, where there is no security, and was spotted by Kendall's team sitting in her backyard by her pool.\n\nPolice were called but Ford had gone before they arrived, and on Tuesday, the man allegedly came back and got in via the unsecured mountainside again and was spotted by security on Kendall's front porch.\n\nThis time, police arrived and arrested Ford, who is now being held on a 5150 psychiatric hold and has been charged with criminal trespass and violating a protective order.\n\nKhloe Kardashian 'hasn't decided' whether to leave Tristan Thompson\n\nKhloe Kardashian still \"hasn't decided\" whether or not to break up with Tristan Thompson following his alleged cheating scandal earlier this year.\n\nThe 34-year-old reality star was just days away from giving birth to her and Tristan's daughter True in April this year when video footage emerged which seemed to show the NBA star getting close with another woman, and although she is currently still in a relationship with him, sources say she hasn't made a final decision yet.\n\nAn insider said: \"Khloé isn't saying that she and Tristan split. It seems she hasn't decided yet what she wants to do about their relationship.\"\n\nKhloe gave birth to True, now six months, in Cleveland where she lived with Tristan - who plays for the Cleveland Cavaliers - but after spending the summer back home in Los Angeles, she has reportedly become reluctant to return to Ohio.\n\nThe source added: \"Her family is happy that she is still in LA and wants her around for as long as possible. No one is pushing for her to go back to Cleveland to be with Tristan. This will be her decision to make.\n\n\"There hasn't been any new talk about moving to Cleveland. It seems she isn't moving back right now.\"\n\nDespite not knowing what her relationship with Tristan will look like in the future, the 'Keeping Up with the Kardashians' star is said to be \"very positive\" about what the future holds for her and her daughter.\n\nThe insider told People magazine: \"But one thing is for sure. Khloé seems very happy. She loves being a mom and only leaves True occasionally for work. She seems very positive about her future.\"\n\nThe news comes after sources recently reported the couple's relationship is still \"up in the air\".\n\nA source said earlier this week: \"Khloé is stable, content and very happy with being a mom and with how things are going with True. As for Tristan, things are still quite up in the air between them. Things seem more unstable in the relationship right now. But she's taking it all in stride.\"\n\nKanye West's mental health talk cancelled\n\nCharlamagne Tha God announced that he has postponed his TimesTalk with the rapper - who has previously opened up about his battle with mental health - as he thought having a conversation with the 41-year-old musician wouldn't \"be productive\".\n\nPhoto: Bang\n\nCharlamagne wrote on social media: \"Normalizing being mentally healthy is a conversation that I really wanted to have with Kanye because he's been so vocal about his own mental health struggles. Unfortunately I think to have that conversation with him right now would not be productive and a total distraction from the point of the convo which is to eradicate the stigma of mental health especially in the black community (sic)\"\n\nThe decision to cancel the talk - scheduled for Wednesday - comes a couple of days after Kayne, who is married to Kim Kardashian West, met with President Donald Trump at the White House, wearing a hat emblazoned with Trump's slogan 'Make America Great Again'.\n\nPhoto: Instagram\n\nExplaining why he wore the controversial hat during his visit, Kanye said: \"You know, they tried to scare me to not wear this hat - my own friends. But this hat, it gives me - it gives me power, in a way. You know, my dad and my mom separated, so I didn't have a lot of male energy in my home. And also, I'm married to a family that - you know, not a lot of male energy going on.\n\n\"It's beautiful, though, but there's times where, you know, there's something about-- you know, I love Hillary [Clinton]. I love everyone, right? But the campaign 'I'm with her' just didn't make me feel, as a guy, that didn't get to my dad all the time - like a guy that could play catch with his son.\"\n\nKim Kardashian West's fears for Kanye\n\nKim Kardashian West is worried about her husband Kanye West after his recent outburst in the Oval Office.\n\nKanye, 41, was widely slammed for his bizarre outbursts during a rambling meeting with President Donald Trump in the Oval Office earlier this week and Kim, 37, is becoming increasingly upset about her husband.\n\nA source told PEOPLE: \"Kim is very uncomfortable and unhappy with the whole situation. She finds Kanye brilliant, so it makes her upset when he goes on these public rants and come across as someone who isn't well.\n\n\"It's stressful for her. She knows he isn't healthy right now, but it's impossible to get across to him. All she can do is hope that he calms down mentally soon.\"\n\nKim's famous family is also worried about the rapper.\n\nThe insider said: \"Kim's family thinks he needs help, but Kanye doesn't, so it won't happen. The entire family is at the end of their ropes, and stuff like this won't help. They're trying to help him get things where they should be, and it's going to be that much harder now.\n\n\"No one close to him can tell him that he's sounding unhinged, because his answer is that the President of the United States doesn't think so.\"\n\nMeanwhile, Kanye told Trump during his meeting that he doesn't think he has bipolar disorder and believes he was just battling with \"sleep deprivation\".\n\nHe said: \"What I think is we don't need sentences, we need pardons. We need to talk to people. I was diagnosed with bipolar disorder, I was connected with a neuropsychologist that works with the athletes in the NBA and NFL. He looked at my brain. I wasn't actually bipolar, I had sleep deprivation which can cause dementia 10 to 20 years from now when I wouldn't even remember my son's name.\"\n\nPhoto: AFP\n\nKanye - who has North, five, Saint, two, and Chicago, eight months, with his wife Kim - had previously been open about his bipolar disorder.\n\nHe explained: \"I think it's important for us to have open conversations about mental health - especially with me being black. Because we never had therapists in the black community. We never approached taking a medication. I think it's good that when I had my first complete blackout at age five, my mom didn't fully medicate me. Because I might have never been 'Ye'. And there's times where at least I'm happy that I know [I'm bipolar.]\"\n\nKim West has 'exciting' things to discuss with President Trump\n\nKim Kardashian West says that Kanye West will be meeting with President Donald Trump at the White House next week to discuss some \"exciting things\" the pair \"have been planning\".\n\nThe 'Keeping Up with the Kardashians' star is proud to be able to say that her husband of four years is going to the White House next week to talk with the president and she has been giving him advice on how to best get his point across.\n\nSpeaking to TV show 'Extra' at the Tiffany & Co. launch of the 2018 Tiffany Blue Book collection in New York City, Kim said: \"I try to (give Kanye advice), I will try to help him communicate. I always say he isn't the best communicator, but he has the best heart. I know what he wants to accomplish ... and I can't wait to see that happen.\"\n\nTeasing the topic of conversation, the curvaceous beauty spilled the pair will be discussing the \"city of Chicago and some exciting things that I feel like they have been planning, and I really hope the president listens\".\n\nKim has previously met with President Trump and convinced him to pardon 63-year-old Alice Marie Johnson - who had received a life sentence following a 1996 conviction for a non-violent, first-time drug offence, in which her only role was answering phones. She had served 22 years behind bars.\n\nPhoto: Bang/Instagram\n\nSpeaking about her achievement, she said: \"That was a really good feeling. I always say no matter what your views are, it's not about the politics, it's about the people.\"\n\nKylie Jenner 'is trying for another baby'\n\nReality TV star Kylie Jenner is reportedly trying for another baby.\n\nThe 21-year-old make-up mogul - who has an eight-month-old daughter called Stormi with Travis Scott - is already trying for a second baby with her boyfriend.\n\nA source told Us Weekly: \"They're actively trying for another.\"\n\nKylie and Travis, 26, have been dating since 2017, but the reality TV star recently insisted she's \"definitely not ready\" for another baby.\n\nSpeaking in a Snapchat Q & A with her best friend Jordyn Woods, she said: \"I want another baby, but when is the question, and I'm definitely not ready right this second. When I do, I would love to share more of that with you guys.\"\n\nDespite this, Kylie was happy to admit that she'd love to have another daughter with Travis.\n\nDiscussing potential baby names, she explained: \"I haven't found anything I love love, but I definitely want another girl, hopefully. And I want her to have a feminine name.\"\n\nPhoto: Bang/Instagram\n\nMeanwhile, Kylie revealed recently that she loves seeing Travis and Stormi interacting with each other.\n\nShe said: \"They have this crazy connection and she's definitely a daddy's girl. It's cute to watch. When dad's around, I'm not even there. It's like she doesn't see me, but it's cool.\"\n\nKylie also claimed that becoming a mother had helped her to love herself more than ever.\n\nThe 'Keeping Up with the Kardashians' star explained: \"I feel like having a daughter, and thinking about beauty in the future, has definitely changed me, and I feel like it has made me love myself more and accept everything about me.\n\n\"Even my ears, I always felt like they stuck out too far, and she [Stormi] has the same ears as me and so now I love my ears.\"\n\nKhloe Kardashian 'is holding off moving to Cleveland'\n\nReality TV star Khloe Kardashian is reportedly \"holding off\" on moving to Cleveland to be with Tristan Thompson.\n\nThe 34-year-old reality star and the Cleveland Cavaliers basketball player have been dating since 2016 and have five-month-old daughter True together, yet Khloe is still not ready to make the full-time switch from Los Angeles to Cleveland.\n\nA source explained: \"She isn't ready to leave her family just yet. True will be six months old soon and Khloe plans to spend that special day with her family.\"\n\nThe insider explained that it's recently been hard for Khloe to relive the drama surrounding Tristan through 'Keeping Up with the Kardashians' in the days prior to her giving birth.\n\nThe reality show has aired the allegations that the 27-year-old star cheated on Khloe with multiple women shortly before the arrival of their daughter.\n\nThe source added: \"As much as she's worked on moving past the heartbreak, the reminder brings up some of those emotions again.\n\n\"Khloe will most likely head back to Cleveland, but as of now, there isn't an official date.\"\n\nEarlier this month, an insider claimed Khloe \"still struggles\" with the cheating allegations.\n\nIt was claimed that the incident has eroded the reality star's trust in Tristan.\n\nA source said: \"Khloe has seemed emotional. Her feelings about Tristan cheating is something that she is still dealing with.\n\n\"She has good weeks when she is fine about it and weeks when she is upset about it. It's of course difficult to trust someone 100 percent who cheated days before he was about to become a dad. Khloe still struggles with this sometimes.\n\n\"She wants to move back to Cleveland, but she isn't sure what date she is [going]. The move is postponed for now.\"\n\nFollow Emirates 24|7 on Google News.", "images": ["https://media.emirates247.com/images/shoof-logo.png", "https://media.emirates247.com/images/2018/10/emirates6-73.JPG", "https://media.emirates247.com/images/happiness-icon.png", "https://media.emirates247.com/images/2018/10/emirates6-338.jpg", "https://media.emirates247.com/images/2018/10/emirates6-482.JPG", "https://media.emirates247.com/images/2018/10/emirates6-412.jpg", "https://media.emirates247.com/images/2018/10/emirates6-188.jpg", "https://media.emirates247.com/images/2018/10/emirates6-557.JPG", "https://media.emirates247.com/images/2018/10/emirates6-189.jpg", "https://media.emirates247.com/images/2018/10/emirates6-283.jpg", "https://www.emirates247.com/res/img/press-sector-logo.png", "https://media.emirates247.com/images/2018/10/emirates6-112.jpg", "https://media.emirates247.com/images/2018/10/emirates6-555.jpg", "https://media.emirates247.com/images/2018/10/emirates6-367.JPG", "https://media.emirates247.com/images/2018/10/emirates6-20.JPG", "https://media.emirates247.com/images/2018/10/emirates6-190.jpg", "https://media.emirates247.com/images/albayan_logo.jpg", "https://media.emirates247.com/images/2018/10/emirates6-21.JPG", "https://media.emirates247.com/images/2018/10/emirates6-413.JPG", "https://media.emirates247.com/images/2018/10/emirates6-368.JPG", "https://media.emirates247.com/images/2018/10/emirates6-191.jpg", "https://media.emirates247.com/images/2018/10/emirates6-113.JPG", "https://media.emirates247.com/images/2018/10/emirates6-74.JPG", "https://media.emirates247.com/images/2018/10/emirates6-284.JPG", "https://media.emirates247.com/images/2018/10/emirates6-337.JPG", "https://media.emirates247.com/images/2018/10/2emirates26.JPG", "https://media.emirates247.com/images/emirate_247_logo.jpg", "https://media.emirates247.com/images/2018/10/emirates6-107.jpg", "https://media.emirates247.com/images/2018/10/emirates6-414.JPG", "https://media.emirates247.com/images/2018/10/emirates6-484.JPG", "https://media.emirates247.com/images/2018/10/2emirates14.jpg ", "https://media.emirates247.com/images/2018/10/emirates6-19.jpg", "https://www.emirates247.com/res/img/app_store.png", "https://www.emirates247.com/polopoly_fs/7.106.1453021014!/image/image.png_gen/derivatives/default/image.png", "https://www.emirates247.com/res/img/play_store.png", "https://media.emirates247.com/images/2018/10/emirates6-556.JPG", "https://www.emirates247.com/polopoly_fs/1.675004.1540976895!/image/image.jpg", "https://www.emirates247.com/res/img/google-news-icon.png", "https://collector.effectivemeasure.net/noscript", "https://media.emirates247.com/images/2018/10/2emirates25.JPG", "https://media.emirates247.com/images/2018/10/emirates6-366.jpg", "https://media.emirates247.com/images/eay_logo.jpg", "https://media.emirates247.com/images/2018/10/emirates6-72.jpg", "https://media.emirates247.com/images/2018/10/emirates6-483.JPG", "https://media.emirates247.com/images/2018/10/emirates6-336.jpg", "https://media.emirates247.com/images/dubaipost_logo.jpg"], "top_img": "https://www.emirates247.com/polopoly_fs/1.675004.1540976895!/image/image.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.emirates247.com/entertainment/kuwtk-khloe-kardashian-is-still-undecided-about-her-future-with-tristan-thompson-2018-10-31-1.674036", "title": "KUWTK: Khloe Kardashian is still undecided about her future with Tristan Thompson", "meta_data": {"viewport": "width=device-width, initial-scale=1", "msapplication-tap-highlight": "no", "last-modified": "2018-10-03 08:25:32 GST", "robots": "ACAP allow-index", "author": "Bang", "description": "The 34-year-old reality TV star was recently spotted supporting the NBA player at a basketball game in Cleveland, but the 'Revenge Body' host - who has six-month-old daughter True with Tristan - still isn't sure how long she wants to stay in the city with", "google-site-verification": "gvGASCnV8iZTJPFdQv6c1D7_EB5BTyiF0sCBN-Cy20g", "y_key": "2e2a4541c87dc829", "msvalidate.01": "97B560A2BDDF76982EF1BBF2E5F4DE45", "alexaVerifyID": "cpWRiGeguXPAy-a1KZErjqqRH-w", "fb": {"app_id": 132782903460978, "pages": 136509933034734}, "og": {"site_name": "Emirates24|7", "locale": "en_GB", "title": "KUWTK: Khloe Kardashian is still undecided about her future with Tristan Thompson", "type": "article", "url": "https://www.emirates247.com/entertainment/kuwtk-khloe-kardashian-is-still-undecided-about-her-future-with-tristan-thompson-2018-10-31-1.674036", "image": "https://www.emirates247.com/polopoly_fs/1.675004.1540976895!/image/image.jpg", "description": "The 34-year-old reality TV star was recently spotted supporting the NBA player at a basketball game in Cleveland, but the 'Revenge Body' host - who has six-month-old daughter True with Tristan - still isn't sure how long she wants to stay in the city with"}, "article": {"published_time": "2018-10-31 13:37+0400", "modified_time": "2018-10-03 08:25+0400"}, "twitter": {"card": "summary_large_image", "url": "https://www.emirates247.com/entertainment/kuwtk-khloe-kardashian-is-still-undecided-about-her-future-with-tristan-thompson-2018-10-31-1.674036", "title": "KUWTK: Khloe Kardashian is still undecided about her future with Tristan Thompson", "description": "The 34-year-old reality TV star was recently spotted supporting the NBA player at a basketball game in Cleveland, but the 'Revenge Body' host - who has six-month-old daughter True with Tristan - still isn't sure how long she wants to stay in the city with", "image": {"src": "https://www.emirates247.com/polopoly_fs/1.675004.1540976895!/image/image.jpg"}, "app": {"name": {"iphone": "Emirates24|7", "ipad": "Emirates24|7", "googleplay": "Emirates24|7"}, "id": {"iphone": 786224961, "ipad": 786224961, "googleplay": "com.emirates247"}}}}, "movies": [], "publish_date": 1540915200.0, "source": "https://www.emirates247.com", "summary": ""}