{"url": "https://www.romper.com/p/what-sizes-are-in-bethenny-frankels-new-jeans-line-skinnygirl-jeans-is-not-just-for-skinny-girls-9326639", "text": "If you are a fan of Bethenny Frankel, you know that she and her Skinnygirl brand are everywhere: cookbooks, margaritas, makeup, skincare, and even deli meats. So it would only be a natural evolution for her to jump into the clothing business and she has done just that. Starting on September 10, Skinnygirl Jeans will debut, including jeans, jackets, and sweats. But the brand is called Skinnygirl Jeans, so you may be wondering, \"are they definitely for me?\" Here are the details on the sizes included in Bethenny Frankel's new jeans line so you know if you can grab a few for yourself come September.\n\nAccording to Bethenny, it is her mission to design jeans for all shapes and sizes and the jeans will be available in sizes 24-32 and plus sizes 14W-24W. The jeans have great attention to detail and include black and denim fabric decorated with smoked stones, tuxedo detail, silver chains, and crystals. They'll be designs that are mid-rise and high-rise and as Bethanny said in her Instagram story, they are for all \"ages, shapes, sizes, and races. \"It's all inclusive and plus sizes are on the same rack as a size 0,\" she said in a recent story. Just as she rolled out her Skinnygirl margaritas before developing her vodkas and wines, she hopes that these items are the start of a much larger clothing line.\n\nWith hashtags like #allshapesallsizes and the constant claim that Bethenny wants the women who wear her jeans to feel empowered, it may feel odd that despite coming in sizes up to 32 and including the plus sizes, the line is called \"Skinnygirl.\" The New York Post captured this concern in an article titled, Bethenny Frankel's new Skinnygirl jeans line is incredibly tone-deaf. The article states, \"women today are tired of being told they need to be a size 2 in order to be desirable, happy and fulfilled.\" They mention Ashley Graham and Iskra Lawrence, who have both used their social media platforms to celebrate their curvier figures.\n\nThough she is likely using the name Skinnygirl to capitalize on her other brands (and she is nothing if not brilliant at marketing), there's a risk with the use of the word \"skinny\". Body positivity, being happy with the body you have and not obsessed with the body you want, is on the rise and there could be backlash against a brand of clothing that has the word \"skinny\" in it's name, no matter what sizes it includes. As Chastity Garner, co-founder of theCURVYcon, told Yahoo news, “To me, [Skinnygirl] is a name that means you are trying to look, feel, or achieve being skinny,” she says. “America doesn’t have a good relationship with the word ‘skinny,’ so I think it can be hazardous to women, but especially young girls.”\n\nIs Skinnygirl something to aspire to or does it imply that everyone has an inner skinny girl, not matter what your actual size? “Skinnygirl is a state of mind; it’s about applauding your strength and feeling good about yourself. It is important to me that this line is inclusive of all shapes and sizes, offering women premium denim fits in the most innovative and comfortable fabrics, at a sensible value,” Frankel said in a statement that was reported in Rivet. This may sound good to Frankel, but moms who are careful about the words they use in support of body positivity may steer clear of a brand with \"skinny\" in its name.\n\nWhile the concept of a jean line that is for all shapes, sizes, and ages with a reasonable price point (all items will around $100 or less), great materials, and fun details is exciting, it'll be interesting to see if the aspirational marketing helps the larger sizes sell or if it's only truly skinny girls who will buy into the Skinnygirl concept.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/2/f5e89623-fe59-4002-9924-f54dceb61fd3-getty-1193384895.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/a2bbf078-5f8d-4098-a8a4-1be17f7fd34f-7753e37a-ae95-4b71-b78b-7f56b33a1c57-9781536210224int2.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/7/45b3162b-75a7-42d8-8155-0d02698246ac-getty-948342536.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/7/45b3162b-75a7-42d8-8155-0d02698246ac-getty-948342536.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.romper.com/uploads/image/2018/6/7/dad81106-0066-45c7-883c-bf8af266c48c-bodybuilders_cta.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/3/de3effe5-f78b-402b-acb0-08b52e9acd30-image002-1.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/7/45b3162b-75a7-42d8-8155-0d02698246ac-getty-948342536.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/what-sizes-are-in-bethenny-frankels-new-jeans-line-skinnygirl-jeans-is-not-just-for-skinny-girls-9326639", "title": "What Sizes Are In Bethenny Frankel's New Jeans Line? Skinnygirl Jeans Is Not Just For Skinny Girls", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/what-sizes-are-in-bethenny-frankels-new-jeans-line-skinnygirl-jeans-is-not-just-for-skinny-girls-9326639", "type": "article", "title": "No, You Don't Have To Be A Skinny Girl To Wear Bethenney Frankel's Skinnygirl Jeans", "description": "If you are a fan of Bethenny Frankel, you know that she and her Skinnygirl brand are everywhere: cookbooks, margaritas, makeup, skincare, and even deli meats. So it would only be a natural evolution for her to jump into the clothing business and she…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/7/45b3162b-75a7-42d8-8155-0d02698246ac-getty-948342536.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "If you are a fan of Bethenny Frankel, you know that she and her Skinnygirl brand are everywhere: cookbooks, margaritas, makeup, skincare, and even deli meats. So it would only be a natural evolution for her to jump into the clothing business and she…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}