{"url": "https://www.usanetwork.com/suits/blog/katherine-heigl-joins-suits-as-series-regular-in-season-8", "text": "Emmy Award-winning and two-time Golden Globe-nominated actress Katherine Heigl (Grey’s Anatomy, Knocked Up) has been cast in a new series regular role for Season 8 of Suits!\n\nSet to premiere later this year, Heigl will star opposite Gabriel Macht (Harvey Specter) as Samantha Wheeler -– a talented new partner at Pearson Specter Litt who challenges the status quo and will either become the firm’s greatest ally … or most powerful enemy! Heigl joins the Suits ensemble alongside Macht, Sarah Rafferty (Donna Paulsen), Rick Hoffman (Louis Litt) and new series regular Dulé Hill (Alex Williams).\n\n“Joining Suits was the perfect organic way to not only collaborate with an EP I admire deeply, but to also become part of a show and cast that I am an immense fan of,” shared Heigl. “I have watched Suits from the very beginning and feel incredibly lucky to be the newest member of the Pearson Specter Litt family.”\n\nREAD MORE: Patrick J. Adams on Leaving Suits: Mike Ross Has Taught Me the Power of Believing in Myself\n\n“On behalf of the entire Suits team, I am extraordinarily excited to welcome Katherine Heigl into our family -- I have always been a big fan of her work and was delighted to discover she was an avid Suits fan herself,” expressed Aaron Korsh, creator and executive producer of Suits. “I cannot wait to have her come play with our entire cast and crew. Unfortunately, the same cannot be said for Harvey, Louis, Donna, and Alex as the mysterious Samantha Wheeler is a direct threat to their status quo. One thing is for sure -- Samantha's wit, charm, loyalty, strength, and vulnerability will all be put to the test as she muscles her way into the firm currently known as Pearson Specter Litt.”\n\nSeason 8 of Suits begins production this April in Toronto. Season 7 resumes this spring, with new episodes premiering on USA Wednesday, Mar. 28 at 9/8c!\n\nCount down to the Suits premiere with the official Louis Litt 2018 Calendar. Download and print your own to GET LITT UP in 2018!", "images": ["https://www.usanetwork.com/", "https://www.usanetwork.com/sites/usanetwork/modules/contrib/lazyloader/loader/loader-7.gif", "https://www.usanetwork.com/sites/usanetwork/files/2018/01/suits_promo_KatherineHeigl_1920x1080.jpg"], "top_img": "https://www.usanetwork.com/sites/usanetwork/files/2018/01/suits_promo_KatherineHeigl_1920x1080.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.usanetwork.com/suits/blog/katherine-heigl-joins-suits-as-series-regular-in-season-8", "title": "Katherine Heigl Joins Suits as Series Regular in Season 8", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "fb": {"app_id": 241079750077}, "description": "Katherine Heigl (Grey’s Anatomy) has been cast in a new series regular role for Season 8 of Suits. Read about her new character, Samantha Wheeler!", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "USA Network", "type": "article", "url": "https://www.usanetwork.com/suits/blog/katherine-heigl-joins-suits-as-series-regular-in-season-8", "title": "Katherine Heigl Joins Suits as Series Regular in Season 8 | Blog | Suits | USA Network", "description": "Katherine Heigl has been cast in a new series regular role in Suits. Read about her new character, Samantha Wheeler, who will appear in Season 8 later this year!", "updated_time": "2018-01-31T15:06:17-05:00", "image": "https://www.usanetwork.com/sites/usanetwork/files/2018/01/suits_promo_KatherineHeigl_1920x1080.jpg"}, "twitter": {"site": "@USA_Network", "url": "https://www.usanetwork.com/suits/blog/katherine-heigl-joins-suits-as-series-regular-in-season-8", "title": "Katherine Heigl Joins Suits as Series Regular in Season 8", "description": "Katherine Heigl (Grey’s Anatomy) has been cast in a new series regular role for Season 8 of Suits. Read about her new character, Samantha Wheeler!"}, "article": {"published_time": "2018-01-31T14:19:23-05:00", "modified_time": "2018-01-31T15:06:17-05:00"}}, "movies": [], "publish_date": 1517426363.0, "source": "https://www.usanetwork.com", "summary": ""}