{"url": "https://ew.com/recap/the-arrangement-season-1-episode-2/", "text": "Image zoom Daniel Power/E!\n\nThe Arrangement S 1 E 2 type TV Show network E!\n\nLast week, our girl Megan Morrison had a LOT going on: She dumped her boyfriend, she booked a big movie role… oh, and she signed a $10 million marriage contract with Kyle West. What a roller coaster! But this week, her drive is clear and simple: Megan is horny!\n\nShe’s clearly enjoying her new life as the future Mrs. Kyle West. We know this because we see her smiling in Kyle’s shower in between aspirational close-ups of the fancy faucets. This house is luxe AF! Megan steps out of the shower, ready for some lovemaking with her fiancé, but she’s interrupted by his assistant Ben. Ben keeps showing up right when Megan’s feeling frisky; he’s a real boner killer, but he’s also great at managing the details for her upcoming jaunt to the Venice Film Festival for Kyle’s big premiere of the priest/war movie AWOL.\n\nDavid Miscavige Terence Anderson is supposed to skip Venice to stay home and work on his new book for Scientology The Institute of the Higher Mind (IHM). He’s sending his wife Shelly Miscavige Deann (also Kyle’s producing partner) along in his place. But when Deann stops by his office to discuss the trip, the dialogue that ensues is downright puzzling. Do yourself a favor: grab your favorite scene partner and read this one out loud for a fun segment of The Arrangement theatre.\n\nDEANN: “I see you’ve made plans to join us in Venice.”\n\nTERENCE: “That’s because I couldn’t bear the thought of being here without you.”\n\nDEANN: “Hmm, I imagine that must be very hard for you.”\n\nTERENCE (pressed against her): “It’s getting hard for you actually.” (Why is everyone so horny this week?!)\n\nDEANN: “You’re mirroring me.”\n\nTERENCE: “Does it feel as false for you as it does for me?”\n\nI had to re-watch this doozy five times before I realized that Deann is saying “You’re mirroring me” (apparently an IHM mind-control technique) even though it definitely sounds like she’s saying “You’re marrying me,” which would be a real curve ball. (Wha? They’re not married? He says it feels false? Do they have an Arrangement too?! I don’t know what’s real anymore!) I blame this confusion on Lexa Doig’s Canadian accent (the show is filmed in Vancouver, and not to brag, but I have a Canadian boyfriend, so I consider myself an expert on detecting Canadian accents. My boyfriend disagrees). Moving on!\n\nBack at Megan’s place, her friend Hope and her other friend (whose name I cannot for the life of me figure out) squeal as Megan shows off the fancy dresses she’ll be wearing in Venice, thanks to Kyle’s IHM-sponsored stylist. (Apparently Megan still has her place and her friends! I’m sure that’ll all be changing soon.) But their fun makeover montage is interrupted by Megan’s ex-boyfriend Nic (the scruffy rocker dude who cheated on her last week). Nic just heard about this Kyle West thing, and he’s pissed!\n\nMegan and Nic step outside to scream at each other. (Imagine walking your dog in the early aughts and spotting Katie Holmes and Chris Klein in a front-lawn fight. Simpler times! But honestly I’d love to see them back together.) Nic reminds us that Megan has a shady secret from her past that’s sure to come back and bite her: “Kyle West is a movie star! He’s just looking for some nobody-hot-actress to keep him warm for a week. And he’s gonna be real bummed when he finds out you can’t even do that!” (No one has ever sounded more Canadian than this guy saying this line. Ever. My Canadian boyfriend agrees.)\n\nJust as Kyle, Megan and Deann are leaving for Venice, Terence gives Megan a warning: Nicole Kidman Lisbeth Graves is gonna be there, and it’s gonna be awkward, and she needs to watch what she does with her face with all those photographers around! That means no sad faces and no angry faces. “Be mindful,” he warns her gravely. “Bye bitch,” she basically replies.\n\nNEXT: Megan is foiled again\n\nAt the festival, Megan sits in the audience for the final scene of AWOL: Music swells as we zoom in on a bloodied Kyle (clutching his cross, wearing his priest collar), uttering his final word: “Maria…” She’s moved to tears and tells Kyle afterward, “Your acting inspires me.” And she hasn’t even begun her IHM mind-training yet!\n\nDeann reminds them they have an important film festival cocktail thing, but in one of SEVERAL montages set to clearable pop music, Kyle and Megan play hooky and sneak out into the streets undercover: Hats! Trench coats! Fake mustaches! They walk through the canals, swept up in the beauty of Venice, and Kyle asks Megan that timeless question that Italian lovers have been asking for centuries: “What was your first concert?” (Megan’s answer: Backstreet Boys. Mine: Cyndi Lauper. My mom is amazing!) Kyle surprises Megan with dinner on a boat he has chartered, or something, and she swoons. More clearable pop music kicks in as they sip champagne, French kiss each other, and stare at the sea meaningfully. Once again, Megan just wants to lovemake… but Kyle’s gotta get back to work.\n\nSome actress/new IHM recruit, Annika, keeps calling Deann to remind us that they’re up to no good, and to tell Deann she’s not happy with these headlines she’s seeing about Kyle and Megan’s whirlwind romance. And finally we learn Kyle and Megan’s celeb-name portmanteau: KYGAN. (Sounds like your worst friend’s toddler’s name, right? Although in retrospect, “TomKat” wasn’t so great either. Also, I believe that my queen Jen Aniston chose Justin Theroux primarily because their names could not be mashed-up in a catchy way. Go ahead and try. Theraniston? Jenstin? Justifer? Actually Justifer’s not the worst…)\n\nKyle does a Skype meditation/auditing sesh with Terence. (Can we just call him “Terry” for fun? Let’s LIVE, you guys!) Terry tells Kyle to take all that anxiety he’s feeling about running into Lisbeth, put it into an invisible clay ball in his hands, and then put that clay ball of feelings down on the table and leave it there. Seems like… kind of good advice?\n\nMegan’s not having the best time at the festival. There’s a tense run-in with Kyle and Lisbeth, and a photographer catches Megan’s stank-faced reaction. (The media eats it up: Is Kygan on the rocks already?!) Lisbeth walks in on Megan taking bathroom selfies, and when Megan tries to break the ice, Lisbeth tells her she’s not here to make friends. (Nicole Kidman would never!) And back at the hotel, when Megan tries to seduce Kyle wearing nothing but a masquerade mask, he falls asleep. The poor girl just wants to bone!\n\nBut Megan does make a friend at the festival: free-spirited indie actress Daisy Something (Brit Morgan). Daisy and her friends insist that Megan come party with them. Megan’s in her Lululemons, ready to use the hotel gym, but throws caution to the wind, shoots her sleeping fiancé a text, and goes to the clerb. She does a few shots, but when Daisy and her friends start making fun of sellout Kyle West (they’re the only ones in Venice who don’t know about Kygan yet), Megan decides to call it a night and heads back to the hotel.\n\nMegan is followed by a sweaty, leering local dude who is pretty much the most grotesque Italian caricature ever: “Hey, American girl like to party! Mafia pasta sexy time gimme kiss American girl!” (My Canadian boyfriend is also Italian, and during this scene he announced he’ll no longer be watching The Arrangement with me. I’m bummed, but in his defense, he’s been missing Feud for this thing.)\n\nKyle comes to the rescue, chases the Italian guy away, and yells at Megan for leaving the hotel. A paparazzo captures their argument, Kyle punches the guy’s lights out, and Deann steps in to pay him off. Back at the hotel, Kyle broods over the paparazzo incident and Megan comforts him lovingly. And then finally – FINALLY! – they lovemake by the fire.\n\nThe next morning, Megan is standing on the sidelines watching Kyle’s press junket when Terry rolls up. Ugh! He’s not pleased with the recent Kygan stories about Megan making a sad face – he warned her not to make a sad face! – and threatens to terminate the contract. And just when Megan is about to be like, “Um, no, bitch,” Terry pulls out his phone: He’s got Megan’s bathroom selfie! Her friend Hope tweeted it! Or something. It’s unclear… but it’s not good. He tells her she needs to manage her problem with authority. And we’re left wondering: Is this what Trump says to Kellyanne? Or, more importantly, is this what Miscavige said to Leah Remini? Which brings me to the most important question of them all, a question I’ll keep shouting from the rooftops until we have an answer: Where’s our Leah Remini cameo?!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg", "keywords": [], "authors": ["Matt Mcconkey", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/recap/the-arrangement-season-1-episode-2/", "title": "The Arrangement recap: Season 1, Episode 2", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Christine Evangelista,E,Josh Henderson,Michael Vartan", "news_keywords": "Christine Evangelista,E,Josh Henderson,Michael Vartan", "description": "Megan joins Kyle for his premiere at the Venice Film Festival.", "og": {"title": "'The Arrangement' Recap: Kygan Goes to Venice", "type": "article", "site_name": "EW.com", "url": "https://ew.com/recap/the-arrangement-season-1-episode-2/", "description": "Last week, our girl Megan Morrison had a LOT&nbsp;going on: She dumped her boyfriend, she booked a big movie role… oh, and she signed a&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/recap/the-arrangement-season-1-episode-2/", "description": "Megan joins Kyle for his premiere at the Venice Film Festival.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/recap/the-arrangement-season-1-episode-2/", "title": "'The Arrangement' Recap: Kygan Goes to Venice", "description": "Megan joins Kyle for his premiere at the Venice Film Festival.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F03%2Fnup_174905_1045-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}