{"url": "https://www.washingtonpost.com/business/economy/he-helped-halle-berry-and-taraji-henson-to-stardom-now-9-minority-women-are-accusing-him-of-sexual-harassment/2018/02/02/259e8196-f590-11e7-b34a-b85626af34ef_story.html", "text": "When the call ended, Lamison began reciting a poem she had written. Midway through her performance, she said, Cirrincione grabbed her and started kissing her, sticking his tongue in her mouth.\n\nAD\n\nAD\n\nShe said he told her that he could take her on as a client, on the condition that he would get to see her for sex whenever he wanted. She said she pushed him away and left.\n\nLamison is among nine women — eight African Americans and one Asian American — who have told The Washington Post that Cirrincione made unwanted sexual advances toward them over a period of two decades. Several said they viewed Cirrincione, who is white, as an important gatekeeper for black actresses in an industry notoriously difficult to break into — one whose path is even more narrow for minorities. They said he took advantage of that dynamic to prey upon young women of color seeking an entry into Hollywood.\n\nThree of the women say that he pushed for sex as a condition for representing them, and that he did not take them on when they refused. A fourth said he offered to help advance her career if she agreed to have sex with him monthly. A fifth actress said he masturbated in front of her in his office during the years he managed her.\n\nAD\n\nAD\n\nThe Post interviewed each of the women separately, multiple times over a three-month period, as well as friends, family members and others in whom the women said they confided aspects of their interactions with Cirrincione. The earliest allegation of inappropriate conduct was in 1993, and the most recent in 2011.\n\nCirrincione said in a statement that he accepts responsibility for pursuing sexual relationships but denies allegations that he sought sexual favors in exchange for representing actresses.\n\n\"We live in a time where men are being confronted with a very real opportunity to take responsibility for their actions. I support this movement wholeheartedly. I have had female clients and employees my entire career in this industry. I have built a reputation for advancing the careers of women of color,\" Cirrincione said.\n\nAD\n\nAD\n\n\"I have had affairs while in committed relationships, ones I am now ashamed to say are coming to light and shading my past and my reputation. I can say without a doubt that I have never used favors, sexual or otherwise, as a reason for managing anyone. I want to make it clear that not one of those relationships were anything but consensual.\n\n\"I take responsibility for my part in the situation and I am not here to diminish anyone's feelings or experiences. I apologize to these women, my past and present partner, my clients and employees for the pain this is bringing them. I was under the impression I was living my life as a supportive man to women. It is with a heavy heart that I see now I was wrong.\"\n\nThe nine women distinguished Cirrincione's behavior from Harvey Weinstein's, which included accusations of rape that the Hollywood titan has denied. None have made criminal allegations against Cirrincione or sought legal recourse. Six did not want their names published out of concern for their families and relationships in the industry; some have friends who continue to be represented by Cirrincione.\n\nAD\n\nAD\n\nThe women's allegations portray a pattern of sexual harassment dating back to the early 1990s, when Cirrincione, now 70, ran his fledgling management career out of a New York City apartment building. Six of the women, including an Asian American model, say they have abandoned their acting careers or took extended breaks from the business in part because of their encounters with Cirrincione, who they say shattered their confidence and sense of self-worth.\n\nAll of the women say they sought his representation because of his reputation for boosting the careers of black actresses such as Berry and in later years Taraji P. Henson, clients whose names and film achievements the women say he dangled before them as bait.\n\nOne of the actresses said that during her audition for Cirrincione in the early 2000s, he told her she reminded him of Berry when Berry was starting out.\n\nAD\n\nAD\n\n\"Of course that was like your dream to have Halle Berry's manager say, 'Oh, my God, you remind me of Halle,' \" said the woman, who is now a fashion and lifestyle blogger.\n\nShe said Cirrincione called her after the audition to tell her that she wasn't quite ready for his agency but that he would help her get new headshots and appear with her at industry events to introduce her to the right people — on the condition that she sleep with him once a month.\n\n\"He said it so matter-of-factly, like we were just going to get coffee,\" she said.\n\nHe told her to think about his offer, she recalled. When she did not follow up, she said he called a week later to apologize, told her she was a \"good girl\" and asked her to \"forget what we talked about.\" A friend in whom she confided at the time said that she had told him about the conversations with Cirrincione.\n\nAD\n\nAD\n\nAnother actress who met Cirrincione in 2005 during the Los Angeles premiere party of \"Hustle & Flow,\" featuring Henson, said the manager invited her to audition for him. She was 36 at the time, with no television or film credits. She said he told her during her audition that he was the only manager who knew what to do with black actresses.\n\nShe said he told her he could change her life if he signed her — just as he had for Berry and Henson. Then she said he propositioned her, saying that would be part of their business deal. She told him she was not interested. The woman's sister and then-boyfriend said she described the incident to them immediately after it occurred.\n\nWhat Cirrincione seemed to represent\n\nTo the women, Cirrincione had represented their best hopes of breaking in and making it in a fiercely competitive industry rife with racial discrimination. Of the top 168 U.S. films ranked by global box office performance in 2015, only 11 leading roles were played by black actors, compared with 145 by white actors, according to data analyzed by an author of UCLA's 2017 Hollywood diversity report. Black women starred in two films; white women starred in 44.\n\nAD\n\nAD\n\nCirrincione's reputation for seeking sexual relationships with aspiring stars was an open secret in Hollywood, the women said — one they learned about only after their encounters with him. One actress, upon confiding her experience to her acting teacher years later, said the teacher immediately identified Cirrincione without the actress having named him. Two women said they later heard about other actresses' experiences with Cirrincione, one from her manager and the other from her attorney.\n\nThe women interviewed by The Post said they stayed silent for years about the harassment they said they endured because they feared repercussions to their careers and reputations. Several said they had also experienced sexual harassment and assault by other men in the industry. They said they knew of no reporting mechanism at the time to hold the men accountable for their behavior.\n\n\"Any kind of sexual misconduct or harassment that's talked about from women is automatically suspect,\" said Lamison, who runs a program to cultivate more women and minority directors. \"For black women, it seems like we are even more marginalized when it comes to something like that. Historically, how we have been treated and looked at — and to some degree oversexualized — makes it difficult.\"\n\nAD\n\nAD\n\nThe women said that the national reckoning set off by the accusations against Weinstein and other powerful men in Hollywood have given them courage to publicly share their experiences and that they hoped their stories would help young minority women navigating the industry.\n\nBerry, who had joined fellow actresses in donning black gowns at the Golden Globe Awards in January as part of Hollywood's Time's Up movement against workplace sexual harassment, said in a statement that she ended her relationship with Cirrincione more than three years ago after learning of a misconduct allegation against him.\n\n\"Over three years ago, a woman was on the radio saying that Halle Berry's manager was her worst casting couch experience ever. That news literally stopped me in my tracks. I immediately confronted Vince about it, and he denied it completely. But even with his denial, something didn't feel right in my spirit, and with the possibility that it could be true, I immediately ended our over-25-year relationship,\" Berry said.\n\nBerry did not hear the woman's name and could not remember the radio program, according to her representative.\n\nCirrincione said he does not recall any confrontation with Berry over the program.\n\n\"I never heard that from Halle. We never had a discussion. I'm totally shocked. It's not like she left me abruptly,\" Cirrincione said in an interview.\n\nBerry said she was \"saddened\" to learn of more allegations of sexual harassment against her former manager.\n\n\"While Vince never made an inappropriate gesture toward me, nor did I hear about this type of behavior from any woman or man while we worked together, I have always had a no-tolerance policy when it came to such matters,\" Berry said. \"My heart goes out to any person who is subject to this type of behavior, and I stand in support of their strength and bravery.\"\n\nBerry, a Miss USA first runner-up, met Cirrincione in 1988 after one of his soap opera clients recommended her for a part calling for a young black actress.\n\nTo this day, Berry is the only black woman to have won the Academy Award for best actress in a leading role. The biracial actress has publicly credited her success to Cirrincione, calling him her \"secret weapon\" in a 2002 New York Times interview. He's even helped her land parts written for white women, in \"The Flintstones\" and \"The Last Boy Scout.\"\n\nCirrincione and Berry co-produced \"Introducing Dorothy Dandridge,\" a 1999 HBO film about the tragic life of the first African American woman to be nominated for a best actress Oscar.\n\nHenson, an Oscar-nominated actress whose career Cirrincione has managed for two decades, said in an interview that she has never heard of nor witnessed any inappropriate behavior by Cirrincione toward women.\n\n\"I've never had any issue with this on any level,\" Henson said. \"He totally respected me.\"\n\nHenson, who produced and stars in the new action film \"Proud Mary,\" said she regarded Cirrincione as a \"father figure\" who helped her rise in Hollywood. She said he would at times pay for her rent, child-care fees and, later, her son's school tuition.\n\n\"He saw a single mother trying to make her dreams come true, and he nurtured that,\" Henson said. \"He wrote checks and wouldn't ask for anything in return. It wasn't coming from a creepy place. If anything, it empowered me. Like this man believes in me. I love him for that.\"\n\nHenson said she does not view Cirrincione as an all-powerful gatekeeper for black women in the industry but, rather, that he was especially supportive of black women.\n\n\"He is always brutally honest with me about black women's space in this industry,\" Henson said, referring to him preparing her for lower pay and limited leading roles because black women were not seen as appealing in the overseas market. \"I just looked to him as a man who understood the black woman's plight in the industry. I never looked at him as a magical, mythical creature.\"\n\n\"He would say: 'I did this with Halle, because I know how the game is played. We have to carve your own lane. You have a voice out here,' \" she said. \"He didn't sugarcoat how hard it is here for us. We just have to keep fighting, and one day the doors will open.\"\n\nCirrincione has also been Henson's producing partner. Henson's publicist, Pam Sharp, is Cirrincione's longtime girlfriend.\n\n'He held the keys to the kingdom of access'\n\nThe women who spoke about their experiences with Cirrincione said that the alleged sexual misconduct had lasting effects on their personal and professional lives. \"You have people who say he just made a pass, that he was just making an offer. But that's not just what happened,\" said Lamison, whose mother also recounted Lamison's experience. \"He is abusing his power in a way that is really damaging.\"\n\nSome of the women have moved into behind-the-scenes roles in Hollywood or left the industry. Three said they have undergone years of therapy as a result of Cirrincione's behavior.\n\nLamison, a screenwriter, director and producer, runs her own foundation pairing seriously ill children with Hollywood figures to create short films. She produced and stars in \"Last Life,\" a film premiering this month at the Pan African Film Festival.\n\nIn one of the earliest allegations of Cirrincione's sexual misconduct with aspiring actresses, which predates when Berry's career — and his — took off in Hollywood, former stage actress Letha Remington recalled what she describes as an inappropriate meeting when she sought his representation in 1993, a time when the manager was based out of an apartment building on West 55th Street and Eighth Avenue in New York.\n\nDuring their third meeting, Remington said Cirrincione began caressing her shoulders and told her he was lonely because his wife at the time was a nurse who worked nights. He did not explicitly proposition her, but when Remington spurned his advances, he told her that he could not represent her.\n\n\"It made me feel like I had to be clever enough to maneuver around that and get the opportunity that I needed to make it on my own talent, not on sleeping with somebody,\" Remington said. Her daughter said in an interview that Remington shared the story about brushing off Cirrincione's advances years ago.\n\nIn one of the most recent allegations, a biracial actress said she sent her headshot to Cirrincione in 2010, after other managers told her they already had a \"mixed girl\" or that they did not know how to pitch her.\n\nAfter several visits to his office, the actress said that Cirrincione invited the then-28-year-old woman to a small gathering at his house, but when she arrived, they were alone.\n\nShe recalled Cirrincione sitting across from her on the floor and recounting the early days of Berry's career. She said he pointed out a children's play structure in his yard that he said was for Berry's daughter. She opened up to him about the sexual and physical abuse she had endured as a child, her mother's suicide, her own depression and the abusive relationships she has been in as an adult.\n\nShe said he told her he could make her a star like Berry, Henson and Annie Ilonzeh, an actress in the short-lived television remake of \"Charlie's Angels.\" Then she said he tried to kiss her and pulled her breasts out of her shirt. She claimed he unzipped his pants, took out his penis and asked her to spit on it.\n\nWhen she recoiled, she said he told her he did not know what the big deal was, adding that all his actresses participate, and pushed her head down toward his lap.\n\n\"In my mind, I was like, just get the representation. Just get past this,\" she said. So she pretended she was playing a role. She said she spit on his penis while he masturbated. Afterward, she said he told her not to feel bad and bragged about his sexual relationships with the women he represents.\n\nShe said Cirrincione repeatedly asked her to return to his office to read for him over the course of several months. During those visits, she said he would grope her breasts and tell her how he masturbated to a short film she had submitted. But he never took her on as a client, leaving her feeling exploited, unworthy and broken, she said.\n\nFour people in whom she confided at the time remembered the conversations.\n\n\"I had a lot of fears he was blacklisting me,\" she said. \"He played the 'I'm the father to all black actresses' role. It's kind of like being a kid when somebody takes you aside that you trust and starts molesting you.\"\n\nPeppur Chambers, who created, produced and acted in a burlesque group called the Brown Betties, said Cirrincione invited her to his home in 2011 after she approached him to produce her show.\n\nAs they sat on the couch watching one of his client's television shows, she said he tried to kiss her but she turned and his lips landed on her head.\n\n\"In my head, I was like: 'This is dumb. Why am I even here?' \" Chambers said. \"I remember feeling like I'm going to take this for the team. You feel like you're selling your soul for what you want.\"\n\nChambers, 47, said she felt she had little choice but to tolerate his advances because Cirrincione had agreed to invest as an executive producer of her dinner theater cabaret. And while she never reciprocated, she said she felt complicit simply by continuing to meet with him for at least four months. The show's co-producer said that Chambers had shared details of her experience with Cirrincione at the time it occurred.\n\nOne writer and filmmaker whom Cirrincione represented in the mid-1990s said she continuously dodged a barrage of sexual propositions from him during the decade she worked with him.\n\n\"It was always sex all the time with Vincent — wanting sex, wanting to know about sex,\" she said.\n\nHer attorney recalled the woman's discomfort with Cirrincione's advances during the years they worked together.\n\nThe writer and filmmaker said she continued working with him because having Cirrincione as her advocate was invaluable for her career.\n\n\"He was the doorway that I took. He held the keys to the kingdom of access,\" she said. \"He was a champion for me at a time when nobody was a champion for black women. Hollywood is so much about who's in your corner and who is helping you. As a woman of color, we don't have a lot of allies, and we don't have a lot of opportunities.\"\n\nThe price was suffering in silence, with repercussions that lasted years beyond their partnership, the woman said.\n\n\"I had to kind of keep the truth a secret,\" she said. \"The price I paid for having my good professional relationship with him was giving up my sense of self, of wholeness, of personal worth.\"\n\nOne actress who said Cirrincione represented her for more than a decade beginning in the 1990s alleged that he masturbated at his desk during many of their meetings.\n\n\"I let him sit there and masturbate, thinking this is crazy. I wondered if I was dressed inappropriately,\" she said.\n\nShe said over the years, Cirrincione used Berry's rising celebrity as a carrot. When Berry won her Oscar for best actress for \"Monster's Ball\" in 2002, the woman said Cirrincione told her to stick with him because he would help position her for an Oscar, too.\n\n\"Halle was definitely part of his play, and now Taraji is,\" she said.\n\nProfessionally, she said she was doing well under his management. He booked auditions. He got her in the right doors. He paid for headshots and acting classes. She was working.\n\nShe said she felt conflicted when other actresses asked her to recommend them to Cirrincione. \"There was always a knot in my stomach,\" she said. \"I'd always have a soft prelude, telling them he's flirty, know your boundaries, protect yourself.\"\n\nShe said she never told anyone at the time about Cirrincione's behavior because she rationalized that it was not the worst thing that could be happening to her. He wasn't raping her, she figured; he was just a \"little perverted.\"\n\nAfter allegations of Weinstein's sexual misconduct surfaced, she shared aspects of her encounters with Cirrincione with two friends, who recounted the conversations.\n\n\"Protecting him was protecting me and my dreams and my career,\" she said. \"I wanted to be a famous actress, and maybe this is something I just had to do in that pursuit.\"", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/b1926fd4-69f8-4173-bf17-393b5820a888.png&w=90&h=90", "https://www.washingtonpost.com/resizer/n6wj64agvfO0ySsMOX2oM9ARo_U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ML6HBVAHSII6RFHI5C4GACW6EM.jpg"], "top_img": "https://www.washingtonpost.com/resizer/n6wj64agvfO0ySsMOX2oM9ARo_U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ML6HBVAHSII6RFHI5C4GACW6EM.jpg", "keywords": [], "authors": ["Tracy Jan", "Reporter Covering The Intersection Of Race", "The Economy"], "canonical_link": "https://www.washingtonpost.com/business/economy/he-helped-halle-berry-and-taraji-henson-to-stardom-now-9-minority-women-are-accusing-him-of-sexual-harassment/2018/02/02/259e8196-f590-11e7-b34a-b85626af34ef_story.html", "title": "He helped Halle Berry and Taraji Henson to stardom. Now 9 minority women are accusing him of sexual harassment.", "meta_data": {"description": "Manager is accused of taking advantage of black women trying to overcome Hollywood’s racial barriers.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/business/economy/he-helped-halle-berry-and-taraji-henson-to-stardom-now-9-minority-women-are-accusing-him-of-sexual-harassment/2018/02/02/259e8196-f590-11e7-b34a-b85626af34ef_story.html", "image": "https://www.washingtonpost.com/resizer/n6wj64agvfO0ySsMOX2oM9ARo_U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ML6HBVAHSII6RFHI5C4GACW6EM.jpg", "title": "He helped Halle Berry and Taraji Henson to stardom. Now 9 minority women are accusing him of sexual harassment.", "description": "Manager is accused of taking advantage of black women trying to overcome Hollywood’s racial barriers."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "He helped Halle Berry and Taraji Henson to stardom. Now 9 minority women are accusing him of sexual harassment.", "description": "Manager is accused of taking advantage of black women trying to overcome Hollywood’s racial barriers."}, "last_updated_date": "2018-02-05T12:14:25.866Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1517500800.0, "source": "https://www.washingtonpost.com", "summary": ""}