{"url": "https://astrologyanswers.com/article/let-astrology-help-you-discover-your-best-spring-fashion-trend/", "text": "Your 2019 Spring Style, Based on Your Zodiac Sign\n\nPosted on April 10, 2019 Share\n\nAs a season, spring is the time of rebirth; is the first equinox of the New Year, and brings a renewed energy to the world. This makes it the perfect time to start making exciting new changes to your life - including updating your wardrobe! Read on to find out which style is, ahem… tailored to fit your zodiac sign.\n\nWhat’s Your Zodiac Sign’s 2019 Spring Style?\n\nAquarius - Streetwear Stylin’\n\nAlways one step ahead of the rest of the pack, Aquarius is the perfect fit for this forward-thinking fashion trend. With a focus on light materials, neutral color tones and athleisure pieces, streetwear has an effortlessly cool aesthetic that appeals to this Air sign. With slight influences from early 2000’s hip hop mixed in as well, it’s still got a little bit of a quirky edge which suits off-beat Aquarius just fine.\n\nKey pieces: pullover windbreaker, bicycle shorts, t-shirt dress, oval sunglasses, running shoes\n\nPisces - French Twist\n\nThis Water sign should say ‘oui!’ to a Parisian influenced wardrobe update for spring. The romantic detailing, classic silhouettes and delicate colors of this trend are well suited for dreamy, laidback Pisces. Plus, their appreciation for beauty means they’ll find constant inspiration from their closet. Since they’re not a big fan of taking risks, this timeless style might be one for Pisces to fall in love with forever.\n\nKey pieces: bow-neck blouse, cropped slim pants, polka dot wrap dress, wide headband, ballet flats\n\nAries - Rock n’ Ready to Wear\n\nAs bold and brash as a punk concert, Aries does not shy away from making a commotion, whether it’s with their attitude or wardrobe. Pump up the volume on your style this spring by giving it a little heavy metal treatment. The dark color palette, durable textiles, and minimalist detailing all suit this Fire sign’s high energy attitude, while still letting everybody know you’re the cool kid on the block. Rock on Aries!\n\nKey pieces: band tees, high waist denim, motorcycle jacket, aviators, biker boots\n\nTaurus - Pretty & Polished\n\nTell ‘em you mean business without saying a word, Taurus. The luxe fabrics, conservative cuts and attention to detail of this wardrobe update is the perfect match for your level disposition, without being drab. What really elevates this trend is the quality of the pieces, something that suits this Earth sign’s love of luxury well. Choosing bright colors and bold patterns keeps it modern and avoids being too rigid.\n\nKey pieces: Mandarin collar blouse, palazzo pant, unstructured blazer, paper bag purse, kitten heels\n\nGemini - Festival Friendly\n\nLife’s a permanent vacation when you have the breezy, easygoing disposition of a Gemini. You’re a total social butterfly who loves new experiences, so be ready for any event by working edgy, festival inspired pieces into your wardrobe. Much like this Air sign’s flexible nature, the items you buy should be able to adapt to any situation - since a Gemini would never commit themselves to settle for just one thing!\n\nKey pieces: lace t-shirt, high/low chiffon skirt, maxi dress, tasseled purse, gladiator sandals\n\nCancer - Bohemian Rhapsody\n\nWe all know this Water sign can be a little nostalgic, so what better trend for them than something totally vintage? Even with the retro nature of boho styling, this look can still be fresh and current as long as Cancer carefully chooses their silhouettes and avoids anything too dated - leave the crocheted bags in the ’60s! The best part of this trend is it allows Cancer to go thrifting, a secret guilty pleasure of theirs.\n\nKey pieces: white crepe top, corduroy shorts, baby doll dress, fringed purse, cork wedge heels\n\nLeo - Socialite Chic\n\nLeo, you have got star quality and you’re ready to let everybody know it with this Hollywood influenced trend. Chances are your look is already pretty attention-grabbing, but this wardrobe update takes it up a notch by investing in better quality pieces - you deserve luxury, Leo. As a Fire sign, you’re also confident enough to pull off the bright colors, eye-catching materials, and figure-hugging fits that this style boasts.\n\nKey pieces: satin bomber jacket, pleather leggings, bodycon dress, oversize sunglasses, suede booties\n\nVirgo - Nautical or Nice\n\nYou may be low-profile Virgo, but that’s because you’re classic, with a conservative sensibility and love of simpler things in life. This makes the nautical trend great for you, due to its versatility and functional styling. Being an Earth sign means you’re fairly practical, so the benefit of this wardrobe update is all the pieces you buy will not only look good but wear well too - no cheap materials or fussy detailing here.\n\nKey pieces: striped crew neck tee, denim shorts, navy romper, straw hat, boat shoes\n\nLibra - 90’s Throwback\n\nWho else could strike the right balance between vintage and contemporary other than Libra? The 90’s trend is still going strong, which gives this Air sign the perfect opportunity to revel in ‘having it all’ - a wardrobe that is unconventional yet still practical. With a bold color palette, comfortable materials and playful patterns, Libra can achieve perfect harmony between their need for creativity and seriousness.\n\nKey pieces: graphic tees, denim overalls, floral pinafore dress, mini purse, chunky sneakers\n\nScorpio - Gender-Bent\n\nPerfect for the sign defined by transformation, menswear is the right trend for Scorpio to reinvigorate their style. The nature of these pieces is so appealing to this Water sign because they love pushing boundaries and having a little mystery about them. To keep this look from becoming totally tomboy though, Scorpio should focus on softer materials, and keep the tailoring precise to show off their shape.\n\nKey pieces: tuxedo style jacket, drop crotch joggers, linen shirt dress, newsboy cap, oxfords\n\nSagittarius - Banjee Babe\n\nThe banjee style is a little rebellious, but also a whole lot of fun - and doesn’t that just sum up Sagittarius perfectly? Influenced by urban New York culture, this trend is cutting edge and attention grabbing which makes it the right fit for a Fire sign. There’s a certain swagger needed to pull off this wardrobe update, and Sag’s fearless attitude is a match made in sartorial heaven. Just be sure to keep it classy, not crass.\n\nKey pieces: faux fur jacket, harem pants, sequined dress, bamboo hoop earrings, high tops\n\nCapricorn - Mod Squad\n\nCool and composed, this retro aesthetic is tailored for Capricorn. The bold prints and luxe materials make a powerful statement that this Earth sign can get behind. While some might think these pieces are simple, Capricorn knows a mod wardrobe is timeless and chic. The functionality of this style also means less time fussing around with keeping up on trends, something straightforward Capricorn appreciates.\n\nKey pieces: sleeveless turtleneck, pencil skirt, A-line mini dress, box clutch, block pumps\n\nLet your sign influence your style this spring, and be inspired by the best traits of your zodiac!\n\nRelated Article: Which British Royal Family Member Are You, Based on Your Zodiac Sign?\n\nDid you enjoy this article? Please share it with your friends! Share Share Email\n\nAbout The Author Emo music, vegetarian food & bold lipstick power this quirky, extroverted Leo. Passionate about exploring the world and our place in it through astrology, tarot, numerology and… Read More »\n\nYou might also be interested in\n\nNext Article", "images": ["https://astrologyanswers.com/ee-assets/images/app_iphone1.png", "https://astrologyanswers.com/ee-assets/images/youtube_icon64.png", "https://astrologyanswers.com/images/made/themes_ee5/ee/site/default/asset/img/authors/Tristan_Lark_use_143_143_c1.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/sagittarius.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/leo.png", "https://astrologyanswers.com/ee-assets/images/insta_follow.png", "https://astrologyanswers.com/themes_ee5/ee/site/default/asset/img/blog/your-2019-spring-style-based-your-zodiac-850x250.jpg", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/pisces.png", "https://astrologyanswers.com/ee-assets/images/pint_follow.png", "https://astrologyanswers.com/ee-assets/images/aa_logo_lg_white.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/scorpio.png", "https://astrologyanswers.com/images/made/themes_ee5/ee/site/default/asset/img/blog/luckiest-day-of-your-week-zodiac-sign-850x850_100_85_80_c1.jpg", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/cancer.png", "https://astrologyanswers.com/ee-assets/images/app_android1.png", "https://astrologyanswers.com/ee-assets/images/instagram_icon64.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/capricorn.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/aquarius.png", "https://astrologyanswers.com/images/made/themes_ee5/ee/site/default/asset/img/blog/summer-stress-cool-down-amethyst-850x850_100_85_80_c1.jpg", "https://astrologyanswers.com/images/made/themes_ee5/ee/site/default/asset/img/blog/tarot-numerology-2s-of-tarot-850x850_100_85_80_c1.jpg", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/virgo.png", "https://astrologyanswers.com/ee-assets/images/twitter_icon64.png", "https://astrologyanswers.com/ee-assets/images/FB-Like.png", "https://astrologyanswers.com/ee-assets/images/pinterest_icon64.png", "https://astrologyanswers.com/themes_ee5/ee/site/default/asset/img/blog/your-2019-spring-style-based-your-zodiac-850x850.jpg", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/gemini.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/taurus.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/aries.png", "https://astrologyanswers.com/ee-assets/images/star-signs/footer_sign/libra.png", "https://astrologyanswers.com/ee-assets/images/facebook_icon64.png"], "top_img": "https://astrologyanswers.com/themes_ee5/ee/site/default/asset/img/blog/your-2019-spring-style-based-your-zodiac-850x850.jpg", "keywords": [], "authors": ["About The"], "canonical_link": "https://astrologyanswers.com/article/let-astrology-help-you-discover-your-best-spring-fashion-trend/", "title": "Your 2019 Spring Style, Based on Your Zodiac Sign", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "description": "Trying to figure out which of the latest spring fashion trends is for you? Look to the stars (and today's article) for some ensemble ideas!", "keywords": "astrology predictions, astrological signs, astrological chart, horoscopes, horoscope signs, zodiac signs, online horoscope reading, dreams, dream dictionary, dream definition, tarot readings, tarot cards", "og": {"site_name": "AstrologyAnswers.com", "type": "article", "title": "Your 2019 Spring Style, Based on Your Zodiac Sign | Astrology Answers", "description": "Trying to figure out which of the latest spring fashion trends is for you? Look to the stars (and today's article) for some ensemble ideas!", "url": "https://astrologyanswers.com/article/let-astrology-help-you-discover-your-best-spring-fashion-trend", "image": {"identifier": "https://astrologyanswers.com/themes_ee5/ee/site/default/asset/img/blog/your-2019-spring-style-based-your-zodiac-850x850.jpg", "secure_url": "https://astrologyanswers.com/themes_ee5/ee/site/default/asset/img/blog/your-2019-spring-style-based-your-zodiac-850x850.jpg"}}}, "movies": [], "publish_date": null, "source": "https://astrologyanswers.com", "summary": ""}