{"url": "https://en.wikipedia.org/wiki/Chrissy_Teigen", "text": "American model, television personality, author\n\nChristine Diane Teigen[3] (born November 30, 1985)[4][5] is an American model, television personality, and author. She made her modeling debut in the annual Sports Illustrated Swimsuit Issue in 2010 and later appeared on the 50th anniversary cover alongside Nina Agdal and Lily Aldridge in 2014. She also co-hosted Lip Sync Battle with LL Cool J on Paramount Network (2015–2019).\n\nEarly life [ edit ]\n\nTeigen was born in Delta, Utah.[4] Her mother is Thai and her father is of Norwegian descent.[6] Her surname is pronounced by the family, although she later came to prefer the \"wrong\" pronunciation of .[3] Teigen's father worked as an electrician and the family moved often. After living in Hawaii, Idaho, and Washington, the family eventually settled in Huntington Beach, California when Teigen was a teenager.[7][8] Teigen attended Snohomish High School in Washington state where she was a cheerleader.[9] She was discovered by a photographer while working in a surf shop.[7][10]\n\nCareer [ edit ]\n\nShe is represented worldwide by IMG Models in New York.[1][2] She became an IGN Babe in 2004 and a substitute model on Deal or No Deal for 2006–2007. In July 2007, she appeared on the cover of Maxim's calendar. Her campaigns include Gillette Venus, Olay, Nike, Skullcandy headphones, Gap Factory, XOXO, UGG Australia, Rock and Republic, Billabong, Beach Bunny Swimwear (for whom she was also a fashion week correspondent), and Nine West Fashion Targets Breast Cancer. She has also served as a recurring guest host and contributor on E!, TMZ, MTV, FUSE/MSG, and Extra with Mario Lopez, and has appeared on America's Next Top Model and Watch What Happens Live. In spring 2013, she was host of the reality competition show, Model Employee on VH1.[11]\n\nTeigen appeared in the Sports Illustrated swimsuit issue in 2010, and was named \"Rookie of the Year\".[12] Her friend and fellow model Brooklyn Decker had introduced her to the people at Sports Illustrated to cast her.[13] She was also a part of the 2011, 2012, 2013 and 2014 Sports Illustrated Swimsuit issues. In 2014, she appeared on the 50th anniversary cover of the Sports Illustrated Swimsuit Issue with Nina Agdal and Lily Aldridge.[14][15]\n\nIn addition to Sports Illustrated, Teigen has appeared on the cover of Ocean Drive magazine, Cosmopolitan, and in editorials for Italian Vogue, Esquire, Glamour, Galore and Cosmopolitan.[16]\n\nOther side projects include designing a capsule collection with swimwear designer DiNeila Brazil (which debuted at Mercedes-Benz Fashion Week Swim in Miami in the summer of 2011) and appearing as a featured character in the 2011 EA Sports video game Need For Speed: The Run.[17]\n\nWhen not working in the world of fashion modeling, Teigen is a cook and writer. She was also featured on an additional Cooking Channel special in February 2013, titled Chrissy Teigen's Hungry, detailing her wedding menu tasting with then-fiancé John Legend.[18] Teigen recently filmed a Cooking Channel special titled Cookies and Cocktails.[19]\n\nIn 2012, Teigen was named Spike TV's \"Our New Girlfriend.\" In 2013, Teigen appeared in her husband John Legend's music video for the song \"All Of Me\", which was inspired by their relationship.[20] In April 2014, Teigen appeared on an Inside Amy Schumer sketch playing a fictionalized version of herself as a relationship counselor.[21] Teigen appears as a judge on the new MTV2 cooking show Snack-Off. In January 2015, Teigen appeared as a guest star on The Mindy Project as the girlfriend of the man to whom Mindy lost her virginity. In April 2015, Teigen became a co-host on Spike, later Paramount Network's Lip Sync Battle alongside LL Cool J.[22] Teigen co-hosted the Billboard Music Awards with Ludacris.[23] From September 2015 until June 2016, she was the food stylist on Tyra Banks's lifestyle talk show FABLife.[24]\n\nOn February 23, 2016, Teigen published Cravings: Recipes for All of the Food You Want to Eat, edited by Francis Lam, which was a New York Times bestseller[25] and the second-best selling cookbook of the year, according to Publishers Weekly.[26] On October 11, 2017, Teigen released a clothing line, in collaboration with Revolve.[27]\n\nOn September 18, 2018, Teigen released her second book, titled Cravings: Hungry For More, also known as Cravings 2.[28] Simultaneously, Teigen released a line of cookware named Cravings by Chrissy Teigen through Target.[29]\n\nIn February 2019, Teigen was announced as a judge for NBC's upcoming comedy competition series Bring the Funny.[30] On November 4, Teigen launched her own cooking website, Cravings by Chrissy Teigen. The website, which features new recipes, cookware suggestions, travelling anecdotes, and entertaining tips, brings together facets of Teigen's professional and personal life.[31]\n\nTeigen is currently starring in Chrissy's Court, a Judge Judy-style courtroom reality series that debuted in April 2020 on Quibi. Teigen also serves as executive producer for the series.[32]\n\nActivism [ edit ]\n\nTeigen donated to Planned Parenthood in 2015 following the Colorado Springs Planned Parenthood shooting and again in 2018.[33][34] A supporter of immigrants' rights, Teigen delivered a speech at a Families Belong Together event.[35][36]\n\nTeigen is a vocal critic of U.S. President Donald Trump.[37] In June 2018, she made a $72,000 donation to the ACLU to commemorate Trump's 72nd birthday.[38] Teigen and her husband endorsed Elizabeth Warren during the 2020 Democratic Party presidential primaries.[39]\n\nPersonal life [ edit ]\n\nTeigen married singer John Legend on September 14, 2013, at Villa Pizzo in Como, Italy.[40][41] Legend proposed to Teigen in December 2011, after four years of dating;[42][43] they first met on the set of his 2006 music video for \"Stereo\". The song \"All of Me\" was dedicated to her.[41][44][45] They have two children, a daughter, Luna, born April 14, 2016[46][47] and a son, Miles,[48] born May 16, 2018.[49][50][51] Both children were conceived via in vitro fertilization.[52] She has spoken openly about her battle with postpartum depression.[53]\n\nFilmography [ edit ]\n\nMusic videos [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2011 Need for Speed: The Run Nikki Blake Voice", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/220px-Christine_Teigen_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/1200px-Christine_Teigen_2012_Shankbone.JPG", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Chrissy_Teigen_Sydney_2012_%282%29.jpg/170px-Chrissy_Teigen_Sydney_2012_%282%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/1200px-Christine_Teigen_2012_Shankbone.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chrissy_Teigen", "title": "Chrissy Teigen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/1200px-Christine_Teigen_2012_Shankbone.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}