{"url": "https://www.cosmopolitan.com/entertainment/tv/a22106547/orange-is-the-new-black-season-5-recap/", "text": "If you're the type that sits indoors for an entire weekend till you've finished a whole season of your favorite show, then it's been over a year since you last saw the finale of Orange Is the New Black. Even if you have an excellent memory, there's been a lot of television since then — an entire season of Game of Thrones, Westworld, etc. — plus more actual news than any one human can keep up with day to day. Here, a quick refresher on season five to catch you up before season six debuts on July 27.\n\nWhere the Season Started\n\nSeason five picked up immediately where season four left off, so just for a minute, think back to 2016. Poussey died during a protest in the cafeteria, when CO Bayley restrained her with a chokehold. After Caputo refused to fire Bayley, the inmates decided to riot; season five began with Daya shooting CO Humphrey in the leg. In the first episode, the inmates gained pretty much full control over the prison, and Taystee eventually got Caputo to read a statement about Poussey's death that was then posted to Twitter.\n\nAfter that initial statement about Poussey, reports about the riot continued to leak out. Remember celebrity chef Judy King? She was still an inmate at Litchfield when the riot started, and after a news camera caught her tied up on the roof (some of the other inmates were trying to find her stash of food), some outlets mistakenly reported that there had been anti-Christian attacks within the prison. Meanwhile, most of the guards were held captive in an office in the sleeping area, and various inmates took turns making sure they didn't escape.\n\nFrieda in her bunker. Netflix\n\nWhile most of the prisoners stayed within their usual confines, Frieda retreated to a \"bunker\" she built in an abandoned swimming pool that was supposed to have been filled in by Figueroa. Eventually, Gina, Yoga Jones, and Anita joined her there, with later appearances by Piper, Alex, Red, and several others.\n\nWhere the Season Ended\n\nAs the riot gained outside media attention, MCC tried to negotiate with the inmates for the release of the COs, with Taystee acting as an advocate for the rights of the prisoners. Gloria also wanted to end the standoff so she could get out and see her son in the hospital, and smuggled the guards out. The guards then escaped via a hole in the fence, meaning Taystee's negotiations were all for nothing. An emergency team then swarmed the prison in riot gear, and many of the inmates, including Flaca and Maritza, were led outside in handcuffs.\n\nNetflix\n\nThe team then realized that they were still 10 inmates short, but these inmates were the ones inside the pool bunker: Piper, Red, Alex, Taystee, Cindy, Suzanne, Blanca, Gloria, Nicky, and Frieda. Before the riot team broke into the bunker, though, one major thing happened. Piscatella, who'd been tied up by Frieda and then set free by Red, died after another officer shot him by accident. Though a superior officer knew that it was a response team member who did it, it's not yet clear whether one of the inmates will be blamed for the death.\n\nLingering Questions\n\n1. Where is Alex? Though Alex was with the bunker crew in the finale, she's not visible in the season six trailer and Piper wonders aloud where she is. Does this mean she didn't end up in maximum security with the rest of the inmates? Or is she just being held in solitary where they can't see her?\n\n2. Are all of the inmates in the same place? The finale saw the inmates being loaded onto different buses, with Flaca and Maritza getting separated. Were those buses headed to different prisons, or did they all end up at Litchfield Max?\n\nNetflix\n\n3. Will Morello have her baby? Morello found out in season five that she was expecting a child with her husband Vincent, but we don't really know how far along she is or how much time will pass in season six, so it's possible she could have the baby in one of the coming episodes.\n\n4. How did Pennsatucky get caught? Though Pennsatucky was last seen in the CO cabins, she's definitely back in prison in the trailer for season six. Who put her back?\n\n5. Did Chang escape? Chang also ran away during the riot, but unlike Pennsatucky, she's not in the trailer. Does this mean she escaped Litchfield for good?\n\nChang contemplates her escape. Netflix\n\n6. Who will take the fall for the riot? Almost everyone in the prison participated in the riot in some way or another, but there are a couple of major crimes that investigators will be looking to solve; those are also the ones that could end with certain inmates having years added to their sentences. Based on the trailer for season six, it's anyone's guess who'll end up in trouble, but for now, no one is safe.\n\nCatch up on Orange Is the New Black before the new season: STREAM\n\nFollow Eliza on Twitter.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=1xw:0.75xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=1xw:0.75xh;center,top&resize=1200:*", "keywords": [], "authors": ["Eliza Thompson", "Senior Entertainment Editor", "I M The Senior Entertainment Editor At Cosmopolitan.Com", "Which Means My Dvr Is Always Percent Full."], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a22106547/orange-is-the-new-black-season-5-recap/", "title": "Everything to Remember About 'Orange Is the New Black' Season 5", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Everything to Remember About 'Orange Is the New Black' Season 5", "description": "Exactly how did this riot start again?", "url": "https://www.cosmopolitan.com/entertainment/tv/a22106547/orange-is-the-new-black-season-5-recap/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=1xw:0.75xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-07-10 07:57:57", "published_time": "2018-07-10 07:57:00", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=1xw:0.75xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Orange Is the New Black Season 5 Recap - What to Remember About OITNB", "description": "A handy guide to remembering what happened on season five of Orange Is the New Black, before the six season hits Netflix on July 27.", "keywords": "orange is the new black, oitnb, oitnb season 5, oitnb season 6, oitnb season 5 recap, orange is the new black refresher, netflix", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=0.6666666666666666xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv", "sailthru.date": "2018-07-10T19:57:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=1xw:0.75xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/orange-is-the-new-black-season-5-1531248417.jpeg?crop=0.6666666666666666xw:1xh;center,top", "sailthru.socialtitle": "Everything to Remember About 'Orange Is the New Black' Season 5", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531180620.0, "source": "https://www.cosmopolitan.com", "summary": ""}