{"url": "www.smh.com.au/lifestyle/beauty/who-would-have-thought-kylie-would-be-the-most-successful-kardashian-20180712-p4zqyt.html", "text": "But, slowly but surely, Jenner has grown up and grown her bank account. While Kendall was off walking for Balmain at Paris Fashion Week in 2015, she stayed in LA and launched a solo brand called Kylie Cosmetics, selling her now infamous \"lip kits\": limited release lip gloss and liner packs revealed on her social media channels, which would sell out online within minutes. Three years later, the now 20-year-old, who welcomed daughter Stormi with her rapper boyfriend Travis Scott in February, has made Forbes' list of the \"richest self-made women\". Loading Jenner, who appears on the magazine's cover, is the youngest person to ever make the list. With her $US900 million fortune (Forbes estimates Kylie Cosmetics, which Jenner has 100 per cent ownership of, makes up $US800 million of that) she is expected to unseat Facebook founder Mark Zuckerberg as the world's youngest-ever self-made billionaire. For context, Kim Kardashian, before now viewed as almost undeniably the most successful in the family, has a net worth of $US355 million. Jenner is now wealthier than the rest of her sisters combined.\n\nForbes reports Jenner's mother, Kris, keeps the books and runs her PR for a \"management fee\" of 10 per cent. In the US, Kylie Cosmetics is everywhere: in pharmacies, department stores, through her online store. She even has a deal with Topshop (the old home of her defunct clothing line with sister Kendall) which sees a table of her lip kits placed amongst the clothes in their stores. Loading But, as many have pointed out, there is one wee problem with Kylie Jenner being described as a \"self-made woman\": she surely isn't. Kylie Jenner didn't start from nothing, or even middle class mediocrity, to build her empire of lip goop. She started from an incredibly wealthy family, with a \"momager\" who put her then pre-teen girl's name on fashion lines and door lists (and still manages each of her children's brands). She started with a reality television contract she had held since she was a child. Although she may now have exceeded their popularity, in those early days, publicity from her older sisters was invaluable in building brand Kylie and driving sales.\n\nKylie Jenner may own 100 per cent of Kylie Cosmetics, but she by no means did 100 per cent of the work to create it, as a number of social media users have protested since Forbes published their list. One of the loudest voices was – unexpectedly but delightfully – Dictionary.com, who found this moment to be an opportune time to define the word \"self-made\" and use it in a sentence. Feminist author Roxane Gay weighed in, saying that while her success is \"commendable\" it \"comes by virtue of her privilege\".\n\nOther social media users, too, have been confused by how this woman is possibly \"self-made\", as well as how she can be viewed as an inspiration for anyone looking to create their own wealth.\n\nThat last tweet is probably unfair, there is one business lesson you can learn from Kylie Jenner: cosmetics are damn lucrative. In 2014, Forbes recommended its readers \"invest in beauty instead of Bitcoin\". NPD group data released earlier this year has shown that, despite a more general retail slump in the US, the beauty industry has continued to grow, especially online. A Kylie lip kit retails for $US29, but it takes less truck space and requires less labour than one of her Topshop t-shirts, which retailed for around the same price.", "images": ["https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda", "https://static.ffx.io/images/$zoom_0.774%2C$multiply_0.3541%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_37/t_crop_custom/q_86%2Cf_auto/446c4f20d229955a473d5c5b64f7e2785840312f"], "top_img": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda", "keywords": [], "authors": ["Mary Ward"], "canonical_link": "https://www.smh.com.au/lifestyle/beauty/who-would-have-thought-kylie-would-be-the-most-successful-kardashian-20180712-p4zqyt.html", "title": "Who would have thought Kylie would be the most successful Kardashian?", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "theme-color": "#0A1633", "title": "Who would have thought Kylie would be the most successful Kardashian?", "description": "But, surely we can all agree: this woman is not self-made.", "article": {"section": "Beauty", "published_time": "2018-07-12T01:22:24+00:00", "modified_time": "2018-07-12T07:11:34+00:00"}, "pubdate": "2018-07-12T01:22:24+00:00", "author": "Mary Ward", "fb": {"app_id": 193677504039845, "pages": 1432569230378131}, "og": {"description": "But, surely we can all agree: this woman is not self-made.", "image": {"identifier": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda", "width": 800, "height": 450, "secure_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda"}, "locale": "en_US", "site_name": "The Sydney Morning Herald", "title": "Who would have thought Kylie would be the most successful Kardashian?", "url": "https://www.smh.com.au/lifestyle/beauty/who-would-have-thought-kylie-would-be-the-most-successful-kardashian-20180712-p4zqyt.html"}, "parsely-title": "Who would have thought Kylie would be the most successful Kardashian?", "parsely-link": "https://www.smh.com.au/lifestyle/beauty/who-would-have-thought-kylie-would-be-the-most-successful-kardashian-20180712-p4zqyt.html", "parsely-type": "NewsArticle", "parsely-image-url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda", "parsely-section": "Beauty", "parsely-author": "Mary Ward", "parsely-pub-date": "2018-07-12T01:22:24+00:00", "parsely-tags": "KYLIE JENNER,makeup & nails,kim kardashian", "parsely-metadata": "{\"type\":\"article\",\"assetId\":\"p4zqyt\"}", "parsely-network-canonical": "https://www.smh.com.au/lifestyle/beauty/who-would-have-thought-kylie-would-be-the-most-successful-kardashian-20180712-p4zqyt.html", "robots": "noarchive,noodp,index", "twitter": {"card": "summary_large_image", "description": "But, surely we can all agree: this woman is not self-made.", "image": {"src": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/b275ed277b1a5e4b9426244043e6d9170b56bfda"}, "site": "@smh", "title": "Who would have thought Kylie would be the most successful Kardashian?"}, "google-signin-client_id": "589384154045-p5vk6p2adh6l4p13n8rfjtbsfqu8gbn5.apps.googleusercontent.com"}, "movies": [], "publish_date": 1531324800.0, "source": "http://www.smh.com.au", "summary": ""}