{"url": "https://www.usatoday.com/story/money/2018/07/18/lays-tastes-america-new-flavors-launch-test/788797002/", "text": "Dixita Limbachia\n\nEveryone knows lobster rolls are associated with Maine and deep-dish pizza calls its home Chicago, but what happens when those flavors go into a potato chip?\n\nFrito-Lay has launched eight new regionally-inspired flavors under its Lay's brand that it says reflect different tastes from parts of the country. And we put them all to a taste test to see if they reminded anyone of home on the range, the land of Dixie or just about anywhere else.\n\nThe Tastes of America flavored-chip lineup includes cajun spice; chile con queso; crab spice; deep dish pizza; fried pickles with ranch; lobster roll; pimento cheese; and Thai sweet chili.\n\nEach flavor was picked based on consumer feedback in different regions, said Tina Mahal, senior director of marketing at Frito-Lay.\n\n“This just a part of our DNA now, listening to consumers,” said Mahal. “What we did was tap into those places that had the inspiration that popped the most.”\n\nMore Money:How billionaire entrepreneur Ted Leonsis amassed his most important asset – his network\n\nMore Money:12 Amazon Prime Day deals you didn’t know you needed\n\nMahal added that Lay’s took a new approach in offering these selected flavors only in the relevant regions as a part of their efforts to acknowledge consumers and their roots within those areas.\n\n“People feel a deep connection to home,” said Mahal. “They also feel that they want their brands to understand them.”\n\nSo, we put them to the test. With eight unique flavors, we had our very own USA TODAY staff taste test the flavors to see if they could actually identify them and associate them with various regions.\n\nOur first participant, Marissa Surman, scored was able to associate each chip with its part of the country. The Wisconsin native found that fried pickle with ranch hit home for her.\n\n“If I know my state at all, that’s definitely representing the mid-America area,” said Surman.\n\nThe next volunteer, Kyle Montoya identified deep-dish pizza and Thai sweet chili right away, but couldn’t distinguish lobster roll, Chile con queso and pimento cheese.\n\n“I have to best honest, I don’t know what I just put in my mouth,” said Montoya. “It’s good. I just don’t know what it is”\n\nChristopher Potter, became a huge fan of cajun spice and could pinpoint the flavor right away. “I’m tasting the cajun spice on this one for sure, you can almost see it on the chip.”\n\nParticipant Maria Marzullo sounded a little hesitant at first.\n\n“They [the chips] caught me off guard but once you eat more of them they taste really good,” she said.\n\nHere is Lay’s Taste of America summer collection and its region:\n\n1. Cajun Spice, Central Gulf: Inspired by the Gulf Coast iconic jambalaya and blackened Cajun chicken, this bag harbors intense flavors of garlic, paprika, onion and oregano. The flavor will debut at the Louisiana Shrimp and Petroleum Festival in Morgan City, La. from August 31 to September 2.\n\n2. Chile Con Queso, Texoma, Mountain, Southern California: This flavor infuses Tex-Mex queso with a kick of spice that is reminiscent of the Southwest. The flavor release will take place at the Houston Food Fest on August 18.\n\n3. Crab Spice, Mid-Atlantic: A custom-blend of spices the Bay area, fans can find this flavor release at Chesapeake Crab and Beer Festival in National Harbor, Md. on August 18.\n\n4. Deep Dish Pizza, Mid-America: At the heart of America, this taste mimics the deep- dish pizza by the well-known Giordano’s pizza recipe in Chicago. Set to be issued at Navy Pier in Chicago on August 11.\n\n5. Fried Pickles with Ranch, Midwest: Do you remember the state fair? Well, this classic deep-fried favorite will help you recall those days. Lay’s will unveil this taste at Missouri State Fair in Sedalia, Mo. from August 16 to 18.\n\n6. Lobster Roll, Northeast: A beloved coastal flavor of fresh lobster served on a buttery grilled roll, northeasters can find the flavor at the Maine Lobster Festival in Rockland, Maine from August.\n\n7. Pimento Cheese, Southeast: This southern charm flavor of sharp cheddar and a dash of cayenne pepper will be introduced at the Shrimp and Grits Festival at Jeckyll Island, Ga. from September 14 to 16.\n\n8. Thai Sweet Chili, Pacific Northwest: Inspired by pacific northwest food trucks, this bag of blended sweet chili sauce and heat is set to take place at the Bite of Seattle from July 20 to 22.", "images": ["https://www.gannett-cdn.com/-mm-/4fd934d4901866ae2050000a9945ded27f6f70a4/c=0-234-1352-998/local/-/media/2018/07/17/USATODAY/USATODAY/636674372784821574-TOA-logo.png?width=1352&height=764&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/media/2018/07/17/USATODAY/USATODAY/636674372784821574-TOA-logo.png?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/4fd934d4901866ae2050000a9945ded27f6f70a4/c=0-234-1352-998/local/-/media/2018/07/17/USATODAY/USATODAY/636674372784821574-TOA-logo.png?width=1352&height=764&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/money/2018/07/18/lays-tastes-america-new-flavors-launch-test/788797002/", "title": "Fried-pickle potato chips? We taste tested Frito Lay's region-themed snacks", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Fried-pickle potato chips? We taste tested Frito Lay's region-themed snacks", "description": "With the launch of Lay's new regionally-inspired flavors that represent different regions across the U.S., the USA TODAY staff puts the new flavors to the test.", "url": "https://www.usatoday.com/story/money/2018/07/18/lays-tastes-america-new-flavors-launch-test/788797002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4fd934d4901866ae2050000a9945ded27f6f70a4/c=0-234-1352-998/local/-/media/2018/07/17/USATODAY/USATODAY/636674372784821574-TOA-logo.png?width=1352&height=764&fit=crop&format=pjpg&auto=webp", "width": 1352, "height": 764}, "type": "article"}, "article": {"author": "Dixita Limbachia", "content_tier": "free", "opinion": "false"}, "description": "With the launch of Lay's new regionally-inspired flavors that represent different regions across the U.S., the USA TODAY staff puts the new flavors to the test.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/4fd934d4901866ae2050000a9945ded27f6f70a4/c=0-234-1352-998/local/-/media/2018/07/17/USATODAY/USATODAY/636674372784821574-TOA-logo.png?width=1352&height=676&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Fried-pickle potato chips? We taste tested Frito Lay's region-themed snacks", "description": "With the launch of Lay's new regionally-inspired flavors that represent different regions across the U.S., the USA TODAY staff puts the new flavors to the test."}}, "movies": [], "publish_date": 1531843200.0, "source": "https://www.usatoday.com", "summary": ""}