{"url": "https://www.theguardian.com/media/2016/jul/12/how-technology-disrupted-the-truth", "text": "One Monday morning last September, Britain woke to a depraved news story. The prime minister, David Cameron, had committed an “obscene act with a dead pig’s head”, according to the Daily Mail. “A distinguished Oxford contemporary claims Cameron once took part in an outrageous initiation ceremony at a Piers Gaveston event, involving a dead pig,” the paper reported. Piers Gaveston is the name of a riotous Oxford university dining society; the authors of the story claimed their source was an MP, who said he had seen photographic evidence: “His extraordinary suggestion is that the future PM inserted a private part of his anatomy into the animal.”\n\nThe story, extracted from a new biography of Cameron, sparked an immediate furore. It was gross, it was a great opportunity to humiliate an elitist prime minister, and many felt it rang true for a former member of the notorious Bullingdon Club. Within minutes, #Piggate and #Hameron were trending on Twitter, and even senior politicians joined the fun: Nicola Sturgeon said the allegations had “entertained the whole country”, while Paddy Ashdown joked that Cameron was “hogging the headlines”. At first, the BBC refused to mention the allegations, and 10 Downing Street said it would not “dignify” the story with a response – but soon it was forced to issue a denial. And so a powerful man was sexually shamed, in a way that had nothing to do with his divisive politics, and in a way he could never really respond to. But who cares? He could take it.\n\nThen, after a full day of online merriment, something shocking happened. Isabel Oakeshott, the Daily Mail journalist who had co-written the biography with Lord Ashcroft, a billionaire businessman, went on TV and admitted that she did not know whether her huge, scandalous scoop was even true. Pressed to provide evidence for the sensational claim, Oakeshott admitted she had none.\n\n“We couldn’t get to the bottom of that source’s allegations,” she said on Channel 4 News. “So we merely reported the account that the source gave us … We don’t say whether we believe it to be true.” In other words, there was no evidence that the prime minister of the United Kingdom had once “inserted a private part of his anatomy” into the mouth of a dead pig – a story reported in dozens of newspapers and repeated in millions of tweets and Facebook updates, which many people presumably still believe to be true today.\n\nOakeshott went even further to absolve herself of any journalistic responsibility: “It’s up to other people to decide whether they give it any credibility or not,” she concluded. This was not, of course, the first time that outlandish claims were published on the basis of flimsy evidence, but this was an unusually brazen defence. It seemed that journalists were no longer required to believe their own stories to be true, nor, apparently, did they need to provide evidence. Instead it was up to the reader – who does not even know the identity of the source – to make up their own mind. But based on what? Gut instinct, intuition, mood?\n\nHow technology disrupted the truth – podcast Read more\n\nDoes the truth matter any more?\n\nNine months after Britain woke up giggling at Cameron’s hypothetical porcine intimacies, the country arose on the morning of 24 June to the very real sight of the prime minister standing outside Downing Street at 8am, announcing his own resignation.\n\n“The British people have voted to leave the European Union and their will must be respected,” Cameron declared. “It was not a decision that was taken lightly, not least because so many things were said by so many different organisations about the significance of this decision. So there can be no doubt about the result.”\n\nBut what soon became clear was that almost everything was still in doubt. At the end of a campaign that dominated the news for months, it was suddenly obvious that the winning side had no plan for how or when the UK would leave the EU – while the deceptive claims that carried the leave campaign to victory suddenly crumbled. At 6.31am on Friday 24 June, just over an hour after the result of the EU referendum had become clear, Ukip leader Nigel Farage conceded that a post-Brexit UK would not in fact have £350m a week spare to spend on the NHS – a key claim of Brexiteers that was even emblazoned on the Vote Leave campaign bus. A few hours later, the Tory MEP Daniel Hannan stated that immigration was not likely to be reduced – another key claim.\n\nFacebook Twitter Pinterest The Vote Leave campaign bus, featuring a widely disputed claim about UK contributions to the EU. Photograph: Stefan Rousseau/PA\n\nIt was hardly the first time that politicians had failed to deliver what they promised, but it might have been the first time they admitted on the morning after victory that the promises had been false all along. This was the first major vote in the era of post-truth politics: the listless remain campaign attempted to fight fantasy with facts, but quickly found that the currency of fact had been badly debased.\n\nThe remain side’s worrying facts and worried experts were dismissed as “Project Fear” – and quickly neutralised by opposing “facts”: if 99 experts said the economy would crash and one disagreed, the BBC told us that each side had a different view of the situation. (This is a disastrous mistake that ends up obscuring truth, and echoes how some report climate change.) Michael Gove declared that “people in this country have had enough of experts” on Sky News. He also compared 10 Nobel prize-winning economists who signed an anti-Brexit letter to Nazi scientists loyal to Hitler.\n\nIt can become very difficult for anyone to tell the difference between facts that are true and 'facts' that are not\n\nFor months, the Eurosceptic press trumpeted every dubious claim and rubbished every expert warning, filling the front pages with too many confected anti-migrant headlines to count – many of them later quietly corrected in very small print. A week before the vote – on the same day Nigel Farage unveiled his inflammatory “Breaking Point” poster, and the Labour MP Jo Cox, who had campaigned tirelessly for refugees, was shot dead – the cover of the Daily Mail featured a picture of migrants in the back of a lorry entering the UK, with the headline “We are from Europe – let us in!” The next day, the Mail and the Sun, which also carried the story, were forced to admit that the stowaways were actually from Iraq and Kuwait.\n\nThe brazen disregard for facts did not stop after the referendum: just this weekend, the short-lived Conservative leadership candidate Andrea Leadsom, fresh from a starring role in the leave campaign, demonstrated the waning power of evidence. After telling the Times that being a mother would make her a better PM than her rival Theresa May, she cried “gutter journalism!” and accused the newspaper of misrepresenting her remarks – even though she said exactly that, clearly and definitively and on tape. Leadsom is a post-truth politician even about her own truths.\n\nWhen a fact begins to resemble whatever you feel is true, it becomes very difficult for anyone to tell the difference between facts that are true and “facts” that are not. The leave campaign was well aware of this – and took full advantage, safe in the knowledge that the Advertising Standards Authority has no power to police political claims. A few days after the vote, Arron Banks, Ukip’s largest donor and the main funder of the Leave.EU campaign, told the Guardian that his side knew all along that facts would not win the day. “It was taking an American-style media approach,” said Banks. “What they said early on was ‘Facts don’t work’, and that’s it. The remain campaign featured fact, fact, fact, fact, fact. It just doesn’t work. You have got to connect with people emotionally. It’s the Trump success.”\n\nFacebook Twitter Pinterest Illustration: Sébastien Thibault\n\nIt was little surprise that some people were shocked after the result to discover that Brexit might have serious consequences and few of the promised benefits. When “facts don’t work” and voters don’t trust the media, everyone believes in their own “truth” – and the results, as we have just seen, can be devastating.\n\nHow did we end up here? And how do we fix it?\n\nTwenty-five years after the first website went online, it is clear that we are living through a period of dizzying transition. For 500 years after Gutenberg, the dominant form of information was the printed page: knowledge was primarily delivered in a fixed format, one that encouraged readers to believe in stable and settled truths.\n\nNow, we are caught in a series of confusing battles between opposing forces: between truth and falsehood, fact and rumour, kindness and cruelty; between the few and the many, the connected and the alienated; between the open platform of the web as its architects envisioned it and the gated enclosures of Facebook and other social networks; between an informed public and a misguided mob.\n\nWhat is common to these struggles – and what makes their resolution an urgent matter – is that they all involve the diminishing status of truth. This does not mean that there are no truths. It simply means, as this year has made very clear, that we cannot agree on what those truths are, and when there is no consensus about the truth and no way to achieve it, chaos soon follows.\n\nIncreasingly, what counts as a fact is merely a view that someone feels to be true – and technology has made it very easy for these “facts” to circulate with a speed and reach that was unimaginable in the Gutenberg era (or even a decade ago). A dubious story about Cameron and a pig appears in a tabloid one morning, and by noon, it has flown around the world on social media and turned up in trusted news sources everywhere. This may seem like a small matter, but its consequences are enormous.\n\nIn the digital age, it is easier than ever to publish false information, which is quickly shared and taken to be true\n\n“The Truth”, as Peter Chippindale and Chris Horrie wrote in Stick It Up Your Punter!, their history of the Sun newspaper, is a “bald statement which every newspaper prints at its peril”. There are usually several conflicting truths on any given subject, but in the era of the printing press, words on a page nailed things down, whether they turned out to be true or not. The information felt like the truth, at least until the next day brought another update or a correction, and we all shared a common set of facts.\n\nThis settled “truth” was usually handed down from above: an established truth, often fixed in place by an establishment. This arrangement was not without flaws: too much of the press often exhibited a bias towards the status quo and a deference to authority, and it was prohibitively difficult for ordinary people to challenge the power of the press. Now, people distrust much of what is presented as fact – particularly if the facts in question are uncomfortable, or out of sync with their own views – and while some of that distrust is misplaced, some of it is not.\n\nIn the digital age, it is easier than ever to publish false information, which is quickly shared and taken to be true – as we often see in emergency situations, when news is breaking in real time. To pick one example among many, during the November 2015 Paris terror attacks, rumours quickly spread on social media that the Louvre and Pompidou Centre had been hit, and that François Hollande had suffered a stroke. Trusted news organisations are needed to debunk such tall tales.\n\nSometimes rumours like these spread out of panic, sometimes out of malice, and sometimes deliberate manipulation, in which a corporation or regime pays people to convey their message. Whatever the motive, falsehoods and facts now spread the same way, through what academics call an “information cascade”. As the legal scholar and online-harassment expert Danielle Citron describes it, “people forward on what others think, even if the information is false, misleading or incomplete, because they think they have learned something valuable.” This cycle repeats itself, and before you know it, the cascade has unstoppable momentum. You share a friend’s post on Facebook, perhaps to show kinship or agreement or that you’re “in the know”, and thus you increase the visibility of their post to others.\n\nHere is the news – but only if Facebook thinks you need to know | John Naughton Read more\n\nAlgorithms such as the one that powers Facebook’s news feed are designed to give us more of what they think we want – which means that the version of the world we encounter every day in our own personal stream has been invisibly curated to reinforce our pre-existing beliefs. When Eli Pariser, the co-founder of Upworthy, coined the term “filter bubble” in 2011, he was talking about how the personalised web – and in particular Google’s personalised search function, which means that no two people’s Google searches are the same – means that we are less likely to be exposed to information that challenges us or broadens our worldview, and less likely to encounter facts that disprove false information that others have shared.\n\nPariser’s plea, at the time, was that those running social media platforms should ensure that “their algorithms prioritise countervailing views and news that’s important, not just the stuff that’s most popular or most self-validating”. But in less than five years, thanks to the incredible power of a few social platforms, the filter bubble that Pariser described has become much more extreme.\n\nOn the day after the EU referendum, in a Facebook post, the British internet activist and mySociety founder, Tom Steinberg, provided a vivid illustration of the power of the filter bubble – and the serious civic consequences for a world where information flows largely through social networks:\n\nI am actively searching through Facebook for people celebrating the Brexit leave victory, but the filter bubble is SO strong, and extends SO far into things like Facebook’s custom search that I can’t find anyone who is happy *despite the fact that over half the country is clearly jubilant today* and despite the fact that I’m *actively* looking to hear what they are saying. This echo-chamber problem is now SO severe and SO chronic that I can only beg any friends I have who actually work for Facebook and other major social media and technology to urgently tell their leaders that to not act on this problem now is tantamount to actively supporting and funding the tearing apart of the fabric of our societies … We’re getting countries where one half just doesn’t know anything at all about the other.\n\nBut asking technology companies to “do something” about the filter bubble presumes that this is a problem that can be easily fixed – rather than one baked into the very idea of social networks that are designed to give you what you and your friends want to see.\n\nFacebook, which launched only in 2004, now has 1.6bn users worldwide. It has become the dominant way for people to find news on the internet – and in fact it is dominant in ways that would have been impossible to imagine in the newspaper era. As Emily Bell has written: “Social media hasn’t just swallowed journalism, it has swallowed everything. It has swallowed political campaigns, banking systems, personal histories, the leisure industry, retail, even government and security.”\n\nBell, the director of the Tow Centre for Digital Journalism at Columbia University – and a board member of the Scott Trust, which owns the Guardian – has outlined the seismic impact of social media for journalism. “Our news ecosystem has changed more dramatically in the past five years,” she wrote in March, “than perhaps at any time in the past 500.” The future of publishing is being put into the “hands of the few, who now control the destiny of the many”. News publishers have lost control over the distribution of their journalism, which for many readers is now “filtered through algorithms and platforms which are opaque and unpredictable”. This means that social media companies have become overwhelmingly powerful in determining what we read – and enormously profitable from the monetisation of other people’s work. As Bell notes: “There is a far greater concentration of power in this respect than there has ever been in the past.”\n\nPublications curated by editors have in many cases been replaced by a stream of information chosen by friends, contacts and family, processed by secret algorithms. The old idea of a wide-open web – where hyperlinks from site to site created a non-hierarchical and decentralised network of information – has been largely supplanted by platforms designed to maximise your time within their walls, some of which (such as Instagram and Snapchat) do not allow outward links at all.\n\nMany people, in fact, especially teenagers, now spend more and more of their time on closed chat apps, which allow users to create groups to share messages privately – perhaps because young people, who are most likely to have faced harassment online, are seeking more carefully protected social spaces. But the closed space of a chat app is an even more restrictive silo than the walled garden of Facebook or other social networks.\n\nFacebook Twitter Pinterest ‘The centralisation of information is making us all much less powerful’ … Iranian blogger Hossein Derakhshan, who was imprisoned for six years. Photograph: Arash Ashoorinia/The Guardian\n\nAs the pioneering Iranian blogger Hossein Derakhshan, who was imprisoned in Tehran for six years for his online activity, wrote in the Guardian earlier this year, the “diversity that the world wide web had originally envisioned” has given way to “the centralisation of information” inside a select few social networks – and the end result is “making us all less powerful in relation to government and corporations”.\n\nOf course, Facebook does not decide what you read – at least not in the traditional sense of making decisions – and nor does it dictate what news organisations produce. But when one platform becomes the dominant source for accessing information, news organisations will often tailor their own work to the demands of this new medium. (The most visible evidence of Facebook’s influence on journalism is the panic that accompanies any change in the news feed algorithm that threatens to reduce the page views sent to publishers.)\n\nIn the last few years, many news organisations have steered themselves away from public-interest journalism and toward junk-food news, chasing page views in the vain hope of attracting clicks and advertising (or investment) – but like junk food, you hate yourself when you’ve gorged on it. The most extreme manifestation of this phenomenon has been the creation of fake news farms, which attract traffic with false reports that are designed to look like real news, and are therefore widely shared on social networks. But the same principle applies to news that is misleading or sensationally dishonest, even if it wasn’t created to deceive: the new measure of value for too many news organisations is virality rather than truth or quality.\n\nOf course, journalists have got things wrong in the past – either by mistake or prejudice or sometimes by intent. (Freddie Starr probably didn’t eat a hamster.) So it would be a mistake to think this is a new phenomenon of the digital age. But what is new and significant is that today, rumours and lies are read just as widely as copper-bottomed facts – and often more widely, because they are wilder than reality and more exciting to share. The cynicism of this approach was expressed most nakedly by Neetzan Zimmerman, formerly employed by Gawker as a specialist in high-traffic viral stories. “Nowadays it’s not important if a story’s real,” he said in 2014. “The only thing that really matters is whether people click on it.” Facts, he suggested, are over; they are a relic from the age of the printing press, when readers had no choice. He continued: “If a person is not sharing a news story, it is, at its core, not news.”\n\nThe increasing prevalence of this approach suggests that we are in the midst of a fundamental change in the values of journalism – a consumerist shift. Instead of strengthening social bonds, or creating an informed public, or the idea of news as a civic good, a democratic necessity, it creates gangs, which spread instant falsehoods that fit their views, reinforcing each other’s beliefs, driving each other deeper into shared opinions, rather than established facts.\n\nContact the Guardian securely Read more\n\nBut the trouble is that the business model of most digital news organisations is based around clicks. News media around the world has reached a fever-pitch of frenzied binge-publishing, in order to scrape up digital advertising’s pennies and cents. (And there’s not much advertising to be got: in the first quarter of 2016, 85 cents of every new dollar spent in the US on online advertising went to Google and Facebook. That used to go to news publishers.)\n\nIn the news feed on your phone, all stories look the same – whether they come from a credible source or not. And, increasingly, otherwise-credible sources are also publishing false, misleading, or deliberately outrageous stories. “Clickbait is king, so newsrooms will uncritically print some of the worst stuff out there, which lends legitimacy to bullshit,” said Brooke Binkowski, an editor at the debunking website Snopes, in an interview with the Guardian in April. “Not all newsrooms are like this, but a lot of them are.”\n\nWe should be careful not to dismiss anything with an appealing digital headline as clickbait – appealing headlines are a good thing, if they lead the reader to quality journalism, both serious and not. My belief is that what distinguishes good journalism from poor journalism is labour: the journalism that people value the most is that for which they can tell someone has put in a lot of work – where they can feel the effort that has been expended on their behalf, over tasks big or small, important or entertaining. It is the reverse of so-called “churnalism”, the endless recycling of other people’s stories for clicks.\n\nThe digital advertising model doesn’t currently discriminate between true or not true, just big or small. As the American political reporter Dave Weigel wrote in the wake of a hoax story that became a viral hit all the way back in 2013: “‘Too good to check’ used to be a warning to newspaper editors not to jump on bullshit stories. Now it’s a business model.”\n\nA news-publishing industry desperately chasing down every cheap click doesn’t sound like an industry in a position of strength, and indeed, news publishing as a business is in trouble. The shift to digital publishing has been a thrilling development for journalism – as I said in my 2013 AN Smith lecture at the University of Melbourne, “The Rise of the Reader”, it has induced “a fundamental redrawing of journalists’ relationship with our audience, how we think about our readers, our perception of our role in society, our status”. It has meant we have found new ways to get stories – from our audience, from data, from social media. It has given us new ways to tell stories – with interactive technologies and now with virtual reality. It has given us new ways to distribute our journalism, to find new readers in surprising places; and it has given us new ways to engage with our audiences, opening ourselves up to challenge and debate.\n\nBut while the possibilities for journalism have been strengthened by the digital developments of the last few years, the business model is under grave threat, because no matter how many clicks you get, it will never be enough. And if you charge readers to access your journalism you have a big challenge to persuade the digital consumer who is used to getting information for free to part with their cash.\n\nNews publishers everywhere are seeing profits and revenue drop dramatically. If you want a stark illustration of the new realities of digital media, consider the first-quarter financial results announced by the New York Times and Facebook within a week of one another earlier this year. The New York Times announced that its operating profits had fallen by 13%, to $51.5m – healthier than most of the rest of the publishing industry, but quite a drop. Facebook, meanwhile, revealed that its net income had tripled in the same period – to a quite staggering $1.51bn.\n\nUnreported Britain: without local newspapers, who is keeping tabs? Read more\n\nMany journalists have lost their jobs in the past decade. The number of journalists in the UK shrank by up to one-third between 2001 and 2010; US newsrooms declined by a similar amount between 2006 and 2013. In Australia, there was a 20% cut in the journalistic workforce between 2012 and 2014 alone. Earlier this year, at the Guardian we announced that we would need to lose 100 journalistic positions. In March, the Independent ceased existing as a print newspaper. Since 2005, according to research by Press Gazette, the number of local newspapers in the UK has fallen by 181 – again, not because of a problem with journalism, but because of a problem with funding it.\n\nBut journalists losing their jobs is not simply a problem for journalists: it has a damaging impact on the entire culture. As the German philosopher Jürgen Habermas warned, back in 2007: “When reorganisation and cost-cutting in this core area jeopardise accustomed journalistic standards, it hits at the very heart of the political public sphere. Because, without the flow of information gained through extensive research, and without the stimulation of arguments based on an expertise that doesn’t come cheap, public communication loses its discursive vitality. The public media would then cease to resist populist tendencies, and could no longer fulfil the function it should in the context of a democratic constitutional state.”\n\nPerhaps, then, the focus of the news industry needs to turn to commercial innovation: how to rescue the funding of journalism, which is what is under threat. Journalism has seen dramatic innovation in the last two digital decades, but business models have not. In the words of my colleague Mary Hamilton, the Guardian’s executive editor for audience: “We’ve transformed everything about our journalism and not enough about our businesses.”\n\nThe impact on journalism of the crisis in the business model is that, in chasing down cheap clicks at the expense of accuracy and veracity, news organisations undermine the very reason they exist: to find things out and tell readers the truth – to report, report, report.\n\nMany newsrooms are in danger of losing what matters most about journalism: the valuable, civic, pounding-the-streets, sifting-the-database, asking-challenging-questions hard graft of uncovering things that someone doesn’t want you to know. Serious, public-interest journalism is demanding, and there is more of a need for it than ever. It helps keep the powerful honest; it helps people make sense of the world and their place in it. Facts and reliable information are essential for the functioning of democracy – and the digital era has made that even more obvious.\n\nHillsborough disaster: deadly mistakes and lies that lasted decades Read more\n\nBut we must not allow the chaos of the present to cast the past in a rosy light – as can be seen from the recent resolution to a tragedy that became one of the darkest moments in the history of British journalism. At the end of April, a two-year-long inquest ruled that the 96 people who died in the Hillsborough disaster in 1989 had been unlawfully killed and had not contributed to the dangerous situation at the football ground. The verdict was the culmination of an indefatigable 27-year-campaign by the victims’ families, whose case was reported for two decades with great detail and sensitivity by Guardian journalist David Conn. His journalism helped uncover the real truth about what happened at Hillsborough, and the subsequent cover-up by the police – a classic example of a reporter holding the powerful to account on behalf of the less powerful.\n\nWhat the families had been campaigning against for nearly three decades was a lie put into circulation by the Sun. The tabloid’s aggressive rightwing editor, Kelvin MacKenzie, blamed the fans for the disaster, suggesting they had forced their way into the ground without tickets – a claim later revealed to be false. According to Horrie and Chippindale’s history of The Sun, MacKenzie overruled his own reporter and put the words “THE TRUTH” on the front page, alleging that Liverpool fans were drunk, that they picked the pockets of victims, that they punched, kicked and urinated on police officers, that they shouted that they wanted sex with a dead female victim. The fans, said a “high-ranking police officer”, were “acting like animals”. The story, as Chippindale and Horrie write, is a “classic smear”, free of any attributable evidence and “precisely fitting MacKenzie’s formula by publicising the half-baked ignorant prejudice being voiced all over the country”.\n\nIt is hard to imagine that Hillsborough could happen now: if 96 people were crushed to death in front of 53,000 smartphones, with photographs and eyewitness accounts all posted to social media, would it have taken so long for the truth to come out? Today, the police – or Kelvin MacKenzie – would not have been able to lie so blatantly and for so long.\n\nThe truth is a struggle. It takes hard graft. But the struggle is worth it: traditional news values are important and they matter and they are worth defending. The digital revolution has meant that journalists – rightly, in my view – are more accountable to their audience. And as the Hillsborough story shows, the old media were certainly capable of perpetrating appalling falsehoods, which could take years to unravel. Some of the old hierarchies have been decisively undermined, which has led to a more open debate and a more substantial challenge to the old elites whose interests often dominated the media. But the age of relentless and instant information – and uncertain truths – can be overwhelming. We careen from outrage to outrage, but forget each one very quickly: it’s doomsday every afternoon.\n\nThe challenge for journalism today is to establish what role journalistic organisations still play in public discourse\n\nAt the same time, the levelling of the information landscape has unleashed new torrents of racism and sexism and new means of shaming and harassment, suggesting a world in which the loudest and crudest arguments will prevail. It is an atmosphere that has proved particularly hostile to women and people of colour, revealing that the inequalities of the physical world are reproduced all too easily in online spaces. The Guardian is not immune – which is why one of my first initiatives as editor-in-chief was to launch the Web We Want project, in order to combat a general culture of online abuse and ask how we as an institution can foster better and more civil conversations on the web.\n\nAbove all, the challenge for journalism today is not simply technological innovation or the creation of new business models. It is to establish what role journalistic organisations still play in a public discourse that has become impossibly fragmented and radically destabilised. The stunning political developments of the past year – including the vote for Brexit and the emergence of Donald Trump as the Republican candidate for the US presidency – are not simply the byproducts of a resurgent populism or the revolt of those left behind by global capitalism.\n\nFacebook Twitter Pinterest The rise of Donald Trump is ‘a symptom of the mass media’s growing weakness’, according to academic Zeynep Tufekci. Photograph: Jim Cole/AP\n\nAs the academic Zeynep Tufekci argued in an essay earlier this year, the rise of Trump “is actually a symptom of the mass media’s growing weakness, especially in controlling the limits of what it is acceptable to say”. (A similar case could be made for the Brexit campaign.) “For decades, journalists at major media organisations acted as gatekeepers who passed judgment on what ideas could be publicly discussed, and what was considered too radical,” Tufekci wrote. The weakening of these gatekeepers is both positive and negative; there are opportunities and there are dangers.\n\nAs we can see from the past, the old gatekeepers were also capable of great harm, and they were often imperious in refusing space to arguments they deemed outside the mainstream political consensus. But without some form of consensus, it is hard for any truth to take hold. The decline of the gatekeepers has given Trump space to raise formerly taboo subjects, such as the cost of a global free-trade regime that benefits corporations rather than workers, an issue that American elites and much of the media had long dismissed – as well as, more obviously, allowing his outrageous lies to flourish.\n\nWhen the prevailing mood is anti-elite and anti-authority, trust in big institutions, including the media, begins to crumble.\n\nI believe that a strong journalistic culture is worth fighting for. So is a business model that serves and rewards media organisations that put the search for truth at the heart of everything – building an informed, active public that scrutinises the powerful, not an ill-informed, reactionary gang that attacks the vulnerable. Traditional news values must be embraced and celebrated: reporting, verifying, gathering together eyewitness statements, making a serious attempt to discover what really happened.\n\nWe are privileged to live in an era when we can use many new technologies – and the help of our audience – to do that. But we must also grapple with the issues underpinning digital culture, and realise that the shift from print to digital media was never just about technology. We must also address the new power dynamics that these changes have created. Technology and media do not exist in isolation – they help shape society, just as they are shaped by it in turn. That means engaging with people as civic actors, citizens, equals. It is about holding power to account, fighting for a public space, and taking responsibility for creating the kind of world we want to live in.\n\nMain illustration: Sébastien Thibault\n\n• Follow the Long Read on Twitter at @gdnlongread, or sign up to the long read weekly email here.\n\n• Help fund our journalism by becoming a Guardian supporter.", "images": ["https://i.guim.co.uk/img/media/54ba6ca9366d59eae4b299e18ae027d3f1551266/0_0_5000_3000/master/5000.jpg?width=300&quality=85&auto=format&fit=max&s=67d5f77ced2c58988c65135d6d0d7b2e", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Media%2CPolitics%2CEthics%2CNewspapers%2CTelevision+industry", "https://i.guim.co.uk/img/media/5ba5323c407c2059115d49ee1b5498c3e699cede/0_0_3500_1928/master/3500.jpg?width=300&quality=85&auto=format&fit=max&s=cdead0343b0c0b57ef310ac60a28ad8a", "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b16c37db8b3a5bba18714c193a325ad", "https://i.guim.co.uk/img/media/301445b5a0a81ef2499a99deed909245234a779b/0_0_2832_4256/master/2832.jpg?width=300&quality=85&auto=format&fit=max&s=c73842ed530832e2ac75375f7e3364af", "https://i.guim.co.uk/img/media/81a3551edc11e6c5495d1d748505e7f593f2e7ff/0_116_4326_2596/master/4326.jpg?width=300&quality=85&auto=format&fit=max&s=a4a63271cda846a89f163491df224f63", "https://phar.gu-web.net/count/pvg.gif", "https://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/master/5000.jpg?width=300&quality=85&auto=format&fit=max&s=5b21bdeadde5cadc614c6fa794cd04c4"], "top_img": "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b16c37db8b3a5bba18714c193a325ad", "keywords": [], "authors": ["Katharine Viner"], "canonical_link": "https://www.theguardian.com/media/2016/jul/12/how-technology-disrupted-the-truth", "title": "How technology disrupted the truth | Katharine Viner", "meta_data": {"description": "Social media has swallowed the news – threatening the funding of public-interest reporting and ushering in an era when everyone has their own facts. But the consequences go far beyond journalism", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Katharine Viner", "thumbnail": "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/5000.jpg?width=620&quality=85&auto=format&fit=max&s=e94ab7653fa4b95d83f81fbef8b78b96", "keywords": "Media,Politics,Ethics,Newspapers,Television industry", "news_keywords": "Media,Politics,Ethics,Newspapers,Television industry", "og": {"url": "http://www.theguardian.com/media/2016/jul/12/how-technology-disrupted-the-truth", "image": "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b16c37db8b3a5bba18714c193a325ad", "description": "Social media has swallowed the news – threatening the funding of public-interest reporting and ushering in an era when everyone has their own facts. But the consequences go far beyond journalism", "type": "article", "title": "How technology disrupted the truth | Katharine Viner", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/katharineviner", "publisher": "https://www.facebook.com/theguardian", "section": "Media", "published_time": "2016-07-12T05:00:10.000Z", "tag": "Media,Politics,Ethics,Newspapers,Television industry", "modified_time": "2017-11-28T18:11:38.000Z"}, "al": {"ios": {"url": "gnmguardian://media/2016/jul/12/how-technology-disrupted-the-truth?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://media/2016/jul/12/how-technology-disrupted-the-truth?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/media/2016/jul/12/how-technology-disrupted-the-truth", "iphone": "gnmguardian://media/2016/jul/12/how-technology-disrupted-the-truth?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/328e9120d07331a2458e2acdb2ba033fe1b672fe/0_0_5000_3000/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=b1b3208318a2d52fb0c934a06e8063d8", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1468252800.0, "source": "https://www.theguardian.com", "summary": ""}