{"url": "www.thehollywoodgossip.com/2018/06/johnny-depp-hiding-deadly-disease-from-fans/", "text": "Last week, fans were shocked by photos of Johnny Depp looking gaunt and frail while on tour with his band in Europe.\n\nIf you haven't seen the image in question, just imagine what Johnny would look like if he had spent the past few months preparing for a live-action sequel to the Corpse Bride.\n\nOr, ya know ... you can just see for yourself in the pic below:\n\nLook, Depp superfans are a real and terrifying bunch, and we know better than to needlessly provoke them, so before you scroll down to the comments to excoriate us for cracking jokes about a dying man, let us make one thing clear:\n\nJohnny Depp is probably not dying.\n\nIn fact, he's probably just fine.\n\nIn fact, his reps have already issued a statement claiming that he's losing weight on purpose and is healthier than he's been in years.\n\nBut none of that will stop the Australian tabloids from working their readers up into a lather with claims that Depp is on his deathbed.\n\nIn case you're not familiar, Aussie tabloids make British tabloids look like freakin' New York Times in terms of journalistic integrity, which is really saying something, as British tabloids have been putting US tabloids to shame in terms of, well, shamelessness for the past couple decades.\n\nBasically, just think of everything Donald Trump has said about the mainstream media in the past two years and know that all of those things are actually true of the Aussie tabloids.\n\nAnyway, one scandal sheet from Down Under has demonstrated an obsession with Johnny's well-being that's matched only by every single Hot Topic clerk on the planet.\n\nIn a piece with the admirably restrained and subtle title of “What’s Killing Johnny?” a magazine that's apparently known only as NW claimed that sources close to the actor are deeply concerned that he's on his last (fatally skinny) legs.\n\n“His friends are worried he’s keeping quiet about a serious illness,\" says an almost certainly made-up \"insider.\"\n\n\"It’s well known that he’s a heavy drinker and the fear is his frail appearance could be linked to drugs or booze… or both.\"\n\nThe insider claims that one illness in particular has Johnny fans concerned:\n\n“Many are worried he possibly has liver cancer or something because he’s so skinny and has got, like, no hair now.”\n\nLol at the claim that \"many\" people jumped to that same ultra-specific conclusion.\n\n\"Johnny's looking slimmer than usual. Must be the liver cancer,\" cried the masses in unison.\n\nWe guess the folks at NW can skate by on a technicality here, as Johnny Depp will almost certainly not live forever, and is thus dying, in a sense.\n\nBut if we know Johnny -- and we don't -- he'll be shambling across the stage like the reanimated cadaver of his idol Keith Richards long after everyone has stopped caring or paying attention.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--YoHqp3PL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1528125637/johnny-depp-in-russia.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--YoHqp3PL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1528125637/johnny-depp-in-russia.jpg", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2018/06/johnny-depp-hiding-deadly-disease-from-fans/", "title": "Johnny Depp: Hiding Deadly Disease From Fans?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/06/johnny-depp-hiding-deadly-disease-from-fans/", "title": "Johnny Depp: Hiding Deadly Disease From Fans?", "description": "Recent photos of Johnny Depp have left fans concerned. And now, one tabloid is standing by a shocking claim about the actor's health.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--lMJT6wV1--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1422561674/johnny-depp-in-tokyo.jpg", "type": "image/jpeg", "width": 630, "height": 940}}, "article": {"published_time": "2018-06-15T17:54:11-04:00", "modified_time": "2018-06-15T17:53:14-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Johnny Depp: Hiding Deadly Disease From Fans?", "description": "Recent photos of Johnny Depp have left fans concerned. And now, one tabloid is standing by a shocking claim about the actor's health.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--YoHqp3PL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1528125637/johnny-depp-in-russia.jpg"}}, "description": "Recent photos of Johnny Depp have left fans concerned. And now, one tabloid is standing by a shocking claim about the actor's health."}, "movies": [], "publish_date": 1529099651.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}