{"url": "https://people.com/royals/prince-harry-sweet-speech-meghan-markle-commonwealth-youth-forum/", "text": "Prince Harry is sharing his optimism and excitement about joining forces with fiancée Meghan Markle as they forge a new dynamic partnership around the world.\n\nHarry, 33, said in a major speech on Monday that he is “grateful” Meghan, 36, will be at his side to help young peoples’ voices to be heard as he begins a new role as the Commonwealth Youth Ambassador.\n\nGet push notifications with news, features and more.\n\nMaking his first address since being appointed to the position by his grandmother, Queen Elizabeth, Harry said, “I am incredibly grateful that the woman I am about to marry, Meghan, will be joining me in this work, of which she too is hugely excited to take part in.”\n\nAs he plans his first year in the job, he told delegates at the opening of the 11th Commonwealth Youth Forum in London, “I know that serving as an ambassador to young people, I am going to have to try to keep up with you.”\n\nImage zoom SIMON DAWSON/AFP/Getty\n\nHarry and Meghan will undertake tours to Commonwealth countries and convene meetings in the U.K. to “discuss how best we can make Commonwealth platforms work for you, and to ensure maximum impact,” he said. “Both here in the U.K. and as I travel, my job will be to listen to you.”\n\nFriends of the prince have told PEOPLE that he and Meghan see the Commonwealth as a perfect place for their international philanthropic activities, which match a lot of the charity work Meghan had done before she joined the royal fold. They are set to take part in some Commonwealth events later this week.\n\nOn Monday, Harry said he is drawing inspiration from the Queen, 91, as “the ultimate source of guidance on all things Commonwealth,” which is comprised of the 53 “thriving family of nations” linked to the U.K.\n\nRELATED PHOTOS: See Every Single One of Meghan Markle’s Chic Outfits — and Find Out How to Get Them for Less\n\n“On the day of her 21st birthday, the then-Princess Elizabeth gave an extraordinary radio address from Cape Town. With an eye on the future, and an already unflinching sense of duty, she made a commitment,” he told the delegates. “She said that whether her life be long or short, it would be dedicated to the service of the people of the Commonwealth.”\n\n“From that speech in 1947 onwards, she has known that young people really make the difference,” Harry continued. “Her call to action was for her fellow young people to lead the way in making the Commonwealth a ‘more free, more prosperous, more happy and a more powerful influence for good in the world.'”\n\nCan’t get enough of PEOPLE’s Royals coverage? Sign up for our newsletter to get the latest updates on Kate Middleton, Meghan Markle and more!\n\nRELATED VIDEO: The Look of Love! See Prince Harry and Meghan Markle’s Stunning Official Engagement Photos\n\nAnd he paid tribute to the foresight of his father, Prince Charles, 69, adding, “The young adults I have met across the Commonwealth have shown me time and again that your generation understands something very important: that to tackle a big challenge, you need to focus on the root causes, not the symptoms — something my father has believed for years, yet something society still struggles with.”\n\nImage zoom Simon Dawson-WPA Pool/Getty\n\nHe told the young people in front of him, “You are connected. You have made positive use of technology to build relationships within your communities, nations and across the globe.”\n\nRELATED: The Sweet Way Prince Harry and Meghan Markle Will Honor Princess Diana at Their Wedding\n\n“You care. You want your nations to be cleaner, your planet to be greener, your friends and neighbors to be treated fairly and with respect, no matter their ethnicity, their religion, or their status,” he continued. “You are optimistic. The complicated challenges we face – climate change, inequality, conflict – they do not discourage you. Rather, they inspire you to persevere and effect change.”\n\nImage zoom Chris Jackson/Getty\n\nThe speech comes at an exciting time for the royal family: Kate Middleton is expected to give birth to her and Prince William’s third child later this month, and the countdown is on for Harry and Meghan’s highly anticipated wedding on May 19.\n\n“Meghan is going to be a force,” a palace source told PEOPLE of the actor’s new chapter in the royal family. “She will help him really define his role and relate to the public in a way that he wouldn’t have been able to do before. It was worth the wait.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-41-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-8-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg", "keywords": [], "authors": ["Simon Perry"], "canonical_link": "https://people.com/royals/prince-harry-sweet-speech-meghan-markle-commonwealth-youth-forum/", "title": "Prince Harry Just Gave the Sweetest Shout Out to the 'Woman I Am About to Marry'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "British Royals,Celebrity Weddings,Couples,Meghan Markle,News,Prince Harry,Queen Elizabeth,Queen Elizabeth II,Royal News,Royal Wedding", "news_keywords": "British Royals,Celebrity Weddings,Couples,Meghan Markle,News,Prince Harry,Queen Elizabeth,Queen Elizabeth II,Royal News,Royal Wedding", "description": "Prince Harry is sharing his optimism and excitement about joining forces with fiancée Meghan Markle", "og": {"title": "Prince Harry Just Gave the Sweetest Shout Out to the 'Woman I Am About to Marry'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/royals/prince-harry-sweet-speech-meghan-markle-commonwealth-youth-forum/", "description": "Prince Harry is sharing his optimism and excitement about joining forces with fiancée Meghan Markle&nbsp;as they forge a new dynamic partnership around the world. Harry,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/royals/prince-harry-sweet-speech-meghan-markle-commonwealth-youth-forum/", "description": "Prince Harry is sharing his optimism and excitement about joining forces with fiancée Meghan Markle", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/royals/prince-harry-sweet-speech-meghan-markle-commonwealth-youth-forum/", "title": "Prince Harry Just Gave the Sweetest Shout Out to the 'Woman I Am About to Marry'", "description": "Prince Harry is sharing his optimism and excitement about joining forces with fiancée Meghan Markle", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fprince-harry-61-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}