{"url": "www.businessinsider.com/trump-relationship-with-oprah-winfrey-2018-1", "text": "President Donald Trump has long admired Oprah Winfrey, the much-beloved media mogul and self-made billionaire.\n\nIn 1999, Trump even said Winfrey would be his top pick for a vice presidential running mate. In 2015, he defended that choice. \"I think we'd win easily,\" he said.\n\nBut as speculation about Winfrey's own political ambitions mount, Trump may be forced to change his tune about his former friend.\n\n\n\nPresident Donald Trump has long admired Oprah Winfrey, the much-beloved media mogul and self-made billionaire. But that may change now that Winfrey is reportedly considering a 2020 presidential bid herself.\n\nTrump has spoken glowingly of Winfrey over the last few decades, even telling TV host Larry King in 1999 that Winfrey would be his top pick for a vice presidential running mate, should he run.\n\n\"I love Oprah. Oprah would always be my first choice,\" Trump told King. \"She's a terrific woman, she's somebody that's very special. If she'd do it, she'd be fantastic. She's popular, she's brilliant, she's a wonderful woman.\"\n\nAnd in 2015, Trump again suggested he might pick Winfrey as his presidential running mate, telling ABC News’s George Stephanopoulos that the two would \"win easily\" if they teamed up.\n\n\"I like Oprah, what can I tell you?\" Trump said in the interview. \"She's great, she's talented, she's a friend of mine, she's a good person. I've been on her show. … I like Oprah, is that supposed to be a bad thing? I'd love to have Oprah, I think we'd win easily, actually.\"\n\nTrump has also publicly praised her on Twitter, tweeting in 2012 that he \"adore[s]\" Winfrey and calling her \"terrific\" in a 2013 tweet.\n\nThe president has appeared on Winfrey's long-running daytime talk show multiple times and 30 years ago, in 1988, discussed his possible presidential ambitions.\n\n\"I know people have talked to you about whether or not you want to run — would you ever?\" Winfrey asked Trump.\n\nTrump demurred, responding that he had no immediate plans to run for office, but went on to say that he would have \"a hell of a chance of winning\" because he, like many Americans, he argued, is frustrated by trade deals and foreign policy that he said disadvantaged the US.\n\n\"I probably wouldn't, but I do get tired with seeing what's happening with this country and if it got so bad I'd never want to rule it out totally,\" he said.\n\nTrump went on to say that if he were elected president, \"this country would make one hell of a lot of money from those people that for 25 years have taken advantage.\"\n\n\"It wouldn't be the way it's been, believe me,\" he said.\n\nDonald Trump and Winfrey. Screenshot/YouTube\n\nOprah 2020?\n\nSpeculation about Winfrey's own political ambitions are mounting after she delivered a powerful speech at the Golden Globe awards on Sunday night, weaving stories of racial and gender injustice into a hopeful narrative that many argued read like a political stump speech.\n\n\"I want all the girls watching here and now to know that a new day is on the horizon,\" she said to a standing ovation.\n\nWhile Winfrey recently shot down the idea of a possible presidential bid, telling Gayle King on \"CBS This Morning\" in October that there would be \"no running for office of any kind for me,\" she said on Sunday that she would consider a run. Two of Winfrey's close friends told CNN that she is \"actively considering\" a 2020 bid. And Winfrey's longtime partner, Stedman Graham, told The Los Angeles Times on Sunday that Winfrey would \"absolutely\" run if \"the people\" want her to.\n\nIn fact, Winfrey told Bloomberg last March that Trump's election inspired her to consider the possibility.\n\n\"I thought, 'Oh gee, I don't have the experience, I don't know enough.' And now I'm thinking, 'Oh. Oh!'\" she said.\n\nWinfrey was a strong supporter of former President Barack Obama's 2008 and 2012 presidential campaigns and she endorsed Hillary Clinton in 2016. But her political positions are largely unknown.\n\nDuring a 2008 stump speech for Obama in Iowa, Winfrey said she's voted for candidates on both sides of the aisle.\n\n\"Over the years, I've voted for as many Republicans as I have Democrats, so this isn't about partisanship for me, this is very, very personal,\" she said. \"I'm here because of my personal conviction about Barack Obama and what I know he can do for America.\"\n\nThe White House responded to the 2020 speculation on Monday.\n\n\"We welcome the challenge, whether it be Oprah Winfrey or anybody else,\" White House spokesman Hogan Gidley told reporters on Monday, adding that Trump will definitely run for reelection.\n\nWatch the 1988 interview below:", "images": ["http://www.businessinsider.com/trump-relationship-with-oprah-winfrey-2018-1?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5a53fb4cc32ae63f018b51ed?width=1200&format=jpeg", "https://i.insider.com/5a53c0d9c32ae667018b5057?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a53c0d9c32ae667018b5057?width=24&format=jpeg&auto=webp", "https://i.insider.com/5a53fb4cc32ae63f018b51ed?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5a53fb4cc32ae63f018b51ed?width=1200&format=jpeg", "keywords": [], "authors": ["Eliza Relman"], "canonical_link": "https://www.businessinsider.com/trump-relationship-with-oprah-winfrey-2018-1", "title": "Trump has a long and warm relationship with Oprah that helped springboard his presidential ambitions", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Trump has a long and warm relationship with Oprah that helped springboard his presidential ambitions", "date": "2018-01-08", "news_keywords": "Donald Trump, Oprah Winfrey, Presidencial Bid, Presidency, White House, Barack Obama, Eliza Relman", "description": "President Donald Trump has long admired Oprah Winfrey, who is apparently considering a 2020 presidential run herself.", "author": "Eliza Relman", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Politics", "og": {"title": "Trump has a long and warm relationship with Oprah that helped springboard his presidential ambitions", "description": "President Donald Trump has long admired Oprah Winfrey, who is apparently considering a 2020 presidential run herself.", "type": "article", "url": "https://www.businessinsider.com/trump-relationship-with-oprah-winfrey-2018-1", "image": "https://i.insider.com/5a53fb4cc32ae63f018b51ed?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Trump has a long and warm relationship with Oprah that helped springboard his presidential ambitions", "sailthru.date": "2018-01-08", "sailthru.tags": "Donald Trump, Oprah Winfrey, Presidencial Bid, Presidency, White House, Barack Obama, Eliza Relman", "sailthru.description": "President Donald Trump has long admired Oprah Winfrey, who is apparently considering a 2020 presidential run herself.", "sailthru.author": "Eliza Relman", "sailthru.verticals": "politics", "sailthru.image.full": "https://i.insider.com/5a53fba23225de9b198b4f5f?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5a53fba23225de9b198b4f5f?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@PoliticsInsider"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5a53b7f33225deb4198b4dec", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": ["https://www.youtube.com/embed/SEPs17_AkTI"], "publish_date": 1515340800.0, "source": "http://www.businessinsider.com", "summary": ""}