{"url": "www.thecut.com/2018/08/brad-pitt-angelina-jolie-divorce-latest-news.html", "text": "Brad Pitt and Angelina Jolie. Photo: Getty Images\n\nTwo years ago, Brad Pitt and Angelina Jolie dropped a bombshell: the Hollywood power couple was splitting up after two years of marriage but roughly 12 years together. What followed were months of back and forth between the (former) couple in the press. There were leaks about custody battles and Pitt’s reported drinking and weed smoking; meanwhile, Pitt gave a candid interview with GQ about the split and his new passion for sculpture and R&B music.\n\nLast summer, there were a slew of new stories, court filings, and suspicious tabloid take-downs in this seemingly never-ending saga. But on Friday, a judge reportedly declared both Pitt and Jolie to be legally single – though their divorce settlement has not yet been finalized.\n\nHere, a look at all that has happened with Brangelina’s divorce.\n\nFirst, can we look back at their … uh … happier … days?\n\nSure. The coupling of Brad Pitt and Angelina Jolie is already Hollywood legend. The pair met while filming Mr. and Mrs. Smith in 2004 — back when Pitt was still married to Jennifer Aniston. Rumors about what may or may not have gone down between Pitt and Jolie on set ran rampant. Eventually, he and Aniston split up, and his relationship with Jolie (officially) came to light. But despite their, erm, salacious start, Pitt and Jolie proved to be the real deal. They were involved for 12 years, and had six kids and a French vineyard together.\n\nSo what went wrong?\n\nBack in September 2016, we learned that an “incident” reportedly went down on a private plane, and that the Los Angeles Department of Child and Family Services and FBI got involved. That “incident,” which reportedly involved Pitt and son Maddox Jolie-Pitt, is said to be what prompted Jolie to file for divorce. But in an interview with Vanity Fair in 2017, Jolie made it pretty clear she didn’t want to talk on the record about what happened.\n\nAh, okay. But what’s happened since then?\n\nWell, a lot. Just on the personal front, Pitt is said to have allegedly sobered up in rehab following the divorce announcement. He also was either involved or just friends with MIT professor Neri Oxman for a while (their exact relationship has always been unclear, despite making countless headlines). Jolie, meanwhile, has kept up with her humanitarian work for the United Nations. But divorce-wise, the Pitt and Jolie hadn’t been able to agree on custody or child-support arrangements — which means they’re still technically married.\n\nAwkward. So, what went down last summer?\n\nAs I said, Jolie and Pitt just couldn’t seem to come to an understanding over custody or seemingly anything else tied to their split. The kids had been living in London as Jolie filmed in the U.K., though Pitt is still based in Los Angeles. Back in June, a judge established a schedule for Pitt to spend time with the kids (other than Maddox, who at 16 the court determined was old enough to decide if he wanted to see his dad or not). As a result, Jolie and the kids returned to Los Angeles.\n\nThen, over the summer of 2018, there were a ton of new stories about the couple. It was nearly impossible to keep all these threads straight, so we organized them for you in handy lists:\n\nJolie’s lawyer drama:\n\n• In early August 2018, TMZ cited a “source connected to Brad” in reporting that Jolie has been so “hostile” in the divorce proceedings that her allegedly fed-up attorney — celebrity divorce lawyer Laura Wasser — is quitting.\n\n• Then, Jolie’s spokesperson denied TMZ’s report to People, saying Wasser is not quitting “now or in the future. But an “insider” did say the divorce was “entering a new phase.”\n\n• By late August, Jolie confirmed that she was parting ways with Wasser. A spokesperson for Jolie, Mindy Nyby, told People in a statement: “Angelina has decided to change counsel to Samantha Bley Dejean, as Samantha’s expertise is the protection and best interest of children.” Then, a “source” told People that Jolie picked the new attorney as the lead counsel in the case “a month ago.”\n\nThe back-and-forth about Pitt’s child support payments:\n\n• In legal documents filed on August 7, Jolie’s attorney claimed “Pitt has paid no meaningful child support since separation.” Jolie also asked the court to order Pitt to pay her the money she is owed, CNN reports.\n\n• But that same day, a “source” told People that Pitt has actually paid “easily millions” toward child support since the 2016 split.\n\n• Around that same time, documents obtained by the Daily Mail, Pitt said that he has paid more than $1.3 in “bills” for the children and loaned Jolie $8 million — and he wants to collect interest on the loan.\n\n• Jolie countered that a loan “is not child support.”\n\nAnd of course, the petty tabloid stories:\n\nA constant in the battle between Jolie and Pitt were the seemingly never-ending tabloid stories attacking one party at a time. Here are a select few:\n\n• “Page Six” reported on August 7 that a “source” close to Pitt slammed Jolie’s child support filing as a “publicity stunt.”\n\n• On August 15, Us Weekly had an “exclusive” on how Jolie is attacking Pitt because she knows joint custody is a “done deal.” The story paints Pitt as the victim.\n\n• “Page Six” had a bizarre story on August 20 about how Jolie is jealous of Amal Clooney. It also says that the Clooneys have taken Pitt’s side in the divorce battle. Hmmm …\n\n• A “source” told Entertainment Tonight on August 23 that Pitt is “sickened” that Jolie is letting their custody battle be aired in public.\n\n• Again, “Page Six” went for Jolie on August 25 — with a story about how she is not the “saint” she appears to be. Lainey Gossip points out that by now, it’s clear how these stories about Jolie keep getting out.\n\nLuckily, they eventually reportedly reached a “truce,” which sounds nice.\n\nEntertainment Tonight reported in September that Jolie and Pitt had a reached a “truce.” A “source” told ET: “Brad and Angelina actually set up a secret meeting at her house. It’s the first time they have truly gotten together to make things work since their group therapy with the children. Brad and Angie’s meeting was a success. They are going to stay with the plan set forth through the courts.” This reportedly means that they are going to “create a calmer situation for the kids.” Good.\n\nThen, they headed to court in early December.\n\nAccording to TMZ, a custody hearing date has finally been set for Pitt and Jolie in early December in California. The former pair have reportedly filed docs asking a judge to give them until June to sort out the final details of their divorce (with the use of a private judge, who will also help them figure out the division of property), but on December 4, their custody trial is set to start. TMZ notes that Jolie still wants sole custody, while Pitt wants joint custody of their children. The trial will reportedly take two to three weeks.\n\nAnd now, they’re both legally single (though not yet technically divorced).\n\nE! News reports that as of Friday, a judge has declared both Pitt and Jolie to be legally single. The judge issued a bifurcated judgment, according to The Blast, which means that their marriage is essentially over, even though they are still finalizing their divorce settlement and custody agreement.\n\nThis post has been updated throughout.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/08/08/08-brad-angelina.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/08/08/08-brad-angelina.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/08/08/08-brad-angelina.w1200.h630.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2019/04/brad-pitt-angelina-jolie-divorce-latest-news.html", "title": "What’s Going on With Brad Pitt and Angelina Jolie’s Divorce?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Brad Pitt and Angelina Jolie Are Officially Single", "url": "https://www.thecut.com/2019/04/brad-pitt-angelina-jolie-divorce-latest-news.html", "description": "Although their divorce settlement has yet to be finalized.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/08/08/08-brad-angelina.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Brad Pitt and Angelina Jolie Are Officially Single", "description": "Although their divorce settlement has yet to be finalized.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/08/08/08-brad-angelina.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2019-04-15T09:16:00.000-04:00", "tag": "brangelina divorce, culture, celebrity, brad pitt, angelina jolie", "publisher": "https://www.facebook.com/cut"}, "description": "Brad Pitt and Angelina Jolie split two years ago, but news stories about their divorce and custody problems continue to come out. Here, a look at the latest in their divorce drama.", "sailthru.tags": "brangelina divorce, culture, celebrity, brad pitt, angelina jolie", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1555334160.0, "source": "http://www.thecut.com", "summary": ""}