{"url": "https://www.theguardian.com/film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse", "text": "Actor calls former co-star’s remarks about ‘spectrum of behaviour’ in sexual misconduct ‘Orwellian’ and questions defence of disgraced comedian Louis CK\n\nThe actor Minnie Driver has told the Guardian that men “simply cannot understand what abuse is like on a daily level” and should not therefore attempt to differentiate or explain sexual misconduct against women.\n\n\n\nClarence Thomas accuser Anita Hill to spearhead fight against harassment in Hollywood Read more\n\nDriver was discussing comments by Matt Damon, whom she once dated and with whom she starred in the Oscar-winning 1997 film Good Will Hunting. In an interview with ABC News this week, Damon said alleged sexual misconduct by powerful men involved “a spectrum of behaviour”.\n\nDamon said there was “a difference between patting someone on the butt and rape or child molestation. Both of those behaviours need to be confronted and eradicated without question, but they shouldn’t be conflated.”\n\n\n\nHe added that society was in a “watershed moment” and said it was “wonderful that women are feeling empowered to tell their stories and it’s totally necessary”. But he said: “We live in this culture of outrage and injury, that we’re going to have to correct enough to kind of go, ‘Wait a minute. None of us came here perfect.’”\n\nIn her first response to Damon, Driver wrote on Twitter: “God God, seriously?\n\n\n\n“Gosh it’s so interesting (profoundly unsurprising) how men with all these opinions about women’s differentiation between sexual misconduct, assault and rape reveal themselves to be utterly tone deaf and as a result, systemically part of the problem.”\n\nDriver’s response to Damon was shared widely on social media, alongside that of the actor Alyssa Milano, who said: “There are different stages of cancer. Some more treatable than others. But it’s still cancer.”\n\nOn Saturday, Driver told the Guardian: “I felt I desperately needed to say something. I’ve realised that most men, good men, the men that I love, there is a cut-off in their ability to understand. They simply cannot understand what abuse is like on a daily level.\n\n“I honestly think that until we get on the same page, you can’t tell a woman about their abuse. A man cannot do that. No one can. It is so individual and so personal, it’s galling when a powerful man steps up and starts dictating the terms, whether he intends it or not.”\n\nDriver’s comments come more than two months into a radical national reappraisal of gender relations begun by accusations against Harvey Weinstein, an executive producer of Good Will Hunting who denies allegations including sexual assault and rape.\n\nSpeaking to ABC, Damon compared allegations against Weinstein, Al Franken, Kevin Spacey and the comedian Louis CK, whom he commended for his remorseful response.\n\n“That’s the sign of somebody who – well, we can work with that,” Damon said, adding: “I don’t know Louis CK. I’ve never met him. I’m a fan of his, but I don’t imagine he’s going to do those things again. You know what I mean? I imagine the price that he’s paid at this point is so beyond anything ... ”\n\nDriver said that as accusations, suspensions and firings first swept through Hollywood, she initially refrained from comment. She was now moved to expand her initial response to Damon.\n\n“I don’t understand why Matt would defend Louis CK,” she said. “It seems to me that he thinks that because he didn’t rape somebody – so far as we know – that what he did do wasn’t as bad.”\n\nThe comedian was accused of misconduct including masturbating in front of a number of women. In response, he said “these stories are true” but did not specifically apologise.\n\nFacebook Twitter Pinterest Matt Damon attends a screening in New York. Photograph: Evan Agostini/Invision/AP\n\n“That’s a problem,” Driver continued. “If good men like Matt Damon are thinking like that then we’re in a lot of fucking trouble. We need good intelligent men to say this is all bad across the board, condemn it all and start again.”\n\nDriver argued that men should not be granted the power to interpret abuse inflicted on women without the risk of redoubling an injustice they can scarcely understand.\n\n“I felt that what Matt Damon was saying was an Orwellian idea, we are all equal except that some us are more equal than others,” she said. “Put abuse in there … that all abuse is equal but some is worse.”\n\nShe added: “There is no hierarchy of abuse – that if a woman is raped [it] is much worse than if woman has a penis exposed to her that she didn’t want or ask for … you cannot tell those women that one is supposed to feel worse than the other.\n\n“And it certainly can’t be prescribed by a man. The idea of tone deafness is the idea there [is] no equivalency.\n\nPeter Jackson: I blacklisted Ashley Judd and Mira Sorvino under pressure from Weinstein Read more\n\n“How about: it’s all fucking wrong and it’s all bad, and until you start seeing it under one umbrella it’s not your job to compartmentalise or judge what is worse and what is not. Let women do the speaking up right now. The time right now is for men just to listen and not have an opinion about it for once.”\n\nSince the first publication of allegations against Weinstein, a number of women have come forward to detail abuse they have suffered. This week, the actor Salma Hayek wrote a long essay for the New York Times about her treatment by Weinstein.\n\n“There is not a woman I know,” Driver said, “myself included, who has not experienced verbal abuse and sexual epithets their whole fucking life, right up to being manhandled and having my career threatened several times by men I wouldn’t sleep with.”\n\nDriver did not elaborate on the persons or circumstances involved. But she expressed optimism that as the culture of harassment and abuse that has existed is exposed, men will find a way to support women.\n\n“In the same stereotypical way that we see women being supportive of men in their endeavors,” she said, “I feel that’s what women need of men in this moment. They need men to lean on and not question.\n\n“Men can rally and they can support, but I don’t think its appropriate, per se, for men to have an opinion about how women should be metabolising abuse. Ever.”\n\n", "images": ["https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=300&quality=85&auto=format&fit=max&s=d351c0db9fefab8f45239d58783fe56b", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Minnie+Driver%2CMatt+Damon%2CFilm%2CCulture%2CUS+news%2CWorld+news%2CSexual+harassment%2CHarvey+Weinstein", "https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=712b60b8ff52c5793853053e2fec94ad", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/be471b7c6f672c93418dc64a5f80c940532e9e62/0_154_3000_1800/master/3000.jpg?width=300&quality=85&auto=format&fit=max&s=bc4ca91f9c021e1585d95dd4ddc5be77"], "top_img": "https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=712b60b8ff52c5793853053e2fec94ad", "keywords": [], "authors": ["Edward Helmore"], "canonical_link": "https://www.theguardian.com/film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse", "title": "Minnie Driver: men like Matt Damon 'cannot understand what abuse is like'", "meta_data": {"description": "Actor calls former co-star’s remarks about ‘spectrum of behaviour’ in sexual misconduct ‘Orwellian’ and questions defence of disgraced comedian Louis CK", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Edward Helmore", "thumbnail": "https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=620&quality=85&auto=format&fit=max&s=62b30929a841297fcb1555d6df022c03", "keywords": "Minnie Driver,Matt Damon,Film,Culture,US news,World news,Sexual harassment,Harvey Weinstein", "news_keywords": "Minnie Driver,Matt Damon,Film,Culture,US news,World news,Sexual harassment,Harvey Weinstein", "og": {"url": "http://www.theguardian.com/film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse", "image": "https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=712b60b8ff52c5793853053e2fec94ad", "description": "Actor calls former co-star’s remarks about ‘spectrum of behaviour’ in sexual misconduct ‘Orwellian’ and questions defence of disgraced comedian Louis CK", "type": "article", "title": "Minnie Driver: men like Matt Damon 'cannot understand what abuse is like'", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/edwardhelmore", "publisher": "https://www.facebook.com/theguardian", "section": "Film", "published_time": "2017-12-17T20:04:17.000Z", "tag": "Minnie Driver,Matt Damon,Film,Culture,US news,World news,Sexual harassment,Harvey Weinstein", "modified_time": "2020-02-24T18:37:21.000Z"}, "al": {"ios": {"url": "gnmguardian://film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse", "iphone": "gnmguardian://film/2017/dec/16/minnie-driver-matt-damon-men-cannot-understand-abuse?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/e13af76787c7a58fa41665fa74000dec12a50ff4/0_100_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&s=653d1ccba5742c6f481d38c5b958a79e", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1513353600.0, "source": "https://www.theguardian.com", "summary": ""}