{"url": "www.cheatsheet.com/entertainment/this-1-country-singer-wants-to-officiate-gwen-stefani-and-blake-sheltons-wedding.html/", "text": "Gwen Stefani and Blake Shelton are still going strong after meeting on The Voice years ago. But many are wondering if they will ever walk down the aisle and how they will do it — so much so that a country singer has already offered to officiate their ceremony.\n\nSo what exactly are their marriage plans? Here are seven things to know, including the one country singer who wants to officiate the couple’s wedding.\n\n1. Shelton might have dissed ex Miranda Lambert on Twitter\n\nHe fired off with these harsh words. | He fired off with these harsh words. | Blake Shelton via Twitter\n\nAlthough Shelton and Stefani have been dating three years now, he might still have some resentful feelings for his ex-wife, Miranda Lambert. He tweeted, “Been taking the high road for a long time.. I almost gave up. But I can finally see something on the horizon up there!! Wait!! Could it be?! Yep!! It’s karma!!” on April 25.\n\nSo what could this be referring to? In Touch Weekly reports Lambert has moved on to dating Evan Felker who is still technically married to Staci Felker. Felker filed for divorce in February of 2018. He reportedly struck up his relationship with Lambert after the split.\n\n“They’re figuring it out. It’s in the early stages; they’re still getting to know each other,” an insider said. There also might be a sore spot there because Miranda Lambert, Blake Shelton, and Gwen Stefani were in the same room recently for the American Country Music Awards.\n\nShelton and Stefani mostly stuck to themselves. Otherwise, the couple seems to be doing well.\n\nNext: This is what Shelton said about the marriage rumors.\n\n\n\n2. Shelton and Stefani joke about marriage rumors\n\nShelton and Stefani seem happier than ever. | Kevin Winter/Getty Images Shelton and Stefani seem happier than ever. | Kevin Winter/Getty Images\n\nThe celebrity couple is pretty aware of the marriage rumors swirling around them. In an interview, Shelton said “Well, I don’t know if you guys read the magazines, but we’ve been married for a while. It’s been on the cover of all the credible magazines!”\n\nNext: A source said this is how they really feel about marriage.\n\n\n\n3. A source said they are happy with their relationship the way it is\n\nThe couple might not even want to get married at all. | Christopher Polk/Getty Images The couple might not even want to get married at all. | Christopher Polk/Getty Images\n\nAlthough there have been reports that the couple could be getting married, there are sources saying it’s not really a priority for them.\n\n“There is no reason for them to rush into a marriage, so they aren’t,” a source said according to ET. “Both of them are happy and content with where their relationship is right now.”\n\nNext: Stefani reveals she thinks about marriage.\n\n\n\n4. Stefani said she thinks about marrying Shelton ‘all the time’\n\nStefani might be thinking about walking down the aisle. | NBC Stefani might be thinking about walking down the aisle. | NBC\n\nDuring her appearance on Ellen DeGeneres’ show, Stefani was grilled about whether they will be walking down the aisle.\n\nWhen DeGeneres told her to think about getting married, she said, “I do, I think about it all the time.”\n\nNext: This country singer wants to officiate their wedding.\n\n\n\n5. Luke Bryan wants to officiate their ceremony\n\nLuke Bryan | Ronald Martinez/Getty images Luke Bryan | Ronald Martinez/Getty images\n\nThe one country singer that wants to help on the big day is Luke Bryan. “I’ll do the sermon. The sermon? The service?” told ET. “I would be honored to marry Blake and Gwen.”\n\nNext: This is why Bryan thinks they should get married.\n\n\n\n6. Bryan joked that Shelton needs to hurry up and get married\n\nThe artist wants to see them getting hitched. | Frazer Harrison/Getty Images The artist wants to see them getting hitched. | Frazer Harrison/Getty Images\n\nBryan thinks the couple getting hitched quickly would be best for Shelton.\n\n“If Blake were smart, he would marry her before she goes to an optometrist,” he said according to ET. “Every time I meet Gwen, she’s holding her phone way out here. I’m like, ‘That’s it, she can’t see!'”\n\nNext: This is what Shelton said about Bryan’s offer.\n\n\n\n7. Shelton rejects Bryan’s offer\n\nShelton isn’t really into the idea. | Kevin Winter/Getty Images for iHeartMedia Shelton isn’t really into the idea. | Kevin Winter/Getty Images for iHeartMedia\n\nBryan won’t be officiating the ceremony, given Shelton’s response. “Luke’s not even a legitimate country artist, much less like somebody that can marry people, you know what I’m saying,” Shelton joked on The Voice.\n\nFollow Nicole Weaver on Twitter @nikkibernice.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-and-Gwen-Stefani-640x300.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-640x450.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Gwen-Stefani-and-Blake-Shelton-Peoples-Choice-Awards-1-640x320.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png", "https://www.cheatsheet.com/wp-content/uploads/2015/12/GettyImages-498854032-640x437.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Luke-Bryan-640x444.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Stefani-on-Ellen-DeGeneres-640x356.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/this-1-country-singer-wants-to-officiate-gwen-stefani-and-blake-sheltons-wedding.html/", "title": "This 1 Country Singer Wants to Officiate Gwen Stefani and Blake Shelton’s Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/this-1-country-singer-wants-to-officiate-gwen-stefani-and-blake-sheltons-wedding.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Gwen Stefani reveals which country singer offered to officiate her wedding with Blake Shelton.", "og": {"locale": "en_US", "type": "article", "title": "This 1 Country Singer Wants to Officiate Gwen Stefani and Blake Shelton's Wedding", "description": "Gwen Stefani reveals which country singer offered to officiate her wedding with Blake Shelton.", "url": "https://www.cheatsheet.com/entertainment/this-1-country-singer-wants-to-officiate-gwen-stefani-and-blake-sheltons-wedding.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-11T20:07:21-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "The Voice", "section": "Entertainment", "published_time": "2018-06-11T20:06:00-04:00", "modified_time": "2018-06-11T20:07:21-04:00"}, "twitter": {"card": "summary_large_image", "description": "Gwen Stefani reveals which country singer offered to officiate her wedding with Blake Shelton.", "title": "This 1 Country Singer Wants to Officiate Gwen Stefani and Blake Shelton's Wedding", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blake-Shelton-tweet-640x372.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528761960.0, "source": "http://www.cheatsheet.com", "summary": ""}