{"url": "https://popculture.com/healthy-living/2017/05/20/kesha-talks-body-shaming-and-how-the-internet-contributed-to-her/", "text": "A post shared by Kesha (@iiswhoiis) on Mar 24, 2017 at 12:33am PDT\n\nAfter undergoing rehab for two months to treat an eating disorder in 2014, singer and songwriter, Kesha has vowed to spend less time online due to the damaging effects internet trolls had on her health.\n\nThe 30-year-old best known for her hits, “Tik Tok” and “Die Young,” wrote an essay in Teen Vogue, revealing she has encountered her fair share cyberbullying by body-shamers and occasionally fired back at them.\n\n“When I think about the kind of bullying I dealt with as a child and teen, it seems almost quaint compared with what goes on today,” she wrote. “The amount of body-shaming and baseless slut-shaming online makes me sick. I know from personal experience how comments can mess up somebody's self-confidence and sense of self-worth. I have felt so unlovable after reading cruel words written by strangers who don't know a thing about me.”\n\nKesha calls it a “vicious cycle,” writing that reading all the mean comments forced her to compare herself to others, which only fed into her anxiety and depression.\n\n“Seeing paparazzi photos of myself and the accompanying catty commentary fueled my eating disorder,” she wrote. “The sick irony was that when I was at some of the lowest points in my life, I kept hearing how much better I looked. I knew I was destroying my body with my eating disorder, but the message I was getting was that I was doing great.”\n\nSince her stint in rehab nearly three years ago, Kesha has been entangled in a legal battle with former music producer, Dr. Luke. In addition to invalidating her recording contracts with him, the Los Angeles-native sued Luke for sexual assault and battery.\n\nMORE: Sony Cuts Ties With Dr. Luke Amid Kesha Legal Battle\n\nFans have come to Kesha’s side, lending their support with the singer writing in Teen Vogue that she has “grown up a lot” in the past few years.\n\n“I’ve realized that once you take the step to help yourself, you’re going to be so happy you did,” she wrote. “Taking the time to work on yourself requires bravery. Trying to change your life based on other people’s thoughts can drive you crazy. You have to figure out what makes you feel good and what keeps you in a positive head space.”\n\nKesha goes on to share that she has changed her relationship with social media in order to feed a more positive attitude to her lifestyle.\n\n“I love it because it’s how I communicate with my fans — and nothing means more to me than my fans — but too much of it can exacerbate my anxiety and depression,” she wrote.\n\nAs a method of self-help, Kesha writes she took a pledge to take more breaks from social media and screens, and spend a lot more time outdoors.\n\n“For me, some of the most therapeutic experiences include hiking up a mountain or riding a bike by the beach,” she wrote. “Being among animals in their natural habitats reminds me that my problems are so small. Our lives are no more significant than the lives of any other animals. We're all just animals, after all!”\n\nEnding off her essay on a high and empowering note, Kesha writes, “Remember that beauty comes in all shapes and sizes. And that no one can take the magic you make.”\n\nPhoto Credit: Twitter / @AV_newswire\n\nRelated:\n\nKesha Opens up About Eating Disorder Stemming From Dr. Luke's Alleged Body Shaming\n\nKesha Drops Sexual Assault Lawsuit Against Dr. Luke in California\n\nKesha's Abuse Claims Against Dr. Luke Dismissed by Judge", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/healthy-living/2017/05/20/kesha-talks-body-shaming-and-how-the-internet-contributed-to-her/", "title": "Kesha Talks Body Shaming and How the Internet Contributed to Her Eating Disorder", "meta_data": {"description": "A post shared by Kesha (@iiswhoiis) on Mar 24, 2017 at 12:33am PDT After undergoing rehab for two months to treat an eating disorder in 2014, singer and songwriter, Kesha has vowed to spend less time online due to the damaging effects internet trolls had on her health.The 30-year-old best known [...]", "keywords": "Body Positive", "news_keywords": "Body Positive", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Kesha Talks Body Shaming and How the Internet Contributed to Her Eating Disorder", "description": "A post shared by Kesha (@iiswhoiis) on Mar 24, 2017 at 12:33am PDT After undergoing rehab for two [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Kesha Talks Body Shaming and How the Internet Contributed to Her Eating Disorder", "type": "article", "url": "https://popculture.com/healthy-living/2017/05/20/kesha-talks-body-shaming-and-how-the-internet-contributed-to-her/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Healthy Living", "description": "A post shared by Kesha (@iiswhoiis) on Mar 24, 2017 at 12:33am PDT After undergoing rehab for two [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1495209600.0, "source": "https://popculture.com", "summary": ""}