{"url": "https://abcnews.go.com/2020/Royal_Wedding/photos/prince-william-kate-middletons-young-love-st-andrews-13350518/image-13351043", "text": "Prince William and Kate Middleton: The College Years Study buddies, Prince William and Kate Middleton, on campus at St. Andrews University in 2003. William graduated with a master of arts degree in geography, Middleton with a master of arts degree in art history. Peter Kelly\n\nPrince William and Kate Middleton: The College Years Kate Middleton, seated in the first row in a brown shirt, spent part of her gap year in Chile before beginning college at St. Andrews University. Handout\n\nPrince William and Kate Middleton: The College Years Prince William, an avid surfer, enjoyed catching some waves while he was a student at St. Andrews University. Handout\n\nPrince William and Kate Middleton: The College Years Kate Middleton attended then-boyfriend Prince William's rugby sevens tournament sponsored by the Gin House in 2003. Peter Kelly\n\nPrince William and Kate Middleton: The College Years St. Andrews University class of 2005 group photograph. Prince William is seated in the first row, fourth from the right. Kate Middleton is seated in the second to last row, 12th from the right. Alan Richardson Dundee\n\nPrince William and Kate Middleton: The College Years Close-up of Prince William in the St. Andrews University class of 2005 group photograph. Alan Richardson Dundee\n\nPrince William and Kate Middleton: The College Years Close-up of Kate Middleton amid fellow St. Andrews University class of 2005 students. Alan Richardson Dundee\n\nPrince William and Kate Middleton: The College Years Britain's Prince William and Kate Middleton pose together affter their graduation from St. Andrews University, Scotland, June 23, 2005. Courtesy of The Middleton Family", "images": ["http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "https://s.abcnews.com/images/2020/ht_kate_william_study_buddies_jef_ss_110411_ssh.jpg", "https://abcnews.go.com/2020/Royal_Wedding/photos/prince-william-kate-middletons-young-love-st-andrews-13350518/image-13351043", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript"], "top_img": "https://s.abcnews.com/images/2020/ht_kate_william_study_buddies_jef_ss_110411_ssh.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/2020/Royal_Wedding/slideshow/prince-william-kate-middletons-young-love-st-andrews-13350518/image-13351043", "title": "Prince William and Kate Middleton's Young Love at St. Andrews University - ABC News", "meta_data": {"robots": "index, follow", "author": "ABC News", "copyright": "Copyright (c) 2020 ABC News Internet Ventures", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "View Study buddies, Prince William and Kate Middleton, on campus at St. Andrews University in 2003. William graduated with a master of arts degree in geography, Middleton with a master of arts degree in art history. pictures and other Prince William and Kate Middleton: The College Years photos at ABC News", "keywords": "Prince William, Kate Middleton, St Andrews University, college, love, relationship", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Prince William and Kate Middleton: The College Years from William and Kate: The College Years", "og": {"site_name": "ABC News", "title": "Prince William and Kate Middleton: The College Years from William and Kate: The College Years", "description": "Study buddies, Prince William and Kate Middleton, on campus at St. Andrews University in 2003. William graduated with a master of arts degree in geography, Middleton with a master of arts degree in art history.", "url": "https://abcnews.go.com/2020/Royal_Wedding/slideshow/prince-william-kate-middletons-young-love-st-andrews-13350518/image-13351043"}}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}