{"url": "people.com/movies/sherry-lansing-shares-on-set-secrets-angelina-jolie-tom-cruise-mel-gibson/", "text": "Image zoom David Crotty/Patrick McMullan\n\nNot many people get to know celebrities beyond their public persona — but Sherry Lansing has worked with the best.\n\nThe former Paramount Studios CEO, and the first woman to ever be president of a major movie studio, is telling all in a new book about her life, Leading Lady: Sherry Lansing and the Making of a Hollywood Groundbreaker. Though she stepped away from Hollywood in 2005 after decades in the business, the former exec still fondly remembers her time there and opens up to PEOPLE about some of the movie superstars she worked with.\n\nGet push notifications with news, features and more.\n\nRead on for behind-the-scenes stories straight from the best source — the producer and exec who made the films.\n\nAngelina Jolie’s life-changing moment\n\nWhen Angelina Jolie was cast as Lara Croft in Tomb Raider, the studio felt she was a risky choice due to her wild-child reputation. But after the actress fought for the role, she immediately impressed the studio and the crew with her hard work and talent on camera.\n\n“In the dailies, she was riveting,” Lansing recalls in the book. “She took what might have been a cardboard character and added a layer of mystery and emotion and humanity.”\n\nImage zoom BRENT STIRTON/GETTY\n\nJolie with Maddox in Cambodia in 2006\n\nAnd Lansing says she was more than just impressive on film. The former executive got to witness Jolie begin her life as a philanthropist after working in Cambodia where the film was shot — and where she eventually ended up adopting her first son, Maddox, in 2002. The actress had already become involved with the United Nations High Commissioner for Refugees at the time, for which she is now a Special Envoy, thanks to her trips to the Southeast Asian country.\n\n“I saw it earlier on,” Lansing tells PEOPLE of Jolie’s passion for philanthropy. “Right after Tomb Raider, she was on my same flight out of London where she sat next to me. She had nothing with her but a backpack and she was going back to Cambodia to work with the refugees. She was always interested in causes bigger than herself and she always worked hard for those causes. She’s done amazing good to make the world a better place.”\n\nTom Cruise was like a “brother” to her\n\nThere were some people Lansing worked with whom she formed close relationships with — including Tom Cruise. She says she and Cruise were like “brother and sister” as they collaborated on movies like the Mission: Impossible franchise and War of the Worlds, while Cruise’s production company, Cruise/Wagner Productions, had an exclusive deal with Paramount.\n\n“I knew Tom when he was a young boy when he was cast in Taps,” Lansing tells PEOPLE. “The Tom Cruise that I met all those years ago is the same person he is today — the hardest-working actor, brilliant, focused and kind. He’s nice to everyone and he treats everyone with respect.”\n\nImage zoom L. Cohen/WireImage\n\nThe two grew to trust each other, with, according to the book, Cruise coming to rescue in 2005 when Mission: Impossible II was delayed a year. When Lansing started panicking, since the sequel was supposed to be Paramount’s big summer blockbuster that year, Cruise repeatedly told her it was going to be okay. To her surprise, she got a call from Steven Spielberg about Paramount releasing War of the Worlds the very same weekend Mission: Impossible II was slated to open, therefore giving the studio exec the blockbuster she needed.\n\nRELATED VIDEO: Mel Gibson’s Changing Looks!\n\nAfter an early clash, Mel Gibson was ‘easy to work with’\n\nThe former exec worked closely with the then-novice director Mel Gibson on his breakout film Braveheart and got to experience a different side of the actor. After budget negotiations for the epic film got heated, Lansing says she admired the way Gibson was passionate about his work.\n\n“We had this whole budget fight and at the end of the day I said to him, ‘I’m sure you have a dartboard where you have a picture of me,’ and he said, ‘No, you were doing your job and I was doing mine,’ ” Lansing tells PEOPLE. “He was so easy to work with and so passionate. He’s tireless in his hard work and he’s one of the most talented actors and one of the most brilliant directors in the business.”\n\nImage zoom Crown Archetype\n\nRobert Redford sure can deliver a pickup line\n\nLansing has been on hand to witness filming on some of the greatest movies ever made, like Gibson’s epic war scenes in Braveheart and James Cameron‘s perfect recreation of the doomed Titanic ship. But the moments that stand out to her as the best are much smaller.\n\nThe former producer reveals one of the best moments on set for her was when Robert Redford perfectly delivered the pivotal question in Indecent Proposal. “I remember thinking that the movie would succeed or fail on whether or not he could pull that line off,” Lansing tells PEOPLE. “I was sitting in a corner near the camera, watching the first take, when Redford just threw the line away like he was asking someone for a cup of water. And I went, ‘Oh my God, that’s so brilliant, that’s genius.’ That moment when you see something come to life is so incredible.”\n\nLeading Lady: Sherry Lansing and the Making of a Hollywood Groundbreaker, written by Stephen Galloway, is out now. Lansing will reveal more behind-the-scenes secrets on Friday, April 28 when she sits down with Galloway and Michael Douglas for a talk at the 92nd Street Y theater in New York City.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20147'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fsherry-lansing1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fsherry-lansing-book-1.jpeg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fangelina_jolie4-5-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg", "keywords": [], "authors": ["Ale Russian"], "canonical_link": "https://people.com/movies/sherry-lansing-shares-on-set-secrets-angelina-jolie-tom-cruise-mel-gibson/", "title": "Angelina Jolie, Tom Cruise and Mel Gibson: Sherry Lansing Shares Secrets", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Angelina Jolie,Exclusive,Glenn Close,Mel Gibson,Michael Douglas,Movie Celebrities,Robert Redford,Tom Cruise.", "news_keywords": "Angelina Jolie,Exclusive,Glenn Close,Mel Gibson,Michael Douglas,Movie Celebrities,Robert Redford,Tom Cruise.", "description": "Not many people get to know celebrities beyond their public persona -- but Sherry Lansing has worked with the best", "og": {"title": "Angelina Jolie, Tom Cruise and Mel Gibson: Sherry Lansing Shares Secrets", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/sherry-lansing-shares-on-set-secrets-angelina-jolie-tom-cruise-mel-gibson/", "description": "Not many people get to know celebrities beyond their public persona — but Sherry Lansing has worked with the best. The former Paramount Studios CEO,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/sherry-lansing-shares-on-set-secrets-angelina-jolie-tom-cruise-mel-gibson/", "description": "Not many people get to know celebrities beyond their public persona -- but Sherry Lansing has worked with the best", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/sherry-lansing-shares-on-set-secrets-angelina-jolie-tom-cruise-mel-gibson/", "title": "Angelina Jolie, Tom Cruise and Mel Gibson: Sherry Lansing Shares Secrets", "description": "Not many people get to know celebrities beyond their public persona -- but Sherry Lansing has worked with the best", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Ftom-cruise-sherry-lansing.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}