{"url": "https://www.inquisitr.com/4487009/teen-mom-og-star-farrah-abraham-explains-why-she-cant-end-amber-portwood-feud/", "text": "It looks like the Teen Mom OG drama will continue, as Farrah Abraham has come out to say she will not be ending her feud with costar Amber Portwood anytime soon. The frenemies have made this a storyline for a while now, so why would she end it? Besides that, it looks like Farrah Abraham has other reasons to not end the Amber Portwood fight.\n\nIt looks like E! News had a chance to talk with Farrah Abraham, as she was attending New York Fashion Week. Even though Amber Portwood recently revealed that she would be interested in being friends with Farrah again, we do not see a rekindling of their friendship happening, as Abraham confirmed this with E! News.\n\n“I would want to bury that hatchet, too, but I’m never wrong. I’m a great friend; I’m a stand-up individual and in the same sentence she wants to be friends with me, she always says I’m crazy.”\n\nSo, why is she not ending the feud? From that statement, it seems like Farrah Abraham believes she is never wrong. Well, that is definitely not going to mend any fences for either of them. Farrah is referring to Portwood’s appearance on E!’s Daily Pop last month, where Amber described Farrah as crazy.\n\n“We used to be friends, but I don’t know what happened. I think she did things for publicity. I still love her to death. She knows that.”\n\nAmber also mentioned wanting to rekindle their friendship and that she is “ready to let everything go.” Amber may be ready, but it looks like Farrah is not on the same page.\n\n“She’s the only one who is diagnosed with a split personality disorder amongst other things, which is not a joke. It’s very serious.”\n\nWhile it appears that Amber is ready to move on and make nice, Farrah is not. So, if Amber reached out and called Farrah to reconcile, would it happen? Not according to Abraham.\n\n“I believe she’s blocked. I just am on a whole other level of my life and I’m focused on my daughter and not on her.”\n\nSpeaking of her daughter, it looks like Sophia is calling all the shots in their lives. Farrah has reached out to her own mother, Debra Danielson, to try and mend those fences, especially with Debra’s upcoming wedding. It looks like Sophia does not approve of it, so they won’t be attending?\n\n“With my mom’s wedding right now it’s made Sophia not want to be around her. I’m kind of stuck in the middle trying to have everyone get along. Sophie is not approving of it but I am happy for her and supportive. I hope she has an amazing wedding and we send her our best wishes. We are taking her to Italy next week so we just try to keep it cordial.”\n\n#nyfw @nolchashows #NewYork A post shared by Farrah Abraham (@farrah__abraham) on Sep 8, 2017 at 4:16pm PDT\n\nThe craziness that is Teen Mom OG and Farrah Abraham continues, but it won’t continue with Amber Portwood as her friend. While she does not want to be friends, she does not wish any ill feelings on Amber. In fact, she is happy with Amber and some of the recent decisions she has made in her life.\n\n“I wish she would take other people in her circle more seriously so that she could be the happiest Amber. I think producers and production play off of that so I would just strive to keep people around who are there for you. I’m happy she’s not dating Matt Baier anymore. I told her years ago to ditch him and I’m happy to finally have found out.”\n\nDo you think Farrah Abraham and Amber Portwood will ever be friends again on Teen Mom OG?\n\n[Featured Image by Tommaso Boddi/Getty Images]", "images": ["https://secure.gravatar.com/avatar/12b68087c5cb7871876399934d5c96e2?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Teen-Mom-OG-Farrah-Abraham-Not-ending-feud-with-Amber-Portwood.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Todd Betzold"], "canonical_link": "https://www.inquisitr.com/4487009/teen-mom-og-star-farrah-abraham-explains-why-she-cant-end-amber-portwood-feud/", "title": "‘Teen Mom OG’ Star Farrah Abraham Explains Why She Can’t End Amber Portwood Feud", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}