{"url": "https://www.bustle.com/p/why-are-thor-the-hulk-fighting-in-the-thor-ragnarok-trailer-the-first-look-is-so-exciting-50110", "text": "Have you ever had an unexpected run in with an old co-worker? In the latest trailer for Marvel's Thor: Ragnarok, Thor finds himself fighting the Hulk in a massive battle arena. The gladiator-esque face off is not exactly a warm reunion between two former Avengers, and it creates a lot of questions. At first Thor seems relieved to run into a familiar face, even if that face is enormous, angry, and green. For a small moment it appears the superhero might be in the clear, but that would be too simple, and the Hulk doesn't seem to recognize his old pal. Instead, the Hulk charges full throttle toward Thor, and right before the two meet in the air the trailer cuts to black.\n\nSo, what's going on here? It's clear that something fishy is afoot, or the Hulk wouldn't be trying to clobber a superhero he used to fight evil with. It might have a lot to do with the Grandmaster, a decadently dressed yet rather sinister new villain played by Jeff Goldblum. The Grandmaster seems to be orchestrating this whole fight, and can be seen looking on in disapproval from a skybox above the arena. The big mystery is how the character got the Hulk to turn on a friend. \"Oh, come on,\" Thor says in frustration as the Hulk growls at his friendly approach, and as viewers, we can relate.\n\nMarvel Entertainment on YouTube\n\nOf course, the face off between Thor and the Hulk isn't the only excitement in the new trailer. This is the big reveal of Cate Blanchett's Hela, the Asgardian goddess of death, a character expected to challenge the series' protagonist in a major way. \"She plays the worst of the worst. So evil,\" Mark Ruffalo, who plays the Hulk, described Blanchett's character in an interview with ET Online. \"She is going to kill us. It's such a great part she gets to play.\"\n\nEven without Blanchett's Oscar-winning acting, the film is packed with stars. Tom Hiddleston reprises his role as Loki, who can only be back once more to try and defeat Thor. It also appears Benedict Cumberbatch will make a high-profile appearance as Doctor Strange, and Tessa Thompson (Creed, Westworld) will play the Asgardian superhero Valkyrie. Anthony Hopkins will once again appear as Odin, and Idris Elba returns as Heimdall. On the performance front, this is not the Marvel movie to miss.\n\nLet's just hope that the Hulk recognizes Thor at some point, because it looks like the hero might be in a bit of trouble. It's going to take a lot to defeat Blanchett's Hela, who was a scary enough villain before they introduced that hat with the evil mutant deer horns and thorn studded sword in this trailer. That's not to mention the evil work of Loki and the Grandmaster, who are just two more obstacles in the way of saving Asgard.\n\nThe film hits theaters on November 3, 2017, and director Taika Waititi has promised in interviews that even for a superhero movie, it will be truly strange and \"out there\". This first look trailer definitely supports that claim, but let's just hope we get a few more answers before the movie premieres in the fall.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/12/a050599c-0f91-449c-a680-e88ed10034ae-getty-1202992300.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/2017/4/10/505d8d86-41ca-4900-8891-dcca55c740ab.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/2017/4/10/505d8d86-41ca-4900-8891-dcca55c740ab.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/3/99943db3-98ad-4042-b38f-ae81222aa490-4760f1ee6d7382e3cb38e88f2f0e730f22ed4a2be805d0f20e1dcfac5e38ac5703ead59ce6e6f4f1f2c0b00b5c40d34d.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/c046b701-5293-4a48-9511-754066590440-screenshot-588.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/14a8d2bf-6a64-40cc-a104-034fe33752a4-getty-1188778598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/2017/4/10/505d8d86-41ca-4900-8891-dcca55c740ab.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/why-are-thor-the-hulk-fighting-in-the-thor-ragnarok-trailer-the-first-look-is-so-exciting-50110", "title": "Why Are Thor & The Hulk Fighting In the 'Thor: Ragnarok' Trailer? The First Look Is So Exciting", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/why-are-thor-the-hulk-fighting-in-the-thor-ragnarok-trailer-the-first-look-is-so-exciting-50110", "type": "article", "title": "Thor & The Hulk Reunite In The 'Thor: Ragnarok' Trailer", "description": "Have you ever had an unexpected run in with an old co-worker? In the latest trailer for Marvel's Thor: Ragnarok, Thor finds himself fighting the Hulk in a massive battle arena. The gladiator-esque face off is not exactly a warm reunion between two…", "image": {"identifier": "https://imgix.bustle.com/2017/4/10/505d8d86-41ca-4900-8891-dcca55c740ab.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Have you ever had an unexpected run in with an old co-worker? In the latest trailer for Marvel's Thor: Ragnarok, Thor finds himself fighting the Hulk in a massive battle arena. The gladiator-esque face off is not exactly a warm reunion between two…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}