{"url": "https://web.archive.org/web/20090624230658/http://www.whitehouse.gov/blog/Protecting-Our-Children-from-the-Dangers-of-Smoking/", "text": "Protecting Our Children from the Dangers of Smoking\n\nViewing this video requires Adobe Flash Player 8 or higher. Download the free player.\n\n\n\ndownload .mp4 (159.8 MB) | read the transcript\n\n\n\nThe President expressed his appreciation for Senator Ted Kennedy above all today. Lamenting that the senator could not be there for the signing of Family Smoking Prevention and Tobacco Control Act, he called it \"change that's been decades in the making.\" By all accounts, it is the strongest measure protecting children from the dangers of smoking to date -- read the fact sheet for all of the details.\n\nHe recounted the all-too-familiar statistics: that more than 400,000 Americans now die of tobacco-related illnesses each year; that more than 8 million Americans suffer from at least one serious illness caused by smoking; and that almost 90% of all smokers began at or before their 18th birthday.\n\nHe spoke on his personal experience:\n\nI know -- I was one of these teenagers, and so I know how difficult it can be to break this habit when it's been with you for a long time. And I also know that kids today don't just start smoking for no reason. They're aggressively targeted as customers by the tobacco industry. They're exposed to a constant and insidious barrage of advertising where they live, where they learn, and where they play. Most insidiously, they are offered products with flavorings that mask the taste of tobacco and make it even more tempting.\n\nWe've known about this for decades, but despite the best efforts and good progress made by so many leaders and advocates with us today, the tobacco industry and its special interest lobbying have generally won the day up on the Hill. When Henry Waxman first brought tobacco CEOs before Congress in 1994, they famously denied that tobacco was deadly, nicotine was addictive, or that their companies marketed to children. And they spent millions upon millions in lobbying and advertising to fight back every attempt to expose these denials as lies.\n\nFifteen years later, their campaign has finally failed. Today, thanks to the work of Democrats and Republicans, health care and consumer advocates, the decades-long effort to protect our children from the harmful effects of tobacco has emerged victorious. Today, change has come to Washington.\n\nThis legislation will not ban all tobacco products, and it will allow adults to make their own choices. But it will also ban tobacco advertising within a thousand feet of schools and playgrounds. It will curb the ability of tobacco companies to market products to our children by using appealing flavors. It will force these companies to more clearly and publicly acknowledge the harmful and deadly effects of the products they sell. And it will allow the scientists at the FDA to take other common-sense steps to reduce the harmful effects of smoking.\n\nThis legislation is a victory for bipartisanship, and it was passed overwhelmingly in both Houses of Congress. It's a victory for health care reform, as it will reduce some of the billions we spend on tobacco-related health care costs in this country. It's a law that will reduce the number of American children who pick up a cigarette and become adult smokers. And most importantly, it is a law that will save American lives and make Americans healthier.\n\nMaking clear that this legislation does not represent the end of the road on fighting back the health risks of smoking, the President nonetheless described it as another very significant sign of change in Washington:\n\nDespite the influence of the credit card industry, we passed a law to protect consumers from unfair rate hikes and abusive fees. Despite the influence of banks and lenders, we passed a law to protect homeowners from mortgage fraud. Despite the influence of the defense industry, we passed a law to protect taxpayers from waste and abuse in defense contracting. And today, despite decades of lobbying and advertising by the tobacco industry, we've passed a law to help protect the next generation of Americans from growing up with a deadly habit that so many of our generation have lived with.", "images": ["https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/images/get_connected_01.jpg", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/images/eop/sftr-whgov.gif", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/images/eop/clear.gif", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/images/plus.gif", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/tout/fy-2010-budget.jpg", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/images/home_touts_03.jpg", "https://web.archive.org/web/20090624230658im_/http://statse.webtrendslive.com/dcs0l9nq800000ctek411lue6_2c8b/njs.gif?dcsuri=/nojavascript&WT.js=No&DCS.dcscfg=1&WT.tv=8.6.0", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/images/eop/hdr-usa-flag.gif", "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/images/eop/icon-rss-gscl.gif"], "top_img": "https://web.archive.org/web/20090624230658im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Protecting Our Children from the Dangers of Smoking", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}