{"url": "https://www.usmagazine.com/celebrity-news/news/bridget-marquardt-talks-holly-madison-kendra-wilkinson-feud-w207059/", "text": "Is she Team Holly or Team Kendra? Turns out, Girls Next Door alum Bridget Marquardt is remaining neutral in the ongoing feud between her former costars Holly Madison and Kendra Wilkinson.\n\nThe one-time Playboy model, 42, spoke out about her fellow blonde bombshells’ beef during an appearance on the Wednesday, May 18, episode of Hollywood Today Live, and told hosts Garcelle Beauvais and Kristen Brockman that she is not picking sides.\n\n“It’s kind of sad. Like I feel like we have a bond, the three of us,” the TV personality began. “It’s kind of like, it’s not like a sisterhood, it’s not like friends, I mean it is friends, but it’s something totally different than any other relationship you could possibly imagine.”\n\n“And so in that sense, it kind of makes me sad, but at the same time, I mean,” she added, “Holly came out with a book and she gave her experience.”\n\nWhile she looks at the fight between Hugh Hefner’s exes from a diplomatic perspective, she didn’t sugarcoat her feelings when telling Wilkinson, 30, she didn’t agree with the mom of two’s expletive-filled Twitter tirade against Madison, 36, on May 12.\n\n“This is what I told Kendra, ‘She’s writing about her experience and this is how she’s reflecting on it and she has a right to do that,’” Marquardt continued. “’And you have a right not to agree with her, but lashing out like this and saying such vile things and stuff isn’t really the way to handle it either.'”\n\nAs Us Weekly previously reported, Wilkinson ripped into Madison after taking issue with comments the Vegas Diaries author made in a recent interview, in which she spoke candidly about her time living in the Playboy Mansion with Hefner, 90, and his harem of girlfriends.\n\n“Now Holly is on cover of People mag sayin she lived in fear at the mansion. She wasn’t in fear with that d–k in her ass for a paycheck,” Wilkinson wrote in her now-deleted posts. “That bitch is in fear now knowing so many of us saw her doing some nasty s–t. She’s embarrassed and in shame. She was the clean up girl … Hollys job was to get Hef hard again and clean him up with her mouth.”\n\nWilkinson and Madison rose to fame together as stars of E!’s Girls Next Door in the mid-aughts; the series ran for six seasons from 2005 until 2009. In 2015, Madison released her first memoir, Down the Rabbit Hole: Curious Adventures and Cautionary Tales of a Former Playboy Bunny, which became the catalyst for the conflict between herself and Wilkinson.\n\nAlthough Wilkinson memorably lashed out at Madison for the claims she made in the tome (which included stories about Hef allegedly giving Madison Quaaludes and verbally attacking her, among others), Marquardt revealed that Wilkinson hasn’t even read the book.\n\n“But I’m not sure, she must be referring to the first book that Holly wrote, not the one that’s coming out right now,” she said during her chat on Hollywood Today Live. “But Kendra hasn’t read the book. I asked her, she hasn’t read it.”\n\nAs fans will recall, Wilkinson and Marquardt had a heart-to-heart over the aftermath of leaving the Playboy Mansion on the May 6 episode of Kendra on Top.\n\n“You know, I did have—as we all did, probably, a hard time transitioning into like a world outside the mansion,” Wilkinson told her. When the WE tv star left the Playboy Mansion in 2009 to marry her husband, Hank Baskett, she slammed Marquardt in the press, saying they were never friends, which she admitted to regretting. “When I was saying those things, it was more about like, trying to distance myself from the mansion as much as I could, which was the wrong thing to do,” she shared with Marquardt.\n\nMarquardt, who is engaged to her beau of seven years, Nick Carpenter, told Hollywood Today Live that she felt Wilkinson’s apology was the real deal.\n\n“I do feel it was sincere and I do think there’s a long way to go,” she noted. “There’s been a long track record of things, you know, so I think that that’s definitely a step in the right direction, and we both feel really good about it. But it doesn’t mean that we’re BFFs or anything right now.”\n\nWatch the video above.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/bridget-marquardt-promos-e371fcd1-6c9d-4c64-b1ce-82d1fdb8b879.jpg?crop=146px%2C30px%2C1331px%2C699px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/bridget-marquardt-inline-206b936e-c8bc-4a52-b065-c538d36f699f.jpg", "https://www.usmagazine.com/wp-content/uploads/bridget-marquardt-holly-madison-kendra-wilkinson-hugh-hefner-87e77469-ada3-4a9d-b48a-5241a28e22eb.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/bridget-marquardt-promos-e371fcd1-6c9d-4c64-b1ce-82d1fdb8b879.jpg?crop=146px%2C30px%2C1331px%2C699px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/bridget-marquardt-talks-holly-madison-kendra-wilkinson-feud-w207059/", "title": "Bridget Marquardt Talks Holly Madison, Kendra Wilkinson Feud", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "‘Girls Next Door’ alum Bridget Marquardt weighed in on Holly Madison and Kendra Wilkinson’s ongoing feud on Wednesday, May 18 — see what she said", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Bridget Marquardt: My Take on Holly and Kendra’s Feud", "description": "‘Girls Next Door’ alum Bridget Marquardt weighed in on Holly Madison and Kendra Wilkinson’s ongoing feud on Wednesday, May 18 — see what she said", "url": "https://www.usmagazine.com/celebrity-news/news/bridget-marquardt-talks-holly-madison-kendra-wilkinson-feud-w207059/", "site_name": "Us Weekly", "updated_time": "2018-02-09T00:28:09+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/bridget-marquardt-promos-e371fcd1-6c9d-4c64-b1ce-82d1fdb8b879.jpg?crop=146px%2C30px%2C1331px%2C699px&resize=1200%2C630&ssl=1", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/bridget-marquardt-promos-e371fcd1-6c9d-4c64-b1ce-82d1fdb8b879.jpg?crop=146px%2C30px%2C1331px%2C699px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "section": "Celebrity News", "published_time": "2016-05-19T15:14:00+00:00", "modified_time": "2018-02-09T00:28:09+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "‘Girls Next Door’ alum Bridget Marquardt weighed in on Holly Madison and Kendra Wilkinson’s ongoing feud on Wednesday, May 18 — see what she said", "title": "Bridget Marquardt: My Take on Holly and Kendra’s Feud", "site": "@usweekly", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/bridget-marquardt-promos-e371fcd1-6c9d-4c64-b1ce-82d1fdb8b879.jpg?crop=146px%2C30px%2C1331px%2C699px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1463670840.0, "source": "https://www.usmagazine.com", "summary": ""}