{"url": "www.cheatsheet.com/entertainment/5-tom-cruise-dating-rumors-you-should-stop-believing-now.html/", "text": "Tom Cruise | Angela Weiss/Getty Images Tom Cruise | Angela Weiss/Getty Images\n\nThere have been a number of rumors over the years about Tom Cruise’s love life. The Mission Impossible star has kept sort of a low profile with his relationships after splitting from his ex-wife, Katie Holmes, in 2012. Therefore, because he isn’t jumping on couches and declaring his love for anyone, some tabloids have decided to make up stories about him being romantically involved with other Hollywood A-listers.\n\nNow, it’s time to separate fact from fiction and bust those rumors about who Cruise has dated.\n\nAngelina Jolie\n\nIn March 2017, the National Enquirer published a bogus report that the actor was dating Angelina Jolie.\n\nThe publication claimed that the two stars met to talk about the film they were working on together, however, we know that they never did a movie together so that part isn’t true. The outlet went on to claim that Jolie was enjoying making her ex, Brad Pitt, jealous about the romance. But Gossip Cop reported that there’s no truth to that, which makes sense since Jolie told People that dating is the furthest thing from her mind and something she doesn’t plan on doing for a long time.\n\nJane Fonda\n\nAfter appearing together at Comic-Con in Las Vegas in spring 2018 to promote their movies, the site New Idea falsely reported that Cruise was seeing Jane Fonda.\n\nThe Book Club star ended up debunking this rumor herself during an interview with Extra when she said, “I’m not dating anymore, but I did up until a couple of years ago … I’ve closed up shop down there!”\n\nVanessa Kirby\n\nThere were wild reports, which surfaced in October 2017, that The Crown actress Vanessa Kirby was marrying, yes marrying, her Mission Impossible — Fallout co-star.\n\nThe story was published by not one, but two tabloids and totally caught Kirby by surprise. “The most disconcerting thing was the people I didn’t think would believe it did, and they were texting my boyfriend, asking, ‘Are you OK?'” she told Marie Claire. “I don’t think they believe anything they read now because you just can’t. None of it is real. To be getting married to him? Not even a snog—it was marriage.”\n\nElisabeth Moss\n\nIn November 2017, another article from the National Enquirer was debunked after it claimed that Cruise was romancing Elisabeth Moss. There was no evidence whatsoever to support this story and it may only have come out because the two Scientologists were both single at the time.\n\nMoss though made it clear that to Marie Claire that the report was false and said she has “no time for dating,” adding, “It’s actually a problem. But I’m very focused on my work.”\n\nKatie Holmes\n\nFinally, in November 2016, the website called Headlines & Global News did a story that Cruise’s former wife had dumped her beau, Jamie Foxx, to get back together with him.\n\nOf course, time has proven that to be untrue and despite not wanting to talk about their relationship Holmes and Foxx are still going strong. Whenever split rumors do make the rounds, they just leave it to their reps to deny.", "images": ["http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg", "keywords": [], "authors": ["Michelle Kapusta"], "canonical_link": "https://www.cheatsheet.com/entertainment/5-tom-cruise-dating-rumors-you-should-stop-believing-now.html/", "title": "5 Tom Cruise Dating Rumors You Should Stop Believing Now", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/5-tom-cruise-dating-rumors-you-should-stop-believing-now.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "These are a few wild rumors about Tom Cruise's love life that you can stop believing now.", "og": {"locale": "en_US", "type": "article", "title": "5 Tom Cruise Dating Rumors You Should Stop Believing Now", "description": "These are a few wild rumors about Tom Cruise's love life that you can stop believing now.", "url": "https://www.cheatsheet.com/entertainment/5-tom-cruise-dating-rumors-you-should-stop-believing-now.html/", "site_name": "Showbiz Cheat Sheet", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "tom cruise", "section": "Entertainment", "published_time": "2018-07-25T22:53:00-04:00"}, "twitter": {"card": "summary_large_image", "description": "These are a few wild rumors about Tom Cruise's love life that you can stop believing now.", "title": "5 Tom Cruise Dating Rumors You Should Stop Believing Now", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/09/tomcruise-e1532550203466-640x459.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1532573580.0, "source": "http://www.cheatsheet.com", "summary": ""}