{"url": "https://www.inquisitr.com/5195383/scheana-marie-dishes-on-potential-reunion-with-rob-valletta-plus-did-she-and-ariana-madix-have-a-falling-out/", "text": "Scheana Marie hasn’t remained friends with Robert Parks-Valletta since their August 2017 feud but is their hope for a future reconciliation between the former couple?\n\nWhile promoting the new season of Vanderpump Rules, which began airing on Bravo TV on Monday, the longtime reality star and aspiring singer opened up about her thoughts on staying close with exes post-split.\n\n“When it’s done, it’s done. And if in a year or two years they come back into my life and I feel okay… okay. But I can’t be like homies with my ex,” Scheana explained to E! News.\n\nThen, when asked if fans should anticipate a future reunion with Rob, Scheana exclaimed, “Hell no!”\n\nAlso during her interview with E! News, Scheana said fans of Vanderpump Rules should expect to see her undergo a number of changes with her friendships with her co-stars. That said, rumors of a feud with her best friend Ariana Madix are false.\n\n“You’ll see some friendship changes, like positive. Positive! I said that the other day and then it was like, ‘Scheana and Ariana, not friends anymore,’ That’s not what I said. No, I just said there’s changes drastically in the friendships,” she explained.\n\nIn Scheana Marie’s latest two Instagram photos, she was seen with Ariana Madix and a number of other cast members of Vanderpump Rules.\n\nScheana Marie and Robert Parks-Valletta began dating ahead of Vanderpump Rules Season 6 and chronicled their relationship throughout the sixth season. Then, just weeks after the show wrapped production, Rob broke things off with the reality star.\n\nAt the reunion special for Season 6, Scheana broke down about their breakup but told press she was sure that they would ultimately get back together, get married, and start a family.\n\n“We have every intention of getting married one day and having a family, but we just don’t know when that day will be,” she said during an interview with Page Six last December, four months after her and Rob’s breakup. “I’m like, that’s going to be one hell of a story to tell the grandkids, grandma and grandpa couldn’t get it together for 13 years, but now they’ve been married for 50.”\n\nIn the year since her split from Rob, Scheana has been linked to the Bachelorette’s Robby Hayes and her Vanderpump Rules co-star Adam Spott.\n\nTo see more of Scheana Marie and her co-stars, tune into the seventh season of Vanderpump Rules on Monday nights at 9 p.m. on Bravo TV.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/12/Scheana-Marie-Talks-Rob-Valletta-Split.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/34feb98eadd86f8672383a21efe174f9?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Lindsay Cronin"], "canonical_link": "https://www.inquisitr.com/5195383/scheana-marie-dishes-on-potential-reunion-with-rob-valletta-plus-did-she-and-ariana-madix-have-a-falling-out/", "title": "Scheana Marie Dishes On Potential Reunion With Rob Valletta, Plus Did She And Ariana Madix Have A Falling Out?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}