{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/13/emmy-nominations-2017-complete-coverage/", "text": "Netflix’s “Stranger Things” and FX’s “Feud: Bette and Joan” tied for the second-most nominations with 18, while HBO’s “Veep” was close behind with 17.\n\nIn the drama category, the absence of “Game of Thrones” (not eligible for this year’s prize because of the upcoming season’s late start) made room for freshmen series, and five new shows made the cut: HBO’s “Westworld”; Netflix’s “Stranger Things”; Hulu’s “The Handmaid’s Tale”; Netflix’s “The Crown”; and NBC’s “This Is Us.” (Netflix veteran “House of Cards” and AMC’s “Better Call Saul” landed the final two spots.)\n\nAD\n\nAD\n\nOn the comedy side, Emmy voters went with some old favorites, such as ABC’s “Modern Family” and HBO’s “Veep,” both previous winners that have been nominated every year since they were eligible. Rounding out the category was HBO’s “Silicon Valley”; Netflix’s “Unbreakable Kimmy Schmidt”; Netflix’s “Master of None”; ABC’s “Blackish”; and the sole newcomer, FX’s “Atlanta.”\n\nThe Emmy Awards air Sunday, Sept. 17 on CBS, and will be hosted by Stephen Colbert. See below for a list of major nominations and analysis.\n\nNominations by network:\n\nHBO: 111\n\nNetflix: 91\n\nNBC: 64\n\nFX: 54\n\nABC: 34\n\nCBS: 29\n\nFox: 21\n\nHulu: 18\n\nAmazon: 16\n\nNominations for the 69th Primetime Emmy Awards\n\nAD\n\nOutstanding Drama Series\n\n“The Crown” (Netflix)\n\n“The Handmaid’s Tale” (Hulu)\n\n“Westworld” (HBO)\n\n“Stranger Things” (Netflix)\n\n“This Is Us” (NBC)\n\n“Better Call Saul” (AMC)\n\n“House of Cards” (Netflix)\n\nImmediate reaction: We’re not surprised to see “This Is Us” on the list, but NBC’s beloved tearjerker is the first network drama to land a nod for this prestigious category in six years. “The Handmaid’s Tale” was an obvious choice here and it’s the one to watch on Emmy night, though we won’t count out “Westworld” or “The Crown.” “The Leftovers,” despite critical acclaim, failed to clinch a nomination for its final season.\n\nAD\n\nOutstanding Comedy Series\n\n“Blackish” (ABC)\n\n“Atlanta” (FX)\n\n“Veep” (HBO)\n\n“Master of None” (Netflix)\n\n“Silicon Valley” (HBO)\n\n“Unbreakable Kimmy Schmidt” (Netflix)\n\n“Modern Family” (ABC)\n\nImmediate reaction: With a Golden Globe already under its belt, Donald Glover’s critically-acclaimed FX comedy “Atlanta” will be a strong contender against last year’s winner, “Veep.” “Modern Family” clinches its eighth nomination, remaining a voter favorite despite declining ratings (it at one point won five years in a row). It would have been nice to see another new name on the list this year — HBO’s “Insecure,” perhaps, or ABC’s perpetually overlooked “Fresh Off the Boat.”\n\nOutstanding Lead Actress in a Drama Series\n\nClaire Foy, “The Crown” (Netflix)\n\nKeri Russell, “The Americans” (FX)\n\nElisabeth Moss, “The Handmaid’s Tale” (Hulu)\n\nViola Davis, “How to Get Away with Murder” (ABC)\n\nRobin Wright, “House of Cards” (Netflix)\n\nEvan Rachel Wood, “Westworld” (HBO)\n\nImmediate reaction: For the first time since “Homeland” debuted, Claire Danes is off the list — in her place is Claire Foy, who plays a young Queen Elizabeth II in “The Crown.” (Last year’s winner, Tatiana Maslany for “Orphan Black,” was ineligible.) The debut of “The Handmaid’s Tale” and “Westworld” also means nods for Elisabeth Moss and Evan Rachel Wood, respectively — and the odds are good for Moss.\n\nAD\n\nOutstanding Lead Actor in a Drama Series\n\nSterling K. Brown, “This Is Us” (NBC)\n\nMatthew Rhys, “The Americans” (FX)\n\nKevin Spacey, “House of Cards” (Netflix)\n\nLiev Schreiber, “Ray Donovan” (Showtime)\n\nAnthony Hopkins, “Westworld” (HBO)\n\nMilo Ventimiglia, “This Is Us” (NBC)\n\nBob Odenkirk, “Better Call Saul” (AMC)\n\nImmediate reaction: You can bet NBC is breaking out the champagne with all the love for “This Is Us.” While Sterling K. Brown’s nomination was expected, Milo Ventimiglia was the wild card. Otherwise it’s business as usual (Matthew Rhys’s nod makes up for the lack of “The Americans” in the best drama category) with the addition of Anthony Hopkins in “Westworld,” which apparently is the TV Academy’s new favorite show.\n\nAD\n\nOutstanding Lead Actress in a Comedy Series\n\nJulia Louis-Dreyfus, “Veep” (HBO)\n\nTracee Ellis Ross, “Blackish” (ABC)\n\nLily Tomlin, “Grace and Frankie” (Netflix)\n\nJane Fonda, “Grace and Frankie” (Netflix)\n\nEllie Kemper, “Unbreakable Kimmy Schmidt” (Netflix)\n\nAllison Janney, “Mom” (CBS)\n\nPamela Adlon, “Better Things” (FX)\n\nImmediate reaction: Pamela Adlon, the co-creator and star of FX’s “Better Things,” is the biggest surprise here, though we’re not sure she’ll be a match for Julia Louis-Dreyfus, who has taken home the trophy annually since 2012. Or could Tracee Ellis Ross, clinching her second nomination for ABC’s “Blackish,” pull off a surprise win? (She did earn a pretty historic Golden Globe last year.) Jane Fonda finally joins her “Grace and Frankie” co-star Lily Tomlin, a three-time nominee in this category. Allison Janney won best supporting actress in 2014 and 2015 for “Mom,” but this is her first year on the lead actress roster.\n\nOutstanding Lead Actor in a Comedy Series\n\nDonald Glover, “Atlanta” (FX)\n\nAnthony Anderson, “Blackish” (ABC)\n\nJeffrey Tambor, “Transparent” (Amazon)\n\nAziz Ansari, “Master of None” (Netflix)\n\nWilliam H. Macy, “Shameless” (Showtime)\n\nZach Galifianakis, “Baskets” (FX)\n\nImmediate reaction: We’re definitely not surprised to see Donald Glover, star, creator and occasional director of FX’s critical darling “Atlanta” here. But we weren’t expecting the other newcomer, Zach Galifianakis, who co-created his niche FX comedy — about a very sad clown — with Louis C.K. (a five-time nominee in this category). Jeffrey Tambor is the one to beat: The “Transparent” actor has, somewhat controversially, taken home the trophy for the past two years. Glover could definitely claim victory, but don’t overlook any of the others: Aziz Ansari, Anthony Anderson and William H. Macy all landed repeat nominations, so the trophy could really go to anyone.\n\nAD\n\nOutstanding Lead Actress in a Limited Series or a Movie\n\nNicole Kidman, “Big Little Lies” (HBO)\n\nReese Witherspoon, “Big Little Lies” (HBO)\n\nJessica Lange, “Feud: Bette and Joan” (FX)\n\nSusan Sarandon, “Feud: Bette and Joan” (FX)\n\nCarrie Coon, “Fargo” (FX)\n\nFelicity Huffman, “American Crime” (ABC)\n\nImmediate reaction: Four Oscar winners + two acclaimed shows = toughest category of the Emmys? As many assumed, both Jessica Lange and Susan Sarandon will feud for the prize for “Feud,” and Nicole Kidman and Reese Witherspoon will go head to head for the addictive “Big Little Lies.” Even the most seasoned award-show expert will tell you this one is impossible to predict.\n\nAD\n\nOutstanding Lead Actor in a Limited Series or a Movie\n\nRiz Ahmed, “The Night Of” (HBO)\n\nJohn Turturro, “The Night Of” (HBO)\n\nEwan McGregor, “Fargo” (FX)\n\nRobert De Niro, “The Wizard of Lies” (HBO)\n\nBenedict Cumberbatch, “Sherlock: The Lying Detective” (PBS)\n\nGeoffrey Rush, “Genius” (National Geographic)\n\nImmediate reaction: Even though “The Night Of” will be more than a year old by the time the Emmy Awards actually roll around, this seems like the limited series that Emmy voters would most likely adore. And no surprise to see the love for Robert De Niro, a longtime award show favorite, or that the voters fell for the mysterious charms of Benedict Cumberbatch\n\nOutstanding Supporting Actress in a Drama Series\n\nAnn Dowd, “The Handmaid’s Tale” (Hulu)\n\nSamira Wiley, “The Handmaid’s Tale” (Hulu)\n\nUzo Aduba, “Orange is the New Black” (Netflix)\n\nMillie Bobby Brown, “Stranger Things” (Netflix)\n\nThandie Newton, “Westworld” (HBO)\n\nChrissy Metz, “This Is Us” (NBC)\n\nImmediate reaction: Another tough one that could have gone in a bunch of different directions, but as always, Uzo Aduba is a shoo-in — whether OITNB is competing as a comedy or a drama — and there’s no way the adorable Millie Bobby Brown would’ve gone unrecognized. Come awards night, it will likely turn into a showdown between “The Handmaid’s Tale” supporting cast, as critics rave about both Samira Wiley and Ann Dowd.\n\nAD\n\nOutstanding Supporting Actor in a Drama Series\n\nJonathan Banks, “Better Call Saul” (AMC)\n\nJohn Lithgow, “The Crown” (Netflix)\n\nMandy Patinkin, “Homeland” (Showtime)\n\nMichael Kelly, “House Of Cards” (Netflix)\n\nDavid Harbour, “Stranger Things” (Netflix)\n\nRon Cephas Jones, “This Is Us” (NBC)\n\nJeffrey Wright, “Westworld” (HBO)\n\nImmediate reaction: Emmy voters understandably couldn’t resist Ron Cephas Jones’s crushingly sad storyline in “This Is Us.” This category was a wildcard, and Jones joins several new names, including David Harbour, John Lithgow and Jeffrey Wright. And after a couple years off the list, Mandy Patinkin is no doubt thrilled to be back.\n\nAD\n\nOutstanding Supporting Actress in a Comedy Series\n\nVanessa Bayer, “Saturday Night Live” (NBC)\n\nLeslie Jones, “Saturday Night Live” (NBC)\n\nKate McKinnon, “Saturday Night Live” (NBC)\n\nKathryn Hahn, “Transparent” (Amazon)\n\nJudith Light, “Transparent” (Amazon)\n\nAnna Chlumsky, “Veep” (HBO)\n\nImmediate reaction: No shocker to see the women of SNL show up here, though Kate McKinnon (last year’s winner) or Leslie Jones probably has the edge over Vanessa Bayer’s farewell season. One wildcard: Anna Chlumsky’s fifth consecutive nomination on “Veep,” always an Emmy obsession.\n\nOutstanding Supporting Actor in a Comedy Series\n\nLouie Anderson, “Baskets” (FX)\n\nTy Burrell, “Modern Family (ABC)\n\nAlec Baldwin, “Sat urday Night Live” (NBC)\n\nTituss Burgess, “Unbreakable Kimmy Schmidt” (Netflix)\n\nTony Hale, “Veep” (HBO)\n\nMatt Walsh, “Veep” (HBO)\n\nImmediate reaction: It’s an eighth(!) consecutive Emmy nomination for Ty Burrell. As “Modern Family” loses its buzz, why do voters always prefer him over his co-stars? It’s been a few years since Ed O’Neill and Jesse Tyler Ferguson were nominated. We digress. This category is fairly predictable, and let’s just say it would be shocking if Alec Baldwin wasn’t onstage in September accepting a trophy for his portrayal of Trump.\n\nAD\n\nOutstanding Reality-Competition Program\n\n“The Voice” (NBC)\n\n“The Amazing Race” (CBS)\n\n“Top Chef” (Bravo)\n\n“Project Runway” (Lifetime)\n\n“RuPaul’s Drag Race” (Logo)\n\n“American Ninja Warrior” (NBC)\n\nImmediate reaction: RuPaul’s beloved reality competition gets its first nod in the category alongside the shows that have all been here before, including perennial favorites “The Amazing Race,” “Top Chef” and “The Voice,” which has won the last two years in a row. As reality-TV expert Andy Dehnart pointed out before the nominations, over the last decade, only eight(!) shows have been nominated in this category overall. RuPaul’s makes it nine, so it’s refreshing to have any new names on the list.\n\nAD\n\nOutstanding Variety Talk Series\n\n“Late Show with Stephen Colbert” (CBS)\n\n“Last Week Tonight with John Oliver” (HBO)\n\n“Jimmy Kimmel Live” (ABC)\n\n“Full Frontal with Samantha Bee” (TBS)\n\n“Late Late Show with James Corden” (CBS)\n\n“Real Time with Bill Maher” (HBO)\n\nImmediate reaction: Sorry, Jimmy Fallon — we’re not saying that ruffling Donald Trump’s hair is the reason you didn’t make it in this year, but that move angered a lot critics. Taking his place is Stephen Colbert, the host who was snubbed last year after a rocky start on “The Late Show,” but is having the time of his life in 2017 covering the political chaos.\n\nOutstanding Limited Series\n\n“The Night Of” (HBO)\n\n“Big Little Lies” (HBO)\n\n“Fargo” (FX)\n\n“Feud: Bette and Joan” (FX)\n\n“Genius” (National Geographic)\n\nImmediate reaction: This showdown will be a feud — get it ?! — between “Big Little Lies” and, well, “Feud.” If the two acclaimed series split the vote, “The Night Of” could sneak in. Otherwise, this category played out as expected, and it’s a nice win for National Geographic’s “Genius,” the network’s Albert Einstein biopic and first scripted drama series.\n\nAD\n\nOutstanding TV Movie\n\n“Black Mirror” (Netflix)\n\n“Dolly Part on’s Christ mas Of M any Colors: Circle Of Love” (NBC)\n\n“Immortal Life of Henrietta Lacks” (HBO)\n\n“Sherlock: The Lying Detective” (PBS)\n\n“The Wizard of Lies” (HBO)\n\nImmediate reaction: “Wait, ‘Black Mirror’ isn’t a movie,” you might say. “Just a really creepy TV show!” You are correct — but the critically beloved episode “San Junipero” (a love story between characters played by Mackenzie Davis and Gugu Mbatha-Raw) was submitted as a TV movie, and deemed eligible. It has a shot, though it faces tough competition from HBO, which traditionally does quite well in this category.\n\nAD\n\nOutstanding Supporting Actress in a Limited Series or a Movie\n\nRegina King, “American Crime” (ABC)\n\nLaura Dern, “Big Little Lies” (HBO)\n\nShailene Woodley, “Big Little Lies” (HBO)\n\nJudy Davis, “Feud: Bette and Joan” (FX)\n\nJackie Hoffman, “Feud: Bette and Joan” (FX)\n\nMichelle Pfeiffer, “The Wizard of Lies” (HBO)\n\nOutstanding Supporting Actor in a Limited Series or a Movie\n\nAlexander Skarsgard, “Big Little Lies” (HBO)\n\nDavid Thewlis, “Fargo” (FX)\n\nAlfred Molina, “Feud: Bette and Joan” (FX)\n\nStanley Tucci, “Feud: Bette and Joan” (FX)\n\nBill Camp, “The Night Of” (HBO)\n\nMichael Kenneth Williams, “The Night Of” (HBO)\n\nAD\n\nOutstanding Variety Sketch Series\n\n“Billy on the Street” (truTV)\n\n“Documentary Now!” (IFC)\n\n“Drunk History” (Comedy Central)\n\n“Portlandia” (IFC)\n\n“Saturday Night Live” (NBC)\n\n“Tracey Ullman’s Show” (HBO)\n\nOutstanding Guest Actress in a Comedy Series\n\nWanda Sykes, “Blackish” (ABC)\n\nCarrie Fisher, “Catastophe” (Amazon)\n\nBecky Ann Baker, “Girls” (HBO)\n\nAngela Bassett, “Master Of None” (Netflix)\n\nKristen Wiig, “Saturday Night Live” (NBC)\n\nMelissa McCarthy, “Saturday Night Live” (NBC)\n\nAD\n\nOutstanding Guest Actor in a Comedy\n\nRiz Ahmed, “Girls” (HBO)\n\nMatthew Rhys, “Girls” (HBO)\n\nDave Chappelle, “Saturday Night Live” (NBC)\n\nLin-Manuel Miranda, “Saturday Night Live” (NBC)\n\nTom Hanks, “Saturday Night Live” (NBC)\n\nHugh Laurie, “Veep” (HBO)\n\nOutstanding Guest Actress in a Drama Series\n\nAlison Wright, “The Americans” (FX)\n\nAlexis Bledel, “The Handmaid’s Tale” (Hulu)\n\nCicely Tyson, “How to Get Away with Murder” (ABC)\n\nAnn Dowd, “The Leftovers” (HBO)\n\nLaverne Cox, “Orange is the New Black” (Netflix)\n\nShannon Purser, Stranger Things” (Netflix)\n\nOutstanding Guest Actor in a Drama Series\n\nBen Mendelsohn, “Bloodline” (Netflix)\n\nBD Wong, “Mr. Robot” (USA)\n\nHank Azaria, “Ray Donovan” (Showtime)\n\nDenis O’Hare, “This Is Us” (NBC)\n\nBrian Tyree Henry, “This Is Us” (NBC)\n\nGerald McRaney, “This Is Us” (NBC)\n\nOutstanding Host for a Reality or Reality-Competition Program\n\nMartha Stewart and Snoop Dogg, “Martha & Snoop’s Potluck Dinner Party” (VH1)\n\nGordon Ramsay, “Masterchef Junior” (Fox)\n\nAlec Baldwin, “Match Game” (ABC)\n\nHeidi Klum and Tim Gunn, “Project Runway” (Lifetime)\n\nRuPaul Charles, “RuPaul’s Drag Race” (Logo)\n\nW. Kamau Bell, “United Shades of America” (CNN)\n\nOutstanding Structured Reality Program\n\n“Antiques Roadshow” (PBS)\n\n“Diners, Drive-Ins and Dives” (Food Network)\n\n“Fixer Upper” (HGTV)\n\n“Lip Sync Battle” (Spike TV)\n\n“Shark Tank” (ABC)\n\n“Who Do You Think You Are?” (TLC)\n\nOutstanding Unstructured Reality Program\n\n“Born This Way” (A&E)\n\n“Deadliest Catch” (Discovery Channel)\n\n“Gaycation With Ellen Page” (Viceland)\n\n“Intervention” (A&E)\n\n“RuPaul’s Drag Race: Untucked” (YouTube)\n\n“United Shades Of America With W. Kamau Bell” (CNN)\n\nOutstanding Variety Special\n\n“Carpool Karaoke Primetime Special 2017” (CBS)\n\n“Full Frontal With Samantha Bee Presents Not The White House Correspondents’ Dinner” (TBS)\n\n“Louis C.K. 2017” (Netflix)\n\n“Sarah Silverman: A Speck Of Dust” (Netflix)\n\n“Stephen Colbert’s Live Election Night Democracy’s Series Finale: Who’s Going To Clean Up This Sh*t?” (Showtime)\n\nOutstanding Special Class Program\n\n“Hairspray Live!” (NBC)\n\n“The Oscars” (ABC)\n\n“Super Bowl LI Halftime Show Starring Lady Gaga” (FOX)\n\n“70th Annual Tony Awards” (CBS)\n\nOutstanding Documentary or Nonfiction Special\n\n“Amanda Knox” (Netflix)\n\n“The Beatles: Eight Days A Week – The Touring Years” (Hulu)\n\n“A House Divided (Vice Special Report)” (HBO)\n\n“L.A. Burning: The Riots 25 Years Later (A&E)\n\n“13th” (Netflix)\n\nOutstanding Documentary Or Nonfiction Series\n\n“American Masters” (PBS)\n\n“Chef’s Table” (Netflix)\n\n“The Keepers” (Netflix)\n\n“Planet Earth II” (BBC America)\n\n“30 For 30” (ESPN)\n\nOutstanding Informational Series Or Special\n\n“Anthony Bourdain Parts Unknown” (CNN)\n\n“Inside The Actors Studio” (Bravo)\n\n“Leah Remini: Scientology And The Aftermath” (A&E)\n\n“StarTalk With Neil deGrasse Tyson” (National Geographic)\n\n“Vice” (HBO)", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHTVCGXPMY7Z3MOGPDHLAXVXUQ.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/Md-HQLvop9oL0ODieBmm4KEbrcg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHTVCGXPMY7Z3MOGPDHLAXVXUQ.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/0c7bb0a5-9c44-4e37-9289-56b1a4db67c7.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/Md-HQLvop9oL0ODieBmm4KEbrcg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHTVCGXPMY7Z3MOGPDHLAXVXUQ.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture", "Bethonie Butler", "Reporter Covering Television", "Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/13/emmy-nominations-2017-complete-coverage/", "title": "‘Saturday Night Live’ and ‘Westworld’ lead Emmy nominations with 22 nods", "meta_data": {"description": "Complete list and analysis of the of 69th annual Emmy nominations.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/13/emmy-nominations-2017-complete-coverage/", "image": "https://www.washingtonpost.com/resizer/Md-HQLvop9oL0ODieBmm4KEbrcg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHTVCGXPMY7Z3MOGPDHLAXVXUQ.jpg", "title": "‘Saturday Night Live’ and ‘Westworld’ lead Emmy nominations with 22 nods", "description": "Complete list and analysis of the of 69th annual Emmy nominations."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘Saturday Night Live’ and ‘Westworld’ lead Emmy nominations with 22 nods", "description": "Complete list and analysis of the of 69th annual Emmy nominations."}, "last_updated_date": "2019-04-21T21:30:11.683Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1499875200.0, "source": "https://www.washingtonpost.com", "summary": ""}