{"url": "https://en.wikipedia.org/wiki/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten", "text": "The wedding of Princess Elizabeth, elder daughter and heir presumptive of King George VI, and Philip Mountbatten, a former Greek prince, took place on 20 November 1947 at Westminster Abbey in London. Philip had been made Duke of Edinburgh on the morning of the wedding.\n\nEngagement [ edit ]\n\nElizabeth and Philip are second cousins once removed (by descent from Christian IX of Denmark and Louise of Hesse-Kassel) and third cousins (by descent from Queen Victoria and Prince Albert). Princess Elizabeth met Prince Philip of Greece and Denmark in 1934, at the wedding of Philip's cousin Princess Marina of Greece and Denmark to Prince George, Duke of Kent, paternal uncle of Elizabeth, and again in 1937.[1] After another meeting at the Royal Naval College in Dartmouth in July 1939, Elizabeth—though only 13 years old—fell in love with Philip and they began to exchange letters.[2] An entry in Chips Channon's diary made reference to the future marriage of Elizabeth and Philip as early as 1941, \"He is to be our Prince Consort, and that is why he is serving in our Navy.\"[3] The couple became secretly engaged in 1946, when Philip asked King George VI for his daughter's hand in marriage. The King granted his request providing any formal engagement was delayed until Elizabeth's 21st birthday the following April.[4] Their engagement was officially announced on 9 July 1947.[5] Philip proposed to Elizabeth with a 3-carat round diamond ring consisting of \"a centre stone flanked by 10 smaller pave diamonds.\"[6] The diamonds were taken from a tiara that belonged to Philip's mother, Princess Alice of Battenberg, and were also used to create a quatrefoil bracelet for Elizabeth.[7]\n\nThe King gave his formal consent to the marriage in his British Privy Council, in accordance with the Royal Marriages Act 1772. The same was done in Canada at a meeting of the King's Canadian Privy Council, with the Chief Justice of Canada, Thibaudeau Rinfret, standing in as deputy to the King's representative, the Governor General of Canada.[n 1][8]\n\nWedding [ edit ]\n\nVenue [ edit ]\n\nPrincess Elizabeth and the Duke of Edinburgh married at 11:30 GMT on 20 November 1947 at Westminster Abbey.[9] Princess Elizabeth became the tenth member of the Royal Family to be married at the Abbey.[10]\n\nBridal party [ edit ]\n\nPrincess Elizabeth was attended by eight bridesmaids: The Princess Margaret (her younger sister), Princess Alexandra of Kent (her first cousin), Lady Caroline Montagu-Douglas-Scott (daughter of the Duke of Buccleuch), Lady Mary Cambridge (her second cousin), Lady Elizabeth Lambart (daughter of the Earl of Cavan), Lady Pamela Mountbatten (Philip's first cousin), Margaret Elphinstone (her first cousin), and Diana Bowes-Lyon (her first cousin).[9] Her cousins Prince William of Gloucester and Prince Michael of Kent served as page boys.[9] The bridesmaids wore wreaths \"in their hair of miniature white sheaves, Lilies and London Pride, modelled in white satin and silver lame\", while the pages wore Royal Stewart tartan kilts.[11]\n\nThe best man was the Marquess of Milford Haven,[10] the groom's maternal first cousin. The Marquess was a grandson of Prince Louis of Battenberg and Princess Victoria of Hesse and by Rhine; and a great-great-grandson of Queen Victoria.\n\nWedding attire [ edit ]\n\nFor her wedding dress, Elizabeth still required ration coupons to buy the material for her gown, designed by Norman Hartnell.[12][13] The dress was \"a duchesse satin bridal gown with motifs of star lilies and orange blossoms.\"[13] Elizabeth's wedding shoes were made out of satin and were trimmed with silver and seed pearl.[11] Elizabeth did her own makeup for the wedding.[14] Her wedding bouquet was prepared by the florist M. H. Longman, and consisted of \"white orchids with a sprig of myrtle\". The myrtle was taken from \"the bush grown from the original myrtle in Queen Victoria's wedding bouquet\".[11] The bouquet was returned to the abbey the day after the service to be laid on the tomb of the Unknown Warrior, following a tradition started by Elizabeth's mother at her wedding in 1923.[11]\n\nOn the morning of her wedding, as Princess Elizabeth was dressing at Buckingham Palace before leaving for Westminster Abbey, her tiara snapped. The court jeweller, who was standing by in case of emergency, was rushed to his work room by a police escort. Queen Elizabeth reassured her daughter that it would be fixed in time, and it was.[15] Elizabeth's father gave her a pair of pearl necklaces, which had belonged to Queen Anne and Queen Caroline, as a wedding present. On her wedding day, Elizabeth realised that she had left her pearls at St James's Palace. Her private secretary, Jock Colville, was asked to go and retrieve them. He was able to get the pearls to the princess in time for her portrait in the Music Room of Buckingham Palace.[16]\n\nWedding service [ edit ]\n\nThe royal parties were brought in large carriage processions, the first with the Queen and Princess Margaret and later a procession with Queen Mary.[17] Philip left Kensington Palace with his best man, the Marquess of Milford Haven.[17] Princess Elizabeth arrived at the Abbey with her father, the King, in the Irish State Coach.[9]\n\nThe ceremony was officiated by the Archbishop of Canterbury, Geoffrey Fisher, and the Archbishop of York, Cyril Garbett. The ceremony was recorded and broadcast by BBC Radio to 200 million people around the world.[13][18]\n\nWedding ring [ edit ]\n\nLike her mother's, Princess Elizabeth's wedding band was made of Welsh gold.[19][20] The ring was made from a nugget of Welsh gold from the Clogau St David's mine, near Dolgellau;[10] this nugget had been given to the then Lady Elizabeth Bowes-Lyon, and used to make her wedding ring and subsequently the wedding rings of both of her daughters.[21] The same nugget was later used to create the wedding rings of Princess Anne and Lady Diana Spencer.[21]\n\nMusic [ edit ]\n\nWilliam Neil McKie, the Australian organist and Master of the Choristers at the abbey, was the director of music for the wedding, a role he again filled at Elizabeth's coronation in 1953.[22] McKie also wrote a motet for the occasion, \"We wait for thy loving kindness, O God\". Psalm 67, \"God be merciful unto us and bless us\", was sung to a setting by Sir Edward Cuthbert Bairstow. The anthem was \"Blessed be the God and Father of our Lord Jesus Christ\" by Samuel Sebastian Wesley; the hymns were \"Praise, my soul, the king of heaven\", and \"The Lord's my Shepherd\" to the Scottish tune \"Crimond\" attributed to Jessie Seymour Irvine, which was largely unknown in the Church of England at the time. A descant to \"Crimond\" had been taught to Princesses Elizabeth and Margaret by a lady-in-waiting, Lady Margaret Egerton; the music for the descant could not be found two days before the wedding, so the princesses and Lady Margaret sang it to Sir William McKie, who wrote it down in shorthand.[23] The service started with a specially composed fanfare by Arnold Bax and finished with Felix Mendelssohn's \"Wedding March\". The abbey choir was joined by the choirs of the Chapel Royal and St George's Chapel, Windsor.[24]\n\nTitle [ edit ]\n\nBefore the wedding, Philip renounced his Greek and Danish titles as required by the Act of Settlement, 1701, converted from Greek Orthodoxy to Anglicanism and adopted the style \"Lieutenant Philip Mountbatten\", taking the surname of his mother's British family.[25] The day before the wedding, King George bestowed the style \"Royal Highness\" and, on the morning of the wedding, 20 November 1947, he was made the Duke of Edinburgh, Earl of Merioneth, and Baron Greenwich of Greenwich in the County of London.[26] Consequently, being already a Knight of the Garter, between 19 and 20 November 1947 he bore the unusual style His Royal Highness Sir Philip Mountbatten and is so described in the Letters Patent of 20 November 1947.[26]\n\nUpon their marriage, Elizabeth took the title of her husband and became Princess Elizabeth, Duchess of Edinburgh. They departed for their honeymoon at Broadlands in Hampshire, home of Philip's uncle, Earl Mountbatten.[27]\n\nFamily celebrations [ edit ]\n\nAfter the ceremony, Elizabeth and Philip then proceeded to Buckingham Palace, where the couple waved to the crowds from the balcony.\n\nTheir wedding breakfast was held in the Ball-Supper Room of the Palace.[9][10] The menu included Filet de Sole Mountbatten, Perdreau en Casserole, and Bombe Glacee Princess Elizabeth.[10] Music was played by the string band of the Grenadier Guards.[10]\n\nThe official wedding cake was baked by London bakery McVitie & Price.[10][28] A fruitcake made of four tiers, it stood nine feet high,[10] and weighed about 500 lbs.[28] It was made with 80 oranges, 660 eggs, and over three gallons of Navy Rum. As World War II had ended a mere two years earlier and certain things were still subject to rationing,[28] some of the ingredients used to make the cake were shipped to Britain from around the world; this led to the cake being given the nickname \"The 10,000 Mile Cake.[10][28] Decorations included the coats of arms of both the bride's and the groom's families, as well as the bride and groom's individual monograms, and sugar-iced figures depicting regimental and naval badges, as well as the couple's favorite activities.[10] The couple cut the cake with the Duke of Edinburgh's Mountbatten sword, which had been a wedding gift from his father-in-law, the King.[10]\n\nThe couple received over 2,500 wedding presents from around the world and around 10,000 telegrams of congratulations.[9][13] The gifts were put on public display at St James's Palace and made available for public viewing.[10]\n\nThe day after the wedding the wedding bouquet was returned to Westminster Abbey and placed on the Tomb of the Unknown Warrior;[10] this tradition was initiated by the bride's mother, Queen Elizabeth, following her marriage to the bride's father, then the Duke of York. The bouquet was composed of white cattleya, odontoglossum, and cypripedium orchids and a sprig of myrtle from the Osborne Myrtle Bush, which had been planted at Osborne House by Queen Victoria in 1846.[29][30] The flowers in the bouquet were supplied by the Worshipful Company of Gardeners and were arranged by florist MH Longman.[10]\n\nGuests [ edit ]\n\nBride's family [ edit ]\n\nGroom's family [ edit ]\n\nOther royal guests [ edit ]\n\n[31]\n\nAbsentees [ edit ]\n\nBride's family [ edit ]\n\nThe Duke of Windsor, the former king, who was not invited, and his sister, Mary, Princess Royal, who said she was ill (her husband, Henry Lascelles, 6th Earl of Harewood, had died six months before). Ronald Storrs claimed that the Princess Royal did not attend in protest at her brother's exclusion.[32]\n\nGroom's family [ edit ]\n\nSo soon after the end of World War II, it was not acceptable for the Duke of Edinburgh's German relations, including Philip's three surviving sisters, to be invited to the wedding.[33]\n\nHoneymoon [ edit ]\n\nThe couple boarded a train to Hampshire at Waterloo Station, and spent their wedding night at the home of the Duke of Edinburgh's uncle, the Earl Mountbatten of Burma, in Broadlands.[10][13] From there the couple travelled to Birkhall on the Balmoral Estate, where they spent the remainder of their honeymoon.[10][13]\n\nFor her going-away outfit, Elizabeth wore \"a dress and matching coat in mist-blue with mushroom-coloured accessories\" that was designed by Hartnell.[11]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Flag_of_Italy_%281861-1946%29_crowned.svg/23px-Flag_of_Italy_%281861-1946%29_crowned.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Flag_of_Yugoslavia_%281918%E2%80%931941%29.svg/23px-Flag_of_Yugoslavia_%281918%E2%80%931941%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Flag_of_Spain_%281785%E2%80%931873%2C_1875%E2%80%931931%29.svg/23px-Flag_of_Spain_%281785%E2%80%931873%2C_1875%E2%80%931931%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Flag_of_Luxembourg.svg/23px-Flag_of_Luxembourg.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/72/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten%2C_Duke_of_Edinburgh_photo.PNG", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Flag_of_Hanover_1837-1866.svg/23px-Flag_of_Hanover_1837-1866.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Flag_of_Iraq_%281924%E2%80%931959%29.svg/23px-Flag_of_Iraq_%281924%E2%80%931959%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Flagge_Gro%C3%9Fherzogtum_Baden_%281891%E2%80%931918%29.svg/23px-Flagge_Gro%C3%9Fherzogtum_Baden_%281891%E2%80%931918%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Flag_of_the_Duchy_of_Parma.svg/23px-Flag_of_the_Duchy_of_Parma.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Marriage_certificate_of_Philip_Mountbatten_and_Elizabeth_Windsor.jpg/220px-Marriage_certificate_of_Philip_Mountbatten_and_Elizabeth_Windsor.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten%2C_Duke_of_Edinburgh_photo.PNG/240px-Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten%2C_Duke_of_Edinburgh_photo.PNG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Coat_of_Arms_of_Philip%2C_Duke_of_Edinburgh.svg/120px-Coat_of_Arms_of_Philip%2C_Duke_of_Edinburgh.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Banner_of_the_Holy_Roman_Emperor_%28after_1400%29.svg/23px-Banner_of_the_Holy_Roman_Emperor_%28after_1400%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/23px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flag_of_Romania.svg/23px-Flag_of_Romania.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/72/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten%2C_Duke_of_Edinburgh_photo.PNG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten", "title": "Wedding of Princess Elizabeth and Philip Mountbatten", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/72/Wedding_of_Princess_Elizabeth_and_Philip_Mountbatten%2C_Duke_of_Edinburgh_photo.PNG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}