{"url": "http://library.cqpress.com/cqresearcher/document.php?id=cqresrre2005031800&type=query&num=Hollywood", "text": "Introduction In early February, North Korea's leader bragged about his nuclear arsenal, the lagging U.S. dollar started climbing and the Prince of Wales announced his engagement. But the serious-minded readers of Bloomberg News were most interested in Charles and Camilla. Americans have an insatiable appetite for celebrity news, and the juicier the better — from Brad and Jennifer's breakup to Michael Jackson's trial to Martha Stewart's jail term. Some observers say it's harmless to follow the lives of celebrities. Indeed, they even say we are genetically programmed to care, and that the heavy focus on celebrities simply reflects that interest. But media critics say celebrity coverage is squeezing out legitimate news and that, as a result, the United States is becoming a nation that knows more about the “Battle of the Network Stars” than the battle for Baghdad. With less attention being paid to informing citizens about government and the world around them, the critics warn, a cornerstone of a democratic society — an informed populace — is being put in jeopardy. Read the Full Report (Subscription Required) Buy Full Report", "images": ["http://profile.ak.fbcdn.net/hprofile-ak-snc4/50314_14014374330_323187_q.jpg", "http://library.cqpress.com/cqresearcher/images/triangle.gif", "http://library.cqpress.com/cqresearcher/images/logo.png?v=2", "http://library.cqpress.com/cqresearcher/images/navArrow.png", "http://library.cqpress.com/cqresearcher/file.php?path=/images/CQ_Researcher/r20050318-cover.jpg", "http://library.cqpress.com/cqresearcher/images/closeicon.png", "http://library.cqpress.com/cqresearcher/images/survey.gif"], "top_img": "http://profile.ak.fbcdn.net/hprofile-ak-snc4/50314_14014374330_323187_q.jpg", "keywords": [], "authors": [], "canonical_link": "http://library.cqpress.com/cqresearcher/cqresrre2005031800", "title": "Celebrity Culture", "meta_data": {"robots": "noarchive", "citation_issn": "1942-5635", "citation_firstpage": 245, "citation_lastpage": 268, "og": {"title": "Celebrity Culture", "type": "article", "url": "http://library.cqpress.com/cqresearcher/cqresrre2005031800", "image": "http://profile.ak.fbcdn.net/hprofile-ak-snc4/50314_14014374330_323187_q.jpg", "site_name": "CQ Researcher by CQ Press", "description": "In early February, North Korea's leader bragged about his nuclear arsenal, the lagging U.S. dollar started climbing and the Prince of Wales announced his engagement. But the serious-minded readers of Bloomberg News were most interested in Charles and Camilla. Americans have an insatiable appetite for celebrity news, and the juicier the better &#8212; from Brad and Jennifer's breakup to Michael Jackson's trial to Martha Stewart's jail term. Some observers say it's harmless to follow the lives of celebrities. Indeed, they even say we are genetically programmed to care, and that the heavy focus on celebrities simply reflects that interest. But media critics say celebrity coverage is squeezing out legitimate news and that, as a result, the United States is becoming a nation that knows more about the &#8220;Battle of the Network Stars&#8221; than the battle for Baghdad. With less attention being paid to informing citizens about government and the world around them, the critics warn, a cornerstone of a democratic society &#8212; an informed populace &#8212; is being put in jeopardy."}, "fb": {"app_id": 195908820443982}}, "movies": [], "publish_date": null, "source": "http://library.cqpress.com", "summary": ""}