{"url": "https://popculture.com/celebrity/2018/04/12/kendra-wilkinson-hangs-jersey-shore-tori-spelling-after-hank-baskett-split/", "text": "After filing for divorce from Hank Baskett, Kendra Wilkinson is finding support in some unlikely friends.\n\nLess than a week after filing for divorce from her husband-of-eight-years, the 32-year-old Kendra on Top star was “getting back to being Kdub” by finding support in a group of famous friends, including the cast of Jersey Shore and Tori Spelling.\n\n“So thankful for friends right now,\" Wilkinson wrote on an Instagram post on Tuesday, which included a series of pictures and videos of her day out. “Laughter is the best medicine and yesterday i overdosed. [Laugh out loud]. Getting back to being Kdub again [and] feels good.\"\n\nThe former Playboy model and reality television personality spent the day clinking wine glasses with the cast of Jersey Shore, including Nicole \"Snooki\" Polizzi and Deena Cortese, before hanging out with fellow reality star and Beverly Hills, 90210 alum Tori Spelling. The two later attended the Millennial Mamas' Mom's Night Out event in Calabasas, joined by Wilkinson’s BFF and co-star Jessica Hall, Beverly Hills, 90210 alum Ian Ziering’s wife Erin Ziering, 7th Heaven alum Beverley Mitchell, and American Idol alum Kimberly Caldwell, E! News reports.\n\nOn Friday, Wilkinson confirmed that after nearly nine years of marriage, she and Baskett had chosen to file for divorce. “Today is the last day of my marriage to this beautiful man,\" she said at the time.\n\n“I will forever love Hank and be open but for now we have chosen to go our own ways,” she captioned a photo of herself and Baskett. “I’m beyond sad and heartbroken because I did believe in forever, that’s why I said yes but unfortunately too much fear has gotten in the way. We are both amazing parents and our kids will be happy n never know the difference other than seeing mama smile.”\n\nShe continued, \"Sometimes love looks funny. We are told to make sacrifices in life if it's true love well in this case it’s me. I want to see happy Hank again... I miss that. Marriage was just a piece of paper and a piece of jewelry but our hearts will always be real.\"\n\nWilkinson, 32, and Baskett, 35, wed in 2009. The couple share son Hank IV, 8, and daughter Alijah, 3. Their marriage was rocked by scandal in 2014 when Baskett, a former football player, allegedly had an affair with a transgender model while Wilkinson was eight months pregnant.\n\nThe couple remained committed to each another in the wake of the scandal, though The Girls Next Door cast member famously flushed her wedding ring down the toilet and they appeared on Marriage Boot Camp: Reality Stars Edition to flush out their problems.", "images": ["https://media.popculture.com/2018/04/kendra-wilkinson-today-nbc-20031412-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/04/kendra-wilkinson-today-nbc-20031412-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2018/04/12/kendra-wilkinson-hangs-jersey-shore-tori-spelling-after-hank-baskett-split/", "title": "Kendra Wilkinson Hangs With 'Jersey Shore' Crew and Tori Spelling After Hank Baskett Split", "meta_data": {"description": "After filing for divorce from Hank Baskett, Kendra Wilkinson is finding support in some unlikely friends.Less than a week after filing for divorce from her husband-of-eight-years, the 32-year-old Kendra on Top star was “getting back to being Kdub” by finding support in a group of famous [...]", "keywords": "Kendra Wilkinson,Jersey Shore,Snooki,Tori Spelling", "news_keywords": "Kendra Wilkinson,Jersey Shore,Snooki,Tori Spelling", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "SchonterAllison", "title": "Kendra Wilkinson Hangs With 'Jersey Shore' Crew and Tori Spelling After Hank Baskett Split", "description": "After filing for divorce from Hank Baskett, Kendra Wilkinson is finding support in some unlikely [...]", "image": "https://media.popculture.com/2018/04/kendra-wilkinson-today-nbc-20031412-640x320.jpeg"}, "og": {"title": "Kendra Wilkinson Hangs With 'Jersey Shore' Crew and Tori Spelling After Hank Baskett Split", "type": "article", "url": "https://popculture.com/celebrity/2018/04/12/kendra-wilkinson-hangs-jersey-shore-tori-spelling-after-hank-baskett-split/", "image": {"identifier": "https://media.popculture.com/2018/04/kendra-wilkinson-today-nbc-20031412-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "After filing for divorce from Hank Baskett, Kendra Wilkinson is finding support in some unlikely [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1523462400.0, "source": "https://popculture.com", "summary": ""}