{"url": "http://www.parkerxl.com/where-do-kameron-westscott-dandra-simmons-rank-amongst-all-101-real-housewives/", "text": "So how did their efficiency stack up towards the opposite ninety nine Actual Housewives who’ve come earlier than them? You are going to should learn on to seek out out! (Notice: Solely those that’ve accomplished their first full season, together with reunion specials, are included on the record. Meaning you will need to examine again in a couple of weeks for RHOC beginner Peggy Sulahian !)\n\nBecoming a member of the listing this time are a pair of RHOD newbies who did not waste time stirring issues up within the Lone Star state. Kameron Westscott , the canine lover decided to convey the aforementioned pink pet food into the world, went toe-to-toe with Brandi Redmond almost each probability she acquired, whereas D’Andra Simmons , via whom we met the Mama D (her boss of a mom), wasn’t afraid to place anybody of their place in the event that they have been appearing a idiot—together with longtime good friend and self-described Mouth of the South, LeeAnne Locken .\n\nNow that season two reunion of The Actual Housewives of Dallas is formally over, with speak of knives for arms, pink pet food and Sexual Chocolate firmly in our rear view mirror, it is time for one factor: An replace of our official Actual Housewives rating!\n\nBravo The Official Rating of The Actual Housewives\n\nWe at E! Information cannot get sufficient of The Actual Housewives. We obsess over their feuds, we interject their taglines into conversations on the common, we even obtain their hilarious songs. However not all Housewives are created equal. For each Teresa Giudice, there is a Tammy Knickerbocker. We proudly current the official rating of The Actual Housewives. All a hundred and one of them.\n\nAdam Olszweski/Bravo a hundred and one-ninety eight. The Actual Housewives of D.C.\n\nBravo’s unwell-fated try at highlighting our nation’s capital introduced collectively 4 ladies so forgettable you would be forgiven for erasing them out of your reminiscence and one so determined for fame that she crashed the White Home. Extra on her later. (These forgettable women? Mary Amons, Lynda Erkiletian, Cat Ommanney, and Stacie Scott Turner.)\n\nTommy Garcia/Bravo ninety seven-ninety one. The Actual Housewives of Potomac\n\nAfter two seasons, we will not be bothered with Gizelle Bryant, Karen Huger, Robyn Dixon, Ashley Darby, Charrisse Jordan-Jackson, Monique Samuels, and Katie Rost‘s incessant arguments about etiquette or who the “Grande Dame of Potomac” may be. Sorry, not sorry.\n\nChris McPherson/NBC/NBCU Photograph Financial institution by way of Getty Pictures ninety. Kimberly Bryant, RHOC\n\nWho?\n\nBRAVO 89. Tammy Knickerbocker, RHOC\n\nOnce more, who?\n\nBRAVO 88. DeShawn Snow, RHOA\n\nAs soon as upon a time, DeShawn starred on the identical TV present as NeNe Leakes. Shocking, we all know.\n\nBRAVO 87. Quinn Fry, RHOC\n\nHer defining trait was “cougar.” Yawn.\n\nBravo 86. Kameron Westscott, RHOD\n\nOn the one hand, she’s the Housewife who launched the world to pink pet food. However, she’s the Housewife who launched the world to pink pet food.\n\nBravo eighty five. Siggy Flicker, RHONJ\n\nFrom peacekeeper in season one to unrelenting complaints a few thrown cake in season two, we’re unsure what is going on on with Siggy, however we do not adore it.\n\nPaul Zimmerman/Getty Photographs eighty four. Dolores Catania, RHONJ\n\nFactors for being prepared to go toe-to-toe with Danielle Staub. Factors subtracted for being unwilling to fault BFF Siggy on absolutely anything.\n\nBravo eighty three. Kelly Dodd, RHOC\n\nOnce more, too new to the franchise to rank any larger. Factors for the really unorthodox dwelling preparations, although.\n\nGustavo Caballero/Getty Pictures for Allied-THA eighty two. Karent Sierra, RHOM\n\nAll we keep in mind about Karent is that she was a dentist and none of her co-stars appeared to love her in any respect. Subsequent!\n\nAdam Olszweski/Bravo eighty one. Cristy Rice, RHOM\n\nThis was an actual individual with a present on Bravo. We promise.\n\nBravo eighty. Jules Wainstein, RHONY\n\nAs RHONY‘s most up-to-date one-and-completed, Jules’ tenure was too temporary to rank any larger. Nevertheless, she positive did ship her justifiable share of drama.\n\nAdam Olszweski/Bravo seventy nine. Larsa Pippen, RHOM\n\nIf solely we knew then that she was Kim Kardashian‘s BFF…\n\nJeff Daly/Bravo seventy eight. Ana Quincoces, RHOM\n\nHigher luck on Subsequent Meals Community Star, Ana!\n\nBravo seventy seven. Joyce Giraud de Ohoven, RHOBH\n\nNothing greater than a punching bag for Brandi Glanville. Plus, her tagline celebrating the icky notion you can by no means be too skinny was gross.\n\nBRAVO seventy six. Cindy Barshop, RHONY\n\nCindy was purported to be the brand new Bethenny Frankel. Cindy was no Bethenny Frankel.\n\nBravo seventy five. Amber Marchese, RHONJ\n\nEvery little thing Amber and her husband Jim did appeared to reek of desperation. Plus, he was concerned in additional of the drama than she was. Not a very good look.\n\nMike Pont/Getty Photographs seventy four-seventy three. Teresa Aprea and Nicole Napolitano, RHONJ\n\nSo pointless they could not even get particular person taglines.\n\nGabriel Olsen/FilmMagic seventy two. Lizzie Rovsek, RHOC\n\nOne other considered one of OC‘s one-and-accomplished Housewives.\n\nJason Kempin/Getty Pictures seventy one. Cary Deuber, RHOD\n\nCary proved herself prepared to face as much as the loudest of voices (e.g. LeeAnne Locken), however one thing about her marriage makes us uncomfortable. Perhaps it is her husband’s bizarre obsession with shopping for her whole wardrobe.\n\nBravo 70. D’Andra Simmons, RHOD\n\nHer willingness to name BFF LeeAnne Locken on her BS, in addition to the introduction to her pleasant mom Mama D, are why D’Andra’s ranked as excessive as she is.\n\nAlberto E. Rodriguez/Getty Photographs sixty nine. Lydia McLaughlin, RHOC\n\nLydia’s largest storyline was making an attempt to get her mother to quit smoking weed. Buzzkill!\n\nJason Kempin/Getty Pictures sixty eight. Tiffany Hendra, RHOD\n\nTiffany by no means actually had a storyline of her personal within the first season of Dallas. Until making an attempt to persuade her Keith City-lite husband that dwelling in Texas was a good suggestion is your concept of riveting tv.\n\nCarlos Barrios/Getty Pictures for Luli Fama sixty seven. Lisa Hochstein, RHOM\n\nLisa’s wrestle with fertility was an emotional watch, however that was about all there was of word on her time on Miami.\n\nBravo sixty six. Stephanie Hollman, RHOD\n\nStephanie’s BFF relationship with Brandi Redmond is a delight, however Brandi all the time shines a bit brighter. Additionally, WTF is up with Stephanie’s husband and his lists?\n\nDylan Rives/Getty Pictures for Venue Journal sixty five. Alexia Echevarria, RHOM\n\nFactors for correctly stepping away in season two to give attention to her son after his horrific accident, however Alexia was by no means that fascinating on her personal.\n\nCharles Sykes/Bravo sixty four. Adriana de Moura, RHOM\n\nAdriana was the proper of loopy. Too dangerous she was caught on the sinking ship that was Miami.\n\nBravo sixty three. Joanna Krupa, RHOM\n\nJoanna’s most memorable Housewives contribution was her offscreen feud with Brandi Glanville. That is not how this works, Joanna.\n\nGustavo Caballero/Getty Photographs for Maaji sixty two. Marysol Patton, RHOM\n\nMarysol was solely stored round as a result of her mother Elsa was such a riot. You recognize, we all know, and she or he is aware of it.\n\nBravo sixty one. Kathryn Edwards, RHOBH\n\nAll of us cheered when Kathryn took on the notorious Faye Resnick as quickly as she made her Beverly Hills debut. After which we snored by means of the remainder of her temporary time on the present.\n\nRobin Marchant/Getty Pictures 60. Lea Black, RHOM\n\nLea was the grande dame of Miami and her co-stars knew it. Nobody dared cross her. Additionally, her husband as soon as represented Justin Bieber in courtroom!\n\nBravo fifty nine. Brandi Redmond, RHOD\n\nDid you ever anticipate a Housewife to speak about poop a lot? We did not. We additionally did not anticipate to be as delighted by it as we have been.\n\nBravo fifty eight. Dorit Kemsley, RHOBH\n\nDorit, she of the indiscriminate European accent (regardless of being born in Connecticut) and boorish husband PK, got here in scorching when she was added to RHOBH in season seven, instantly pitting herself towards fan-fave Erika Girardi in a feud that appeared to solely exist in her head. She generated some nice drama, however her incapability to defend herself articulately towards her superior co-stars prevents her from rating any greater. (And if we ever hear the phrase Pantygate once more, it is going to be too quickly.)\n\nVirginia Sherwood/Bravo fifty seven. Lisa Wu-Hartwell, RHOA\n\nLisa was a wonderfully positive Housewife, however we do not need simply fantastic. Not when she’s sharing the display with NeNe Leakes.\n\nBravo Photograph: Mitchell Haaseth fifty six. Lynne Curtin, RHOC\n\nLynne truly acquired an eviction discover on digital camera. Always remember!\n\nAlberto E. Rodriguez/Getty Photographs fifty five. Jo De La Rosa, RHOC\n\nJo was the primary Housewife to discover her musical pursuits, kicking off considered one of our favourite tendencies within the franchise. However factors deducted for being the individual to foist Slade Smiley upon the world.\n\nRodolfo Martinez/Bravo fifty four. Carlton Gebbia, RHOBH\n\nThe franchise’s first and solely training Wiccan, Carlton was fairly a personality. Sadly, she by no means actually appeared to need to be round any of the opposite ladies. In any respect. Bye, witch!\n\nTommy Garcia/Bravo fifty three. Peggy Tanous, RHOC\n\nPeggy got here in as a pal of Alexis Bellino and instantly revealed she as soon as dated her husband. What a pal!\n\nBravo fifty two. Tinsley Mortimer, RHONY\n\nWith only one season underneath her belt, RHONY‘s ninth, the previous socialite’s story principally concerned her tumultuous time crashing at Sonja Morgan‘s townhouse, the place her pal handled Tinsley like her surrogate daughter—for higher or (principally) worse.\n\nMathieu Younger/Bravo fifty one. Kristen Taekman, RHONY\n\nKeep in mind the time that Ramona Singer threw a wine glass at her face?\n\nGerald Herbert/AP Photograph 50. Michaele Salahi, RHODC\n\nMichaele is the one cause anybody even remembers RHODC. Sadly, that is as a result of she and her husband crashed a state dinner on the White Home on digital camera. The White Home!\n\nBravo Photograph: Mitchell Haaseth forty nine. Lauri Peterson, RHOC\n\nLauri’s time on RHOC was typically consumed by her child’s brushes with the regulation, however her villainous return in season eight was very entertaining.\n\nJim Spellman/WireImage forty eight. Alex McCord, RHONY\n\nAlex by no means actually felt like part of the group, nor did she appear to have the mettle to wrestle with the large canine. Keep in mind the best way she all the time broke out into hives throughout confrontations?\n\nBravo forty seven. Claudia Jordan, RHOA\n\nClaudia dared to tackle NeNe Leakes and lived to inform the story. Sadly, she could not inform it on digital camera as a result of she was given the boot after only one season.\n\nBravo forty six. LeeAnne Locken, RHOD\n\nThe franchise’s first former carny, LeeAnne’s mood was in contrast to something we might ever seen earlier than. She even went after a digital camera man throughout one notably fiery outburst!", "images": ["https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2018/03/rs_634x1024-180312123327-634-cameron-diaz-31218.jpg?resize=360%2C240", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_634x1024-171119154052-634.tracee-ellis-ross-american-music-awards-2017.ct.111917.jpg?resize=125%2C125", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/12/rs_634x1024-150211052453-634.Ed-Sheeran-Beyonce-JR-21115.jpg?resize=125%2C125", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-14_20-56-46.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2016/01/Even-cell-phones-accessories.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-14_18-59-26.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2019/11/IMG_4409.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2018/05/img_3773.jpg?resize=480%2C240", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_600x600-171113131233-600.Bethenny-Frankel-NeNe-Leakes.ms.111317.jpg?w=750", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_634x1024-171116035527-634-Gabi-MK111617.jpg?resize=66%2C66", "http://www.parkerxl.com/wp-content/themes/valenti/library/images/thumbnail-480x240.png", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x768-171121154322-1024-tv-we-re-thankful-for.jpg?resize=480%2C240", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2016/01/91ef3af006b9f2285c2ac352b3142535.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2016/06/shcker.jpg?resize=80%2C60", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2016/01/8104c1bde24b76b71ad9026ef7280c95.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2016/06/rosie-huntington-whitely-long-legs.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2019/11/IMG_6472.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2018/08/img_0918.png?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2018/05/img_2982.jpg?resize=80%2C60", "http://www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg", "https://www.joomag.com/Frontend/embed/cover/issue_cover.php?UID=M0738975001409950884", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2018/05/img_3626.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2018/05/img_1663.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2014/12/p19.jpg?resize=480%2C240", "http://assets.pinterest.com/images/pidgets/pin_it_button.png", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2019/11/IMG_4497-1-scaled.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg?fit=1024%2C759", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2019/11/parker1.jpg?resize=80%2C60", "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-15_18-08-57.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-15_18-09-05.jpg?resize=80%2C60", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-14_21-12-32.jpg?resize=80%2C60", "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2018/05/img_3944.jpg?resize=80%2C60", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-15_18-09-09.jpg?resize=80%2C60", "http://www.parkerxl.com/wp-content/uploads/2015/11/PArkerXLHeader_mini.jpg", "https://i2.wp.com/www.parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-15_18-09-13.jpg?resize=80%2C60"], "top_img": "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg?fit=1024%2C759", "keywords": [], "authors": [], "canonical_link": "http://www.parkerxl.com/where-do-kameron-westscott-dandra-simmons-rank-amongst-all-101-real-housewives/", "title": "Where Do Kameron Westscott & D'Andra Simmons Rank Amongst All 101 Real Housewives? - Parker XL", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Where Do Kameron Westscott & D'Andra Simmons Rank Amongst All 101 Real Housewives? - Parker XL | Lifestyle & Fashion", "description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "url": "http://www.parkerxl.com/where-do-kameron-westscott-dandra-simmons-rank-amongst-all-101-real-housewives/", "site_name": "Parker XL | Lifestyle & Fashion", "updated_time": "2017-11-14T08:22:48+00:00", "image": {"identifier": "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg?fit=1024%2C759", "secure_url": "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg?fit=1024%2C759", "width": 1024, "height": 759}}, "article": {"publisher": "https://www.facebook.com/parkerxl/", "section": "tpr", "published_time": "2017-11-14T08:22:37+00:00", "modified_time": "2017-11-14T08:22:48+00:00"}, "twitter": {"card": "summary", "description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "title": "Where Do Kameron Westscott & D'Andra Simmons Rank Amongst All 101 Real Housewives? - Parker XL | Lifestyle & Fashion", "site": "@RealParkerXL", "image": "https://i1.wp.com/www.parkerxl.com/wp-content/uploads/2017/11/rs_1024x759-160721095035-1024Template_Landing_Page-housewives.jpg?fit=1024%2C759", "creator": "@RealParkerXL"}, "google-site-verification": "-AJth76StNccpEa8_YZqs-jtI6HvtEceL9IGSvwDLmI", "msapplication-TileImage": "https://i0.wp.com/www.parkerxl.com/wp-content/uploads/2015/11/66416_Parker_XL_logo_01-e1461634559462.png?fit=100%2C72"}, "movies": [], "publish_date": 1510647757.0, "source": "http://www.parkerxl.com", "summary": ""}