{"url": "https://abcnews.go.com/GMA/Style/royal-wedding-history-fascinators/story?id=54719609", "text": "Royal Wedding: The history of fascinators What is the history of the very creative hats people wear to royal weddings?\n\nThey're colorful, bombastic, fabulous and the ultimate statement pieces -- they're fascinators, and you're about to see them gracing many of the heads of Prince Harry and Meghan Markle's wedding attendees.\n\nWhat is a fascinator?\n\nTypically, women attending a British wedding wear a hat, or a \"fascinator,\" to accessorize their outfit. Usually, the fascinator is worn during the ceremony and the reception, but will often be taken off in the evening or during dinner.\n\nA fascinator may seem ostentatious to those who aren't used to the style, but they are staples in a Brit's wardrobe.\n\nCatherine, Duchess of Cambridge attends the wedding of Pippa Middleton and James Matthews at St Mark's Church on May 20, 2017 in Englefield Green, England. UK Press via Getty Images\n\n\"Originally, fascinators were smaller, with little decorations,\" Suzanne Cotton, the fashion design chair at Columbus College of Art and Design, told \"Good Morning America.\" \"But in the William and Kate years, fascinators became an over-the-top accessory. I definitely think they’ve evolved from being a small, pretty thing like a little piece of netting with a flower to being these very over-the-top fashion statements.\"\n\nFascinators can come in all shapes and sizes, but they do have certain parameters.\n\nA fascinator is a decorative hat that is typically large and attached to a headband, small combs or an elastic back.\n\n\"They’re attached to headbands, they’re easy to wear, and they still allow you to make a bold fashion statement,\" Cotton said.\n\nHow did the fascinator get its name?\n\nThe word “fascinator” may trace its roots back to the Latin word \"fascinatus,\" which means to bewitch, according to Cotton.\n\n\"And I think fascinators can certainly do that,\" Cotton said. \"They give people a chance to make a bold fashion statement.\"\n\nWhen did fascinators come onto the fashion scene?\n\nFascinators have been used for hundreds of years, according to fashion experts, but Cotton contends they've been through quite an evolution since their advent.\n\n\"In the 19th and 20th centuries, fascinators were light knitted headpieces, but the modern fascinator ... really became popular in the 1980s and ’90s,\" Cotton said.\n\nPrincess Beatrice departs the Royal Wedding of Prince William to Catherine Middleton at Westminster Abbey on April 29, 2011 in London. UK Press via Getty Images\n\nSandra Walcott, an adjunct assistant professor for the Fashion Institute of Technology's Accessories Design Department, told \"GMA\" the fascinator became popular after milliners Stephen Jones and Philip Treacy created some creative pieces for London celebrities.\n\nJones had Diana, Princess of Wales, as a consistent client due to his avant-garde designs in the early 1980s.\n\nTreacy is a favorite of many international celebrities, such as Sarah Jessica Parker and Camilla, Duchess of Cornwall. Of the various transfixing fascinators worn to Prince William and Kate Middleton's 2011 wedding, 36 of them were Treacy's.\n\nMost notably, Princess Beatrice's oddly shaped fascinator she wore to William and Kate's ceremony was designed by Treacy.\n\nPrincess Eugenie of York arrives to the Royal Wedding of Prince William to Catherine Middleton at Westminster Abbey on April 29, 2011 in London. Pascal Le Segretain/Getty Images\n\nBut Beatrice wasn't alone in her peculiar debut at that particular royal wedding. Right by her side, was Princess Eugenie of York.\n\n\"The most famous fascinator that I remember is the one worn by Princess Eugenie,\" Walcott said. \"The fascinator is said to be 'outlandish' due to its large size, odd shape, and awkward placement at the front of the head.\"\n\nWhy do British women wear them?\n\nFascinators became prevalent because there's a feeling in Britain that one is not fully dressed without something on your head, according to Walcott.\n\n\"Think of the expression 'dressed from head to toe,'\" she added.\n\nThe accessory also helps bring the eyes upward, Walcott noted, towards a person's face, and can enhance a woman's overall look.\n\nBut Cotton has a practical theory on why they are so widely worn.\n\n\"I think fascinators became popular because they don’t mess with your hair,\" she said.\n\nZara Phillips and Chanelle McCoy attend day 2 'Ladies Day' of the Cheltenham Festival at Cheltenham Racecourse on March 14, 2018 in Cheltenham, England. Max Mumby/Indigo/Getty Images\n\nCotton is skeptical about what the fashion forecast is for fascinators, as she feels they may have hit their peak in the fashion world.\n\n\"Treacy has said the fascinator is dead, so I’m curious to see how many fascinators we’ll see at the royal wedding,\" Cotton said.\n\nPrince Harry and Meghan Markle will wed on May 19, a day where jubilant attendees may show the fashion world whether fascinators are still hot or not.", "images": ["https://s.abcnews.com/images/Lifestyle/Fascinator-wedding-gty-hb-180425_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Lifestyle/Fascinator-wedding-gty-hb-180425_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Blair Shiff", "May", "Min Read"], "canonical_link": "https://goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609", "title": "Royal Wedding: The history of fascinators", "meta_data": {"description": "What is the history of the very creative hats people wear to royal weddings?", "keywords": "fascinators, british hats, royal wedding hats, hats of the royal wedding, kate middleton, prince william, prince harry, meghan markle, harry and meghan wedding, queen elizabeth, prince philip", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Royal Wedding: The history of fascinators", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609", "title": "Royal Wedding: The history of fascinators", "description": "What is the history of the very creative hats people wear to royal weddings?", "image": "https://s.abcnews.com/images/Lifestyle/Fascinator-wedding-gty-hb-180425_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-05-02T12:38:02Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,54719609", "ipad": "abcnewsipad://link/story,54719609", "googleplay": "https://goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Royal Wedding: The history of fascinators", "description": "What is the history of the very creative hats people wear to royal weddings?", "url": "https://goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609", "image": {"identifier": "https://s.abcnews.com/images/Lifestyle/Fascinator-wedding-gty-hb-180425_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,54719609", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,54719609", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/style/story/royal-wedding-history-fascinators-54719609"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}