{"url": "https://en.wikipedia.org/wiki/This_Is_Us_(season_2)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode U.S. viewers\n\n(millions)\n\nOn the Big Three's 37th birthday, Randall wants to adopt a baby, but Beth convinces him they can honor William's legacy by adopting an older child. Kate leaves an audition because all the other women there are thin, but she returns to go through with it. She is rejected because of her inexperience, not her weight; Kate is confident she can work her way up. Toby tells Kevin that he, not Kevin, needs to be Kate's \"person.\" Kevin explains that Kate informed him of their father's death, and being Kate's brother is the only thing he is really good at. In the past, Rebecca takes the Big Three to a movie after her argument with Jack. Rebecca urges Jack to come home; Jack admits his drinking is out of control. Later, the family house has burned and Rebecca, in the car with Jack's possessions in a bag, screams and cries.\n\n20 2 \"A Manny-Splendored Thing\" John Fortenberry Dan Fogelman & Bekah Brunstetter October 3, 2017 ( ) 2AZC02 11.06[19]\n\nThe young Big Three prepare for a school talent show. Kate abandons her plan to sing, after Rebecca calls her the family's \"greatest singer,\" but Kate overhears Rebecca's superior ability. Only Sophie enjoys Kevin's poor Mr. T impression. Kate reassures Jack, who turns to a punching bag to avoid drinking. Years later, teenage Kate reassures Jack after he admits his alcoholism problem; he lets Rebecca take him to an AA meeting. In the present, Kevin appears in the 100th \"The Manny\" episode. The writer gives him deliberately humiliating material, but Sophie focuses him on completing the job. The other Pearsons fly in for the taping. Randall admits to Beth that he worries about fostering an older child who could have major issues. Kevin tells Beth that Randall only risked failure once: in asking her out. Beth reassures Randall they will succeed, and they tell their daughters about their intentions. Kate gets her first gig, filling in with a bar's house band. Kate sings well, then tells Rebecca that her exaggerated praise is insincere and demoralizing. Rebecca seeks support from Toby; but he sides with Kate, winning Rebecca's approval.\n\n21 3 \"Déjà Vu\" John Requa & Glenn Ficarra Isaac Aptaker & Elizabeth Berger October 10, 2017 ( ) 2AZC03 11.02[20]\n\nOn Kevin's movie set, Kate—excited that Sylvester Stallone is his co-star—bonds with \"Sly\" and tells him what his films meant to her father, and about his death. After talking with Stallone, Kevin's memories of his dad surface, affecting his performance in a scene. Randall learns that a young girl, Deja, is being brought to his home. Later, when Deja yells at Beth for \"stealing\" her mom's cigarettes, Randall defends his wife, and Deja shrinks to defend herself from apparent aggression. Randall talks to Deja about the joy he found in having Jack and Rebecca, as well as William. Kevin takes pain medication after his old football knee injury is reinjured during battle scene filming. In flashbacks, when the kids are teenagers, Jack talks about his efforts to rehabilitate from alcoholism; Randall tries to find his birth parents through an ad, and is comforted by Kate and Kevin after a woman claims to be his birth mother for his family's money.\n\n22 4 \"Still There\" Ken Olin Vera Herbert October 17, 2017 ( ) 2AZC04 10.65[21]\n\nYoung Kate and Kevin have chicken pox. Randall reluctantly agrees to deliberately contract it. Against Rebecca's objections, her mother Janet arrives and is snowed in with the Pearsons. Janet is judgmental and socially tone-deaf, and ostracizes Randall. Rebecca confronts Janet, calls her a racist, and demands she leave as soon as possible; Randall overhears. The family takes refuge in the master bedroom. Despite having also gotten sick, Jack rallies to shovel Janet's car out so she can leave immediately. Janet admits she can't help feeling differently about Randall, but she takes an interest in his science fair project and acknowledges he is special. In the present, Randall takes his daughters and Deja bowling, but Deja's unwashed hair leads to a fight with another girl. Beth realizes Deja is suffering alopecia from stress; Deja allows Beth to wash and braid her hair. Randall invites Deja to run with him to combat stress; Deja understands Beth shared their conversation with him, and cuts the braids off. Kevin undergoes surgery on his injured knee; reluctant to take painkillers, he does so to maintain his movie's production schedule. Kate is six weeks pregnant but hasn't told Toby.\n\n23 5 \"Brothers\" John Requa & Glenn Ficarra Tyler Bensinger October 24, 2017 ( ) 2AZC05 10.60[22]\n\nKate and Toby share news of her pregnancy. Kevin, set to be auctioned off by Sophie for a large-scale charity event she is hosting, gets drunk while trying to get a pain medication prescription; he misses the auction, embarrassing Sophie. Randall earns Deja's trust. In the past, when Jack takes 10-year-old Kevin and Randall camping, Rebecca learns that Jack's father is dying. She calls Jack, but his past issues with his father combined with his focus on making sure Kevin gets along with Randall keep Jack from returning. Rebecca reassures Jack's father (who sees his granddaughter, Kate) that Jack is a great father and husband. Kevin finds a notebook where Randall wrote reminders to himself on how to keep the peace between them, motivating him to be nice to Randall. Later, Jack looks at a picture of him and his brother in the army. During Jack's childhood, he and his never-before-seen brother await their father's return to the car as he gets drunk at a bar.\n\nIn flashbacks, with the 10-year-old Big Three, Rebecca takes Randall trick-or-treating while Jack takes Kate and Kevin to a haunted house. Randall learns about Kyle's death from the neighbors; Rebecca then tells him the facts of his adoption. In other flashbacks, with the Big Three being in their twenties, Kate finds out she is involved with a married man. Kevin, desperate for work as an actor, attempts to steal a role from his roommate and best friend. Meanwhile, Randall and Beth prepare for the arrival of their first daughter. Beth unexpectedly goes into labor after agreeing to help Rebecca create a Facebook account. With no time to get to the hospital, Randall helps Beth through a home delivery. Kate and Kevin commiserate about their deadbeat lives and decide to live together. When Rebecca posts a photo of her granddaughter on Facebook, she gets a message from Miguel asking how she has been the last eight years. (Jack's death was sometime before Miguel last saw Rebecca.)\n\n25 7 \"The Most Disappointed Man\" Chris Koch Kay Oyegun November 7, 2017 ( ) 2AZC07 9.89[24]\n\nJack and Rebecca prepare to finalize Randall's adoption when Randall is a year old. Their case worker gives a glowing recommendation, but their judge is against interracial adoption. After Rebecca's letter about being Randall's mother, the judge recuses himself; the new judge grants the adoption. Concurrently, William pleads guilty to a drug charge. Although the judge is disappointed because William had a clean record, William claims to be more disappointed due to the loss of his loved ones and son. The judge visits William in jail, offering to reduce the sentence and get him help if he stays sober. William keeps this promise for 30-odd years until hearing his cancer is terminal. As he is about to use, Randall introduces himself as William's biological son. In the present, Randall takes Deja to visit her mother Shauna in prison, but Shauna declines the visit. Randall later talks to Shauna, who intends to take Deja back after her release. He lets Shauna call Deja collect. Kevin's relationship with Sophie deteriorates as he continues abusing pain medication and alcohol. Kate and Toby announce their pregnancy to Kevin and plan to get married at city hall, but then reconsider having a big wedding.\n\n26 8 \"Number One\" Ken Olin K.J. Steinberg November 14, 2017 ( ) 2AZC08 10.05[25]\n\nIn flashbacks, baby Kevin walks first. Teenage Kevin disrespects a Pitt football recruiter, thinking Pitt inferior, so Jack scolds Kevin. As Jack speaks with his sponsor and recites the serenity prayer, Kevin remains flippant, but Jack apologizes to Kevin. A game injury ends Kevin's football prospects while Jack and Randall are away at a college tour. Jack comes to the hospital and assures Kevin that he has other talents and will find his purpose. Kevin apologizes for his attitude. Jack gives him a pendant, symbolizing \"purpose,\" given to him in Vietnam at a personal low point. Jack says Kevin is his purpose. Present-day Kevin, exhausted by substance abuse, is an honored alumnus at his high school. His football coach introduces him; Kevin imagines Jack giving the speech. Kevin declares himself unworthy of his award. He pantomimes football on the field, giving play-by-play commentary on his failures. He has sex with fellow honoree Charlotte, a doctor, and uses her prescription pad to create a forgery; he quickly leaves a pharmacy after police enter. Having left the pendant in Charlotte's house, he returns in its pursuit, but she keeps him out. He collapses, begging for help. He visits Randall, who assumes Kevin's desire to talk concerns Kate's miscarriage.\n\n27 9 \"Number Two\" Ken Olin K.J. Steinberg & Shukree Hassan Tilghman November 21, 2017 ( ) 2AZC09 9.34[26]\n\nIn flashbacks, baby Kate walks second. Teenage Kate bonds with the dog, Louie. Kate seems unconcerned with college applications; Rebecca is pleased to discover Kate's application for Berklee. At Kevin's game, Kate accepts Rebecca's praise just as Kevin is injured. At the hospital, Kate admits she feared disappointing Rebecca; Rebecca acknowledges their emotional distance, but is ready to support Kate when needed. Kate watches her parents embrace. Present-day Kate talks to her unborn baby; she and Toby focus on her prenatal care, but she miscarries. Kate leaves a singing gig, overcome at seeing a family; she loads a buffet plate, but leaves it untouched. Toby works frantically to avert the delivery of a baby bath. At home, Kate blames Toby for getting her excited about the baby; she tells Toby that the miscarriage didn't happen to him, but he asserts that he shares their loss. Rebecca arrives and Kate accepts her support. Kate admits feeling she hurt Toby by miscarrying; Rebecca shares that concealing from Jack her grief over triplet Kyle's death led her to a breakdown in a supermarket after six weeks. Kate tells Toby how she feels and they agree to try again soon; they reaffirm their love.\n\n28 10 \"Number Three\" Ken Olin Shukree Hassan Tilghman November 28, 2017 ( ) 2AZC10 10.94[27]\n\nIn flashbacks, baby Randall walks third. Jack expects teenage Randall to attend Harvard, but lets Randall tour Howard. Jack takes the official tour; a friend shows Randall around. Randall tells Jack that others' reactions make him feel \"off balance\" as the only black family member. Jack shows Randall the Vietnam Veterans Memorial; Jack felt off balance when he returned from the war. Jack believes Randall will find balance and be \"spectacular.\" They return to Pittsburgh to a hospitalized Kevin; Jack admits monitoring all three children is difficult. In the present, the charges against Deja's mother, Shauna, are dropped; Randall and Beth consider fighting for custody. Randall recalls William's account of following Rebecca home after her second visit; he realized Randall had a full life without him and left. Randall observes Shauna preparing for Deja's homecoming and realizes Deja's home is with Shauna; Beth agrees. They attend Deja's school presentation. Shauna takes Deja home; Randall offers to be available to Deja for help no matter what. Randall and Beth agree to foster again; a young boy meets with his social worker. Kevin arrives at Randall's, but leaves quickly after drinking vodka. Kevin speeds down the highway; Tess, hidden in the back seat because she \"hates\" home, admonishes him. Kevin is arrested for DUI; Tess is safe.\n\n29 11 \"The Fifth Wheel\" Chris Koch Vera Herbert January 9, 2018 ( ) 2AZC11 9.65[28]\n\nWhen the kids are 10, Jack takes the family for a cabin vacation, picking up Kevin after football camp. Randall's new glasses are missing. Rebecca notices Kate's food obsession; Jack has her exercise, but takes her for ice cream. During a thunderstorm, Kevin brings Randall's glasses to their parents' room where Kate and Randall are sleeping. He sleeps on the floor. Present-day Toby finds junk-food trash. Tess tells her parents she was sad when Deja had to leave. The family visits Kevin at rehab; Barbara, the facilitator, wants only immediate family at Kevin's first session. Kevin apologizes to the family, but Barbara also has him discuss family issues. Kevin says they are a family of addicts and that he always felt like the \"fifth wheel\" growing up: Kate had Jack's support and Rebecca loved Randall more than Kevin. Randall scolds Kevin; Rebecca, crying, says Randall was easier to love. Toby, Beth, and Miguel, at a bar, discuss being outsiders, Miguel the only one who knew Jack. After the session, the Big Three reconcile. Kate admits to Toby about hiding junk food since miscarrying. Rebecca tells Kevin why she never worried about him and that they had their moments. (In the flashback, Rebecca joins Kevin on the floor.)\n\n30 12 \"Clooney\" Zetna Fuentes Bekah Brunstetter January 16, 2018 ( ) 2AZC12 9.82[29]\n\nJack and Rebecca take the teenage Big Three shopping for suits and dresses for the winter formal and Jack's job. Randall asks a redheaded girl out. Though the teenagers are almost starting college, Jack again wants to start \"Big Three Homes\" (which he put aside to support his family). Presently, William's stray cat \"Clooney\" wanders. After rehab, Kevin stays with Rebecca—whom Miguel is protecting, since Kevin upset her by getting arrested and criticizing her at rehab. Miguel later tells Kevin that Jack and Rebecca were a unified couple, not individuals; he did not love Rebecca while Jack was alive, but does now and is staying. Kate befriends Madison from their support group; they go wedding dress shopping and Kate discovers Madison's bulimia. Madison later faints and calls Kate for help. Kate says losing weight as a teenager did not make her happy. Randall visits Beth at work; she says working again would help him. Randall gets William's box from storage, searches for a lady about whom William wrote and drew, and discovers it was a mural of Billie Holiday. Randall tells Beth he wants to buy and manage the run-down building with her. In the flashback, Jack and Rebecca forget to buy smoke detector batteries.\n\n31 13 \"That'll Be the Day\" Uta Briesewitz Kay Oyegun & Don Roos January 23, 2018 ( ) 2AZC13 9.37[30]\n\nAround 1980, an elderly couple sort their junk, including a jukebox that plays \"That'll Be the Day.\" When their house gets a buyer, the man gives his neighbor, Jack, a slow cooker with a tricky switch. In 1998, Jack and Rebecca watch the Super Bowl alone as the teenagers are otherwise occupied—Kevin is with Sophie, Randall is on a date, and Kate is making a music college audition tape (which Jack videotapes, to Kate's initial disapproval). In the present, Randall and Beth buy William's old building. Kevin helps Randall do repairs; they soon find themselves overwhelmed and bugs, so the building is vacated when an exterminator is called. When Toby looks up dogs on the internet, Kate—with mixed feelings—adopts a dog. Kevin tries to make amends to Sophie, receives his missing pendant in the mail, and knows that he cannot make amends to his dad. In 1998, the old slow cooker's faulty switch causes a house fire.\n\n32 14 \"Super Bowl Sunday\" John Requa & Glenn Ficarra Dan Fogelman February 4, 2018 ( ) 2AZC14 26.97[31]\n\nIn 1998, Jack evacuates the family (Kevin is away) from the burning house, then retrieves Kate's dog and family mementos. Jack, hospitalized for smoke inhalation, dies suddenly of cardiac arrest, to Rebecca’s shock. She tells Miguel, Randall, and Kate; Kate tells Kevin. On the 20th anniversary of Jack's death, Kate's VCR damages the audition tape Jack recorded—and saved from the fire—which she watches cathartically, blaming herself. Toby gets the tape repaired and digitized. Kate tells Toby that he strengthens her and Jack would have loved him. Kevin visits Jack's memorial tree, admitting he has not lived up to Jack's legacy, but pledging to make him proud. Rebecca makes Jack's favorite lasagna and bonds with Kevin. Randall holds a Super Bowl party to commemorate Jack, but is emotional when the family's new pet lizard dies. Tess admits trying to prevent social workers from calling, fearing recent changes mean Randall wants a \"new life.\" He reassures her he will always be devoted to her; she is happy the family participates in fostering. Deja unexpectedly arrives; Randall and Beth comfort her. The boy seen earlier is placed with a couple; the social worker is an adult Tess, whom an older Randall meets for dinner.\n\n33 15 \"The Car\" Ken Olin Isaac Aptaker & Elizabeth Berger February 6, 2018 ( ) 2AZC15 10.13[32]\n\nJack buys a costly Wagoneer because his young children love it. The Pearsons, going to see \"Weird Al\" Yankovic, slowly cross a bridge Rebecca fears. Jack drives Rebecca, awaiting MRI results, to his \"favorite tree” (nearest a pay phone); Rebecca is fine, as Jack anticipated. Jack predicts he will die first and asks to be outside, not buried. The brothers fight during Randall's driving lesson; Jack exhorts them to be close like him and his brother, who died in Vietnam. Jack drives truant Kate to Alanis Morissette's autograph session; they compare Morrissette with Bruce Springsteen. Rebecca drives the teenagers to Jack's funeral, stalking the urn because she was not in Jack's room when he died. Dr. K and his second wife attend the funeral, where he tells Rebecca that Jack often sought his advice and she has always been strong. Kate decides to give away her dog; Rebecca affirms that Jack's death is not Kate's fault because Jack made his own decisions. The brothers bicker over manly duties, but they make peace when Rebecca tells them to remain teenagers. The Pearsons scatter Jack's ashes at the tree, but Kate keeps some. Jack had purchased Springsteen tickets, so Rebecca drives the family to the concert, overcoming her fear and crossing the bridge.\n\n34 16 \"Vegas, Baby\" Joanna Kerns Laura Kenar February 27, 2018 ( ) 2AZC16 9.74[33]\n\nJack and Rebecca celebrate their early wedding anniversaries—she, with small thoughtful gifts; he, with grand romantic gestures. The children, age 10, plan a romantic anniversary celebration (despite Rebecca's desire not to celebrate), including an attempted dinner and culminating in observing a meteor shower. Rebecca decides they should always celebrate their anniversary. In the present, Toby and Kate hold their bachelor and bachelorette parties in Las Vegas. Kevin, Randall, Beth, and others attend; Toby has no close male friends and Kate and Beth are not close. Kevin maintains his sobriety, despite struggling when learning his film scenes may have been cut. Weeks after providing Deja money for Shauna's utility bill, Randall worries about Deja; Beth wants to move on, resulting in them arguing. Kate tries to mediate, revealing she feels Beth replaced her in Randall's life; Kate explains she was closest to Randall during part of their youth. Beth admits her love for Deja hurts in her absence. Toby supports Kevin and Randall, saying his own brother never desired a close relationship. Ron Howard tells Kevin his great work is still in the movie. When returning home, Beth decides she and Randall should visit Deja; they find her and Shauna living in a car.\n\n35 17 \"This Big, Amazing, Beautiful Life\" Rebecca Asher Kay Oyegun March 6, 2018 ( ) 2AZC17 8.90[34]\n\nFlashbacks show other characters' experiences paralleling Deja's. 16-year-old Shauna gives birth to Deja; Shauna's grandmother G.G. urges Shauna towards accountability. Three years later, G.G. financially supports Shauna. G.G. dies; Shauna depends on Deja. Adolescent Deja injures herself cooking Shauna's birthday dinner; Linda removes Deja from her home. Stress drives Shauna to drug use and Deja stays in the foster system. Deja and her foster sister Raven, after shoplifting, are removed from a physically abusive foster father's home; Raven is willing to endure physical abuse for stability. Deja returns to Shauna; Shauna's mooching boyfriend Lonzo brings a gun into the home and Deja's alopecia begins amid the adults' fighting. The gun is found in Shauna's car; Deja lives with the Pearsons, returning to Shauna after the charges are dropped. Shauna breaks up with Lonzo, but spends her and Deja's savings to bail him out of jail; Deja attempts to raise money, but decides not to pawn G.G.'s brooch, resulting in Shauna and Deja being evicted for unpaid rent. Randall and Beth take in Shauna and Deja. Deja concludes that the human experience is universal. Shauna believes she deprived Deja of a childhood and decides to leave Deja with the Pearsons.\n\n36 18 \"The Wedding\" Ken Olin Isaac Aptaker & Elizabeth Berger March 13, 2018 ( ) 2AZC18 10.94[35]", "images": ["https://upload.wikimedia.org/wikipedia/en/1/1e/This_Is_Us_season_2_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1e/This_Is_Us_season_2_poster.jpg/220px-This_Is_Us_season_2_poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/This_Is_Us_%28season_2%29/0/bebd5a1873a083494125a503e73b202c841abef0.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/1e/This_Is_Us_season_2_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/This_Is_Us_(season_2)", "title": "This Is Us (season 2)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/1e/This_Is_Us_season_2_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}