{"url": "https://www.seventeen.com/celebrity/movies-tv/reviews/a23435/disney-princess-rankings/", "text": "We love all the Disney Princesses, but we're all about Girl Power and some princesses are just more badass than others. On the power girl scale, here's how your fave Disney Princesses rank.\n\n13. Aurora, Sleeping Beauty\n\nThe most interesting thing about her is that she sleeps, for a really long time! The story's a bit of a snooze, literally.\n\n12. Snow White, Snow White and the Seven Dwarfs\n\nSnow White started the whole \"I'll just rest my eyes until prince charming comes along\" trend, which just prevents her, and the other damsels in distress, from living up to their full potential. Plus, lying around waiting for some dude to come rescue you? Lame! At least she taught us to never take food from strangers.\n\n11. Cinderella, Cinderella\n\nFrom her evil stepsisters to her even more evil stepmother, Cinderella just can't seem to catch a break. We sympathize with Cinders, but we wouldn't have blamed her for teaching her evil step siblings a lesson or two!\n\n10. Ariel, Little Mermaid\n\nWhile we love Ariel's adventurous side, does it not bother anyone else how much she was willing to give up for Prince Eric? Meanwhile, he was ready to marry the first girl who sang him a pretty tune. It's time to reevaluate your life when the crab makes better decisions than you do!\n\n9. Jasmine, Aladdin\n\nOur favorite thing about Jasmine is that her and Aladdin take turns rescuing each other. Still, girl can be super judge-y. We respect that she isn't \"a prize to be won,\" but she doesn't give anyone a chance because she thinks all the princes are show-offs—until someone shows up on a magic carpet, which sounds a little show off-y to us...\n\n8. Merida, Brave\n\nMerida gets props for wanting to do things her own way, and her bow and arrow skills give us a total Katniss vibe. Okay, so she did turn her mom into a bear and all, but she realized she was wrong and changed her back. That counts for something, right?\n\n7. Elsa, Frozen\n\nElsa's the only other Disney princess (then queen) that has magical powers. Unfortunately, it takes her almost hurting her own sister to realize that being different can be good thing.\n\n6. Rapunzel, Tangled\n\nRapunzle spends the first 18 years of her life locked in a castle, and yet she still learned how to wield a weapon (a frying pan, but hey, it still counts!) like a trained professional.\n\n5. Belle, Beauty and the Beast\n\nBelle is a small town girl who loves nothing more than to curl up with a good book. While she doesn't have magic powers or serious fighting skills like some of the other princesses, she manages to show the beast there's beauty in kindness. And unlike some of the other damsels on this list, she rescues her prince from an evil spell!\n\n4. Pocahontas, Pocahontas\n\nYes, she made a sacrifice for love, but it was deeper than that. Pocahontas managed to create peace and understanding between two feuding groups. Plus, she can paint with all the colors of the wind, so there's that.\n\n3. Tiana, The Princess and the Frog\n\nTiana is the first and only princess who not only has a full-time job, but starts her own business, too! She proves that with hard work and determination, nothing, even turning into a frog, can stand in your way.\n\n2. Anna, Frozen\n\nAnna is goofy, outspoken, unstoppable and totally relatable. When everyone feared the worst, Anna looked for a solution, and proved that sometimes the most important love is the love for your family.\n\n1. Mulan, Mulan\n\nMulan is no one's damsel in distress, which makes her the most kick-butt princess of them all. She joins the army and no one finds her suspicious, because she's just as good, if not better, than everyone else. Oh yeah, she also saves her entire country. NBD.\n\nWhat do you think of our ranking? What would you change? Tell us in the comments below!\n\n\n\nMORE:\n\n17 Problems Only Disney Princesses Understand\n\n14 Things That Make No Sense In Disney Movies\n\nWatch Disney Princesses Remake Mean Girls In Honor Of Its 10 Year Anniversary\n\nGifs Courtesy of: Giphy.com", "images": ["https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/640x320/landscape_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/640x320/landscape_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg?resize=1200:*", "keywords": [], "authors": ["Jelani Addams Rosa"], "canonical_link": "https://www.seventeen.com/celebrity/movies-tv/reviews/a23435/disney-princess-rankings/", "title": "Best And Worst Disney Princesses", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Definitive Ranking Of Disney Princesses!", "description": "On the girl power scale, see how your favorite Disney princesses rank.", "url": "https://www.seventeen.com/entertainment/reviews/disney-princess-rankings", "image": {"identifier": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/640x320/landscape_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2018-04-12 03:48:11", "published_time": "2014-05-07 06:44:00", "section": "Movies & TV", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/640x320/landscape_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg?resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Ranking Of Disney Princesses - Best And Worst Disney Princesses", "description": "On the girl power scale, see how your favorite Disney princesses rank.", "keywords": "beauty and the beast,disney princesses,tangled,Disney movies,disney princess,frozen,the little mermaid", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/320x320/square_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,movies-tv,frozen,the little mermaid,disney princess,beauty and the beast,disney movies,buzz blog", "sailthru.date": "2014-05-07T18:44:00Z", "sailthru.image.full": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/640x320/landscape_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/sev.h-cdn.co/assets/cm/15/09/320x320/square_nrm_54db75c78a089_-_cos-01-disney-princesses-uu8nuz-xl-synd2.jpg", "sailthru.socialtitle": "Definitive Ranking Of Disney Princesses!", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1399416240.0, "source": "https://www.seventeen.com", "summary": ""}