{"url": "www.thesun.co.uk/tvandshowbiz/2466587/cheryl-liam-payne-son-bear-split/", "text": "CHERYL and Liam Payne are parents to their son Bear.\n\nThe Sun exclusively revealed their tot was born on March 22, 2017. Following the sad news that their relationship has run its course, here is the lowdown on their son Bear...\n\nWhat did Cheryl and Liam call their baby?\n\nCheryl and Liam named their baby Bear, and the tot also took his One Direction star dad's surname, Payne.\n\nThey decided on the unusual name after spending a week getting to know the tot.\n\nA source revealed: “Cheryl and Liam wanted to get to know their baby before deciding on a name.\n\n“They spent over a week getting to know him first before deciding.\"\n\nThe baby name became the subject of an April Fool's prank, with Directioners making the name Lionel trend as the baby's name.\n\nMarie Claire also shared an article naming the tot as “Wayne ‘Window’ Payne”.\n\n2 Cheryl revealed her bump for the first time in a campaign for L'Oreal and The Prince's Trust\n\nlatest on cheryl HOT MAMA Pregnant Vogue Williams wows fans with her toned abs in tough workout session TOP OF THE TOTS Liam Payne and Cheryl teach 7-month-old son Bear to speak Spanish ONE'S YOUR LOT Cheryl tells Liam Payne she's 'not ready for another baby' after he admitted he wanted a second child COULDN'T BEAR TO LEAVE Cheryl and Liam Payne deny they're quitting the UK for a life in Hollywood with baby Bear BOUNCE BACK BODY Cheryl is back to a size six after daily workouts, yoga during baby Bear's naps and a low carb diet BACK TO WORK Cheryl to 'fly to America to record fifth album' following first public appearance after maternity leave mummy bear's back! Cheryl shows off her slim post-baby body just five months after giving birth as she's spotted in public signing autographs for fans Exclusive LIAM PLOTS TOT TAT Liam Payne 'planning large chest tattoo' to mark becoming a dad to son Bear with long-term girlfriend Cheryl Dad date Liam Payne reveals he didn't meet Cheryl's father until she was pregnant with their son Bear high steaks Liam Payne reveals 'mother-in-law' Joan jokingly 'waved a knife' at him when he ordered a £300 steak for dinner\n\nWhy did Liam Payne and Cheryl call their baby Bear?\n\nLiam Payne revealed the reason Cheryl chose to call their newborn son Bear.\n\nHe made the confession during a radio interview in the US and admitted he’d had an “internal battle” about the moniker.\n\nLiam said: “The reason she chose Bear, in the end, was that Bear is a name that when you leave a room you won’t forget. And I like that. When I look at him he is Bear.\n\n“To be honest at first I wasn’t having it, I didn’t understand it and I wasn’t sure. Now I look at him and he is Bear. It’s mad.”\n\n2 Credit: Instagram\n\nWhat is Bear's nickname and middle name?\n\nLiam revealed his adorable nickname for baby Bear is Cub.\n\nThe One Direction star met fans in America for a Q&A, and immediately opened up on “making a human”.\n\nOne fan wrote: “He said his proudest moment was bear and said at first he called him cub a lot.”\n\nAccording to a fan who the One Direction star met in Boston, Liam and Cheryl decided to give their “cub” the middle name of Grey.\n\nAn excited Twitter user called Jackie posted: “LIAM TOLD US BEAR’S MIDDLE NAME! IT’S GREY! BEAR GREY PAYNE”\n\nThe fan also added that the name certainly suits their little one, tweeting: “He just talked about letting Cheryl name him and that when he looks at him now ‘he’s definitely Bear’ & that his middle name is Grey.'\"\n\nWhen did Cheryl and Liam split?\n\nOn July 1, 2018, The Sun exclusively revealed that Cheryl and Liam had separated after two-and-a-half years.\n\nThe pair released a statement confirming their split: \"We are sad to announce that we are going our separate ways.\n\n\"It's been a tough decision for us to make. We still have so much love for each other as a family.\n\n\"Bear is our world and we ask that you respect his privacy as we navigate our way through this together.\"", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "https://i0.wp.com/www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict0002856538806.jpg?crop=0px%2C61px%2C3013px%2C2010px&resize=1200%2C800&ssl=1", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://i0.wp.com/www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict0002856538806.jpg?crop=0px%2C61px%2C3013px%2C2010px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Josie Griffiths"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/2466587/cheryl-liam-payne-son-bear-split/", "title": "When was Cheryl and Liam Payne’s son Bear born, and what does his name mean?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Here's all you need to know about Cheryl and Liam Payne's son Bear", "url": "https://www.thesun.co.uk/tvandshowbiz/2466587/cheryl-liam-payne-son-bear-split/", "description": "CHERYL and Liam Payne are parents to their son Bear. The Sun exclusively revealed their tot was born on March 22, 2017. Following the sad news that their relationship has run its course, here is th…", "site_name": "The Sun", "image": {"identifier": "https://i0.wp.com/www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict0002856538806.jpg?crop=0px%2C61px%2C3013px%2C2010px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2020-04-17T11:12:47+00:00", "modified_time": "2020-04-17T11:13:35+00:00", "publisher": 161385360554578, "tag": "Cheryl, Liam Payne, Explainers", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The 24-year-old One Direction hunk and former Girls Aloud babe have been enjoying parenthood", "keywords": "liam payne, cheryl, cheryl and liam, cheryl baby, cheryl cole, Bear, baby Bear, relationship, split, break-up, parents", "news_keywords": "liam payne, cheryl, cheryl and liam, cheryl baby, cheryl cole, Bear, baby Bear, relationship, split, break-up, parents", "twitter": {"text": {"title": "When was Cheryl and Liam Payne’s son Bear born, and what does his name mean?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "WHAT'S IN A NAME?", "headline": "Here's all you need to know about Cheryl and Liam Payne's son Bear", "image": {"medium": "https://i0.wp.com/www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict0002856538806.jpg?crop=0px%2C89px%2C3013px%2C2010px&resize=300%2C192&ssl=1", "large": "https://i0.wp.com/www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict0002856538806.jpg?crop=0px%2C89px%2C3013px%2C2010px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 2466587, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1587121967.0, "source": "http://www.thesun.co.uk", "summary": ""}