{"url": "https://www.thecut.com/2017/03/how-bachelor-contestants-cash-in-after-the-show-is-over.html", "text": "Ashley Rosenbaum and Danielle Lombard. Photo: Courtesy of Instagram/daniellellombard; Courtesy of Instagram/ashleylynnrosenbaum\n\nTonight, the improbable 21st season of The Bachelor comes to a close. Only one woman will walk away with everlasting love, but all of the contestants will get the opportunity to reach for something greater: free money.\n\nRelated Stories A History of The Bachelor, by the People Who Lived It\n\nWhether they were sent home in the first few weeks or made it all the way to the final rose ceremony, every contestant will enter the amorphous reality-TV-personality-slash-social-media-influencer economy, which, in 2017, is booming. Since contestants are not paid to appear on The Bachelor, the best chance to capitalize on their newfound visibility is right after the show. The stars and contestants do not want to appear too thirsty for fame, of course — they went on The Bachelor to “find love” — but time is of the essence. In a few months, a new season of the show will premiere, and there will be 25 new contestants for the public to follow. The best brand partnerships are being negotiated right now. And the only way for contestants to extend their time in the spotlight is to keep making deals and sharing their lives with the public.\n\nSo how much money can stars and contestants make? And how, exactly, do they cash in? We talked to a few members of the Bachelor franchise to find out.\n\n“Flat Tummy Tea and Teeth Whitening”\n\nSocial-media endorsement deals with brands are some of the most popular ways contestants cash in on their fame. Instagram is the main platform for this, likely because that is where Bachelor stars tend to build the biggest following (you know their faces, not necessarily their names). Kaitlyn Bristowe, who served as the Bachelorette in 2015, said she was bombarded with Instagram offers as soon as she left the show (happily, in the arms of her fiance Shawn Booth).\n\n“Overnight you have this huge following, so all these brands are like, ‘Here, do you want to work with us?’” she told me in a phone interview. “So you get offers to do the Flat Tummy Tea and the teeth whitening and all that. For somebody who has worked a regular job before, you’re like, ‘Oh my gosh, you’re going to pay me to do that? Glorious.’” Kaitlyn chose to partner with brands like Palm Bay cocktails, Smartfood popcorn, and TRESemmé.\n\nThese kinds of ads, which have proliferated across social media over the last five years, are pretty easy to spot. They all feature slightly ham-fisted product placement, obviously pre-written captions, and specific hashtags like, #VolumeRevolution #TRESemmePartner. Reality-TV stars can reportedly make $1,500 to $7,000 for each simple photo, depending on their follower count. And Bachelor and Bachelorette leads are not the only ones to book these kinds of deals: Even contestants who were only briefly on the show can rack up multiple clients.\n\nFor example, when the current Bachelor, Nick Viall, sent contestant Danielle Lombard home just a few weeks into this season, she immediately got to work. Since her departure from the show just five weeks ago, she has posted advertisements for BootayBag panties, Weekend Vice clothing, Bombay Hair “rose gold” curling irons (for “those Victoria Secret Voluminous Waves!”), DIFF sunglasses, Muddy Body face masks, Glam Seamless hair extensions, FabFitFun subscription boxes, Away luggage, Drip Doctors on-demand IV therapy (for “immunity”), and the JetSmarter app.\n\nLucky for Danielle, she probably will not have to keep all those ads on her feed, should she later regret posting them. Oftentimes, brand contracts will stipulate that stars can delete the posts after a certain amount of time. Kaitlyn, for her part, said it takes time to find the right Instagram ad balance. “I have turned down money to stay true to who I am and brands that I want to work with,” she explained.\n\nTo Dance or Not to Dance With the Stars\n\nOne of the most coveted opportunities for a Bachelor star is an appearance on ABC’s Dancing With the Stars. It is added exposure, and the “celebrities” on the show are paid well: They reportedly make six-figure base salaries and bonuses for every week they stay in the competition. In the past, three Bachelors, one Bachelorette, and one Bachelor contestant have scored placement on the show, and this season, Nick will join their ranks. His announcement about joining the show, however, was met with controversy.\n\nWhen news of Nick’s casting broke, Kaitlyn claimed on Twitter that Bachelor creator Mike Fleiss prevented her from doing Dancing With the Stars after her run as the Bachelorette. “Actually I was offered it, had the contract & Mike Fliess [sic] told me I wasn’t allowed. He said he didnt want people wanting fame after his show,” she tweeted.\n\nActually I was offered it, had the contract & Mike Fliess told me I wasn't allowed.He said he didnt want people wanting fame after his show🤔 https://t.co/nSzricohi4 — Kaitlyn Bristowe (@kaitlynbristowe) February 27, 2017\n\nThe Bachelor creator did not comment on the accusation and instead responded on Twitter, “@kaitlynbristowe has my total support if she wants to appear on DWTS!!! #TheBachelor.” This did not pacify Kaitlyn; she pointed out that the opportunity was no longer available to her. “Thanks I’ll get right on that opportunity 2 yrs ago. I wonder what changed your mind?” she tweeted. (We reached out to representatives for Fleiss for comment and will update if we hear back.)\n\nThe controversy shows the fraught position Bachelor and Bachelorette stars find themselves in after the show. They do not want to seem too fame-hungry (they are supposed to be settling down with a fiancé!), but if they do not aggressively pursue opportunities right away, they risk losing out on cash.\n\nChris Soules, a Bachelor who appeared on Dancing With the Stars in 2015, said in a phone interview that Bachelor producers “have a say in almost everything you do afterwards,” because stars remain under contract for a year after the show. He added that he was surprised to hear Kaitlyn’s story. “I sort of knew that [Mike Fleiss] could approve or disapprove most anything, but I just figured it’s ABC … they’re a pretty important company to Mike Fleiss so I just assumed that he was indifferent if the contestants went on.”\n\nKaitlyn told me she would still “love to know why” she was not allowed to dance with the stars, but she has moved on. “I’m going to be starting my podcast soon, and living in Nashville, I’ve been songwriting and singing so that’s really fun,” she revealed. She said she has recorded three songs and ultimately hopes to release an album.\n\nTelevised Weddings and Couples Therapy\n\nDancing With the Stars is not the only reality-TV option for stars post-Bachelor. After his season of The Bachelor in 2016, Ben Higgins booked an unscripted-scripted Freeform reality show with his fiancée titled Ben and Lauren: Happily Ever After. The show was as boring and unmemorable as its stars, and it did not get picked up for a second season. Ben’s best chance to earn another paycheck from his Bachelor fame? Marry Lauren on television.\n\nA televised wedding is the most logical next step for a successful Bachelor or Bachelorette couple. To date, five couples have married in front of their family, friends, and millions of ABC viewers: Trista and Ryan Sutter (The Bachelorette, season 1), Jason and Molly Mesnick (The Bachelor, season 13), Ashley and JP Rosenbaum (The Bachelorette, season 7), Sean and Catherine Lowe (The Bachelor, season 17), and Jade and Tanner Tolbert (Bachelor in Paradise, season 2). All of them stressed, in one way or another, that they just wanted to continue sharing their journey with fans, and that made getting paid to get married on TV sound a bit more romantic. Trista and Ryan, who were the first couple in Bachelor history to marry, reportedly pulled in $1 million for a three-episode wedding special in 2003, while Sean and Catherine reportedly made six figures for a one-episode special in 2014.\n\nAfter a televised wedding, of course, comes televised couples therapy. Sean and Catherine and Jade and Tanner appeared on separate seasons of WeTV’s chaotic couples therapy program Marriage Boot Camp: Reality Stars. It is a Real World–style setup that involves five couples undergoing marriage counseling in the same house, while drinking a lot. When I interviewed Jade and Tanner at a Marriage Boot Camp premiere last year, they confirmed that they started filming the show just three months after their wedding. They considered it a positive experience.\n\n“I guess, you know, we didn’t look at it as a negative thing like, ‘Our marriage is in trouble,” Jade said. “We’re more like, ‘Let’s learn from these couples now so we don’t have problems later.’ Because both of us come from divorced families … we really want to get through everything together. And so we just felt like, why not? We’ve done everything else on TV!”\n\nIn a blog post after his season of the show aired in 2015, Sean was more direct. “I’ll admit it: I did it for the money,” he wrote. Both couples are still married, so maybe it was worth it.\n\nBrand-Friendly Babies\n\nFive married Bachelor couples have stayed together long enough to have children, and those babies have become part of the social-media-influencer economy, too. Last year, I met Sean and Catherine at a baby shower for their first child, and the whole event was sponsored by Dreft baby detergent. Like fellow Bachelor parents JP and Ashley, Sean and Catherine have featured their baby in Instagram ads for brands like HelloFresh and Teami Blends tea.\n\nDesiree and Chris Siegfried, who married after season nine of The Bachelorette, recently placed their son in an ad for Pace Salsa. (Caption: #ad It’s Asher’s first Taco Tuesday!)\n\nJade and Tanner, meanwhile, just became pregnant with their first child. Immediately after announcing the good news on Instagram, Jade posted an ad for the Ava fertility tracker, which she credited for helping her get pregnant quickly.\n\nThese five couples represent a vast minority of Bachelor and Bachelorette stars who have managed to continue to make money for years after their appearances on the show by sharing more and more of their lives with the public. Families used to pass down farms or dental practices through the generations, but now, we’ve reached an age where reality-TV stars are bequeathing social-media-influencer status to their children. Perhaps, when these brand-friendly babies grow up, they’ll appear on The Bachelor themselves, to continue the tradition.\n\nWatch the video below to see some on-set secrets about what goes on behind the scenes of The Bachelor.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2017/03/13/13-bachelor-stars-ig-ads.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2017/03/13/13-bachelor-stars-ig-ads.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/13/13-bachelor-stars-ig-ads.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2017/03/how-bachelor-contestants-cash-in-after-the-show-is-over.html", "title": "How Bachelor Contestants Cash In After the Show Is Over", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "How Bachelor Contestants Cash In After the Show Is Over", "url": "https://www.thecut.com/2017/03/how-bachelor-contestants-cash-in-after-the-show-is-over.html", "description": "We talked to members of the Bachelor franchise to find out.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/13/13-bachelor-stars-ig-ads.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "How Bachelor Contestants Cash In After the Show Is Over", "description": "We talked to members of the Bachelor franchise to find out.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/13/13-bachelor-stars-ig-ads.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "article": {"published_time": "2017-03-13T14:38:46-04:00", "tag": "the bachelor, the bachelorette, fame, instagram ads, social media influencers, nick viall, brand babies, cut homepage lede, top story", "publisher": "https://www.facebook.com/cut"}, "description": "We talked to members of the ‘Bachelor’ franchise to find out how they make money on Instagram after the show is over.", "sailthru.tags": "the bachelor, the bachelorette, fame, instagram ads, social media influencers, nick viall, brand babies, cut homepage lede, top story", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1489430326.0, "source": "https://www.thecut.com", "summary": ""}