{"url": "https://www.cosmopolitan.com/entertainment/tv/a13030127/skeet-ulrich-riverdale-profile/", "text": "When I arrive to meet Skeet Ulrich at his home in Studio City, Los Angeles, I’m greeted by his well-mannered 16-year-old son, Jakob, who escorts me into the house through the garage. “I built this,” he says, pointing to a motorcycle. I’m impressed, and had I not just walked 850 feet uphill in a sweatshirt, I might have managed more than a “wow, that’s awesome!” But I’m winded and red-faced, and can’t believe I have to meet his dad, a god of the late nineties, looking like a tomato.\n\nThese days, Ulrich, 47, is known as Jughead’s jailbird father, FP Jones, on The CW murder-mystery Riverdale, but his career has spanned more than two decades, popping off in 1996 with roles in The Craft, in which he played a high-school creep put under a love spell, and Scream, in which he played a serial killer who somehow made fake blood look finger-licking good. (“Corn syrup,” the line goes. “Same stuff they used for pig’s blood in Carrie.”) Leave it to a shrink to unpack the how and why of Billy Loomis’s sex appeal (I’d say it’s the greasy hair) — Ulrich was just trying to act.\n\nScream. Miramax\n\n“This was when you received hard fan mail, and there would be trash bags full of letters, so I was aware that I had a popularity,” he tells me from his couch, where his dog Lua, who is smaller than my forearm, flops around like a Beanie Baby come to life. “As to where I sat on the heartthrob scale, I had no [idea]. There was no real barometer. You go on Instagram now and, yeah, we all know Cole [Sprouse, who plays Jughead] is a heartthrob. It’s very obvious.” If only Skeet Ulrich saw the inside of my middle-school notebooks.\n\nUlrich was married to actress Georgina Cates by the age of 27 and moved to a farm in Virginia not long after. (He and Cates have twins, Jakob and Naiia, born in 2001; the couple divorced in 2005.) He rarely walked red carpets because he hates getting his picture taken. “I never look how I thought I’d look,” he says. “I’m like, I think I look pretty good tonight. And then I see the picture and I’m like, Oh, I was very wrong.” He was the only star of Scream absent from the stage at the MTV Movie Awards when the Wes Craven horror film took home Best Movie (it was up against Romeo + Juliet). The fame was “not something I was interested in,” he says. “I was really interested in doing things that challenged me.”\n\nThe Newton Boys. 20th Century Fox via Getty Images\n\nHe took roles in James L. Brooks’s As Good as It Gets (1997), Richard Linklater’s The Newton Boys (1998), and Ang Lee’s Ride With the Devil (1999), and says he passed on movies like Armageddon (the role went to Ben Affleck) and Face/Off (the role went to Alessandro Nivola). It's as if he was borrowing from Leonardo DiCaprio’s Guide to Rejecting Leomania: no matter how hot teens think you are, do not make movies they'll care about.\n\n“I see Leo around quite a bit,” Ulrich says. “He’s always very nice. He’ll stop conversations he’s having to come say hi to me, so whatever bond we formed 20 years ago, it still has relevance to both of us.” The guys hung out back in the day, after DiCaprio’s friend, magician David Blaine, came to live with Ulrich for about six months. But when I inquire about the infamous Pussy Posse, DiCaprio’s clique of womanizing party boys whose members included Lukas Haas, Tobey Maguire (with whom Urlich starred in Ride With the Devil), and Blaine, Ulrich looks puzzled. “I don’t even know what that is.”\n\nAs thrilling as it is to recount the glory days of the nineties, at least for me (Ulrich seems more animated when talking about how much he hates Trump — \"he's got to be impeached before he destroys the world\" — or how much he loves Darren Aronofsky’s Mother! than he does his past), there’s a more serious matter to discuss. Nine days prior to our meeting, the New York Times published an article alleging that producer Harvey Weinstein, whose long list of movies includes Scream, had been sexually harassing women for decades, reportedly trying to coerce actresses to watch him shower, among other horrors. The New Yorker followed the story with its own chilling report that included allegations of sexual assault, the Times ran additional harassment accounts from Angelina Jolie and Gwyneth Paltrow, and there have been other accusations since. (Weinstein has denied many of the allegations, including \"any allegations of non-consensual sex,\" according to The New Yorker.)\n\n\n\n“I knew,” Ulrich admits. “Most people knew. I had dinner with someone who is one of the most famous women on the planet — I won’t say who it is — who has not come out, who told me similar things.”\n\nHe didn’t do anything about it, he says, because “there is nothing you can do. I mean, What am I gonna do? I can’t step up, certainly then, on allegations. Honestly, and I think it’s what most people faced: How do you cut your livelihood from a very powerful corporation on something that you don’t know what the facts are? Now that it’s starting to come out and people are finally stepping up and saying stuff, I’m glad. That’s what it takes. Because one person stepping up and making allegations is gonna hurt that one person and not help anyone, especially [against] someone with that power.”\n\nAmong the most outspoken of Weinstein’s accusers is Ulrich’s Scream co-star Rose McGowan, who claimed on Twitter that Weinstein raped her (Weinstein denies the allegation). The Times had previously reported that Weinstein paid her a financial settlement of $100,000 in 1997 for an unspecified “episode.”\n\nThere is nothing you can do. I mean, What am I gonna do? I can’t step up, certainly then, on allegations.\n\n“I saw her about a year ago and that was the only time I’d seen her since like ’99 or something,” Ulrich says. “None of this [news] was out at that time, so it certainly wasn’t anything I was going to bring up with her. It wasn’t even in my thought process.”\n\n“What industry is safe?” he adds. “Where is a beautiful woman, or any woman, free to walk down the street and not be a feast to some asshole’s eyes? I see how men can be. And then you give a man power? It’s scary.”\n\nUlrich has a stillness about him throughout our conversation. He’s even-keeled, restrained, and says “bless you” every time his publicist, who’s sitting at the dining-room table, sneezes. My interest in him was renewed not only because of his role in Riverdale, but because of his touchy-feely social media activity. He leaves breathlessly supportive comments on his children’s Instagram posts — “Love this shot!!!” “So cool!!!” “You are ALWAYS a ray of sunshine.” Despite not knowing him personally, Busy Philipps once shouted him out in an Instagram story, praising him for putting his acting career on hold to raise his kids. Ulrich says he didn’t watch the story, but someone told him about it. “[She said] I left the business or something?”\n\n\n\n“I didn’t,” he clarifies. “I left a great deal of opportunities because I couldn’t work outside of L.A. with [my kids] being little.” The limitations were “frustrating,” he admits, declining to comment on the twins' mother. “I had such a nonexistent father, I knew that if I did have kids I would never allow them to feel unwanted.\" The result is a tight-knit family that’s expanded to include his fiancée, Brazilian model Rose Costa, and her son, Luca (his father is James Marsden), who will be 5 in December.\n\nThe Craft. United Archives GmbH / Alamy Stock Photo\n\nUlrich was born Bryan Ray Trout in Lynchburg, Virginia, but spent most of his childhood in North Carolina; he took his last name from his first stepfather and got the nickname “Skeet” from a coach who noticed the boy’s small build. (He had open-heart surgery when he was 10 and frequently fell ill with pneumonia.) It wasn’t until Ulrich transferred to New York University from the University of North Carolina at Wilmington, where he was studying marine biology, that he began acting in earnest, starting out in theater under the tutelage of playwright David Mamet, then moving into film. “My god, most of my beginning films, like Boys, the first one, I was horrific,” he says. “And I thought I was really bad in The Craft. I was like, This is horrible.” (He doesn’t know anything about the possible quasi remake, but says he \"got paid a usage fee for some clip that they’re using in it, from the original. Whether that’s still in there or not, I don’t know.”)\n\nEarly in his career, Ulrich was relentlessly compared to Johnny Depp. “All the time,” he says. “There’s certainly worse people to be compared to … I always thought he was a very good-looking guy.” But the talent digs stung. “It hurt when people compared our acting and [said] I’m not half the actor he is,” Ulrich says. “And yet I think I’ve done some stuff he couldn’t do. He also did — what was it called, [with] Angelina Jolie? The Tourist. So we all have ‘em.”\n\nJericho. Getty\n\nUlrich allows that his own IMDB profile began to “waiver” by the early 2000s. “I stockpiled some money on a couple of movies I shouldn’t have been a part of,” he says. On top of that, “I’m sure [my distance from the scene] hurt me in the long run — when you’re not in producers’ faces, when you’re not at the parties and all that stuff, it took its toll, for sure. But I wouldn’t trade it.”\n\nHe made his shift to TV in 2003 with ABC’s Miracles, which got canceled after six episodes. Then there was CBS's Jericho (2006), which got pulled after one season, brought back by popular demand, and shut down again; a 2010-11 stint on Law & Order: L.A. (he got killed off); and a string of pilots that never saw the light of day. If you take all that work into consideration, Riverdale isn’t Ulrich’s comeback — he never went anywhere. But the CW show is his first project in quite some time that “has a bubbling about it,” he concedes. “It’s the only set I’ve been on in my 20-something years doing this where you have to wade through a couple hundred people to get on the set.”\n\nIt’s also the first time Ulrich’s played a dad (not counting the series that were dead on arrival). When I point out the irony of such a good dad playing such a bad dad, he disagrees. “I think he’s a great dad without means. To me, the summation of FP Jones is ‘sometimes good people do bad things for the right reasons.’ What I love about him is he’s clearly the most blue-collar of anyone on that show. He’s the working class, he’s the coal miner, the construction worker. He’s the guy who’s shit upon day in and day out by society, and that was evident through the first season.”\n\nRiverdale. The CW\n\nNext up are a small part in Ryan Murphy’s Versace: American Crime Story and a role in Lifetime’s I Am Elizabeth Smart movie, narrated by Smart, in which he’ll play Brian David Mitchell, the man who kidnapped her at knifepoint from her home in 2002. “It was stressful for both of us,” he says of his first meeting with Smart. “I think the producers’ intention was [that] we would meet before I went into the hair and makeup chair, and it didn’t happen and nobody was there to sort of foster us along. She walked in and you could feel her breath just stop.”\n\nBefore I leave, we take a field trip to the family’s chicken coop, which Ulrich constructed with help from Riverdale co-stars KJ Apa (who plays Archie) and Sprouse. “I think everybody looks for distractions outside of the work and the business and the press,” he says. “And I had it readily available here and they jumped right in.” Ulrich also builds furniture, including a coffee table he made out of teak and birch plywood, the dining-room table, kitchen cabinets, and a console.\n\nRiker Brothers\n\nWe walk down the driveway and back up along a narrow path — me, Ulrich, his publicist, Jakob, and Luca. (Naiia and Rose are out this morning.) “Dad, you know I saw two deers before?” Luca says on our way to meet Clucky, Marilou, Heihei (a nod to Moana), and Coco. “I know,” Ulrich says encouragingly. “Right there?” “Right behind our chicken coop!” He also saw hawks and a bald eagle. Jakob retrieves five eggs from the coop and picks up Heihei so I can pet her.\n\nEarlier, I’d asked Ulrich if his kids are embarrassed by his public displays of fatherhood. “Never. Not at all,” he said. “They’re great human beings.” Jakob likes racing (Ulrich’s family has NASCAR roots). \"If he doesn’t know how to do something, he’s like me: he researches until he understands it, and then does it.” And Naiia wants to be an actress. “I refuse to let her just jump into the business part without proper training, because if you want a career at it, you need to know what you’re doing, and so we’re trying to find the right things for her to study and where.”\n\nUlrich bends to show Luca some Swiss chard. It’s in the midst of a garden that’s looking otherwise rough, given that he’s not had much time to tend to it. It’s not as if he’s gone for stretches of time or anything; he typically shoots Riverdale in Vancouver two days a week. But the hours he does have with his family are precious and sometimes, that means the leafy greens have to wait. “We don’t have any rule [for how long I can be gone],” he says. But if he had it his way? “I’d say a day. Because home … it’s heaven to me what we have here.”\n\nFollow Cosmo Celeb on Facebook.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=1xw:0.749531542785759xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=1xw:0.749531542785759xh;center,top&resize=1200:*", "keywords": [], "authors": ["Patti Greco", "Patti Greco Is A Freelance Writer", "Editor Based In Brooklyn."], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a13030127/skeet-ulrich-riverdale-profile/", "title": "Skeet Ulrich Went From '90s Heartthrob to Struggling TV Actor. Now He's Back.", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Skeet Ulrich Went From '90s Heartthrob to Struggling TV Actor. Now He's Back.", "description": "The Riverdale star, who you also know from Scream, discusses his rocky career, loving family, and the Harvey Weinstein allegations.", "url": "https://www.cosmopolitan.com/entertainment/tv/a13030127/skeet-ulrich-riverdale-profile/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=1xw:0.749531542785759xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-16 05:24:59", "published_time": "2017-10-17 02:12:00", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=1xw:0.749531542785759xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Skeet Ulrich Talks About Harvey Weinstein and Riverdale Season 2 - Skeet Ulrich Interview", "description": "Skeet Ulrich, who you also know from Scream and now Riverdale, discusses his rocky career, loving family, and the Harvey Weinstein allegations.", "keywords": "Riverdale, Skeet Ulrich,  FP Jones, riverdale season 2, skeet ulrich interview", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=0.6670833333333334xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv,Riverdale,skeet ulrich", "sailthru.date": "2017-10-17T14:12:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=1xw:0.749531542785759xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/skeet-ulrich-1951-vhg-1508252691.jpeg?crop=0.6670833333333334xw:1xh;center,top", "sailthru.socialtitle": "Skeet Ulrich Went From '90s Heartthrob to Struggling TV Actor. Now He's Back.", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1508177520.0, "source": "https://www.cosmopolitan.com", "summary": ""}