{"url": "time.com/3394238/britney-spears-kevin-federline-wedding/", "text": "In case you wanted proof of your waning youth, Thursday marks the 10th anniversary of Britney Spears and Kevin Federline’s wedding — a day when a promising young pop star and a dude nicknamed “Meat Pole” decided to throw caution to the wind and say “I do.”\n\n“Ten years — it totally freaks me out,” says wedding planner Alyson Fox, reflecting on the September 18, 2004, nuptials. The day marked Fox’s first (and only) celebrity wedding. While it was originally planned as a big October wedding at the Bacara in Santa Barbara, things rapidly changed after the paparazzi figured out the date and location. Fox was left with about 10 days to organize a completely new, surprise wedding — and, not trusting any other venue to keep the secret, she held it at her own house.\n\nMost Britney fans probably don’t celebrate her short-lived marriage’s anniversary; some even see it as a key moment in a downward spiral from which she has only recently recovered. Still, though Britney filed for divorce in 2006, Fox holds that marriage dear.\n\nTIME spoke to Fox about the whirlwind wedding, young love and the groomsmens’ infamous white Juicy velour “pimp” tracksuits.\n\nTIME: Britney and Kevin Federline’s engagement was huge. Did you think that this would be one of the biggest weddings-\n\nAlyson Fox: —of my career? Yes, I mean, she is Britney Spears. I first interviewed with Felicia, her assistant for years, and I didn’t know who I was meeting with, just that it was a VIP… I met Britney and her mom the next day and they all couldn’t be nicer. The sweetest. I mean they’re from the South. Britney’s so polite, she kept calling me Miss Alyson, and I was like, ‘Oh my God don’t do that; that makes me feel old.’\n\nAnd then you met Kevin.\n\nThey were like any young couple. Very much in love, very touchy feely.\n\nWhat was the original wedding going to be like?\n\nThey came up with a list of 200 to 250 people, and we thought the Bacara would be great. We were designing the most beautiful but not over the top, elegant but shabby chic, gorgeous but fun event… It was a really fun experience. I have not one negative thing to say until we had to move the whole wedding.\n\nSo what happened?\n\nA publication printed the location and date of the wedding. I got a call from a very unhappy Kevin. [Unhappy at the situation not her.] Even though I told them that we had the best security team and it could still go on without a hitch, they didn’t want 100 million people standing outside trying to take pictures, ruining the intimacy and privacy of that event. So we had to go to Plan B, and we had to do it fast.\n\nYou had a “Plan B”?\n\nWell, we planned it in 10 days or less… Everything was already in the works, Monique Lhuillier was making all the gowns that were basically ready, all the vendors were in place for the big wedding — we just didn’t have a location. In that week we decided we can’t do it at a hotel, we can’t do a venue because people were going to know. We limited the guest list to the two families and the wedding party, and then we talked to Britney and Kevin about doing a surprise wedding. Nobody would know.\n\nNot even Britney’s mom?\n\nNo. Nobody knew… We told everyone and our vendors we were having an engagement party. We tried to use every vendor we could who was going to help at the wedding.\n\nAnd you would throw it at your house in Studio City?\n\nWell, their place wasn’t ready yet… The vendors made the house look stunning. It was so beautiful. I only wish they could have had more people… Every person who walked in that night, we handed then an invitation, they opened it up and it said “surprise!” you are here for the wedding and not the engagement party. And we would direct them to the room where they would change into their gowns and tuxedos…\n\nTuxedos? I thought the men were wearing those white Juicy velour jumpsuits…\n\nNo! That’s what they left the house in. They were in tuxedos and gowns. Everybody made such a big deal about that, but that’s what Juicy did for every celebrity who got married. They’d send them the cute little tracksuits. I asked Britney and Kevin what they wanted printed on the back, and Britney said, “Maids! Maids will be cute!” And it was. It was cute! And he said “Pimps” which was adorable… People are closed-minded. It was a joke, it was for fun. It was Juicy tracksuits! 10 years ago people would have given anything for a Juicy tracksuit.\n\nYou must not have gotten a lot of sleep that week.\n\nOh I didn’t sleep that week. And I didn’t sleep the week after, because there were all these stories going on [at the time] that they weren’t really married, and all this B.S. People are going to think what they’re going to think, but I know the truth. They were wonderful people and I’ll say that until the day I die. To this day I don’t talk to a lot of people about it because I still feel protective over them. Unfortunately it didn’t work out — but what is it, 60% of marriages that don’t?\n\nRead TIME’s 1999 profile of Britney Spears here, in the archives: A Sweet Sensation\n\nGet our History Newsletter. Put today's news in context and see highlights from the archives. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2014/08/kanye-west.jpg?quality=85&w=547", "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg?quality=85&w=716&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg", "https://api.time.com/wp-content/uploads/2014/09/britney-spears-jimmy-fallon.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg?quality=85&w=716&h=628&crop=1", "keywords": [], "authors": ["Laura Stampler"], "canonical_link": "https://time.com/3394238/britney-spears-kevin-federline-wedding/", "title": "Britney Spears and Kevin Federline Wedding Planner 10 Year Anniversary", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Britney Spears and Kevin Federline's Wedding Planner, 10 Year Anniversary", "news_keywords": "Britney Spears, Wedding, Kevin Federline, 10 Years, Juicy, Pimp Tracksuit, Marriage", "description": "Britney and Kevin were married September 18, 2004, in their wedding planner's Studio City home. For Alyson Fox, that day lives on in memory.", "og": {"title": "10 Years Later: Britney and Kevin", "type": "article", "site_name": "Time", "url": "https://time.com/3394238/britney-spears-kevin-federline-wedding/", "description": "They were married September 18, 2004 in their wedding planner's Studio City home. Here's what she remembers.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg?quality=85&w=716&h=628&crop=1", "width": 716, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/3394238/britney-spears-kevin-federline-wedding/", "description": "Britney and Kevin were married September 18, 2004, in their wedding planner's Studio City home. For Alyson Fox, that day lives on in memory.", "media": "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg?quality=85&w=716&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/3394238/britney-spears-kevin-federline-wedding/", "title": "10 Years Later: Britney and Kevin", "description": "They were married September 18, 2004 in their wedding planner's Studio City home. Here's what she remembers.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2014/09/britney-spears-people-cover.jpg?quality=85&w=716&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}