{"url": "https://en.wikipedia.org/wiki/Carrie_Fisher", "text": "American actress, screenwriter and novelist\n\nCarrie Frances Fisher (October 21, 1956 – December 27, 2016) was an American actress, writer, and comedian.[3] Fisher is known for playing Princess Leia in the Star Wars films, a role for which she was nominated for four Saturn Awards. Her other film credits include Shampoo (1975), The Blues Brothers (1980), Hannah and Her Sisters (1986), The 'Burbs (1989), When Harry Met Sally... (1989), Soapdish (1991), and The Women (2008).[4] Fisher was nominated twice for the Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series for her performances on the television series 30 Rock and Catastrophe. She was posthumously made a Disney Legend in 2017,[5] and in 2018 she was awarded a posthumous Grammy Award for Best Spoken Word Album.\n\nFisher wrote several semi-autobiographical novels, including Postcards from the Edge and an autobiographical one-woman play, and its non-fiction book, Wishful Drinking, based on the play. She wrote the screenplay for the film version of Postcards From The Edge which garnered her a BAFTA Award for Best Adapted Screenplay nomination, and her one-woman stage show of Wishful Drinking was filmed for television and received a nomination for the Primetime Emmy Award for Outstanding Variety Special. Fisher worked on other writers' screenplays as a script doctor, including tightening the scripts for Hook (1991), Sister Act (1992), The Wedding Singer (1998), and many of the films from the Star Wars franchise, among others.[6] In later years, she earned praise for speaking publicly about her experiences with bipolar disorder and drug addiction.[7]\n\nFisher was the daughter of singer Eddie Fisher and actress Debbie Reynolds. She and her mother appear in Bright Lights: Starring Carrie Fisher and Debbie Reynolds, a documentary about their relationship. It premiered at the 2016 Cannes Film Festival. Fisher died of a sudden cardiac arrest on December 27, 2016, at age 60, four days after experiencing a medical emergency during a transatlantic flight from London to Los Angeles. One of her final films, Star Wars: The Last Jedi, was released on December 15, 2017, and is dedicated to her.[8][9] Fisher appeared in Star Wars: The Rise of Skywalker through the use of unreleased footage from The Force Awakens.[10][11]\n\nEarly life [ edit ]\n\nCarrie Frances Fisher[12] was born on October 21, 1956, in Burbank, California,[13] to actress Debbie Reynolds and singer Eddie Fisher.[14][15] Fisher's paternal grandparents were Russian-Jewish immigrants,[16][17][18][19][20] while her mother, who was raised a Nazarene, was of Scots-Irish and English descent.[21][22][23][24]\n\nFisher was two years old when her parents divorced in 1959. Her father's third marriage, to actress Connie Stevens, resulted in the births of Fisher's two half-sisters, Joely Fisher and Tricia Leigh Fisher. In 1960, her mother married Harry Karl, owner of a chain of shoe stores. Reynolds and Karl divorced in 1973, when Fisher was 17 years old.[25]\n\nFisher \"hid in books\" as a child, becoming known in her family as \"the bookworm.\"[26] She spent her earliest years reading classic literature and writing poetry. She attended Beverly Hills High School until age 16, when she appeared as a debutante and singer in the hit Broadway revival Irene (1973), starring her mother.[27] Her time on Broadway interfered with her education, resulting in Fisher's dropping out of high school.[28] In 1973, Fisher enrolled at London's Central School of Speech and Drama, which she attended for 18 months.[26][29] Following her time there, Fisher was accepted at Sarah Lawrence College, where she planned to study the arts. She later left without graduating.[30][31][32]\n\nCareer [ edit ]\n\n1970s [ edit ]\n\nShe was extremely smart; a talented actress, writer and comedienne with a very colorful personality that everyone loved. In Star Wars she was our great and powerful princess—feisty, wise and full of hope in a role that was more difficult than most people might think. —director George Lucas[33]\n\nFisher made her film debut in 1975 as the precociously seductive character Lorna Karpf in the Columbia Pictures comedy Shampoo, filmed in mid-1974, when she was age 17. Lee Grant and Jack Warden play the role of her parents in the film. Warren Beatty, Julie Christie and Goldie Hawn also star in the film.[4] In 1977, Fisher starred as Princess Leia in George Lucas' science-fiction film Star Wars (later retitled Star Wars: Episode IV – A New Hope) opposite Mark Hamill and Harrison Ford.[34] At the time, she believed the script for Star Wars was fantastic, but did not expect many people to agree with her. Though her fellow actors were not close at the time, they bonded after the commercial success of the film.[35]\n\nIn April 1978, Fisher appeared as the love interest in Ringo Starr's 1978 TV special Ringo.[36] The next month, she starred alongside John Ritter (who had also appeared in Ringo) in the ABC-TV film Leave Yesterday Behind.[37] At this time, Fisher appeared with Laurence Olivier and Joanne Woodward in the anthology series Laurence Olivier Presents in a television version of the William Inge play Come Back, Little Sheba.[38] That November, she played Princess Leia in the 1978 TV production Star Wars Holiday Special, and sang in the last scene.[39]\n\n1980s [ edit ]\n\nFisher appeared in the film The Blues Brothers as Jake's vengeful ex-lover; she is listed in the credits as \"Mystery Woman\".[40] While Fisher was in Chicago filming the movie, she choked on a Brussels sprout; Dan Aykroyd performed the Heimlich maneuver and \"saved my life\".[41] She appeared on Broadway in Censored Scenes from King Kong in 1980. The same year, she reprised her role as Princess Leia in The Empire Strikes Back, and appeared with her Star Wars co-stars on the cover of the July 12, 1980, issue of Rolling Stone to promote the film.[42] She also starred as Sister Agnes in the Broadway production of Agnes of God in 1983.[43]\n\nF.I.S.T. in 1978 Fisher with Wim Wenders at a private party after the premiere of the moviein 1978\n\nIn 1983, Fisher returned to the role of Princess Leia in Return of the Jedi, and posed in the character's metal bikini on the cover of the Summer 1983 issue of Rolling Stone to promote the film.[44][45] The costume later achieved a following of its own.[46] In 1986, she starred along with Barbara Hershey and Mia Farrow in Woody Allen's Hannah and Her Sisters.\n\nIn 1987, Fisher published her first novel, Postcards from the Edge. The book was semi-autobiographical in the sense that she fictionalized and satirized real-life events such as her drug addiction of the late 1970s and her relationship with her mother. It became a bestseller, and she received the Los Angeles Pen Award for Best First Novel. Also during 1987, she was in the Australian film The Time Guardian. In 1989, Fisher played a major supporting role in When Harry Met Sally..., and in the same year she appeared with Tom Hanks as his character's wife in The 'Burbs.[4]\n\n1990s [ edit ]\n\nIn 1990, Columbia Pictures released a film version of Postcards from the Edge, adapted for the screen by Fisher and starring Meryl Streep, Shirley MacLaine and Dennis Quaid.[47] Fisher appeared in the fantasy comedy film Drop Dead Fred in 1991, and played a therapist in Austin Powers: International Man of Mystery (1997).[4] During the 1990s, Fisher also published the novels Surrender the Pink (1990) and Delusions of Grandma (1993). Fisher wrote an episode of the television sitcom Roseanne entitled \"Arsenic and Old Mom\", in which her mother Debbie Reynolds made a guest appearance. Fisher also did uncredited script work for movies such as Lethal Weapon 3 (where she wrote some of Rene Russo's dialogue), Outbreak (also starring Russo), The Wedding Singer[48] and Stop! Or My Mom Will Shoot.[49]\n\n2000s [ edit ]\n\nIn the 2000 film Scream 3, Fisher played a former actress,[50] and in 2001 she played a nun in the Kevin Smith comedy Jay and Silent Bob Strike Back. She also co-wrote the TV comedy film These Old Broads (2001), of which she was also co-executive producer. It starred her mother Debbie Reynolds, as well as Elizabeth Taylor, Joan Collins and Shirley MacLaine.[51]\n\nIn addition to acting and writing original works, Fisher was one of the top script doctors in Hollywood, working on the screenplays of other writers.[52][53] She did uncredited polishes on movies in a 15-year stretch from 1991 to 2005. She was hired by George Lucas to polish scripts for his 1992 TV series The Young Indiana Jones Chronicles and the dialogue for the Star Wars prequel scripts.[52] Her expertise in this area was the reason she was chosen as one of the interviewers for the screenwriting documentary Dreams on Spec in 2007. In an interview in 2004, Fisher said she no longer did much script doctoring.[53]\n\nIn 2005, Women in Film & Video – DC recognized Fisher with the Women of Vision Award.[54]\n\nFisher also voiced Peter Griffin's boss, Angela, on the animated sitcom Family Guy[55] and wrote the introduction for a book of photographs titled Hollywood Moms, which was published in 2001.[56] Fisher published a sequel to Postcards, The Best Awful There Is, in 2004.\n\nFisher wrote and performed in her one-woman play Wishful Drinking at the Geffen Playhouse in Los Angeles from November 2006 to January 2007.[57] Her show then played throughout 2008 at the Berkeley Repertory Theater,[58] San Jose, the Hartford Stage,[59] the Arena Stage[60] and Boston.[61] Fisher published her autobiographical book, also titled Wishful Drinking, based on her successful play in December 2008 and embarked on a media tour. In 2009, Fisher returned to the stage with her play at the Seattle Repertory Theatre.[62] Wishful Drinking then opened on Broadway in New York at Studio 54 and played an extended run from October 2009 until January 2010.[63][64] In December 2009, Fisher's audiobook recording of Wishful Drinking earned her a nomination for a 2009 Grammy Award in the Best Spoken Word Album category.[65]\n\nFisher joined Turner Classic Movies host Robert Osborne on Saturday evenings in 2007 for The Essentials with informative and entertaining conversation on Hollywood's best films. She guest-starred in the episode titled \"Sex and Another City\" from season 3 of Sex and the City with Sarah Jessica Parker. On October 25, 2007, Fisher guest-starred as Rosemary Howard on the second-season episode of 30 Rock called \"Rosemary's Baby\", for which she received an Emmy Award nomination.[66] On April 28, 2008, she was a guest on Deal or No Deal.[67] In 2008, she also had a cameo as a doctor in the Star Wars-related comedy Fanboys.\n\n2010s [ edit ]\n\nIn 2010, HBO aired a feature-length documentary based on a special live performance of Fisher's Wishful Drinking stage production.[68] At the time of her death, Fisher had been preparing a sequel to the one-woman play.[69]\n\nFisher speaking at the 2012 San Diego Comic-Con International\n\nFisher appeared on the seventh season of Entourage in the summer of 2010.[68] She was among the featured performers at the Comedy Central Roast of Roseanne, which aired in August 2012. In her monologue, Fisher poked fun at her own mental illness,[70] and her fellow roasters' reliance on weight and menopause jokes.[71] Fisher joked that she had no idea why she was asked to roast Roseanne, until \"they explained that we were actually good friends, and that apparently we have worked together.\"[72] Host Jane Lynch joked that Fisher was there to add perspective to Roseanne's struggles with weight and drugs. Fellow roaster Wayne Brady poked fun at Fisher's career, saying she was the only celebrity \"whose action figure is worth more than you are.\"[73]\n\nShe was selected as a member of the main competition jury at the 2013 Venice Film Festival.[74] She filmed an appearance on the UK comedy panel show QI that was broadcast on December 25, 2014.[75] Fisher starred alongside Sharon Horgan and comedian Rob Delaney in the British comedy series Catastrophe, that was first broadcast on Channel 4 in the UK on January 19, 2015.[76][77] Her last appearance on Catastrophe, which aired in the UK on April 4, 2017, left many viewers in tears[78] and earned her a posthumous Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series nomination.\n\nIn a March 2013 interview following the announcement that a new trilogy of films would be produced, Fisher confirmed that she would reprise her role as Princess Leia in Episode VII of the Star Wars series. Fisher claimed that Leia was \"Elderly. She's in an intergalactic old folks' home [laughs]. I just think she would be just like she was before, only slower and less inclined to be up for the big battle.\"[79] After other media outlets reported this on March 6, 2013, her representative said the same day that Fisher was joking and that nothing was announced.[80]\n\nIn a January 2014 interview, Fisher confirmed her involvement and the involvement of the original cast in the upcoming sequels by saying \"as for the next Star Wars film, myself, Harrison Ford and Mark Hamill are expected to report to work in March or April. I'd like to wear my old cinnamon buns hairstyle again but with white hair. I think that would be funny.\"[81]\n\nIn March 2014, Fisher stated that she was moving to London for six months because that was where Star Wars Episode VII filming would take place.[82] On April 29, 2014, the cast for the new sequel was officially announced, and Fisher, along with Harrison Ford, Mark Hamill, Peter Mayhew, Anthony Daniels, and Kenny Baker, were all cast in their original roles for the film. Star Wars Episode VII, subtitled The Force Awakens, was released worldwide on December 18, 2015. Fisher was nominated for a 2016 Saturn Award for Best Supporting Actress for her portrayal.[83]\n\nIn Rogue One (2016), which predates the original trilogy, young versions of Leia and the character Grand Moff Tarkin appear through computer animation.[84][85] Fisher had completed filming her role as Leia in Star Wars: The Last Jedi (2017) shortly before her death.[86] Director Rian Johnson has stated that many of Fisher's own ideas made it into the film, and that she supplied a few of Leia's lines.[87] Variety reported following her death that Fisher was slated to appear in The Rise of Skywalker, and that Lucasfilm, Disney, and others involved with the film will need to find a way to address her death and what will become of her character.[88][89][90] In July 2018, it was announced that Fisher would appear posthumously in Star Wars: The Rise of Skywalker via unreleased footage from The Force Awakens.[10][11][91]\n\nFisher's memoir, The Princess Diarist, was released in November 2016. The book is based on diaries she kept while filming the original Star Wars trilogy in the late 1970s and early 1980s.[92][93] Her audiobook recording of the memoir earned her the 2018 Grammy Award for Best Spoken Word Album, awarded 13 months after her death.\n\nFisher and her mother appear in Bright Lights: Starring Carrie Fisher and Debbie Reynolds,[94] a 2016 documentary about their close relationship featuring interviews, photographs and home movies. The documentary premiered at the 2016 Cannes Film Festival and broadcast on January 7, 2017.[95]\n\nShe will be featured in the film Wonderwell with Rita Ora, which was filmed in the summer of 2016 in Italy.[96]\n\nPersonal life [ edit ]\n\nIn her 2016 autobiography The Princess Diarist, Fisher wrote that she and Harrison Ford had a three-month affair during the filming of Star Wars in 1976.[97]\n\nFisher met musician Paul Simon while filming Star Wars, and the pair dated from 1977 until 1983.[98] In 1980, she was briefly engaged to Canadian actor and comedian Dan Aykroyd, who proposed to her on the set of their film The Blues Brothers. She said: \"We had rings, we got blood tests, the whole shot. But then I got back together with Paul Simon.\"[99] Fisher was married to Simon from August 1983 to July 1984, and they dated again for a time after their divorce.[99] During their marriage, she appeared in Simon's music video for the song \"Rene and Georgette Magritte with Their Dog after the War\". Simon's song \"Hearts and Bones\" is about their romance.[100][101]\n\nShe subsequently had a relationship with Creative Artists Agency principal and talent agent Bryan Lourd. Their only child, Billie Lourd, was born in 1992. Eddie Fisher stated in his autobiography (Been There Done That) that his granddaughter's name is Catherine Fisher Lourd and her nickname is \"Billy.\" The couple's relationship ended when Lourd left to be in a homosexual relationship. In interviews, Fisher described Lourd as her second husband, but a 2004 profile of the actress and writer revealed that she and Lourd were never legally married.[102]\n\nFisher also had a close relationship with singer James Blunt. While working on his album Back to Bedlam in 2003, Blunt spent much of his time at Fisher's residence. When Vanity Fair's George Wayne asked Fisher if their relationship was sexual, she replied: \"Absolutely not, but I did become his therapist. He was a soldier. This boy has seen awful stuff. Every time James hears fireworks or anything like that, his heart beats faster, and he gets 'fight or flight.' You know, he comes from a long line of soldiers dating back to the 10th century. He would tell me these horrible stories. He was a captain, a reconnaissance soldier. I became James' therapist. So it would have been unethical to sleep with my patient.\"[34]\n\nOn February 26, 2005, R. Gregory \"Greg\" Stevens, a 42 year old lobbyist, was found dead in Fisher's California home. The final autopsy report listed the cause of death as \"cocaine and oxycodone use\" but added chronic, and apparently previously undiagnosed, heart disease as contributing factors. Media coverage of an initial autopsy report used the word \"overdose,\" but that wording is not in the final report.[103] In an interview, Fisher claimed that Stevens' ghost haunted her mansion, which unsettled her: \"I was a nut for a year\", she explained, \"and in that year I took drugs again.\"[34]\n\nFisher described herself as an \"enthusiastic agnostic who would be happy to be shown that there is a God.\"[104] She was raised Protestant,[105] but often attended Jewish services (her father's faith) with Orthodox friends.[106]\n\nIn 2016, Harvard College gave Fisher its Annual Outstanding Lifetime Achievement Award in Cultural Humanism, noting that \"her forthright activism and outspokenness about addiction, mental illness, and agnosticism have advanced public discourse on these issues with creativity and empathy.\"[7]\n\nFisher was a supporter and advocate for several causes, including women's advocacy,[107] animal rights,[108] and LGBT causes.[109] She was open about her experiences caring for friends who suffered from AIDS, contributing financially to various AIDS and HIV organizations, including hosting a benefit for amfAR, The Foundation for AIDS Research.[110] She also served as an honorary board member for the International Bipolar Foundation,[111] and, in 2014, received the Golden Heart Award for her work with The Midnight Mission.[112]\n\nShe was a spokesperson for Jenny Craig weight loss television ads that aired in January 2011.[113]\n\nBipolar disorder and drug use [ edit ]\n\nDuring appearances on 20/20 and The Secret Life of the Manic Depressive with Stephen Fry, Fisher publicly discussed her diagnosis of bipolar disorder and her addictions to cocaine and prescription medication.[114] She said her drug use was a form of self-medication; she used pain medication such as Percodan to \"dial down\" the manic aspect of her bipolar disorder.[115] She gave nicknames to her bipolar moods: Roy (\"the wild ride of a mood\") and Pam (\"who stands on the shore and sobs\").[116] \"Drugs made me feel more normal\", she explained to Psychology Today in 2001. \"They contained me.\"[115] She discussed her 2008 memoir Wishful Drinking and various topics in it with Matt Lauer on NBC's Today that same year, and also revealed that she would have turned down the role of Princess Leia had she realized it would give her the celebrity status that made her parents' lives difficult.[117] This interview was followed by a similar appearance on The Late Late Show with Craig Ferguson on December 12, 2008, where she discussed her electroconvulsive therapy (ECT) treatments.[118] At one point, she received ECT every six weeks to \"blow apart the cement\" in her brain.[119] In 2014, she said she was no longer receiving the treatment.[120]\n\nIn another interview, Fisher revealed that she used cocaine during the filming of The Empire Strikes Back. \"Slowly, I realized I was doing a bit more drugs than other people and losing my choice in the matter\", she noted.[121] In 1985, after months of sobriety, she accidentally overdosed on a combination of prescription medication and sleeping pills.[122] She was rushed to the hospital, creating the turn of events that led to much of the material in her novel and screenplay, Postcards from the Edge. Asked why she did not take on the role of her story's protagonist, named Suzanne, in the film version, Fisher remarked, \"I've already played Suzanne.\"[123]\n\nIn her later years, Fisher had an emotional support animal, a French Bulldog named Gary, whom she brought to numerous appearances and interviews.[124] Following her death, reports indicated that Fisher's daughter Billie Lourd would take care of Gary.[125]\n\nDeath [ edit ]\n\nAfter finishing the European leg of her book tour (her last TV appearance was on an episode of 8 Out of 10 Cats broadcast 21 December 2016) Fisher was on a commercial flight on December 23, 2016, from London to Los Angeles when she suffered a medical emergency around fifteen minutes before the aircraft landed.[126][a] A passenger seated near Fisher reported that she had stopped breathing;[129] another passenger performed CPR on Fisher until paramedics arrived at the scene. Emergency services in Los Angeles were contacted when the flight crew reported a passenger unresponsive prior to landing. Fisher was taken by ambulance to the Ronald Reagan UCLA Medical Center, where she was placed on a ventilator.[130][131]\n\nOn the morning of December 27, 2016, after being in intensive care for four days, Fisher died at the age of 60 at the UCLA Medical Center.[132] Fisher's daughter, Billie Lourd, confirmed her mother's death in a statement to the press.[130] Many of her co-stars and directors from Star Wars and other works also shared their thoughts on her death.[133]\n\nOn January 9, 2017, the Los Angeles County Department of Public Health issued a death certificate that stated \"cardiac arrest/deferred\" as the cause of death. More tests were expected.[134] In a June 16, 2017, news release, the Los Angeles County coroner's office said that the exact cause of death could not be determined, but sleep apnea and the buildup of fatty tissue on the walls of arteries were among the contributing factors.[1] A full report from June 19, 2017, stated that Fisher had cocaine in her system, as well as traces of heroin, other opiates, and MDMA. The report also stated that the investigation was unable to determine when she had taken the drugs, and whether they contributed to her death.[135] Her daughter Billie Lourd stated that Fisher \"battled drug addiction and mental illness her entire life [and] ultimately died of it. She was purposefully open in all of her work about the social stigmas surrounding these diseases... I know my Mom, she'd want her death to encourage people to be open about their struggles.\"[136]\n\nThe day after Fisher's death, her mother Debbie Reynolds suffered a stroke at the home of son Todd, where the family was planning Fisher's burial arrangements.[137] She was taken to Cedars-Sinai Medical Center, where she died later that afternoon.[138][139] According to Todd Fisher, Reynolds had said, \"I want to be with Carrie\" immediately prior to suffering the stroke.[140][141][b] On January 5, 2017, a joint private memorial was held for Fisher and Reynolds. Fisher was cremated while her mother was entombed. A portion of her ashes were laid to rest beside Reynolds in a crypt at Forest Lawn Memorial Park in Hollywood Hills.[143] The remainder of those ashes are held in a giant, novelty Prozac pill.[144]\n\nIn the absence of a star for Fisher on the Hollywood Walk of Fame, fans created their own memorial using a blank star. Along with flowers and candles, words put on the blank star read, \"Carrie Fisher / May The Force Be With You Always / Hope\".[3] In the video game Star Wars: The Old Republic, thousands of fans paid tribute to Fisher by gathering at House Organa on the planet Alderaan where Fisher's character in Star Wars resided.[145][146] Lightsaber vigils and similar events in Fisher's honor were held at various Alamo Drafthouse Cinemas theaters and other sites.[147][148][149] On January 6, 2017, the lights on Broadway in Manhattan were darkened for one minute in honor of Fisher and her mother.[150] Fisher and Reynolds were also both featured in the 89th Academy Awards In Memoriam segment.[151] On March 25, 2017, a public memorial for mother and daughter was held at the Hall of Liberty theater in Forest Lawn Memorial Park. The event was streamed live on Reynolds' website. On April 14, a special tribute to Fisher was held by Mark Hamill during the Star Wars Celebration in Orlando.[152] The 2017 film Star Wars: The Last Jedi was dedicated to her memory.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nBibliography [ edit ]\n\nNovels\n\nNon-fiction\n\nScreenplays\n\nPlays\n\nWishful Drinking , 2006 [185]\n\n, 2006 A Spy in the House of Me, 2008[186]\n\nAwards and nominations [ edit ]\n\nNotes [ edit ]\n\n^ [127] Several news outlets called the episode a \"massive heart attack\".[128] Radio transmissions and emergency calls included the phrases \"cardiac episode\" and \"cardiac arrest\"; witnesses believed they had seen Fisher having a heart attack.Several news outlets called the episode a \"massive heart attack\". ^ [142] In an interview with ABC News , Fisher later said that his mother \"didn't die of a broken heart. ... It wasn't that she was sitting around inconsolable—not at all. She simply said that she didn't get to see Carrie come back from London. She expressed how much she loved my sister. She then said she really wanted to be with Carrie—in those precise words—and within 15 minutes from that conversation, she faded out. Within 30 minutes, she technically was gone.\"", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Carrie_Fisher_memorial_star.jpg/170px-Carrie_Fisher_memorial_star.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Carrie_Fisher_2013-a_straightened.jpg/1200px-Carrie_Fisher_2013-a_straightened.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Carrie_Fisher_by_Gage_Skidmore.jpg/170px-Carrie_Fisher_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/SDCC_2015_-_Carrie_Fisher_%2819655495036%29_%28cropped%29.jpg/170px-SDCC_2015_-_Carrie_Fisher_%2819655495036%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Carrie_Fisher_and_Wim_Wenders.jpg/220px-Carrie_Fisher_and_Wim_Wenders.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Carrie_Fisher_2013-a_straightened.jpg/220px-Carrie_Fisher_2013-a_straightened.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Carrie_Fisher_2013-a_straightened.jpg/1200px-Carrie_Fisher_2013-a_straightened.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Carrie_Fisher", "title": "Carrie Fisher", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Carrie_Fisher_2013-a_straightened.jpg/1200px-Carrie_Fisher_2013-a_straightened.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}