{"url": "https://web.archive.org/web/20081022203056/http://www.plannedparenthoodaction.org/campaigns/john-mccain-his-own-words-135.htm", "text": "John McCain In His Own Words\n\nMcCain has voted consistently against women's health, and he supports overturning the landmark U.S. Supreme Court ruling, Roe v. Wade. These positions will make it difficult for him to win over moderate pro-choice voters in the general election.\n\n\n\nLearn more about McCain's positions on the following issues:\n\n\n\nIn February 2007, the Associated Press quoted McCain as saying, \"I do not support Roe versus Wade. It should be overturned.\"In May 2007, during an appearance on Meet the Press, Sen. McCain reiterated his support for overturning Roe v. Wade, saying, \"I have stated time after time after time that Roe v. Wade was a bad decision, that I support a woman \u0097 the, the rights of the unborn.\" He went on to say, \"My position has been consistently in my voting record, pro-life, and I continue to maintain that position and voting record.\"In 2005, McCain voted NO to allocate $100 million to expand access to preventive health care services that reduce the numbers of unintended and teen pregnancies and reduce the number of abortions. McCain opposed legislation requiring that abstinence-only programs be medically accurate and scientifically based.\n\nMcCain voted NO on legislation that would help reduce the number of teen pregnancies by providing funding for programs to teach comprehensive, medically accurate sexuality education and other programs to prevent unintended teen pregnancies.In 1990, McCain voted NO on legislation to extend the Title X federal family planning program, which provides low-income and uninsured women and families with health care services ranging from breast and cervical cancer screening to birth control.In 2003, McCain voted NO on legislation to improve the availability of contraceptives for women and to require insurance coverage of prescription birth control.In an interview aboard the \"Straight Talk Express,\" McCain struggled to answer questions about comprehensive sex education and HIV prevention. He also stated that he thought he supported \"the president's policy\" on sex education.In 2005, McCain voted NO on legislation to overturn the \"global gag rule,\" which bars non-U.S. nongovernmental organizations from receiving U.S. family planning assistance if the organization (using its own, non-U.S. funds) provides abortion services or information or advocates for pro-choice laws and policies in its own country.\n\nThe word is starting to get out about McCain's rigid anti-woman's health record, but more women across the country need to know the truth.", "images": ["https://web.archive.org/web/20081022203056im_/http://www.plannedparenthoodaction.org/images/hd-other-campaigns.gif", "https://web.archive.org/web/20081022203056im_/http://www.plannedparenthoodaction.org/images/hd-search.png", "https://web.archive.org/web/20081022203056im_/http://www.plannedparenthoodaction.org/images/080912-md-McCain.jpg", "https://web.archive.org/web/20081022203056im_/http://www.plannedparenthoodaction.org/images/hd-join-network.png"], "top_img": "https://web.archive.org/web/20081022203056im_/http://www.plannedparenthoodaction.org/images/080912-md-McCain.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Planned Parenthood® Action Center", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}