{"url": "https://www.vogue.com/article/anna-wintour-responds-mario-testino-bruce-weber-sexual-misconduct-allegations", "text": "Today, the New York Times reported allegations of sexual misconduct against photographers Mario Testino and Bruce Weber, which they have challenged or denied. Both have been contributors to Vogue and Condé Nast for many years. Below is a personal response from Vogue’s Editor in Chief and Condé Nast Artistic Director Anna Wintour.\n\nThe past several months have been an extraordinary time of reckoning and change, and I, like so many others, have been astonished by the courage of those who have come forward to tell stories of sexual misconduct. Abuse of power has gone on for too long in so many places—including in Washington, in Hollywood, in broadcasting, journalism, Silicon Valley, and last but not least, in fashion, where many young women and men have spoken up about manipulation and coercion on go-sees, on shoots, and in other working environments. I’m proud to say that Condé Nast is responding, here and internationally, with a new Code of Conduct, a set of guidelines for outside contributors which has emerged after bracingly honest discussions—with model advocates and agents, stylists, photographers, hair and makeup artists, set designers, and many of our own editors. The goal of these conversations has been to understand how we can create safe and positive environments for everyone we work with. These are some of the decisions we have made:\n\n*All models appearing in fashion shoots commissioned by Condé Nast must be 18 years of age or older. The only exceptions will be those appearing as themselves as part of a profile, news story, or similar content, and they will be required to have a chaperone on set at all times.\n\n*Alcohol will no longer be allowed on Condé Nast sets. Recreational drugs are not permitted.\n\n*Photographers will no longer be permitted to use a Condé Nast set for any work that is not commissioned or approved by the company.\n\n*Any shoot involving nudity, sheer clothing, lingerie, swimwear, simulated drug or alcohol use, or sexually suggestive poses must be approved in advance by the subject.\n\nEven as we stand with victims of abuse and misconduct, we must also hold a mirror up to ourselves—and ask if we are doing our utmost to protect those we work with so that unacceptable conduct never happens on our watch. Sometimes that means addressing the fact that such behavior can occur close to home. Today, allegations have been made against Bruce Weber and Mario Testino, stories that have been hard to hear and heartbreaking to confront. Both are personal friends of mine who have made extraordinary contributions to Vogue and many other titles at Condé Nast over the years, and both have issued objections or denials to what has emerged. I believe strongly in the value of remorse and forgiveness, but I take the allegations very seriously, and we at Condé Nast have decided to put our working relationship with both photographers on hold for the foreseeable future.", "images": ["https://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg", "https://assets.vogue.com/photos/5a5a47a5cb158d6c8c10bba8/16:9/w_1280,c_limit/00-social-image-vogue-logo.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg"], "top_img": "https://assets.vogue.com/photos/5a5a47a5cb158d6c8c10bba8/16:9/w_1280,c_limit/00-social-image-vogue-logo.jpg", "keywords": [], "authors": ["Condé Nast"], "canonical_link": "https://www.vogue.com/article/anna-wintour-responds-mario-testino-bruce-weber-sexual-misconduct-allegations", "title": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2020", "description": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations", "id": "5a5a466ef491070430bb458d", "keywords": "news,culture", "news_keywords": "news,culture", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a5a466ef491070430bb458d", "parsely-metadata": "{\"description\":\"Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations\",\"image-16-9\":\"https://assets.vogue.com/photos/5a5a47a181aeda0b83432853/16:9/w_1000,c_limit/00-promo-image-vogue-logo.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5a5a47a181aeda0b83432853/1:1/w_1000,c_limit/00-promo-image-vogue-logo.jpg\"}", "og": {"description": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations", "image": "https://assets.vogue.com/photos/5a5a47a5cb158d6c8c10bba8/16:9/w_1280,c_limit/00-social-image-vogue-logo.jpg", "site_name": "Vogue", "title": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations", "type": "article", "url": "https://www.vogue.com/article/anna-wintour-responds-mario-testino-bruce-weber-sexual-misconduct-allegations"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5a5a47a5cb158d6c8c10bba8/16:9/w_1280,c_limit/00-social-image-vogue-logo.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Anna Wintour Responds to Mario Testino and Bruce Weber Sexual Misconduct Allegations"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "https://www.vogue.com", "summary": ""}