{"url": "nypost.com/2018/02/03/janet-jacksons-family-is-still-mad-at-justin-timberlake/", "text": "When Justin Timberlake takes the stage at Super Bowl LII for the halftime show Sunday at US Bank Stadium in Minneapolis, there is at least one famous name who thinks he needs to make reparations.\n\n“If he’s such a gentleman, he’d make sure Janet [Jackson] is there,” Joseph Jackson told The Post.\n\nThe singer’s father is not the only one who thinks that Timberlake should make amends for Nipplegate — the infamous 2004 Super Bowl scandal that bruised Jackson’s career and her ego, after a planned stunt turned into a costume malfunction, leaving her bare breast exposed to 140 million viewers.\n\nSince it was announced that Timberlake would be performing at this year’s big game, Twitter has been alight with the #JusticeForJanet hashtag, as users call out the privilege suggested by Timberlake being asked to perform again, while Jackson was not.\n\nTimberlake has stayed mum about including Jackson in his halftime show, although he recently told Beats 1 host Zane Lowe that the two had “absolutely” made peace.\n\nBut Jackson family insiders say that just because the singer has forgiven Timberlake for not standing up for her when she was vilified for the incident, she hasn’t forgotten.\n\n“Justin’s solo career took off after that and Janet was blackballed,” one family member said. “He says they are good, but let’s see him prove it and bring her out.”\n\n‘Justin’s solo career took off after that and Janet was blackballed’\n\nSo what really happened in 2004 at Reliant Stadium (now NRG Stadium) in Houston? Conspiracy theories abound that the wardrobe “malfunction” was secretly planned by Jackson and Timberlake, but Jackson sources say that’s not the case.\n\nThey admit, however, that there was great mystery in the run-up to that halftime show.\n\n“When some of us went to Houston, we were told they were doing rehearsals,” said a relative. “People from the NFL and MTV were there so [we] thought we would get a preview of the performance.”\n\nInstead, security advised that final rehearsals were closed to everyone.\n\n“We had heard that they were experimenting on some sort of elaborate production,” the relative added.\n\nIt’s easy to forget that Jackson and Timberlake were not the only acts that night. Produced by MTV — who had previously organized the 2001 halftime event — the show first featured performances by Jessica Simpson, Diddy, Nelly and Kid Rock. Jackson took the stage with a marching band for her 1989 hit “Rhythm Nation,” then was joined by Timberlake for his “Rock Your Body.”\n\nThe two had a sexy, playful chemistry and had previously been rumored to have been hooking up. Jackson was in the early throes of a romance with producer Jermaine Dupri, but “everyone — including [her mother] Katherine knew the chemistry was there,” a Jackson insider said.\n\nYou could practically feel the heat as the two gyrated against each other onstage. At the end of the number, while singing “I’m gonna have you naked by the end of this song,” Timberlake reached across Jackson’s chest, grabbing her right breast and ripping off part of her top — exposing her bare breast, the nipple completely covered by a large silver sun attached by a piercing.\n\nLooking back at video of the incident, it’s hard to make out Jackson’s expression immediately after, as her face was mostly obscured by her hair, but she quickly covered herself with her hand. In photos from the event, Timberlake looks shell-shocked.\n\nJackson later explained to her mother that the cups of her top had been attached with a Velcro-like fabric that could easily be manipulated or opened to reveal a red lace bra underneath, according to the family source.\n\nThe source confirmed that Jackson and Timberlake had hatched a plan for him to rip off the top’s cup, but didn’t alert MTV, CBS, the NFL or even their backup dancers.\n\n“They were like, let’s make this real and show the meaning behind [the song],” the Jackson insider said.\n\n“Her red bra was all that was supposed to show, no nipple, no exposure,” the insider said. “It was meant to be a little racy, but nobody meant for her breast to show. It became a big deal because Justin grabbed the costume much too hard and, instead of pulling the one small part, he tore the bra part, too.” (Representatives for Timberlake did not return calls for comment.)\n\nBehind the scenes, there was confusion, as MTV executive producer Salli Frattini, recalled to ESPN The Magazine in 2014: “There was lots of chaos in the [production truck, and we played it back and we were like, ‘Oh, s – – t. What just happened?’ ”\n\nAt first, Jackson — who flew out of Houston that night — had no idea just how big the fallout would be. “At that point, she was just a little upset — a little troubled that her breast was seen in front of the biggest audience in history,” the family member recalled.\n\nBut when she exited the stage, no one — including reps from AOL and the NFL, as well as Nelly — would look at her.\n\n“No one said anything when she left the stage,” the family member added. “It was like, ‘Uh-oh, we’ve got trouble.’”\n\nBefore the game was over and the Patriots had beaten the Panthers, 32-29, Jackson’s representative had issued the first statement, explaining that Timberlake was supposed to have pulled off the bustier cup only, not the bra itself.\n\nThe NFL responded quickly to the incident, making clear it was “disappointed.” The league’s then executive vice president, Joe Browne, said “it’s unlikely that MTV will produce another Super Bowl halftime.” (Indeed, the network has not.)\n\nMTV released a statement claiming that “the tearing of Janet Jackson’s costume was unrehearsed, unplanned, completely unintentional and was inconsistent with assurances we had about the content of the performance.” The network’s then CEO, Tom Freston, alleged that Jackson alone had “engineered” the stunt.\n\nOver the next week, some 200,000 viewers reportedly complained to the FCC, which later fined CBS $550,000; the decision was tied up in the court system for eight years before finally being tossed out in favor of CBS.\n\nAOL, which had sponsored the halftime event, asked for a refund on its $10 million investment. Advertiser McDonald’s called the incident “inappropriate” — but did not drop Timberlake as its “I’m lovin’ it” spokesman.\n\nAt first, Timberlake was flippant about Nipplegate, telling Access Hollywood that, “We love giving you all something to talk about.” But he changed his tune shortly after that, saying, “I’m sorry if anyone was offended.”\n\nJackson meanwhile, issued both written and taped statements, absolving MTV, CBS and the NFL and saying, “It was not my intention that it go as far as it did.”\n\nBut the damage was already done.\n\nThe weekend after the Super Bowl, Timberlake and Jackson had been scheduled to appear at the 46th Annual Grammy Awards on CBS, where both were slated to perform. Timberlake’s performance happened. Jackson, who was supposed to lead a tribute to Luther Vandross, was allegedly uninvited.\n\nHer punishment didn’t end there.\n\nWhen Jackson’s “Damita Jo” album came out two months after the 2004 Super Bowl, she was facing a mountain of obstacles. As Rolling Stone reported, Viacom — the parent company then of both CBS and MTV — [hit] back . . . by essentially blacklisting her, keeping her music videos off their properties MTV, VH1 and radio stations under their umbrella. The blacklist [spread] to include non-Viacom media entities as well.”\n\nJackson told relatives that she was embarrassed and feared she’d never perform again.\n\n“Radio stations wouldn’t play her music. Her album, which was great, suffered,” the family member recalled. Billboard reported that “Damita Jo” was her worst-selling album over a 20-year span, despite receiving largely favorable reviews.\n\nSo devastating was the backlash, Jackson stopped attending family gatherings and shut out those closest to her. “She’d drive by [the family’s Encino estate] in her bright yellow Jeep. We’d see her but she’d keep going,” a second relative said. “It was like she didn’t know what to do.”\n\nLoved ones and friends, including filmmaker Tyler Perry, became concerned about Jackson’s health.\n\n‘MTV ought to be ashamed, my family helped build MTV . . . and this is the thanks we get.’ - Jermaine Jackson\n\n“She’s going into depression, she’s not herself,” her brother Jermaine said at the time. “Justin needs to hold a press conference and condemn CBS, MTV and everyone else for what they’re doing to Janet. MTV ought to be ashamed, my family helped build MTV . . . and this is the thanks we get.”\n\nIt took two years before Timberlake would tell MTV News: “If you consider it 50-50, then I probably got 10 percent of the blame. I think America is harsher on women. I think America is unfairly harsh on ethnic people.”\n\nNot long after that, Jackson admitted to Oprah Winfrey that while Timberlake had reached out to her, she wasn’t ready to reply.\n\n“Friendship is very important to me, and certain things you just don’t do to friends,” she said. “In my own time, I’ll give him a call.”\n\nWhen Winfrey asked if Timberlake had “left [her] out there hanging,” Jackson replied, “To a certain degree.” She added that all the blame had been put on “me, as opposed to us.”\n\nOn Saturday, Jackson issued a statement saying there would be no halftime reunion.\n\n“To put to rest any speculation or rumors as to whether I will be performing at the Super Bowl tomorrow, I will not,” she said.\n\nTo this day, Jackson’s Waterloo has shaped the culture in unexpected ways.\n\nAs a result of the incident, the FCC instituted a five-second tape delay on Super Bowl performances, allowing censors time to catch offensive material.\n\nCoincidentally or not, no women appeared again at the halftime show until 2011 when the Black Eyed Peas — including Fergie — took the stage.\n\nMost remarkably, we have Nipplegate to thank for YouTube. Co-founder Jawed Karim told USA Today that he was inspired to create the video site in 2005 after not being able to find any footage of the incident online.\n\nSome who condemned Jackson have finally admitted it was too much.\n\nIn 2014, former FCC chairman Michael Powell told ESPN the Magazine that the committee had acted “unfairly” toward the singer. “It all turned into being about her,” Powell said. “In reality, if you slow the thing down, it’s Justin ripping off her breastplate.”\n\nAs for Timberlake, he recently said that he “stumbled through” his handling of the situation. Jackson family insiders reveal he had to ask a few times before Jackson finally agreed to quietly meet up with him a few years ago in Los Angeles. After talking for a while, the two patched up their differences and sealed their friendship with a kiss and a long embrace.\n\nThat said, however, the Jackson insider explained that, “Publicly, Janet will tell everyone she’s forgiven Justin, but privately, she’s reluctant to trust him. He’s reached out to her about doing some things together but I don’t think she’s ready for that. Is she still angry? No. She doesn’t wish him any ill will. Does she still think about it? Not all of the time, but certainly since he’s doing the halftime show again, it’s definitely been a dinner table topic.”\n\nThe insider said that more than anything, Jackson is disappointed. “[Timberlake] used to dig her but when it came to supporting her after what happened, he disappeared. That’s not too manly and she didn’t deserve that. Even if she’s chosen to forgive him, it doesn’t mean she’s gotten past how he didn’t man up.\n\n“We believe [the Super Bowl is a chance for him to] show her . . . and the world that he was wrong. He should insist that she come out and do something even if it’s just him apologizing publicly in front of the whole stadium. It’s not too late.”", "images": ["https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=618&h=410&crop=1", "https://thenypost.files.wordpress.com/2020/04/online-piano-class.jpg?quality=90&strip=all&w=300&h=200&crop=1", "https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=1200", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["February"], "canonical_link": "https://nypost.com/2018/02/03/janet-jacksons-family-is-still-mad-at-justin-timberlake/", "title": "Janet Jackson’s family is still mad at Justin Timberlake", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "When Justin Timberlake takes the stage at Super Bowl LII for the halftime show Sunday at US Bank Stadium in Minneapolis, there is at least one famous name who...", "generator": "WordPress.com", "og": {"type": "article", "title": "Janet Jackson’s family is still mad at Justin Timberlake", "url": "https://nypost.com/2018/02/03/janet-jacksons-family-is-still-mad-at-justin-timberlake/", "description": "When Justin Timberlake takes the stage at Super Bowl LII for the halftime show Sunday at US Bank Stadium in Minneapolis, there is at least one famous name who thinks he needs to make reparations. “…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2018-02-03T16:21:28+00:00", "modified_time": "2018-02-04T04:03:38+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Janet Jackson’s family is still mad at Justin Timberlake"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2018/01/superbowl1.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Janet Jackson's family is still mad at Justin Timberlake", "description": "When Justin Timberlake takes the stage at Super Bowl LII for the halftime show Sunday at US Bank Stadium in Minneapolis, there is at least one famous name who thinks he needs to make"}, "fb": {"pages": 225343690812937}, "nypost-section": "Entertainment", "parsely-metadata": "{\"post_id\":\"nypost-12225058\"}", "keywords": "Entertainment,aol,cbs,janet jackson,justin timberlake,mtv,super bowl,viacom,youtube", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/CeVkKoSgkTg?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&start=68&wmode=transparent"], "publish_date": 1517587200.0, "source": "http://nypost.com", "summary": ""}