{"url": "https://www.vulture.com/2017/09/every-aca-pun-in-the-pitch-perfect-movies.html", "text": "Pitch Perfect 2. Photo: Universal Pictures\n\nThe trailer for the third and final (I’ll believe when I see it) installment in the Pitch Perfect franchise has finally arrived — and with it, immense waves of Pitch Perfect nostalgia. (Isn’t it wonderful to be alive at a time when a “Pitch Perfect franchise” is a real thing?) According to that new trailer, Pitch Perfect 3 promises more of what we’ve all come to expect from the Pitch Perfect movies: organized nerd singing, mash-ups of songs we didn’t know we needed but now can’t live without (hello “Wake Me Up” and “Zombie”), and, of course, the inexplicable but always adorable use of “aca” as a prefix. In honor of this beloved aca-tradition, Vulture has gone ahead and made a list of all the plays on “aca” and “pitch” in the franchise thus far. No, this is not a joke. We’re Dixie Chick serious.\n\nPitch Perfect\n\nThe seminal movie about college students making sweet, sweet music with their mouths, and the bonds of sisterhood overcoming any obstacle — even when that obstacle is a gorgeous solo from Ben Platt. The original Pitch Perfect introduces us to the world of competitive collegiate a cappella singing through Anna Kendrick’s Beca, a freshman who pretty much hates everything and is honestly, a real bitch, until she meets the Barden Bellas and learns that singing covers and having a solid group of lady friends is good for the soul. She also learns — thanks to Anna Camp’s Aubrey — that a cappella is very serious, and to show that seriousness, a person should use “aca” as a prefix or “pitch” in a punny way whenever possible.\n\n“Aca-scuse me?”\n\nThere’s nothing like the first time, is there? This is aca-enthusiast Aubrey to Beca after Beca makes fun of a cappella during the Activities Fair. It is laced with as much attitude as you imagine.\n\n“My fellow aca-people, we will not let egotistical, big-headed garbage dirtballs — whoever you may be — get in our way. I promise you we will return to the ICCAs and finish what we started last year.”\n\nIt’s time to be honest, pitches: Aubrey is the best character in the Pitch Perfect franchise and she never gets the recognition she deserves. Don’t aca-at me.\n\n“Well, well, well, look who’s in treble!”\n\nThis isn’t “aca” or “pitch” related, but of all the puns the Treblemakers get out of their group name, this one, used on initiation night, is the best. It’s worth it for Adam Devine’s line reading alone. Bumper is the worst, but also kind of the best, right?\n\n“Ladies, welcome to aca-initiation night.”\n\nAubrey has things to do and covers of songs to arrange, she cannot waste the syllables on “a cappella initiation night.” This usage is simply about brevity.\n\n“You’re one of those a cappella girls. I’m one of those a cappella boys. And we’re gonna have aca-children. It’s inevitable.”\n\nSlow your roll, Jesse! The way to any college girl’s heart is not to immediately talk about having children, aca or not.\n\n“Hands in aca-bitches!”\n\nAubrey to the Bellas for their first group huddle. “Aca” is a very versatile prefix, used here as a term of endearment.\n\n“I know you have a toner for Jesse.”\n\nAh, yes, the moment in which we all learned that “toner” is the term for a “musical boner,” and also learned that “musical boner” is a thing, I guess. Never tell me Pitch Perfect isn’t educational.\n\n“I think we’re gonna be aca-awesome.”\n\nChloe is the yin to Aubrey’s yang, and when Aubrey is freaking out about how unprepared the Bellas are for their gig at the Sigma Beta Theta Fall Mixer, Chloe knows to talk her friend off the ledge via use of her favorite prefix. Of course, they go on to bomb the Sigma Beta Theta Fall Mixer, but that is neither here nor there. Also, them being so bad gives us one of the greatest lines in the movie: “This makes my beer taste bad.”\n\n“Aca-scuse me?”\n\nYup, it’s your girl Aubrey, back with her standard reply to anyone who threatens her a cappella way of life. This time, it’s after Chloe suggests that Beca may be onto something when she complains about the Bellas never trying anything new. Beca is right, but there are more tactful ways to go about it. So yes, Chloe and Beca, ACA-SCUSE YOU.\n\n“The Sockapellas”\n\n“Proving that it doesn’t get better for everyone after high school.”\n\n“Aca-scuse me?”\n\n“Aca-believe it.”\n\nHere’s the sitch: The Bellas are on their way to the ICCA Semi-Finals, but run out of gas …because Fat Amy forgot to fill the tank after being attacked by a burrito at the hands of her true love, Bumper. Aubrey has every right to “aca-scuse” her teammate, and honestly, I don’t appreciate Fat Amy’s tone here. Is she making light of the “aca” prefix?\n\n“You guys are gonna get pitch-slapped so hard, your man boobs are gonna concave.”\n\nHere’s Fat Amy with a great burn for Bumper, after he teases the team over their dated semi-finals set list. For a movie called Pitch Perfect, they do not use “pitch” wordplay nearly enough. It fits into so many phrases! #PitchPlease\n\n“Aca-huddle, now!”\n\nThis is, of course, Aubrey, signaling to us that aca-huddles are way more serious than normal huddles.\n\n“The aca-gods have looked down on us and they have given us a second chance.”\n\nI wish Aubrey would go more into detail as to who these “aca-gods” are once she receives news that the Bellas have won a spot at Nationals, thanks to a technicality. Are the “aca-gods” Pentatonix?\n\n“Aca-awkward.”\n\nYes, Fat Amy, it is “aca-awkward” when Aubrey tells her BFF Chloe to get her head out of her ass because “it’s not a hat,” in front of the whole group. Excellent word choice.\n\n“Shut your eyes and get rid of all the aca-politics.”\n\nJohn and Gail are back at Nationals, and they really know how to set the scene. Am I the only one who cries throughout the entire Bella finale performance?\n\n“Listen up, aca-ballers!”\n\nYour final “aca” fix of the film comes courtesy of Christopher Mintz-Plasse, the saddest audition coordinator there ever was. Let this dude sing! LET HIM LIVE.\n\nPitch Perfect 2\n\nPitch Perfect 2 doubles down on the Fat Amy jokes, but, surprisingly, not so much on the “aca” wordplay. The sequel sees our girls prepare for and then (of course) win the A Cappella World Championships. The Bellas main competition this go-around comes from Das Sound Machine, a German a cappella group full of superhumans who are no doubt better than all of us at everything. Pitch Perfect 2 also features a very cute subplot about Benji falling for the newest Bella, Emily (Hailee Steinfeld), and reminds us that no one would hate it if the Pitch Perfect franchise was about the power of lady friendship first, then Benji’s revenge second.\n\nThe “aca” prefix is used sparingly, but for the most part, in much more creative ways than in the first film; they don’t blow their aca-wad all at once.\n\n“Let’s Talk-apella”\n\nEveryone’s favorite a cappella commentators, Gail and John, are back — and this time with a podcast called Let’s Talk-apella. Honestly, that’s a great name. How has it not been taken before? Surely, there must be people clamoring for an a cappella–based podcast, right?\n\n“Those deutsch-bags!”\n\nFat Amy uses this clever wordplay to cut to the core of the Bellas German nemeses. Moments before, she praises the musical legacy of David Hasselhoff, so don’t go thinking Fat Amy has a vendetta against all Germans. It’s just this one, very specific, very good-looking group of Germans who want to crush her friends’ dreams of making music with their mouths.\n\n“O-M-aca-G!”\n\nBaby Bella Emily fits right in with her new a cappella sisters: She is also a complete weirdo.\n\n“Aca-wiedersehen, bitches!”\n\nOne of the best running gags of Pitch Perfect 2 is that Anna Kendrick’s Beca is completely smitten with the leaders of Das Sound Machine, even when she wants to be angry. She attempts to “aca” her way out of a confrontation with her enemies/crushes, and although she gets props for aca-ing in a second language, this does nothing to help the Bella’s cause.\n\n“You are such a disa-aca-pointment.”\n\nGreen Bay Packers offensive tackle David Bakhtiari says this to teammate Clay Matthews after Matthews blanks during the country song round in an underground a cappella league riff-off. Is that the greatest sentence ever written?\n\n“I almost burnt to death because of you aca-bitches.”\n\nAfter another disastrous performance, Cynthia Rose knows there’s nothing like a classic to really insult your friends. Classics are classics for a reason.\n\n“I’m not Copen-hating this place.”\n\nIt’s not an aca-word, but as the Bellas arrive in Denmark for the A Cappella World Championships, one has to wonder: Shouldn’t this be Copenhagen’s tourism slogan?\n\n“Tonight, groups from around the globe duke it out for the title of Aca-World Champions.”\n\nI mean, this one seems pretty valid.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2017/09/26/26-pitch-perfect-2.w1200.h630.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/09/26/26-pitch-perfect-2.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/26/26-pitch-perfect-2.w1200.h630.jpg", "keywords": [], "authors": ["Maggie Fremont"], "canonical_link": "https://www.vulture.com/2017/09/every-aca-pun-in-the-pitch-perfect-movies.html", "title": "Every ‘Aca’ Pun in the Pitch Perfect Movies", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Every Time ‘Aca’ Is Used As a Prefix in the Pitch Perfect Movies", "url": "https://www.vulture.com/2017/09/every-aca-pun-in-the-pitch-perfect-movies.html", "description": "We’re Dixie Chick serious about this.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/26/26-pitch-perfect-2.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Every ‘Aca’ Pun in the Pitch Perfect Movies", "description": "We’re Dixie Chick serious about this.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/09/26/26-pitch-perfect-2.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-09-26T21:13:02.600Z", "tag": "movies, pitch perfect, pitch perfect 2, pitch perfect 3, anna kendrick", "publisher": "https://www.facebook.com/Vulture"}, "description": "A list of every pun used in the Pitch Perfect movie franchise, starring Anna Kendrick and Anna Camp.", "sailthru.tags": "movies, pitch perfect, pitch perfect 2, pitch perfect 3, anna kendrick", "author": "Maggie Fremont", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1506460382.6, "source": "https://www.vulture.com", "summary": ""}