{"url": "https://people.com/home/jeff-lewis-says-flipping-out-hasnt-officially-been-canceled-despite-his-contract-expiring/", "text": "Image zoom David Livingston/Getty Images\n\nJeff Lewis’ contract with Bravo may have allegedly expired, but his hit reality show, Flipping Out, isn’t going anywhere — for now, he says.\n\nThe outspoken reality star revealed on his SiriusXM radio show Jeff Lewis Live! that Bravo has yet to pull the plug on Flipping Out — which is currently airing its eleventh season.\n\nGet push notifications with news, features and more.\n\n“Just to clarify: the show has not been officially cancelled,” he said on Tuesday’s broadcast. “Usually what happens is, they will air the show and they air the season and then everyone gets together at Bravo and they collect all the ratings and then they make a decision. As far as I know, no one has made a decision.”\n\nReps for Bravo confirm to PEOPLE that “nothing official has been determined” regarding Flipping Out. They had no comment on the status of Lewis’s contract, which expired on October 15.\n\nRELATED: Flipping Out’s Jeff Lewis Lists $8 Million Hollywood House He First Bought for $860,000\n\nImage zoom Gage Edward, Jeff Lewis and Jenni Pulos Bravo\n\nThough Lewis has yet to hear anything, he recognizes the timing hasn’t been great for a renewal.\n\nIn recent months, the Jeff Lewis Design owner has been at the center of two major controversies. He came under fire in June, when the surrogate who carried his and partner Gage Edward’s daughter Monroe, now almost 2, sued the couple, Bravo and Flipping Out’s production company, Authentic Entertainment, for allegedly filming her delivery without her permission, among other issues.\n\nThen in September, just before Flipping Out‘s premiere, PEOPLE exclusively reported that Lewis had parted ways with his friend of nearly 20 years and co-star Jenni Pulos, after a huge fight that he says was caught on film and will be part of the show’s current season. Lewis claims Pulos reported him to Bravo for “abuse and victimization” and later wrongful termination.\n\nImage zoom Megan Weaver, Jeff Lewis and Jenni Pulos on Flipping Out Nicole Wilder/Bravo/Getty Images\n\n“I understand the timing was not right for Bravo,” Lewis said on Jeff Lewis Live. “My contract happens to expire before the rest of the season airs. I would think you might want to air the season a little sooner before the contract expires so that way you can decide whether or not you want to pick up the show.”\n\nHe also claimed that Bravo had previously picked up Flipping Out in the middle of airing a season. “There have been times when they picked up the show right after episode 3 airs,” he said. “Sometimes they do it quickly, sometimes not as quickly. As far as I know, there’s been no definitive answer.”\n\nRELATED VIDEO: Jeff Lewis Introduces His New Intern: His Daughter Monroe!\n\nStill, Lewis is not holding his breath. “They’re also not going to send an email and say, ‘We’ve decided not to pick up your show.’ They just go dark as far as I know,” he said. “It would be nice to hear from an upper level executive, with flowers or something.”\n\n“It is personal,” he later admitted of the network allowing the lapse. “My feelings are hurt. I’m not feeling important to them right now. I’ve been with them for 11 years. I’ve done three shows for them. I’ve worked my ass off for them, and I’m not feeling important because they don’t seem to care that my contract is expired and that tomorrow I could be somewhere else.”\n\n“You don’t give a s—,” he said. “And considering right now, they’re launching this whole Bravo Home [initiative] — which I think is a great idea. Is this the time to let your anchor remodeling show lapse?”\n\nImage zoom Jeff Lewis Jeff Lewis Instagram\n\nLewis has been open about the fact that his Bravo contract was expiring on Oct. 15. On Monday, he posted a photo of himself on Instagram showing him standing next to a white board bearing his photo to which he’d added the words “Contract EXPIRED!” written across the top, with a big red X drawn across his face.\n\nNo matter what happens, Lewis said on Jeff Lewis Live that he believes that “when one door closes, another door opens” and he “will manifest somewhere else.”\n\nAnd, he confessed, he did take at least one “big meeting,” claiming that he did not have a non-compete clause in his contract. “I want people to know that I’m a free agent, absolutely,” Lewis said.\n\nImage zoom Jeff Lewis Daniel Zuchnik/WireImage\n\nBut don’t think that means Lewis wouldn’t want to stay at Bravo if he could.\n\n“I do really like everybody at Bravo,” he said, reading a text message exchange he had with Bravo boss Andy Cohen. “I’m always open to working with and for Bravo. There is no ill will from me.”\n\n“I would not be here sitting in this room if it weren’t for them,” Lewis added, separately. “I have absolutely nothing but gratitude for them and I understand what they’ve done for me. If it’s over, it’s over and I can hopefully land somewhere else.”\n\nFlipping Out airs Tuesdays (10 p.m. ET) on Bravo. Jeff Lewis Live airs Tuesdays, Thursdays, and Fridays (11 a.m. ET) on SiriusXM’s Radio Andy (Ch. 102).", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-contract-instagram.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fjeff-lewis-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fgettyimages-803400742-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fnup_183147_8000-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/home/jeff-lewis-says-flipping-out-hasnt-officially-been-canceled-despite-his-contract-expiring/", "title": "Jeff Lewis Says Flipping Out 'Hasn't Officially Been Canceled'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Flipping Out,Jeff Lewis,News", "news_keywords": "Flipping Out,Jeff Lewis,News", "description": "Jeff Lewis' contract with Bravo may have allegedly expired, but his hit reality show Flipping Out apparently isn't going anywhere for now", "og": {"title": "Jeff Lewis Says Flipping Out 'Hasn't Officially Been Canceled' Despite His Contract's Expiration", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/home/jeff-lewis-says-flipping-out-hasnt-officially-been-canceled-despite-his-contract-expiring/", "description": "Jeff Lewis’ contract with Bravo may have allegedly expired, but his hit reality show,&nbsp;Flipping Out,&nbsp;isn’t going anywhere — for now, he says. The outspoken reality&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/home/jeff-lewis-says-flipping-out-hasnt-officially-been-canceled-despite-his-contract-expiring/", "description": "Jeff Lewis' contract with Bravo may have allegedly expired, but his hit reality show Flipping Out apparently isn't going anywhere for now", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/home/jeff-lewis-says-flipping-out-hasnt-officially-been-canceled-despite-his-contract-expiring/", "title": "Jeff Lewis Says Flipping Out 'Hasn't Officially Been Canceled' Despite His Contract's Expiration", "description": "Jeff Lewis' contract with Bravo may have allegedly expired, but his hit reality show Flipping Out apparently isn't going anywhere for now", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjeff-lewis-tout.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}