{"url": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale", "text": "Not to be confused with The Handmaiden\n\n1985 novel by Margaret Atwood\n\nThe Handmaid's Tale, originally published in 1985, is a dystopian novel[6] written by Canadian author Margaret Atwood. It is set in a near-future New England, in a totalitarian state, known as Gilead, resembling a theonomy that overthrows the United States government.[7]\n\nThe Handmaid's Tale explores themes of subjugated women in a patriarchal society and the various means by which these women resist and attempt to gain individuality and independence. The novel's title echoes the component parts of Geoffrey Chaucer's The Canterbury Tales, which is a series of connected stories (\"The Merchant's Tale\", \"The Parson's Tale\", etc.).[8]\n\nThe Handmaid's Tale is structured into two parts, by night and by other various events. This novel can be interpreted as a double narrative, Offred's tale and the handmaids' tales. The night sections are solely about Offred, and the other sections (shopping, waiting room, household, etc.) are the stories that describe the possible life of every handmaid, though from the perspective of Offred. In many of these sections, Offred jumps between past and present as she retells the events leading up to the fall of women's rights and the current details of the life that she now lives.\n\nThe Handmaid's Tale won the 1985 Governor General's Award and the first Arthur C. Clarke Award in 1987; it was also nominated for the 1986 Nebula Award, the 1986 Booker Prize, and the 1987 Prometheus Award. The book has been adapted into a 1990 film, a 2000 opera, a 2017 television series, and other media.\n\nIn 2019, a sequel novel, The Testaments, was published.\n\nPlot summary [ edit ]\n\nAfter a staged attack that killed the President of the United States and most of Congress, a radical political group called the \"Sons of Jacob\" used quasi-Christian ideology to launch a revolution. The United States Constitution was suspended, newspapers were censored, and what was formerly the United States of America was changed into a military dictatorship resembling a theonomy, known as the Republic of Gilead.[7] The new regime moved quickly to consolidate its power, overtaking all other religious groups, including traditional Christian denominations. In addition, the regime reorganized society using a peculiar interpretation of some Old Testament ideas, and a new militarized, hierarchical model of social and religious fanaticism among its newly created social classes. Above all, the biggest change is the severe limitation of people's rights, especially those of women, who are not allowed to read, write, own property or handle money. Most significantly, women are deprived of control over their own reproductive functions.\n\nThe story is told in first-person narration by a woman named Offred. In this era of declining birth rates due to increasing infertility caused by environmental pollution and radiation, she is one of few fertile women remaining. Therefore, she is forcibly assigned to produce children for the \"Commanders\", the ruling class of men, and is known as a \"Handmaid\" based on the biblical story of Rachel and her handmaid Bilhah. Apart from Handmaids, other women are also classed socially and follow a strict dress code, ranked highest to lowest: the Commanders' Wives in blue, the Handmaids in red with white veils around their faces, the Aunts (who train and indoctrinate the Handmaids) in brown, the Marthas (cooks and maids) in green, \"Econowives\" who handle everything in the domestic sphere in stripes, young, unmarried girls in white, and widows in black.\n\nOffred details her life starting with her third assignment as a Handmaid to a Commander. Interspersed with her narratives of her present-day experiences are flashbacks of her life before and during the beginning of the revolution, when she finds she has lost all autonomy to her husband, their failed attempt to escape to Canada, her indoctrination into life as a Handmaid by the government-trained Aunts, and the successful escape of her friend Moira. At her new home, she is treated poorly by a woman called Serena Joy, the Commander's wife and a former Christian media personality, who supported women's domesticity and subordinate role well before Gilead was established. To Offred's surprise, the Commander requests to see her outside of the \"Ceremony\", a sexual ritual obligatory for handmaids and intended to result in conception in the presence of his wife. The two begin an illegal relationship where they play Scrabble and Offred is allowed to ask favours of him, whether in terms of information or material items. Finally, he gives her lingerie and takes her to a government-run brothel called Jezebel's meant to add variety to men's sex lives, which (as claimed by the Commander) is necessary. Offred unexpectedly encounters Moira there, with her will broken, and she learns that those who are found breaking the law are sent to the Colonies to clean up toxic waste or are allowed to work at Jezebel's as punishment.\n\nIn the days between her visits to the Commander, Offred also learns from her shopping partner, a woman called Ofglen, of the Mayday resistance, an underground network working to overthrow the Republic of Gilead. Not knowing of Offred's criminal acts with her husband, Serena begins to suspect that the Commander is infertile, and arranges for Offred to begin a covert sexual relationship with Nick, the Commander's personal servant. After their initial sexual encounter, Offred and Nick begin to meet on their own initiative as well, with Offred discovering that she enjoys these intimate moments despite memories of her husband, and shares potentially dangerous information about her past with him. However, shortly after, Ofglen disappears (reported as a suicide), and Serena finds evidence of the relationship between Offred and the Commander, which causes Offred to contemplate suicide.\n\nOffred tells Nick that she thinks she is pregnant. Shortly afterward, men arrive at the house wearing the uniform of the secret police, the Eyes of God, known informally as \"the Eyes\", to take her away. As she is led to a waiting van, Nick tells her to trust him and go with the men. It is unclear whether the men are actually Eyes, or members of the Mayday resistance, an underground network to overthrow the Republic of Gilead. Offred is still unsure if Nick is a member of Mayday or an Eye posing as one, and does not know if leaving will result in her escape or her capture. Ultimately, she enters the van with her future uncertain.\n\nThe novel concludes with a metafictional epilogue, described as a partial transcript of an international historical association conference taking place in the year 2195. The keynote speaker explains that Offred's account of the events of the novel was recorded onto cassette tapes later found and transcribed by historians studying what is then called \"the Gilead Period.\" It is implied that, following the collapse of the theonomic Republic of Gilead, a more equal society re-emerged with a restoration of normal rights for women and freedom of religion.[9] However, the future setting still presents some issues regarding attitudes towards women, as seen when Professor Peixoto makes a sexist joke about Professor Maryann Crescent Moon, causing laughter from the audience, and highlighting his ignorance toward the situation.\n\nBackground [ edit ]\n\nFitting with her claims that The Handmaid's Tale is a work of speculative fiction, not science fiction, Atwood's novel offers a satirical view of various social, political, and religious trends of the United States in the 1980s. Her motivation for writing the novel was that in the 1980s, the religious right was discussing what they would do with/to women if they took power, including the Moral Majority, Focus on the Family, the Christian Coalition and the Ronald Reagan administration.[10] Further, Atwood questions what would happen if these trends, and especially \"casually held attitudes about women\" were taken to their logical end.[11] Atwood continues to argue that all of the scenarios offered in The Handmaid's Tale have actually occurred in real life—in an interview she gave regarding Oryx and Crake, Atwood maintains that \"As with The Handmaid's Tale, I didn't put in anything that we haven't already done, we're not already doing, we're seriously trying to do, coupled with trends that are already in progress... So all of those things are real, and therefore the amount of pure invention is close to nil.\"[12] Atwood was also known to carry around newspaper clippings to her various interviews to support her fiction's basis in reality.[13] Atwood has explained that The Handmaid's Tale is a response to those who claim the oppressive, totalitarian, and religious governments that have taken hold in other countries throughout the years \"can't happen here\"—but in this work, she has tried to show how such a takeover might play out.[14]\n\nAtwood's inspiration for the Republic of Gilead came from her time studying early American Puritans while at Harvard, which she attended on a Woodrow Wilson Fellowship.[11] Atwood argues that the modern view of the Puritans—that they came to America to flee religious persecution in England and set up a religiously tolerant society—is misleading, and that instead, these Puritan leaders wanted to establish a monolithic theocracy where religious dissent would not be tolerated.[11] Atwood also had a personal connection to the Puritans, and she dedicates the novel to her own ancestor Mary Webster, who was accused of witchcraft in Puritan New England but survived her hanging.[15] Due to the totalitarian nature of Gileadan society, Atwood, in creating the setting, drew from the \"utopian idealism\" present in 20th century régimes, such as Cambodia and Romania, as well as earlier New England Puritanism.[16] Atwood has argued that a coup, such as the one depicted in The Handmaid's Tale, would misuse religion in order to achieve its own ends:.[17][16]\n\nAtwood, with respect to those leading Gilead, further stated:[18]\n\nI don't consider these people to be Christians because they do not have at the core of their behavior and ideologies what I, in my feeble Canadian way, would consider to be the core of Christianity … and that would be not only love your neighbors but love your enemies. That would also be 'I was sick and you visited me not' and such and such …And that would include also concern for the environment, because you can't love your neighbor or even your enemy, unless you love your neighbor's oxygen, food, and water. You can't love your neighbor or your enemy if you're presuming policies that are going to cause those people to die. … Of course faith can be a force for good and often has been. So faith is a force for good particularly when people are feeling beleaguered and in need of hope. So you can have bad iterations and you can also have the iteration in which people have got too much power and then start abusing it. But that is human behavior, so you can't lay it down to religion. You can find the same in any power situation, such as politics or ideologies that purport to be atheist. Need I mention the former Soviet Union? So it is not a question of religion making people behave badly. It is a question of human beings getting power and then wanting more of it.\n\nIn the same vein, Atwood also declared that \"In the real world today, some religious groups are leading movements for the protection of vulnerable groups, including women.\"[8] Atwood also draws connections between the ways in which Gilead's leaders maintain their power and other examples of actual totalitarian governments. In her interviews, Atwood offers up Afghanistan as an example of a religious theocracy forcing women out of the public sphere and into their homes, as in Gilead.[13][11] The \"state-sanctioned murder of dissidents\" was inspired by the Philippines, and the last General Secretary of the Romanian Communist Party Nicolae Ceaușescu's obsession with increasing the birth rate led to the strict policing of pregnant women and the outlawing of birth control and abortion.[13] However, Atwood clearly explains that many of these deplorable acts were not just present in other cultures and countries, \"but within Western society, and within the 'Christian' tradition itself\".[16]\n\nThe Republic of Gilead struggles with infertility, making Offred's services as a Handmaid vital to producing children and thus reproducing the society. Handmaids themselves are \"untouchable\", but their ability to signify status is equated to that of slaves or servants throughout history.[16] Atwood connects their concerns with infertility to real-life problems our world faces, such as radiation, chemical pollution, and venereal disease (HIV/AIDS is specifically mentioned in the \"Historical Notes\" section at the end of the novel, which was a relatively new disease at the time of Atwood's writing whose long-term impact was still unknown). Atwood's strong stance on environmental issues and their negative consequences for our society has presented itself in other works such as her MaddAddam trilogy, and refers back to her growing up with biologists and her own scientific curiosity.[19]\n\nCharacters [ edit ]\n\nOffred [ edit ]\n\nOffred is the protagonist and narrator who takes the readers through life in Gilead. She was labeled a \"wanton woman\" when Gilead was established because she had married a man who was divorced. All divorces were nullified by the new government, meaning her husband was now considered still married to his first wife, making Offred an adulteress. In trying to escape Gilead, she was separated from her husband and daughter. She is part of the first generation of Gilead's women, those who remember pre-Gilead times. Proved fertile, she is considered an important commodity and has been placed as a \"handmaid\" in the home of \"the Commander\" and his wife Serena Joy, to bear a child for them (Serena Joy is believed to be infertile).[20] Readers are able to see Offred's resistance of The Republic of Gilead on the inside through her thoughts.\n\nOffred is a slave name that describes her function: she is \"of Fred\" (i.e., she belongs to Fred–presumed to be the name of the Commander–and is considered a concubine). In the novel, Offred says that she is not a concubine, but a tool; a \"two legged womb\". The Handmaids' names say nothing about who the women really are; their only identity is as the Commander's property. \"Offred\" is also a pun on the word \"offered\", as in \"offered as a sacrifice\", and \"of red\" because the red dress assigned for the handmaids in Gilead.\n\nIn Atwood's original novel, Offred's real name is never revealed; however, Volker Schlöndorff's 1990 film adaptation gave Offred the real name Kate,[21] while the television series gave her the real name June.\n\nThe women in training to be Handmaids whisper names across their beds at night. The names are \"Alma. Janine. Dolores. Moira. June,\" and all are later accounted for except June. In addition, one of the Aunts tells the handmaids-in-training to stop \"mooning and June-ing\". From this and other references, some readers have inferred that her birth name could be \"June\".[23] Miner suggests that \"June\" is a pseudonym. As \"Mayday\" is the name of the Gilead resistance, June could be an invention by the protagonist. The Nunavut conference covered in the epilogue takes place in June.[24] When the Hulu TV series chose to state outright that Offred's real name is June, Atwood wrote that it was not her original intention to imply that Offred's real name is June \"but it fits, so readers are welcome to it if they wish\".[8] The revelation of Offred's real name serves only to humanize her in the presence of the other Handmaids.\n\nThe Commander [ edit ]\n\nThe Commander says that he was a scientist and was previously involved in something similar to market research before Gilead's inception. Later, it is hypothesized, but not confirmed, that he might have been one of the architects of the Republic and its laws. Presumably, his first name is \"Fred\", though that, too, may be a pseudonym. He engages in forbidden intellectual pursuits with Offred, such as playing Scrabble, and introduces her to a secret club that serves as a brothel for high-ranking officers. Offred learns that the Commander carried on a similar relationship with his previous handmaid, who later killed herself when his wife found out.\n\nIn the epilogue, Professor Peixoto speculates that one of two figures, both instrumental in the establishment of Gilead, may have been the Commander, based on the name \"Fred\". It is his belief that the Commander was a man named Frederick R. Waterford who was killed in a purge shortly after Offred was taken away, charged with harbouring an enemy agent.\n\nSerena Joy [ edit ]\n\nSerena Joy is a former televangelist and the Commander's wife in the fundamentalist theonomy. The state took away her power and public recognition, and tries to hide her past as a television figure. Offred identifies Serena Joy by recalling seeing her on TV when she was a little girl early on Saturday mornings while waiting for the cartoons to air. Believed to be sterile (although the suggestion is made that the Commander is sterile, Gileadean laws attribute sterility only to women), she is forced to accept that he has use of a handmaid. She resents having to take part in \"The Ceremony\", a monthly fertility ritual. She strikes a deal with Offred to arrange for her to have sex with Nick in order to become pregnant. According to Professor Pieixoto in the epilogue, \"Serena Joy\" or \"Pam\" are pseudonyms; the character's real name is implied to be Thelma.\n\nOfglen [ edit ]\n\nOfglen is a neighbour of Offred's and a fellow Handmaid. She is partnered with Offred to do the daily shopping. Handmaids are never alone and are expected to police each other's behaviour. Ofglen is a member of the Mayday resistance. In contrast to Offred, she is daring. She knocks out a Mayday spy who is to be tortured and killed in order to save him the pain of a violent death. Offred is told that when Ofglen vanishes, it is because she has committed suicide before the government can take her into custody due to her membership in the resistance, possibly to avoid giving away any information.\n\nA new handmaid, also called Ofglen, takes Ofglen's place, and is assigned as Offred's shopping partner. She threatens Offred against any thought of resistance. In addition, she breaks protocol by telling her what happened to the first Ofglen.\n\nNick [ edit ]\n\nNick is the Commander's chauffeur, who lives above the garage. By Serena Joy's arrangement, he and Offred start a sexual relationship to increase her chance of getting pregnant. If she were unable to bear the Commander a child, she would be declared sterile and shipped to the ecological wastelands of the Colonies. Offred begins to develop feelings for him. Nick is an ambiguous character, and Offred does not know if he is a party loyalist or part of the resistance, though he identifies himself as the latter. The epilogue suggests that he really was part of the resistance, and aided Offred in escaping the Commander's house.\n\nMoira [ edit ]\n\nMoira has been a close friend of Offred's since college. In the novel, their relationship represents a female friendship that the Republic of Gilead tries to block. A lesbian, she has resisted the homophobia of Gilead society. Moira is taken to be a Handmaid soon after Offred. She escapes by stealing an Aunt's pass and clothes, but Offred later finds her working as a prostitute in a party-run brothel. She was caught and chose the brothel rather than to be sent to the Colonies. Moira exemplifies defiance against Gilead by rejecting every value that is forced onto the citizens.\n\nLuke [ edit ]\n\nLuke was Offred's husband before the formation of Gilead, having divorced his first wife to marry her. Under Gilead, all divorces were retroactively nullified, resulting in Offred being considered an adulteress and their daughter illegitimate. Offred was forced to become a Handmaid and her daughter was given to a loyalist family. Since their attempt to escape to Canada, Offred has heard nothing of Luke. She wavers between believing him dead or imprisoned.\n\nProfessor Pieixoto [ edit ]\n\nPieixoto is the \"co-discoverer [with Professor Knotly Wade] of Offred's tapes\". In his presentation at an academic conference, he talks about \"the 'Problems of Authentication in Reference to The Handmaid's Tale'\".[20] Pieixoto is therefore the person who is retelling Offred's story, and so makes the narration even more unreliable than it was originally.\n\nSetting [ edit ]\n\nThe novel is set in an indeterminate dystopian future, speculated to be around the year 2005,[25] with a fundamentalist theonomy ruling the territory of what had been the United States but is now the Republic of Gilead. Individuals are segregated by categories and dressed according to their social functions. Complex dress codes play a key role in imposing social control within the new society and serve to distinguish people by sex, occupation, and caste.\n\nThe action takes place in what once was the Harvard Square neighbourhood of Cambridge, Massachusetts;[27] Atwood studied at Radcliffe College, located in this area.\n\nPolitics [ edit ]\n\nIn Gilead, the bodies of fertile women are politicized and controlled. The North American population is falling as more men and women become infertile (though in Gilead, legally, it is only women who can be the cause of infertility). Gilead's treatment of women is based upon a literal, fundamentalist interpretation of the Bible, meaning that women are the property of and subordinate to their husband, father, or head of household. They are not allowed to do anything that would grant them any power independent of this system. They are not allowed to vote, hold a job, read, possess money, or own anything, among many other restrictions.\n\nA particular quote from The Handmaid's Tale sums this up: \"The Republic of Gilead, said Aunt Lydia, knows no bounds. Gilead is within you\" (HT 5.2). This describes that there is no way around the societal bounds of women in this new state of government. Handmaids, being not allowed to wed, are given two-year assignments with a commander, and lose their own name: they are called \"Of [their Commander's first name]\", such as the novel's protagonist, known only as Offred. When a handmaid is reassigned, her name changes with her. Their original identities are suppressed. However, while being re-educated as handmaids, they surreptitiously share their names with each other.\n\nIn this book, the government appears to be strong though \"no one in Gilead seems to be a true believer in its revolution\" (Beauchamp). The Commanders, portrayed via Commander Fred, do not agree with their own doctrines. The commander takes Offred at one point to a brothel in order to have sex with her in an informal setting apart from the Ceremony. The wives, portrayed via Serena Joy, former television evangelist, disobey the rules set forth by their commander husbands. Serena smokes black market cigarettes, expresses the forbidden idea that men may be infertile, and schemes to get Offred impregnated by her chauffeur.\n\nReligion [ edit ]\n\nBruce Miller, the executive producer of The Handmaid's Tale television serial, declared with regard to Atwood's book, as well as his series, that Gilead is \"a society that’s based kind of in a perverse misreading of Old Testament laws and codes\".[28] The author explains that Gilead tries to embody the \"utopian idealism\" present in 20th-century regimes, as well as earlier New England Puritanism.[16] Both Atwood and Miller stated that the people running Gilead are \"not genuinely Christian\".[29][28] The group running Gilead, according to Atwood, is \"not really interested in religion; they're interested in power.\"[18] In fact, in her prayers to God, Offred reflects on Gilead and prays “I don't believe for an instant that what's going on out there is what You meant.... I suppose I should say I forgive whoever did this, and whatever they’re doing now. I’ll try, but it isn't easy.”[30] Margaret Atwood, writing on this, says that \"Offred herself has a private version of the Lord's Prayer and refuses to believe that this regime has been mandated by a just and merciful God.\"[31]\n\nChristian churches that do not support the actions of the Sons of Jacob are systematically demolished, and the people living in Gilead are never seen attending church.[28] Christian denominations, including Quakers, Baptists and Roman Catholics, are specifically named as enemies of the Sons of Jacob.[18][28] Nuns who refuse conversion are considered \"Unwomen\" and banished to the Colonies, owing to their reluctance to marry and refusal (or inability) to bear children. Priests unwilling to convert are executed and hanged from the Wall. Atwood pits Quaker Christians against the regime by having them help the oppressed, something she feels they would do in reality: \"The Quakers have gone underground, and are running an escape route to Canada, as—I suspect—they would.\"[31]\n\nJews are named an exception and classified Sons of Jacob. Offred observes that Jews refusing to convert are allowed to emigrate from Gilead to Israel, and most choose to leave. However, in the epilogue, Professor Pieixoto reveals that many of the emigrating Jews ended up being dumped into the sea while on the ships ostensibly tasked with transporting them to Israel, due to privatization of the \"repatriation program\" and capitalists' effort to maximize profits. Offred mentions that many Jews who chose to stay were caught secretly practicing Judaism and executed.\n\nLegitimate women [ edit ]\n\nWives The top social level permitted to women, achieved by marriage to higher-ranking officers. Wives always wear blue dresses and cloaks, suggesting traditional depictions of the Virgin Mary in historic Christian art. When a Commander dies, his Wife becomes a Widow and must dress in black.\n\nDaughters The natural or adopted children of the ruling class. They wear white until marriage, which is arranged by the government. The narrator's daughter may have been adopted by an infertile Wife and Commander and she is shown in a photograph wearing a long white dress.\n\n[8] The bonnets that Handmaids wear are modelled on Old Dutch Cleanser's faceless mascot, which Atwood in childhood found frightening.\n\nFertile women whose social function is to bear children for infertile Wives. Handmaids dress in ankle-length red dresses, white caps, and heavy boots. In summer, they change into lighter-weight (but still ankle-length) dresses and slatted shoes. When in public, in winter, they wear ankle-length red cloaks, red gloves, and heavy white bonnets, which they call \"wings\" because the sides stick out, blocking their peripheral vision and shielding their faces from view. Handmaids are women of proven fertility who have broken the law. The law includes both gender crimes, such as lesbianism; and religious crimes, such as adultery (redefined to include sexual relationships with divorced partners since divorce is no longer legal). The Republic of Gilead justifies the use of the handmaids for procreation by referring to two biblical stories: Genesis 30:1–13 and Genesis 16:1–4. In the first story, Jacob's infertile wife Rachel offers up her handmaid Bilhah to be a surrogate mother on her behalf, and then her sister Leah does the same with her own handmaid Zilpah (even though Leah has already given Jacob many sons). In the other story, which appears earlier in Genesis but is cited less frequently, Abraham has sex with his wife's handmaid, Hagar. Handmaids are assigned to Commanders and live in their houses. When unassigned, they live at training centers. Handmaids who successfully bear children continue to live at their commander's house until their children are weaned, at which point they are sent to a new assignment. Those who do produce children, however, will never be declared \"Unwomen\" or sent to the Colonies, even if they never have another baby.\n\nAunts Trainers of the Handmaids. They dress in brown. Aunts promote the role of Handmaid as an honorable way for a sinful woman to redeem herself. They also police the Handmaids, beating some and ordering the maiming of others. The aunts have an unusual amount of autonomy, compared to other women of Gilead. They are the only class of women permitted to read although this is only to fulfil the administrative aspect of their role. (\"The Aunts are allowed to read and write.\" Vintage Books, p. 139. However, on p. 100 of the Vintage Books edition: \"They played it (the Beatitudes) from a disc; the voice was a man's.\" In the Anchor Books edition: \"They played it (the Beatitudes) from a tape, so not even an Aunt would be guilty of the sin of reading. The voice was a man's. (p.89.)\")\n\nMarthas They are older, infertile women who have domestic skills and are compliant, making them suitable as servants. They dress in green smocks. The title of \"Martha\" is based on the story of Jesus at the home of Martha and Mary (Gospel of Luke 10:38–42), where Jesus visits Mary, sister of Lazarus and Martha; Mary listens to Jesus while Martha works at \"all the preparations that had to be made\".\n\nEconowives Women married to men of lower-rank, not members of the elite. They are expected to perform all the female functions: domestic duties, companionship, and child-bearing. Their dress is multicoloured red, blue, and green to reflect these multiple roles, and is made of notably cheaper material.\n\nThe division of labour among the women generates some resentment. Marthas, Wives and Econowives perceive Handmaids as promiscuous and are taught to scorn them. Offred mourns that the women of the various groups have lost their ability to empathize with each other. They are divided in their oppression.\n\nThe Ceremony [ edit ]\n\n\"The Ceremony\" is a non-marital sexual act sanctioned for reproduction. The ritual requires the Handmaid to lie on her back between the legs of the Wife during the sex act as if they were one person. The Wife has to invite the Handmaid to share her power this way; many Wives consider this both humiliating and offensive. Offred describes the ceremony:\n\nMy red skirt is hitched up to my waist, though no higher. Below it the Commander is fucking. What he is fucking is the lower part of my body. I do not say making love, because this is not what he's doing. Copulating too would be inaccurate because it would imply two people and only one is involved. Nor does rape cover it: nothing is going on here that I haven't signed up for.\n\nGenre classification [ edit ]\n\nThe Handmaid’s Tale is a feminist dystopian novel,[33][34] combining the characteristics of dystopian fiction: “a genre that projects an imaginary society that differs from the author’s own, first, by being significantly worse in important respects and second by being worse because it attempts to reify some utopian ideal,”[35] with the feminist utopian ideal which: “sees men or masculine systems as the major cause of social and political problems (e.g. war), and presents women as not only at least the equals of men but also as the sole arbiters of their reproductive functions.[36][37] The Encyclopedia of Science Fiction notes that dystopian images are almost invariably images of future society, “pointing fearfully at the way the world is supposedly going in order to provide urgent propaganda for a change in direction.”[38] Atwood's stated intent was indeed to dramatize potential consequences of current trends.[39]\n\nIn 1985, reviewers hailed the book as a \"feminist 1984,\"[40] citing similarities between the totalitarian regimes under which both protagonists live, and “the distinctively modern sense of nightmare come true, the initial paralyzed powerlessness of the victim unable to act.”[41] Scholarly studies have expanded on the place of The Handmaid’s Tale in the dystopian and feminist traditions.[41][11][42][12][40]\n\nThe classification of utopian and dystopian fiction as a sub-genre of the collective term, speculative fiction, alongside science fiction, fantasy, and horror is a relatively recent convention. (See also: The Internet Speculative Fiction Database) Dystopian novels have long been discussed as a type of science fiction, however, with publication of The Handmaid's Tale, Atwood distinguished the terms science fiction and speculative fiction quite intentionally. In interviews and essays, she has discussed why, observing:\n\nI like to make a distinction between science fiction proper and speculative fiction. For me, the science fiction label belongs on books with things in them that we can't yet do, such as going through a wormhole in space to another universe; and speculative fiction means a work that employs the means already to hand, such as DNA identification and credit cards, and that takes place on Planet Earth. But the terms are fluid.[43]\n\nAtwood acknowledges that others may use the terms interchangeably, but she notes her interest in this type of work is to explore themes in ways that \"realistic fiction\" cannot do.[43]\n\nAmong a few science fiction aficionados, however, Atwood's comments were considered petty and contemptuous. (The term speculative fiction was indeed employed that way by certain New Wave writers in the 1960s and early 1970s to express their dissatisfaction with traditional or establishment science fiction.) Hugo-winning science fiction critic David Langford observed in a column: \"The Handmaid's Tale won the very first Arthur C. Clarke Award in 1987. She's been trying to live this down ever since.\"[44]\n\nCritical reception [ edit ]\n\nThe Handmaid's Tale was well received by critics, helping to cement Atwood's status as a prominent writer of the 20th century. Not only was the book deemed well-written and compelling, but Atwood's work was notable for sparking intense debates both in and out of academia.[10] Atwood maintains that the Republic of Gilead is only an extrapolation of trends already seen in the United States at the time of her writing, a view supported by other scholars studying The Handmaid's Tale.[45] Indeed, many have placed The Handmaid's Tale in the same category of dystopian fiction as Nineteen Eighty-Four and Brave New World,[13] with the added feature of confronting patriarchy, a categorization that Atwood has accepted and reiterated in many articles and interviews.[14]\n\nEven today, many reviewers hold that Atwood's novel remains as foreboding and powerful as ever, largely because of its basis in historical fact.[15][17] Yet when her book was first published in 1985, not all reviewers were convinced of the \"cautionary tale\" Atwood presented. For example, Mary McCarthy's New York Times review argued that The Handmaid's Tale lacked the \"surprised recognition\" necessary for readers to see \"our present selves in a distorting mirror, of what we may be turning into if current trends are allowed to continue\".[19]\n\nIn the aftermath of the television series' debut in 2017, there has been much debate on parallels drawn between the series (and by extension, this book) and American society following the election of Donald Trump as President of the United States and that of Mike Pence as Vice President of the United States.[46][47]\n\nAnalysis [ edit ]\n\nFeminist analysis [ edit ]\n\nMuch of the discussion about The Handmaid's Tale has centered on its categorization as feminist literature. Atwood does not see the Republic of Gilead as a purely feminist dystopia, as not all men have greater rights than women.[16] Instead, this society presents a typical dictatorship: \"shaped like a pyramid, with the powerful of both sexes at the apex, the men generally outranking the women at the same level; then descending levels of power and status with men and women in each, all the way down to the bottom, where the unmarried men must serve in the ranks before being awarded an Econowife\".[16] Econowives are women married to men that don't belong to the elite and who are expected to carry out child-bearing, domestic duties, and traditional companionship. When asked about whether her book was feminist, Atwood stated that the presence of women and what happens to them are important to the structure and theme of the book. This aisle of feminism, by default, would make a lot of books feminist. However, she was adamant in her stance that her book did not represent the brand of feminism that victimizes or strips women of moral choice.[48] Additionally, Atwood has argued that while some of the observations that informed the content of The Handmaid's Tale may be feminist, her novel is not meant to say \"one thing to one person\" or serve as a political message—instead, The Handmaid's Tale is \"a study of power, and how it operates and how it deforms or shapes the people who are living within that kind of regime\".[13][14]\n\nSome scholars have offered such a feminist interpretation, however, connecting Atwood's use of religious fundamentalism in the pages of The Handmaid's Tale to a condemnation of their presence in current American society.[49][50] Atwood goes on to describe her book as not a critique of religion, but a critique of the use of religion as a \"front for tyranny.\"[51] Yet others have argued that The Handmaid's Tale critiques typical notions of feminism, as Atwood's novel appears to subvert the traditional \"women helping women\" ideals of the movement and turn toward the possibility of \"the matriarchal network ... and a new form of misogyny: women's hatred of women\".[52] Scholars have analyzed and made connections to patriarchal oppression in The Handmaid's Tale and oppression of women today. Aisha Matthews tackles the effects of institutional structures that oppress woman and womanhood and connects those to the themes present in The Handmaid's Tale. She first asserts that structures and social frameworks, such as the patriarchy and societal role of traditional Christian values, are inherently detrimental to the liberation of womanhood. She then makes the connection to the relationship between Offred, Serena Joy, and their Commander, explaining that through this \"perversion of traditional marriage, the Biblical story of Rachel, Jacob, and Bilhah is taken too literally.\" Their relationship and other similar relationships in The Handmaid's Tale mirror the effects of patriarchal standards of womanliness.[53]\n\nSex and Occupation [ edit ]\n\nThe sexes are strictly divided. Gilead's society values white women's reproductive commodities over those of other ethnicities. Women are categorized \"hierarchically according to class status and reproductive capacity\" as well as \"metonymically colour-coded according to their function and their labour\" (Kauffman 232). The Commander expresses his personal opinion that women are considered inferior to men, as the men are in a position where they have power to control society.\n\nWomen are segregated by clothing, as are men. With rare exception, men wear military or paramilitary uniforms. All classes of men and women are defined by the colours they wear, drawing on colour symbolism and psychology. All lower-status individuals are regulated by this dress code. All \"non-persons\" are banished to the \"Colonies\". Sterile, unmarried women are considered to be non-persons. Both men and women sent there wear grey dresses.\n\nThe women, particularly the handmaids, are stripped of their individual identities as they lack formal names, taking on their assigned commander's first name in most cases. This hierarchical society has forced women to come to terms with their inability to make decisions about their own bodies and lives.\n\nUnwomen [ edit ]\n\nSterile women, the unmarried, some widows, feminists, lesbians, nuns, and politically dissident women: all women who are incapable of social integration within the Republic's strict gender divisions. Gilead exiles Unwomen to \"the Colonies\", areas both of agricultural production and deadly pollution. Joining them are handmaids who fail to bear a child after three two-year assignments.\n\nJezebels [ edit ]\n\nJezebels are women who are forced to become prostitutes and entertainers. They are available only to the Commanders and to their guests. Offred portrays Jezebels as attractive and educated; they may be unsuitable as handmaids due to temperament. They have been sterilized, a surgery that is forbidden to other women. They operate in unofficial but state-sanctioned brothels, unknown to most women. Jezebels, whose title also comes from the Bible (note Queen Jezebel in the Books of Kings), dress in the remnants of sexualized costumes from \"the time before\", such as cheerleaders' costumes, school uniforms, and Playboy Bunny costumes. Jezebels can wear make-up, drink alcohol and socialize with men, but are tightly controlled by the Aunts. When they pass their sexual prime and/or their looks fade, they are discarded without any precision as to whether they are killed or sent to the Colonies in the novel.\n\nRace analysis [ edit ]\n\nAfrican Americans, the main non-white ethnic group in this society, are called the Children of Ham. A state TV broadcast mentions they have been relocated \"en masse\" to \"National Homelands\" in the Midwest, which are suggestive of the Apartheid-era homelands set up by South Africa. Ana Cottle characterized The Handmaid's Tale as \"white feminism\", noting that Atwood does away with black people in a few lines by relocating the \"Children of Ham\" while borrowing heavily from the African-American experience and applying it to white women.[54][55] It is implied that Native Americans living in territories under the rule of Gilead are exterminated. Jews are given a choice between converting to the state religion or being \"repatriated\" to Israel. However, converts who were subsequently discovered with any symbolic representations or artifacts of Judaism were executed, and the repatriation scheme was privatized. Many argue that readers cannot simply ignore the parallels between racism and sexism within The Handmaid's Tale. Many critics believe that Atwood chooses to erase the black community from the novel by sending them elsewhere in order to make the Republic of Gilead a white society. Scholar Ben Merriman believes that Atwood's portrayal of society in The Handmaid's Tale mimics that of a society run on black slavery, due to the novel's heavy focuses on \"sexual exploitation, isolation, and compelled ignorance that accompany severe economic and political powerlessness\", which are themes often associated with African-American slavery. Merriman accuses Atwood of purposely failing to acknowledge the parallels between her novel and the African-American experience. In Gilead, Handmaids are forbidden to read or write and the men in charge control access to literacy. In black slavery, African-Americans had restrictions on literacy as well. Additionally, The Handmaid's Tale is written as an oral narration of Offred's experiences; oral narration is a theme commonly associated with slave narratives.[56]\n\nLanguage analysis [ edit ]\n\nIn the novel's fictional fundamentalist society, sterile is an outlawed word. In this society, there is no such thing as a sterile man. In this culture, women are either fruitful or barren, the latter of which are declared to be \"unwomen\" and are sent to the colonies with the rest of the \"unwomen\" to do life-threatening work until their death, which is, on average, three years.\n\nAtwood emphasises how changes in context affect behaviours and attitudes by repeating the phrase \"Context is all\" throughout the novel, establishing this precept as a motif. Playing the game of Scrabble with her Commander illustrates the key significance of changes in \"context\"; once \"the game of old men and women\", the game became forbidden for women to play and therefore \"desirable\". Through living in a morally rigid society, Offred has come to perceive the world differently from earlier. Offred expresses amazement at how \"It has taken so little time to change our minds about things\". Wearing revealing clothes and makeup had been part of her former life, but when she sees Japanese tourists dressed that way, she now feels the women are inappropriately dressed.\n\nOffred can read but not translate the phrase \"nolite te bastardes carborundorum\" carved into the closet wall of her small bedroom; this mock-Latin aphorism signifies \"Don't let the bastards grind you down\".\n\nAwards [ edit ]\n\nAcademic reception [ edit ]\n\nAtwood's novels, and especially her works of speculative fiction, The Handmaid's Tale and Oryx and Crake, are frequently offered as examples for the final, open-ended question on the North American Advanced Placement English Literature and Composition exam each year.[62] As such, her books are often assigned in high-school classrooms to students taking this Advanced Placement course, despite the mature themes the work presents. Atwood herself has expressed surprise that her books are being assigned to high-school audiences, largely due to her own censored education in the 1950s, but she has assured readers that this increased attention from high-school students has not altered the material she has chosen to write about since.[63]\n\nChallenges [ edit ]\n\nBecause the book has been frequently challenged or banned over the last thirty years, many people have expressed discontent at The Handmaid's Tale's presence in the classroom. Some of these challenges have come from parents concerned about the explicit sexuality and other adult themes represented in the book. Others have argued that The Handmaid's Tale depicts a negative view of religion, a view supported by several academics who propose that Atwood's work satirizes contemporary religious fundamentalists in the United States, offering a feminist critique of the trends this movement to the Right represents.[49][50]\n\nThe American Library Association (ALA) lists The Handmaid's Tale as number 37 on the \"100 Most Frequently Challenged Books of 1990–2000\".[64] Atwood participated in discussing The Handmaid's Tale as the subject of an ALA discussion series titled \"One Book, One Conference\".[65]\n\nSome complaints have included:\n\n\"The Handmaid's Tale wasn't likely written for 17-year-olds, but neither are a lot of things we teach in high school, like Shakespeare... And they are all the better for reading it. They are on the edge of adulthood already, and there's no point in coddling them,\" he said, adding, \"they aren't coddled in terms of mass media today anyway\"... He said the book has been accused of being anti-Christian and, more recently, anti-Islamic because the women are veiled and polygamy is allowed... But that \"misses the point\", said Brown. \"It's really anti-fundamentalism.\"[67]\n\nIn her earlier account (14 January 2009), Rushowy reported that a Toronto District School Board committee was \"reviewing the novel\". While noting that \"The Handmaid's Tale is listed as one of the 100 'most frequently challenged books' from 1990 to 1999 on the American Library Association's website\", Rushowy reports that \"The Canadian Library Association says there is 'no known instance of a challenge to this novel in Canada' but says the book was called anti-Christian and pornographic by parents after being placed on a reading list for secondary students in Texas in the 1990s.\"[68]\n\nIn November 2012 two parents in Guilford County, North Carolina protested against inclusion of the book on a required reading list at a local high school. The parents presented the school board with a petition signed by 2,300 people, prompting a review of the book by the school's media advisory committee. According to local news reports, one of the parents said \"she felt Christian students are bullied in society, in that they're made to feel uncomfortable about their beliefs by non-believers. She said including books like The Handmaid's Tale contributes to that discomfort, because of its negative view on religion and its anti-biblical attitudes toward sex.\"[69]\n\nOther use in academia [ edit ]\n\nIn institutions of higher education, professors have found The Handmaid's Tale to be useful, largely because of its historical and religious basis and Atwood's captivating delivery. The novel's teaching points include: introducing politics and the social sciences to students in a more concrete way;[70][71] demonstrating the importance of reading to our freedom, both intellectual and political;[72] and acknowledging the \"most insidious and violent manifestations of power in Western history\" in a compelling manner.[73] The chapter entitled \"Historical Notes\" at the end of the novel also represents a warning to academics who run the risk of misreading and misunderstanding historical texts, pointing to the satirized Professor Pieixoto as an example of a male scholar who has taken over and overpowered Offred's narrative with his own interpretation.[74]\n\nThe novel appears as a studied text on Ireland's Leaving Certificate examination for school-leavers.[citation needed]\n\nIn other media [ edit ]\n\nAudio [ edit ]\n\nAn audiobook of the unabridged text, read by Claire Danes ( ISBN 9781491519110), won the 2013 Audie Award for fiction. [75]\n\nISBN 9781491519110), won the 2013 Audie Award for fiction. In 2014, Canadian band Lakes of Canada released their album Transgressions , which is intended to be a concept album inspired by The Handmaid's Tale . [76]\n\n, which is intended to be a concept album inspired by . On his album Shady Lights from 2017, Snax references the novel and film adaption, specifically the character of Serena Joy, in the song, “Make Me Disappear.” The first verse reads, ‘You can call me Serena Joy. Drink in hand, in front of the TV, I’m teary eyed, adjusting my CC.’\n\nFilm [ edit ]\n\nThe 1990 film The Handmaid's Tale was based on a screenplay by Harold Pinter and directed by Volker Schlöndorff. It stars Natasha Richardson as Offred, Faye Dunaway as Serena Joy, and Robert Duvall as The Commander (Fred).\n\nGraphic Novel [ edit ]\n\nIn 2019, a graphic novel based on this book and with the same title was published by Renée Nault, ISBN 9780224101936.\n\nRadio [ edit ]\n\nA dramatic adaptation of the novel for radio was produced for BBC Radio 4 by John Dryden in 2000.\n\nA Canadian dramatic adaptation for radio was written by playwright Michael O'Brien and produced on CBC Radio in 2002.\n\nStage [ edit ]\n\nTelevision [ edit ]\n\nSequel [ edit ]\n\nIn November 2018, Atwood announced the sequel, titled The Testaments, which was published in September 2019.[87] The novel is set fifteen years after Offred's final scene, with the testaments of three female narrators from Gilead.[88]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ The Handmaid's Tale is the inaugural winner of this award for the best science fiction novel published in the United Kingdom during the previous year. ^ Prometheus. The Prometheus Award is an award for libertarian science fiction novels given out annually by the Libertarian Futurist Society, which also publishes a quarterly journal,\n\nReferences [ edit ]\n\nBibliography [ edit ]\n\n(17 June 2005), \"Aliens Have Taken the Place of Angels\", The Guardian\n\n(14 Jan 2009), \"Complaint Spurs School Board to Review Novel by Atwood\", The Toronto Star .\n\n. Alexander, Lynn (22 May 2009), \"The Handmaid's Tale Working Bibliography\", Department of English, University of Tennessee at Martin . Hyperlinked to online resources for Alexander, Dr Lynn (Spring 1999), Women Writers: Magic, Mysticism, and Mayhem (course) . Includes entry for book chap. by Kauffman.\n\n. Hyperlinked to online resources for . Includes entry for book chap. by Kauffman. An Interview with Margaret Atwood on her novel, The Handmaid's Tale (n.d.). In Nashville Public Library .\n\n(n.d.). In . Armrbuster, J. (1990). \"Memory and Politics — A Reflection on \"The Handmaid's Tale\". Social Justice 17( 3), 146–52.\n\n3), 146–52. Atwood, Margaret (1985). The Handmaid's Tale ISBN 0-7710-0813-9 . Atwood, Margaret (1986). The Handmaid's Tale . New York: Anchor Books. Atwood, Margaret (1998). The Handmaid's Tale . New York: Anchor Books (div. of Random House). ISBN 978-0-385-49081-8 . Parenthetical page references are to the 1998 ed. Digitized 2 June 2008 by Google Books (311 pp.) (2005), La Servante écarlate [ The Handmaid's Tale ] (in French), Rué, Sylviane transl, Paris: J'ai Lu, ISBN 978-2-290-34710-2.\n\nParenthetical page references are to the 1998 ed. Digitized 2 June 2008 by Google Books (311 pp.) (2005), [ ] (in French), Rué, Sylviane transl, Paris: J'ai Lu, ISBN 978-2-290-34710-2. Atwood, M. (2004). The Handmaid's Tale and Oryx and Crake \"In Context\". PMLA , 119 (3), 513–517.\n\n, (3), 513–517. Atwood, M. (20 January 2012). \"Haunted by the Handmaid's Tale\". The Guardian .\n\n. Bergmann, H. F. (1989). \"Teaching Them to Read: A Fishing Expedition in the Handmaid's Tale\". College English , 51 (8), 847–854.\n\n, (8), 847–854. Burack, C. (1988–89). \"Bringing Women's Studies to Political Science: The Handmaid in the Classroom\". NWSA Journal 1 (2), 274–83.\n\n(2), 274–83. Callaway, A. A. (2008). \"Women disunited: Margaret Atwood's The Handmaid's Tale as a critique of feminism\". San Jose State University .\n\n. Curwood, Steve. (13 June 2014). \"Margaret Atwood on Fiction, The Future, and Environmental Crisis\". Living on Earth . n.p.\n\n. n.p. Evans, M. (1994). \"Versions of History: The Handmaid's Tale and its Dedicatees\". In C. Nicholson (Ed.), Margaret Atwood: Writing and Subjectivity (pp. 177–188). London, United Kingdom: Palgrave Macmillan UK.\n\n(pp. 177–188). London, United Kingdom: Palgrave Macmillan UK. Greene, Gayle. (1986). \"Choice of Evils\". The Women's Review of Books 3 (10), 14–15.\n\n(10), 14–15. Gruss, S. (2004). \"People confuse personal relations with legal structures\". An Interview with Margaret Atwood. In Gender Forum . Retrieved 28 March 2016.\n\n. Retrieved 28 March 2016. Hines, M. E. (2006). Margaret Atwood's The Handmaid's Tale: Fundamentalist Religiosity and the Oppression of Women . N.p.: Angelo State University.\n\n. N.p.: Angelo State University. Kauffman, Linda (1989), \"6. Special Delivery: Twenty-First Century Epistolarity in The Handmaid's Tale\", in Goldsmith, Elizabeth, Writing the Female Voice: Essays on Epistolary Literature , Boston: Northeastern University Press, pp. 221–44. Cited in Alexander.\n\n, Boston: Northeastern University Press, pp. 221–44. Cited in Alexander. Langford, David (Aug 2003), \"Bits and Pieces\", SFX (UK: Ansible) (107).\n\nLarson, J. L. (1989). \"Margaret Atwood and the Future of Prophecy\". Religion & Literature 21 (1), 27–61.\n\n(1), 27–61. Laz, C. (January 1996). \"Science Fiction and Introductory Sociology: The 'Handmaid' in the Classroom\". Teaching Sociology , 24 (1), 54–63.\n\n, (1), 54–63. Lewis, Lapham H. (September 2004). \"Tentacles of rage: The Republican propaganda mill, a brief history\". Harper's Magazine .\n\n. Mercer, N. (2013). \"Subversive Feminist Thrusts\": Feminist Dystopian Writing and Religious Fundamentalism in Margaret Atwood's The Handmaid's Tale, Louise Marley's The Terrorists of Irustan, Marge Piercy's He, She and I . Madison, WI: University of Wisconsin.\n\n. Madison, WI: University of Wisconsin. Miner, Madonne (1991), \"'Trust Me': Reading the Romance Plot in Margaret Atwood's The Handmaid's Tale\". Twentieth Century Literature 37: 148–68, doi:10.2307/441844.\n\n37: 148–68, doi:10.2307/441844. Morris, M. (1990). \"Margaret Atwood, The Art of Fiction No. 121\". The Paris Review .\n\n. Neuman, S. C. (2006). \"'Just a Backlash': Margaret Atwood, Feminism, and The Handmaid's Tale\". University of Toronto Quarterly , 75 (3), 857–868.\n\n, (3), 857–868. Oates, J. C. (2 November 2006). \"Margaret Atwood's Tale\". The New York Review of Books .\n\n. Perry, D. (30 December 2014). \"Margaret Atwood and the 'Four Unwise Republicans': 12 surprises from the legendary writer's Reddit AMA\". The Oregonian .\n\n. Rothstein, Mervyn. (17 February 1986). \"No Balm in Gilead for Margaret Atwood\". The New York Times .\n\n. Rushowy, Kristin (16 January 2009). \"Atwood Novel Too Brutal, Sexist For School: Parent\". The Toronto Star . Archived from the original on 21 April 2016.\n\nStein, K. F. (1996). \"Margaret Atwood's Modest Proposal: The Handmaid's Tale\". Canadian Literature , 148 , 57–72.\n\n, , 57–72. The 100 Most Frequently Challenged Books of 1990–2000, American Library Association, 2009.\n\nAndriano, Joseph. \"The Handmaid’s Tale as Scrabble Game.\" Critical Insights: The Handmaid's Tale, edited by J. Brooks Bouson, Salem, 2009. Salem Online.\n\nElliott, John. \"A Watershed Moment for Atwood\" The Ottawa Citizen, December 5, 2004, pp. A3. ProQuest, .", "images": ["https://upload.wikimedia.org/wikipedia/en/1/18/TheHandmaidsTale%281stEd%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/4/44/Old_Dutch.gif", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Rubik%27s_cube_v3.svg/25px-Rubik%27s_cube_v3.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/18/TheHandmaidsTale%281stEd%29.jpg/220px-TheHandmaidsTale%281stEd%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Book_collection.jpg/32px-Book_collection.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/32px-Flag_of_Canada.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/TheHandmaidsTale%281stEd%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale", "title": "The Handmaid's Tale", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/18/TheHandmaidsTale%281stEd%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}