{"url": "www.huffingtonpost.com/entry/how-feasible-oceans-8-heist-blow-by-blow-explanation_us_5b0efb3de4b0be10a4881dac", "text": "Warning: This article contains spoilers. So many spoilers. Highly detailed, movie-ruining spoilers.\n\n“Somewhere out there, there’s an 8-year-old girl dreaming of becoming a criminal,” Debbie Ocean, played by Sandra Bullock, tells her mirrored reflection in one of the standout moments of “Ocean’s 8,” the highly anticipated sequel to Steven Soderbergh’s iconic heist films. “You’re doing this for her.”\n\nThe film gives budding bad girls everywhere role models to look up to, but just how accurate is the example they depict?\n\nDuring her time in prison (five years, eight months and 12 days, to be exact), Bullock ― erm, sorry, Ocean ― painstakingly maps out a convoluted strategy to steal $150 million in jewels by nabbing the iconic Cartier “Toussaint” diamond necklace off the neck of a famous actress at the Met Gala. Bullock writes the whole thing down on one very wrinkly sheet of paper, so viewers know she’s not messing around.\n\nWhen granted parole, the savvy con artist wastes no time rendezvousing with her old partner-in-crime Cate Blanchett ― ugh, right, Lou ― to execute the plot and get that necklace. They bring on five more very skilled swindlers to help carry out their Gordian heist. No boys allowed.\n\nOver the course of a delightful one hour and 50 minutes, Sandra and friends demonstrate that with teamwork, a few million dollars and freakishly good luck, women can steal anything! But before you join a ragtag lady gang and hold up your local jewelry store, let’s take a minute to consider how feasible this whole con job truly is.\n\nCould a 3D printer really produce a zirconium replica of a five-pound diamond necklace? Would a Hollywood starlet actually take a random art dealer as her date to the Met Ball? We asked a random assortment of (kinda sorta) experts these probing questions, and much more, below.\n\nHere’s a fact-checked rundown of the “Ocean’s 8” heist:\n\nStep 1: Get the look.\n\nHow plausible? “A lot of celebrities are crazy, so yeah, I think that could actually happen.”\n\nThe kickoff of the entire heist hinges on the look. Basically, Bullock decides she needs Anne Hathaway’s character ― a major Hollywood starlet and host of the year’s uber prestigious Met Gala ― to wear the $150 million Cartier “Toussaint” diamond necklace, previously locked in a vault 50 feet underground, to the big celebrity fete at New York’s most prestigious museum.\n\n(So they can steal it, of course.)\n\nTo do that, Bullock recruits a designer to her team to convince Hathaway to don the big ol’ jewels in the first place. Bullock lands on Helena Bonham-Carter for the job, a washed up ’90s “it” designer who is millions of dollars in debt but is still somehow in the good graces of Anna Wintour.\n\nSo here’s how they convince Hathaway ― who, again, is one of the hottest stars of the moment ― to choose a random ass designer for the big night: Bullock directs Bonham-Carter to appear in public with Dakota Fanning, i.e. Hathaway’s famous person nemesis who plays no further role in this movie. They snap a photo of the brief encounter and hope a Page 6 placement (a) makes Hathaway think Fanning is attempting to hire Bonham-Carter for Met styling purposes and (b) that, as a result, she becomes jealous enough to scoop Bonham-Carter up as her own designer.\n\nSure enough, it works.\n\nAccording to Alexandra Miles, a celebrity nanny concierge who’s worked with her fair share of actresses on the nights of big events, it’s conceivable that a celebrity of Hathaway’s caliber would opt for a lesser celebrated designer just to irk a rival celeb. “A lot of celebrities are crazy, so yeah, I think that could actually happen,” she said. “There are a lot of big, celebrity rivalries that become very high school.”\n\nStep 2: 3D printers are a girl’s best friend.\n\nHow plausible? “We’re probably not there yet.”\n\nSarah Paulson, aka the heist team’s “fence,” acquires a very fancy 3D printing machine that arrives with a pair of connected, high-tech glasses. The glasses can scan any object and upload their structure to the cloud ― unless you attempt to use them while underground in a Cartier vault, as Bonham-Carter learns. (Due to the terrible internet service in vaults, of course.) The glasses wearer just has to observe the object in question from a variety of angles until the glasses flash “100%” inside the lens, letting Paulson know the deed is done. The fancy printer machine then makes an exact replica of the object in zirconium, which looks an awful lot like diamonds.\n\nContrary to my initial belief that this scene required a wildly implausible technology that was centuries from existing, a New York-based 3D printing lab verified that these glasses-scanner-printer trinities do, in fact, exist. Still, the technology in the film is a bit more advanced than what’s possible in real life.\n\n“We’re probably not there yet,” Christina Perla, co-founder & CEO of Makelab, told HuffPost. “It might be feasible but there are questions that need to be addressed. Is the scale correct? A lot of times the object needs to be rescaled in a 3D printing program. Also, there might be some holes in the print. If you want a perfect print you have to check it on the computer and make sure there are no holes, no gaps, no inverted triangles. Is it possible? It could be. But it’s a little ahead of our time.”\n\nCourtesy Warner Brothers Entertainment Bullock, Blanchett, Rihanna, Mindy Kaling, Awkwafina, Helena Bonham Carter, Anne Hathaway and Paulson ride the subway together, looking very suspicious and very cool.\n\nStep 3: Infiltrate the museum.\n\nHow plausible? “Ninety percent of the time those guards are just looking at porn on their phones.”\n\nTo infiltrate the Met’s security system in anticipation of the big night, Sandra Bullock decides to cause a breach to stir things up, but just a little one.\n\nWhile Paulson is distracting a guard at the museum by asking for directions, Bullock installs an unsanctioned artwork on the wall, a variation of Emanuel Gottlieb Leutze’s “Washington Crossing the Delaware” with an all-women cast.\n\nEd Harris, a security guard for hire who has worked at art museums and art events in the past, said it’s possible someone could sneak an unsanctioned artwork into the museum space. “I mean, it really depends,” Harris, who is not Ed Harris the actor, told HuffPost. “The artwork could fit in a backpack or someone could sneak it in a jacket. I would think security is not going to be searching everyone who comes in.”\n\nBut could they install it on a wall? That’s less likely. “The movies are the movies,” he said. “Someone would probably see that. But I can’t make any promises. Honestly, that doesn’t happen in real life,” he said.\n\nHowever, a preparator working at a Los Angeles art gallery, who prefers to remain anonymous, said he believes someone could easily hang up an unsanctioned artwork in a gallery or museum, adding, “90 percent of the time those guards are just looking at porn on their phones.”\n\nBullock’s act of art vandalism is written up in the press as a stunt by renowned, anonymous street artist Banksy. How likely is it that an art blog would credit a work to Banksy without verifying it first? “Typically, Banksy announces his new artworks on his website, so we would not report something as a definitive new Banksy unless he had claimed it as his own,” Sarah Cascone, associate editor at artnet News, told HuffPost.\n\n“But an all-female ‘Washington Crossing the Delaware’ being hung guerrilla-style next to the real deal would be a news story regardless,” Cascone said. “We would probably publish a story that included speculation over whether or not Banksy was responsible. In the past, however, I have worked with editors who would be eager to capitalize on the Banksy name for a big headline, even without verification, so it’s not the most unrealistic thing.”\n\nStep 4: Take out the trash, steal all the security secrets.\n\nHow plausible? “Rihanna can accomplish anything.”\n\nFirst, Awkwafina (resident pickpocket) steals a badge from a cleaning crew, obtaining access to the building where a *very important security meeting* is happening in response to the Met Banksy debacle. Second, Rihanna (resident hacker) dresses as a janitor, uses the stolen badge to get into the building and proceeds to stick a recording device onto a trash can while pretending to take out the garbage during that *very important security meeting.*\n\nMission: accomplished. Now they know all the security secrets!\n\nCould it happen? Surely. Rihanna can accomplish anything she sets her genius mind on. Don’t fight me on this. No expert information needed.\n\nCourtesy Warner Brothers Entertainment Paulson, Bullock and Rihanna deep in plot mode.\n\nStep 5: Puppy love, aka the Great Wheaten Terrier Phishing Scam.\n\nHow plausible? “Hmm.”\n\nSo, we’re still on the whole security thing. Rihanna looks up a man who handles surveillance at The Met on Facebook and finds out he fucking loves Wheaten Terriers. So she creates a faux Wheaten fan site and goads the guy into clicking on its link with an onslaught of cute puppy pics. Because of Rihanna’s mythic hacking powers, this one click activates the desktop camera in his office and grants her access to everything on his computer, including files outlining the security cameras in The Met. (Also, there’s a map on his office wall outlining the camera arrangement. Dude is not good at covert surveillance.)\n\nShe ultimately uses this information to locate an at least nine-foot area blind spot next to the Met’s women’s bathroom, which will later allow Awkwafina to pull some pickpocket magic with no cameras to catch her.\n\nI reached out to celebrity dog trainer Brandon Macmillan to ask how likely a dog lover would be to click on such a clearly phishy link. (The text was written in Comic Sans!) His publicist, however, stopped responding before I could ask the question. I also posted on the Wheaten forum on Reddit, asking the community whether their love of Wheatens is so ardent they would click any link for the mere possibility of seeing their furry faces. I only got one response:\n\nReddit Screenshot The lone, sad reply to my Reddit query.\n\nHmm.\n\nStep 6: Go Vogue.\n\nHow plausible? “Completely inconceivable.”\n\nSarah Paulson ― an ex-con turned stay-at-home mom ― interviews for an open position at Vogue. Because she’s shady, she fakes some stellar references and cover letters in preparation. Fortunately for Sarah, Wintour cannot personally vet her because she’s immersed in a Roger Federer tennis match. Despite not being able to pronounce “gala,” Paulson is hired on the spot. She also starts the job that same day!\n\nMultiple reporters and editors employed at various Conde Nast publications including Vogue turned down my request for on-the-record comment. However, one brave soul volunteered his opinion that it is completely inconceivable that a Conde Nast publication would hire someone on the spot without first checking her references and confirming with the higher-ups. He prefers to remain anonymous, citing potential career ramifications for this bold statement.\n\nPaulson uses her new position to peek the seating arrangements for the big night, and learns that Hathaway doesn’t yet have a date!\n\nStep 7: Matchmaker, matchmaker.\n\nHow plausible? “That would totally never happen.”\n\nHathaway needs a date. And Bullock realizes that date should be her very own ex-boyfriend, a sketchy art dealer whose fuckery landed her in jail in the first place. So she works with (now Vogue employee) Paulson to invite the ex to a dinner she knows Hathaway will be attending. The two sit next to one another, hit it off, and voila! The most famous actress in the country is bringing an art dealer her date.\n\nCelebrity nanny concierge Miles is dubious that a major actress would bring a lowly art dealer as her date to the gala ― no offense, art dealers. “That would totally never happen,” she said. (It is worth noting, however, that Jennifer Lawrence is rumored to be dating an art dealer.)\n\nBut there’s an even more serious red flag here. According to Jamie Feldman, a HuffPost reporter who’s covered the Met Ball red carpet in the past, celebrities hardly ever bring random dates ― i.e., not a longterm partners ― to the event. “They are seated with the designers who dress them,” Feldman said.\n\nStep 8: The mystery of magnets.\n\nHow plausible? “I will focus on the implausibility of this other detail because I don’t understand the magnets.”\n\nBonham-Carter learns, while Hathaway is getting primped for the big night, that the Toussaint diamond necklace can only be removed from the celebrity’s neck by using a special magnet, introduced by the hella buff Mossad agent hired to guard the Cartier gems.\n\nYou see, this whole time, the group has been planning on somehow plucking the necklace (hey Awkwafina!) right off Hathaway during the gala. But they did not plan for this magnet business.\n\nLuckily, Rihanna has a little sister who is a magnet genius and figures out some contingency plan I can’t even begin to rehash. Over the phone, Rihanna discusses “polymagnet spring” things with her sibling, who has perfect cell service despite being on the subway. Hmm. I will focus on the implausibility of this other detail because I don’t understand the magnets.\n\nSide note: In the Mossad agent scene, Hathaway is doing her own makeup for the gala?!?! Celebrity nanny concierge Miles agreed with me: This would “never happen.”\n\nCourtesy Warner Brothers Entertainment Hathaway doing her own makeup for the damn Met Gala while Bonham-Carter (like all of us) looks on aghast.\n\nStep 9: We’ll need to see some ID.\n\nHow plausible? “I’m still reeling over the magnets.”\n\nBullock and Paulson work together to get the Ocean’s 8 crew fake identities for the gala and ensure they’re on the list for the big night. They get fake IDs and fancy dresses, too. This is so easily accomplished in the “Ocean’s” universe that I’m not even going to second-guess it. I’m still reeling over the magnets.\n\nStep 10: Become a caterer, and bring poison.\n\nHow plausible? “Fully depends on the public’s perceived importance of the guest at hand.”\n\nBlanchett, disguised as a nutritionist hired for the night, slips a little bit of vomit-inducing liquid into Hathaway’s vegan soup. Hathaway slurps it up and promptly runs to the bathroom to barf.\n\nJenna Amatulli, a HuffPost reporter who worked as a caterer in 2011, was skeptical that the soup poisoning could be executed unnoticed. “The mysterious substance in the soup would be hard to pull off without having someone on the inside who is complicit,” she said.\n\nAccording to Sean Perry, a caterer with various elite catering companies throughout New York, the success of Blanchett’s plan “fully depends on the public’s perceived importance of the guest at hand.”\n\nHe elaborated: “Would someone like me allow her ploy to affect someone so well-liked as Sir Elton John? Absolutely not. But if her attempted trickery targeted someone more loathsome, such as political luminaries, her actions would not only be purposefully unnoticed, but most likely encouraged.”\n\nCourtesy Warner Brothers Entertainment Bullock feeds Blanchett at Veselka in New York. Going to mark this as feasible because you have to believe in something in this cruel world!\n\nStep 11: There’s the rub.\n\nHow plausible? “I think it’d totally be possible to knick this.”\n\nOK, things are heating up! Awkwafina, dressed as a bathroom attendant, locks all the other stalls in the bathroom, so she has Hathaway in there *alone*. She then soothes the frantic vomitress by rubbing her neck ― and demagnetizing the diamond necklace in the process! She pockets the jewels as poor Hathaway pukes her Hathaguts out into the toilet.\n\nJ.D. Dillard is the writer and director of “Sleight” ― which, yes, is about sleight of hand. He also dabbles in the art himself. When asked about the plausibility of Awkwafina’s big move, he replied, “So my first thought is five pounds seems a little heavy — turns out that’s the weight of my Nespresso machine. I think it’d totally be possible to knick this — but transporting it without it visibly weighing down your clothing is another thing.”\n\nLuckily, Awkwafina doesn’t hold on to the jewels for too long.\n\nStep 12: Dirty dishes.\n\nHow plausible? “It’s a shit-show when dinner is over.”\n\nAwkwafina takes the necklace and ― in the blindspot carefully mapped out by Bullock and Rihanna ― drops it onto a busboy’s cart wheeling dirty dishes into the kitchen. To reiterate, she just drops the diamonds, uncovered, amongst all the nasty dirty dishes and food bits.\n\n“I think the necklace on a cart of dirty dishes could easily happen,” Amatulli said. “It’s a shit-show when dinner is over and the staff is pacing their clean-off.”\n\nPerry, however, offered a different interpretation. Because caterers often “can barely afford a Metro card, let alone a meal,” as he put it, he hypothesized that a diamond necklace would surely be noticed when a caterer or busboy snuck a taste of the fancy leftovers.\n\nCourtesy Warner Brothers Entertainment The schemers, schemin'.\n\nStep 13: Break it down.\n\nHow plausible? “It’s a ‘long, detailed process’ that could probably not be executed in a bathroom.”\n\nMindy Kaling ― a diamond expert dressed as a dishwasher who’s been here the whole time! ― takes the tray of dirty dishes and washes the Toussaint diamond off in the sink. She then surreptitiously takes the $150 million accessory to the employee bathroom in the back of the kitchen.\n\nShe sits on the toilet and pulls down the baby changing table ― which has been transformed into a full-blown diamond inspection station! Kaling then breaks down the Toussaint necklace into nine pieces, eight to distribute amongst the ladies and one to frame that sketchy art dealer.\n\nJack Sutton, the owner of Jack Sutton Fine Jewelry in New Orleans ― who, full disclosure, is my uncle ― said that he would be able to cut up a $150 million necklace “if it would be more desirable and profitable that way.” However, he said it’s a “long, detailed process” that could probably not be executed in a bathroom.\n\nHe added that if the jewels needed to be cleaned, a “kitchen sink would work.”\n\nStep 14: Search party.\n\nHow plausible? “She had some time to prep them on carrying jewelry weighing the same amount as a baby Maltese dog.”\n\nAt this point, the agents assigned to guard the Toussaint diamond necklace notice it’s missing from Hathaway’s neck. They place the entire museum on lockdown to search for it.\n\nDuring this time, Paulson slips the fake zirconium replica of the necklace into the pool in the Met’s Temple of Dendur. She then cries out that she found the missing jewels and the frantic search comes to an abrupt halt.\n\nHathaway puts on the fake necklace and the party resumes. (They don’t show the Mossad guard removing the necklace later that evening, but it seems he doesn’t realize the special magnet thingy is no longer necessary?)\n\nAwkwafina then surreptitiously passes out small chunks of the real Toussaint necklace to each member of the crew. They have been remade into earrings, bracelets and pendants to throw others off the scent. (The scent of diamonds.)\n\nThis part of the heist, Dillard believes, seems tenable. “If there’s some system in place, I feel like she can... easily pass pieces to the others on the team,” he said. “The hope being she had some time to prep them on carrying jewelry weighing the same amount as a baby Maltese dog.”\n\nCourtesy Warner Brothers Entertainment Tag yourself. I'm the Helena!\n\nStep 15: Fanning old flames.\n\nHow plausible? “Hair is like 70 percent of how I recognize people.”\n\nBullock, also attending the gala but disguised in a blonde wig, waits for her ex beau to come to the bar. She then knocks into him and slips a small string of diamonds into his jacket pocket, thus framing him for the whole thing. He gives a brief ― wait, was that? no, couldn’t be ― glance and then resumes his partying.\n\nClaire Fallon, a HuffPost reporter and person who has run into exes in the past, says she too might not recognize a former lover if he had such a dramatic hair change. “The wig would honestly throw me off a lot,” she said. “Hair is like 70 percent of how I recognize people.”\n\nStep 16: Ummm, wait what?\n\nHow plausible? “That’s what you get for being greedy, Cate!”\n\nHere’s where things get even crazier and the whole plot actually falls apart.\n\nWhile museum security was busy frantically searching for the Toussaint diamond, Blanchett and Qin Shaobo, who played acrobat Yen in “Ocean’s 11-13,” sneak into the actual Met costume exhibition to ― surprise! ― steal more jewels!\n\nShaobo somersaults his way through the exhibit, grabbing up all the European royalty-themed jewels along the way. He puts them in a plastic baggie which he then attaches to a toy submarine. Cate Blanchett reels it in with a remote control through a moat that’s part of the exhibition.\n\nHere lies the biggest plot hole of the film. Shaobo then replaces the stolen jewels with zirconium lookalikes, ostensibly made in the same 3D printer that yielded the necklace. But none of the “Ocean’s 8” crew ever did the glasses scanning thing with these jewels! The only one who saw the exhibition prior to its opening was Hathaway, who does a cute little promo video advertising the show. But she’s certainly not wearing the prominent scanner glasses we 3D printing experts know and love.\n\nMaybe, I thought, the con artists somehow used Hathaway’s promo video to make copies of the royal jewels. But Makelab’s Perla confirmed that the 3D scanning glasses could not take stock of objects on film. Rather, the actual goods must be scanned so the glasses can record their depth and size. Sadly, this ruins the entire plot of the movie because there is no way Blanchett could be holding that bag-o-fake-jewels. That’s what you get for being greedy, Cate!\n\nThere you have it. The plot of “Ocean’s 8,” thrilling and impressive as it may look, is beyond unfeasible ― it’s straight up impossible. Stay in school, kids. The grifter life is not sustainable no matter how good Rihanna makes it look! (Really good.)\n\nOh yes, and eventually Hathaway turns to the dark side and gets in on the grown-up bling ring herself. Hence “Ocean’s 8,” if you were keeping count. I’m not sure how likely it is that a rich and famous movie star would be swayed to a life of criminality by the prospect of more millions, but I’m going to let that slide because no multi-millionaire movie stars would talk to me.", "images": ["https://img.huffingtonpost.com/asset/5b16e2862200004500eea98d.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5bfef7703c000041040ebe03.jpg?ops=100_100", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/5b16e2402200004500eea98c.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5b16d0502000006505b937af.jpeg?ops=scalefit_970_noupscale", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5b16e4271a0000c504ce0a96.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5b1593402200003100eea778.png?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=1778_1000", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/5b16cb082000006505b937a3.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5b16cbd12000004100b937a7.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=scalefit_970_noupscale"], "top_img": "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=1778_1000", "keywords": [], "authors": ["Arts", "Culture Reporter"], "canonical_link": "https://www.huffpost.com/entry/how-feasible-oceans-8-heist-blow-by-blow-explanation_n_5b0efb3de4b0be10a4881dac", "title": "But How Feasible Is The 'Ocean's 8' Heist Really? A Blow-By-Blow Examination", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "We fact-checked the most glamorous con job in cinematic history.", "keywords": "Arts and Entertainment,Movies,jewelry,cate blanchett,Sandra Bullock", "og": {"title": "But How Feasible Is The 'Ocean's 8' Heist Really? A Blow-By-Blow Examination", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/how-feasible-oceans-8-heist-blow-by-blow-explanation_n_5b0efb3de4b0be10a4881dac", "site_name": "HuffPost", "locale": "en_US", "description": "We fact-checked the most glamorous con job in cinematic history."}, "article": {"tag": "Arts and Entertainment,Movies,jewelry,cate blanchett,Sandra Bullock", "section": "Culture & Arts", "author": "https://www.facebook.com/priscillamfrank", "published_time": "2018-06-08 05:45:17 -0400", "modified_time": "2018-06-08 14:23:52 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostArts", "title": "But How Feasible Is The 'Ocean's 8' Heist Really? A Blow-By-Blow Examination", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b1590481a00002700ce0892.jpeg?cache=w5yu1wrbvh&ops=1778_1000", "width": 1778, "height": 1000}, "description": "We fact-checked the most glamorous con job in cinematic history.", "creator": "@badgirlpripri"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b0efb3de4b0be10a4881dac", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "arts"}, "movies": [], "publish_date": 1528451117.0, "source": "http://www.huffingtonpost.com", "summary": ""}