{"url": "www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition", "text": "The delicate, fresh creations of Claire Ptak, of Violet Bakery, who will make Harry and Meghan’s wedding cake, are a sharp departure from the architectural confections of royal weddings past. Photograph courtesy Violet Bakery\n\nNext month, to mark the occasion of Prince Harry’s marriage to Meghan Markle, Julien’s, the L.A.-based “auction house to the stars,” will be selling five cake slices from “iconic” British royal weddings past. The lot includes a slice of brandy-infused fruitcake from the 2011 marriage of Harry’s brother William to Kate Middleton (with an estimated price of between six and eight hundred dollars), and one from the wedding of the boys’ parents, Prince Charles and Diana (eight to twelve hundred dollars), sold with a paper doily and an envelope, addressed to its original recipients and marked with Queen Elizabeth’s royal stamp. There is a slice from Charles’s wedding to his second wife, Camilla Parker Bowles; another from the wedding of Prince Andrew and Sarah Ferguson, in 1986; and, at a relative bargain rate of three to five hundred dollars, one from the union of Princess Anne and Captain Mark Phillips, in 1973. In the years since these confections were baked, their layers of marzipan may have turned from yellow to a dingy ochre, but the cake itself, loaded with sugar and spirits and dried fruit, is otherwise impressively preserved.\n\nElizabeth and Philip’s wedding, in 1947, featured a four-tiered cake weighing five hundred pounds. Photograph by Topical Press Agency / Getty\n\nIt was an eighteenth-century cookery writer named Elizabeth Raffald who first developed the formula to which each of these royal-wedding cakes more or less adhered. Since medieval times, all special occasions in England, from Christmas to christenings, had been celebrated with fruit cakes, which were optimally suited to an era before refrigeration. (As one modern-day food-safety specialist noted, “You are unlikely to see mould on a fruit cake for a very long time.”) Raffald’s innovation was to cover “bride cake,” as wedding cake was then called, in a layer of marzipan, followed by a bright white shell of the cement-like substance that came to be known as royal icing. This double coating made cakes that were good to look at but not necessarily to eat. Guests were left, one nineteenth-century baker remarked, with “a thick layer of white sugar which nobody cared about; a medium layer of almond paste, which everybody wished for, and did not always get; and an immense quantity of cake of which many only ate a few crumbs.”\n\nQueen Victoria’s cake for her wedding, in 1840, was the first to become a national obsession, an extension of the public’s fascination with the young queen herself. It was baked in a vast single layer—“a great beast . . . some ten feet in circumference,” as one observer put it. On top were figurines of Victoria and her betrothed, Albert of Saxe-Coburg and Gotha, wearing Roman dress, and also statues of turtle doves, Cupids, and one of Victoria’s beloved dogs. The cake’s picture was displayed in every print shop in London; in the weeks before the wedding as many as twenty-one thousand people visited the bakery on Bond Street, where a policeman was standing guard. Eighteen years later, the wedding of Victoria’s daughter Vicky, to Prince Frederick William of Prussia, featured the first multi-tiered royal-wedding cake. It stood seven feet tall, with elaborate sugar busts of the bride, the groom, and the bride’s parents, plus various naked Cupids, festoons of orange blossom, and allegorical statues representing innocence and wisdom.\n\nQueen Victoria’s wedding cake, from 1840, was the first to become a national obsession. Artwork courtesy The Mirror of Literature, Amusement, and Instruction\n\nFor more than a century afterward, royal-wedding cakes did not change much beyond their decorative flourishes. When Elizabeth and Philip were married, in 1947, wartime rationing was still in place, and there was something almost masochistic in the way the public revelled in the thought of the couple’s four-tiered “masterpiece” confection, which weighed five hundred pounds, was stuffed with currants and raisins donated by the Girl Guides of Australia, and featured scenes from the couple’s lives, including of Philip’s favorite sports: athletics, cricket, and sailing. (In 2015, a piece of this cake, still wrapped in its original baking parchment, was sold at auction for five hundred pounds.) For Kate and William’s wedding, the groom asked for a special extra cake of melted dark chocolate and broken rich-tea biscuits, but the couple’s main wedding cake would not have looked out of place on a Victorian banqueting table. Its maker, the luxury-cake designer Fiona Cairns, has said that she was given a “clear brief” that the cake must not be “ostentatious or grand.” Yet it still featured eight tiers of fruitcake rising more than a metre high and weighing a hundred kilos and decorated with seventeen types of sugar-paste flowers, each chosen by Kate for its symbolic meaning, including thistles for Scotland and lily of the valley for humility. The request for chocolate, and for modesty, looked like tiny gestures of rebellion from a prince who might secretly yearn to break free of his grandmother’s rituals but is too polite to do so.\n\nFurther Reading More from The New Yorker on the royal wedding.\n\nHarry and Meghan’s ceremony, on May 19th, will, in many ways, adhere to British royal tradition—the horse-drawn carriages, the commemorative coins. The couple will be married at St. George’s Chapel, at Windsor Castle, which has hosted royal weddings for centuries. But, because Harry is the younger brother, unlikely ever to become King, he and his bride can afford certain small freedoms—and their cake, baked by Claire Ptak, of the hip East London shop Violet Bakery, may be the sharpest departure of all. Ptak, like Markle a native Californian, has said that she grew up thinking that “fruitcake was sort of a cruel joke” (though I can attest that she has since learned to make a delicious Dundee-flavored one with candied Meyer lemons). Before moving to London, she trained at Chez Panisse, Alice Waters’s temple of seasonal, market-driven cooking in Berkeley. Her cake for the upcoming wedding will be made of organic Amalfi lemon and English elderflower, incorporating the “bright flavours of spring.”\n\nFor the wedding of Prince William and Kate Middleton, in 2011, the cake designer Fiona Cairns was given a “clear brief” that her creation must not be “ostentatious or grand.” Photograph from ROTA / Camera Press / Redux\n\nWhat interests Ptak in baking is not visual grandeur but, as she puts it in her “Violet Bakery Cookbook,” the “minutiae of flavour and balance.” Her first venture in London was a wildly popular stall on Broadway Market, which offered cupcakes and whoopie pies, many of them made with seasonal produce, from nectarine to geranium leaf. In 2010, she opened a shop on Wilton Way, in Hackney, a half-gentrified neighborhood in East London. The cramped but elegant space, which faces a public-housing complex, features chalkboard menus and an antique madeleine mold hanging on the wall. On a visit earlier this month, I bought a lemon bar that looked like an unremarkable brown rectangle but tasted revelatory, the perfect balance of buttery and tart. In this and in all her baked goods, Ptak’s style is rustic-chic, a kind of elegant imperfection more in tune with an idealized country village than a gilded palace. Her Instagram account is a parade of uneven galettes and pies with sticky red plums or sour cherries spilling out, a charmingly stained page containing a recipe for snickerdoodles (from her mother, who taught her to bake), and wedding cakes that look delicate and fresh: three simple tiers of moist sponge coated in satiny buttercream, often tinted with fruit puree, and strewn with seasonal blooms and petals. Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, Ptak’s cakes are designed to eat, not to keep.\n\nEven the simplest of wedding cakes, though, is subject to symbolic interpretation. To some observers, the couple’s choice of Violet Bakery will confirm once again that Meghan, an actress who once ran a life-style Web site, has great taste (better than Kate’s, as legion cruel fashion bloggers have judged). To others, the cake might represent all the welcome ways in which Harry’s marriage to Markle—an American, biracial divorcée—reflects progressive British values. But what Ptak’s lemon-and-elderflower confection most surely reflects is the transformation of British attitudes toward baking in the years since William and Kate were married. Thanks in large part to the massive popularity of “The Great British Baking Show,” Brits now, as Ptak herself has noted, have developed a taste for cakes beyond “stale sponges.” For all the divisions in modern British society, we are now a nation of home bakers, ready to whip up a batch of Ptak’s coffee-cardamom-walnut cakes or Mary Berry’s fresh-strawberry tartlets for our own royal-wedding-watching parties this weekend.\n\nRoyal celebrations of the past have left lasting traces on British food culture. The curried coronation chicken, created by Constance Spry to mark Elizabeth’s coronation, in 1953, is still a beloved summer dish. Victoria sponge, a simple jam-filled sandwich cake, which was baked in profusion to celebrate Queen Victoria’s Golden Jubilee, in 1887, has never gone out of fashion. Already, there are signs that Ptak’s lemon-and-elderflower creation will become a new British favorite. Iceland, a low-cost supermarket chain selling mostly frozen foods, has created its own knock-off version, priced at just eight pounds. But Ptak told me recently that she hopes her style of baking points backward as much as forward. Her royal wedding cake will encourage people to think about things like flavor, provenance, and the seasons—“all of which,” she said, “are actually rather traditional.”", "images": ["https://media.newyorker.com/photos/590951ae019dfc3494e9db73/4:3/w_480%2Cc_limit/Luke-Barr-book.jpg", "https://media.newyorker.com/photos/5af45ec37fb33744eca3b053/1:1/w_200%2Cc_limit/Royal-Wedding-Icon-051018.jpg", "https://media.newyorker.com/photos/5afb018fdda2d225595b0dbb/master/w_1600%2Cc_limit/Wilson-Royal-Wedding-Cake-3.jpg", "https://media.newyorker.com/photos/5afb018f7295c82c7924c6ca/master/w_1600%2Cc_limit/Wilson-Royal-Wedding-Cake-2.jpg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/photos/59095c54019dfc3494e9f753/4:3/w_480%2Cc_limit/Food-Imagination.jpg", "https://media.newyorker.com/photos/5afb019052bc692d8918c70a/master/w_1600%2Cc_limit/Wilson-Royal-Wedding-Cake-1.jpg", "https://media.newyorker.com/photos/5909727febe912338a377420/4:3/w_480%2Cc_limit/Twilley-Teaching-Grownups-How-to-Eat.jpg", "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1280,c_limit/wilson-royal-wedding-cake.jpg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo.f1893bac6dafe13d6d5bad671a5bee2345efa44d.svg", "https://media.newyorker.com/photos/59096ef01c7a8e33fb38e824/4:3/w_480%2Cc_limit/Wilson-Reading-About-People-Eating.jpg", "http://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header.6e34c81346bc43475ffd572e6c2eb3e125927148.svg", "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/master/w_2560%2Cc_limit/wilson-royal-wedding-cake.jpg"], "top_img": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1280,c_limit/wilson-royal-wedding-cake.jpg", "keywords": [], "authors": ["Bee Wilson", "Bee Wilso", "Nicola Twille"], "canonical_link": "https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Bee Wilson", "copyright": "Copyright (c) Condé Nast 2020", "description": "Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.", "id": "5afaffc85474413779cf5a98", "keywords": "annals of gastronomy,prince harry,wedding cake,royal weddings,meghan markle", "news_keywords": "annals of gastronomy,prince harry,wedding cake,royal weddings,meghan markle", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5afaffc85474413779cf5a98", "parsely-metadata": "{\"description\":\"Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.\",\"image-16-9\":\"https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1000,c_limit/wilson-royal-wedding-cake.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/1:1/w_1000,c_limit/wilson-royal-wedding-cake.jpg\"}", "og": {"description": "Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.", "image": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1280,c_limit/wilson-royal-wedding-cake.jpg", "site_name": "The New Yorker", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition", "type": "article", "url": "https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.", "domain": "https://www.newyorker.com", "image": {"src": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1280,c_limit/wilson-royal-wedding-cake.jpg?mbid=social_retweet"}, "site": "@NewYorker", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.newyorker.com", "summary": ""}