{"url": "www.tv.com/shows/live-with-kelly-and-ryan/reviews/", "text": "You must only upload images which you have created yourself or that you are expressly authorised or licensed to upload. By clicking \"Publish\", you are confirming that the image fully complies with TV.com’s Terms of Use and that you own all rights to the image or have authorization to upload it.\n\nPlease read the following before uploading\n\nDo not upload anything which you do not own or are fully licensed to upload. The images should not contain any sexually explicit content, race hatred material or other offensive symbols or images. Remember: Abuse of the TV.com image system may result in you being banned from uploading images or from the entire site – so, play nice and respect the rules!", "images": ["http://img2.tvtome.com/i/tvp/sm/204554.jpg", "http://img2.tvtome.com/i/tvp/gQ/1689.jpg", "http://tv-avatar-prod.s3.amazonaws.com/AprilFox.jpg", "http://www.tv.com/public/images/tvcom_logos/TVcomLogoUS.png", "http://img2.tvtome.com/i/tvp/sm/204555.jpg", "http://static.tvtome.com/images/misc/grey.gif", "http://img2.tvtome.com/i/tvp/sm/204657.jpg", "http://img2.tvtome.com/i/tvp/sm/204484.jpg", "http://img2.tvtome.com/i/tvp/sm/203712.jpg", "http://www.tv.com/public/images/Prime-Video-Color-Black.png", "http://img2.tvtome.com/i/tvp/sm/204531.jpg", "http://www.tv.com/public/images/lists/ajax-loader-blue.gif"], "top_img": "http://img2.tvtome.com/i/tvp/gQ/1689.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/tv/live-with-regis-and-kelly/user-reviews", "title": "LIVE with Kelly and Ryan", "meta_data": {"author": "TV.com", "copyright": "© 2020 TV.com", "description": "Latest LIVE with Kelly and Ryan review: I don't want to be rude about someone's craft but Kelly has done the show for a long time.. honestly ...", "application-name": "TV.com", "msapplication-TileColor": "#67b7ed", "msapplication-TileImage": "/public/images/tvcom_logos/ie10-pin.png", "msapplication-starturl": "/", "og": {"site_name": "TV.com", "url": "http://www.tv.com/shows/live-with-kelly-and-ryan/", "image": "http://img2.tvtome.com/i/tvp/gQ/1689.jpg", "title": "LIVE with Kelly and Ryan", "type": "tv_show", "description": "Live! with Kelly & Ryan, known formerly as \"Live with Kelly\", \"Live! with Kelly and Michael\" and \"Live with Regis and Kelly\" has been entertaining people every morning since 2001. Kelly Ripa and Michael Strahan who takes over co-hosting duties as Regis' successor has charm, energy and charisma to boot and is a great match for Kelly. Once known as Daytime's Dynamic Duo, Regis Philbin and Kelly Ripa, with their spontaneous and enthusiastic daily chat sessions - and their ability to playfully needle one another - the pair brought life to any and every topic as they share their morning coffee with viewers.\r\nAlthough it wasn't always Regis and Kelly. At first it was Regis and Kathie Lee. In late July 2000 Kathie Lee Gifford left the show, from that point till Febuary 2001 the show was known as \"Live with Regis\". Regis had a different co-host each day until they found the perfect co-host, Kelly Ripa.\r\nThe show airs every morning from the WABC studios in New York City. Regis Philbin, who has become a cultural icon in television broadcasting, was honored with a Daytime Emmy Award for Outstanding Talk Show Host in May 2001 for \"Live With Regis and Kelly\". Joining the show on February 12, 2001, Kelly Ripa's endearing personality quickly won the hearts of Americans from coast to coast when she joined the show in February 2001. Her quick wit and broad smile proves the perfect complement to Regis' quirky style of entertainment."}, "fb": {"app_id": 63749637650}}, "movies": [], "publish_date": null, "source": "http://www.tv.com", "summary": ""}