{"url": "en.wikipedia.org/wiki/Troian_Bellisario", "text": "American actress\n\nTroian Avery Bellisario ( ; born October 28, 1985)[1] is an American actress. She is best known for starring as Spencer Hastings in the television series Pretty Little Liars (2010–2017).\n\nBorn in Los Angeles, California, she is the daughter of producers Donald P. Bellisario and Deborah Pratt. Bellisario made her acting debut in her father's 1988 film Last Rites at the age of three. She continued to have roles produced by her father, mainly in television shows such as Quantum Leap, First Monday, and NCIS, and in 1998, she acted in the direct-to-video comedy film Billboard Dad. In 2010, she received praise for her leading performance in the film Consent for which she won the Vision Fest Award for Best Acting by a Female Lead and the FirstGlance Philadelphia Award for Best Actress.\n\nIn 2009, Bellisario landed the lead role of Spencer Hastings in the Freeform series Pretty Little Liars (2010–2017). For her performance, she has won two Teen Choice Awards out of six nominations and a Young Hollywood Award. In addition to her work on Pretty Little Liars, Bellisario also starred in the WIGS episode series Lauren, for which she received critical acclaim and won the New York Film Festival Award for Best Performance by an Actress and was nominated for the Streamy Award for Best Female Performance—Drama. She went to star in the drama film Feed (2017), the romantic science fiction film Clara (2018), and Richard Linklater's mystery comedy-drama Where'd You Go, Bernadette (2019)\n\nBellissario has produced and co-written multiple short films and indie projects, and appeared in a number of independent short films over her career. In 2016, she made her directorial debut with the fifteenth episode from the seventh season of Pretty Little Liars, \"In the Eye Abides the Heart\", and has since gone on to direct episodes of Famous in Love (2018) and Good Trouble (2019 - present). Bellisario has been in a relationship with Canadian actor Patrick J. Adams since 2009; the couple have collaborated together on multiple film and television projects and share one daughter together.\n\nEarly life [ edit ]\n\nTroian Avery Bellisario was born and raised in Los Angeles. Her parents are producers Donald P. Bellisario and Deborah Pratt.[2] Donald created Magnum, P.I., Quantum Leap, and NCIS, among other TV series. She has a younger brother,[3] three half-sisters, two half-brothers and is a step-sister of actor Sean Murray and producer Chad W. Murray (step-brothers). Her father is of Italian and Serbian descent. Her mother is African American, and also has some French and English ancestry.[4]\n\nBellisario attended Campbell Hall School in Studio City, California from kindergarten through twelfth grade,[5] where she was the valedictorian of her class.[6] After high school, Bellisario attended Vassar College for a couple months before taking a break for the sake of her mental health as she felt the institution only enhanced her need for perfection.[7] She graduated with a Bachelor of Fine Arts degree from the University of Southern California in 2009.[8]\n\nCareer [ edit ]\n\nBellisario made her acting debut in the 1988 film Last Rites at the age of three.[9] From 1990 to 2007, she guest starred on such television series as Quantum Leap, Tequila and Bonetti, JAG, First Monday and NCIS, television series that were produced by her father Donald P. Bellisario. In the NCIS episode \"Red Cell\" (Season 2, Episode 20) she played Sarah McGee, sister of Special Agent Timothy McGee, played by her real-life stepbrother Sean Murray.\n\nIn 1998, she co-starred with Mary-Kate and Ashley Olsen in the film Billboard Dad. Beginning in 2006, Bellisario began appearing in a number of independent short films namely, Unspoken, Archer House and Intersect. In November 2009, Bellisario was cast as Spencer Hastings in the TV series Pretty Little Liars based on the book series of the same name by Sara Shepard.[10] In October 2011, Bellisario announced she was in the process of writing and creating her own film, which was successfully funded through Kickstarter on November 16, 2011. Filming ended in December 2011 and the film was officially completed by August 2012.[11]\n\nIn 2014, she starred in the music video for The Head and the Heart's song \"Another Story\".[12] Bellisario also starred in Immediately Afterlife, a short film about two cult members who are the only survivors of their group's mass suicide, playing Bennett, alongside her Pretty Little Liars co-stars Shay Mitchell (Emily), Ian Harding (Ezra Fitz) and Nolan North (Peter Hastings).[13] In 2015, she was cast in a leading role in the American remake of the French-Canadian film Martyrs.[14][15] In 2015, Bellisario and fiancée Patrick J. Adams filmed short film We Are Here in Haida Gwaii, which Bellisario wrote and starred in.[16] In 2017, Bellisario starred in her feature film, Feed, which she also wrote and produced. The film was written based on Bellisario's own experiences with an eating disorder.[17]\n\nOn April 7, 2016, it was announced that Bellisario would be directing Season 7, Episode 15 of Pretty Little Liars.[18] This made her one of the first in the cast, alongside Chad Lowe, to direct an episode on the series. In 2020, Bellisario appeared as the bride character Jenna Marshall from the episode \"Til Dex Do Us Part\" in Stumptown.[19]\n\nIn March 2020, Bellisario will play the lead role of Claire in the CBS political drama pilot Ways & Means which was written by Ed Redlich.[20]\n\nPersonal life [ edit ]\n\nBellisario started dating Suits star Patrick J. Adams after they met on the set of the play Equivocation in 2009.[21] The couple briefly split, but after Adams' guest appearance as Hardy in Pretty Little Liars, 2010, the two got back together.[22] Since working on Equivocation and Pretty Little Liars, the couple also worked together on the 2012 short film The Come Up, on the USA series Suits in which Adams stars, and the short film We Are Here. Bellisario and Adams married on December 10, 2016 in Santa Barbara, California.[23][24] Bellisario was one of the guests at Meghan Markle’s wedding to Prince Harry at St George's Chapel, Windsor Castle on May 19, 2018. In October 2018 Adams announced the birth of the couple's daughter.[25]\n\nBellisario revealed in early January 2014 that she went through personal problems through high school, resulting in an eating disorder and self-harming problems. \"I was the youngest daughter, the perfect little girl,\" she said. \"My school was a very intense college prep school. So it was about wanting to please my father and mother and wanting to be perfect to everybody.\"[26]\n\nBellisario delivered the USC School of Dramatic Arts (her alma mater) commencement speech in 2014. \"Once you start creating without anybody's permission, you own it. And because you learned it here, you know the power of a story. You'll never feel embarrassed when people ask you, 'What do you do?' You will look them in the eye and say, 'I tell stories.' And people will line up to work with you,\" Bellisario told the graduating class.[27]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 1988 Last Rites Justin's daughter 1998 Billboard Dad Kristen Bulut 2006 Unspoken Jani Short film 2007 Archer House Tatum Short film 2009 Intersect Victoria Short film 2009 Before the Cabin Burned Down Meg Short film 2010 Consent Amanda 2010 Peep World Film set P.A. 2011 A November Girlfriend Short film 2011 Pleased to Meet You Carson 2012 Jessica Short film 2012 Joyful Girl Belle Short film 2013 C.O.G. Jennifer 2013 Exiles Juliet Short film; also writer and executive producer 2014 Immediately Afterlife Bennett Short film 2015 Surf Noir Lacey Short film 2015 Martyrs Lucie Jurin 2015 Still a Rose Juliet Short film 2015 Amy Amy Short film 2016 In the Shadows of the Rainbow Short film 2017 Chuck Hank and the San Diego Twins Claire 2017 Feed Olivia Grey Also writer and producer 2018 We Are Here Woman Short film; also producer and writer 2018 Clara Clara 2019 Where'd You Go Bernadette Becky 2019 Like Turtles Molly Short film; also producer\n\nTelevision [ edit ]\n\nWeb [ edit ]\n\nMusic videos [ edit ]\n\nDirector [ edit ]\n\nYear Title Episode(s) Notes 2017 Pretty Little Liars \"In the Eye Abides the Heart\" Directorial debut 2018 Famous in Love \"Guess Who's (Not) Coming to Sundance?\" 2019–present Good Trouble \"Swipe Right\", \"Fragility\"\n\nAwards and nominations [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Troian_Bellisario_in_Manila.jpg/220px-Troian_Bellisario_in_Manila.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/7/7a/Troian_Bellisario_in_Manila.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Troian_Bellisario_in_Manila.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Troian_Bellisario", "title": "Troian Bellisario", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Troian_Bellisario_in_Manila.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}