{"url": "http://exclaim.ca/comedy/article/tracy_morgan-staying_alive", "text": "Tracy Morgan Staying Alive\n\nPublished Jul 28, 2017\n\n8\n\nStaying Alive, Tracy Morgan's glorious return to the stage, isn't just a recounting of his 2014 near-death accident, it's a celebration of his recovery. Kicking off with a wonderfully executed title card showing Morgan strutting down the street to the music of the Bee Gees, à la Saturday Night Fever, Morgan inserts a joke where he pays for an lavish coat in cash, pulling money from a cloth Walmart bag, while giving the viewer insight into just how real and honest this special is willing to get.Walking out in front of the crowd at the Count Basie Theatre in New Jersey, Morgan wastes little time getting real. Decked out in a white John Travolta suit, the Bronx-raised comedian delivers a touching and riotous set that often resembles a one man show, as he recounts his life-changing experience, beginning with his time spent in the afterlife, musing on how he met God, Ol' Dirty Bastard, Notorious B.I.G. and Michael Jackson.Throughout the 60-minute special, Morgan's material never comes off entirely mind-blowing or astute, but it does come from actual events that Morgan never shies away from reciting, from asking his doctor if his dick still worked, to recovering from brain trauma and informing his speech therapist that \"This is the way I've always talked.\"But Morgan is resourceful enough to avoid sticking completely to his accident and its aftermath, instead he uses this experience to parlay into jokes describing family members who visited him during his hospital stay, about how his wife shamed him out of feeling sorry for himself, and how, when he returns to heaven, Jesus will be the cool guy at the party hanging with his comedian friend, Jimmy Mack (who perished in the same crash).Although there are stretches that finds Morgan rambling and unfocused, there's truly no other special out there quite like Staying Alive for its candour, swagger, intelligence, touching truth and for its ability to laugh at mortality and to revel in beating death.Exclaim! is reviewing every standup comedy special currently available on Netflix Canada , including this one. You can find a complete list of reviews so far here", "images": ["http://exclaim.ca/assets/icons/spotify.png", "https://www.facebook.com/tr?id=1852537211683832&ev=PageView&noscript=1", "http://b.scorecardresearch.com/p?c1=2&c2=17938551&cv=2.0&cj=1", "https://exclaim.ca//images/tracy-morgan.jpg", "http://exclaim.ca/images/exclaim-apr2020-cover-jessie_reyez-560w.jpg", "http://exclaim.ca/assets/images/ocreates_w.png", "http://exclaim.ca/images/tracy-morgan.jpg"], "top_img": "http://exclaim.ca/images/tracy-morgan.jpg", "keywords": [], "authors": [], "canonical_link": "http://exclaim.ca/comedy/article/tracy_morgan-staying_alive", "title": "Tracy Morgan Staying Alive", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0, maximum-scale=1.0", "keywords": "comedy, reviews, album, netflix, netflixmarathon", "description": "Staying Alive, Tracy Morgan's glorious return to the stage, isn't just a recounting of his 2014 near-death accident, it's a celebration of h...", "og": {"title": "Tracy Morgan Staying Alive", "type": "website", "image": {"identifier": "http://exclaim.ca/images/tracy-morgan.jpg", "secure_url": "https://exclaim.ca/images/tracy-morgan.jpg", "width": 745, "height": 497}, "url": "http://exclaim.ca/comedy/article/tracy_morgan-staying_alive", "description": "Staying Alive, Tracy Morgan's glorious return to the stage, isn't just a recounting of his 2014 near-death accident, it's a celebration of h..."}, "twitter": {"image": "https://exclaim.ca/images/tracy-morgan.jpg", "card": "summary_large_image", "site": "@exclaimdotca", "title": "Tracy Morgan Staying Alive", "description": "Staying Alive, Tracy Morgan's glorious return to the stage, isn't just a recounting of his 2014 near-death accident, it's a celebration of h..."}, "fb": {"app_id": 1633498506944361, "pages": 181835542119}}, "movies": [], "publish_date": null, "source": "http://exclaim.ca", "summary": ""}