{"url": "www.newidea.com.au/george-clooney-helped-brad-pitt-and-jennifer-aniston-get-back-together", "text": "The actor told friends he’s responsible for encouraging Brad to reignite his romance with former wife Jennifer Aniston, who George has always had a close friendship with.\n\nJust last weekend, George and Brad were spotted out together for the first time in more than five years – marking a new chapter in their friendship.\n\nThe pair enjoyed dinner with other Hollywood heavyweights including Sean Penn, Bradley Cooper and Laura Dern in LA, with George even using Jen Aniston’s private bodyguard.\n\nAnd it seems George didn’t hold back in telling dinner guests just how happy he is that Brad and Jen have reunited.\n\nBrad, Jen and George have been friends for years Getty\n\n‘George has always hated Ange and really disliked the way she controlled Brad throughout their marriage,’ says a source.\n\n‘He loved Brad and Jen when they were together and was devastated when they split – especially when he found out it was because of Ange, who he’d never heard good things about.\n\n‘So when Ange and Brad split, George was the first person to call him and reconnect – and also plant the seed about reaching out to Jen.\n\n‘He’d stayed in contact with Jen even after her divorce from Brad – and they’ve never stopped being close.\n\nWhen George heard that her marriage to Justin was on the rocks, he really stepped up efforts to reconcile the pair.\n\n‘Now it’s happened, he’s out there telling anyone who’ll listen that he’s responsible. He’s pretty chuffed about it.’\n\nWhile Brad would’ve been more than happy to finally catch up with George and Sean – friends who he wasn’t allowed to hang out with while he was married to Ange – one notable no-show at the pre-Oscars weekend dinner was Jen.\n\nSources say she and Brad chose not to go to the restaurant together, to avoid any public scrutiny so soon after her official split from husband Justin Theroux – however it’s believed she caught up with Brad and George later.\n\n‘Jen lent George her bodyguard, knowing he and Brad would be coming back to her place in Bel Air after dinner,’ says a source.\n\n‘Given that George and Amal are mostly based in the UK now, he doesn’t have his own security detail in LA anymore – so Jen was only too happy to help.\n\n‘After the dinner, George and Brad went back to her place and they had a nightcap. Like old times.\n\n‘Brad raved about what a great mum Jen has been to his kids – that made him fall in love with her even more. And because George is a new dad he could really appreciate it.\n\n‘Brad said the kids have taken to Jen and they get really upset when they have to leave. He’s really enjoyed watching them bond.’\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://www.newidea.com.au/media/6671/161109_jennifer_aniston_brad_pitt_divorce.jpg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/6671/161109_jennifer_aniston_brad_pitt_divorce.jpg", "keywords": [], "authors": ["New Idea"], "canonical_link": "https://www.newidea.com.au/george-clooney-helped-brad-pitt-and-jennifer-aniston-get-back-together", "title": "George Clooney helped Brad Pitt and Jennifer Aniston get back together", "meta_data": {"language": "en-us", "description": "George Clooney’s friendship with Brad Pitt all but crumbled after ex-wife Angelina Jolie banned them from seeing each other during their tumultuous marriage, but it appears the Ocean’s Eleven star has had the final laugh.", "news_keywords": "Brad Pitt, Jennifer Aniston, Brad Pitt and Jennifer Aniston, George Clooney, George Clooney got Brad Pitt and Jennifer Aniston back together, Brad and Jen, Brad and Jen back together, George and Amal Clooney, Justin Theroux, Angelina Jolie, celeb news, latest celeb news, celebrity news, latest celebrity news, celeb goss, celebrity goss, celebrity gossip, latest celebrity gossip, George Clooney helped Brad Pitt and Jennifer Aniston get back together", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/george-clooney-helped-brad-pitt-and-jennifer-aniston-get-back-together", "title": "Revealed: Who got Brad Pitt and Jennifer Aniston back together", "description": "George Clooney’s friendship with Brad Pitt all but crumbled after ex-wife Angelina Jolie banned them from seeing each other during their tumultuous marriage, but it appears the Ocean’s Eleven star has had the final laugh.", "image": {"identifier": "http://www.newidea.com.au/media/6671/161109_jennifer_aniston_brad_pitt_divorce.jpg", "width": 2000, "height": 1080}}, "twitter": {"title": "George Clooney helped Brad Pitt and Jennifer Aniston get back together", "description": "George Clooney’s friendship with Brad Pitt all but crumbled after ex-wife Angelina Jolie banned them from seeing each other during their tumultuous marriage, but it appears the Ocean’s Eleven star has had the final laugh.", "image": "http://www.newidea.com.au/media/6671/161109_jennifer_aniston_brad_pitt_divorce.jpg", "url": "https://www.newidea.com.au/george-clooney-helped-brad-pitt-and-jennifer-aniston-get-back-together"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1520892095.31, "source": "http://www.newidea.com.au", "summary": ""}