{"url": "https://en.wikipedia.org/wiki/The_Bachelor_(season_22)", "text": "No.\n\noverall No. in\n\nseason Title Original air date Prod.\n\ncode U.S. viewers\n\n(millions) Rating/share\n\n(18–49)\n\n216 1 \"Week 1: Season 22 Premiere\" January 1, 2018 ( ) 2201 5.48[40] 1.5/5[40]\n\nThis season begins with Arie arrived at the rental bachelor pad home for the tenure of the season, he is then greeted by his friend and season seventeen Bachelor Sean Lowe, his wife Catherine and their son Samuel. Sean offers his advice on being the bachelor and Catherine provides parenting tips. The competition commences later in the night as Arie greets the women as they arrive at the mansion. Tia holds a little wiener to represent the small town she hails from; Bri, a sports reporter, tosses Arie a catch; Valerie gives a ballroom dance; Bekah M. rides a 1965 Ford Mustang up to the mansion; Jessica recognizes Arie as her father met him a few years ago; Becca K. holds a black velvet ring box to give Arie a proposal; Annaliese wears a mask to recall Arie's nickname \"kissing bandit\" and Maquel rides an IndyCar race car, to dismay from the other girls. Once all the women are in the mansion, Arie and Brittany T. ride miniature cars outside the mansion, Kendall sings a song while playing her ukulele, Caroline brings a box of pizza to eat a slice, Jenna gives Arie a foot massage. In the end, Arie selects Chelsea to receive the first impression rose. At the rose ceremony, Ali, Amber, Bri, Brittane J., Jessica, Lauren J., Nysha and Olivia are sent home.\n\n217 2 \"Week 2\" January 8, 2018 ( ) 2202 5.56[41] 1.4/5[41]\n\nBecca K. gets the first one-on-one date of the season. She gets to ride a motorcycle with Arie and they travel to his home for a tour. There, they get a surprise visit from Rachel Zoe and Becca receives a set of clothes and Louboutin heels, plus the gift of a necklace and two pairs of earrings. Arie and Becca discuss her painful past and Arie gives her a rose. Krystal also gets a one-on-one date with Arie and they fly to his hometown of Scottsdale, Arizona for a tour of the high school Arie attended. They stop by his parents' house where Krystal meets Arie's parents, including former race car driver Arie Luyendyk, his younger brother and his sister-in-law. They arrive back in Los Angeles and visit the Bradbury Building where Krystal shares some of her backstory with Arie. In the end, Arie gives her a rose and they are given a private concert by Connor Duermit inside the Los Angeles Theatre. Fifteen ladies take part in the first group date: a demolition derby race. Annaliese had a traumatic injury on a bumping car as a child, which influences her ability to enjoy the date. Chris Harrison and race car driver Robby Gordon present the event. Seinne emerges victorious and is declared the winner. After the derby event, Arie informs the girls that Brittany T. has been sent to hospital due to minor injuries. Bibiana starts a dramatic argument with the other ladies and threatens to leave. Seinne ends up with the group date rose. At the cocktail party, Brittany receives the \"Most Hardcore\" certificate award. Bibiana's drama continues when she interrupts Lauren B. and Krystal as they compete to spend time one-on-one with Arie. In the rose ceremony, Jenny, Lauren G. and Valerie are eliminated.\n\n218 3 \"Week 3\" January 15, 2018 ( ) 2203 6.61[42] 1.8/6[42]\n\nEight ladies go on a group date to take part in a wrestling event, dubbing themselves the \"Gorgeous Ladies of Bachelor\". Angelina Altishin and Ursula Hayden of Gorgeous Ladies of Wrestling train them. Tia and Bibiana feel overwhelmed by the training and Arie comforts Tia. They divide into four teams of two. Arie opens the event by wrestling with professional wrestler and former The Bachelorette contestant Kenny King. They spend the night at Caravan Outpost in Ojai. Bibiana discusses Krystal's irritating behavior with Arie. Bekah M. gets the group date rose, despite Krystal thinking she has the strongest connection with him. Lauren S. gets the one-on-one date of the week. Arie meets her and they fly to Napa Valley. They spend time inside the winery, but Arie decides they lack romantic chemistry and Lauren S. is sent home. Seven ladies take part in a group date at a park, where Arie introduces them to his dog, Bastian. The women play with dogs and train them to perform tricks for a show. Annaliese had several traumatic instances with dogs in her childhood, which causes her to be nervous. The women have to perform the show at The Grove. Chris Harrison and Fred Willard present the event, which they call \"Arie's Amazing Acrodogs\". Chelsea gets the group date rose. At the cocktail party, Bibiana sets up a daybed outdoors with a telescope, though Lauren B. was the first one to discover the place before Bibiana claimed the spot. Tia presents moonshine to Arie. Annaliese and Arie decide they do not have mutual attraction or a future connection and she is eliminated before the ceremony. At the rose ceremony, Bibiana is eliminated.\n\n219 4 \"Week 4\" January 22, 2018 ( ) 2204 6.38[43] 1.8/6[43]\n\nChris Harrison tells the ladies they are traveling to South Lake Tahoe, California to meet up with Arie. Seinne gets the one-on-one date and they take a thrilling parasailing ride on a boat over Lake Tahoe. They dine at Hard Rock Lake Tahoe in Stateline, Nevada and share their stories with each other. Arie gives her a rose, they enjoy a private concert with Lanco inside. At the hotel, Maquel receives a call from her mother and learns that her grandfather has died. She subsequently leaves the competition. The twelve ladies chosen for a group date head into the wilderness where they meet survival experts Mykel and Ruth Hawke. The women learn three survival skills: drinking urine from a thermos, eating worms and bugs and exploring the vast wilderness with a provided map divided between three teams of four. Krystal recalls when she attended a camp. Tia ends up receiving the date rose. Bekah M. gets the second one-on-one date and she and Arie take a horseback ride through the foothills of Lake Tahoe until they reach a bathtub. Bekah finally reveals to Arie that she is 22. In the end, Arie gives Bekah the rose. Chris shows up at the hotel and announces that the cocktail party is cancelled. At the rose ceremony, Krystal wants to talk with Arie before the ceremony begins. In the end, Brittany and Caroline are eliminated from the competition.\n\n220 5 \"Week 5\" January 29, 2018 ( ) 2205 6.36[44] 1.7/6[44]\n\nThe remaining ladies travel to Fort Lauderdale, Florida, where Maquel has returned to rejoin the competition. Chelsea gets the one-on-one date with Arie on a houseboat and riding on a jet ski. They have dinner at an antique car museum where Chelsea confides to Arie about her past relationship and her son. Arie gives her a rose and they dance to a song by Tenille Arts backstage. The eleven ladies chosen for a group date go bowling. Arie splits the women into two teams, named The Spare Roses and The Pin Ups. He reveals that the winning team will go to the after party, while the losers will go back to the hotel. The Spare Roses win the game, but after Arie changes his mind and invites both teams to the after party, Krystal begins to show her frustration. They return to the hotel where Krystal decides to skip the after party, calling Arie a liar. Arie visits Krystal in her room and confines her to the room after they talk about Krystal's hurt feelings. She later changes her mind and joins the others, who confront her separately about her hypocrisy. Lauren B. gets the group date rose. Tia has a one-on-one date at the Everglades, riding a hydro boat with Arie and stopping by an old wooden house to eat three delicacies: fried gator, corn and frog legs. After dinner, Arie hands the rose to her. The cocktail party takes place at Bonnet House where Krystal's behavior becomes more irrational, causing others to be upset. At the rose ceremony, Ashley, Maquel and Marikh are eliminated.\n\n221 6 \"Week 6\" February 5, 2018 ( ) 2206 6.82[45] 1.8/7[45]\n\nThe ten ladies travel to Paris, France to stop at U by Uniworld cruise boat on the Seine River. Chris Harrison announces there will be four dates instead of the regular three. Lauren B. gets a one-on-one date with Arie, riding a boat and sightseeing around the city including Notre-Dame de Paris. They dine together at Le Grand Véfour and reveal their backstories. Arie relates how his ex-girlfriend was pregnant but suffered a miscarriage, and Lauren tells him she was previously engaged. Arie gives her a rose. The six ladies chosen for a group date take part in a Moulin Rouge Féerie cabaret inside the theater. They learn choreography, with Seinne demonstrating her dancing experience. Moulin Rouge artistic director Miss Janet announces the best performing lady will receive a rose to perform on stage with Arie. At the cocktail party, Arie has discussions with each of the ladies to open up their feelings, and Bekah M. receives the group date rose. She and Arie start the show for the night, while the rest of the girls sit in the audience. Kendall and Krystal get the two-on-one date and travel to Château de Breteuil in Yvelines to meet with Arie. They race through a hedge maze and Krystal finds Arie first. Krystal confides in Arie that Kendall is not ready for marriage, and Kendall talks to Krystal privately about it afterwards. Arie then announces the date will continue at a building close to Eiffel Tower. Kendall receives the rose, sending Krystal home. Arie and Kendall kiss at the top of Eiffel Tower. Jacqueline gets a one-on-one date with Arie, but their car breaks down. They go into a fashion store, where Jacqueline selects a dress to wear. They have lunch at Maxim's restaurant and she receives a rose from Arie. In the rose ceremony at Musée des Arts Forains that night, Chelsea and Jenna are eliminated. Afterwards, Arie announces that the remaining ladies will be traveling to Tuscany, Italy.\n\n222 7 \"Week 7\" February 12, 2018 ( ) 2207 5.94[46] 1.5/5[46]\n\nThe seven ladies arrive in Tuscany and stop in Pisa, where Chris Harrison announces there will be three individual dates, one group date and no rose ceremony. Becca K. gets the first one-on-one date and they drive to the town of Barga, buying bread and sharing a picnic overlooking the Tuscan view. She becomes excited about Arie meeting her family on the upcoming hometowns. Becca receives a rose. Jacqueline expresses increasing doubts and seeks out Arie to discuss her future goals about finishing her degree, ultimately deciding to quit the competition. Lauren B. has the second one-on-one to the town of Lucca with Arie, where they ride bicycles on a cobbled streets, eat gelato, and watch children playing football. They dine at Villa Grabau, when Lauren confesses her feelings to Arie, who gives her the rose. Seinne goes on the next one-on-one date, where she and Arie explore the Tuscan countryside to meet Giulio and his dogs, go hunting for truffles, and are welcomed by his family for lunch. Arie does not give a rose to Seinne, sending her home. Kendall, Bekah M. and Tia go on the last group date, meeting with Arie at Villa Reale. Tia expresses her concerns to Arie about Bekah's seriousness and youth, leaving Bekah upset and receiving consolation from Arie. Kendall receives the rose, leaving Tia and Bekah to have dinner on their continuation of the date. Tia gets the rose and Bekah is eliminated.\n\n223 8 \"Week 8\" February 19, 2018 ( ) 2208 6.27[47] 1.7/6[47]\n\nKendall's hometown date begins in Los Angeles where she meets Arie and takes him to a taxidermy studio, showing him how to stuff rats. Then, Kendall brings Arie to meet her family. Kendall's twin sister Kylie voices her concern to Arie about relationship issues; the sisters have been talking face-to-face. Tia takes Arie to her hometown Weiner, Arkansas, traveling to Crowley's Ridge Raceway near Paragould to experience car racing. Arie drifts first to take the lead. When Arie meets Tia's family, her overprotective father talks to Arie about his playboy reputation. The next stop is at Minneapolis, Minnesota to visit Becca, where she and Arie visit Minnetonka Orchards to harvest apples and take slingshots, then later make caramelized apples to eat. Later that day, Arie meets Becca's family in Prior Lake for a family dinner. Becca's uncle shares his story to Arie, that Becca's dad died and her mom is in remission from breast cancer. Finally, Arie travels to Virginia Beach, Virginia to meet with Lauren where they ride horses on a beach, go up the lighthouse and stroll on the pier. She introduces Arie to her family, Arie suffers an anxiety attack before dinner has started. He tells Lauren's father that he previously traveled to Iraq to visit the Armed Forces on a goodwill tour. At the rose ceremony, Arie takes Kendall aside and asks if she feels ready to be engaged. In the end, Tia is eliminated, leaving her crying and heartbroken.\n\n224 9 \"The Women Tell All\" February 25, 2018 ( ) N/A 4.26[48] 1.1/4[48]\n\nEighteen eliminated contestants sit down to face the audience. Chris Harrison interviews Krystal about her harsh irrational attitude and hypocritical behavior. The ladies question her about lying on the bowling date in Fort Lauderdale, but Krystal defends herself instead of offering an apology. She reveals that she lost her voice throughout the season, and that her brother is currently recovering from homelessness. Seinne is first on the hot seat and how she recalls memories from her date with Arie in Tuscany and says that she is still single. Bekah M. expresses frustrations over assumptions about her age and addresses Tia about her previous remarks. Chris shows a missing persons notice for her, and Bekah explains she went to work a marijuana farm weeks after completed filming, but did not have reception for days causing her mother to report her missing, Chris calls her mother on his cellphone, and suggests that her daughter may be absent for a few weeks to make an appearance on Bachelor in Paradise. Tia talks about feeling blindsided and Chris asks her if she wants to have another chance for love. Arie joins Chris onstage. Caroline calls out Arie, saying \"I know what you did. I don't know how you could do that\" with no further explanation given. Then, Arie reunites with Krystal and gives an apology for what happened on the two-on-one date in Paris. Before the special ends, bloopers and a sneak peek of Blockers are shown.\n\n225 10 \"Week 9\" February 26, 2018 ( ) 2209 6.57[49] 1.8/7[49]\n\nThe three ladies head to Ica, Peru for overnight dates. Kendall takes a dune buggy in Paracas where she ends up sandboarding to the bottom after the buggy gets stuck on a steep point and sets up a picnic in the desert. Lauren takes a plane ride over the Nazca Lines seeing aerial views of ancient large scale geoglyphs on the ground below. She talks with Arie about relationship issues, stating her fears of another heartbreak. Becca takes a catamaran ride to a picturesque view of Ballestas Islands and sees the seals there. All three ladies get the fantasy suites, and Arie receives a blessing from each lady the following morning after the overnight date. The next day, Becca's ex-boyfriend Ross shows up and talks to Arie, saying that he is desperate to have Becca back and win her heart. Ross goes to Becca's hotel room asking for a marriage proposal and she says no. At the rose ceremony, Arie called Kendall and they talk once again, as she is not really ready for marriage without chemistry and physical attraction. Arie sends her home before the ceremony.\n\n226 11 \"Week 10: Season Finale\" March 5, 2018 ( ) 2210 7.94[50] 2.2/8[50]\n\nLauren and Becca have an opportunity to meet with Arie's family in a hotel in Cusco. Both ladies have doubts after hearing a conversation with Arie's parents, with Arie saying he loves both women. Lauren's final date involves riding in a private train from Sacred Valley, she and Arie end at Machu Picchu with a view nearby. Lauren reveals that she met Arie before the show while she was living in Dallas. Becca's final date involves a plaza in Downtown Cusco, where Arie holds an umbrella waiting for her. They go into a marketplace trying to fit traditional poncho dress. They share their story how they first met, reading on a memory book about their potential future together including getting married and having children. At the rose ceremony, Lauren is feeling excited to receive a proposal, but Arie tells her something is stopping him and she is sent home in tears. When Becca arrives, they profess their love and Arie kneels and proposes to her. Becca accepts. Weeks after filming wrapped up, Becca arrives at the safe house in Los Angeles just as Arie is arriving. He immediately announces he wants to call off the engagement. They speak in private and he tells Becca he is more in love with Lauren than her. Arie's goal is to reconcile with Lauren and he reveals to Becca that he spoke to Lauren on New Year's Day. Becca feels frustrated, confused, angry and heartbroken, sobbing on the bathroom floor. She finally asks Arie to leave the house, which he eventually does. In a live interview, Becca reveals that she hasn't spoken to Arie since that day.\n\n227 12 \"After the Final Rose\" March 6, 2018 ( ) N/A 7.77[51] 2.2/8[51]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/15/The_Bachelor_S22_poster.jpg/220px-The_Bachelor_S22_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/1/15/The_Bachelor_S22_poster.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/15/The_Bachelor_S22_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Bachelor_(season_22)", "title": "The Bachelor (season 22)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/15/The_Bachelor_S22_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}