{"url": "https://www.billboard.com/articles/news/bbma/8456871/billboard-music-awards-2018-best-moments", "text": "BBMAS The 13 Best Moments From the 2018 Billboard Music Awards\n\nThe 2018 Billboard Music Awards may be over, but not without making an impact. Whether stars were championing each other, honoring lives we've lost or giving a voice to those who need it most, this year's show was a powerful one from Kelly Clarkson's moving cold open to Salt-N-Pepa's nostalgic (and energetic) finish.\n\nThere were plenty of memorable, GIF-able and quote-able moments from the 2018 BBMAs on Sunday night (May 20), and we've rounded up our favorite highlights below.\n\nKelly Clarkson’s call to action\n\nBefore officially kicking off the night with an awe-inspiring medley of the year’s biggest Billboard hits, Clarkson started her Billboard Music Awards hosting gig by paying tribute to those who lost their lives in the tragic Sante Fe High School shooting just two days prior. In a powerful move, Clarkson went against what producers asked and called on fans and viewers to take action.\n\n\"I’m so sick of the moment of silence because it’s not working,” she said while choking back tears. \"How about a moment of action, a moment of change. Why don’t we change what’s happening?”\n\nKhalid dancing to Kelly Clarkson’s opening performance\n\nBetween performing with Shawn Mendes and Normani and winning top new artist, Khalid had a pretty solid Billboard Music Awards experience. But his highlight of the night may have been Kelly Clarkson’s opening number, especially when she sang his hit “Young, Dumb & Broke.” Please see GIF evidence below.\n\nLuis Fonsi’s shout-out to the Spanish-speaking community\n\nWhile accepting the award for Top Hot 100 Song for “Despacito,” Fonsi thanked fans for loving a mostly Spanish song and then went on to deliver an inspiring message to those who speak his language. “This goes out to all my Latino brothers, all the immigrants. All the DREAMers out there, all of those who get made fun of when you speak with an accent, all of those when they say, ‘Hey speak English.’ To you — Puerto Rico, this goes out to you.\"\n\nCamila Cabello being unapologetically herself\n\nCamila Cabello has always been a goofball, but it was especially apparent at this year's BBMAs. Camila was clearly pumped for her new tour mate when Swift won top female artist, jumping up and down while the “Delicate” singer made her way to the stage. Then when Swift shouted her out during her speech, Cabello let loose, and continued to throughout the rest of the night (like headbanging during Shawn Mendes' performance) — and it was awesome.\n\nTyra Bank’s “That was powerful” response to Christina Aguilera and Demi Lovato's performance\n\nThe dynamic divas had the whole arena on their feet after the debut of their new collaboration “Fall In Line,” but there was one reaction that encompassed what everyone was thinking:\n\n\"That was powerful!!!!!!!!!!\" - Tyra Banks reacts to Christina Aguilera & Demi Lovato's duet pic.twitter.com/Ka4CHdp6YF — Born Salty (@cjzero) May 21, 2018\n\nCardi B’s “cameo” during J.Lo’s “Dinero” performance\n\nWith a baby on the way in a number of weeks, Cardi B was unable to assist her latest collaborators Jennifer Lopez and DJ Khaled with their performance of “Dinero.” Even with her absence, Cardi made sure to still make an appearance through a fabulous black-and-white video tearing up her verse — and of course having J.Lo join in for the already iconic line, \"Two bad bitches that came from the Bronx.\"\n\nShawn Mendes and Khalid giving Marjory Stoneman Douglas High School students the spotlight\n\nIn line with the action that Clarkson called for in the show's beginning, Mendes and Khalid had Parkland students join them for their poignant anthem, \"Youth,\" a powerful addition that resulted in a prolonged standing ovation.\n\nChills from this moving @ShawnMendes & @thegreatkhalid performance. A huge thank you to the Marjory Stoneman Douglas Show Choir for being a part of this special #BBMAs moment. pic.twitter.com/tBntNJs2J5 — Billboard Music Awards (@BBMAs) May 21, 2018\n\nTaylor Swift’s empowering acceptance speeches\n\nSwift was already inspiring during her first win, calling out her fellow female musicians as she accepted the award for top female artist. But she really gave fans all the feels upon accepting her second award (for top selling album), sending a heartfelt thank you to those Swifties that have helped her “feel understood again.\"\n\nLook What You Made @taylorswift13 do -- ...WIN the #BBMAs for Top Female Artist! Congrats! pic.twitter.com/adf3zY3YxG — Billboard Music Awards (@BBMAs) May 21, 2018\n\nAndy Cohen bopping to Janet Jackson\n\nThe Watch What Happens Live host had some pretty GIF-able moments throughout the entire show, but his dancing to Janet Jackson’s performance was one that even GIPHY had to acknowledge:\n\nJanet Jackson’s nod to #TimesUp and #MeToo\n\nThe 2018 Icon Award recipient was obviously one of the night’s most-anticipated stars, and she made the most of her position with a powerful shout-out to those who have taken part in the #TimesUp and #MeToo movements. \"I believe for all our challenges, we live at a glorious moment history,” she declared. \"It's a moment when, at long last, women have made it clear that we will no longer be controlled, manipulated or abused. I stand with those women and with those men equally outraged who support us in heart and mind.\"\n\nSimon Cowell and Kelly Clarkson have a mini American Idol reunion\n\nCoincidentally on the same night that the American Idol finale aired, the Season 1 winner and OG judge had a brief run-in on the BBMAs stage — and it was as adorable as any Idol fan would’ve hoped. Clarkson looked genuinely excited to see Cowell as they went in for a hug, and the now-America’s Got Talent judge couldn’t help gushing over the singer's impressive performance. \"That was bloody fantastic, what can I say? I’m very proud of you.\"\n\nJungkook’s abs flash\n\nIt was no secret that BTS’ performance was one of the most (if not the most) awaited of the night, and they absolutely blew expectations out of the water with their high-energy debut of “Fake Love.” While the entire performance undoubtedly made the Internet erupt, Jungkook’s quick shot of his rock-hard abs likely made fans' already melting hearts complete mush.\n\nthank u jungkook pic.twitter.com/dzXFANa2O9 — jungkook being extra (@kookbeingextra) May 21, 2018\n\nSalt-N-Pepa closing out the show\n\nPutting the cap on a night that featured hits of the last year, Salt-N-Pepa reminded the world that the '90s had some of the GOAT jams. Joining forces with another sassy bunch of legends, En Vogue, the gals delivered a fiery medley of \"Shoop/Let's Talk About Sex/Push It/Whatta Man” that sent everyone off with both throwback and positive vibes.", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://static.billboard.com/files/media/2018-BBMAs-recirc.png", "https://static.billboard.com/files/media/simon-cowell-kelly-clarkson-bbmas-show-2018-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?5483f7d85ab28d1d2c44"], "top_img": "https://static.billboard.com/files/media/simon-cowell-kelly-clarkson-bbmas-show-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.billboard.com/articles/news/bbma/8456871/billboard-music-awards-2018-best-moments", "title": "The 13 Best Moments From the 2018 Billboard Music Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-05-21T03:09:37-04:00", "published_time": "2018-05-21T00:14:02-04:00"}, "description": "Whether stars were championing each other, honoring lives we've lost or giving a voice to those who need it most, this year's show was a powerful one from Kelly Clarkson's moving cold open to Salt-N-Pepa's nostalgic (and energetic) finish.", "og": {"description": "Whether stars were championing each other, honoring lives we've lost or giving a voice to those who need it most, this year's show was a powerful one from Kelly Clarkson's moving cold open to Salt-N-Pepa's nostalgic (and energetic) finish.", "image": {"identifier": "https://static.billboard.com/files/media/simon-cowell-kelly-clarkson-bbmas-show-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Billboard Music Awards 2018: Watch the 13 Best Moments | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/bbma/8456871/billboard-music-awards-2018-best-moments", "site_name": "Billboard"}, "title": "The 13 Best Moments From the 2018 Billboard Music Awards", "twitter": {"card": "summary_large_image", "description": "Whether stars were championing each other, honoring lives we've lost or giving a voice to those who need it most, this year's show was a powerful one from Kelly Clarkson's moving cold open to Salt-N-Pepa's nostalgic (and energetic) finish.", "image": "https://static.billboard.com/files/media/simon-cowell-kelly-clarkson-bbmas-show-2018-billboard-1548-1024x677.jpg", "title": "The 13 Best Moments From the 2018 Billboard Music Awards", "site": "@billboard"}}, "movies": [], "publish_date": 1526876042.0, "source": "https://www.billboard.com", "summary": ""}