{"url": "en.wikipedia.org/wiki/Anmer_Hall", "text": "For the theatre director with pseudonym Anmer Hall, see Alderson Burrell Horne\n\nAnmer Hall is a Georgian country house in the village of Anmer in Norfolk, England. It is about 12 miles (19 km) north east of King's Lynn, about 2 miles (3.2 km) east of the Queen's residence at Sandringham[1] and about 2 miles (3.2 km) west of Houghton Hall. Anmer Hall was a wedding gift to the Duke and Duchess of Cambridge from the Queen.[2]\n\nThe current house was built in the 18th century and has formed part of the Sandringham estate since 1898. The house was registered as a Grade II* listed building in 1984 but was later de-listed.[3]\n\nHistory [ edit ]\n\nThe current late-Georgian house dates from the 18th century, although it may be built around an earlier core. It has two storeys and attic with dormer windows. The long south front comprises 13 bays, and was refaced with red bricks c. 1815. It has 13 ground-floor windows set in blank arches and a semicircular porch on two Tuscan columns, with 11 windows on the first floor. The three central bays are topped by a pediment. The north front is of rubble carrstone and includes four c. 17th-century ogee-headed sashes on the first floor. Renovations c. 1900 added a brick dressed skin to the north front, together with a projecting entrance porch and a tower towards the eastern end, in the corner formed with a carrstone service wing also added c. 1900.\n\nThe surrounding estate became a scheduled ancient monument in 2003, and includes earthworks marking the sites of buildings from the medieval village of Anmer.[4] The village church, St Mary, lies close to the house, but a short distance away from the modern village.\n\nOccupants [ edit ]\n\nAnmer Hall was the seat of the Coldham family from at least 1705. The nearby Sandringham estate was bought by Queen Victoria in 1862 as a wedding present for the Prince of Wales, later Edward VII, and neighbouring land was added to the estate in subsequent years.\n\nIn 1896, the Anmer Hall estate was purchased at auction for £25,000 by the famed serial fraudster[5] Ernest Terah Hooley before his first bankruptcy. The Prince had attempted to purchase the property prior to Hooley's acquisition.[6] Through an intermediary, the Prince asked Hooley that he be allowed to purchase it from him, ostensibly for his daughter Maud. Hooley agreed, allowing him to buy it at cost in 1898. It has been alleged that a motivation for the Prince's action was to avoid the possibility of Hooley's business promoter Alexander Meyrick Broadley, whom the Prince had earlier forced from society, from becoming a constant guest on the estate, and therefore near-neighbour.[7] Together with the Prince's eldest son and an equerry, Broadley had been implicated in the Cleveland Street scandal.[8][9]\n\nAnmer Hall, shown with new roof, in October 2014\n\nAnmer Hall was leased to John Loader Maffey, 1st Baron Rugby (1877–1969), who was to become Governor-General of the Sudan, Permanent Secretary of the Colonial Office and wartime Ambassador to Dublin. His daughter Penelope (1910–2005) socialised with the Royal Family, and was reportedly a favourite of King George V.\n\nFrom 1972 to 1990, the house was leased to the Duke and Duchess of Kent as their country house. In February 1990, the Duke and Duchess of Kent moved to Crocker End House in Nettlebed in Oxfordshire. From 1990 to 2000, it was rented by Hugh van Cutsem (1941–2013).[1] It was then leased to the family of James Everett, owner of kitchen timber company Norfolk Oak.[10]\n\nIn January 2013, it was reported that the Queen had allocated Anmer Hall for use by the Duke of Cambridge, his wife the Duchess of Cambridge and family.[11][12][13] The lease to the Everett family was terminated early, before its expiry in 2017, to allow redevelopment.[14]\n\nTo accommodate the Duke and Duchess using the house as their main residence whilst William worked as a pilot for East Anglian Air Ambulance, a £1.5 million refurbishment programme was put in place. Paid for from private Royal family funds, this included: a complete new roof; new kitchen; the addition of a conservatory designed by architect Charles Morris (who previously designed extensions to Highgrove House);[1] complete internal redecoration; and an extensive tree-planting programme to afford the Duke and Duchess greater privacy.[15]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Anmer_Hall_near_Sandringham_in_Norfolk_%28geograph_4220749%29.jpg/220px-Anmer_Hall_near_Sandringham_in_Norfolk_%28geograph_4220749%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/300px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Norfolk_UK_location_map.svg/240px-Norfolk_UK_location_map.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Royal_Standard_of_the_United_Kingdom.svg/100px-Royal_Standard_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Red_pog.svg/7px-Red_pog.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/1200px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg/100px-Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/1200px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Anmer_Hall", "title": "Anmer Hall", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/1200px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}