{"url": "https://abcnews.go.com/GMA/Culture/stars-crazy-rich-asians-react-golden-globe-nominations/story?id=59650471", "text": "Stars of 'Crazy Rich Asians' react to Golden Globe nominations The nominations for the 76th Annual Golden Globe Awards were just announced!\n\nThe nominations for the 76th Annual Golden Globe Awards were announced Thursday morning.\n\nAdam McKay’s upcoming political drama, \"Vice,\" scored the highest number of nominations -- six -- while other front-runners included \"A Star Is Born,\" \"The Favourite\" and \"Mary Poppins Returns.\"\n\nCelebrities are expressing their gratitude to the Hollywood Foreign Press Association on social media.\n\nGolden Globe statuettes are on display during an unveiling by the Hollywood Foreign Press Association at the Beverly Hilton Hotel, Jan. 6, 2009 in Beverly Hills, Calif. Alberto E. Rodriguez/WireImage/Getty Images\n\n\"Crazy Rich Asians\" was nominated for best musical or comedy movie, and the film's star, Constance Wu, earned a nomination for best actress.\n\nWu shared her shock at the announcement on Twitter.\n\n\"What a morning to have had my phone on Do Not Disturb Mode till now... I’m ecstatic but also in shock! Thank you @goldenglobes!!!\" she tweeted.\n\nThe film's director, Jon M. Chu, shared his own reaction to Wu's nomination.\n\nHe said he never thought the film would be as successful as it is.\n\n\"Not in my wildest dreams did I ever think our movie would be embraced to this magnitude by the audience and now the HFPA. What an honor to be included on such a beautiful list of diverse human experience stories amongst storytellers I have looked up to my entire life,\" Chu said in a statement to ABC News.\n\n\"In response to Eleanor Young, we were always good enough,\" he concluded.\n\nWu's co-star, Henry Golding, sent congratulations to her on the best actress nomination.\n\n\"What a phenomenal achievement, congratulations @constancewu on your ground breaking nomination for best actress at the golden globes!\" he wrote alongside a photo of the pair. \"She continues to fly the flag for many causes but most of all as a pillar of strength for young Asian actresses around the world.\"\n\nGolding added, \"Our special collaboration to bring this story to the screen fought the good fight for diversity!\"\n\n\"Mary Poppins Returns\" actress Emily Blunt earned a nomination in the best actress in a motion picture category.\n\nThe film, which hits theaters Dec. 19, scored four nominations.\n\n“Thank you ever so much to the HFPA! I’m blown away and over the moon,\" the actress said in a statement to ABC News.\n\nShe continued, \"I delighted in playing every aspect of this extraordinary and iconic character. The entire experience working on it was spellbinding and that’s largely to do with the incomparable Rob Marshall who took on this project with great love, depth and courage in his heart. I’m thrilled for Lin and for the recognition for our beautiful score as well as the film as a whole.\"\n\nCatherine Zeta Jones took to Instagram to congratulate her husband, Michael Douglas, for scoring a nomination for his performance in \"The Kominsky Method.\"\n\n\"Dancing with my husband this morning. Congratulations to my fantastic husband for his Golden Globe nomination for 'The Kominsky Method' so proud of you, so well deserved. Love you sweetheart,\" she shared.\n\n\"It is such an honor to be nominated as a comedy actor for 'The Kominsky Method,'\" Douglas said in a statement to ABC News.\n\nMaril Davis, executive producer of Starz drama \"Outlander,\" shared her excitement for Caitriona Balfe, who received a nomination in the best performance by an actress in a television series category.\n\nBalfe said she was \"shocked and completely ecstatic\" to receive the acknowledgement for her performance in \"Outlander.\"\n\n\"A HUGE thank you to the HFPA for their continued support and a HUGE congratulations to Julia, Elizabeth, Sandra and Keri, I am beyond proud to be in your company,\" she wrote.\n\n\"Mostly, thank you to my incredible fellow actors and the wonderful team of writers, producers and crew on @Outlander_STARZ that push me to my best. #GoldenGlobeAwards,\" she added.\n\nJameela Jamil of \"The Good Place\" reacted to the show grabbing a nomination in the best television series category.\n\nShe also congratulated her co-star, Kristen Bell, for earning a Golden Globes best actress nomination in a comedy or musical television series.\n\nMark Ronson, one of the co-writers of \"Shallow,\" the hit single from \"A Star Is Born,\" celebrated its nomination for best original song by posting a video of himself playing the tune on his guitar.\n\nMelissa McCarthy and Richard E. Grant both received nominations for their performances in \"Can You Ever Forgive Me?\"\n\nGrant wrote that he was \"absolutely stunned\" at the acknowledgement.\n\nDebra Messing is now a nine-time Golden Globe nominee. The 50-year-old actress received a nomination in the best actress in a musical or comedy series category.\n\n\"I am so so grateful that our show came back and that I get to say these geniuses words. Today celebrates them,\" she shared on Instagram.\n\nPatricia Arquette, who received a nomination for her work in \"Escape at Dannemora,\" shared how honored she was to share such distinguished company in the category.\n\nHer brother, David Arquette, was equally excited for her!\n\n\"So deserved BRAVO,\" he said in a post.", "images": ["https://s.abcnews.com/images/GMA/cast-crazy-rich-asians-gty-ps-181206_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/GMA/cast-crazy-rich-asians-gty-ps-181206_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Hayley Fitzpatrick", "December", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471", "title": "Stars of 'Crazy Rich Asians' react to Golden Globe nominations", "meta_data": {"description": "The nominations for the 76th Annual Golden Globe Awards were announced on Thursday morning.", "keywords": "social media, celebrity, Golden Globe Awards", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Stars of 'Crazy Rich Asians' react to Golden Globe nominations", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471", "title": "Stars of 'Crazy Rich Asians' react to Golden Globe nominations", "description": "The nominations for the 76th Annual Golden Globe Awards were announced on Thursday morning.", "image": "https://s.abcnews.com/images/GMA/cast-crazy-rich-asians-gty-ps-181206_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-12-06T18:10:31Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,59650471", "ipad": "abcnewsipad://link/story,59650471", "googleplay": "https://goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Stars of 'Crazy Rich Asians' react to Golden Globe nominations", "description": "The nominations for the 76th Annual Golden Globe Awards were announced on Thursday morning.", "url": "https://goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471", "image": {"identifier": "https://s.abcnews.com/images/GMA/cast-crazy-rich-asians-gty-ps-181206_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,59650471", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,59650471", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/stars-crazy-rich-asians-react-golden-globe-nominations-59650471"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}