{"url": "https://web.archive.org/web/20171016122151/http://screenrant.com:80/stars-completely-estranged-from-famous-parents", "text": "Sometimes, it can be difficult to get along with your folks. When you throw in the fact that the person in question is a celebrity, someone whose life is constantly under scrutiny, and the parents are also celebrities, it can get a bit crazy at times. This can lead to estrangement between parents and their child and sadly, it happens a lot more than you might think.\n\nThis seems to be a problem more for actors than other types of celebrities, which may have to do with their time in the spotlight. Whether a younger actor or actress ends up despising their parent(s) for taking their income while they worked as a child or they spoke about them to the press in a bad way, some stars just want nothing to do with their folks anymore.\n\nIn a lot of cases, estrangement can go on for years and might only end when a parent or child is lying on their death bed. In other cases, the estrangement never ends and a parent can pass on before a reconciliation can occur.\n\nWe found a good number of stars whose parents were also actors and actresses that don’t get along any longer. Whatever the reason, here are 15 Actors Completely Estranged From Their Famous Parents.\n\n15. ANGELINA JOLIE – JON VOIGHT\n\nAngelina Jolie is one of the most famous actresses on the planet. She is an Academy Award winner and a Goodwill ambassador whose work across the globe has been hailed by many. She is also the daughter of John Voight, one of the most celebrated actors from the 1970s. They two were estranged for years, due to her father’s infidelity concerning her late mother as well as a comment he made publicly in 2002 saying Jolie “needed help” and suffered from “mental problems.”\n\nThe two have made several attempts to reconcile their relationship for the sake of Jolie’s children. She has six kids who all call Voight their grandfather, which has led Voight claimed they had recovered their relationship in 2011 using Bradd Pitt, Jolie’s husband at the time, as a go-between. They made some strides towards reconciling, but their relationship is far from fully recovered.\n\n\n\n14. LINDSAY LOHAN – MICHAEL LOHAN\n\nLindsay Lohan has certainly had her own problems over the years. She may have fallen prey to the curse of the “Child Actor” given that she grew up in the spotlight and eventually got into a lot of trouble thanks to drugs and alcohol. Her issues have landed her in trouble with the law, but these issues pale in comparison to her tumultuous relationship with her father, Michael Lohan, whose personal fame is almost entirely derived from his famous daughter.\n\nWhen asked about her father in May 2013 by Piers Morgan, she said, “He won’t change. I just think there comes a point where you just kind of have to accept what it is. Whenever I do try to bring him back into my life, he creates chaos for me and uses it to his advantage. He’s been really good and then really crazy my whole life.”\n\nThe two barely get along when they are talking to one another, and while she has expressed hope that he will change, the two are currently estranged.\n\n\n\n13. EMMA ROBERTS – ERIC ROBERTS\n\nEmma Roberts has been getting work in Hollywood for a number of years and is probably best known for her roles in We’re The Millers, Scream Queens, and American Horror Story. She is related to a number of famous folks, including her aunt Julia Roberts and her father, Eric Roberts – with whom she has a tumultuous relationship.\n\nHer father has had a pretty bad relationship with his sister, Julia for years, but he and his daughter have been estranged since he divorced her mother when Emma was just a baby. Estrangement throughout the family seems to be the norm. In addition to Eric’s bad relationship with his sister and daughter, Julia had a bad relationship with her half-sister, Nancy Motes, who passed away from a drug overdose in 2014, just a day before Emma’s 23rd birthday.\n\nThough they have a poor relationship, Eric came out in defense of his daughter when she was arrested for domestic violence in 2013.\n\n\n\n12. DREW BARRYMORE\n\nDrew Barrymore has had an interesting career. She got into drugs and alcohol at a very early age and while she has matured into a successful actress and producer, her teenage years were a bit crazier than most people’s formative years. She emancipated herself from her mother, Jaid Barrymore, at the tender age of 14 and they haven’t spoken since.\n\nEven though they haven’t spoken, Drew seems to have no ill feelings towards her mother. In her memoir, she wrote: “I am grateful to this woman for bringing me into this world, and it would crush me to know she was in need anywhere. It is not who I am to harbor any anger for the fact that our life together was so incredibly unorthodox. I want only to say thank you to her, because I love my life and it takes every step to get to where you are, and if you are happy, then God bless the hard times it took you to get there.”\n\n\n\n11. KATE HUDSON – BILL HUDSON\n\nKate Hudson (and her brother, Oliver) are no longer close to their famous dad, Bill Hudson. Bill and Goldie Hawn (Kate’s mother) divorced in 1980. Since that time, he has had almost no contact with his children at all. When Goldie Hawn and Kurt Russell got together, Kate became Kurt’s daughter for all intents and purposes; she even calls him dad without much regard for her biological father.\n\nOliver posted a photograph of the three of them together when they were children on Father’s Day, 2015 with the caption “Happy abandonment day”, which may have helped their relationship, at least between Oliver and his father. Oliver has mentioned that the post began a dialogue between himself and his father, but gave no indication as to any change between Kate’s relationship with her dad.\n\nThis relationship doesn’t look like it will be thawing anytime soon given the lack of contact for more than three decades.\n\n\n\n10. IRELAND BALDWIN – ALEC BALDWIN\n\nIreland Baldwin is the daughter of the famous acting pair, Alex Baldwin and Kim Basinger and she hasn’t always had the best relationship with her father. The 30 Rock star famously called his daughter a “rude, thoughtless little pig” in a voicemail that went public. In his memoir, Nevertheless, Baldwin wrote that he created a “Permanent break” in their relationship.\n\nIreland has gone on record via Tweets and Instagram posts discussing her issues with her body image, much of which stemmed from the way her father has spoken to her. “I’ve gone from a size 00 to a size 6 to a size whatever to not knowing to not eating to eating boxes of pizza to starving myself to being gym obsessed to eating my way out of a Sprinkles cupcakes bakery to now.”\n\nDespite her father’s claims, she is clearly a beautiful woman who is very far from a “rude, thoughtless little pig.”\n\n\n\n9. JENNIFER ANISTON – NANCYD DOW\n\nJennifer Aniston’s mother, Nancy Dow has been a prominent member of the celebrity community for years and that may have something to do with the cause of their estrangement. While they are currently speaking to one another, they spent a large portion of Aniston’s adulthood without speaking to one another. The biggest issue between the two appears to be Dow’s temper.\n\n“She had a temper. I can’t tolerate that. If I get upset, I will discuss [things]. I will never scream and get hysterical like that. [But] I was never taught that I could scream. One time, I raised my voice to my mother, and I screamed at her, and she looked at me and burst out laughing. She was laughing at me [for] screaming back. And it was like a punch in my stomach.” Some of the worst conflicts arose from Dow’s being critical of Aniston’s looks. While the world considers her to be gorgeous, her mother apparently criticized her looks constantly, which only pushed the Friends star further from away her mother.\n\n\n\n8. CONNOR CRUISE – NICOLE KIDMAN\n\nConnor Cruise is the adopted son of former Hollywood power couple Tom Cruise and Nicole Kidman. He is currently estranged from his mother who has spoken out about their relationship. When Kidman and Cruise’s marriage came to an end, so did her relationship with her children and according to sources close to the family, it was entirely to do with the Church of Scientology.\n\nAccording to John Brosseau, “They probably on half a dozen occasions would make derogatory comments about Nicole. On one occasion, Connor and Bella were both telling me how they had recognized that she’s an SP and I remember thinking at the time, ‘Wow, they were coerced into this thinking.”\n\nIn the Church of Scientology, an SP is a “Suppressive Person”, which essentially means someone who should be avoided due to their negative stance on the Church. Eventually, Kidman reunited with her daughter, Bella Cruise in 2016, but has yet to reconcile with her son.\n\n\n\n7. CHRISTIAN SLATER – MICHAEL HAWKINS\n\nThe relationship between Christian Slater and his father… well, lack of relationship is one of the worst we came upon while researching this list. Not only are the two estranged – there have been allegations that Michael Hawkins, Slater’s father, threatened to kill him and his mother. In various interviews over the years, Slater and his mother, Mary Jo Slater, have claimed that Hawkins is a manic-depressive schizophrenic who needs psychological help.\n\nThese claims pushed Hawkins to file a lawsuit demanding $20 million from his son, insisting that he destroyed his career due to the comments. The lawsuit against Slater was thrown out, though his mother remains a defendant.\n\nPrior to the lawsuit, the two hadn’t spoken for nine years, but Hawkins did reach out to his son in an attempt to reconcile. Slater was working to better their relationship, but thanks to the lawsuit, it doesn’t look like a reconciliation is on the table.\n\n\n\n6. ASHLEY JUDD – NAOMI JUDD\n\nAshley Judd has had a rocky relationship with her mother, Naomi Judd, for a long time. It became especially troublesome after Ashley wrote in her 2011 memoir of childhood sexual abuse and neglect she suffered growing up. The publication of that memoir, titled All That is Bitter and Sweet, cemented the rift. In the book, Ashley wrote that she suffered from incest and abuse, with her finger pointed directly at her mother.\n\nAshley’s book detailed her abuse, which she learned of through therapy that uncovered the childhood trauma she had suppressed. There were numerous acts of molestation and attempted rape throughout her childhood discussed in the memoir. Writing the book helped her to get past her depression and she hoped it would help similarly abused children cope with their issues.\n\nNaomi’s relationship with her other daughter, Winona, has similarly been strained, but according to Naomi, she has a good relationship with her daughters – though it remains rocky.\n\n\n\n5. ROCCO RITCHIE – MADONNA\n\nRocco Ritchie is the son of Madonna and Guy Ritchie, but he doesn’t get along with his mother anymore. When Madonna and Ritchie divorced, a custody agreement arranged for Rocco to live with his father as he has a much better relationship with his new step-mom, Jacqui Ainsley. He has spoken out about his mother and they have had a rocky relationship for years.\n\nAfter Madonna posted a picture of the family, Rocco followed up with an Instagram post saying “So glad I don’t live there anymore.” Rocco has gotten into trouble with the law thanks to a Marijuana possession arrest in London, but Madonna seems to be trying to mend her relationship with her son: “I love my son very much. I will do whatever I can to give him the support that he needs, and I ask that you respect our privacy at this time.”\n\nDespite her reaching out, Madonna wasn’t invited to her son’s 17th birthday, which he celebrated with his step-mom.\n\n\n\n4. TORI SPELLING – CANDY SPELLING\n\nTori Spelling hails from a famous family – her late father, Aaron Spelling, was a big name in television production for years. He produced a little show called Beverly Hills, 90210, which starred, among other people, Tori Spelling. It’s safe to say Tori had a good relationship with her father, but it may have been her dad’s doing that deteriorated the relationship between Tori and her mother, Candy.\n\nAccording to Tori, their relationship was strained due to their contest for her father’s attention. She told Access Hollywood, “Obviously I’ll never know what really went on, but growing up, I definitely was closer with my dad. I was very much a daddy’s girl….And as an adult, I can go back and look at the relationship and see that he kind of always positioned her as, like, he was good cop, she was bad cop. And he kind of created a little bit of that dynamic. It wasn’t just all her.” She has mentioned that she would like to repair their relationship, but they are currently estranged.\n\n\n\n3. TATUM O’NEAL – RYAN O’NEAL\n\nTatum O’Neal is the Academy Award-winning actress and daughter of Ryan O’Neal who starred alongside her in the 1973 film Paper Moon. She won the Oscar at the age of nine for that role, and remains the youngest person ever to do so, but her home life as a child was very difficult.\n\nTatum was abused and even attempted suicide at the age of 13, had a terrible relationship with her mother, and eventually became estranged from her father. She has described her life as “toxic” and “difficult”, suggesting much of her troubles stemmed from her father.\n\nTatum has gone through a great deal of self-discovery and even came to forgive her father, though their relationship remains rocky at best. “He can say whatever he wants… he can make up stuff or say stuff…This is about forgiveness… this is about trying to shut a door and open another one. I don’t know if it’s going to work. It may or it may not, but I’m going to try.”\n\n\n\n2. MACKENZIE PHILLIPS – JOHN PHILLIPS\n\nWhen it comes to terrible relationships that lead to estrangement, nobody has a better excuse than Mackenzie Phillips. According to Phillips, she entered into an incestuous relationship with her father, John Phillips of The Mamas & The Papas, after he forced himself on her after she passed out on the eve of her wedding. When she awoke and found her father raping her, she asked herself if such a thing had happened before. Eventually, the relationship reportedly became consensual.\n\nAfter some time, she severed her sexual relationship with her father as well as all communication, but she also suffered estrangement from much of her remaining family members after revealing her past in a tell-all book, High on Arrival. Surprisingly, Philips has asked people not to hate her father for what he did, but given what she went through, it’s hard to say she wasn’t harmed by her dad who has since passed away.\n\nAs he is now dead, some family members estranged themselves from her simply because he cannot defend himself from her accusations.\n\n\n\n1. KIM, KYLIE, AND KENDALL – CAITLYN JENNER\n\nMany people around the globe either applauded or derided Caitlyn Jenner’s coming out as transgender in 2015, but the revelation and subsequent publication of her memoir seems to have created a rift between Caitlyn and her children. Kim Kardashian-West hasn’t spoken to Caitlyn due to some of the comments written about her mother, Kris Jenner, in Caitlyn’s book. She said the comments were “so hurtful”, which has forced Caitlyn to keep her distance from the reality show star.\n\nHer other daughters, Kendall and Kylie have also become estranged following the publication of her memoir, The Secrets of My Life. The statements made in the book appear to have created the rift as it did with Kim, though Kylie remains in contact with her father, despite their relationship remaining difficult. Their remaining in contact has caused some strain between Kylie and her other sisters, which suggests their relationship may become more estranged as time goes on.\n\n—\n\nDo you know of any actors whose strained relationships with their famous family has led to estrangement? Sound off in the comments and let’s discuss!\n\nThePremium Network Ad Free Browsing\n\nAd Free Browsing Over 10,000 Videos!\n\nOver 10,000 Videos! All in 1 Access\n\nAll in 1 Access Join For Free! GO PREMIUM WITH SCREENRANT Go Premium!", "images": ["https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-icon-light.svg", "https://web.archive.org/web/20171016122151im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/themes/screenrant/assets/images/svg/tp-logo.svg", "https://web.archive.org/web/20171016122151im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-part-of-1.svg", "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/uploads/2017/10/Jennifer-Aniston-and-Nancy-Dow.jpg", "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-go-premium-white.svg", "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/themes/screenrant/assets/images/svg/ad-blocker.svg"], "top_img": "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/uploads/2017/10/Jennifer-Aniston-and-Nancy-Dow.jpg", "keywords": [], "authors": ["Jonathan H. Kantor"], "canonical_link": "https://web.archive.org/web/20171016122151/http://screenrant.com/stars-completely-estranged-from-famous-parents/", "title": "15 Stars Who Are Completely Estranged From Their Famous Parents", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"pages": 10765693196, "app_id": 1682953215260932}, "syndication-source": "http://screenrant.com/stars-completely-estranged-from-famous-parents/", "twitter": {"domain": "ScreenRant.com", "site": "@screenrant", "card": "summary_large_image", "title": "15 Stars Who Are Completely Estranged From Their Famous Parents", "description": "It can be tough to grow up with famous parents, even when you become famous yourself. Sometimes those relationships don't last, especially for actors.", "image": {"src": "http://screenrant.com/wp-content/uploads/2017/10/Jennifer-Aniston-and-Nancy-Dow.jpg"}}, "news_keywords": "Lists", "description": "It can be tough to grow up with famous parents, even when you become famous yourself. Sometimes those relationships don't last, especially for actors.", "og": {"type": "article", "title": "15 Stars Who Are Completely Estranged From Their Famous Parents", "url": "https://web.archive.org/web/20171016122151/http://screenrant.com/stars-completely-estranged-from-famous-parents/", "locale": "en_US", "description": "It can be tough to grow up with famous parents, even when you become famous yourself. Sometimes those relationships don't last, especially for actors.", "site_name": "Screen Rant", "image": {"identifier": "https://web.archive.org/web/20171016122151im_/http://screenrant.com/wp-content/uploads/2017/10/Jennifer-Aniston-and-Nancy-Dow.jpg", "width": 620, "height": 310}}, "article": {"publisher": "http://www.facebook.com/ScreenRant", "published_time": "2017-10-12T13:01:20+00:00", "modified_time": "2017-10-12T12:16:50+00:00", "author": "Jonathan H. Kantor", "section": "Lists"}, "robots": "noydir"}, "movies": [], "publish_date": 1507813280.0, "source": "https://web.archive.org", "summary": ""}