{"url": "www.thehollywoodgossip.com/2017/06/mehgan-james-busted-lying-about-rob-kardashian-relationship/", "text": "Last week, we reported on rumors that Rob Kardashian is dating Mehgan James, a reality star best known for her time on VH1's Bad Girls Club.\n\nSeveral media outlets seemed certain that the relationship was the real deal and that Rob and Meghan had been seeing each other on the down-low for months.\n\nAs more details rolled in, however, the situation became increasingly sketchy.\n\nEventually, Rob himself took to social media to deny that he's dating Mehgan, insisting that he's never even met the troubled 27-year-old.\n\n\"Wait reading online about some chick I'm dating Megan something,\" Rob tweeted.\n\n\"Not true never even met or heard of her before.\"\n\nThe dual takeaways from this tweet seem abundantly clear:\n\n1. Someone needs to introduce Rob to our old friend Mr. Punctuation, and 2. he's legitimately not hooking up with Meghan.\n\nAfter all, Rob isn't one to deny that he's sleeping with a hot, young, semi-famous woman unless there's really just no shred of truth to the rumor.\n\nSo how did news of this phony couple spread so far so fast?\n\nWell, it seems Mehgan may have had a hand creating the false impression that she and Rob are an item.\n\nAt first, James pretended she was just as shocked by the situation as everyone else.\n\nBut a new report from TMZ accuses her of spreading the rumor herself in an effort to boost her public profile.\n\nSources close to the situation say that James and her team reported the fake relationship to a number of tabloids and media outlets, so as to help the aspiring model accumulate a larger online following.\n\nThe sad thing is, the ploy seems to have been effective.\n\nMehgan's Instagram following has doubled - reaching a total of more than 800,000 - in the week since news of her alleged relationship with Rob first broke.\n\nJudging by the comments on some of her pics, however, she's already experiencing some backlash from her ill-conceived publicity stunt.\n\nSources say Rob's baby mama, Blac Chyna, is especially disgusted by the situation, and we don't blame her.\n\nAfter all, if you're gonna use Rob for fame, the least you could do is go an actual date with the guy!\n\nThat's just common decency.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--n-2MP9fK--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1496348677/mehgan-james-in-a-yellow-jersey.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--n-2MP9fK--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1496348677/mehgan-james-in-a-yellow-jersey.jpg", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/06/mehgan-james-busted-lying-about-rob-kardashian-relationship/", "title": "Mehgan James: BUSTED Lying About Rob Kardashian Relationship!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/06/mehgan-james-busted-lying-about-rob-kardashian-relationship/", "title": "Mehgan James: BUSTED Lying About Rob Kardashian Relationship!", "description": "Last week, rumors that Mehgan James is dating Rob Kardashian spread like wildfire. We now know that it was James herself fanning the flames.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--dHC--Dfr--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1453739213/blac-chyna-and-rob-kardashian.jpg", "type": "image/jpeg", "width": 630, "height": 612}}, "article": {"published_time": "2017-06-05T08:50:08-04:00", "modified_time": "2017-06-05T08:53:09-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Mehgan James: BUSTED Lying About Rob Kardashian Relationship!", "description": "Last week, rumors that Mehgan James is dating Rob Kardashian spread like wildfire. We now know that it was James herself fanning the flames.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--n-2MP9fK--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1496348677/mehgan-james-in-a-yellow-jersey.jpg"}}, "description": "Last week, rumors that Mehgan James is dating Rob Kardashian spread like wildfire. We now know that it was James herself fanning the..."}, "movies": [], "publish_date": 1496667008.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}