{"url": "https://boundingintocomics.com/2017/10/27/hugh-jackman-costume-classic/", "text": "By far one of the best embodiments of a comic book character on screen has to be Hugh Jackman.\n\nHis take on Wolverine over the course of about two decades was great. It was also the high point of just about every X-Men film. When his run finally ended with this year’s Logan, many of us held out some hope to see him dawn the classic blue and yellow costume from the comics.\n\nJust like his close friend Deadpool’s Ryan Reynolds, Jackman is known to jump on Twitter to have some fun with fans. Yesterday morning, Jackman went on Twitter to tease fans about what he’s going to wear for Halloween this year.\n\nJust maybe I will finally wear blue and yellow spandex for my #halloweencostume #tootall pic.twitter.com/0IwL6GoHzZ — Hugh Jackman (@RealHughJackman) October 26, 2017\n\nThat’s right, Hugh Jackman might finally be in the classic Wolverine costume. But not how we would have wanted to see.\n\nLogan Director James Mangold spoke with Screenrant.com about the issue with the yellow costume months ago and why it didn’t work to put it in the movie.\n\nI always feel a certain contingent of fans who are yearning for it. But the biggest block I’ve had – I’m willing to take the heat for it – is that, I can never get past, being a writer for these movies as well, that Logan is the least narcissistic of all the superheroes, any kind I can think of – Marvel, DC or anywhere else. What I mean by that is, who puts a special branded outfit on when they do good deeds? And why? The only reason you do it is so you can have some sort of trademarked claim and get credit for what you did. Nothing seems less Wolverine-like than the desire to put on a trademarked outfit , particularly canary yellow, and kind of prance about doing good deeds and have people go, “Oh my God! It’s The Wolverine!” At least the Wolverine, as I see him, that’s a real struggle for me and always has been. I somehow feel that if somehow we ever put Hugh [Jackman] into one of those outfits, people would not be happy. Essentially, it’s something that lives on the page and I’m not sure could live anywhere else.\n\nPersonally, I would have loved to see him run around in a big old yellow costume ripping people up. Unless you’re going to trick or treat with the Aussie actor you won’t get to see him in his full yellow glory.\n\nHere’s hoping a photo of Jackman with the costume on makes it online!\n\n(Visited 179 times, 1 visits today)", "images": ["https://boundingintocomics.com/wp-content/plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://boundingintocomics.com/files/2020/03/2020.03.25-11.36-boundingintocomics-5e7beae935c64-360x240.png", "https://www.facebook.com/tr?id=317732228686583&ev=PageView&noscript=1", "https://secure.gravatar.com/avatar/bd3ac93af965dc7ebbdf0dbbfdaaeaae?s=120&d=mm&r=g", "https://boundingintocomics.com/files/2020/04/2020.04.14-12.08-boundingintocomics-5e94fef7aa785-360x240.png", "https://boundingintocomics.com/files/2017/10/GettyImages-127234401-e1509128095503.jpg", "https://boundingintocomics.com/files/2015/04/BiC_new_Logo.jpg"], "top_img": "https://boundingintocomics.com/files/2017/10/GettyImages-127234401-e1509128095503.jpg", "keywords": [], "authors": ["If Starfleet Were Real His Career Would Be In A Much Different Place. Currently", "He Specializes In All Things Star Trek. He Loves Dc But Has A Soft Spot For Deadpool."], "canonical_link": "https://boundingintocomics.com/2017/10/27/hugh-jackman-costume-classic/", "title": "Hugh Jackman Teases His Halloween Costume – It’s Wolverine Centric!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Hugh Jackman went on Twitter to tease fans about what he's going to wear for Halloween this year. We might finally get to see him wear the classic Wolverine outfit!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Hugh Jackman Teases His Halloween Costume - It's Wolverine Centric!", "description": "I hope he actually does this!", "url": "https://boundingintocomics.com/2017/10/27/hugh-jackman-costume-classic/", "site_name": "Bounding Into Comics", "updated_time": "2017-10-27T18:48:41+00:00", "image": {"identifier": "https://boundingintocomics.com/files/2017/10/GettyImages-127234401-e1509128095503.jpg", "secure_url": "https://boundingintocomics.com/files/2017/10/GettyImages-127234401-e1509128095503.jpg", "width": 750, "height": 401}}, "article": {"tag": "Wolverine", "section": "Comic Culture", "published_time": "2017-10-27T18:15:12+00:00", "modified_time": "2017-10-27T18:48:41+00:00"}, "twitter": {"card": "summary", "description": "Hugh Jackman went on Twitter to tease fans about what he's going to wear for Halloween this year. We might finally get to see him wear the classic Wolverine outfit!", "title": "Hugh Jackman Teases His Halloween Costume - It's Wolverine Centric! - Bounding Into Comics", "image": "https://boundingintocomics.com/files/2017/10/GettyImages-127234401-e1509128095503.jpg", "creator": "@PassStage6"}, "generator": "AMP for WP 1.0.41", "fb": {"pages": 324378871050003}, "google-site-verification": "eBvlJjUOmw85MRzMIs7Q3CvfyhxBgwFy9UiiqIEem0s", "msvalidate.01": "605F7E89B971A7E19B78A2ADB8672AE3", "msapplication-TileImage": "https://boundingintocomics.com/files/2015/04/Favicon1.png"}, "movies": [], "publish_date": 1509033600.0, "source": "https://boundingintocomics.com", "summary": ""}