{"url": "https://www.cheatsheet.com/health-fitness/the-dark-secrets-behind-jennifer-aniston-and-justin-therouxs-divorce-and-why-his-rumored-relationship-with-selena-gomez-is-so-messed-up.html/", "text": "Jennifer Aniston and Justin Theroux shocked the world when they announced their split in February 2018. After seven years as a couple and two and a half years of marriage, we thought they finally got their happy ending.\n\nAlthough they promised to “[continue] their cherished friendship” in the separation statement they released, we’re not so sure that’s the case anymore. Dark secrets have been revealed surrounding their divorce, including what they’re fighting over (page 6) and why Theroux’s rumored relationship with Selena Gomez is so messed up (page 8).\n\n1. There were warning signs of their divorce\n\nThe warning signs were there. | Valerie Macon/AFP/Getty Images The warning signs were there. | Valerie Macon/AFP/Getty Images\n\nLooking back, maybe Aniston and Theroux’s divorce isn’t so surprising after all. As it turns out, there were some obvious warning signs leading up to their announcement.\n\nAniston was attending parties left and right without her husband, from her Friends co-star Courtney Cox’s birthday celebration in Malibu to Amy Schumer’s surprise wedding.\n\nTheroux didn’t post any birthday wishes to Aniston on Feb. 11, 2018 — just four days before their separation announcement — whereas they’d typically share sweet messages on each other’s birthday.\n\nNext: It’s been going on for a while.\n\n2. They went through ‘intense issues’ for almost a year\n\nTheir last year together wasn’t a happy one. | Tim Mosenfelder/Getty Images Their last year together wasn’t a happy one. | Tim Mosenfelder/Getty Images\n\nAccording to E! News, Aniston and Theroux had been unhappy for quite some time. A source revealed that by the time of their split, they’d actually “been separated for two months.”\n\nHowever, they “were having intense issues for about eight months.”\n\nNext: They may not have ever been meant to be.\n\n3. Their lifestyles were completely different\n\nShe couldn’t live the low-key life he wanted. |Jean Baptiste Lacroix/AFP/Getty Images She couldn’t live the low-key life he wanted. |Jean Baptiste Lacroix/AFP/Getty Images\n\nAniston and Theroux seemed perfect for each other, but their lifestyles just weren’t compatible. E! News reported that Theroux prefered keeping a low profile, which just wasn’t possible when married to a Hollywood A-lister like Aniston.\n\nA source confirmed, “Jennifer and Justin fell in love hard and fast and yet they were never really suited to one another. He was a New York hipster that loved the alternative lifestyle and Jennifer was living a much more reclusive life when they first started to fall in love.”\n\n\n\nThe source added, “The initial chemistry between them made it easy for them to ignore their differences and incompatibility.”\n\nNext: This played a major role in their split.\n\n4. They couldn’t agree on where to live\n\nHe didn’t want to give up living in New York. | Frederick M. Brown/Getty Images He didn’t want to give up living in New York. | Frederick M. Brown/Getty Images\n\nThe couple’s different ideas on where to live reportedly became a major force in leading to their split. Aniston feels at home in Los Angeles, while Theroux wasn’t ready to give up his life in New York. A source told Entertainment Tonight, “[Theroux] much prefers being [in New York] and that’s been a major issue for them for a long time.”\n\nWhile they reportedly tried giving New York a try, “she just never really could get settled in, she wasn’t happy.”\n\nNext: You won’t believe what Theroux found.\n\n5. Theroux found old love notes from Pitt\n\nShe kept notes from Brad Pitt. | Ucy Nicholson/AFP/Getty Images She kept notes from Brad Pitt. | Ucy Nicholson/AFP/Getty Images\n\nFor those of you hoping for Aniston to reunite with her ex-husband, Brad Pitt, you may swoon over the fact that she kept old post-it notes with sweet messages from him all these years. Theroux, however, was unsurprisingly upset upon finding her keepsake collection.\n\nA source told Us Weekly that when Theroux “stumbled upon old Post-it notes Brad had written,” the impact was “huge.”\n\n“Sweet little Post-its like, ‘You looked nice tonight’ or ‘Miss you already,’” were among the love notes Theroux uncovered. His discovery left him with insecurities, which could have ultimately played a huge part in their split.\n\nNext: They’ve been fighting over this since their split.\n\n6. They’re fighting over the custody of their dogs\n\nNeither wants to give up the dogs. | Gabriel Bouys/AFP/Getty Images Neither wants to give up the dogs. | Gabriel Bouys/AFP/Getty Images\n\nAniston and Theroux may have split amicably, but they don’t seem to be on the greatest terms anymore. The cause? The fight over the custody of their four dogs.\n\nA source told Radar Online, “The custody of the dogs is a massive sticking point in their divorce agreement!”\n\nNext: Theroux may have moved on with this celebrity.\n\n7. Theroux is reportedly seeing Selena Gomez\n\nSelena Gomez is 21 years younger than Theroux. | Selena Gomez is 21 years younger than Theroux. | Selena Gomez via Instagram\n\nRumors have begun circulating that Theroux has moved on from Aniston with Selena Gomez — who is 21 years his junior. According to Cosmopolitan, a source claimed, “Initially, they leaned on each other for emotional support after going through messy breakups. It’s turned into something more than friendship.”\n\nNext: Here’s why their rumored relationship is so messed up.\n\n8. Gomez and Aniston are apparently super close\n\nJennifer Aniston and Selena Gomez are good friends. | Michael Buckner/Getty Images for InStyle Jennifer Aniston and Selena Gomez are good friends. | Michael Buckner/Getty Images for InStyle\n\nAniston clearly isn’t happy with Theroux’s apparent relationship with Gomez. She and Gomez have boasted about their friendship in the past, making this romance rumor particularly shady.\n\nA source told The Sun, “Jennifer called her to ask why she had been hanging out with Justin, because she felt betrayed.”\n\n“She has been close to Selena for a few years and has taken her under her wing,” the source added. “But Jen has clearly been offended, which really affected Selena.”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/selena-gomez-outfit1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-491198722.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/jenniferanistonselena.png?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Jennifer-Aniston-at-a-Smartwater-and-St.-Judes-Childrens-Hospital-event.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/05/Brad-Pitt-with-Jennifer-Aniston-e1463500554471.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2014/10/Justin-Theroux.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/health-fitness/the-dark-secrets-behind-jennifer-aniston-and-justin-therouxs-divorce-and-why-his-rumored-relationship-with-selena-gomez-is-so-messed-up.html/", "title": "The Dark Secrets Behind Jennifer Aniston and Justin Theroux’s Divorce (and Why His Rumored Relationship With Selena Gomez Is So Messed Up)", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/the-dark-secrets-behind-jennifer-aniston-and-justin-therouxs-divorce-and-why-his-rumored-relationship-with-selena-gomez-is-so-messed-up.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Jennifer Aniston and Justin Theroux shocked the world when they announced their split, but now, dark secrets have surfaced amid their divorce.", "og": {"locale": "en_US", "type": "article", "title": "The Dark Secrets Behind Jennifer Aniston and Justin Theroux’s Divorce (and Why His Rumored Relationship With Selena Gomez Is So Messed Up)", "description": "Jennifer Aniston and Justin Theroux shocked the world when they announced their split, but now, dark secrets have surfaced amid their divorce.", "url": "https://www.cheatsheet.com/health-fitness/the-dark-secrets-behind-jennifer-aniston-and-justin-therouxs-divorce-and-why-his-rumored-relationship-with-selena-gomez-is-so-messed-up.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-25T19:04:19-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Jennifer aniston", "section": "Health & Fitness", "published_time": "2018-05-26T17:04:04-04:00", "modified_time": "2018-05-25T19:04:19-04:00"}, "twitter": {"card": "summary_large_image", "description": "Jennifer Aniston and Justin Theroux shocked the world when they announced their split, but now, dark secrets have surfaced amid their divorce.", "title": "The Dark Secrets Behind Jennifer Aniston and Justin Theroux’s Divorce (and Why His Rumored Relationship With Selena Gomez Is So Messed Up)", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1527368644.0, "source": "https://www.cheatsheet.com", "summary": ""}