{"url": "https://variety.com/2018/tv/news/bachelor-winter-games-surprise-engagement-finding-love-in-four-episodes-1202706770/", "text": "SPOILER ALERT: Do not read if you have not yet watched “The Bachelor Winter Games” finale from Thursday, Feb. 22.\n\n“The Bachelor Winter Games” finished its inaugural season on Thursday, capping a four-episode run with the “World Tells All” special to check in with the international cast.\n\nThe Olympics-inspired show, which mixed fan favorites from the American franchise with “Bachelor” alums from the international franchises, centered on competing in winter sports challenges and, of course, finding love. And despite the short shooting schedule, find love they did. Four couples emerged from the show, with one surprise proposal at the “World Tells All” taping.\n\nClare Crawley, runner-up on Juan Pablo Galavis’ infamous “Bachelor” season and contestant on “Bachelor in Paradise,” and Canada’s Benoit Beausejour-Savard, got engaged after a whirlwind romance.\n\nThe two briefly dated on “Bachelor Winter Games” before Beausejour-Savard left the show brokenhearted when Crawley started showing interest in other men. However, they reconnected after filming and dated for two months before Beausejour-Savard proposed on the “Tells All” stage.\n\n“As soon as I got back from ‘Winter Games’ there was a message from him just checking to see if I was okay,” Crawley told Variety shortly after she accepted the engagement and custom Neil Lane ring.\n\nAt the time, Beausejour-Savard said he thought she had ended up with another man from the show but still wanted to check on her as he says he knew “it wasn’t the end of the two of us.” They continued to grow their relationship but kept it a the secret from their fellow “Bachelor” cast mates — by avoiding them.\n\n“They were thinking we were savage and didn’t want any news from them, but that wasn’t it,” Beausejour-Savard said. “We were bad at lying and just wanted to avoid the lies.”\n\nAs a result, the cast said they were just as surprised as the audience, with fan-favorite Ashley Iaconetti saying she was “truly shocked, truly amazed, just in awe” and friend Lesley Murphy said “it was so unexpected but in the best way possible.”\n\nJordan Mauger, a former Bachelor in New Zealand, called Beausejour-Savard a “sneaky French bugger” for lying to them, saying, “He really pulled one over on us because we were just hanging out with them last night and watching the episode where the stuff goes down with Benoit and Clare, and Clare left the room. And we were like ‘Oh my God, there’s still s— going down?’ But it was all play, they were good, give them the reality Oscar.”\n\nAs for the other couples, Americans Dean Unglert and Murphy found love on the show, as did Iaconetti and Canadian Kevin Wendt, and Australia’s Courtney Dober and New Zealand’s Lily McManus.\n\nUnglert, who was beloved with fans after Rachel Lindsay’s season of “The Bachelorette” but fell from favor after his behavior on “Bachelor in Paradise,” got down on one knee during the “World Tells All” taping. But instead of presenting an engagement ring, too, Unglert gave Murphy a key to his house.\n\nHe said he didn’t know what to expect going into the show, but “even the producers, the creators — everyone — were surprised and excited to see the amount of couples that came out of it.”\n\n“I think this has more couples coming out of it [than even ‘Bachelor in Paradise’], so it’s good to see people grow so quickly and so fondly for each other over such a short amount of time,” Unglert said.\n\nIaconetti, who first appeared on Chris Soules’ season and has since been on “Bachelor in Paradise,” said that she feared there would be cliques going into “Winter Games.” Citing her friendship with Ben Higgins, Luke Pell and Unglert, she admitted she thought the Americans would all stick together but was pleasantly surprised to find everyone, instead, “assimilated together as different countries, and it was pretty awesome.”\n\nWendt added that he was surprised how well the cast got along, and was expecting “to have the Chads [Johnson, of JoJo’s season] of the house ready to fight me and crazy women fighting each other.”\n\n“It was cool because when I started clicking with Ashley, we just laid around all day talking about everything, and all the guys were friends with each other,” Wendt said. “It was a very positive feeling leaving there that I made a bunch of friends and a girlfriend all in one.”\n\nMauger shared a moment he wished had aired — when he and Dober faced off in a New Zealand versus Australia downhill skiing challenge. The two bet that whoever lost the competition had to do a “shoey” — drinking a beer out of a shoe — from the other person’s ski boot. Mauger came out on top and said, “We went back to the lodge, and he had to drink, and I made sure my boot was really sweaty. It was an absolute laugh.”\n\nHiggins, the former Bachelor who ended his engagement with Lauren Bushnell last year, left “Winter Games” early after realizing he wasn’t over his previous relationship and was not yet ready to date. Still, he said he has no regrets about the experience.\n\n“It was different. I didn’t know what I was getting myself into, honestly, and I think the thing that maybe excited me about the whole experience was every day when I woke up it felt easy because it felt very real,” Higgins said. “I didn’t know it was going to be a dating show. I didn’t know it was also going to be a very limited amount of competitions. I just went into it thinking ‘Hey, this seems like the right next step for me.’ I’m really glad I did it.”\n\nStassi Yaramchuk from “Bachelor” Sweden also revealed at “World Tells All” that she was single after striking up a relationship with Pell on the show. She alleged that Pell refused to talk to her after filming ended and claimed the romance was just for TV, with the two facing off for an awkward conversation during the tell-all taping. Yaramchuck says she is now interested in being the next Bachelorette.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fbachelor-winter-games-surprise-engagement-finding-love-in-four-episodes-1202706770%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202706770&comment_count=7", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://pmcvariety.files.wordpress.com/2018/02/bachelor-winter-games.jpg?w=1000"], "top_img": "https://pmcvariety.files.wordpress.com/2018/02/bachelor-winter-games.jpg?w=1000", "keywords": [], "authors": ["Kirsten Chuba"], "canonical_link": "https://variety.com/2018/tv/news/bachelor-winter-games-surprise-engagement-finding-love-in-four-episodes-1202706770/", "title": "‘Bachelor Winter Games’ Cast Talks Surprise Engagement, Finding Love in Four Episodes", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"Winter Games\" finished off it's first season on Thursday, capping its four-episodes with the \"World Tells All\" to check in with the cast.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202706770, "author": "Kirsten Chuba", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-02-22T20:00:04"}, "pmc-tag": "Ben Higgins,Benoit Beausejour-Savard,Clare Crawley,The Bachelor,The Bachelor Winter Games", "title": "‘Bachelor Winter Games’ Cast Talks Surprise Engagement, Finding Love in Four Episodes", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Bachelor Winter Games’ Cast Talks Surprise Engagement, Finding Love in Four Episodes", "url": "https://variety.com/2018/tv/news/bachelor-winter-games-surprise-engagement-finding-love-in-four-episodes-1202706770/", "description": "SPOILER ALERT: Do not read if you have not yet watched “The Bachelor Winter Games” finale from Thursday, Feb. 22. “The Bachelor Winter Games” finished its inaugural season on Thursday, …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/02/bachelor-winter-games.jpg?w=1000", "width": 1000, "height": 563, "alt": "THE BACHELOR WINTER GAMES - Is love the universal language? Find out as 14 international bachelors and bachelorettes from such countries as Switzerland, Japan and Australia compete and, hopefully, find love with 12 of AmericaÕs Bachelor Nation favorites. These singles will go head-to-head in winter-themed challenges, including the toughest sport of all - love. Chris Harrison hosts this highly anticipated, four-episode series, complete with the usual dose of tears, drama, romance and laughter, as ÒThe Bachelor Winter Games,Ó a global celebration of unity and love, premieres on TUESDAY, FEB. 13 (8:00-10:01 p.m. EST), on The ABC Television Network. (ABC/Lorenzo Bevilaqua)BENOIT BEAUSEJOUR-SAVARD, CLARE CRAWLEY"}, "locale": "en_US"}, "article": {"published_time": "2018-02-23T04:00:04+00:00", "modified_time": "2018-02-23T04:00:06+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "‘Bachelor Winter Games’ Cast Talks Surprise Engagement, Finding Love in Four Episodes"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/02/bachelor-winter-games.jpg?w=1000", "alt": "THE BACHELOR WINTER GAMES - Is love the universal language? Find out as 14 international bachelors and bachelorettes from such countries as Switzerland, Japan and Australia compete and, hopefully, find love with 12 of AmericaÕs Bachelor Nation favorites. These singles will go head-to-head in winter-themed challenges, including the toughest sport of all - love. Chris Harrison hosts this highly anticipated, four-episod…"}, "card": "summary_large_image", "title": "‘Bachelor Winter Games’ Cast Talks Surprise Engagement, Finding Love in Four Episodes", "description": "\"Winter Games\" finished off it's first season on Thursday, capping its four-episodes with the \"World Tells All\" to check in with the cast."}, "author": "Kirsten Chuba", "content_type": "Article", "post_id": 1202706770, "title": "'Bachelor Winter Games' Cast Talks Surprise Engagement, Finding Love in Four Episodes", "published_at": "2018-02-22 20:00:04", "image": "https://pmcvariety.files.wordpress.com/2018/02/bachelor-winter-games.jpg?w=1000", "comment_count": 7, "tags": "The Bachelor Winter Games", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched “The Bachelor Winter Games” finale from Thursday, Feb. 22.\r\n\r\n\"The Bachelor Winter Games\" finished its inaugural season on Thursday, capping a four-episode run with the \"World Tells All\" special to check in with the international cast.\r\n\r\nThe Olympics-inspired show, which mixed fan favorites from the American franchise with \"Bachelor\" alums from the international franchises, centered on competing in winter sports challenges and, of course, finding love. And despite the short shooting schedule, find love they did. Four couples emerged from the show, with one surprise proposal at the \"World Tells All\" taping.\r\n\r\nClare Crawley, runner-up on Juan Pablo Galavis' infamous \"Bachelor\" season and contestant on \"Bachelor in Paradise,\" and Canada's Benoit Beausejour-Savard, got engaged after a whirlwind romance.\r\n\r\nThe two briefly dated on \"Bachelor Winter Games\" before Beausejour-Savard left the show brokenhearted when Crawley started showing interest in other men. However, they reconnected after filming and dated for two months before Beausejour-Savard proposed on the \"Tells All\" stage.\r\n\r\n\"As soon as I got back from 'Winter Games' there was a message from him just checking to see if I was okay,\" Crawley told Variety shortly after she accepted the engagement and custom Neil Lane ring. \r\n\r\nAt the time, Beausejour-Savard said he thought she had ended up with another man from the show but still wanted to check on her as he says he knew \"it wasn’t the end of the two of us.\" They continued to grow their relationship but kept it a the secret from their fellow \"Bachelor\" cast mates — by avoiding them. \r\n\r\n\"They were thinking we were savage and didn’t want any news from them, but that wasn’t it,\" Beausejour-Savard said. \"We were bad at lying and just wanted to avoid the lies.\" \r\n\r\nAs a result, the cast said they were just as surprised as the audience, with fan-favorite Ashley Iaconetti saying she was \"truly shocked, truly amazed, just in awe\" and friend Lesley Murphy said \"it was so unexpected but in the best way possible.\"\r\n\r\nJordan Mauger, a former Bachelor in New Zealand, called Beausejour-Savard a \"sneaky French bugger\" for lying to them, saying, \"He really pulled one over on us because we were just hanging out with them last night and watching the episode where the stuff goes down with Benoit and Clare, and Clare left the room. And we were like 'Oh my God, there’s still s--- going down?' But it was all play, they were good, give them the reality Oscar.\"\r\n\r\nAs for the other couples, Americans Dean Unglert and Murphy found love on the show, as did Iaconetti and Canadian Kevin Wendt, and Australia's Courtney Dober and New Zealand's Lily McManus.\r\n\r\nUnglert, who was beloved with fans after Rachel Lindsay's season of \"The Bachelorette\" but fell from favor after his behavior on \"Bachelor in Paradise,\" got down on one knee during the \"World Tells All\" taping. But instead of presenting an engagement ring, too, Unglert gave Murphy a key to his house.\r\n\r\nHe said he didn't know what to expect going into the show, but \"even the producers, the creators — everyone — were surprised and excited to see the amount of couples that came out of it.\"\r\n\r\n\"I think this has more couples coming out of it [than even 'Bachelor in Paradise'], so it’s good to see people grow so quickly and so fondly for each other over such a short amount of time,\" Unglert said.\r\n\r\nIaconetti, who first appeared on Chris Soules' season and has since been on \"Bachelor in Paradise,\" said that she feared there would be cliques going into \"Winter Games.\" Citing her friendship with Ben Higgins, Luke Pell and Unglert, she admitted she thought the Americans would all stick together but was pleasantly surprised to find everyone, instead, \"assimilated together as different countries, and it was pretty awesome.\"\r\n\r\nWendt added that he was surprised how well the cast got along, and was expecting \"to have the Chads [Johnson, of JoJo's season] of the house ready to fight me and crazy women fighting each other.\"\r\n\r\n\"It was cool because when I started clicking with Ashley, we just laid around all day talking about everything, and all the guys were friends with each other,\" Wendt said. \"It was a very positive feeling leaving there that I made a bunch of friends and a girlfriend all in one.\"\r\n\r\nMauger shared a moment he wished had aired — when he and Dober faced off in a New Zealand versus Australia downhill skiing challenge. The two bet that whoever lost the competition had to do a \"shoey\" — drinking a beer out of a shoe — from the other person's ski boot. Mauger came out on top and said, \"We went back to the lodge, and he had to drink, and I made sure my boot was really sweaty. It was an absolute laugh.\"\r\n\r\nHiggins, the former Bachelor who ended his engagement with Lauren Bushnell last year, left \"Winter Games\" early after realizing he wasn't over his previous relationship and was not yet ready to date. Still, he said he has no regrets about the experience.\r\n\r\n\"It was different. I didn’t know what I was getting myself into, honestly, and I think the thing that maybe excited me about the whole experience was every day when I woke up it felt easy because it felt very real,\" Higgins said. \"I didn’t know it was going to be a dating show. I didn’t know it was also going to be a very limited amount of competitions. I just went into it thinking 'Hey, this seems like the right next step for me.' I’m really glad I did it.\"\r\n\r\nStassi Yaramchuk from \"Bachelor\" Sweden also revealed at \"World Tells All\" that she was single after striking up a relationship with Pell on the show. She alleged that Pell refused to talk to her after filming ended and claimed the romance was just for TV, with the two facing off for an awkward conversation during the tell-all taping. Yaramchuck says she is now interested in being the next Bachelorette.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1519358404.0, "source": "https://variety.com", "summary": ""}