{"url": "https://en.wikipedia.org/wiki/Benefit_concert", "text": "Type of musical benefit performance\n\nEvita, see \"Charity concert\" redirects here. For the song in the musical, see Evita (musical)\n\nLive 8 , a large, international series of benefit concerts staged in 2005\n\nA benefit concert or charity concert is a type of musical benefit performance (e.g., concert, show, or gala) featuring musicians, comedians, or other performers that is held for a charitable purpose, often directed at a specific and immediate humanitarian crisis.\n\nBenefit concerts can have both subjective and concrete objectives. Subjective objectives include raising awareness about an issue such as misery in Africa (such as Live 8) and uplifting a nation after a disaster (such as America: A Tribute to Heroes). Concrete objectives include raising funds (such as Live Aid) and influencing legislation (such as Live 8 or Farm Aid). The two largest benefit concerts of all time, in size, were the Live 8 and the Live Earth events, which both attracted billions of spectators.[1] Scholars theorize that the observed increase on concert size since the Live Aid is happening because organizers strive to make their events as big as the tragedy at hand, thus hoping to gain legitimization that way.[2]\n\nHistory [ edit ]\n\nExamples exist in musical history of concerts being staged for philanthropic purposes. In 1749, the composer George Frideric Handel wrote his Foundling Hospital Anthem, and put on annual performances of Messiah, to support an orphans' charity in London.[3] While many composers and performers took part in concerts to raise donations for charitable causes, it was also not unusual in the 18th and 19th centuries for musicians to stage performances to raise funds for their own professional work, such as Ludwig van Beethoven's 1808 Akademie concert.[4][5]\n\nThe modern understanding of a benefit concert is of a large-scale, popular event put on to support a charitable or political cause. In the modern era, the first benefit concert is generally held to be the Concert For Bangladesh, a programme of two events held at Madison Square Garden in New York City in 1971, which were organized by George Harrison and Ravi Shankar.[6][self-published source?] However, the format of most modern concerts was established in 1985 by Bob Geldof's Live Aid event.[1]\n\nCelebrity charity [ edit ]\n\nBenefit concerts are a major example of celebrity charity for they involve popular musicians; actors and actresses; and other kinds of entertainment figures volunteering to a greater cause. The efficiency of celebrity charity is explained by the theory of Catalytic Philantihropy designed by Paul Schervish. His thesis explains that it is more beneficial to a cause that celebrities do not contribute by only donating their money, but by participating in event like benefit concerts. That way stars can inspire hundreds of thousands of others to give.[7]\n\nThe presence of celebrities can draw criticism, but that is outweighed by the benefits. Some argue that pop stars only take part in charity to improve their public image. That, arguably, may be a motivation, but their participation can be essential to the event's success. Celebrities not only promote catalytic philanthropy, they can produce an effect some call Geldofism: “The mobilization of pop stars and their fans behind a cause.”[8] Therefore, because of their visibility, celebrities are used by organizers as a mean to gain support to the cause in hand.\n\nFurthermore, the success of benefit concerts is tightly related to the quality of entertainment offered by them.[9] To gain space and legitimization in the media, benefit concerts must have a large audience, the kind of large crowd attracted by famous music stars. Bob Geldof himself responded to criticisms about the lack of African artists on the Live 8 by stating that, although those musicians produce great works, they do not sell many albums—and, for the sake of reaching as many people as possible, his concert had to include only popular artists.[10]\n\nFinally, the quality of entertainment is key to the creation of a public sphere where discussions about the concert's cause can occur. The better the entertainment, the more people watch the concert, and thus the more people become aware of the cause.[11] Furthermore, the music played in the concerts can lead spectators to interconnect and become more likely to act towards the cause. According to a theory, by Jane Bennett, when people sing in the presence of other people, and that happens in benefit concerts, they become connected to each other and are more likely to work together towards a goal.[12][13]\n\nCritics also say that benefit concerts are just a way for the rich West to forgive itself by helping the poor and distressed. These critiques argue that concerts like the Live Aid \"rob Africans of agency, reinforces Western ethnocentrism and racisms and see famine as a natural disaster rather than as a political issue\".[14]\n\nEffectiveness [ edit ]\n\nBenefit concerts are an effective form of gaining support and raising funds for a cause because of the large media coverage that they usually receive.[15] In addition to the results they generate themselves, benefit concerts also generate a kind of cascading effect. That is, larger benefit concert motivate smaller concerts and other kinds of charity initiatives.[2]\n\nAs media events [ edit ]\n\nLarge-scale benefit concerts attract millions of viewers and are usually broadcast internationally. As powerful means of mass communication, they can be highly effective at raising funds and awareness for humanitarian causes. Media scholars Dayan and Katz classify benefit concerts as “media events”: shared experiences that unite viewers with one another and their societies.[16] In fact, in their book Media Events: The Live Broadcasting of History, the authors suggest that the song synonymous with the Live Aid benefit concert, “We Are the World,\" might as well be the theme song for media events, as it nicely encompasses the tone of such occasions: “these ceremonies (media events) are so all-encompassing that there is nobody left to serve-as out-group”.[16]\n\nDayan and Katz define media events as shared experiences that unite viewers and call their attention to a particular cause or occasion.[16] They argue that media events interrupt the flow people's daily lives, and that such events create a rise of interpersonal communication or “fellow feeling”.[16] Furthermore, they propose that media events transform the ordinary role of the viewer into something more interactive where they adhere to the script of the event.[16] All these principles of media events are true of benefit concerts. Benefit concerts interrupt the routine of people's lives because they occur (in most cases) for only for one night or for one week-end. Furthermore, they are broadcast as television spectacles that interrupt the regular scheduled programming on a given television network. Often, this kind of announced interruption has television viewers discussing the event with others beforehand, generating excitement around the event.[16] Moreover, benefit concerts encourage audiences to adhere to their script, such as by phoning in donations or signing an online pledge.\n\nBenefit concerts and para-social interaction [ edit ]\n\nAs media events, benefit concerts are widely broadcast and seen by millions of people. (The Live Aid charity concert in 1985, for example, was seen by an estimated 1.5 billion viewers worldwide.)[17] However, this mass dissemination is only one of the factors that contribute to the success of benefit concerts. The people who send the message for collective action are essential to a benefit concert's effectiveness.\n\nDayan and Katz suggest that media events are an expression of a “neo-romantic desire for heroic action”, meaning that media events produce leaders who inspire collective action with belief in the “power of the people” to change the world.[16] Benefit concerts, therefore, have the potential to raise enormous sums of money for a cause because of the para-social interaction that occurs between the performing celebrities (the leaders) and the spectating fans (the people).\n\nDan Laughey describes para-social interaction as “the apparent familiarity between media personalities and audiences”.[18] Seeing a favourite celebrity support a cause can influence fans to support the same cause—not because the cause is significant to the fans, but because it seems significant to the artist. To feel connected to a celebrity, fans are likely to participate in activities the celebrity considers important. For example, if a benefit concert starred unknown musicians performing songs for unknown people in Africa, the incentive for viewers to donate would be minimal. Bob Geldof, the founder of Live Aid, is aware of the need of familiarity and para-social interaction on behalf of the viewer. When criticised for not inviting enough African performers to play at Live Aid (of which the main purpose was famine relief for Africa), Geldof commented that only popular musicians were invited to play at the show because unfamiliar artists would cause viewers to lose interest and “switch off”.[17] In seeing the familiar face of their beloved artist on stage endorsing a cause, fans feel more compelled to support the cause.\n\nCriticisms [ edit ]\n\nCriticisms against benefit concerts go further than just criticizing the intentions of the celebrities involved. Some argue that benefit concerts are a wrong response for tragedies because the atmosphere involved on them is hardly one of mourning.[19] Further criticism comes from those who argue that Geldofism turns celebrities into the only legitimate spokespeople for a cause, robbing the NGOs of the possibilities to speak up for a cause.[20]\n\nNotable examples [ edit ]\n\nIn chronological order, beginning with the earliest date:\n\nThe Foundling Hospital Anthem (1749) and annual performances of Messiah (1749–59)\n\nStaged by the composer George Frideric Handel in support of the Foundling Hospital, a children's charity in London.[3]\n\nHistoric Concert for the Benefit of Widows and Orphans of Austrian and Hungarian Soldiers (1918)\n\nJanuary 12, 1918 – The Historic Concert for the Benefit of Widows and Orphans of Austrian and Hungarian Soldiers was held at the Konzerthaus, Vienna. Its patrons were Kaiser Charles I of Austria and Empress Zita of Bourbon-Parma, with posters designed by Josef Divéky. An estimated 1,100,000 Austro-Hungarian men, mostly unmarried, were killed in the war.[21]\n\nThe Concert for Bangladesh (1971)\n\nFestival of Hope Rockfest (1972)\n\nA Poke in the Eye (With A Sharp Stick) (1976)\n\nA Gift of Song: The Music for UNICEF Concert (1979)\n\nThe Secret Policeman's Ball (1979)\n\nThe No Nukes concerts (1979)\n\nSeptember 1979 – The No Nukes concerts in New York\n\nThe Concerts for Kampuchea (1979)\n\nThe Secret Policeman's Other Ball (1981)\n\nNuclear Disarmament Rally (1982)\n\nJune 12, 1982 – In New York City, 750,000 people marched from the UN to Central Park to protest nuclear weapons – in what was probably the largest single protest in U.S. history. NYC was shut down for the day. The concert featured artists including Jackson Browne, Linda Ronstadt, and Bruce Springsteen. Keith Haring created a poster for the event, which was handed out free to the audience.\n\nLive Aid (1985)\n\nJuly 13, 1985 – The Live Aid benefit concerts – conceived and organized by Bob Geldof and Midge Ure – took place in London and Philadelphia. Similar concerts were held in Sydney and Moscow.\n\nFarm Aid (1985)\n\nSelf Aid (1986)\n\nMay 17, 1986 – The Self Aid concert held in Dublin, Ireland aimed to highlight the chronic unemployment problem in Ireland at the time. Performers at the event included U2, Van Morrison and The Pogues.\n\nConspiracy of Hope US Tour (1986)\n\nHeart Beat 86 (1986)\n\nHuman Rights Now! World Tour (1988)\n\nSeptember 2 – October 15, 1988 The Human Rights Now! World tour of rock concerts for Amnesty International\n\nThe Wall – Live in Berlin (1990 July 21) Roger Waters (Memorial Fund for Disaster Relief)\n\nThe Freddie Mercury Tribute Concert (1992)\n\nAmerica: A Tribute to Heroes (2001)\n\nThe Concert for New York City (2001)\n\nThe SARS Benefit Concert (2003)\n\nLive 8 (2005)\n\nJuly 2, 2005 – Bob Geldof and Midge Ure organised Live 8, a set of 8 concerts held in 8 cities around the world on the same day – as part of a campaign to persuade the G8 member governments to increase their fight to eradicate poverty in third-world countries.\n\nLive Earth (2007)\n\nJuly 7, 2007 – Al Gore inspired and helped organize Live Earth. During its first year, it consisted of a series of concerts held on all seven continents of the planet on the same day.\n\nA Billion Hands Concert (2008)\n\nRockdrive (ongoing)\n\n12-12-12: The Concert for Sandy Relief (2012)\n\nThe former Jerry Lewis MDA Telethon, which aired each year every Labor Day weekend, was dramatically reformatted over the course of 2011 and 2012; from the program's founding in 1966 until 2010, the program aired as a traditional long-form telethon over the course of 21 hours. By the time of the 2012 edition, its name was changed to the current moniker, its longtime host was ousted, and its format was reduced to a three-hour benefit concert for the Muscular Dystrophy Association. The MDA announced the event's discontinuation in May 2015 in order to focus on other ways to raise support for the organization via mobile and digital media.[26]\n\nJune 4, 2017 – Ariana Grande organised a concert in dedication to the 22 victims killed at her concert that was held on 22 May 2017 at the Manchester Arena.\n\nSeptember 12, 2017 – A one-hour, commercial-free benefit concert television special for the relief efforts from the aftermath of Hurricane Harvey and Hurricane Irma (with later benefits also going to victims of Hurricane Maria the following week).\n\nList of benefit concerts [ edit ]\n\nThe following is an incomplete list of benefit concerts with their own Wikipedia page. For a more descriptive and inclusive list focusing on historically notable events, see the list above. Note that while some of the listed concerts feature only one headliner and several supporting acts, other benefit concerts feature diverse lineups and are also considered music festivals. This list may have some overlap with list of free festivals, which are rock festivals that often have a social agenda or fund-raising focus.\n\nRock and pop concerts [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/BANGLADESHconcert1971Lipack_frame.jpg/220px-BANGLADESHconcert1971Lipack_frame.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Live_8_-_edinburgh_50000_-_the_final_push_rjl.jpg/220px-Live_8_-_edinburgh_50000_-_the_final_push_rjl.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Bob_Geldof_Rock_am_Ring_1987.jpg/220px-Bob_Geldof_Rock_am_Ring_1987.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/3/3e/Live_8_-_edinburgh_50000_-_the_final_push_rjl.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Live_8_-_edinburgh_50000_-_the_final_push_rjl.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Benefit_concert", "title": "Benefit concert", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Live_8_-_edinburgh_50000_-_the_final_push_rjl.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}