{"url": "https://www.independent.co.uk/arts-entertainment/films/features/my-friend-dahmer-john-backderf-film-jeffrey-comic-book-interview-serial-killer-a8375866.html", "text": "Most of us have wondered what happened to certain kids from our school days, but few can have had their worlds rocked quite like the comic book artist John Backderf, when he found out what his erstwhile friend Jeffrey Dahmer had been up to.\n\nAfter they’d graduated from high school, Dahmer vanished. “I can’t say my friends and I were terribly concerned about it, but we did comment on it, from time to time,” says Backderf, aka Derf, on the phone from New York. “We knew his parents lived in town and yet we never saw him anywhere.”\n\nWhen Dahmer was arrested in 1991, he discovered why: Dahmer had already embarked on a murderous journey that would brutally extinguish 17 lives and make him one of America’s most notorious and depraved serial killers.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nAlthough the revelation shocked Backderf, he’d thought from quite early on that there was something off about “Jeff”. “There was always a darkness about him that was really kind of repellent,” recalls the artist, who had been “wary” of him as a consequence.\n\n“I was OK with hanging out with him, if there was other people around. I was never going to be alone with him. And I’m pretty happy I had that instinct, because that could have well been me chopped up in the trunk of his car,” says Backderf, audibly shivering as he alludes to the gruesome fate of Dahmer’s 19-year-old first victim, Steven Hicks.\n\nWe are talking because Backderf’s acclaimed 2012 graphic novel, My Friend Dahmer, has been adapted into a well-received movie, featuring a chilling performance by ex-Disney star and singer Ross Lynch as the teenage Dahmer, spiralling towards the abyss.\n\nWhen Backderf visited the set, the unnerving accuracy of Lynch’s transformation made it hard for him to talk to the actor when he was in costume. “He just reminded me so much of Jeff. It was spooky.”\n\nThis was undoubtedly enhanced by writer-director Marc Meyers’s decision to film scenes at Dahmer’s actual boyhood home in Bath, Ohio, which today is owned by a musician-friend of Backderf’s. The house is where Dahmer became a murderer, and Backderf admits that he didn’t think they would film there.\n\n“I understand why they did, especially on an indie-film budget,” he says. “But it’s sacred ground, and I kept telling them, ‘You really can’t lose sight of that. You can never lose sight, making this movie, where it ends.’ And I don’t think they did.”\n\nDahmer’s house was around eight miles from Backderf’s, and when they were juniors their paths mainly crossed at school, as lab partners and whatnot.\n\n“The problem with our town was it was a rural town, and there were these country roads that were not safe to bike on with long distances, so you were limited to kids in your immediate area to be friends with. So we were not going to really become friends. And I don’t know whether I had any interest in becoming his friend at that point.”\n\nWhen they reached high school, Dahmer changed. Previously quiet, he started throwing fake fits and doing a mocking impression of a local interior designer with cerebral palsy (Backderf later discovered that in fact he was copying his own mother, who was known to have mental health issues).\n\nIn the film, Backderf and his friends are fascinated by this behaviour and recruit him, forming the Dahmer Fan Club, with Backderf as its minister for propaganda. In reality, Dahmer came to them, claims the cartoonist.\n\n“The film strikes a different tone than what it really was, which was that he was a very willing participant in all of this. He loved every minute of it.”\n\nDahmer “inserted himself” into their group, bringing a “weirdness to the table” that they “wholeheartedly embraced”.\n\n“We were bored stiff,” recalls Backderf, “and just looking to get through the day, and Jeff was entertainment. He was a little bit dangerous, he was a little bit unpredictable, and that was fun for us.”\n\nHe insists they weren’t as casually cruel as the film suggests. “[Meyers] makes my character a little meaner than I was in real life. I wasn’t a mean kid. I certainly was not empathetic, I don’t know many 17-year-olds that are. I don’t shy away from my role in this, and never have, but the truth is that we were all kind of doing it together.”\n\nThey joined in the disablist mockery (“That’s hard to explain away… pretty inexcusable by any stretch of the imagination. But I chalk it up just to being 17 and being an idiot”), tried to hide Dahmer in plain sight in school club group photographs, placed drawings of him wherever they could. It was a laugh, until it wasn’t – Dahmer started drinking heavily and grew noticeably darker, frightening Backderf so much that he eventually “wrote Jeff off”.\n\nDahmer’s arrest years later threw Backderf into a state of confusion. “With a snap of a finger, my entire personal history changed… Suddenly all these silly things, all of this stuff that we did as teenagers, it becomes something very different. It becomes very dark, almost dangerous.”\n\nUnknown to him, while they were playing, Dahmer had been secretly struggling with his emerging homosexuality, and necrophiliac urges that scared and repulsed him to such an extent that he’d tried to tamp them down with alcohol.\n\nPut into context his “behaviour at school became very chilling,” says Backderf, “because he was perfecting the tools that he would use to become such a lethal killer. The ability to vanish. The ability to not give anything away and to charm people. The ability to hide everything that was going on in his head.\n\n“All those things he perfected when he was very young through our goofball antics, he used them when he was a monster. That’s a little hard to live with.”\n\nBackderf doesn’t believe the course Dahmer’s life took was inevitable, though, and his question has always been: where were the adults? Dahmer’s behaviour was bizarre, and his drinking was obvious to everyone, but no one in authority intervened.\n\n“They didn’t care. They just pushed him along and figured, ‘Well, next year he’ll be somebody else’s problem.’ And of course he was somebody else’s problem.”\n\nHe could easily have been Backderf’s. When he put the timeline of Dahmer’s activities together for the graphic novel, he was shocked to discover that he and his friends had been nearby when Dahmer had killed Hicks and cut up his corpse. “We were all around it at various points, in some cases mere yards away. That was a little tough to process.”\n\nWhile Dahmer would go on to kill again and again, it is the slaughter of Hicks that resonates most with Backderf.\n\n“He haunts me still,” he says sadly. “I think about him from time to time.”\n\nThey didn’t know each other, as Hicks went to a different school, “but he was like so many kids that I knew,” says Backderf. “Just kind of this affable rock’n’roller who just wanted to smoke a little weed, listen to some music, have a beer, hang out with friends, and his life was snuffed out just because he took a ride with the wrong guy. It was just so arbitrary.”\n\nIt took him a long time to deal with the truth about his friendship with Dahmer, and the role he’d unwittingly played in encouraging parts of his pathology. He didn’t start writing about it until after Dahmer was beaten to death in prison in 1994.\n\nSeeing their relationship recreated on screen (Alex Wolff plays him in the film) has been surreal. “But in a long list of things that are surreal about this story, it’s just another entry,” he laughs.\n\n“At this point, after 25 years, I just kind of shrug and say, ‘Well that was weird’, and move on. It doesn’t really have an impact on me anymore.”\n\nListening to him talking about Hicks, however, it seems clear that not all of the wounds have healed.\n\n‘My Friend Dahmer’ is in cinemas on 1 June; ‘My Friend Dahmer’ by Derf Backderf is published by Abrams ComicArts", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/30/12/my-friend-dahmer-0.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/30/12/my-friend-dahmer-0.jpg", "keywords": [], "authors": ["Stephen Applebaum"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/features/my-friend-dahmer-john-backderf-film-jeffrey-comic-book-interview-serial-killer-a8375866.html", "title": "'There was always a darkness about him': My Friend Dahmer author John Backderf on growing up with a serial killer", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/films/features/my-friend-dahmer-john-backderf-film-jeffrey-comic-book-interview-serial-killer-a8375866.html", "title": "'There was always a darkness about him': My Friend Dahmer author John Backderf on growing up with a serial killer", "description": "The comic book artist known as Derf went to the same school as Jeffrey Dahmer. Now, his account of their friendship has been turned into a film", "updated_time": "2018-05-31T13:28:21+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/30/12/my-friend-dahmer-0.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8375866"}, "description": "Most of us have wondered what happened to certain kids from our school days, but few can have had their worlds rocked quite like the comic book artist John Backderf, when he found out what his erstwhile friend Jeffrey Dahmer had been up to.   After they’d graduated from high school, Dahmer vanished. “I can’t say my friends and I were terribly concerned about it, but we did", "keywords": "My Friend Dahmer, Jeffrey Dahmer, John Backderf, Features, Film, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "My Friend Dahmer", "published_time": "2018-05-30T14:06:00+01:00", "modified_time": "2018-05-31T13:28:21+01:00", "section": "Features", "author_name": "Stephen Applebaum", "content_type": "story", "word_count": 1474, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 0}, "twitter": {"title": "'There was always a darkness about him': My Friend Dahmer author Joh…", "description": "Most of us have wondered what happened to certain kids from our school days, but few can have had their worlds rocked quite like the comic book artist John Backderf, when he found out what his", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1527685560.0, "source": "https://www.independent.co.uk", "summary": ""}