{"url": "www.independent.co.uk/arts-entertainment/films/news/meryl-streep-harvey-weinstein-statement-disgraceful-a7990836.html", "text": "Meryl Streep has called Harvey Weinstein “disgraceful” over the sexual harassment allegations made against the Hollywood producer.\n\nThe Academy Award-winner issued a statement to The Huffington Post, revealing she was not aware of Weinstein’s behaviour before the allegations were made public.\n\nStreep has collaborated with Weinstein on numerous projects, including August: Osage County and The Iron Lady, even once referring to him as a “God”.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nWeinstein has been accused of sexually harassing numerous women over the past few decades, the producer having reportedly paid eight individuals to keep the story quiet.\n\nMany critics, including Donald Trump Jnr, have been vocal about Hollywood not discussing the Weinstein situation. The Daily Beast even used an image of the producer with Streep for an article titled: “Hollywood’s Loud Silence on Harvey Weinstein’s Sexual Harassment Allegations.”\n\nShape Created with Sketch. Harvey Weinstein: his accusers Show all 42 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Harvey Weinstein: his accusers 1/42 Harvey Weinstein Harry Weinstein’s reputation as one of Hollywood’s leading executives was long cemented in stone. The acclaimed movie mogul, who produced Oscar-winning films Shakespeare in Love, The English Patient, and The Artist, clocked up box office successes and accolades aplenty. But this has quickly changed since a chorus of women have come forward to accuse the Hollywood producer of sexual harassment and assault. Since the New York Times’ bombshell report disclosed sexual harassment and rape allegations against the film mogul dating back decades, Weinstein has been fired from his namesake company, expelled from the Oscars and has had his wife leave him. Weinstein has apologised for having “caused a lot of pain” but has denied all allegations of nonconsensual sex. Getty 2/42 Annabella Sciorra The Sopranos actor alleged Weinstein raped her after shooting The Night We Never Met, a 1993 movie that Weinstein produced. Similar to the stories told by other women, Weinstein drove the actor home, only to reportedly burst into Sciorra's apartment and start unbuttoning his shirt. “He shoved me onto the bed, and he got on top of me,” Sciorra said. “I kicked and I yelled.” Weinstein then allegedly locked her arms and forced sexual intercourse on her. After the incident, Sciorra found it increasingly hard to get work, many filmmakers saying 'We heard you were difficult', something the actor claims was because of the 'Weinstein-machine'. Getty 3/42 Natassia Malthe The model and actress, who has appeared in around 50 films, said she met Weinstein at a BAFTA after party in 2008 while she was working as a spokeswoman for LG. She told a press conference in New York that she felt pressured into telling Weinstein she was staying at the Sanderson Hotel after being put on the spot. Malthe, now 43, said after her shift on February 10 she went back to her room and went to sleep, but was awoken by \"repeated pounding\" on her door, from someone yelling: \"Open the door Natassia Malthe, it's Harvey Weinstein.\" Feeling humiliated, she said she opened the door. She alleged Weinstein began implying sex would get her a role in an upcoming film while semi-undressed and then he began to masturbate. \"I was sitting on the bed talking to Harvey when he pushed me back and forced himself onto me. It was not consensual. He did not use a condom,\" she said. AP 4/42 Sean Young The actor, best known for her role in Ridley Scott's Blade Runner, said that Weinstein exposed himself to her in the early 1990s, when she was starring in the Miramax-produced Love Crimes - a production company that Weinstein headed at the time. \"I personally experienced him pulling his you-know-what out of his pants to shock me,\" she said. \"My basic response was, 'You know, Harvey, I really don’t think you should be pulling that thing out, it’s not very pretty.'\" Young never worked with Weinstein again after the incident. 5/42 Mimi Haleyi Mimi Haleyi said she was assaulted by Weinstein in what appeared to be a child's bedroom in his New York City apartment in 2006 when she was in her 20s. She said she was aspiring to work in television and film production when she was first introduced to him at the London premiere of The Aviator around two years earlier and he helped her get experience on the set of a TV show being produced by The Weinstein Company. But, she added, he repeatedly hassled her and even tried to force himself through her front door in an effort to get her to join him on a trip to Paris. At one point he allegedly forcibly performed oral sex on an aspiring production assistant while she was on her period. Getty 6/42 Lupita Nyong'o In an op-ed for The New York Times, the Oscar-winning actor said she was invited to Weinstein’s family home in Connecticut on the premise of watching a film shortly after they met in 2011. But she said shortly after it started he \"insisted\" in front of his children that she follow him and she was led to his bedroom. The Kenyan-Mexican actress, now 34, said she felt pressured into giving him a massage after he offered her one. \"Before long he said he wanted to take off his pants,\" she wrote.\"I told him not to do that and informed him that it would make me extremely uncomfortable. He got up anyway to do so and I headed for the door, saying that I was not at all comfortable with that.\" Over the years that followed, he continued to get in touch, Nyong'o said, and when she declined another proposition she felt her career was threatened. Getty 7/42 Lena Headey Writing on social media, the Game of Thrones actor claims she first met Weinstein at the Venice Film Festival in 2005 where, after taking her for a walk by the water, he “made some suggestive comment and gesture.” Headey claims she bumped into Weinstein years later where he kept asking her questions about her love life. She alleges that, when Weinstein invited her to his hotel room to show her a script, the \"energy shifted.” The actor notes how, after saying she was not interesting in anything but the work, Weinstein was furious, apparently marching her back to a lift, \"grabbing and holding tightly to the back of [her] arm.\" She claims that, after paying for her car, he whispered in her ear: \"Don't tell anyone about this, not your manager, not your agent.” Headey finished the post, writing: “I got in the car and I cried.” Getty Images 8/42 Lucia Evans The actor told The New Yorker that after a meeting to discuss casting her in various projects, Weinstein forced her to perform oral sex on him. “I said, over and over, ‘I don’t want to do this, stop, don’t’.” She added: “He’s a big guy. He overpowered me. I just sort of gave up. That’s the most horrible part of it, and that’s why he’s been able to do this for so long to so many women: people give up, and then they feel like it’s their fault.” Getty 9/42 Laura Madden Madden, a production assistant who worked at Miramax for a decade, told the Times that Weinstein allegedly “prodded her for massages at hotels,” a common theme among the sources the Times’s reporters spoke with. On one occasion, she claims she locked herself in his hotel bathroom, sobbing 10/42 Ashley Judd Judd recounted for the Times how Weinstein allegedly harassed her while she was filming Kiss the Girls in 1996, inviting her to his hotel room and asking her for a massage, then inviting her to watch him shower. Judd first went public with the allegations in a 2015 interview with Variety during which she discussed the experience without naming the producer involved. She described Weinstein’s alleged behaviour as “coercive bargaining”; “I said no, a lot of ways, a lot of times, and he always came back at me with some new ask,” she told the Times AFP/Getty 11/42 Rose McGowan McGowan reportedly reached a “previously undisclosed” $100,000 settlement with Weinstein in 1997, over an incident that occurred in a hotel room Getty 12/42 Mimi Haleyi Mimi Haleyi said she was assaulted by Weinstein in what appeared to be a child's bedroom in his New York City apartment in 2006 when she was in her 20s. She said she was aspiring to work in television and film production when she was first introduced to him at the London premiere of The Aviator around two years earlier and he helped her get experience on the set of a TV show being produced by The Weinstein Company. But, she added, he repeatedly hassled her and even tried to force himself through her front door in an effort to get her to join him on a trip to Paris. At one point he allegedly forcibly performed oral sex on an aspiring production assistant while she was on her period. Getty 13/42 Emily Nestor Nestor had been temping at the Weinstein Company for only one day in 2014 when Weinstein allegedly offered to boost her career in return for sexual favours, according to the Times. She declined and reportedly complained of his behaviour to colleagues, who later passed the information on to senior executives. An internal Weinstein Company document cited by the Times describes Nestor’s encounter with Weinstein as follows: “She said he was very persistent and focused though she kept saying no for over an hour” Getty 14/42 Ambra Battilana In March 2015, Battilana, an aspiring model and actress, was reportedly summoned to Weinstein’s office on a Friday night to discuss her career. According to a police report cited by the Times, Battilana claimed she was assaulted by Weinstein, who “grabbed her breasts after asking if they were real and put his hands up her skirt.” Weinstein later claimed that Battilana had set him up, according to colleagues of his who were interviewed by the Times. The Manhattan District Attorney, Cyrus Vance, later declined to press charges, and according to the Times, “made a payment” to Battilana. On 5 October, the International Business Times reported that after Vance dropped the charges, he received $10,000 from Weinstein’s lawyer 15/42 Lauren O’Connor Lauren O’Connor, an employee of the Weinstein Company, penned a memo to executives alleging “a toxic environment for women” at the company. The memo cited numerous incidents of Weinstein harassing or coercing women who worked for him. She expressed fear that Weinstein was using her and other female employees to “facilitate liaisons with ‘vulnerable women who hope he will get them work.’” That same year, Weinstein allegedly reached a settlement with O’Connor Getty 16/42 Kate Beckinsale The actor, who starred in the Weinstein Company films Serendipity and The Aviator, alleges that she was invited to Weinstein’s hotel room at the age of just 17. When she approached the door, the producer reportedly greeted her dressed in just a dressing gown. “I was incredibly naive and young and it did not cross my mind that this older, unattractive man would expect me to have any sexual interest in him,” she wrote on Instagram. “After declining alcohol and announcing that I had school in the morning I left, uneasy but unscathed.” Theo Wargo/Getty Images 17/42 Gwyneth Paltrow The actor alleges that after he cast her in the title role of the film Emma when she was 22, he took her to his hotel room, placed his hands on her and suggested massages. “I was a kid, I was signed up, I was petrified,” Paltrow told the New York Times. Rex Features 18/42 Asia Argento Italian actress Asia Argento has alleged that in 1997 Weinstein forcibly performed oral sex on her as she repeatedly told him to stop. “When I see him, it makes me feel little and stupid and weak,” Argento told The New Yorker. “After the rape, he won”. Rex Features 19/42 Cara Delevigne The British model and actress penning an Instagram post claiming that Weinstein had ordered her to kiss another woman in his hotel room, and tried to kiss her on the lips. AFP/Getty 20/42 Ashley Judd Ashley Judd said she rebuffed Harvey Weinstein’s unwanted sexual advances by offering to consent only after she had won an Oscar. When she was initially invited to a meeting with Weinstein, Judd said, she was surprised to learn the producer was in his hotel room - a tactic that recurs in other womens’ accounts. Echoing the accounts of other women, Judd said Weinstein suggested she give him a massage and then invited her to watch him shower. After a “volley of no’s” she said she would only after she wins an Oscar, fleeing after making the comments. Reuters/Mike Segar 21/42 Judith Godrèche French actress Judith Godrèche said when she was 24 Weinstein invited her to his hotel room and asked to give her a massage. “The next thing I know, he’s pressing against me and pulling off my sweater,” she told the New York Times. Rex Features 22/42 Mira Sorvino The Oscar-winning actor said she found herself in a hotel room with Weinstein in 1995 where “he started massaging my shoulders, which made me very uncomfortable, and then tried to get more physical, sort of chasing me around.” According to an interview in The New Yorker Weinstein subsequently arrived at her apartment late at night and she had to call a friend to come over to pose as her boyfriend in order to get Weinstein out of the house. Rex Features 23/42 Katherine Kendall The actress said Weinstein undressed and chased her around a living room when she was just 23. She subsequently felt that telling others meant “I’ll never work again and no one is going to care or believe me,” she told the New York Times. WireImage 24/42 Tomi-Anne Roberts As an aspiring actress and working in a restaurant in New York, Tomi-Ann Roberts encountered Weinstein who encouraged her to audition for one of his films back in 1984. She subsequently went to meet him and found him naked in the bath and invited her to get naked and get into the bath with him, she told the New York Times. She said she left feeling manipulated. 25/42 Myleen Klass It has also been alleged that the disgraced film producer propositioned Myleene Klass with a “sex contract” at Cannes Film Festival in 2010. One of the singer and television personality’s friends reportedly told The Sun, Klass had told Weinstein to “f*** off”. Getty Images 26/42 Sophie Dix Sophie Dix, best known for her role as Captain Sadie Williams in Soldier Soldier, described her encounter with Weinstein when she was 23 as “the single most damaging thing that’s happened in my life”. She told The Guardian Weinstein had pushed her to her bed and was “tugging at her clothes”. She rushed to the bathroom to escape, but when she came out she found him “standing there masturbating”. “I quickly closed the door again and locked it,” she said. “Then when I heard room service come to the door I just ran.” Rex 27/42 Léa Seydoux The actor and director claims she had to fight off Weinstein after he brought her to his hotel room during what she remembers to be 2012. “He suddenly jumped on me and tried to kiss me. I had to defend myself. He’s big and fat, so I had to be forceful to resist him. I left his room, thoroughly disgusted,” she wrote in The Guardian. AFP/Getty Images 28/42 Claire Forlani British actress Claire Forlani wrote on Twitter that she had evaded Weinstein’s advances on five occasions at the age of 25. At meetings with the Hollywood a-lister, she says “massage was suggested”, and that Weinstein had boasted of all the women he’d had sex with. Mark Douet 29/42 Florence Darel French actress Florence Darel claimed Weinstein relentlessly pursued her in the mid 1990's and propositioned her while Eve Chilton, his wife at the time, was in the hotel room next door. “I was astonished,” she told People magazine. “When you have someone so physically disgusting in front of you, continuing and continuing as though this was all perfectly normal… What happened to me may not be illegal but it was inappropriate. Very inappropriate.” Getty 30/42 Lysette Anthony Lysette Anthony, who starred as Marnie Nightingale in Hollyoaks, has claimed Weinstein raped her in the late 1980's after turning up to her London home in the late 1980’s. She described the disgraced film producer’s alleged attack as “pathetic and revolting” and said it left her feeling “disgusted and embarrassed”. Getty 31/42 Dawn Dunning Dunning said she met Weinstein in 2003 when she was 24-years-old and the disgraced film producer suggested she have a threesome with him and someone else. She told the New York Times Weinstein got angry when she refused. “You’ll never make it in this business,” she said he told her as she left. Rex Features 32/42 Rosanna Arquette Rosanna Arquette was already well known for her role in Desperately Seeking Susan, when she said she met Weinstein at his hotel to pick up a script in the early nineties. Weinstein was dressed only in a dressing gown, and tried to put her hand on his erect penis. Speaking to the New York Times, Arquette said as she left she told him: “I will never be that girl.” Rex Features 33/42 Emma de Caunes Caunes, a French actor, claimed Weinstein took her to his hotel room in 2010 supposedly to retrieve a book he was making into a film, but once there he went into the bathroom. De Caunes said he then emerged naked, with an erection and told her to lie on the bed. She fled the room. Rex Features 34/42 Zoe Brock Model Zoe claimed that she had to lock herself in a bathroom at Weinstein’s hotel in 1997, after the mogul had sent all of the assistants out of the room, and then appeared naked. “I was alone with Weinstein, she told ITV’s This Morning programme. “He very quickly left the room and came back naked. He chased me naked.” 35/42 Jessica Barth Actress Jessica Barth described an encounter with Weinstein in 2011 in an interview with The New Yorker in which she said Weinstein veered between offering her roles in films and demanding a naked massage. She alleges the producer said to her: “So, what would happen if, say, we’re having some champagne and I take my clothes off and you give me a massage?” When she tried to leave, he then promised to give her the number of a female executive at the company. “He gave me her number, and I walked out and I started bawling,” Barth said. Rex Features 36/42 Romola Garai The actress told The Guardian she felt “violated” after she went to a meeting with Weinstein at the age of 18 and he met her in his hotel room wearing nothing but a dressing gown. Getty 37/42 Heather Graham Graham claimed that during a casting opportunity in the early 2000's Weinstein had told her he had an open relationship with his wife. “He could sleep with whomever he wanted when he was out of town. I walked out of the meeting feeling uneasy,” Graham told Variety. “There was no explicit mention that to star in one of those films I had to sleep with him, but the subtext was there.” Graham was never hired to work in a Weinstein film. Rex Features 38/42 Jessica Hynes Spaced and W1A star Jessica Hynes tweeted about an encounter with Weinstein earlier this week, but subsequently deleted the tweet. Rex Features 39/42 Lucia Evans The actor told The New Yorker that after a meeting to discuss casting her in various projects, Weinstein forced her to perform oral sex on him. “I said, over and over, ‘I don’t want to do this, stop, don’t’.” She added: “He’s a big guy. He overpowered me. I just sort of gave up. That’s the most horrible part of it, and that’s why he’s been able to do this for so long to so many women: people give up, and then they feel like it’s their fault.” Getty 40/42 Louisette Geiss The former actress said she met Weinstein to pitch a film script she was working on. During the meeting, Weinstein allegedly went out and reappeared naked and got into a jacuzzi where he masturbated in front of her and said he would make the script into a film if she stayed and watched. Getty 41/42 Liza Campbell Liza Campbell, a British writer and artist, alleged that “Olympically ugly” Weinstein asked her to join him in the bath and began getting undressed at a hotel. In a piece for The Times, Campbell claimed she was forced to sprint to the door to escape. Rex Features 42/42 Louise Godbold Writing in a blog post, Louise Godbold, a non-profit director in Los Angeles, said her encounter with Weinstein took the form of an “office tour that became an occasion to trap me in an empty meeting room. She said then Weinstein was “begging for a massage, his hands on my shoulders as I attempted to beat a retreat.” 1/42 Harvey Weinstein Harry Weinstein’s reputation as one of Hollywood’s leading executives was long cemented in stone. The acclaimed movie mogul, who produced Oscar-winning films Shakespeare in Love, The English Patient, and The Artist, clocked up box office successes and accolades aplenty. But this has quickly changed since a chorus of women have come forward to accuse the Hollywood producer of sexual harassment and assault. Since the New York Times’ bombshell report disclosed sexual harassment and rape allegations against the film mogul dating back decades, Weinstein has been fired from his namesake company, expelled from the Oscars and has had his wife leave him. Weinstein has apologised for having “caused a lot of pain” but has denied all allegations of nonconsensual sex. Getty 2/42 Annabella Sciorra The Sopranos actor alleged Weinstein raped her after shooting The Night We Never Met, a 1993 movie that Weinstein produced. Similar to the stories told by other women, Weinstein drove the actor home, only to reportedly burst into Sciorra's apartment and start unbuttoning his shirt. “He shoved me onto the bed, and he got on top of me,” Sciorra said. “I kicked and I yelled.” Weinstein then allegedly locked her arms and forced sexual intercourse on her. After the incident, Sciorra found it increasingly hard to get work, many filmmakers saying 'We heard you were difficult', something the actor claims was because of the 'Weinstein-machine'. Getty 3/42 Natassia Malthe The model and actress, who has appeared in around 50 films, said she met Weinstein at a BAFTA after party in 2008 while she was working as a spokeswoman for LG. She told a press conference in New York that she felt pressured into telling Weinstein she was staying at the Sanderson Hotel after being put on the spot. Malthe, now 43, said after her shift on February 10 she went back to her room and went to sleep, but was awoken by \"repeated pounding\" on her door, from someone yelling: \"Open the door Natassia Malthe, it's Harvey Weinstein.\" Feeling humiliated, she said she opened the door. She alleged Weinstein began implying sex would get her a role in an upcoming film while semi-undressed and then he began to masturbate. \"I was sitting on the bed talking to Harvey when he pushed me back and forced himself onto me. It was not consensual. He did not use a condom,\" she said. AP 4/42 Sean Young The actor, best known for her role in Ridley Scott's Blade Runner, said that Weinstein exposed himself to her in the early 1990s, when she was starring in the Miramax-produced Love Crimes - a production company that Weinstein headed at the time. \"I personally experienced him pulling his you-know-what out of his pants to shock me,\" she said. \"My basic response was, 'You know, Harvey, I really don’t think you should be pulling that thing out, it’s not very pretty.'\" Young never worked with Weinstein again after the incident. 5/42 Mimi Haleyi Mimi Haleyi said she was assaulted by Weinstein in what appeared to be a child's bedroom in his New York City apartment in 2006 when she was in her 20s. She said she was aspiring to work in television and film production when she was first introduced to him at the London premiere of The Aviator around two years earlier and he helped her get experience on the set of a TV show being produced by The Weinstein Company. But, she added, he repeatedly hassled her and even tried to force himself through her front door in an effort to get her to join him on a trip to Paris. At one point he allegedly forcibly performed oral sex on an aspiring production assistant while she was on her period. Getty 6/42 Lupita Nyong'o In an op-ed for The New York Times, the Oscar-winning actor said she was invited to Weinstein’s family home in Connecticut on the premise of watching a film shortly after they met in 2011. But she said shortly after it started he \"insisted\" in front of his children that she follow him and she was led to his bedroom. The Kenyan-Mexican actress, now 34, said she felt pressured into giving him a massage after he offered her one. \"Before long he said he wanted to take off his pants,\" she wrote.\"I told him not to do that and informed him that it would make me extremely uncomfortable. He got up anyway to do so and I headed for the door, saying that I was not at all comfortable with that.\" Over the years that followed, he continued to get in touch, Nyong'o said, and when she declined another proposition she felt her career was threatened. Getty 7/42 Lena Headey Writing on social media, the Game of Thrones actor claims she first met Weinstein at the Venice Film Festival in 2005 where, after taking her for a walk by the water, he “made some suggestive comment and gesture.” Headey claims she bumped into Weinstein years later where he kept asking her questions about her love life. She alleges that, when Weinstein invited her to his hotel room to show her a script, the \"energy shifted.” The actor notes how, after saying she was not interesting in anything but the work, Weinstein was furious, apparently marching her back to a lift, \"grabbing and holding tightly to the back of [her] arm.\" She claims that, after paying for her car, he whispered in her ear: \"Don't tell anyone about this, not your manager, not your agent.” Headey finished the post, writing: “I got in the car and I cried.” Getty Images 8/42 Lucia Evans The actor told The New Yorker that after a meeting to discuss casting her in various projects, Weinstein forced her to perform oral sex on him. “I said, over and over, ‘I don’t want to do this, stop, don’t’.” She added: “He’s a big guy. He overpowered me. I just sort of gave up. That’s the most horrible part of it, and that’s why he’s been able to do this for so long to so many women: people give up, and then they feel like it’s their fault.” Getty 9/42 Laura Madden Madden, a production assistant who worked at Miramax for a decade, told the Times that Weinstein allegedly “prodded her for massages at hotels,” a common theme among the sources the Times’s reporters spoke with. On one occasion, she claims she locked herself in his hotel bathroom, sobbing 10/42 Ashley Judd Judd recounted for the Times how Weinstein allegedly harassed her while she was filming Kiss the Girls in 1996, inviting her to his hotel room and asking her for a massage, then inviting her to watch him shower. Judd first went public with the allegations in a 2015 interview with Variety during which she discussed the experience without naming the producer involved. She described Weinstein’s alleged behaviour as “coercive bargaining”; “I said no, a lot of ways, a lot of times, and he always came back at me with some new ask,” she told the Times AFP/Getty 11/42 Rose McGowan McGowan reportedly reached a “previously undisclosed” $100,000 settlement with Weinstein in 1997, over an incident that occurred in a hotel room Getty 12/42 Mimi Haleyi Mimi Haleyi said she was assaulted by Weinstein in what appeared to be a child's bedroom in his New York City apartment in 2006 when she was in her 20s. She said she was aspiring to work in television and film production when she was first introduced to him at the London premiere of The Aviator around two years earlier and he helped her get experience on the set of a TV show being produced by The Weinstein Company. But, she added, he repeatedly hassled her and even tried to force himself through her front door in an effort to get her to join him on a trip to Paris. At one point he allegedly forcibly performed oral sex on an aspiring production assistant while she was on her period. Getty 13/42 Emily Nestor Nestor had been temping at the Weinstein Company for only one day in 2014 when Weinstein allegedly offered to boost her career in return for sexual favours, according to the Times. She declined and reportedly complained of his behaviour to colleagues, who later passed the information on to senior executives. An internal Weinstein Company document cited by the Times describes Nestor’s encounter with Weinstein as follows: “She said he was very persistent and focused though she kept saying no for over an hour” Getty 14/42 Ambra Battilana In March 2015, Battilana, an aspiring model and actress, was reportedly summoned to Weinstein’s office on a Friday night to discuss her career. According to a police report cited by the Times, Battilana claimed she was assaulted by Weinstein, who “grabbed her breasts after asking if they were real and put his hands up her skirt.” Weinstein later claimed that Battilana had set him up, according to colleagues of his who were interviewed by the Times. The Manhattan District Attorney, Cyrus Vance, later declined to press charges, and according to the Times, “made a payment” to Battilana. On 5 October, the International Business Times reported that after Vance dropped the charges, he received $10,000 from Weinstein’s lawyer 15/42 Lauren O’Connor Lauren O’Connor, an employee of the Weinstein Company, penned a memo to executives alleging “a toxic environment for women” at the company. The memo cited numerous incidents of Weinstein harassing or coercing women who worked for him. She expressed fear that Weinstein was using her and other female employees to “facilitate liaisons with ‘vulnerable women who hope he will get them work.’” That same year, Weinstein allegedly reached a settlement with O’Connor Getty 16/42 Kate Beckinsale The actor, who starred in the Weinstein Company films Serendipity and The Aviator, alleges that she was invited to Weinstein’s hotel room at the age of just 17. When she approached the door, the producer reportedly greeted her dressed in just a dressing gown. “I was incredibly naive and young and it did not cross my mind that this older, unattractive man would expect me to have any sexual interest in him,” she wrote on Instagram. “After declining alcohol and announcing that I had school in the morning I left, uneasy but unscathed.” Theo Wargo/Getty Images 17/42 Gwyneth Paltrow The actor alleges that after he cast her in the title role of the film Emma when she was 22, he took her to his hotel room, placed his hands on her and suggested massages. “I was a kid, I was signed up, I was petrified,” Paltrow told the New York Times. Rex Features 18/42 Asia Argento Italian actress Asia Argento has alleged that in 1997 Weinstein forcibly performed oral sex on her as she repeatedly told him to stop. “When I see him, it makes me feel little and stupid and weak,” Argento told The New Yorker. “After the rape, he won”. Rex Features 19/42 Cara Delevigne The British model and actress penning an Instagram post claiming that Weinstein had ordered her to kiss another woman in his hotel room, and tried to kiss her on the lips. AFP/Getty 20/42 Ashley Judd Ashley Judd said she rebuffed Harvey Weinstein’s unwanted sexual advances by offering to consent only after she had won an Oscar. When she was initially invited to a meeting with Weinstein, Judd said, she was surprised to learn the producer was in his hotel room - a tactic that recurs in other womens’ accounts. Echoing the accounts of other women, Judd said Weinstein suggested she give him a massage and then invited her to watch him shower. After a “volley of no’s” she said she would only after she wins an Oscar, fleeing after making the comments. Reuters/Mike Segar 21/42 Judith Godrèche French actress Judith Godrèche said when she was 24 Weinstein invited her to his hotel room and asked to give her a massage. “The next thing I know, he’s pressing against me and pulling off my sweater,” she told the New York Times. Rex Features 22/42 Mira Sorvino The Oscar-winning actor said she found herself in a hotel room with Weinstein in 1995 where “he started massaging my shoulders, which made me very uncomfortable, and then tried to get more physical, sort of chasing me around.” According to an interview in The New Yorker Weinstein subsequently arrived at her apartment late at night and she had to call a friend to come over to pose as her boyfriend in order to get Weinstein out of the house. Rex Features 23/42 Katherine Kendall The actress said Weinstein undressed and chased her around a living room when she was just 23. She subsequently felt that telling others meant “I’ll never work again and no one is going to care or believe me,” she told the New York Times. WireImage 24/42 Tomi-Anne Roberts As an aspiring actress and working in a restaurant in New York, Tomi-Ann Roberts encountered Weinstein who encouraged her to audition for one of his films back in 1984. She subsequently went to meet him and found him naked in the bath and invited her to get naked and get into the bath with him, she told the New York Times. She said she left feeling manipulated. 25/42 Myleen Klass It has also been alleged that the disgraced film producer propositioned Myleene Klass with a “sex contract” at Cannes Film Festival in 2010. One of the singer and television personality’s friends reportedly told The Sun, Klass had told Weinstein to “f*** off”. Getty Images 26/42 Sophie Dix Sophie Dix, best known for her role as Captain Sadie Williams in Soldier Soldier, described her encounter with Weinstein when she was 23 as “the single most damaging thing that’s happened in my life”. She told The Guardian Weinstein had pushed her to her bed and was “tugging at her clothes”. She rushed to the bathroom to escape, but when she came out she found him “standing there masturbating”. “I quickly closed the door again and locked it,” she said. “Then when I heard room service come to the door I just ran.” Rex 27/42 Léa Seydoux The actor and director claims she had to fight off Weinstein after he brought her to his hotel room during what she remembers to be 2012. “He suddenly jumped on me and tried to kiss me. I had to defend myself. He’s big and fat, so I had to be forceful to resist him. I left his room, thoroughly disgusted,” she wrote in The Guardian. AFP/Getty Images 28/42 Claire Forlani British actress Claire Forlani wrote on Twitter that she had evaded Weinstein’s advances on five occasions at the age of 25. At meetings with the Hollywood a-lister, she says “massage was suggested”, and that Weinstein had boasted of all the women he’d had sex with. Mark Douet 29/42 Florence Darel French actress Florence Darel claimed Weinstein relentlessly pursued her in the mid 1990's and propositioned her while Eve Chilton, his wife at the time, was in the hotel room next door. “I was astonished,” she told People magazine. “When you have someone so physically disgusting in front of you, continuing and continuing as though this was all perfectly normal… What happened to me may not be illegal but it was inappropriate. Very inappropriate.” Getty 30/42 Lysette Anthony Lysette Anthony, who starred as Marnie Nightingale in Hollyoaks, has claimed Weinstein raped her in the late 1980's after turning up to her London home in the late 1980’s. She described the disgraced film producer’s alleged attack as “pathetic and revolting” and said it left her feeling “disgusted and embarrassed”. Getty 31/42 Dawn Dunning Dunning said she met Weinstein in 2003 when she was 24-years-old and the disgraced film producer suggested she have a threesome with him and someone else. She told the New York Times Weinstein got angry when she refused. “You’ll never make it in this business,” she said he told her as she left. Rex Features 32/42 Rosanna Arquette Rosanna Arquette was already well known for her role in Desperately Seeking Susan, when she said she met Weinstein at his hotel to pick up a script in the early nineties. Weinstein was dressed only in a dressing gown, and tried to put her hand on his erect penis. Speaking to the New York Times, Arquette said as she left she told him: “I will never be that girl.” Rex Features 33/42 Emma de Caunes Caunes, a French actor, claimed Weinstein took her to his hotel room in 2010 supposedly to retrieve a book he was making into a film, but once there he went into the bathroom. De Caunes said he then emerged naked, with an erection and told her to lie on the bed. She fled the room. Rex Features 34/42 Zoe Brock Model Zoe claimed that she had to lock herself in a bathroom at Weinstein’s hotel in 1997, after the mogul had sent all of the assistants out of the room, and then appeared naked. “I was alone with Weinstein, she told ITV’s This Morning programme. “He very quickly left the room and came back naked. He chased me naked.” 35/42 Jessica Barth Actress Jessica Barth described an encounter with Weinstein in 2011 in an interview with The New Yorker in which she said Weinstein veered between offering her roles in films and demanding a naked massage. She alleges the producer said to her: “So, what would happen if, say, we’re having some champagne and I take my clothes off and you give me a massage?” When she tried to leave, he then promised to give her the number of a female executive at the company. “He gave me her number, and I walked out and I started bawling,” Barth said. Rex Features 36/42 Romola Garai The actress told The Guardian she felt “violated” after she went to a meeting with Weinstein at the age of 18 and he met her in his hotel room wearing nothing but a dressing gown. Getty 37/42 Heather Graham Graham claimed that during a casting opportunity in the early 2000's Weinstein had told her he had an open relationship with his wife. “He could sleep with whomever he wanted when he was out of town. I walked out of the meeting feeling uneasy,” Graham told Variety. “There was no explicit mention that to star in one of those films I had to sleep with him, but the subtext was there.” Graham was never hired to work in a Weinstein film. Rex Features 38/42 Jessica Hynes Spaced and W1A star Jessica Hynes tweeted about an encounter with Weinstein earlier this week, but subsequently deleted the tweet. Rex Features 39/42 Lucia Evans The actor told The New Yorker that after a meeting to discuss casting her in various projects, Weinstein forced her to perform oral sex on him. “I said, over and over, ‘I don’t want to do this, stop, don’t’.” She added: “He’s a big guy. He overpowered me. I just sort of gave up. That’s the most horrible part of it, and that’s why he’s been able to do this for so long to so many women: people give up, and then they feel like it’s their fault.” Getty 40/42 Louisette Geiss The former actress said she met Weinstein to pitch a film script she was working on. During the meeting, Weinstein allegedly went out and reappeared naked and got into a jacuzzi where he masturbated in front of her and said he would make the script into a film if she stayed and watched. Getty 41/42 Liza Campbell Liza Campbell, a British writer and artist, alleged that “Olympically ugly” Weinstein asked her to join him in the bath and began getting undressed at a hotel. In a piece for The Times, Campbell claimed she was forced to sprint to the door to escape. Rex Features 42/42 Louise Godbold Writing in a blog post, Louise Godbold, a non-profit director in Los Angeles, said her encounter with Weinstein took the form of an “office tour that became an occasion to trap me in an empty meeting room. She said then Weinstein was “begging for a massage, his hands on my shoulders as I attempted to beat a retreat.”\n\nStreep’s full statement reads: “The disgraceful news about Harvey Weinstein has appalled those of us whose work he championed, and those whose good and worthy causes he supported. The intrepid women who raised their voices to expose this abuse are our heroes.\n\n“One thing can be clarified. Not everybody knew. Harvey supported the work fiercely, was exasperating but respectful with me in our working relationship, and with many others with whom he worked professionally.\n\n“I didn’t know about these other offences: I did not know about his financial settlements with actresses and colleagues; I did not know about his having meetings in his hotel room, his bathroom, or other inappropriate, coercive acts. And if everybody knew, I don’t believe that all the investigative reporters in the entertainment and the hard news media would have neglected for decades to write about it.\n\n“The behaviour is inexcusable but the abuse of power familiar. Each brave voice that is raised, heard and credited by our watchdog media will ultimately change the game.”\n\nSince the allegations were published, Weinstein has been fired from The Weinstein Company. They said: “His employment is terminated, effective immediately.”", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/09/14/harvey-weinstein-meryl-streep.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/09/14/harvey-weinstein-meryl-streep.jpg", "keywords": [], "authors": ["Jack Shepherd"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/news/meryl-streep-harvey-weinstein-statement-disgraceful-a7990836.html", "title": "Meryl Streep slams 'disgraceful' Harvey Weinstein", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/films/news/meryl-streep-harvey-weinstein-statement-disgraceful-a7990836.html", "title": "Meryl Streep slams 'disgraceful' Harvey Weinstein", "description": "'Not everybody knew about these offences,' says the Hollywood star", "updated_time": "2017-10-09T19:05:26+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/09/14/harvey-weinstein-meryl-streep.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7990836"}, "description": "Meryl Streep has called Harvey Weinstein “disgraceful” over the sexual harassment allegations made against the Hollywood producer.  The Academy Award-winner issued a statement to The Huffington Post, revealing she was not aware of Weinstein’s behaviour before the allegations were made public.", "keywords": "Meryl Streep, Harvey Weinstein, News, Film, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Meryl Streep", "published_time": "2017-10-09T14:50:00+01:00", "modified_time": "2017-10-09T19:05:26+01:00", "section": "News", "author_name": "Jack Shepherd", "content_type": "story", "word_count": 354, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 4, "external_link_count": 2}, "twitter": {"title": "Meryl Streep slams 'disgraceful' Harvey Weinstein", "description": "Meryl Streep has called Harvey Weinstein “disgraceful” over the sexual harassment allegations made against the Hollywood producer.  The Academy Award-winner issued a statement to The Huffington Post,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1507557000.0, "source": "http://www.independent.co.uk", "summary": ""}