{"url": "https://hellogiggles.com/news/francia-raisa-kidney-recovery/", "text": "Image zoom Selena Gomez / www.instagram.com\n\nIn September of 2017, Selena Gomez shocked her fans when she revealed the reason she had stepped out of the public eye for a few months: She had been recovering from a kidney transplant due to complications from lupus. Gomez also revealed that one of her best friends, Francia Raisa, had donated the kidney for the transplant. Now, months later, Francia Raisa has opened up about her tough recovery from the surgery.\n\nBack in 2015, Gomez revealed that she suffers from lupus. And since then, she’s had to take several breaks to focus on her health. The surgery happened in the summer of 2017. And while both friends seem to be doing well now, it certainly seems like the overall experience was pretty scary. In November, Gomez attended the Lupus Research Alliance Annual Gala, where she opened up about her struggle, saying that “it actually got to a point where it was life-or-death” before her surgery. “Thankfully, one of my best friends gave me her kidney and it was the ultimate gift of life. And I am doing quite well now,” she added.\n\nNow, Francia Raisa is opening up too. During a recent appearance on Harry, Harry Connick Jr.’s talk show, she discussed how tough it was to recover from the surgery. “It’s harder as the donor because we are losing something our body didn’t need to lose, so trying to recover from that and she’s gaining something her body needed,” Raisa said. “So she’s up and at it immediately and I had a hard time.”\n\nFrancia Raisa also talked about her recovery which was, at times, frustrating.\n\n“I couldn’t get up without having someone help me. That was very humbling. I couldn’t take a shower by myself, I had to have someone help me because I couldn’t move,” Raisa continued. “I’m a very very active person, so the fact that my doctor said I couldn’t move for two months. Two months, I couldn’t do anything active. All I could do was walk. That was very hard for me and I have a dog and every day the thing I look forward to is drinking my coffee and walking and I couldn’t do that. It was really, really hard.”\n\nFrancia Raisa also revealed that Gomez felt guilty for putting her in the situation, but that the two ultimately grew closer because of it.\n\nSelena Gomez had a bit of a rough recovery as well.\n\nIn one interview, she revealed that her kidney “flipped” after the initial surgery, making what should have been a two-hour operation a six-hour one. It seems that the silver lining to the situation was the bonding between not just Raisa and Gomez, but their families as well.\n\nShortly after Gomez revealed her surgery on social media, her mom shared an emotional message of her own. She posted a photo of Gomez and Raisa on Instagram, saying, “Selena gained a kidney, I was able to keep my little girl, but I also gained another daughter.”\n\nFrancia Raisa’s interview will air on Harry on Monday, February 19th. Here’s hoping the best friends are doing much, much better now!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2019%2F04%2F22091648%2Fbestredlipsticks.jpg", "https://images.hellogiggles.com/uploads/2017/11/10072559/avatar-k-150x150.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2019%2F02%2F12155159%2Fbest-friend-stories.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2019%2F04%2F22091645%2Fbest-money-apps.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg", "keywords": [], "authors": ["Jessica Booth"], "canonical_link": "https://hellogiggles.com/news/francia-raisa-kidney-recovery/", "title": "Francia Raisa opened up about her tough recovery after donating a kidney to BFF Selena Gomez", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "best friends,besties,BFF,bffs,celeb bffs,celebrity best friends,francia raisa,news,selena gomez,selena gomez lupus,TRENDING,trending news,Celeb", "news_keywords": "how tall is francia raisa, francia raisa selena gomez, francia raisa selena gomez interview, francia raisa instagram, francia raisa kidney, francia raisa grownish, who is selena gomez best friend, selena gomez transplant interview, francia raisa selena gomez surgery, selena gomez lupus", "description": "Actress Francia Raisa opened up about her rough recovery after donating a kidney to her best friend Selena Gomez. Here are the details.", "og": {"title": "Francia Raisa opened up about her tough recovery after donating a kidney to BFF Selena Gomez", "type": "article", "site_name": "HelloGiggles", "url": "https://hellogiggles.com/news/francia-raisa-kidney-recovery/", "description": "She couldn't move for two months.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg", "width": 700, "height": 1000}}, "pinterest": {"url": "https://hellogiggles.com/news/francia-raisa-kidney-recovery/", "description": "Actress Francia Raisa opened up about her rough recovery after donating a kidney to her best friend Selena Gomez. Here are the details.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://hellogiggles.com/news/francia-raisa-kidney-recovery/", "title": "Francia Raisa opened up about her tough recovery after donating a kidney to BFF Selena Gomez", "description": "She couldn't move for two months.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.hellogiggles.com%2Fuploads%2F2018%2F02%2F17064032%2Ffrancia-selena.jpg"}, "fb": {"pages": 209123339112078}, "pinterest-rich-pin": "false"}, "movies": [], "publish_date": null, "source": "https://hellogiggles.com", "summary": ""}