{"url": "https://web.archive.org/web/20110416110045/http://projects.washingtonpost.com:80/obama-speeches/speech/622", "text": "Obama delivers speech on the national debt\n\nSpeech Transcript\n\nOBAMA: It is wonderful to be back at G.W. I want you to know that one of the reasons that I worked so hard with Democrats and Republicans to keep the government open was so that I could show up here today.\n\n(LAUGHTER)\n\nI want to make sure that all of you had one more excuse to skip class.\n\n(LAUGHTER)\n\nYou're welcome.\n\n(LAUGHTER)\n\nI want to give a special thanks to Steven Knapp, the president of G.W. I just saw him. Where is he?\n\nThere he is, right here.\n\n(APPLAUSE)\n\nI want to -- we've got a lot of distinguished guests here. A couple of people I want to acknowledge.\n\nFirst of all, my outstanding vice president, Joe Biden, is here.\n\n(APPLAUSE)\n\nOur secretary of the treasury, Tim Geithner, is in the house.\n\n(APPLAUSE)\n\nJack Lew, the director of the Office of Management and Budget.\n\n(APPLAUSE)\n\nGene Sperling, chair of the National Economic Council, is here.\n\n(APPLAUSE)\n\nMembers of our bipartisan fiscal commission are here, including the two outstanding chairs -- Erskine Bowles and Alan Simpson are here.\n\n(APPLAUSE)\n\nAnd we have a umber of members of Congress here today. I'm grateful for all of you taking the time to attend.\n\nWhat we've been debating here in Washington over the last few weeks will affect the lives of the students here and families all across America in potentially profound ways.\n\nThis debate over budgets and deficits is about more than just numbers on a page, it's about more than just cutting and spending. It's about the kind of future that we want.\n\nOBAMA: It's about the kind of country that we believe in. And that's what I want to spend some time talking about today.\n\nFrom our first days as a nation, we have put our faith in free markets and free enterprise as the engine of America's wealth and prosperity. And more than citizens of any other country, we are rugged individualists, a self-reliant people with a healthy skepticism of too much government.\n\nBut there has always been another thread running through our history: a belief that we're all connected and that there are some things we can only do together, as a nation.\n\nWe believe, in the words of the first Republican president, Abraham Lincoln, that through government, we should do together what we cannot do as well for ourselves.\n\nAnd so we've built a strong military to keep us secure, and public schools and universities to educate our citizens. We've laid down railroads and highways to facilitate travel and commerce.\n\nOBAMA: We've supported the work of scientists and researchers whose discoveries have saved lives, unleashed repeated technological revolutions, and led to countless new jobs and entire new industries.\n\nEach of us has benefited from these investments, and we're a more prosperous country as a result.\n\nNow, part of this American belief that we're all connected also expresses itself in a conviction that each one of us deserves some basic measure of security and dignity.\n\nWe recognize that, no matter how responsibly we live our lives, hard times or bad luck, a crippling illness or a layoff may strike any one of us. \"There but for the grace of God go I,\" we say to ourselves.\n\nAnd so we contribute to programs like Medicare and Social Security, which guarantee us health care and a measure of basic income after a lifetime of hard work; unemployment insurance, which protects us against unexpected job loss; and Medicaid, which provides care for millions of seniors in nursing homes, poor children, those with disabilities.\n\nOBAMA: We're a better country because of these commitments.\n\nI'll go further: We would not be a great country without those commitments.\n\nAnd for much of the last century, our nation found a way to afford these investments and priorities with the taxes paid by its citizens. As a country that values fairness, wealthier individuals have traditionally borne a greater share of this burden than the middle class or those less fortunate; everybody pays, but the wealthier have borne a little more.\n\nThis is not because we begrudge those who've done well. We rightly celebrate their success.\n\nInstead, it's a basic reflection of our belief that those who benefited most from our way of life can afford to give back a little -- a little bit more.\n\nOBAMA: Moreover, this belief hasn't hindered the success of those at the top of the income scale. They continue to do better and better with each passing year.\n\nNow, at certain times -- particularly during war or recession -- our nation has had to borrow money to pay for some of our priorities. And as most families understand, a little credit card debt isn't going to hurt, if it's temporary.\n\nBut as far back as the 1980s, America started amassing debt at more alarming levels, and our leaders began to realize that a larger challenge was on the horizon.\n\nThey knew that eventually, the baby boom generation would retire, which meant a much bigger portion of our citizens would be relying on programs like Medicare, Social Security and possibly Medicaid.\n\nLike parents with young children who know they have to start saving for the college years, America had to start borrowing less and saving more to prepare for the retirement of an entire generation.\n\nTo meet this challenge, our leaders came together three times during the 1990s to reduce our nation's deficit -- three times. They forged historic agreements that required tough decisions made by the first President Bush, then made by President Clinton, by Democratic Congresses and by a Republican Congress.\n\nAll three agreements asked for shared responsibility and shared sacrifice, but they largely protected the middle class, they largely protected our commitments to seniors, they protected our key investments in our future.\n\nAs a result of these bipartisan efforts, America's finances were in great shape by the year 2000. We went from deficit to surplus. America was actually on track to becoming completely debt-free, and we were prepared for the retirement of the baby boomers.\n\nBut after Democrats and Republicans committed to fiscal discipline during the 1990s, we lost our way in the decade that followed. We increased spending dramatically for two wars and an expensive prescription drug program, but we didn't pay for any of this new spending.\n\nOBAMA: Instead we made the problem worse with trillions of dollars in unpaid-for tax cuts; tax cuts that went to every millionaire and billionaire in the country; tax cuts that will force us to borrow an average of $500 billion every year over the next decade.\n\nTo give you an idea of how much damage this caused to our nation's checkbook, consider this.\n\nIn the last decade, if we had simply found a way to pay for the tax cuts and the prescription drug benefit, our deficit would currently be at low historical levels in the coming years.\n\nBut that's not what happened. And so, by the time I took office, we once again found ourselves deeply in debt and unprepared for a baby boom retirement that is now starting to take place.\n\nWhen I took office, our projected deficit annually was more than $1 trillion. On top of that, we faced a terrible financial crisis and a recession that, like most recessions, led us to temporarily borrow even more.\n\nIn this case, we took a series of emergency steps that saved millions of jobs, kept credit flowing, and provided working families extra money in their pocket. It was absolutely the right thing to do, but these steps were expensive and added to our deficits in the short term.\n\nSo that's how our fiscal challenge was created. That's how we got here. And now that our economic recovery is gaining strength, Democrats and Republicans must come together and restore the fiscal responsibility that served us so well in the 1990s.\n\nWe have to live within our means. We have to reduce our deficit. And we have to get back on a path that will allow us to pay down our debt.\n\nOBAMA: And we have to do it in a way that protects the recovery, protects the investments we need to grow, creates jobs, and helps us win the future.\n\nNow, before I get into how we can achieve this goal, some of you, particularly the younger people here -- you don't qualify, Joe...\n\n(LAUGHTER)\n\n... some of you might be wondering, \"Why is this so important? Why does this matter to me?\"\n\nWell, here's why.\n\nEven after our economy recovers, our government will still be on track to spend more money than it takes in throughout this decade and beyond. That means we'll have to keep borrowing more from countries like China.\n\nThat means more of your tax dollars each year will go towards paying off the interest on all of the loans that we keep taking out. By the end of this decade, the interest that we owe on our debt could rise to nearly $1 trillion. Think about that. That's the interest, just the interest payments.\n\nThen, as the baby boomers start to retire in greater numbers and health care costs continue to rise, the situation will get even worse.\n\nBy 2025, the amount of taxes we currently pay will only be enough to finance our health care programs, Medicare and Medicaid, Social Security, and the interest we owe on our debt. That's it. Every other national priority -- education, transportation, even our national security -- will have to be paid for with borrowed money.\n\nNow, ultimately all this rising debt will cost us jobs and damage our economy. It will prevent us from making the investments we need to win the future.\n\nOBAMA: We won't be able to afford good schools, new research, or the repair of roads; all the things that create new jobs and businesses here in America.\n\nBusinesses will be less likely to invest and open shop in a country that seems unwilling or unable to balance its books. And if our creditors start worrying that we may be unable to pay back our debts, that could drive up interest rates for everybody who borrows money, making it harder for businesses to expand and hire or families to take out a mortgage.\n\nHere's the good news: That doesn't have to be our future; that doesn't have to be the country that we leave our children.\n\nWe can solve this problem. We came together as Democrats and Republicans to meet this challenge before; we can do it again. But that starts by being honest about what's causing our deficit.\n\nYou see, most Americans tend to dislike government spending in the abstract, but like the stuff that it buys.\n\nMost of us, regardless of party affiliation, believe that we should have a strong military and a strong defense. Most Americans believe we should invest in education and medical research. Most Americans think we should protect commitments like Social Security and Medicare.\n\nAnd without even looking at a poll, my finely honed political instincts tell me that almost nobody believes they should be paying higher taxes.\n\n(LAUGHTER)\n\nSo because all this spending is popular with both Republicans and Democrats alike, and because nobody wants to pay higher taxes, politicians are often eager to feed the impression that solving the problem is just a matter of eliminating waste and abuse.\n\nOBAMA: You'll hear that phrase a lot: \"We just need to eliminate waste and abuse.\"\n\nThe implication is that tackling the deficit issue won't require tough choices.\n\nOr politicians suggest that we can somehow close our entire deficit by eliminating things like foreign aid, even though foreign aid makes up about 1 percent of our entire federal budget.\n\nSo here's the truth.\n\nAround two-thirds of our budget -- two-thirds -- is spent on Medicare, Medicaid, Social Security and national security -- two- thirds.\n\nPrograms like unemployment insurance, student loans, veterans' benefits and tax credits for working families take up another 20 percent.\n\nWhat's left, after interest on the debt, is just 12 percent for everything else. That's 12 percent for all of our national priorities: education, clean energy, medical research, transportation, our national parks, food safety, keeping our air and water clean. You name it, all of that accounts for 12 percent of our budget.\n\nNow, up 'til now, the debate here in Washington -- the cuts proposed by a lot of folks in Washington have focused almost exclusively on that 12 percent.\n\nOBAMA: But cuts to that 12 percent alone won't solve the problem. So any serious plan to tackle our deficit will require us to put everything on the table and take on excess spending wherever it exists in the budget.\n\nA serious plan doesn't require us to balance our budget overnight. In fact, economists think that with the economy just starting to grow again we need a phased-in approach. But it does require tough decisions and support from our leaders in both parties now. Above all, it will require us to choose a vision of the America we want to see five years, 10 years, 20 years down the road.\n\nNow, to their credit, one vision has been presented and championed by Republicans in the House of Representatives and embraced by several of their party's presidential candidates. It's a plan that aims to reduce our deficit by $4 trillion over the next 10 years, and one that addresses the challenge of Medicare and Medicaid in the years after that.\n\nThose are both worthy goals. They're worthy goals for us to achieve.\n\nBut the way this plan achieves those goals would lead to a fundamentally different America than the one we've known, certainly in my lifetime. In fact, I think it would be fundamentally different than what we've known throughout our history.\n\nA 70 percent cut in clean energy, a 25 percent cut in education, a 30 percent cut in transportation, cuts in college Pell Grants that will grow to more than $1,000 per year.\n\nOBAMA: That's the proposal.\n\nThese aren't the kind of cuts you make when you're trying to get rid of some waste or find extra savings in the budget. These aren't the kind of cuts that the fiscal commission proposed.\n\nThese are the kind of cuts that tell us we can't afford the America that I believe in and I think you believe in.\n\nI believe it paints a vision of our future that is deeply pessimistic. It's a vision that says if our roads crumble and our bridges collapse, we can't afford to fix them; if there are bright young Americans who have the drive and the will but not the money to go to college, we can't afford to send them.\n\nGo to China and you'll see businesses opening research labs and solar facilities.\n\nSouth Korean children are outpacing our kids in math and science. They're scrambling to figure out how they put more money into education.\n\nBrazil is investing billions in new infrastructure and can run half their cars not on high-priced gasoline, but on biofuels.\n\nAnd yet, we are presented with a vision that says the American people, the United States of America, the greatest nation on Earth, can't afford any of this.\n\nIt's a vision that says America can't afford to keep the promise we've made to care for our seniors. It says that 10 years from now, if you're a 65-year-old who's eligible for Medicare, you should have to pay nearly $6,400 more than you would today.\n\nIt says, instead of guaranteed health care, you will get a voucher. And if that voucher isn't worth enough to buy the insurance that's available in the open marketplace, well, tough luck; you're on your own.\n\nPut simply, it ends Medicare as we know it.\n\nIt's a vision that says up to 50 million Americans have to lose their health insurance in order for us to reduce the deficit.\n\nOBAMA: Who are these 50 million Americans?\n\nMany are somebody's grandparents, maybe one of yours, who wouldn't be able afford nursing home care without Medicaid.\n\nMany are poor children. Some are middle-class families who have children with autism or Down's syndrome. Some are these kids with disabilities are -- the disabilities are so severe that they require 24-hour care.\n\nThese are the Americans we'd be telling to fend for themselves.\n\nAnd, worst of all, this is a vision that says even though Americans can't afford to invest in education at current levels or clean energy, even though we can't afford to maintain our commitment on Medicare and Medicaid, we can somehow afford more than $1 trillion in new tax breaks for the wealthy.\n\nThink about that.\n\nIn the last decade, the average income of the bottom 90 percent of all working Americans actually declined. Meanwhile, the top 1 percent saw their income rise by an average of more than a quarter of a million dollars each. That's who needs to pay less taxes?\n\nThey want to give people like me a $200,000 tax cut that's paid for by asking 33 seniors to each pay $6,000 more in health costs.\n\nThat's not right, and that's not going to happen as long as I'm president.\n\n(APPLAUSE)\n\nThis vision is less about reducing the deficit than it is about changing the basic social compact in America. Ronald Reagan's own budget director said there's nothing serious or courageous about this plan.\n\nOBAMA: There's nothing serious about a plan that claims to reduce the deficit by spending a trillion dollars on tax cuts for millionaires and billionaires. And I don't think there's anything courageous about asking for sacrifice from those who can least afford it and don't have any clout on Capitol Hill. That's not a vision of the America I know.\n\nThe America I know is generous and compassionate. It's a land of opportunity and optimism. Yes, we take responsibility for ourselves, but we also take responsibility for each other, for the country we want and the future that we share.\n\nWe're a nation that built a railroad across a continent and brought light to communities shrouded in darkness. We sent a generation to college on the G.I. Bill and we saved millions of seniors from poverty with Social Security and Medicare.\n\nWe have led the world in scientific research and technological breakthroughs that have transformed millions of lives.\n\nThat's who we are. This is the America that I know.\n\nWe don't have to choose between a future of spiraling debt and one where we forfeit our investment in our people and our country.\n\nTo meet our fiscal challenge, we will need to make reforms, we will all need to make sacrifices. But we do not have to sacrifice the America we believe in. And as long as I'm president, we won't.\n\nSo today I'm proposing a more balanced approach to achieve $4 trillion in deficit reduction over 12 years. It's an approach that borrows from the recommendations of the bipartisan fiscal commission that I appointed last year, and it builds on the roughly $1 trillion in deficit reduction I already proposed in my 2012 budget.\n\nOBAMA: It's an approach that puts every kind of spending on the table, but one that protects the middle class, our promise to seniors and our investments in the future.\n\nThe first step in our approach is to keep annual domestic spending low by building on the savings that both parties agreed to last week. That step alone will save us about $750 billion over 12 years.\n\nWe will make the tough cuts necessary to achieve these savings, including in programs that I deeply care about. But I will not sacrifice the core investments that we need to grow and create jobs. We will invest in medical research. We will invest in clean energy technology. We will invest in new roads and airports and broadband access. We will invest in education. We will invest in job training. We will do what we need to do to compete, and we will win the future.\n\nThe second step in our approach is to find additional savings in our defense budget.\n\nNow, as commander in chief, I have no greater responsibility than protecting our national security, and I will never accept cuts that compromise our ability to defend our homeland or America's interests around the world.\n\nBut as the chairman of the Joint Chiefs, Admiral Mullen, has said, the greatest long-term threat to America's national security is America's debt.\n\nOBAMA: So just as we must find more savings in domestic programs, we must do the same in defense. And we can do that while still keeping ourselves safe.\n\nOver the last two years, Secretary Bob Gates has courageously taken on wasteful spending, saving $400 billion in current and future spending. I believe we can do that again.\n\nWe need to not only eliminate waste and improve efficiency and effectiveness, but we're going to have to conduct a fundamental review of America's missions, capabilities, and our role in a changing world.\n\nI intend to work with Secretary Gates and the Joint Chiefs on this review, and I will make specific decisions about spending after it's complete.\n\nThe third step in our approach is to further reduce health care spending in our budget. Now, here the difference with the House Republican plan could not be clearer.\n\nTheir plan essentially lowers the government's health care bills by asking seniors and poor families to pay them instead. Our approach lowers the government's health care bills by reducing the cost of health care itself.\n\nAlready, the reforms we passed in the health care law will reduce our deficit by $1 trillion. My approach would build on those -- these reforms.\n\nWe will reduce wasteful subsidies and erroneous payments. We will cut spending on prescription drugs by using Medicare's purchasing power to drive greater efficiency and speed generic brands of medicine onto the market. We will work with governors of both parties to demand more efficiency and accountability from Medicaid.\n\nWe will change the way we pay for health care: not by the procedure or the number of days spent in a hospital, but with new incentives for doctors and hospitals to prevent injuries and improve results.\n\nAnd we will slow the growth of Medicare costs by strengthening an independent commission of doctors, nurses, medical experts and consumers who will look at all the evidence and recommend the best ways to reduce unnecessary spending while protecting access to the services that seniors need.\n\nNow, we believe the reforms we've proposed to strengthen Medicare and Medicaid will enable us to keep these commitments to our citizens while saving us $500 billion by 2023, and an additional $1 trillion in the decade after that.\n\nOBAMA: But if we're wrong, and Medicare costs rise faster than we expect, then this approach will give the independent commission the authority to make additional savings by further improving Medicare.\n\nBut let me be absolutely clear: I will preserve these health care programs as a promise we make to each other in this society. I will not allow Medicare to become a voucher program that leaves seniors at the mercy of the insurance industry, with a shrinking benefit to pay for rising costs. I will not tell families with children who have disabilities that they have to fend for themselves.\n\nWe will reform these programs, but we will not abandon the fundamental commitment this country has kept for generations.\n\nThat includes, by the way, our commitment to Social Security. While Social Security is not the cause of our deficit, it faces real long-term challenges in a country that's growing older.\n\nAs I said in the State of the Union, both parties should work together now to strengthen Social Security for future generations. But we have to do it without putting at risk current retirees or the most vulnerable or people with disabilities, without slashing benefits for future generations and without subjecting Americans' guaranteed retirement income to the whims of the stock market. And it can be done.\n\nThe fourth step in our approach is to reduce spending in the tax code, so-called tax expenditures.\n\nIn December, I agreed to extend the tax cuts for the wealthiest Americans because it was the only way I could prevent a tax hike on middle-class Americans.\n\nOBAMA: But we cannot afford $1 trillion worth of tax cuts for every millionaire and billionaire in our society. We can't afford it. And I refuse to renew them again.\n\nBeyond that, the tax code is also loaded up with spending on things like itemized deductions. And while I agree with the goals of many of these deductions, from homeownership to charitable giving, we can't ignore the fact that they provide millionaires an average tax break of $75,000 but do nothing for the typical middle-class family that doesn't itemize.\n\nSo my budget calls for limiting itemized deductions for the wealthiest 2 percent of Americans, a reform that would reduce the deficit by $320 billion over 10 years.\n\nBut to reduce the deficit, I believe we should go further. And that's why I'm calling on Congress to reform our individual tax code so that it is fair and simple, so that the amount of taxes you pay isn't determined by what kind of accountant you can afford.\n\nI believe reform should protect the middle class, promote economic growth, and build on the fiscal commission's model of reducing tax expenditures so that there is enough savings to both lower rates and lower the deficit. And as I called for in the State of the Union, we should reform our corporate tax code as well, to make our businesses and our economy more competitive.\n\nSo this is my approach to reduce the deficit by $4 trillion over the next 12 years.\n\nOBAMA: It's an approach that achieves about $2 trillion in spending cuts across the budget. It will lower our interest payments on the debt by $1 trillion. It calls for tax reform to cut about $1 trillion in tax expenditures -- spending in the tax code. And it achieves these goals while protecting the middle class, protecting our commitment to seniors and protecting our investments in the future.\n\nNow, in the coming years, if the recovery speeds up and our economy grows faster than our current projections, we can make even greater progress than I've pledged here.\n\nBut just to hold Washington and to hold me accountable and make sure that the debt burden continues to decline, my plan includes a debt failsafe.\n\nIf, by 2014, our debt is not projected to fall as a share of the economy, if we haven't hit our targets, if Congress has failed to act, then my plan will require us to come together and make up the additional savings with more spending cuts and more spending reductions in the tax code.\n\nAnd that should be an incentive for us to act boldly now, instead of kicking our problems further down the road.\n\nSo this is our vision for America, this is my vision for America, a vision where we live within our means while still investing in our future, where everyone makes sacrifices but no one bears all the burden, where we provide a basic measure of security for our citizens and we provide rising opportunity for our children.\n\nThere will be those who vigorously disagree with my approach. I can guarantee that as well.\n\n(LAUGHTER)\n\nSome will argue we should not even consider -- ever, ever -- raising taxes, even if only on the wealthiest Americans.\n\nOBAMA: It's just an article of faith to them.\n\nI say that at a time when the tax burden on the wealthy is at its lowest level in half a century, the most fortunate among us can afford to pay a little more.\n\nI don't need another tax cut. Warren Buffett doesn't need another tax cut. Not if we have to pay for it by making seniors pay more for Medicare or by cutting kids from Head Start or by taking away college scholarships that I wouldn't be here without, and that some of you wouldn't be here without.\n\nAnd here's the thing: I believe that most wealthy Americans would agree with me. They want to give back to their country, a country that's done so much for them. It's just Washington hasn't asked them to.\n\nOthers will say that we shouldn't even talk about cutting spending until the economy is fully recovered. These are mostly folks in my party.\n\nI'm sympathetic to this view, which is one of the reasons I supported the payroll tax cuts we passed in December. It's also why we have to use a scalpel and not a machete to reduce the deficit, so that we can keep making the investments that create jobs.\n\nBut doing nothing on the deficit is just not an option. Our debt has grown so large that we could do real damage to the economy if we don't begin a process now to get our fiscal house in order.\n\nFinally, there are those who believe we shouldn't make any reforms to Medicare, Medicaid or Social Security out of fear that any talk of change to these programs will immediately usher in the sort of radical steps that House Republicans have proposed. And I understand those fears.\n\nOBAMA: But I guarantee that if we don't make any changes at all, we won't be able to keep our commitment to a retiring generation that will live longer and will face higher health care costs than those who came before.\n\nIndeed, to those in my own party, I say that if we truly believe in a progressive vision of our society, we have an obligation to prove that we can afford our commitments.\n\nIf we believe that government can make a difference in people's lives, we have the obligation to prove that it works, by making government smarter and leaner and more effective.\n\nOf course, there are those who simply say there's no way we can come together at all and agree on a solution to this challenge. They'll say the politics of this city are just too broken, the choices are just too hard, the parties are just too far apart.\n\nAnd after a few years on this job I have some sympathy for this view.\n\n(LAUGHTER)\n\nBut I also know that we've come together before and met big challenges.\n\nRonald Reagan and Tip O'Neill came together to save Social Security for future generations.\n\nThe first President Bush and a Democratic Congress came together to reduce the deficit.\n\nPresident Clinton and a Republican Congress battled each other ferociously -- disagreed on just about everything -- but they still found a way to balance the budget.\n\nOBAMA: And in the last few months, both parties have come together to pass historic tax relief and spending cuts. And I know there are Republicans and Democrats in Congress who want to see a balanced approach to deficit reduction.\n\nAnd even those Republicans I disagree with most strongly I believe are sincere about wanting to do right by their country. We may disagree on our visions, but I -- I -- I truly believe they want to do the right thing.\n\nSo I believe we can and must come together again.\n\nThis morning, I met with Democratic and Republican leaders in Congress to discuss the approach that I laid out today. And in early May, the vice president will begin regular meetings with leaders in both parties with the aim of reaching a final agreement on a plan to reduce the deficit and get it done by the end of June.\n\nI don't expect the details in any final agreement to look exactly like the approach I laid out today. This is a democracy; that's not how things work. I'm eager to hear other ideas from all ends of the political spectrum.\n\nAnd though I'm sure the criticism of what I've said here today will be fierce in some quarters and my critique of the House Republican approach has been strong, Americans deserve and will demand that we all make an effort to bridge our differences and find common ground.\n\nThis larger debate that we're having -- this larger debate about the size and the role of government -- it has been with us since our founding days. And during moments of great challenge and change, like the one that we're living through now, the debate gets sharper and it gets more vigorous. That's not a bad thing. In fact, it's a good thing.\n\nOBAMA: As a country that prizes both our individual freedom and our obligations to one another, this is one of the most important debates that we can have.\n\nBut no matter what we argue, no matter where we stand, we've always held certain beliefs as Americans.\n\nWe believe that in order to preserve our own freedoms and pursue our own happiness, we can't just think about ourselves. We have to think about the country that made these liberties possible. We have to think about our fellow citizens with whom we share a community. And we have to think about what's required to preserve the American dream for future generations.\n\nThis sense of responsibility -- to each other and to our country -- this isn't a partisan feeling. This isn't a Democratic or a Republican idea. It's patriotism.\n\nThe other day I received a letter from a man in Florida. He started off by telling me he didn't vote for me and he hasn't always agreed with me. But even though he's worried about our economy and the state of our politics, here's what he said.\n\nHe said, \"I still believe. I believe in that great country that my grandfather told me about. I believe that somewhere lost in this quagmire of petty bickering on every news station, the American dream is still alive.\"\n\n\"We need to use our dollars here rebuilding, refurbishing and restoring all that our ancestors struggled to create and maintain. We as a people must do this together, no matter the color of the state one comes from or the side of the aisle one might sit on.\"\n\nI still believe -- I still believe as well. And I know that if we can come together and uphold our responsibilities to one another and to this larger enterprise that is America, we will keep the dream of our founding alive in our time, and we will pass it on to our children, we will pass on to our children a country that we believe in.\n\nThank you, God bless you, and may God bless the United States of America.\n\n(APPLAUSE)\n\nThank you.\n\n(APPLAUSE)\n\nEND .ETX\n\nApr 13, 2011 14:40 ET .EOF", "images": ["https://web.archive.org/web/20110416110045im_/http://media.washingtonpost.com/wp-srv/special/politics/speech-database/images/icon.gif", "https://web.archive.org/web/20110416110045im_/http://media.washingtonpost.com/wp-dyn/content/photo/2009/09/18/PH2009091801494.gif", "https://web.archive.org/web/20110416110045im_/http://media.washingtonpost.com/wp-srv/images/big-quote.gif", "https://web.archive.org/web/20110416110045im_/http://media.washingtonpost.com/wp-dyn/content/graphic/2009/02/03/GR2009020301841.gif", "https://web.archive.org/web/20110416110045im_/http://stats.surfaid.ihost.com/crc/images/uc.GIF?1.13&wpost&wpost&noscript"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "In Obama's Words", "meta_data": {"keywords": "Obama delivers speech on the national debt, April 13, 2011,Obama at George Washington University", "description": "President Obama's speech transcript at George Washington University on April 13, 2011. Brought you by The Washington Post."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}