{"url": "https://www.mercurynews.com/2018/07/12/katie-holmes-just-cant-quit-jamie-foxx-despite-his-publicly-humiliating-her-with-other-women/", "text": "After escaping her reportedly intense marriage to mega-star Tom Cruise, Katie Holmes was probably looking for a sense of calm and stability in her next serious relationship.\n\nBut it’s questionable whether the “Dawson’s Creek” alum has found that with Jamie Foxx, with multiple reports suggesting that the Oscar-winning actor hasn’t been able to let go of his flirtatious, bachelor ways.\n\n“No one understands why Katie loves a man who can’t seem to commit or why he’s publicly humiliating her like this,” an insider told Us magazine. “Everyone just wants her to take care of herself and to be happy. But she won’t let go of Jamie.”\n\nFoxx, 50, sparked breakup rumors earlier this month when he was spotted partying in Miami with multiple women, while Holmes, 39, was in Paris for Fashion Week. Foxx also was seen getting close to his ex-girlfriend Kristin Grannis on July 4 when they watched fireworks together in Malibu. On top of that, the “Ray” actor was hit with allegations that he got rough with a woman during a sexual encounter in Las Vegas 2002 and tried to force her to have oral sex with him.\n\nWhile TMZ reported that Foxx won’t face charges in that case because the statute of limitations had run out, Holmes is reportedly unhappy with his other behavior around women, Us magazine reported.\n\nNonetheless, Holmes is not ready to give up on the relationship, because she’s “absolutely smitten” with him, the insider told Us.\n\nPage Six reported that Holmes was heard declaring her love for the “Django Unchained” actor after she boarded a flight to Paris. Suri, her 12-year-old daughter with Cruise, was with her, as was a friend and their nanny.\n\n“Katie was FaceTiming Jamie after they boarded,” a source told Page Six. “She said she loves him and asked if he wanted ‘cookies from Paris.'”\n\nHolmes and Foxx reportedly began dating in 2013 after Holmes divorced Cruise in 2012, but Holmes and Foxx went to great lengths to keep their relationship a secret. That’s because Holmes was legally obligated by her divorce settlement from Cruise to not publicly date anyone for five years after their breakup, according to reports in September 2017.\n\nThey still have never publicly confirmed that they are a couple, though they did the next best thing in September 2017 by being photographed together, walking on a beach in Malibu holding hands.\n\nThen again, when RadarOnline reported in late June that the couple had split, Holmes representative went on the record to call the story “100 percent untrue.” Many outlets took the on-the-record denial as an official confirmation that there is — or was — a relationship.\n\nUs magazine said there are other challenges to the relationship, notably the fact that Holmes lives in New York City and Foxx is based in Los Angeles. But they see each other “more than people would think,” a source said.\n\nThe key to Foxx’s hold on Holmes is that he’s “mesmerizing,” “entertaining” and can always make her laugh, the source told Us. So, somehow it works for her — for now.\n\n“She has fun with him when they are together,” the source said. “It’s a relationship that works for her.”", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2017/06/babydriver_4.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2017/05/met_4.jpg?w=1024&h=785", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/05/met_4.jpg?w=1024&h=785", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/07/12/katie-holmes-just-cant-quit-jamie-foxx-despite-his-publicly-humiliating-her-with-other-women/", "title": "Katie Holmes just can’t quit Jamie Foxx — despite his ‘publicly humiliating’ her with other women", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Katie Holmes is reportedly so 'smitten' with the mesmerizing Jamie Foxx that she's willing to put him with him 'publicly humiliating' her with other women.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Katie Holmes just can’t quit Jamie Foxx — despite his ‘publicly humiliating’ her with other women", "url": "https://www.mercurynews.com/2018/07/12/katie-holmes-just-cant-quit-jamie-foxx-despite-his-publicly-humiliating-her-with-other-women/", "description": "The ex-Mrs. Tom Cruise is reportedly so ‘smitten’ with the mesmerizing Mr. Foxx that she’s willing to put up with his flirtatious, bachelor ways.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/05/met_4.jpg?w=1024&h=785", "width": 1024, "height": 785}, "locale": "en_US"}, "article": {"published_time": "2018-07-12T16:49:15+00:00", "modified_time": "2018-07-16T16:59:14+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Katie Holmes just can’t quit Jamie Foxx — despite his ‘publicly humiliating’ her with other women"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/05/met_4.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1531324800.0, "source": "https://www.mercurynews.com", "summary": ""}