{"url": "https://www.elitedaily.com/p/whats-jessica-biels-net-worth-its-not-as-high-as-youd-think-8072817", "text": "Jessica Biel and Justin Timberlake have been married since 2012 and make us all swoon along the way every time they post something sweet about each other. They've been having an amazing year in their individual careers with Biel getting a Golden Globe nomination for her performance in The Sinner and Timberlake snagging the 2018 Super Bowl Halftime show, which will go down just two days after his new album releases. Given all that, what's Jessica Biel's net worth? The actress has been in the business since her 7th Heaven days when she was just a teenager, but her net worth is not as high as one would predict.\n\nJessica Biel's net worth is reportedly $18 million. I can't even imagine having $100,000 to my name let alone $18 million, so that's a pretty f*cking staggeringly impressive number in my eyes. But Justin Timberlake's net worth is even higher than that, and I quite literally might cry a river. Justin Timberlake's net worth is reportedly $230 million, and I can literally hear my unpaid student loans shrieking in envy right now. How do two people make so much money?! I bet they buy all of their food at Whole Foods without blinking.\n\nJustin be like, \"Honey, I'm thinking about how rich we are.\" Jessica be like, \"Mmmmm, I know.\"\n\nPascal Le Segretain/Getty Images Entertainment/Getty Images\n\nOutside all of their individual success in their careers, they've always made it clear how nuts about each other they are. They celebrated their fifth wedding anniversary in October of 2017. To commemorate it, Timberlake posted a video on Instagram of him singing the song they played during their first dance at their wedding with a sweet caption. It read,\n\n#TBT to a late night freestyle session on a break in the studio - YES I've been back in the studio cooking! But, today is even more special for me because five years ago, on this day, I became the luckiest man in the world when I exchanged vows with my best friend. This song was our first dance. Today is even more special for me because five years ago, on this day, I became the luckiest man in the world when I exchanged vows with my best friend. This song was our first dance. To my beautiful @jessicabiel : You have taught me so much about what a true love means. I can't put into words what these last five years have meant to me, so... 'Listen to the melody ‘cause my love is in there hiding...' #Happy5thAnniversaryWifey #ASongForYou\n\nAnd they're super supportive of each other's careers, too. Timberlake was obvi Biel's date to the 2018 Golden Globes in order to support her and her nomination.\n\nBiel posted an adorable photo of Timberlake carrying her on his back on Golden Globes night with the caption, \"I give my ride to the #goldenglobes after party a very enthusiastic 5 ⭐️ rating.\"\n\nWhile the couple has never combined their acting talents in a movie together, Biel has been incorporated into Timberlake's upcoming Man of the Woods album in a big way. When the trailer announcing the album dropped on Jan. 2, Timberlake said in the video that his family was the inspiration behind the music on the album. He said, \"This album is really inspired by my son, my wife, my family, but more so than any album I’ve ever written, where I’m from. And it’s personal.\"\n\njustintimberlakeVEVO on YouTube\n\nBiel can be heard in the video saying, \"It feels like mountains. Trees. Campfires. Like Wild West, but now.\" \"Filthy\" was the first song to be released from the album (and it's also the first song on the album). At the end of the song, Biel's voice can be heard saying, \"Do you see me? Can you find me? Look closer. Through the trees. Do you see it?\" It's a pretty weird, earthy blurb to be placed at the end of such a futuristic song, but given that \"Filthy\" is the first song on the album, that Biel soundbite is probably going to serve as the intro to the rest of the songs that might have a different vibe from \"Filthy.\"\n\nWe've already heard \"Supplies,\" though, and it does have the same vibe as \"Filthy,\" but Timberlake's \"Say Something\" has that earthy vibe the Man of the Woods trailer hints at. Between the album release, Timberlake's Super Bowl Halftime Show, and the Man of the Woods tour starting this year, Timberlake and Biel are definitely going to be adding to their family's net worth this year. And I will still be broke AF.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.elitedaily.com/uploads/getty/2018/1/31/ad06ce98-4046-4e10-8ff1-a50b6b7eb223-getty-645760172.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/c82ef555-540c-40fa-b0e5-e7f96403b0ad-getty-1170629794.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/ca574bac-e603-453a-a0e1-d65cafea57b6-getty-919969056.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/17/666f5461-db31-459c-a8d4-d226e5d4ef9b-getty-884987858.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/31/09bd41bc-2c96-4c7d-a006-39c7322fd00b-getty-904009110.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/1/31/09bd41bc-2c96-4c7d-a006-39c7322fd00b-getty-904009110.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/31/09bd41bc-2c96-4c7d-a006-39c7322fd00b-getty-904009110.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/whats-jessica-biels-net-worth-its-not-as-high-as-youd-think-8072817", "title": "What's Jessica Biel's Net Worth? It's Not As High As You'd Think", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/whats-jessica-biels-net-worth-its-not-as-high-as-youd-think-8072817", "type": "article", "title": "Jessica Biel's Net Worth Really Isn't As High As You'd Think", "description": "Jessica Biel and Justin Timberlake have been married since 2012 and make us all swoon along the way every time they post something sweet about each other. They've been having an amazing year in their individual careers with Biel getting a Golden…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/31/09bd41bc-2c96-4c7d-a006-39c7322fd00b-getty-904009110.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Jessica Biel and Justin Timberlake have been married since 2012 and make us all swoon along the way every time they post something sweet about each other. They've been having an amazing year in their individual careers with Biel getting a Golden…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}