{"url": "www.teenvogue.com/story/kylie-jenner-says-she-travis-scott-dont-go-on-dates", "text": "Rest easy, Kylie Jenner and Travis Scott stans. Your favorite Calabasas power couple is still really, really in love. Having just welcomed their daughter into the world, the two sat down to talk love, crying, custom Stormi chains, and more in their GQ cover story. The most shocking detail they revealed? Kylie and Travis never had a first date.\n\n“We don't go on dates,” Kylie confessed. According to the story, the two met at Coachella, although neither remembered where. It was more of a hang-out than a date, but clearly, it went well. After the festival, there wasn’t time to plan an official first date, or even an unofficial second date. Travis was headed to the next stop on his “Birds Eye View” tour, so Kylie left Calabasas to follow him.\n\n“Coachella was one of the stops on his tour,” she explained. “So he said, ‘I'm going back on tour—what do we want to do about this?’ Because we obviously liked each other. And I was like, ‘I guess I'm going with you.” Which is such an epic love risk that even Kylie admitted the move was “crazy romantic.” She continued, “I really jumped on the bus ... And then we rode off into the sunset. I did the whole tour with him.”\n\nAs for the Kar-Jenner clan’s thoughts on the whole thing? They apparently respected her decision. As we know, Kylie has always been fiercely independent. “My whole family knows that I do whatever I'm going to do,” Kylie said. “I've been that way my whole life. I don't really answer to anybody. I live on my own, and so I just rode off into the sunset.”\n\nWhile traveling across the country with your new maybe-boyfriend for three months might sound like a lot of commitment early on, Kylie said touring with Travis not only strengthened their relationship, but protected their privacy.\n\n“We had a lot of downtime,” she recalled. “It was organic. And we would just go to these random cities. We got to not be who we really were. Like, if we were in L.A., I feel like it would've been way different. Everything happened for a reason. We weren't going out as “Kylie and Trav.” We would just be in Cleveland, walking the street for hours. We would go on walks, and no one would bother us.”\n\nLet us slide into your DMs. Sign up for the Teen Vogue daily email.\n\nWant more from Teen Vogue? Check this out: Kim Kardashian Defends Forbes Calling Kylie Jenner \"Self-Made\"", "images": ["https://assets.teenvogue.com/photos/5b4df73fde9cf67dcdabaad1/16:9/w_1280,c_limit/FB.jpg", "http://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5b4df7389755cd1681a2f7f8/16:9/w_2560%2Cc_limit/lede.jpg", "http://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg"], "top_img": "https://assets.teenvogue.com/photos/5b4df73fde9cf67dcdabaad1/16:9/w_1280,c_limit/FB.jpg", "keywords": [], "authors": ["Hanna Lustig", "Hanna Lusti"], "canonical_link": "https://www.teenvogue.com/story/kylie-jenner-says-she-travis-scott-dont-go-on-dates", "title": "Kylie Jenner Says She and Travis Scott \"Don't Go on Dates\"", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Hanna Lustig", "copyright": "Copyright (c) Condé Nast 2020", "description": "In a new interview with \"GQ,\" Kylie Jenner opened up about her relationship with Travis Scott and how they first got together.", "id": "5b4df64106a31e53f19913c8", "keywords": "culture, kylie jenner,travis scott", "news_keywords": "culture, kylie jenner,travis scott", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b4df64106a31e53f19913c8", "parsely-metadata": "{\"description\":\"In a new interview with \\\"GQ,\\\" Kylie Jenner opened up about her relationship with Travis Scott and how they first got together.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5b4df73aac39084f512059f8/16:9/w_1000,c_limit/tout.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5b4df73aac39084f512059f8/1:1/w_1000,c_limit/tout.jpg\"}", "og": {"description": "“We don't go on dates.\"", "image": "https://assets.teenvogue.com/photos/5b4df73fde9cf67dcdabaad1/16:9/w_1280,c_limit/FB.jpg", "site_name": "Teen Vogue", "title": "Kylie Jenner and Travis Scott Never Had an Official \"First Date\"", "type": "article", "url": "https://www.teenvogue.com/story/kylie-jenner-says-she-travis-scott-dont-go-on-dates"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "“We don't go on dates.\"", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5b4df73fde9cf67dcdabaad1/16:9/w_1280,c_limit/FB.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Kylie Jenner and Travis Scott Never Had an Official \"First Date\""}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "http://www.teenvogue.com", "summary": ""}