{"url": "http://time.com/4557271/tim-kaine-speech-spanish-arizona/", "text": "Good afternoon, Phoenix! I’m so glad to be here with you all.\n\nOne of the core values of our campaign is that we’re “stronger together.” That means we know that the only way to change this country for the better is by working with each other. So it’s important to us to communicate with as many people as possible – and to listen to as many people as possible – and share our positive vision for America.\n\nThis country has a foundation that spreads out all across the planet. It has roots in Africa and Asia, many of whose people were brought here against their will, but became part of the fabric of our society. It’s rooted in Native Americans, who have always been here. And it’s enriched by immigrants from all corners – places like Ireland, where my family first came from.\n\nAnd people sometimes forget – and some may not even know – that the Hispanic community has been part of our country since the Spanish arrived in St. Augustine in 1565. That was well before the British landed in North America.\n\nSpanish was the first European language spoken in this country. A few years ago, I gave the first speech ever delivered in Spanish on the Senate floor. Since we were debating a bill about immigration, explaining it in Spanish just made sense – especially since it’s the language of more than 40 million people in this country who are most affected by this issue.\n\nI feel the same way about this election. With so much at stake for the Hispanic community, it just makes sense to make the case for our campaign in a language that’s spoken by so many families across the country.\n\nI don’t speak Spanish perfectly. But I picked up what I could while working with Jesuit missionaries in Honduras. I took the skills I learned as a boy, working in my father’s ironworking shop, and I put them to use in the village of El Progreso, teaching young people carpentry and metalwork.\n\nThat experience changed my life, and I have carried it with me ever since, in every position I’ve held – civil rights lawyer, city councilman, mayor, lieutenant governor, governor, and senator.\n\nWhat I learned in Honduras comes down to three things: Fe, familia y trabajo duro. Those were also the values I learned in my Irish-Catholic family in Kansas City. There’s one other basic belief that Hillary and I share: Do all the good you can and serve one another. It’s pretty simple.\n\nAnd today, I recognize those same values in every state in our nation, by people of all skin colors, religions and backgrounds. And in this campaign, it’s been inspiring to see people from across our country coming together to address the challenges we face.\n\nI believe that God has created a beautiful and rich tapestry in our country, an incredible cultural diversity that succeeds when we embrace everybody in love and battle back against the dark forces of division.\n\nPresidential elections are always a choice between two visions for our country… a choice between two candidates.\n\nBut this year it’s a little bit different. It’s about America looking in the mirror and deciding what we see there.\n\nThis isn’t just a question of a president’s temperament and experience, although those are very important qualities. What’s really on the ballot is Hillary Clinton’s “stronger together” vision versus Donald Trump’s frightening and divisive vision for our country.\n\nSo today, I wanted you to hear directly from me, that under a Clinton-Kaine Administration, everyone will have a place in America.\n\nLatinos have always shaped this country… From your service in the military, to your spirit of entrepreneurship… to your presence\n\non the Supreme Court.\n\nAnd by 2050, communities of color will represent the majority of our population. So of course Latinos will help shape the future of America because you are the future of America.\n\nTodos somos americanos.\n\nWe need all Americans, from all backgrounds, to help write the next chapters in our nation’s story – just as you have always done. This community has been part of a long struggle that has shown your resilience and your power.\n\nIn recent years, many of those battles have been waged right here in Arizona. In many ways, Phoenix was one of the birthplaces of the modern immigrant rights movement, when people from all over the country came to organize against SB1070 – a bill that went against so many of our shared values.\n\nThat battle isn’t over… Right now, in this election, you are all leading the way in the next phase of progress. But we’re up against some pretty tough opponents.\n\nOne of Trump’s biggest supporters, Sheriff Joe Arpaio, who’s facing criminal charges for profiling Latinos and has persecuted undocumented immigrants. He says he thinks Trump will get “a lot of Hispanic votes.”\n\nDo you think he’s right?\n\nJust the other day, your former governor, Jan Brewer, who signed into law the discriminatory SB1070 that promoted racial profiling, said that she wasn’t worried about her candidate, Donald Trump, winning this state, because, as she said, Latinos “don’t get out and vote.”\n\nDo you think she’s right?\n\nI think Jan Brewer must not be paying very close attention. Because\n\nmillions of Americans are coming together – Democrats and Republicans and Independents – to support Hillary Clinton and reject Donald Trump and everything he stands for.\n\nHere in Arizona, our campaign is surging. More than a million people have already voted early, and the rate of Hispanic voters has nearly doubled compared to four years ago. We are also seeing the same energy from the Latino community in early vote in states like Florida, Nevada, North Carolina and other states.\n\nSo I hate to break it to the Trump campaign, but Latinos are going to have a really big voice in this election… And the choice is really clear.\n\nOn the one hand, you have Hillary Clinton. Someone who’s spent her entire life working on behalf of kids and families. She started her career at an organization that fights for children and their families, at the Children’s Defense Fund. Registering Latino voters in South Texas and fought; fighting for universal healthcare and equal rights. In other words, she’s lista. Hillary Clinton is lista.\n\nOn the other hand, you have Donald Trump. Someone who thinks “Latino outreach” means tweeting out a picture of a taco bowl.\n\nIn the first weeks of his campaign, Donald Trump said that immigrants from Mexico are drug dealers, rapists, murderers. In the last debate, Trump referred to them as “bad hombres.”\n\nHe insists that “this is a country where we speak English, not Spanish.” He doesn’t understand that multilingual and bilingual families contribute to the diversity that makes our nation strong.\n\nHe once called Alicia Machado, the winner of his Miss Universe pageant, “Miss Housekeeping…” And a month ago, he decided to pick a fight with her on Twitter and in interviews for days.\n\nAnd he attacked Gonzalo Curiel – the distinguished judge in the fraud lawsuit against Trump University. Now, Judge Curiel was born in Indiana. His parents were born in Mexico. But Donald actually said Judge Curiel can’t be trusted to do his job because of his “Mexican heritage.”\n\nEven the Republican Speaker of the House, Paul Ryan, who has endorsed Trump, said that was the “definition of a racist comment.”\n\nJudge Curiel is as American as I am. And he’s as American as Donald Trump.\n\nWhether your family just arrived or has been here since before the United States even existed… Hillary Clinton and I believe we are brothers and my sisters, and we will be your champions.\n\nYou’re our neighbors, colleagues, friends and families. You make our nation stronger, smarter, and more creative. And I want all of you to know that we see you, and we are with you.\n\nAmerica is a better country because of you.\n\nHillary and I have a positive vision for what we want to accomplish.\n\nYou know, when Hillary first called me up and told me she had chosen me to be her running mate, here’s what she said…\n\nThe definition of success in a Clinton-Kaine Administration won’t be the number of laws we pass, but whether we can make life a little easier for a working mother, or help a child learn better in a classroom, or help a person who’s made a mistake get a second chance. At that moment, I knew we were going to be soul mates in this journey.\n\nHillary and I are making two major promises for the first 100 days of our administration.\n\nFirst, we’ll make the biggest investment in new, good-paying jobs since World War II. We need to create an economy that works for everyone, not just those at the top. And I don’t need to tell anyone here that we still have some work to do to get there.\n\nLatinos are 17 percent of our country’s population, but they hold only 2 percent of its wealth. That’s just not right. We’ve got to connect more Latinos with good jobs that pay good wages… with more opportunities to go to college, launch new ventures, and build wealth that you can pass on to your kids.\n\nOne of the keys to that is small business. Hillary and I are two kids of two fathers who built small businesses, and we know need to do much more to support the Latino-owned small businesses that create so many jobs across America. Our plan will make it easier to start one, increase access to capital, and invest $25 billion in the communities that need it most.\n\nAnd at a time when education is more important than ever for the jobs of the future, we’ll fight for universal pre-school, good schools in every ZIP code, and make sure no one has to give up on their dreams of college because they can’t afford to pay.\n\nOver the last 20 years, the number of Latinos going to college has tripled. That’s great news. And yet, Latinos are still less likely than their white peers to graduate – often because they can’t afford to.\n\nOur plan will help change that. We’re going to make community college\n\nfree. We’re going to make in-state public universities debt-free. And for families making less than $125,000 a year, we’ll completely eliminate tuition at those schools. That’s how we can start to break down all the economic barriers that are holding you back.\n\nSecond, Hillary and I will introduce legislation for comprehensive immigration reform that includes a path to citizenship.\n\nToo many children in America say goodbye to their parents every morning, not knowing if their mom or dad will be there when they get home.\n\nDonald Trump wants to create a deportation nation. Trump wants to deport almost 16 million people. He wants to deport 11.5 million\n\nundocumented people. And he wants to eliminate citizenship for 4.5 million people who were born in the United States to parents without documents undocumented parents and deport them as well.\n\nThis goes against one of the most important values in our Constitution – a person born here in the United States is a citizen. Hillary and I will fight against Trump’s divisive plan with all of our efforts.\n\nOne of my favorite things to do is go to the naturalization services where people become U.S. citizens.\n\nUsually, after the oath is taken, there’s an open microphone, and people get to walk up and explain why they decided to become a citizen. Their stories just bring tears to your eyes and a smile to your face when you hear what they think about the greatness of the United States of America.\n\nYou can’t help but think: Cualquier persona que ama tanto a los Estados Unidos merece estar aquí.\n\nThat’s why we’re going to fight so hard for comprehensive immigration reform, and in the meantime, we’ll do everything we can to keep families together.\n\nA few months ago, the Supreme Court put DAPA on hold. That was devastating for millions of families. But it’s important to note that the Court didn’t actually rule on the substance of the case. Hillary and I have always said that DAPA is squarely within the President’s authority, and we will keep fighting for it.\n\nWe also need to end family detention, close private detention facilities, and stop the raids and round-ups. They’re not right. They’re not necessary. And they’re not consistent with our values.\n\nI want to close by explaining why Hillary and I believe that we’re stronger together. It’s something that has always united Democrats. We’re not just looking out for ourselves, we’re people who look out for those among us that need help.\n\nIn my church, we talk about the story of the Good Samaritan. There’s somebody who’s beaten up and lying at the side of the road. And a lot of people walk on by – people who should know better, people who are leaders, people who have titles. They just walk on by. I bet somebody walked on by and said, “You’re a loser.”\n\nBut then a Samaritan, who in that story was sort of an outcast, says I’m going to go help him out.\n\nToday, there are a lot of people in this country who on the side of the road asking for help. Maybe they need a job, or need to figure out how to pay for college. Maybe they’re struggling with an illness, or are a victim of violence. Maybe they’re being bullied, or they’re just somebody who needs a second chance.\n\nThey’re all there, by the side of the road, asking for help.\n\nHillary Clinton and I believe that we can’t just walk on by. Democrats don’t walk on by. Arizonans don’t walk on by. Americans don’t walk on by.\n\nThat’s just not who we are. We go over and help. And if we want this country to remain a place where we are measured by how we help others, then we need every single person here to vote. And we need you to bring your friends, and families, and neighbors to vote too.\n\nFor the first time in a while, the state of Arizona is competitive – and every single vote counts. Tomorrow is the last day of early voting in Arizona… But why wait until then when everyone can vote today!\n\nEarly voting is open until tomorrow. The nearest early voting location is the Maryvale-Cartwright School District Annex Building, at 3401 North 67th Avenue.\n\nThis election isn’t just about where we’re going. It’s about who we are.\n\nI think we’re a country where we all belong. A country that chooses love over hate. A country that builds on the progress we’ve made instead of going backward. That, as we used to say in Honduras, goes adelante, no atrás.\n\nAnd to anyone who says that we can’t realize that vision, let’s reply with the chant that has echoed through our history:\n\nSi, se puede!\n\nGracias, Phoenix. Let’s go vote. And let’s go win.", "images": ["https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg?quality=85&w=1024&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg?quality=85&w=1024&h=628&crop=1", "keywords": [], "authors": ["Time Staff"], "canonical_link": "https://time.com/4557271/tim-kaine-speech-spanish-arizona/", "title": "Tim Kaine's Speech in Spanish at an Arizona Rally: Read Now", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Tim Kaine speech spanish, Tim Kaine spanish speech, Tim Kaine spanish, Tim Kaine speech arizona, Tim Kaine speech phoenix, Tim Kaine, Tim Kaine transcript", "news_keywords": "Tim Kaine speech spanish, Tim Kaine spanish speech, Tim Kaine spanish, Tim Kaine speech arizona, Tim Kaine speech phoenix, Tim Kaine, Tim Kaine transcript", "description": "Vice-presidential hopeful Tim Kaine on Thursday delivered a speech in Spanish at a campaign rally in Phoenix, Arizona.", "og": {"title": "Read the Transcript of Tim Kaine’s Speech in Spanish", "type": "article", "site_name": "Time", "url": "https://time.com/4557271/tim-kaine-speech-spanish-arizona/", "description": "\"Todos somos americano\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg?quality=85&w=1024&h=628&crop=1", "width": 1024, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4557271/tim-kaine-speech-spanish-arizona/", "description": "Vice-presidential hopeful Tim Kaine on Thursday delivered a speech in Spanish at a campaign rally in Phoenix, Arizona.", "media": "https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg?quality=85&w=1024&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4557271/tim-kaine-speech-spanish-arizona/", "title": "Read the Transcript of Tim Kaine’s Speech in Spanish", "description": "\"Todos somos americano\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2016/11/tim-kaine-spanish-speech.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}