{"url": "vt.co/entertainment/celebrity/taylor-swift-fans-certain-shes-pregnant/", "text": "Over the years, there have been some pretty ridiculous rumours about Taylor Swift. According to some online commenters, she's a massive Trump supporter, she purchases multi-million dollar houses just to be near guys that she finds attractive and apparently she's a secret Satanist. Oh, and she has no belly button to speak of. So they say, anyway. However, recently there has been yet another piece of gossip that's sprung up about our favourite Grammy Award winner, and this time fans believe they're well and truly onto something.\n\nAccording to social media users, we can look forward to meeting a mini-Swift sometime next year. Yes, that's right - fans online strongly believe that the Look What You Made Me Do singer is pregnant. The speculation began a few months ago when Tay Tay returned from her year-long hiatus from music. Ignoring that fact that she was looking happy, healthy and toned from her time away, fans immediately jumped on the idea that she had gained a few pounds over the last few months. Soon enough, the rumour mill was well and truly away, with many people claiming that she was pregnant, presumably with the baby of her boyfriend, British actor Joe Alwyn.\n\nKeen to uncover the \"mystery\", people were quick to point out the fact that Taylor had taken to wearing loose clothing when out and about, as well as when performing on stage, including yesterday when she performed at day two of the Capital FM Jingle Bell Ball at London's O2 Arena. However, it's important to point out the fact that this rumour is, so far, completely based on speculation and there's been no official confirmation of these Chinese whispers. This brings us to the real question - is Taylor pregnant, or is she just being savagely attacked for gaining a few pounds?\n\nWhen discussing her insignificant weight gain, people online seemed to either have one of two opinions: that she's having a baby, or that she's just \"fat\". And if the case is that Taylor has just put on a couple of pounds, like we all do from time to time, some large apologies need to be made to the musician. Over the past few months, many unapologetic fans have ripped her to sheds on Twitter, calling her \"fat\" and \"overweight.\" Shockingly, one Twitter user even declared that they wanted the \"old Taylor\" back.\n\nThe star is allegedly well aware of the rumours swirling around about her weight. Taylor reportedly made it clear that she wasn't happy about the surrounding interest at a private music session held before the premiere of her sixth studio album. After personally inviting loyal Swifties to hear her new music before anyone else, the singer allegedly told a fan called Bethany that she was tired of media speculation and that she had simply gained 15 pounds over the past few months and was not pregnant. @SwiftBethany13 apparently wrote online: “At the [secret session] she was like ‘I gained 15 pounds and everyone thinks I’m pregnant, I’m not. [Taylor] also said about how the paps are really rude and would yell mean things at her like 'she’s pregnant.'”\n\nIt certainly isn't the first time the Shake It Off songstress has been shamed for her weight online; during her 1989 tour, the star was consistently skinny-shamed by fans who insisted that she was too thin and desperately needed to put on some weight. Taylor, who recently announced a 2018 tour, was regularly called out for being a \"skeleton\" and was criticised for having \"no booty\".\n\nYet, it wasn't only fans who condemned the star for being \"underweight\". In 2016, comedian Amy Schumer was said to have body shamed Taylor for being too skinny when she posted a picture on Instagram showing her and her friend in swimwear on the beach and writing \"Taylor that's not a thigh gap. This is a thigh gap.\" Furthermore, Diplo, a DJ and music producer, found himself in hot water back in 2014 when The Washington Post reported that he had started a \"Fundraisers for Medical & Health Expenses\" petition to \"get Taylor Swift a booty\".\n\nIn fact, the whole world seems to be obsessed with any weight that Taylor does or does not put on. Demi Lovato allegedly bashed the Reputation singer back in 2016 when she seemingly discussed her weight during an interview with Glamour Magazine, saying: \"I think in certain situations, certain people could be doing more if they’re going to claim that as part of their brand. To be honest, and this will probably get me in trouble, I don’t see anybody in any sort of squad that has a normal body. It’s kind of this false image of what people should look like. And what they should be like, and it’s not real.\"\n\nHowever, wherever there are Taylor-haters, there are also a million Swifties there to step in and defend her. Today social media has been flooded with fans who insist that the singer is looking healthy and happy and have been biting at the haters. Finally, an opinion that we can get on board with.\n\nSo, is our favourite singer actually going to have a baby, or is she just being brutally body shamed yet again? The answer to this question remains to be seen, but we wouldn't be surprised if it were the latter option. But, whatever the case, we can tell you one thing for absolutely certain: Taylor Swift is looking absolutely fabulous. Keep on killing it, Taylor.", "images": ["http://vt.co/static/img/logos/jungle-creations.svg", "https://cdn.junglecreations.com/wp/junglecms/2017/12/taylor-swift-news-compressor-1.jpg", "http://vt.co/static/img/icons/search.svg", "http://vt.co/static/img/icons/share/pinterest.svg", "http://vt.co/static/img/icons/gorilla.svg", "http://vt.co/static/img/icons/share/whatsapp.svg", "http://vt.co/static/img/icons/share/email.svg", "http://vt.co/static/img/logos/vt_white.svg", "http://vt.co/static/img/icons/share/facebook.svg", "http://cdn.junglecreations.com/wp/junglecms/2017/12/taylor-feature-compressor.jpg", "http://vt.co/static/img/logos/vt_black.svg", "http://cdn.junglecreations.com/wp/junglecms/2017/12/GettyImages-888656852-compressor.jpg"], "top_img": "http://cdn.junglecreations.com/wp/junglecms/2017/12/taylor-feature-compressor.jpg", "keywords": [], "authors": [], "canonical_link": "http://vt.co/entertainment/celebrity/taylor-swift-fans-certain-shes-pregnant/", "title": "Taylor Swift fans are certain she's pregnant", "meta_data": {"viewport": "width=device-width", "description": "Speculation is rife online that Taylor Swift is pregnant. But, are fans just body shaming her by jumping on her minute weight gain?", "fb": {"app_id": 586923868183434, "pages": 363765800431935}, "og": {"locale": "en-US", "type": "article", "title": "Taylor Swift fans are certain she's pregnant", "image": {"identifier": "http://cdn.junglecreations.com/wp/junglecms/2017/12/taylor-feature-compressor.jpg", "height": 450, "width": 850}, "description": "Over the years, there have been some pretty ridiculous rumours about Taylor Swift. According to some online commenters, she's a massive Trump supporter, she purchases multi-million dollar houses just to be near guys that she finds attractive and apparently she's a secret Satanist. Oh, and she has no belly button to&hellip;", "url": "http://vt.co/entertainment/celebrity/taylor-swift-fans-certain-shes-pregnant/", "site_name": "VT"}, "article": {"publisher": "https://www.facebook.com/VT", "section": "Entertainment", "published_time": "2017-12-11T14:24:42+00:00"}, "twitter": {"card": "summary_large_image", "title": "Taylor Swift fans are certain she's pregnant", "image": "http://cdn.junglecreations.com/wp/junglecms/2017/12/taylor-feature-compressor.jpg", "description": "Over the years, there have been some pretty ridiculous rumours about Taylor Swift. According to some online commenters, she's a massive Trump supporter, she purchases multi-million dollar houses just to be near guys that she finds attractive and apparently she's a secret Satanist. Oh, and she has no belly button to&hellip;"}, "next-head-count": 10}, "movies": [], "publish_date": 1513002282.0, "source": "http://vt.co", "summary": ""}