{"url": "https://www.npr.org/sections/therecord/2017/06/12/532474238/ice-cube-leaves-bill-maher-shaken-and-stirred-over-the-n-word", "text": "Ice Cube Leaves Bill Maher Shaken And Stirred Over The N-Word The OG reprises his role as potent race critic with the re-release of 'Death Certificate.'\n\nEnlarge this image toggle caption David Becker/Getty Images for Daylight Beach David Becker/Getty Images for Daylight Beach\n\nYou know America's turning cold again when Ice Cube freezes over. Like a thermostat set to gauge the temperature of our racial transgressions, gangsta rap's first political provocateur got triggered this past Friday night; it took the abuse of one of his favorite words to resurrect his former self.\n\nWhen Bill Maher sparked outrage one week prior by jokingly referring to himself as a \"house n*****\" on his 13-year-old HBO talk show Real Time With Bill Maher, hip-hop's response ran the gamut. Chance the Rapper called for the show's immediate cancellation, while Killer Mike, a recurring Real Time guest and a successor to Cube's righteous rage, claimed he found the impromptu wisecrack funny — and, more importantly, the least of black America's concerns.\n\nBut it took the rapper most responsible for making the n-word a celebrated part of today's lexicon — as a founding member of incendiary '90s rap group N.W.A. (you know, as in N***** Wit Attitude) — to turn Maher's wrongheaded usage of the word into a \"teachable moment.\"\n\nYouTube\n\nBest known for such anthems as N.W.A.'s \"F*** The Police\" and his caustic solo debut AmeriKKKa's Most Wanted, the old Cube couldn't have returned at a better time. His appearance on the show coincided with the 25th anniversary re-release of his most potent sociopolitical treatise, 1991's Death Certificate. Dressed in black and wearing the signature scowl that characterized his raucous entrée into rap, Cube wasted no time mincing words with Maher.\n\n\"I knew you was gon' f*** up sooner or later,\" he told the comedian. The sentiment summed up much of the week-long criticism surrounding what Doha Madani, a writer for the HuffPost vertical Black Voices, describes as Maher's history of \"racist, sexist, transphobic and Islamophobic remarks.\"\n\nBut this was more than Cube piggybacking on call-out culture; it was a return to the rapper-turned-actor's first role, as vocal objector to America's underlying bigotry. Without a doubt, he's been sorely missed.\n\nFor nearly 20 years, every profile written about Ice Cube has hinged on one question: What happened to the mad, unrepentant, explicit n-word AmeriKKKa loves to hate? The MC who added political bite to N.W.A.'s bark traded in his hip-hop cred for Hollywood; his breakout role as Dough Boy in director John Singleton's 1991 debut Boyz N the Hood eventually led to crossover film success. Disgruntled fans protested, while Cube's icy exterior melted with each successive release of a new family-oriented comedy.\n\ntoggle caption Courtesy of the artist\n\nThat's an oversimplified version of the transformation that turned the South Central native into a successful screenwriter and co-founder of his Cube Vision production company — but it suggests a larger absence in rap. For close to two decades, the genre's most prominent and promoted voices have found the paper chase more topical than political consciousness.\n\nThe original release of Death Certificate delivered an urgent diagnosis: \"N***** are in a state of emergency,\" Cube announces on the album's original intro.\n\nNot only did it expose a generation to an urban America ravaged by gangs, guns and drugs, the album offered a pointed racial critique to contextualize the inner city's economic disparity. On \"Black Korea,\" Cube practically predicts the 1992 uprisings that would follow the brutal, on-camera beating of Rodney King. \"I Wanna Kill Sam\" castigates red-white-and-blue hypocrisy from slavery through the present day. On \"Alive On Arrival,\" he highlights the devaluation of black life by narrating his own death-by-bureaucracy while bleeding from a minor gunshot wound on the floor of a public hospital waiting room. He holds a mirror up to his peers with songs like \"Us\" and \"Doing Dumb S***,\" grounded in a message of personal responsibility that reflected the Nation of Islam teachings Cube was loosely affiliated with at the time.\n\nOf course, hip-hop's attempt to transform the n-word from racial slur to intra-racial term of endearment got muddied by white America's sense of entitlement. Despite accepting Maher's apology, Cube stressed the need to get to \"the root of the psyche\" that made Maher feel comfortable with using a word so historically loaded with racial animus. When Cube referred to \"guys out there who cross the line because ... they think they're too familiar,\" it was definitely a dig at Maher. The comedian has vociferously defended his right to use the word in the past due to hip-hop's manipulation of its meaning.\n\nYouTube\n\nBut, as Cube told a visibly frustrated Maher, \"that's our word now, and you can't have it back.\"\n\nOn an episode designed to absolve Maher of some guilt — thanks to thoughtful, tempered objection from public intellectual Michael Eric Dyson, who endured plenty of criticism for defending the comedian's left-leaning record — Cube reminded the nation of rap's ability to speak the raw, uncut truth to power.\n\nHip-hop's blunt approach has always served as the perfect counter-punch to the civil rights era's articulated patience. In the same sense, Dyson and Cube wound up playing a compelling version of \"Good Cop Bad Cop\" — which happens to be the title of one of three new songs on Cube's Death Certificate re-release.\n\nBut Cube also played the very role Maher needed him to play. With their exchange now viral, his public chastening has satiated enough critics to ensure the preservation of the comedian's long-running show. And Ice Cube the rapper simultaneously revitalized his own rep. When Ice Cube the actor receives his star on Hollywood's Walk of Fame this summer, the character he displayed on Real Time last Friday night will be the one inspiring hip-hop's loudest applause.", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/assets/img/2017/01/30/rodneycarmichael_sq-ad453b583dc660c883974bd1e4002fa3d71b57f1-s100-c85.jpg", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2017/06/11/death-certificate-25th-anniversary_sq-bfd439798a6c692d3097da4f7a8ff2ca7a18b2d4-s800-c15.jpg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2017/06/12/gettyimages-679804288_wide-6c54e56ac16c5ab4e5051b53ac865c234addeffe-s1100-c15.jpg", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png", "https://media.npr.org/assets/img/2017/06/12/gettyimages-679804288_wide-6c54e56ac16c5ab4e5051b53ac865c234addeffe.jpg?s=1400"], "top_img": "https://media.npr.org/assets/img/2017/06/12/gettyimages-679804288_wide-6c54e56ac16c5ab4e5051b53ac865c234addeffe.jpg?s=1400", "keywords": [], "authors": ["Rodney Carmichael"], "canonical_link": "https://www.npr.org/sections/therecord/2017/06/12/532474238/ice-cube-leaves-bill-maher-shaken-and-stirred-over-the-n-word", "title": "Ice Cube Leaves Bill Maher Shaken And Stirred Over The N-Word", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2017-06-12", "description": "25 years after Death Certificate, the OG reprises his role as rap's most potent race critic.", "og": {"title": "Ice Cube Leaves Bill Maher Shaken And Stirred Over The N-Word", "url": "https://www.npr.org/sections/therecord/2017/06/12/532474238/ice-cube-leaves-bill-maher-shaken-and-stirred-over-the-n-word", "type": "article", "description": "25 years after Death Certificate, the OG reprises his role as rap's most potent race critic.", "image": "https://media.npr.org/assets/img/2017/06/12/gettyimages-679804288_wide-6c54e56ac16c5ab4e5051b53ac865c234addeffe.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "Ice Cube Leaves Bill Maher Shaken And Stirred Over The N-Word", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2017/06/12/gettyimages-679804288_wide-6c54e56ac16c5ab4e5051b53ac865c234addeffe.jpg?s=1400"}}}, "movies": ["https://www.youtube.com/embed/gnwiYdFaRfk?rel=0", "https://www.youtube.com/embed/SSKRLZSzCXA?rel=0"], "publish_date": 1497196800.0, "source": "https://www.npr.org", "summary": ""}