{"url": "https://en.wikipedia.org/wiki/Alexandra_Cabot", "text": "For the comic and cartoon character of the same name, see Alexandra Cabot (comics)\n\nFictional character on Law & Order: Special Victims Unit\n\nAlexandra \"Alex\" Cabot is a fictional character within the Law & Order universe portrayed by Stephanie March. She is a primary character in Law & Order: Special Victims Unit and Conviction.\n\nCharacter overview [ edit ]\n\nCabot first appears in the SVU episode \"Wrong Is Right\", when she is hired to work with SVU as their permanent assistant district attorney (ADA) overseeing the legality of its arrests, following a rotating mix of ADAs, among them Abbie Carmichael (Angie Harmon) of the original Law & Order.[1] She is a graduate of Harvard Law School,[2] and has an \"uncle Bill\" who is a federal judge.[1] While Cabot has great compassion for the victims of sexual assault, child sexual abuse and domestic violence whom she advocates for, her strict code of legal ethics often forces her to make harsh decisions and judgments that go against her personal feelings. Her moral compass has earned her respect within the SVU squad.\n\nShe does occasionally bend the rules to suit her own notions of justice, but often with unpleasant results. In one case, she is so determined to put serial child molester Roy Barnett (Beau Gravitte) in prison that she aggressively pressures one of his victims, Sam Cavanaugh (Bret Harrison) to testify, going so far as to threaten the boy with legal action if he does not comply. Sam later attempts suicide, leaving him with severe brain damage and thus unable to testify. She then lies to the detectives about having a search warrant for Sam’s home, which results in Barnett’s conviction on a technicality, but gets her in trouble with her superiors. She is let off with a one-month suspension, but feels responsible for Sam’s plight.[3]\n\nExecutive producer and head writer Neal Baer has said that an unaddressed sexual tension exists between Cabot and Detective Olivia Benson (Mariska Hargitay). Baer said, \"We read the fan sites. We know that people are into the Alex-Olivia thing. All the codes are in there.\"[4] When asked in a 2009 press call if Cabot and Benson were in love, March said, \"I’m not saying we’re not…I’m not saying we’re not in love.\"[5]\n\nDeparture from SVU [ edit ]\n\nAfter three seasons, Cabot made her departure from SVU in the season-five episode \"Loss\", in which she is prosecuting a rapist named Rafael Zapata Gaviria (Jacinto Taras Riddick), who works for drug lord Cesar Velez. Zapata had brutally raped and murdered an undercover NYPD officer who was working with the Drug Enforcement Administration (DEA). Cabot receives a threat on her life, as well as that of her mother. Despite warnings from the rest of the SVU squad, Cabot continues to prosecute the case, unwilling to let Zapata scare her. Tim Donovan (Josh Hopkins), a key witness and DEA special agent, is murdered in a car bombing right before Cabot's eyes. Cabot initially wants to try Zapata, even with no witness and her own life on the line, but after pressuring from the SVU detectives and District Attorney Arthur Branch (Fred Thompson), she drops the charges. However, Zapata is immediately arrested by federal agents for the witness's murder and is subsequently killed in his cell.[6]\n\nAt the conclusion of the episode, Cabot is apparently killed in a drive-by shooting while saying goodnight to Benson and Detective Elliot Stabler (Christopher Meloni). In the following scene, a cold, quiet SVU squad room is shown with Stabler reading a newspaper proclaiming her death. Benson and Stabler are called to a deserted area by federal agents, where Cabot emerges from the car. She tells the stunned detectives that she had insisted on telling them the truth before disappearing into the Witness Protection Program.[6] She is replaced in the following episode by ADA Casey Novak (Diane Neal).[7]\n\nFirst reappearance on SVU [ edit ]\n\nIn the season-six episode \"Ghost\", events surrounding the arrest of Liam Connors (Brian F. O'Byrne), the assassin who shot her, led to Cabot's return from the Witness Protection Program as Connors is arrested for her murder while being pursued for several others and an attempted murder of a young boy who witnessed one of his crimes. She reveals that the assumed identity she was given was an insurance salesperson from Tulsa, that she was living and working in Wisconsin under the name \"Emily\", and that she missed her mother's funeral while in hiding. She is reluctant to see Connors convicted of a murder he did not commit (he does not know she is alive, either), but still wants justice and testifies against him in court. Connors goes to prison, having been found guilty under two counts of attempted murder (Cabot and an eight-year-old boy), plus five counts of murder. Upon winning the case, the SVU squad goes to Novak's office to celebrate, awaiting Cabot to join them. She does not show up, and federal agents inform them that she has once again been moved and given a new identity.[8]\n\nIn Conviction [ edit ]\n\nAbout a year after her reappearance on SVU, Cabot returns to New York and resumes her work in the district attorney's office as the homicide bureau chief (replacing Tracey Kibre from Law & Order: Trial by Jury) in the Law & Order spinoff Conviction. She plays a tough but understanding supervisor to a young group of ADAs. Her attitude and personality in this role were much different from those of the young ADA who prosecuted cases in SVU. Cabot's departure from witness protection and return to New York as a bureau chief was not explained during the show's airing, as she was a last-minute addition to the cast and most of the early episodes had already been written before she was added. Plans were made for later episodes to explain Cabot's return to New York, plus a greater exploration of her personal life and past, but the cancellation of Conviction made this moot.[9]\n\nSecond reappearance on SVU [ edit ]\n\nThe explanation of Cabot's return from witness protection to the DA's office in Conviction was finally revealed in the SVU season-10 episode, \"Lead\", where she reveals to the SVU detectives that she has been asked by DA Jack McCoy (Sam Waterston) to step in for Kim Greylek (Michaela McManus), when Greylek was called back to the Justice Department. At that point, she had not told her former colleagues of her return; she is implied, and later confirmed, to be still traumatized by her attempted murder. The detectives learn she had left witness protection after Velez died in prison and Connors was extradited to Ireland. Sometime between 2006 and 2007, she stepped down from the position of homicide bureau chief and is replaced by Christine Danielson (Gloria Reuben). Cabot begins work in the Appeals Bureau until her return to SVU.[10] She remains at SVU for the remainder of the season, in which she appears in six episodes in what Cabot calls a \"temporary\" role. She replaces Greylek.\n\nIn the season-11 premiere, Cabot is revealed to be training in Albany, and will eventually return to the Appeals Bureau. McCoy asks Executive ADA Sonya Paxton (Christine Lahti) to assume Cabot's role.[11] Paxton is ultimately fired for showing up to trial drunk,[12] and Cabot returns to her old job, commenting that she had \"clawed her way\" out of Appeals to return to SVU, to prosecute Kevin O’Donnell (Garret Dillahunt), the leader of a pedophile advocacy group. In this episode, Stephanie March is added to the season-11 opening credits as a series regular (though only in episodes in which she appears).[13] Benson and Stabler are later informed that Cabot had been accused of withholding evidence and is being investigated by the state bar association. In that same episode, Paxton returns to give Cabot some \"much needed advice\" that helps her win the case.[14]\n\nIn another episode, Cabot tries a rape case with an illegal immigrant from the Democratic Republic of the Congo as her star witness. The witness was herself raped in the Congo, and Cabot works to help her get asylum, as well as trying the rape case, which then becomes a murder case after the victim dies from an infection caused by injuries sustained during the rape. Cabot succeeds in getting the rapist convicted and gets the witness a visa that would allow her to remain in the United States without fear of being deported. However, the case affects both the witness and Cabot; the witness decides to return to the Congo to help rape victims there, while Cabot decides to take a leave of absence and joins the prosecutor's office of the International Criminal Court, which prosecutes sex crimes and other human-rights abuses in areas such as the Congo.[15] She is replaced by ADA Jo Marlowe (Sharon Stone).[16]\n\nSubsequent appearances [ edit ]\n\nSeason 13 [ edit ]\n\nADAs Alexandra Cabot and Casey Novak both returned to Law & Order: Special Victims Unit for the show's 13th season.[17] In the season premiere \"Scorched Earth\", Cabot makes her first appearance in the squad room since season 11. She is the lead prosecutor in a rape case against Roberto DiStasio (Franco Nero), a diplomat in the running to become Italy's next prime minister. When the accuser, a hotel maid, is caught on tape admitting she could make money off her alleged rapist, Cabot's new boss, SVU's Bureau Chief ADA Michael Cutter (Linus Roache), says that they are dropping the charges. Cabot fights Cutter, however, and the case does make it to trial, with mixed results; the jury finds the defendant guilty of unlawful imprisonment, but are deadlocked on the rape charge.[18]\n\nIn the episode \"Spiraling Down\", Cabot is convinced by the detectives to set up a sting operation to catch johns after they rescue an underaged prostitute. They arrest former professional quarterback Jake Stanton (Treat Williams), and both Cabot and Benson seek to make an example out of him, but Cabot is unexpectedly forced to face off with defense attorney Bayard Ellis (Andre Braugher) at trial, after Benson tells Stanton's wife to call him. After the case takes a turn for the worse, Cabot berates Benson after court when Benson defends Stanton. Cabot implies she knows Benson had something to do with Ellis defending Stanton. Cabot ultimately loses the case after the jury finds Stanton not guilty due to mental instability caused by the numerous concussions he suffered during his career.[19]\n\nCabot is the prosecutor in seven episodes of season 13, sharing the ADA duties with Novak, Cutter, and David Haden (Harry Connick Jr.). The character makes her final appearance in the season in \"Learning Curve\", in which she helps the investigation of sexual abuse in an exclusive preparatory school.[20]\n\nSeason 19 [ edit ]\n\nCabot returns six years later in the Season 19 episode, \"Sunk Cost Fallacy\". At this point, she has retired from the D.A's office, and now helps battered women escape their abusers by “disappearing” them - smuggling them out of New York City and giving them new identities.\n\nIn SVU's latest case, a woman named Jules Hunter (Sarah Wilson) and her four-year-old daughter Ruby have gone missing, and the detectives find evidence of their apparent murders in Jules' car. They arrest their chief suspect, Jules’ abusive husband Nick (Scott Porter). However, now-Lieutenant Benson discovers that Cabot had faked Jules’ and Ruby’s deaths in order to help them escape their abusive home and start new lives.\n\nBenson is forced to reduce the charges against Nick to assault, and he makes bail. He then sues the department and the D.A's office for $50 million. During the resulting bench trial, Nick’s lawyer calls Benson as a witness and gets her to reveal that Jules and Ruby are alive. Cabot tries to hide them again, but Benson persuades Jules to stay and help put Nick in prison. Soon afterward, however, Jules is killed in an apparent car accident. Both Cabot and Benson believe that Nick is responsible, but he nevertheless wins custody of Ruby. Though now on opposite sides, Cabot and Benson part ways on good terms; they express admiration for each other and hug. Cabot then goes to meet another client.\n\nCredits [ edit ]\n\nMarch has been credited in 97 episodes of SVU (appearing in 93),[21] making her the third-longest ADA in the franchise history, surpassed by Casey Novak (SVU), and Ron Carver (Law & Order: Criminal Intent). Additionally, she is credited in all 13 episodes of Conviction, bringing her total episode count to 110.\n\nSeasons Years Episodes 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 2 2000–01 3 2001–02 4 2002–03 × × × 5 2003 × 6 2005 1 (Conviction) 2006 10 2009 11 2009–10 13 2011–12 19 2018 Seasons Years 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Episodes\n\nRegular cast × Regular cast + no appearance Recurring cast No credit + no appearance No episode", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/a/a3/ADA_Alexandra_Cabot.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/ADA_Alexandra_Cabot.jpg/300px-ADA_Alexandra_Cabot.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a3/ADA_Alexandra_Cabot.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Alexandra_Cabot", "title": "Alexandra Cabot", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/a3/ADA_Alexandra_Cabot.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}