{"url": "https://en.wikipedia.org/wiki/Crazy_Ex-Girlfriend_(season_4)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date [47] US viewers\n\n(millions)\n\n45 1 \"I Want to Be Here\" Stuart McDonald Rachel Bloom October 12, 2018 ( ) 0.40[48]\n\nThe judge presiding over Rebecca's attempted murder case rejects her guilty plea, but sentences Rebecca to six weeks in jail while she awaits a new hearing. In jail, Rebecca attempts to atone for all of her wrongdoings by directing her fellow inmates' theatre class, which they don’t take kindly to, especially once they discover that Rebecca is there voluntarily. Meanwhile, Heather and Hector try to convince Josh that he doesn’t have a disorder and Nathaniel goes on a solo survivalist camping experience, only to be comforted by George. Paula gets Trent to confess, therefore nullifying the state's case against Rebecca. Paula, Valencia, and Heather deliver the news to Rebecca, but she still wants to stay in jail until Heather and Valencia call Rebecca out on her privilege and her idea that her being in jail is helping anybody. Josh begins therapy sessions with Dr. Davit Akopian. Hearing the news that Rebecca has been released from jail, Nathaniel invites her on a trip to Hawaii, but Rebecca declines in favor of helping the other inmates with legal advice. Nathaniel calls Rebecca selfish and Rebecca asks him to leave. A brief flashback shows Paula waking up Trent. Songs: \"What's Your Story?\"; \"No One Else is Singing My Song\" (sung by Rebecca, Nathaniel, Josh, & the cast); \"Maybe I'm Just Broken\" (sung by George)\n\n46 2 \"I Am Ashamed\" Rachel Specter & Audrey Wauchope[d] Erin Ehrlich October 19, 2018 ( ) 0.38[51]\n\nReports of Rebecca’s release hit the local news along with details of her past behaviors. After reading the online comments, Rebecca becomes agoraphobic. Meanwhile, Darryl scours the \"white market\" for breastmilk for his baby daughter, Hebecca. He goes to retrieve it on Halloween while White Josh and Josh babysit. Rebecca misses an appointment with Dr. Akopian, but suspects that a woman who died in her and Heather’s apartment is haunting the place. Rebecca calls on Valencia to help her perform a séance, though Heather and Paula believe that there must be a logical explanation for the noises and electrical problems in the apartment. Nathaniel returns to work, only to be berated by his father for slacking off. The firm’s silent partner Bert, the conspiracy theorist from Rebecca’s support group, decides that he wants to have a more active role in the firm’s operations. Daryl’s trip causes him to miss Hebecca’s first Halloween. While dropping off their daughter Madison, his ex-wife Stacy tells Daryl that’s using formula is perfectly fine and Madison affirms that he is a good father. Rebecca is finally able to go outside when she, Paula, Heather, and Valencia visit the dead woman’s grave to pay their respects. Songs: \"Time to Seize the Day\"; \"The Cringe\" (sung by Castleman & the cast) Other Rebecca's line: \"My name's Debra.\"\n\n47 3 \"I'm On My Own Path\" Jude Weng Alden Derck October 26, 2018 ( ) 0.41[52]\n\nRebecca returns to work and, although Nathaniel is avoiding her, she aces a meeting with one of the firm's biggest clients. Still feeling dissatisfied, Dr. Akopian tells Rebecca that she doesn’t have to be a lawyer if she doesn’t enjoy it. Rebecca runs into Josh in the waiting room, as he now sees the other Dr. Akopian for therapy, and Josh tells Rebecca that he’s started dating again. She helps him pick out dates, but neither are successful. Back at the firm, Rebecca discovers a new pretzel shop in the lobby, run by her former co-worker Jim. He explains that he wasn’t happy practicing law, so he quit, which inspires Rebecca to do the same. Heather and Hector get married at the courthouse so that he can use her health insurance. Despite Heather not wanting a wedding, she arranges the ceremony that Hector wanted with the help of Valencia and Beth. Rebecca finally tells Paula that she won’t be returning to the firm and that she never wanted to be a lawyer. Corporate shuts down Jim's pretzel shop after finding several violations made by Rebecca. Jim returns to the firm, but Rebecca decides to rebrand the shop as her own. Songs: \"Don’t Be a Lawyer\" (sung by Jim); \"Our Twisted Fate\" (sung by the pretzels (Adam Schlesinger)) Other Rebecca's line: \"I live in this park!\"\n\n48 4 \"I'm Making Up for Lost Time\" Stuart McDonald Elisabeth Kiernan Averick November 2, 2018 ( ) 0.46[53]\n\nRebecca is spontaneously visited by her younger half-brother Tucker, who lies about his parents knowing where he is and secretly references one of Rebecca's old diaries in order to make it seem as though they have a lot in common. Paula takes her sons, Tommy and Brendan, to do an escape room exercise and quickly realizes that she knows nothing about their lives. Rebecca and Tucker take a trip into Los Angeles and stumble upon an open audition for a production of Peter Pan. Despite being a talented singer, Tucker bombs the audition. Rebecca attempts to persuade the director into changing her mind, but to no avail. Nathaniel has Sunil follow Rebecca and gather intel on how to get her back in exchange for letting Sunil serve as the paralegal on a big case. Meanwhile, Mrs. Hernandez researches the case and Nathaniel ultimately assigns it to her. He bribes the director of Peter Pan into giving Tucker a role in exchange for Rebecca's diary. Nathaniel makes an attempt at Rebetzel's to win Rebecca back, which backfires as Rebecca catches on to his scheme and confronts him, telling him that they're completely done. When she later speaks to Tucker, he reveals that the audition was the whole reason he came to see Rebecca, but that he did end up enjoying getting to know her. After he launches into a self-disparaging rant, Rebecca, recognizing how troubled he is, arranges with Tucker's mom for him to begin therapy and pays for him to go to theatre camp the next summer (instead of working at their father's construction site). Tucker asks Rebecca if she \"hates him now\", to which she replies that she loves him, a statement he reciprocates. The episode concludes with Tucker nestling up to Rebecca on her couch to watch Rebecca's favorite movie growing up, Slumbered. Songs: \"One Indescribable Instant (Reprise)\" (sung by Tucker & Rebecca); \"I Want to Be a Child Star\" (sung by Tucker) Other Rebecca's line: \"I think I'm a fork! Uh-oh!\"\n\n49 5 \"I'm So Happy for You\" Erin Ehrlich Ilana Peña November 9, 2018 ( ) 0.42[54]\n\nHeather and Valencia both announce that they are moving and Brendan decides to join a Peace Corps-like organization. Distraught that her son is leaving after finally becoming close to him, Paula schemes to get him to stay by attempting to enlist his old school crush, but her plan backfires. Rebecca confesses to Dr. Akopian that she sees life as a competition and that she feels as though she’s losing. Dr. Akopian affirms that she has fallen behind, but only because of her health struggles. Unsatisfied with Dr. Akopian's assessment, Rebecca tries to convince Heather and Valencia that they’re giving up on their young lifestyles and starts hanging out with Maya and AJ, later inviting them and their friends to Heather and Valencia's going-away party. Darryl and White Josh worry about spending too much time together, as all their friends urge them to get back together. White Josh starts dating a fellow trainer, Vic, which Darryl encourages. As Brendan packs, Paula tells him how proud she is of him for turning out better than she thought he would. Rebecca has a terrible time at the party and apologizes for being a jerk to her friends, who all agree to always keep in touch. Songs: \"The Group Mind Has Decided You're in Love\" (sung by the cast); \"I've Always Never Believed In You\" (sung by Paula) Other Rebecca's line: \"Don't look. I'm behind you!\"\n\n50 6 \"I See You\" Dan Gregor Jack Dolgen November 16, 2018 ( ) 0.40[55]\n\nWith all her friends either away or busy, Rebecca decides to call up her old work colleagues to hang out, though only Darryl is receptive. They drive to Irvine for a barbecue special, but clash when Darryl repeatedly defies Rebecca's request to keep things light. To study for her finals, Paula buys a desk online and accidentally hires Josh to help her retrieve it from San Bernardino. Once there, Paula stalls and Josh helps her overcome her inner fear of success. Heather picks up Nathaniel when his car breaks down outside of the city. They continue on to Santa Monica as Nathaniel clutches a package and makes fun of Heather's car. After her car breaks down due to its age and poor condition, Nathaniel and Heather get into a heated argument, and the package is revealed to contain the ashes of his childhood au pair Heidi, which he was planning to scatter in the ocean. Nathaniel opens up to Heather that the only people he's ever felt truly loved by are Heidi and Rebecca, and he feels as though he's now lost everyone who loved him. Heather tells him that he should show more people this side of him, and Nathaniel confesses that his cruel demeanor is a defense mechanism and expresses a desire to become a nicer person. Since they are unable to make it to the beach, they brush Heidi's ashes in a nearby drain that leads to the ocean. Rebecca apologizes for snapping at Darryl and, later on, they almost kiss. Both brush the moment off as a result of their respective loneliness, but Rebecca also enjoys the realization that she’s capable of being attracted to someone nice. This leads to her decision to get back on the dating scene. Josh tells Paula that she'll be a good lawyer given how much she cares, and Paula hands Josh a pamphlet for apartments in the area so he can move out of Hector's mom's house. Back at Home Base, Nathaniel apologizes to Bert and awkwardly gives him a kiss on the forehead, and Heather announces to Nathaniel that she got a new Civic. Songs: \"Trapped In a Car With Someone You Don't Want To Be Trapped In a Car With\" (sung by the cast); \"Farewell, Fair Mustache\" (sung by Darryl) Other Rebecca's Line: \"I eat my own eyelashes!\"\n\nRebecca lets Josh stay at her apartment while she attends an awards ceremony in New York, where her mother Naomi is being honored. Rebecca opts to stay with Valencia and Beth, but plans to tell Naomi about her recent life struggles and changes after committing to being honest. However, Naomi already knows everything thanks to the media, except that Rebecca quit practicing law. Josh falls behind in his adult responsibilities, but gets inspiration from Darryl to clean up Rebecca's apartment. Rebecca and Naomi plan the award ceremony with their nemeses, the Levines, and Naomi promises that her old friend Elayne Boosler will be there. Boosler later declines the invitation and Rebecca confesses to Naomi that she now runs a pretzel stand, but she is happy doing so. Naomi calls Rebecca a failure and forbids her from admitting this to anyone at the ceremony. Nathaniel, who is attempting to become nice, helps Paula cover Rebecca's prison cases and discovers to his surprise that he finds joy in helping others. Valencia is able to convince Boosler to attend the ceremony and after Naomi goes behind Rebecca's back to get her job at the firm back, Rebecca warns Naomi against overstepping their boundaries again. Upon returning home, Rebecca decides to take Josh in as a roommate and, seeing how both Josh and Nathaniel have grown, begins to develop feelings for them again. Songs: \"How To Clean Up\" (sung by Darryl); \"Forget It\" (sung by Naomi); \"If You Ever Need A Favor In 50 Years\" (sung by Naomi & Elayne Boosler) Other Rebecca's Line: (Barking noises)\n\n52 8 \"I'm Not the Person I Used to Be\" Stuart McDonald Rene Gube December 7, 2018 ( ) 0.39[57]\n\nValencia and Greg return to West Covina to attend their high school reunion. Josh, being the Prom King, argues with Hector, the student body president, over who should give the reunion speech, and following Josh's speech Hector reveals that White Josh was actually voted Prom King but turned it down. Deflated, Josh joins George and the school's magic club and realizes what his popularity caused him to miss out on in high school. As Rebecca reconnects with Greg, she texts Paula asking whether she should tell him that she slept with his dad, but Paula is preoccupied studying for her law school finals. For fear that he Marco will tell Greg himself, Rebecca eventually decides to tell Greg, who tells her that they both changed. Valencia tells Heather that she had a crush on another person when she was dating Josh in high school. On graduation day, she wrote a love letter to them but received no reply. Later, they find out that the letter had been sitting in Hector's trunk. It is revealed that her crush was Father Brah. The two have a brief moment of rekindling, but decide to go their separate ways as they both are in serious relationships. Songs: \"Hello, Nice To Meet You\" (sung by Rebecca & Greg); \"What U Missed While U Were PopUlar\" (sung by George) Other Rebecca's Line: \"I miss the season 1 theme song!\"\n\n53 9 \"I Need Some Balance\" Kimmy Gatewood Elisabeth Kiernan Averick January 11, 2019 ( ) 0.45[58]\n\nDue to her resentment for the musical Cats, anthropomorphic felines - representing Rebecca's vagina - begin to haunt Rebecca through euphemistic songs. To get her mind off Josh, Greg, and Nathaniel, Rebecca doubles down on spin classes in preparation for a date with Jason, whom she was matched with on Tinder again. Valencia warns Rebecca about wearing cheap polyester leggings to work out, but Rebecca dismisses her concern and ends up getting a yeast infection. Meanwhile, Darryl competes with Bert for the affections of their subordinates. Rebecca reschedules her date and attempts to treat the infection by \"doubling down\", but her efforts cause her to get bacterial vaginosis. Due to the smell, Rebecca has Valencia send Jason home. Nathaniel meets Greg at the gym. They bond by discussing their exes and encourage one another to confront them, not realizing that they are both talking about Rebecca until they run into each other at her house. Rebecca explains to Jason what happened and he is understanding. They meet for their date but are interrupted by Nathaniel, Greg, and a mostly naked Josh. Jason decides to leave, followed by Greg and Nathaniel. Without knowing what they wanted to say, Rebecca is left frustrated and confused. Songs: \"Hungry Vagina Metaphor\" (sung by the Hungry Cat); \"Itchy Vagina Metaphor\" (sung by the Itchy Cat); \"Funky Vagina Metaphor\" (sung by the Funky Cat); \"Elated Vagina Metaphor\" (sung by the Elated Cat); \"Nostalgic Vagina Metaphor\" (sung by the Nostalgia Cat and Doggy Dog) Other Rebecca's Line: \"I’m dating my uncle!\" (Boom operator walks away.)\n\n54 10 \"I Can Work With You\" Kabir Akhtar Rachel Specter & Audrey Wauchope January 18, 2019 ( ) 0.41[59]\n\nRebecca tells Darryl she still wants to know what important things both Greg and Nathaniel wanted to tell her. After listening, Darryl invites Rebecca to babysit Hebecca and she reluctantly agrees. While Rebecca is babysitting, Paula hosts a game night that's in celebration of her graduating law school, but she does not disclose this to anyone except for Scott because she doesn't want praise. At the party, Heather and Beth, Josh and Nathaniel, Valencia and Hector, and Paula and Scott are paired up in teams. Paula and Scott are great at the game but Nathaniel and Josh still have lots of tension between them over Rebecca and their completely different personalities. Meanwhile, at Darryl's Greg comes over to help Rebecca babysit and eventually the pair sleep together on Darryl's floor. Rebecca talks to Greg about taking their relationship slow because of her BPD and he agrees. At Paula's crumbling party, Josh and Nathaniel bond over sports and eventually Paula reveals that she graduated from law school to everyone. After Paula announces her success the party turns around and soon everyone is helping Josh with an underwear shoot. Hector confronts Valencia on her cruel treatment of him, and she apologizes and decides to be nicer to him. Rebecca bonds with Hebecca and after Darryl returns home they leave Hebecca with Greg and go to Paula's party. After they arrive with a cake, Paula is finally able to celebrate her accomplishments surrounded by her loved ones. Songs: \"Sports Analogies\" (sung by Nathaniel and Josh); \"Hello, Nice to Meet You (Reprise #1)\" (sung by Rebecca and Greg); \"Hello, Nice to Meet You (Reprise #2)\" (sung by Rebecca to Hebecca) Other Rebecca's Line: \"I've never felt love!\"\n\n55 11 \"I'm Almost Over You\" Erin Ehrlich Michael Hitchcock January 25, 2019 ( ) 0.37[60]\n\nShortly after seeing Rebecca and Greg together Nathaniel gets jealous and after he hears Paula talk about Rebecca's love of romantic comedies he goes home and binge-watches lots of rom-coms. Nathaniel then enters a dream-like rom-com sequence where he and Maya are pretending to be in love as they are each trying to win back an ex (Rebecca and Joanne) by making them jealous. In the dream, Nathaniel and Maya need to work on a big case for Joanne's insurance company and at the end of the 'movie' Maya wins Joanne back. After realising he is in love with Maya and not Rebecca he goes to try and win Maya back but she tells Nathaniel to let her be happy and soon Maya fades out to become Rebecca. Nathaniel wakes up from the sequence and realises that he needs to let Rebecca be happy with Greg and at the end of the episode Nathaniel tells Rebecca he needs to let her go. Songs: \"Gratuitous Karaoke Moment\" (sung by Nathaniel & Maya)\n\n56 12 \"I Need a Break\" Jack Dolgen Ilana Peña February 1, 2019 ( ) 0.40[61]\n\nRebecca asks Greg to come with her to Raging Waters and after some initial reluctance he agrees. However, Dr, Akopian is unsure this is wise and reminds Rebecca that she originally said she wanted to take her relationships slowly to look after her mental health, but Rebecca doesn't listen and decides to go with Greg anyway. Meanwhile, Paula is becoming overworked and stressed but shows no signs of slowing down. When Rebecca and Greg arrive at the park things quickly go south as Greg is not enjoying himself and Rebecca takes it personally. She spirals out of control and tries to have sex with both Josh and Nathaniel until she eventually ends up sleeping outside Dr. Shin's practice. Paula is getting much worse and when Mrs. Hernandez suggests she may be going through the menopause, Paula goes to the gynecologist - who after hearing her symptoms reveals that she is having a heart attack. Paula has surgery and recovers but is told she needs to make lifestyle changes. At the end of the episode, we see that Rebecca has taken both Dr. Akopian and Dr. Shin's advice and started taking medication. Songs: \"I Hate Everything But You\" (sung by Greg); \"I'm Not Sad, You're Sad\"; \"The Darkness\" Other Rebecca's Line: \"I lived in a wall for eight months!\"\n\n57 13 \"I Have to Get Out\" Stuart McDonald Rene Gube February 8, 2019 ( ) 0.41[62]\n\nWhile Rebecca struggles with acceptance of her need to take anti-depressants, Dr. Akopian shows her that taking medication is completely normal. Meanwhile, at the hospital Paula continues to practice for the bar exam despite still being in recovery and Darryl bonds with a woman named April over bean dip. In the waiting room Josh, Nathaniel, and Greg get exposed to squirrel flu after being coughed on by a young boy and are taken to an isolated ward. Due to a delay, Dr. Roth can't sign Paula out on time to take her bar exam, so Rebecca dresses up as a doctor to get a gurney and sneak Paula out of the hospital. However, due to the fatigue caused by her new medication, she ends up falling asleep on the gurney, and she is subsequently taken to the morgue. After waking up, Rebecca realizes she needs to make a change in her life and that she should try out for a musical she picked up a leaflet for. Elsewhere, tension is building in the ward causing Greg and Josh to start fighting, whilst Nathaniel attempts to mediate. Darryl and April's daughters - Madison and Chloe, respectively - run into each other in the waiting room and it is revealed that they are classmates who have been holding a grudge against one another. After Madison overhears Darryl and April express sadness at not being able to see each other due to their daughter's beef, she conspires with Chloe to enlist Little Cough Boy to cough on them and force them into quarantine together. After sneaking Paula out and getting to watch her be truly happy taking her exam Rebecca realises she should pursue her dream of musical theatre. At the end of the episode Rebecca comes clean to Greg about trying to sleep with Nathaniel and Josh and the pair agree to just be friends. Songs: \"Anti-Depressants are So Not a Big Deal\" (sung by Dr. Akopian, Rebecca, and Ensemble), \"End of the Movie (reprise)\", \"Real Life Fighting is Awkward\" (sung by Adam Schlesinger) Other Rebecca's Line: \"I own 15 ferrets!\"\n\n58 14 \"I'm Finding My Bliss\" Kabir Akhtar Elisabeth Kiernan Averick & Michael Hitchcock March 15, 2019 ( ) 0.31[63]\n\nRebecca prepares for her audition at the community theatre musical revue, and Valencia is disappointed after she expects a proposal from Beth. Valencia decides to audition with Rebecca to avoid going back to New York with Beth. Josh decides to do theater tech for the revue, although this is mainly due to his wanting to spend more time with Rebecca, and after Nathaniel walks in during the audition to give Rebecca legal paperwork related to their work at the jail, the director insists that Nathaniel join the production. Nathaniel agrees, also due to his desire to spend time with Rebecca. Meanwhile, Greg prepares for the soft reopening of his father's Italian restaurant with help from Heather, and Darryl struggles with accepting that Paula is interviewing at other firms who are offering her more money. After the audition, Rebecca gets a comedic song she'd always loved to her delight, but upon examining the lyrics, she is horrified to discover that the song is deeply misogynistic. She makes a few small revisions to the lyrics, but when she presents them to the director, she is insulted and told to perform the song as originally written. At the show's performance, Rebecca is reluctant to perform the original lyrics as they go against her morals, and she wishes that the audience could hear her lyrics. Nathaniel agrees and decides to walk out on stage and sing Rebecca's rewritten version, but the director demands that the curtain be closed before he is able to finish the song. Nathaniel and Rebecca are promptly fired and \"banished\" from the community theater by the director. Nathaniel admits to Rebecca that he really only joined the show to spend time with her, and they almost kiss - a moment Josh witnesses. At Serrano's, Greg is surprised by the soft opening's high turnout, given that he believed the restaurant failed due to \"West Covina turning its back\". Heather reminds him that the restaurant failed because his father was \"a drunk and a terrible businessman\", and that the only reason Greg hated West Covina before leaving for Atlanta was because he hated himself. Greg decides to stay in West Covina and actually open the restaurant for good. Meanwhile, Darryl realizes from a fairly meaningless song in the community theatre performance that he needs to let Paula go if he truly cares about what's best for her. Paula assures Darryl that she'll always be his friend no matter where she's employed. Songs: \"Let Me Be in Your Show\" (sung by Valencia, Tim, and Rebecca), \"Etta Mae's Lament\", \"The Tick Tock Clock\" (sung by the cast), \"I'm the Bride of the Pirate King\" (sung by Valencia), \"Apple Man\" (sung by Tim), \"Etta Mae's Lament\" (revised) (performed by Nathaniel), \"What'll It Be?\" (reprise) (sung by Greg) Other Rebecca's Line: \"I have the Benjamin Button disease! I'm 70!\"\n\n59 15 \"I Need to Find My Frenemy\" Stuart McDonald Alden Derck & Aline Brosh McKenna March 22, 2019 ( ) 0.40[64]\n\nAfter finding out that Josh, Greg, and Nathaniel still have feelings for her, Rebecca is unable to decide between them. With Darryl and AJ's help, she draws columns on a whiteboard at Rebetzel's with positives under each guy, although this doesn't clarify anything for her. Suddenly, she gets a call from Audra Levine's husband that she has abandoned her husband and newborn triplets and is staying in Las Vegas. Meanwhile, Heather, Valencia, and Paula are having lunch and are each complaining about their problems - Heather's frustration with Hector's irresponsibility, Valencia's anger at Beth not proposing, and Paula's inability to afford her new optional work uniform. Rebecca barges in and asks them to search for Audra, and they eagerly agree to go to Vegas so they can distract themselves from their own problems in their lives. Meanwhile, Josh and Nathaniel fight over Rebecca, much to White Josh's entertainment. Songs: \"The Math of Love Quadrangles\" (sung by Rebecca, Josh, Nathaniel and Greg), \"Slow Motion\" (sung by Rebecca, Valencia, Heather, and Paula), \"Slow Motion\" (reprise) (sung by Rebecca, Valencia, Heather, Paula, and Audra), \"JAP Battle\" (reprise) (rapped by Rebecca and Audra) Other Rebecca's Line: \"Asparagus is my enemy!\"\n\n60 16 \"I Have a Date Tonight\" Dan Gregor Erin Ehrlich March 29, 2019 ( ) 0.38[65]\n\nRebecca goes on three dates with Josh, Nathaniel and Greg. Meanwhile, the others decide to gamble on whom Rebecca will pick. Songs: \"Love's Not a Game\" (sung by White Josh and the Cast), \"There's No Bathroom\" (sung by Bernie (\"Weird Al\" Yankovic)), \"Love's Not a Game\" (reprise) Other Rebecca's line: (The hairstylist is combing Other Rebecca's hair, when the real Rebecca walks up and says:) \"See? Perfection is an illusion!\" (to her own hairstylist) \"Oh, did I have a thing? Thank you. I could feel it, right there.\"\n\n61 17 \"I'm in Love\" Aline Brosh McKenna Aline Brosh McKenna & Rachel Bloom April 5, 2019 ( ) 0.50[66]\n\nOn Valentine's Day, following dates with Josh, Nathaniel, and Greg, Rebecca has a dream in which she reunites with Dr. Akopian as a dream ghost who shows her different possible futures depending on who she chooses. While she appears happy in each of them, after the 'dreams' finish she becomes sad. After waking up, she tells Paula about the dream, and enters into one of her musical fantasies. Afterwards, she tells Paula about the musical numbers that take place in her head. Paula suggests she should write down these songs. Afterwards, Rebecca breaks things off with all three of her potential suitors. One year later, Rebecca is at an open mic night with all her friends, most of whom have also found happiness. Valencia and Beth are married, Josh has a new girlfriend, Nathaniel has quit his job as a lawyer and now has a job at the zoo, Darryl is married to April (and having a new baby), Hector and Heather have a new hot tub, but Greg is still single and White Josh's apartment burned down. Rebecca herself is now truly happy, and after a year of songwriting, singing, and piano lessons, she sits down at a piano to give her first public performance. Songs: \"Eleven O'Clock\" (a medley of \"Crazy Ex-Girlfriend Theme\", \"I'm Just a Girl in Love\", \"You Do/You Don't Want to be Crazy\", \"A Diagnosis\", \"The Darkness\", \"We'll Never Have Problems Again\", \"I'm a Good Person\", \"West Covina\", \"You Stupid Bitch\", and \"Eleven O'Clock\"), \"West Covina\" (final reprise) (sung a cappella by Paula and Rebecca)\n\n62 18 \"Yes, It's Really Us Singing: The Crazy Ex-Girlfriend Concert Special!\" Marty Pasetta, Jr. Rachel Bloom & Adam Schlesinger & Jack Dolgen April 5, 2019 ( ) 0.38[66]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7b/Crazy_Ex-Girlfriend_season_4_promotional_poster.jpeg/220px-Crazy_Ex-Girlfriend_season_4_promotional_poster.jpeg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/7/7b/Crazy_Ex-Girlfriend_season_4_promotional_poster.jpeg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/7b/Crazy_Ex-Girlfriend_season_4_promotional_poster.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Crazy_Ex-Girlfriend_(season_4)", "title": "Crazy Ex-Girlfriend (season 4)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/7b/Crazy_Ex-Girlfriend_season_4_promotional_poster.jpeg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}