{"url": "https://people.com/music/justin-timberlake-jessica-biel-love-story-hindsight/", "text": "In his first book, Justin Timberlake reflects on the experiences and people that most inspire him as an artist — including his love story with his wife of six years, Jessica Biel.\n\nTitled Hindsight: & All the Things I Can't See in Front of Me, the singer-songwriter reveals in his book that he and Biel had a meet-cute worthy of any of the rom-coms that they’ve appeared in. He also explains why they dated other people when they first started seeing each other. (We were “keeping ourselves safe from getting hurt,” he writes.)\n\nGet push notifications with news, features and more.\n\n“When I met Jess, it was undeniable how beautiful she is,” Timberlake, 37, writes in Hindsight, out Tuesday. He and The Sinner actress, now 36, met at a party in Hollywood.\n\n“I made some sort of sarcastic comment, really dry,” he explains. “Nobody got it except her. She laughed, and I noticed, all of a sudden, and in the way where you wonder if a person’s like you, if they have a very dry, dark sense of humor, too.”\n\nImage zoom \"Hindsight\" by Justin Timberlake/Harper Design\n\nThough he didn’t ask for her number that night, he kept thinking: “I’m kind of really interested in that girl. There was just something about that girl. Kind of interested in that girl. Goddamn it.”\n\nHe writes, “I had to psych myself up. I had to remind myself that I was me — giving myself a pep talk, shadowboxing with myself, rubbing my own shoulders.”\n\nRELATED: Justin Timberlake Wrote Breakup Anthem ‘Cry Me a River’ in 2 Hours: ‘I’ve Been Scorned’\n\nImage zoom Kevin Mazur/Getty Images for American Express\n\nThey saw each other again when she came to a show during his FutureSex/LoveSounds tour. He offered her and her friends a ride on his tour bus, which is when he finally asked for her number and they started talking, according to the book.\n\nJustin Timberlake Reveals He Weighs in on Jessica Biel’s Footwear Purchases: ‘I Love Women’s Shoes’\n\n“Then the Golden Globes came up, and that’s when we planned on seeing each other,” Timberlake writes. “We were both still seeing other people, keeping ourselves safe from getting hurt, from really putting ourselves out there. It took a bit for both of us to admit to ourselves that we were really, really into each other.”\n\nAfter he came back from touring abroad they spent a month together. Then they decided to be exclusive, according to Hindsight.\n\nRELATED: Jessica Biel Flirts with Husband Justin Timberlake on Instagram — See Her Saucy Comment\n\nImage zoom \"Hindsight\" by Justin Timberlake/Harper Design\n\n“We’ve had a lot of unforgettable times,” Timberlake writes. “She’s become a huge influence on my life, and I have such an admiration for her, especially seeing her as a mother now.”\n\nHe adds, “But I had admiration for her before. She’s a very good writer. She’s a poet. She’s a tremendous actor. She’s funny. Very funny. And she’s one of the most patient people I’ve ever met… She changed me. She changed my life.”\n\nTimberlake and Biel married in Puglia, Italy on Oct. 19, 2012.\n\n“It’s as simple as having someone there to open that pickle jar when you can’t get it open and as complicated as deciding to be in each other’s lives forever,” Biel told PEOPLE in a 2012 interview about marrying Timberlake. “That kind of commitment is very special, and we were ready to jump.”\n\nImage zoom Justin Timberlake and Jessica Biel Todd Williamson/NBC/NBCU Photo Bank via Getty\n\nRELATED: ‘She’s Got My Back’! Justin Timberlake Praises Wife Jessica Biel in Sweet Instagram Post\n\nIn April 2015, the couple welcomed son Silas Randall. According to Timberlake, parenthood has deepened his connection with his wife and influenced his songwriting. (Timberlake writes that his wife, son, and grandfather inspired his latest album, Man of the Woods.)\n\nImage zoom The couple with their 3½-year-old son Silas Randall Jessica Biel/Instagram\n\nDuring an interview on the Today show this past August, Biel reflected on her marriage with Timberlake. According to Biel, the key to a strong marriage is hard work, and the need for commitment never goes away.\n\n“We’re lucky enough to go and stay in different places and live in different places while we work and that’s definitely part [of having a strong marriage],” Biel told Savannah Guthrie, referring to her time traveling the world with Timberlake while on his tour.\n\nRELATED: How Justin Timberlake Found Out Jessica Biel Was Pregnant — and Why He’s Sometimes Jealous of Her Relationship with Silas\n\nImage zoom Silas and Justin Timberlake \"Hindsight\" by Justin Timberlake/Harper Design\n\n“But, honestly, I just really feel like you have to work hard,” Biel shared. “That doesn’t change if you work at home or in an office or you’re on a tour. It doesn’t change, the work doesn’t change.”\n\nTimberlake presented some of his own reflections about their 10 years as a couple in Hindsight. Timberlake writes that, rather than wanting to “be loved for what we are,” the bigger desire is “to be loved for what we aren’t. I think we want to be loved for all our f—ed-up s—.”\n\nRELATED: Paris PDA! Justin Timberlake and Jessica Biel Smooch at Midnight in the City of Love as He Drops Summer Bop ‘SoulMate’\n\nImage zoom \"Hindsight\" by Justin Timberlake/Harper Design\n\n“We should say ‘I will’ instead of ‘I do’ when we get married because people constantly change, both physically and mentally. I’ve watched my wife change,” he writes. “I’ve watched her body change. It’s a temple. It should be worshipped. It should be marveled at. I’m fascinated by her. She’s everything, man.”\n\nHe continues, “She just constantly surprises me with who she is, and who she’s becoming, and I really hope I do the same for her. I’m excited to see what she’s going to do next. I wake up and roll over and look at her, and I’m inspired.”\n\nRELATED: Justin Timberlake Postpones NYC Show Due to ‘Severely Bruised’ Vocal Cords\n\nHindsight is on sale now. Timberlake, who’s currently on vocal rest due to “severely bruised vocal cords,” celebrated the book’s release with a silent Instagram video — including a hat-tip to Love Actually.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjustin-timberlake-hindsight-3-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjustin-timberlake-hindsight-6-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjustin-timberlake-hindsight-1-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fjustin-timberlake1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F02%2Fbiel-timberlake-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fjustin-timberlake-hindsight-2-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg", "keywords": [], "authors": ["Sam Gillette"], "canonical_link": "https://people.com/music/justin-timberlake-jessica-biel-love-story-hindsight/", "title": "Justin Timberlake Reveals How He Fell in Love with Jessica Biel", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Books,Couples,Jessica Biel,Justin Timberlake,Music News,News,Parents", "news_keywords": "Books,Couples,Jessica Biel,Justin Timberlake,Music News,News,Parents", "description": "\"We were both still seeing other people, keeping ourselves safe from getting hurt, from really putting ourselves out there,\" the musician writes in his new book", "og": {"title": "Justin Timberlake Reveals How He Fell in Love with Jessica Biel and Why They Dated Other People", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/justin-timberlake-jessica-biel-love-story-hindsight/", "description": "In his first book, Justin Timberlake reflects on the experiences and people that most inspire him as an artist — including his love story with&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/music/justin-timberlake-jessica-biel-love-story-hindsight/", "description": "\"We were both still seeing other people, keeping ourselves safe from getting hurt, from really putting ourselves out there,\" the musician writes in his new book", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/justin-timberlake-jessica-biel-love-story-hindsight/", "title": "Justin Timberlake Reveals How He Fell in Love with Jessica Biel and Why They Dated Other People", "description": "\"We were both still seeing other people, keeping ourselves safe from getting hurt, from really putting ourselves out there,\" the musician writes in his new book", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fbiel-timberlake-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}