{"url": "https://www.elitedaily.com/p/the-photos-of-meghan-markles-signature-prove-its-gotten-fancier-since-becoming-a-royal-9741622", "text": "A lot changes when you become a duchess, folks. In Meghan Markle's case, she got a new house, new country, new title, new family, and even a new signature. Yup, you read that right. The former American actress-turned-duchess' autograph now comes with 100 percent fancier, more sophisticated loops and lines. This means the Duchess of Sussex's transformation into becoming a full-on Disney Princess is almost complete - hooray! The photos of Meghan Markle's signature before and after becoming a royal show a sweet, delicate change in her penmanship and fans are loving the inside look.\n\nCosmopolitan first picked up on the differences when she signed her name in the President of Ireland Michael Higgins' guestbook during her July 11 trip with Prince Harry. Funnily enough, she and Prince Harry, Duke of Sussex, only signed their first names. I guess President Higgins will remember which Meghan and Harry they are when he reads back through it, but if it were me saving their phone numbers or something I'd have to specify \"Meghan Royal\" and \"THE Prince Harry.\" I'm just that popular and know that many people, I guess.\n\nBelow, you can see a picture of an old signature Harry and Meghan left during a previous visit to Northern Ireland in March. Next to it is Meghan's fancier, more controlled signature in Higgins' guestbook from July on the right.\n\nPool/Getty Images Entertainment/Getty Images & WPA Pool/Getty Images Entertainment/Getty Images\n\nHere is the full dated image from the President's guestbook:\n\nWPA Pool/Getty Images Entertainment/Getty Images\n\nI can just see fans blowing up the graphic and rushing it to their tattoo parlors to get stamped on their bodies now.\n\nSure, she probably took her time signing Higgins' book because it was a whole to-do and everything. But damn, it does look nice. I mean, photographers were there, she had to sit in a fancy chair... yada, yada. Just look at the focus on her face as she puts pen to paper.\n\nPool/Getty Images Entertainment/Getty Images\n\nWhat grace. What poise. No wonder her name turned out so pretty.\n\nThe truth is, Meghan seems to be totally slaying the duchess game. Even with a lengthy background as an American actress, she seems to be seamlessly transitioning into royal life. Take her and Prince Harry's Ireland trip, for example. The two enjoyed hanging out with local Irish families and children and even let one toddler touch their faces. Obviously, it made everyone wonder when Prince Harry and Meghan Markle are going to start a family of their own, a question that doesn't seem to phase them in the slightest.\n\nChris Jackson/Getty Images Entertainment/Getty Images\n\nIn fact, one local woman told People magazine she candidly discussed children with Prince Harry when she met him in person. Elaine Adam-Stewart says she told Prince Harry, \"My husband also has red hair and he gave me five children. When are you and Meghan going to get going?\" According to Adam-Stewart, Prince Harry laughed and responded, \"Five children? — too many.\"\n\nStill, both Meghan and Harry have expressed how excited they are to have a family one day. During their initial interview with BBC, Prince Harry responded to the proposition of having children. He said. \"Of course. You know, one step at a time. Hopefully, we’ll start a family in the near future.\" Also, during their visit to Ireland, Meghan checked out some hypoallergenic baby products. People magazine quoted her as saying, \"I’m sure at some point we’ll need the whole thing.\"\n\nMaybe the next time we see Meghan's signature it will be on a birth certificate? Eh? Eh? Eh? (Just assuming that's how birth certificates work... I literally have no idea. Is it obvious?)\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.elitedaily.com/uploads/image/2018/7/12/02efc411-8e93-4f8c-929c-a3816e016d3f-signature.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.elitedaily.com/uploads/getty/2018/7/12/435963bd-5188-4f10-9708-290ec5fc4509-getty-996039828.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/7d9a1541-86c9-44a6-962f-e116013d37c8-21fecc54-ebbe-42ae-80dd-25bd0df43cf9-getty-930538180.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2018/7/12/ce0bea15-2a6a-4afd-804e-878e4d6fb5ae-getty-996125652.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/8b7f982f-83d4-403e-a59f-032e19f1926c-dsc05523finalsk-copy.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/7/12/22b90c21-3fa0-48e3-8b9c-16c52503f80d-getty-996280606.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/10/b195a297-8adf-49b1-946c-907106bde81d-getty-1095125670.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.elitedaily.com/uploads/getty/2018/7/12/233133da-f413-42cd-82bf-462e828d21c1-getty-996280728.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/7/12/22b90c21-3fa0-48e3-8b9c-16c52503f80d-getty-996280606.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/12/22b90c21-3fa0-48e3-8b9c-16c52503f80d-getty-996280606.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/the-photos-of-meghan-markles-signature-prove-its-gotten-fancier-since-becoming-a-royal-9741622", "title": "The Photos Of Meghan Markle's Signature Prove It's Gotten Fancier Since Becoming A Royal", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/the-photos-of-meghan-markles-signature-prove-its-gotten-fancier-since-becoming-a-royal-9741622", "type": "article", "title": "Here's How Meghan Markle's Signature Has Changed Since Becoming A Duchess", "description": "A lot changes when you become a duchess, folks. In Meghan Markle's case, she got a new house, new country, new title, new family, and even a new signature. Yup, you read that right. The former American actress-turned-duchess' autograph now comes…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/12/22b90c21-3fa0-48e3-8b9c-16c52503f80d-getty-996280606.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "A lot changes when you become a duchess, folks. In Meghan Markle's case, she got a new house, new country, new title, new family, and even a new signature. Yup, you read that right. The former American actress-turned-duchess' autograph now comes…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}