{"url": "https://en.wikipedia.org/wiki/Man_of_the_Woods", "text": "2018 studio album by Justin Timberlake\n\nMan of the Woods is the fifth studio album by American singer-songwriter Justin Timberlake. It was released on February 2, 2018.[3][4] The production of the album was handled by Timberlake, The Neptunes, Timbaland, Danja, J-Roc, Eric Hudson, and Rob Knox. The album sees Timberlake experimenting with elements of R&B, funk, pop, soul, and Americana.[5] The album is named after his son Silas, whose name means \"Man of the forest\".[6] The album's first single \"Filthy\" was released on January 5, 2018, followed by \"Supplies\" and \"Say Something\" on January 19 and 26, respectively. The album track \"Man of the Woods\" was also accompanied by a music video.\n\nThe album debuted atop the US Billboard 200, while \"Filthy\" and \"Say Something\" reached the top 10 on the Billboard Hot 100. To promote the album, Timberlake embarked on his sixth concert tour, The Man of the Woods Tour in March 2018. The single \"Say Something\" received a nomination for Best Pop Duo/Group Performance at the 61st Annual Grammy Awards.[7]\n\nBackground [ edit ]\n\nAfter completing the successful world tour for his previous records The 20/20 Experience and The 20/20 Experience – 2 of 2, Timberlake took a one-year break and later returned to produce the soundtrack for the animated film Trolls in 2016. In a radio interview in May 2016 Timberlake first confirmed working on a new album but without a date set for release yet, \"I think where I grew up in America has a lot of influence – Growing up in Tennessee – very central of the country – Memphis is known as the birthplace of rock & roll, but also the home of the blues, but Nashville's right down the street so there's a lot of country music.\"[8] Timberlake worked with producers Timbaland, Danja, The Neptunes, and Max Martin,[9] and in following interviews he stated, \"It sounds more like where I've come from than any other music I've ever made... It's Southern American music. But I want to make it sound modern – at least that's the idea right now.\"[10] In December 2017, Timberlake's website displayed the logo featuring the letters \"MOTW\".[11] Rolling Stone physical magazine reported that the album would feature a collaboration with singer-songwriter Chris Stapleton.[12] Stapleton and Timberlake previously collaborated in a live performance at the 2015 CMA Awards, with some music publications speculating his next record may be influenced by Southern music.[13][14]\n\nRelease and promotion [ edit ]\n\nTimberlake headlined the Super Bowl LII halftime show at U.S. Bank Stadium in Minneapolis, Minnesota on February 4, 2018.[15] He confirmed via his social media pages that Man of the Woods will be released on February 2, with a video trailer introducing the album and the influence behind it, \"this album is really inspired by my son, my wife, my family, but more so than any album I've ever written–where I'm from.\"[16] The album's lead single, \"Filthy\" was released on January 5 along with the album pre-order.[17] The song was released with a music video, and three additional videos by different directors were released weekly beginning January 18, with \"Supplies\" being the first,[18] followed by the Chris Stapleton-featuring \"Say Something\" and \"Man of the Woods\". He also performed at the 2018 Brit Awards.[19]\n\nTimberlake and the Tennessee Kids on the Man of the Woods tour.\n\nWith the announcement of \"Filthy\", Variety confirmed guest appearances by Stapleton, The Neptunes and Alicia Keys on the album.[20] The cover art was photographed by Ryan McGinley.[21] An exclusive version of the album and its vinyl edition was made available at Target; both were made available for presale the day \"Filthy\" was released.[22] In February, Timberlake opened a pop-up shop in New York City with limited edition merchandise featuring a total of 16 different brand collaborations, each paired with a song, centered on the concept \"country meets streetwear.\"[23][24] Since May 2018, the Museum of Pop Culture's Holodome exhibits a 360°, immersive reality space presentation by Timberlake performing \"Montana\", set in Montana by a lake.[25]\n\n\"Morning Light\", featuring American singer Alicia Keys, was soundtrack of the Brazilian telenovela O Tempo não Para, exhibited by Rede Globo.\n\nAlthough not included on the album, Timberlake released the single, \"SoulMate\" to coincide with the summer leg of The Man of the Woods Tour.[26]\n\nRecording [ edit ]\n\nInitial discussions for the album began several years before the production of the album, between Timberlake and Pharrell Williams. Production was placed on hold for two years, while Timberlake and wife Jessica Biel had their son, Silas. Production began between Timberlake, Williams and Chad Hugo, with the first song for the album being the title-track, which is the Latin translation of Timberlake's son's name.[27] Timberlake had not worked with Williams and Hugo (also known as production duo The Neptunes) after a label dispute with rap group Clipse during Timberlake's time with Jive Records. During an interview with Beats 1's Zane Lowe, Timberlake said: \"It became challenging for him to work with any Jive artist at that point. If I’m being totally honest about it I was extremely hurt being caught up in the middle of it, but at the same time I had a shitload of money stolen, you know, from me by somebody else when I was in the group. I had already gone through legal troubles, and I kind of felt like, you know what, I’m at this point where I feel like I have so much ahead of me, I just don't want to be in the middle of the record label and somebody that, you know, I consider a friend. And so I feel like I kind of just removed myself from the situation.\"[28][29]\n\nAs with FutureSex/LoveSounds, recording sessions for the album were loose and had multiple studios open for work. In one room, Danja and Timbaland worked, Chad Hugo and Pharrell Williams of The Neptunes, worked in another room and producer and member of The Y's, Rob Knox and Eric Hudson worked in another. A direction was not discussed among the production team too much, as Timberlake already had an idea of the direction he wanted the album to take.[30]\n\nIn an interview with Complex, producer Danja spoke of the recording sessions for Man of the Woods, \"We didn't have any conversations about the current state of music and that's what we always do. We go in the studio and just do what we feel. This time around, I just feel like he had more of a direction. Like, when we did FutureSex/LoveSounds, we didn't have any conversations of direction or what's going on in the current state of music. We went in and had fun and made music.\" He also spoke about the vision that Timberlake had for the album: \"I remember walking into the studio, and I'm like, 'So, what's the vibe?' He just raised his hands up like, 'This is the vibe.' And what he had on was a flannel, some Adidas, some jeans. He had his beard and a skully on. That was the vibe.\"[31]\n\nTimberlake's wife, Jessica Biel and his son Silas, have uncredited vocals on a number of songs on the album. Biel appears on the album's lead-single \"Filthy\" and \"Hers (Interlude)\". When sequencing the album, Timberlake felt that \"Filthy\" was \"a palette-cleanser, then we wanted to take you into the forest, take you outside, so I felt like I needed a voice of consciousness\". Timberlake wrote Biel's parts for her, which were subsequently recorded on the Voicenotes iPhone application. Timberlake wanted her to sound like \"the ghost, a presence, but we're following [her]\". The \"Hers (Interlude)\" was recorded after Timberlake mixed the album's eleventh song \"Flannel\".[32][33]\n\nWhen announcing his Man of the Woods Tour, Timberlake revealed the inspiration for both the album and tour came from the outdoors as well as his family, \"The outdoors is the inspiration for a lot of these songs. That's the main idea. The tour will be able to bring the outside in. How can we bring that to life? I want people to see the inspiration for how it ended up sounding. I've never seen that done before: Bring the outside in.\"[34][35]\n\nChris Stapleton (who is featured on the album's third single \"Say Something\") was initially only writing songs with Timberlake, before being asked to sing on the song, \"I really just went out to Los Angeles to write songs with him, it's a very fluid process with him, there's a lot going on. That was one of those things where there wasn't necessarily a plan. He was like ‘All right, you hop in there and take a verse,’ and I’m like, ‘You want me to do what?’ ... It came out great. I had a blast with him, he's a great creative force and one of those guys that if you get a chance to work with him, you should.\". Stapleton also has writing credits on other songs on the album, including the Alicia Keys-featuring \"Morning Light\" and \"The Hard Stuff\" as well as guitar on the lead-single \"Filthy\".[36]\n\nMusic [ edit ]\n\nThe genre of the album incorporates traditional R&B as well as influences from country and funk described as \"...Americana with 808s\".[37] In a second teaser trailer for the album, Timberlake said that the album has a number of influences. \"It's meant to be heard outside even more than inside, I believe. You talk about those, like, Southern guitars and that sound that feels like heritage. That is me exercising my love for where I came from.\"[38] Rolling Stone described most of the album's first half is \"cosmopolitan future-funk,\"[39] while Variety stated the music is funk-soul.[2]\n\nAhead of the album release, Timberlake hosted a listening session with music industry insiders and members of the press. Associated Press commented the album features pop, R&B and electronic tracks.[1]\n\nCritical reception [ edit ]\n\nMan of the Woods received mixed reviews from music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has an average score of 55 based on 29 reviews, indicating \"mixed or average reviews\".[41]\n\nIn Rolling Stone, Christopher R. Weingarten gave the album a positive review, saying \"parts of Man of the Woods are his most exploratory music in years.\"[39] In Variety, Chris Willman expressed \"there are plenty of reasons to like Man of the Woods, not least that it's got a good beat and you can dance to it,\" and concluded \"It's the utterly weird boldness of Timberlake figuratively dragging Pharrell and Danja into the middle of a frosty field that makes the album memorable. This is undeniably the real him right now – funkster, family man, firewalker.\"[2] Jason Lipshutz of Billboard summarized his review saying, \"Man of the Woods is worth exploring, but it's already worth wondering how Timberlake follows it\". Q said \"throughout, Man of the Woods seesaws brilliantly between pop and country.\"[50] Billboard included it among the best 50 albums of the first half of 2018.[51]\n\nMan of the Woods received a B from Entertainment Weekly,[45] while The Guardian and NME gave it three out of five stars.[47] In her review for The A.V. Club, Annie Zaleski said \"At its best, this approach leads to sonic whirlwinds.\"[43] Brock Radke of Las Vegas Weekly deemed it Timberlake's \"most experimental album\" that is \"far from a failure, and that's because its bright spots will accomplish the singular goal of all of Timberlake's music: making non-dancing people get up and dance without remorse or self-consciousness.\" He considered \"Higher, Higher\" the album's best track, and \"Midnight Summer Jam\" a \"throwback soul party a la Earth, Wind & Fire.\"[52] In Exclaim!, Ian Gormely gave the album a 5 out of 10 score, saying that the album is \"immaculately produced and performed\" but also noting that \"sound and feel are no substitute for soul.\"[53] Jamieson Cox of Pitchfork rated the album 3.8/10 and called it \"a huge misstep for the pop star\" as well as \"warm, indulgent, inert, and vacuous\".[49]\n\nCommercial performance [ edit ]\n\nMan of the Woods debuted at number one on the US Billboard 200 with 293,000 album-equivalent units, of which 242,000 were pure album sales, making it the biggest first week of the year at the time,[54] and gave Timberlake his fourth consecutive number-one album in the country.[55] It is also his fourth album to top the Canadian Albums Chart, opening at the country's summit with 18,000 consumption units.[56]\n\nDuring its second chart week, Man of the Woods dropped one spot to number two on the Billboard 200, selling 74,000 total units.[57] In its third chart week, the album remained in the top ten of the Billboard 200, charting at number six and selling 38,000 total units.[58] It fell out of the top ten to number eleven, selling 28,000 total units in its fourth chart week.[59]\n\nIn March 2018, Man of the Woods was certified Gold by the Recording Industry Association of America (RIAA) for sales of over 500,000 album-equivalent units in the US.[60]\n\nIn 2018, Man of the Woods was ranked as the 46th most popular album of the year on the Billboard 200.[61] Timberlake was named Amazon Prime's most streamed artist of the year,[62] as well as the 24th top artist of the year by Billboard.[63] Man of the Woods concluded 2018 as the sixth best-selling album of the year and the 31st most consumed album of the year overall.[64][65]\n\nAs of January 2019, Man of the Woods has sold over 774,000 album-equivalent units in the US, with over 422,000 being pure sales.[66][67]\n\nTrack listing [ edit ]\n\nCredits adapted from liner notes.\n\n^[a] signifies a co-producer\n\nsignifies a co-producer ^[b] signifies an additional producer\n\nSample credits [ edit ]\n\n\"Sauce\" contains a sample from \"Juice vs. Sauce\" by GinoRuss.\n\n\"Livin' Off the Land\" contains an audio sample from the TV show Mountain Men .\n\n. \"Young Man\" contains a sample from \"La La Eh\" from Ashley & Bobby's album It's a Beautiful Day To Play.\n\nPersonnel [ edit ]\n\nCredits are adapted from album’s liner notes.[68]\n\nProduction [ edit ]\n\nExecutive Music Producer: Justin Timberlake\n\nProduced by Justin Timberlake (1, 3, 8-10, 15, 16), Timbaland (1, 9, 16), Danja (1, 3, 9), The Neptunes (Pharrell Williams & Chad Hugo) (2, 4-7, 11-14), Rob Knox (8, 15), Jerome “J-Roc” Harmon (16) Additional Production by Justin Timberlake (2, 4-7, 11-14), Elliott Ives (3), Larrance Dopson (9) Co-Produced by Eric Hudson (8)\n\nAll Vocals Produced and Arranged by Justin Timberlake\n\nEngineered by Chris Godbey (1, 3, 9, 10, 16), Andrew Coleman & Mike Larson (2, 4-7, 11-14), Ben Chang (8, 15) Assisted by Ben Sedano (1, 2, 4-9, 11-16), Jon Sher (2, 4, 6, 7, 11-16), Eric Eylands (2, 4, 11, 14), John Armstrong (2, 5, 12), Tyler Shields (2, 6), Jeremy Miller (2, 6), Sean Klein (3, 10), Funai Costa (5), Martin Giraldo (5), Joshua Harris (5, 12)\n\nMixed by Chris Godbey at Jungle City Studios, NYC Assisted by Sean Klein\n\nMastered by Dave Kutch at The Mastering Palace, NYC\n\nA&R: Andre “Dre” Person\n\nManagement: Rick Yorn and Josh Dembling at LBI Entertainment, and Johnny Wright at Wright Entertainment Group\n\nPersonal Assistant to Mr. Timberlake: Veronica Pinto\n\nBrand Visibility: Louis Muckle and Sonia Muckle at M2M Construction LLC\n\nBusiness Management: Michael S. Dreyer at Dreyer, Robbins & Associates\n\nDigital Team: Brad Margolis, Rachael Yarbrough, Faith-Ann Young\n\nLegal Representation: David Lande, Alicia Winfield Sydney, Mitch Tenzer and Kelly Vallon at Ziffren Brittenhaum LLP\n\nCreative Direction: Trace Ayala & David Cho\n\nPhotography: Ryan McGinley\n\nArt Direction & Design: GrandArmy\n\nGroomer: Christine Nelli\n\nStylist: Annie Psaltaris\n\nStylist Assistant: Dolly Pratt\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Man_of_the_Woods_Tour_-_Miami_-_04.jpg/260px-Man_of_the_Woods_Tour_-_Miami_-_04.jpg", "https://upload.wikimedia.org/wikipedia/en/f/f6/Justin_Timberlake_-_Man_of_the_Woods_%28Official_Album_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f6/Justin_Timberlake_-_Man_of_the_Woods_%28Official_Album_Cover%29.png/220px-Justin_Timberlake_-_Man_of_the_Woods_%28Official_Album_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Chris_Stapleton_May_23%2C_2017.jpg/175px-Chris_Stapleton_May_23%2C_2017.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Alicia_Keys_cropped.jpg/175px-Alicia_Keys_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f6/Justin_Timberlake_-_Man_of_the_Woods_%28Official_Album_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Man_of_the_Woods", "title": "Man of the Woods", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/f6/Justin_Timberlake_-_Man_of_the_Woods_%28Official_Album_Cover%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}