{"url": "https://www.tvinsider.com/716382/nia-jax-interview-wwe-raw-total-divas-season-8/", "text": "Nia Jax is not like most girls and wouldn’t have it any other way. An imposing figure in the ring, the WWE superstar walks confidently down the aisle before every match. The strength she exudes combined with overall self-assuredness have made her a role model for those who might find it difficult to embrace who they are in life.\n\nJax is cognizant of this, which is a reason she signed on to join the Total Divas cast last year. The E! reality series became a way for her to show different sides, even the insecurities. The Raw performer believed it was a chance for audiences to get a better glimpse who she is as a person.\n\nSee Also 5 Dream Matches for WWE's Inaugural All-Women's PPV Event, 'Evolution' We are already thinking of the potential showdowns featuring current WWE female superstars & legends mixing it up for the historic event.\n\n“Coming on to the WWE scene, I was different and bigger than everybody, so everyone didn’t know how to take me,” she said. “I could tell fans were like, ‘Well, she is supposed to be a bad guy. Do we hate her? Do we make fun of her because of her size? She does some cool things the other girls can’t do. Do we cheer that?’\n\n“…I’m bubbly. I ‘m loud. I like to have fun. I am always down for a party, and if there is drama, I like to nip that in the bud. I feel like it opened myself to our current WWE fans to see what my personality was off camera.\n\n\"Then the new fans on Total Divas who see me as a different person. A breath of fresh air and something they don’t see on TV as often. A bigger girl kind of embracing herself and really living life without any apologies. It has been great. I love being part of Total Divas. I love our cast. It’s a different cast this year, but last year I loved the cast as well. I had a great time filming. I feel like this season is probably our best season yet.”\n\nJax could feel a genuine appreciation for her positive message on social media and during appearances. She returned to the plus-sized celebration known as Curvy Con for a second time with fellow Total Divas cast member Nikki Bella, who was the first “straight-sized” women invited to the event. The two took the main stage to discuss body positivity and the importance of supporting each other on their respective journeys.\n\n“It’s a party of encouraging, inspiring women,” Jax said. “It has a lot to do with fashion, but it has a lot to do with encouraging people to be themselves. Last year, I was on such a high from it that I remember talking to Nikki Bella and Brie Bella and saying, ‘You guys need to come here.’ They were starting their Birdiebee line and including plus size.\n\n“I told them they needed to bring a popup shop to Curvy Con because you don’t understand the reach that it has. It’s during New York Fashion Week, which is huge. But the impact that it has on women.\n\n\"This year when I got to do it with Nikki by my side, it was on another level. We got to be on a panel. It was so cute because we were backstage, and Nikki said, ‘I’m so nervous.’ I said, ‘Why would you be so nervous?’ She said it was out of her comfort zone. It was an honor to join such influential people like Venus Williams and Gabourey Sidibe there.”\n\nJax was also grateful to receive a People’s Choice nomination for “Game Changer of the Year\" and recently accepted the Association of National Advertisers' #SeeHer Now Award. Her drive and passion to put good in the world is likened to cousin of Dwayne “The Rock” Johnson. She hopes to continue being an example for season eight of Total Divas. For Jax, having cameras around the second time around during taping was easier.\n\n“I became used to it,” she said. “Even before I was on Total Divas, Total Divas was filming backstage when I was on NXT. I did a Breaking Ground with NXT as well, so I got a little taste of having cameras follow me with the experience of my mom coming to my first-ever wrestling match on TV. It’s pretty easy just because I feel like I’m a pretty cut and dry person.\n\n“You know exactly what you’re getting from me. I don’t change how I am when I’m on camera than when I’m off camera. It was a little different because I was a lot busier this season when I became the women’s champion at WrestleMania.\n\n\"Obviously, when you’re the champion there are a lot more things required of you. My schedule got busy pretty quickly, which I was grateful for. However, with the cameras there you feel like you’re doing three different jobs running at the same time.”\n\nJax is excited for fans to see what winning the title from Alexa Bliss at WWE’s biggest event of the year meant to her. Looking back today, she realizes what a huge impact it had. When they were approached with a storyline revolving around body shaming and best friend backstabbing, Jax recalls Bliss feeling uncomfortable with some of the things that were written.\n\n“I said to her, ‘Look, this is a huge storyline. This is something people go through.’ Not just body shaming, but body image in general that Alexa had to deal with growing up. That I’ve dealt with. I feel like everyone has dealt with this at some point. We had to go in, like really go in on this storyline,” she said.\n\n“We agreed. I told her, ‘Stuff you’re going to say is going to hurt. But at the end of the day I feel like this is going to be a bigger thing that we realize.’ Talking to fans and fans approaching me to tell me how it really touched them. They could relate to what we were going through within the storyline.\n\nSee Also Former WWE Superstar Stu Bennett Building Career Outside the Ring The former Wade Barrett is the leading man in the movie 'I Am Vengeance' and among the hosts of 'Ultimate Beast Master: Survival of the Fittest' on Netflix\n\n\"Then to see everyone stand behind me when I won the title at WrestleMania, it changed my life. It completely made me appreciate everything that we got to do. It made me realize the platform we do have in WWE and the reach it has.\n\n“I’m so grateful we were able to tackle that storyline because it’s something that was real. People need to see it. People were questioning why we were doing this. And saying, ‘How dare they have Alexa say that.’ I sat back saying, ’Yes, let her say those things because this is real life. It happens. We need to tackle it. Young kids watch our product, and they’re going through it.’\n\n\"To be able to see some of their favorite superstars going through it and then being able to relate. I get to beat my bully and win the title at WrestleMania. That’s the biggest moment in my career so far. It’s really cool.”\n\nRather than finding love and a boyfriend, Jax says the season centers more on coming into her own and becoming more independent.\n\n“It’s about winning the women’s championship and buying my first house by myself,” she said. “Welcoming Paige back. That is a huge thing this season. Paige had a pretty rough year before she came back. She made her comeback, got injured again. She had to transform into this amazing general manager. She is just so incredibly talented. I feel like this season you will see a lot of her and I having a lot of fun.\n\n“There is a lot of antics that go on between us. That’s the first thing we do when we get together. It becomes what kind of trouble can we cause, or practical joke can we pull.\n\n\"Now that she is on SmackDown we can’t pull much, but any time there is a combined Pay-Per-View that is what we do. It becomes let’s get together and wreak some havoc. This season I feel like there is a lot of stuff, but my personal favorite is Paige is coming back and everyone gets to see the journey she has gone through. They get to see how strong she is and all the things she had to overcome to get where she is today.”\n\nJax couldn’t be prouder with the recent steps forward taken by WWE for the female roster. She has enjoyed watching the second annual Mae Young Classic. Perhaps scoping out future opponents.\n\n“I saw a little of it because I wanted to hear my Renee [Young] and Beth [Phoenix] on there,” Jax said.\n\n“I’m pretty impressed with Toni Storm. I like her style. The one football marking she puts under her eye. It’s like she is ready to go. She has a cool style about her. It’s so cool to see something like the Mae Young Classic. These women are such a diverse group. I feel like even in WWE it’s the most diverse roster it has ever been.\n\n“Then to see all these other women just kicking butt. These girls are not only working hard in the Mae Young Classic, but they are working year-round and get to showcase it here in WWE and the Network.\n\n\"It’s so cool to watch because it’s not only inspiring us to see what is up-and-coming with the next generation of WWE but inspires us to get better and continue what we are doing. Keep pushing on and break the glass ceilings and break the molds and realize that there is no limit to what we can do.”\n\nOn the horizon is the inaugural all-women’s Pay-Per-View Evolution on October 28. When the announcement was made, she had one dream match in mind.\n\n“I thought it would be cool if me and my cousin Tamina teamed up against Beth and Nattie,” Jax said. “Four powerful women and two powerhouse teams against each other.”\n\nAfter losing the women’s championship earlier in the summer, Jax has been relatively off TV recovering from ailments and training to be back better than ever.\n\nThough viewers didn't have to wait that much longer for the irresistible force to return. She began the comeback on Raw after Hell in a Cell teaming with Ember Moon just in time for the build to the historic all-women's PPV.\n\n“I’ll be at Evolution for sure,” Jax said. “Now people are saying I’m doing so well, I feel I owe it to them to keep it up. The pressure. I got to go get it back from Ronda.”\n\nTotal Divas, Season 8 premiere Wednesday, September 19, 9/8c, E!", "images": ["https://www.tvinsider.com/wp-content/uploads/2018/07/62655_CCM_SmackDown_FoxSports_Art_TV_Announcement_AJ_v2-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "https://www.tvinsider.com/wp-content/uploads/2018/09/NUP_182876_1469-855x570.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/comfort-tv-logo.gif?x=1", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "https://www.tvinsider.com/wp-content/uploads/2018/08/Madison-Rayne-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/08/John-Gold-Outside-Drug-Den-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.tvinsider.com/wp-content/uploads/2018/09/nia-jax-total-divas-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/Bosch-Season-6-304x195.jpg", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/party-of-five-reboot-freeform-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2018/07/image1-1-1014x570.jpeg", "https://www.tvinsider.com/wp-content/uploads/2018/05/Kacy-Catanzaro-WWE-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/03/nia-jax-alexa-bliss-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/whats-on.png"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/09/nia-jax-total-divas-1014x570.jpg", "keywords": [], "authors": ["Scott Fishman", "Meaghan Darwish", "Matt Roush", "Samantha Bergeson", "Meredith Jacobs"], "canonical_link": "https://www.tvinsider.com/716382/nia-jax-interview-wwe-raw-total-divas-season-8/", "title": "Nia Jax on Promoting a Positive Body Image in Her Return to 'Total Divas'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "Jax says the new season of the E! hit centers more on her coming into her own.", "url": "https://www.tvinsider.com/716382/nia-jax-interview-wwe-raw-total-divas-season-8/", "title": "Nia Jax on Promoting a Positive Body Image in Her Return to 'Total Divas'", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/09/nia-jax-total-divas-1014x570.jpg", "width": 1014, "height": 570}}, "theme-color": "#00aeef", "title": "Nia Jax on Promoting a Positive Body Image in Her Return to 'Total Divas'", "description": "Jax says the new season of the E! hit centers more on her coming into her own.", "author": "Scott Fishman", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/716382/nia-jax-interview-wwe-raw-total-divas-season-8/", "title": "Nia Jax on Promoting a Positive Body Image in Her Return to 'Total Divas'", "creator": "@tvinsider", "description": "Jax says the new season of the E! hit centers more on her coming into her own.", "image": "https://www.tvinsider.com/wp-content/uploads/2018/09/nia-jax-total-divas-1014x570.jpg?264", "card": "summary_large_image"}}, "movies": ["https://www.youtube.com/embed/Eob4Td9-bzg", "https://www.youtube.com/embed/E9GfJMwm4KA"], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}