{"url": "http://time.com/money/4991518/georgina-chapmans-net-worth-weinstein-marchesa/", "text": "Georgina Chapman, co-founder of the Marchesa fashion line, saw her label soar to prominence and profits—thanks in some measure to Harvey Weinstein, the rich and powerful movie mogul she married in 2007.\n\nNow that Weinstein has become a pariah, engulfed in allegations of sexual harassment from well over a dozen women including famous actresses like Gwyneth Paltrow, Rose McGowan, and Ashley Judd, it’s widely believed that Chapman’s Marchesa label will suffer a dramatic fall—at least in Hollywood circles.\n\n“No star is ever going to want to wear the brand again,” one publicist told the Hollywood Reporter.\n\nHarvey Weinstein and Georgina Chapman attend a Broadway show in New York in late 2015. Walter McBride—WireImage\n\nThat publicist asked to remain anonymous, and indeed, few sources will speak on the record or make any comment at all about Weinstein, Chapman, or Marchesa. It seems that the Weinstein scandal is so toxic that retailers, Hollywood insiders, and pros in the fashion business don’t want to be linked to it in any way.\n\nIn statements, Weinstein has said that has “behaved with colleagues in the past has caused a lot of pain.” He officially resigned from the production firm he co-founded, the Weinstein Company, this week, and is believed to be seeking treatment in Arizona. A Weinstein spokesperson also said that “any allegations of non-consensual sex are unequivocally denied by Mr. Weinstein,” and “there were never any acts of retaliation against any women for refusing his advances.”\n\nHere’s what we know about what Weinstein has meant for Chapman and her Marchesa label—and how Chapman’s business interests and net worth could be impacted by the revelations about her husband.\n\nGeorgina Chapman’s Net Worth Before Her Split from Harvey Weinstein\n\nRight after the first sexual misconduct allegations surfaced earlier this month, Weinstein said his wife was “100 percent behind me.” But Chapman soon announced she was separating from her husband. “My heart breaks for all the women who have suffered tremendous pain because of these unforgivable actions,” Chapman said in a released statement. “I have chosen to leave my husband. Caring for my young children is my first priority and I ask the media for privacy at this time.”\n\nWeinstein responded to news of the separation by saying that he supports his wife’s decision. “I am in counseling and perhaps, when I am better, we can rebuild,” he said in a statement. “There has been a lot of pain for my family that I take full responsibility for.”\n\nChapman, 41, was born in London and attended the Chelsea College of Art and Design, where she met her future business partner, Keren Craig. The two co-founded Marchesa together in 2004, the same year that Chapman started dating Weinstein, 24 years her senior. Chapman has periodically worked as a model and actress. Marchesa launched a bridal line in 2008, roughly six months after Weinstein and Chapman were married.\n\nGeorgina Chapman prepares a model before Marchesa Bridal Presentation during New York Fashion Week in April. Slaven Vlasic—Getty Images\n\nChapman has an estimated net worth of £15 million, or roughly $20 million, compared to $250 million to $300 million for her husband, Harvey Weinstein. The couple sold a home in Connecticut for $1.65 million in early October, and still own two other oceanfront homes in Connecticut, each assessed at over $7 million. The couple hosted a lavish $38,500-per-person Barack Obama fundraiser in 2012 at their compound in the state.\n\nAnother home owned by Weinstein and Chapman—a 9,000-square-foot waterfront mansion in the Hamptons—was put on the market in August with an asking price of $12.4 million. The couple’s main home is a townhouse in New York City’s West Village, which they purchased for $15 million in 2007.\n\nHow these properties might be divided is a mystery. According to E! News, Chapman and Weinstein signed a prenuptial agreement before getting married in late 2007. The terms of their separation and likely divorce are unknown. “You would anticipate at least the vast majority of the financial side of this to be handled behind closed doors with the business managers,” a family law specialist told E!\n\nIt also remains murky how Chapman’s separation from Weinstein might impact her business interests, including Marchesa. Marchesa has not responded to MONEY’s requests for comment.\n\nActresses Tied to Harvey Weinstein Have Worn Marchesa on the Red Carpet for Years\n\nRenee Zellweger, Jennifer Lopez, Gwyneth Paltrow, Felicity Huffman, Kerry Washington and Jennifer Lawrence all wearing Marchesa. Getty Images (6)\n\nWith red carpet season on the horizon, the choice of designers worn by actresses will demonstrate implicitly how Hollywood feels about Marchesa—and, by extension, Chapman and Weinstein.\n\nTen years ago, the New York Times observed that Marchesa’s designs had enjoyed a “Short Walk to the Red Carpet,” with actresses like Jennifer Lopez and Sienna Miller wearing the previously low-profile label to events like the Golden Globes.\n\nThere was an explanation for why Marchesa was suddenly favored by A-listers: The gossip indicated that Weinstein, who was dating Chapman at the time and had provided funding for the brand, was in the habit of strong-arming actresses tied to his productions into wearing Marchesa dresses.\n\nNow, many signs suggest the gossip was true. Felicity Huffman confirmed that Weinstein said he would not put money behind her film, Transamerica, unless she wore Marchesa on the red carpet. Many other actresses involved in Weinstein-backed films, including Renee Zellweger, Mischa Barton, Cate Blanchett, and Sienna Miller, also appear to have been asked to wear Marchesa during awards season.\n\nAt Least One Marchesa Partnership Has Folded\n\nOn October 5—the same day the New York Times published the first of multiple reports about Weinstein’s alleged sexual misconduct—Helzberg Diamonds announced the launch of a partnership with Marchesa for a line new of diamond engagement rings, priced from $2,499 to $9,499. It was supposed to be called the Marchesa Radiant Star Collection.\n\nSoon, though, around the time that another bombshell story about Weinstein’s alleged harassment was published by the New Yorker, mention of Marchesa disappeared from Helzberg’s website. The Kansas City-based firm, which is owned by Warren Buffett’s Berkshire Hathaway, soon released a short statement, without elaborating, that “the company is not launching the Marchesa brand at this time,” to the Hollywood Reporter.\n\nOne wedding stylist told the New York Post that, generally speaking, the brand’s sales are likely to flail in the wake of the Weinstein scandal, and a fashion publicist said that Marchesa employees are trying to find other jobs. An anonymous retailer also told the Post that some stores will probably stop selling Marchesa products.\n\nHowever, Marchesa dresses and jewelry are still widely available for purchase from major retailers such as Macy’s, Neiman Marcus, and Bergdoff Goodman.\n\nWhile most retailers have chosen not to comment on Marchesa, Chapman, or Weinstein, at least one upscale seller has voiced support for the brand. “Bergdoff Goodman and Marchesa have been longtime partners — we were the first store to pick up the brand when it launched in 2004. We have been avid supporters of Georgina and Keren’s work ever since and hope to continue supporting the brand in the future,” Linda Fargo, a senior vice president for Bergdoff Goodman said recently, according to Women’s Wear Daily.\n\nMore Backlash Against Marchesa and Chapman to Follow?\n\n“We all knew celebrities were asked to wear Marchesa if they were in a Weinstein movie,” the co-owner of a fashion communications company who asked to remain anonymous recently said to the New York Times. “They were supposed to wear it at least once. We all knew that cycle.”\n\nNow, however, with Weinstein powerless and out of the picture, that cycle is broken. It is unclear if Chapman knew about any of the alleged misconduct on the behalf of her husband, but entertainment industry experts say her brand will suffer from guilt by association.\n\nGeorgina Chapman (right) and Harvey Weinstein (center) at a 2016 New York Fashion Week event. Theo Wargo—Getty Images for New York Fashio\n\nWeinstein is “very much a figure who has been a bridge between Hollywood and the fashion worlds. So I think it’s going to be hard to disentangle Marchesa from his image,” Booth Moore, the fashion news director for the Hollywood Reporter, who has covered the Weinstein scandal extensively, explained in an interview with NPR. “I think that people really are voting with their dollars or, you know, really are emotional about the way that they spend money nowadays so that this scandal could affect the fortunes of Marchesa.”\n\nKim Vernon, the president and CEO of the Vernon Co. brand consultancy, told Women’s Wear Daily (WWD) that she “would expect that most of those actresses would distant [sic] themselves from wearing those gowns at their awards and red-carpet events.”\n\nHowever, Vernon still thinks that Marchesa won’t necessarily be dropped by mainstream retailers, and that the brand could still have a promising future even if its dresses are never again regularly worn by stars: “I think they can have a successful business without Hollywood. They do a real business with the Notte second line and a lot of licensed products.”\n\nMarchesa sales might not be affected much in some stores. One retailer spokesperson, who chose to remain anonymous, told WWD that Marchesa sales have been “really fantastic,” and that “our customer really hasn’t connected the dots that he [Weinstein] and she [Chapman] are married.”", "images": ["https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman-2.jpg", "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman-marchesa-celebs1.jpg", "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman-3.jpg", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman.jpg?quality=85", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman-divorce.jpg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman.jpg?quality=85", "keywords": [], "authors": ["Brad Tuttle"], "canonical_link": "https://money.com/georgina-chapmans-net-worth-weinstein-marchesa/", "title": "Harvey Weinstein Could Have a Toxic Effect on Georgina Chapman's Fashion Line. Here's What We Know", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "fashion,georgina chapman,Georgina Chapman net worth,Harvey Weinstein,Hollywood,Marchesa,sexual harassment,Wealth", "news_keywords": "georgina chapman, georgina chapman net worth, georgina chapman marchesa, georgina chapman wedding, georgina chapman husband, marchesa, harvey weinstein, harvey Weinstein and georgina chapman net worth, harvey weinstein marchesa, georgina weinstein", "description": "Georgina Chapman's fashion label, Marchesa, could be impacted by her husband Harvey Weinstein's sexual harassment scandal.", "og": {"title": "Harvey Weinstein Could Have a Toxic Effect on Georgina Chapman's Fashion Line. Here's What We Know", "type": "article", "site_name": "Money", "url": "https://money.com/georgina-chapmans-net-worth-weinstein-marchesa/", "description": "Another blow for Weinstein's wife.", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman.jpg?quality=85", "width": 1024, "height": 626}}, "pinterest": {"url": "https://money.com/georgina-chapmans-net-worth-weinstein-marchesa/", "description": "Georgina Chapman's fashion label, Marchesa, could be impacted by her husband Harvey Weinstein's sexual harassment scandal.", "media": "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/georgina-chapmans-net-worth-weinstein-marchesa/", "title": "Harvey Weinstein Could Have a Toxic Effect on Georgina Chapman's Fashion Line. Here's What We Know", "description": "Another blow for Weinstein's wife.", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2017/10/171019-georgina-chapman.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}