{"url": "https://www.inverse.com/article/43557-janelle-monae-pynk-vagina-pants-vulva-anatomy", "text": "There are many innuendos to the female form in Janelle Monae’s vibrant new video for “PYNK,” but none are quite as explicit as the artist’s artfully rosy “vagina pants.” Ruffled and, well, pink, Monae’s trousers turn her bottom half into the frilled labia of the female genitalia, framing the deep magenta opening blooming between her legs.\n\nSubtlety is not welcome here. These are vagina pants. To rule out the possibility that prudish viewers might mistake them for something less primal — blossoming flowers, perhaps, or an avant-garde tutu — Monae includes a shot of her pal, Thor: Ragnorok actress Tessa Thompson, poking her head out between their lips, like a beautiful adult baby popping through the birth canal (though some have speculated she’s the clitoris). In addition to the pants’ unapologetically loud-and-proud celebration of the female form, what makes them such a refreshing statement is the fact that they’re actually quite anatomically accurate. Despite what the porn industry might suggest, vaginas are complicated and multi-layered — just like these pants.\n\nIn case it wasn't clear, these are vagina pants. Janelle Monae/YouTube\n\nTechnically, these should be called “vulva pants.” The word vagina is often used to refer to what is actually called the vulva, which consists of the whole external shebang: the labia, clitoris, vagina (the actual orifice), and urethra. In turn, the labia — that’s Latin for “lips” — are considered as two separate parts, the labia majora and the labia minora. The former are the outer lips, and the latter are the inner lips closer to the vaginal opening itself.\n\nIf you watch a lot of porn, you might get the idea that the labia — especially the labia minora — are tight, neat bits of skin that are not at all like what Monae’s layered pants suggest. The fact is that all vulvas are different, as experts concerned about unrealistic body image have pointed out. Porn favors vaginas where the labia minora don’t peek out of the labia majora, but in reality, “labial protuberance,” as researchers refer to it, is quite common. And, as Monae’s complicated, beautiful, multi-layered pants suggest, it’s nothing to be ashamed of, either.\n\nA wider shot of Monae and her dancers, some also wearing vulva pants, shows a wide array of labial shapes — some narrow, some more ruffled, some deeper pink than others. The only way she could have improved upon this representation is by showing a wider range of colors: Depending on a person’s coloring, labia can be pink, brown, reddish, or purplish, just like the lips on your face. On Twitter, Monae and Thompson have strongly implied that the dancers who are not wearing vulva pants represent women who do not have vaginas.\n\nIn both the video and lyrics for “PYNK,” Monae shuns the societal reflex to resort to euphemisms. Sure, she winkingly features shots of peeled citrus and oysters, but Monae remains as frank about the female form and sexuality as ever, challenging the rest of us to do the same.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/4/1ed08235-e88a-456c-865b-4861a5e997dc-bed.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/inverse/da/ce/4a/6f/d511/461f/acd5/1b60b043b1d7/janelle-monaes-new-video-for-pynk-shows-her-wearing-vagina-pants-which-accurately-capture-the.gif?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/inverse/d8/e5/f6/04/b0e5/4889/8d74/20fc7f9d2d7e/in-case-it-wasnt-clear-these-are-vagina-pants.png?w=349&h=184.25048169556842&auto=format%2Ccompress&cs=srgb&q=70&fit=max&crop=faces", "https://imgix.bustle.com/uploads/shutterstock/2020/3/19/0a69f761-e689-49d0-a6f8-d60a5504a845-shutterstock-1624563289.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2019/10/30/30d529f0-3aee-4086-b262-c91b0c33c541-3-color-gradient.png?w=1380&h=500&fit=crop&duotone=7f3fa9%2Ca82fd3&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/shutterstock/2020/4/1/6e7ada5f-59a9-471a-8ddd-8a18e7af2beb-shutterstock-1420525580.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/inverse/da/ce/4a/6f/d511/461f/acd5/1b60b043b1d7/janelle-monaes-new-video-for-pynk-shows-her-wearing-vagina-pants-which-accurately-capture-the.gif?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.inverse.com/article/43557-janelle-monae-pynk-vagina-pants-vulva-anatomy", "title": "Janelle Monae's \"PYNK\" Video Teaches Accurate Lesson on Vagina Anatomy", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@inversedotcom", "card": "summary_large_image"}, "og": {"site_name": "Inverse", "url": "https://www.inverse.com/article/43557-janelle-monae-pynk-vagina-pants-vulva-anatomy", "type": "article", "title": "Janelle Monae's \"PYNK\" Video Teaches Accurate Lesson on Vagina Anatomy", "image": {"identifier": "https://imgix.bustle.com/inverse/da/ce/4a/6f/d511/461f/acd5/1b60b043b1d7/janelle-monaes-new-video-for-pynk-shows-her-wearing-vagina-pants-which-accurately-capture-the.gif?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}}, "movies": [], "publish_date": null, "source": "https://www.inverse.com", "summary": ""}