{"url": "https://www.vanityfair.com/hollywood/2018/01/dumbledore-fantastic-beasts-explicitly-gay", "text": "When the cast for Fantastic Beasts: The Crimes of Grindelwald was first announced, with Jude Law set to play a younger, hotter Dumbledore, fans grew excited, imagining boundless possibilities for this dashing new version of the character. Could the film, perhaps, even include a glimpse at the future Hogwarts headmaster’s romantic life—a subject left open-ended by the original Harry Potter books, though J.K. Rowling confirmed after completing the series that Dumbledore was gay?\n\nWell, no. Director David Yates has revealed that for now, Dumbledore’s sexuality will not make it to screen—at least, “not explicitly.”\n\n“But I think all the fans are aware of that,” Yates continued, speaking to Entertainment Weekly. “He had a very intense relationship with Grindelwald when they were young men. They fell in love with each other’s ideas, and ideology, and each other.”\n\nRowling previously teased the idea that eventually, one of the five planned Fantastic Beasts films will address Dumbledore’s sexuality—but it’s unclear when, or how. “Well, I can’t tell you everything I would like to say because this is obviously a five-part story, so there’s lots to unpack in that relationship,” she said at a press conference in 2016. “I will say that you will see Dumbledore as a younger man, and quite a troubled man because he wasn’t always the sage. He was always very clever, but we’ll see what I think was the formative period of his life. As far as his sexuality is concerned, watch the space.” Rowling responded to the recent controversy on Twitter, complaining that she’d been “sent abuse about an interview that didn't involve me, about a screenplay I wrote but which none of the angry people have read, which is part of a five-movie series that's only one instalment in.”\n\nWhat, exactly, are fans to make of this? Rowling first announced that Dumbledore was gay in 2007, while promoting the final book in her original series, Harry Potter and the Deathly Hallows. As she put it to one fan who asked if Dumbledore had ever fallen in love, “I always thought of Dumbledore as gay.” Three Harry Potter films were released after this announcement, but none of them made explicit mention of Dumbledore’s sexuality—understandably, perhaps, since their source material didn’t either. As of now, Dumbledore’s romantic life has been purely the stuff of fan fiction—and apparently, it will remain so for the foreseeable future.\n\nThis approach speaks to a frustrating trend in blockbuster movies, one exemplified by recent films like Power Rangers and Beauty and the Beast. Both movies made headlines by teasing story lines involving explicitly gay characters—or, in the case of Beauty and the Beast, an “exclusively gay moment.” When the movies actually made it to theaters, though, those much-touted scenes amounted to little more than throwaway moments that felt divorced from the rest of the story—blink-and-you’ll-miss-it fragments, rather than true examples of much-needed L.G.B.T. representation. There’s something cynical about explicitly telling L.G.B.T. fans to look out for L.G.B.T. characters—then responding to their attention (and ticket purchases) with weak feints at inclusion, or nothing at all.\n\nAlthough TV continues to make great strides in this arena, film has lagged far behind—and few franchises make that more readily apparent than Fantastic Beasts. Obviously, it’s wrong to write a film off without having seen it—but at the same time, it’s only natural for some fans to feel disappointment at this Dumbledore news. Legions of moviegoers are tired of being teased with the possibility of L.G.B.T. characters, only to have the prospect unceremoniously yanked out from under them. The first Fantastic Beasts already hinged on an obvious gay liberation metaphor involving Ezra Miller’s character, Credence. Why, then, should it bother being coy about Dumbledore’s personal life—especially in a film that essentially pits the character against his terrible ex-boyfriend?\n\nMarketing divisions seem to have figured out already that representation often helps a film’s bottom line; how long will it take for writers and filmmakers to follow suit?", "images": ["https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5a1d8fc336356e1e4aafd1a3/1:1/w_350%2Ch_350%2Cc_limit/depp.jpg", "https://media.vanityfair.com/photos/57b4abd36985b3841292d97a/master/w_1600%2Cc_limit/Daniel-Radcliffe-Post-Harry-Potter-Movies-ss02.jpg", "https://media.vanityfair.com/photos/5a5935acb2571072cf48eb06/1:1/w_350%2Ch_350%2Cc_limit/Radcliffe-Depp.jpg", "https://media.vanityfair.com/photos/5a296d6ef23f9530d4dbacb1/1:1/w_350%2Ch_350%2Cc_limit/Fantastic-Beasts-Johnny-Depp.jpg", "https://media.vanityfair.com/photos/57b4abd36985b3841292d979/master/w_1600%2Cc_limit/Daniel-Radcliffe-Post-Harry-Potter-Movies-ss01.jpg", "https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/16:9/w_1280,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg", "https://media.vanityfair.com/photos/5a722e4878a53e5138c4f584/master/w_2560%2Cc_limit/l-Fantastic-Beasts-Gay-Dumbledore.jpg", "https://media.vanityfair.com/photos/57b4abd451d697ed23e725da/master/w_1600%2Cc_limit/Daniel-Radcliffe-Post-Harry-Potter-Movies-ss03.jpg"], "top_img": "https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/16:9/w_1280,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg", "keywords": [], "authors": ["Laura Bradley", "Laura Bradle", "Joanna Robinso"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/01/dumbledore-fantastic-beasts-explicitly-gay", "title": "Dumbledore Won’t Be Explicitly Gay in Fantastic Beasts 2—but Why?", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Laura Bradley", "copyright": "Copyright (c) Condé Nast 2020", "description": "Director David Yates disappoints fans by saying that Dumbledore’s sexuality will not make it to screen—at least, “not explicitly”—in the upcoming film.", "id": "5a7217c526f2a903d79d2863", "keywords": "movies,fantastic beasts", "news_keywords": "movies,fantastic beasts", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a7217c526f2a903d79d2863", "parsely-metadata": "{\"description\":\"Director David Yates disappoints fans by saying that Dumbledore’s sexuality will not make it to screen—at least, “not explicitly”—in the upcoming film.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/16:9/w_1000,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/1:1/w_1000,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg\"}", "og": {"description": "Director David Yates disappoints fans by saying that Dumbledore’s sexuality will not make it to screen—at least, “not explicitly”—in the upcoming film.", "image": "https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/16:9/w_1280,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg", "site_name": "Vanity Fair", "title": "Dumbledore Won’t Be Explicitly Gay in Fantastic Beasts 2—but Why?", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/01/dumbledore-fantastic-beasts-explicitly-gay"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Director David Yates disappoints fans by saying that Dumbledore’s sexuality will not make it to screen—at least, “not explicitly”—in the upcoming film.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5a722e46b5c7ae1a05e44d07/16:9/w_1280,c_limit/t-Fantastic-Beasts-Gay-Dumbledore.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Dumbledore Won’t Be Explicitly Gay in Fantastic Beasts 2—but Why?"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}