{"url": "https://variety.com/2018/film/reviews/mary-poppins-returns-review-emily-blunt-1203085530/", "text": "Nostalgia is a quaint word, one that summons visions of things that are toasty, comfy, wholesome, reassuring — all qualities, as it happens, that we associate with the 1964 Walt Disney nanny-from-heaven musical “Mary Poppins.” Yet nostalgia can also be a magical thing. It’s the great time machine of human emotion, with the power to turn the past into the present, the present into the past, and time itself into something timeless. “Mary Poppins Returns,” a sequel set 30 years after the first film, isn’t the immortal children’s movie that the singular, luminous, slightly screw-loose Disney original was. Yet it’s a rapturous piece of nostalgia — a film that devotes itself, in every madly obsessive frame, to making you feel happy in the guileless way a movie still could back in 1964.\n\nDirected by Rob Marshall, it’s a lavishly high-spirited and, at times, nearly fetishistic recreation of a ’60s studio-back-lot musical, with cobblestone-streets-of-London sets that look like sets, dance numbers driven by a touch of Gene Kelly athletic-hoofer exuberance, and, more than that, a tone of whimsical sincerity that even the most innocent children’s films of today are a tad too slick and jaded to try for. From the opening moments, when Lin-Manuel Miranda, as Jack the cockney lamplighter, raises his puppy-dog eyes and pure-heart grin to sing “(Underneath the) Lovely London Sky,” you’ll likely find yourself in the grip of the film’s old-is-new, stodgy-is-soulful elation.\n\nThat said, there’s a paradox built into “Mary Poppins Returns.” Nearly everything in the film is designed to evoke a song, a visual flourish, or a story detail from the original “Mary Poppins.” So in more ways than you can count, it’s “just like” the earlier film. But, of course, when you first watched “Mary Poppins” (and I’m old enough to have seen it when it came out — in fact, I saw it five times), you weren’t thinking, “Look! It’s just like that classic we love so much!” Nostalgia, in “Mary Poppins Returns,” is a transporting emotion, yet the movie is as calculated a piece of re-enactment as “The Force Awakens.” Even as it throws off sparkles of sweetness and light and vaudeville fairy dust, the more the movie mimics “Mary Poppins” the less it can be “Mary Poppins.”\n\nBut what it can be is something else: a 1960s movie, cleansed of shadow, improbably delivered into the present day. “Mary Poppins Returns” doesn’t have to replace “Mary Poppins” in our affection to be more than a spoonful of sugar. The movie overflows with delirious good vibes. And the key to what works about it is that it lets you access and celebrate something that’s deeply square. The songs are square (though frankly, while good enough, not nearly as timeless as the Sherman brothers’ classics from the earlier film), the orchestrations are square (and, in fact, brilliantly retro), the plot is square, the whole look of the movie is square, and when Michael Banks (Ben Whishaw), the boy from “Mary Poppins,” now grown up with three children of his own, stands in the attic of the Banks townhouse singing “A Conversation” (addressed to his late wife), the tear that will roll down your cheek is square. This is lump-in-the-throat filmmaking that feels like an antidote to every bad thought you had in 2018.\n\nOf course, many of the children who see “Mary Poppins Returns” will have no knowledge of the original. And it’s a mark of the film’s ingenuity that it will seem enthralling — and, in its way, exotic — to them. It takes panache to make a movie as defiantly corny and stylistically out-of-date as this one and not have it feel stilted, and Marshall has staged “Mary Poppins Returns” with great care and skill; it’s easily the best thing he’s done since “Chicago.” Marshall, in his way, taps deeply into the time-machine spirit of the thing.\n\nSo how is Emily Blunt? Gliding down from the clouds, she’s practically perfect in every way, though let’s be clear that of all the things in the original “Mary Poppins” that can’t be entirely duplicated, the first and foremost is Julie Andrews’ incandescent sparkle of benevolence. Andrews, in her way, may be the most snobbishly underrated movie star of the 20th century, because in just two films (“Mary Poppins” and “The Sound of Music”), she did more to turn goodness into a mythological force than any actress since Lillian Gish. Emily Blunt has a slightly more acerbic presence. Her Mary possesses the same tartly irresistible combination of qualities we remember: She’s an angel, a disciplinarian, a devotee of the imagination, a tutor of delight, and also a bit vain (she spends a little more time than she should throwing glances at mirrors).\n\nBut Andrews had a smile that lit up the world, and Blunt, in her gleeful and slightly devious way, is more circumspect; you would much more want to see the soap opera of this Mary Poppins’ life (and could, in fact, imagine it existing). Yet Blunt inhabits Mary Poppins’ snappishly entrancing spirit, and in the musical numbers she generates her own spit-spot radiance. She initiates the Banks children into the world of imagination by inviting them to dive into the bathtub and out the other side (resulting in a snazzy underwater fantasia), and the film gets totally rolling when she, Jack, and the kids literally enter the surface of their mother’s cracked decorative bowl, leading to an updated version of the live-action-meets-drawn-cartoon sequence of “Mary Poppins,” which is wonderfully executed here, hitting that same note of colliding daffiness.\n\nJust about every song in “Mary Poppins Returns” has a 1964 antecedent. “Can You Imagine That?,” the bathtub-into-the-ocean number, echoes “A Spoonful of Sugar,” and once the characters arrive in animation land the tongue-twisting “The Royal Doulton Music Hall” is the film’s nod to “Supercalifragilisticexpialidocious.” Later on, the lamplighters join in a ladder-and-torch chorus of “Trip a Little Light Fantastic” that’s the film’s equivalent to “Step in Time,” and the finale, “Nowhere to Go But Up,” is “Let’s Go Fly a Kite” with human-levitating balloons. Meryl Streep, in a triumphant scene, shows up as Mary’s cousin, who resembles a gypsy version of the Mad Hatter and sings a song called “Turning Turtle” in a voice that sounds like Madame Blavatsky meets “Fiddler on the Roof.” Now that’s showbiz.\n\nThe story has an elegant heart-tug simplicity. Michael, an aspiring artist who’s been working as a bank teller at Fidelity Fiduciary and raising his kids with the help of his sister, Jane (Emily Mortimer), learns that the Banks house along the cozy half circle of Cherry Tree Lane is about to be repossessed. The home-equity loan he took out needs to be paid back in five days, and Michael’s only hope is to find the lost record of the bank shares his father got for him. (Colin Firth, as the dastardly and secretly smirking Fidelity executive Mr. Wilkins, pretends to help.) So this is yet another tale of “saving Mr. Banks.” Except that Whishaw’s Michael, who rather disarmingly resembles Charlie Chaplin, is a softie who turns into a hard case only because he’s terrified of losing everything.\n\nAt two hours and 10 minutes, “Mary Poppins Returns” is a bit long, yet just when you think it’s flagging, which for me was during the “Trip a Little Light Fantastic” number (sorry, but I never loved “Step in Time” that much either), Marshall pulls it all together with a sensational sequence in which Jack and his fellow leeries scale Big Ben to slow down the clock by five minutes. When Miranda’s Jack is hovering over the city, and Mary comes to the rescue via her umbrella, the entire movie soars. And that’s before Dick Van Dyke shows up for a cameo sharp enough to remind you of the life force he was in “Mary Poppins.” “Mary Poppins Returns” never stops looking back. That’s the film’s essential quality — its majestic cornball MO. Yet in recreating, with so much meticulous love, the sensory and emotional contact high of “Mary Poppins,” the movie does something that points forward instead of back. It says: What if we could actually feel this way now? Maybe we could come out the other side.", "images": ["https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=681&h=383&crop=1", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Freviews%2Fmary-poppins-returns-review-emily-blunt-1203085530%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1203085530&comment_count=25", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=1000", "keywords": [], "authors": ["Owen Gleiberman"], "canonical_link": "https://variety.com/2018/film/reviews/mary-poppins-returns-review-emily-blunt-1203085530/", "title": "Film Review: ‘Mary Poppins Returns’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Emily Blunt is practically perfect in a 'Mary Poppins' sequel that uncannily recreates the studio-system sincerity of the original.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1203085530, "author": "Owen Gleiberman", "pmc-category": "Reviews", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-12-12T09:00:46"}, "pmc-tag": "Emily Blunt,Lin-manuel Miranda,Mary Poppins,Mary Poppins Returns", "title": "Film Review: ‘Mary Poppins Returns’", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Reviews", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Film Review: ‘Mary Poppins Returns’", "url": "https://variety.com/2018/film/reviews/mary-poppins-returns-review-emily-blunt-1203085530/", "description": "Nostalgia is a quaint word, one that summons visions of things that are toasty, comfy, wholesome, reassuring — all qualities, as it happens, that we associate with the 1964 Walt Disney nanny-from-h…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=1000", "width": 1000, "height": 562, "alt": "Mary Poppins (Emily Blunt) returns to the Banks’ home in Disney’s original musical, MARY POPPINS RETURNS, a sequel to the 1964 MARY POPPINS  which takes audiences on an entirely new adventure with the practically perfect nanny and the Banks family."}, "locale": "en_US"}, "article": {"published_time": "2018-12-12T17:00:46+00:00", "modified_time": "2018-12-19T17:22:20+00:00"}, "twitter": {"creator": "@OwenGleiberman", "site": "@variety", "text": {"title": "Film Review: ‘Mary Poppins Returns’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=1000", "alt": "Mary Poppins (Emily Blunt) returns to the Banks’ home in Disney’s original musical, MARY POPPINS RETURNS, a sequel to the 1964 MARY POPPINS  which takes audiences on an entirely new adventure with the practically perfect nanny and the Banks family."}, "card": "summary_large_image", "title": "Film Review: ‘Mary Poppins Returns’", "description": "Emily Blunt is practically perfect in a 'Mary Poppins' sequel that uncannily recreates the studio-system sincerity of the original."}, "author": "Owen Gleiberman", "content_type": "Article", "post_id": 1203085530, "title": "Film Review: 'Mary Poppins Returns'", "published_at": "2018-12-12 09:00:46", "image": "https://pmcvariety.files.wordpress.com/2018/03/mary-poppins-returns-teaser.jpg?w=1000", "comment_count": 25, "tags": "Mary Poppins Returns", "topics": "Reviews", "appeared_in_print": "No", "body": "Nostalgia is a quaint word, one that summons visions of things that are toasty, comfy, wholesome, reassuring — all qualities, as it happens, that we associate with the 1964 Walt Disney nanny-from-heaven musical \"Mary Poppins.\" Yet nostalgia can also be a magical thing. It’s the great time machine of human emotion, with the power to turn the past into the present, the present into the past, and time itself into something timeless. \"Mary Poppins Returns,\" a sequel set 30 years after the first film, isn’t the immortal children’s movie that the singular, luminous, slightly screw-loose Disney original was. Yet it’s \r\n\r\nDirected by Rob Marshall, it's a lavishly high-spirited and, at times, nearly fetishistic recreation of a '60s studio-back-lot musical, with cobblestone-streets-of-London sets that look like sets, dance numbers driven by a touch of Gene Kelly athletic-hoofer exuberance, and, more than that, a tone of whimsical sincerity that even the most innocent children’s films of today are a tad too slick and jaded to try for. From the opening moments, when Lin-Manuel Miranda, as Jack the cockney lamplighter, raises his puppy-dog eyes and pure-heart grin to sing \"(Underneath the) Lovely London Sky,\" you'll likely find yourself in the grip of the film’s old-is-new, stodgy-is-soulful elation.\r\n\r\nThat said, there’s a paradox built into \"Mary Poppins Returns.\" Nearly everything in the film is designed to evoke a song, a visual flourish, or a story detail from the original \"Mary Poppins.\" So in more ways than you can count, it’s \"just like\" the earlier film. But, of course, when you first watched \"Mary Poppins\" (and I’m old enough to have seen it when it came out — in fact, I saw it five times), you weren’t thinking, \"Look! It’s just like that classic we love so much!\" Nostalgia, in \"Mary Poppins Returns,\" is a transporting emotion, yet the movie is as calculated a piece of re-enactment as \"The Force Awakens.\" Even as it throws off sparkles of sweetness and light and vaudeville fairy dust, the more the movie mimics \"Mary Poppins\" the less it can be \"Mary Poppins.\"\r\n\r\nBut what it can be is something else: a 1960s movie, cleansed of shadow, improbably delivered into the present day. \"Mary Poppins Returns\" doesn’t have to replace \"Mary Poppins\" in our affection to be more than a spoonful of sugar. The movie overflows with delirious good vibes. And the key to what works about it is that it lets you access and celebrate something that's deeply square. The songs are square (though frankly, while good enough, not nearly as timeless as the Sherman brothers' classics from the earlier film), the orchestrations are square (and, in fact, brilliantly retro), the plot is square, the whole look of the movie is square, and when Michael Banks (Ben Whishaw), the boy from \"Mary Poppins,\" now grown up with three children of his own, stands in the attic of the Banks townhouse singing “A Conversation” (addressed to his late wife), the tear that will roll down your cheek is square. This is lump-in-the-throat filmmaking that feels like an antidote to every bad thought you had in 2018.\r\n\r\nOf course, many of the children who see \"Mary Poppins Returns\" will have no knowledge of the original. And it’s a mark of the film’s ingenuity that it will seem enthralling — and, in its way, exotic — to them. It takes panache to make a movie as defiantly corny and stylistically out-of-date as this one and not have it feel stilted, and Marshall has staged \"Mary Poppins Returns\" with great care and skill; it’s easily the best thing he’s done since \"Chicago.\" Marshall, in his way, taps deeply into the time-machine spirit of the thing.\r\n\r\nSo how is Emily Blunt? Gliding down from the clouds, she’s practically perfect in every way, though let’s be clear that of all the things in the original \"Mary Poppins\" that can’t be entirely duplicated, the first and foremost is Julie Andrews’ incandescent sparkle of benevolence. Andrews, in her way, may be the most snobbishly underrated movie star of the 20th century, because in just two films (\"Mary Poppins\" and \"The Sound of Music\"), she did more to turn goodness into a mythological force than any actress since Lillian Gish. Emily Blunt has a slightly more acerbic presence. Her Mary possesses the same tartly irresistible combination of qualities we remember: She’s an angel, a disciplinarian, a devotee of the imagination, a tutor of delight, and also a bit vain (she spends a little more time than she should throwing glances at mirrors).\r\n\r\nBut Andrews had a smile that lit up the world, and Blunt, in her gleeful and slightly devious way, is more circumspect; you would much more want to see the soap opera of this Mary Poppins’ life (and could, in fact, imagine it existing). Yet Blunt inhabits Mary Poppins’ snappishly entrancing spirit, and in the musical numbers she generates her own spit-spot radiance. She initiates the Banks children into the world of imagination by inviting them to dive into the bathtub and out the other side (resulting in a snazzy underwater fantasia), and the film gets totally rolling when she, Jack, and the kids literally enter the surface of their mother’s cracked decorative bowl, leading to an updated version of the live-action-meets-drawn-cartoon sequence of \"Mary Poppins,\" which is wonderfully executed here, hitting that same note of colliding daffiness.\r\n\r\nJust about every song in \"Mary Poppins Returns\" has a 1964 antecedent. \"Can You Imagine That?,\" the bathtub-into-the-ocean number, echoes \"A Spoonful of Sugar,\" and once the characters arrive in animation land the tongue-twisting \"The Royal Doulton Music Hall\" is the film’s nod to “Supercalifragilisticexpialidocious.” Later on, the lamplighters join in a ladder-and-torch chorus of “Trip a Little Light Fantastic” that’s the film’s equivalent to “Step in Time,” and the finale, “Nowhere to Go But Up,” is “Let’s Go Fly a Kite” with human-levitating balloons. Meryl Streep, in a triumphant scene, shows up as Mary’s cousin, who resembles a gypsy version of the Mad Hatter and sings a song called “Turning Turtle” in a voice that sounds like Madame Blavatsky meets \"Fiddler on the Roof.\" Now that’s showbiz.\r\n\r\nThe story has an elegant heart-tug simplicity. Michael, an aspiring artist who's been working as a bank teller at Fidelity Fiduciary and raising his kids with the help of his sister, Jane (Emily Mortimer), learns that the Banks house along the cozy half circle of Cherry Tree Lane is about to be repossessed. The home-equity loan he took out needs to be paid back in five days, and Michael’s only hope is to find the lost record of the bank shares his father got for him. (Colin Firth, as the dastardly and secretly smirking Fidelity executive Mr. Wilkins, pretends to help.) So this is yet another tale of \"saving Mr. Banks.\" Except that Whishaw’s Michael, who rather disarmingly resembles Charlie Chaplin, is a softie who turns into a hard case only because he’s terrified of losing everything.\r\n\r\nAt two hours and 10 minutes, \"Mary Poppins Returns\" is a bit long, yet just when you think it’s flagging, which for me was during the \"Trip a Little Light Fantastic\" number (sorry, but I never loved \"Step in Time\" that much either), Marshall pulls it all together with a sensational sequence in which Jack and his fellow leeries scale Big Ben to slow down the clock by five minutes. When Miranda’s Jack is hovering over the city, and Mary comes to the rescue via her umbrella, the entire movie soars. And that’s before Dick Van Dyke shows up for a cameo sharp enough to remind you of the life force he was in \"Mary Poppins.\" \"Mary Poppins Returns\" never stops looking back. That’s the film’s essential quality — its majestic cornball MO. Yet in recreating, with so much meticulous love, the sensory and emotional contact high of \"Mary Poppins,\" the movie does something that points forward instead of back. It says: What if we could actually feel this way now? Maybe we could come out the other side.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1544634046.0, "source": "https://variety.com", "summary": ""}