{"url": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-reunion-katie-apologizes-to-lala-w474845/", "text": "Raise your glasses high! The cast of Vanderpump Rules gathered together to relive the Bravo series’ pre-wedding drama for the first part of the season 5 reunion special on Monday, April 3.\n\nThe Bubbas’ Wedding Bliss\n\nIt’s no secret that this season was bigger and better than ever before — so big, in fact, that host Andy Cohen was forced to hold the reunion at a studio in downtown Los Angeles instead of at Sur. “We normally do this at Sur, but we had to move out!” Andy laughed, gesturing to the visibly tense cast mates.\n\nAndy wasted no time jumping into wedding talk. He prompted Katie Maloney and Tom Schwartz to give an update on their married life, and Schwartz immediately responded with a cringeworthy dad joke: “They say there’s three rings,” he began. “There’s the engagement ring. There’s the wedding ring. And then there’s suffering.” Ha ha?\n\nStassi Schroeder revealed that actually she crashed the Bubbas’ honeymoon — but Jax Taylor and Brittany Cartwright somehow one-upped Stassi by moving into the same apartment complex as Tom and Katie. “I was not happy about it,” the newly married Katie stated flatly. “I don’t want this to be like a dorm situation!”\n\nJax Stands by Sex Rumor\n\nSeason 5 opened with a steamy sex rumor involving Brittany and Kristen Doute, and it was started by none other than Jax himself. Nearly a year later, Jax continued to stand by his story.\n\n“I was in shock,” he insisted. But Brittany and Kristen adamantly denied the rumored hookup. “I did not go down on Brittany,” Kristen swore as Brittany shook her head in agreement. “Didn’t happen.”\n\nBrittany told Andy that she and Kristen had just shared a “stupid kiss,” but Jax demanded to know why the girls were fully naked if all they did was just exchange a quick peck. James Kennedy remarked that he believed Jax was telling the truth (for once). “I just think Kristen likes getting with people while her boyfriend’s in the other room,” James sneered. “Third time’s a charm.”\n\nScheana Denies Having “Prenup Remorse”\n\nShifting back to the wedding buzz, Andy asked Lisa Vanderpump if she agreed with Tom and Katie’s decision to draft a prenup before tying the knot. “Good business, or bad romance?” he questioned the happily married Sur boss.\n\n“I don’t see what they had to share,” Lisa responded. “They were arguing over 50 bucks!”\n\nScheana Shay made the mistake of mentioning on the show that she would never get a prenup — and now she’s going through a nasty divorce from husband Mike Shay. Andy asked if she regretted foregoing a prenup, but she surprisingly did not.\n\n“At the time, it did seem like it would put a slight damper on how happy we were,” Scheana said. Before their wedding, Scheana felt that she didn’t have much to risk financially, and unfortunately she never thought divorce would be in her future.\n\n“Well, I would’ve had a prenup if I’d been marrying Shay,” Lisa interrupted her. “Let’s be honest. He didn’t pull his weight in the relationship.” Lisa said she knew exactly how much she would’ve left him: “Diddly squat.”\n\nJames Slams Cheating Accusations\n\nThroughout season 5, James was confronted multiple times about cheating on his girlfriend, Raquel Leviss. The DJ continued to deny sleeping with his former Sur coworker Gigi. “I’ve heard from someone who was close to Gigi for a short time that she said she would fight or f–k anyone to get in this group,” Ariana Madix offered, suggesting that Gigi might’ve purposely spread those rumors just to get herself involved in the show.\n\nWhen Andy brought up the fact that another Sur employee actually had photo proof that she had slept with James, the DJ stubbornly concluded that the photo was edited. The cast decided to elect Kristen to do a full investigation into the situation, which gave James the perfect opportunity to point out that Kristen had literally slept with every single guy on one side of the room (Jax, James and Tom Sandoval conveniently sat in a row). “Am I the only guy who hasn’t had sex with Kristen?” Andy asked, bewildered.\n\nLala Confronts the Cast\n\nAfter being MIA for most of the season, Lala Kent made an unexpected appearance at the reunion. Andy jumped at the chance to question Lala about the digs she made toward her former castmates throughout her run on the show. She admitted that she said horrible things just to tear down the other girls, but Sandoval refused to let Lala take full responsibility for the cast’s division. “You guys attacked her first!” he barked at Stassi, Kristen, and Katie.\n\nLala told Andy that the way the trio treated Scheana was also an issue. Scheana finally piped up and confessed that she was hurt that Stassi called her anorexic. But per usual, Stassi brushed off Scheana’s concerns and simply told her to go to Taco Bell.\n\nScheana insisted that the girls made her “nervous,” which prompted Stassi, Kristen and Katie to freak out on her. James noted that Stassi was clearly the ringleader of the three ladies, but Lala felt it was Katie who was the “mean girl.” But rather than jump down Lala’s throat, Katie actually put a stop to the heated argument with a “sorry.”\n\n“I don’t like to sling insults,” Katie told Lala in a heartfelt apology. “That was an ugly moment for me to watch. I 100 percent apologize for saying that, because I was very stubborn this summer, especially toward you.” Katie explained she wasn’t at a good place this summer — emotionally, physically and relationship-wise. She admitted that she wrongfully took it out on Lala.\n\nUpon hearing Katie’s apology, Lala instantly burst into tears. “I’ve waited a long time for just one of them say, ‘I’m sorry for hurting your feelings.’ You have no idea. That means the world to me,” she said.\n\nVanderpump Rules airs on Bravo Mondays at 9 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-c3800a9d-5572-40a5-a73c-e688d0f3622c.jpg?crop=1px%2C286px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-42caf5c6-6356-4c4b-8727-8a7f6811e805.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-c3800a9d-5572-40a5-a73c-e688d0f3622c.jpg?crop=1px%2C286px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Maria Fischer"], "canonical_link": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-reunion-katie-apologizes-to-lala-w474845/", "title": "'Vanderpump Rules' Reunion: Katie Apologizes to Lala", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Katie Maloney took a step toward making amends with Lala Kent on Vanderpump Rules' Monday, April 3, season 5 reunion — read Us Weekly's recap", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Pump Rules' Reunion: Katie Apologizes to Lala, Scheana Talks Prenups", "description": "Katie Maloney took a step toward making amends with Lala Kent on Vanderpump Rules' Monday, April 3, season 5 reunion — read Us Weekly's recap", "url": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-reunion-katie-apologizes-to-lala-w474845/", "site_name": "Us Weekly", "updated_time": "2017-12-07T03:10:53+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-c3800a9d-5572-40a5-a73c-e688d0f3622c.jpg?crop=1px%2C286px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-c3800a9d-5572-40a5-a73c-e688d0f3622c.jpg?crop=1px%2C286px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "section": "Entertainment", "published_time": "2017-04-05T14:01:00+00:00", "modified_time": "2017-12-07T03:10:53+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Katie Maloney took a step toward making amends with Lala Kent on Vanderpump Rules' Monday, April 3, season 5 reunion — read Us Weekly's recap", "title": "'Pump Rules' Reunion: Katie Apologizes to Lala, Scheana Talks Prenups", "site": "@usweekly", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/nup_177192_0357_andy-cohen-vanderpump-rules-zoom-c3800a9d-5572-40a5-a73c-e688d0f3622c.jpg?crop=1px%2C286px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1491400860.0, "source": "https://www.usmagazine.com", "summary": ""}