{"url": "https://www.biphoo.com/celebrity/madonna/news/zac-efron-jokes-about-flirting-with-madonna", "text": "Madonna Biography\n\nThere are these certain people on this earth who are irreplaceable and their aura is charismatic. There is this singing sensation who has been entertaining us with her work for over years now. Madonna is an amazing singer, songwriter, actress and now a business woman too. Yes, you are absolutely right we are talking about Madonna. She has been an incredible artist of all times who has given us numerous reasons to lover her.\n\n\n\n\n\nMadonna Personal Life Specification | Academy and Scholarship Specification | Music and Dance Specification |\n\n\n\n\n\nMadonna was born in a Catholic family to Silvio Anthony ‘Tony’ Ciccone and Madonna Louise Fortin on August 16, 1958, in Bay City of Michigan. Her father had an ancestry from Italy while her mother had French Canadian ancestry. Her father was working as an engineer at General Motors. Madonna was having the same name as her mother’s so she was nicknamed as ‘Little Nonni’. In 1966 she was confirmed in the Catholic Church and she changed her name to Veronica. Madonna used to reside in the Detroit suburbs of Pontiac. Her mother died at the age of 30 of breast cancer and she noticed that she was having some changes in her behavior and life. She was not able to grasp the fact that her mother is gone now. In 1966, her father married the family housekeeper Joan Gustafson with whom he had 2 children named Jennifer and Mario. She did not like her father for marrying another woman and always rebelled him for this very reason. She went to Rochester Adams High School where she was a star student and also a member of the cheerleading squad. When Madonna finished her graduation she got a scholarship at University School of Michigan of Music, Theatre, and Dance.\n\n\n\n\n\n\n\n\n\n\n\nMadonna also took the ballet lessons and convinced her father to allow her to take these lessons. In 1978 she thought of dropping the college and moved to New York City which was a big move. As Madonna did not have a lot of money so she took a part-time job at Dunkin Donuts and with the modern dance troupes, she also took classes at Alvin Ailey Dance Theatre and performed with Pear Lang Dance Theatre. She once said that when she moved to New York, it was the first time she boarded a plane; it was the first time she took a taxi cab and came here with just $35 in hands. Madonna used to perform as a backup artist with many artists. There was this time when she was performing as a backup singer and dancer for Patrick Hernandez at his world tour she became romantically attracted and got involved with Dan Gilroy and they started living in Corona, Queens. In 1980 it was the first time that they performed together as a rock band in which she sang and played guitar and drums. The band was known as The Breakfast Club, later she left the club with her former boyfriend Stephen Bray as a drummer and formed a new band named Emmy. Their music was able to impress the DJ and the music producer Mark Kamins who arranged a meeting between Madonna and the Sire Records founder. Thus she was always a star and was just waiting for her breakthrough to arrive.\n\n\n\n\n\nMadonna Career | Controversies & Relationships | MTV Music and video Awards | Best Album\n\n\n\n\n\nIn 1982, Madonna signed her deal with Sire and her first single was released in 1982 named everybody and the second was Burning Up which came up in March 1983. Both were successful hits in the United States and were able to book the spots in the hot dance club songs and Billboard magazine as well. Just after this success, she started working on her debut album Madonna with Reggie Lucas of Warner Bros. she was not completely satisfied with Lucas’s way of working and the completed tracks so she tried to seek help from someone else.\n\n\n\n\n\n\n\n\n\nAfter some time Madonna moved in with her boyfriend John ‘Jellybean’ Benitez and asked him to help her complete the album. He remixed the tracks and they released her third single Holiday which was again a hit in the international markets as well. She also became the fashion trendsetter of the 1980s as her sense of fashion, her clothes, and style used to inspire young girls and women all over the world. She gained a prominent recognition after the success of her second album named Like a Virgin which was able to be on the top of all the billboards for consecutively 6 weeks. A controversy arrived when certain organization caught their attention on the subject of addressing premarital sex as inappropriate. She was also criticized for her performance of Like a Virgin at MTV Music Video Awards wearing a wedding dress. Her next top hit was Material Girl and she promoted it doing the Marlin Monroe’s style of her song Diamonds are a girl’s best friends. Like a Virgin was certified as a diamond album and sold 21 million copies that year. Madonna appeared in movies in 1985 with appearing as a singer in Vision Quest which was a romantic drama and she had her 2 soundtracks in that movie. Madonna went on Virgin Tour with Beatle Boys performing as an opening act. That tour was a great hit of her career.\n\n\n\n\n\nMadonna Academy Awards | Magazines and Newspapers | 4th Music Album | Top 100 Billboards\n\n\n\n\n\n\n\nIn June 1986 she released her third album True Blue dedicated to Sean Penn. The three singles from the album were able to make it on the Billboard 100. People for magazines and newspapers were all over her for her success. The album was sold worldwide and it was on the top list of 28 countries that year. The very next year Madonna acted in a movie name who’s that girl and had 4 soundtracks of her own in that film. In 1989 she signed her deal for endorsing a soft drink brand Pepsi and while the advertisement was played it had a soundtrack Like a Player the video featured many Catholic religious symbols so the religious groups began to rebel and boycott the brand. Then the brand canceled their contract with her and also revoked the sponsorship. Then her 4th music album became Like a player for which Madonna got a huge positive response from the critics and fans as well. The album had sold 4 million copies in the US and was on the top 200 billboards. Her song Sooner or Later won her the Academy Awards for best original song in 1991. She also won a Grammy in 1992 for Best Long Form of Music.\n\n\n\n\n\n\n\n\n\nIn 1992, Madonna acted in the film A League of Their Own and she had a soundtrack to perform in that movie which was at the top of the Billboard 100 that year. The very year she launched her own company named Maverick which consisted of a record company, music Production Company, and film production company and associated music publishing, TV broadcasting, book publishing and several other divisions. It was a joint business venture with Time Warner. The first release that was out from this venture was her first book with a title Sex. At the same time, she announced the release of her next album The Erotica. One of its tracks managed to be number 3 on the top 100 billboards. In 1996, she played the role of Eva Peron which she had always wanted to play in the Evita. It was considered as one of the best performances of all the cast and Madonna won a Golden Globe Award for the same for best Actress. On October 14, 196 she became a mother to a beautiful daughter Lourdes Maria Ciccone with Leon.\n\n\n\n\n\n\n\n\n\nIn 1988 Madonna released her album The Ray of Light which had completely changed her image by then. The critics said that this album was one of the greatest masterpieces of the 90s. It was nominated for both Alba of the year and record of the year as well. This album earned a lot of business worldwide as it had sold 16 million copies globally. Madonna played a music violin teacher in the movie Music of the Heart and the soundtracks of that movie won the Grammy that year. Madonna met a director named Ritchie and got romantically involved with him and married him. On August 11, 2000, she gave birth to her son Rocco with her second husband in Los Angeles. Her next tour began in 2001 named as Drowned World Tour which had numerous sold out shows in the world. Madonna also had done a cameo in one of the James Bond movies named Die another Day and the soundtrack featuring her in the movie won the Grammy that year.\n\n\n\n\n\nMadonna 9th Studio Album | MTV Music Awards | Top 10 Billboard | Japan Gold Disc Awards\n\n\n\n\n\n\n\nIn 2003 Madonna released 9th studio album named The American life which was her trip down the memory lane for whatever she had achieved and what kind of life she lived. That year she gave another splendid performance with Britney Spears, Missy Elliot, Christina Aguilera at MTV Music Video Awards. Madonna had also done the guest vocals for one of the Britney songs that year. Madonna also sued Time Warner from Maverick for poorly managing and mismanaging the resources in the company. She became the 6th one in the UK Music Hall of Fame along with The Beatles, Elvis Presley, Bob Marley, and U2. A clothing line named M by Madonna in collaboration with Swedish retailers H&M was launched in 2006 consisting of various trench coats, sequined dresses, cropped jackets and various other clothes.\n\n\n\n\n\n\n\n\n\nIn 2007 Madonna single from the album Liver Earth Concert earned her $120 million and got listed at the top 10 billboards. She produced a wrote a documentary named I am Because We Are. In 2008 Madonna booked her spot at Rock and Roll Hall of Fame. At the 23rd Japan Gold Disc Awards, Madonna received her fifth Artist of the Year trophy from Recording Industry Association of Japan, the most for any artist. Madonna directed her second feature film, W.E., a biographical film about the affair between King Edward VIII and Wallis Simpson in 2011. Working with photographer Steven Klein, Madonna completed a 17-minute film called secret project revolution. In 2014 she began to work on her 13th studio album collaborating along with artists like Kanye West and others. In December that year 13 tracks got leaked on the internet for Madonna album and then she said that half of the tracks will not be used and the other half are going to be changed and evolved thus saving the day. The album Rebel Heart was released in March 2015 and reached the number one position at different music markets including Australia, Canada, Germany, and the UK. She traveled the world to promote this album and 1.045 million tickets were sold out. Her tour ended in 2016.\n\n\n\n\n\nIn 2016 a family controversy came up between her son, herself and ex-husband Ritchie. Madonna four-year-old twin sisters from Malawi named Esther and Stella. Her goo work is never going to end and she is going to continue being the best superstar that this world is ever going to witness. This 58 old woman who had an extreme influence of Marlin Monroe in her life has never failed to inspire us with the kind of hard work and philanthropic deeds she has been doing. We believe that the world is not completely over with Madonna fever and is never going to get over her in the upcoming years till she is her alive to entertain us.\n\n\n\n\n\nMadonna 4K Wallpaper\n\n\n\n\n\n\n\nMadonna Actress Pic\n\n\n\n\n\n\n\nMadonna Pic Collection\n\n\n\n\n\n\n\nMadonna Pic with Boyfriend\n\n\n\n\n\n\n\nMadonna 4k Bikini Wallpaper\n\n\n\n\n\n\n\nMadonna Actress Private Pic\n\n\n\n\n\n\n\nMadonna Beautiful Actress Pic\n\n\n\n\n\n\n\nMadonna Hot Actress\n\n\n\n", "images": ["https://www.biphoo.com/product-images/celebrities-images/hairstyle/11Madonna-1.jpg", "https://www.biphoo.com/images/bipamerica-feedback-button.png", "https://www.biphoo.com/product-images/celebrities-images/thumb/thumb_56e7b3eb95261Caterina-Murino-2016.jpg", "https://www.biphoo.com/product-images/celebrities-images/4ian-5.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/contact-us.png", "https://www.biphoo.com/product-images/cms/news/58ec7d89ea027Madonna Daughter Lourdes Looking Hot AND Hungry On the Beach.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bbb50487bDownload Wallpapers Madonna 4k Pics Free.jpg", "https://www.biphoo.com/images/long-right-arrow.png", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/7Madonna-5.jpg", "https://www.biphoo.com/template/biphoo/menu/header_images/search-button.png", "http://i.imgur.com/bLFrkbG.jpg", "https://www.biphoo.com/product-images/cms/news/medium/med_5af533991f4bekhloe-kardashian-shows-sneak-peak-true-ftr.jpg", "https://www.biphoo.com/template/biphoo/menu/header_images/my-account.gif", "https://www.biphoo.com/images/long-left-arrow.png", "https://www.biphoo.com/product-images/cms/news/58e5ee184a564Madonna Shades Pepsi Controversial Ad Featuring Kendall Jenner With Cheeky Shout Out to Coca-Cola.jpg", "https://www.biphoo.com/product-images/celebrities-images/thumb/thumb_56e7b2243dfeaAdam-G-Sevani-2016-1.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bbd9e547dMadonna Download Wallpapers 8k Pics.jpg", "https://www.biphoo.com/product-images/celebrities-images/0Jason Stuart.5jpg.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/3Madonna-9.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/movielogo.png", "https://www.biphoo.com/template/biphoo/images/tumblr.png", "https://www.biphoo.com/template/biphoo/menu/icons/people.png", "https://www.biphoo.com/template/biphoo/menu/icons/celebrity.png", "http://i.imgur.com/KgZxtxV.jpg", "https://www.biphoo.com/product-images/celebrities-images/3Madonna-4.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bcb2f38314k resolution Madonna images.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/advertising.png", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/5Madonna-6.jpg", "https://www.biphoo.com/template/biphoo/menu/header_images/back-button.png", "https://www.biphoo.com/product-images/celebrities-images/thumb/thumb_56e7a279c134abritney-spears-2016.jpg", "https://www.biphoo.com/product-images/celebrities-images/thumb/thumb_56e7b2f3c03b7bradley-simpson-2016.jpg", "https://www.biphoo.com/product-images/celebrities-images/4Michelle Rodriguez-5.jpg", "https://www.biphoo.com/template/biphoo/images/linkdine-logo.png", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/6Madonna-7.jpg", "https://www.biphoo.com/template/biphoo/menu/header_images/responsive_menu.png", "https://www.biphoo.com/template/biphoo/images/google-logo.png", "https://www.biphoo.com/product-images/cms/news/58ec7ecce5a17Madonna daughter Lourdes Leon wears a skimpy pink bikini.jpg", "https://www.biphoo.com/images/user-icon.png", "https://www.biphoo.com/template/biphoo/menu/icons/vehicles.png", "https://www.biphoo.com/template/biphoo/menu/icons/politics.png", "https://www.biphoo.com/product-images/cms/news/medium/med_5dc5a2fc0656e1.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/1Madonna-11.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/usa.png", "http://i.imgur.com/BVSnYCQ.jpg", "https://www.biphoo.com/template/biphoo/images/facebook-logo.png", "https://www.biphoo.com/template/biphoo/menu/icons/restaurants.png", "https://www.biphoo.com/images/views-icon.png", "https://www.biphoo.com/product-images/celebrities-images/3scott3.jpg", "https://www.biphoo.com/product-images/celebrities-images/4Brit Marling-5.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/classifiedsIcon.png", "https://www.biphoo.com/template/biphoo/menu/icons/health.png", "https://www.biphoo.com/images/user-calender.png", "https://www.biphoo.com/images/home_blue.png", "https://www.biphoo.com/template/biphoo/menu/icons/artical.png", "https://www.biphoo.com/template/biphoo/images/twitter.png", "https://www.biphoo.com/product-images/celebrities-images/1Madonna-2.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/news.png", "https://www.biphoo.com/images/breadCrumbArrow.png", "https://www.biphoo.com/product-images/celebrities-images/5Madonna-6.jpg", "https://www.biphoo.com/product-images/celebrities-images/0Madonna-1.jpg", "http://i.imgur.com/7vJ4yS2.jpg", "https://www.biphoo.com/product-images/cms/news/medium/med_5e16e0808f2bathumb_5af5356220832kimye-ftr.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/legal-center.png", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/9Madonna-3.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/business-listings.png", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bc8f8a62c4k images free Madonna.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/finance.png", "http://i.imgur.com/b8JhVWL.jpg", "http://i.imgur.com/taUsqtY.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/microsite.png", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bbf7ad45eMadonna Ultra HD Pics Free Downloads.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/traval-icon.png", "http://i.imgur.com/sJ77JiO.jpg", "https://www.biphoo.com/product-images/cms/news/5927e23684257Zac Efron Jokes About Flirting With Madonna.jpg", "https://www.biphoo.com/product-images/cms/news/medium/med_5af536e22ac7ckimye-read-to-end-feud-with-taylor-ftr.jpg", "http://i.imgur.com/HY3mUNL.jpg", "http://i.imgur.com/4YmaGPx.jpg", "https://www.biphoo.com/product-images/celebrities-images/2Madonna-3.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/10Madonna-2.jpg", "https://www.biphoo.com/product-images/cms/news/59a8f70411bd4Madonna.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/2Madonna-10.jpg", "http://i.imgur.com/PCMvqgx.png", "https://www.biphoo.com/product-images/cms/news/medium/med_5af534ce6fb33selena-gomez-regrets-being-open-ftr.jpg", "https://www.biphoo.com/product-images/celebrities-images/thumb/thumb_56e7a22d69ebdzayn-malik-2016.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/8Madonna-4.jpg", "https://www.biphoo.com/product-images/cms/news/59140aea40705Patti LuPone Calls Madonna a Movie Killer Says She Dead Behind the Eyes.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bc6583b78Madonna UHD Hi-Res Wallpapers.jpg", "http://i.imgur.com/PkglDoS.jpg", "https://www.biphoo.com/template/biphoo/php_captcha.php", "https://www.biphoo.com/template/biphoo/menu/icons/deal1.png", "https://bitconnect.co/upload/image/banner/lending/BitConnect-lending-300X250.gif", "http://i.imgur.com/SKd4c09.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/events.png", "https://www.biphoo.com/template/biphoo/menu/icons/jobs.png", "https://www.biphoo.com/template/biphoo/images/facebook.png", "https://www.biphoo.com/template/biphoo/images/logo.png", "https://www.biphoo.com/template/biphoo/menu/icons/dating.gif", "https://www.biphoo.com/product-images/celebrities-images/57ee446b5cb53madonna_770.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bad6f1af1Madonna 4K Ultra HD Desktop Wallpapers.jpg", "https://www.biphoo.com/product-images/cms/news/58c3a9347e149Madonna works out for five hours a day.jpg", "https://www.biphoo.com/template/biphoo/images/twiter-logo.png", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bafb68bb4Madonna HD 3840x2160 Wallpapers.jpeg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/0Madonna-12.jpg", "https://www.biphoo.com/template/biphoo/menu/icons/real-estate.png", "http://i.imgur.com/JEuAgzI.jpg", "https://www.biphoo.com/product-images/celebrities-images/hairstyle/4Madonna-8.jpg", "https://www.biphoo.com/product-images/celebrities-images/wallpapers/5788bb8a84979Download Wallpapers 5k Pics Madonna.jpg"], "top_img": "https://www.biphoo.com/product-images/cms/news/5927e23684257Zac Efron Jokes About Flirting With Madonna.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.biphoo.com/celebrity/madonna/news/zac-efron-jokes-about-flirting-with-madonna", "title": "Zac Efron Jokes About Flirting With Madonna", "meta_data": {"keywords": "Zac Efron Jokes About Flirting With Madonna", "description": "Zac Efron Jokes About Flirting With Madonna", "p": {"domain_verify": "2e67df853b5a7df1d8ba2050aef47493"}, "language": "en-US", "google-site-verification": "YIqOhrW7Z3Jr9aGE0WvLfl3HsmaatHUaE0YXpDsAOeU", "msvalidate.01": "7D4B462B58D0334FD3DC8E23476B23D6", "og": {"url": "https://www.biphoo.com/celebrity/madonna/news/zac-efron-jokes-about-flirting-with-madonna", "type": "website", "image": "https://www.biphoo.com/product-images/cms/news/5927e23684257Zac Efron Jokes About Flirting With Madonna.jpg"}, "robots": "NOODP", "revisit-after": "1 days", "author": "text", "copyright": "Biphoo", "rating": "General", "fb": {"app_id": 1550147521691675}, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0"}, "movies": [], "publish_date": null, "source": "https://www.biphoo.com", "summary": ""}