{"url": "https://web.archive.org/web/20060418144436/http://www.gravel2008.us:80/", "text": "Home\n\nAbout Senator Gravel Biography Articles Media\n\nNational Initiative\n\nIssues\n\nBlog\n\nGet Involved\n\nContribute Senator Mike Gravel\n\nAnnounces His Candidacy Washington DC - April 17, 2006 We have a great country. We can do better. We must embrace our Founders intentions that we evolve our democracy to remain true to its founding principles. Lincoln, 140 years ago, defined our government: “of the People, by the People, and for the People.” It falls to us to now give full meaning to a Government “by the People” so our common wisdom is reflected in our national policies. Today’s advances in information and communication technology provide us unprecedented ability to communicate as citizens, and all that is lacking is a political process, a mechanism, that permits the citizens to play a direct role in the operations of government. Our country needs a renewal––renewal not just of particular policies, or of particular people, but of democracy itself. I believe that the remedy for the state of our political alienation is the civic renewal embodied in the “National Initiative for Democracy.” The National Initiative is proposed legislation that colleagues and I have developed over the last fifteen years. The National Initiative––when enacted into law––will bring all American citizens into the operations of government as lawmakers. Our three branches of government have become like an unstable chair with only three legs. The Founders could not have envisioned how much money and special interests would corrupt our political process. Giving us––American citizens––legislative power will put the fourth leg on our chair, giving birth to a new foundation of American governance––adding a new check to our system of Checks and Balances. I believe the internet adage: “all of us together are smarter than any one of us alone. I say: “Let the People Decide.” Lawmaking is the central power of government not Election Day voting. Politicians have purposely made the electoral process uncompetitive and jealously guard their monopoly on lawmaking. Whoever makes the laws determines who we vote for, when we vote and how we vote––Florida and Ohio are recent examples. Representative government is mired in a culture of lies and corruption. The corrupting influence of money has created a class of professional politicians raising huge sums to maintain power. Then politicians legislate in the interests of corporations and interest groups. Are today’s political leaders more corrupt than earlier generations? I do not think so. Most men and women in public service begin with a dedication to the public good. It’s the power that corrupts them. Throwing the rascals out ––Republicans or Democrats or any party for that matter––may make us feel good but reshuffling the deck won’t make any difference. We hope against hope that our representatives will correct and reform government. But it’s like asking the foxes to redesign the chicken-coop. The flaws of representative government aren’t in either in the structure of representative government or with those who manage it. It’s both. It’s the structure of representative government that makes its managers susceptible to corruption, greed, injustice and self serving interests. Continued on page 2 Stay up to date, enter your email and zip code: Email : Zip : A 21st Century Government We are a great nation––blessed with ideal geography and abundant resources developed by the sacrifices of immigrant peoples who came to our shores from all over the world, melding foreign cultures and political and religious beliefs into a national community of diversity, liberty, laws and free markets. Our political and economic achievements inspired respect and admiration worldwide. That respect and admiration has been squandered by our current partisan, political leadership. Today, the United States government and the president are reviled in many parts of the world. Not only have we failed as a world leader but our domestic stewardship has presided over a crumbling national infrastructure and unmet social needs while undermining the soundness of our economy with government profligacy. Unfortunately, the partisan, political rhetoric we hear as we approach the 2006 election ineffectively nibbles at the margins of domestic issues and defers submissively to an imperial presidency on global matters. Unfortunately, the monopoly power representatives have thwarts any possibly of reforming government. Representative government, by its very structure, is susceptible to corruption, greed, unfairness, injustice and self-serving special interests. There are only two venues in human governance within which change is possible: the people or the government (that the people set up in the Constitution). Since the government venue is responsible for our current predicament, we have no choice but to look to the venue of the people to reform the government. We need to change the direction of the United States if we are to meet the social, technological, environmental and global challenges of the 21st Century.", "images": ["https://web.archive.org/web/20060418144436im_/http://www.gravel2008.us/images/banner.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Mike Gravel 2008", "meta_data": {"keywords": "mike, gravel, mike gravel, president, presidential, campaign, goverment, direct democracy, fair tax, social security", "description": "Mike Gravel for President 2008", "ROBOTS": "ALL"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}