{"url": "www.newidea.com.au/meghan-markle-prince-harry-twins-confirmed", "text": "SEE MORE: Meghan and Harry 'having twins'\n\nLast week, insiders also confirmed the exciting news to the National Enquirer.\n\n'It's amazing...just incredible,' a friend gushed to the Enquirer. 'But they won't announce for some time, or until the end of the first trimester, as is the American custom.'\n\nAnother insider reportedly told the US publication, 'All the signs have been there for months now.\n\n'It's wonderful news to be sure - but it shouldn't come as a shock to anyone.'\n\nThe Enquirer's shocking report claims 36-year-old Meghan secretly visited fertility doctors before her May 19 wedding to Prince Harry, who is sixth in line to the British throne.\n\n'Harry and Meghan want to get pregnant as quickly as possible after their wedding,' a friend tells.\n\n'They both know that as Meghan gets older, it can get increasingly harder to conceive - and they are both keenly aware of her vulnerability to health complications and the chance of miscarriage the older she gets.'\n\nAlong with fertility check-ups, Meghan also visited London-based nutritionist Melanie Brown at Kensington Palace, insiders told the Enquirer.\n\nBrown, a 'specialist in fertility, IVF, and pregnancy,' who works out of Duke Street, gave Meghan pointers on 'pre-conceptual and pregnancy nutrition, including weight loss and gain, and immune issues.'\n\nHarry, 33, also reportedly 'stepped up', meeting with nutritionist Gabriela Peacock on how he can drop weight and boost fertility.\n\nMeghan and Harry's exciting baby news will mark the first time the monarchy has welcomed twins in almost 600 years.\n\nThe Duke and Duchess of Sussex's twin joy may have been the help of his genetics.\n\nHarry's uncle, his mother Princess Diana's brother, Charles Spencer, has identical twin daughters. The royal's great-grandfather, Edmund Maurice Burke Roche, the fourth Baron Fermoy, was also an identical twin.\n\nOne insider told the Enquirer, 'We all know where the genes for twins comes from - and it wasn't the House of Windsor on Harry's side!\n\n'You might romantically say this is Diana's last gift to her youngest son.'\n\nGetty\n\nA friend added to Life & Style, 'She just can't wait to be a mother.'\n\nHarry is beyond eager to be a dad, added the source.\n\nThe palace insider claims that Her Majesty is also one of the most excited.\n\n'She's been nagging Harry for months about how she can't wait for him to extend the family.\n\n'She loves being a grandmother and a great-grandmother!'\n\nThe royal family is yet to respond to the reports.\n\nThe Royal Wedding Debrief! What happened after Meghan and Harry's big day? We talk through why their wedding will go down in history as one of the most entertaining and romantic. In the latest episode of the New Idea Royals podcast, Frances Sheen and royal expert Angela Mollard take you behind the scenes of the big day - from the bride's stunning dresses to the surprise guest list - and talk through all the highlights that kept us all riveted.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/media/28760/harry-and-meghan.jpg", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/28760/harry-and-meghan.jpg", "keywords": [], "authors": ["Georgia Mars", "Georgia Mars Is A Digital Content Editor At New Idea Magazine. As A Self-Professed Celeb Expert", "Georgia Claims To Know Everything About Everyone", "When She'S Not Digging Deep For The Next Big Celebrity Scoop", "You Can Find Georgia Catching Up On The Latest Reality Tv."], "canonical_link": "https://www.newidea.com.au/meghan-markle-prince-harry-twins-confirmed", "title": "Confirmed: Meghan & Harry - Yes, it's twins", "meta_data": {"language": "en-us", "description": "New Idea reported last week that newlyweds Prince Harry and Meghan Markle were set to welcome twins, and now the exciting baby news has been confirmed.", "news_keywords": "Meghan Markle, Prince Harry, Meghan Markle Prince Harry, Prince Harry twins, Meghan Markle twins, Meghan Markle Prince Harry family plans, What are Meghan Markle and Prince Harry s baby plans, baby, celeb babies, celebrity babies", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/meghan-markle-prince-harry-twins-confirmed", "title": "Confirmed: Meghan & Harry - Yes, it's twins", "description": ".", "image": {"identifier": "http://www.newidea.com.au/media/28760/harry-and-meghan.jpg", "width": 1500, "height": 1000}}, "twitter": {"title": "Confirmed: Meghan Markle and Prince Harry to welcome twins", "description": "New Idea reported last week that newlyweds Prince Harry and Meghan Markle were set to welcome twins, and now the exciting baby news has been confirmed.", "image": "http://www.newidea.com.au/media/28760/harry-and-meghan.jpg", "url": "https://www.newidea.com.au/meghan-markle-prince-harry-twins-confirmed"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1530923820.665, "source": "http://www.newidea.com.au", "summary": ""}