{"url": "money.cnn.com/2017/05/01/media/ryan-seacrest-kelly-ripa-live-co-host/index.html", "text": "Ryan Seacrest is joining \"Live\" as Kelly Ripa's new co-host, jump-starting a new era in the morning television ratings race.\n\nTwo sources with knowledge of the deal confirmed the news to CNN prior to Monday's broadcast, on which Ripa and Seacrest broke the news to viewers.\n\n\"Today, the next chapter of the 'Live' story is about to be written,\" Ripa said.\n\nRipa thanked all of the temporary co-hosts who had filled in during the search, saying, \"They are a part of the 'Live' family forever.\"\n\nShe then increased the anticipation by going to commercial break before bringing Seacrest on stage.\n\n\"So happy,\" Seacrest said as he embraced Ripa before the audience. \"So exciting.\"\n\nSeacrest, one of the world's best-known broadcasters, has co-hosted \"Live\" five times as a guest since ABC began the search for Michael Strahan's replacement one year ago.\n\n\"Live\" gives Seacrest, the former host of Fox's \"American Idol,\" a new daily platform on network television. He will also be an executive producer on the show, according to The Hollywood Reporter, giving him at least nominally the same level of power over it that Ripa herself has.\n\nThe beloved talk show airs in many markets at 9 a.m., directly against the third hour of NBC's \"Today.\" In the fall NBC is introducing a new 9 a.m. show led by Megyn Kelly, who recently jumped from Fox News to NBC.\n\nFive years ago Seacrest was seen as a contender for a \"Today\" show co-host job. Instead, Ripa and Seacrest will be competing with Kelly.\n\n\"Live\" is based in New York. Seacrest lives in Los Angeles, but he has a home in Manhattan, and he's moving to New York to start the new job.\n\nSeacrest is already one of the busiest people in the media business. The new hosting gig will not affect other on-air and off-air roles. He recently renewed his contract to host red carpet specials for NBCUniversal's E! network, for example.\n\nSeacrest will continue to lead his nationally syndicated radio shows for iHeartMedia. According to a source, the ABC building that houses \"Live\" will also have a new radio studio for Seacrest.\n\nSeacrest is already in business with ABC as the host of \"Dick Clark's New Year's Rockin' Eve\" on New Year's Eve.\n\nThe hosting deal may open the door for further business deals with ABC's parent company, Disney.\n\nThe seat next to Ripa was coveted by dozens of entertainment and news industry A-listers.\n\nThe search began when Strahan abruptly left the show for \"Good Morning America\" after co-hosting alongside Ripa for four years. Ripa was reportedly blindsided by the news. Strahan told her about it barely half an hour before the news leaked in the press.\n\nSince then, Ripa's guest co-hosts have included Andy Cohen, Anderson Cooper, Jerry O'Connell, and Fred Savage.\n\nRipa took to Twitter on Sunday to tell her followers that she would reveal her new co-host during Monday's show.\n\nRepresentatives for Ripa, Seacrest and ABC either declined to comment or did not respond to requests for comment ahead of the official announcement on Monday.", "images": ["http://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "http://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/170501073249-kely-ripa-ryan-seacrest-780x439.jpg", "https://i2.cdn.turner.com/money/dam/assets/170501073249-kely-ripa-ryan-seacrest-1024x576.jpg", "http://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "http://i2.cdn.turner.com/money/.element/img/8.0/newsletters/reliable_sources/rs-with-button_large1x1.jpg", "http://i.cdn.turner.com/money/images/1.gif", "http://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/170501073249-kely-ripa-ryan-seacrest-780x439.jpg", "keywords": [], "authors": ["Chloe Melas", "Brian Stelter"], "canonical_link": "https://money.cnn.com/2017/05/01/media/ryan-seacrest-kelly-ripa-live-co-host/index.html", "title": "Ryan Seacrest is Kelly Ripa's new co-host on 'Live'", "meta_data": {"viewport": "width=1140", "date": "2017-05-01 07:55:18", "title": "Ryan Seacrest is Kelly Ripa's new co-host on 'Live'", "description": "The decision jump-starts a new era in the morning TV ratings race.", "keywords": "kelly ripa, ryan seacrest, megyn kelly, live, morning TV, morning TV ratings", "news_keywords": "kelly ripa, ryan seacrest, megyn kelly, live, morning TV, morning TV ratings", "author": "Chloe Melas and Brian Stelter", "section": "media", "og": {"title": "Ryan Seacrest is Kelly Ripa's new co-host on 'Live'", "type": "article", "url": "https://money.cnn.com/2017/05/01/media/ryan-seacrest-kelly-ripa-live-co-host/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/170501073249-kely-ripa-ryan-seacrest-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "The decision jump-starts a new era in the morning TV ratings race."}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2017/05/01/media/ryan-seacrest-kelly-ripa-live-co-host/index.html", "title": "Ryan Seacrest is Kelly Ripa's new co-host on 'Live'", "description": "The decision jump-starts a new era in the morning TV ratings race.", "image": "https://i2.cdn.turner.com/money/dam/assets/170501073249-kely-ripa-ryan-seacrest-540x304.jpg"}, "DC.date.issued": "2017-05-01T07:55:18"}, "movies": [], "publish_date": 1493568000.0, "source": "http://money.cnn.com", "summary": ""}