{"url": "https://en.wikipedia.org/wiki/Stranger_Things", "text": "American science fiction horror web television series\n\nStranger Things is an American science fiction, drama-horror web television series created by the Duffer Brothers and released on Netflix. The twins also serve as executive producers with Shawn Levy and Dan Cohen. The series premiered on Netflix on July 15, 2016. Set in the 1980s in the fictional town of Hawkins, Indiana, the first season focuses on the investigation into the disappearance of a young boy amid supernatural events occurring around the town, including the appearance of a girl with psychokinetic abilities. The series stars an ensemble cast including Winona Ryder, David Harbour, Finn Wolfhard, Millie Bobby Brown, Gaten Matarazzo, Caleb McLaughlin, Noah Schnapp, Natalia Dyer, Charlie Heaton, Joe Keery and Cara Buono.\n\nThe Duffer Brothers developed the series as a mix of investigative drama alongside supernatural elements portrayed with horror, science fiction and childlike sensibilities. Setting the series in the 1980s, the Duffer Brothers infused references to the pop culture of that decade while several themes and directorial aspects were inspired primarily by the works of Steven Spielberg, John Carpenter, and Stephen King, as well as anime and video games. They also took inspiration from strange experiments that took place during the Cold War and real world conspiracy theories involving secret government experiments.\n\nStranger Things has attracted record viewership on Netflix and has a broad, active, and international fan base. The series has received critical acclaim for its characterization, pacing, atmosphere, acting, soundtrack, directing, writing, and homages to 1980s films. The series has received multiple awards and nominations including 31 Primetime Emmy Award nominations, four Golden Globe Award nominations, a British Academy Television Award nomination, two Directors Guild of America Award nominations, three Writers Guild of America Award nominations, and three Grammy Award nominations. It has won a Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series, two American Film Institute awards, a Critics' Choice Television Award, and three People's Choice Awards, among others. In September 2019, the series was renewed for a fourth season. The Duffer Brothers have said that Stranger Things is likely to end after its fourth or fifth season.\n\nSeries overview [ edit ]\n\nStranger Things is set in the fictional rural town of Hawkins, Indiana, during the early 1980s. The nearby Hawkins National Laboratory ostensibly performs scientific research for the United States Department of Energy, but secretly does experiments into the paranormal and supernatural, including those that involve human test subjects. Inadvertently, they have created a portal to an alternate dimension, \"the Upside Down\". The influence of the Upside Down starts to affect the unknowing residents of Hawkins in calamitous ways.[1][2]\n\nThe first season begins in November 1983, when Will Byers is abducted by a creature from the Upside Down. His mother, Joyce, and the town's police chief, Jim Hopper, search for Will. At the same time, a young psychokinetic girl called Eleven escapes from the laboratory and assists Will's friends, Mike, Dustin, and Lucas, in their own efforts to find Will.[3]\n\nThe second season is set a year later, starting in October 1984. Will has been rescued, but few know of the details of the events. When it is discovered that Will is still being influenced by entities from the Upside Down, his friends and family learn there is a larger threat to their universe from the Upside Down.[4]\n\nThe third season is set several months later, in the days leading up to the Fourth of July celebration in 1985. The new Starcourt Mall has become the center of attention for Hawkins' residents, putting most other stores out of business. Hopper becomes increasingly concerned about Eleven and Mike's relationship while still trying to care for Joyce. Unbeknownst to the town, a secret Soviet laboratory under Starcourt seeks to open the gateway to the Upside Down, allowing the entities from the Upside Down to possess people in Hawkins and creating a new horror to deal with.[5][6]\n\nCast and characters [ edit ]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 8 July 15, 2016 ( ) 2 9 October 27, 2017 ( ) 3 8 July 4, 2019 ( ) 4 8[18] TBA\n\nSeason 1 (2016) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 1 1 \"Chapter One: The Vanishing of Will Byers\" The Duffer Brothers The Duffer Brothers July 15, 2016 ( ) 2 2 \"Chapter Two: The Weirdo on Maple Street\" The Duffer Brothers The Duffer Brothers July 15, 2016 ( ) 3 3 \"Chapter Three: Holly, Jolly\" Shawn Levy Jessica Mecklenburg July 15, 2016 ( ) 4 4 \"Chapter Four: The Body\" Shawn Levy Justin Doble July 15, 2016 ( ) 5 5 \"Chapter Five: The Flea and the Acrobat\" The Duffer Brothers Alison Tatlock July 15, 2016 ( ) 6 6 \"Chapter Six: The Monster\" The Duffer Brothers Jessie Nickson-Lopez July 15, 2016 ( ) 7 7 \"Chapter Seven: The Bathtub\" The Duffer Brothers Justin Doble July 15, 2016 ( ) 8 8 \"Chapter Eight: The Upside Down\" The Duffer Brothers Story by : Paul Dichter\n\nTeleplay by : The Duffer Brothers July 15, 2016 ( )\n\nSeason 2 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 9 1 \"Chapter One: MADMAX\" The Duffer Brothers The Duffer Brothers October 27, 2017 ( ) 10 2 \"Chapter Two: Trick or Treat, Freak\" The Duffer Brothers The Duffer Brothers October 27, 2017 ( ) 11 3 \"Chapter Three: The Pollywog\" Shawn Levy Justin Doble October 27, 2017 ( ) 12 4 \"Chapter Four: Will the Wise\" Shawn Levy Paul Dichter October 27, 2017 ( ) 13 5 \"Chapter Five: Dig Dug\" Andrew Stanton Jessie Nickson-Lopez October 27, 2017 ( ) 14 6 \"Chapter Six: The Spy\" Andrew Stanton Kate Trefry October 27, 2017 ( ) 15 7 \"Chapter Seven: The Lost Sister\" Rebecca Thomas Justin Doble October 27, 2017 ( ) 16 8 \"Chapter Eight: The Mind Flayer\" The Duffer Brothers The Duffer Brothers October 27, 2017 ( ) 17 9 \"Chapter Nine: The Gate\" The Duffer Brothers The Duffer Brothers October 27, 2017 ( )\n\nSeason 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date 18 1 \"Chapter One: Suzie, Do You Copy?\" The Duffer Brothers The Duffer Brothers July 4, 2019 ( ) 19 2 \"Chapter Two: The Mall Rats\" The Duffer Brothers The Duffer Brothers July 4, 2019 ( ) 20 3 \"Chapter Three: The Case of the Missing Lifeguard\" Shawn Levy William Bridges July 4, 2019 ( ) 21 4 \"Chapter Four: The Sauna Test\" Shawn Levy Kate Trefey July 4, 2019 ( ) 22 5 \"Chapter Five: The Flayed\" Uta Briesewitz Paul Dichter July 4, 2019 ( ) 23 6 \"Chapter Six: E Pluribus Unum\" Uta Briesewitz Curtis Gwinn July 4, 2019 ( ) 24 7 \"Chapter Seven: The Bite\" The Duffer Brothers The Duffer Brothers July 4, 2019 ( ) 25 8 \"Chapter Eight: The Battle of Starcourt\" The Duffer Brothers The Duffer Brothers July 4, 2019 ( )\n\nSeason 4 [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nRoss (left) and Matt Duffer, the creators of the series\n\nStranger Things was created by Matt and Ross Duffer, known professionally as the Duffer Brothers.[22] The two had completed writing and producing their 2015 film Hidden, in which they had tried to emulate the style of M. Night Shyamalan. However, due to changes at Warner Bros., its distributor, the film did not see a wide release and the Duffer Brothers were unsure of their future.[23] To their surprise, television producer Donald De Line approached them, impressed with Hidden's script, and offered them the opportunity to work on episodes of Wayward Pines alongside Shyamalan. The brothers were mentored by Shyamalan during the episode's production, so that when they finished, they felt they were ready to produce their own television series.[24]\n\nThe Duffer Brothers prepared a script[when?] that would essentially be similar to the series' actual pilot episode, along with a 20-page pitch book to help shop the series around for a network.[25] They pitched the story to about fifteen[26] cable networks, all of which rejected the script on the basis that they felt a plot centered around children as leading characters would not work, asking them to make it a children's series or to drop the children and focus on Hopper's investigation in the paranormal.[24] In early 2015, Dan Cohen, the VP of 21 Laps Entertainment, brought the script to his colleague Shawn Levy. They subsequently invited the Duffer Brothers to their office and purchased the rights for the series, giving full authorship of it to the brothers. After reading the pilot, the streaming service Netflix purchased the whole season for an undisclosed amount;[27] the series was subsequently announced for a planned 2016 release by Netflix in early April 2015.[28] The Duffer Brothers stated that at the time they had pitched to Netflix, the service had already gotten recognized for its original programming, such as House of Cards and Orange Is the New Black, with well-recognized producers behind them, and were ready to start giving upcoming producers like them a chance.[25] The brothers started to write out the series and brought Levy and Cohen in as executive producers to start casting and filming.[29]\n\nMontauk is an eight-hour sci-fi horror epic. Set in Long Island in 1980 and inspired by the supernatural classics of that era, we explore the crossroads where the ordinary meet the extraordinary...emotional, cinematic and rooted in character, Montauk is a love letter to the golden age of Steven Spielberg and Stephen King – a marriage of human drama and supernatural fear. — The Duffer Brothers' original pitch for Montauk[30]\n\nMontauk. For this, they took inspiration from Firestarter. The book cover the Duffer Brothers created to pitch. For this, they took inspiration from Stephen King book covers such as\n\nThe series was originally known as Montauk. The setting was then Montauk, New York and nearby Long Island locations. Montauk figured into a number of real world conspiracy theories involving secret government experiments.[28][31] The brothers had chosen Montauk as it had further Spielberg ties with the film Jaws, where Montauk was used for the fictional setting of Amity Island.[32] After deciding to change the narrative of the series to take place in the fictional town of Hawkins instead, the brothers felt they could now do things to the town, such as placing it under quarantine, that they really could not envision with a real location.[32] With the change in location, they had to come up with a new title for the series under direction from Netflix's Ted Sarandos so that they could start marketing it to the public. The brothers started by using a copy of Stephen King's Firestarter novel to consider the title's font and appearance, and came up with a long list of potential alternatives. Stranger Things came about as it sounded similar to another King novel, Needful Things, though Matt noted they still had a \"lot of heated arguments\" over this final title.[33]\n\nTo pitch the series, the Duffer Brothers showcased images, footage and music from classic 1970s and 1980s films such as E.T. the Extra-Terrestrial, Close Encounters of the Third Kind, Poltergeist, Hellraiser, Stand by Me, Firestarter, A Nightmare on Elm Street and Jaws, in order to establish the tone of the series.[30]\n\nWriting [ edit ]\n\nThe idea of Stranger Things started with how the brothers felt they could take the concept of the 2013 film Prisoners, detailing the moral struggles a father goes through when his daughter is kidnapped, and expand it out over eight or so hours in a serialized television approach. As they focused on the missing child aspect of the story, they wanted to introduce the idea of \"childlike sensibilities\" they could offer, and toyed around with the idea of a monster that could consume humans. The brothers thought the combination of these things \"was the best thing ever\". To introduce this monster into the narrative, they considered \"bizarre experiments we had read about taking place in the Cold War\" such as Project MKUltra, which gave a way to ground the monster's existence in science rather than something spiritual. This also helped them to decide on using 1983 as the time period, as it was a year before the film Red Dawn came out, which focused on Cold War paranoia.[24] Subsequently, they were able to use all their own personal inspirations from the 1980s, the decade they were born, as elements of the series,[24][34] crafting it in the realm of science fiction and horror.[35] Other influences cited by the Duffer Brothers include: Stephen King novels; films produced by Steven Spielberg, John Carpenter, Wes Craven,[36][37][38] and Guillermo del Toro;[33] films such as Star Wars, Alien, and Stand by Me;[33][37][39] Japanese anime such as Akira and Elfen Lied;[33][36] and several video games including Silent Hill, Dark Souls and The Last of Us.[40][41][36] The Duffer Brothers also believe that they may have brought influences from other works unintentionally, including Beyond the Black Rainbow and D.A.R.Y.L., discovered by reviewing fan feedback on the series.[32] Several websites and publications have found other pop culture references in the series, particularly references to 1980s pop culture.[42][43][44][45]\n\nWith Netflix as the platform, the Duffer Brothers were not limited to a typical 22-episode format, opting for the eight-episode approach. They had been concerned that a 22-episode season on broadcast television would be difficult to \"tell a cinematic story\" with that many episodes. Eight episodes allowed them to give time to characterization in addition to narrative development; if they had less time available, they would have had to remain committed to telling a horror film as soon as the monster was introduced and abandon the characterization.[25] Within the eight episodes, the brothers aimed to make the first season \"feel like a big movie\" with all the major plot lines completed so that \"the audience feels satisfied\", but left enough unresolved to indicate \"there's a bigger mythology, and there's a lot of dangling threads at the end\", something that could be explored in further seasons if Netflix opted to create more.[46]\n\nRegarding writing for the children characters of the series, the Duffer Brothers considered themselves as outcasts from other students while in high school and thus found it easy to write for Mike and his friends, and particularly for Barb.[33] Joyce was fashioned after Richard Dreyfuss' character Roy Neary in Close Encounters of the Third Kind, as she appears \"absolutely bonkers\" to everyone else as she tries to find Will.[47]\n\nCasting [ edit ]\n\nThe Duffer Brothers cast David Harbour as Chief Hopper believing this was his opportunity to portray a lead character.\n\nIn June 2015, it was announced that Winona Ryder and David Harbour had joined the series as Joyce and as the unnamed chief of police, respectively.[7] The brothers' casting director Carmen Cuba had suggested Ryder for the role of Joyce, which the two were immediately drawn to because of her predominance in the films of the 1980s.[24] Levy believed Ryder could \"wretch up the emotional urgency and yet find layers and nuance and different sides of [Joyce]\". Ryder praised that the show's multiple storylines required her to act for Joyce as \"she's out of her mind, but she's actually kind of onto something\", and that the producers had faith she could pull off the difficult role.[48] The Duffer Brothers had been interested in Harbour before, who until Stranger Things primarily had smaller roles as villainous characters, and they felt that he had been \"waiting too long for this opportunity\" to play a lead, while Harbour himself was thrilled by the script and the chance to play \"a broken, flawed, anti-hero character\".[33][49]\n\nAdditional casting followed two months later with Finn Wolfhard as Mike, Millie Bobby Brown in an undisclosed role, Gaten Matarazzo as Dustin, Caleb McLaughlin as Lucas, Natalia Dyer as Nancy, and Charlie Heaton as Jonathan.[8] In September 2015, Cara Buono joined the cast as Karen,[9] followed by Matthew Modine as Martin Brenner a month later.[10] Additional cast who recur include Noah Schnapp as Will,[8][13] Shannon Purser as Barbara \"Barb\" Holland,[50] Joe Keery as Steve Harrington,[14][13] and Ross Partridge as Lonnie,[51] among others.\n\nActors auditioning for the children roles read lines from Stand by Me.[24] The Duffer Brothers estimated they went through about a thousand different child actors for the roles. They noted that Wolfhard was already \"a movie buff\" of the films from the 1980s period and easily filled the role, while they found Matarazzo's audition to be much more authentic than most of the other audition tapes, and selected him after a single viewing of his audition tape.[25] As casting was started immediately after Netflix greenlit the show, and prior to the scripts being fully completed, this allowed some of the actor's takes on the roles to reflect into the script. The casting of the young actors for Will and his friends had been done just after the first script was completed, and subsequent scripts incorporated aspects from these actors.[46] The brothers said Modine provided significant input on the character of Dr. Brenner, whom they had not really fleshed out before as they considered him the hardest character to write for given his limited appearances within the narrative.[47]\n\nFilming [ edit ]\n\nThe brothers had desired to film the series around the Long Island area to match the initial Montauk concept. However, with filming scheduled to take place in November 2015, it was difficult to shoot in Long Island in the cold weather, and the production started scouting locations in and around the Atlanta, Georgia area. The brothers, who grew up in North Carolina, found many places that reminded them of their own childhoods in that area, and felt the area would work well with the narrative shift to the fictional town of Hawkins, Indiana.[32]\n\nThe filming of the first season began in November 2015 and was extensively done in Atlanta, Georgia, with the Duffer Brothers and Levy handling the direction of individual episodes.[52] Jackson served as the basis of the fictional town of Hawkins, Indiana.[53][54] Other shooting locations included the Georgia Mental Health Institute as the Hawkins National Laboratory site, Bellwood Quarry, Patrick Henry High School in Stockbridge, Georgia, for the middle and high school scenes,[55] Emory University's Continuing Education Department, the former city hall in Douglasville, Georgia, the Georgia International Horse Park in Conyers, Georgia, the probate court in Butts County, Georgia, Old East Point Library and East Point First Baptist Church in East Point, Georgia, Fayetteville, Georgia, Stone Mountain Park, Palmetto, Georgia, and Winston, Georgia.[56] Set work was done at Screen Gem Studios in Atlanta[56] and the series was filmed with a Red Digital Dragon camera.[47] Filming for the first season concluded in early 2016.[53]\n\nAfter the third season finished filming, producers considered the idea of keeping the Starcourt Mall set as a permanent attraction for fans to visit, but ultimately decided against it.[57]\n\nThe fourth season of Stranger Things was expected to consist of eight episodes, with the first episode titled \"Chapter One: The Hellfire Club\".[58] Filming for the season was slated to begin in January 2020 and to last through August.[59] With release of a February 2020 teaser for the fourth season, the Duffers confirmed that production had started.[60] Some filming for the fourth season took place at Lukiškės Prison and nearby in Vilnius, Lithuania.[61] In March 2020, production was stopped due to the 2019–20 coronavirus pandemic.[62]\n\nVisual effects [ edit ]\n\nTo create the aged effect for the series, a film grain was added over the footage, which was captured by scanning in film stock from the 1980s.[47] The Duffer Brothers wanted to scare the audience, but not to necessarily make the series violent or gory, following in line with how the 1980s Amblin Entertainment films drove the creation of the PG-13 movie rating. It was \"much more about mood and atmosphere and suspense and dread than they are about gore\", though they were not afraid to push into more scary elements, particularly towards the end of the first season.[47] The brothers had wanted to avoid any computer-generated effects for the monster and other parts of the series and stay with practical effects, so they created an animatronic to play the part of the demogorgon.[63][64] However, the six-month filming time left them little time to plan out and test practical effects rigs for some of the shots. They went with a middle ground of using constructed props including one for the monster whenever they could, but for other shots, such as when the monster bursts through a wall, they opted to use digital effects. Post-production on the first season was completed the week before it was released to Netflix.[24]\n\nThe title sequence uses closeups of the letters in the Stranger Things title with a red tint against a black background as they slide into place within the title. The sequence was created by the studio Imaginary Forces, formerly part of R/GA, led by creative director Michelle Doughtey.[65] Levy introduced the studio to the Duffer Brothers, who explained their vision of the 1980s-inspired series, which helped the studio to fix the concept the producers wanted. Later, but prior to filming, the producers sent Imaginary Forces the pilot script, the synth-heavy background music for the titles, as well as the various book covers from King and other authors that they had used to establish the title and imagery, and were looking for a similar approach for the series' titles, primarily using a typographical sequence. They took inspiration from several title sequences of works from the 1980s that were previously designed by Richard Greenberg under R/GA, such as Altered States and The Dead Zone. They also got input from Dan Perri, who worked on the title credits of several 1980s films. Various iterations included having letters vanish, to reflect the \"missing\" theme of the series, and having letters cast shadows on others, alluding to the mysteries, before settling into the sliding letters. The studio began working on the title sequence before filming, and took about a month off during the filming process to let the producers get immersed in the series and come back with more input. Initially they had been working with various fonts for the title and used close-ups of the best features of these fonts, but near the end the producers wanted to work with ITC Benguiat, requiring them to rework those shots. The final sequence is fully computer generated, but they took inspiration from testing some practical effects, such as using Kodalith masks as would have been done in the 1980s, to develop the appropriate filters for the rendering software. The individual episode title cards used a \"fly through\" approach, similar to the film Bullitt, which the producers had suggested to the studio.[66]\n\nMusic [ edit ]\n\nThe Stranger Things original soundtrack was composed by Michael Stein and Kyle Dixon of the electronic band Survive.[67] It makes extensive use of synthesizers in homage to 1980s artists and film composers including Jean-Michel Jarre, Tangerine Dream, Vangelis, Goblin, John Carpenter, Giorgio Moroder, and Fabio Frizzi.[68]\n\nAccording to Stein and Dixon, the Duffer Brothers had been fans of Survive's music, and used their song \"Dirge\" for the mock trailer that was used to sell the series to Netflix.[67][69] The Duffer Brothers discovered the band through the 2014 film The Guest, where Survive features on the soundtrack.[70] Once the series was green-lit, the Duffer Brothers contacted Survive around July 2015 to ask if they were still doing music; the two provided the production team with dozens of songs from their band's past to gain their interest, helping to land them the role.[67] Once aboard, the two worked with producers to select some of their older music to rework for the series, while developing new music, principally with character motifs.[69] The two had been hired before the casting process, so their motif demos were used and played over the actors' audition tapes, aiding in the casting selection.[69][71] The series' theme is based on an unused work Stein composed much earlier that ended up in the library of work they shared with the production staff, who thought that with some reworking would be good for the opening credits.[67]\n\nIn addition to original music, Stranger Things features period music from artists including The Clash, Joy Division, Toto, New Order, The Bangles, Foreigner, Echo and the Bunnymen, Peter Gabriel, and Corey Hart, as well as excerpts from Tangerine Dream, John Carpenter, and Vangelis.[72][73] In particular, The Clash's \"Should I Stay or Should I Go\" was specifically picked to play at pivotal moments of the story, such as when Will is trying to communicate with Joyce from the Upside Down.[73]\n\nRelease [ edit ]\n\nThe first season consisted of eight one-hour-long episodes which were released worldwide on Netflix on July 15, 2016,[74] in Ultra HD 4K. The second season, consisting of nine episodes, was released on October 27, 2017 in HDR.[75][76] The third season once again consists of eight episodes,[77] and was released on July 4, 2019.[78] Netflix announced on September 30, 2019 that they had renewed the show for a fourth season.[79]\n\nHome media [ edit ]\n\nThe first season of Stranger Things was released on a Blu-ray/DVD combo pack exclusively to Target retailers on October 17, 2017, and the same for the 4K/Blu-ray combo pack on November 15, 2017, both of which includes vintage CBS-FOX VHS-inspired packaging.[80][81] The second season received a similar release on November 6, 2018.[82][83]\n\nReception [ edit ]\n\nAudience viewership [ edit ]\n\nNetflix did not initially reveal subscriber viewership numbers for their original series, and Symphony Technology Group compiled data for the season based on people using software on their phones that measures television viewing by detecting a program's sound. According to Symphony, within the first 35 days of release, Stranger Things averaged ratings around 14.07 million adults between the ages 18–49 in the United States. This made it the third most-watched season of Netflix original content in the U.S. at the time behind the first season of Fuller House and fourth season of Orange Is the New Black.[84] In a September 2016 analysis, Netflix found that Stranger Things \"hooked\" viewers by the second episode of the first season, indicating that the second episode was \"the first installment that led at least 70 percent of viewers who watched that episode to complete the entire first season of a show.\"[85]\n\nFor the third season, Netflix revealed that the show had broken viewing records for Netflix, with 40.7 million households having watched the show in its first four days, and 18.2 million already watched the entire series within that timeframe.[86] Within its first month, the third season was watched by 64 million households, setting a new record for the most-watched original Netflix series.[87][88]\n\nCritical response [ edit ]\n\nSeason Critical response Rotten Tomatoes Metacritic 1 97% (89 reviews) 76 (34 reviews) 2 94% (147 reviews) 78 (33 reviews) 3 89% (132 reviews) 72 (26 reviews)\n\nReview aggregator Rotten Tomatoes gave the first season an approval rating of 97% based on 87 reviews, and a weighted average rating of 8.1/10. The site's critical consensus states, \"Exciting, heartbreaking, and sometimes scary, Stranger Things acts as an addictive homage to Spielberg films and vintage 1980s television.\"[89] The New York Times has compared the show to Rob Reiner's Stand by Me, relating their nostalgic feel by \"...finding that timeless moment where everything seemed tantalizingly, scarily new.\"[90] Review aggregator Metacritic gave the first season a normalized score of 76 out of 100 based on 34 critics, indicating \"generally favorable reviews\".[91]\n\nOn Rotten Tomatoes, the second season has an approval rating of 94% based on 147 reviews and an average rating of 7.86/10. The site's critical consensus states, \"Stranger Things' slow-building sophomore season balances moments of humor and a nostalgic sweetness against a growing horror that's all the more effective thanks to the show's full-bodied characters and evocative tone.\"[92] On Metacritic, the second season has a normalized score of 78 out of 100, based on 33 critics, indicating \"generally favorable reviews\".[93]\n\nOn Rotten Tomatoes, the third season has an approval rating of 89% based on 132 reviews, and an average rating of 7.87/10. The site's critical consensus states, \"Vibrant and charming, Stranger Things transforms itself into a riveting—if familiar—summer ride that basks in its neon-laden nostalgia without losing sight of the rich relationships that make the series so endearing.\"[94] On Metacritic, the third season has a normalized score of 72 out of 100, based on 26 critics, indicating \"generally favorable reviews\".[95]\n\nThe show was ranked 3rd best TV show of the year (2016) by The Guardian and Empire.[96][97] It was also included on The Atlantic's best TV show of 2017 list.[98]\n\nShannon Purser 's performance as Barb received a great deal of attention from fans and led to her being nominated for Outstanding Guest Actress in a Drama Series.\n\nStranger Things gained a dedicated fan base soon after its release. One area of focus was the character of Barb, Nancy's nerdy friend and classmate who is taken and killed by the monster early in the season.[99] According to actress Shannon Purser, Barb \"wasn't supposed to be a big deal\", and the Duffer Brothers had not gone into great detail about the character since the focus was on finding Will. However, many fans sympathized with the character; Laura Bradley of Vanity Fair suggested that Barb would be a similar misfit in society, and \"looks more like someone you might actually meet in real life\" compared to the other characters, particularly Nancy. Hashtags grew in popularity after the series' release, such as \"#ImWithBarb\" and \"#JusticeforBarb\", and several fan sites and forums were created to support her.[100] Purser did not return for the second season, but the Duffer Brothers used the real-life \"Justice for Barb\" movement as inspiration for narrative at the start of the second season: Nancy addresses the fact \"that no one ever cares about\" Barb.[16] Purser and several media outlets took her nomination as Barb for Outstanding Guest Actress in a Drama Series in the Primetime Emmy Awards as achieving \"Justice for Barb\", highlighting how well her character was received.[101][102][103]\n\nAnother impact of the series has been an increased demand for Eggo waffles, as they are shown to be Eleven's favorite food in several episodes and are seen as a representation of the series.[104] The Kellogg Company manufactures Eggo and had not been part of the production prior to the first season's release, but they recognized the market impact of the series. They provided a vintage 1980s Eggo television advertisement for Netflix to use in its Super Bowl LI commercial, and they intend to become more involved with cross-promotion.[105] Coca-Cola released a limited run of New Coke (introduced in 1985) to coincide with the third season of the show, which takes place in 1985.[106]\n\nLegal matters [ edit ]\n\nIn April 2018, filmmaker Charlie Kessler filed a lawsuit against the Duffer brothers, claiming that they stole his idea behind his short film Montauk, which featured a similar premise of a missing boy, a nearby military base doing otherworldy experiments, and a monster from another dimension. Kessler directed the film and debuted it at the 2012 Hamptons International Film Festival. During the 2014 Tribeca Film Festival, he pitched his film to the Duffer brothers and later gave them \"the script, ideas, story and film\" for a larger film idea which he called The Montauk Project. Kessler contended that the Duffer brothers used his ideas to devise the premise for Stranger Things and sought a third of the income that they had made from the series.[107][108] The Duffer brothers' lawyer stated that they never saw Kessler's film nor spoke to him regarding it, and that Kessler had no input into their concepts for Stranger Things.[109] The judge denied summary judgment for the Duffer brothers in April 2019, allowing Kessler's suit to proceed to trial.[110] Just before the trial was due to start in May 2019, Kessler withdrew his lawsuit after hearing the depositions and seeing documents from as early as 2010 which showed him that the Duffers had independently come up with the concept of Stranger Things.[111]\n\nJournalists have noted that the idea of supernatural events around Montauk had originated due to urban legend of the Montauk Project, which came to light from the 1992 book The Montauk Project: Experiments in Time.[112][113][114]\n\nIn September 2017, multiple media outlets published articles about a cease-and-desist letter sent by a Netflix in-house attorney to the operator of a Stranger-Things-themed bar in Chicago.[116] The letter included humorous references to the series: \"unless I'm living in the Upside Down\"; \"we're not going to go full Dr. Brenner on you\"; \"the demogorgon is not always as forgiving\". The letter also won praise from lawyers for its even-handedness in not demanding immediate closure of the bar, only demanding that the bar not remain open without Netflix's permission past its initial scheduled run.\n\nAwards and nominations [ edit ]\n\nStranger Things has received numerous awards and nominations across the entertainment industry, including ten Primetime Emmy Award nominations and four Golden Globe Award nominations through the second season. The series' cast has received several of these: the series' first-season cast won the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series, while series leads Ryder, Brown, and Harbour have earned individual awards and nominations.\n\nOther media [ edit ]\n\nBeyond Stranger Things [ edit ]\n\nLogo for the aftershow\n\nWith the release of the second season of the series, Netflix also released Beyond Stranger Things, an aftershow hosted by Jim Rash. The guests of the aftershow are composed of cast and crew from the series, including the Duffer Brothers and the series' stars, to discuss the development and behind-the-scenes production of the series and its larger mythology. Unlike previous aftershows created by Embassy Row, such as Talking Dead and Talking Bad, Beyond Stranger Things is intended to be watched after a screening of the entire second season.[117]\n\nNo aftershow was created for the third season.[118]\n\nTie-in books [ edit ]\n\nPenguin Random House partnered with Netflix to release a series of books related to Stranger Things, starting in late 2018. These include a companion book to the series, Stranger Things: World Turned Upside Down: The Official Behind-The-Scenes Companion, a children's book that offers \"advice, wisdom, and warnings\" from Stranger Things.[119] They have also published a two-in-one Hawkins Middle School Yearbook/Hawkins High School Yearbook,[120] and How to Survive in a Stranger Things World.[121] Visions from the Upside Down: Stranger Things Artbook was released on October 15, 2019[122] and Will Byers' Secret Files on September 24, 2019.[123]\n\nIn the second quarter of 2019, as part of its Silver Archive series, UK publisher Obverse Books released a book on the first season of Stranger Things by writer Paul Driscoll.[124]\n\nNovels [ edit ]\n\nThe novel Suspicious Minds by Gwenda Bond takes place before the first season and focuses on Eleven's mother Terry Ives and her experiences with Dr. Brenner in the Hawkins laboratory in 1969.[125] The novel was released on February 5, 2019, and was soon followed by Darkness on the Edge of Town by New Zealand author Adam Christopher on May 28, 2019. In Edge, following the events of the second season, Hopper relates details of his past life in New York City during the 1970s to Eleven.[126] Runaway Max, a young adult novel by Brenna Yovanoff, was released on June 4, 2019, and explored Max Mayfield's early life in San Diego prior to moving to Hawkins in 1984, as well as offering a retelling of events from the second season from her perspective.[127]\n\nComics [ edit ]\n\nDark Horse Comics announced a partnership with Netflix for \"a multi-year publishing line\" of stories set in the Stranger Things world. The initial title was a four-issue miniseries written by Jody Houser and interior art by Stefano Martino. The story took place during the events of the first season and took Will's perspective while he was still trapped in the Upside Down.[128] The first issue of the miniseries was released on September 26, 2018.[129]\n\nOn May 4, 2019, Dark Horse Comics published a special Stranger Things comic as part of the event Free Comic Book Day (FCBD). The Dark Horse FCBD 2019 General comic contained a Stranger Things story entitled The Game Master set a few days after the events of the first season. It was written by Jody Houser and illustrated by Ibrahim Moustafa.[130]\n\nThe second Stranger Things title is another four-part miniseries, written again by Jody Houser with interior art by Edgar Salazar, titled Stranger Things: Six. The comic focuses on one of the experiments preceding Eleven: a girl named Francine, who possesses powers of precognition. The first issue went on sale on May 29, 2019.[131]\n\nAn original graphic novel based on the series called Stranger Things: Zombie Boys was released on February 19, 2020. It was written by Greg Pak, drawn by Valeria Favoccia, lettered by Nate Piekos of Blambot, colored by Dan Jackson, with cover art by Ron Chan. It is 72 pages and set after the first season.[132]\n\nA third comic miniseries, Stranger Things: Into the Fire, started in January 2020. Also lasting for four issues, it is a sequel to the Six miniseries set prior to the show's third season. It is written by Jody Houser, penciled by Ryan Kelly, and inked by Le Beau Underwood.[133]\n\nAnother Stranger Things one-shot is slated for Free Comic Book Day 2020. It will be written by Greg Pak and set shortly after the Battle of Starcourt Mall depicted in the series' third season.[134]\n\nIssue Release Date Story Art Colors Cover Collection #1[135] September 26, 2018 Jody Houser PENCILS: Stefano Martino\n\nINKS: Keith Champagne Lauren Affe Aleksi Briclot\n\nRafael Albuquerque (variant)\n\nKyle Lambert (variant)\n\nPatrick Satterfield (photo variant) Stranger Things: The Other Side\n\nRELEASE DATE: May 7, 2019\n\n9781506709765[136] #2[137] October 31, 2018 Aleksi Briclot\n\nSteve Morris (variant)\n\nGreg Ruth (variant)\n\nPatrick Satterfield (photo variant) #3[138] November 28, 2018 Aleksi Briclot\n\nGrzegorz Domaradzki (variant)\n\nMatthew Taylor (variant)\n\nPatrick Satterfield (photo variant) #4[139] January 2, 2019 Aleksi Briclot\n\nJen Bartel (variant)\n\nEthan Young (variant)\n\nPatrick Satterfield (photo variant) SIX #1[140] May 29, 2019 PENCILS: Edgar Salazar\n\nINKS: Keith Champagne Marissa Louise Aleksi Briclot Stranger Things Volume 2: SIX\n\nRELEASE DATE: November 26, 2019\n\n9781506712321[141] SIX #2[142] June 26, 2019 SIX #3[143] July 31, 2019 SIX #4[144] August 28, 2019\n\nDungeons & Dragons game [ edit ]\n\nHasbro published a licensed version of a Stranger Things-themed Dungeons & Dragons starter kit in May 2019. The kit, besides including instruction books, character sheets and dice, included a campaign \"The Hunt for the Thessalhydra\" which the children played in the first season (written with the intent of having come from the pen of the character of Will himself) as well as Demogorgon minifigs.[145]\n\nVideo games [ edit ]\n\nMobile games [ edit ]\n\nNetflix and BonusXP developed a free mobile game tie-in for Stranger Things, released to iOS and Android devices on October 4, 2017. The game uses a retro-pixel style of art, similar to games for the Super Nintendo Entertainment System. The game is loosely based on the Stranger Things story after season one, with the player starting as Chief of Police Jim Hopper looking for the missing boys. Once these characters are found, they become playable and have special abilities that allow the player to access more areas in the game.[146][147] BonusXP had less than a year to complete the game. The team decided to make the game in a similar style to The Legend of Zelda because it \"was a perfect match because both [Stranger Things and Zelda] are about exploration, and it's kind of a mysterious fit that fit the mood of the show,\" according to BonusXP president Dave Pottinger. The map of Hawkins in the game was based on a Google street view map of Jackson, Georgia where the series is filmed. In order to help keep the game a secret, BonusXP did not hire game testers for their quality assurance, instead having family members from the design team provide feedback; this process helped create the two difficulty levels in the game.[148] Completing the game gives players a clip from the first episode of the second season of the series.[149] The game was downloaded 3 million times in the first week, becoming a top download and receiving critical praise. With the release of season two, an update to the game added Max as a playable character, and a release for the Amazon Fire TV, which included controller support.[148] The game was nominated for \"Mobile Game\" at the 14th British Academy Games Awards.[150][151]\n\nA second mobile game by BonusXP, Stranger Things 3: The Game, was announced during The Game Awards 2018. It will be released as a tie-in for Stranger Things's third season, launching on July 4, 2019.[152] This game will be an isometric action game, where players leads selected show characters, including Joyce, Jim, Max, and Eleven, through various levels, with gameplay inspired by several video games of the 1980s. The game will follow the narrative of the third season, as BonusXP had some input with the Duffer brothers, and will provide additional story elements that the show does not have time to explore.[153][154]\n\nA third mobile game, simply called Stranger Things, is being developed by Next Games. It will be location-based game with role-playing game mechanics.[154]\n\nPlayStation VR game [ edit ]\n\nSony Interactive Entertainment has announced that it is working on a PlayStation 4-exclusive game, based on Stranger Things, for their PlayStation VR peripheral. The company has since released a teaser showing the Christmas-lights-on-a-wall scenes.[155]\n\nCancelled Telltale game [ edit ]\n\nIn June 2018, Netflix announced plans for Telltale Games to produce an episodic adventure game based on the series, as part of a larger partnership that would see ports of other Telltale series as interactive movies on Netflix. However, the project was cancelled after Telltale laid off the majority of its staff in September 2018.[156][157][158][159][160] As planned, the game would have taken place in the springtime of 1985, bridging the events of the second and third season. Telltale had also commissioned a companion game from Night School Studio titled Kids Next Door that would be a precursor to their title, but this also was canned on Telltale's closure.[161] Upon Telltale Games’ revival by LSG Entertainment, several titles were reacquired, but the rights to Stranger Things had already reverted to Netflix.\n\nTheme park attractions [ edit ]\n\nIn 2018 and 2019, Universal Parks and Resorts featured mazes based on Stranger Things at Halloween Horror Nights at their Universal Studios Hollywood and Universal Orlando Resort theme parks, with Universal Studios Singapore also receiving a Stranger Things-based attraction for the 2018 season.\n\nOthers [ edit ]\n\nLego introduced a Stranger Things set called \"The Upside Down\", based on a version of the Byers' home and its replica in the Upside Down, in May 2019.[162] Netflix partnered with Epic Games to include some elements of Stranger Things in Fortnite Battle Royale in the weeks preceding the show's third season launch.[154] Stranger Things DLC for the VR game Face Your Fears was also released.[163][164][165] Within a September 17, 2019, update for the asymmetric multiplayer horror game Dead by Daylight, the Demogorgon was released as one of the killers, along with survivors based on Nancy and Steve.[166] Stranger Things-themed vehicles and cosmetics were added to Rocket League for its 2019 Halloween event.[167]\n\nUnited States Representative David Cicilline compared the state of the nation during the presidency of Donald Trump to that of Stranger Things during a speech given in Congress on February 16, 2017, using a sign \"Trump Things\" in the same format as the title card of the series and saying \"Like the main characters in Stranger Things, we are now stuck in the Upside Down\".[168]\n\nAs part of its release on Netflix on April 14, 2017, the cast of the rebooted version of Mystery Science Theater 3000 riffed on the first part of \"Chapter 1\" of Stranger Things.[169] Google used augmented reality (AR) \"stickers\" of Stranger Things characters to introduce its ARCore technology announced alongside its Pixel 2 phone in October 2017.[170] Sesame Street created a young audience-appropriate spoof of Stranger Things, called Sharing Things, released in November 2017; it featured Cookie Monster as the \"Cookiegorgon\", Grover as Lucas, Ernie as Dustin, and included several nods to the narrative of the second season.[171] The Simpsons episode \"Treehouse of Horror XXX\", which aired on October 20, 2019, included the segment Danger Things, a parody of Stranger Things.[172] The classic 1980s bicycles used in the series have been produced in limited runs that sell out quickly.[173]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Ross_Duffer_by_Gage_Skidmore.jpg/109px-Ross_Duffer_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Stranger_Things_logo.png/250px-Stranger_Things_logo.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d5/Stranger_Things_Book_Cover_Original_Pitch.jpg/220px-Stranger_Things_Book_Cover_Original_Pitch.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/42px-Ambox_current_red.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Millie_Bobby_Brown_by_Gage_Skidmore_2.jpg/130px-Millie_Bobby_Brown_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c4/BeyondStrangerThingsLogo.png/170px-BeyondStrangerThingsLogo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/David_Harbour_by_Gage_Skidmore.jpg/170px-David_Harbour_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Winona_Ryder_2010_TIFF_adjusted.jpg/159px-Winona_Ryder_2010_TIFF_adjusted.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Matt_Duffer_by_Gage_Skidmore.jpg/125px-Matt_Duffer_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Stranger_Things_cast_by_Gage_Skidmore.jpg/220px-Stranger_Things_cast_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/3/38/Stranger_Things_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Shannon_Purser_by_Gage_Skidmore.jpg/170px-Shannon_Purser_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/%E2%80%9CHawkins_National_Labs%E2%80%9D_also_known_as_Emory_University%E2%80%99s_briarcliff_campus._%2828903314358%29.jpg/220px-%E2%80%9CHawkins_National_Labs%E2%80%9D_also_known_as_Emory_University%E2%80%99s_briarcliff_campus._%2828903314358%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/38/Stranger_Things_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Stranger_Things", "title": "Stranger Things", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/38/Stranger_Things_logo.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}