{"url": "https://web.archive.org/web/20171031150818/https://www.forbes.com/sites/laurabegleybloom/2017/10/31/how-21-year-old-created-beauty-company-women-of-every-color/", "text": "Photo courtesy of Jon Cee Visuals\n\nWith Bahi Cosmetics, an all-natural skincare and cosmetics company for women of every color, 21-year-old Danielle Bahi is on a mission to disrupt the beauty space. Essence magazine recently called Bahi Cosmetics \"the brand to watch.\"\n\nThis founder, who was born on the Ivory Coast of Africa and came to the United States when she was 7-years-old, started the organic, vegan and cruelty-free company in her college dorm room two years ago. Travel has played a role in Bahi's success. Besides using ingredients that she sources at farmers markets — olives, sunflowers, almonds, hazelnut oil — Bahi hosts what she calls Greyscale events around the country. At these gatherings, Bahi brings together all kinds of artists to share ideas, uplift other women of color and get inspired.\n\nHere, Bahi tells how she got her start, how travel inspires her and shares advice for other young women who want to make a change in the world.\n\nLaura Begley Bloom: What motivated you to create this business?\n\nDanielle Bahi: I am an artist driven by my passion for skincare and beauty. I want to provide the world with cost-effective skincare that actually does the job it's meant to do. With little to no money, I started this business and now it's growing larger, one day at at time.\n\nPhoto courtesy of Bahi Cosmetics\n\nBegley Bloom: Who is your target market?\n\nBahi: We don’t have a target market — which is part of the beauty of our company. We believe everyone should be able to use the products and feel comfortable using them. I want to empower others across the world to have more confidence in their skin.\n\nBegley Bloom: How did you get your start?\n\nBahi: I started Bahi in my bedroom, just making glitters and pigments. I was hesitant about selling skincare, despite the fact that I had already formulated skincare items. When you’re starting out, you don’t know how everyone is going to react to your creations. But after a while, I slowly introduced skincare. As the company has grown, the brand has remained a homemade cosmetics company. I currently make each of the products by hand, using natural ingredients from farmers markets.\n\nBegley Bloom: Did you leave another job to do this?\n\nBahi: Before Bahi, I was actually a barista at Le Pain Quotidien. After Bahi bloomed, I had no choice but to leave the job. In order to keep up with the growth of Bahi, I had to clear my plate of many other things that stood in the way.\n\nBegley Bloom: Was it challenging? Did you start making money right away?\n\nBahi: The transition of Bahi becoming a true company and growing from a passion of mine was one of the hardest moments I’ve ever experienced. When I first started Bahi, money wasn’t being made as fast as I’d hoped it would. The creativity and passion was there, but the structure and client base hadn’t arrived. I had no choice but to work numerous jobs in order to take care of my own necessities while pursuing this dream.\n\nPhoto courtesy of Bahi Cosmetics\n\nBegley Bloom: What’s the secret behind your success?\n\nBahi: I just believed in my business and projected those beliefs into reality. I did pre-orders and sold the products before I could even create them. Even if an idea never sees the light of day, I will do everything in my power to make it happen. For many of the Bahi products, I had the ingredients written down long before they were completed. I had even planned out Bahi for two years before I took the plunge, but I always believed in it — and now we’re here.\n\nBegley Bloom: Do you travel a lot for your job? How does it inspire you?\n\nBahi: I’ve had the opportunity to meet and connect with customers in Atlanta, New York, Chicago and Paris to hear personal stories of how our products affect their confidence. What really inspires me is getting to seeing the results in person versus viewing them from a phone screen at home. It motivates me to do more for our customers.\n\nBegley Bloom: Tell me about your Greyscale events.\n\nBahi: I love meeting other artists and creatives who are as passionate about their work as I am. Hearing them share their knowledge about their craft inspires me to perfect mine. Greyscale was created to bring together all forms of artists and showcase talent. I wanted to create union through these shows. It was my hope that by bringing a variety of people together that they would feel a deeper love and connection for others through their art. Our latest Greyscale event was held in Atlanta, where we sold paintings, had a live DJ and allowed artists to perform and simply connect with others in the crowd. Seeing each of them mingling, bonding and meeting some of the people they speak to on social media was great. We hope to continue this and over time take on larger and larger cities and grow together with our customers across the world.\n\nBegley Bloom: What's your greatest inspiration?\n\nBahi: My grandmother was always my greatest inspiration. She taught me her belief that if a skincare product is made from ingredients that you can't pronounce, it shouldn’t be on your skin. My grandmother was a woman who was deeply rooted in herbal medicine, growing just about any and every ingredient in her backyard.\n\nPhoto courtesy of Bahi Cosmetics\n\nBegley Bloom: What places around the world inspire you the most?\n\nBahi: Surprisingly, France. I draw inspiration from the people, the culture and, most importantly, the art. I focus on meeting amazing people, no matter where I go.\n\nBegley Bloom: What is your most important career strategy?\n\nBahi: It's important to take a step back and review the work. I’m an accomplisher. I love getting things done, but I tend to go ahead with projects without fully breaking down their processes; sometimes that doesn't work in my favor. Now, I've realized the importance of fully processing my ideas beforehand and seeing if they’re worth continuing or if they can be tweaked to be a bit better. Sometimes, they have to be scrapped altogether and I've learned that's okay, too.\n\nBegley Bloom: Has being a woman ever been an impediment along the way?\n\nBahi: No, it has not. However, being a black woman has.\n\nBegley Bloom: Are you helping other women get ahead?\n\nBahi: That is my goal. I believe there is room for success for everyone. I believe in opportunities and cross promotion. So whether it’s bringing women I believe in onto the Bahi team or simply giving another brand a shoutout or featuring them in our monthly magazine, we always strive to help other women — and creatives, in general — succeed.\n\nBegley Bloom: What's the best advice anyone's ever given you?\n\nBahi: “Work in silence” —my grandfather.\n\nBegley Bloom: Worst advice?\n\nBahi: \"Hire your peers. It’s easier to get the job done.\"\n\nBegley Bloom: Have you had any challenges along the way? How did you solve them?\n\nBahi: I’ve had challenges with shipping. I would send my items off, only for them not to be scanned on time or sometimes not scanned at all. I’ve lost a lot over missing packages. The best way for me to resolve this issue has been to resend packages to customers and, of course, offer other shipping options. Although it cost me on the back end, having happy and loyal customers has always been my main focus.\n\nBegley Bloom: What's your advice to other women who want to start a company like this?\n\nBahi: Be prepared to undertake the impossible. Not everything is going to be easy , and patience is the ultimate virtue. Believe me, I learned these things the hard way.", "images": ["https://web.archive.org/web/20171031150818im_/https://blogs-images.forbes.com/laurabegleybloom/files/2017/10/Bahi-models-1.jpg?width=960", "https://web.archive.org/web/20171031150818im_/https://i.forbesimg.com/special-report/2016/women-at-forbes/img/women-at-forbes_logo.svg", "https://web.archive.org/web/20171031150818im_/https://blogs-images.forbes.com/laurabegleybloom/files/2017/10/IMG_0922-copy.jpg?width=960", "https://web.archive.org/web/20171031150818im_/https://blogs-images.forbes.com/laurabegleybloom/files/2017/10/IMG_4804-1200x800.jpg?width=960", "https://web.archive.org/web/20171031150818im_/https://blogs-images.forbes.com/laurabegleybloom/files/2017/10/3daniPS.jpg?width=960", "https://web.archive.org/web/20171031150818im_/https://2.gravatar.com/avatar/e0c80c88e3731484223e4211a4e0f19a?s=136&d=mm&r=g", "https://web.archive.org/web/20171031150818im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Flaurabegleybloom%2Ffiles%2F2017%2F10%2F3daniPS.jpg"], "top_img": "https://web.archive.org/web/20171031150818im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Flaurabegleybloom%2Ffiles%2F2017%2F10%2F3daniPS.jpg", "keywords": [], "authors": ["Laura Begley Bloom"], "canonical_link": "https://web.archive.org/web/20171031150818/https://www.forbes.com/sites/laurabegleybloom/2017/10/31/how-21-year-old-created-beauty-company-women-of-every-color/", "title": "How A 21-Year-Old Created A Beauty Company For Women Of Every Color", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "How A 21-Year-Old Created A Beauty Company For Women Of Every Color", "image": "https://web.archive.org/web/20171031150818im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Flaurabegleybloom%2Ffiles%2F2017%2F10%2F3daniPS.jpg", "updated_time": "2017-10-31T10:18:12-04:00", "url": "https://web.archive.org/web/20171031150818/https://www.forbes.com/sites/laurabegleybloom/2017/10/31/how-21-year-old-created-beauty-company-women-of-every-color/", "description": "This founder tells how she is shaking up the beauty world and shares how travel inspires her.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "How A 21-Year-Old Created A Beauty Company For Women Of Every Color", "description": "This founder tells how she is shaking up the beauty world and shares how travel inspires her.", "image": "https://web.archive.org/web/20171031150818im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fblogs-images.forbes.com%2Flaurabegleybloom%2Ffiles%2F2017%2F10%2F3daniPS.jpg", "creator": "@laurabegleybloom"}, "description": "This founder tells how she is shaking up the beauty world and shares how travel inspires her.", "author": "Laura Begley Bloom", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Laura Begley Bloom", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/4510-2963", "published": "2017-10-31", "modified": "2017-10-31"}}, "movies": [], "publish_date": 1509379200.0, "source": "https://web.archive.org", "summary": ""}