{"url": "https://people.com/tv/mama-june-shannon-new-boyfriend-geno-introduction/", "text": "Mama June Shannon just took a big step in her relationship with her new man.\n\nIn the season 2 premiere of Mama June: From Not to Hot, the reality star introduced her boyfriend, Geno, to audiences — and her two youngest children.\n\nGet push notifications with news, features and more.\n\nAlthough Mama June, 38, attempted to keep her relationship with Geno a secret from daughters Alana “Honey Boo Boo” Thompson, 12, and Lauryn “Pumpkin” Shannon, 18, the girls learned about him when they followed her to bingo, where she met up with Geno and was caught kissing him on-camera.\n\n“She’s kissing him!” Alana said as the couple exited the bingo building and shared a smooch an hour after they entered. “What kind of guy takes mama on a date to bingo?”\n\nUpon arriving home later that night, the girls pressed Mama June about her whereabouts and confessed to spying on her — but she refused to answer any questions.\n\n“Yes, I have found love y’all. I have a great wonderful guy, Geno, and I feel like a kid again,” Mama June, who dropped 300 lbs. from her onetime high of 460 lbs. in 2016, told audiences about her new beau. “Geno knew me when I was heavy and I really think he’s here for the right reasons. I think he likes me for me, not for [fame] or me being skinny.”\n\nImage zoom\n\nAlthough Mama June admitted to enjoying sneaking around with Geno — it’s “kind of hot, it’s kind of like foreplay. I’m kind of liking it, I’m kind of digging it,” she admitted — she was intentionally keeping it on the down low to protect her daughters from getting hurt.\n\n“Geno’s the first guy that I’ve dated really serious since I’ve lost the weight, and I’m trying to keep this one to myself to see how it’s going to work out,” she explained. “I hope this one works out, but honestly, I’ve had some terrible luck with guys and I’ve got really burnt. So, it’s really hard for me to fully trust him right now.”\n\nIn 2014, her family’s TLC reality show Here Comes Honey Boo Boo was abruptly canceled after she was accused of dating a man who had been convicted of molesting her oldest daughter Anna, 23, an allegation she strenuously denied. Later, when she split from her on-again, off-again beau Matt “Sugar Bear” Thompson, Alana’s father, after a stint on Marriage Boot Camp in 2016, Mama June accused him of physical abuse. Thompson, who married Jennifer Lamb earlier this year, denies the allegations.\n\nImage zoom\n\nImage zoom Courtesy WE tv\n\nImage zoom\n\nImage zoom\n\nWatch the full episode of Mama June: How I Kept Off 300 lbs., streaming now on PeopleTV. Go to People.com/peopletv, or download the app on your favorite streaming device.\n\nDuring the couple’s pottery-making date, Geno asked Mama June about when he could be introduced to her daughters.\n\n“I really, really enjoy hanging out with you,” Geno told her. “I’m being totally serious, you need to tell the kids about me.”\n\n“I want to tell them,” said Mama June, who had been dating Geno for two months at the time of filming. “But I’m really worried because me and the girls have been through hell and back and I don’t want the girls to get attached to somebody and the dude just come up and walk out of their life and they’re devastated again.”\n\nBy the end of their date, the couple agreed that they were both ready to make an introduction happen, which they sealed with a kiss. “I promise baby, I’ll introduce you to them soon,” she assured him.\n\nLater in the episode, the introduction finally happened when Mama June brought Geno to her house, where they found Pumpkin’s boyfriend, Josh, wading in the water-filled back of his truck with Alana.\n\nImage zoom Courtesy WE tv\n\nImage zoom\n\n“This is Geno, we’ve been dating for a couple months,” Mama June said before Alana shook his hand and asked, “What’s your intentions with my mama?”\n\nWhen Pumpkin questioned why he hadn’t been around before, Mama June explained, “I wanted to protect y’all.”\n\n“If you want to run now and get away from this craziness, I won’t hold it against you,” she told Geno, who did the opposite of run: he handed her his keys and jumped in the back of the truck with Josh and Alana.\n\n“So are you going to stay?” she asked him during a confessional. “I’m here, aren’t I?” he told her with a smile.\n\nWATCH: The Secret to Mama June’s 300-Lb. Weight Loss: Sleeping Until 1 to Skip Breakfast!\n\nImage zoom\n\nBut did Alana approve of her mother’s new boyfriend?\n\n“I mean, he’s a cool guy or whatever,” Alana admitted. Still, she had her reservations about how the new romance would impact their own mother-daughter relationship. “Does that mean me and you ain’t going to hang out no more ’cause you have a boyfriend?” Alana asked. “You haven’t been around a lot.”\n\n“I mean, now that y’all are getting older, it’s time for me to find somebody that I can be happy with,” Mama June said to her. “I’ve been single for so long and been devoted to y’all.”\n\nDuring a recent interview with PEOPLE, Mama June called Geno “my rock and my best friend.”\n\n“I’ve never been able to enjoy somebody as much as I have him,” she shared.\n\nShe added: “He restored our faith when we thought there were no good men left out there.”\n\nMama June: From Not to Hot airs Fridays (9 p.m. ET) on WE tv.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-9-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-5-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-6.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-8-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-7-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-10-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-6.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/mama-june-shannon-new-boyfriend-geno-introduction/", "title": "Mama June Introduces New Boyfriend Geno to Her Daughters — But Do They Approve of Him?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Alana Honey Boo Boo Thompson,Celeb Relationships,June Shannon,News,TV", "news_keywords": "Alana Honey Boo Boo Thompson,Celeb Relationships,June Shannon,News,TV", "description": "\"I have found love y'all. I have a great wonderful guy, Geno, and I feel like a kid again,\" Mama June said in the season 2 premiere of Mama June: From Not to Hot", "og": {"title": "Mama June Introduces New Boyfriend Geno to Her Daughters — But Do They Approve of Him?", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/mama-june-shannon-new-boyfriend-geno-introduction/", "description": "Mama June Shannon just took a big step in her relationship with her new man. In the season 2 premiere of Mama June: From Not&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-6.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/mama-june-shannon-new-boyfriend-geno-introduction/", "description": "\"I have found love y'all. I have a great wonderful guy, Geno, and I feel like a kid again,\" Mama June said in the season 2 premiere of Mama June: From Not to Hot", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-6.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/mama-june-shannon-new-boyfriend-geno-introduction/", "title": "Mama June Introduces New Boyfriend Geno to Her Daughters — But Do They Approve of Him?", "description": "\"I have found love y'all. I have a great wonderful guy, Geno, and I feel like a kid again,\" Mama June said in the season 2 premiere of Mama June: From Not to Hot", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmama-june-boyfriend-6.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}