{"url": "http://toofab.com/2017/08/30/spencer-pratt-drags-lauren-conrad-and-caitlyn-jenner-reveals-secret-connection-to-ryan-gosling/", "text": "Spencer Pratt unloaded on Lauren Conrad and fellow \"Hills\" star Brody Jenner's parent Caitlyn Jenner in a new interview the reality show's fans will surely enjoy.\n\nPratt appeared on the \"Allegedly with Theo Von & Matthew Cole Weiss\" podcast on Wednesday and he did not hold back, spilling on LC, Jenner, sex tapes and his secret connection to Ryan Gosling.\n\nSee some of his shadiest quotes from the interview below!\n\nHow LC screwed his and Heidi's baby photo deal:\n\n\"Well Lauren Conrad just blew it for us, having the worst selling magazine cover in the history of the publication. She killed our numbers. She's supposed to be the queen of 'The Hills,' so all our money just went way down because of her. I would rather taken no money to have that happen to her so it's a win regardless.\"\n\nWhy LC won't do a \"Hills\" reunion:\n\n\"Some people don't want to share any shine, they'd rather sit on their Instagram account.\"\n\nHis reaction if his son-to-be wanted to date Lauren's kid:\n\n\"If he wants to date Liam, that's up to him. I personally will be targeting Kristin Cavallari's $100 million + daughter for my son. Kristin, I'll be such a good in-law!\"\n\nHis connection to Ryan Gosling and Scientology:\n\n\"I had a penthouse loft when I was a freshman at USC and the connecting penthouse loft was Ryan Gosling and we used to kick it all the time. He may deny it but I have many witnesses and I'll take a polygraph. He told me a story about Scientology that has stuck with me for years. Let's just say it involved people not surviving heavy shit and I was like, oh wow, this is not something to joke about. I never had the clean enough juice [to be recruited], if I had been a Brody or Lauren I think they would have come after me and I would have been like, lets get on a jet John Travolta. I'd be out here repping, me and TC just had a seance or whatever.\"\n\nOn Caitlyn Jenner, who he hasn't met since her transition:\n\n\"I'm Team Kris Jenner. I was Team Brody. Bruce is like the worst person ever. He wouldn't even call Brody on his birthday and he was in the valley. It's not like he was in the Czech Republic. He was always bad as a human from what I saw as Brody's best friend. I had heard he had gotten hormone injections and all that but to me I was like, whatever, maybe that's Tuesday.\" \"It was so back in the day and I loved titties so much, I thought maybe he just wanted titties to rub on, like his own titties, I don't know. He was a ghost.\"\n\nHis and Heidi's reality TV future:\n\n\"My own show, the paperwork's signed. We'll see if it ever goes onto an actual ... one thing I've learned about networks is they'll pay you and maybe the show [will never happen]. I've now been paid for two shows, whole seasons, that never went.\"\n\nOn his tense relationship with his sister:\n\n\"Sisters talk shit. Some people have sisters they get along with and some don't. It doesn't phase me having a hater in my family.\"\n\nWhether he and Heidi have a sex tape:\n\n\"Hell no. I went and heard out the offers, I'm not about to do a sex tape for back end, no pun intended. If you had written me in 2007 a $10 million check, for sure I would have done it. [Would you do one now?] Yeah, it's $10 million. [With a pregnant Heidi?] It's $10 million.\"\n\nThe interview comes after Pratt and his wife released a spoof of Taylor Swift's \"Look What You Made Me Do\" -- you'll definitely want to watch that below.", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2017/08/30/spencer-pratt-heidi-montag-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2017/08/30/spencer-pratt-heidi-montag-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/08/30/spencer-pratt-drags-lauren-conrad-and-caitlyn-jenner-reveals-secret-connection-to-ryan-gosling/", "title": "Spencer Pratt Rips Lauren Conrad Over Failed Magazine Cover; Says 'Bruce Jenner Is Like the Worst Person Ever'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Spencer Pratt Rips Lauren Conrad Over Failed Magazine Cover; Says 'Bruce Jenner Is Like the Worst Person Ever'", "description": "''Lauren Conrad just blew it for us, having the worst selling magazine cover in the history of the publication.''", "image": "https://toofab.akamaized.net/2017/08/30/spencer-pratt-heidi-montag-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "''Lauren Conrad just blew it for us, having the worst selling magazine cover in the history of the publication.''", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/08/30/spencer-pratt-drags-lauren-conrad-and-caitlyn-jenner-reveals-secret-connection-to-ryan-gosling/", "site_name": "toofab", "type": "article", "title": "Spencer Pratt Rips Lauren Conrad Over Failed Magazine Cover; Says 'Bruce Jenner Is Like the Worst Person Ever'", "description": "''Lauren Conrad just blew it for us, having the worst selling magazine cover in the history of the publication.''", "image": "https://toofab.akamaized.net/2017/08/30/spencer-pratt-heidi-montag-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": ["https://www.youtube-nocookie.com/embed/XjBNAOa8QGc"], "publish_date": 1504022400.0, "source": "http://toofab.com", "summary": ""}