{"url": "https://vaaju.com/all-times-meghan-markles-bff-priyanka-chopra-had-the-future-royal-back-at-peoples-choice-awards/", "text": "5. The Time She Noted That Markle is still her Same Texting Girl's Girl:\n\nWhen you talked about the New Season Quantico this week, Chopra opened the The Rachael Ray Show about Markle. She said that they still kept contact even though her life has changed dramatically.\n\n\"I think she has a phone. She is a girl girl and I have known her for three years now,\" she said before she became a bit more serious. \"I'm so fond of everything that has happened to her because I really feel she's one of the female icons that I think might be a strong idol for girls around the world because she really cares about the world, really cares \"she noted before she added:\" But she still writes a lot, which is great! \"\n\n6. Her letter to Markle for Time:\n\nMarkle was one of Time most influential people in 2018 who wrote the letter after her for the newspaper? Chopra, of course! \"Something among biryani, poutine and endless conversations I realized how deeply Meghan Markle cares about the world. With her what you see is right and what you get is a relativable young woman with her heart and mind in the right place,\" she started the letter for Time . \"Her compassion, evident in the causes she supports, and her effort to break down stereotypes – evident in her actions – will connect her to a generation with great need for kindness.\"\n\nChopra continued to write: \"This ever smiling, strong free freedom found his prince, fell in love and, in turn, made a cynical world faith in tales again. But more than anything else, Meghan is an important influencer in a world that needs strong public figures to respect and look up. The world can be inspired by. Meghan, standing shoulder to shoulder with Harry, will be a princess for the people. \"\n\n\" Always love my friend, live happily ever, \"she concluded.", "images": ["https://akns-images.eonline.com/eol_images/Entire_Site/201843/rs_634x1024-180503150238-634.priyanka-chopra.ct.050318.jpg?fit=inside|900:auto&output-quality=90", "https://akns-images.eonline.com/eol_images/Entire_Site/2018031/rs_600x600-180131123015-600-meghan-markle-priyanka-chopra.jpg?fit=around", "https://akns-images.eonline.com/eol_images/Entire_Site/20171121/rs_634x1024-171221041525-634-PHMM-MK122117.jpg?fit=inside|900:auto&output-quality=90", "https://vaaju.com/wp-content/themes/sahifa/favicon.ico", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://vaaju.com/wp-content/themes/sahifa/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "All times Meghan Markles BFF Priyanka Chopra had the future royal back! at People's Choice Awards", "meta_data": {"generator": "WordPress 4.9.13", "viewport": "width=device-width, initial-scale=1.0", "verifyownership": "b1e371e2ddbe42a06d65db4cee9fa13e"}, "movies": [], "publish_date": null, "source": "https://vaaju.com", "summary": ""}