{"url": "https://www.bustle.com/p/jennifer-lawrence-met-lisa-rinna-from-real-housewives-of-beverly-hills-her-reaction-is-totally-perfect-photos-5551294", "text": "When she's not winning Academy Awards, Jennifer Lawrence is just like every other 27-year-old woman in America: she loves to watch endless marathons on Bravo. On Saturday, Nov. 24, Jennifer Lawrence finally met Lisa Rinna, current star of Real Housewives of Beverly Hills, and literally no one could handle the moment. Rinna's daughter Amelia Gray Hamlin captured the moment in a series of Instagram stories, where it seems RHOBH superfan Lawrence bumped into the mother and daughter while enjoying dinner in Los Angeles.\n\nThe photos of the photoshoot via Rinna's daughter are priceless. Lawrence looks absolutely overjoyed, and Rinna's working her classic dramatic pout. It's just really, really fun to see these women having the best time. To Hamlin's credit, she seemed chill about an Oscar winning actor flipping out over meeting her mom at dinner. Most teenagers might freak out in the presence of The Hunger Games' Katniss Everdeen, X-Men's Mystique, or any other number of Lawrence's big movie characters. When you're the daughter of a daytime soap opera icon and Harry Hamlin, though, perhaps you're just used to everyone around you being fabulous.\n\nBehold, the moment when Lawrence met Rinna:\n\nJust look at those faces. Jennifer Lawrence has long been open about her obsession with Bravo franchises. Obviously, Lawrence encountering Rinna by chance was a big deal for her. Let's be thankful Rinna's 16-year-old daughter was there with a cool head to capture the moment for everyone. Hamlin documented the meet-cute with a series of pictures and escalating captions. \"Twitter-worthy,\" she wrote at first, adding \"Jennifer Lawrence looks like she's seen a ghost. I'm done. Goodnight. Tuck. Me. In.\" Okay, so maybe she wasn't as chill about it as it looked.\n\nThe actor was so excited to meet Lisa Rinna, it's honestly kind of adorable. Lawrence loves her so much, she even invented a drinking game she plays during Rinna's scenes. Based on the pictures, though, she wasn't the only one freaking out. The second photo Hamlin posted to her story is caption-free, because it doesn't need one: Rinna and Lawrence taking a selfie and smiling, as if they just can't believe they're really there together. It's so warm, and genuine — it has to be a candid. Honestly, it looks like Lawrence might cry. I mean, look at that big smile.\n\nOf course, this wasn't Lawrence's first close encounter with a celebrity idol. She had a birthday dinner at one of RHOBH star Lisa Vanderpump's restaurants, and reportedly called Bravo's Andy Cohen personally to ask for details about RHONY star LuAnn De Lesseps' divorce. In fact, the Oscar winner just loves reality television in general. Earlier in November, Lawrence hosted an episode of Jimmy Kimmel Live! and used it as an opportunity to fawn over guest Kim Kardashian. Several years ago, Lawrence was involved in a car accident that by her own admission she caused because she thought she saw the star of TLC's Here Comes Honey Boo Boo on the street. J.Law is just as big a fan of reality TV as you and me. Yup, Oscar winners can be big Bravo fans and have fangirl moments, too.\n\nWhile that might not have been the case, on the bright side, her budding friendship with Kris Jenner seems to be extremely real. On more than one occasion, Jenner has had Lawrence over for dinner, including one night where the actor \"drank five martinis and wound up naked\" in Jenner's epic closet, according to Elle. Maybe a best friendship with Rinna is next. Maybe Lawrence will guest star on RHOBH! After all, she's met the cast's two Lisas. Now, there's an idea to be thankful for.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/8/808cb38d-b273-4f3c-adba-48f61a9f1e35-getty-1206486671.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/25/7b08f3d3-b165-4dc4-8678-dc78a41da841-getty-862211706.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/3/194ae6f8-bcef-4f14-b94e-ad8aa42bad93-getty-1181741946.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/25/7b08f3d3-b165-4dc4-8678-dc78a41da841-getty-862211706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/5/ffe0125c-67d7-4cbc-9c03-9ef3c732f278-getty-1176902899.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/0dc67634-7fac-45d6-a7e9-eea45c7501a0-getty-1211247217.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/25/7b08f3d3-b165-4dc4-8678-dc78a41da841-getty-862211706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/jennifer-lawrence-met-lisa-rinna-from-real-housewives-of-beverly-hills-her-reaction-is-totally-perfect-photos-5551294", "title": "Jennifer Lawrence Met Lisa Rinna From 'Real Housewives Of Beverly Hills' & Her Reaction Is Totally Perfect — PHOTOS", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/jennifer-lawrence-met-lisa-rinna-from-real-housewives-of-beverly-hills-her-reaction-is-totally-perfect-photos-5551294", "type": "article", "title": "Jennifer Lawrence Finally Met 'Real Housewives Of Beverly Hills' Lisa Rinna & The Photos Are So Amazing", "description": "When she's not winning Academy Awards, Jennifer Lawrence is just like every other 27-year-old woman in America: she loves to watch endless marathons on Bravo. On Saturday, Nov. 24, Jennifer Lawrence finally met Lisa Rinna, current star of Real…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/25/7b08f3d3-b165-4dc4-8678-dc78a41da841-getty-862211706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "When she's not winning Academy Awards, Jennifer Lawrence is just like every other 27-year-old woman in America: she loves to watch endless marathons on Bravo. On Saturday, Nov. 24, Jennifer Lawrence finally met Lisa Rinna, current star of Real…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}