{"url": "https://www.bustle.com/p/stassis-boyfriend-beau-clarks-job-is-a-good-clue-he-the-vanderpump-rules-star-will-last-15529572", "text": "Stassi Schroeder has admittedly dated a lot of duds. Just on her time on Vanderpump Rules, she’s taken up relationships with Jax Taylor, which ended well for no one; that bartender Frank who wanted to fight Jax; and broadcaster Patrick Meagher, who clearly thought he was way too good to be on a reality show. Now, Stassi is dating Beau Clark, and it seems like these two are really meant to be. Beau from Vanderpump Rules also has a normal job — he’s not a SURver or bartender or actor, which means that he’s removed from much of the SUR drama. Hey, maybe these two really could work.\n\nBeau and Stassi met when Stassi finally let her friends — fellow Vanderpump castmates Kristen Doute and Katie Maloney-Schwartz — set her up with him. Of their relationship, Stassi told Entertainment Tonight, \"I can just be myself [with him]. Legitimately, I feel so comfortable and happy and I just have fun and he just, literally, just I love him for him and he loves me for me,\" she said. \"I just want to be around him all the time. And I've really never had that, which is kinda sad, I guess. But, I have it now.\"\n\nEveryone deserves that feeling, so it's wonderful now that Stassi has it. She also told Entertainment Tonight that they had to have the \"I'm on a reality show\" talk very early in their relationship. Stassi said that when they first started dating, Beau was all, \"No, I have a normal career.\" Eventually, though, Beau agreed to film with her, and ended up even enjoying it. \"He loves it, and he's best friends with all my best friends, and it's not even that they're my best friends now, they're our best friends,\" Stassi continue.\n\nBeau's day job, by the way, is that of a commercial casting and advertising associate, according to E! News. That means that he helps fill commercials with people so that companies can sell things to other people. A search on LinkedIn doesn't turn up any leads, so maybe he doesn't have one, or he doesn't go by \"Beau Clark\" on it. No matter, though — Beau is in a place where he doesn't need Vanderpump Rules because he has an actual career. That's better in the long run, because it alleviates any doubt that he's with for Stassi for fame (or infamy). He seems to be already be capitalizing on all those precious sponcon offers, but really, can you blame him?\n\nIt's a true pleasure to watch Beau and Stassi, and the rest of the Vanderpump cast seems to feel the same way: Brittany told Us Weekly that she thinks Stassi and Beau are \"adorable\" together. \"I think they're great for each other,\" Brittany said. Jax, Stassi's ex, agreed, saying, \"Finally she's got a good guy, she's got a great guy, and they both really love each other.”\n\nStassi deserves happiness, so this Vanderpump Rules fan is happy she found her Beau.", "images": ["https://imgix.bustle.com/uploads/getty/2020/3/31/34f92466-677d-4d20-8fa8-44acce4e45d7-getty-1203531335.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/12/17/724429c1-9bdb-4a6f-996b-571bb4185f54-nup_179337_0956.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/3/30/d3d759ad-4a62-4aad-8c0f-291da7dcd980-getty-1165247512.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/12/17/724429c1-9bdb-4a6f-996b-571bb4185f54-nup_179337_0956.JPG?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/cbae4fb9-7857-4a5b-9742-f0ebc0c0e973-153499_3661.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/469f5b19-7ef1-4007-ac39-11cc3090c544-screen-shot-2020-04-07-at-45323-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/12/17/724429c1-9bdb-4a6f-996b-571bb4185f54-nup_179337_0956.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/stassis-boyfriend-beau-clarks-job-is-a-good-clue-he-the-vanderpump-rules-star-will-last-15529572", "title": "Stassi's Boyfriend Beau Clark's Job Is A Good Clue He & The 'Vanderpump Rules' Star Will Last", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/stassis-boyfriend-beau-clarks-job-is-a-good-clue-he-the-vanderpump-rules-star-will-last-15529572", "type": "article", "title": "Stassi's Boyfriend's Job Is A Good Clue He & The 'Vanderpump' Star Will Last", "description": "Stassi Schroeder has admittedly dated a lot of duds. Just on her time on Vanderpump Rules, she’s taken up relationships with Jax Taylor, which ended well for no one; that bartender Frank who wanted to fight Jax; and broadcaster Patrick Meagher, who…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/12/17/724429c1-9bdb-4a6f-996b-571bb4185f54-nup_179337_0956.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Stassi Schroeder has admittedly dated a lot of duds. Just on her time on Vanderpump Rules, she’s taken up relationships with Jax Taylor, which ended well for no one; that bartender Frank who wanted to fight Jax; and broadcaster Patrick Meagher, who…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}