{"url": "https://ew.com/golden-globes/2018/12/06/golden-globes-nominations-snubs-4/", "text": "The 2019 Golden Globes nominations are out. Let’s first hit some surprises, because there were some rather huge ones on the TV side.\n\nNBC’s fan favorite The Good Place was finally honored for best comedy series. Sacha Baron Cohen unexpectedly crashed the best actor in a comedy category for Showtime’s political prank series Who Is America? The excellent imported BBC/Netflix thriller Bodyguard got a best drama series nod. And Candice Bergen was nominated for CBS’ low-rated (and presumed canceled) Murphy Brown reboot. With the exception of The Good Place honor, top oddsmakers did not see any of those coming.\n\nWe’ll have more of surprises along the way. But here are the biggest snubs in the TV categories.\n\nThe Handmaids Tale (Hulu).The dystopian drama swept the Emmys for its debut season in 2017 and won for best drama series at the Globes last year. Yet season 2 failed to get a nomination in the top category, and it was a title on every prediction list (stars Elisabeth Moss and Yvonne Strahovski were both nominated, as expected). This is a pretty shocking omission, though the latest season was admittedly more divisive among critics and fans than the first.\n\nWestworld (HBO). Another big drama series snub. The second season cleaned up at the Emmys a few months ago, with four wins, but aside from a supporting nod for Thandi Newton, the Hollywood Foreign Press was apparently less impressed. Actors Ed Harris, Jeffrey Wright and Evan Rachel Wood were all left out. Also absent from the drama category: The second season of Ozark (Netflix) was snubbed, though star Jason Bateman was nominated.\n\nAtlanta (FX): The second season of the innovative rap-scene comedy, despite being an Emmy favorite, was surprisingly shut out of the top comedy slots (though star Donald Glover was nominated). Also snubbed was another Emmy darling, Netflix’s ’80s wrestling dramedy GLOW (yet actress Alison Brie got a nod). There was an upside: The Good Place (NBC) finally broke into this category with its first Globes comedy series nomination, and star Kristen Bell was nominated for lead actress in a comedy too.\n\nSterling K. Brown,John Krasinski, Liev Schreiber, Milo Ventimiglia and Bob Odenkirk. The best actor in a drama category featured some serious upsets. Last year’s winner, Brown, was fully expected to at least get a nomination once again for This Is Us. Three-time nominee Odenkirk was fully expected to get recognized for Better Call Saul. Krasinski was fully expected to get nominated for his work in Amazon’s Jack Ryan. Five-time nominee Schreiber was fully expected to get nominated once again (due to the HFPA’s curious love for Showtime’s Ray Donovan). And Ventimiglia, well, he wasn’t fully expected to get a This Is Us nod, but some thought he might squeeze in. Instead, there were new additions like Stephan James for Amazon’s Homecoming and Billy Porter for FX’s Pose.\n\nJodie Comer. The Killing Eve actress was expected to get a nomination for lead actress in a drama series along with her co-star Sandra Oh (who was nominated), yet was shut out. Robin Wright was also snubbed for the final season of Netflix’s House of Cards. Instead, there was a minor surprise on the list: Outlander’s Caitriona Balfe, who was nominated last year, but wasn’t necessarily expected to make the list this time given the intense competition from newcomers like Oh and Homecoming‘s Julia Roberts.\n\nTed Danson. While The Good Place received nominations for best comedy series and an actress nod for Kristen Bell, Danson, who was considered the most likely nom of the three, was left out. Blame Sacha Baron Cohen?\n\nManiac (Netflix): Many thought the psychological dark comedy-drama was brilliant and unlike anything else on TV this year, so it was expected to get a nom in the movie-limited series category. Nope. Star Emma Stone was also left out for Maniac — the Globes snub which seemed to elicit the most Twitter upset this morning among the TV categories. Stone did receive a supporting nod for her work in the movie The Favourite, however.\n\nPatrick Melrose (Showtime) was also skipped in the series limited series category, despite predictions, though that’s more understandable given the project’s somewhat lackluster reaction — all the praise was around the boozy performance of star Benedict Cumberbatch (who was of course nominated). Another Showtime snub in the movies-mini category: Benicio Del Toro, who was given strong odds to land a mention for his work in Escape at Dannemora.\n\nMovie nominations snubs and surprises here.\n\nFull list of Golden Globes nominations.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F12%2Ftv-snubs-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F12%2Ftv-snubs-2000.jpg", "keywords": [], "authors": ["James Hibberd"], "canonical_link": "https://ew.com/golden-globes/2018/12/06/golden-globes-nominations-snubs-4/", "title": "Golden Globes biggest TV nomination snubs and surprises", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "Even by Golden Globes standards, there were a LOT of snubs and shocks this year", "og": {"title": "Golden Globes biggest TV nomination snubs and surprises", "type": "article", "site_name": "EW.com", "url": "https://ew.com/golden-globes/2018/12/06/golden-globes-nominations-snubs-4/", "description": "The 2019 Golden Globes nominations are out. Let’s first hit some surprises, because there were some rather huge ones on the TV side. NBC’s fan&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F12%2Ftv-snubs-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/golden-globes/2018/12/06/golden-globes-nominations-snubs-4/", "description": "Even by Golden Globes standards, there were a LOT of snubs and shocks this year", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F12%2Ftv-snubs-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/golden-globes/2018/12/06/golden-globes-nominations-snubs-4/", "title": "Golden Globes biggest TV nomination snubs and surprises", "description": "Even by Golden Globes standards, there were a LOT of snubs and shocks this year", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F12%2Ftv-snubs-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1544025600.0, "source": "https://ew.com", "summary": ""}