{"url": "www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "text": "This isn't the first time Blake's been drinking has been in the spotlight.\n\nCountry singer and Voice judge Blake Shelton fell on stage while performing at a music festival in Oregon this past weekend. The following day, he tweeted out a plea for the footage and admitted he had been drinking.\n\n“Ok Pendleton I know somebody is bound to have video of me falling on stage last night,” The 42-year-old wrote. “Please!! I have to see it! Post that sh-t! And yes I had been drinking. A lot…”\n\nVideo of the singer falling quickly spread around the internet.\n\nOk Pendleton I know somebody is bound to have video of me falling on stage last night!! Please!! I have to see it!!! Post that shit! And yes I had been drinking. A lot.. — Blake Shelton (@blakeshelton) July 15, 2018\n\nIn the video, Shelton is seen losing his balance while holding a microphone. He quickly gets back up and grabs his guitar. While some people found the fall entertaining, many people were not amused.\n\n“So, that’s the type of quality show that you put on … for people that spend their hard earned money to come see you, is for you to show up drunk?” one follower said. “That’s some Justin Bieber on Hennessy, throwing up on stage, nonsense right there!”\n\nShelton retweeted that message and said: \"Oh I’m sorry ma’am... This account is meant for people who actually have a sense of humor.. We’re not accepting cry baby tweets today.. Maybe try again tomorrow!\"\n\nThis isn't the first time Shelton's drinking has come into the spotlight.\n\nAfter his divorce from fellow country superstar Miranda Lambert in 2015, rumors began circling that he was headed down a dangerous, alcohol-filled spiral. In Touch published a front-page story alleging that he was \"drinking vodka before noon\" and that his friends were begging him to get help. It also claimed that his alleged alcohol addiction is what destroyed his marriage to Lambert.\n\nIn response to the story, Shelton sued the magazine, and though he admitted to posting about drinking and alcohol on social media he denied the claims that he was a \"raging alcoholic.\"\n\nAmong the claims he said were false include ones that he had started drinking when he was 14, as a way to cope with his brother's death. Richie Shelton died in a car accident when he was 24 and Shelton was just 14.\n\nHe also denied he magazine's claims that he went to rehab, and said the fake story was built on \"friend-of-friend gossip\" and a guy who believes he can \"spot alcoholism.\"\n\n“It’s simply a case of Blake having supersized this persona of him having fun and drinking,” says a source close to Shelton to People of the claims.\n\n\"My tweets are intended to amuse and get a reaction from my fans,\" he explains. \"They are exaggerated figments of my imagination, and from the reactions I get, I think my fans understand that,\" Shelton said in the lawsuit.\n\nHappy Independence Day everybody!!!!! I’m proud to be an American!!! Aaaannnd I’m drinking to celebrate... — Blake Shelton (@blakeshelton) July 4, 2018\n\nIn 2017, Radar Online reported that Shelton's current girlfriend Gwen Stefani told him that she wasn't walking down the aisle until he stopped drinking.\n\nAccording to an insider, he lost 85 pounds that year thanks to Stefani putting him on a no-drinking diet. However, during that time he was also seen leaving a liquor store in L.A. with multiple boxes of tequila.\n\n“When Gwen is away, Blake seems to play! Or, at the very least, take a few cheat days,” a source said.\n\nEmily Blackwood is an editor at YourTango who covers pop culture, dating, relationships and everything in between. Every Wednesday at 7:20 p.m. you can ask her any and all questions about self-love, dating, and relationships LIVE on YourTango’s Facebook page. You can follow her on Instagram, Twitter or on her website at www.emily-blackwood.com.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/BlakeShelton.jpg?itok=aIe0dsUe", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BlakeShelton.jpg?itok=YCuqk6gH"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BlakeShelton.jpg?itok=YCuqk6gH", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "title": "Does Blake Shelton Have A Drinking Problem? New Details About The Fall He Took On Stage After Drinking 'A Lot'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "celebrity, Blake Shelton, gwen stefani, Miranda Lambert, drinking, alcoholic, addiction, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/emily-blackwood", "published_time": "2018-07-16T23:12:10", "modified_time": "2018-07-16T23:12:10"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "title": "Does Blake Shelton Have A Drinking Problem? New Details About The Fall He Took On Stage After Drinking 'A Lot'", "description": "This isn't the first time Blake's been drinking has been in the spotlight.", "updated_time": "2018-07-16T23:12:10", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BlakeShelton.jpg?itok=YCuqk6gH", "width": 620, "height": 309}}, "description": "Is Blake Shelton an alcoholic? The country singer admitted to being drunk on stage, and this isn't the first time his drinking has been a problem. We have all the details about his possible addiction and how his girlfriend Gwen Stefani is dealing with it.", "abstract": "Emily Blackwood is an editor at YourTango who covers pop culture, dating, relationships and everything in between. Every Wednesday at 7:20 p.m. you", "robots": "follow, index, noodp, noydir", "news_keywords": "blake shelton, blake shelton drinking, video blake shelton falling, gwen stefani, gwen stefani blake shelton, miranda lambert, blake shelton alcoholic, blake shelton rehab", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "title": "Does Blake Shelton Have A Drinking Problem? New Details About The Fall He Took On Stage After Drinking 'A Lot'", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/BlakeShelton.jpg?itok=YCuqk6gH", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/hkJ8BKh_Dxg"], "publish_date": 1531753930.0, "source": "http://www.yourtango.com", "summary": ""}