{"url": "https://www.cbssports.com/wwe/news/daniel-bryan-formally-cleared-by-wwe-to-return-to-in-ring-action/", "text": "Three years after what was expected to be the final match of his career, Daniel Bryan has been medically cleared to return to the ring, WWE officials confirmed Tuesday.\n\nBryan, 36, who formally retired in February 2016 due to concussion issues, has been formally cleared by three outside neurosurgeons, neurologists and concussion experts, including the well-known Dr. Robert Cantu. WWE medical director Dr. Joseph Maroon has also cleared Bryan to return.\n\nThe announcement of Bryan's return opens up the door for a possible match at WrestleMania 34 on Sunday, April 8 in New Orleans.\n\nBig fan of WWE? Subscribe to our podcast -- In This Corner with Brian Campbell -- where we go in depth on everything you need to know in WWE each week.\n\nThe WWE storyline over the past year surrounding Bryan, who serves as the on-screen general manager of SmackDown Live, has constantly teased a potential return to action.\n\nOutside the walls of WWE, Bryan has only fueled those suspicions by openly campaigning for an in-ring comeback. He even suggested that leaving WWE once his contract expired to pursue outside options was a viable likelihood as he believed other organizations would easily clear him to wrestle based on what his personal doctors' diagnoses.\n\nBryan, who is married to WWE superstar Brie Bella, has walked out the emotional fallout of his forced retirement in a very public manner through the WWE Network tribute documentary \"Thank You Daniel\" and the E! reality series \"Total Bellas.\" He has also been relentless in his search for medical clearance by undergoing constant testing and experimental procedures from a litany of doctors.\n\nSaying goodbye to the ring was one of the hardest moments of my life. But thanks to the amazing people supporting me, I was able to keep fighting for my dream. This moment feels surreal and I'm glad to be able to talk to you all at the beginning of #SDLive tonight. — Daniel Bryan (@WWEDanielBryan) March 20, 2018\n\nInjuries have long been a theme in Bryan's unlikely rise from underdog independent wrestler to mainstream crowd favorite on the main event level. After dramatically winning the WWE world heavyweight championship following a pair of classic matches at WrestleMania 30 in 2014, a neck injury forced Bryan to relinquish the title and miss seven months of action.\n\nBryan went on to win the intercontinental title in a ladder match at WrestleMania 31 the following year but would have his final match just one month later on SmackDown when he teamed with John Cena to defeat Cesaro and Tyson Kidd. After being sidelined with head injuries, Bryan went on to experience post-concussion seizures that he originally hid from WWE only to reveal later on the urging of his wife.\n\nSubsequent tests showed a lesion on the front of Bryan's brain, which led to his decision to retire. Bryan, who went on to undergo hyperbaric oxygen therapy treatments over the past two years, has routinely claimed the damage to his brain has healed over time.\n\nBig fan of WWE? Subscribe to our podcast -- In This Corner with Brian Campbell -- where we go in depth on everything you need to know in WWE each week.\n\nBryan, leader of the popular \"Yes Movement,\" is a four-time world champion in WWE and among the most popular characters in professional wrestling worldwide over the past two decades.\n\nWhen speaking about his intentions to return over the past year, Bryan has mentioned a part-time schedule and an in-ring style -- modeled after legends like Terry Funk and Jerry \"The King\" Lawler -- that is less damaging to his body.\n\nEntering Tuesday night's episode of SmackDown Live, Bryan remains embroiled in a storyline as a sympathetic authority figure for top heels Kevin Owens and Sami Zayn in their battle against commissioner Shane McMahon, who initiated a temporary leave of absence last week only to be beaten down by Owens and Zayn, leading to McMahon winding up in a local medical facility.", "images": ["https://sportshub.cbsistatic.com/i/r/2020/02/03/041e2304-9f18-4ec6-8ae8-988da87437a3/thumbnail/170x170/4df151d46e829bac6a185b2015af55fb/wwe-charlotte-flair-02032020-170.jpg", "https://sportshub.cbsistatic.com/i/r/2018/03/20/20bd130a-6a6b-45d6-b69f-5c0fa82ae061/thumbnail/1200x675/56fab6f46b9a07228685b443af3d8619/daniel-bryan-wwe-two-belts.jpg"], "top_img": "https://sportshub.cbsistatic.com/i/r/2018/03/20/20bd130a-6a6b-45d6-b69f-5c0fa82ae061/thumbnail/1200x675/56fab6f46b9a07228685b443af3d8619/daniel-bryan-wwe-two-belts.jpg", "keywords": [], "authors": ["Brian Campbell", "Cbs Sports Insider"], "canonical_link": "https://www.cbssports.com/wwe/news/daniel-bryan-formally-cleared-by-wwe-to-return-to-in-ring-action/", "title": "Daniel Bryan formally cleared by WWE to return to in-ring action", "meta_data": {"google": "notranslate", "description": "One of WWE's most popular superstars has been waiting three years for this moment", "og": {"site_name": "CBSSports.com", "title": "Daniel Bryan formally cleared by WWE to return to in-ring action", "description": "One of WWE's most popular superstars has been waiting three years for this moment", "image": "https://sportshub.cbsistatic.com/i/r/2018/03/20/20bd130a-6a6b-45d6-b69f-5c0fa82ae061/thumbnail/1200x675/56fab6f46b9a07228685b443af3d8619/daniel-bryan-wwe-two-belts.jpg", "type": "article", "url": "https://www.cbssports.com/wwe/news/daniel-bryan-formally-cleared-by-wwe-to-return-to-in-ring-action/"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "https://www.facebook.com/cbssports"}, "fb": {"pages": 25902406772, "app_id": 297742330311988, "admins": 100002967552623}, "twitter": {"account_id": 14885860, "card": "summary_large_image", "url": "https://www.cbssports.com/wwe/news/daniel-bryan-formally-cleared-by-wwe-to-return-to-in-ring-action/", "title": "Daniel Bryan formally cleared by WWE to return to in-ring action", "description": "One of WWE's most popular superstars has been waiting three years for this moment", "image": "https://sportshub.cbsistatic.com/i/r/2018/03/20/20bd130a-6a6b-45d6-b69f-5c0fa82ae061/thumbnail/1200x675/56fab6f46b9a07228685b443af3d8619/daniel-bryan-wwe-two-belts.jpg", "site": "@cbssports", "creator": "@BCampbellCBS"}, "msapplication-tooltip": "CBSSports.com features live scoring and news for NFL football, MLB baseball, NBA basketball, NHL hockey, college basketball and football. CBSSports.com is also your source for fantasy sports news.", "msapplication-starturl": "https://www.cbssports.com/", "msapplication-window": "width=1024;height=768", "msapplication-navbutton-color": "#1483b2", "google-site-verification": "EdjXVFTZ6BgUzS3Void8cMiXXzE6bXDvNg-Yjl3VZj8"}, "movies": [], "publish_date": null, "source": "https://www.cbssports.com", "summary": ""}