{"url": "https://www.etonline.com/ladies-platinum-life-talk-love-heartbreak-drama-new-reality-series-exclusive-89184", "text": "Get ready to meet the \"queens of the hip-hop scene!\"\n\nThe girlfriends, wives and fiancées of the biggest names in rap have come together for The Platinum Life, a new reality series on E! that will showcase their lives in the spotlight.\n\nA few of the ladies recently invited ET to experience the \"VIP lifestyle\" with them at the Anaheim Convention Center in Anaheim, California, where Nelly, who is dating one of the gals, was performing. From their favorite perks to the crazy drama, Shantel Jackson, Asiah Collins and Alycia Bella tease what fans can expect from their all-new show.\n\nMORE: Nelly Talks Tour Life, Keeping Music 'Fresh' & What Makes His Girlfriend Stand Out From the Rest (Exclusive)\n\nShantel Jackson\n\nE!\n\nShe's sweet, confident and an all-around awesome support system for her boyfriend, Nelly, whom she's been dating for three and a half years. While chatting with ET, Shantel recalled the exact moment she and Nelly met, and the qualities she loves about him.\n\n\"Nelly and I actually met through a mutual friend of ours and I was so honestly hell-bent on, 'No, I don't think I want to get into another relationship right now or date another celebrity,'\" said Shantel, who previously dated Floyd Mayweather. \"He kept pressing our mutual friend like, 'Just tell her to come chill with me at the studio, I just want to meet her.' I ended up just giving in one day, and honestly, we've been inseparable ever since.\"\n\n\"I'm always proud of him,\" she continued. \"I love the way he treats his family, he takes care of his mother, he takes care of his father. Family is really important to him and it's really important to me as well. We're also both adventurous, outdoorsy. He makes me laugh, which is really important. We can be around each other non-stop and not be at each other’s throats like, 'Oh my gosh, I gotta get away from you.' I really enjoy that… I enjoy his company.\"\n\nWhen she's not by Nelly's side, Shantel loves hanging out with her girlfriends and working on her own business ventures. She tells ET that the show will be a mix of all the glitz and glamour, the partying, the drama and an inside look at what goes on behind the scenes.\n\n\"All of that is our lives,\" she explained. \"We do party, we do get to see the concerts that we want to see, we get to watch our men perform. Of course, we are around these other women in the circle and all of us are not going to agree on everything -- [it's natural] to bump heads with someone along the lines and that’s real life.\"\n\n\"But even if we're in disagreements one day, I think we still find common ground,\" she added. \"We respect each other enough to not have to throw drinks or throw hands. Keep it cute, classy and catty.\"\n\nAsiah Collins\n\nE!\n\nKid Ink's wife has been with the rapper since they were just \"young, broke kids\" in high school -- their first date was a trip to the movies followed by $3 sushi! -- but after all this time together, there's nothing Asiah loves more than being his \"Main Chick.\"\n\n\"I feel like the only girl in the world, to be honest,\" she gushed. \"He's very good at making me feel like I'm the only chick that matters.\"\n\nAnd while she doesn't mind being known as Ink's wife, Asiah's excited for fans to see a different side of her on the show, which premieres on the couple's one-year wedding anniversary. In addition to supporting her husband, Asiah keeps busy by raising their 1-year-old daughter, Aislin, and working on her own dreams.\n\n\"Oh my God, I'm still trying to figure that out,\" Asiah said, when asked how she balances it all in this industry. \"Sometimes it gets really tricky, but most of the time it's just about having a really good support system.\"\n\n\"But I'm excited for fans to learn that I do have a brain and a personality and I'm out here making moves,\" she added. \"Also, just more about the roles that I play on tour, helping Ink out. I'm not only there to be a pretty face -- I'm actually contributing to the tour, handling the merch, etc. Anything he needs me to do, I'll do it. It doesn't matter what it is.\"\n\nAsiah confirmed her and Ink's baby girl will make a few appearances on the show. She says their lives have changed drastically since welcoming a child, and fans will get to see a part of that world.\n\n\"You have to keep it fresh,\" she said of how she and Ink have made it work all these years. \"We both get so busy, and having a toddler now as well, it's just knowing that you don't always have the proper time to be intimate. So, you just get it in when you can and how you can. We also plan date nights. Every Wednesday night we'll go somewhere, just the two of us.\"\n\nAlthough they seemingly have their hands full already, Asiah said she and Ink are currently \"trying\" for another kid.\n\n\"I have it on my mind. I've mapped it out to wait until after my 30th birthday next year,\" Asiah, who celebrated her 29th birthday on the day of our interview, revealed. \"So, the plan is in a year to get knocked up the night of my 30th birthday. But we've both been feeling the fever a lot lately. So, we'll see if we last that long.\"\n\nAlycia Bella\n\nE!\n\nWhen filming began for The Platinum Life, Alycia had just gotten out of a long-term relationship with Ty Dolla $ign (who is now dating Fifth Harmony's Lauren Jauregui). After calling it quits from the \"Paranoid\" rapper, Alycia is ready to show the world what it's like to hold her own as the single girl in the group.\n\n\"When it comes to love, I feel like it's just something that happens -- you don't try, you don't force it,\" she said. \"I'm not feeling like I need a man at the moment. I'm off men right now! I'm cool without a guy and just focusing on me.\"\n\n\"I definitely probably share, like, five percent of what really happened in our relationship just out of respect for something that I feel is so real to me, and that was a part of my life for the past 10 years,\" she continued. \"It's so layered and you can't really tell a full story in sound bites. So, more so, you'll see me coming to find myself again and being able to hear my own voice again.\"\n\nShe said this newfound attitude is all thanks to the support of the girls, who helped her remember what it was like to have a voice.\n\n\"They made me realize like, 'Wow, you were Alycia before you were tied to a famous guy. You have your own dreams and ambitions and goals,'\" she explained. \"So, I think you watch me getting back to me, and that was honestly an experience in itself that I'm so appreciative of.\"\n\n\"I felt like this show is exactly what I was asking for,\" she added. \"I've been wanting my voice to be heard, I've been wanting to inspire other women that maybe have been in a situation like the one I've been in. I think that the message for women to feel empowered and strong by themselves is so important. And that I have insecurities, too. The Platinum Life doesn't mean you have it all together.\"\n\nEric Bellinger's wife, La'Myia Good, King Los' girlfriend, LoLa Monroe, Miguel's fiancée, Nazanin Mandi, and Ne-Yo's wife, Crystal Smith, also star in The Platinum Life, premiering Sunday, Oct. 15 at 10 p.m. ET/PT on E!", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/z_theplatinumlife_ladies.jpg?h=c673cd1c&itok=l6_ljNtg", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/1280_rs_634x950-171009154039-634-the-platinum-life-alycia-bella-1.jpg?itok=4VuhB2Zb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/1280_rs_634x950-171009154041-634-the-platinum-life-shantel-jackson-1.jpg?itok=Xr0LCTrN", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-10/z_theplatinumlife_ladies.jpg?h=c673cd1c&itok=U2xsMK-q", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-10/1280_rs_634x950-171009154037-634-the-platinum-life-asiah-collins.jpg?itok=yJuhgUza"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/z_theplatinumlife_ladies.jpg?h=c673cd1c&itok=l6_ljNtg", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/ladies-platinum-life-talk-love-heartbreak-drama-new-reality-series-exclusive-89184", "title": "The Ladies of 'The Platinum Life' Talk Love, Heartbreak & Drama on New Reality Series (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "The Ladies of 'The Platinum Life' Talk Love, Heartbreak & Drama on New Reality Series (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/ladies-platinum-life-talk-love-heartbreak-drama-new-reality-series-exclusive-89184", "title": "The Ladies of 'The Platinum Life' Talk Love, Heartbreak & Drama on New Reality Series (Exclusive)", "description": "Ahead of Sunday's premiere, the queens of the hip-hop scene explain what they hope fans will learn about them!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/z_theplatinumlife_ladies.jpg?h=c673cd1c&itok=l6_ljNtg", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Ahead of Sunday's premiere, the queens of the hip-hop scene explain what they hope fans will learn about them!", "title": "The Ladies of 'The Platinum Life' Talk Love, Heartbreak & Drama on New Reality Series (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍", "url": "https://www.etonline.com/ladies-platinum-life-talk-love-heartbreak-drama-new-reality-series-exclusive-89184", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/z_theplatinumlife_ladies.jpg?h=c673cd1c&itok=l6_ljNtg"}, "description": "Ahead of Sunday's premiere, the queens of the hip-hop scene explain what they hope fans will learn about them!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, Music, News, TV, The Platinum Life, Nelly", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}