{"url": "https://en.wikipedia.org/wiki/Project_Runway", "text": "American television series\n\nProject Runway is an American reality television series that focuses on fashion design. The contestants compete with each other to create the best clothes and are restricted by time, materials and theme. Their designs are judged by a panel, and one or more designers are typically eliminated from the show each week. During each season, contestants are progressively eliminated until only a few contestants remain. These finalists prepare complete fashion collections for New York Fashion Week. After the runway shows, the judges choose the winner.\n\nProject Runway was created by Eli Holzman and was hosted by supermodel Heidi Klum from 2004 to 2017. It has a varied airing history, with Bravo originating the first five seasons, followed by Lifetime for eleven more. The series' return to Bravo for the seventeenth season was announced on May 14, 2018, in the wake of The Weinstein Company's bankruptcy, pending TWC asset winner Lantern Entertainment's acquisition of the former TWC assets.[2] The show won a Peabody Award in 2008 \"for using the 'television reality contest' genre to engage, inform, enlighten and entertain.\"[3] On September 7, 2018, it was confirmed that Heidi Klum and the designers' mentor Tim Gunn would not be returning for a 17th season on Bravo because they both signed a deal to helm another fashion competition show, Making the Cut , on Amazon Video.[4] American model Karlie Kloss followed Klum as the new host, with Season 4 winner Christian Siriano replacing Gunn as mentor.[5]\n\nFormat [ edit ]\n\nProject Runway uses progressive elimination to reduce the initial field of 12 or more fashion designers down to three or four before the final challenge. Each non-finale challenge (the scope of one episode) requires the designers to develop one or more pieces of new clothing to be presented at a runway show. The challenges range in creative diversity to test the designers' ingenuity while maintaining their personal fashion design aesthetic. These challenges may include creating a garment from non-traditional materials, such as: apartment furnishings (Season 3), recyclable materials (Season 3), items from a grocery store (Seasons 1 & 5), edible food items (Seasons 1, 4 & 10), plants and flowers (Season 2), using their own clothes that they happened to be wearing (Seasons 2 & 9), designing clothing with materials from a party store (season 8) ; or designing for a certain high-profile person (such as actress Brooke Shields, figure skater Sasha Cohen or Miss USA Tara Conner); or designing for a corporate fashion line (e.g., Banana Republic; Diane von Fürstenberg; Macy's; or Sarah Jessica Parker's Bitten); or centered on a specialized theme (such as \"cocktail party\", \"wedding gown\", \"female wrestling outfit\", or \"prom dress\").\n\nThe first several seasons were filmed in New York City, at The New School University's Parsons The New School for Design. They shop for materials at a fabric store in New York's Garment District (usually at MOOD Designer Fabrics) – unless the challenge requires otherwise (e.g., denim jackets and jeans from Levi's, confectionery and souvenirs at the Hershey's Store in Times Square, or fabric at Spandex House in Season 4). The designers live together, grouped by gender, at Atlas New York (an apartment building near Parsons) during Seasons 1–3 (back again at Season 5) and at New Gotham during Season 4. Along with the network change to Lifetime, the location changed from New York to Los Angeles for Season 6 only (permanently returning to New York for Season 7.) While on the show, the designers are prohibited from leaving the apartments without authorization, making unauthorized communication with family or friends, or using the Internet to research designs. Designers are also forbidden to bring pattern books or similar how-to materials with them during the show, or risk being disqualified from the competition (as was the case of Keith Michael in Season 3 and of Claire Buitendorp in Season 16).\n\nThe designers are given a budgeted stipend to select and purchase fabric and notions, and then provided a limited amount of time to finish their designs (the shortest being 5 hours and the longest being two or three days, with the exception of fashion week when they are given 12 weeks). Often, the designers work independently, although on some challenges, contestants must work in teams or as a single collective group. Once the deadline is reached, the designers must dress their models and select their hair, make-up, and accessories. Each model walks down the runway, and the garment the contestant made is rated by a panel of judges, who score each look in several categories from 0 to 5, and often provide personal annotations and comments regarding the presented designs. Each contestant does a voice-over while the model is walking down the runway. The judges then interview the remaining designers (usually six) who garnered the highest and the lowest scores (usually a top 3 and a bottom 3), and share their opinions while listening to the designers' defense of their outfits, then confer as a group in private. The panel then announces the winning and losing designers based on their scores and other considerations. Typically, the winner receives immunity for the next challenge, and therefore cannot be eliminated. As the season progresses, immunity is disregarded during later challenges to prevent the designers from getting an easy pass in the final & crucial rounds of the competition. Other incentives given to the contestants aside from winning immunity include: The winning garment may be featured in print media, integrated into a limited edition look for a particular clothing brand, or sold at an online fashion store (e.g., BlueFly.com beginning in Season 4 onwards). Generally, the loser of each challenge is eliminated from the competition, with host Klum giving him or her a double air kiss on the runway and wishing the eliminated designer farewell her catchphrase, Auf Wiedersehen (formal German for goodbye - literal translation \"until we meet again\"), before they depart. Thus, elimination from the show is sometimes called \"being auf'd\"—a play on words as it can be interpreted as offed—and designers who receive an unusually large amount of camera time, solely to lay a predicate for their elimination from the show, are occasionally described as receiving \"the 'auf' edit.\"\n\nAfter the final challenge, the remaining three designers are then told to prepare a complete fashion collection of twelve looks to be presented at New York Fashion Week in Bryant Park. The finalists are given 12 weeks and $8,000 for this task, which they perform at their own homes or studios. While some construction work can be outsourced, the majority of the garments must be created by the designers themselves. Prior to the show, the finalists must return to New York City to oversee model casting, hair and make-up consultations, finishing touches to their clothes, final fitting on their models, and possibly an additional challenge, such as designing another outfit to blend in with the collection (as in Seasons 2, 5, 6 and 8). Their receipts are also handed over to the producers of the show to determine if they went over budget or had outsourcing done as favors, both of which are against the rules. If rules are violated, they may be forced to eliminate a crucial aesthetic factor in their presentation (e.g., Jeffrey Sebelia's blond wigs and pleated leather shorts in Season 3); or the judging panel might lower their scoring, if they insist upon using a forbidden item (e.g., Kara Saun's outsourced footwear in Season 1). The ultimate winner is selected by the judges, and receives $100,000 to start their own design line, a feature spread in Marie Claire magazine, and a mentorship from a design firm (ended on Season 3). The winner is also given the optional opportunity to sell their collection on bluefly.com. Subsequent seasons have also included a new car as part of the prize package. Prior to its 2009 dissolution, the automobile company Saturn furnished the winners' vehicles.\n\nFemale fashion models, who work with the designers throughout the season, are also in the competition. Each week, as the number of designers dwindles, the number of models is also reduced. Models are randomly pre-assigned to a designer during the first challenge, but from the second challenge onwards, the designers are able to choose the model with whom they wish to work. During weekly model eliminations, the models stand on a runway with Klum, in front of the seated group of designers. The models appear by wearing the same outfit (black dress and barefoot). The designers then pick their models in sequence, based upon their respective scores in the previous design competition. Originally, model selection happened at the start of every episode save for the first. The winner of the previous challenge receiving first pick, and the other designers picking models in order through Klum's random draw of large red shirt buttons with their names stored in a black velvet bag. However, there were times when only the winning designer was given the choice to pick with the following choices: either keep their previous model, take the losing designer's model from the last challenge, or switch models with another competing designer. Beginning with Season 6, model selection appears on a companion program, Models of the Runway, usually near the end of that show. At the end of the weekly model selection process, the one unpicked model is sent home. This losing model is also given host Klum's air kiss and Auf Wiedersehen before leaving the runway. Included in the prize package for the winning model is coverage in Elle magazine, featuring the winning designer's twelve-piece collection as part of her prize. However, certain challenges may not require the models at all, such as: giving a competing designer a head-to-toe makeover (Seasons 2 and 5), designers creating their own looks (Season 3), designing menswear (Season 4), or creating a garment for a specific client (e.g., reconstructed outfits for women who lost weight, or wrestling costumes for the WWE Divas in Season 4). Airing of the model selection ended starting Season 8.\n\nJudging [ edit ]\n\nJoining Klum in judging duties are American top designer Michael Kors, Marie Claire fashion director Nina Garcia, and a fourth guest judge, usually a fashion designer, a supermodel, a celebrity, or a professional from an industry related to the challenge given. Tim Gunn, former Chair of the Fashion School at Parsons The New School for Design and now Chief Creative Officer for Liz Claiborne Inc., co-hosts the show along with Klum and acts as a mentor to the designers, giving them suggestions and tips for their designs throughout the episode, but he does not participate in the judging. Zac Posen became a regular judge on the show at the beginning of the eleventh season, as Kors was unable to participate due to scheduling conflicts. Throughout the eleventh season, Rachel Roy alternated with Posen when he couldn't commit to being a judge for a particular episode. After the departure of Heidi Klum and Tim Gunn was announced in September 2018, designer Zac Posen released a statement confirming that he too was leaving the show.[6] Therefore, as the show returned to Bravo for Season 17 only Elle Magazine editor-in-chief Nina Garcia remained as a continuing judge. In October 2018, it was announced that fashion designer Brandon Maxwell and former Teen Vogue editor-in-chief Elaine Welteroth were joining Nina Garcia as permanent judges.[7]\n\nProduction [ edit ]\n\nOn July 4, 2006, the show's producers, The Weinstein Company, announced a five-year deal that would relocate the show to Lifetime, beginning with Season 6. In response, NBCUniversal filed a lawsuit against the Weinstein Company for violating its contract rights.[8] A September 2008 court decision granted NBCU's request for an injunction, preventing Lifetime from promoting or exhibiting \"Runway\" until further notice.[9]\n\nOn April 1, 2009, the lawsuit between The Weinstein Company and NBCUniversal was settled, with Weinstein agreeing to pay NBC an undisclosed sum for the right to move the show to Lifetime.[10][11] Season 6 began airing on Lifetime on August 20, 2009.[12] On August 27, 2009, NBC Universal wound up gaining partial ownership of Lifetime, when A&E Television Networks, which was already partially owned by NBC, acquired the channel's parent company, Lifetime Entertainment Services. It premiered on the Slice channel in Canada on September 12.[13]\n\nFollowing the show's sixteenth season, NBC reacquired the rights to the show, as a result of the bankruptcy of the Weinstein Company; Weinstein Company's assets, which including Project Runway, were acquired by Lantern Entertainment in March 2018, and by May 2018, NBC's Bravo Media LLC. NBC announced in May 2018 that the show would move back to Bravo as a reboot of the series.[14] By September 2018, host Heidi Klum and mentor Tim Gunn announced they were leaving Project Runway to start a new reality competition show for Amazon Studios; judge Zac Posen also stated he was leaving the show.[15] By October 2018, Bravo announced that Klum and Gunn would be replaced, respectively, by supermodel Karlie Kloss and the winner of Season 4, Christian Siriano. Additionally, fashion designer Brandon Maxwell and former Teen Vogue editor-in-chief Elaine Welteroth were joining Nina Garcia as permanent judges.[16]\n\nSeasons [ edit ]\n\nSeason 1 [ edit ]\n\nProject Runway premiered its first season on December 1, 2004, featuring 12 designers. Heidi Klum, Michael Kors and Nina Garcia served as judges while Tim Gunn, fashion chair at Parsons The New School for Design, served as the mentor for the designers. During this season, Project Runway received critical acclaim, including an Emmy nomination for outstanding competitive reality series. Growth in audience popularity was also dramatic from its debut to the season finale, making it a sleeper hit. Project Runway gave Bravo one of its most successful series since Queer Eye for the Straight Guy.\n\nPennsylvania-based designer Jay McCarroll won the competition with his model Julia Beynon. Kara Saun and her model Jenny Toth placed second, while Wendy Pepper and her model Melissa Haro placed third. Austin Scarlett won the fan favorite award. As his prize for winning the competition, McCarroll was eligible to receive a $100,000 cash prize, a mentorship with Banana Republic to aid in developing his own fashion label (both of which he turned down), and display of his work in the American edition of Elle magazine.\n\nAustin Scarlett produced a decoy collection for Fashion Week after being eliminated in the controversial \"Nancy O'Dell Grammy Challenge\", causing outrage among fans. His appearance at Fashion Week was an 11th hour decision made by the show's producers who were concerned that the identity of the three finalists would be revealed before the Project Runway Season 1 finale aired. The ploy was later adopted for the show's succeeding seasons.\n\nIn 2008, Jay McCarroll, in conjunction with Here! Films released the feature-length documentary \"Eleven Minutes\". The feature documentary chronicles his year-long post Project Runway journey preparing his first independent runway show for New York's Fashion Week in Bryant Park and the subsequent selling of his line to stores. Also in 2008, Jay McCarroll launched his own online fashion boutique, The Colony.\n\nSeason 2 [ edit ]\n\nThe second season premiered on December 7, 2005. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the second season. Following a nationwide search earlier in the year, 16 designers were chosen as semi-finalists and brought to New York City in June 2005. After the first challenge, called Road to the Runway, fourteen went on to compete as finalists.\n\nChloe Dao won the competition with her model Grace Kelsey. Daniel Vosovic and his model Rebecca Holliday placed second, while Santino Rice and his model Heather Brown placed third. Daniel Vosovic also won the fan favorite award.\n\nSeason 3 [ edit ]\n\nThe third season premiered on July 12, 2006, featuring 15 designers. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the third season. This season introduced a new set of sponsors, notably Macy's replacing Banana Republic, in advance of Macy's conversion of former May Company department stores.\n\nThe season finale aired on October 18, 2006. Mychael Knight was the first to be eliminated in the season finale for his collection titled \"Street Safari.\" Knight was a fan favorite, but his line did not appeal to the judges. In a \"Reunion\" episode that aired on October 4, 2006, viewers voted Mychael Knight as their favorite designer, earning him a $10,000 prize. Laura Bennett was the second eliminated for her collection of cocktail dresses and evening wear, though the judges praised her for how expensive her items looked. During taping, Bennett found out she was pregnant with her sixth child. Jeffrey Sebelia was voted the winner by the judges. Uli Herzner was the runner-up and was also highly praised by the judges for her collection. Sebelia's girlfriend and son were there to celebrate his win with him. Jeffrey's model, Marilinda Rivera, won the Elle fashion editorial featuring his winning designs at Fashion Week, over fellow models Nazri Segaro (for Uli Herzner), Camilla Barungi (for Laura Bennett) and Clarissa Anderson (for Mychael Knight).\n\nThere were many dramatic scenes which played out this season. Designer Keith Michael became the first designer to be asked to leave the show for multiple rule violations. He was found to be in possession of prohibited pattern-making books and left the production site for several hours, during which time he used the internet. Sebelia was accused of having outside help to finish his garments by fellow competitor Laura Bennett. The issue was investigated, and it was declared that he had followed the guidelines. Because he could not produce a receipt for a pair of leather shorts he had sent out for pleating, he removed that item from the show. In addition, because he had gone over budget by $227.95, he removed the blonde wigs he had planned for his runway models in order to drop below budget. Also, for the first time, the last four designers were selected as finalists (Jeffrey Sebelia, Laura Bennett, Ulrike \"Uli\" Herzner, and Mychael Knight), with no decoy collection to serve as a distraction before the finale aired, and allowed to compete at New York Fashion Week.\n\nDuring Season 3, there was a poll consisting of the most memorable moments of Project Runway. Among the most notable were Keith's disqualification, Sebelia's issues with competitor Angela Kesler's mother, and the controversy about Sebelia's final collection.\n\nSeason 4 [ edit ]\n\nThe fourth season premiered on November 14, 2007, featuring 15 designers. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the fourth season. Earlier in the year Gunn was named Chief Creative Officer for Liz Claiborne Inc.[17] Cast members for Season 4 were revealed during episodes of Tim Gunn's Guide to Style.\n\nThis was the first season a designer was compelled to quit the competition for medical reasons. Jack Mackenroth left in Episode 5 and was replaced by Chris March, who had been the most recently eliminated designer.\n\nThis was also the first season in which four designers were chosen to prepare collections for Fashion Week, but only three proceeded on in the competition to show their collections at Fashion Week. In a new finale twist, Rami Kashou and Chris March, the bottom 2 of the last challenge, had to show the three best pieces from their collections to the judges.\n\nKathleen \"Sweet P.\" Vaughn, the last designer eliminated before the finale, produced a decoy collection for Fashion Week, along with Chris March. Siriano won $10,000 as the Project Runway Season 4 Fan Favorite. Season 3 Fan Favorite winner Mychael Knight brought out the check to Siriano during the Reunion episode. Siriano became the fourth and youngest winner of Project Runway. His model, Lisa Nargi, won the Elle fashion editorial featuring his winning designs at Fashion Week, over fellow models Sam Ruggiero (for Rami Kashou) and Lauren Browne (for Jillian Lewis). This was also the first season of the show in which the final three models did not wear the finale pieces of their respective designers.\n\nSeason 5 had a series poll consisting the 22 most memorable moments of Project Runway. The season 4 moments consist of Michael Kors losing it during a competition, designer Elisa Jimenez's spit marks, the designers talking about their wrestling names, Mackenroth's departure/March's return, Siriano's drama with a teen, Sarah Jessica Parker surprising the designers, and Victoria Beckham telling Siriano she would love to wear any of his clothing.\n\n\"It's Sew Not Over\", a post-show competition, designers were asked to create a three piece collection that would be voted online by the viewing public. Jillian Lewis was chosen as the winner.[18]\n\nSeason 5 [ edit ]\n\nThe fifth season premiered on July 16, 2008, at its new time of 9/8c on Bravo, featuring 16 designers. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the fifth season.\n\nThis first episode was the first time that they repeated a challenge from a previous season: the Gristedes challenge, in which the designers had to make a design of their choice using what they could find at a grocery store. The episode, featuring a special guest judge appearance by first season competitor Austin Scarlett, was intended as an homage to the glories of past seasons, the fifth season being the last on Bravo and by original producers Magical Elves.\n\nSimilar to season 4, four designers were chosen to prepare collections for Fashion Week, but only three proceeded on in the competition to show their collections at Fashion Week. However, unlike the previous season, the last challenge does not have a bearing on this decision and any of the four remaining designers could be eliminated before fashion week.\n\nFor the first time, six people showed collections for Fashion Week. Joe Faris and Stephen \"Suede\" Baum, the last two designers eliminated, and Jerell Scott, who was eliminated in the first part of the finale, showed decoy collections.\n\nFor the first time, all of the finalists (Kenley Collins, Korto Momolu and Leanne Marshall) were female. All three collections were well received. Kenley was praised for her well-tailored designs, but was eliminated first because some of her designs were reminiscent of other professional designers' collections. The judges admired Korto's ethnic touches on her designs, but thought that a few were overworked. Leanne was declared the winner for her wave patterns. Her model, Tia Shipman, won the Elle fashion editorial featuring her winning designs at Fashion Week, over fellow models Katarina Munez (for Korto Momolu) and Topacio Pena (for Kenley Collins). Jennifer Lopez was supposed to be the guest judge in the finale, but bowed out at the last minute, so Tim Gunn took her place.\n\nFor the first time since Season 1, there was no reunion or opening introduction due to time restraints. However, Bravo continued to stage the fan favorite contest, with Momulu winning.\n\nSeason 6 [ edit ]\n\nSeason six premiered on August 20, 2009, featuring 16 designers. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the sixth season. This season was the first season of Project Runway to be filmed in Los Angeles, at the Fashion Institute of Design and Merchandising,[19] rather than New York.\n\nThe sixth season had been announced to begin airing in January 2009 on Lifetime, but was delayed due to legal issues. The announcement occurred before NBC Universal sought preliminary injunctive action effectively enjoining production. The launch was further delayed due to Lifetime's request that the suit between NBC Universal and The Weinstein Co. be removed to federal court.[20][21][22] On April 1, 2009, the lawsuit between Weinstein Co. and NBC Universal was settled, with Weinstein agreeing to pay NBC an undisclosed sum for the right to move the show to Lifetime.[10][11]\n\nThe premiere was preceded by a two-hour special episode of Project Runway: All-Star Challenge where eight past contestants (Daniel Vosovic, Santino Rice, Jeffrey Sebelia, Uli Herzner, Mychael Knight, Chris March, Sweet P, and Korto Momolu) competed in one challenge with a cash prize of $100,000.[23] Vosovic won the challenge, while Momolu came in second place, Sweet P in third, and March in fourth.\n\nFor the first time in Project Runway history, only three contestants showed their collections at New York Fashion Week. The three finalists of the sixth season showed their collections at Bryant Park on February 20, 2009, but the finalists were not named and did not appear onstage that day. Irina Shabayeva won the competition with her model Kalyn Hemphill. Althea Harper and her model Tanisha Harper placed second, while Carol Hannah Whitfield and her model Lisa Blades placed third. This was the second season overall (and the second consecutive season) where all three finalists were female. Christopher Straub won the Fan Favorite Award.\n\nSeason 7 [ edit ]\n\nThe seventh season premiered on January 14, 2010, featuring 16 designers.[24] Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the seventh season. This season featured the return of the show to New York City, following a move to Los Angeles for Season 6.\n\nThis was the first season a designer was compelled to quit the competition for personal reasons. Maya Luz, who left the competition unexpectedly in Episode 11 after deciding that she did not have enough experience to \"go all the way\", was replaced by Anthony Williams, who had been the most recently eliminated designer.\n\nSimilar to season 4, four designers were chosen to prepare collections for Fashion Week, but only three proceeded on in the competition to show their collections at Fashion Week. In a finale twist, Mila Hermanovski and Jay Nicolas Sario, the bottom 2 of the last challenge, had to show the three best pieces from their collections to the judges.\n\nFor the first time, ten designers showed collections for Fashion Week. The final 11 designers (except Maya Luz) all showed decoy collections.\n\nSeth Aaron Henderson won the competition with his model Kristina Sajko. Emilio Sosa and his model Lorena Angjeli placed second, while Mila Hermanovskie and her model Brandise Danesewich placed third. Maya Luz won the fan favorite award.\n\nSeason 8 [ edit ]\n\nThe eighth season premiered on July 29, 2010, on the Lifetime network with a new 90-minute format for each episode and in a new time-slot, 9pm PT/ET. This season featured 17 competing designers, the most in the show's history. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the eighth season.\n\nThis season featured the longest winner deliberation in Project Runway history. Kors and Garcia voted for Gretchen Jones to win, while Klum and guest judge Jessica Simpson voted for Mondo Guerra. In the end, Jones won the competition with her model Millana Snow. After the show, Tim Gunn publicly aired his disappointment in Kors' and Garcia's choice for the winner. Mondo Guerra and his model Tina Marie Clarke placed second, while Andy and his model placed third. Mondo Guerra also won the fan favorite award.\n\nSeason 9 [ edit ]\n\nThe ninth premiered on July 28, 2011, featuring 20 designers.[25] Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the ninth season. For the first time since season 3, four designers were chosen to show their collections at Fashion Week.\n\nAnya Ayoung-Chee won the competition with her model Sveta Glebova. Joshua McKinley and his model Sonia Niekrasz placed second, Viktor Luna and his model Erika K. Jones placed third and Kimberly Goldson and her model Bojana Draskovic placed fourth. Anya also won the fan favorite award.\n\nSeason 10 [ edit ]\n\nThe tenth season premiered on July 19, 2012, featuring 16 designers. Celebrating the show's tenth season milestone, this season launched with a fashion show in front of a live audience.[26] As with the previous season, four designers were chosen to show their collections at Fashion Week. Heidi Klum, Michael Kors, Nina Garcia and Tim Gunn all returned for the tenth season.\n\nThis season featured the first time two designers quit on the same season. Andrea Katz and Kooan Kosuke both quit on Episode 3 due to personal reasons.\n\nDmitry Sholokhov won the competition with his model Katt Vogel. Fabio Costa and his model Hannah Herreid placed second, Melissa Fleis and her model Lacee Teel placed third and Christopher Palu and his model Claudia Ruff placed fourth. Elena Slivnyak won the fan favorite award.\n\nSeason 11 [ edit ]\n\nThe eleventh season premiered on January 24, 2013, featuring 16 designers. Zac Posen replaced Michael Kors as one of the main judges due to the latter's scheduling conflicts.[27] Heidi Klum, Nina Garcia and Tim Gunn all returned for the eleventh season. Dubbed as \"Teams Edition\", the designers had to work in teams for every challenge this season.\n\nMichelle Lesniak Franklin won the competition with her model Lisa Jackson. Patricia Michaels and her model Katrina Topacio placed second, while Stanley Hudson and his model Anna Kanehara placed third. Originally, Michelle would have been eliminated in Episode 11, but the judges gave her a second chance.\n\nSeason 12 [ edit ]\n\nThe twelfth season premiered on July 18, 2013, featuring 15 new designers and 1 returning designer as voted by the public.[28] Kate Pankoke from Season 11 won the public voting for the 16th spot to compete once again over Ra'mon Lawrence of Season 6 and Valerie Mayen of Season 8. Heidi Klum, Zac Posen, Nina Garcia and Tim Gunn all returned for the twelfth season.\n\nFive designers were chosen to prepare collections for Fashion Week, but only three were supposed to proceed on in the competition to show their collections at Fashion Week. Alexandria von Bromssen, Justin LeBlanc and Helen Castillo, the bottom 3 of the last challenge, had to show the three best pieces from their collections to the judges. In a final twist, both von Bromssen and LeBlanc were chosen to show their collections at Fashion Week, making this the fourth time four people were competing in the finale.\n\nDom Streater won the competition with her model Rayuana Aleyce. Alexandria von Bromssen and her model Ya Jagne placed second, Justin LeBlanc and his model Ji Young Baek placed third and Bradon McDonald and his model Cameron Corrigan placed fourth. Originally, Justin would have been eliminated in Episode 6, but he was given a second chance due to the newly instituted \"Tim Gunn Save.\"[29]\n\nSeason 13 [ edit ]\n\nThe thirteenth season premiered on July 24, 2014, featuring 18 new designers and 1 returning designer as voted by the public. Amanda Valentine from Season 11 won the public voting for the 19th spot to compete once again over Alexander Pope and Ken Laurence of Season 12. Heidi Klum, Zac Posen, Nina Garcia and Tim Gunn all returned for the thirteenth season.\n\nSome of the celebrity judges for this season are Olympian Lindsey Vonn, Mad Men's Elisabeth Moss, burlesque queen Dita Von Teese and former Project Runway winner Christian Siriano.[8]\n\nThe contestants are Alexander Knox, Amanda Valentine, Angela Sum, Carrie Sleutskaya, Char Glover, Emily Payne, Emmanuel Tobias, Fäde zu Grau, Hernan Lander, Jefferson Musanda, Kiniokahokula Zamora, Korina Emmerich, Kristine Guico, Mitchell Perry, Nzinga Knight, Samantha Plasencia, Sandhya Garg, Sean Kelly and Tim Navarro.\n\nSean Kelly won the competition. Amanda Valentine placed second, Kini Zamora placed third and Char Glover placed fourth. Originally, Char would have been eliminated in Episode 6, but she was given a second chance and returned to the show by Tim Gunn who used his \"Tim Gunn Save.\"\n\nSeason 14 [ edit ]\n\nThe fourteenth season premiered on August 6, 2015. The judges included: Heidi Klum, Zac Posen and Nina Garcia. Tim Gunn returns for his 14th season as a mentor.\n\nSome of the celebrity judges for this season were Ciara, Tracee Ellis Ross, Kiernan Shipka, Ashley Tisdale, Kelly Osbourne, Coco Rocha, Melanie Brown and Hannah Davis.\n\nThe designers are: Amanda Perna, Ashley Nell Tipton, Blake Patterson, Candice Cuoco, David Giampiccolo, Duncan Chambers-Watson, Edmond Newton, Gabrielle Arruda, Hanmiao Yang, Jake Wall, Joseph Poli, Kelly Dempsey, Laurie Underwood, Lindsey Creel, Merline Labissiere and Swapnil Shinde.\n\nAshley Nell Tipton won the competition. Kelly Dempsey placed second, Edmond Newton placed third and Candice Cuoco placed fourth. Originally, Edmond would have been eliminated in Episode 12, but he was given a second chance and returned to the show by Tim Gunn who used his \"Tim Gunn Save.\"\n\nSeason 15 [ edit ]\n\nThe fifteenth season premiered September 15, 2016. The judges included: Heidi Klum, Zac Posen and Nina Garcia. Tim Gunn returns for his 15th season as a mentor.\n\nSome of the celebrity judges for this season were Priyanka Chopra, Kelly Osbourne, Shiri Appleby, Savannah Guthrie, Carly Chaikin, Emily Ratajkowski, Sabrina Carpenter, Nina Dobrev, Camilla Belle, Jaime King, Lucky Blue Smith, and Anne Fulenwider.\n\nThe designers were: Alex Snyder, Brik Allen, Cornelius Ortiz, Dexter Simmons, Erin Robertson, Ian Hargrove, Jenny Ricetti, Kimber Richardson, Laurence Basse, Linda Marcus, Mah-Jing Wong, Nathalia JMag, Rik Villa, Roberi Parra, Sarah Donofrio, and Tasha Henderson.\n\nThe winner was Erin Robertson. Roberi Parra was the runner-up, with Laurence Basse and Rik Villa coming in third and fourth place respectively.\n\nSeason 16 [ edit ]\n\nThe sixteenth season premiered on August 17, 2017.[30] The judges included: Heidi Klum, Zac Posen and Nina Garcia. Tim Gunn returned for his 16th season as mentor.\n\nSome of the celebrity judges for this season were Georgina Chapman, Anne Fulenwider, Yolanda Hadid, Katie Holmes, and Demi Lovato.\n\nThe designers were: Margarita Alvarez, Amy Bond, Michael Brambila, Claire Buitendorp, Shawn Buitendorp, ChaCha, Kenya Freeman, Ayana Ife, Kentaro Kameyama, Kudzanai Karidza, Brandon Kee, Batana-Khalfani, Sentell McDonald, Aaron Myers, Samantha Rei, and Deyonté Weather.\n\nKentaro Kameyama won the season, with Ayana Ife as the runner-up, Brandon Kee placing third and Margarita Alvarez placing fourth. Originally Margarita would have been eliminated in episode 11 but was spared elimination and brought back into the competition by Tim Gunn.\n\nThis season also had a designer eliminated due to cheating. Claire Buitendorp was eliminated in Episode 9 after it was revealed that she had taken a measuring tape back to the apartment to measure her own clothing. Her disqualification came after winning the challenge from episode 8. The win was rescinded and awarded to another designer.\n\nSeason 17 [ edit ]\n\nThe seventeenth season premiered on March 14, 2019. Several changes have been made to the show, along with its return to Bravo.[31]\n\nModel Karlie Kloss replaced Klum as the host, with Project Runway alumnus Christian Siriano replacing Tim Gunn as mentor of the contestants. Nina Garcia stayed on as a judge, joined by fashion designer Brandon Maxwell, and former editor-in-chief of Teen Vogue Elaine Welteroth.\n\nThe designers were: Cavanagh Baker, Frankie Lewis, Afa Ah Loo, Bishme Cromartie, Gary 'Garo Sparo' Spampinato, Hester Sunshine, Jamall Osterholm, Kovid Kapoor, Lela Orr, Nadine Ralliford, Rakan Shams Aldeen, Renee Hill, Sebastian Grey, Sonia Kasparian, Tessa Clark and Venny Etienne.\n\nSebastian Grey won the season, with Hester Sunshine as the runner-up, and Gary 'Garo Sparo' Spampinato placing third.\n\n\n\n\n\nSeason 18 [ edit ]\n\nFurther information: Project Runway (season 18)\n\nThe eighteenth season premiered on December 5, 2019.[32] This marked the second season after the return to Bravo. Karlie Kloss returned as host with Project Runway alumnus Christian Siriano returning as mentor. Nina Garcia stayed for her 18th season, joined by fashion designer Brandon Maxwell and writer/editor Elaine Welteroth. Sixteen designers appeared in the first episode: Brittany Allen, Asma Bibi, Chelsey Carter, Jenn Charkow, Victoria Cocieru, Marquise Foster, Alan Gonzalez, Sergio Guadarrama, Dayoung Kim, Shavi Lewis, Geoffrey Mac, Delvin McCray, Tyler Neasloney, Veronica Sheaffer, Melanie Trygg and Nancy Volpe-Beringer.[33] At age 64, Nancy Volpe-Beringer is the oldest contestant to be included in Project Runway.[34] The models cast included a variety of body types and DD Smith, the first non-binary model in Project Runway history.[35] Season 18 finalists will show at New York Fashion week. Unlike in season 17, mentor Christian Siriano now has the option to use a one-time \"Siriano Save\" to bring back a contestant from elimination if he disagrees with a judging decision.[36]\n\nGeoffrey Mac won the season, with Nancy Volpe-Beringer, Sergio Guadarrama and Victoria Cocieru are runners-up.\n\nFuture seasons [ edit ]\n\nOn 27 February 2020, the casting of Season 19 opened. The details of the season have yet to be announced.\n\nSpinoffs [ edit ]\n\nAll Stars [ edit ]\n\nProject Runway All Stars is a spin-off of Project Runway, featuring designers from previous seasons of Project Runway. The show has run for six seasons, with the seventh and final season airing currently. Angela Lindvall and Carolyn Murphy have each hosted one season, and the last five seasons have been hosted by Alyssa Milano. As on the regular Project Runway, the designers are judged by the host, two permanent judges and 1-2 guest judges. The permanent All Stars judges has been the designers Isaac Mizrahi and Georgina Chapman. Joanna Coles mentored the designers in the first two seasons, Zanna Roberts Rassi mentored in season three to season five and Anne Fulenwider mentored last two seasons.\n\nUnder the Gunn [ edit ]\n\nHosted by Tim Gunn, Project Runway: Under the Gunn brings back Project Runway alumni Anya Ayoung-Chee, Nick Verreos and Mondo Guerra to mentor and manage the designer contestants. The mentors must show they have the business savvy to manage their team of four designers, or else leave the show themselves. Designer Rachel Roy, celebrity stylist Jen Rade, and Marie Claire senior fashion editor Zanna Roberts Rassi serve as the judges with Tim.\n\nProject Accessory [ edit ]\n\nProject Accessory aired directly after the season finale of Project Runway season 9, premiering on October 27, 2011. The show featured 12 contestants who participated in challenges to design and display the most amazing accessories. With the help of their mentor, Eva Jeanbart-Lorenzotti, they needed to impress host Molly Sims and judges Kenneth Cole and Ariel Foxman, editor of InStyle. Kelly Osbourne and Debra Messing were among the guest judges appearing this past season.\n\nProject Runway: Threads [ edit ]\n\nProject Runway: Threads aired directly after the season finale of Project Runway Season 13, premiering on October 23, 2014. Each week of eight three young designers competed for a scholarship to study fashion design in addition to sewing materials and equipment. The host was Vanessa Simmons. The judges were Christian Siriano (Project Runway Season 4 winner), Seventeen magazine Fashion Director Gina Kelly and Accessories Editor Jasmine Snow, and Ingrid Nilsen who is a video blogger on YouTube. Since each week there are three new competitors, there is no one winner, but rather eight spread across the eight episodes.\n\nProject Runway: Junior [ edit ]\n\nProject Runway: Junior is a direct spin-off of Project Runway, featuring twelve teen designers aged between 13 and 17. The show premiered on November 12, 2015.\n\nSeason 2 of Project Runway: Junior premiered on December 26, 2016 with a third season announced in May, 2016.[37]\n\nProject Runway: Fashion Startup [ edit ]\n\nProject Runway: Fashion Startup is a spin-off of Project Runway, that showcases aspiring fashion and beauty entrepreneurs as they pitch their concepts for the chance to secure funds from a panel of investors to help grow their budding ventures. The show premiered on October 20, 2016.[38][39]\n\nInternational versions [ edit ]\n\nCountries highlighted in red indicate a version of the show that is no longer airing. Of the versions still airing, Mission Catwalk (from Jamaica) has been on the longest after the US version, having completed 5 seasons. Of the versions no longer airing, Project Runway Korea had the longest run with 5 seasons.\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/23px-Flag_of_New_Zealand.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/21px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Flag_of_Jamaica.svg/23px-Flag_of_Jamaica.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/7f/PRLogo12.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/23px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/23px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flag_of_Turkey.svg/23px-Flag_of_Turkey.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_Mongolia.svg/23px-Flag_of_Mongolia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/23px-Flag_of_Ukraine.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/23px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Flag_of_the_Arab_League.svg/23px-Flag_of_the_Arab_League.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/23px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Flag_of_Malaysia.svg/23px-Flag_of_Malaysia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/23px-Flag_of_Poland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/23px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Flag_of_the_Republic_of_China.svg/23px-Flag_of_the_Republic_of_China.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Heidi_Klum%2C_Michael_Kors%2C_and_Nina_Garcia.jpg/220px-Heidi_Klum%2C_Michael_Kors%2C_and_Nina_Garcia.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/23px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/23px-Flag_of_Portugal.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Project_Runway", "title": "Project Runway", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}