{"url": "https://web.archive.org/web/20180424000839/http://redstatewave.com/article.asp?id=124965", "text": "Latest News\n\nBREAKING: They Got Him!! 5 hours ago\n\nHell Just Froze Over - Look Who Just Apologized 6 hours ago\n\nBREAKING: Van Attack!! It’s Bad! 6 hours ago\n\nBREAKING: A Third Democrat Just Broke Rank! 6 hours ago\n\nBREAKING: New Information Has Just Been Released About the Waffle House Shooter and It’s Bad! 6 hours ago\n\nPresident Trump and Mike Pence just threw in their full support 6 hours ago\n\nBREAKING: The Supreme Court Has Refused!! 6 hours ago\n\nBREAKING: Look Whose Video Kanye West Just Promoted!! 7 hours ago\n\nThe #3 Democrat Just Dropped A Bomb! 7 hours ago\n\nBREAKING: He Just Resigned Due To the Protests!! 7 hours ago\n\nBREAKING: Another Democrat Just Broke Party Lines - Big Win For Trump! 8 hours ago\n\nBREAKING: The Attempt Against Trump Just Backfired!! 8 hours ago\n\nPresident Trump Fires Off! It’s Viral! 8 hours ago\n\nThere It Is Folks! Nunes Just Dropped the Bombshell Claim! 9 hours ago\n\nWhoa! Look What these Kids Were Just Chanting In San Francisco! 10 hours ago\n\nBREAKING: The World's Oldest Person Has Died 19 hours ago\n\nTrump Was Right! 21 hours ago\n\nBREAKING: Shania Twain Apologizes For Supporting Donald Trump 23 hours ago\n\nBREAKING: Look Who Just Called For the Confiscation of All Semi-Automatic Firearms!! 1 day ago\n\nKanye West invokes slavery debate and liberals hate it 1 day ago\n\nB-B-Boom! Rep. Devin Nunes drops a bomb on the Russia probe 1 day ago\n\nBREAKING: NRA Just Got Blind Side! 1 day ago\n\nBREAKING: We Just Learned Who the Hero At the Waffle House Was and Look Who! 1 day ago\n\nTrump Just Hit “Sleepy Eyes” Chuck Todd!! 1 day ago\n\nBREAKING: Mitt Romney Just Got Some Terrible News!! 1 day ago\n\nBREAKING: Look Who Just Resigned Over “Political Correctness”! 1 day ago\n\nBREAKING: Reports Are Suggesting CNN Helped Orchestrate The Entire Setup!! 1 day ago\n\nUh Oh! Look What Was Just Discovered About Fresno State Professor! 1 day ago\n\nBREAKING: Russia May Have Dirt on Comey!! 1 day ago\n\nLook Who Just Fired On James Comey!! 1 day ago\n\nBREAKING: Multiple People Have Just Been Killed In A Gun Free Zone!! 1 day ago\n\nBREAKING: Trump Just Hit Sessions! 1 day ago\n\nTrump’s Early Morning Tweet Is Already Viral! 1 day ago\n\nLook Why Alan Dershowitz Believes Michael Cohen Could Flip! 1 day ago\n\nPresident Trump Reveals What’s Really Happening With North Korea 1 day ago\n\nThis Is Why Conservative Candace Owens Just Won! 1 day ago\n\nWhoa! Look What the Mayor of New York Just Admitted!! 1 day ago\n\nWell, Well, Well, Look Who Just Emerged From the Shadows! 1 day ago\n\nKaepernick Just Landed It! 1 day ago\n\nGingrich Just Called Out McConnell! This is What Needs to Be Done Now!! 1 day ago\n\nA Newly Discovered CDC Survey Has Just Destroyed the Entire Narrative! 1 day ago\n\nThis Could Be Bad News For Trump! 1 day ago\n\nBREAKING: Wikileaks Just Fired Back At the DNC!! 1 day ago\n\nWell, Well, Well, Look What We Found! 1 day ago\n\nBREAKING: Trump Just Hit the New York Times Reporter! 2 days ago\n\nPresident Trump Just Snubbed The Dems - It’s Historic! 2 days ago\n\nBREAKING: He’s Dead!! 2 days ago\n\nBREAKING: Gunfire Erupts! Coupe D’etat! 2 days ago\n\nKanye West and Candace Owens are waking up the black community. Liberals are hating it 2 days ago", "images": ["https://web.archive.org/web/20180424000839im_/http://noiimages.s3.amazonaws.com/images/redstate/20170813501146659.jpg", "https://web.archive.org/web/20180424000839im_/http://noiimages.s3.amazonaws.com/images/redstate/20180416504124516.png"], "top_img": "https://web.archive.org/web/20180424000839im_/http://noiimages.s3.amazonaws.com/images/redstate/20170813501146659.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "BREAKING: Laura Ingraham Just Fired!!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "MAGA News", "og": {"title": "BREAKING: Laura Ingraham Just Fired!!", "description": "Please share this news!", "image": "https://web.archive.org/web/20180424000839im_/http://noiimages.s3.amazonaws.com/images/redstate/20170813501146659.jpg"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}