{"url": "https://uproxx.com/prowrestling/total-divas-season-7-episode-6-recap-midseason-finale/", "text": "Previously, on Total Divas : Rusev hung out with Alexa Bliss’ baby pig, and all of us died of extreme joy and happiness. Also, Brie Bella began her journey back to a WWE ring, and Jim Neidhart was a terrible tenant. Also also, everyone still kind of generally thinks Lana is the pits. This becomes important later.\n\nAlso, I can’t help but wonder how differently some of the ensuing hijinks would have been affected HAD Nia been around to witness them and/or intervene.\n\nI have no idea why Jax couldn’t make this trip, so Alexa is rolling solo, but gets some quality bonding time with Nikki, as they’re the first two to arrive in Cabo. It goes without saying that we are massive, MASSIVE fans of real-life besties Nia and Alexa, but it’s also nice to see how Alexa rolls with situations without her looking-out-for-Lexi’s-best-interests muscle around.\n\nDuring a photo shoot for BirdieBee, Brie lets Nikki in on the plan that she’s throwing her an engagement party in Cabo San Lucas, Mexico. This is the scene-setting for the entirety of this episode, which gets out of control extremely quickly. The Divas are going to _____! is a tried and true Total Divas trope, but this one might go down as being the most infamous. Everyone but Nia Jax heads down to Cabo in various groups, which brings us to our next point of order.\n\nShe Thinks She’s Quentin Tarantino\n\nBefore the Smackdown crew of Carmella, Naomi, Lana and Nattie get down to Cabo, they have to wrestle on Smackdown. While Nattie and Carmella are getting their makeup did, Nattie starts ranting about Lana, once again calling back the screaming argument Lana had with everyone in Florida about how they should work harder to get better at promos. “She thinks she’s Quentin Tarantino,” says Nattie to Carmella, and it legit took me 30 seconds to understand what the hell she meant by that. At first I thought it was because of all the cussing Lana did. Then I thought maybe Lana was secretly super into feet. It finally dawned on me that Nattie was mocking Lana insisting she’s super good at words/talking/writing, and picked QT as the example that came to her mind as an example of that. Incredible.\n\nWhile Nattie is shit-talking, Lana overhears and strolls up to Nattie, who doesn’t know she’s there. Nattie’s makeup lady cringes for a while before Nattie finally looks at who’s standing next to her AS SHE SAYS “Lana is just so much drama — ” and looks suitably shocked before giving her an “o hai.”\n\nJust as a word of warning: this episode marks the turning point where Nattie becomes the greatest villain in television history. And yes, I listened to Byron Saxton on Smackdown Live this week.\n\nBag Full Of Penis Things\n\nCarmella brought an entire “bag” of “penis things” to Cabo, because she was under the mistaken impression that this was Nikki’s bachelorette party, and apparently things in the shape of dicks are for that and definitely not for engagement parties. The best thing is Nikki acting offended like, “Jesus, you think five days at a mansion in Cabo San Lucas would be for something as important as my bachelorette party? Get a clue, Carmella.”\n\nTo their credit, everyone rolls with the penis stuff anyway, and none of it gets blurred. Maybe this is the best timeline after all.\n\nCan Lana And Nattie Coexist? (Spoiler: No)\n\nIn this one (1) episode, here is a list of things that Lana does to Nattie:\n\nContinually try to get along with Nattie\n\nEnlist Naomi to good-naturedly (and half-assedly) TP Nattie’s room\n\nBe (subjectively) annoying\n\nAgain insist she’s good at promos\n\nPossibly play-slap Nattie, possibly after Nattie slapped her first\n\nBy comparison, in this one (1) episode, here is a list of things that NATTIE does to LANA:\n\nShit-talk Lana behind her back, and fail to realize Lana is standing next to her as she continues to shit-talk\n\nContinually ignore Nikki’s repeated and earnest requests to get along with Lana so it doesn’t ruin Nikki’s engagement party weekend\n\nMove Lana’s things out of Lana’s chosen resort room and into a room on the ground floor because she finds Lana irritating\n\nWhip Lana with flowers when she catches Lana and Naomi TPing her room\n\nBlame Lana for ruining said flowers\n\nPublicly announce Lana is pregnant (she is not)\n\nDefinitely slap Lana several times, hard, while dancing onstage at a club\n\nThreaten to beat Lana’s f*cking ass\n\nThrow a glass of $800 champagne at Lana as a means of proving a point\n\nThrow Lana’s suitcase and cell phone off the side of a cliff\n\nRun and lock herself in her room when Lana asks if anyone has seen her phone\n\nHide in her room as Lana makes threats at the door, after repeatedly saying she wouldn’t hesitate to lay Lana out if provoked\n\nI should note Lana did throw the rest of the bottle of $800 champagne on Nattie, but that was a pretty sensible retaliation, I feel. Anyway, Nattie is absolutely insane in this episode, and Naomi tries to blame it on “Red Wine Nattie.” The episode ends with Lana threatening to shave Nattie’s head, and to strip naked so the producers can’t use the footage if Nattie doesn’t open the door immediately. The episode ends on a mid-season cliffhanger!\n\nI hope when the show returns, Nattie is replaced by one of Teddy Hart’s cats and they never mention it. Not even one of Nattie’s cats. She doesn’t deserve it.", "images": ["https://uproxx.com/wp-content/uploads/2020/04/moxley-chair-aew.jpg?w=328&h=185&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=8430760&c3=&c4=&c5=&c6=&c15=&cj=1", "https://uproxx.com/wp-content/themes/uproxx/assets/images/logo-prowrestling.png?v=1.0.8", "https://uproxx.com/wp-content/uploads/2020/04/smackdown-triple-threat.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/03/royal-rumble-1999-logo.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/braun-strowman-black-sheep.jpg?w=328&h=185&crop=1", "https://pixel.quantserve.com/pixel/p-73t-O7FWprUTo.gif", "https://uproxx.com/wp-content/uploads/2020/04/charlotte-flair-smackdown-2020-grid.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2019/07/peoples-party-2.jpg?w=719&h=272&crop=1", "https://uproxx.com/wp-content/uploads/2017/12/nikki-bella-grimace.jpg?w=650", "https://uproxx.com/wp-content/uploads/2020/04/timothy-thatcher-nxt-debut.jpg?w=328&h=185&crop=1"], "top_img": "https://uproxx.com/wp-content/uploads/2017/12/nikki-bella-grimace.jpg?w=650", "keywords": [], "authors": ["Bill Hanstock", "Brandon Stroud", "Emily Pratt", "Contributing Writer"], "canonical_link": "https://uproxx.com/prowrestling/total-divas-season-7-episode-6-recap-midseason-finale/", "title": "The Most Outrageous ‘Total Divas’ Moments Of The Week", "meta_data": {"description": "In which Nattie lives long enough to see herself become a villain.", "keywords": "prowrestling, sports, total divas, total divas recap, wwe total divas", "viewport": "width=device-width, initial-scale=1", "robots": "index,follow", "twitter": {"card": "summary_large_image", "site": "@UPROXX", "creator": "@UPROXX", "widgets": {"csp": "on"}, "title": "The Most Outrageous ‘Total Divas’ Moments Of The Week"}, "google-site-verification": "370ZQZwYhpp3OFLpudIZ11ONRN8X1ZhGglPMAFJ6GKw", "qc": {"post": "total-divas-season-7-episode-6-recap-midseason-finale", "author": "Bill Hanstock", "section": "prowrestling", "primary_tag": "total-divas"}, "generator": "WordPress 5.4", "og": {"type": "article", "title": "The Most Outrageous ’Total Divas’ Moments Of The Week", "url": "https://uproxx.com/prowrestling/total-divas-season-7-episode-6-recap-midseason-finale/", "description": "In which Nattie lives long enough to see herself become a villain.", "site_name": "UPROXX", "image": {"identifier": "https://uproxx.com/wp-content/uploads/2017/12/nikki-bella-grimace.jpg?w=650", "width": 650, "height": 400}, "locale": {"identifier": "en_US", "alternate": "en_GB"}}, "article": {"published_time": "2017-12-14T21:15:00+00:00", "modified_time": "2019-03-19T10:53:54+00:00", "publisher": "https://www.facebook.com/UPROXX"}, "fb": {"admins": "680207693,2208604", "app_id": 117400151618132, "pages": 116548701336}}, "movies": [], "publish_date": 1513286100.0, "source": "https://uproxx.com", "summary": ""}