{"url": "https://en.wikipedia.org/wiki/Rosemarie_Aquilina", "text": "American judge\n\nRosemarie Elizabeth Aquilina (born April 25, 1958) is an American judge. She is a judge of the 30th circuit court in Ingham County, Michigan.[1] Previously, Aquilina was the 55th District Court Judge, where she served as both a Sobriety Court Judge as well as the Chief Judge.[1] She is the judge who sentenced Larry Nassar in the USA Gymnastics sex abuse scandal.[2]\n\nEarly life and education [ edit ]\n\nAquilina was born in Munich to a Maltese father (a urologist) and a German mother. She moved to the United States with her family in 1959, stateless at the time, and became a naturalized citizen when she was 12 years old.[3] Aquilina earned her Bachelor of Arts degree in English and Journalism at Michigan State University in 1979 and her Juris Doctorate degree from Thomas M. Cooley Law School (now called Western Michigan University Cooley Law School) in Lansing, Michigan in 1984.[1]\n\nCareer [ edit ]\n\nFollowing law school, Aquilina worked for 10 years as administrative assistant and campaign manager for state senator John F. Kelly, and then as a partner in his lobbying firm, Strategic Governmental Consultants, PLLC.[1] During this time, she also formed Aquilina Law Firm, PLC, practicing for several years with her sister, Helen Hartford.[4] She later became the host of Ask the Family Lawyer, a syndicated radio talk show.[1][5][6]\n\nAquilina then joined the Michigan Army National Guard, where she became the state's first female member of the Judge Advocate General's Corps and acquired the nickname \"Barracuda Aquilina\" due to her dedication to service and advocating on behalf of the soldiers she worked with.[1][6] She served in the Michigan Army National Guard for twenty years before retiring.[7]\n\nAquilina is currently an adjunct professor at Western Michigan University Cooley Law School where she teaches a variety of courses.[1] She was awarded by Cooley Law School with the Griffen Award for Teaching Excellence.[1] Aquilina also serves as an adjunct professor at Michigan State University College of Law, where she teaches classes in criminal and civil trial practice, trial practicum, criminal law, and criminal procedure in both the LL.M. and J.D. programs.[1] She was honored with the College of Law Student Bar Association Adjunct Faculty Award for exceptional teaching.[1] In the 1990s, Aquilina ran for Michigan Senate as Laura Baird contested a seat on the Michigan House of Representatives, though Aquilina did not win.[8] In 2004, she was elected a judge of the 55th Michigan District Court, and in November 2008, she was elected as judge of the 30th Circuit Court for Ingham County.[4][1] In July 2013, Aquilina ruled that the city of Detroit's bankruptcy filing violated the state constitution, and sent an advisory memorandum to president Barack Obama.[4][9] This ruling was stayed less than a week later by the Michigan Court of Appeals,[10][11] and one day later the federal bankruptcy court issued a stay of all state court proceedings on the Detroit bankruptcy, ordering that all other legal challenges to the city's bankruptcy petition be litigated in federal bankruptcy court.[12] In December 2013, bankruptcy judge Steven W. Rhodes issued an opinion rejecting all the federal and state constitutional challenges to Detroit's bankruptcy and allowing the city to go through the Chapter 9 bankruptcy process.[13]\n\nIn 2018, Aquilina presided over the USA Gymnastics sex abuse scandal case.[14] She allowed over 150 women and girls involved with the US Olympics gymnastics team doctor, Larry Nassar, to present personal testimony on their sexual abuse.[14] Aquilina sentenced Nassar to up to 175 years in prison for sexual abuse of juveniles and young women over the past two decades.[6][14] Aquilina is also an author and has published two novels: Feel No Evil (2003) and Triple Cross Killer (2017).[15]\n\nOn May 11, 2018, she was chosen by the graduates to deliver an address at the commencement ceremony of the Michigan State University College of Law, where she is a professor.\n\nPersonal life [ edit ]\n\nRose Aquilina has five children.[16] Aquilina also has two grandchildren.[17] She currently resides with three of her children, her father, and her mother in East Lansing, Michigan.[17][1] Rose Aquilina has 3 siblings. Dr. Joe Aquilina, Helen Hartford, and Dr. Thomas C. Aquilina.", "images": ["https://upload.wikimedia.org/wikipedia/commons/6/65/Rosemarie_Aquilina_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Rosemarie_Aquilina_02.jpg/220px-Rosemarie_Aquilina_02.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/65/Rosemarie_Aquilina_02.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Rosemarie_Aquilina", "title": "Rosemarie Aquilina", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/6/65/Rosemarie_Aquilina_02.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}