{"url": "www.thesun.co.uk/tvandshowbiz/4654602/mariah-careys-boyfriend-bryan-tanaka-thighs-date-night/", "text": "MARIAH Carey's loved-up boyfriend Bryan Tanaka couldn't resist placing his hands on the singer's thighs as they made their way into Nobu restaurant in Malibu.\n\nThe smitten pair arrived in a stunning black Lamborghini with Bryan, 34, behind the wheel and climbed out of the eye-catching scissor doors.\n\n15 Mariah Carey's loved-up boyfriend Bryan Tanaka couldn't resist placing his hands on the singer's thighs as they made their way into Nobu, Malibu Credit: BackGrid\n\n15 He gently pulled her dress down before they made their way into the restaurant Credit: BackGrid\n\nMariah, 47, wore a busty black minidress with side cut outs, which she teamed with see-through tights and knee-high heeled boots.\n\nShe carried her leather jacked over her shoulder and held Bryan's hand while smiling at the cameras.\n\nHis muscular arms burst from his tight short-sleeved shirt which he wore with dark jeans and loafers.\n\nThe couple briefly stopped and showed each other affection, with Bryan cosying into his girl while placing his hands on her thighs and pulling down gently on her dress.\n\nMeanwhile Mariah put her hands on his shoulders and gazed bashfully over into the distance.\n\n15 The pair couldn't take their eyes off each other on date night Credit: Splash News\n\n15 They shared lots of laughs and smiles as they walked hand in hand Credit: Splash News\n\n15 They arrived inside a flash Lamborghini Credit: Splash News\n\n15 Bryan emerged from behind the wheel Credit: Splash News\n\n15 He looked smart in a short-sleeve shirts and dark trousers Credit: Splash News\n\n15 Mariah was busty in the revealing black minidress Credit: Splash News\n\n15 She carried a black leather jacket over her shoulder Credit: Splash News\n\nJust days ago Westlife's Mark Feehily revealed Mariah once ate Chinese food sitting on the floor of his friend's flat in Hoxton - and isn't the diva she's claimed to be.\n\nThe Irish singer, 37, who is making a comeback after he was asked to be Mimi’s Special Guest on her epic Christmas tour in December, gave an incredible insight to what hanging out with the star off-stage is really like.\n\nSpeaking exclusively to The Sun Online, Mark, said: “They say never meet your idols - but this couldn’t be more opposite for Mariah.\n\n15 Mariah is no diva, says Westlife's Mark Feehily Credit: Splash News\n\n“The last time I went to see Mariah she was playing in Wembley.\n\n“Afterwards we went to a friend's apartment in Hackney.\n\n“We literally ordered a Chinese and sat on the floor eating our takeaway.\n\n“So we were sitting on the floor, eating our Chinese and drinking champagne in a flat in London, discussing what was going on on the telly and having a laugh.\n\n15 Mark Feehily described his relationship with Mariah in an exclusive interview Credit: Rex Features\n\n“Her super stretch white limo was parked outside the block of flats. Next to all the other cars!\n\n“To me that's a good example of who she is, the biggest selling female superstar of all time, a massive diva, she loves all the fabulous life of course but at same time she's very down to earth and not afraid to hang out in her mate's flat and have a Chinese and a bit of a laugh.”\n\nThe pair met in 1999 when she recorded duet Against All Odds with Westlife, and have remained friends ever since.\n\n15 Mariah has developed a reputation as a bit of a diva over the years Credit: Getty - Contributor\n\n15 Mark, performing with Westlife on their farewell tour back in 2012 Credit: Getty - Contributor\n\nMark, who has kept a low profile since Westlife split five years ago, has been quietly working on new material for next year, when he got the call to be part of Mariah’s epic show.\n\nHe said: ‘'I’m beaming. Doing a Christmas record is an idea I've had for a long time.\"\n\n15 Mariah got to know Mark after recording with Westlife Credit: SONY BMG\n\nHe said: “Then when I got the call and the opportunity to be the special guest on the Mariah show it felt like the perfect opportunity to put this idea into action - at the biggest Christmas event in the pop world this year.”\n\nMark has turned his life around after reaching his lowest point when Westlife split, at the same time he was nursing heartbreak from separating from his fiancé.\n\nHe recalled: \"So Westlife ended and my seven year relationship ended all at once. That was a tough and dark time. There was no aftercare. It's like 'thanks for selling 55million albums, now bye!' It's tough.\"\n\n15 Mark will join Mariah on her tour Credit: PA:Press Association\n\nMark told how he took time away from the spotlight to rebuild his confidence and got therapy.\n\nAfter quietly plugging away with new material, he got the call he had dreamed of from their mutual gig agent saying Mariah wanted him on the tour.\n\nHe added: “This Mariah gig is the icing on the cake.”\n\nUK dates for the Mariah Carey: All I Want For Christmas Is You tour include Sunday 10 December at the Manchester Arena and Monday 11 December at the O2, London.\n\nMOST READ IN TV & SHOWBIZ PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior BECK HOME The Beckhams post pics proving they didn't move back to London\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220.\n\nWe pay for videos too. Click here to upload yours.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/10/rr-composite-mariah.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/10/rr-composite-mariah.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Dan Cain"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/4654602/mariah-careys-boyfriend-bryan-tanaka-thighs-date-night/", "title": "Mariah Carey’s boyfriend Bryan Tanaka can’t keep his hands off her as he feels up her thighs on date night", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Mariah Carey's boyfriend Bryan Tanaka can't keep his hands off her on date night", "url": "https://www.thesun.co.uk/tvandshowbiz/4654602/mariah-careys-boyfriend-bryan-tanaka-thighs-date-night/", "description": "MARIAH Carey’s loved-up boyfriend Bryan Tanaka couldn’t resist placing his hands on the singer’s thighs as they made their way into Nobu restaurant in Malibu. The smitten pair arr…", "site_name": "The Sun", "image": {"identifier": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/10/rr-composite-mariah.jpg?crop=0px%2C0px%2C750px%2C500px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2017-10-10T15:53:54+00:00", "modified_time": "2017-10-10T15:53:54+00:00", "publisher": 161385360554578, "tag": "Mariah Carey", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "THE pop diva and the dancer looked smitten as they went for dinner at celeb hangout Nobu in Malibu. They arrived in a flash black Lamborghini with Bryan behind the wheel.", "keywords": "Mariah Carey, boyfriend, Bryan Tanaka, thighs, date night", "news_keywords": "Mariah Carey, boyfriend, Bryan Tanaka, thighs, date night", "twitter": {"text": {"title": "Mariah Carey’s boyfriend Bryan Tanaka can’t keep his hands off her as he feels up her thighs on date night"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "touch my body", "headline": "Mariah Carey's beau Bryan Tanaka can't keep his hands off her on date night", "image": {"medium": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/10/rr-composite-mariah.jpg?crop=0px%2C0px%2C750px%2C500px&resize=300%2C192&ssl=1", "large": "https://i2.wp.com/www.thesun.co.uk/wp-content/uploads/2017/10/rr-composite-mariah.jpg?crop=0px%2C0px%2C750px%2C500px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 4654602, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1507650834.0, "source": "http://www.thesun.co.uk", "summary": ""}