{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/19/kevin-harts-alleged-cheating-and-extortion-scandal-explained/", "text": "“I simply got to do better, but I’m also not going to allow a person to have financial gain over my mistakes,” Hart said. “In this particular situation, that’s what was attempted, and I said I’d rather fess up to my mistakes.”\n\nAD\n\nAD\n\nA representative for Hart said in a statement to People that “someone tried to set Kevin up in a failed extortion attempt. As law enforcement is involved, we cannot comment further as it could affect the investigation.”\n\nA spokeswoman for the Los Angeles FBI field office said the agency neither confirms nor denies investigations. And asked whether his agency is involved in the matter, a spokesman for the Los Angeles District Attorney’s Office declined to comment.\n\nHere’s what you need to know to understand what’s going on:\n\nHart’s Instagram post\n\n“I’m at a place in my life where I feel like I have a target on my back, and because of that, I should make smart decisions,” Hart said in the video, not directly addressing extortion allegations. “And recently, I didn’t. You know, I’m not perfect. I’m not going to sit up here and say that I am, or claim to be in any way shape or form, and I made a bad error in judgement and put myself in an environment where only bad things can happen, and they did. And in doing that, I know I’m going to hurt the people closest to me.”\n\nAD\n\nAD\n\nThe details that then emerged\n\nSoon after Hart’s video went live, TMZ was out with a report that “a woman has allegedly demanded money from Kevin” with a video showing him and a woman engaged in “sexually suggestive” conduct. The outlet wrote that Hart’s Instagram confession was him “getting out in front of a messy situation.”\n\nTMZ, which has been covering the saga closely, followed up with a report that said an anonymous person demanded millions of dollars in exchange for keeping the video private. But the outlet, citing law enforcement sources, wrote that it’s unclear whether the woman in the video or another person made the alleged demand.\n\nOn Tuesday, the outlet published a blurry still frame that is purportedly from the video in question.\n\nAD\n\nThe woman at the center of the scandal goes public\n\n“I am not an extortionist,” Montia Sabbag said at a Wednesday press conference. “I had nothing to do with these recordings.”\n\nAD\n\nThe model/actress, who had been identified by TMZ days before, retained high-powered lawyer Lisa Bloom.\n\nBloom has represented Blac Chyna (after her ex-fiancee posted explicit photos of her on social media) and women who have accused Bill Cosby and Bill O’Reilly of sexual misconduct.\n\nOn Wednesday, Bloom said Sabbag was secretly taped about a month ago in Hart’s Las Vegas hotel room.\n\n“Montia is a crime victim,” said Bloom, according to the Hollywood Reporter. “Someone apparently snuck cameras into Kevin Hart’s private hotel suite in Las Vegas and recorded bedroom images of the two of them. It is a crime to secretly put cameras in a private place like a hotel room. It is another crime to secretly record people in a private place. It is yet another crime to distribute those images. Montia is the victim of multiple felonies under state and federal laws.”\n\nAD\n\nAD\n\nBloom dismissed reports of an investigation as her client had not been approached, she claimed. She added that they will be meeting with law enforcement “immediately” to report the crime. “Montia and I are not asking for a cent from Kevin Hart. This is not about money,” the attorney said. “We are not suing him. We are not making any claims against him. Kevin Hart appears to be the victim of this criminal, just as Montia is a victim of this criminal.”\n\nCheating rumors that bubbled up over the summer\n\nThis all followed a summer when celebrity gossip sites ran stories about Hart possibly cheating on his pregnant wife — including a blurry photos showing a man and a woman cozying up in a car.\n\nHart posted this on Instagram about the same time, seemingly addressing the rumors:\n\n#LiveLoveLaugh .....SMDH A post shared by Kevin Hart (@kevinhart4real) on Jul 19, 2017 at 5:28pm PDT\n\nA public back-and-forth between his former wife and current wife\n\nThose cheating rumors eventually died down. And then on her wedding anniversary, Parrish posted a tribute to Hart — which then caused its own mini-controversy.\n\n“I love you every day,” she wrote. “8 years together.. 1 year married.. Forever to go!”\n\nBut Hart separated from first wife, Torrei Hart, in February 2010, and the two divorced in 2011 — and that timeline caused a stir on social media, even prompting a back-and-forth between the two women on social media.\n\nAD\n\nAD\n\nParrish, in now-deleted comments on Instagram, wrote that “their marriage was broken way before I came in the picture. They were separated, living in separate homes. I was never a secret. She knew that as well. Don’t believe the hype.”\n\nTorrei Hart, who co-parents her two children with Hart, told TMZ that “she forced my hand to address this publicly. The most important thing to me is my children, so if my children see something that she’s writing that makes me look like a liar, no.”\n\n“I told them before I’m happy for them,” she said. “They’re about to have a baby. My kids are very happy they’re about to have siblings on the way, I’m honestly happy for them, and I don’t understand where all this is coming from.”\n\nAD\n\nHart’s ex-wife sits down with ‘Inside Edition’\n\nAmid the reports about a possible extortion plot, Torrei Hart did a sit-down interview with “Inside Edition” that aired Monday night. She told the outlet that “lies and infidelity” led to the demise of her marriage with Hart, and that they had “grown apart.”\n\nAD\n\nShe was also asked to comment on whether Hart would cheat again. “I don’t know,” she said. “All I can say is if it happened to me, it could happen to anyone.”\n\nHart has publicly addressed his history with cheating\n\n“Lying ruined my marriage. . . . That’s a lie, I cheated,” Hart said in his 2013 stand-up special “Kevin Hart: Let Me Explain.”\n\n“Yes, people, I cheated. Am I ashamed of it? No, I’m not,” he joked. “Do I wish I could take it back? No, no I don’t. Let me tell you why. You can’t evolve as a man if you never make a mistake. The only way that you can be perfect is to not f‑‑‑ up. I did it, I f‑‑‑ed up. Don’t cheat!”\n\nAD\n\nThe comedian’s career has blown up in the past decade as he’s evolved his act to take his personal stories to the stage. Of course, a stand-up comic’s act can’t always — and often shouldn’t — be treated as a factual recounting of the past. But Hart has also, in sit-down interviews, talked about his first marriage with Torrei Hart.\n\nAD\n\n“I was young on my first marriage,” Hart told Chelsea Handler in 2016. “I’m not ashamed to say it, guys. I got married at the age of 22. I was still all over the place. I didn’t really understand the definition of marriage. So I wasn’t ready for it, so I take responsibility. I can say I messed my first marriage up. I’m man enough to say that.”\n\nHart added: “At the same time, that was when I was in the prime of my sexy, so don’t blame me. That’s when I was figuring it out.”\n\nAD\n\nThe interview with Handler came just a few months after he married Eniko Parrish.\n\n“I will say that me and my ex-wife, regardless of the problems we went through, are in an amazing place now where we’re friends, we’re great parents, we’re co-parents, but we have a relationship,” Hart continued. “And now that I’ve moved on and I’ve met somebody else, to make this step was a big step. It took some time, it took seven years, but I was like, you know what, she deserves it because I can’t keep letting us walk around free. That’s not fair to her, like, I got to lock this up — I’m talking about my body.”\n\nAD\n\nHandler began laughing uncontrollably as he kept going: “So I proposed, man, and I can honestly say — that wasn’t a joke! I was serious. I’m happy. I’m in love. I found a good woman.”", "images": ["https://www.washingtonpost.com/resizer/5zX9Uk8VWyGMTfz75jNhoGiiPj4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4PSQEHCDXUYA5AMQH2QKRLBO2Y.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4EGPVNVCUA4J3KTLCIHUMBSE7U.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/5bd13033-50c2-4ef3-a231-2f9d3ef43dcc.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/5zX9Uk8VWyGMTfz75jNhoGiiPj4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4PSQEHCDXUYA5AMQH2QKRLBO2Y.jpg", "keywords": [], "authors": ["Elahe Izadi", "Pop Culture Writer"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/19/kevin-harts-alleged-cheating-and-extortion-scandal-explained/", "title": "Kevin Hart’s alleged cheating and extortion scandal, explained", "meta_data": {"description": "He recently made a public apology to his pregnant wife, Eniko Parrish, and children. And he's addressed his history with cheating before.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/19/kevin-harts-alleged-cheating-and-extortion-scandal-explained/", "image": "https://www.washingtonpost.com/resizer/5zX9Uk8VWyGMTfz75jNhoGiiPj4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4PSQEHCDXUYA5AMQH2QKRLBO2Y.jpg", "title": "Kevin Hart’s alleged cheating and extortion scandal, explained", "description": "He recently made a public apology to his pregnant wife, Eniko Parrish, and children. And he's addressed his history with cheating before."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Kevin Hart’s alleged cheating and extortion scandal, explained", "description": "He recently made a public apology to his pregnant wife, Eniko Parrish, and children. And he's addressed his history with cheating before."}, "last_updated_date": "2018-02-26T00:38:18.150Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1505750400.0, "source": "https://www.washingtonpost.com", "summary": ""}