{"url": "http://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "text": "Now, I know people are skeptical about whether Washington can bring about this change. Our inability to reform health care in the past is just one example of how special interests have had their way, and the public interest has fallen by the wayside. And I know people are afraid we'll draw the same old lines in the sand and give in to the same entrenched interests and arrive back at the same stalemate that we've been stuck in for decades.\n\nBut I am here today and I believe you are here today because this time is different. This time, the call for reform is coming from the bottom up and from all across the spectrum -- from doctors, from nurses, from patients; from unions, from businesses; from hospitals, health care providers, community groups. It's coming from mayors and governors and legislatures, Democrats, Republicans -- all who are racing ahead of Washington to pass bold health care initiatives on their own. This time, there is no debate about whether all Americans should have quality, affordable health care -- the only question is, how?\n\nAnd the purpose of this forum is to start answering that question -- to determine how we lower costs for everyone, improve quality for everyone, and expand coverage to all Americans. And our goal will be to enact comprehensive health care reform by the end of this year. That is our commitment. That is our goal.\n\nNow, in the past month alone, we've done a lot more to advance that goal than we've done in the past decade. We've provided and protected coverage for 11 million children from working families, and for 7 million Americans who've lost their jobs in this downturn. We've made the largest investment in history in preventive care; invested in electronic medical records that will save money, ensure privacy, and save lives; we've launched a new effort to find a cure for cancer in our time. We've also set aside in our budget a health care reserve fund to finance comprehensive reform. I know that more will be required, but this is a significant down payment that's fully paid for, does not add one penny to our deficit. And I look forward to working with Congress and the American people to get this budget passed.\n\nNow, as we work to determine the details of health care reform, we won't always see eye to eye. We may disagree -- and disagree strongly -- about particular measures. But we know that there are plenty of areas of agreement, as well, and that should serve as the starting points for our work.\n\nWe can all agree that if we want to bring down skyrocketing costs, we'll need to modernize our system and invest in prevention. We can agree that if we want greater accountability and responsibility, we have to ensure that people aren't overcharged for prescription drugs, or discriminated against for pre-existing conditions -- and we need to eliminate fraud, waste and abuse in government programs. I think most of us would agree that if we want to cover all Americans, we can't make the mistake of trying to fix what isn't broken. So if somebody has insurance they like, they should be able to keep that insurance. If they have a doctor that they like, they should be able to keep their doctor. They should just pay less for the care that they receive.\n\nAnd finally, we can all agree that if we want to translate these goals into policies, we need a process that is as transparent and inclusive as possible. And that's why I've asked all of you -- representatives of organizations, interests, and parties from across the spectrum -- to join us here today. In fact, this was the hottest ticket in town. (Laughter.) That's why we asked concerned citizens like the folks on this stage to organize open meetings across America where people could air their views. As Travis said, more than 3,000 meetings were held in all 50 states and D.C.; more than 30,000 people attended. I thank them for their input and their ideas, and look forward to reading the report that Travis has presented to me.", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "keywords": [], "authors": [], "canonical_link": "https://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "title": "Obama’s Remarks at the White House Health Care Forum", "meta_data": {"article": {"published": "2009-03-05T17:27:17.000Z", "modified": "2009-03-05T19:04:38.000Z", "section": "U.S.", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 1194838364912, "nyt_uri": "nyt://article/c77c9435-6706-599d-9df0-2d4f43114cf5", "pubp_event_id": "pubp://event/b95003aab7544736a10f01b96e831acb", "description": "President Obama’s remarks at the White House forum on health reform, as prepared for delivery.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "pdate": 20090305, "og": {"url": "https://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "type": "article", "title": "Obama’s Remarks at the White House Health Care Forum", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "description": "President Obama’s remarks at the White House forum on health reform, as prepared for delivery."}, "twitter": {"url": "https://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "title": "Obama’s Remarks at the White House Health Care Forum", "description": "President Obama’s remarks at the White House forum on health reform, as prepared for delivery.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/c77c9435-6706-599d-9df0-2d4f43114cf5"}}, "site": "@nytimes"}, "CG": "us", "SCG": "politics", "PT": "article", "PST": "Text", "url": "https://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/c77c9435-6706-599d-9df0-2d4f43114cf5", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2009/03/05/us/politics/05obama-text.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1236182400.0, "source": "http://www.nytimes.com", "summary": ""}