{"url": "https://people.com/music/coachella-2017-inside-the-hottest-parties/", "text": "Image zoom Courtesy PrettyLittleThing\n\nIt’s that time again!\n\nHollywood’s biggest stars like Leonardo DiCaprio, Orlando Bloom and Katy Perry descended on the California desert this weekend to kick off the first weekend for Coachella. While the event is a multi-day music festival, it is also a huge draw for the many private parties and events and, of course, PEOPLE was behind the scenes with the stars.\n\nGet push notifications with news, features and more.\n\nRead on for the best moments from the parties.\n\nThursday, April 13\n\nAlessandra Ambrosio sure knows how to get the party started! The model kicked off Coachella weekend and #REVOLVEFestival with a poolside dinner in celebration of her collection Ale by Alessandra x Revolve. Fellow Victoria’s Secret model Sara Sampaio, as well as A$AP Ferg and many influencers celebrated the collection by her side.\n\nImage zoom Katie Jones/WWD/REX/Shutterstock\n\nGrammy-nominated singer and Coachella alum performer, Halsey, rode out to the desert bar crawl style with Three Olives Vodka. Along the way, Halsey and guests stopped at the Three Olives Thrift Shop with cocktails and shopping. The singer then surprised guests at The Saguaro in Palm Springs for the vodka brand’s “Find Otherness” party.\n\nFriday, April 14\n\nDon’t put it past REVOLVE to keep the parties going into the weekend. The leading online retailer threw a House of Harlow 1960 x REVOLVE brunch hosted by the one and only Nicole Richie at #hotelREVOLVE at the Arrive Hotel in Palm Springs, followed by The Blonde Salad Pool Party hosted by blogger Chiara Ferragni with a special performance by rapper A$AP Ferg and attendees including Shay Mitchell and Olivia Culpo.\n\nImage zoom Jerod Harris/Getty\n\nBut that was just Mitchell’s first stop of the day. The Pretty Little Liars actress made her way over to the VELOCITY BLACK x 1OAK/Up & Down Beach Club, where partygoers attending the bash snacked on Catch LA sushi and desserts, refueled with massages by Zeel and IV drips, and even had the opportunity to jet-ski in the mega-mansion’s very own backyard lake.\n\nRELATED: Every Can’t-Miss Celebrity Outfit at Coachella (From Crazy-Cool to Hotter Than the Desert)\n\nUpon arrival, Mitchell posed for photos with her stylists, Marie-Lou and Chloe Bartoli. Those who opted for the day club instead of the festival danced to music by will DJ Taco (of ODD Future), as they sipped on cocktails by Absolut Elyx mixed with Red Bull, D’usse and Budweiser. The star-studded guest list included some of Hollywood’s finest, like Tobey Maguire, Leonardo DiCaprio, Orlando Bloom, Tyga, Russell Simmons, Rita Ora, Sofia Richie, Chanel Iman and more. Amid Tyga’s recent split from girlfriend Kylie Jenner, an onlooker tells PEOPLE the rapper “appeared to be in great spirits, as he sipped on a drink and partied with a table full of his male friends.”\n\nThe rapper left the party with his entourage through the back entrance around 5:45 p.m., right around the same time Paris Hilton showed up hand-in-hand with Chris Zylka.\n\nWhile some were keen on showing affection, others just enjoyed the sunny California weather poolside at a private cabana with some best friends.\n\n“Orlando was really low-key at the party. He wasn’t flirting with any girls and was just wandering around with a guy friend,” says an onlooker about the newly single star, whose ex Katy Perry partied at the FUNBOY X Smashbox pool party just miles away. “Tobey hung out at a VIP table and later spent time with his BFF Leonardo DiCaprio.”\n\nImage zoom FameFlynet\n\nAnother day, another fashion celebration. Ambrosio, along with model pals Jasmine Tookes, Josephine Skriver, Martha Hunt and Romee Strijd helped kick off the Sexy Little Things launch at the Victoria’s Secret Angel Oasis with a poolside lunch. Meanwhile, guests enjoyed a relaxing afternoon at the desert retreat, which included everything from an ice cream truck to a live deejay to a styling suite by Hunt’s stylist, Lindsay Grosswendt. Before the event, Skriver, Hunt and Australian actress Adelaide Kane also got a quick Tone It Up workout sesh in presented by fitness gurus Karena Dawn and Katrina Scott.\n\nImage zoom Xavier Collin/IPA/Splash News Online\n\nWell, it’s safe to say Jenner and Tyga kept their distance at separate parties — so far, that is. The Keeping Up with the Kardashians star attended the Pretty Little Things x PAPER Magazine party with besties Jordyn Woods and Stassie Karanikolaou. Once they arrived they decided to forgo the first stop at the carpet, and instead headed straight to the fun, where they quickly got comfortable at their VIP table by the pool and snacked on hamburgers and french fries while mingling with friends. Continuing on with fashion parties at Coachella, Hailee Steinfeld performed at Republic Records x sbe’s “The Hyde Away” Presented by Hudson. The singer-actress sang an acoustic set at the party (with mom, dad and boyfriend Cameron Smoller in the front row) and then stopped by the Hudson Jeans suite to grab festival swag.\n\nImage zoom Jonathan Leibson/Getty Images for NYLON Media\n\nFROM COINAGE: The Real Cost of Going to Coachella\n\nIt’s a tough life bouncing from party to party. Mitchell and Ambrosio popped up at the FUNBOY x Smashbox pool party, and posed for pictures on/alongside the seahorse and festival flamingo pool floats. Also at the event was Perry, making her first public appearance since shaving off all of her blonde locks.\n\nImage zoom Source: Katy Perry/Instagram\n\nMeanwhile over at the FORAY x VAMPPED DESERT OASIS, host Emily Ratajkowski and Foray Collective co-founder, Kaitlynn Carter, were spotted lounging poolside in shaded cabanas. Carter’s fiancé, Brody Jenner, was also in attendance as the party’s deejay. His music was enjoyed by sisters Vanessa and Stella Hudgens. Partygoers looking for a styling session at the Musse & Cloud, boohoo.com and HerCampus-sponsored event were able to hit up the L’Oréal Paris’ beauty bar like pals Becca Tilley and Witney Carson, who received glitter roots and braids.\n\nHeading into the night, Mitchell made one last stop at the Nylon Midnight Garden bash, where the actress danced it up to The Weeknd’s “Some Way.” Amber Rose, Odell Beckham Jr., and sisters Nicole and Sofia Richie, were also spotted at the party, which featured made-to-order Coolhaus ice cream sandwiches, a hairstyling station by Batiste Dry Shampoo and Johnnie & Soda cocktails. Not to mention, guests were even treated to a surprise pizza delivery from Papa John’s, particularly enjoyed by Nick Jonas while accompanying his brother Joe Jonas and his girlfriend Sophie Turner to the party. The DNCE singer and the Game of Thrones star “were getting busy,” a source tells PEOPLE. “The two were all over each other throughout the night,” the source continues. “Pulling Turner to the dancefloor, Jonas openly flirted as he held her, with both evidently completely taken with each other.”\n\nImage zoom Joshua Blanchard/Getty Images for NYLON Media\n\nSaturday, April 15\n\nLeave it up to Kendall and Kylie Jenner to buzz around the desert to the best parties. The sister duo teamed up to host dating app Bumble’s Winter Bumbleland party on Saturday afternoon. Kendall arrived first to the “Aspen Chic meets Desert Heat”-themed bash with best friend Hailey Baldwin in tow, while Kylie Jenner showed up a little later on with pal Jordyn Woods. And being just weeks after Kendall’s Pepsi controversy when her advertisement was pulled for being deemed as “tone deaf,” the model still didn’t appear to be in the best spirits. “Kendall did not look happy,” a source tells PEOPLE. “She was hanging out alone on a corner couch in the VIP area with Hailey Baldwin with staring at her phone.” And Kylie arrived just in time to get the party started. The Life of Kylie star showed up sporting her new purple hairdo in a snakeskin skirt and top set alongside Woods, as they took to the dance floor to show off some moves.\n\nNext up for Baldwin and Kendall Jenner was the Bootsy Bellow party, where the friends hung out at their poolside VIP cabana at the sprawling estate. “They seemed to be partners in crime for Coachella,” says a source, adding that Jenner was in “good spirits” at the event. Also enjoying the music and a performance by Lil Yachty was Katy Perry, who was overheard telling her Coachella posse that she dresses to make an entrance. The singer was also joined by fashionable friends Jeremy Scott and Mia Morretti.\n\nMeanwhile in another poolside cabana, Modern Family star Ariel Winter, with her new hot pink hairstyle, spent most of the afternoon perched on her boyfriend Levi Meaden’s knee. Over at Sofia Richie’s cabana, it was full party mode as her spot was overflowing with guests. Joe Jonas—who was joined by his brother Nick, Sophie Turner, and the rest of his DNCE band mates—was spotted singing and dancing when he arrived at the bash.\n\nAcross the estate, Jamie Chung and Bryan Greenberg shared a sweet kiss before hopping into the 2017 Chevrolet Equinox and driving off. Christina Milian was laughing and chatting with friends as she made her way through the event. Tyler the Creator also popped by to watch his friend and fellow Odd Future member, DJ Taco, as he played music for partygoers. While he was there, Tyler stayed next to the stage and hung out with Kendall Jenner’s ex love interest, Jordan Clarkson, at the bash, which featured a PacSun pop-up shop, a rock climbing wall and live performances. Not to mention guests had food options from several different trucks, including one that served delicious ice cream cookie sandwiches by Coolhaus.\n\nImage zoom Katie Jones/WWD/REX/Shutterstock\n\nBut for those who wanted ice cream and massages, Rachel Zoe and The Zoe Report’s “ZOEasis” was the place to be. Fashion ladies like Chanel Iman, Kate Bosworth (both carrying MCM Worldwide bags), Jamie Chung dressed head-to-toe in pieces from the SS17 Rachel Zoe Collection were pampered with luxurious spa and facial treatments in the SK-II Extreme Expedition Skin Rescue lounge, as well as hair treatments like the signature Coachella braid and false lashes. VIP attendees also got the opportunity to snag a Google’s Pixel phone with a Google Pixel Live Case designed by Rachel Zoe.\n\nMoët & Chandonkicked off Coachella in style at the #REVOLVEFestival during the fashion e-tailer’s 2nd annual star-studded bash. An oh-so-A-list crowd gathered at the Merv Griffin Estate to kick off the iconic weekend in festival-ready REVOVLE outfits. Attendees included Leonardo DiCaprio, Toby Maguire, Orlando Bloom, Alessandra Ambrosio, Nicole Richie, Emma Roberts, Chanel Iman, Leona Lewis, Hailey Clauson, Troian Bellisario, Jasmine Tookes, Shay Mitchell, Elsa Hosk, Terrance J and girlfriend Jasmine Sanders. Terrence J and his girlfriend, nicknamed Golden Barbie, appeared to be “lovey dovey while holding hands and showing some PDA.” Boy squad DiCaprio, Maguire and Bloom relaxed together in a private cabana by the pool with 50 of their closest friends sipping Moët Ice Imperial Champagne, ‘CÎROC Summer Coladas’ and Heineken.” The boys danced with the crowd to a special live performance by Rick Ross and then snuck out,” an onlooker tells PEOPLE. Later in the evening, at REVOLVE Desert Nights after hours party, guests enjoyed surprise live performances by Rae Sremmurd and Ty Dolla $ign.\n\nImage zoom Jerritt Clark/WireImage\n\nAll aboard the vodka bus! Joe Jonas with band DNCE hopped on the Three Olives “Find Otherness” bus (a staple of this year’s music festival bouncing celebrities and influencers from party to party) from their desert house in Rancho Mirage and headed to the Saguaro, Palms Springs for some fun under the sun. Once in the bus, Jonas took the role of deejay to get the party started, plugging in his phone and turning on his favorite Spotify station, “Rap Caviar.” Once the crew arrived at the hotel, the crew opted to relax in their private hotel room for a bit before heading down to the secluded hammock area near the pool – where Jonas met up with his younger brother Nick and some other friends. After partying, the crew shuttled out to the Republic Records x sbe’s “The Hyde Away” Presented by Hudson event, where Jonas spun some tunes before heading to the festival.\n\nImage zoom\n\nJoe Jonas and Sophie Turner sure have had a sweet craving for each other all weekend long. “Joe Jonas arrived with [girlfriend] Sophie Turner,” an onlooker at Republic Records and sbe’s exclusive party presented by Hudson and bareMINERALS tells PEOPLE. “While he performed they separated into different friend groups.”\n\nImage zoom\n\nThe DNCE singer got up in the deejay booth for a set alongside fellow artists Giorgio Moroder, Phantogram and KUNGS. Partygoers of the major record label’s Coachella star-studded including Emma Roberts, Scott Eastwood, Aaron Paul (who party-hopped by Lyft with wife Lauren), Ashley Tisdale, Sofia Carson, Chord Overstreet, Martin Solveig, DAGNY, Bobby Raps, Nina Dobrev, Sean Murray, Danielle Campbell, Gilles Marini were treated to gourmet burgers and savory sides by the sbe-owned cult favorite, Umami Burger including Truffle Sliders, Manly Sliders, Sam’s Crispy Chicken Sliders and sides, such as cheesy tots, truffle fries and Umami chips.\n\nImage zoom Joe Schildhorn/BFA/REX/Shutterstock\n\nLet’s just say those who attended The Lucky Lounge: Desert Jam were, well, lucky. Miley Cyrus, unfortunately, didn’t make it to the event, but her mother, Tish, and older sister, Brandi, watched on as younger sister, Noah, boasted a special headlining performance of her hits “Make Me Cry” and “Stay Together” at the event produced by BMF Media and sponsored by Lucky Brand and CORE Water at the Ingleside Inn in Palm Springs. Ashlee Simpson-Ross and husband Evan Ross also slipped away to the desert for a parents-only weekend, but couldn’t wait to get home and get back to their daughter, Jagger, so “they could all spend Easter together,” says a source.\n\nImage zoom Vivien Killilea/Getty\n\nSean “Diddy” Combs and Tyga stole the show as they jumped on stage with the hip-hop group Migos during a performance at the nANA jUDY Estate Party presented by Chronciergeinside the home’s own airplane hanger. Tyga and Post Malone also gathered for a collaboration, while Rihanna enjoyed the party in a head to toe Gucci sequin getup. According to an onlooker, the “Work” singer refused to “go home yet, cuz enough people ain’t seen my outfit.” Among other famous guests were G-Eazy, French Montana, Wale, Thomas Jack and Russell Simmons, who gathered to celebrate with brand founder Glenn Coleman.\n\nAs the night fell and the festival came to an end (after Lady Gaga’s historic performance as first female headliner at Coachella), people transformed from festivalgoers to partygoers as they flocked over to Jeremy Scott’s Moschino x Candy Crush celebration—which was, to say the least, impressive and over the top. Guests like Kristen Stewart, Stella Maxwell, Rita Ora, Katy Perry (who was “dancing around the stage”), Emily Ratajkowski, Kylie Jenner, Jordyn Woods, Travis Scott, Soko, Taylor Hill, Charli XCX, Coco Rocha, Riz Ahmed and many more danced to performances by Lil Yachty and Lil Uzi Vert, and snacked on french fries, beef and veggie sliders, grilled cheese and a large candy bar equipped with mini jawbreakers, swedish fish, an array of gummy bears and taffy. Jenner and Scott, who performed at the festival Friday arrived around 2:45 a.m. and proceeded straight to the VIP area. Newly single Jenner and Scott have been sparking dating rumors since she split with rapper Tyga. “Kylie and Travis made their way to a private table, where they were joined by friends and enjoyed the deejay,” a source tells PEOPLE. “After five minutes of being in a very crowded space, Travis got up and left the table, and Kylie followed him out with her friends following close behind her.”\n\nOver at the #WeedMapsOasis presented by Brass Knuckles, West Coast Cure, FlavRX and Nameless Genetics, sister Kendall Jenner was adding fuel to the fire about a romance sparking between she and rapper A$AP Rocky, who was performing at the party. “Kendall showed up with a posse just for him and they were all over each other,” an onlooker tells PEOPLE. The pair has been consistently hanging out since mid last year, grabbing dinners together and even joining each other on trips to Europe. A source told PEOPLE in March the two have been “spending more time” together and that Jenner is “open to seeing where it goes.”\n\nThe party hopping just keeps on going for Alessandra Ambrosio, who stopped by Neon Carnival. The model danced to house music as she excitingly waited to play one of the carnival games. Leonardo DiCaprio partied at a table adorned with models and bottles of 1942 Tequila Don Julio, with friends like Tobey Maguire dancing around him throughout the evening’s performances. Keeping it low key, as usual, DiCaprio donned his classic festival ensemble of a sweater and baseball cap. Rihanna, another known Neon Carnival alum, wore her sunglasses at night while sipping on a magnum bottle of 1942. Also attending the exclusive event was Selena Gomez, Drake, French Montana, Cassie, Belly, Diddy, G-Eazy, Vin Diesel, Aaron Paul and Nicole Scherzinger. Gomez, who arrived solo, met up with The Weeknd at his table. At one point, the couple made their way to the VIP restroom holding hands. It was “very cute,” says an onlooker, adding that the Weeknd made sure security guards were around and that things were blocked off for Gomez. “He gave her a hug and a kiss before they went back to their table,” shares the onlooker. Around 1 a.m., Nick Jonas, Joe Jonas, Sophie Turner, Joe’s DNCE band mates, and a bunch of friends arrived. Joe and Turner stayed close to each other while they were at the outdoor party. When the group stopped to listen and enjoy the music, Turner sweetly wrapped her arms around him. Almost an hour later, Amber Rose and Odell Beckham Jr. arrived with a huge posse in tow. They headed straight to a VIP table at the Levi’s sponsored-event, which featured an epic dance floor, amusement park rides, games and hairstyling stations by Batiste Dry Shampoo. For food, guests dug into pizza and sipped on Tequila Don Julio cocktails.\n\nImage zoom Marksman/MEGA\n\nSunday, April 16\n\nHappy Easter! To help Coachella attendees and partygoers unwind from the long weekend, Katy Perry threw an Easter Day Recovery Brunch. The event, which also celebrated the launch of the singer’s new footwear line, was the ultimate R&R spot. It included everything from a delicious buffet brunch by Toca Madera to an oxygen bar to massages—and in the spirit of Easter, a giant purple Easter bunny was dancing all around the soirée! If you were lucky enough to catch a glimpse of Perry, the star made her way through the event, stopping to take photos with fans and to have a dance session with pal Mia Moretti. For drinks, attendees could choose anything from mimosas to creating their own Bloody Mary to a Juicero pop-up juice station, which was enjoyed by Perry herself. (She opted for the Beta Glow.) And of course, you can’t leave empty handed, guests were gifted shoes from the singer’s collection as well.\n\nMaking sure to go out with bang, #REVOLVEFestival hosted one last fashion-filled party to round up the weekend. Kendall Jenner, Hailey Baldwin, Joe Jonas and DNCE, Soko, Terrence J, Jasmine Sanders, Chris Pine, Skrillex, Noah Cyrus, and Nicole Scherzinger and fellow Pussycat Dolls founder Robin Antin. were just a several of the 1,500 guests who flocked to the Merv Griffin Estate on Sunday to conclude a successful several days of partying from sun up to sundown. Sleepless nights definitely call for a little booster – guests stopped by the ORB™ teepee-esque photo booth for an aura photo reading experience with ORB™ Vitamins. The photo booth read each guest’s energy waves and matched them with the best ORB™ product for their aura like a Smooth Energy or Sleep Complex. And speaking of those who were definitely in need of some rest after the long weekend, Jenner – the queen of party hopping – and friends arrived just in time to dance to Migos’ surprise performance, before sneaking away to the back of the house for impromptu tattoos. “Kendall and Hailey were playing with the REVOLVE water guns when Hailey told Kendall she’d ‘be right back,’ and ran up the REVOLVE House to get a hand tattoo by celebrity artist Jonboy,” a source tells PEOPLE. VIPs shaded themselves poolside in cabanas and quenched their thirst with Moët Ice Imperial – a champagne designed specifically to be enjoyed over ice.\n\nImage zoom Thaddaeus McAdams/WireImage\n\nAin’t no party like a Fifth Harmony party! The girl group, along with party deejays Serayah and Alexandra Richards, stopped by the Galore x Stillhouse Poolside Brunch on the last day of Coachella, where guests indulged in “poptails” provided by Stillhouse whiskey x Chloe’s Soft Serve Fruit.​ But there seemed to have been a running theme this Coachella–there’s never just one party. On Friday, Jeremy Scott, Taryn Manning, Jasmine Sanders and more stopped by the Galore/Grindr x Stillhouse Pool Party with Charli XCX, who performed while guests enjoyed the brand’s whiskey cocktails. ​Jordyn Woods, Manning, Alie Layus, and more spun some fun tunes throughout the day.\n\nStay tuned for more fun sightings inside Coachella’s hottest parties!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fparis-hilton2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fdnce-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Falessandra1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkate-bosworth1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fsofia-richie-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fchord-overstreet-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Famber-rose-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Forlano-bloom-leo-dicaprio-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkendall-jenner8-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkaty-perry7-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Falessandra-ambrosio3-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fashlee-simpson-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fnicole-richie2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2066'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fashley-tisdale-5-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkaty-perrt-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg", "keywords": [], "authors": ["Nicole Sands", "Mariah Haas"], "canonical_link": "https://people.com/music/coachella-2017-inside-the-hottest-parties/", "title": "Coachella 2017: Inside the Hottest Parties", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Alessandra Ambrosio,Chanel Iman,Drake,Hailee Steinfeld,Halsey,Katy Perry,Keeping Up with the Kardashians,Kylie Jenner,Leonardo DiCaprio,Music News,News,Nicole Richie,Orlando Bloom,Paris Hilton,Rihanna,Rita Ora,Russell Simmons,Sean \"Diddy\" Combs,Selena Gomez,Shay Mitchell,Sofia Richie,The Coachella Music and Arts Festival,Tobey McGuire,Tyga", "news_keywords": "Alessandra Ambrosio,Chanel Iman,Drake,Hailee Steinfeld,Halsey,Katy Perry,Keeping Up with the Kardashians,Kylie Jenner,Leonardo DiCaprio,Music News,News,Nicole Richie,Orlando Bloom,Paris Hilton,Rihanna,Rita Ora,Russell Simmons,Sean \"Diddy\" Combs,Selena Gomez,Shay Mitchell,Sofia Richie,The Coachella Music and Arts Festival,Tobey McGuire,Tyga", "description": "Hollywood's biggest names will flock to the desert this Easter weekend for Coachella Music and Arts Festival", "og": {"title": "Coachella 2017: Inside the Hottest Parties", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/coachella-2017-inside-the-hottest-parties/", "description": "It’s that time again! Hollywood’s biggest stars like&nbsp;Leonardo DiCaprio, Orlando Bloom and Katy Perry&nbsp;descended on the California desert this weekend to kick off the first&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/coachella-2017-inside-the-hottest-parties/", "description": "Hollywood's biggest names will flock to the desert this Easter weekend for Coachella Music and Arts Festival", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/coachella-2017-inside-the-hottest-parties/", "title": "Coachella 2017: Inside the Hottest Parties", "description": "Hollywood's biggest names will flock to the desert this Easter weekend for Coachella Music and Arts Festival", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fkylie-jenner4.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}