{"url": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245", "text": "Jimmy Kimmel spotlights son's rare heart birth defect His son William was diagnosed with tetralogy of fallot with pulmonary atresia.\n\n\u0097 -- In an emotional monologue on his show, Jimmy Kimmel told the story of his son's harrowing first few days after being diagnosed with rare and potentially dangerous cardiac defects.\n\nThe \"Jimmy Kimmel Live!\" host was sometimes brought to tears as he talked about how his newborn son William was diagnosed with \"tetralogy of fallot with pulmonary atresia.\"\n\nHe recounted that a nurse first noticed something was wrong with William, when he was only a few hours old, noting that the infant \"was a bit purple.\" The baby was taken to the neonatal intensive care unit where the medical staff started to see signs that something was wrong with his heart.\n\n\"The room started to fill up. More doctors, nurses, and equipment started coming in and they determined that he wasn’t getting enough oxygen into his blood,\" Kimmel said. \"It’s a terrifying thing.\"\n\nThe infant was eventually taken to Children's Hospital Los Angeles, where doctors performed open-heart surgery to help his heart function. The initial surgery went well but Kimmel said his son will need at least two surgeries in the future.\n\nHere's a look at the rare birth defects and how they're detected.\n\nWhat is the condition?\n\nKimmel said his newborn son was diagnosed with the tetralogy of fallot with pulmonary atresia, which actually describes two congenital heart defects.\n\nThe condition tetralogy of fallot is characterized by a combination of multiple defects that affect the heart's structure and function. There is a hole in the wall between the lower chambers of the heart, an obstruction from the heart to the lungs and the aorta -- the major blood vessel into the heart -- lying over the lower chambers of the heart, according to the American Heart Association. As a result of the defect, blood is not fully oxygenated as it flows through the body, according to the Mayo Clinic.\n\nKimmel's newborn son had an additional complication where the valve that allows blood flow to the pulmonary artery is blocked. This is called pulmonary atresia.\n\nHow often does it occur?\n\nTetrology of fallot is estimated to occur in about 5 for every 10,000 live births, according to the National Institutes of Health.\n\nIn general, heart conditions are among the most common birth defects, according to Dr. Eric Devaney, Chief of Pediatric Cardiac and Thoracic Surgery at UH Rainbow Babies & Children’s Hospital .\n\n\"A lot of the defects that are apparent when the baby is born [are] obscured by the fact that the placenta deals with gas flow,\" Devaney said, explaining the placenta would be able to oxygenate the blood in utero.\n\nWhat are the symptoms?\n\nSymptoms of this condition can vary depending on the severity of the defect. In extreme cases, babies can appear blue-ish or \"cyanotic\" because their blood isn't being oxygenated properly. An infant may also have a heart murmur.\n\nIf the defect isn't as pronounced, the condition may not be diagnosed until the infants are older. Some babies have \"Tet spells\" where they cry and then pass out. These spells are caused by a sudden drop in oxygen, due to the malformed heart. In these cases, the infants may be agitated and suddenly develop blue skin, nails or lips, they can also be at risk for fainting or even death.\n\nHow is it treated?\n\nTo help the heart function properly, surgeons generally have to perform open heart surgery to fix the defect. Surgeons will work to fix the hole in the heart and open up the pulmonary artery to help the blood flow more easily, according to the Mayo Clinic.\n\nOften doctors will perform the surgery in stages, first creating a shunt to help with blood flow before a more extensive surgery is done to fix the problem. Children will generally need life-long care by a cardiologist to monitor any complications over time.\n\nDr. Karen Kagha is a dermatology resident and a resident at ABC News Medical Unit", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s.abcnews.com/images/Health/ht-kimmel-newborn-son-hb-170502_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/Health/ht-kimmel-newborn-son-hb-170502_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Gillian Mohney", "May", "Min Read"], "canonical_link": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245", "title": "Jimmy Kimmel spotlights son's rare heart birth defect", "meta_data": {"keywords": "abcnews", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Jimmy Kimmel spotlights son's rare heart birth defect", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245", "title": "Jimmy Kimmel spotlights son's rare heart birth defect", "image": "https://s.abcnews.com/images/Health/ht-kimmel-newborn-son-hb-170502_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-05-02T23:36:12Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,47154245", "ipad": "abcnewsipad://link/story,47154245", "googleplay": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Jimmy Kimmel spotlights son's rare heart birth defect", "url": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245", "image": {"identifier": "https://s.abcnews.com/images/Health/ht-kimmel-newborn-son-hb-170502_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,47154245", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,47154245", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Health/jimmy-kimmel-spotlights-sons-rare-heart-birth-defect/story?id=47154245"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}