{"url": "https://web.archive.org/web/20071020151813/http://capitaleye.org:80/inside.asp?ID=311", "text": "October 19, 2007 | Check back periodically for new additions to this digest. President John Doe (10/19/07, 5:30 pm)\n\nPresident John H. Cox? President Dal Lamagna? These names might not sound familiar, but these guys have also reported raising money for a presidential bid this cycle—and in some cases have actually collected more than (slightly) better-known candidates. Cox, a Republican described as a \"Reagan fiscal and social conservative\" on his website, has raised $586,080 this year, which is more than Alan Keyes has raised, and Cox has more cash on hand than the newcomer. Lamagna, a \"progressive activist\" who has produced three documentaries about the Iraq war, has raised $376,400, which is more than Mike Gravel raised. Both Cox and Lamagna, however, have accrued pretty significant debt. Cox is in the hole $1.1 million, almost twice more than he's brought in, and Lamagna's debt is $349,000. But because they are both funding their own campaigns, they owe the money to themselves. Other lesser-known candidates are libertarians or members of other third parties. Military Continues to Give to Paul, Obama (10/19/07, 5:30 pm)\n\nDespite his anti-war stance, or perhaps because of it, Ron Paul continues to collect more money from members of the U.S. military than any other presidential candidate, including John McCain, a Vietnam War prisoner who backs the administration's policy in Iraq. Paul brought in at least $53,670 from the uniformed services, compared to McCain's $40,000. Democrat Barack Obama, who opposed the resolution to go to Iraq from the start, is the number-two recipient with at least $45,200. This trend may exemplify growing dissatisfaction among members of the military with the administration's handling of foreign policy, especially in Iraq. Democrats have received 35 percent of the total $319,000 in contributions from uniformed service members this year. By comparison, in 2000, the last presidential race before the Iraq war began, Democrats received only 18 percent of contributions from the military. *Read a Capital Eye story from September about military giving: The Other Iraq Surge Battle of the Sexes (10/19/07, 12:45 pm)\n\nHillary Clinton, the only woman running for president, is bringing in more money from female donors than any other candidate. But she doesn't have the largest number of female donors. That distinction belongs to Democrat Barack Obama, who has so far collected money from at least 22,045 women giving more than $200, compared to Clinton's 17,539. (Only donors who give more than $200 are itemized in campaign finance reports, so it's impossible to determine a gender breakdown for smaller donors.) Clinton is nearly tied with Democrat Dennis Kucinich in the percentage of total funds coming from women—about 44 percent for both of them. Among Republicans, a larger number of women have given to Mitt Romney than any other candidate in the party, 8,801 donors giving a total of $12.1 million, or about 32 percent of his total. But with about 35 percent of his funds from women, dropout Sam Brownback's receipts from females make up the largest percentage of his total compared to all other GOP candidates. Hedge Funds and Private Equity Invest in Giuliani, Democrats (10/19/07, 11:15 am)\n\nAs senators, Hillary Clinton and Barack Obama are debating legislation that would significantly increase taxes on hedge funds and private equity firms. As presidential hopefuls, the two are raking in money from the industry, while Mitt Romney, who made his fortune in private equity, is seeing a decline in contributions from them. Nearly 61 percent of the $5.7 million in donations from hedge funds and private equity firms went to Democrats during the third quarter. Although Romney brought in $597,800 during the 1st Quarter—more than any other candidate from either party—he is down to $76,350 for the 3rd Quarter and $944,275 for the year. Clinton has collected $966,300 and Obama has collected $940,000 in the last nine months. The real winner of hedge fund and private equity money seems to be Republican Rudy Giuliani. He has amassed $1.1 million from the wealthy industry so far. Investing in Politics: What the candidates have brought in so far from hedge funds and private equity firms Candidate 1st Quarter 2nd Quarter 3rd Quarter Total Rudy Giuliani $358,200 $519,950 $246,095 $1,124,245 Hillary Clinton $333,850 $374,950 $257,500 $966,300 Mitt Romney $597,800 $270,125 $76,350 $944,275 Barack Obama $161,330 $667,944 $110,623 $939,897 Chris Dodd $394,800 $374,250 $146,900 $915,950 John McCain $146,550 $149,200 $31,650 $327,400 John Edwards $208,300 $28,800 $16,965 $254,065 Bill Richardson $13,300 $78,900 $37,200 $129,400 Joe Biden $13,100 $38,300 $8,800 $60,200 Sam Brownback $11,500 $6,350 $2,300 $20,150 Fred Thompson N/A N/A $17,300 $17,300 Ron Paul $0 $2,800 $2,200 $5,000 Tom Tancredo $0 $1,000 $500 $1,500 Duncan Hunter $0 $1,000 $0 $1,000", "images": ["https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/corner_botR.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/tabs_home.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/RSS.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/centerlogo.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/curve.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/corner_botL.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/tabs_archives.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/edge_top.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/spacer.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/include/img/space.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/masthead.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/tabs_opinion.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/corner_topL.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/edge_bot.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/tagline.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/corner_topR.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/CCCCCC.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/tabs_email.gif", "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/static.jpg"], "top_img": "https://web.archive.org/web/20071020151813im_/http://capitaleye.org/img/static.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Summing Summertime: Part 4", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}