{"url": "https://www.bustle.com/p/john-stamos-birthday-message-for-lori-loughlin-proves-that-uncle-jesse-aunt-becky-are-forever-9922558", "text": "Get ready to feel nostalgic, Full House fans. On Saturday, John Stamos posted an adorable birthday message for Lori Loughlin, and it featured a special throwback picture. These two actors have been co-stars for a long time, and they first appeared onscreen together as Jesse and Rebecca in Full House, which premiered in 1987. Stamos' post brought back memories of their early days on the series, and his message was a tribute to both their television roles and friendship.\n\nThe caption reads:\n\n\"Been Jesse to your Rebecca for 30 years. 30 more, then that’s it! I don’t for one second take for granted your talent, your heart and most importantly, our friendship. Happy Birthday Lori, XO\".\n\nThe post shows that these two have remained close pals over the years, and that neither star expects that to change. Loughlin and Stamos began their careers on the sitcom, which was popular throughout the late '80s and '90s. The series followed the story of TV sports anchor Danny Tanner, who recruits his comedian best friend Joey, and musician brother-in-law Jesse to help raise his daughters after his wife passes away. Danny becomes friends with another anchor named Rebecca Donaldson, who is played by Loughlin. Rebecca eventually falls for Jesse, and becomes part of the family.\n\nJesse and Rebecca ended up together on the show, and while Loughlin and Stamos never had a real-life romance, this birthday post shows that they remain close friends. According to The Today Show, Loughlin responded to the birthday wish, commenting, \"It's been a great 30! I'm so glad we've been on this journey together!! I love ya buddy!!\"\n\nIn 2016, a sequel to the series called Fuller House premiered on Netflix, bringing the two stars back together onscreen. It turns out the whole cast of the reboot was by Loughlin's side on her birthday. On Saturday, she posted a group photo with Stamos, and her other co-stars Andrea Barber, Candace Bure, and Jodie Sweetin on Instagram. The caption read: \"So much love for this group!!!\" and was followed by several heart emojis. Bure, who plays D.J. Tanner, commented: \"Happy Birthday!!!! Love you tons and tons.\" It looks like even though the actor spent most of her birthday on the set, the cast and crew made time to celebrate and have fun.\n\nStamos wasn't the only co-star to share a birthday wish for Loughlin. Barber posted a picture with the star from the Fuller House set, writing: \"Happy birthday to my beautiful friend Lori Loughlin, who has the best laugh, the prettiest smile, the funniest dog, and the biggest heart. I love you, Lori!\". Bob Saget also posted a picture with his co-star to Instagram, writing:\n\n\"Happy Birthday Lori. Always so sweet, so smart, so beautiful. So lucky to have you as a friend all these years. Let's make a real series out of \"Wake Up San Francisco.\" Should play well in Kentucky. Love you.\"\n\nUltimately, it's the bond between Stamos and Loughlin that fans can't seem to get enough of though. They've appeared alongside each other for over three decades, and built a pretty incredible friendship over the years. His sweet throwback post shows that they're still such good friends, and they're definitely keeping the Uncle Jesse and Aunt Becky feels alive.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/8/630a9d05-b742-4adb-82c5-030cd815d6dc-fh_101_02597r1.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/af2e6901-e5ed-4ac0-aab9-f8c9e3176b4e-lizzie-mcguire-lizzie-gordo-photo.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/3/df260296-aee0-4393-987d-88377b50e0df-getty-1216034319.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/8/22af50f6-993f-4859-8cf9-8047932c1348-getty-954387504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/7/29/e5afcc69-5381-458f-95ca-0ee2f84472b8-getty-520309562.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/7/29/e5afcc69-5381-458f-95ca-0ee2f84472b8-getty-520309562.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/29/4b930816-20e5-4813-998c-02a13957355f-fangirls1-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/29/e5afcc69-5381-458f-95ca-0ee2f84472b8-getty-520309562.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/john-stamos-birthday-message-for-lori-loughlin-proves-that-uncle-jesse-aunt-becky-are-forever-9922558", "title": "John Stamos' Birthday Message For Lori Loughlin Proves That Uncle Jesse & Aunt Becky Are Forever", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/john-stamos-birthday-message-for-lori-loughlin-proves-that-uncle-jesse-aunt-becky-are-forever-9922558", "type": "article", "title": "John Stamos Sent Lori Loughlin A Sweet Birthday Message That Uncle Jesse Would Approve Of", "description": "Get ready to feel nostalgic, Full House fans. On Saturday, John Stamos posted an adorable birthday message for Lori Loughlin, and it featured a special throwback picture. These two actors have been co-stars for a long time, and they first appeared…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/29/e5afcc69-5381-458f-95ca-0ee2f84472b8-getty-520309562.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Get ready to feel nostalgic, Full House fans. On Saturday, John Stamos posted an adorable birthday message for Lori Loughlin, and it featured a special throwback picture. These two actors have been co-stars for a long time, and they first appeared…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}