{"url": "www.billboard.com/articles/columns/pop-shop/6700657/justin-bieber-gun-control-kanye-west-song", "text": "In a new interview, Justin Bieber spent about 13 minutes discussing a myriad of topics, from his humble beginnings and fame to collaborating with Kanye West and his personal views on gun laws.\n\nWatch Ariana Grande Cover Justin Bieber's 'What Do You Mean?' in Concert\n\nThe conversation, filmed for France’s Clique TV, began with Bieber talking about his image.\n\n“I just want people to see me as a normal dude,” he said. “Like, I just come in here with my hoodie because I’m comfortable, and just chillin’, and not trying too hard. I just want to have a good time and show people that I’m normal.”\n\nDespite wanting to be viewed as an average guy, the “What Do You Mean?” singer said that he’s appreciated the doors that success has opened for him and his family.\n\n“It felt really cool, man,” Bieber said when asked what it was like to get his first big paycheck. “It felt like … I used to have to, my mom would always make me order water at restaurants. I could never get a soft drink. Those are like little things that when you’re a kid, they matter. Like, you get disappointed, like, ‘I just wanted a soda, Mom.’ Or like, I would go and share meals with my mom and stuff. It’s not like we were like, really, really, really dirt poor, but there were struggles, and when I got my first check I just felt the security to be able to take care of my mom because she always took care of me. Just being able to take care of your mom feels really good.”\n\nStill, he admitted that the fact that he’s famous doesn’t mean that he never feels alone.\n\nJustin Bieber Says He's Single and 'Ready to Mingle' on 'Ellen'\n\n“People would never guess that artists like myself would feel lonely, with all things that are always around us and people, but a lot of it is really surface-y, and there’s no depth to those relationships. So you just end up feeling like, well, I’m connecting but I’m not feeling what I want to feel,” he explained. “So, that’s where I ended up. I was just in a place of like searching because I felt like people weren’t what I needed them to be for me. So now, I’m really surrounded by really cool people who are like, really for me, and I can really connect with [them]. I’m in the best place ever, probably [that] I’ve ever been in my life.”\n\nThe discussion then turned to Kanye West, who has collaborated with Bieber for the singer’s next album.\n\n“We did this one song -- I don’t know if it’s gonna make the album, but it was really cool, a really New York vibe,” Bieber revealed.\n\n“Kanye’s a talker, so you get him in a room and he just starts talking, and he just starts ranting, and I just sit and I listen because he’s been through a lot of stuff. He’s not just talking to just talk. He’s obviously got something to say that he’s feeling from his heart. So when I hear that, I like to just sit and listen. He’s a really, really smart guy,” he added.\n\nSince Kanye recently announced his intentions to run for president in 2020, Bieber was asked what he would do in that position -- if he, of course, was eligible to be elected as President of the United States. While answering the question, Bieber took the opportunity to open up about his views on gun control.\n\n“I’d probably just fix some of the gun laws,” he said. “In Canada, we don’t really have any guns and there’s no gun violence, so that really solves it. I mean, they think that it’s for protection and stuff, but it always ends up in some bozo’s hand.”\n\nBieber also named his all-time favorite rappers, talked about his friends in the skateboarding community and more. Watch the full interview below:", "images": ["https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/media/billboard-logo-b-20-billboard-1548-compressed.jpg", "https://static.billboard.com/files/media/Justin-Bieber-Video-Music-Awards-MTV-2015-BIillboard-650-compressed.jpg", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?c596412deda54d9a807d"], "top_img": "https://static.billboard.com/files/media/Justin-Bieber-Video-Music-Awards-MTV-2015-BIillboard-650-compressed.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.billboard.com/articles/columns/pop-shop/6700657/justin-bieber-gun-control-kanye-west-song", "title": "Justin Bieber Talks Gun Control, Feeling Lonely & Working With Kanye on Song With a 'New York Vibe'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2015-09-20T13:49:05-04:00", "published_time": "2015-09-19T21:19:51-04:00"}, "description": "In a new interview, Justin Bieber spent about 13 minutes discussing a myriad of topics, from his humble beginnings and fame to collaborating with Kanye West and his personal views on gun laws.", "og": {"description": "In a new interview, Justin Bieber spent about 13 minutes discussing a myriad of topics, from his humble beginnings and fame to collaborating with Kanye West and his personal views on gun laws.", "image": {"identifier": "https://static.billboard.com/files/media/Justin-Bieber-Video-Music-Awards-MTV-2015-BIillboard-650-compressed.jpg", "height": 430, "width": 650}, "title": "Justin Bieber Talks Gun Control, Feeling Lonely & Working With Kanye on Song With a 'New York Vibe'", "type": "article", "url": "http://www.billboard.com/articles/columns/pop-shop/6700657/justin-bieber-gun-control-kanye-west-song", "site_name": "Billboard"}, "title": "Justin Bieber Talks Gun Control, Feeling Lonely & Working With Kanye on Song With a 'New York Vibe'", "twitter": {"card": "summary_large_image", "description": "In a new interview, Justin Bieber spent about 13 minutes discussing a myriad of topics, from his humble beginnings and fame to collaborating with Kanye West and his personal views on gun laws.", "image": "https://static.billboard.com/files/media/Justin-Bieber-Video-Music-Awards-MTV-2015-BIillboard-650-compressed.jpg", "title": "Justin Bieber Talks Gun Control, Feeling Lonely & Working With Kanye on Song With a 'New York Vibe'", "site": "@billboard"}}, "movies": [], "publish_date": 1442711991.0, "source": "http://www.billboard.com", "summary": ""}