{"url": "www.emirates247.com/entertainment/kuwtk-kim-kardashian-west-goes-blonde-for-kanye-west-on-anniversary-2018-05-25-1.665367", "text": "By Bang\n\nKim Kardashian West has \"gone blonde\" again to mark her fourth wedding anniversary as her husband Kanye West prefers her with blonde hair.\n\nThe 'Keeping Up With The Kardashians' star shared a video of her sporting blonde locks as she knows it is her husband Kanye West's \"favourite\".\n\nShe captioned the short video: \"Went blonde again for my anniversary it's @kanyewest's favorite (sic)\"\n\nKim and Kanye celebrated their fourth anniversary on social media earlier on Thursday, where Kim praised Kanye and dubbed him an \"inspiration\".\n\nPosting a picture of them from their wedding day, Kim wrote: \"4 years down and forever to go ... Thank you babe for giving me our family and caring so much about us. Thank you for inspiring me on a daily, I'm so lucky. I can't wait for forever ... Happy Anniversary (sic)\"\n\nKim - who has North, four, Saint, two, and Chicago, four months, together - previously revealed her husband prefers her with blonde hair.\n\nAsked if Kanye prefers her with dark or blonde hair, she replied: \"Both but maybe a little more blonde.\"\n\nAnd continuing on Twitter, she added: \"Wait I miss my short hair! Time to take extensions out! I'm so indecisive ... Oh no no no. Never this again ... Not [going back to dark hair] right now. Since it's newly bleached i have to wait a few weeks to change colours. Maybe when the roots grow out too much. It will be years before I go blonde again so have to enjoy it.\"\n\nKim previously admitted she found going blonde \"very high maintenance\", but she is grateful for her hairdresser Chris Appleton for persevering to get her hair done.\n\nShe added: \"This blonde is very high maintenance. Love you @ChrisAppleton1 but getting over this. (sic).\"\n\nKhloe Kardashian wants to marry Tristan Thompson 'eventually'\n\nKhloe Kardashian wants to marry Tristan Thompson \"eventually\" despite him being seen kissing another woman just days before Khloe gave birth to their daughter True.\n\n💕Happy One Month True 💕 A post shared by Khloé (@khloekardashian) on May 12, 2018 at 5:37am PDT\n\nThe 'Keeping Up With The Kardashians' star's partner was seen kissing another woman just days before Khloe gave birth to their daughter True but she gave him another chance and she is \"happier and happier every day\".\n\nA source told People magazine: \"She is doing great. She seems happier and happier every day ... She wants her family to be together ... He has been very apologetic. Khloé wants to get married eventually, but there are no serious wedding talks yet.\n\n\"She does talk about a future with Tristan, though. She believes they can figure things out and have a happy life together. True is doing great, too. And Kris [Jenner] is so proud of all her grandkids. She constantly shows pictures of all the babies.\"\n\nKhloe's sister Kim Kardashian West recently admitted she was \"rooting\" for the pair and hopes that they would reconcile.\n\nShe said: \"I'm always rooting for her. I'm always rooting for love. I'm always rooting for families.\"\n\nDespite Kim's optimism, it was previously reported that members of Khloe's family - which also includes brother Rob Kardashian - and close friend circle were shocked by her decision to forgive Tristan.\n\nSources said that the family were hopeful that Khloe would \"move on\" from Tristan but remain civil for the sake of their child. However, they respect Khloe's decision to rekindle the romance and support the relationship, if it's what Khloe wants.\n\nKhloe Kardashian's tough name decision\n\nKhloe Kardashian found it \"so tough\" to pick a name for her daughter, but went for True as it has a family connection.\n\nThe 33-year-old reality star gave birth to her daughter True - whom she has with her boyfriend Tristan Thomspon - just over a month ago, and in a new post on her app, khloewithak.com, she has revealed that it was her grandmother MJ who picked out the tot's unusual moniker after Khloe had a hard time deciding.\n\nShe wrote: \"Picking a name for your child is really so tough! I knew I wanted my baby to have a 'T' initial, so one night while we were all at dinner, thinking of some names, my Grandma M.J. suggested True.\"\n\nThe unique name has a family connection, as the 'Revenge Body' star revealed it is her \"great-grandfather's first name and grandfather's middle name.\"\n\nKhloe said the name \"stuck with me for my entire pregnancy,\" and whilst the moniker conversation happened some time before her tot's birth, she couldn't get the name out of her head, and so decided to bestow it on her daughter.\n\nThis isn't the first time True's family connection has been discussed either, as Khloe's mother and 'Keeping Up with the Kardashians' co-star Kris Jenner previously revealed the link on social media.\n\nShe wrote: \"I'm so excited to welcome my precious little granddaughter True!!! FUN FACT... my Grandfather's name on my Dad's side was True Otis Houghton....my Dad's name was Robert True Houghton...so i am so excited Khloe named her daughter True!!! #lovebug #familytradition #family @true (sic)\"\n\nKhloe has been doting on her new arrival since her birth last month, and it was previously claimed is \"consumed with love\" for her baby.\n\nAn insider shared: \"Khloe is feeling nothing but happiness right now. She is head over heels in love with her little girl - she is just consumed with love. Absolutely nothing else matters. She's so incredibly happy that her baby is here, that she is big and strong and healthy and beautiful, and so right now Khloe truly has no other cares in the world.\"\n\nKim Kardashian West blames Kanye West for grey hair\n\nKim Kardashian West has joked her husband Kanye West is causing her hair to turn grey.\n\nThe 'Keeping Up With the Kardashians' star - who has children North, five, Saint, two, and three-month-old Chicago with her rapper husband - has discovered a silvery strand in her hair and joked it was triggered by the recent controversy surrounding the 'Famous' hitmaker.\n\nSpeaking on 'Live With Kelly and Ryan', she said: \"He's doing really good. He's in Wyoming recording, he has a couple of albums coming out so he's just focused on that.\n\n\"I will say, he gave me my first grey hair this week, and I am blaming that on him. But no, he's doing really good.\"\n\nThe 40-year-old rapper has caused a stir in recent weeks with his public support of President Donald Trump and faced a backlash when he claimed \"slavery was a choice\".\n\nHe said: \"When you hear about slavery for 400 years ... for 400 years? That sounds like a choice. We're mentally imprisoned.\"\n\nHowever, the 'Stronger' musician later took to Twitter to say his comments had been misconstrued.\n\nHe clarified: \"to make myself clear. Of course I know that slaves did not get shackled and put on a boat by free will\n\n\"My point is for us to have stayed in that position even though the numbers were on our side means that we were mentally enslaved\n\n\"They cut out our tongues so we couldn't communicate to each other. I will not allow my tongue to be cut\n\n\"the reason why I brought up the 400 years point is because we can't be mentally imprisoned for another 400 years. We need free thought now. Even the statement was an example of free thought\n\n\"It was just an idea (sic)\"\n\nKhloe Kardashian supports Tristan Thompson at basketball game\n\nKhloe Kardashian turned up at Tristan Thompson's basketball game over the weekend to show that they're still a couple.\n\nThe 'Keeping Up With the Kardashians' star set tongues wagging last week when she was spotted enjoying dinner with the 27-year-old sportsman - who was caught on camera kissing another woman while she was pregnant - and some of his friends.\n\nBut the 33-year-old beauty has made yet another attempt to prove that her and Tristan - who have three-week-old daughter True together - are stronger than ever as she turned up at the Quicken Loans Arena - escorted by security - to cheer him on while his team the Cleveland Cavaliers went up against the Toronto Raptors, TMZ reports.\n\nThe couple's relationship hit the headlines last month when video footage of Tristan appearing to kiss another woman in a nightclub in New York City emerged online.\n\nKhloe was heavily pregnant at the time and a day later delivered their daughter True.\n\nIt was initially thought the blonde beauty had decided to move back to Los Angeles, California, to be near her family and was awaiting the all-clear from the doctors to fly.\n\nHowever, Khloe has since changed her mind and is determined to make her relationship with Tristan work for the sake of their daughter.\n\nAnd, to ensure she's doing everything she can to make them work, she recently disabled the comments on all of the photographs she's posted of her and her boyfriend Tristan Thompson on her Instagram account.\n\nShe's also deleted the comments - many of which contained abuse aimed at Tristan - that fans have left on their photos since the cheating scandal came to light last month.\n\nShe's also wiped all the comments that had been left on the announcement post she shared when her baby daughter arrived into the world.\n\nAlongside a photo of her house covered in pink balloons, she wrote at the time: \"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True! [sic]\"\n\nHowever, many fans were quick to make their opinions heard and began questioning on the sweet shot why Khloe had allowed her baby to take Tristan's surname.\n\nKhloe Kardashian disables Instagram comments\n\nKhloe Kardashian has blocked her fans from leaving negative comments about her boyfriend Tristan Thompson after he was accused of cheating on her while she was heavily pregnant with their daughter True.\n\nThe 'Keeping Up with the Kardashians' star is desperately trying to save her relationship after it was claimed that her partner, with whom she has three-week-old daughter True, had cheated on her with multiple women while she was pregnant.\n\nAnd, in a bid to focus on their issues, the 33-year-old beauty has deleted the comments - many of which contained abuse aimed at Tristan - that fans have left on their photos since the cheating scandal came to light at the beginning of last month.\n\nThe blonde beauty has also wiped all the comments that had left on the announcement post she shared when her baby daughter arrived into the world.\n\nAlongside a photograph of her house covered in pink balloons, she wrote at the time: \"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True! [sic]\"\n\nHowever, many fans were quick to make their opinions heard and began questioning on the sweet shot why Khloe had allowed her baby to take Tristan's surname.\n\nKhloe was left devastated last month when footage emerged of 27-year-old Tristan - whom she's been dating since 2016 - appearing to kiss a woman in a nightclub in New York while his girlfriend was at home awaiting the arrival of their child.\n\nThe stress of the scandal reportedly sent Khloe into early labour and, although she was fuming with her partner, she allowed him to see his daughter being born.\n\nIt was then thought Khloe - who moved her whole life to Cleveland, Ohio, to be closer to the basketball player when she found out she was pregnant - would move back to Los Angeles to be near her family so they could help her raise little True.\n\nBut a source has since said: \"She's creating a life for her family in Cleveland.\"\n\nKylie Jenner admits there were 'better' names for daughter than Stormi\n\nKylie Jenner has confessed there are probably \"better\" names for her daughter and that she is \"not sure\" how she and her partner Travis Scott arrived at Stormi.\n\nThe 20-year-old beauty has confessed that she is not sure how she and her partner Travis Scott arrived at the unique moniker for their first child, though Kylie thinks her four-month-old baby \"picked her own name\" and it was just meant to be.\n\nSpeaking to her sister Kim Kardashian West for ES magazine, Kylie admitted: \"I really don't know how we thought of Storm. Her dad insisted it was him, but I feel like it was me.\n\n\"And that kind of just stuck with us.\n\n\"And then I didn't really like just Storm - I didn't feel like that was her name.\n\n\"So then it became Stormi. And it just stuck. I feel like there were a lot of other names that I might have even liked better to be honest, but I feel like Stormi picked her own name, like it was just her name.\"\n\nThe beauty businesswoman hopes that her daughter will grow into a \"strong\" and \"independent\" female.\n\nShe said: \"She's going to have her own challenges. I just hope that she's strong and independent and confident.\"\n\nKylie also admitted that she doesn't know whether she wants Stormi to be filmed for the family's show, 'Keeping Up with the Kardashians'.\n\nShe said: \"I have thought about it but I haven't come to a conclusion yet.\"\n\nWhilst Kylie doesn't have a problem with her family being in the spotlight, she admits she sometimes has fantasies about what it would be like to be a normal person.\n\nAsked by Kim if she wishes she was born into a \"non-famous family\", she said: \"I don't wish I'd changed my family, because I love my family. I do think about if I didn't have to be famous. And it's like a fantasy sometimes, but there's really not one problem I have. You figure out how to deal with it.\"\n\nNorth West refuses to talk to brother Saint\n\nKim Kardashian West has revealed her eldest two children don't talk as North, four, refuses to communicate with her two-year-old brother Saint.\n\nKim Kardashian West and Kanye West's four-year-old daughter still hasn't bonded properly with her two-year-old sibling, though she has started to learn how to share more.\n\nThe 37-year-old reality star says North has warmed more to the couple's four-month-old daughter Chicago, than she did when her brother was first born.\n\nAppearing on 'The Ellen DeGeneres Show' on Monday, Kim shared: \"She's better than she was with Saint ... there was a shocking moment yesterday.\n\n\"She literally had a can of popcorn and was like, 'Saint, do you want some?' And I was like 'What!?' You gotta understand, she does not share with Saint, she does not hardly talk to Saint, so that was such a big moment in my household.\"\n\nSpeaking in October, Kim admitted North was \"still jealous\" of Saint, and is yet to completely \"warm up\" to the tot.\n\nHowever, she insisted that North is not \"harmful\" towards Saint, and she simply \"doesn't want boys in her room\".\n\nThe brunette beauty said: \"Obviously North loves Saint, she just is still jealous. She needs to still get it together and warm up and be a little bit nicer, but I think she's getting there. I saw glimmers of hope a week ago. She's not harmful, she's not hurting him or anything. She just doesn't want boys in her room.\"\n\nThe businesswoman previously claimed in an interview in August last year that she finds it \"so hard\" to deal with her brood when they don't get along.\n\nShe said: \"I don't know if it's because she's the older sister. I don't know what it is. I thought it was a phase. She does not like her brother and it's so hard for me. She would get so jealous when I would breastfeed and all that kind of stuff. And now, the phase isn't going away.\"\n\nKanye West praised by Donald Trump\n\nPresident Donald Trump has claimed Kanye West has \"good taste\" after the rapper voiced his support for him on social media.\n\nThe 'Stronger' rapper turned heads this week when he took to Twitter to post a series of tweets in which he openly spoke of his support for the controversial US president, whom many A-List stars have campaigned against since he won the presidential election in 2016.\n\nAnd now, following on from Kanye's tweets, Trump has heaped praise on the 40-year-old musician, whom he says is \"smart\".\n\nSpeaking on Fox New's 'Fox & Friends', he said: \"You know, I have known Kanye a little bit and I get along with Kanye. I get along with a lot of people frankly, but Kanye looks and he sees black unemployment at the lowest it's been in the history of our country, okay? He sees that stuff and he's smart. And he says, you know what? Trump is doing a much better job than the Democrats did.\"\n\nThe music mogul first took to Twitter to speak in defence of Trump on Wednesday, when he revealed that he considers the 71-year-old politician to be his \"brother\", and said the pair share the same \"dragon energy\".\n\nHe wrote: \"You don't have to agree with trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought.\n\n\"If your friend jumps off the bridge you don't have to do the same. Ye being Ye is a fight for you to be you. For people In my life the idea of Trump is pretty much a 50 50 split but I don't tell a Hillary supporter not to support Hillary\n\n\"I love Hillary too. (sic)\"\n\nThe 'Heartless' hitmaker went on to insist that his thought don't come from a place of political leaning, as he doesn't consider himself to be a Democrat or a Republican.\n\nHe added: \"I love when people have their own ideas. You don't have to be allowed anymore. Just be.\n\n\"Love who you want to love. That's free thought. I'm not even political. I'm not a democrat or a republican.\"\n\nThe rapper later shared a snap of himself wearing a \"Make American Great Again\" hat, which was Donald Trump's campaign slogan during the election.\n\nHe also shared another picture of the headwear, proudly showing off the autograph President Trump had inked onto the cap.\n\nKanye's comments have caused the likes of Ariana Grande, Katy Perry, Kendrick Lamar, The Weeknd, and Rihanna to unfollow his Twitter account.\n\nInternational stars including British musicians Harry Styles and Zayn Malik, Australian musician and YouTube star Troye Sivan, and Korean pop group BTS have also made the move to stop following the rapper.\n\nKanye was defended on social media by his wife Kim Kardashian West - with whom he has four-year-old North, two-year-old Saint, and three-month-old Chicago - who said he shouldn't be \"demonised\" for voicing his opinion.\n\nShe wrote: \"Now when he spoke out about Trump... Most people (including myself) have very different feelings & opinions about this. But this is HIS opinion. I believe in people being able to have their own opinions,even if really different from mine. He never said he agrees with his politics\n\n\"He's a free thinker, is that not allowed in America? Because some of his ideas differ from yours you have to throw in the mental health card? That's just not fair. He's actually out of the sunken place when he's being himself which is very expressive (sic)\"\n\nKim Kardashian West's Instagram displays her mood\n\nKim Kardashian West's Instagram is where she posts her most personal feelings.\n\nThe 37-year-old reality star - who has four-year-old daughter North, two-year-old son Saint, and three-month-old daughter Chicago with her husband Kanye West - has 110 million followers on the app and it's the place where she most likes to share how she is feeling day-to-day, unlike Snapchat which she uses for their range of filters and Twitter for talking to others and seeking opinions.\n\nSpeaking about her use of the three social platforms, she said: \"Snapchat has the best filters, so I'm always using their filter, their camera for posting. With Instagram, it's this, like, mood for me.\n\n\"I'll post how I'm feeling, what I want to do, what I do. That's my mood.\n\n\"If I'm in Japan I'll put in all these inspo pics and I'll just, that's my vibe of what I'm feeling that week. So I think that's a good insight [into] my personality and what I'm feeling. With Twitter I really communicate with people the most. I look at that as the most interactive, but a great focus group too. I really do respect and value their opinions and I'm asking questions and love conversation back and forth. I love to live tweet if our show's on, if something's going on.\"\n\nWhile Kim is an avid social media user, the 'Keeping Up with the Kardashians' star has also admitted that she finds it \"hard\" to deal with trolls.\n\nShe told The Business of Fashion magazine:\"You have to be a strong person to just handle all the negative comments and the negative energy that comes your way, because if you put yourself out there, [it's] the nature of the internet [that] everyone's going to want to hate. That trolling energy that everyone puts out there, that negative energy, is really hard to deal with. It's really, really tough.\"\n\nKhloe Kardashian not giving up on Tristan Thompson\n\nKhloe Kardashian reportedly \"isn't ready to give up\" on her romance with Tristan Thompson, after he was accused of cheating.\n\nThe 33-year-old reality star gave birth to the pair's first child, a daughter named True, 11 days ago, just days after a video surfaced which seemingly showed the NBA star leaning in for a kiss with another woman.\n\nAnd although it was previously claimed Khloe would be leaving Cleveland - where she lives with Tristan - in order to continue her life at home in Los Angeles with her family, sources now say she is still unsure about whether she should leave her 27-year-old beau.\n\nAn insider said: \"Medically, she could leave Cleveland now - it's her choice to stay. She isn't ready to give up on her relationship with Tristan. She's still very torn. She doesn't want to make a decision right now.\n\n\"This was supposed to be the happiest time in her life. But she is still extremely disappointed with Tristan and isn't sure she can trust him again.\"\n\nAccording to the source, Tristan - who plays for the Cleveland Cavaliers - \"wants them to be together.\"\n\nThey added: \"It seems he's willing to get help. He admits his behaviour is completely wrong.\"\n\nHowever, it has been claimed the 'Keeping Up with the Kardashians' star's family is pushing for her to split with the sporting star, as they don't want to see Khloe - who also faced infidelity in her marriage to ex-husband Lamar Odom - to get hurt again.\n\nThe source told People magazine: \"Khloé's family thinks she deserves much better. They want her back in Los Angeles. Khloé got very burned in the past because she's too loyal - no one wants her to stay with a guy who might not change.\"\n\nKhloe's reported indecisiveness comes after it was previously claimed the 'Revenge Body' star was living on her own with her daughter after kicking Tristan out of their shared home.\n\nAn insider said: \"She left the hospital and is staying at Tristan's house. Khloe is waiting for doctors to tell her it's safe to fly and then she will return to Los Angeles.\"\n\nKim Kardashian West confirms DASH store closure\n\nKim Kardashian West has confirmed the closure of all the DASH stores she owns with her sisters.\n\nThe 37-year-old reality star and her sisters Kourtney and Khloe Kardashian shut down their New York branch of the boutique in December 2016, and after a report surfaced recently claiming they were planning on closing their Los Angeles and Miami outlets as well, Kim has confirmed the news.\n\nIn a post on her app and website on Thursday, the star - who has four-year-old daughter North, two-year-old son Saint, and three-month-old daughter Chicago with her husband Kanye West - wrote: \"After nearly 12 years, my sisters and I have decided to close the doors of our DASH stores. We opened our first store as a family in 2006 and since then we have made so many lifelong memories. From opening locations in Los Angeles, Miami and New York, to having our Dash Dolls spin-off show, it's been such a huge part of our lives.\n\n\"We've loved running DASH, but in the last few years we've all grown so much individually. We've been busy running our own brands, as well as being moms and balancing work with our families. We know in our hearts that it's time to move on.\n\n\"We love our DASH Dolls and are so grateful for the amazing memories - and we have to give a special thanks to the DASH employees and all of the incredible fans and customers who have supported us throughout the years! We couldn't have done it without you. Thank you to everyone!\"\n\nPreviously, it was claimed the two remaining DASH stores were \"bleeding money\", and that the 'Keeping Up with the Kardashians' stars would open their doors in Los Angeles and Miami for the last time on May 31.\n\nAn email from a company executive that was sent to vendors and obtained by RadarOnline.com said: \"The girls, Kim, Khloe & Kourtney have decided to close DASH as it is time to renew our leases but we cannot commit to another five years.\n\n\"With that being said, operations will end May 31st.\n\n\"You can contact me anytime up to that date with any concerns, question, or inquiries.\"\n\nKhloe Kardashian leaning on sisters\n\nKhloe Kardashian has admitted she has learned a lot about motherhood from her sisters.\n\nThe 33-year-old reality star welcomed her daughter True Thompson - whom she has with her boyfriend Tristan Thompson - into the world last week, and has claimed in a post on her app that she is picking up parenting tips from her sisters Kylie Jenner, Kim Kardashian West, and Kourtney Kardashian, who all have children of their own.\n\nKhloe - who also has half-sister Kendall Jenner and brother Rob Kardashian - said: \"[My sisters are] all such phenomenal moms. Sure, we disagree on some of our parenting skills, but ultimately I look up to them so much as mothers. I can't say exactly what advice or skills I'll be taking from them, but I'm going to remain awe-inspired by how they can handle it all. I hope that comes easily for me.\"\n\nThe 'Revenge Body' star admits she isn't the best at taking advice from other people, but knows she can always go to her siblings for judgement-free tips.\n\nShe added: \"Even though I'm not big on taking advice - I don't believe there's only one-way-or-the-highway and we all have to adapt into our own routines - it's so comforting to know that I have sisters whom I can ask about anything that may come up. Just by observing them as moms, I've already learned so much.\"\n\nKhloe is currently leaning on her family and 'Keeping Up with the Kardashians' co-stars more than ever, after video footage emerged shortly before her daughter's birth, which seemingly showed her NBA star beau leaning in for a kiss with another woman.\n\nRecently, it was claimed Khloe was living alone with her daughter after kicking the 27-year-old basketball player out of their shared Cleveland home.\n\nA source said: \"She left the hospital and is staying at Tristan's house. Khloe is waiting for doctors to tell her it's safe to fly and then she will return to Los Angeles.\"\n\nKardashians jet out of Cleveland\n\nThe Kardashians have jetted out of Cleveland after rallying around Khloe Kardashian following the birth of her first child, True.\n\nThe family - including Kris Jenner and her daughters Kim Kardashian West, Kourtney Kardashian and Kendall Jenner - were seen stepping onto their private jet and heading back to Los Angeles.\n\nKhloe's sisters flew into Ohio on Monday, whilst Kris has been there all week supporting her daughter, TMZ reports.\n\nIt was previously revealed that Khloe's mother Kris is keeping her \"spirits high\" after Khloe's partner Tristan - with whom she has daughter True - was seen getting close to another girl, just a few days before True arrived into the world.\n\nThe insider shared: \"Khloe needs her mom more than ever now. Everyone has always seen Khloe as the strongest sister, but in light of the new baby and the timing of Tristan's cheating scandal, having her mom by her side has been so essential in keeping her spirits high. Khloe and Kris are spending true bonding time with the new baby. Kris is teaching Khloe the ropes when it comes to breastfeeding. People always hear of the drama that goes on in the Kardashian family but Khloe and her mother have spent some wonderful moments together despite the recent news ...\n\n\"Kris has gathered the family and made sure they would all be there for her. They are so excited for Khloe. Her sisters are being super supportive of her ... her family is rallying around her. The video hasn't stopped the Kardashians from making sure her day will be one of love and respect. They won't let any news change the importance of how beautiful this birth is for Khloe. They want her to focus on having a healthy experience. They really like Tristan and have welcomed him into their family. At this point, Khloe's family wants nothing more than to believe that he is a stand-up guy and that this was a setup. But only time will tell.\"\n\nKhloe Kardashian names her daughter True\n\nKhloe Kardashian has named her daughter - who she has with her partner Tristan Thompson - True.\n\nThe 'Keeping Up With The Kardashians' star has broken her silence since the birth of her daughter - who she has with her partner Tristan Thompson - and has revealed the unusual moniker they have decided on.\n\nShe wrote on Instagram: \"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True! (sic)\"\n\nIt was previously claimed that Khloe's mother Kris Jenner is keeping her \"spirits high\" after her partner Tristan was seen getting close to another girl, just a few days before True arrived into the world.\n\nThe insider shared\"Khloe needs her mom more than ever now. Everyone has always seen Khloe as the strongest sister, but in light of the new baby and the timing of Tristan's cheating scandal, having her mom by her side has been so essential in keeping her spirits high. Khloe and Kris are spending true bonding time with the new baby. Kris is teaching Khloe the ropes when it comes to breastfeeding. People always hear of the drama that goes on in the Kardashian family but Khloe and her mother have spent some wonderful moments together despite the recent news ...\n\n\"Kris has gathered the family and made sure they would all be there for her. They are so excited for Khloe. Her sisters are being super supportive of her ... her family is rallying around her. The video hasn't stopped the Kardashians from making sure her day will be one of love and respect. They won't let any news change the importance of how beautiful this birth is for Khloe. They want her to focus on having a healthy experience. They really like Tristan and have welcomed him into their family. At this point, Khloe's family wants nothing more than to believe that he is a stand-up guy and that this was a setup. But only time will tell.\"\n\nKhloe Kardashian filmed labour and delivery for Keeping Up With the Kardashians\n\nFans will reportedly be able to see Khloe Kardashian giving birth to her daughter on the new series of 'Keeping Up With the Kardashians'.\n\nThe 33-year-old reality TV star reportedly allowed the cameras of her family's E! show into her delivery suite at the Cleveland Clinic in Ohio in the early hours of Thursday so they could document her baby daughter being born for the forthcoming season 15.\n\nAnd that wasn't the only thing the cameras caught as it's believed the blonde beauty allowed them to record her reaction when she found out her boyfriend Tristan Thompson had allegedly cheated on her numerous times while she was pregnant, according to PEOPLE.\n\nIt's believed the stress of the alleged infidelity caused Khloe - who wasn't due to give birth until the end of the month - to go into early labour, but luckily her mother Kris Jenner, her sisters Kim Kardashian West and Kourtney Kardashian and best friend Malika Haqq managed to fly from Los Angeles to Cleveland in time to help her through the birth.\n\nDespite the stress he's caused, Khloe allowed 27-year-old Tristan - who also has a 16-month-old son called Prince Oliver from a previous relationship - into the delivery room.\n\nA source said: \"Khloe laboured yesterday at the hospital. Tristan was there for the birth. He has practice today, but will spend as much time at the hospital as possible.\"\n\nAnd, although their relationship is the hot topic of conversation, Khloe is determined to put the cheating scandal - which kickstarted this week when a video emerged of Tristan seemingly kissing another woman - to the side for the sake of their newborn daughter.\n\nThe insider explained: \"Everyone is focused on what's best for their baby girl. Khloe is being the bigger person and letting Tristan bond with their baby.\"\n\nTristan was captured on camera chatting with an unidentified woman at the PH-D lounge in New York City earlier this month, before seemingly leaning in for a kiss.\n\nThe woman who took the video said: \"I was there and he was on the table right next to us with a group of friends and some girl who he was obviously making out with all night.\n\n\"They were holding each other and it was so obvious. They were there when I got there and they were part of a big group of friends.\n\n\"They were talking and being around each other all night. He was texting and talking on the phone and she was obviously looking over his shoulder.\n\n\"Everybody knew who he was. We talked about it and everybody watched them make out several times. I have obviously seen him before and people around me were like, 'That's Tristan Thompson'. I have seen him on TV.\"\n\nThis isn't the first time Tristan has been accused of being unfaithful either, as TMZ alleged he had cheated on the 'Keeping Up with the Kardashians' star twice in October.\n\nKhloe Kardashian to give birth on Friday?\n\nKhloe Kardashian will reportedly give birth via a scheduled caesarean section on Friday.\n\nThe 33-year-old star was said to have been experiencing contractions on Wednesday a few weeks before her due date, but it's now been claimed she'll undergo a scheduled caesarean section later this week.\n\nAnd in the wake of claims her boyfriend Tristan Thompson has been unfaithful, she no longer wants him by the side at the birth so her mother Kris Jenner and oldest sister Kourtney Kardashian are on their way to Cleveland, Ohio, to support her, while other sibling Kim Kardashian West will also be there when she has her baby.\n\nA source told X17online: \"Khloe is devastated and humiliated. She's trying to keep it together for the sake of the baby's health, but she's done with him.\n\n\"She has changed her birth plan, and no longer will allow Tristan to be in the room when she gives birth.\"\n\nAlthough the 'Keeping Up With the Kardashians' star had planned to stay in Cleveland for some time because it offers her more privacy, she is now planning to fly back to Los Angeles \"immediately after\" leaving hospital.\n\nThe source added: \"Immediately after [the birth], she plans on leaving Cleveland and never returning.\n\n\"Kris has been working on coordinating a private jet with a medical staff to get Khloe and the baby safely from Cleveland to LA.\n\n\"She's also talking to their lawyers about Khloe filing for sole custody of the child. She's in absolute disbelief that Tristan has done this to her daughter, and now she's out for blood.\"\n\nTristan, 27, was seen getting close to a pretty brunette at rooftop bar PH-D Lounge in Manhattan over the weekend.\n\nThe video clip appears to show the basketball player - who already has 16-month-old son Prince with ex-girlfriend Jordan Craig - speaking to the mystery woman before he seemingly leans in for a sneaky smooch.\n\nThat's according to the woman who captured the footage, who said: \"I was there and he was on the table right next to us with a group of friends and some girl who he was obviously making out with all night.\n\n\"They were holding each other and it was so obvious. They were there when I got there and they were part of a big group of friends.\"\n\nKhloe Kardashian to produce series about murderous sisters\n\nReality star Khloe Kardashian has announced she is set to produce a new TV series about murderous sisters.\n\nThe 33-year-old reality star - who is currently pregnant with her first child - is to executive produce a new TV series for Investigation Discovery, which is to air in 2019.\n\nKhloe told the New York Post newspaper's Page Six column: \"I am so excited to be bringing you 'Twisted Sisters'.\n\n\"As a self-proclaimed 'true-crime addict' there is no better way to tell these tales about the bonds that sisters possess and how they can go so terribly wrong.\"\n\nEach episode of the six-part series will explore the true-crime stories of sisters who kill each other or sisters who team up to kill others.\n\nMeanwhile, a source recently claimed Khloe is keen to keep her daughter's birth \"top secret\" for a few days.\n\nThe 'Keeping Up with the Kardashians' star and boyfriend Tristan Thompson are currently preparing for the arrival of their first child, but the duo initially plan to keep things low-key for the first few days.\n\nThe insider explained: \"She may be on a roll now documenting her bump and revealing everything about her soon-to-arrive daughter, but in fact Khloe is terrified because it's her first baby, so she's doing a total blackout on it. Her plan is to keep everything secret for a few days - just like Kylie [Jenner, her half-sister] did.\n\n\"They really want a few days to themselves before the circus starts. Khloe knows fans will be desperate for news, but unless she demands the time to enjoy her first few days as a mum, things will go crazy immediately. She wants some time to take it all in and to catch her breath for as long as she can - this is precious to her.\"\n\nKhloe Kardashian working hard to stop stretch marks\n\nKhloe Kardashian reveals her top products for maintaining glowing skin during her pregnancy with her first child and avoid dreaded stretch marks.\n\nThe 'Keeping Up with the Kardashians' star maybe worth an estimated $40 million and is able to have her pick of the market's most luxury brands, but she swears by seven different oils and creams that can be bought in a pharmacy to keep her skin from being too badly damaged by her growing baby.\n\nTaking to her Instagram stories, Khloe - who is expecting a child with boyfriend Tristan Thompson - shared her products of choice saying:\n\n\"A few of my tummy oils and lotions for my tummy. Yes it's a lot but I don't use them all at once. I use different ones throughout the day or every other day.\"\n\nThe Good American founder included products such as Bio-Oil and Palmer's Cocoa Butter Tummy Butter as two of her favourite products to moisturise her ever-expanding bump and has previously praised the former product for its skin hydrating benefits.\n\nKhloe, 33, said: \"I keep Bio-Oil in my shower and before I get out, I drench myself in it from head to toe.\"\n\nAnd the 'Revenge Body' star makes sure to remain active during her pregnancy and admits she hasn't experienced a lot of the body disadvantages because she exercises.\n\nWriting on her app, she said: \"Whatever you do before you're pregnant, you're allowed to continue, and they say it leads for a better delivery. I feel great, and I would feel horrible if I was just sitting around, overeating all day ... I don't have swollen feet, I don't have a lot of these things because I'm staying so active right now. So, as long as I can, I want to keep that up.\"\n\nKylie Jenner did paternity test to prove Travis Scott is baby's father\n\nKylie Jenner reportedly had a paternity test done on her baby daughter Stormi to prove her boyfriend Travis Scott is the father.\n\nThe 'Keeping Up With the Kardashians' star's ex-boyfriend Tyga - whom she split from in April last year - has been suggesting that the two-month-old tot belongs to him throughout the 20-year-old reality TV star's pregnancy and shortly after the birth.\n\nIn a bid to put the rumours to rest once and for all, the brunette beauty agreed to have the DNA test done - under the condition that Tyga never spoke of it again.\n\nA source told The Sun newspaper: \"Tyga has been demanding a paternity test throughout Kylie's pregnancy but she wouldn't hear of it.\n\n\"She still cares for Tyga but this isn't something she ever wanted to agree to.\n\n\"Kylie begged him to back off because she didn't need the embarrassment.\n\n\"The last thing Kylie wanted was everyone to think she might be hooking up with two men during the time she conceived. She didn't want her millions of fans questioning who the father is. It's hard enough being a young, unmarried, pregnant mother without adding the notion, 'Who is the father?'\"\n\nKylie found out the result of the test, which proved baby Stormi belongs to her current boyfriend Travis, just before she posted a close-up shot of the tot on March 23.\n\nHowever, the make-up mogul is said to be fuming with Tyga, 28, as he took to his social networking sites just days later to address rumours that he's Stormi's dad - despite the former couple having the agreement that it'll never be spoken about.\n\nHe said at the time: \"I've never said anything about someone else's child or family insinuating my involvement; and will never do so. Please, Stop spreading false stories and attacking people's families. I have nothing to do with any of that. People should be able to live in peace. (sic).\"\n\nKylie dated Tyga for two years before they split at the beginning of April last year and the reality TV star was spotted getting cosy with Travis, 25, at Coachella.\n\nTravis is listed on Stormi's birth certificate as her biological father.\n\nKim giving parenting advice to sister Khloe Kardashian\n\nKim Kardashian West is giving her sister Khloe Kardashian plenty of advice as she nears the end of her pregnancy.\n\nThe 33-year-old reality star is expected to give birth to her first child, a daughter, with her boyfriend Tristan Thompson any day now, and her older sister Kim - who has North, four, Saint, two, and Chicago, two months, with her husband Kanye West - has revealed she has been telling her sibling what to expect from the coming weeks and months.\n\nShe said: \"Khloe and I have a really good thing going on right now. I'm like the real one with her [about] what goes down and how it's going to go down.\"\n\nBut 37-year-old Kim is having a hard time piling on the facts for her sister at the moment, as the blonde beauty has become \"too sensitive\" and \"freaked out\" as her due date creeps closer.\n\nKim added: \"You cannot tell her anything right now that's too sensitive because she's just so freaked out. So, I can't really get into the whole, like, nipples and breastfeeding thing. She's just going to have to figure that all out and slowly.\"\n\nKim has no concerns about her sister and 'Keeping Up with the Kardashians' co-star though, as she knows she'll be more than able to handle motherhood.\n\nSpeaking to 'Entertainment Tonight', she added: \"It'll be fine. She knows. She's seen all of us go through it. She's prepared, but I feel her and I are on a really good communication about everything. I know when to push it and when to ... right now isn't a time to freak her out. The closer it gets, you can't freak someone out.\n\n\"You have no idea and that's the beauty of it. You just have no clue and that's totally fine.\"\n\nCaitlyn Jenner has sun damage removed from nose\n\nCaitlyn Jenner has taken to Instagram to reveal she recently had \"sun damage\" removed from her nose, which she got as a result of not using sunblock.\n\nThe 'I Am Cait' star took to Instagram to share a make up free picture of herself, urging others to use sunblock, as she revealed she had to have a spot from her nose removed due to damage from the sun's rays.\n\nShe captioned the photo: \"I recently had to get some sun damage removed from my nose. PSA - always wear your sunblock (sic)\"\n\nCaitlyn has been very open with her followers about what she has gone through, having underwent a gender transition back in 2015, and she previously revealed she feels \"wonderful\" not having any more secrets.\n\nShe said: \"I don't have a secret left in my life. It's a wonderful feeling. The book is about a lifelong struggle. Everybody has their stuff. Everybody has things that they have to deal with in life, and what I've dealt with my entire life is my identity with myself as a person. To be able to share that journey with people ... feels great.\"\n\nAnd the 68-year-old television personality believes she threw herself into sport because of her \"issues with her gender\".\n\nShe added: \"You're not talking about sexuality - you're talking about who you are and who's in your soul. It goes through your head 24 hours a day, 365 days a year ... I grew up in the 50s and the 60s - there wasn't even a word for it. I didn't know what it was. I didn't know why.\n\n\"Sneaking into my mom's closet or my sister's closet ... walking around when I was 9 or 10 years old ... [with] a scarf over my head so it didn't look like I was a girl ... I look back on it now and a lot of the reasons why I was so obsessed with winning the games was because of my issues with gender.\"\n\nKhloe Kardashian had 45k flowers at baby shower\n\nKhloe Kardashian hired a floral artist and bought 45,000 flowers for her baby shower including 12,000 carnations.\n\nThe 'Keeping Up With The Kardashians' star celebrated her and partner Tristan Thompson's impending arrival with an English country garden meets Alice in Wonderland themed baby shower and instructed floral artist Jeff Leatham to pack in the hefty amount of flowers, including 12,000 carnations.\n\nHe said: \"Khloé's only thing was that pink was important to her. We came in with different ideas to create something whimsical. I pulled together some imagery of kind of a fantasy English garden. That's why we had those topiary animals made of greens and the flowers falling in a sculpture form from the ceiling. People walked into like some kind of crazy fantasy Alice in Wonderland atmosphere. We achieved that - and I was so excited because no one deserves it more than Khloé. There was over 45,000 flowers with 12,000 carnations. The elephants were so amazing. We made sure the trunks were up and flying because that means good luck and Khloé loved that. We wanted something different because there have been so many baby showers in the family and we've done all of them. So, we wanted to make sure they were all extremely different.\"\n\nMindy Weiss was in charge of planning the event, and she has revealed the most important thing to Khloe was having everyone there.\n\nShe said: \"The biggest priority for Khloé was having a room filled with all her friends and family, so we designed the whole event around the idea of having everyone there together.\"\n\nKhloe also reached out on her app to thank Jeff and Mindy for their work.\n\nShe wrote: \"My baby shower was such a dream, I'm STILL on cloud nine. It was beautiful beyond words. I have two very special people to thank for that: party planner Mindy Weiss and floral artist Jeff Leatham. They truly brought my vision to life and it was more than I could have imagined. Forever grateful!\"\n\nKim Kardashian West's ski lessons\n\nKim Kardashian West is teaching her kids to ski from an early age, following a tradition her late father Robert Kardashian set.\n\nThe 'Keeping Up With The Kardashians' star enjoyed going out on the slopes with her father Robert Kardashian before his untimely death in 2003 and wants to pass on the same tradition to her own children - North, four, Saint, two and newborn daughter Chicago.\n\nWriting on her blog, she shared: \"We usually skied together on Thanksgiving, which was his holiday to take us. Once I finally got back out there, it was as if I never left.\n\n\"Now, I make it a point to go at least once a year with my family. North has already had two years of ski lessons and I can't wait to start Saint next year! It's such a fun activity to do together as a family.\"\n\nAnd Kim has picked up another tradition from her father - writing a letter to each of her kids every year, which she plans to keep and give them to them when they are 21-years-old.\n\nShe revealed on Twitter: \"I found a 3 page letter my dad wrote me right after high school about life and it's so special to have. I re-read it last night. I write my kids a letter each year reflecting on the year we had together & fun memories. I'll give the letters to them when they turn 21 (sic)\"\n\nKim's comments came soon after the family marked what would have been Robert's 73rd birthday.\n\nTaking to Twitter, Kim wrote: \"Happy Birthday dad! I love this family photo. I love our family. Thank you for EVERYTHING. I'm so grateful you are my dad! (sic)\"\n\nKhloe Kardashian blames Kris Jenner for her 'Khlo-C-D'\n\nKhloe Kardashian says she has her mother Kris Jenner to thank for her \"Khlo-C-D\".\n\nThe 'Keeping Up With The Kardashians' star has a penchant for keeping things organised and clean and says it is her mom Kris Jenner that has instilled that in her.\n\nShe said: \"I have Kris Jenner to thank. The interesting thing is my mom is a hoarder, but she demands cleanliness and structure from me (and all her kids). She was always very vocal about my room being impeccably clean.\"\n\nAnd the 33-year-old singer - who is expecting her first child with her partner Tristan Thompson - also picked up a lot of hosting etiquette from her mother too.\n\nShe added on her website: \"Besides the Khlo-C-D, my mom also taught me hosting etiquette, like how to set the dinner table, the appropriate silverware to use and how to position them. So, I really am grateful for everything that she taught me!\"\n\nMeanwhile, Khloe previously revealed her time with Tristan is very \"structured\", which is just like she likes.\n\nWriting on her app, she shared: \"During the NBA season in Cleveland, Tristan and I are very structured. You know I have KHLO-C-D, so I lovvvve that structure and order, LOL. It ends up working great for both of us, though, because Tristan has a very strict and chaotic work schedule.\n\n\"It can feel like life's all about work sometimes. We're both very understanding partners when it comes to work, so we make sure to schedule and take advantage of our quality time together at the house.\n\n\"We normally have very easy nights with dinner and a little relaxing time on the couch. That's pretty much it! Friends will come over, have a glass of wine and play some cards, but that's kind of as wild as we get during the season.\"\n\nKim Kardashian received jewellery from her 'next door neighbour' Madonna\n\nKim Kardashian revealed Madonna gifted her jewellery from her personal collection to her when she was a child.\n\nThe 37-year-old 'Keeping Up with the Kardashians' star revealed that she and older sister Kourtney, 38, used to go over to Madonna's house \"every day\" after school to walk the singer's dog, and although the sisters were \"shaking\" with nerves, Madonna gifted the girls items from her personal jewellery collection as a thank you.\n\nWhile promoting their best-selling beauty lines - KKW and MDNA - during an event at Los Angeles' YouTube Space on Tuesday, Kim shared: \"Yeah we were just reminiscing about this [living next door to each other] earlier.\n\n\"[Madonna], at a time period in her life, moved in with her manager who happened to be our next door neighbor growing up.\n\n\"So Kourtney and I would walk - our parents were good friends with her manager - so we'd walk their dog after school. So every day we would go over and we would see Madonna. Like, we were shaking!\"\n\n\"I remember so vividly her coming in one day in ripped jeans and a white T-shirt and these combat boots and she had dark short hair and this leather jacket and she just walked in and she was like, 'You know what, girls? I'm over these bracelets, and she took off her bracelets and gave us these black rubber bracelets.\"\n\n\"She gave us all of these neon bracelets and was like, 'Wait I'll be right back,' and gave us this whole shoe box of all of this neon jewellery and earrings.\"\n\nKim admitted her friends didn't believe the pop superstar gave her and Kourtney the bracelets, saying: \"All of our friends were like, 'Yeah right,' [when we said] Madonna gave them to us!\"\n\nBut the 'Material Girl' hitmaker regrets her decision to give the bracelets away as the items were one-of-a-kind.\n\nShe added: \"I was so stupid, by the way. They don't make those bracelets anymore!\"\n\nKim Kardashian West reveals tips to success\n\nKim Kardashian West has revealed putting her \"heart and soul\" into her career has helped her gain success.\n\nThe 37-year-old beauty - who has four-year-old North, two-year-old Saint, and two-month-old Chicago with her husband Kanye West - has revealed her top tips to finding success, and says that the most important things to remember are to be on time for commitments, and to be \"respectful\" of the people you work with.\n\nWriting on her app, she said: \"While there's no single recipe for success, I found that sticking to these principles helped me build my businesses and achieve my dreams.\n\n\"There are NO excuses for being late, not showing up or not getting your work done.\n\n\"Everyone has other things going on, so if you commit to something, you need to be on time and respectful. (sic)\"\n\nThe 'Keeping Up with the Kardashians' star revealed it's important for her to be \"passionate\" about what she does, and claims \"confidence\" is key when it comes to finding success.\n\nShe continued: \"If you find something you're really passionate about, figure out a way to make that your job. You'll work harder if your heart and soul is in your career.\n\n\"Whether it's posting on my own social channels or telling my perspective on our show, I like to be confident in my own voice.\"\n\nKim notes that she isn't perfect, but insists that when things don't go her way, she always tries to learn from it.\n\nShe wrote: \"If I do make a mistake, I learn from it and move on. Don't blame other people!\"\n\nMost importantly, Kim claims it's vital to take time off from working to find \"inspiration\" outside of her working life, and to make sure she doesn't \"burn out\".\n\nShe added: \"By taking time for yourself, you'll find inspiration in unexpected places and you won't exhaust yourself. If you're too burnt out on work, you'll half-a** things.\"\n\nKim Kardashian West accuses Saint Laurent of copying Kanye\n\nKim Kardashian West accuses designer Saint Laurent of copying Kanye's stage design\n\nThe 37-year-old star reposted a picture of the designer's stage set up from their Autumn/Winter 2018 collection in Paris, but she seemed to be implying that their creative direction was not an original idea.\n\nPosting the photos on her story, she sarcastically wrote the caption: \"Cute YSL\"\n\nShe then posted a photo of her husband, rapper and singer Kanye West, at one of his 'Yeezy Tour' shows, where the lighting and stage arrangement appear extremely similar.\n\nThis isn't the first time that Kim has called out copycats who appear to replicate her or her husband's styles. In 2014, she posted a photo of Kanye and oldest sister Kourtney's ex, Scott Disick, and fans accused her of calling out music's power couple Beyoncé and Jay Z.\n\nIn the photo, Kanye is wearing a black ski mask over his face and the reality star captioned the picture with the hash tags: \"#ThrowbackThursday, #Lastyear, #StyleIcons, and #LordDisick.\"\n\nFans were quick to suspect that the 'Keeping Up with the Kardashians' star was referring to Beyoncé and Jay Z wearing black ski masks in their 'On The Run' tour promotional images, and during their on screen performances of hits such as 'Crazy in Love', which came a year after the photo of Kanye was taken.\n\nMeanwhile, Kim, Kanye and her sisters are enjoying a trip in Toyko, Japan, where Kim has been sharing pictures of the upcoming season 7 collection of Kanye's fashion brand, Yeezy, on her social media.\n\nThe fashion icon took to Twitter to post the pictures of her outfits after Jet lag left her unable to get a good night's sleep.\n\nShe said: \"I'm gonna post some Tokyo fashion real quick since it's 5am and I can't sleep (sic)\"\n\nAnother tweet confirmed the star was sporting the brand's new collection, as she wrote that her outfits were \"all Yeezy season 7 (sic)\".\n\nKim Kardashian West launching new prank show\n\nKim Kardashian West is acting as an executive producer on new comedy prank show 'You Kiddin' Me' which air on Facebook.\n\nThe 37-year-old star will act as an executive producer in conjunction with Liosngate on comedy series 'You Kiddin' Me, which has been commissioned to air on Facebook.\n\nThe social media site has commissioned 10 episodes of the programme which is \"inspired by Kardashian family antics\" as seen in E! reality series 'Keeping Up with the Kardashians'.\n\nThe show will feature the kids of celebrities getting put in charge of their own parents who must do everything their children tell them The show will also invite Facebook users to play jokes on their favorite stars.\n\nAnnouncing the project, Kim said: \"I know from first-hand experience that children are wise beyond their years and can come up with the craziest things, so imagine how funny it will be to see them make all the decisions.\"\n\nKim and her husband Kanye West have three children, daughter North, four, son Saint, two, and baby daughter Chicago, together.\n\nThe series will be available via mobile, desktop and Facebook's TV apps and is part of Facebook's big push to offer more television-quality projects via its Watch video platform.\n\nKim will be joined as an executive producer by Brian Tannenbaum, Peter M. Cohen, Melissa Stokes and Jennifer O'Connell.\n\nKylie Jenner celebrates Stormi's one month birthday\n\nKylie Jenner has posted a sweet Instagram tribute to her baby daughter as she turned one month old.\n\nThe 20-year-old lip kit mogul took to the photo sharing app to post two pictures of herself holding her daughter Stormi - whom she has with rapper boyfriend Travis Scott - in honour of the tot turning one month old on Thursday.\n\nShe wrote: \"my angel baby is 1 month old today (sic)\"\n\nTravis, 28, also shared a photo on social media to mark his daughter's first milestone, as he posted a picture on Snapchat of Stormi wearing a pink sweater with the word \"Daddy\" written on it inside a red heart.\n\nHe wrote on the image: \"My lil mama 1 month today Her favorite unit of course (sic)\"\n\nThe 'Life of Kylie' star has been keeping fans up to date with Stormi's first few weeks in the world since she was born on February 1, and has posted a handful of photos and videos of her baby on social media.\n\nAnd recently, it was claimed the star is \"completely in love\" with Stormi and enjoying being a mother for the first time.\n\nA source said: \"It's been a big adjustment for Kylie, but she's loving be a mom and watching all of the little things that Stormi is doing each day. She's exhausted and emotional, but she's also completely in love.\"\n\nKylie recently admitted she couldn't stop staring at her baby and has noticed a resemblance to herself in her little one.\n\nWhen asked by a fan on Twitter how Stormi is doing, Kylie replied: \"she's good still staring at her all day. she looks just like me when i was a baby (sic)\"\n\nThe 'Keeping Up with the Kardashians' star kept her pregnancy under wraps until she gave birth, and announced the news of Stormi's arrival on Instagram in a lengthy note.\n\nIt read: \"I'm sorry for keeping you in the dark through all the assumptions. I understand you're used to me bringing you along on all my journeys. My pregnancy was one I chose not to do in front of the world. I knew for myself I needed to prepare for this role of a lifetime in the most positive, stress free and health way I knew how. There was no gotcha moment, no big paid reveal I had planned. I knew my baby would feel every stress and every emotion so I chose to do it this way for my little life and our happiness.\n\n\"Pregnancy has been the most beautiful, empowering and life changing experience I've had in my entire life and I'm actually going to miss it. I appreciate my friends and especially my family for helping me make this special moment as private as we could. My beautiful and healthy baby girl arrived February 1st and I just couldn't wait to share this blessing. I've never felt love and happiness like this I could burst. Thank you for understanding.\"\n\nKim Kardashian West wants to take away Kendall's anxiety\n\nReality TV star Kim Kardashian West has listed all of the personality traits she admires in her family members and the ones she wishes she could get rid of for them.\n\nThe 22-year-old model opened up about her battle with the condition during an episode of her family's reality TV show 'Keeping Up with the Kardashians' and admitted some days it's so bad she struggles to force herself to leave the house.\n\nIn an interview with Vogue India magazine Kim, 37, was asked which trait or issue she would take away from any of her sisters and mother Kris Jenner and the concerned beauty admitted she'd like to be able to help Kendall live her life free from anxiety.\n\nListing the personality traits she would do away with, Kim said: \"Kourtney's stubbornness. And Khloe's getting too sensitive. I would take away Kendall's anxiety, Kylie's, 'I don't care, I know what I'm doing' thing and probably my brother's moodiness.\"\n\nWhen asked what she'd take from her mother Kris, she added: \"Nothing. She's perfect.\"\n\nKim - who has three children, North, four, Saint, two, and baby daughter Chicago, with her husband Kanye West - also ran through the personality traits she'd most like to inherit from each member of her famous TV family.\n\nAnd it is her momager Kris, 62, who she admires the most.\n\nThe hour-glass beauty said: \"I'd take my brother's sense of humour. Kendall's sweetness. Khloe's I-don't-give-a-f**k attitude. Kourtney's savviness around finances. Kylie's ability to just go for it and not care what other people's opinions are. And my mom's nurturing.\"\n\nKim Kardashian West shares first picture of Chicago West\n\nKim Kardashian West has shared the first picture of baby Chicago, who was born last month via a surrogate.\n\nThe 'Keeping Up With The Kardashians' star took to her Instagram account on Monday to share a snap of her daughter, who was born last month.\n\nShe simply captioned it: \"Baby Chicago.\"\n\nMeanwhile, Kim - who also has North, four, and Saint, two - previously took to her app to thank the surrogate mother, who carried her and Kanye's third child.\n\nShe wrote: \"I'm so grateful for modern technology and that this is even possible. It's not for everyone, but I absolutely love my gestational carrierand this was the best experience I've ever had. Our gestational carrier gave us the greatest gift one could give. The connection with our baby came instantly and it's as if she was with us the whole time. Having a gestational carrier was so special for us and she made our dreams of expanding our family come true. We are so excited to finally welcome home our baby girl.\n\n\"I have always been really honest about my struggles with pregnancy. Preeclampsia and placenta accreta are high-risk conditions, so when I wanted to have a third baby, doctors said that it wasn't safe for my - or the baby's - health to carry on my own. After exploring many options, Kanye and I decided to use a gestational carrier. Although I have used the term surrogate in the past, a gestational carrier is actually the technical term for a woman who carries a baby that she has no biological relationship to.\n\n\"A traditional surrogate donates her egg, is artificially inseminated with the father's sperm and then carries the baby to term. Since we implanted my fertilized egg in our gestational carrier, our baby is biologically mine and Kanye's. You can either choose someone that you know or you can go through an agency, like Kanye and I did.\"\n\nSnapchat parent's stock plummets after Kylie Jenner tweet\n\nSnapchat's parent company lost some $1.3 billion in market value on Thursday after reality star Kylie Jenner's tweeted that she was no longer using the messaging service.\n\n\"sooo does anyone else not open Snapchat anymore? Or is it just me... ugh this is so sad,\" Jenner tweeted.\n\nShe later followed up with \"still love you tho snap ... my first love,\" but the damage may already have been done.\n\nSnap Inc.'s shares fell by over six percent in Thursday trading, a loss of about $1.3 billion in market capitalization.\n\nJenner has huge followings on various social media platforms, including Twitter and Instagram.\n\nShe gave birth to a daughter this month, and her Instagram post announcing the pregnancy quickly became one of the most liked posts of all time on the social media platform.\n\nKim stocked private jet with Japanese snacks for Kanye's 40th\n\nKim Kardashian West has revealed she stocked her private jet with Japanese sweets and magazines and made her husband Kanye West guess where they were going for his 40th birthday last year.\n\nThe 'Keeping Up With the Kardashians' star wanted to pull out all of the stops for her husband's big milestone last June, but she refused to give away the surprise she had planned for him until he jumped on board the jet and sussed out the clues - including sweet treats and reading material - she had strategically scattered around the aircraft.\n\nTaking to her Twitter account, the 37-year-old reality TV star uploaded a photograph of Kanye beaming at the camera with his stash of Japanese candy sat in front of him.\n\nShe accompanied it with the caption: \"Throwback to that time I surprised Kanye with a trip to Japan for his birthday! He had to guess where we were going based on the snacks and magazines I had the plane stocked with! He was happy! (sic)\"\n\nHer decision to dig out the photo and share it online has sparked speculation that she's thinking about ideas that will top last year's birthday as the day creeps closer.\n\nAnd it's not just Kim who comes up with the best gifts as the 'Only One' hitmaker spent over $200,000 on stocks for the brunette beauty's Christmas present last year - and Amazon and Adidas have boomed on the stock market, meaning the businesswoman has already made an impressive £23,000 in just two months, according to TMZ.com.\n\nMeanwhile, the couple have already had the best gift this year as their baby daughter Chicago - who was born via surrogate last month - was welcomed into the world.\n\nA source said recently: \"Kim gets up for everything, in the middle of the night, especially in the first week. It's really important they bond with the baby. Kim's a very hands-on mom. Baby is settling in beautifully. Chi is sleeping a ton for now.\n\nFollow Emirates 24|7 on Google News.", "images": ["http://media.emirates247.com/images/2018/02/emirates-648.JPG", "https://media.emirates247.com/images/2018/04/emirates1-254.jpg", "http://media.emirates247.com/images/2018/03/emirates1-12.JPG", "http://media.emirates247.com/images/2018/02/emirates-726.JPG", "https://media.emirates247.com/images/2018/05/emirates1-487.jpg", "https://media.emirates247.com/images/2018/04/emirates1-210.jpg", "https://media.emirates247.com/images/2018/04/emirates1-184.JPG", "http://media.emirates247.com/images/2018/02/emirates-764.jpg", "http://media.emirates247.com/images/2018/03/emirates-899.JPG", "https://media.emirates247.com/images/2018/05/emirates1-560.JPG", "http://media.emirates247.com/images/2018/03/emirates1-11.JPG", "http://media.emirates247.com/images/2018/03/emirates-942.JPG", "http://media.emirates247.com/images/2018/03/emirates-812.JPG", "https://media.emirates247.com/images/2018/05/emirates1-526.jpg", "http://media.emirates247.com/images/2018/03/emirates-780.JPG", "http://media.emirates247.com/images/2018/03/emirates-826.JPG", "http://media.emirates247.com/images/2018/02/emirates-705.JPG", "http://media.emirates247.com/images/2018/02/emirates-617.JPG", "https://media.emirates247.com/images/2018/05/emirates1-595.JPG", "https://media.emirates247.com/images/2018/05/emirates1-527.JPG", "https://media.emirates247.com/images/2018/04/emirates1-461.jpg", "https://media.emirates247.com/images/2018/04/emirates1-225.JPG", "https://media.emirates247.com/images/2018/05/emirates1-873.JPG", "http://media.emirates247.com/images/2018/03/emirates-941.jpg", "https://media.emirates247.com/images/2018/05/emirates1-594.JPG", "http://media.emirates247.com/images/2018/02/emirates-723.jpg", "http://media.emirates247.com/images/2018/03/emirates-782.JPG", "https://media.emirates247.com/images/2018/04/emirates1-97.JPG", "https://media.emirates247.com/images/2018/04/emirates1-333.jpg", "http://media.emirates247.com/images/2018/02/emirates-706.JPG", "https://media.emirates247.com/images/2018/04/emirates1-399.JPG", "https://media.emirates247.com/images/2018/04/emirates1-460.jpg", "https://www.emirates247.com/polopoly_fs/1.669669.1527242817!/image/image.jpg", "https://media.emirates247.com/images/2018/04/emirates1-345.JPG", "https://media.emirates247.com/images/2018/04/emirates1-183.jpg", "http://media.emirates247.com/images/2018/03/emirates-970.JPG", "https://media.emirates247.com/images/2018/05/emirates1-642.JPG", "https://media.emirates247.com/images/2018/04/emirates1-135.JPG", "https://media.emirates247.com/images/2018/04/emirates1-96.jpg", "http://media.emirates247.com/images/2018/03/emirates-825.jpg", "https://media.emirates247.com/images/2018/04/emirates1-164.jpg", "https://media.emirates247.com/images/2018/04/emirates1-285.JPG", "https://media.emirates247.com/images/2018/04/emirates1-134.jpg", "http://media.emirates247.com/images/happiness-icon.png", "https://media.emirates247.com/images/2018/04/emirates1-431.JPG", "https://media.emirates247.com/images/emirate_247_logo.jpg", "https://media.emirates247.com/images/2018/05/emirates1-643.JPG", "https://media.emirates247.com/images/2018/05/emirates1-562.JPG", "http://media.emirates247.com/images/2018/02/emirates-618.JPG", "https://media.emirates247.com/images/2018/05/emirates1-561.JPG", "https://media.emirates247.com/images/2018/04/emirates1-71.JPG", "http://media.emirates247.com/images/2018/03/emirates-975.jpg", "http://media.emirates247.com/images/2018/02/emirates-725.JPG", "http://media.emirates247.com/images/2018/03/emirates-810.jpg", "http://media.emirates247.com/images/2018/03/emirates1-10.jpg", "http://media.emirates247.com/images/2018/03/emirates-969.JPG", "https://media.emirates247.com/images/2018/05/emirates1-689.jpg", "http://media.emirates247.com/images/2018/03/emirates-943.JPG", "http://media.emirates247.com/images/2018/03/emirates-898.JPG", "http://media.emirates247.com/images/2018/03/emirates-971.JPG", "http://www.emirates247.com/res/img/press-sector-logo.png", "https://media.emirates247.com/images/2018/05/emirates1-899.jpg", "http://media.emirates247.com/images/2018/03/emirates-972.JPG", "https://media.emirates247.com/images/2018/04/emirates1-284.jpg", "https://media.emirates247.com/images/2018/04/emirates1-98.JPG", "https://media.emirates247.com/images/2018/05/emirates1-593.JPG", "https://media.emirates247.com/images/2018/04/emirates1-331.jpg", "http://media.emirates247.com/images/2018/02/emirates-616.jpg", "http://media.emirates247.com/images/2018/02/emirates-647.jpg", "http://www.emirates247.com/res/img/google-news-icon.png", "https://media.emirates247.com/images/2018/04/emirates1-133.jpg", "https://media.emirates247.com/images/2018/05/emirates1-525.jpg", "http://media.emirates247.com/images/2018/02/emirates-763.jpg", "https://media.emirates247.com/images/2018/05/emirates1-485.jpg", "http://media.emirates247.com/images/2018/02/emirates-707.JPG", "https://media.emirates247.com/images/2018/05/emirates1-644.JPG", "http://media.emirates247.com/images/2018/02/emirates-652.JPG", "http://www.emirates247.com/res/img/app_store.png", "https://media.emirates247.com/images/2018/04/emirates1-344.JPG", "https://media.emirates247.com/images/2018/04/emirates1-398.JPG", "https://collector.effectivemeasure.net/noscript", "http://media.emirates247.com/images/2018/03/emirates-968.JPG", "https://media.emirates247.com/images/2018/04/emirates1-255.jpg", "https://media.emirates247.com/images/dubaipost_logo.jpg", "https://media.emirates247.com/images/shoof-logo.png", "http://media.emirates247.com/images/2018/03/emirates-967.JPG", "https://media.emirates247.com/images/2018/04/emirates1-462.jpg", "https://media.emirates247.com/images/2018/04/emirates1-165.jpg", "http://media.emirates247.com/images/2018/03/emirates-897.JPG", "https://media.emirates247.com/images/2018/04/emirates1-429.jpg", "https://media.emirates247.com/images/2018/04/emirates1-136.JPG", "https://media.emirates247.com/images/2018/04/emirates1-70.JPG", "http://media.emirates247.com/images/2018/02/emirates-653.JPG", "http://media.emirates247.com/images/2018/03/emirates-811.JPG", "https://media.emirates247.com/images/2018/04/emirates1-286.JPG", "http://media.emirates247.com/images/2018/03/emirates-827.JPG", "https://media.emirates247.com/images/2018/05/emirates1-486.jpg", "https://media.emirates247.com/images/albayan_logo.jpg", "http://www.emirates247.com/res/img/play_store.png", "https://media.emirates247.com/images/2018/04/emirates1-182.jpg", "https://media.emirates247.com/images/2018/04/emirates1-400.jpg", "https://media.emirates247.com/images/2018/04/emirates1-430.JPG", "http://media.emirates247.com/images/2018/02/emirates-472.JPG", "http://media.emirates247.com/images/2018/03/emirates-781.JPG", "https://media.emirates247.com/images/2018/04/emirates1-211.jpg", "https://media.emirates247.com/images/2018/04/emirates1-343.JPG", "http://media.emirates247.com/images/2018/02/emirates-651.jpg", "https://www.emirates247.com/polopoly_fs/7.106.1453021014!/image/image.png_gen/derivatives/default/image.png", "https://media.emirates247.com/images/2018/05/emirates1-898.jpg", "https://media.emirates247.com/images/2018/04/emirates1-332.JPG", "https://media.emirates247.com/images/eay_logo.jpg", "http://media.emirates247.com/images/2018/03/emirates-973.JPG"], "top_img": "https://www.emirates247.com/polopoly_fs/1.669669.1527242817!/image/image.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.emirates247.com/entertainment/kuwtk-kim-kardashian-west-goes-blonde-for-kanye-west-on-anniversary-2018-05-25-1.665367", "title": "KUWTK: Kim Kardashian West 'goes blonde' for Kanye West on anniversary", "meta_data": {"viewport": "width=device-width, initial-scale=1", "msapplication-tap-highlight": "no", "last-modified": "2018-10-03 08:25:32 GST", "robots": "ACAP allow-index", "author": "Bang", "description": "Kim Kardashian West has \"gone blonde\" again to mark her fourth wedding anniversary as her husband Kanye West prefers her with blonde hair.The 'Keeping Up With The Kardashians' star shared a video of her sporting blonde locks as she knows it is her husband", "google-site-verification": "gvGASCnV8iZTJPFdQv6c1D7_EB5BTyiF0sCBN-Cy20g", "y_key": "2e2a4541c87dc829", "msvalidate.01": "97B560A2BDDF76982EF1BBF2E5F4DE45", "alexaVerifyID": "cpWRiGeguXPAy-a1KZErjqqRH-w", "fb": {"app_id": 132782903460978, "pages": 136509933034734}, "og": {"site_name": "Emirates24|7", "locale": "en_GB", "title": "KUWTK: Kim Kardashian West 'goes blonde' for Kanye West on anniversary", "type": "article", "url": "https://www.emirates247.com/entertainment/kuwtk-kim-kardashian-west-goes-blonde-for-kanye-west-on-anniversary-2018-05-25-1.665367", "image": "https://www.emirates247.com/polopoly_fs/1.669669.1527242817!/image/image.jpg", "description": "Kim Kardashian West has \"gone blonde\" again to mark her fourth wedding anniversary as her husband Kanye West prefers her with blonde hair.The 'Keeping Up With The Kardashians' star shared a video of her sporting blonde locks as she knows it is her husband"}, "article": {"published_time": "2018-05-25 14:04+0400", "modified_time": "2018-10-03 08:25+0400"}, "twitter": {"card": "summary_large_image", "url": "https://www.emirates247.com/entertainment/kuwtk-kim-kardashian-west-goes-blonde-for-kanye-west-on-anniversary-2018-05-25-1.665367", "title": "KUWTK: Kim Kardashian West 'goes blonde' for Kanye West on anniversary", "description": "Kim Kardashian West has \"gone blonde\" again to mark her fourth wedding anniversary as her husband Kanye West prefers her with blonde hair.The 'Keeping Up With The Kardashians' star shared a video of her sporting blonde locks as she knows it is her husband", "image": {"src": "https://www.emirates247.com/polopoly_fs/1.669669.1527242817!/image/image.jpg"}, "app": {"name": {"iphone": "Emirates24|7", "ipad": "Emirates24|7", "googleplay": "Emirates24|7"}, "id": {"iphone": 786224961, "ipad": 786224961, "googleplay": "com.emirates247"}}}}, "movies": [], "publish_date": 1527177600.0, "source": "http://www.emirates247.com", "summary": ""}