{"url": "https://www.usatoday.com/story/life/entertainthis/2017/07/19/jake-zyrus-talks-changing-his-name-charice-his-transgender-journey/478590001/", "text": "Jake Zyrus, the Filipino singer and Glee star formerly known as Charice Pempengco, says life since coming out as transgender has been \"surreal.\"\n\nWhat started out as simply changing his screen name so he wouldn’t “be stuck in [the] past\" has turned into a flurry of articles about the star's identity, a buzz that Zyrus didn't intend to create.\n\n\"I just thought that I was going to change my social networking sites’ user names, and I just didn’t think that everyone would pick it up,\" the singer explained. \"But when... everyone was talking about it, I was like, ‘I guess this is the perfect time.’ It was Pride Month and I just saw that everything was happening in the right place, right time and I started talking about it.”\n\nFollowing his coming out via Twitter and Instagram in June, the singer, 25, spoke with USA TODAY about his transgender journey, music career and life since his recent name change.\n\nNot only surprised by the buzz his name change created, Zyrus, who lives in the Philippines, was also surprised with how accepting his fans have been of the news.\n\n\"When I thought about finally coming out as a transgender man, I didn’t think a lot of people would actually agree to it and accept me, but I was surprised with the love and support,\" he said. \"So I’ve been doing great, I’ve been feeling good about everything. I’ve been happy.\"\n\nHis family members, who found out at the same time fans did, were not as positive in their reactions. Describing them as not \"open with LGBT people\" from a country \"still having a hard time trying to ask for equality and freedom,\" Zyrus said his relationship with family has been \"kind of on-and-off.\"\n\n\"Their reaction was expected. Right now we’re not ok, but... I know that someday they will find some peace in their heart and [know that] whatever I’m doing right now is for my happiness and is who I really am.”\n\nThe news also garnered some pushback in the Filipino media community. Esquire Philippines published a since-removed story on June 20 titled \"Jake Zyrus and The Challenges of Personal Reinvention,\" which people criticized for insulting transgender people. The publication issued a lengthy apology.\n\nZyrus, who accepted the apology on Twitter, said that he didn't take the article too seriously, but was \"touched\" by others who stood up for him.\n\nFear of that type of blowback was, in part, what kept Zyrusfrom fully embracing his identity sooner, though he discussed it with Oprah Winfrey in 2014. In a special Where Are They Now episode, Zyrus told the host he was gay, though now says it was out of fear of coming out as trans.\n\n\"In the Philippines it was so hard because, at that time, nobody ever talked about transgender people,\" he explained. \"So I was scared to actually go out there and be one of those first people -- I was scared basically to tell them, ‘Hey, I know that I’m a man. I know that I’m transgender.'\"\n\nWhen Winfrey asked if he struggled with gender identity, however, he responded \"my soul is male.\"\n\nA feeling, Zyrus said, he's felt since he was a kid.\n\n\"I didn’t know the gender labels yet. I didn’t know the words lesbian or transgender, but I knew that Charice wasn’t the right name for me,\" he explained.\n\nSo how did the singer come up with his new name? Zyrus said he \"just felt it.\"\n\n\"I came up with so many names. There was Christian, there was Kyle. But when I kept saying, ‘Jake, Jake’ in front of the mirror, I just thought that it was the name for me,\" he explained.\n\nHe decided on \"Zyrus\" because he thought it sounded like a performer.\n\n\"If I perform onstage all over the world, it made me feel good thinking about the fans shouting my name,\" he said. \"And I just imagined everything and it made me happy.\"\n\nAlthough the singer's name is new, Zyrus isn't new to the spotlight.\n\nAfter landing a spot on the Filipino American Idol-style show Little Big Star in 2005, the singer gained popularity posting performances on YouTube. An appearance on The Ellen Show in 2007 raised his profile in the U.S.\n\nThe singer's then-self-titled album Charice went to No. 8 on Billboard's album chart in 2010, making Zyrus the first Asian solo singer to land in the Top 10 of the Billboard 200 albums chart. Later that year he landed a recurring role on Glee, playing Sunshine Corazon, a foreign exchange student and vocal rival to one of the show's leads, Rachel Berry (Lea Michele).\n\nThese days, the singer is just \"going with the flow.\"\n\n\"Whatever happens, happens. I’m really just trying to live my life as much as possible,\" he says.\n\nZyrus's new single Hiling (which means \"wish\" in English) dropped July 5, his first track under his new name, which he describes as a cheesy love song. His last album Catharsis released in October 2016.\n\nHe's also looking forward to performing outside of the Philippines soon, with discussions of larger concerts and an album happening in the near future.\n\n\"I’m just letting everything happen to me,\" he says. \"I’m just really happy that I’m going to be able to share my music again.\"", "images": ["https://www.gannett-cdn.com/-mm-/84a7c834b729abbee5a3a46732ce91542f0460c4/c=0-147-850-1280/local/-/media/2017/07/14/USATODAY/USATODAY/636356214037108584-IMG-7495.jpg?width=300&height=400&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/df69c86641be357cfe300aca6902474b6c1f7dc6/c=0-162-850-642/local/-/media/2017/07/14/USATODAY/USATODAY/636356214037108584-IMG-7495.jpg?width=850&height=480&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/df69c86641be357cfe300aca6902474b6c1f7dc6/c=0-162-850-642/local/-/media/2017/07/14/USATODAY/USATODAY/636356214037108584-IMG-7495.jpg?width=850&height=480&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/07/19/jake-zyrus-talks-changing-his-name-charice-his-transgender-journey/478590001/", "title": "Jake Zyrus reveals details of his transgender journey, changing his name from Charice", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Jake Zyrus reveals details of his transgender journey, changing his name from Charice", "description": "What to know about the former 'Glee' star, who recently came out as transgender.", "url": "https://www.usatoday.com/story/life/entertainthis/2017/07/19/jake-zyrus-talks-changing-his-name-charice-his-transgender-journey/478590001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/df69c86641be357cfe300aca6902474b6c1f7dc6/c=0-162-850-642/local/-/media/2017/07/14/USATODAY/USATODAY/636356214037108584-IMG-7495.jpg?width=850&height=480&fit=crop&format=pjpg&auto=webp", "width": 850, "height": 480}, "type": "article"}, "article": {"author": "Sara M Moniuszko", "content_tier": "free", "opinion": "false"}, "description": "What to know about the former 'Glee' star, who recently came out as transgender.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/df69c86641be357cfe300aca6902474b6c1f7dc6/c=0-162-850-642/local/-/media/2017/07/14/USATODAY/USATODAY/636356214037108584-IMG-7495.jpg?width=850&height=425&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Jake Zyrus reveals details of his transgender journey, changing his name from Charice", "description": "What to know about the former 'Glee' star, who recently came out as transgender."}}, "movies": [], "publish_date": 1500393600.0, "source": "https://www.usatoday.com", "summary": ""}