{"url": "www.elitedaily.com/p/kendall-jenners-instagram-comment-about-scott-disick-sofia-richie-is-so-shady-8038538", "text": "There is never a shortage of drama in the Kardashian-Jenner family. Given that there are so many immediate and extended family members, there is always something going on that piques public interest. One of the latest intriguing happenings involves Scott Disick and his girlfriend, Sofia Richie. While the family isn't known for publicly commenting on such high-profile situations, Kendall Jenner's Instagram comment about Scott Disick and Sofia Richie seemingly displayed her true (and not-so-positive) feelings about the couple.\n\nJenner reportedly commented on a photo of Disick with Richie and his three kids (whom he shares with his ex-girlfriend, and Jenner's sister, Kourtney Kardashian) that surfaced on an Instagram fan account called @scottthelord. From screenshots grabbed of the apparently now-deleted comment, it appears that Jenner (on her verified account) wrote, \"Awww, Scott and his kids,\" and then she closed the comment with a laughing emoji, according to Teen Vogue. Elite Daily reached out to Kendall Jenner's representation for comment but has not heard back at the time of publication.\n\nEagle-eyed fans immediately noticed the presumable shady comment before it was deleted. Why would a seemingly innocent comment like that be considered shady? Well, Jenner could either really be swooning over Disick spending time with his three kids: Mason, Penelope, and Reign, or she could be lumping Richie in as one of the \"kids\" as a dig at the couple's 15-year age difference — Disick is 34 years old and Richie is 19.\n\nIt seems like fans ran away with the latter theory since this appears to the be the first time that Jenner has publicly commented on the relationship between Disick and Richie, which was rumored to have begun back in September 2017. Once fans decided that the reported comment was meant to be shady, there was a multitude of responses.\n\nSome fans were loving Jenner's tongue-in-cheek comment, and they responded positively with messages like, \"Love that @kendalljenner is just subtly throwing shade at Scott and Sofia haha,\" and \"Yasssss savage.\" While there were definitely many fans that were very much here for Jenner's comment, there were just as many people who were ready serve some shade right back at her.\n\nA common thread in those responses including reminding Jenner that her sister, Kylie Jenner, was 17 years old when she reportedly began dating then-boyfriend Tyga in 2014, according to Cosmopolitan. With that in their arsenal, people replied with comments like, \"Didn't your sister Kylie date Tyga when she was 17? What about your sister Kourtney and your mom? LOL just stop.\" Beyond Kylie's previous relationship, people also pointed out that a couple other members of Kendall's family have younger significant others as well.\n\nKourtney Kardashian (who will turn 39 years old in April) has been spotted globetrotting with her 24-year-old boyfriend, Younes Bendjima, since they began dating back in December 2016. And even the matriarch of the Kardashian-Jenner crew, Kris Jenner, is dating someone 25 years her junior. In the end, though, everyone involved — from Richie and Disick to Kourtney and Kris and their respective boyfriends — is over the age of 18, which means they are all legally adults and can make their own decisions about who they want to date.\n\nOf course, the drama rears its head because the relationship between exes, Kardashian and Disick, does not always appear amicable. While it seems like they do their best to co-parent and get along for the sake of their children, there is no doubt that it appears difficult for both parties to always keep on a happy face in this situation.\n\nAnd when it comes to being a ride-or-die sister, Kendall is definitely there for Kourt with her latest comment. If you are familiar with Keeping Up With The Kardashians, though, you know the family has a somewhat biting sense of humor, so let's just hope that Disick and Richie are in on this (possible) joke.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/28/23740c37-2e40-4631-99ca-64f77f715a69-getty-852391410.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/2/f2d41d12-2957-4f14-83a9-45d955e82f13-getty-930538154.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/28/23740c37-2e40-4631-99ca-64f77f715a69-getty-852391410.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/aa66853a-3525-41ad-988f-51568ae27100-getty-1143782524.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/28/23740c37-2e40-4631-99ca-64f77f715a69-getty-852391410.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kendall-jenners-instagram-comment-about-scott-disick-sofia-richie-is-so-shady-8038538", "title": "Kendall Jenner’s Instagram Comment About Scott Disick & Sofia Richie Is So Shady", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kendall-jenners-instagram-comment-about-scott-disick-sofia-richie-is-so-shady-8038538", "type": "article", "title": "Kendall Jenner Dissed Scott Disick & Sofia Richie On Instagram & It's So Shady", "description": "There is never a shortage of drama in the Kardashian-Jenner family. Given that there are so many immediate and extended family members, there is always something going on that piques public interest. One of the latest intriguing happenings involves…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/28/23740c37-2e40-4631-99ca-64f77f715a69-getty-852391410.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "There is never a shortage of drama in the Kardashian-Jenner family. Given that there are so many immediate and extended family members, there is always something going on that piques public interest. One of the latest intriguing happenings involves…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}