{"url": "www.inquisitr.com/4552749/brad-pitt-and-angelina-jolies-sons-pax-and-maddox-not-feuding-as-their-parents-split-drags-on/", "text": "Watching your parents go through a divorce is never easy, but when your parents are uber-famous actors Brad Pitt and Angelina Jolie and every detail is under media scrutiny, it can take the situation to a whole new level. It has been over a year since Jolie and Pitt announced their split after a 12-year relationship that included two years of marriage, but the divorce proceedings continue to drag on without resolution. Is it possible that the breakup is causing some severe sibling rivalry between oldest sons Maddox and Pax Jolie-Pitt?\n\nIn the latest issue of National Enquirer, the tabloid is claiming that 16-year-old Maddox and 13-year-old Pax are locked in a feud, causing non-stop fighting between the two brothers. The source in the story says that Maddox is bossy and Pax has had enough; and with the younger brother being taller and stronger, Maddox could “have that smug smile knocked off his face.” However, Gossip Cop has looked into the story and has discovered that it is inaccurate.\n\nTeenage boys do have disagreements, but that doesn’t mean there is any battle between the brothers. According to Gossip Cop’s source, Maddox and Pax are close, and they get along just fine. The divorce has been difficult for the family, but they are all getting through it as best they can.\n\nLoung Ung, Vivienne, Maddox, Pax, Angelina Jolie, Kimhak Mun, Knox, Shiloh, Zahara and Sareum Srey Moch attend the Toronto International Film Festival. [Image by Alberto E. Rodriguez/Getty Images]\n\nThe boys are growing up fast, and they both worked with their mom on her latest project First They Killed My Father. Maddox received an Executive Producer credit and Pax worked as a photographer.\n\nOn top of working with Jolie, they are also attending red carpet premieres and after-parties. She Knows revealed that the boys wore designer clothes while posing for pictures outside an exclusive New York party with their mom.\n\nBut, the kids don’t just join Jolie at glamorous events. Yahoo! is reporting that Maddox and his sisters Zahara, 12, and Vivienne, 9, were spotted shopping for Halloween costumes this past week with the Tomb Raider actress, while she attempted to keep a low profile by wearing sunglasses with a long dress and cardigan.\n\nBrad Pitt poses with Pax, Maddox, and Shiloh Jolie-Pitt. [Image by Frazer Harrison/Getty Images]\n\nThe outing took place just after Jolie revealed she had a “bad experience” with Harvey Weinstein back in the 90’s after the release of Playing by Heart. In an email to The New York Times, Jolie wrote that behavior like that against women is unacceptable.\n\nTell us! Do you think the longer Brad Pitt and Angelina Jolie drag on their divorce the more it will affect their children? Let us know in the comments below.\n\n[Featured Image by Emma McIntyre/Getty Images]", "images": ["https://secure.gravatar.com/avatar/5ed34468ceaaad942f0b4277ee61d2b2?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/10/Brad-Pitt-And-Angelina-Jolies-Sons-Pax-And-Maddox-Feuding-As-Their-Parents-Split-Drags-On.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Loung-Ung-Vivienne-Maddox-Pax-Angelina-Jolie-Kimhak-Mun-Knox-Shiloh-Zahara-and-Sareum-Srey-Moch-attend-the-First-They-Killed-My-Father-premiere.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/07/Brad-Pitt-Shiloh-Pax-Maddox.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Perry Carpenter"], "canonical_link": "https://www.inquisitr.com/4552749/brad-pitt-and-angelina-jolies-sons-pax-and-maddox-not-feuding-as-their-parents-split-drags-on/", "title": "Brad Pitt And Angelina Jolie’s Sons Pax And Maddox Not Feuding As Their Parent’s Split Drags On?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}