{"url": "https://simple.wikipedia.org/wiki/Hippopotamus", "text": "The hippopotamus (Hippopotamus amphibius), or hippo, ancient Greek for \"river horse\" (Ιπποπόταμος), is a large mammal in Africa that usually eats plants. It is one of only two species in the family Hippopotamidae that are still alive. The other is the pygmy hippopotamus.\n\nThe hippopotamus is the second largest land animal in size, and the third largest land animal in weight. The elephant is the heaviest, and the white rhinoceros is the second heaviest, but a bit smaller than the hippo. The hippo is also the heaviest artiodactyl.\n\nThe hippopotamus is semi-aquatic. This means that even though it usually lives on the land, it spends a great amount of time in rivers and lakes where males lead groups of 5 to 30 females and young. In the daytime, they keep cool by staying in the water or mud. They give birth to baby hippos in the water, too. At dusk, they come out to graze on grass. Hippopotamuses rest together in the water, but they like to graze by themselves.\n\nThe hippopotamus has a torso that is shaped like a barrel, a very big mouth and teeth, an almost hairless body, short legs and great size. It is the third largest land mammal, judging by its weight, which is between between 1½ and 3 tonnes. The white rhinoceros weighs 1½ to 3½ tonnes, and the three species of elephant weigh 3 to 9 tonnes. Even though it has short, fat legs, it can run more quickly than a human. Some hippos have run at 30 km/h (19 mph) for short distances. The hippopotamus is one of the fiercest animals in the world. It is often called one of the most dangerous animals in Africa. There are about 125,000 to 150,000 hippos in Sub-Saharan Africa. Zambia (about 40,000) and Tanzania (20,000–30,000) have the most hippos. They are threatened because they are losing their habitats and being poached for their meat and ivory teeth.\n\nThe word \"hippopotamus\" comes from the ancient Greek ἱπποπόταμος, hippopotamos, from ἵππος, hippos, \"horse\", and ποταμός, potamos, which means \"river\". So, \"hippopotamus\" means \"horse of the river\".[3] More than one hippopotamus are called hippopotami, and 'hippopotamuses', or 'hippos' is also used.[4] Hippopotamusi are social. About 30 hippos live together in groups. A male hippopotamus is known as a bull. A female hippopotamus is called a cow, and a baby hippo is called a calf. The species is also known as the common hippopotamus or the Nile hippopotamus.\n\nA hippo at the zoo in Lisbon\n\nA drawing of a hippopotamus skeleton\n\nInside the mouth of a hippopotamus\n\nHippopotami are the fourth largest mammals in the world (after whales, elephants, and rhinoceroses). The Egyptian hippopotamus is smaller than the others. They can live in the water or on land. They can walk or even run along the bottom of a river.\n\nBecause hippos are so large, it is difficult to weigh them in the wild. Most adult male hippos weigh between 1,500–1,800 kg (3,300–4,000 lb). Females hippos are smaller, and usually weigh between 1,300–1,500 kg (2,900–3,300 lb). Older males can get even bigger. They are at least 3,200 kg (7,100 lb) and sometimes even weigh 4,500 kg (9,900 lb).[5][6]\n\nMale hippos seem to keep on growing for their whole lives. Females hippos, though, become heaviest when they are about 25 years old.[7]\n\nHippos have big and heavy bodies, dark gray skin, and short legs. A hippo's main defence is their extremely strong mouth. They can grow to be 15 feet long and weigh 3,000 pounds.[8]\n\nHippopotami are herbivores which live in groups. Despite being semiaquatic and having webbed feet, an adult hippo is not a particularly good swimmer nor can it float. It is rarely found in deep water; when it is, the animal moves by porpoise-like leaps from the bottom.[9] They usually stay in the mud and water during the day and come out to eat grass or leaves at night. Though they are bulky animals, hippopotami can gallop at 30 km/h (19 mph) on land but normally trot.[9]\n\nMany hippos lived in North Africa and Europe[10] until about 30,000 years ago. They used to be common in Egypt's Nile region from long ago, though they are not there now. Pliny the Elder writes that, in his time, the best place in Egypt for finding this animal was in the Saite nome.[11] The animal could still be found around there after the Arab Conquest in 639. Hippos are still found in the rivers and lakes of Uganda, Sudan, Somalia, Kenya, northern Democratic Republic of the Congo and Ethiopia, west through Ghana to Gambia, and also in Southern Africa (Botswana, Republic of South Africa, Zimbabwe, Zambia). Some hippos also live in Tanzania and Mozambique. They like to live in places with water that is not too deep.\n\nHippos and humans [ change | change source ]\n\nLounging at the London Zoo in 1852\n\nHippos are very aggressive towards humans, whom they commonly attack whether in boats or on land with no apparent provocation. This aggression by the hippopotamus is caused by humans coming too close to their children. Hippopotami are very protective of their young and they often fear that humans pose a large threat to their young.[12] They are widely considered to be one of the most dangerous large animals in Africa.[13][14]\n\nThe earliest proof that humans were involved with hippos comes from butchery cut marks on hippo bones at Bouri Formation from around 160,000 years ago.[15] Later rock paintings and engravings showing hippos being hunted. They have been found in the mountains of the central Sahara from 4,000–5,000 years ago near Djanet. Ancient Egyptians also knew much about hippos. They knew the hippo was a fierce, wild animal that lived in the Nile. In Egyptian mythology, Tawaret, a goddess of protection in pregnancy and childbirth, had the head of a hippo. This was because ancient Egyptians saw how protective female hippopotami could be about their young.[16]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg/1200px-Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg", "https://simple.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg/220px-Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Mouth_of_a_hippo.jpg/220px-Mouth_of_a_hippo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Wikiquote-logo-en.svg/40px-Wikiquote-logo-en.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Wikispecies-logo.svg/34px-Wikispecies-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Status_iucn3.1_VU.svg/220px-Status_iucn3.1_VU.svg.png", "https://simple.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Hippo_distribution.gif/220px-Hippo_distribution.gif", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/HippoSkelLyd2.png/250px-HippoSkelLyd2.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Hippo_zoo_Lisbon.JPG/220px-Hippo_zoo_Lisbon.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Hippopotamus_Egypt_fayence_Berlin.jpg/220px-Hippopotamus_Egypt_fayence_Berlin.jpg", "https://simple.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Obaysch_1852.gif/220px-Obaysch_1852.gif", "https://upload.wikimedia.org/wikipedia/commons/7/74/Red_Pencil_Icon.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg/1200px-Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg", "keywords": [], "authors": [], "canonical_link": "https://simple.wikipedia.org/wiki/Hippopotamus", "title": "Simple English Wikipedia, the free encyclopedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg/1200px-Hippopotamus_amphibius_in_Tanzania_4041_Nevit.jpg"}}, "movies": [], "publish_date": null, "source": "https://simple.wikipedia.org", "summary": ""}