{"url": "https://en.wikipedia.org/wiki/Glenn_Quinn", "text": "Glenn Martin Christopher Francis Quinn (May 28, 1970 – December 3, 2002) was an Irish actor. While he was best known for his portrayal of Mark Healy on the popular '90s family sitcom Roseanne. Quinn also amassed a large fan base for his portrayal of Doyle, a half-demon, on Angel, a spin-off series of Buffy the Vampire Slayer.[1][2]\n\nEarly life [ edit ]\n\nQuinn was born in Dublin, Ireland on May 28, 1970, the son of Murty Quinn, a musician and singer with the Miami Showband who enjoyed seven #1 hits in the '60s and '70s, and his wife, Bernadette Quinn (nee Brady).[3] He was raised in Cabinteely, a suburb of Dublin, and attended Clonkeen College.[1][4] He emigrated from Ireland to the United States with his mother and two sisters, Sonja and Louisa, in 1988, when he was still just a teenager, with the family settling in Los Angeles, California.[4] Quinn had a third sibling, a brother Ciaran, whom he never knew existed as the boy had been placed for adoption.[5]\n\nCareer [ edit ]\n\nQuinn did commercials for Pepsi and Ray-Ban, appeared in the music video for the Richard Marx song \"Satisfied,\" and had his first speaking line in the pilot of Beverly Hills, 90210 after having endured eight separate auditions for the role of \"Brandon Walsh\" and then \"Steve Sanders\"[6] (played by Jason Priestley and Ian Ziering, respectively). Casting director Johanna Ray gave him a small role with two lines in the pilot, but Quinn was barely visible in the final broadcast version.\n\nIn 1991, Quinn had his first major role in the movie Shout, which starred John Travolta and in which Quinn shared an on-screen kiss with Gwyneth Paltrow in her debut film.[7]\n\nOne of Quinn's more visible roles began in 1990 as the character Mark Healy, Becky Conner's boyfriend and later husband, in Roseanne. He continued in this role until the show ended in 1997 (seasons 3–9). In 2018, the fourth episode of the revived show's tenth season was dedicated to the memory of Quinn.\n\nQuinn took on the role as youngest son Cedric on the 1992 U.S. and UK TV series Covington Cross.\n\nIn 1992, he starred alongside Holly Marie Combs in Dr. Giggles.[2] In 1997, he played dual roles in the horror anthology film Campfire Tales.\n\nAfter seven years using an American accent on Roseanne, Quinn was pleased producers made Doyle on Angel Irish because it would allow him to use his native accent. In an interview with The Irish Times, Quinn said of his accent, \"I've been hiding it for so long that it's amazing to have some freedom. It was like putting on an old pair of shoes. It's bringing my soul back to life.\"[1] His last film work was in R.S.V.P. (2002).\n\nDeath [ edit ]\n\nOn December 3, 2002, Quinn's body was found at a friend's home in North Hollywood, California.[8] An autopsy found that Quinn had died as the result of a heroin overdose.[9] In the months leading up to his death, Quinn had reportedly been struggling with homelessness and drug addiction. His issues with substance abuse started in 1987. Unable to maintain sobriety, he was eventually bought out as owner of Goldfingers nightclub in Los Angeles, California. [10][1][11][12] Quinn neither married nor had any children.\n\nFilmography [ edit ]\n\nList of film roles Year Title Role Notes 1991 Shout Alan 1992 Dr. Giggles Max Anderson 1995 Live Nude Girls Randy Conzini 1997 Campfire Tales Scott Anderson/Paramedic #1 Segments: \"The Locket\" and \"The Campfire\" 1998 Some Girl Jeff 2002 R.S.V.P. Prof. Hal Evans\n\nList of video game roles Year Title Role Notes 1996 Star Wars: X-Wing vs. TIE Fighter Voice only 1997 Outlaws 'Rattlesnake' Dick Farmer Voice only Pirate #5 Voice only", "images": ["https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/45/Glenn_Quinn.jpg/220px-Glenn_Quinn.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Glenn_Quinn", "title": "Glenn Quinn", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}