{"url": "https://www.oscars.org/news/where-watch-oscars-tv-around-world", "text": "In the United States the Oscars is aired on ABC. But where can you watch it around the world? Here is your guide:\n\nAfrica: M-Net Albania: Digitalb Andorra: Canal + Spain Armenia: Public TV Company of Armenia Asia: HBO Asia Australia: Nine Network Austria: ORF 1 or Pro 7 Sat 1 Azerbaijan: AZTV Belarus: ONT- Second Nat’l TV Channel Belgium (Flemish): Chello Media/Prime or Canal + France Benelux: BE TV SA Bolivia: Red Unitel / Canal 9 Brazil: TV Globo Bulgaria: BTV Cinema Canada: CTV Television Network Chile: LaRed China: CCTV-6 Colombia: Vista /RCN Costa Rica: Canal 7 Croatia: HRT Croation Television Cyprus: Intervision Services Denmark: TV2 Film or Danmarks Radio TV DR 1,2, & 3 Dominican Republic: Teleantilles Ecuador: Telecuartro Guayaquil El Salvador: Canal Dos Estonia: Kanal 2 Fiji: Fiji Broadcasting Corp Finland: YLE France: Canal+ France Georgia: Rustavi 2 Broadcasting Germany: Pro 7/ Sat 1 Greece: Intervision Services Guatemala: Channels 3, 7, 11 & 13 Holland: Liberty Global Content or Chello Media Honduras: Compania Televisora Hondurena Hong Kong: Pearl Channel/TVB Iceland: RUV India: Star India Indonesia: KompasTV Ireland: RTE, RTE 2, and BSkyB Israel: DBS Satellite/YES Movies & Hot Vision Italy: Sky Italia / Sky Cinema Japan: Wowow & NHK Kazakhstan: JSC Khabar Agency Korea: CJE&M/Orion Cinema Liechtenstein: Pro 7 Sat 1 Luxembourg (French & Dutch): Canal + France Luxembourg (German): Pro 7 Sat 1 Macedonia: Sitel TV Malta (Italian): Sky Italia/Sky Cinema Mexico: Red Azteca/ Ch. 7 Middle East: Gulf DTH Entertainment/OSN Monaco (French): Canal + France Monaco (Italian): Sky Italia/Sky Cinema Mongolia: Mongol TV Montenegro: Radio Television Montenegro New Zealand: Sky Network/Sky Movies Nicaragua: Canal 2 Norway: Modern Times Group/Viasat or TV3 & TV6 Papua New Guinea: Nine Network Panama: Medcom Paraguay: Canal 9 Peru: Canal 2 Poland: Canal + Poland Portugal: SIC Romania: Digi Film Russia (CIS/USSR): JSC Chanel One Serbia: Radio Television Serbia Singapore: Media Corp/Ch. 5 Slovakia: Slovenska TV/Doma Slovenia: Planet TV Slovenia (Italian): Sky Italia/Sky Cinema Spain: Canal + Spain Surinam: Apintie Televisie Sweden: SVT Switzerland (Italian): Sky Italia/Sky Cinema Switzerland (German): Pro 7 Sat 1 Switzerland (French): Canal + France Taiwan: TTV Main Channel/ Taiwan Television Ent. Thailand: True Visions/UBC Turkey: Digiturk Trinidad & Tobago: CCN Ukraine: Channel Ukraine United Kingdom: BSkyB Uruguay: Sociedad Televisora Larranag Vietnam: TVad Vietnam Television\n\nThe following territories are covered by the Canal + France agreement:\n\nAlgeria, Andorra, Angola, Belgium (Flemish), Benin, Botswana, Burkina Faso, Burundi, Cameroon, Cape Verde, Central Africa (Republic of), Chad, Comoros, Congo (Reublic of), Denmark, Djibouti (Republic of), Dom Tom, Equatorial Guinea, Eritrea, Ethiopia, Finland, France, Gabon, Gambia, Ghana, Guinea (Republic of), Guinea Bissau, Holland, Ivory Coast, Kenya, Liberia, Luxembourg Dutch, Luxembourg French, Luxembourg German, Madagascar, Malawi, Mali, Mauritania, Mauritius, Monaco, Morocco, Mozambique, Namibia, Niger, Nigeria, Norway, Poland, Rwanda, Sao Tome & Principe, Senegal, Sierra Leone, Somalia, Sudan, Swaziland, Sweden Switzerland French, Tanzania, Togo, Tunisia, Uganda, Zaire, Zambia, and Zimbabwe\n\nThe following territories are covered by the TNT agreement:\n\nAnguilla Island (Leeward Island), Antigiua & Barbuda, Argentina, Aruba, Bahamas, Barbados, Belize, Bermuda, Bolivia, Brazil, British Virgin Islands, Cayman Islands, Chile, Colombia, Costa Rica, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Grenadines Islands, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Montserrat, Netherlands Antilles, Nicaragua, Panama, Paraguay, Peru, St. Kitts & Nevis, St. Lucia, St. Vincent Island, Suriname, Trinidad & Tobago, Turks and Caicos Islands, Uruguay, and Venezuela.\n\nThe following territories are covered by the M-Net Africa agreement:\n\nAngola, Benin, Botswana, Burkina Faso, Burundi, Cameroon, Central Africa Republic, Chad, Comoros, Congo (Republic of), Djibouti (Republic of), Equatorial Guinea, Eritrea, Ethiopia, Gabon, Gambia, Ghana, Guinea (Republic of), Guinea Bissau, Ivory Coast, Kenya, Lesotho, Liberia, Madagascar, Malabo, Malawi, Mali, Mauritius, Mozambique, Nambia, Niger, Nigeria, Reunion Island, Rwanda, Sao Tome & Principe, Senegal, Seychelles, Sierra Leone, South Africa, St. Helena, Sudan, Swaziland, Tanzania, Togo, Uganda, Western Sahara, Zaire, Zambia, Zanzibar, and Zimbabwe.\n\nThe 89th Oscars will be held on Sunday, February 26, 2017, at the Dolby Theatre® at Hollywood & Highland Center in Hollywood, and will be televised live on the ABC Television Network at 7 p.m. ET/4 p.m. PT. The Oscars also will be televised live in more than 225 countries and territories worldwide.", "images": ["https://www.oscars.org/sites/all/themes/oscar/logo.png", "https://www.oscars.org/sites/oscars/files/050223b.jpg"], "top_img": "https://www.oscars.org/sites/oscars/files/050223b.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.oscars.org/news/where-watch-oscars-tv-around-world", "title": "Where to watch the Oscars on TV around the world", "meta_data": {"description": "In the United States the Oscars is aired on ABC. But where can you watch it around the world?", "generator": "Drupal 7 (http://drupal.org)", "og": {"image": "https://www.oscars.org/sites/oscars/files/050223b.jpg", "site_name": "Oscars.org | Academy of Motion Picture Arts and Sciences", "type": "article", "title": "Where to watch the Oscars on TV around the world", "url": "https://www.oscars.org/news/where-watch-oscars-tv-around-world", "description": "In the United States the Oscars is aired on ABC. But where can you watch it around the world? Here is your guide.", "updated_time": "2017-02-22T13:10:03-08:00"}, "twitter": {"image": "https://www.oscars.org/sites/oscars/files/050223b.jpg", "card": "summary_large_image", "creator": "@TheAcademy", "url": "https://www.oscars.org/news/where-watch-oscars-tv-around-world", "title": "Where to watch the Oscars on TV around the world", "description": "In the United States the Oscars is aired on ABC. But where can you watch it around the world? Here is your guide."}, "article": {"published_time": "2015-02-20T15:26:32-08:00", "modified_time": "2017-02-22T13:10:03-08:00"}}, "movies": [], "publish_date": 1424474792.0, "source": "https://www.oscars.org", "summary": ""}