{"url": "www.irishtimes.com/culture/film/dwayne-johnson-can-the-rock-save-hollywood-1.3561533", "text": "This weekend sees the release of two potentially huge blockbusters: The Incredibles 2 and Skyscraper. Already the highest-grossing animated film in the US, The Incredibles 2, the latest from Pixar, trades on the massive appeal of the first film and the desire for a high-end family entertainment. Rawson Marshall Thurber’s Skycraper, a disaster film set in that sort of building, does something much more eccentric: it sells itself on its star.\n\nWhat’s so strange about that, you may well ask. Long, long ago (as long ago as 1910), this was standard practice. Movies got made because Mary Pickford, Doris Day, Arnold Schwarzenegger or Johnny Depp signed along the dotted line. Not every one was a hit. But their names mattered almost as much as the plot.\n\nThat era is over. The word “franchise” was used about fast-food restaurants before it was used about movies. The superhero chains are now the real stars and the actors are merely flipping the meat and refilling the napkin dispensers.\n\nYet, there is one man who can can still open a movie. His name is Dwayne “The Rock” Johnson and, this month, he will be saving that eponymous skyscraper from terrorists. The Rock remains.\n\nWhen the sums were done at the end of 2017, Dwayne Johnson’s great rival Vin Diesel – more on that later – was declared the highest-grossing star of the year. He dredged up $1.6 billion on the back of Fast & Furious 8 and xXx: Return of Xander Cage.\n\nA more useful question, however, would have been: who grossed more for films released in 2017?\n\nAs the new year progressed, analysts gawped at the unstoppable success of a little-heralded family entertainment entitled Jumanji: Welcome to the Jungle, which had been released in December. Week after week, it lurked around the top 10 and, by its eventual disappearance, had taken a massive $961 million. That’s more than Spider-Man: Homecoming, Wonder Woman, Thor: Ragnarok and whatever the last Pirates of the Caribbean film was called. Johnson, who also appeared in Fast & Furious 8, won the battle that mattered, with more than $2 billion for 2017 releases.\n\nThe Jumanji story is important because, unlike films in the Star Wars or Marvel sequences, it succeeded largely on the charisma of its star. Yes, Welcome to the Jungle is a sequel, but the first film was released more than 20 years ago and it has secured only a marginal position in popular consciousness. Jumanji: Welcome to the Jungle made more than three times as much as Blade Runner 2049. That film was an ecstatically reviewed sequel to a belatedly established classic. Welcome to the Jungle co-starred Kevin Hart.\n\nThere is barely a film in last year’s top 20 that was convincingly sold on its star. Star Wars: The Last Jedi did not succeed because of Daisy Ridley or John Boyega. Independent cinema has rarely been so fecund, but, at the commercial end, a dizzying run on the movie-star pound has left the industry in a state of panicked uncertainty.\n\nEnormous charm\n\nJohnson succeeds because he has enormous charm and because he is disciplined in his choices. He also succeeds because – a former wrestler who communicates with physicality – he has an uncomplicated appeal that translates well to the increasingly important Asian markets. Dwayne Johnson may well be the last movie star standing.\n\nHow did we get here? The first proper movie star is usually deemed to be the mellifluously named Florence Lawrence. Emerging through D W Griffith’s Biograph Studios, Lawrence, initially anonymous on publicity material, was first named on a poster in 1910. Over the next few decades, Hollywood, a mechanism of cynical brilliance, honed the concept of the star as asset and marketing tool.\n\nDwayne Johnson may well be the last movie star standing. File photograph: Ryan Conaty/The New York Times\n\nDwayne Johnson: ‘I always say you have to be grateful.’ Photograph: Ryan Conaty/The New York Times\n\nFor about 50 years, the “star system” allowed the studios to mould contracted players into brilliant confections that conveyed information about the film even before the audience had read a synopsis. John Wayne was always a version of “John Wayne”. Cary Grant was always a version of that complex conundrum known as “Cary Grant”. You knew you weren’t going to see Fred Astaire pushing a grapefruit into Mae Clarke’s unfortunate face. That was Jimmy Cagney’s job.\n\nThe most eloquent illustration of that process can be found in George Cukor’s 1954 version of A Star is Born. Played with poignant charm by Judy Garland, Esther Blodgett, a talented jazz singer, is run through a merciless machine that plucks her eyebrows, curls her hair, moulds her voice and changes her name. She doesn’t find out about the last tweak until a check arrives made out to “Vicki Lester”.\n\nThe system was brutal and lacking in flexibility, but Cukor’s film acknowledges that it worked. The height of the star system – the 1930s and the 1940s – still feels like a golden age for Hollywood. The greatest actors and directors made enough space for themselves within the strictures to deliver works of genius. Many benefited from the studio’s ability to shut down scandals that, in the current era, would be all over social media before the narcotics cops had time to complete their report.\n\nThe demise of the star system came from two different directions. Determined actors such as Olivia de Havilland, Bette Davis and Shirley MacLaine took action against their employers and gradually wore away the legal viability of the one-sided contracts. As the 1950s crept on, actors such as Marlon Brando and Montgomery Clift, both trained in the method school, rebelled against the supposedly “artificial” nature of the system and began wearing vests in public and refusing to have their eyebrows tweaked. More importantly, they resisted the pressure to anglicise names and thus cleared the way for Robert De Niro to remain Italian and Harvey Keitel to remain Jewish.\n\nMore powerful\n\nNone of this did much to diminish the radiance of the movie star. Though nominally less manufactured, Pacino and Streisand remained as untouchable as Gable and Garbo. Now free agents, able to negotiate a take of the profits, movie stars became more powerful than ever.\n\nBy the 1980s, actors such as Arnold Schwarzenegger and Sylvester Stallone had willingly turned themselves into more starkly identifiable brands than any of the studio system’s products. That is how the Reagan era worked. They were surrounded by teams that helped them maintain their march towards ever-greater riches and ever-greater visibility. Crucially, they made films – high in action, low in dialogue – that played as well in Thailand as North Dakota. Stars from that era are still easier to market in Asia than almost all of their millennial successors.\n\nThe Rock is very much in that 1980s’ tradition.\n\nWhen I met him a few years back, I was impressed by his businesslike approach. He is aware that he is doing a job. But he is also genuinely interested in the person before him. He remembers your name. He listens to what you say. Before I was ushered in, the PR minders – who remain diplomatically silent if somebody is awkward – couldn’t say enough about how nice he was.\n\n“Oh I have occasionally heard that,” he said almost bashfully. “My reputation does precede me. I always say you have to be grateful. We are in an industry that is, all things considered, doing pretty well. Hey, you have to be grateful for that.”\n\n‘The Rock’ poses at a World Wrestling Federation event in 2000. Photograph: Getty Images\n\nDwayne Johnson in 'The Scorpion King'\n\nBorn in 1972, Dwayne Douglas Johnson grew up as the son of wrestler Rocky Johnson. He lived briefly with his mother’s family in New Zealand before moving home to Connecticut and Pennsylvania. Johnson admits to having had a rough time with his dad – they’re pals now – and to getting in scrapes with the law. He graduated from the University of Miami in criminology and spent some time as a linebacker in the Canadian Football League.\n\nWhen all that fell apart, Johnson moved towards the lucrative world of professional wrestling. It was already clear that Rocky Maivi, as he initially dubbed himself, was not suited to be one of the black-balaclava bad guys.\n\nFollowing a noisy period as the clean-cut hero of WWF, during which he adopted The Rock as a nickname, he eventually drifted towards film with the enjoyable romp The Scorpion King in 2002. Johnson would admit that the movie career required subsequent calibration. There were too many iffy children’s films (though Julie Andrews loved playing against him in The Tooth Fairy) and, following a characteristically thoughtful re-evaluation, he honed in upon a rambunctious school of action cinema.\n\nOvercome sniggers\n\nAlong the way, he has managed to overcome sniggers about his original profession – in contrast, Hulk Hogan’s movie career withered – and establish himself as a new figurehead of the establishment.\n\nIn that famous photograph of the audience rocking back when Warren Beatty confirmed they’d given the Oscar to the wrong film, Johnson sits in the second row behind Meryl Streep and Ben Affleck. In this era, it helps that he comes from a mixed-race background. It also helps that he seems to be a decent person.\n\nDuring the shooting of Fast & Furious 8, Johnson posted a comment on Instagram concerning unnamed stars who don’t “conduct themselves as stand-up men and true professionals”. Observers noted that he and Vin Diesel did not appear in any scenes together in the picture. “Vin and I had a few discussions, including an important face-to-face in my trailer,” he told Rolling Stone recently. “And what I came to realise is that we have a fundamental difference in philosophies on how we approach moviemaking and collaborating.”\n\n\n\nDwayne Johnson in 'Skyscraper'. Photograph: Universal Pictures\n\nDwayne Johnson in 'Skyscraper'. Photograph; Kimberley French/©Universal Pictures\n\nEven before the host of The Apprentice became president, speculation bubbled about a future in politics for Johnson. Those 1980s’ stars mentioned earlier mostly gravitated towards the Republican Party. Schwarzenegger, who came to acting via body-building, actually became governor of California. When I met Johnson, I observed that, some years earlier, he had addressed the Republican National Convention.\n\n“I did both parties,” he corrected me. “At that time I had a really young following and that was about exercising your right to vote.” Canny.\n\nQuestions about Donald Trump\n\nIn recent years, he has found himself unable to escape questions about Donald Trump’s policy and behaviour. A man of impeccable manners, he felt compelled to give a clear response. Addressing the NFL players who knelt during the national anthem in protest at police brutality, Johnson said that, if he were in their position, he “would either have knelt or raised my fist in solidarity”. He voted for Obama twice, but did not cast a ballot in 2016.\n\nIn the Rolling Stone interview, he expressed something like regret at that decision. “The next elections, in 2020, I think I’ll be a little bit more vocal in who I support,” he said.\n\nAfter that, who knows? Well, asked about the Trump situation, he remarked that, though anybody can run for president, “not everybody should run for president”.\n\nBefore the situation got so desperate, he laid out his strategy to me.\n\n“Look, I love politics, but I am not passionate about pursuing politics,” he said. “I will leave that to others who are more passionate. I will do what I am passionate about, which is entertaining.”\n\nAfter all, we need at least one movie star.\n\nDwayne Johnson: The Rock in five films\n\nThe Scorpion King (2002) It may not be the greatest recommendation, but this broad action flick was better than any of the Mummy films from which it span off. Dwayne “The Rock” Johnson is indestructible as the eponymous warrior.\n\nSouthland Tales (2006) What the heck is this? Richard Kelly followed up Donnie Darko with a deranged dystopian fantasy concerning a merger between the entertainment industry and the military-industrial complex. Perhaps. Dwayne plays an amnesiac action star. Why not?\n\nThe Other Guys (2010) Dwayne has always had smashing comic timing and he uses it to best advantage as one of the two perfect cops – the other is Samuel L Jackson – idealised by “other guys” Will Ferrell and Mark Wahlberg. A hoot.\n\nFast & Furious 7 (2015) They’re all great obviously. But the seventh film in the driving ’n’ shooting series might be the best. This is the one that featured the last performance of Paul Walker. It is also (appropriately) the seventh highest grossing film of all time. Yes, you read that right.", "images": ["http://www.irishtimes.com/polopoly_fs/1.4230608.1587048659!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4060248.1571832553!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4210029.1584979686!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4224909.1586422157!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563877!/image/image.jpg_gen/derivatives/landscape_620/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563878.1531481666!/image/image.jpg_gen/derivatives/box_300_160/image.jpg", "http://www.irishtimes.com/assets/images/icons/apps/google-play.png", "http://www.irishtimes.com/polopoly_fs/1.4220157.1585927262!/image/image.jpg_gen/derivatives/landscape_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4229550.1586955557!/image/image.jpg_gen/derivatives/box_300_160/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4227881.1586857338!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563880.1531481672!/image/image.jpg_gen/derivatives/box_300_160/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4225322.1586451432!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/assets/images/logo/masthead-small-white.svg", "http://b.scorecardresearch.com/p?c1=2&c2=8946263&cv=2.0&cj=1", "http://www.irishtimes.com/polopoly_fs/1.4230912.1587067014!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4226081.1586531195!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4227856.1586855929!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4230903.1587065919!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563881!/image/image.jpg_gen/derivatives/landscape_620/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4230608.1587048659!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4231617.1587134343!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/country-cookie/", "http://www.irishtimes.com/polopoly_fs/1.4223234.1586273002!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4217991.1585755060!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4228686.1586875338!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4228626.1586966761!/image/image.jpg_gen/derivatives/box_140/image.jpg", "https://www.irishtimes.com/image-creator/?id=1.3563878&origw=1440", "http://www.irishtimes.com/polopoly_fs/1.4228628.1586873277!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4217059.1585671250!/image/image.jpg_gen/derivatives/landscape_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4223131.1586268045!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.2520880.1454508378!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563879!/image/image.jpg_gen/derivatives/landscape_620/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563875!/image/image.jpg_gen/derivatives/landscape_620/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3563882!/image/image.JPG", "http://www.irishtimes.com/polopoly_fs/1.4223101.1586355148!/image/image.jpg_gen/derivatives/box_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4230436.1587058038!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.3561531!/image/image.jpg_gen/derivatives/landscape_620/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4230385.1587027731!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/assets/images/icons/apps/app-store.png", "http://www.irishtimes.com/polopoly_fs/1.4231617.1587134343!/image/image.jpg_gen/derivatives/box_76/image.jpg", "http://www.irishtimes.com/assets/images/comments/comment-error-message.png", "http://www.irishtimes.com/polopoly_fs/1.3926305.1563460639!/image/image.png_gen/derivatives/box_300/image.png", "http://www.irishtimes.com/polopoly_fs/1.4218057.1585756847!/image/image.jpg_gen/derivatives/landscape_140/image.jpg", "http://www.irishtimes.com/polopoly_fs/1.4226096.1586530744!/image/image.jpg_gen/derivatives/box_140/image.jpg"], "top_img": "https://www.irishtimes.com/image-creator/?id=1.3563878&origw=1440", "keywords": [], "authors": [], "canonical_link": "https://www.irishtimes.com/culture/film/dwayne-johnson-can-the-rock-save-hollywood-1.3561533", "title": "Dwayne Johnson: Can ‘The Rock’ save Hollywood?", "meta_data": {"apple-itunes-app": "app-id=365544593", "description": "The golden era of a film selling itself on its star is over – but ‘Skyscraper’ does just that", "vf": {"unique_id": "wwwirishtimescom13561533"}, "news_keywords": "Culture, Film, Arnold Schwarzenegger, Ben Affleck, Bette Davis, Daisy Ridley, Donald Trump, Donnie Darko, Doris Day, Dwayne Douglas Johnson, Esther Blodgett, Florence Lawrence, Fred Astaire, George Cukor, Grant Cary, Hulk Hogan, Jimmy Cagney, John Boyega, John Wayne, Johnny Depp, Judy Garland, Julie Andrews, Kevin Hart, Mae Clarke, Mark Wahlberg, Marlon Brando, Marshall Thurber, Mary Pickford, Meryl Streep, Olivia De Havilland, Paul Walker, Richard Kelly, Robert Niro, Rocky Johnson, Rocky Maivi, Samuel L Jackson, Scorpion King, Shirley MacLaine, Sylvester Stallone, Vicki Lester, Vin Diesel, Will Ferrell, Xander Cage, Canadian Football League, Republican Party, University Of Miami In Criminology, Wwf, Instagram, Johnson, NFL, Asia, Connecticut, Hollywood(US.CA), Montgomery, New Zealand, North Dakota, Pennsylvania, Rawson, Southland, Thailand, United States", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=2.0, user-scalable=yes, target-densitydpi=medium-dpi", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "telephone=no", "robots": "all", "og": {"title": "Dwayne Johnson: Can ‘The Rock’ save Hollywood?", "type": "article", "url": "https://www.irishtimes.com/culture/film/dwayne-johnson-can-the-rock-save-hollywood-1.3561533", "site_name": "The Irish Times", "description": "The golden era of a film selling itself on its star is over – but  ‘Skyscraper’ does just that", "locale": "en_US", "image": {"identifier": "https://www.irishtimes.com/image-creator/?id=1.3563878&origw=1440", "secure_url": "https://www.irishtimes.com/image-creator/?id=1.3563878&origw=1440", "type": "image/jpeg", "height": 630, "width": 1200}}, "twitter": {"card": "summary_large_image", "site": "@IrishTimesCultr", "creator": "@DonaldClarke63", "url": "https://www.irishtimes.com/culture/film/dwayne-johnson-can-the-rock-save-hollywood-1.3561533", "title": "Dwayne Johnson: Can ‘The Rock’ save Hollywood?", "description": "The golden era of a film selling itself on its star is over – but  ‘Skyscraper’ does just that", "image": "https://www.irishtimes.com/polopoly_fs/1.3563878.1531481666!/image/image.jpg", "account_id": 15084853}, "p": {"domain_verify": "407f54448f07f81a1dee976d9c243713"}, "fb": {"pages": 45441411157, "app_id": 1170474839675514}}, "movies": ["https://www.youtube.com/embed/t9QePUT-Yt8"], "publish_date": null, "source": "http://www.irishtimes.com", "summary": ""}