{"url": "https://www.mercurynews.com/2018/10/29/how-meghan-markle-has-freed-kate-middleton-to-become-the-queen-shes-destined-to-be/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nMeghan Markle has been winning raves and non-stop headlines for her fashion choices, her feminist speeches, her PDA with Prince Harry and her pregnancy glow during her first royal tour to Australia and the South Pacific. Clearly, the California-born former TV actress is comfortable being a new global superstar.\n\nMeanwhile, her sister-in-law Kate Middleton has been back home in the U.K., continuing her more low-key but self-assured return to royal duties after taking six months’ maternity leave following the birth of her third child, Prince Louis, in April.\n\nIt turns out that Kate’s recent moves may be more consequential than Meghan’s in the long term. That’s because Kate is married to William, second in line to the British throne, while Meghan’s new husband Harry was bumped down to sixth in line of succession after Louis was born.\n\nOnce William becomes king, Kate becomes Queen Catherine — queen consort officially, Town and Country reported.\n\nThe Duchess of Cambridge also is the mother of at least one other future monarch, Prince George. And it looks like, after seven years of marriage and numerous royal appearances, she’s grown comfortable with this “senior” position — especially with Meghan taking over the “princess-in-training” role with her marriage in May to Harry, according to Vanity Fair.\n\nRoyal observers added to Vanity Fair that Meghan’s arrival into “The Firm” gives it four massively popular figures as its representatives to the world, just as Queen Elizabeth II enters her mid-90s and Charles reportedly takes over more of the duties of being head of the family.\n\nKate is now “fully a senior royal” within the apparatus — no longer the “commoner” who’s just married into the royal family, Vanity Fair added. That’s now Meghan’s position.\n\n“It’s a huge turning point,” Susan E. Kelley, owner and editor of the blog What Kate Wore, told Vanity Fair. “I think this is where Kate gets to make her mark.”\n\nIn certain ways, Kate’s seemingly more confident moves since returning to royal duties show the influence of her new sister-in-law, the Duchess of Sussex. Since marrying William in 2011, Kate has been seen as a bit prim and proper in what she wears and how she presents herself. To the royal press corps, she has often come off as “standoffish” or “haughty.”\n\nMeghan’s demeanor, on the other hand, is more relaxed and down-to-earth, probably reflecting her American upbringing and her experience in Hollywood. The former “Suits” actress and humanitarian certainly knows how to work the press, the cameras and the crowds.\n\nVanity Fair and other publications noted that Kate’s first royal outing since returning from maternity leave allowed her to show a more relaxed side, as well as an interest in supporting disadvantaged children. She visited inner-city children at a London wildlife garden and school. Rather than turn up in a modest-length skirt, with her signature nude pumps and panty hose, she came dressed casually in jeans, a khaki jacket and leather boots. During her visit, she was photographed bending down to bond with the young children and to read them a story.\n\nKate followed up that photo op by showing some rare PDA with William at Princess Eugenie’s Oct. 12 wedding at Windsor Castle. She let William put his hand on her back at one point, while she rested her hand on his upper thigh while watching Eugenie marry Jack Brooksbank in St. George’s Chapel.\n\nKate Middleton and Prince William were feeling the love at Princess Eugenie's #RoyalWedding! https://t.co/tpwasT5lI2 — ET Canada (@ETCanada) October 12, 2018\n\nKate also showed up in what Vanity Fair called one of the most “fashion-forward dresses of her career” — a tweed Erdem with a shoulder-baring asymmetrical neckline — at an Oct. 10 solo appearance at the Victoria and Albert Museum.\n\nFinally, she dazzled last week at a state dinner at Buckingham Palace, wearing an ice-blue Alexander McQueen gown and the Lover’s Knot tiara — a favorite of the late Princess Diana.\n\nThe Alexander McQueen gown also was sleeveless; Kate hasn’t worn many dresses, including evening gowns, that show off her slender arms. Meghan, however, has shown less traditional modesty when it comes to fashion, sometimes baring her shoulders or going sleeveless, including recently in Australia where she wore an eco-friendly U.S.-made sundress with a thigh-high slit.\n\nMeghan, with Harry, also easily ditched royal protocol, removing her shoes to join some surfers/mental health advocates on a Sydney beach. Kate, on the other hand, kept her shoes on while visiting another Sydney beach in 2014, the Express pointed out.\n\n“A couple of years ago, you might still have seen (Kate) being a little bit timid,” Kelley added to Vanity Fair. “Now, she seems like she’s in a more take-charge position. I’m beginning to see the person who’s going to be the queen emerging.”\n\nKaitlin Menza, co-host of the Royally Obsessed podcast, added to Vanity Fair, “After that long break, (Kate) has certainly come back with a bang. I think that’s what she’s trying to convey: ‘I’m back, baby.'”\n\nRoyal observers put aside any ideas of a behind-the-scenes Kensington Palace rivalry between Kate and Meghan.\n\nVanity Fair’s royal correspondent Katie Nicholl said that Kate actually is “quite grateful” to Meghan for relieving her of some of “the relentless scrutiny” that comes from being in the royal family.\n\n“People who are often saying ‘Well, is she jealous of Meghan?’ She’s really not,” Nicholl said.\n\n“Kate is happier in her life now than she ever has been,” Nicholl continued. “She has everything she wants. She has William, she has three beautiful children . . . she is where she always wanted to be.”", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/uploads/2018/07/KateMeghanWimbledon1.jpg?w=1024&h=682"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/07/KateMeghanWimbledon1.jpg?w=1024&h=682", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/10/29/how-meghan-markle-has-freed-kate-middleton-to-become-the-queen-shes-destined-to-be/", "title": "How Meghan Markle has freed Kate Middleton to become the queen she’s destined to be", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "New global superstar Meghan Markle has taken some of the 'relentless scrutiny' off Kate Middleton, allowing the future Queen Catherine to be more herself, royal observers say.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "How Meghan Markle has freed Kate Middleton to become the queen she’s destined to be", "url": "https://www.mercurynews.com/2018/10/29/how-meghan-markle-has-freed-kate-middleton-to-become-the-queen-shes-destined-to-be/", "description": "Meghan Markle has taken some of the ‘relentless scrutiny’ off Kate Middleton, allowing the future Queen Catherine to be more herself, royal observers say.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/07/KateMeghanWimbledon1.jpg?w=1024&h=682", "width": 1024, "height": 682}, "locale": "en_US"}, "article": {"published_time": "2018-10-29T14:32:08+00:00", "modified_time": "2018-10-29T18:33:31+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "How Meghan Markle has freed Kate Middleton to become the queen she’s destined to be"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/07/KateMeghanWimbledon1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1540742400.0, "source": "https://www.mercurynews.com", "summary": ""}