{"url": "https://www.indiewire.com/2018/04/2018-new-indie-movies-summer-releases-1201951208/", "text": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.\n\nThis week, IndieWire will be rolling out our annual Summer Preview, including offerings that span genres, niche offerings for dedicated fans, a closer look at festival favorites finally headed to a theater near you, and plenty of special attention to all the new movies you need to get through a jam-packed summer movie-going season. Check back throughout the week for a new look at the best the season has to offer, and clear your schedule, because we’re going to fill it right up.\n\nRead More: Check out our entire Summer Preview right here\n\nToday — 29 indie standouts and festival favorites (including exciting new offerings from some of our favorite directors, from Jason Reitman to Debra Granik, Spike Lee to Gus Van Sant, Paul Schrader to Desiree Akhavan, and plenty of rising stars) bound for a big screen near you.\n\n“Tully,” May 4\n\nscreencap\n\nA very different kind of adult fairy tale (one that frequently doubles as a feature-length advertisement for tubal ligation), “Tully” is a fantasy of the highest order; it might look like an episode of “This Is Us,” but this story is every bit as magical as “The Shape of Water.” Think of it as Diablo Cody’s modern take on “Mary Poppins”: What it lacks in musical sequences, it more than makes up for in sex scenes and Carly Rae Jepsen sing-alongs. Starring a convincingly worn-out Charlize Theron as a 40-year-old mother of two, “Tully” tells the story of a woman who’s at her wit’s end before a luminous young night nurse (Mackenzie Davis) rings her doorbell and restores her to life. Funnier than “Juno” and almost as ruthlessly honest as “Young Adult,” Cody’s third collaboration with director Jason Reitman is a razor-sharp movie about the trials of motherhood, and the clear and present danger of losing yourself once you start living for someone else. —DE\n\n“RBG,” May 4\n\nCNN\n\nPopular on IndieWire\n\nWhen she was growing up, Ruth Bader Ginsburg’s beloved mother Celia gave her two lessons to guide her through life: “Be a lady” and “Be independent.” That two-pronged approach appears to have influenced every aspect of the Supreme Court justice’s life, both personal and political. In Betsy West and Julie Cohen’s wide-ranging “RBG,” Ginsburg’s life — and its many lessons, both learned and taught — come to entertaining and energetic life. It’s a fist-pumping, crowd-pleasing documentary that makes one heck of a play to remind people of Ginsburg’s vitality and importance, now more than ever. “RBG” serves as a compelling Ginsburg primer, and West and Cohen are understandably interested in driving home just how fully she fought back sexism at every stage of her professional life, from her experience at Harvard Law to her first steps into full-time work to her Supreme Court appointment. Yet it’s the insights into her personal life that feel the most vital, moving “RBG” beyond the kind of information you could read on a Wikipedia page (as ably and entertainingly rendered as they may be on the big screen). -KE\n\n“Revenge,” May 11\n\nIf you love New French Extremity films like “High Tension” and “Martyrs,” and have been yearning for a grisly, blood-soaked heroine, have we got the film for you. “Revenge” stars Matilda Anna Ingrid Lutz, who transforms from sex kitten to badass on a mission to seek revenge against the men who wronged her. Jen (Lutz) is taken on a getaway by her lover, a married man, but is surprised when two of his friends also show up on the trip. The men have sinister intentions, but Jen isn’t going down without a fight and the guys have a big surprise waiting for them, as Jen morphs into a defiant Final Girl for the ages. Bloody, brutal, and unforgettable, “Revenge” is a great way to kick off the summer horror season. —JR\n\n“Beast,” May 11\n\nA stylish romantic noir, “Beast” debuted at TIFF last year and breaks out two well-matched UK actors, “Taboo” star Jessie Buckley and “Lovesick” regular Johnny Flynn. Rookie director Michael Pearce balances gorgeous scenery with two mysterious and charismatic yet unreliable characters who draw us into their love affair but are capable of…what, exactly? We are afraid to find out, and you should be, too. You’ll hear more from Pearce very soon, who’s been doing the LA meeting rounds. -AT\n\n“The Day After,” May 11\n\nSouth Korean favorite Hong Sang-soo has been unstoppable as of late. “The Day After” will be the director’s third in the U.S. in the last year alone, following “On the Beach Alone at Night” and “Claire’s Camera.” Hong’s latest premiered at Cannes last year and stars his recent muse and “The Handmaiden” star Kim Min-hee. The story, shot in black and white, centers on a dramatic love triangle between a man, his wife, and the unassuming woman his wife mistakes for being romantically involved with her husband. -ZS\n\n“Filmworker,” May 11\n\nAn absolute must-see documentary for fans of Stanley Kubrick, Tony Zierra’s “Filmworker” brings us into the life of the legendary and mysterious director’s long-time assistant Leon Vitali. Kubrick was both notoriously private and insistent on working with a tight-knit group of confidants and, for over two decades Vitali – who first worked with Kubrick as an actor in “Barry Lyndon” (1975) – was one of those who dedicated his life to serving the great master’s vision. Not only does “Filmworker” give cinephiles an unique view inside this closed-door world of Kubrick’s process, it paints a fascinating portrait of those lesser-known collaborators who enable such an obsessive artist – something that becomes particularly emotional resonant in the role Vitali played ushering “Eyes Wide Shut” to the finish line after Kubrick died in 1999. -CO\n\n“First Reformed,” May 18\n\nA24\n\nFor 40 years, Paul Schrader has made movies about serious, driven men isolated by deep-seated philosophical conflicts. From “American Gigolo” to “Mishima: A Life in Four Chapters” to “Affliction” — not to mention the “Taxi Driver” screenplay for which he’s best known — Schrader’s stone-faced protagonists are guided by a spiritual sense of purpose that reflects his Calvinist upbringing. With “First Reformed,” that obsession takes center stage in an absorbing late period achievement that brings Schrader’s talent back into focus. “First Reformed” consolidates the decades of bubbling guilt and frustration experienced by so many Schrader protagonists into a single enraged priest, played with brilliant layers of guilt and discontent by Ethan Hawke. Hawke’s character wrestles with an ecological crisis, his own faith, and his allegiance to his church in a suspenseful pileup of circumstances that keeps you guessing all the way through the shocking finale. It’s the best work in years for both men, a fascinating meditation on inner turmoil in which doing the right thing can lead down many wrong directions. –EK\n\n“Pope Francis – A Man of His Word,” May 18\n\nWim Wenders’ latest documentary, “Pope Francis – A Man of His Word,” will make its global debut at Cannes, but without the Pope. After producer Alessandro Lo Monaco worked closely with the Vatican on Gianfranco Pannone’s documentary about the Vatican’s Swiss Guard, the Vatican approached him about co-producing a documentary about outspoken Pope Francis, who seeks to communicate directly with the people. Lo Monaco turned to three-time Oscar nominee Wenders (documentaries “Buena Vista Social Club,” “Pina,” and “Salt of the Earth”), who devised a direct-to-camera visual and narrative concept to engage the audience face-to-face with the pope, creating a dialogue between him and a cross-section of humanity as he responds to questions from farmers, workers, refugees, children, the elderly, prison inmates, and those who live in favelas and migrant camps. Intended as a personal journey with the Pope rather than a biography, the movie films Pope Francis addressing his audience on the big subjects: life, death, social justice, immigration, ecology, wealth inequality, materialism, and the role of the family. -AT\n\n“How to Talk to Girls at Parties,” May 25 John Cameron Mitchell’s “How To Talk to Girls at Parties” premiered at the Cannes Film Festival last year and is finally coming to theaters this summer, thanks to A24. The film is adapted from the short story by Neil Gaiman and is kind of like a punk rock version of “Under the Skin.” Elle Fanning plays an alien who falls in love with humanity after befriending an English teenager obsessed with the punk scene. With its outlandish costumes and edgy storyline, the film finds Mitchell back in “Hedwig” mode following his dramatic last feature, “Rabbit Hole.” There’s also Nicole Kidman as an alien leader, so you know you can’t miss it. -ZS\n\n“American Animals,” June 1\n\nCourtesy of Sundance Institute\n\n“You’ve seen too many movies.” It’s a line that’s almost as old as the movies themselves. And yet, in reality, very few people have actually seen too many movies. More often, the trouble is that someone hasn’t seen enough movies — or, in the case of Bart Layton’s “American Animals,” that they’ve seen just enough movies to get them into trouble. A slick, well-acted, and intensely self-reflexive docudrama from the director of “The Impostor,” “American Animals” stars Barry Keoghan and Evan Peters in the true story of some bored young film buffs who hatch a plan that’s too good to be true: They’re going to break into the special-collection section of the Transylvania University Library — home to some of the world’s rarest books — and steal millions of dollars worth of classic literature. You’ll be shocked to learn that things don’t go according to plan. A fun heist thriller with a seriously meta twist, “American Animals” is fiercely entertaining from start to finish, even when its characters are acting so dumb that you start to suspect they still have some more evolving to do. —DE\n\n“Hereditary,” June 8\n\nA24\n\nA24 has been at the forefront of some of the best indie horror releases in past years thanks to “The Witch” and “It Comes at Night,” and “Hereditary” looks to continue that tradition. After taking Sundance by storm earlier this year, “Hereditary” seems poised to conquer the summer horror box office, and rival “A Quiet Place” as one of the year’s best horror movies. After the death of her mother, Annie (Toni Collette) and her family discover dark secrets about their ancestry, but they soon discover you cannot outrun the things you have inherited, especially when they are sinister. Filled with chilling images (seriously, that man on fire!), a powerhouse performance by Collette, and one eerie little girl, “Hereditary” is sure to terrifying audiences, and be an unforgettable experience at the movies this summer. —JR\n\n“Hearts Beat Loud,” June 8\n\nGunpowder & Sky\n\nIt’s hard to imagine being embarrassed to have Nick Offerman as your dad, but by sheer force of effortless charm, Kiersey Clemons (“Dope”) makes it look natural. From three-time Sundance alum Brett Haley (“The Hero,” “I’ll See You in My Dreams”), “Hearts Beat Loud” stars Offerman as a father who convinces his daughter into starting a band with him. Saddled with a struggling record shop, he pressures her to take a year off before college after their song receives minor attention on Spotify. The film was critically well-received out of Sundance, with many praising the heartwarming story and singling out Clemons’ performance. Toni Collette, Blythe Danner, and Ted Danson also star, with an original music by Keegan DeWitt. The film also boasts a tender teen romance between Clemons and Sasha Lane (“American Honey”), which is sure to interest anyone with an eye on the rising indie stars. -JD\n\n“Won’t You Be My Neighbor?,” June 8\n\nFocus Features\n\n“When I was a boy and I would see scary things in the news, my mother would say to me, ‘Look for the helpers,’” wrote beloved children’s television host Fred Rogers in one of his 36 books. “‘You will always find people who are helping.’” Rogers died in 2003, leaving an imprint on the entire galaxy (an asteroid was named in his honor). Yet these words have been recirculated often in the intervening years, when the nation Rogers wished good morning for more than three decades awakes to another mass shooting or act of terrorism. And there’s more to come: a Tom Hanks-led biopic called “You Are My Friend” will follow this documentary from Oscar recipient and recent Cannes casualty Morgan Neville (“20 Feet from Stardom”). An ordained minister whose red cardigan now resides in the Smithsonian, Rogers harkens back to a simpler, gentler-seeming time – numerous audience members were overheard weeping during the tribute’s Sundance Film Festival premiere. Yet he confronted societal injustices everyday on his Emmy-winning “Mister Rogers’ Neighborhood” – where Michael Keaton was once a stagehand – phrasing lessons with great care that was never patronizing, even when conveyed a miniature trolley-ride away, by the puppet nobility of The Neighborhood of Make-Believe. -JM\n\nCheck out more summer preview picks on the next page.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-16-at-5-42-11-pm1.png?w=117&h=82&crop=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F04%2F2018-new-indie-movies-summer-releases-1201951208%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201951208", "http://www.indiewire.com/wp-content/uploads/2018/04/beast-pc-kerry-brown.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "http://www.indiewire.com/wp-content/uploads/2017/08/first-reformed.jpg?w=780", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.indiewire.com/wp-content/uploads/2018/01/37781692685_d9a7712589_o.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2018/01/group_table_029.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2018/04/american-animals.jpg?w=117&h=82&crop=1", "http://www.indiewire.com/wp-content/uploads/2017/05/1ac64290efa5c8bf4cafb1b5dc9512d4bf221d7c.jpg?w=780", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "http://www.indiewire.com/wp-content/uploads/2017/09/revenge.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-20-at-11-32-09-am.png?w=600", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg", "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2018/01/sundancerbg-tpr-011718-1240x6981.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2018/01/tully-charlize-theron-today-191101-tease-03_2852959446ae0e3b7eeef46253ba76fd.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/11/hbl_still_color_final-full-frame.jpg?w=780"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg", "keywords": [], "authors": ["Kate Erbland Eric Kohn David Ehrlich Anne Thompson Jenna Marotta Zack Sharf Jamie Righetti Chris O'Falt Jude Dry", "Kate Erbland", "Eric Kohn", "David Ehrlich", "Anne Thompson", "Jenna Marotta", "Zack Sharf", "Jamie Righetti", "Chris O'Falt", "Jude Dry"], "canonical_link": "https://www.indiewire.com/2018/04/2018-new-indie-movies-summer-releases-1201951208/", "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.", "news_keywords": "Summer Preview 2018", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Jude Dry", "content_type": "Article", "post_id": 1201951208, "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "published_at": "2018-04-19 11:15:43", "image": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=300", "comment_count": 0, "tags": "Summer Preview 2018", "topics": "Film", "body": "This week, IndieWire will be rolling out our annual Summer Preview, including offerings that span genres, niche offerings for dedicated fans, a closer look at festival favorites finally headed to a theater near you, and plenty of special attention to all the new movies you need to get through a jam-packed summer movie-going season. Check back throughout the week for a new look at the best the season has to offer, and clear your schedule, because we’re going to fill it right up.\r\n\r\nRead More: Check out our entire Summer Preview right here\r\n\r\nToday — 29 indie standouts and festival favorites (including exciting new offerings from some of our favorite directors, from Jason Reitman to Debra Granik, Spike Lee to Gus Van Sant, Paul Schrader to Desiree Akhavan, and plenty of rising stars) bound for a big screen near you.\r\n\"Tully,\" May 4\r\n\r\n\r\nA very different kind of adult fairy tale (one that frequently doubles as a feature-length advertisement for tubal ligation), “Tully” is a fantasy of the highest order; it might look like an episode of “This Is Us,” but this story is every bit as magical as “The Shape of Water.” Think of it as Diablo Cody’s modern take on “Mary Poppins”: What it lacks in musical sequences, it more than makes up for in sex scenes and Carly Rae Jepsen sing-alongs. Starring a convincingly worn-out Charlize Theron as a 40-year-old mother of two, “Tully” tells the story of a woman who’s at her wit’s end before a luminous young night nurse (Mackenzie Davis) rings her doorbell and restores her to life. Funnier than “Juno” and almost as ruthlessly honest as “Young Adult,” Cody’s third collaboration with director Jason Reitman is a razor-sharp movie about the trials of motherhood, and the clear and present danger of losing yourself once you start living for someone else. —DE\r\n\"RBG,\" May 4\r\n\r\n\r\nWhen she was growing up, Ruth Bader Ginsburg’s beloved mother Celia gave her two lessons to guide her through life: “Be a lady” and “Be independent.” That two-pronged approach appears to have influenced every aspect of the Supreme Court justice’s life, both personal and political. In Betsy West and Julie Cohen’s wide-ranging “RBG,” Ginsburg’s life — and its many lessons, both learned and taught — come to entertaining and energetic life. It’s a fist-pumping, crowd-pleasing documentary that makes one heck of a play to remind people of Ginsburg’s vitality and importance, now more than ever. “RBG” serves as a compelling Ginsburg primer, and West and Cohen are understandably interested in driving home just how fully she fought back sexism at every stage of her professional life, from her experience at Harvard Law to her first steps into full-time work to her Supreme Court appointment. Yet it’s the insights into her personal life that feel the most vital, moving “RBG” beyond the kind of information you could read on a Wikipedia page (as ably and entertainingly rendered as they may be on the big screen). -KE\r\n\"Revenge,\" May 11\r\n\r\n\r\nIf you love New French Extremity films like “High Tension” and “Martyrs,” and have been yearning for a grisly, blood-soaked heroine, have we got the film for you. “Revenge” stars Matilda Anna Ingrid Lutz, who transforms from sex kitten to badass on a mission to seek revenge against the men who wronged her. Jen (Lutz) is taken on a getaway by her lover, a married man, but is surprised when two of his friends also show up on the trip. The men have sinister intentions, but Jen isn’t going down without a fight and the guys have a big surprise waiting for them, as Jen morphs into a defiant Final Girl for the ages. Bloody, brutal, and unforgettable, “Revenge” is a great way to kick off the summer horror season. —JR \r\n\"Beast,\" May 11\r\n\r\n\r\nA stylish romantic noir, \"Beast\" debuted at TIFF last year and breaks out two well-matched UK actors, \"Taboo\" star Jessie Buckley and \"Lovesick\" regular Johnny Flynn. Rookie director Michael Pearce balances gorgeous scenery with two mysterious and charismatic yet unreliable characters who draw us into their love affair but are capable of...what, exactly? We are afraid to find out, and you should be, too. You'll hear more from Pearce very soon, who's been doing the LA meeting rounds. -AT\r\n\"The Day After,\" May 11\r\nSouth Korean favorite Hong Sang-soo has been unstoppable as of late. \"The Day After\" will be the director's third in the U.S. in the last year alone, following \"On the Beach Alone at Night\" and \"Claire's Camera.\" Hong's latest premiered at Cannes last year and stars his recent muse and \"The Handmaiden\" star Kim Min-hee. The story, shot in black and white, centers on a dramatic love triangle between a man, his wife, and the unassuming woman his wife mistakes for being romantically involved with her husband. -ZS\r\n\"Filmworker,\" May 11\r\nAn absolute must-see documentary for fans of Stanley Kubrick, Tony Zierra’s “Filmworker” brings us into the life of the legendary and mysterious director’s long-time assistant Leon Vitali. Kubrick was both notoriously private and insistent on working with a tight-knit group of confidants and, for over two decades Vitali – who first worked with Kubrick as an actor in “Barry Lyndon” (1975) – was one of those who dedicated his life to serving the great master’s vision. Not only does “Filmworker” give cinephiles an unique view inside this closed-door world of Kubrick’s process, it paints a fascinating portrait of those lesser-known collaborators who enable such an obsessive artist – something that becomes particularly emotional resonant in the role Vitali played ushering “Eyes Wide Shut” to the finish line after Kubrick died in 1999. -CO\r\n\"First Reformed,\" May 18\r\n\r\n\r\nFor 40 years, Paul Schrader has made movies about serious, driven men isolated by deep-seated philosophical conflicts. From “American Gigolo” to “Mishima: A Life in Four Chapters” to “Affliction” — not to mention the “Taxi Driver” screenplay for which he’s best known — Schrader’s stone-faced protagonists are guided by a spiritual sense of purpose that reflects his Calvinist upbringing. With “First Reformed,” that obsession takes center stage in an absorbing late period achievement that brings Schrader’s talent back into focus. “First Reformed” consolidates the decades of bubbling guilt and frustration experienced by so many Schrader protagonists into a single enraged priest, played with brilliant layers of guilt and discontent by Ethan Hawke. Hawke's character wrestles with an ecological crisis, his own faith, and his allegiance to his church in a suspenseful pileup of circumstances that keeps you guessing all the way through the shocking finale. It’s the best work in years for both men, a fascinating meditation on inner turmoil in which doing the right thing can lead down many wrong directions. -EK\r\n\"Pope Francis - A Man of His Word,\" May 18\r\nWim Wenders’ latest documentary, “Pope Francis - A Man of His Word,” will make its global debut at Cannes, but without the Pope. After producer Alessandro Lo Monaco worked closely with the Vatican on Gianfranco Pannone’s documentary about the Vatican’s Swiss Guard, the Vatican approached him about co-producing a documentary about outspoken Pope Francis, who seeks to communicate directly with the people. Lo Monaco turned to three-time Oscar nominee Wenders (documentaries “Buena Vista Social Club,” “Pina,” and “Salt of the Earth”), who devised a direct-to-camera visual and narrative concept to engage the audience face-to-face with the pope, creating a dialogue between him and a cross-section of humanity as he responds to questions from farmers, workers, refugees, children, the elderly, prison inmates, and those who live in favelas and migrant camps. Intended as a personal journey with the Pope rather than a biography, the movie films Pope Francis addressing his audience on the big subjects: life, death, social justice, immigration, ecology, wealth inequality, materialism, and the role of the family. -AT\r\n\r\n\"How to Talk to Girls at Parties,\" May 25\r\n\r\n\r\nJohn Cameron Mitchell’s “How To Talk to Girls at Parties” premiered at the Cannes Film Festival last year and is finally coming to theaters this summer, thanks to A24. The film is adapted from the short story by Neil Gaiman and is kind of like a punk rock version of \"Under the Skin.\" Elle Fanning plays an alien who falls in love with humanity after befriending an English teenager obsessed with the punk scene. With its outlandish costumes and edgy storyline, the film finds Mitchell back in \"Hedwig\" mode following his dramatic last feature, \"Rabbit Hole.\" There's also Nicole Kidman as an alien leader, so you know you can't miss it. -ZS\r\n\r\n\r\n\"American Animals,\" June 1\r\n\r\n\r\n“You’ve seen too many movies.” It’s a line that’s almost as old as the movies themselves. And yet, in reality, very few people have actually seen too many movies. More often, the trouble is that someone hasn’t seen enough movies — or, in the case of Bart Layton’s “American Animals,” that they’ve seen just enough movies to get them into trouble. A slick, well-acted, and intensely self-reflexive docudrama from the director of “The Impostor,” “American Animals” stars Barry Keoghan and Evan Peters in the true story of some bored young film buffs who hatch a plan that’s too good to be true: They’re going to break into the special-collection section of the Transylvania University Library — home to some of the world’s rarest books — and steal millions of dollars worth of classic literature. You’ll be shocked to learn that things don’t go according to plan. A fun heist thriller with a seriously meta twist, “American Animals” is fiercely entertaining from start to finish, even when its characters are acting so dumb that you start to suspect they still have some more evolving to do. —DE\r\n\"Hereditary,\" June 8\r\n\r\n\r\nA24 has been at the forefront of some of the best indie horror releases in past years thanks to “The Witch” and “It Comes at Night,” and “Hereditary” looks to continue that tradition. After taking Sundance by storm earlier this year, “Hereditary” seems poised to conquer the summer horror box office, and rival “A Quiet Place” as one of the year’s best horror movies. After the death of her mother, Annie (Toni Collette) and her family discover dark secrets about their ancestry, but they soon discover you cannot outrun the things you have inherited, especially when they are sinister. Filled with chilling images (seriously, that man on fire!), a powerhouse performance by Collette, and one eerie little girl, “Hereditary” is sure to terrifying audiences, and be an unforgettable experience at the movies this summer. —JR\r\n\"Hearts Beat Loud,\" June 8\r\n\r\n\r\nIt's hard to imagine being embarrassed to have Nick Offerman as your dad, but by sheer force of effortless charm, Kiersey Clemons (\"Dope\") makes it look natural. From three-time Sundance alum Brett Haley (\"The Hero,\" \"I'll See You in My Dreams\"), \"Hearts Beat Loud\" stars Offerman as a father who convinces his daughter into starting a band with him. Saddled with a struggling record shop, he pressures her to take a year off before college after their song receives minor attention on Spotify. The film was critically well-received out of Sundance, with many praising the heartwarming story and singling out Clemons' performance. Toni Collette, Blythe Danner, and Ted Danson also star, with an original music by Keegan DeWitt. The film also boasts a tender teen romance between Clemons and Sasha Lane (\"American Honey\"), which is sure to interest anyone with an eye on the rising indie stars. -JD\r\n\"Won't You Be My Neighbor?,\" June 8\r\n\r\n\r\n“When I was a boy and I would see scary things in the news, my mother would say to me, ‘Look for the helpers,’” wrote beloved children’s television host Fred Rogers in one of his 36 books. “‘You will always find people who are helping.’” Rogers died in 2003, leaving an imprint on the entire galaxy (an asteroid was named in his honor). Yet these words have been recirculated often in the intervening years, when the nation Rogers wished good morning for more than three decades awakes to another mass shooting or act of terrorism. And there’s more to come: a Tom Hanks-led biopic called “You Are My Friend” will follow this documentary from Oscar recipient and recent Cannes casualty Morgan Neville (“20 Feet from Stardom”). An ordained minister whose red cardigan now resides in the Smithsonian, Rogers harkens back to a simpler, gentler-seeming time – numerous audience members were overheard weeping during the tribute’s Sundance Film Festival premiere. Yet he confronted societal injustices everyday on his Emmy-winning “Mister Rogers’ Neighborhood” – where Michael Keaton was once a stagehand – phrasing lessons with great care that was never patronizing, even when conveyed a miniature trolley-ride away, by the puppet nobility of The Neighborhood of Make-Believe. -JM\r\n\r\nCheck out more summer preview picks on the next page.\r\n\r\n\r\n\"En el Septimo Dia,\" June 8\r\nThe first feature from Jim McKay (“Our Song”) in a decade was well worth the wait. McKay's film is a touching crowdpleaser about the plight of undocumented Mexican immigrant José, who dashes across Brooklyn each day doing bicycle deliveries for a cramped restaurant when he isn’t playing soccer as the team’s star player in Sunset Park. Those two aspects of his life suddenly clash when his boss insists he work on the same day that his team is due to play in the finals, and he spends the bulk of the week trying to decide where his allegiances lie. José’s problems are exacerbated by his desire to bring his pregnant wife to New York from Mexico, but he’s also keen on serving the needs of his teammates — and retaining some degree of autonomy over the system that dictates his everyday challenges. From this basic premise, McKay spins a bittersweet portrait of urban life against the backdrop of widely neglected concerns, merging the contemporary framework with the tropes of classic neorealism. As with “Our Song,” McKay shows a penchant for working with non-professional actors and clarifying their emotional turmoil through a rousing narrative. More than anything else, “En el Séptimo Dia” (“The Seventh Day”) succeeds at foregrounding characters too often sidelined in American cinema. This is a great New York movie about real New Yorkers who deserve the spotlight more often. -EK\r\n\"Under the Silver Lake,\" June 22\r\n\r\n\r\nA24 had great success last year premiering the Safdie brothers' \"Good Time\" in competition at Cannes followed by a summer release, and that's the exact same route the studio is taking with David Robert Mitchell's \"Under the Silver Lake.\" Mitchell is an indie favorite thanks to the modern horror classic \"It Follows,\" and his latest is a neo-noir mystery starring Andrew Garfield as a makeshift detective searching for his missing neighbor (Riley Keough). The excellent first trailer teased that Mitchell could have own \"Inherent Vice\" on his hands, and he'll be competing for his first Palme d'Or next month before the film's June release. -ZS\r\n\"Damsel,\" June 22\r\n\r\n\r\nThe mad science behind the filmmaking trickery of Austin sibling directors David and Nathan Zellner is that they make wise movies that seem like superficial larks. From their outrageous suburban comedy “Goliath” all the way through the surreal meta “Fargo” riff “Kumiko, the Treasure Hunter,” the Zellners excel at transforming absurd circumstances into trenchant observations of human behavior. With the wildly adventurous “Damsel,” they conjure a kooky Old West setting with antics straight out of “Blazing Saddles,” unearthing a poetic vision of desperate men and the woman who wants nothing to do with them. At first, it seems as though plucky romantic Samuel (Robert Pattinson) hails from a classic tradition of masculine heroism as he plots to rescue Penelope (Mia Wasikowska) from another man in the wilderness. But the truth is a much more complicated and darkly humorous look at just how reductive that trope has become in modern storytelling. Already well-received at Sundance, “Damsel” screened in competition at Berlin and went home empty-handed. Though it lacks the otherworldly weirdness of “Kumiko,” it’s another wry genre experiment that deserves an audience. -EK\r\n\"Leave No Trace,\" June 29\r\n\r\n\r\nA new film from director Debra Granik (“Winter’s Bone,” “Stray Dog”) means something unexpected and thoughtfully crafted that you don’t want to miss. Granik once again welcomes audiences into the world of characters we don’t see on the big screen in a story of a father (Ben Foster) and his teenage daughter (Thomasin McKenzie) who happily live off-the-grid on the edge of Portland, Oregon, until their cover is blown and they are forced to journey into the wilderness. The last time Granik found a teenage actress to anchor her film it was Jennifer Lawrence, and early reviews indicated she has found another potential breakout talent with the New Zealand-born McKenzie. The film debuted at Sundance in January, and is now poised for a Cannes premiere, where Granik will screen it as part of the prestigious Directors' Fortnight section. –CO\r\n\"Sorry to Bother You,\" July 6\r\n\r\n\r\n“Sorry to Bother You” is already a whip-smart satire of racial dynamics in the workplace when it’s about a black telemarketer (Lakeith Stanfield, never better) who uses a white voice to improve his business. Then the mutants show up. The directorial debut of hip-hop artist Boots Riley reaches into the stratosphere of creative inspiration with utterly bonkers results that are nonetheless crystal clear in their intentions: “Putney Swope” by way of “Dear White People,” Riley’s wacky capitalist indictment fires a zillion different wacky ideas at once, and more often than not, hits its targets. Armie Hammer is perfectly cast as a scheming executive whose racist intentions know no bounds, and Tessa Thompson's in top-form as a radical artist and activist. Talk about a movie of the moment. This one will keep people talking all summer. -EK\r\n\"Don't Worry, He Won't Get Far on Foot,\" July 13\r\n\r\n\r\nGus Van Sant is back after 2015's lackluster offering \"Sea of Trees,\" and this time he's re-teamed with Joaquin Phoenix, star of his 1995's classic \"To Die For.\" \"Don't Worry, He Won't Get Far On Foot\" tells the real-life story of cartoonist John Callahan, who finds healing and humor in art after a life-changing accident that also sets him on the road to sobriety. \"Don't Worry, He Won't Get Far On Foot\" is a welcome return for Van Sant, and a must-see film that is sure to be part of the awards conversation thanks in part to another incredible lead performance by Phoenix, and another strong supporting turn for Jonah Hill, who continues to establish himself as a versatile dramatic actor. -JR\r\n\"Eighth Grade,\" July 13\r\n\r\n\r\nYou’re going to fall in love with Elsie Fisher. As the breakout star and big, beating heart of Bo Burnham’s feature directorial debut, “Eighth Grade,” Fisher is tasked with carrying an entire film — an achingly real, firmly modern coming-of-age tale – with honesty and vulnerability to spare. The moment audiences meet Fisher’s character, soon-to-be middle school grad Kayla, she’s staring straight into her computer, delivering a motivational speech about “being yourself” that she will then upload on to her YouTube channel. But Kayla isn’t some social media star, and her video ends with a halting plea for more likes and more shares. For a kid like Kayla, an outcast who is mostly ignored by her peers, the internet provides just another place for her voice to go unheard. It’s remarkable that Burnham — yes, a man — has delivered a film like “Eighth Grade,” which is so deeply rooted in the feminine adolescent experience that it often feels as if he must have cracked open a whole mess of girls’ diaries to pen it. Burnham was initially moved to write about how social media impacts our lives, before abandoning the idea for something a little lighter, and perhaps even more true. -KE\r\n\"Blindspotting,\" July 20 (expanding on July 27)\r\n\r\n\r\nCarlos Lopez Estrada's debut stars its co-writers, Daveed Diggs and Rafael Casal, as a pair of Oakland-based movers who struggling to find their place in a sea of gentrification. Ultimately, the movie belongs to Diggs, a Tony winner for “Hamilton” who comes into his own as a genuine movie star with a fully realized performance. However, \"Blindspotting\" is a powerful showcase for both actors, as the story oscillates from comedy to tragedy with a series of shocking developments that contend with matters of race, family and personal ambition with a striking degree of intimacy. All that, plus a little side dish of hip hop, ensure this Sundance opener will translate into a genuine crowdpleaser. -EK\r\n\"Searching,\" August 3\r\n\r\n\r\nAneesh Chaganty’s clever \"Searching\" (which debuted at Sundance earlier this year as \"Search\") takes the \"screen movie\" concept into nifty new directions, bolstered by a solid turn from star John Cho. The film chronicles the twisted mystery of David's (Cho) missing teen daughter Margot (Michelle La), though at first, it’s not entirely clear to David what’s happened, for two people able to connect through so many different means, it’s shockingly easy for one of them to slip through the cracks. Eventually cognizant of what’s happened (or, at the very least, that something has happened), David’s ratcheting fear is effectively captured through video calls and his constantly Facetime camera, always on. Cho is stellar as the undone dad, and his grounded performance keeps David real and relatable even as the storytelling grows more ambitious. It’s a true storytelling feat, married with sharp editing that makes the entire effort not only seamless, but also wholly intuitive. The use of real websites and social media platforms – from YouTube and Gmail to Facebook and Instagram – further sell the conceit, and the only true distraction the film offers is audio that can be billed as too good (the video, however, occasionally times out, real as anything). -KE\r\n\"Madeline's Madeline,\" August 10\r\n\r\n\r\n\r\nOne of the boldest and most invigorating American films of the 21st century, Josephine Decker’s “Madeline’s Madeline” is an ecstatically disorienting experience that defines its terms right from the start and then obliterates any trace of traditional film language, achieving a cinematic aphasia that allows Decker to redraw the boundaries between the stories we tell and the people we tell them about. The story of a single mother Regina (the multi-talented Miranda July), her irrepressible teenage daughter Madeline (major newcomer Helena Howard), and the unspecified mental illness that drives a wedge between them when the latter joins an experimental theater troupe, this mesmeric tour de force claws at its premise with incredible precision, using. The result is an experimental movie with the emotional tug of a mainstream hit, a fragmented coming-of-age drama that explores the vast space between Jacques Rivette and Greta Gerwig in order to find something truly new and ineffably of its time. —DE\r\n\"Skate Kitchen,\" August 10\r\n\r\n\r\nWhen \"The Wolfpack\" played Sundance in 2015, it was one of the buzziest hits of the festival. One of those rare documentaries that proves truth is always stranger than fiction, the film made first-time director Crystal Moselle an instant indie superstar. Three years later, Moselle is making her narrative debut with \"Skate Kitchen,\" which follows a vibrant crew of girl skateboarders. Moselle casts many first-time actors, maintaining her hallmark authenticity and knack for highlighting real life characters. Variety's review compared \"Skate Kitchen\" to the 1986 skater film \"Thrashin',\" praising its \"millennial, vérité spin\" on an \"an irresistible hangout movie.\" Jaden Smith plays a supporting role, which is certain to draw the hip young set when \"Skate Kitchen\" hits theaters this summer. -JD\r\n\"BlacKkKlansman,\" August 10\r\nSpike Lee has teamed with Focus Features and Blumhouse's Jason Blum for his next true story drama, \"BlacKkKlansman,\" which promises to be another political blood-boiler. The movie stars John David Washington and Adam Driver and centers on an African-American detective who infiltrates a Colorado chapter of the Ku Klax Klan and becomes its leader. The film has been selected to compete for the Palme d'Or at Cannes next month, which will give Lee his third shot at the prize following \"Do the Right Thing\" and \"Jungle Fever.\" -ZS\r\n\"The Miseducation of Cameron Post,\" August 10\r\n\r\n\"Appropriate Behavior\" filmmaker Desiree Akhavan returned to this year's Sundance with a dramatic and timely new feature that speaks to her burgeoning talents behind the camera (good enough to win the Grand Jury Prize, after all). The drama is based on the Emily M. Danforth novel of the same name and follows the eponymous Cameron Post (Chloe Grace Moretz, in one of her best roles ever) after she is caught engaging in sexual activity with her best female friend on prom night. Sent off to a gay conversion therapy center, Cameron must contend with the camp’s two very different heads — the strict Dr. Lydia Marsh (Jennifer Ehle) and her brother Reverend Rick (John Gallagher Jr.), who himself as been through the program, meant to “cure same sex attraction” — while also growing closer to fellow campers Jane (Sasha Lane) and Adam (Forrest Goodluck). Akhavan has already shown her deft hand at taking complicated, complex matters of sexuality and family and turning them into rich, wily final products, and \"Miseducation\" only continues that trend in satisfying ways. -KE\r\n\r\n\"Makala,\" August 24\r\nEmmanuel Gras’ experimental documentary won the Critics’ Week prize at Cannes for good reason: It’s an ambitious experiment with film form that also resonates on a powerful emotional level. The movie follows the plight of a Congolese coal salesman through every step of his process, from chopping down trees to journeying across a sun-baked landscape in a grueling trip to support his family back home. The poetic imagery and elegant sound design all contribute to a mesmerizing, lyrical descent into this cycle of survival, which ultimately embodies a universal struggle. While Cannes 2017 was dominated by conversations about Netflix and the future of the moviegoing experience, “Makala” makes the case that some cinematic achievements demand the big screen experience, and on some level contribute to its continuing relevance. It’s a movie that should get audiences talking — about capitalism, economic hurdles, personal ambition — and it's also a riveting adventure. One of this summer's must-sees. -EK\r\n\"Support the Girls,\" August 24\r\n\r\n\r\nSXSW regular Andrew Bujalski sets his latest film inside a Texas titty bar, replete with car washes, short shorts, and a lethargic naturalism that effectively wipes clean the titillation such a setting might typically arouse. Regina Hall (\"Girls Trip\") plays the bar's general manager, Lisa, who runs a tight ship but protects her girls with a maternal warmth. The conflicts are not quite disastrous; someone needs money for an abortion, someone else has to take her son to work, and someone is stealing. Bujalski's day-in-the-life realism is refreshing, and it serves to normalize the waitresses' lives. The down side of such well executed hyper-realism is that when the time comes for a denouement, it inevitably falls flat. Nevertheless, \"Support the Girls\" is an excellent showcase for Hall, Lea Delaria (\"Orange is the New Black\"), Haley Lu Richardson (\"Columbus\"), Dylan Gelula (\"Unbreakable Kimmy Schmidt\"), as well the underground rap artist Junglepussy, making her film debut as Shayna McHayle. -JD\r\n\"The Little Stranger,\" August 31\r\nFor his sixth feature – and first since earning a Best Director Oscar nomination for “Room” – Irish director Lenny Abrahamson contemplates a languishing manor in central England. Circa 1947, Hundreds Hall becomes a welcome stopover for the son of one of its former maids, Dr. Faraday (Domhnall Gleeson, who co-starred in Abrahamson’s 2014 film “Frank”). There lives his future fiancée, Caroline (Ruth Wilson, “The Affair”), with her ex-WWII pilot brother (Will Poulter) and their mother (Academy Award nominee Charlotte Rampling). But the Ayres family home life turns sinister and ghost-strewn after Caroline’s dog attacks a child. “The Danish Girl” screenwriter Lucinda Coxon adapted the text from Sarah Waters’ 2009 novel, proclaimed the best book of that year by none other than scare Svengali Stephen King. –JM\r\n\r\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/04/2018-new-indie-movies-summer-releases-1201951208/", "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "description": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg", "width": 780, "height": 487}}, "article": {"published_time": "2018-04-19T15:15:43+00:00", "modified_time": "2018-06-04T18:46:22+00:00", "author": "https://www.indiewire.com/author/kateindiewire/", "section": "Film", "tag": "Summer Preview 2018"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1524153600.0, "source": "https://www.indiewire.com", "summary": ""}