{"url": "thehorrormoviesblog.com/2018/01/01/jay-z-caught-shapeshifting-united-airlines-flight-lax/", "text": "Dozens of United Airlines passengers claim they saw Jay-Z shapeshift into a reptilian as the rapper and music mogul travelled between New York City and Los Angeles on Friday.\n\nOne witness, writing about the experience on Twitter, said “the shit hit the fan in business class” when Jay-Z “lost control” and began shapeshifting in front of the other business class passengers. “V scary. He kept changing shape. He knew more and more people were watching and he got angrier and angrier when he couldn’t stop.”\n\nAt one point, just before the plane began it’s descent, Jay-Z scuttled off to the bathroom, where he spent “at least 10 minutes,” according to another eyewitness, before emerging with a pale, drawn expression – and then immediately begin shapeshifting again, with the eyes of the entire business class cabin fixed on him.\n\n“Everybody saw it. His chin jutted out the door and then he just changed completely into a leering reptilian.”\n\nAccording to one passenger, Jay-Z’s reptilian form is a shrunken version of his human form. Describing reptilian Jay-Z on Twitter, the passenger wrote, “He looked sickly, about five feet tall, like a hunchback crossed with a bird, but with scales and a really negative vibe.”\n\nAnother witness described him as “swaggering around, evil, grey, a f*cking reptile.”\n\nTwitter exploded with tweets detailing the scene as soon as the plane landed in Los Angeles and passengers were able to access wifi. Within minutes, before passengers had even disembarked, the hashtag #ReptilianJayZ had been retweeted thousands of times.\n\nHowever as the trending topic began attracting attention on Twitter the tweets with the #ReptilianJayZ hashtag and the accounts behind them began to disappear.\n\nThe hashtag disappeared from Twitter’s top 10 trending topics and now appears to have been airbrushed from history by the social media platform.\n\nA public figure who wishes to remain anonymous for fear of losing her Twitter profile – a verified account with over 1,400,000 followers – says that she clicked on the hashtag and watched in real time as hundreds of tweets and user accounts were deleted.\n\nShe saved copies of as many new tweets as she could before they were also deleted.\n\n“Jay-Z tweets were only staying published for 20 or 30 seconds before they were being scrubbed. It was eerie to watch people being silenced before my very eyes.”\n\nTwitter explained they were deleting the tweets as they fell foul of the platform’s ’Hateful conduct’ rules:\n\nHateful conduct: You may not promote violence against or directly attack or threaten other people on the basis of race, ethnicity, national origin, sexual orientation, gender, gender identity, religious affiliation, age, disability, or disease.\n\nIn a series of since deleted tweets, one eyewitness, taking advantage of Twitter’s new 280 character limit, said she approached Jay-Z when he was in human form and asked him “what the actual f*ck?\n\nJay-Z stared at her frozen face, and then laughed a horrible laugh, before unleashing some kind of “reptilian manifesto” on the unsuspecting business class passenger:\n\n“Get ready, the Statue of Liberty will be shapeshifting soon, Jesus Christ in Rio will manifest as reptilian. Mount Rushmore will be taken over for the glory of our superior race. You will see the world as it really is – JAY Z”\n\nUnited Airlines, desperate to avoid a new scandal, sent two men with guns and a blanket onboard to shepherd Jay-Z off the flight before any of the other passengers were allowed to leave, according to multiple witnesses.\n\nThere were audible gasps of relief as Jay-Z left the aircraft.\n\nExperts claim Jay-Z belongs to the Babylonian Brotherhood – a group of shapeshifting reptilian humanoids determined to control humanity and usher in the New World Order.\n\nAccording to historians there have been sightings of reptilians around the world at regular intervals throughout history, but it is widely believed that we are now in a golden age of reptilian sightings. There is a belief that the world is gaining consciousness, waking up, and that the veil is slowly lifting.\n\nIt is said that Jay-Z, a member of the dominant reptilian-Illuminati bloodline, is becoming one of the most commonly sighted shapeshifting reptilians in the world, second only to Queen Elizabeth.\n\nHowever experts warn that two people watching the same scene will not necessarily both be able to discern the shapeshifting reptilian, however more people than ever before have developed the ability to witness reptilians manifest in their true form.\n\nDo YOU want to write for HMB? Get started today by signing-up and submitting an article Get started today by signing-up and submitting an article HERE BECOME AN AUTHOR", "images": ["http://thehorrormoviesblog.com/wp-content/uploads/2018/01/ppppppppppp.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2017/10/kkkkk-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2018/12/1-4-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/uuu.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2015/08/241812168_eye56x5x5x5x5_xlarge-2-150x150.png", "http://thehorrormoviesblog.com/wp-content/uploads/2013/10/www-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2015/11/download-1-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2016/12/iiiii-150x150.jpeg", "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/005a2994ac5dc0a10fc2.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2010/11/Resident_Evil_4_Afterlife_3d_poster-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/themes/hmb/img/icon-user.png", "http://thehorrormoviesblog.com/wp-content/uploads/2015/07/maxresdefault-2-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2015/11/xhmb-authors-logo.png.pagespeed.ic._VE4uqo-GD.png", "http://thehorrormoviesblog.com/wp-content/uploads/2017/07/jjjj-1-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/llll.jpg", "http://thehorrormoviesblog.com/wp-content/uploads/2016/01/1452721153_144351441798590-150x150.jpg", "http://thehorrormoviesblog.com/wp-content/themes/hmb/img/logo.svg", "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/7.jpg"], "top_img": "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/005a2994ac5dc0a10fc2.jpg", "keywords": [], "authors": ["Nadia Vella"], "canonical_link": "http://thehorrormoviesblog.com/2018/01/01/jay-z-caught-shapeshifting-united-airlines-flight-lax/", "title": "Jay-Z Caught Shapeshifting On United Airlines Flight To LAX", "meta_data": {"viewport": "width=device-width,initial-scale=1.0", "og": {"locale": "en_US", "type": "article", "title": "Jay-Z Caught Shapeshifting On United Airlines Flight To LAX", "description": "Dozens of United Airlines passengers claim they saw Jay-Z shapeshift into a reptilian as the rapper and music mogul travelled between New York City and Los Angeles on Friday. // One witness, writing about the experience on Twitter, said “the shit hit the...", "url": "http://thehorrormoviesblog.com/2018/01/01/jay-z-caught-shapeshifting-united-airlines-flight-lax/", "site_name": "THE HORROR MOVIES BLOG", "image": "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/uuu-150x150.jpg"}, "article": {"author": "https://www.facebook.com/nadia.vella.775", "section": "Lizard", "published_time": "2018-01-01T14:07:09+00:00"}, "twitter": {"card": "summary", "description": "Dozens of United Airlines passengers claim they saw Jay-Z shapeshift into a reptilian as the rapper and music mogul travelled between New York City and Los Angeles on Friday. One witness, writing about the experience on Twitter, said “the shit hit the fan in business class” when Jay-Z “lost control” and began shapeshifting in frontMORE", "title": "Jay-Z Caught Shapeshifting On United Airlines Flight To LAX", "image": "http://thehorrormoviesblog.com/wp-content/uploads/2018/01/005a2994ac5dc0a10fc2.jpg", "creator": "@paranormal_nvel"}, "fb": {"app_id": 578048765586229}}, "movies": [], "publish_date": 1514736000.0, "source": "http://thehorrormoviesblog.com", "summary": ""}