{"url": "https://movieweb.com/luke-wilson-hero-car-crash-saves-woman/", "text": "Actor Luke Wilson and professional golfer Bill Haas were involved in a fatal car accident on Tuesday night in Pacific Palisades. Haas was the passenger in a Ferrari that reportedly clipped a few cars, including Wilson's SUV, and then crashed into a pole at a high speed. The driver of the Ferrari died at the scene and Haas suffered some pain and leg swelling and has since gone home to South Carolina to recuperate. After Luke Wilson's SUV had been clipped, he and another driver got out of their vehicles to help a woman whose car had flipped after hearing her cry for help.\n\nAccording to Sean Heirigs, Luke Wilson instantly got out of his car to rush to the assistance of the woman whose car had been flipped over from the accident. Heirigs says that Wilson led the rescue, directing him on what to do after they noticed that the woman's leg was pinned underneath her steering wheel. Wilson was reportedly scared that the Ferrari was going to catch on fire and possibly explode.\n\nSean Heirigs says that Luke Wilson came up with the plan to get the unidentified 50-year old woman out of the car. Heirigs recalls that he went to the passenger side door to try and calm the woman down while Wilson figured out a way to free her from the vehicle. He had this to say.\n\n\"At one point, (Wilson) was like, Let's get her out of here, it smells like smoke. You don't know if it's going to blow up or not. So, I reached in through a window to calm her down. Luke went around the back, to the trunk of the car. We pried it open, she was able to unbuckle herself, and Luke started to pull her out from the back. We then both carried her to the curb.\"\n\nSean Heirigs says that Luke Wilson took charge of the situation and hailed the actor as a hero. When it was all over, Heirigs says they all hugged each other while waiting for the paramedics to show up.\n\nAs for the driver of the Ferrari, he was Mark William Gibello who lived in the area, the coroner said. Bill Haas was staying with Gibello's family to prepare for the Genesis Open at nearby Riviera Country Club. Haas was obviously not able to make it, and as previously noted, he went back to South Carolina after getting discharged from the hospital. Apparently, Gibello and Haas had only met that previous Thursday and according to reports, Bill Haas was pretty shaken up by the accident.\n\nAccording to witnesses at the scene of the accident, the Ferrari was traveling at a high rate of speed when it clipped Sean Heirigs' BMW and Luke Wilson's SUV, plowing into the unidentified woman's car, flipping it over in the process. The Ferrari then crashed into a pole and Bill Haas had to crawl out of the sunroof to escape the wreckage. 71-year old Mark William Gibello, who was the driver of the Ferrari, died at the scene. Gibello was reportedly showing the car off to Haas when he lost control of the vehicle.\n\nThe unidentified 50-year old woman's condition is not clear at this time, but it assumed that she was okay after Luke Wilson pulled her from the wreckage. Wilson and his representatives have yet to make a statement in regard to the accident, but Sean Heirigs is calling Wilson a hero. From what it sounds like, everybody involved is lucky that there was only one fatality at the scene. You can read more about Luke Wilson's heroic deeds over at People Magazine.", "images": ["https://cdn3.movieweb.com/i/article/sb3hzstawNUIAQkFsk512IboyFisAp/1200:100/Luke-Wilson-Hero-Car-Crash-Saves-Woman.jpg", "https://cdn3.movieweb.com/i/author/xOPw7WWJQayBqpBi49Vki5rZ4ri0kb/60:70/Kevin-Burwick.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17091571&cv=2.0&cj=1", "https://certify.alexametrics.com/atrk.gif?account=4fQco1IWNa10zK"], "top_img": "https://cdn3.movieweb.com/i/article/sb3hzstawNUIAQkFsk512IboyFisAp/1200:100/Luke-Wilson-Hero-Car-Crash-Saves-Woman.jpg", "keywords": [], "authors": ["Kevin Burwick", "Writer For Movieweb Since Enjoys Playing Catan When Not Writing About Superheroes", "Star Wars."], "canonical_link": "https://movieweb.com/luke-wilson-hero-car-crash-saves-woman/", "title": "Real-Life Hero Luke Wilson Rescues Woman After Deadly Car Crash", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Luke Wilson led the rescue of a woman who was trapped in her car after a fatal accident.", "fb": {"app_id": 357878074202}, "robots": "max-image-preview:large", "og": {"title": "Real-Life Hero Luke Wilson Rescues Woman After Deadly Car Crash", "type": "article", "image": "https://cdn3.movieweb.com/i/article/sb3hzstawNUIAQkFsk512IboyFisAp/1200:100/Luke-Wilson-Hero-Car-Crash-Saves-Woman.jpg", "url": "https://movieweb.com/luke-wilson-hero-car-crash-saves-woman/", "description": "Luke Wilson led the rescue of a woman who was trapped in her car after a fatal accident.", "site_name": "Movieweb"}, "article": {"published_time": "2018-02-15T11:05:32-08:00", "section": "Movie News"}, "twitter": {"card": "summary_large_image", "site": "@movieweb", "creator": "@PantherInCrime", "title": "Real-Life Hero Luke Wilson Rescues Woman After Deadly Car Crash", "description": "Luke Wilson led the rescue of a woman who was trapped in her car after a fatal accident.", "image": {"identifier": "https://cdn3.movieweb.com/i/article/sb3hzstawNUIAQkFsk512IboyFisAp/1200:100/Luke-Wilson-Hero-Car-Crash-Saves-Woman.jpg", "alt": "Real-Life Hero Luke Wilson Rescues Woman After Deadly Car Crash"}, "url": "https://movieweb.com/luke-wilson-hero-car-crash-saves-woman/"}}, "movies": [], "publish_date": 1518721532.0, "source": "https://movieweb.com", "summary": ""}