{"url": "https://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "text": "A woman called an akashic-records healer who reads your past, present and possible future lives sat me down and asked about my foot pain. I asked her how she knew I had foot pain. I wasn’t limping. She said, “You have flat feet.” I nodded, incredulous. “I do,” I said. “I have flat feet.” She told me that 13 lives ago, my feet were chopped off as punishment for a crime. As a result, since then, whenever I reincarnate (which is every 100 to 500 years because I like to rest between incarnations), my feet are flat because I like the surety of them entirely touching the ground.\n\nWhat I’m saying is: There was nothing that couldn’t be healed at the summit.\n\nThe next morning, I had another article to write. But my hotel was on the beach, and the ocean was just a block away. I still had a bottle of Madame Dry Rose Water, which is “botanically infused, positively charged” water that is filtered through rose-quartz crystals, and a bottle of Lifewtr, which is just water without vowels. I thought, for maybe the first time in my life, that work could wait. Self-care. Wellness. It started now. I had a long trip home ahead of me, and now I was someone who said “self-care.”\n\nI walked down to the beach with my waters. I sat on a bench as I drank them. I became buoyant with hope. I could feel my posture straightening. I was so free of anxiety and so full of forward motion. I couldn’t remember feeling that way ever before. I could do this, I thought. I could change. I could be someone who pursued only the best. The ocean air. The sand. The sky. All the wellness, it was mine. I could stop smoking. I could exercise. I could hydrate. Look at all the kinds of waters we have! Look at all the kinds of moisturizer! All the ingredients, all of them so beautiful. Everything beautiful, lovely and clean. What if you could pay the price — time, intention, a serious allocation of funds — and make it all this way? I could. I would.\n\nI finished my waters and headed to the airport, where I dropped my rental car and boarded the Hertz bus. But something was wrong at the airport, or it was just Los Angeles being Los Angeles, and the bus didn’t move. The normally 10-minute ride was now 20, and then 30, and then 40. I had to go to the bathroom so badly. My terminal was at the end and there was a stop at every single other terminal — even Air China. At 50 minutes, I realized I could no longer hold it and alerted the bus driver. Someone suggested I just get off at the next terminal and then pick the next bus up again. I screamed that I couldn’t! I didn’t have time! My kids and husband were waiting for me!\n\nFinally, I got off two terminals early. I ran through the check-in area, screaming: “Where’s the bathroom? Where’s the bathroom?” I peed my beautiful pee wondering what the point of it all had been. I ran through the next two terminals till I finally got to the United check-in area. I cut the line, screaming still, “I was on a Hertz bus for an hour!”\n\nI dropped off my suitcase just before the cutoff. I ran through the airport, my new smoker’s cough slowing me down. I went through security but didn’t have time to get something to eat at the fancy place, and so I got a premade fried chicken sandwich, which I would eat and feel every preservative and every sodium molecule course through my blood.\n\nAs I was boarding, my sister called me.\n\n“How was it?” she asked.\n\nThe image of the reiki workshop I’d gone to at the summit returned to me. The practitioner had us lie on the floor and announced that we were all sharing one another’s energy, and I didn’t know how to feel about that, as if I hadn’t consented to it. She said, “The future is your best teacher.” She waved her hands over us like a sorceress. She gave us each a charged rose crystal that was shaped like a heart but flat and told us to put it in our bras. At the end, we lay, eyes closed, and put our hands on our hearts, and I opened my eyes before everyone else and saw all these women dressed in light colors, lined up like desperate, exquisite corpses, their hands over their hearts, totally inert.", "images": ["https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-facebookJumbo.png", "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-GNXX/29mag-paltrow-slide-GNXX-articleLarge.png?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-articleLarge.png?quality=75&auto=webp&disable=upscale"], "top_img": "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-facebookJumbo.png", "keywords": [], "authors": ["Taffy Brodesser-Akner"], "canonical_link": "https://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "title": "How Goop’s Haters Made Gwyneth Paltrow’s Company Worth $250 Million", "meta_data": {"article": {"published": "2018-07-25T09:00:03.000Z", "modified": "2018-07-30T20:41:00.000Z", "section": "Magazine", "tag": "Women and Girls", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 100000006018598, "nyt_uri": "nyt://article/d871a606-a36f-5ba4-b7b8-1ffbdfd183fd", "pubp_event_id": "pubp://event/4dd38de54ce5433f9d8bf245dc7f4e8f", "description": "Inside the growth of the most controversial brand in the wellness industry.", "image": "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-facebookJumbo.png", "byl": "By Taffy Brodesser-Akner", "thumbnail": "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-thumbStandard.png", "news_keywords": "Gwyneth Paltrow,Goop.com,Women and Girls", "pdate": 20180725, "og": {"url": "https://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "type": "article", "title": "How Goop’s Haters Made Gwyneth Paltrow’s Company Worth $250 Million", "image": {"identifier": "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-facebookJumbo.png", "alt": "Gwyneth Paltrow."}, "description": "Inside the growth of the most controversial brand in the wellness industry."}, "twitter": {"url": "https://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "title": "How Goop’s Haters Made Gwyneth Paltrow’s Company Worth $250 Million", "description": "Inside the growth of the most controversial brand in the wellness industry.", "image": {"identifier": "https://static01.nyt.com/images/2018/07/29/magazine/29mag-paltrow-slide-HG8U/29mag-paltrow-slide-HG8U-videoSixteenByNineJumbo1600.png", "alt": "Gwyneth Paltrow."}, "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/d871a606-a36f-5ba4-b7b8-1ffbdfd183fd"}}, "site": "@nytimes"}, "CG": "magazine", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/d871a606-a36f-5ba4-b7b8-1ffbdfd183fd", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2018/07/25/magazine/big-business-gwyneth-paltrow-wellness.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1532448000.0, "source": "https://www.nytimes.com", "summary": ""}