{"url": "www.inquisitr.com/opinion/4545022/adam-sandler-confirms-justin-bieber-didnt-ask-for-acting-advice-says-singer-is-funny-as-hell/", "text": "Justin Bieber may or may not be interested in mixing it up in movies one day, but one thing is known – the superstar did not ask Adam Sandler for acting advice.\n\nThat was the recent false claim made by a tabloid site. It was subsequently denied by Sandler during an interview at the Los Angeles premiere of his new Netflix movie, The Meyerowitz Stories, earlier this week.\n\n“Justin Bieber Wants to Break Into Acting, Asked Adam Sandler and David Spade for Advice,” US Weekly had trumpeted as its headline in a story this week, which prompted copycat articles from outlets that didn’t bother to fact-check for themselves.\n\nHowever, the claim that Justin asked for Sandler for film advice because he supposedly wants to try acting is just not true.\n\nWhile the Biebs did dine with Sandler and comic-actor David Spade — just after the trio appeared at a hurricane relief telethon last month — the “Sorry” superstar did not quiz Sandler for acting tips.\n\nIn Entertainment Tonight’s interview, Sandler was asked about the claim that he dined with the Canadian pop singer to help his acting career.\n\n“I don’t know who said that, but that’s some weird story that they made up,” Sandler firmly refuted.\n\nThe veteran comedy star explained, “That’s not it at all.”\n\nSandler continued, “We just hung out. He just wanted to go to dinner, me and David Spade and Dustin [Hoffman], and Dustin said no, he ran away, so it was just me and David.”\n\nWatch the brief interview below.\n\nSandler’s emphatic calling out of the fake story indicates the purported “quotes” in US Weekly’s story were either inadequately sourced or simply made up.\n\nGiven that the magazine is owned by American Media, Inc. — the publisher that also owns the National Enquirer, Radar Online, Star, OK!, and other outlets of that low-tier ilk — we’ll leave it to sensible Inquisitr readers to decide whether or not US Weekly used incompetent sources or just flat-out fabricated them.\n\nEither way, the claim that the Biebs had “sought out some A-list help to guide him in his thespian ambitions,” as US Weekly’s spurious “source” puts it — is fiction.\n\nExhibit one: “Justin Bieber asked Adam Sandler and David Spade out to dinner to pick their brains about breaking into the film industry.”\n\nThat “quote” is false.\n\nExhibit two: “They had a great time! Justin had a lot of questions for them about the movie world.”\n\nThat “quote” is also bogus.\n\nAnother “quote” claimed the pop prince “is trying to educate himself about the industry and learn more about it,” and “wants to break into acting and directing/producing.”\n\nHowever, that was also a completely erroneous “quote.”\n\nJustin Bieber Did NOT Ask Adam Sandler For Acting Advice, Despite Claim https://t.co/dLc5ctxUd0 pic.twitter.com/zjSdCb9U3e — Gossip Cop (@GossipCop) October 12, 2017\n\nHere are some of the things Sandler actually did say about the Biebs.\n\nSandler told Entertainment Tonight that hanging out with the 23-year-old superstar bagged him cool points with his daughters, 11-year-old Sadie and 8-year-old Sunny.\n\n“That was a good thing at home, but he’s a great kid,” Sandler told ET’s Cameron Mathison.\n\nThe 51-year-old added, “He’s funny as hell and we went out to dinner and had a nice time. He’s really, really a great guy — just funny and he can sing pretty well.”\n\nSandler then quipped, “Did you know he sings and dances? I didn’t know.”\n\nBad reporting is commonplace in entertainment news. Much of it is highly exaggerated and/or fabricated. Typically, the aim is attracting clickbait to sites and newsstands.\n\nIn recent weeks, false media stories claiming Bieber had given interviews to two UK tabloids about Ed Sheeran and Simon Cowell were also debunked.\n\nGossip Cop, the reliable rumor-watchdog website, reported that Justin did not give any interviews to the tabloids in question, shortly after the offending outlets removed the made-up interviews from their sites.\n\nOther recent false Justin Bieber-media stories alleged the Grammy winner has been banned from renting properties in Beverly Hills.\n\nHowever, that claim was also revealed to be fake news.\n\nThe best advice? Always consider the source before believing a story.\n\n[Featured Image by KGC-138/STAR MAX/IPx/AP Images]", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/10/Justin-Bieber-Adam-Sandler-help.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/b911717e2a01903d946c8f1136c6928f?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Page Mackinley"], "canonical_link": "https://www.inquisitr.com/opinion/4545022/adam-sandler-confirms-justin-bieber-didnt-ask-for-acting-advice-says-singer-is-funny-as-hell/", "title": "Adam Sandler Confirms Justin Bieber Didn’t Ask For Acting Advice, Says Singer Is ‘Funny As Hell’ [Opinion]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}