{"url": "https://web.archive.org/web/20090224213953/http://www.mcclatchydc.com:80/251/story/62614.html", "text": "WASHINGTON — During the 2008 presidential campaign, candidates Barack Obama and John McCain fought vigorously over who would be toughest on congressional earmarks.\n\n\"We need earmark reform,\" Obama said in September during a presidential debate in Oxford, Miss. \"And when I'm president, I will go line by line to make sure that we are not spending money unwisely.\"\n\nPresident Barack Obama should prepare to carve out a lot of free time and keep the coffee hot this week as Congress prepares to unveil a $410 billion omnibus spending bill that's riddled with thousands of earmarks, despite his calls for restraint and efforts on Capitol Hill to curtail the practice.\n\nThe bill will contain about 9,000 earmarks totaling $5 billion, congressional officials say. Many of the earmarks — loosely defined as local projects inserted by members of Congress — were inserted last year as the spending bills worked their way through various committees.\n\nSo while Obama and McCain were slamming earmarks on the campaign trail, House and Senate members — Democrats and Republicans — were slapping them into spending bills.\n\n\"It will be a little embarrassing for the president if he signs a bill with that many earmarks on it,\" said Stan Collender, a veteran Washington budget analyst. \"He'll say they're left over from the Bush years, and he as to say that next year the bill will be clean.\"\n\nExperts agree that most earmarks are legitimate. Cary Leahey, senior economist with Decision Economics in New York, said the nation's economic crisis is a contributing factor to the plethora of earmarks. Lawmakers can argue that for a relatively small price they've helped boost the economy.\n\n\"One congressman's earmark is another legislative way to fix a serious problem in his district,\" Leahey said.\n\nKenneth Thomas, a lecturer in finance at the University of Pennsylvania's Wharton School of business, agrees.\n\n\"I generally believe that the priority is getting money into the system sooner rather than later, especially if it's for projects that will use local contractors and create jobs,\" he said.\n\nStill, it wasn't supposed to be this way. Earmarks have come under fire because of those that seem to provide what Maya MacGuineas, president of the Committee for a Responsible Federal Budget, calls \"laugh lines,\" such as Alaska's \"Bridge to Nowhere\" or North Dakota's Lawrence Welk Museum.\n\nObama pledged to take a hard hand on earmarks and warned lawmakers in a Feb. 3 letter from Budget Director Peter Orszag not to decorate the recently signed $787.2 billion stimulus bill with them.\n\nDemocrats declared the bill earmark-free. Republicans disagreed.\n\n\"While this bill does not include traditional earmarks, we should all understand that there are earmarks in this bill,\" said Sen. Mike Enzi, R-Wyo. \"There is $850 million ... to bail out Amtrak, a $75 million earmark for the Smithsonian, a $1 billion earmark for the 2010 census.\"\n\nDemocrats have been trying to revamp the earmark process for about two years. In 2007, they instituted a system that required members to explain the contents of each earmark, as well as a justification for why it was included in the legislation that way. They claimed this led to a reduction in earmarks by as much as 43 percent.\n\nBut critics contended the system still had problems. Simply making information more available, they said, didn't address the major criticism: That such projects should go through the regular legislative process, subject to detailed hearings and bipartisan votes.\n\nNot only does this mean the public has no chance to challenge questionable spending, but too often powerful interests who know how to work the system get favorite measures inserted.\n\nFor instance, Congressional Quarterly reported recently that more than 100 House members got earmarks for clients of the PMA Group, a lobbying firm with close ties to Rep. John Murtha, D-Pa., who heads the powerful defense spending subcommittee. The CQ Politics analysis said that in the 2009 defense spending bill, which Congress approved last year, PMA clients got about $300 million.\n\nThe CQ study came after reports that the FBI is investigating the possibility of illegal campaign contributions by PMA to Murtha and other lawmakers. A Murtha spokesman said earlier this month that the FBI probe has nothing to do with Murtha. A PMA spokesman declined to comment on the probe.\n\nAppropriations committee chairmen say they are on track to reform the earmark process beginning in fiscal 2010 by requiring members to make public their requests early, so the public can scrutinize them and presumably contact lawmakers.\n\nThe change, though, doesn't apply to the 2009 funding that Congress will consider next week.\n\nSeveral experts believe that dramatically reducing the number of earmarks, while a laudable goal, is almost impossible. But others contend that earmarks aren't that big of a problem.\n\n\"Earmarks get more attention than they deserve,\" said MacGuineas. \"The problem is that they cause a loss of confidence in the whole budget process.\"\n\nON THE WEB:\n\nCQ list of House members who got PMA Group earmarks\n\nMORE FROM MCCLATCHY\n\nStimulus will flow rapidly to some projects, trickle to others\n\nPresident Obama warns mayors not to 'waste' stimulus money\n\nNationalizing troubled banks may be the only answer", "images": ["https://web.archive.org/web/20090224213953im_/http://s7.addthis.com/static/btn/lg-share-en.gif", "https://web.archive.org/web/20090224213953im_/http://media.mcclatchydc.com/static/images/icon_rss.gif", "https://web.archive.org/web/20090224213953im_/http://ad.doubleclick.net/ad/mi.mdc00/News;dcove=d;pl=story;lvl6=Latestheadlines;loc=ats;pos=NTL3;sz=300x250;tile=2;ord=123456789", "https://web.archive.org/web/20090224213953im_/http://ad.doubleclick.net/ad/mi.mdc00/News;dcove=d;pl=story;lvl6=Latestheadlines;loc=ats;pos=NTL4;sz=160x600;tile=3;ord=123456789", "https://web.archive.org/web/20090224213953im_/http://www.mcclatchydc.com/static/favicon.ico", "https://web.archive.org/web/20090224213953im_/http://media.mcclatchydc.com/static/images/cartoons/cartoon01.jpg", "https://web.archive.org/web/20090224213953im_/http://media.mcclatchydc.com/static/images/mcclatchy_logo_gitmo.gif", "https://web.archive.org/web/20090224213953im_/http://ad.doubleclick.net/ad/mi.mdc00/News;dcopt=ist;dcove=d;pl=story;lvl6=Latestheadlines;loc=ats;pos=NTL2;sz=728x90;tile=1;ord=123456789", "https://web.archive.org/web/20090224213953im_/http://mcclatchy.112.2o7.net/b/ss/nmmclatchy/1/H.10--NS/0?pageName=Story:%2062614%7CEarmark%20reform%26%2363;%202009%20spending%20bill%20contains%209,000%20of%20them&server=www.mcclatchydc.com&channel=Latest%20headlines&c1=http%26%2358;%26%2347;%26%2347;www.mcclatchydc.com%26%2347;251%26%2347;story%26%2347;62614.html&c3=Story&c4=dc%7CMcClatchy%7CMcClatchy%20Newspapers%7CWilliam%20Douglas%20and%20David%20Lightman&c6=MCD%7CDC&c28=&h1=MCD%7CDC%7CNews%7C%7C%7C%7C%7CLatest%20headlines"], "top_img": "https://web.archive.org/web/20090224213953im_/http://www.mcclatchydc.com/static/favicon.ico", "keywords": [], "authors": ["William Douglas", "David Lightman", "Mcclatchy Newspapers"], "canonical_link": "", "title": "Earmark reform? 2009 spending bill contains 9,000 of them", "meta_data": {"verify-v1": "Z7YCkAziGajtpOjMI7jZ4ILvAghyy7DN86gFsJsnmAY="}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}