{"url": "www.thehollywoodgossip.com/2017/06/ryan-seacrest-miserable-as-kelly-ripas-co-host/", "text": "Ryan Seacrest and Kelly Ripa may look happy when the cameras are rolling on Live with Kelly and Ryan, but for one of them, the show is not that great.\n\nYes, we're talking about Ryan here.\n\nThe former American Idol host needs to spend a lot of time New York City in order to keep up with his co-hosting duties on the morning talk show... and he ain't pleased about it.\n\nAccording to Radar, life in the Big Apple is not all it has cracked up to be for Ryan, and he allegedly yearns for the weekend so he can hope across the country to Los Angeles.\n\n“Ryan is miserable,” the insider dishes, adding that relocating to the New York City has been “the biggest mistake of his life.”\n\nYikes.\n\nThere's even word the 42-year-old has become a recluse, despite being invited to some of the most exclusive parties in town.\n\n“He hasn’t embraced the city and hasn’t been going out to the restaurants or parties,” the insider continues.\n\n“He’s invited to almost every event every night and doesn’t go!”\n\nLiving in New York City would be a dream for most, but Ryan has been known as someone who likes the sunny weather of Los Angeles.\n\n“He’s such an LA guy and is finding NYC tough. The weather and the hustle of the city is too much.”\n\nProbably making matters worse is that the ratings are actually down 25 percent vs. last year for the show. Ryan will likely be feeling that he's party responsible for that.\n\nNetwork execs don't like when ratings are down and generally try to get rid of the problem quickly. With Kelly as a long-standing host, it would make sense to keep her around.\n\nRyan, however, is likely expendable.\n\nKelly has been known in the past to not get along with her co-hosts, and if recent reports to be believed, she is not getting along with Ryan.\n\nAnother thing probably irks Ryan is that ABC is rebooting American Idol and he's very busy with Live. Word on the street is that he has been offered over $10 million for his hosting duties.\n\nSeems like a decent salary, right?\n\nWell, Katy Perry has been confirmed as the first judge and is getting $25 million for her services. That's a huge pay gap and considering Ryan has been on the show since 2002.\n\nSo, it seems like things are not working out for Ryan right now.\n\nWhat will he do? Will he stick it out in New York, or return to his roots in Los Angeles?\n\nSound off below!", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MrpOV8jg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497005230/kelly-ripa-and-ryan-seacrest.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MrpOV8jg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497005230/kelly-ripa-and-ryan-seacrest.png", "keywords": [], "authors": [], "canonical_link": "https://www.thehollywoodgossip.com/2017/06/ryan-seacrest-miserable-as-kelly-ripas-co-host/", "title": "Ryan Seacrest: Miserable as Kelly Ripa’s Co-Host!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/06/ryan-seacrest-miserable-as-kelly-ripas-co-host/", "title": "Ryan Seacrest: Miserable as Kelly Ripa’s Co-Host!", "description": "Ryan Seacrest is not enjoying his time on Live with Kelly and Ryan. Will he last much longer on the show? We have the latest details on the matter for you!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--8IDUDZjD--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1479412081/slideshows/reality-tv-star-salaries-who-makes-the-most.png", "type": "image/png", "width": 630, "height": 539}}, "article": {"published_time": "2017-06-09T06:51:41-04:00", "modified_time": "2017-06-09T06:55:14-04:00", "tag": "TV", "author": "pauldailly"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Ryan Seacrest: Miserable as Kelly Ripa’s Co-Host!", "description": "Ryan Seacrest is not enjoying his time on Live with Kelly and Ryan. Will he last much longer on the show? We have the latest details on the matter for you!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--MrpOV8jg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1497005230/kelly-ripa-and-ryan-seacrest.png"}}, "description": "Ryan Seacrest is not enjoying his time on Live with Kelly and Ryan. Will he last much longer on the show? We have the latest details on..."}, "movies": [], "publish_date": 1497005501.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}