{"url": "https://www.bustle.com/articles/160331-15-amazing-lightweight-foundation-alternatives-for-a-breezy-summer-season-photos", "text": "For years, I used nothing but heavy foundations every day in an attempt to hide my acne and redness. However, I recently saw the light during a shopping trip to Sephora, where I tried on a lightweight foundation alternative that I fell in love with. I enjoyed how effortless it was and instantly noticed a difference in how much my skin was able to breathe. Ever since, I've added lightweight foundations and foundation alternatives into my makeup arsenal to wear on days when I want to give my skin some R&R, or just want to create a more natural look.\n\nI would highly suggest trying out products like these for yourself, especially because so many of them are multi-taskers, delivering SPF, primer, highlighter, and ingredients that will help to improve your skin along the way. They can also help you save time in the morning when you're in a rush to get to work or don't want to carry a suitcase of 100 products around while traveling. I understand if you're a skeptic, since I was too for a while. But I think you'll be pleasantly surprised if you keep an open mind and give one of these fabulous products a chance.\n\nWith that in mind, let's get into 15 of the best lightweight foundation alternatives out there, just in time for summer.\n\nbareMinerals Prime Time BB Primer-Cream Daily Defense Broad Spectrum SPF 30, $29, Amazon\n\nI have to admit that I'm pretty skeptical about most primers. I mean, what do they actually do? This product completely changed my mind, though, since the fact that it's also a BB cream gave me a wonderful base to work with. In fact, I often use this alone without foundation, since it delivers a beautiful, even complexion. It's also extremely lightweight, making it easy to apply and delivering a simple, natural look.\n\nTarte BB Tinted Treatment 12-Hour Primer Broad Spectrum SPF Sunscreen, $48, Amazon\n\nTarte is one of my favorite brands that delivers quality product and is also environmentally conscious, so I can't recommend this BB cream enough. This product also doubles as a primer, so that means more bang for you buck — never a bad thing.\n\nPerricone MD No Foundation Foundation Serum, $60, Amazon\n\nThis serum is unique in that it acts and behaves as a foundation would, evening your complexion without actually being a foundation. This serum makes a smooth canvas of your skin, reducing the appearance of discoloration, pores, and fine lines. It also comes in one shade that works for all skin tones, making selecting the right color for your complexion a non-essential.\n\nLaura Mercier Illuminating Tinted Moisturizer SPF 20, $44, Amazon\n\nLaura Mercier is known for making bomb tinted moisturizers, so a product from this line is a natural fit for this list. This tinted moisturizer is unique in that it also acts as a highlighter with its illuminating ingredients. It is an extremely lightweight formula, so just beware that it's not going to provide the coverage of a foundation.\n\nAveeno Positively Radiant CC Cream Tinted Moisturizer SPF 30, $23, Amazon\n\nThis CC cream pulls out all of the stops, as it is not only a color corrector that will help your redness or dark spots disappear, but also includes a formula that is meant for illumination and hydration.\n\nHonest Beauty Everything Tinted Moisturizer SPF 20, $28, Ulta\n\nJessica Alba's beauty line includes this fabulous tinted moisturizer that offers the coverage of a lightweight foundation, but also includes ingredients that are full of antioxidants, like grape seed oil, orange flower water, aloe vera, and olive oil.\n\nUrban Decay Naked Skin One and Done Hybrid Complexion Perfector SPF 20, $64, Amazon\n\nThis product is unique in that it blurs skin imperfections, provides foundation-like coverage, and actually improves the firmness of your visage. Beauty.com reported that a clinical study of this perfector found that those who used the product had a \"significant\" improvement in skin radiance and firmness for up to 12 weeks after use, as well as smaller-looking pores for up to eight weeks after use.\n\nLA Girl Pro BB Cream, $5, Amazon\n\nThis BB cream is paraben-free, cruelty-free, and fragrance-free. Not only that, but it's packed with good-for-your skin Vitamins E, B3, and C. It's a multi-tasking product, since it acts as a primer, BB cream, and highlighter to properly illuminate and prep the skin for makeup. Plus, you can't beat the price.\n\nWant more beauty tips? Check out the playlist below, and be sure to subscribe to Bustle's YouTube page for more hacks and tricks!\n\nNeutrogena Healthy Skin Enhancer Tinted Moisturizer, $11, Amazon\n\nA Retinol treatment combined with a tinted moisturizer? That's exactly what you'll get with this Neutrogena Skin Enhancer, which works to not only prevent your skin from signs of aging, but also gives you great coverage and moisture. It's like skincare and makeup wrapped up into one.\n\nBareMinerals Skin Rev-er Upper, $30, Amazon\n\nThis lightweight formula applies like a lightweight foundation, but is also packed with tons of vitamins and healthy ingredients like salicylic acid and botanicals. This is perfect if you want to use a product that is simple yet powerful.\n\nSephora Collection Bright Future Color Correctors, $35, Amazon\n\nIf you haven't gotten in on the color correcting trend yet, these simple formulas by Sephora should be perfect for anyone, from a beginner to a pro. You can simply apply the correct \"canceling out\" shade and blend to stop the appearance of discoloration instead of wearing a foundation.\n\nPhysicians Formula Organic Wear Moisturizer, Light to Natural, $10, Amazon\n\nThis moisturizer not only comes in a variety of colors in order to provide a nice, lightweight base for your makeup, but is also fortified with organic water and other natural ingredients in order to be kind to the earth as well as your skin. In fact, this moisturizer is cruelty-free, absent of synthetic fragrances and colors, GMOs, and parabens, and 80 percent of the ingredients are from organic farming practices.\n\nThe Body Shop BB Cream Tea Tree, $18, Amazon\n\nIf you are prone to breakouts, this is the BB cream for you. This product from the Body Shop is formulated with tea tree oil, which is known to help heal and prevent acne.\n\nStila Sheer Color Moisturizer SPF 20, $34, Stila\n\nI'm a huge fan of stila products and this moisturizer is no exception. It's not only pigmented to give you a nice, even complexion, but has ingredients like ginger root extract, ginkgo biloba leaf extract, and chamomile in it to deliver antioxidants to your skin.\n\nTanTowel On The Glow Tinted Self-Tanning Face Moisturizer, $10, Amazon\n\nWe've all probably used self-tanner for our bodies, but what about our faces? This clever product helps deliver a summer glow to your visage while also providing moisture that you can utilize in place of any foundation for a natural-looking, Bahama-worthy complexion.\n\nPaula's Choice Resist Super-Light Wrinkle Defense SPF 30, $33, Amazon\n\nThis moisturizer with SPF delivers a hefty dose of skincare while protecting your face from the sun's rays. The best part? You can buy a sample size of the product for just $1.\n\nEveryone knows that wearing heavy foundation in the height of summer is a recipe for disaster. This year, opt for something lightweight. It'll make your life way easier.\n\nImages: Erin McKelle Fischer (1); Courtesy Brands (15)", "images": ["https://imgix.bustle.com/lovelace/uploads/643/5a0a4040-fc07-0133-f1af-0aacbc4f5d01.JPG?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/91a16e20-fc13-0133-248a-0e1b1c96d76b.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/14/6bf98f8a-948c-47ff-bc83-1cd467c3f3da.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/21bbeaa0-fc08-0133-248d-0e1b1c96d76b.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/25182cc0-f9fe-0133-e740-0a315da82319.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/4b39aab0-fc56-0133-8060-0e31b36aeb7f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/eae48d10-fba4-0133-2486-0e1b1c96d76b.jpeg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/7e209b40-fc57-0133-f1b0-0aacbc4f5d01.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/841cc7d0-fc54-0133-f1b3-0aacbc4f5d01.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/2654f780-fc57-0133-8060-0e31b36aeb7f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/e02e5c70-f9fd-0133-e737-0a315da82319.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/lovelace/uploads/643/1f23a400-fc55-0133-805b-0e31b36aeb7f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/lovelace/uploads/643/99732f10-fc53-0133-e739-0a315da82319.jpeg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/651a04f0-fc58-0133-f1af-0aacbc4f5d01.JPG?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/7aaed9a0-fc07-0133-8060-0e31b36aeb7f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/643/b77dbbf0-fc52-0133-8057-0e31b36aeb7f.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/14/6bf98f8a-948c-47ff-bc83-1cd467c3f3da.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/lovelace/uploads/643/8d2927a0-fba4-0133-2488-0e1b1c96d76b.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/14/6bf98f8a-948c-47ff-bc83-1cd467c3f3da.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/160331-15-amazing-lightweight-foundation-alternatives-for-a-breezy-summer-season-photos", "title": "15 Amazing Lightweight Foundation Alternatives For A Breezy Summer Season — PHOTOS", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/160331-15-amazing-lightweight-foundation-alternatives-for-a-breezy-summer-season-photos", "type": "article", "title": "The 15 Best Foundation Alternatives For Spring", "description": "For years, I used nothing but heavy foundations every day in an attempt to hide my acne and redness. However, I recently saw the light during a shopping trip to Sephora, where I tried on a lightweight foundation alternative that I fell in love with.…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/14/6bf98f8a-948c-47ff-bc83-1cd467c3f3da.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "For years, I used nothing but heavy foundations every day in an attempt to hide my acne and redness. However, I recently saw the light during a shopping trip to Sephora, where I tried on a lightweight foundation alternative that I fell in love with.…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}