{"url": "www.inquisitr.com/4800809/brad-pitt-dating-stars-family-urging-to-get-back-with-jen-aniston-says-radar-jen-not-reigniting-romance/", "text": "The latest celebrity romance news has all been focused on the most recent Hollywood marriage to meet its demise – that being the marriage of Jennifer Aniston and Justin Theroux. Ahead of the latest high-profile breakup, all eyes remained on Aniston’s ex, Brad Pitt, and his ongoing divorce battle with estranged wife Angelina Jolie.\n\nUntil a joint statement was released by Jen and Justin last week, there were rumors swirling that the two were on the rocks and that Aniston was finding comfort in Brad Pitt, so now the rumors are rampant that the former couple is looking to rekindle things.\n\nBrad Pitt’s mother has even been dragged into the latest claims involving the Allied star’s dating life and the potential of a romantic reconciliation between him and Jen. Radar Online shares words of a source who indicates that Pitt’s mom is reportedly hopeful that he and Aniston will get back together.\n\nThe source insists that Jane Pitt, Brad’s mother, is overjoyed that he and Jen are back in touch since the Friends star’s split from Justin Theroux. The publication notes the words of the supposed source, who states, “This is what she’s dreamed of for over a decade — she never lost faith and has stayed in touch with Jen for years.”\n\nThe insider also reveals that Jane and Jen have maintained a good relationship, and write old-school letters to one another monthly. Additionally, the two reportedly talk on the phone regularly and have never missed a birthday or anniversary.\n\n“Aniston and Jane”are both pretty old school and write long letters to each other a couple of times a month.’ Plus, they talk on the phone regularly and never miss a birthday or anniversary,” relays the source via Radar.\n\nEXCLUSIVE: Brad Pitt gives ex-wife Jennifer Aniston a shoulder to cry on amidst Justin Theroux split! https://t.co/SrLJUpgx8D pic.twitter.com/LWFObLk8zw — In Touch Weekly (@intouchweekly) February 16, 2018\n\nA second source has shared how Pitt’s whole Missouri-based family is eager for a reunion between Jen and the heartthrob.\n\n“Jane and the whole Missouri-based Pitt family haven’t been disrespectful about Jen and Justin’s marriage, but once it became apparent things wouldn’t work out they actively pushed Brad to get back in touch” dishes the snitch. “\n\nHowever, it seems that Aniston is not ready to rekindle things with Pitt and that this has never been her own intention by keeping in touch with Brad and his family. Us Weekly notes that Aniston is reportedly not considering getting back together with Pitt since her split from Theroux.\n\nFeatured image credit: Christopher Polk Getty Images\n\nA Jen Aniston source spoke exclusively with the publication, stating “Jen wouldn’t consider being with Brad in a romantic way. But there is always a spot in her heart for him.”", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Brad-and-Jen-Fans-in-a-Frenzy-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Jen-Aniston-Health-Regrets-2.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/4800809/brad-pitt-dating-stars-family-urging-to-get-back-with-jen-aniston-says-radar-jen-not-reigniting-romance/", "title": "Brad Pitt Dating: Star’s Family Urging To Get Back With Jen Aniston Says ‘Radar,’ Jen Not Reigniting Romance", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}