{"url": "http://time.com/5124851/winter-olympics-opening-ceremony-2018-time/", "text": "The 2018 Winter Olympics in PyeongChang, South Korea officially kicked off on Friday, Feb. 9 with a highly-anticipated opening ceremony.\n\nThe Olympics opening ceremony, which had a theme of peace, featured K-pop (several countries marched out to BTS, and Team USA marched out to “Gangnam Style“), heated patriotic uniforms and some very cold temperatures.\n\nDays before the event, organizers were working to stop a norovirus outbreak from spreading, ensure spectators and performers were equipped to endure freezing temperatures, and avoid exacerbating tensions among world leaders in attendance, including U.S. Vice President Mike Pence and the sister of North Korean leader Kim Jong Un.\n\nHere are the key details to know about the Olympics opening ceremony:\n\nWhat time did the 2018 Olympics opening ceremony start?\n\nThe Olympics opening ceremony took place in PyeongChang on Feb. 9, beginning at 8 p.m. local time (6 a.m. EST).\n\nThe official Winter Olympic Games schedule began Thursday, with curling and ski jumping events starting on Feb. 8.\n\nHow can I watch the Olympics opening ceremony?\n\nEarly-bird Olympic enthusiasts in the United States were able to watch the opening ceremony live beginning at 6 a.m. EST on NBCOlympics.com and the NBC Sports app, which is available on streaming devices, including Roku, Amazon Fire and Apple TV. Later on Friday at 8 p.m. EST, NBC will air a “fully-produced” television broadcast of the opening ceremony, featuring interviews and commentary by hosts Katie Couric and Mike Tirico.\n\nWhere was the opening ceremony held?\n\nThe Olympics opening ceremony took place in the new PyeongChang Olympic Stadium, which seats 35,000 people. The venue will be used just four times — for the opening and closing ceremonies of the 2018 Olympics and Paralympics — before being torn down. Construction of the stadium was part of the roughly $13 billion that South Korea is spending on the Olympics, the Associated Press reported.\n\nBut amid severe winter weather warnings, organizers feared that the Olympic stadium, which has no roof, might make the opening ceremony too cold for spectators to endure. Temperatures in PyeongChang this month have been falling to -4 degrees Fahrenheit at night, Reuters reported.\n\nThe forecast prompted organizers to work on measures to prevent cases of hypothermia and prepare for no-shows. Spectators were given hot packs, seat warmers, blankets, hats and windbreakers to keep warm. But temperatures at the opening ceremony were warmer than expected at 28 degrees Fahrenheit, and some athletes appeared unfazed.\n\nWhat happened at the Olympics opening ceremony?\n\nAs in every Olympics opening ceremony since 1908, athletes marched into the stadium under their country’s flag during the Parade of Nations. Olympic athletes from North and South Korea marched together under a single flag — a historic diplomatic decision that caused some controversy.\n\nEven before North and South Korea agreed to unite, organizers had planned for the Olympics opening ceremony to have a theme of peace. Korean musicians performed John Lennon’s “Imagine,” surrounded by lights in the shape of a dove.\n\n“We have worked on all of our scenarios under the theme of peace,” Song Seung-whan, the executive creative director for the opening ceremony, said at a press conference in January, according to Reuters. “Although North Korea’s participation was decided belatedly, we think this will serve as a good opportunity for us to convey our message more clearly.”\n\nMore than a thousand drones lit up the sky in the shape of the Olympics rings, above a show that featured 1,300 performers and 700 volunteers at one point, the New York Times reported. South Korean figure skater Yuna Kim lit the Olympic cauldron after performing a short skating routine.\n\nPita Taufatofua — the oiled-up Tongan flag-bearer who became a social media sensation during the opening ceremony of the 2016 Rio Olympics — is competing in PyeongChang as a cross-country skier. He carried his country’s flag at Friday’s opening ceremony, stealing the show once again with the same shirtless uniform despite freezing temperatures.\n\nTeam USA weathered those bitter temperatures by wearing heated parkas as they paraded into the Olympic stadium. The uniforms, which feature American flags made of heat-conductive ink, were designed by Polo Ralph Lauren, the official outfitter for the 2018 U.S. Olympic and Paralympic teams.\n\nWho attended the opening ceremony?\n\nThe U.S. delegation to the Olympics is led by Vice President Mike Pence, who attended the opening ceremony with his wife, Karen Pence. The delegation also includes California Rep. Ed Royce and 2002 Olympic figure skating gold medalist Sarah Hughes. Joining them are Gen. Vincent Brooks, who commands the United Nations Command and U.S. Forces Korea; his predecessor, Gen. James Thurman; and Marc Knapper, a diplomat currently leading the U.S. embassy in Seoul.\n\nEarlier in the day, Pence met with North Korean defectors and Fred Warmbier — the father of Otto Warmbier, an American college student who died last year after being imprisoned in North Korea. Fred Warmbier had also been scheduled to attend the opening ceremony as Pence’s guest, the Washington Post reported. The Warmbiers attended this year’s State of the Union address by President Trump, who pointed to them as “powerful witnesses to a menace that threatens our world.”\n\nKim Jong Un sent his younger sister, Kim Yo Jong, to the opening ceremony as part of the North Korean delegation, which is led by Kim Yong Nam, president of North Korea’s parliament. The unprecedented visit marked the first time an immediate member of the Kim family has been to South Korea. It’s not clear if any of the North Korean representatives will meet Pence or other U.S. officials at the Olympics, though they were seated near each other at the opening ceremony. “We’ll have to see what happens,” U.S. Secretary of State Rex Tillerson said when asked about it on Monday, according to Reuters.\n\nMeanwhile, President Trump and Kim Jong Un were represented at the opening ceremony by two impersonators in the stands, who caused a stir and were asked to leave.\n\nImpersonators of Donald Trump and Kim Jong Un pose during the Opening Ceremony of the PyeongChang 2018 Winter Olympic Games at PyeongChang Olympic Stadium on Feb. 9, 2018. Ryan Pierse/Getty Images\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Katie Reilly at Katie.Reilly@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/02/olympic-opening-ceremony-2018.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/02/wont-see-opening-ceremony-olympics-2018.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/02/lauryn-williams-olympics-sprint.jpg?quality=85&w=589", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/02/trump-kim-jong-un-impersonators.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/02/olympic-opening-ceremony-2018.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Katie Reilly"], "canonical_link": "https://time.com/5124851/winter-olympics-opening-ceremony-2018-time/", "title": "Olympics Opening Ceremony 2018: Time, Place and How to Watch", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "olympics 2018,onetime", "news_keywords": "olympics opening ceremony, 2018 opening ceremony, 2018 olympics opening ceremony, winter olympics opening ceremony, opening ceremony time, opening ceremony olympics 2018, opening ceremony date, olympics 2018, winter olympics 2018 dates, when is the opening ceremony for the 2018 winter olympics", "description": "The 2018 Winter Olympics in PyeongChang, South Korea, will officially kick off with an opening ceremony on Feb. 9. Here's everything we know", "og": {"title": "What to Know About the Opening Ceremony for the 2018 Winter Olympics", "type": "article", "site_name": "Time", "url": "https://time.com/5124851/winter-olympics-opening-ceremony-2018-time/", "description": "This is when the ceremony will take place and how you can watch it", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/02/olympic-opening-ceremony-2018.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5124851/winter-olympics-opening-ceremony-2018-time/", "description": "The 2018 Winter Olympics in PyeongChang, South Korea, will officially kick off with an opening ceremony on Feb. 9. Here's everything we know", "media": "https://api.time.com/wp-content/uploads/2018/02/olympic-opening-ceremony-2018.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5124851/winter-olympics-opening-ceremony-2018-time/", "title": "What to Know About the Opening Ceremony for the 2018 Winter Olympics", "description": "This is when the ceremony will take place and how you can watch it", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/02/olympic-opening-ceremony-2018.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}