{"url": "https://variety.com/2015/tv/news/david-letterman-broke-latenight-tv-1201499877/", "text": "With his off-kilter sensibility (Stupid Pet Tricks?) and his penchant for the oddball (what other host runs across the stage in silhouette before starting a show, or strikes up a telephone relationship with a woman who works in an office across the street?), David Letterman has left everyone who enjoys latenight television in stitches. Now, he’s about to leave them in splinters.\n\nWhen Letterman signs off CBS’ “Late Show”for the last time early Thursday morning, he will deprive TV of its last direct link to Johnny Carson and an era when just one, then two, hosts could dominate the period. The arrivals of Jimmy Kimmel at ABC, then Jimmy Fallon at NBC, and, soon, Stephen Colbert at CBS have given rise to talk of a third generation of late-night talent (if Carson, not Jack Paar or Steve Allen, is to be seen as the root of this particular tree). A fourth and a fifth are already starting to grow.\n\nCarson was the undisputed king of latenight, and Leno and Letterman merely viceroys over large populaces. These days, the land has no ruler. Simply put, by jumping to CBS from NBC after being passed over for the Carson job on “Tonight” – and tweaking the antics from “Late Night” for a broader audience at 11:30 p.m. – Letterman signaled the TV business that anyone could make a go of it around midnight.\n\nAnyone has. Thanks to Letterman, the post-local news slot is no longer the main beachhead at evening’s end. He (along with Tom Snyder) proved a younger crowd would tune in for non-traditional antics in the early hours of the morning. And so we have not only Seth Meyers hanging out in Letterman’s old roost, but James Corden stirring things up with a new “Late Late Show” on CBS that has the vibe of a raucous house party. Meantime, ABC’s “Nightline” has tried transforming itself into a “you-are-there” magazine program with decent results.\n\nBut that’s not all. Since Letterman proved that one could make a viable grab for less than the whole audience and still make a go of it, dozens of others have tried and continue to do so. Time Warner has backed Conan O’Brien since he separated from NBC over the direction of “Tonight.” Comedy Central has fared extremely well by launching “The Daily Show,” “The Colbert Report” and “@midnight,” though its success will continue to be tested by transition and Jon Stewart’s departure in weeks to come. And all of that doesn’t take into account the many hopefuls who have wrestled their own large or small piece of the end-of-day crowd over the years: Chelsea Handler; Joan Rivers; Pat Sajak; Chevy Chase; Arsenio Hall; Joan Rivers; Phil Cowan and Paul Robin of Fox’s “The Wilton-North Report”; Craig Kilborn; Craig Ferguson; Pete Holmes; and George Lopez.\n\nThe field will only widen, and ratings will dwindle as audiences disperse. Consider the fact that 42 million people tuned in to see Carson’s final turn on “Tonight” in 1992 and just 14.6 million watched Jay Leno’s second adieu to the program in 2014.\n\nThere is still a lot to be said about late-night tradition, which is why CBS is placing so much importance on Stephen Colbert’s debut in September. Many TV networks clearly see opportunity in programs that speak to interesting niches. National Geographic Channel has already lined up astrophysicist Neil deGrasse Tyson for a second season of a weekly run of his “Star Talk” podcast and radio show, which examines the ways in which science mixes with popular culture. CMT is readying a June 11th launch for “The Josh Wolf Show,” which will examine country-music celebrities from Wednesday to Saturday. MTV is preparing two late-night concepts: “Girl Code Live,” which features three female comediennes mixing sketch comedy and celebrity chatter, and “Middle of the Night Show,” which will force an unsuspecting celebrity to host a late-night program on the spot from his or her home.\n\nWith all of these bespoke efforts in the pipeline, it’s tempting to think the big, broad mainstays of the past are falling out of fashion. Not so.\n\nFallon and Kimmel have revitalized the format by trotting out clever stunts tailor-made for a younger audience that would rather stream the best bits at their leisure (what that dynamic says about the future of candid moments with celebrities is uncertain, though it was heartening recently to see Nicole Kidman confess to a crush on Jimmy Fallon at an earlier time and Fallon acknowledge he had missed her signals during a failed date). Conan O’Brien is also pushing into new frontiers, readying a series of road trips that will feature him mixing it up with interesting people in sundry locales, much as he did during a recent sojourn to Cuba. Chelsea Handler’s coming format experiment on Netflix, which she has said will play like a hipper, faster version of “60 Minutes,” will likely draw interest, just like the investigative humor John Oliver has burnished on HBO’s “Last Week Tonight.” And Time Warner’s TBS could get into the game in a big way when it launches a new program featuring former “Daily Show” contributor Samantha Bee.\n\nNone of it would be possible without David Letterman, who bravely left a sure thing – at one moment his “Late Night” was the coolest thing on TV – for an uncertain one, and pulled it off. Leno won more viewers, but Letterman proved the distinction was in some ways negligible. Now, as TV viewing continues to fragment, advertisers say they are placing more emphasis on audiences that demonstrate true passion, not necessarily the shows that always draw the biggest crowds.\n\nLetterman might have thrived if he continued (particularly if he proved able to maintain the new energy he has mustered in his current program’s last weeks). He has won notice for the most candid chatter in the time slot and is seen by many as the leading voice in bringing the nation back from tragedy after the terrorist attacks of Sept. 11, 2001.\n\nIn today’s TV-viewing environment, there is no more King of Late Night – at least not in the way Johnny Carson was. “I think Johnny Carson was the last King of Late Night,” Jimmy Kimmel told Advertising Age in 2013 just before moving his program to 11:35 p.m. on ABC. “I hope to have a narrow edge on everyone else. That’s really all you can hope for.”\n\nOn May 20th, David Letterman won’t have to bring the house down. He did that in 1993 when he started up with CBS.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2014/04/david-letterman.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2015%2Ftv%2Fnews%2Fdavid-letterman-broke-latenight-tv-1201499877%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1201499877&comment_count=12", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2014/04/david-letterman.jpg?w=1000", "keywords": [], "authors": ["Brian Steinberg"], "canonical_link": "https://variety.com/2015/tv/news/david-letterman-broke-latenight-tv-1201499877/", "title": "How David Letterman Broke Latenight TV", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "David Letterman's final \"Late Show\" episode airs May 20. Here's how the CBS host broke the latenight mold.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1201499877, "author": "Brian Steinberg", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2015-05-18T15:30:04"}, "pmc-tag": "David Letterman,Jimmy Fallon,Late Show", "title": "How David Letterman Broke Latenight TV", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "How David Letterman Broke Latenight TV", "url": "https://variety.com/2015/tv/news/david-letterman-broke-latenight-tv-1201499877/", "description": "With his off-kilter sensibility (Stupid Pet Tricks?) and his penchant for the oddball (what other host runs across the stage in silhouette before starting a show, or strikes up a telephone relation…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2014/04/david-letterman.jpg?w=1000", "width": 1000, "height": 562, "alt": "David Letterman Retirement"}, "locale": "en_US"}, "article": {"published_time": "2015-05-18T22:30:04+00:00", "modified_time": "2015-05-18T23:44:24+00:00"}, "twitter": {"creator": "@https://twitter.com/bristei", "site": "@variety", "text": {"title": "How David Letterman Broke Latenight TV"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2014/04/david-letterman.jpg?w=1000", "alt": "David Letterman Retirement"}, "card": "summary_large_image", "title": "How David Letterman Broke Latenight TV", "description": "David Letterman's final \"Late Show\" episode airs May 20. Here's how the CBS host broke the latenight mold."}, "author": "Brian Steinberg", "content_type": "Article", "post_id": 1201499877, "title": "How David Letterman Broke Latenight TV", "published_at": "2015-05-18 15:30:04", "image": "https://pmcvariety.files.wordpress.com/2014/04/david-letterman.jpg?w=1000", "comment_count": 12, "tags": "Late Show", "topics": "News", "appeared_in_print": "No", "body": "With his off-kilter sensibility (Stupid Pet Tricks?) and his penchant for the oddball (what other host runs across the stage in silhouette before starting a show, or strikes up a telephone relationship with a woman who works in an office across the street?), David Letterman has left everyone who enjoys latenight television in stitches. Now, he’s about to leave them in splinters.\r\n\r\nWhen Letterman signs off CBS’ “Late Show”for the last time early Thursday morning, he will deprive TV of its last direct link to Johnny Carson and an era when just one, then two, hosts could dominate the period. The arrivals of Jimmy Kimmel at ABC, then Jimmy Fallon at NBC, and, soon, Stephen Colbert at CBS have given rise to talk of a third generation of late-night talent (if Carson, not Jack Paar or Steve Allen, is to be seen as the root of this particular tree). A fourth and a fifth are already starting to grow.\r\n\r\n\r\n\r\nCarson was the undisputed king of latenight, and Leno and Letterman merely viceroys over large populaces. These days, the land has no ruler. Simply put, by jumping to CBS from NBC after being passed over for the Carson job on “Tonight” – and tweaking the antics from “Late Night” for a broader audience at 11:30 p.m. – Letterman signaled the TV business that anyone could make a go of it around midnight.\r\n\r\nAnyone has. Thanks to Letterman, the post-local news slot is no longer the main beachhead at evening's end. He (along with Tom Snyder) proved a younger crowd would tune in for non-traditional antics in the early hours of the morning. And so we have not only Seth Meyers hanging out in Letterman’s old roost, but James Corden stirring things up with a new “Late Late Show” on CBS that has the vibe of a raucous house party. Meantime, ABC's \"Nightline\" has tried transforming itself into a \"you-are-there\" magazine program with decent results.\r\n\r\nBut that’s not all. Since Letterman proved that one could make a viable grab for less than the whole audience and still make a go of it, dozens of others have tried and continue to do so. Time Warner has backed Conan O’Brien since he separated from NBC over the direction of “Tonight.” Comedy Central has fared extremely well by launching “The Daily Show,” “The Colbert Report” and “@midnight,” though its success will continue to be tested by transition and Jon Stewart’s departure in weeks to come. And all of that doesn't take into account the many hopefuls who have wrestled their own large or small piece of the end-of-day crowd over the years: Chelsea Handler; Joan Rivers; Pat Sajak; Chevy Chase; Arsenio Hall; Joan Rivers; Phil Cowan and Paul Robin of Fox's \"The Wilton-North Report\"; Craig Kilborn; Craig Ferguson; Pete Holmes; and George Lopez.\r\n\r\nThe field will only widen, and ratings will dwindle as audiences disperse. Consider the fact that 42 million people tuned in to see Carson's final turn on \"Tonight\" in 1992 and just 14.6 million watched Jay Leno's second adieu to the program in 2014.\r\n\r\nThere is still a lot to be said about late-night tradition, which is why CBS is placing so much importance on Stephen Colbert’s debut in September. Many TV networks clearly see opportunity in programs that speak to interesting niches. National Geographic Channel has already lined up astrophysicist Neil deGrasse Tyson for a second season of a weekly run of his “Star Talk” podcast and radio show, which examines the ways in which science mixes with popular culture. CMT is readying a June 11th launch for “The Josh Wolf Show,” which will examine country-music celebrities from Wednesday to Saturday. MTV is preparing two late-night concepts: “Girl Code Live,” which features three female comediennes mixing sketch comedy and celebrity chatter, and “Middle of the Night Show,” which will force an unsuspecting celebrity to host a late-night program on the spot from his or her home.\r\n\r\nWith all of these bespoke efforts in the pipeline, it’s tempting to think the big, broad mainstays of the past are falling out of fashion. Not so.\r\n\r\nFallon and Kimmel have revitalized the format by trotting out clever stunts tailor-made for a younger audience that would rather stream the best bits at their leisure (what that dynamic says about the future of candid moments with celebrities is uncertain, though it was heartening recently to see Nicole Kidman confess to a crush on Jimmy Fallon at an earlier time and Fallon acknowledge he had missed her signals during a failed date). Conan O’Brien is also pushing into new frontiers, readying a series of road trips that will feature him mixing it up with interesting people in sundry locales, much as he did during a recent sojourn to Cuba. Chelsea Handler’s coming format experiment on Netflix, which she has said will play like a hipper, faster version of “60 Minutes,” will likely draw interest, just like the investigative humor John Oliver has burnished on HBO’s “Last Week Tonight.” And Time Warner's TBS could get into the game in a big way when it launches a new program featuring former \"Daily Show\" contributor Samantha Bee.\r\n\r\n\r\n\r\nNone of it would be possible without David Letterman, who bravely left a sure thing – at one moment his “Late Night” was the coolest thing on TV – for an uncertain one, and pulled it off. Leno won more viewers, but Letterman proved the distinction was in some ways negligible. Now, as TV viewing continues to fragment, advertisers say they are placing more emphasis on audiences that demonstrate true passion, not necessarily the shows that always draw the biggest crowds.\r\n\r\nLetterman might have thrived if he continued (particularly if he proved able to maintain the new energy he has mustered in his current program’s last weeks). He has won notice for the most candid chatter in the time slot and is seen by many as the leading voice in bringing the nation back from tragedy after the terrorist attacks of Sept. 11, 2001.\r\n\r\nIn today’s TV-viewing environment, there is no more King of Late Night – at least not in the way Johnny Carson was. “I think Johnny Carson was the last King of Late Night,” Jimmy Kimmel told Advertising Age in 2013 just before moving his program to 11:35 p.m. on ABC. “I hope to have a narrow edge on everyone else. That's really all you can hope for.”\r\n\r\nOn May 20th, David Letterman won’t have to bring the house down. He did that in 1993 when he started up with CBS.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1431988204.0, "source": "https://variety.com", "summary": ""}