{"url": "https://people.com/music/wade-robson-michael-jackson-lawsuit-dismissed/", "text": "A California judge ruled that Michael Jackson’s estate and the companies it controls are not liable for the King of Pop’s alleged childhood sexual abuse of celebrity choreographer Wade Robson.\n\nRobson first sued in 2013, claiming that Jackson abused him for nearly a decade. He later said in an amended complaint to his 2013 lawsuit that MJJ Productions, the late musician’s entertainment company, and MJJ Ventures were operations “specifically designed to locate, attract, lure and seduce child sexual abuse victims.” A probate court in 2015 rejected his claim against the estate itself, which left the two business entities as defendants.\n\nGet push notifications with news, features and more.\n\nJudge Mitchell L. Beckloff ruled on Tuesday that MJJ Productions and MJJ Ventures were not liable for Robson’s exposure to Jackson as “no one other than Michael Jackson had the legal ability or authority to control Michael Jackson.” He did not rule on the credibility of the allegations themselves.\n\n“As demonstrated by the defendants, Neverland Valley Ranch, where some of the abuse is alleged to have occurred, was owned by Michael Jackson, not either of the corporate defendants,” Beckloff said. “Similarly, Michael Jackson in his individual capacity owned the apartments where other abuse is alleged to have occurred.”\n\nBeckloff also noted that the complaint wasn’t filed within the statute of limitations.\n\n“There is no dispute plaintiff brought this action well after his 26th birthday,” said Beckloff. “Today plaintiff is 35 years old, he was 30 years old when he filed this action four years too late, and his action is barred by the statute of limitations.”\n\nAttorney for Jackson’s estate, Howard Weitzman, hailed the ruling in a statement: “The Estate of Michael Jackson believes the court made the correct decision in dismissing Wade Robson’s claim against it. In my opinion Mr. Robson’s allegations, made 20 plus years after they supposedly occurred and years after Mr. Robson testified twice under oath — including in front of a jury — that Michael Jackson had never done anything wrong to him were always about the money rather than a search for the truth.”\n\nRELATED VIDEO: Choreographer Wade Robson Claims Michael Jackson Ran the ‘Most Sophisticated Child Sexual Abuse’ Operation in History in New Complaint\n\nRobson said he first met Jackson when he was 5 years old after winning a competition run by MJJ Productions in his native Australia. Two years later, his family was invited to stay at the King of Pop’s Neverland Ranch home in California, where he slept in Jackson’s bed and said he was first sexually abused by him.\n\nThe choreographer claimed the abuse continued for seven years and ended only when he “began showing signs of puberty” and Jackson was “no longer as interested in him sexually.”\n\nRobson had previously appeared as a witness for Jackson’s defense during a separate sexual abuse trial in 2005 in which the pop star was acquitted of child molestation charges.\n\nRobson did not immediately return request for comment on the ruling.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1584&h=829&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fmichael-jackson1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1584&h=829&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fmichael-jackson1.jpg", "keywords": [], "authors": ["Brianne Tracy"], "canonical_link": "https://people.com/music/wade-robson-michael-jackson-lawsuit-dismissed/", "title": "Judge Dismisses Michael Jackson Sexual Abuse Lawsuit", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Crime News,Michael Jackson,Music News,News", "news_keywords": "Crime News,Michael Jackson,Music News,News", "description": "Jackson's estate and its business entities are not liable for the King of Pop's alleged childhood sexual abuse of the choreographer", "og": {"title": "Judge Dismisses Michael Jackson Sexual Abuse Lawsuit", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/wade-robson-michael-jackson-lawsuit-dismissed/", "description": "A California judge ruled that Michael Jackson’s&nbsp;estate and the companies it controls are not liable for the King of Pop’s alleged childhood sexual abuse of&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1584&h=829&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fmichael-jackson1.jpg", "width": 1584, "height": 829}}, "pinterest": {"url": "https://people.com/music/wade-robson-michael-jackson-lawsuit-dismissed/", "description": "Jackson's estate and its business entities are not liable for the King of Pop's alleged childhood sexual abuse of the choreographer", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fmichael-jackson1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/wade-robson-michael-jackson-lawsuit-dismissed/", "title": "Judge Dismisses Michael Jackson Sexual Abuse Lawsuit", "description": "Jackson's estate and its business entities are not liable for the King of Pop's alleged childhood sexual abuse of the choreographer", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1584&h=829&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F01%2Fmichael-jackson1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}