{"url": "https://variety.com/2018/film/news/eliza-dushku-molested-stunt-coordinator-joel-kramer-1202663967/", "text": "Eliza Dushku has accused stunt coordinator Joel Kramer of molesting her when she was 12 years old. Kramer has denied the allegations.\n\nHer account, posted early Saturday morning, comes in the wake of the continuing #metoo movement and the launch of the Time’s Up campaign to combat sexual harassment and assault.\n\nIn a Facebook post, Dushku wrote that she was assaulted while working with Kramer on the 1994 James Cameron film “True Lies.” According to her post, Kramer molested her in a Miami hotel room, where he “laid me down on the bed, wrapped me with his gigantic writhing body, and rubbed all over me.” Kramer would have been 36 at the time.\n\nDushku alleges that he “methodically built my and my parents’ trust, for months grooming me,” and told her parent that he would take her for a swim in the hotel’s pool. Instead, her took her to his hotel room, where he “disappeared in the bathroom and emerged, naked, bearing nothing but a small hand towel held flimsy at his mid-section.”\n\nKramer told Variety Saturday morning that Dushku’s allegations were “absolutely not true.” According to Kramer, Dushku swam in the hotel pool with him and other members of the stunt crew, including Dushku’s stunt double. Afterwards, he took her to her first ever sushi meal, and then took her home.\n\nAfter the alleged assault, Dushku wrote, he suggested they should “be careful,” referring to talking about the incident.\n\nDushku also wrote that while in a taxi back to her hotel, Kramer held her on his lap in the backseat. According to Kramer, he drove the car to take her home.\n\nShe also implies that Kramer may have intentionally harmed her while on the set of “True Lies,” referring to it as “no small coincidence” when she was injured on-set after a “tough adult female friend” faced him about the alleged assault.\n\n“With broken ribs, I spent the evening in the hospital,” she wrote. “To be clear, over the course of those months rehearsing and filming ‘True Lies,’ it was Joel Kramer who was responsible for my safety on a film that at the time broke new ground for action films.”\n\nShe also wrote that Kramer would call her “Jailbait,” and that she doesn’t understand why no adults on the set grew suspicious of the “over-the-top special attention he gave me.”\n\n“Over the years I’ve really struggled as I’ve wondered how my life might have been different if someone, any one grown-up who witnessed his sick ways, had spoken up before he lured me to that hotel room.”\n\nDushku explained that she had heard, years ago, that Kramer had been “found out” and forced to leave the business, but recently learned he was still working in the industry.\n\n“And a few weeks ago, I found an internet photo of Joel Kramer hugging a young girl,” she wrote. “That image has haunted me near nonstop since. I can no longer hide what happened.”\n\nShe expressed gratitude for the support of her fans, and wrote that she hopes her speaking out will help other victims of sexual assault.\n\nKramer stated that he was “taken aback” and “floored” by the allegations, and that he “never molested her” and was “never nude in front of her.”\n\n“This whole talk of luring her to my room, on top of her, getting off, holding her in the car and calling her jailbait is just outright hyperbole and lies,” he said.\n\nKramer, who has worked on numerous high-profile films such as “Blade Runner 2049” and “Furious 7,” said he had no explanation for the allegations, but stated that he thought she may have had a crush on him at the time. According to Kramer, another person working on the set had told him that Dushku was “always asking questions” about him, which caused him to feel he had to “handle her with kid gloves.”\n\n“I did kiss her on the cheek once to say goodnight to her, gave her a hug,” he said. “We treated her like family, she was part of our crew.”\n\nHe referred to the allegations as “absurd,” asserting that it would have made no sense for him to act in the manner he accused her of. “Who in their right mind would do something like that, when you’re a high-profile coordinator on a shoot like that with months left of shooting?”\n\nDushku’s legal guardian on the set of “True Lies,” Sue Booth-Forbes, issued a statement supporting Dushku’s account to Deadline Hollywood.\n\n“Eliza Dushku is telling the truth,” she told the outlet. “I was on the ‘True Lies’ set for three weeks and reported Joel Kramer’s inappropriate sexual behavior towards 12-year-old Eliza to a person in authority. I was met with blank stares and had the sense that I wasn’t telling that person anything they didn’t already know.”", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Feliza-dushku-molested-stunt-coordinator-joel-kramer-1202663967%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202663967&comment_count=75", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2018/01/eliza-dushku.jpg?w=1024", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/01/eliza-dushku.jpg?w=1024", "keywords": [], "authors": ["Erin Nyren"], "canonical_link": "https://variety.com/2018/film/news/eliza-dushku-molested-stunt-coordinator-joel-kramer-1202663967/", "title": "Eliza Dushku Says ‘True Lies’ Stunt Coordinator Sexually Assaulted Her When She Was 12", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Eliza Dushku has accused stunt coordinator Joel Kramer of molesting her when she was 12 years old. Kramer has denied the allegations.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202663967, "author": "Erin Nyren", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-13T10:36:12"}, "pmc-tag": "Eliza Dushku,sensitive", "title": "Eliza Dushku Says ‘True Lies’ Stunt Coordinator Sexually Assaulted Her When She Was 12", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Eliza Dushku Says ‘True Lies’ Stunt Coordinator Sexually Assaulted Her When She Was 12", "url": "https://variety.com/2018/film/news/eliza-dushku-molested-stunt-coordinator-joel-kramer-1202663967/", "description": "Eliza Dushku has accused stunt coordinator Joel Kramer of molesting her when she was 12 years old. Kramer has denied the allegations. Her account, posted early Saturday morning, comes in the wake o…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/eliza-dushku.jpg?w=1024", "width": 1200, "height": 675, "alt": "FILE - In this April 5, 2016 file photo, actress Eliza Dushku poses at the premiere of the film \"Be Here Now (The Andy Whitfield Story),\" at the UTA Theater in Beverly Hills, Calif. Dushku, who gained fame on \"Buffy the Vampire Slayer\" and \"Bring It On,\" says she has been sober for eight years after battling alcoholism and drug addiction. The 36-year-old detailed her battle with alcohol and drug addiction Tuesday, March 7, 2017, at the New Hampshire Youth Summit on Opioid Awareness. (Photo by Chris Pizzello/Invision/AP, File)"}, "locale": "en_US"}, "article": {"published_time": "2018-01-13T18:36:12+00:00", "modified_time": "2018-01-13T23:06:47+00:00"}, "twitter": {"creator": "@https://twitter.com/ecnyren", "site": "@variety", "text": {"title": "Eliza Dushku Says ‘True Lies’ Stunt Coordinator Sexually Assaulted Her When She Was 12"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/eliza-dushku.jpg?w=1024", "alt": "FILE - In this April 5, 2016 file photo, actress Eliza Dushku poses at the premiere of the film \"Be Here Now (The Andy Whitfield Story),\" at the UTA Theater in Beverly Hills, Calif. Dushku, who gained fame on \"Buffy the Vampire Slayer\" and \"Bring It On,\" says she has been sober for eight years after battling alcoholism and drug addiction. The 36-year-old detailed her battle with alcohol and drug addiction Tuesday, Ma…"}, "card": "summary_large_image", "title": "Eliza Dushku Says ‘True Lies’ Stunt Coordinator Sexually Assaulted Her When She Was 12", "description": "Eliza Dushku has accused stunt coordinator Joel Kramer of molesting her when she was 12 years old. Kramer has denied the allegations."}, "author": "Erin Nyren", "content_type": "Article", "post_id": 1202663967, "title": "Eliza Dushku Says 'True Lies' Stunt Coordinator Sexually Assaulted Her When She Was 12", "published_at": "2018-01-13 10:36:12", "image": "https://pmcvariety.files.wordpress.com/2018/01/eliza-dushku.jpg?w=1024", "comment_count": 75, "tags": "sensitive", "topics": "News", "appeared_in_print": "No", "body": "Eliza Dushku has accused stunt coordinator Joel Kramer of molesting her when she was 12 years old. Kramer has denied the allegations.\r\n\r\nHer account, posted early Saturday morning, comes in the wake of the continuing #metoo movement and the launch of the Time's Up campaign to combat sexual harassment and assault.\r\n\r\nIn a Facebook post, Dushku wrote that she was assaulted while working with Kramer on the 1994 James Cameron film \"True Lies.\"  According to her post, Kramer molested her in a Miami hotel room, where he \"laid me down on the bed, wrapped me with his gigantic writhing body, and rubbed all over me.\" Kramer would have been 36 at the time.\r\n\r\nDushku alleges that he \"methodically built my and my parents’ trust, for months grooming me,\" and told her parent that he would take her for a swim in the hotel's pool. Instead, her took her to his hotel room, where he \"disappeared in the bathroom and emerged, naked, bearing nothing but a small hand towel held flimsy at his mid-section.\"\r\n\r\nKramer told Variety Saturday morning that Dushku's allegations were \"absolutely not true.\" According to Kramer, Dushku swam in the hotel pool with him and other members of the stunt crew, including Dushku's stunt double. Afterwards, he took her to her first ever sushi meal, and then took her home.\r\n\r\nAfter the alleged assault, Dushku wrote, he suggested they should \"be careful,\" referring to talking about the incident.\r\n\r\nDushku also wrote that while in a taxi back to her hotel, Kramer held her on his lap in the backseat. According to Kramer, he drove the car to take her home.\r\n\r\nShe also implies that Kramer may have intentionally harmed her while on the set of \"True Lies,\" referring to it as \"no small coincidence\" when she was injured on-set after a \"tough adult female friend\" faced him about the alleged assault.\r\n\r\n\"With broken ribs, I spent the evening in the hospital,\" she wrote. \"To be clear, over the course of those months rehearsing and filming 'True Lies,' it was Joel Kramer who was responsible for my safety on a film that at the time broke new ground for action films.\"\r\n\r\nShe also wrote that Kramer would call her \"Jailbait,\" and that she doesn't understand why no adults on the set grew suspicious of the \"over-the-top special attention he gave me.\"\r\n\r\n\"Over the years I’ve really struggled as I’ve wondered how my life might have been different if someone, any one grown-up who witnessed his sick ways, had spoken up before he lured me to that hotel room.\"\r\n\r\nDushku explained that she had heard, years ago, that Kramer had been \"found out\" and forced to leave the business, but recently learned he was still working in the industry.\r\n\r\n\"And a few weeks ago, I found an internet photo of Joel Kramer hugging a young girl,\" she wrote. \"That image has haunted me near nonstop since. I can no longer hide what happened.\"\r\n\r\nShe expressed gratitude for the support of her fans, and wrote that she hopes her speaking out will help other victims of sexual assault.\r\n\r\nKramer stated that he was \"taken aback\" and \"floored\" by the allegations, and that he \"never molested her\" and was \"never nude in front of her.\"\r\n\r\n\"This whole talk of luring her to my room, on top of her, getting off, holding her in the car and calling her jailbait is just outright hyperbole and lies,\" he said.\r\n\r\nKramer, who has worked on numerous high-profile films such as \"Blade Runner 2049\" and \"Furious 7,\" said he had no explanation for the allegations, but stated that he thought she may have had a crush on him at the time. According to Kramer, another person working on the set had told him that Dushku was “always asking questions” about him, which caused him to feel he had to \"handle her with kid gloves.\"\r\n\r\n\"I did kiss her on the cheek once to say goodnight to her, gave her a hug,\" he said. \"We treated her like family, she was part of our crew.\"\r\n\r\nHe referred to the allegations as \"absurd,\" asserting that it would have made no sense for him to act in the manner he accused her of. \"Who in their right mind would do something like that, when you’re a high-profile coordinator on a shoot like that with months left of shooting?\"\r\n\r\nDushku's legal guardian on the set of \"True Lies,\" Sue Booth-Forbes, issued a statement supporting Dushku's account to Deadline Hollywood.\r\n\r\n\"Eliza Dushku is telling the truth,\" she told the outlet. \"I was on the 'True Lies' set for three weeks and reported Joel Kramer’s inappropriate sexual behavior towards 12-year-old Eliza to a person in authority. I was met with blank stares and had the sense that I wasn’t telling that person anything they didn’t already know.\"\r\n\r\nhttps://www.facebook.com/OfficialElizaDushku/posts/1769957739689557", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1515868572.0, "source": "https://variety.com", "summary": ""}