{"url": "http://toofab.com/2017/05/05/the-arrangement-josh-henderson-season-finale-season-2-e-scientology/", "text": "\"The Arrangement\" Season 1 ended with a shocker, and star Josh Henderson promises there is plenty more where that came from for Season 2.\n\n\"There is a lot of mystery left for Kyle’s character,\" he told TooFab. \"The audience thinks they know Kyle pretty well, but there’s a lot that we don’t know yet. Megan’s huge skeleton is out. As far as we know, that’s her only skeleton. Kyle definitely has a few that are super intense.\"\n\nOn the season finale, Megan Morrison (Christine Evangelista) was kidnapped and brainwashed by the Institute of the Higher Mind -- or so we thought.\n\nIn the jaw-dropping final moments, Morrison broke the facade she kept up all episode that she had actually bought into IHM's practices and confided in a friend her true intentions: \"I'm gonna burn the whole thing down.\"\n\nE! renewed the drama for a second season, and Henderson told us everything he could about what he knows so far.\n\nSo what can you tell us about these skeletons?\n\nI don’t know because we don’t have any scripts yet. I just know the secret. I don’t know how it’s going to affect everyone in this world. I think there’s a bunch, but I know one. And that’s what keeps it fun – introducing new things to the audience. At the end of the day, we never want the audience to get comfortable with these characters. We want them always wondering, guessing, figuring things out. So how it’s going to affect Megan and her relationship, how it’s going to affect Kyle’s career, we don’t know yet, and I don’t know yet. These are things that are gonna keep the show a lot of fun. The writers don’t tell us everything for a reason as well. At the end of the day, they want to keep us guessing on our characters. They want to keep us fresh and things changing. But there’s definitely gonna be some bombs dropped on Season 2 for sure.\n\nHow much say do you have in what happens to your character?\n\nWell, actually, I’m playing golf with Jonathan [Abrahams] – our writer – next week, and we’re going to talk about storylines for Season 2 and some things that we think would be fun, some things we think would be shocking. Jonathan as a writer is great because he really loves our input. That’s why you saw Kyle West skating this season. That’s why you see Kyle West playing the piano last episode. They include things we like to do. He wanted to know the weird, special skills that I have, secret talents. So those are fun little moments for the audience to go, ‘Oh, that guy can skate like that? Oh, he can dance? Oh, he can sing?’ There’s things they wouldn’t know unless they include us in to really write into the story and really make things unique. It’s fun. I actually told Jonathan – so many things happen this season that were like happening in my real life at the same time, so I go, ‘Jonathan, whatever you do, don’t kill Kyle on the show. Things keep happening to me, and I don’t want to die right now, so keep thinking positive.'\n\nAre you similar to your character in any way?\n\nWe’re both from Middle America. I’m an actor, Kyle’s an actor. They like to write in a lot of Josh Henderson stuff to Kyle West. And Kyle’s a nice guy, he really is. He cares about people, he cares about his career and he cares about the decisions that he makes as an actor. But Kyle’s the biggest film star in the world, and I’m not. He gets to fly on private jets anywhere he wants. I don’t really get to do that. Some of the things that are in his closet definitely aren’t in my closet. Kyle can’t even go to Starbucks. I can go to Starbucks, but I understand how privacy – once you make it in this business or are very recognizable – you throw your privacy out the window. I understand that with Kyle.\n\nWhat was your favorite episode of Season 1?\n\nDefinitely Episode 2 because we actually went to Venice, Italy. It was incredible. Shooting there was just like a dream come true. You can’t fake it. I had actually been. I was lucky enough to go to Venice before, but shooting there was a totally different experience.\n\nSo when can we start getting excited about Season 2?", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://toofab.akamaized.net/2017/05/05/josh-henderson-arrangement-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2017/05/05/josh-henderson-arrangement-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/05/05/the-arrangement-josh-henderson-season-finale-season-2-e-scientology/", "title": "'The Arrangement' Star Josh Henderson Teases 'Super Intense' Skeletons in the Closet for Season 2", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "'The Arrangement' Star Josh Henderson Teases 'Super Intense' Skeletons in the Closet for Season 2", "description": "\"There’s definitely gonna be some bombs dropped on Season 2,\" Josh Henderson tells TooFab  about \"The Arrangement\" following the Season 1 finale shocker.", "image": "https://toofab.akamaized.net/2017/05/05/josh-henderson-arrangement-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "keywords": "The Arrangement, Josh Henderson", "description": "\"There’s definitely gonna be some bombs dropped on Season 2,\" Josh Henderson tells TooFab  about \"The Arrangement\" following the Season 1 finale shocker.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/05/05/the-arrangement-josh-henderson-season-finale-season-2-e-scientology/", "site_name": "toofab", "type": "article", "title": "'The Arrangement' Star Josh Henderson Teases 'Super Intense' Skeletons in the Closet for Season 2", "description": "\"There’s definitely gonna be some bombs dropped on Season 2,\" Josh Henderson tells TooFab  about \"The Arrangement\" following the Season 1 finale shocker.", "image": "https://toofab.akamaized.net/2017/05/05/josh-henderson-arrangement-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1493913600.0, "source": "http://toofab.com", "summary": ""}