{"url": "https://www.economist.com/gulliver/2018/03/14/united-airlines-kills-another-pet", "text": "GULLIVER recently wrote about a pet that suffered a grizzly end after it was not permitted to fly. Spirit Airlines refused to allow a hamster on board as an emotional-support animal and it ended up being flushed down an airport toilet. But sometimes it is more dangerous for an animal to be permitted to ascend to 35,000 feet. Particularly, it seems, if it is flying on United Airlines.\n\nOn March 12th, on a flight from Houston to New York, a United Airlines flight attendant knowingly stowed a French bulldog in the overhead compartment, where it died, the family that owned the dog alleges. United quickly apologised to the family for what it called “a tragic accident that should never have occurred, as pets should never be placed in the overhead bin.” The airline promised an investigation “to prevent this from ever happening again.”\n\nBut on United, things like this seem to happen again and again. Last year, a Cavalier King Charles Spaniel died in a United plane’s cargo hold when the flight was delayed on the tarmac—also in Houston—for two hours. Most infamously, a giant rabbit called Simon travelling from London to the Iowa State Fair died on a United flight, possibly freezing to death because it was subjected to cold temperatures or placed next to dry ice. A week of headlines in British tabloids, such as “Now United’s killing fluffy bunnies!”, left its reputation in one of its most valuable foreign markets in tatters. And on March 14th, United fessed up to yet another blunder, this time flying a German Shepherd dog from Oregon to Japan instead of its intended destination, Kansas City in Missouri.\n\nIn fact, according to data from America’s Department of Transportation, United was far more dangerous to fly on as a doggy or bunny last year than any other airline. Some 18 animals perished on United flights, compared with two each on American, Delta, and Alaska, and zero on all other airlines tracked by the department. Some 13 animals were also reported injured on United flights; no other airline had more than one injury. That comes out to 2.24 incidents for every 10,000 animals transported on United. The second-worst offender, American, had 0.87 incidents per 10,000.\n\nUnited gained notoriety for its treatment of human passengers last April when a Vietnamese-American passenger, David Dao, was forcibly dragged off an overbooked flight in Chicago. The company’s initial response was possibly the worst bit of crisis-PR in history. As videos of the bloodied man quickly went viral, Oscar Munoz, the carrier’s boss, woodenly apologised for having to “re-accommodate” customers and blamed the flyer for not co-operating. After a passenger backlash the company quickly changed its policy and sought to make amends. Yet some aviation analysts reckon that the death of Simon the bunny did much more damage to United’s reputation in Britain than the manhandling of Dr Dao did in America. What is clear is that its brand will continue to suffer if it does not start treating its animal passengers, as well as it human ones, better.", "images": ["https://www.economist.com/sites/default/files/20191019_BLP504.jpg", "https://www.economist.com/sites/default/files/20190817_blp902_apple_news.jpg", "https://www.economist.com/sites/default/files/20190817_BLP502.jpg", "https://www.economist.com/sites/default/files/20180317_BLP509.jpg", "https://www.economist.com/static/illustration/newsletter-signup.svg"], "top_img": "https://www.economist.com/sites/default/files/20180317_BLP509.jpg", "keywords": [], "authors": ["A.W.", "Washington"], "canonical_link": "https://www.economist.com/gulliver/2018/03/14/united-airlines-kills-another-pet", "title": "It’s a dog’s life - United Airlines kills another pet", "meta_data": {"viewport": "width=device-width", "theme-color": "#E3120B", "msapplication-TileColor": "#E3120B", "msapplication-TileImage": "/static/ico/tile-144.png", "application-name": "The Economist", "msapplication-tooltip": "The Economist", "description": "Last year the carrier killed nine times as many animals as American and Delta", "og": {"site_name": "The Economist", "title": "United Airlines kills another pet", "type": "Article", "url": "https://www.economist.com/gulliver/2018/03/14/united-airlines-kills-another-pet", "description": "Last year the carrier killed nine times as many animals as American and Delta", "image": "https://www.economist.com/sites/default/files/20180317_BLP509.jpg"}, "twitter": {"site": "@TheEconomist", "description": "Last year the carrier killed nine times as many animals as American and Delta", "card": "summary_large_image", "image": "https://www.economist.com/sites/default/files/20180317_BLP509.jpg"}, "fb": {"app_id": 193926687345108, "pages": "6013004059,1487031108050752"}, "next-head-count": 21}, "movies": [], "publish_date": 1520956800.0, "source": "https://www.economist.com", "summary": ""}