{"url": "ew.com/article/2016/07/29/crazy-stupid-love-ryan-gosling-emma-stone-chemistry/", "text": "Image zoom Ben Glass/ Warner Bros.\n\nCrazy, Stupid, Love. type Movie genre Romantic Comedy,\n\nRomance\n\nCrazy, Stupid, Love. tells the story of a middle-aged husband, Cal (Steve Carell), who turns to a 30-something ladies’ man, Jacob (Ryan Gosling), for help hitting on girls at bars after his wife, Emily (Julianne Moore), asks for a divorce. Cal and Emily’s relationship is at the center of the film, but so, too, is that of Jacob and Hannah (Emma Stone), who just so happens to be Cal and Emily’s daughter.\n\nHannah pulls Jacob away from his womanizing ways and into monogamy, and together they are absolutely adorable. Credit that to the insane, amazing chemistry of Gosling and Stone, a dynamic duo that continues to captivate filmmakers and audiences alike. Following Crazy, Stupid, Love., which was directed by Glenn Ficarra and John Requa, the pair were brought back together for 2013’s Gangster Squad; later this year, they’ll appear as the romantic leads in La La Land.\n\nFive years after Crazy, Stupid, Love.’s release, Ficarra tells EW what he remembers about casting Gosling and Stone, what made each right for their roles, why he thinks they continue to be cast together, and more. (You know we had to ask about the play on Dirty Dancing, and the heart-melting dialog-heavy scene that followed.) Read on for how Gosling and Stone came to be our favorite rom-com couple, and much more.\n\nENTERTAINMENT WEEKLY: Looking back on auditions, what was it about Ryan and Emma together that worked so well for you?\n\nGLENN FICARRA: It was very evident very early. We had narrowed down to a few incredibly talented candidates for Emma’s part. They all read with Ryan, [who] was off screen, and I think in most cases they were a little taken by Ryan’s presence, so nervous at the sight of Ryan. When Emma came in, she sat down, she was ready to go; Ryan walked in, immediately flubbed his first line, and she just laid into him, like, “Oh, you’re killing this buddy.” She was the only one not to be intimidated by him, and in that moment John and I knew, “All right this is it, she’s right for the part.” She continued that, and they just got along really well. They have a very similar sense of humor… they riff off each other really well.\n\nWhat was it about Ryan that made him right for the role of Jacob?\n\nWhy wouldn’t you work with Ryan? We had heard that he was interested. We were surprised because at that point he really hadn’t done any substantial comedy. I found that his role in Lars and the Real Girl was a comic performance, but a lot of people read it as drama; you could see in the movie, the timing, it’s all there. He was really interested in doing a comedy, and we thought he could really access the character, and so we met; we talked for a really long time, and Steve met him too. We were all like, “Of course, no brainer.” He’s a really funny guy naturally. No one had seen that side of him before.\n\nRELATED: Crazy Stupid Love: Before They Were Stars\n\nYou talked about why Emma was a good match for Ryan, but can you expand on why she fit the bill as Hannah?\n\nIf I remember correctly she wasn’t exactly what was described on paper, but John and I had both been taken with her in Superbad and then in Zombieland. It felt inevitable that she was going to hit. Her wit is sharp and it played into what we thought of the character as being — too smart for that kind of guy and almost too smart for herself, where she can get a little ahead of herself because her mouth and mind works a little bit faster than she’s expecting.\n\nThat all played into Emma and the way she really is. She comes across as much older, and definitely wasn’t technically the right age. I think she was too young when we were casting, but we were pretty confident she could play older and she’s phenomenally talented. I was sitting next to her in between takes when we were shooting one of the bar scenes. She got the news that she got her first magazine cover and she was over the moon. I was like ‘Oh, wow, what’s going on?’ She goes ‘Oh, I got this movie coming out, Easy A.’ The rest is history.\n\nA big moment for the two of them in the film is when Jacob lifts Hannah, Dirty Dancing style. It’s super charming, but also sort of sexy. How did that scene come together, and what do you remember about shooting it?\n\nThat was not in the script. That was Ryan’s idea. He mentioned he knew that move, and he wanted to do it. He took ballet as a kid and is a musical guy, so he was very confident doing that. That came out of a lot of conversations with Ryan and [writer] Dan Fogelman. Dan took the ball and ran with it and it’s fantastic. That’s where the really great scenes come from, ideas kind of whip around the room and next thing you know… and those are real nerves. Emma was really nervous he was going to drop her. She played into it all. It was really great.\n\nRELATED: Ryan Gosling’s Best Moments\n\nThey’re also so great together in the dialog-heavy scenes. Right after the Dirty Dancing bit, they go to the bedroom and talk all night. What did the two of them bring to those quieter moments?\n\nThat was all improv. They did a couple scripted lines interspersed. The crew, I think, thought John and I were crazy because we said we were going to throw the script away. We were going to stick them in a bed together and keep shooting. We shot for a really long time. We let them go, we let them talk about whatever they wanted, we poured a couple of drinks, and they just riffed. They really amuse each other in real life. At one point, I think it was Ryan came up to me, he was like, “Is this okay, what we’re doing? I’m not sure.” I was like, “No, no, it’s going to be great. Don’t worry.”\n\nThey were making each other laugh and we’d throw lines at them, throw scenarios at them. The thing about the massage chair, I think that might have been in the script, so we had a massage chair we stuck in the garage, went down there and shot that. Originally in the script, it was a montage over several weeks of them falling in love. It seemed cliché to do the walking-on-sunshine love montage, and we thought it would be a little more novel if the first night was kind of love at first sight. It’s a tall order to ask the actors — “Okay, you guys just met, and you have to basically fall in love” — and they totally pull it off.\n\nIt feels very real, the love they show on screen.\n\nThey love each other in real life, and they get on like a house on fire. It wasn’t a lot of heavy lifting on our part. It’s making a move to hire the right chemistry.\n\nWhat else stands out to you about their performances in the film?\n\nThey’re so much fun to work with, willing to try anything. They both like to laugh, so that’s a great plus when you’re doing a comedy, but they’re not outside the characters because they’re serious actors. I remember working with Emma on one of the scenes with Josh Groban. She went to this dramatic place when she realizes that she doesn’t want to marry him. I remember being totally taken off guard by how deep she went. You could see it in her eyes. I remember turning to John and going, “She’s going to be a phenomenal dramatic actress. I would love to see her in a drama or direct her in one.” Consequently, she’s top of our list all the time.\n\nEmma and Ryan have gone on to take roles in Gangster Squad, and they have La La Land coming up (due Dec. 16). How do you think they’ve translated into other films? Why do you think they have such staying power as a cast-able couple?\n\nJohn and I are always kicking ourselves. When we were working with them we kept talking to people about how we have to put them in another movie together, so everybody took the idea. We should’ve kept our mouths shut. Again, they have great chemistry, and they have fun together. I think it shows in everything they do. I haven’t seen La La Land yet, but I hear it’s fantastic; I have some friends who worked on it. Knowing Ryan and Emma, [with] Gangster Squad, the chance to re-do that era I think was really appealing to them. I think La La Land was a challenge as a musical, and I know Ryan loves dance and Emma’s just such an all-around entertainer. It’s going to be fantastic. I’m sure it won’t be the last time they work together.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=612&h=320&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2062'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=612&h=320&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg", "keywords": [], "authors": ["C. Molly Smith", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/article/2016/07/29/crazy-stupid-love-ryan-gosling-emma-stone-chemistry/", "title": "Crazy, Stupid, Love director on Ryan Gosling, Emma Stone chemistry", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Emma Stone,Glenn Ficarra,Ryan Gosling", "news_keywords": "Emma Stone,Glenn Ficarra,Ryan Gosling", "description": "'They love each other in real life, and they get on like a house on fire,' Glenn Ficarra says", "og": {"title": "'Crazy, Stupid, Love.' director: Why Ryan Gosling and Emma Stone are the ultimate rom-com couple", "type": "article", "site_name": "EW.com", "url": "https://ew.com/article/2016/07/29/crazy-stupid-love-ryan-gosling-emma-stone-chemistry/", "description": "Crazy, Stupid, Love. tells the story of a middle-aged husband, Cal (Steve Carell), who turns to a 30-something ladies’ man, Jacob (Ryan Gosling), for help&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=612&h=320&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg", "width": 612, "height": 320}}, "pinterest": {"url": "https://ew.com/article/2016/07/29/crazy-stupid-love-ryan-gosling-emma-stone-chemistry/", "description": "'They love each other in real life, and they get on like a house on fire,' Glenn Ficarra says", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/article/2016/07/29/crazy-stupid-love-ryan-gosling-emma-stone-chemistry/", "title": "'Crazy, Stupid, Love.' director: Why Ryan Gosling and Emma Stone are the ultimate rom-com couple", "description": "'They love each other in real life, and they get on like a house on fire,' Glenn Ficarra says", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=612&h=320&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fudfp-05982.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": ["https://www.youtube.com/embed/flvz5RMRx7E"], "publish_date": 1469721600.0, "source": "http://ew.com", "summary": ""}