{"url": "https://www.much.com/most-memorable-moments-mtv-movie-tv-awards/", "text": "The MTV Movie & TV Awards has always been known for its star-studded attendees and hilariously shocking moments. With the 2018 awards show just around the corner, we’re looking back at some of the best.\n\nFrom Sacha Baron Cohen arriving from the heavens like an angel, to that iconic Rachel McAdams and Ryan Gosling Notebook-esque kiss, to Emma Watson winning the first ever non-gendered acting award, here are some of our favourite moments from MTV Movie & TV Awards over the years.\n\nRyan Gosling and Rachel McAdams recreate their iconic kiss from The Notebook\n\nIn one of the most iconic moments in possibly all awards show history ever, nothing compares to Ryan Gosling and Rachel McAdams both on- and off-screen chemistry when they recreated their famous rain kiss from The Notebook while accepting Best Kiss during the 2005 show. Making our teenage hearts swoon, Ryan and Rachel 4eva.\n\nThat Scarlett Johansson and Sandra Bullock lip-lock\n\nAs it turns out, Britney Spears isn’t the only artist to show her love for a fellow star as award winner Sandra Bullock followed in her MTV stage footsteps, planting a smooch on presenter Scarlett Johansson back in 2010.\n\nEmma Watson winning the first non-gendered acting award\n\nAt last year’s show, non-binary actor Asia Kate Dillon made history last year when she presented Emma Watson with the first-ever non-gendered acting award for her role as Belle in Disney’s live-action remake of Beauty and the Beast.\n\nSacha Baron Cohen flew across the audience as an angel and landed on an unimpressed Eminem\n\nIn true Bruno fashion, Sacha Baron Cohen might have taken things a little too far at the 2009 awards when he flew across the audience as an angel before descending on rapper Eminem butt-first. The rapper stormed off leaving a string of expletives in his wake only to later reveal that he was in on the joke (he could have fooled us).\n\nKristen Stewart and Robert Pattinson’s missed kisses\n\nAt the 2011 MTV Movie & TV Awards, Kristin Stewart and Robert Pattinson won their third consecutive Best Kiss award. Fondly remembering their missed kisses after winning the award in 2009 and 2010, viewers thought (and hoped) by 2011 the duo would finally seal the deal. Instead, Pattinson ran into the audience for a lip-lock with their Twilight third wheel Taylor Lautner.\n\nAdam Devine parodies Beauty and the Beast with Hailee Steinfeld\n\nMTV’s golden popcorn doesn’t have quite the same recognition as a golden statue, but those award ceremonies aren’t filled with nearly as many fun and memorable moments. Case in point, last year’s opening musical number which saw host Adam Devine parody Disney’s Beauty and the Beast with singer/actress Hailee Steinfeld.\n\nJennifer Lopez and Tom Cruise—dressed as Tropic Thunder’s Les Grossman—perform together\n\nIn one of the most unexpected moments, Tom Cruise made an appearance at the 2010 awards show as his obnoxious Tropic Thunder character Les Grossman. Cruise joined JLo on stage for her hit “Get Right” in a hilariously raunchy performance. Who knew Tommy Boy could dance like that.\n\nWhen Lindsay Lohan hosted the 2005 award show\n\nAfter all these years, we’ve always held out for Lindsay Lohan. Hot off the success of Mean Girls and Confessions of a Teenage Drama Queen, Lohan hosted the 2005 MTV Movie & TV Awards where she surprisingly broke out into a choreographed dance routine during the show—back in the day when musical numbers weren’t award show staples.\n\nRita Ora ripping off Zac Efron’s shirt\n\nBoundaries aren’t a thing at the MTV Movie & TV Awards. This was most evident at the 2014 show when Rita Ora made like a Magic Mike extra and ripped off Zac Efron’s shirt. But, to be fair, you can’t really win an award for Best Shirtless Performance with a shirt on…\n\nSeth Rogan and James Franco pulled out a joint while promoting Pineapple Express\n\nIn 2008, Seth Rogen and James Franco puff-puff-passed a blunt on the MTV Movie & TV Awards stage while promoting Pineapple Express. They also pulled out a baggie of weed saying they only smoked “fake weed” while shooting the film, earning raised eyebrows and laughs from the audience.\n\nAubrey Plaza attempting to pull a Kanye on Will Ferrell\n\nPossibly the most cringe-worthy moment to date, Aubrey Plaza attempted to pull a Kanye on Will Ferrell when she jumped on stage and tried to take the golden popcorn from his hands in 2013. The moment was entirely unplanned and left a confused Ferrell asking “What’s happening?” and “Are you OK?” Plaza was kicked out of the awards show shortly after for the stunt.\n\nWhen Reese Witherspoon called out reality stars in her Generation Award acceptance speech\n\nWhen Reese Witherspoon accepted the 2011 Generation Award, she took her title as an “MTV Elder” very seriously, using her acceptance speech to offer advice to the younger generation. Witherspoon said, “It’s possible to make it in Hollywood without a reality show. When I came up in this business if you made a sex tape you were embarrassed, you hid it under your bed.” We’re certain the Kardashians felt the icy cold wrath of Tracy Flick from miles away.\n\nTune in to the 2018 MTV Movie & TV Awards hosted by comedian Tiffany Haddish on Monday, June 18 at 9 p.m. ET on Much and MTV Canada.", "images": ["https://i.ytimg.com/vi/3Mj38G5X0Bg/hqdefault.jpg", "https://www.much.com/wp-content/uploads/2020/03/iHeartConcert-HEader-250x141.jpg", "https://www.much.com/wp-content/uploads/2019/09/lindsaylohan-1-250x141.jpg", "https://www.much.com/wp-content/uploads/2020/04/DRAKE-250x141.jpg", "https://www.much.com/wp-content/uploads/2020/04/oneworld-taylor-250x141.jpg", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/nav/search-icon.png", "https://i.ytimg.com/vi/WV5qnQSKXpU/hqdefault.jpg", "https://www.much.com/wp-content/uploads/2018/06/Reese.gif", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/bellmedia-logo-white.png", "https://i.ytimg.com/vi/9R2wwrGP6VE/hqdefault.jpg", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/close-icon-black.png", "https://www.much.com/wp-content/uploads/2017/01/much-icon-e1484600515892-200x200.jpg", "https://i.ytimg.com/vi/UVEZpUM2dis/hqdefault.jpg", "https://www.much.com/wp-content/uploads/2020/04/lohan-music-teaser-250x141.jpg", "https://www.much.com/wp-content/uploads/2020/04/OneWorld_1280x720_Thumb-250x141.png", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/loading-circle.gif", "https://www.facebook.com/tr?id=417766778714379&ev=PageView&noscript=1", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/nav/back-to-top-icon.png", "https://www.much.com/wp-content/uploads/2018/06/MostMemorableMomentsMTVMovieTVAwards-770x433.jpg", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/loading.gif", "https://www.much.com/wp-content/uploads/2018/06/Aubrey-and-Will.gif", "https://i.ytimg.com/vi/17W4gXw6T1w/hqdefault.jpg", "https://www.much.com/wp-content/uploads/2020/04/GettyImages-1133906844-1-250x141.jpg", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/twitter-icon.png", "https://www.much.com/wp-content/uploads/2018/06/JLo-and-Tom-770x433.jpg", "https://i.ytimg.com/vi/62u4gfA4z4Y/hqdefault.jpg", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/gplus-icon.png", "https://www.much.com/wp-content/themes/much-1.2.58/dist/images/facebook-icon.png", "https://i.ytimg.com/vi/OfYbYMiLj38/hqdefault.jpg", "https://i.ytimg.com/vi/EWH6CtGXnRQ/hqdefault.jpg", "https://www.much.com/wp-content/uploads/2019/07/hustlers-250x141.jpg"], "top_img": "https://www.much.com/wp-content/uploads/2018/06/MostMemorableMomentsMTVMovieTVAwards-770x433.jpg", "keywords": [], "authors": ["Brooklyn Neustaeter"], "canonical_link": "https://www.much.com/most-memorable-moments-mtv-movie-tv-awards/", "title": "The Most Memorable Moments From The MTV Movie & TV Awards", "meta_data": {"viewport": "width=device-width", "google-site-verification": "HJjc7_To7geIUneC8S8qDo60eW4G3_sxyNe8RDAmbbo", "og": {"url": "https://www.much.com/most-memorable-moments-mtv-movie-tv-awards/", "image": "https://www.much.com/wp-content/uploads/2018/06/MostMemorableMomentsMTVMovieTVAwards-770x433.jpg", "type": "article", "site_name": "Much.com", "description": "The MTV Movie & TV Awards has always been known for its star-studded attendees and hilariously shocking moments. With the 2018 awards show just around the corner, we’re looking back at some of the best. From Sacha Baron Cohen arriving from the heavens like an angel, to that iconic Rachel McAdams and Ryan Gosling Notebook-esque […]", "title": "The Most Memorable Moments From The MTV Movie & TV Awards"}, "description": "The MTV Movie & TV Awards has always been known for its star-studded attendees and hilariously shocking moments. With the 2018 awards show just around the corner, we’re looking back at some of the best. From Sacha Baron Cohen arriving from the heavens like an angel, to that iconic Rachel McAdams and Ryan Gosling Notebook-esque […]", "keywords": "much, music, muchmusic, music video, music videos, entertainment news, celebrity news, new music, rap, rock", "fb": {"app_id": 131515486897956}}, "movies": ["https://www.youtube.com/embed/yiX38OrigQM?feature=oembed", "https://www.youtube.com/embed/hBsVYP3z6mo?feature=oembed", "https://www.youtube.com/embed/fJ3cAszSeLY?feature=oembed", "https://www.youtube.com/embed/vAnBes__11Y?feature=oembed", "https://www.youtube.com/embed/gReV0mh3tWM?feature=oembed", "https://www.youtube.com/embed/MGgRDnHbZr0?feature=oembed", "https://www.youtube.com/embed/GZAVOnPL1tI?feature=oembed", "https://www.youtube.com/embed/kBxl1xGkANM?feature=oembed", "https://www.youtube.com/embed/cKiE4xpT13s?feature=oembed"], "publish_date": null, "source": "https://www.much.com", "summary": ""}