{"url": "www.newidea.com.au/prince-harry-and-meghan-markle-buy-malibu-beach-house", "text": "Although it’s been announced the royal couple will officially reside in Kensington Palace when they are married, Megha and Harry are planning to spend at least ‘four months’ in the US.\n\nAfter all, the American starlet is really close to her mum, Doria Radlan, and Harry will do anything he can to make his new bride happy.\n\nAs an active humanitarian, Meghan is also planning to not only make positive changes in the UK, but stateside as well.\n\nAnd as a wedding present to themselves, they are spending an impressive US$16 million to make their dream come true.\n\nSources say the pair have ‘fallen in love’ with this stunning Italian-style property with dramatic views over the Pacific Ocean.\n\nIt has eight bedrooms and eight bathrooms, a large swimming pool, hot tub, waterfalls and koi ponds and is just steps from a private beach.\n\n‘There’s tonnes of space for entertaining,’ discloses a pal. It also has its own cinema, a state-of-the-art gym, floodlit tennis court (perfect for when sporty Kate comes to stay) and a two-storey guest house.\n\n‘It’s everything Harry and Meghan could want – and it’s perfect for when they have kids.’\n\nThe lovestruck young royal is splurging with the millions he received in inheritance from his mum Princess Diana when he turned 30, in 2014.\n\nAnd actress Meghan is chipping in some cash too.\n\n‘They are planning on spending $1 million refurbishing the house to their own tastes,’ explains the pal.\n\nEven before the pair got engaged they decided that they were going to split their time between London and LA.\n\n‘They toyed with the idea of getting a house in Beverly Hills, but thought it would be much more fun to have a place by the beach,’ they continued.\n\n‘They plan on spending three or four months a year in Malibu. It means that Meghan gets to see her mum and friends a lot.\n\n‘In fact, they are trying to convince her mum to move into the guesthouse, so she gets the run of the place when they are away,’ says the source.\n\n‘Harry has had the cash sitting in his bank account for more than three years now and he always intended to spend it on property.\n\n‘He knows his mum will approve of the purchase.’\n\nMalibu is home to dozens of celebrities, including Leonardo DiCaprio, Britney Spears, Halle Berry, Mel Gibson and Orlando Bloom.\n\n‘It’s not grand like the houses Harry is used to in London, but he is mesmerised by the thought of living right next to the sea and somewhere so glamorous and exciting.\n\n‘Meghan thinks it’s funny because she is the exact opposite. She is used to the Malibu lifestyle, but has to pinch herself that she now gets to live in a palace and is getting married in a castle!’\n\nWilliam is said to be ‘a tad jealous’ that Harry and Meghan are getting a pad in California.\n\nRoyal duties for the future king of England would prevent the first-born prince and Kate from spending too much time away from the mother country.\n\nInstead, William and Kate will divide their time between multiple estates across the UK, and use Harry and Meghan as an excuse for the odd cheeky escape from royal duty.\n\n‘He knows it’s not something that he and Kate could get away with – but they plan on visiting them a lot!’ the source says.\n\nThe insider also says that Harry and Meghan will still make London their main home.\n\n‘But Meghan plans to do a lot of charity work in the US and she and Harry want to have a base in LA so they can host fundraisers and invite Hollywood movers and shakers to contribute. But, also, that Malibu beach house is just a cool place to hang out and get away from the pressures of royal life,’ the source added.\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "http://www.newidea.com.au/media/25818/harry-and-meghan.jpg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/25818/harry-and-meghan.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/prince-harry-and-meghan-markle-buy-malibu-beach-house", "title": "Check out Prince Harry and Meghan Markle’s new house", "meta_data": {"language": "en-us", "description": "As New Idea can exclusively reveal, Prince Harry and Meghan Markle are splashing out on a lavish beach house in star-studded Malibu.", "news_keywords": "Prince Harry, Meghan Markle, Malibu, Prince Harry Meghan Markle malibu home, Prince Harry estates, malibu beach house, Meghan Markle homes, Meghan Markle Prince Harry news, royal family, royal family news, latest royal family news", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/prince-harry-and-meghan-markle-buy-malibu-beach-house", "title": "Check out Prince Harry and Meghan Markle’s new house", "description": "As New Idea can exclusively reveal, Prince Harry and Meghan Markle are splashing out on a lavish beach house in star-studded Malibu.", "image": {"identifier": "http://www.newidea.com.au/media/25818/harry-and-meghan.jpg", "width": 1500, "height": 1001}}, "twitter": {"title": "Prince Harry and Meghan Markle buy Malibu beach house", "description": "As New Idea can exclusively reveal, Prince Harry and Meghan Markle are splashing out on a lavish beach house in star-studded Malibu.", "image": "http://www.newidea.com.au/media/25818/harry-and-meghan.jpg", "url": "https://www.newidea.com.au/prince-harry-and-meghan-markle-buy-malibu-beach-house"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1523835670.471, "source": "http://www.newidea.com.au", "summary": ""}