{"url": "www.mercurynews.com/2018/02/16/justin-therouxs-friends-never-believed-he-and-jennifer-aniston-would-last/", "text": "While the love story of Jennifer Aniston and Justin Theroux had its fans, sources close to the couple questioned whether it would last, E! News is reporting.\n\nSure, Aniston and Theroux are both beautiful and talented. One appeal of this love story is that Theroux was well-cast as the hero to rescue Aniston, America’s TV sweetheart, from her supposed heartbreak after Brad Pitt divorced her in 2005 to marry Angelina Jolie.\n\nTheroux is dark, handsome and chiseled (his form is well on display in HBO’s “The Leftovers.”). He also brought to their Hollywood power coupling hipster/artist cred as both an accomplished screenwriter and as a director and actor for Broadway, film and TV.\n\nE! News pointed out that the couple had genuine chemistry and love for each other. On the other hand, “they were never really suited to one another,” people close to the couple told the outlet.\n\nFor these people, it’s not surprising that Aniston and Theroux announced Thursday that they were separating.\n\n“They have always just been two very different people with very different characters who just happened to fall in love,” a source told E! “He’s more nomadic, more of a free spirit, he’s rugged and urban and Jennifer just isn’t that kind of person.”\n\nTheir romance became public in 2011, a year after they filmed “Wanderlust,” a comedy in which Aniston plays a married urban filmmaker who has an affair with the leader of a hippie commune, played by Theroux.\n\nTheroux may have fallen hard for Aniston but he reportedly was bothered by the intense media scrutiny that came with dating the actress, who became adored for her comedic talent and her signature hair styles while starring on the hit sitcom “Friends.” Because of the regular paparazzi presence, especially in Los Angeles, the more social Theroux had to adapt to the reclusive lifestyle that Aniston had come to accept as Brad Pitt’s wife of five years.\n\nBecause of these and other differences, few of Theroux’s friends were “fully on board” with the relationship, E! News said.\n\nThe couple married in 2015 in what sounded like an intimate but star-studded ceremony in the garden of their $21-million Bel-Air estate.\n\nActress, comedian and writer Amy Sedaris, a friend of Theroux’s, told Aniston in a Harper’s Bazaar interview that “everything about that wedding was perfect.”\n\n“Everyone was dressed like a bunch of woodland creatures, and your dress looked so beautiful and breezy,” Sedaris said.\n\nBut the bliss didn’t last, according to reports coming since Thursday. The reports include the possibility that the couple began living apart this past summer. Sources near Theroux’s New York apartment told TMZ that Aniston had been absent from his West Village residence since August.\n\nSources said they saw Theroux in the West Village “all the time,” but that Aniston stopped coming. The last known photo of them together at the apartment was from Oct. 1, TMZ said.\n\nOver the fall, Aniston and Theroux also were fending off a tabloid report in Life & Style that they were fighting over whether to live in New York City or Los Angeles, according to Gossip Cop. Life & Style reported that Aniston had recently come to the realization that “she’s just not cut out for city life” after spending a few weeks with her husband in their New York apartment.\n\nMeanwhile Theroux wasn’t crazy about making Los Angeles their home base, Life & Style said. But in an interview with Gossip Cop, a representative for Aniston shot down the story that they were fighting over which coast to live on.\n\nPeople magazine said Thursday that it was “telling” that Theroux didn’t pose with Aniston for an extensive photo shoot at their Bel-Air mansion for a recent cover story for Architectural Digest. The only photo of Theroux shows him outside with his motorcycles.\n\nAniston purchased the home for $21 million in 2011, and the couple spent two years carrying out extensive renovations on the modern, minimalist property that was billed as “their love nest,” according to various reports.\n\nBut Aniston admitted to Architectural Digest that the collaboration was initially a struggle for her. When she was single, she carried out home renovation projects on her own.\n\n“Justin definitely wanted to be involved, so there was a bit of a learning curve for me on how to include another voice in the design process,” she admitted in the feature. “For instance, I figured out that immediately saying ‘No!’ to any suggestion is not the most collaborative move.”\n\nPeople also noted that a feature in Architectural Digest is also looked at by many as a precursor to putting a home on the market.\n\nMeanwhile, in their joint statement Thursday, Aniston and Theroux said they made their decision to separate at the end of the year. They were last photographed together on vacation in Cabo San Lucas over New Year’s, according to E! News.\n\nIt now appears that the couple, who have vowed to stay good friends, took the trip to Mexico to either make one last attempt to save their marriage or as a way to say good-bye.", "images": ["https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/02/anistonad.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2018/02/aniston_10.jpg?w=1024&h=681", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/04/vuitton_101.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/02/aniston_10.jpg?w=1024&h=681", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/02/16/justin-therouxs-friends-never-believed-he-and-jennifer-aniston-would-last/", "title": "Justin Theroux’s friends never believed he and Jennifer Aniston would last", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Following news that Jennifer Aniston and Justin Theroux have split, sources have come forward to say that friends worried they weren't compatible.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Justin Theroux’s friends never believed he and Jennifer Aniston would last", "url": "https://www.mercurynews.com/2018/02/16/justin-therouxs-friends-never-believed-he-and-jennifer-aniston-would-last/", "description": "Following news that Jennifer Aniston and Justin Theroux have split, sources have come forward to say that friends worried they weren’t compatible.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/02/aniston_10.jpg?w=1024&h=681", "width": 1024, "height": 681}, "locale": "en_US"}, "article": {"published_time": "2018-02-16T19:38:13+00:00", "modified_time": "2018-02-17T01:02:51+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Justin Theroux’s friends never believed he and Jennifer Aniston would last"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/02/aniston_10.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1518710400.0, "source": "http://www.mercurynews.com", "summary": ""}