{"url": "https://www.marieclaire.co.uk/entertainment/tv-and-film/princess-eugenie-the-crown-594356", "text": "We'd watch a show about our lives too tbh, but it'd probably be way more boring\n\nIf we were Claire Foy, we’d be sweating a little bit right now. Netflix’s hit show The Crown has become one of the biggest contenders on the television scene and it turns out not even Queen Elizabeth is immune to its charms, according to a reported conversation with Princess Eugenie.\n\nVanessa Kirby, who played Princess Margaret on the show, was recently interviewed for Vanity Fair and revealed, ‘A friend of mine was at a party and didn’t know anyone, so he sidled up to this group who were talking about The Crown, when one said, ‘Well, my granny watches it and really likes it.’ It slowly dawned on him that the girl was [Princess] Eugenie and her granny was the queen.’\n\nIt makes sense, given that the Daily Express revealed that Prince Edward and his wife Sophie of Wessex were supposedly the ones to introduce the Queen to it. (They share a Netflix account and everything.) We wonder what else the Queen’s been queueing up – maybe she’s a big Orange is the New Black fan?\n\nIt’s not a huge surprise that Princess Eugenie was allegedly the one to spill the beans, as she’s a big The Crown stan and we’re here for it. At an event at the China Exchange, she revealed to the crowd, ‘The music is beautiful, the story is beautiful. You feel very proud to watch it. I can’t speak for everyone, but that’s how I felt when I saw it.’\n\nVanessa Kirby, Claire Foy and their co-star Matt Smith won’t have to worry too much about impressing the royals any further though, as their contract with the show officially up. Since the show follows the royal family throughout their lives, they were hired to play younger versions of Princess Margaret, Queen Elizabeth and Prince Philip respectively – now that their two seasons are up, other actors have been hired to play older incarnations of the characters.\n\nRecently, Netflix announced Helena Bonham Carter would be joining The Crown as the new Princess Margaret, alongside Olivia Colman as Queen Elizabeth and Tobias Menzies as Prince Philip. The burden of living up to the Queen’s expectations in season 3 is now totally on their shoulders.\n\nAt least they won’t have to worry about Prince Philip’s opinion, since he apparently wouldn’t be caught dead with an episode of the show on.\n\nMatt Smith revealed his friend had actually spoken with the royal while at a dinner and asked him if he was watching the show.\n\nIn classic Prince Philip fashion, he reportedly snapped, ‘Don’t be ridiculous.’\n\nWell, you win some – you lose some.", "images": ["https://ksassets.timeincuk.net/wp/uploads/sites/46/2016/09/logo_marie-claire.svg", "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r.jpg", "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r-920x564.jpg", "https://ksassets.timeincuk.net/wp/uploads/sites/46/2016/10/Placeholder-image-MC-1-oct.svg", "https://ksassets.timeincuk.net/wp/uploads/sites/46/2017/04/Megan-9184-135x135.jpg"], "top_img": "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r.jpg", "keywords": [], "authors": ["Megan C. Hills"], "canonical_link": "https://www.marieclaire.co.uk/entertainment/tv-and-film/princess-eugenie-the-crown-594356", "title": "Princess Eugenie basically confirmed the Queen loves The Crown", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "In an overheard Princess Eugenie The Crown conversation, it was reportedly confirmed that the Queen loves the Netflix series about her own life.", "og": {"locale": "en_US", "type": "article", "title": "Princess Eugenie Basically Confirmed The Queen Loves The Crown", "description": "In an overheard Princess Eugenie The Crown conversation, it was reportedly confirmed that the Queen loves the Netflix series about her own life.", "url": "https://www.marieclaire.co.uk/entertainment/tv-and-film/princess-eugenie-the-crown-594356", "site_name": "Marie Claire", "updated_time": "2018-05-04T14:32:16+01:00", "image": {"identifier": "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r.jpg", "secure_url": "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r.jpg", "width": 2000, "height": 1226}}, "article": {"publisher": "https://www.facebook.com/MarieClaireUK/", "section": "TV & Film", "published_time": "2018-05-04T14:31:18+01:00", "modified_time": "2018-05-04T14:32:16+01:00"}, "twitter": {"card": "summary_large_image", "description": "In an overheard Princess Eugenie The Crown conversation, it was reportedly confirmed that the Queen loves the Netflix series about her own life.", "title": "Princess Eugenie Basically Confirmed The Queen Loves The Crown", "site": "@marieclaireuk", "image": "https://ksassets.timeincuk.net/wp/uploads/sites/46/2018/05/rexfeatures_5083664r.jpg", "creator": "@marieclaireuk"}, "fb": {"pages": 157136240296}, "msapplication-TileImage": "https://ksassets.timeincuk.net/wp/uploads/sites/46/2016/09/cropped-Black-M-favicon-270x270.png"}, "movies": [], "publish_date": 1525440678.0, "source": "https://www.marieclaire.co.uk", "summary": ""}