{"url": "https://en.wikipedia.org/wiki/Bob_Morley", "text": "For the British film actor, see Robert Morley\n\nRobert Alfred Morley (born 20 December 1984)[1] is an Australian actor and television director. After appearing in various theatre productions and short films, Morley was cast as Drew Curtis in Home and Away in 2006. For the role, he received a nomination for the Most Popular New Male Talent Logie Award. Morley appeared on It Takes Two in 2007 and following his departure from Home and Away, he joined the cast of The Strip. Morley was cast as Aidan Foster in Neighbours, in 2011 and he starred in the feature film Blinder in 2013. As of 2014, Morley stars as Bellamy Blake on The 100.\n\nEarly life [ edit ]\n\nMorley is the son of a Filipina mother and an Australian Irish father, who died when he was young.[2] Morley has two older sisters and one older brother.[1] He grew up on a farm in Kyneton, a small country town in Victoria,[2] and studied drama at school all the way through to Year 11, until he was asked not to continue.[3] Morley told The Age that he was a naughty student and did not take things seriously.[3] After he completed year 13, Morley moved to Melbourne and began an engineering degree.[2] A year later, he decided to enroll in Creative Arts at the La Trobe University and he got himself an agent.[1][2]\n\nCareer [ edit ]\n\nMorley began his career by acting in various university theatre productions, short films and plays including Falling to Perfect and Tale From Vienna Woods.[1][3] Morley appeared in the 2005 low-budget horror film Dead Harvest directed by Damian Scott[1] and as an extra in the soap opera Neighbours. That same year he got a part in Angels with Dirty Faces and his performance brought him to the attention of the Home and Away casting directors.[3] Morley joined the cast of Home and Away as Drew Curtis in 2006.[3] For his role as Drew, Morley was nominated for the Most Popular New Male Talent Logie Award.[4] Morley appeared in the second series of the Australian celebrity singing competition series It Takes Two from May 2007. On 12 June 2007, he was voted off after six weeks on the show – even though he received his highest score that night. In 2008, Morley departed Home and Away and he was cast as Tony Moretti in the Nine Network's 2008 action drama series The Strip.[5] The series was cancelled due to low ratings and did not return for a second series. He went on to appear in the 2008 Nine Network's Scorched.[2] Morley was nominated for Cleo magazine's \"Bachelor of the Year\" award.\n\nIn 2009, he starred as Lorca in the play Palindrome for a Dead Poet. The following year, Morley featured in season four of Sea Patrol in the 5th episode titled \"Paradise Lost\".[6] In 2011, he starred in the Australian thriller Road Train directed by Dean Francis.[7] The picture was released in North America as Road Kill. In June 2011, it was announced that Morley had joined the cast of Neighbours as Aidan Foster, a love interest for Chris Pappas (James Mason).[8] Morley and Mason's characters formed the show's first gay couple.[8] Morley took a ten-week break from the soap to appear in Blinder, a feature film about Australian rules football.[9] He returned to the set of Neighbours in early June 2012.[9]\n\nOn 21 February 2013, Philiana Ng and Lesley Goldberg from The Hollywood Reporter reported that Morley had been cast as Bellamy in The CW's The 100 which is filmed in Canada.[10] As of 2019, The 100 is airing its sixth season. Morley began filming a role for the drama Lost in The White City in June 2013.[11]\n\nIn 2018, Morley completed the Warner Bros. Television Directors’ Workshop.[12]\n\nPhilanthropy [ edit ]\n\nOn 21 September 2015, he tweeted fans a link to purchase a shirt that he designed[13] in order to raise funds for beyondblue,[14] an Australian organization that provides information and support for Australians' mental health. He designed another shirt in 2017,[15] in which the campaign proceeds were donated to the JED Foundation, a non-profit for the protection of emotional health and the prevention of suicide.\n\nIn September 2017, he joined fellow The 100 cast mates to participate in the BC Children's Hospital Benefit Soccer match in Vancouver, Canada.[16][17] During the match Whitecaps Alumni and other Hollywood Stars took to the pitch at BC Place in support of the charity.\n\nFans have set up a charity project in his name, the Bob Morley Fans Charity Project on YouCaring, in which they auction off signed merchandise they get at conventions and donate the proceeds through the organization to other organizations such as the ACLU, the JED Foundation, and the Brain and Behavior Research Foundation.[18]\n\nPersonal life [ edit ]\n\nBob Morley and his wife, Eliza Taylor\n\nOn 7 June 2019, Morley announced he and his The 100 co-star Eliza Taylor were married.[19] According to Manana Hills Estate and Rev. James Chun, who officiated the wedding, Morley and Taylor got married on 6 May 2019.[20][21]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role 2010 Road Train Craig 2013 Blinder Nick 2014 Lost in the White City Avi\n\nTelevision [ edit ]\n\nAs director [ edit ]\n\nYear Title Notes 2019 The 100 Episode: \"Ashes to Ashes\"\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg/220px-Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/220px-Bob_Morley_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/1200px-Bob_Morley_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/1200px-Bob_Morley_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bob_Morley", "title": "Bob Morley", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/1200px-Bob_Morley_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}