{"url": "https://www.pwtorch.com/site/2018/11/15/11-14-total-divas-review-nia-jax-is-afraid-of-not-fitting-in-nikki-the-poet-naomi-and-nia-cook-paige-cant-swim-and-gets-sunburn-lana-subject-of-gossip/", "text": "SPOTLIGHTED PODCAST (ARTICLE BEGINS A FEW INCHES DOWN)... PWTorch editor Wade Keller presents the Thursday Flagship edition of the Wade Keller Pro Wrestling Podcast with guest cohost PWTorch VIP analyst Todd Martin. Todd and Wade discuss Howard Finkel and what he represented as a great ring announcer but also how Vince McMahon treated him and what that says about McMahon. Todd then gives his strong view on WWE's decision to release so many wrestlers yesterday during a pandemic just days before the next investor's conference call. And much more.\n\n(Search \"wade keller\" to subscribe in podcast app or CLICK HERE to subscribe in Apple Podcasts.)\n\n\n\nTOTAL DIVAS – EPISODE 9\n\nNOVEMBER 14, 2018\n\nAIRED ON E!\n\nBY SARAH K., PWTORCH CONTRIBUTOR\n\nAre you ready for 44 minutes of grown women having first world problems and sometimes arguing for no reason? Oh, yeah, it’s another episode of Total Divas. Tonight is hopefully the conclusion of last week’s “girls’ vacation” in Tahoe. I’m eating pizza rolls (combination flavor) and drinking Cherry Coke as I type this because I just got home from work… in case someone thought I would be eating something organic and drinking tea. Based on the show open, the women will be wearing bikinis at multiple points, Paige will be sunburned, and I will inevitably yell at Lana on my TV for apologizing for who the hell knows what. Oh, and I’m sure that Nattie will lie about something, because she’s on the episode and that’s kind of her thing.\n\nThe show opens with Naomi and Jimmy Uso. Naomi wants a place in Atlanta. Ah, yes, relationships are about compromise. Meanwhile in Tahoe all the girls eat lunch. At this table, Paige is already sunburned. Oh, goodie, Nikki Bella is being challenged to write a poem about commitment. Yeah, I just typed that. Supposedly Nikki has been writing “poetry” since she was a teen – which I’m willing to believe. What I don’t believe is that she ever studied poetry or linguistics or has even the faintest idea that there is actually such a thing as a “rhyming dictionary” – let alone that she’s actually read much from a real dictionary – because I’ve seen her speak on television and I saw the IQ episode where she proved to be of average intelligence. So, this should be fantastically cringy!\n\nNow, back to the episode; Nia is afraid of not fitting in. And then Brie Bella is afraid of Tahoe Tessie. Tahoe Tessie is an American knock-off of the Loch Ness Monster just like the Book of Mormon is an American version of the Bible. Lana is afraid of failing, and also being an outsider. Nattie wants Lana to do a trust fall. “No, Lana, no!” I say to the TV while eating a Hostess cherry pie. Oh yeah, I’m going for all the shades of unhealthy tonight. Anyway, Lana does the trust fall and they catch her.\n\nNow everyone’s on a boat in bathing suits (15 minutes, men) and Brie is talking about Tahoe Tessie again. The girls are going to parasail. Oh, and Naomi arrives on a boat. Nattie and Naomi parasail. That lasted for all of two minutes. Back at the house, Nia is journaling and then chats with Paige about Paige’s inability to swim. Again, people are gathered around a table. Oh, Brie is going to cry about being away from her baby. Yeah, this is a first world problem that most people don’t experience. Also, I just started scrolling through my Instagram timeline because that’s how uninteresting I find Brie Bella. Commercial.\n\nOh, there’s a teaser for the upcoming season of Total Bellas, or as I know it: “Why the f— is this show still on the air?” Brie is going to set Nikki up on a date with some guy from some other reality TV show, because, I presume, the producers of E! were, like, “Shit, there’s a giant hole in this show without the f—ing weirdo that is John Cena.”\n\n“If they have a museum on Tahoe Tessie, that means it’s real,” says Brie Bella. Teenage girls, I implore you to get better role models, seriously. Also, read a book! “I think Brie’s fear of Tahoe Tessie is fricking hilarious,” says Naomi. Yes, Naomi, that is correct. For shits and giggles, there’s a lot of random footage of streets, sunsets, etc. in Total Divas, so, 28 minutes in there’s a shot of a chipmunk. Ironically, I worked on an illustration of a chipmunk last night.\n\nOh crap, Nikki Bella has “books” of poetry that she’s written. Also, she apparently can’t write poetry on command, which, hey teenage girls, is a life lesson: Someone with a vested interest in a trade (whether it be writing, fashion, design, photography, etc.) actually studies the trade, reads books, learns from examples of those who are masters, and then is proficient in applicable situations. For instance, no one that I graduated from art school with is incapable of doing their craft on command. There’s a difference between having a play hobby and being skilled. There’s a real god damned slim chance I’m going to be impressed by the “poetry” I’m going to hear at the end of this episode… because, again, I’ve seen the IQ episode.\n\nAnyway, the girls are on a boat and they’re going to go tubing. Hopefully someone has slathered Paige with sunscreen. First world problems: Can Paige hold on to an inflatable tube while wearing a life jacket in a lake. Paige falls off, of course, and then once she’s back on the boat she cries. Imma try and pretend I didn’t sit here in my living room eating mini Reese’s cups and laughing at a grown woman crying about falling off an innertube in a lake while wearing a life jacket while on a vacation while staying at a rented mansion.\n\nBack from commercial, it’s another everyone-at-a-table-eating-food moment. So, everyone is talking about Lana before Lana shows up at the table. Yeah, girls, that’s called gossiping. Yeah, okay, that resolved nothing. Naomi and Nia decide to cook. It apparently wasn’t fabulous, and yet people were able to make jokes about it who participated in it while it was happening… unlike that time when Nikki Bella made John Cena dinner instead of going out to dinner and he said nothing about the food and was just worried about whether or not his idiot girlfriend damaged anything in his fancy mansion. I might be high on refined sugar, but I haven’t forgotten. Anyway, Brie tries to scare everyone with a squid mask as if she’s Tahoe Tessie. Nikki ordered pizza. So, Naomi’s biggest fear is divorce. Yes, leave it to Naomi to be the adult, think of the adult problem, and then probably be pragmatic and responsible about it.\n\nNaomi has brought the gravity to the situation. She’s the adultiest adult on this show. Later on, outside, the girls sit around a campfire, and they burn some tiny little wood logs. I will note that I don’t think that Nattie has admitted to being afraid of something. Oh, shit, 50 minutes into this show and Nikki Bella is reading her poem, and from the first sentence this is positively written at a teenage girl writing level, and I don’t mean like a hipster library nerd who reads books teenage girl. SMH. Also, the poem doesn’t rhyme… until it tries to rhyme. Oh, lordy. There are hugs after the poem. Uh-huh. I’m now on my second glass of Cherry Coke. Paige then reads from her journal, followed by Nia (who says nice things), Lana begins reading from her journal – talks about apologies and cries – and commercial!\n\nSo, Lana is talking about words, and she wants to leave a legacy of “love and forgiveness.” Yeah, this is cheesy. Then everyone is on a dock – you guessed it – eating, talking about having a baby. Nattie admits that she wants to “have a baby at some point.” I don’t believe that. Anyway, everyone jumps off the dock and into the lake with their clothes on. Paige wears a life jacket. They speak of sisterhood and magic and cleansing. And then everyone ends up in a hot tub for three seconds of screen time.\n\nOn the season finale of Total Divas, it’ll be about the Money in the Bank match, Naomi losing her wedding ring, and the death of Nattie’s father, Jim “the Anvil” Neidhart.\n\nNOW CHECK OUT LAST WEEK’S REPORT: 11/7 TOTAL DIVAS REVIEW: Girls in Bikinis on the Lake episode includes bickering over who has better room, Paige empowering internet jerks, Nikki insists on mandatory journaling time", "images": ["https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?resize=600%2C381&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/01/PWTorchDailyCast2019_MMATalk.jpg?resize=80%2C60&ssl=1", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2017/12/WadeKellerHotline2017.jpg?resize=80%2C60&ssl=1", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/08/SmackdownFox_WWELogo2019_600.png?resize=326%2C245&ssl=1", "https://www.pwtorch.com/site/wp-content/uploads/2016/01/PWTorchLogo2016-text580tight.png", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/04/TotalBellas2000_3x2_600.png?resize=326%2C245&ssl=1", "https://secure.gravatar.com/avatar/f6c6ab59a75b01d0c90e3e3d0f50a527?s=24&d=mm&r=g", "https://i2.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/03/WWE-logo-3x2_600.png?resize=80%2C60&ssl=1", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/03/BruceMitchellVIPMailbagPodcast2020.png?resize=80%2C60&ssl=1", "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/06/OnTheCanvas.jpg?resize=80%2C60&ssl=1", "https://secure.gravatar.com/avatar/c3ced3d59dc5a784592d6d34618f1913?s=24&d=mm&r=g", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2019/01/WKPWP_Blue_Spreaker.png?resize=80%2C60&ssl=1", "https://secure.gravatar.com/avatar/7e9acec66fedeb47b97425ce64f02a5d?s=60&d=mm&r=g", "https://secure.gravatar.com/avatar/c496dd1e57a7221d62f20a33aabe0547?s=24&d=mm&r=g", "https://i2.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2020/03/TorchCover597_3x2_600.png?resize=326%2C245&ssl=1", "https://www.pwtorch.com/site/wp-includes/images/rss.png", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?fit=600%2C400&ssl=1", "https://secure.gravatar.com/avatar/6a5cae733130bf865df2a9c0f535838d?s=60&d=mm&r=g", "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2017/12/TheFix2017V.jpg?resize=80%2C60&ssl=1", "https://secure.gravatar.com/avatar/5627aa75cccfa0945b4f462bb4ebc681?s=24&d=mm&r=g"], "top_img": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?fit=600%2C400&ssl=1", "keywords": [], "authors": ["Bob Rimpnerton", "Kevin", "Truckmonth"], "canonical_link": "https://www.pwtorch.com/site/2018/11/15/11-14-total-divas-review-nia-jax-is-afraid-of-not-fitting-in-nikki-the-poet-naomi-and-nia-cook-paige-cant-swim-and-gets-sunburn-lana-subject-of-gossip/", "title": "11/14 TOTAL DIVAS REVIEW: Nia Jax is afraid of not fitting in, Nikki the Poet, Naomi and Nia cook, Paige can't swim and gets sunburn, Lana subject of gossip -", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "11/14 TOTAL DIVAS REVIEW: Nia Jax is afraid of not fitting in, Nikki the Poet, Naomi and Nia cook, Paige can't swim and gets sunburn, Lana subject of gossip -", "description": "TOTAL DIVAS – EPISODE 9 NOVEMBER 14, 2018 AIRED ON E! BY SARAH K., PWTORCH CONTRIBUTOR Are you ready for 44 minutes of grown women having first world problems and sometimes arguing for no reason? [...]", "url": "https://www.pwtorch.com/site/2018/11/15/11-14-total-divas-review-nia-jax-is-afraid-of-not-fitting-in-nikki-the-poet-naomi-and-nia-cook-paige-cant-swim-and-gets-sunburn-lana-subject-of-gossip/", "image": {"identifier": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?fit=600%2C400&ssl=1", "secure_url": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?fit=600%2C400&ssl=1", "width": 600, "height": 400}}, "article": {"publisher": "https://www.facebook.com/prowrestlingtorch", "section": "TV Shows & Events", "published_time": "2018-11-15T06:58:12+00:00"}, "twitter": {"card": "summary", "description": "TOTAL DIVAS – EPISODE 9 NOVEMBER 14, 2018 AIRED ON E! BY SARAH K., PWTORCH CONTRIBUTOR Are you ready for 44 minutes of grown women having first world problems and sometimes arguing for no reason? [...]", "title": "11/14 TOTAL DIVAS REVIEW: Nia Jax is afraid of not fitting in, Nikki the Poet, Naomi and Nia cook, Paige can't swim and gets sunburn, Lana subject of gossip -", "site": "@PWTorch", "image": "https://i1.wp.com/www.pwtorch.com/site/wp-content/uploads/post/2018/09/TotalDivas_2018_3x2_600.png?fit=600%2C400&ssl=1", "creator": "@PWTorch"}, "generator": "Seriously Simple Podcasting 1.20.13", "msapplication-TileImage": "https://i0.wp.com/www.pwtorch.com/site/wp-content/uploads/2015/10/2016_PWTorchFavicon_WhiteRedBlack.png?fit=270%2C270&ssl=1", "google-site-verification": "QbiACLF5tnvvNHV_szLu6UtYT2nUCTBuTJ9TjRkm1bA"}, "movies": [], "publish_date": 1542211200.0, "source": "https://www.pwtorch.com", "summary": ""}