{"url": "https://web.archive.org/web/20180328200721/https://screenrant.com/coco-interview-gael-garcia-bernal/", "text": "Gael Garcia Bernal is a Mexican film actor, director, and producer, most known for his work in Bad Education, The Motorcycle Diaries, and Babel. He is most often associated with his role in Amazon’s Mozart In the Jungle, playing the character of Rodrigo de Souza. Gael Garcia Bernal will lend his voice to the character of Hector in Disney-Pixar’s Coco, which debuts in theaters on November 22, 2017.\n\nScreen Rant got a chance to sit down with Gael Garcia Bernal on press day, where we discussed what influences he incorporated into the role of Hector along with what influenced the specific jerky movements we’ve come to associate with the character. We also touched upon how important this film will be to the Mexican community.\n\nSR: One question I had was what kind of influences did you bring to Hector after you got the role? What inspired you to like, create that character?\n\nGael Garcia Bernal: Well, there’s, I mean, it is a collaborative process to this characters you know? I mean apart from the set storyline there is, um, there is a reason why they call you, I guess. Because they, I mean, in this film, in particular, they wanted me to improvise, and to play around, and to put in certain words, you know. You know, certain ways of speaking of you know and I would play around with that. And I cannot… I don’t know in particular which ones, you know? But now, because you do so much, and you I develop the character in a way with, together with them, that at the end you don’t know who’s showing where it all kind came from, you know? But there is a lot there you know and… Yeah, it is it is quite… it’s not just putting the voice, you know? It’s putting something else. I don’t know.\n\nSR: Right! Like your own kind of take it. Now, there’s a question I actually had for you, is that I noticed that Hector has these movements, and it is very different than a lot of the other characters. Is there any influence that you had over that, or anything like that?\n\nGael Garcia Bernal: Maybe! And that I wouldn’t know for real because now that I see the movie sometimes I feel that, yes, certain smile certain ways of moving, or the eyes. I don’t know, there’s something there but I don’t know what it is. There they record you while you are doing the voices and everything all the time. And they grab from there.\n\nSR: You know, something that’s really cool about this it a Pixar-Disney film that touches on Mexican culture. What does that mean to you?\n\nGael Garcia Bernal: Well, I mean, it means a lot that there is… You know, coming from making films, you know, it is incredible when you see somebody, or a group of people do a film of another country and make it really, I mean, in this case, they made a really beautiful Mexican movie. And that is that is that is huge. There is a huge accomplishment. I mean, I’ve been saying that they’re just it’s a triumph of how we can talk to each other, you know? Through different cultures and how we can show that we are interdependent in that sense and how universal everything is, you know? So, it’s really nice.\n\nSR: Have you ever had a situation where your family may not have been so encouraging of your artistic dream and if so how did you seize your moment?\n\nGael Garcia Bernal: No. No. I come from a very easy going family in that sense. I mean, fortunately, I come from a very, also, from a family that doesn’t… Is not about… They never pushed on the success stories side, you know? It was always like a thing of like whatever makes you happy, you know? Or whatever you find your sparks your curiosity and satisfies that ,so I never had to seize my moment.\n\nSR: Hector and Miguel have this great energy together. They’re great together, and I love them on screen together. Was there any advice that you gave to young Anthony like breaking into this industry that you may have had for him?\n\nGael Garcia Bernal: No. No. I mean, he seems really prepared. I mean, this is really like, incredibly, you know, like, I mean, he talks about the musical career and he’s only thirteen you know? I mean, you know, he’s he’s very musical. He’s very he’s much more extroverted than I ever was you know? I mean, in terms of like the way that he just you know put it out there he sings really well. I’m sure he’s going to do incredible and he’s a lovely guy you know? I mean, there are a but I just met him three days ago.\n\nThePremium Network Ad Free Browsing\n\nAd Free Browsing Over 10,000 Videos!\n\nOver 10,000 Videos! All in 1 Access\n\nAll in 1 Access Join For Free! GO PREMIUM WITH SCREENRANT Go Premium!", "images": ["https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-part-of-1.svg", "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-go-premium-white.svg", "https://web.archive.org/web/20180328200721im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-icon-light.svg", "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/uploads/2017/09/Coco-Miguel-Skeleton-Land-of-Dead.jpg", "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/themes/screenrant/assets/images/svg/ad-blocker.svg", "https://web.archive.org/web/20180328200721im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/themes/screenrant/assets/images/svg/tp-logo.svg"], "top_img": "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/uploads/2017/09/Coco-Miguel-Skeleton-Land-of-Dead.jpg", "keywords": [], "authors": ["Joe Deckelmeier"], "canonical_link": "https://web.archive.org/web/20180328200721/https://screenrant.com/coco-interview-gael-garcia-bernal/", "title": "Coco Was A 'Collaborative Process' At Pixar", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"pages": 10765693196, "app_id": 1682953215260932}, "syndication-source": "https://screenrant.com/coco-interview-gael-garcia-bernal/", "twitter": {"domain": "ScreenRant.com", "site": "@screenrant", "card": "summary_large_image", "title": "Coco Was A 'Collaborative Process' At Pixar", "description": "We interview Coco star Gael Garcia Bernal about his approach to portraying his character, Hector, and the film's themes.", "image": {"src": "https://screenrant.com/wp-content/uploads/2017/09/Coco-Miguel-Skeleton-Land-of-Dead.jpg"}}, "news_keywords": "Coco,SR Originals", "description": "We interview Coco star Gael Garcia Bernal about his approach to portraying his character, Hector, and the film's themes.", "og": {"type": "article", "title": "Coco Was A 'Collaborative Process' At Pixar", "url": "https://web.archive.org/web/20180328200721/https://screenrant.com/coco-interview-gael-garcia-bernal/", "locale": "en_US", "description": "We interview one of the film's stars.", "site_name": "Screen Rant", "image": {"identifier": "https://web.archive.org/web/20180328200721im_/https://screenrant.com/wp-content/uploads/2017/09/Coco-Miguel-Skeleton-Land-of-Dead.jpg", "width": 620, "height": 310}}, "article": {"publisher": "https://www.facebook.com/ScreenRant", "published_time": "2017-11-21T12:49:32+00:00", "modified_time": "2017-11-21T12:49:32+00:00", "author": "Joe Deckelmeier", "section": "SR Originals", "tag": "coco"}, "robots": "noydir"}, "movies": [], "publish_date": 1511268572.0, "source": "https://web.archive.org", "summary": ""}