{"url": "https://lithub.com/my-8-favorite-books-about-female-friendship/", "text": "When I was a middle schooler, trying to understand the sometimes tricky business of having girlfriends, I turned to books like Harriet the Spy and Are You There God? It’s Me, Margaret (Judy Blume) for solace, and was happily surprised to find that reading them helped me figure out how to navigate those friendships. As I matured, so did the books: first to novels like Forever and The Cat Ate My Gymsuit, by Paula Danziger, then classics like The Color Purple, Sula and Their Eyes Were Watching God. I adored The Joy Luck Club and Love Medicine. What never changed was my need to see my personal experience—especially my female friendships—reflected back to me through literature.\n\nI’ve been thinking a lot about friends—my real ones and my favorite fictional ones—as I’ve been working on my own book, Girl Talk: What Science Can Tell Us About Female Friendship. As a journalist, I wanted to use my reporting background to understand why my friends sometimes acted in strange and mysterious ways, while other friends were steadfastly supportive and kind.\n\nI realized that in some ways, I’ve learned nearly as much about female friendship from reading novels as I did from writing this book.\n\nFor instance, reading The Burning Girl by Claire Messud, and Margaret Atwood’s Cat’s Eye helped me understand what drove the mean girls of my adolescence. Swing Time, by Zadie Smith, gave valuable insight on the competitiveness of girls. In The Color Purple, I learned how rivalry and love can create an enduring relationship between two friends.\n\nArticle continues after advertisement\n\nThese novels struck a chord with me, but reading about these things happening to someone else gave me a sense of control as well. I could close the books when I wanted to, and make them go away.\n\nWe like to see ourselves in the stories that we read. Novels about similar experiences that we’ve had—such as being treated badly by a friend or a breakup with a boyfriend—can make us feel like we’re not the only ones who’ve had these things happen to us. They can also help us feel less alone.\n\nEver since, Pamela, (the epistolary novel written by Samuel Richardson in 1739), readers have been using fiction to better understand themselves by seeing the world through others’ eyes.\n\nThough much work remains to be done in this area, it’s slowly becoming easier for readers from diverse backgrounds to find their own experiences depicted in fiction. Now, they can read Zadie Smith or Min Jin Lee or Wayétu Moore and find connections to their lives and their friends as well.\n\nHere are some of my favorite books about female friendship:\n\nArticle continues after advertisement\n\nThe Burning Girl, by Claire Messud\n\nA semi-gothic novel about the intense friendship between two pre-teenage girls, Julia and Cassie, best friends since they were small. They were two opposites: Julia was quiet and sensitive; Cassie was the mischievous one. When Cassie’s home life is upended by the appearance of her mother’s new boyfriend moving in, she begins to pull away from Julia, and their friendship starts to fall apart. Cassie starts running with a racy crowd, and their class differences start to become more apparent. Julie starts to question what happened to their relationship: “Maybe I made her feel trapped like she’d outgrown me. It was like I knew her too well . . . she wanted to try out a new role and didn’t want to be reminded that it was fake.”\n\nA Thousand Splendid Suns, by Khaled Hosseini\n\nA story about two women, Mariam and Laila, who are married to the same cruel and violent man in Afghanistan. At first, Mariam resents Laila when she comes to live with her and Rasheed, but then she comes to love her and they become best friends. They shield each other against their abusive husband, and Mariam becomes a second mother to Laila’s daughter. When Laila decides to run away, Mariam agrees to go with her. Their relationship is reminiscent of the story of Ruth and Naomi from the Book of Ruth in the Hebrew Bible: the central theme is the loyalty and sacrificial love between two women—one older and one younger.\n\nSwing Time, by Zadie Smith\n\nTwo childhood friends dream of becoming dancers, but only one has real talent. The narrator, who is never named, meets Tracey at dance class: “There were many other girls present but for obvious reasons we noticed each other, the similarities and the differences, as girls will. Our shade of brown was exactly the same—as if one piece of tan material had been cut to make us both—and our freckles gathered in the same areas, we were of the same height.” They have a close but difficult friendship, which ends when they are in their twenties. But they never forget one another, and while they don’t see one another for years, when they catch sight of each other, all the past feelings of affection mixed with jealousy come rushing back.\n\nSula, by Toni Morrison\n\nIn Sula, Morrison wrote about two black women who not only have to deal with sexism and racism, but with the harm they can inflict on each other—and she wanted to show how much these women could hurt each other. When the novel was published, it broke new ground by depicting the darker side of these female relationships. After Sula, more black writers used women’s friendship to tell their stories.\n\nCat’s Eye, by Margaret Atwood\n\nIn Atwood’s 1988 novel, Cat’s Eye, a painter reflects back on her childhood and teenage years, and the trio of girls who first befriended, and then bullied her. It’s a perverse but close friendship that leaves the narrator confused and angry. Atwood was criticized when the book came out for the way she depicted girls and women as treating their friends in a horrible way, rather than in a nurturing fashion, as feminists at the time believed that women should behave. It was considered politically incorrect to say there was this dimension to girls’ friendships; today, that kind of “mean girl” behavior is portrayed everywhere.\n\nThe Hot One: A Memoir of Friendship, Sex, and Murder, by Carolyn Murnick\n\nFriendship breakups can happen in real life, too, as found in this 2017 memoir. In the book, the author recounts what happened to her best friend from childhood, Ashley. When the girls were young, they both felt like outsiders, but when they entered different high schools, they grew apart, and Ashley started hanging out with the fast crowd. She was the hot girl; sexually precocious and popular. After high school, she moved to Los Angeles, where she became a stripper and an escort, while Carolyn attended college. A few years later, Carolyn is shocked to find out that Ashley had died—stabbed to death at the age of 22. She travel to LA to find out what happened to her friend, and who killed her.\n\nPachinko, by Min Jin Lee\n\nIn this page-turning saga about four generations of a poor Korean immigrant family who live in Japan, the women stand out for their strength and courage. The story begins with a teenaged girl in the early 1900s who falls in love with a wealthy stranger. When she becomes pregnant, she refuses to live as his kept woman and instead marries a sickly minister passing through on his way to Japan. Her choice to leave home begins a powerful tale full of love, sacrifice and hardship for the generations of her family to come.\n\nIn the Time of the Butterflies, by Julia Alvarez\n\nThis historical fiction novel about three revolutionary sisters who are murdered in cold blood by a ruthless dictator, is based on real people. The Mirabal sisters stood up to Rafel Trujillo, the brutal leader of the Dominican Republic for 31 years, and they sacrificed their lives for their cause. This 1994 novel brings the women to life by recreating their diaries, letters, secrets, and memories.", "images": ["https://s26162.pcdn.co/wp-content/uploads/2018/11/41zHqGf-TcL._SX329_BO1204203200_-199x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/the-burning-girl-1-200x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/2020/04/shinchocha-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/3/2020/03/carter-brown-feat-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/41M1raVXSjL._SX322_BO1204203200_-195x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/518GQ9aPgVL-197x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/2020/04/climbing-1-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/3/2020/04/BOSCH-6-FEAT-726x400.jpg", "https://s26162.pcdn.co/wp-content/plugins/lb-content-widgets/img/crime-reads-logo-black.png", "https://s26162.pcdn.co/wp-content/themes/rigel/images/social_logo.png", "https://s26162.pcdn.co/wp-content/uploads/2018/11/InTheTimeOfTheButterflies-196x300.jpg", "https://pixel.quantserve.com/pixel/p-sPcTBQa5YQLu3.gif", "https://s26162.pcdn.co/wp-content/uploads/sites/2/2020/04/The-Week-in-Books-Episode-1.png", "https://s26162.pcdn.co/wp-content/uploads/2018/11/220px-A_Thousand_Splendid_Suns-1-196x300.gif", "https://s26162.pcdn.co/wp-content/uploads/2018/11/Preti-Taneja-300x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/2/2020/04/5-Reviews-3-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/3/2020/04/The-Beetle-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/2020/04/wolves-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/71mIgomaa1L-199x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/2/2020/04/Godshot-Chelsea-Bieker-150x150.jpeg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/71-mtSd-0JL-194x300.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/3/2020/03/women-crime-editors-feat-150x150.jpg", "https://s26162.pcdn.co/wp-content/plugins/lb-content-widgets/img/bookmarks-logo.png", "https://s26162.pcdn.co/wp-content/uploads/2018/11/800px-Rooftop_Hangout_Unsplash.jpg", "https://s26162.pcdn.co/wp-content/uploads/2020/04/mary-pearson-150x150.jpg", "https://s26162.pcdn.co/wp-content/uploads/2020/03/41gCSZosAML._SX320_BO1204203200_.jpg", "https://s26162.pcdn.co/wp-content/uploads/2018/11/Mroz-Jacqueline-100x100.jpg", "https://s26162.pcdn.co/wp-content/uploads/sites/2/2020/04/Best-Reviewed-April-17-150x150.png", "https://s26162.pcdn.co/wp-content/uploads/sites/2/2020/04/AudioFile-April-1-150x150.png", "https://s26162.pcdn.co/wp-content/uploads/sites/3/2020/04/1960s-150x150.jpg"], "top_img": "https://s26162.pcdn.co/wp-content/uploads/2018/11/800px-Rooftop_Hangout_Unsplash.jpg", "keywords": [], "authors": [], "canonical_link": "https://lithub.com/my-8-favorite-books-about-female-friendship/", "title": "My 8 Favorite Books About Female Friendship", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"title": "My 8 Favorite Books  About Female Friendship", "site": "@lithub", "creator": "@lithub", "text": {"title": "My 8 Favorite Books  About Female Friendship"}, "image": "https://s26162.pcdn.co/wp-content/uploads/2018/11/800px-Rooftop_Hangout_Unsplash.jpg?w=640", "card": "summary_large_image"}, "og": {"type": "article", "title": "My 8 Favorite Books  About Female Friendship", "url": "https://lithub.com/my-8-favorite-books-about-female-friendship/", "description": "When I was a middle schooler, trying to understand the sometimes tricky business of having girlfriends, I turned to books like Harriet the Spy and Are You There God? It’s Me, Margaret (Judy Blume) …", "site_name": "Literary  Hub", "image": {"identifier": "https://s26162.pcdn.co/wp-content/uploads/2018/11/800px-Rooftop_Hangout_Unsplash.jpg", "width": 800, "height": 480}, "locale": "en_US"}, "fb": {"admins": 1556575837954671}, "google-site-verification": "Rg-Wzmxy2d-k1H7r2vglPozcoYnXO0UpW6XFVNfH3Ic", "contextly-page": "{\"title\":\"My 8 Favorite Books  About Female Friendship\",\"url\":\"https:\\/\\/lithub.com\\/my-8-favorite-books-about-female-friendship\\/\",\"pub_date\":\"2018-12-04 04:48:23\",\"mod_date\":\"2019-04-01 12:07:32\",\"type\":\"post\",\"post_id\":\"103778\",\"author_id\":\"3487\",\"author_name\":\"Jacqueline Mroz\",\"author_display_name\":\"Jacqueline Mroz\",\"tags\":[\"Carolyn Murnick\",\"Claire Messud\",\"female friendship\",\"Girl Talk: What Science Can Tell Us About Female Friendships\",\"Jacqueline Mroz\"],\"categories\":[\"Features\",\"Reading Lists\"],\"image\":\"https:\\/\\/lithub.com\\/wp-content\\/uploads\\/2018\\/11\\/800px-Rooftop_Hangout_Unsplash.jpg\"}", "description": "When I was a middle schooler, trying to understand the sometimes tricky business of having girlfriends, I turned to books like Harriet the Spy and Are You There", "keywords": "carolyn murnick,claire messud,female friendship,girl talk: what science can tell us about female friendships,jacqueline mroz,julia alvarez,khaled hosseini,margaret atwood,min jin lee,seal press,toni morrison,zadie smith", "generator": "WordPress 5.3.2", "article": {"published_time": "2018-12-04T09:48:23+00:00", "modified_time": "2019-04-01T16:07:32+00:00"}}, "movies": [], "publish_date": 1543916903.0, "source": "https://lithub.com", "summary": ""}