{"url": "https://www.cheatsheet.com/health-fitness/revealing-insights-into-kate-middletons-relationship-with-the-royal-family.html/", "text": "She’s been with Prince William for almost two decades, so Kate Middleton has had lots of time to get to know the royal family. However, mystery still surrounds how much they like her. What is Kate’s relationship really like with the royal family members? Some family ties are much tenser than others (page 10).\n\n1. Prince Harry\n\nPrince William, Duchess Kate, and Prince Harry | Alastair Grant/AFP/Getty Images\n\nRoyal relation to Kate: brother-in-law\n\nKate can count on her brother-in-law to always be in her corner. The two are chummy, whether they’re spending time together at a shared charity event or a social gathering. In 2017, Harper’s Bazaar revealed that Prince Harry views Kate as “the big sister he never had.”\n\nNext: A controversial cousin in Kate’s corner\n\n2. Princess Eugenie\n\nCatherine greets Princess Eugenie at the St. Andrews 600th Anniversary Dinner | Samir Hussein/WireImage\n\nRoyal relation to Kate: cousin-in-law\n\nThe media noticed awkward dynamics between Princess Eugenie and Kate early on. But things seem better in recent years. Of course, Eugenie remains most loyal to her sister, Princess Beatrice (more on that drama later). But Eugenie is reportedly on good terms with the whole family, especially Princes William and Harry.\n\nIn January 2017, Buckingham Palace announced Eugenie’s engagement to long-term boyfriend Jack Brooksbank. Both the royal family and her fiance’s family expressed delight over the upcoming nuptials. It seems the princess has a future of her own to focus on.\n\nNext: A 22-year age gap doesn’t hurt this relationship.\n\n3. Lady Louise of Windsor\n\nThen-8-year-old Lady Louise Windsor watches the London 2012 Paralympic Games with the Duchess of Cambridge. | Stefan Roussea/AFP/GettyImages\n\nRoyal relation to Kate: cousin-in-law\n\nDaughter of Prince Edward and Sophie, Countess of Wessex, Lady Louise caught the public’s attention when she served as one of Kate’s adorable bridesmaids in 2011. Since then, Louise and Kate have enjoyed many public outings together. Despite their age difference (Louise is 14 and Kate is 36), the queen’s granddaughters get along swimmingly. They’re often seen chatting and laughing while representing the royal family.\n\nNext: The best grandfather a royal could have?\n\n4. Prince Philip, Duke of Edinburgh\n\n(L-R) Queen Elizabeth II, Prince Philip, Catherine, Charlotte, George, and William during the Trooping the Colour parade. | Chris Jackson/Getty Images\n\nRoyal relation to Kate: grandfather-in-law\n\nKate Middleton shows that she has nothing but respect and admiration for her grandfather-in-law. Upon marrying Prince William and taking on duchess duties, Kate openly said she looked to fill Philip’s shoes and follow his example.\n\nNext: This relationship proves rumors can be false.\n\n5. Anne, Princess Royal\n\nDuchess Kate and Princess Anne | Max Mumby/Indigo/Getty Images\n\nRoyal relation to Kate: husband’s aunt\n\nAnne, Princess Royal, reportedly gossiped about Kate before her wedding. Then, a tabloid frenzy occurred before Prince George’s birth, when Anne, mother to William and Kate’s cousins Zara and Peter, seemed indifferent when asked if she was excited about a new baby in the family. However, the two often chat at social events, so this feud seems like idle gossip.\n\nNext: The important relationship Kate maintains — outside her marriage.\n\n6. Queen Elizabeth II\n\nShe has a special place in Queen Elizabeth’s heart. | Phil Noble/WPA Pool/Getty Images\n\nRoyal relation to Kate: grandmother-in-law\n\nSome relatives seem to have a problem with the attention Kate Middleton receives (more on that soon). It’s not surprising because she clearly maintains one of the best relationships with Queen Elizabeth. Kate reportedly dated Prince William for a while before meeting the queen for the first time at Peter and Autumn Phillips’ wedding. She and her royal grandmother have only grown closer since then.\n\nNext: Kate’s relationship with her father-in-law seems a bit strained.\n\n7. Prince Charles\n\nShe makes a great daughter-in-law. | Justin Tallis/Getty Images\n\nRoyal relation to Kate: father-in-law\n\nWe don’t hear much about Kate Middleton’s relationship with her father-in-law, Prince Charles. But there were rumors of tension shortly after Kate married Prince William. Charles was reportedly “irked” by his son and daughter-in-law on their first royal trip overseas as a married couple, stating he felt the trip featured too many photo ops and was treated too much like a “personal holiday” instead of a diplomatic trip.\n\nNext: What does Prince Charles’ hat-loving wife think?\n\n8. Camilla Parker-Bowles, Duchess of Cornwall\n\nShe seems to get along well with Camilla. | Jack Taylor/Getty Images\n\nRoyal relation to Kate: stepmother-in-law\n\nThings seem cordial between the two duchesses nowadays. But in the beginning, Camilla and Kate were reportedly at odds. One biographer revealed in a book that Camilla thought Kate was “too common” to marry Prince William and may have tried to manipulate the relationship so they wouldn’t get married.\n\nOther reports said Camilla’s close confidantes fed the press unflattering information about Kate and her family. This is the same Camilla who Princess Diana was at odds with for years, so perhaps this isn’t surprising.\n\nNext: What about Prince Harry’s new bride?\n\n9. Meghan Markle\n\nDuchesses Catherine and Meghan attend Christmas Day Church. | Stephen Pond/Getty Images\n\nRoyal relation to Kate: sister-in-law\n\nPrince Harry’s wife has also spent time with Kate and William’s children. Considering Kate’s affinity for her brother-in-law it’s no surprise sources say she defended her sister-in-law as the media reported about Markle’s previous divorce and sometimes-racy career.\n\nWhile Kate didn’t have a big role at Markle’s wedding, reports indicate the two are relatively close, and Kate is helping Markle fit in with the royal family.\n\nNext: Everyone can see the tension between Kate and this royal.\n\n10. Princess Beatrice\n\nRumors about Princess Beatrice and Kate claim they don’t get along. | Chris Jackson/Getty Images\n\nRoyal relation to Kate: cousin-in-law\n\nSarah, Duchess of York (commonly known as Fergie) has long caused a rift in the royal family. So much so that it created tension between her daughters, Princess Beatrice and Eugenie, and the rest of the royal family. Many believe this rift translated to the girls not liking Kate — although Eugenie seems to have warmed up to her cousin-in-law.\n\nPrincess Beatrice is reportedly quite icy toward Kate, feeling sidelined due to Kate’s place and popularity in the royal family, especially with her grandmother, Queen Elizabeth. The feud between the two women regularly steals headlines.\n\nNext: Any talk of disdain between these two is just gossip.\n\n11. Princess Sophie, Countess of Wessex\n\nCould there be an air of competition between these two? | Chris Jackson/Getty Images\n\nRoyal relation to Kate: husband’s aunt\n\nSure, there have been a few whispers that Kate had a falling out with Sophie Wessex after Sophie reportedly became Queen Elizabeth’s “favorite in-law.” But from the looks of things, at least in public, this appears to be a rumor. The press regularly photographs the Countess and Duchess — both from common backgrounds — having a fabulous time together at social events.\n\nNext: The birth of Kate’s children strengthened this relationship.\n\n12. Zara Tindall\n\nKate Middleton and Zara have no feuds between them. | Chris Jackson/Getty Images\n\nRoyal relation to Kate: cousin-in-law\n\nKate Middleton’s relationship with Prince William’s cousin, Zara, is difficult to decipher. Over the years, some speculated Kate herself became cold after rumors floated around that Zara was gossiping before Kate and William’s 2011 wedding. But now, Zara is Prince George’s godmother, and her daughter Mia has play dates with Prince George. It’s also well-known that Zara has had a close relationship with Prince William and Prince Harry throughout their royal lives.\n\nNext: Kate and this royal’s similarities bring them together.\n\n13. Autumn Phillips\n\nTheir kids must really get along. | Chris Jackson/Getty Images\n\nRoyal relation to Kate: wife of cousin-in-law\n\nAutumn entered the royal family after she got hitched to Princess Anne’s son, Peter. As a mother of two and former commoner, she and Kate have a lot in common. (It’s no wonder the Montreal native is called “Canada’s Kate Middleton.”) The two aren’t seen together much, although they’ve been friendly in every setting since Autumn’s 2008 wedding.\n\nNext: How Kate gets along with other ladies across the globe …\n\n\n\n14. Other royal women\n\nKate Middleton | Justin Tallis/AFP/Getty Images\n\nPart of being a duchess is maintaining relations with royals outside of the monarchy. Since Kate constantly travels, she’s seen being friendly with other royal women. Most notably, she’s on friendly terms with Princess Charlene of Monaco and Queen Maxima of the Netherlands — both are close friends.\n\nNext: Does Kate play into the race for the throne?\n\n15. Where Kate fits in the feud for the Crown\n\nKate Middleton doesn’t seem to be fixated on the crown as much as others. | Richard Pohle/AFP/Getty Images\n\nSome of the royal family’s animosity toward Kate may involve her proximity to the throne. Since Prince Charles and Prince Andrew are in a tug-of-war over who will succeed Queen Elizabeth, Kate’s rise to popularity surely irks the royals. (Plus, Prince Andrew fears his daughters, Beatrice and Eugenie, will be further nudged out of the royal circle if Charles becomes king.) Kate keeps her distance from this fight.\n\nNext: So, why do we keep talking about this, anyway?\n\n16. Why Kate’s relationships are so fascinating\n\nKate Middleton is as lovely as she seems. | Carl Court/AFP/Getty Images\n\nThe fascination over Kate Middleton’s relationships with all the royals keeps her Cinderella-like story alive. Her fairy-tale relationship with Prince William and her entrance into the family never seem to get boring. Particularly when you consider all the drama among the family members even before Kate got there!\n\nNext: What does this mean for the next soon-to-be royal?\n\n17. How does this affect the future of the family?\n\nWe hope to see Kate do amazing things while with the royal family. | Ben Pruchnie/Getty Images\n\nThe spotlight on the royal family has shifted since Prince Harry got engaged to actress Meghan Markle. This has, of course, spawned countless comparisons between Meghan and Kate — especially when it comes to Meghan’s relationship with the rest of the royal family.\n\nWith Harry’s bride-to-be becoming the first non-married family member to spend the holidays with the queen, it’s only a wonder what we’ll learn. (And, of course, we wonder how Meghan’s relationship with the queen will be compared to Kate’s.)\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2019/03/Catherine-Duchess-of-Cambridge-and-Princess-Anne-915x1024.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-539393878-640x361.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Camila-Parker-Bowles-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg", "https://www.cheatsheet.com/wp-content/uploads/2019/03/Catherine-Duchess-of-Cambridge-Princess-Eugenie-of-York-773x1024.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Princess-Sophie-640x442.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/kate-middleton-black-peacoat-e1519157087109.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Prince-Charles-640x459.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Autumn-Phillips-546x500.png?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2019/03/Catherine-Duchess-of-Cambridge-and-Meghan-Duchess-of-Sussex-1024x683.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/Queen-Elizabeth-II-and-The-Duke-And-Duchess-Of-Cambridge-Visit-The-East-Midlands-603x500.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Catherine-Duchess-of-Cambridge-Prince-Philip.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2014/05/Kate-Middleton-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/Catherine-Duchess-of-Cambridge-and-Lady-Louise-Windsor.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/07/KateMiddletonserious-1-640x349.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kate-Middleton-and-Princess-Beatrie-603x500.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Zara-Tindall-640x474.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg", "keywords": [], "authors": ["Chelena Goldman"], "canonical_link": "https://www.cheatsheet.com/health-fitness/revealing-insights-into-kate-middletons-relationship-with-the-royal-family.html/", "title": "Revealing Insights Into Kate Middleton’s Relationship With the Royal Family", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/revealing-insights-into-kate-middletons-relationship-with-the-royal-family.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The royal family's connections with the Duchess of Cambridge are complicated. Peek into the relationships between Kate Middleton and her royal in-laws.", "og": {"locale": "en_US", "type": "article", "title": "Revealing Insights Into Kate Middleton's Relationship With the Royal Family", "description": "The royal family's connections with the Duchess of Cambridge are complicated. Peek into the relationships between Kate Middleton and her royal in-laws.", "url": "https://www.cheatsheet.com/health-fitness/revealing-insights-into-kate-middletons-relationship-with-the-royal-family.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2019-03-19T19:44:42-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "royal family", "section": "Health & Fitness", "published_time": "2018-07-18T16:10:00-04:00", "modified_time": "2019-03-19T19:44:42-04:00"}, "twitter": {"card": "summary_large_image", "description": "The royal family's connections with the Duchess of Cambridge are complicated. Peek into the relationships between Kate Middleton and her royal in-laws.", "title": "Revealing Insights Into Kate Middleton's Relationship With the Royal Family", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/04/PrinceWilliamDuchessKateMiddletonPrinceHarry.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1531944600.0, "source": "https://www.cheatsheet.com", "summary": ""}