{"url": "https://www.usatoday.com/story/life/2017/12/13/tavis-smileys-show-dropped-pbs-amid-troubling-allegations-misconduct/950476001/", "text": "PBS's late-night talk show Tavis Smiley was suspended Wednesday after \"multiple, credible allegations\" of misconduct emerged about the popular host/producer. Smiley greeted the news with shock and outrage.\n\nPBS sent a statement to USA TODAY late Wednesday declaring that the public broadcaster had \"indefinitely suspended\" distribution of Tavis Smiley, produced by Smiley's independent production company, TS Media.\n\n\"PBS engaged an outside law firm to conduct an investigation immediately after learning of troubling allegations regarding Mr. Smiley,\" the statement read. \"This investigation included interviews with witnesses as well as with Mr. Smiley. The inquiry uncovered multiple, credible allegations of conduct that is inconsistent with the values and standards of PBS, and the totality of this information led to today’s decision.”\n\nThe consequences for Smiley mounted almost immediately. Late Thursday, Walmart, which had been a sponsor of Smiley's talk show and an upcoming touring theatrical show, announced it cut ties with him. The theatrical show, Death of a King: A Live Theatrical Experience, is based on Smiley's 2014 book of the same title and was to start Jan. 15, King's birthday.\n\n\"We take these issues very seriously and are troubled by the recent allegations,\" the retail giant said in a statement according to the Associated Press. \"As a result, we are suspending our relationship with Mr. Smiley, pending the outcome of the PBS investigation.\"\n\nAnd Hay House, which distributes the Smiley Books imprint, said all Smiley projects were \"on hold\" pending an internal review. Smiley had planned in September to release Leading by Listening: Connecting through Conversation to Transform Your Relationships and Your Business.\n\nIn a Facebook post, Smiley said he was \"as shocked as anyone else by PBS’ announcement.\"\n\n\"I have the utmost respect for women and celebrate the courage of those who have come forth to tell their truth. To be clear, I have never groped, coerced, or exposed myself inappropriately to any workplace colleague in my entire broadcast career, covering 6 networks over 30 years. Never. Ever. Never.\"\n\nSmiley said PBS \"overreacted and conducted a biased and sloppy investigation, which led to a rush to judgment...trampling on a reputation that I have spent an entire lifetime trying to establish. This has gone too far. And, I, for one, intend to fight back.\"\n\nSmiley is an occasional contributor to USA TODAY's opinion section.\n\nOn Thursday, PBS released a statement responding to Smiley's outrage, saying it stands by the \"integrity\" of the investigation of Smiley.\n\nPBS declined to discuss the nature of the allegations but Smiley's response suggested they involved alleged sexual misconduct.\n\nAfter the PBS suspension, Variety reported, quoting unnamed sources, that the investigation found credible allegations that Smiley had engaged in sexual relationships with multiple subordinates, and that some believed their jobs depended on a sexual relationship with Smiley. Also, Smiley was accused of creating a verbally abusive and threatening environment and employees feared retaliation.\n\nSmiley hosted Tavis Smiley, a half-hour interview program that premiered in 2004 and airs weeknights on PBS stations.\n\nAs the former host of BET Tonight With Tavis Smiley on Black Entertainment Television, Smiley became known as \"black America's favorite talk show host,\" according to National Public Radio, and he has been one of the few black hosts on PBS.\n\nSmiley is the second late-night host on PBS to lose his spot on public television, following the derailing of Charlie Rose's career on PBS and CBS following allegations of sexual misconduct.\n\n\"PBS has terminated its relationship with Charlie Rose and canceled distribution of his programs,\" PBS said in a statement at the time. \"PBS expects all the producers we work with to provide a workplace where people feel safe and are treated with dignity and respect.\"\n\nBoth Smiley and Rose have been caught up in a national deluge of sexual harassment and assault allegations that have felled powerful men in entertainment, media, politics, business and fashion in the last two months.\n\nLast year, Smiley and co-author David Ritz published Before You Judge Me: The Triumph and Tragedy of Michael Jackson’s Last Days just days before the seventh anniversary of the superstar’s death. The non-fiction book takes a novelistic approach, speculating on how Jackson feels, what he's thinking, and most pointedly, how he cannot sleep in the 16 weeks leading up to his death.\n\nSmiley has a deal with Warner Bros. Television to develop the book, along with J.J. Abrams' Bad Robot, into an “event television series.”\n\nList:All the Hollywood power players facing sexual misconduct allegations", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5679676185001_5679671740001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/211c3d17bb896ac871b7eea3cc1b589cf0f3ddc4/c=0-50-3938-2275/local/-/media/2017/12/13/USATODAY/USATODAY/636487900552228376-AP-Sexual-Misconduct-Tavis-Smiley.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/211c3d17bb896ac871b7eea3cc1b589cf0f3ddc4/c=0-50-3938-2275/local/-/media/2017/12/13/USATODAY/USATODAY/636487900552228376-AP-Sexual-Misconduct-Tavis-Smiley.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/211c3d17bb896ac871b7eea3cc1b589cf0f3ddc4/c=0-50-3938-2275/local/-/media/2017/12/13/USATODAY/USATODAY/636487900552228376-AP-Sexual-Misconduct-Tavis-Smiley.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2017/12/13/tavis-smileys-show-dropped-pbs-amid-troubling-allegations-misconduct/950476001/", "title": "Tavis Smiley's show dropped by PBS amid 'troubling allegations' of misconduct", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Tavis Smiley's show dropped by PBS amid 'troubling allegations' of misconduct", "description": "Tavis Smiley is the second PBS talk-show host dropped by the public broadcaster amid allegations of sexual misconduct.", "url": "https://www.usatoday.com/story/life/2017/12/13/tavis-smileys-show-dropped-pbs-amid-troubling-allegations-misconduct/950476001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/211c3d17bb896ac871b7eea3cc1b589cf0f3ddc4/c=0-50-3938-2275/local/-/media/2017/12/13/USATODAY/USATODAY/636487900552228376-AP-Sexual-Misconduct-Tavis-Smiley.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1809}, "type": "article"}, "article": {"author": "Maria Puente", "content_tier": "free", "opinion": "false"}, "description": "Tavis Smiley is the second PBS talk-show host dropped by the public broadcaster amid allegations of sexual misconduct.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/211c3d17bb896ac871b7eea3cc1b589cf0f3ddc4/c=0-50-3938-2275/local/-/media/2017/12/13/USATODAY/USATODAY/636487900552228376-AP-Sexual-Misconduct-Tavis-Smiley.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Tavis Smiley's show dropped by PBS amid 'troubling allegations' of misconduct", "description": "Tavis Smiley is the second PBS talk-show host dropped by the public broadcaster amid allegations of sexual misconduct."}}, "movies": [], "publish_date": 1513094400.0, "source": "https://www.usatoday.com", "summary": ""}