{"url": "https://www.aceshowbiz.com/news/view/00115723.html", "text": "Celebrity\n\nJulia Louis-Dreyfus, Mark Hamill and more celebrities take to Twitter to jokingly claim that they were also offered to be Time's Person of the Year under certain fake conditions.\n\nNov 27, 2017\n\nAceShowbiz - Was %cDonald Trump% Time's choice to be its Person of the Year? It was, at least according to POTUS. The President claimed that he had been called by the magazine to inform him that he would \"probably\" receive the widely-respected honor which would come with certain condition, but he said that he had passed on it.\n\n\"Time Magazine called to say that I was PROBABLY going to be named 'Man (Person) of the Year,' like last year, but I would have to agree to an interview and a major photo shoot,\" so he wrote on Twitter on Friday, November 24. \"I said probably is no good and took a pass. Thanks anyway!\"\n\nTime Magazine called to say that I was PROBABLY going to be named “Man (Person) of the Year,” like last year, but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway! — Donald J. Trump (@realDonaldTrump) November 24, 2017\n\nTime quickly disputed Trump's claim. Taking to its own Twitter account, the magazine stated, \"The president is incorrect about how we choose Person of the Year. Time does not comment on our choice until publication, which is December 6.\"\n\nThe President is incorrect about how we choose Person of the Year. TIME does not comment on our choice until publication, which is December 6. — TIME (@TIME) November 25, 2017\n\nFormer Trump campaign manager Corey Lewandowski then fired back at the magazine, telling Fox News, \"The mainstream media has never wanted to give this president the credit that he's deserved. I don't know who else can be the Time magazine person of the year other than our president, Donald Trump. This president calls out the media when they're dishonest, and that's why the American people love him.\"\n\nMeanwhile, anti-Trump supporters won't miss the chance to mock the President. Among those were celebrities like %cJulia Louis-Dreyfus%, %cMark Hamill% and %cLance Bass%, who each claimed to have been offered similar title under different conditions.\n\n\"Veep\" star Louis-Dreyfus tweeted, \"[email protected] just called to say I was PROBABLY going to be named comedienne of the year but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway! @andy_murray.\"\n\n.@nytimes just called to say I was PROBABLY going to be named comedienne of the year but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway! @andy_murray — Julia Louis-Dreyfus (@OfficialJLD) November 25, 2017\n\nTennis star %cAndy Murray% wrote, \"Bbc just called to say I was PROBABLY going to be named sports personality of the year but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway!\"\n\nBbc just called to say I was PROBABLY going to be named sports personality of the year but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway! — Andy Murray (@andy_murray) November 24, 2017\n\n\"Star Wars\" actor Mark Hamill tweeted, \"Time Magazine called to say that I was DEFINITELY going to be named 'Man (Person) of the Year' but I would have to agree to leak major #Ep8 spoilers. I said 'no problem', but then they told me you turned it down and now I don't want it anymore. Thanks anyway!\"\n\nTime Magazine called to say that I was DEFINITELY going to be named \"Man (Person) of the Year\" but I would have to agree to leak major #Ep8 spoilers. I said \"no problem\", but then they told me you turned it down and now I don't want it anymore. Thanks anyway! https://t.co/0tPGr1cNEM — @HamillHimself (@HamillHimself) November 25, 2017\n\nFormer %cNSYNC% member Lance Bass quipped, \"Tiger Beat called and said I was probably going to be Boybander of the year, but it was going to take a long photo shoot and interview. Unfortunately, i have a long awaited appointment to frost my tips on the day of the interview so i turned it down! No thanks Tiger Beat!!!\"\n\nTiger Beat called and said I was probably going to be Boybander of the year, but it was going to take a long photo shoot and interview. Unfortunately, i have a long awaited appointment to frost my tips on the day of the interview so i turned it down! No thanks Tiger Beat!!! — Lance Bass (@LanceBass) November 25, 2017\n\n%cBilly Eichner% added, \"Time Magazine called me a few weeks ago too. This led to us texting and then, of course, sexting. We hooked up a few times, which was fun. But, ultimately, it didn't seem like an ideal match. It's too bad though because Time Magazine is really hot. Oh well. Thanks anyway!\"\n\nTime Magazine called me a few weeks ago too. This led to us texting and then, of course, sexting. We hooked up a few times, which was fun. But, ultimately, it didn't seem like an ideal match. It's too bad though because Time Magazine is really hot. Oh well. Thanks anyway! — billy eichner (@billyeichner) November 25, 2017\n\n%cKumail Nanjiani% also boasted, \"Hollywood called to say that The Big Sick was PROBABLY going to be named 'Movie (Film) of the Century,' & make a billion dollars at the box office (domestic) & win every Oscar, even ones from years past. I said probably is no good and took a pass. Thanks anyway!\"\n\nHollywood called to say that The Big Sick was PROBABLY going to be named “Movie (Film) of the Century,” & make a billion dollars at the box office (domestic) & win every Oscar, even ones from years past. I said probably is no good and took a pass. Thanks anyway! — Kumail Nanjiani (@kumailn) November 25, 2017\n\nTrump has yet to respond to Time's remark that he was never formally offered the title.", "images": ["https://www.aceshowbiz.com/display/images/90x60/2020/04/02/00151597.jpg", "https://www.aceshowbiz.com/display/images/90x60/2020/03/11/00150507.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152428.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152450.jpg", "https://www.aceshowbiz.com/display/images/90x60/2020/04/09/00151988.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152459.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152462.jpg", "https://www.aceshowbiz.com/display/images/300x400/2020/04/18/00152469.jpg", "https://www.aceshowbiz.com/display/images/90x60/2020/03/28/00151367.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/19/00152480.jpg", "https://www.aceshowbiz.com/images/news/stars-mock-donald-trump-for-claiming-he-turned-down-time-s-person-of-the-year-title.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152474.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152476.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152465.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152461.jpg", "https://www.aceshowbiz.com/display/images/90x60/2020/03/17/00150801.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152454.jpg", "https://www.aceshowbiz.com/assets/img/logo.png", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152449.jpg", "https://www.aceshowbiz.com/display/images/160x117/2020/04/18/00152471.jpg"], "top_img": "https://www.aceshowbiz.com/images/news/stars-mock-donald-trump-for-claiming-he-turned-down-time-s-person-of-the-year-title.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.aceshowbiz.com/news/view/00115723.html", "title": "Stars Mock Donald Trump for Claiming He Turned Down Time's Person of the Year Title", "meta_data": {"description": "Julia Louis-Dreyfus, Mark Hamill and more celebrities take to Twitter to jokingly claim that they were also offered to be Time's Person of the Year under certain fake conditions.", "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 320088948016615}, "og": {"title": "Stars Mock Donald Trump for Claiming He Turned Down Time's Person of the Year Title", "type": "article", "url": "https://www.aceshowbiz.com/news/view/00115723.html", "image": {"identifier": "https://www.aceshowbiz.com/images/news/stars-mock-donald-trump-for-claiming-he-turned-down-time-s-person-of-the-year-title.jpg", "alt": "Stars Mock Donald Trump for Claiming He Turned Down Time's Person of the Year Title"}, "site_name": "AceShowbiz", "description": "Julia Louis-Dreyfus, Mark Hamill and more celebrities take to Twitter to jokingly claim that they were also offered to be Time's Person of the Year under certain fake conditions."}, "twitter": {"title": "Stars Mock Donald Trump for Claiming He Turned Down Time's Person of the Year Title", "description": "Julia Louis-Dreyfus, Mark Hamill and more celebrities take to Twitter to jokingly claim that they were also offered to be Time's Person of the Year under certain fake conditions.", "image": "https://www.aceshowbiz.com/images/news/stars-mock-donald-trump-for-claiming-he-turned-down-time-s-person-of-the-year-title.jpg", "card": "summary_large_image", "site": "@aceshowbiz", "creator": "@aceshowbiz", "domain": "aceshowbiz.com"}, "robots": "index, follow", "Googlebot-news": "index, follow", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "theme-color": "#5F256F"}, "movies": [], "publish_date": null, "source": "https://www.aceshowbiz.com", "summary": ""}