{"url": "www.syfy.com/syfywire/donald-glover-sounds-off-on-the-lando-spin-off-rumors", "text": "Are you ready for Frasier in Space? What if we told you that it would star Donald Glover's Lando Calrissian? That's right, another day, another installment in the ongoing drama that is \"what will the next Star Wars spin-off film be?\" Today's guest is none other than Donald Glover himself.\n\nGlover recently sounded off on the Lando spin-off rumors to Entertainment Weekly during their Entertainment Weekly Radio show on SiriusXM. The hugely talented actor/writer/director/producer who has donned the cape of Lando Calrissian for Solo: A Star Wars Story, certainly sounds like he'd be interested in having more Lando in his life.\n\n“It would always be fun to be Lando again,” said Glover when asked about the recent spin-off rumors. “I would love to do it again. It’s really fun. The movie, I feel like, is wide open. This part of the universe without the… I feel like with the Skywalkers, it’s hard, because it’s almost like the Bible. There’s a story that you have to tell, and the lineage of that family. I feel like out here its like, yeah, we’re just like hustlers and gamblers and space pirates, essentially, so you can do a lot more and have a lot more fun.\"\n\nIt's also fairly clear that Glover himself is a fan of the Star Wars movies, as he adds, \"...and I like those movies a lot. I like the comedy of them, the silliness and also the adventure. I think it would just be fun to do.”\n\nWhat about a movie all about Lando specifically? Though Solo certainly features the dapper Mr. Calrissian, the story of the new film isn't about him. Would Glover be interested in anchoring his own story?\n\n“I mean, yeah. I think it would be fun to do,” he says. “It would be cool to see, like, Frasier in Space — like, a high-end guy in space. All of these characters are very specific and they have very specific points of view, so it’s always going to be fun to see them traveling around to a planet that is the opposite of what they’re used to…. And all of that seems like it would be fun to write, for sure.\"\n\nDoes that comment mean that the versatile Glover would want to possibly get involved behind the camera? Not so fast. He also adds, \"...it also is nice to not have to write that. It’s also nice to just, you know, show up in a cape and get pointed in the right direction.”\n\nWe imagine that not having to wear three hats during a production would allow Glover to have more fun, no question. There's also no question that these Lando spin-off movie rumors are not going away any time soon. Glover is insanely popular right now, and his Lando is expected to be a highlight of the new movie — many fans are already treating Lando: A Star Wars Story like it's a done deal. The recent Kathleen Kennedy interview mix up did not help.\n\nStill, it's a nice break from the never-ending Obi-Wan Kenobi spin-off rumors. For the record, that film has not been officially announced either. We'd love more Lando and more Kenobi, but nothing is set right now for either of them.\n\nSolo: A Star Wars Story finally hits theaters on May 25. Wear your cape.\n\n(via Entertainment Weekly)", "images": ["http://www.syfy.com/sites/syfy/themes/wired/assets/images/icons/SYFYWire_Logo.svg", "http://www.syfy.com/sites/syfy/themes/wired/assets/images/icons/watch--black.svg", "http://www.syfy.com/sites/syfy/themes/wired/assets/images/icons/hamburger--black.svg", "http://www.syfy.com/sites/syfy/themes/wired/assets/images/icons/close--black.svg", "http://www.syfy.com/sites/syfy/themes/wired/assets/images/icons/search--black.svg", "https://www.syfy.com/sites/syfy/files/styles/1200x680_hero/public/glover-lando.jpg", "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/glover-lando.jpg", "http://www.syfy.com/sites/syfy/themes/wired/assets/images/loading-spinner.gif"], "top_img": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/glover-lando.jpg", "keywords": [], "authors": ["Brian Silliman"], "canonical_link": "https://www.syfy.com/syfywire/donald-glover-sounds-off-on-the-lando-spin-off-rumors", "title": "Donald Glover sounds off on the Lando spin-off rumors", "meta_data": {"fb": {"app_id": 795894437245434}, "post_type": "syfywire_article", "drupal_parsely_version": "0.1", "description": "Donald Glover recently spoke his thoughts about the potential for a Star Wars spin-off featuring his version of Lando Calrissian. What did he have to say?", "keywords": "Donald Glover, Lando Calrissian, Star Wars, Solo: A Star Wars Story", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "SYFY WIRE", "url": "https://www.syfy.com/syfywire/donald-glover-sounds-off-on-the-lando-spin-off-rumors", "type": "article", "title": "Donald Glover sounds off on the Lando spin-off rumors", "description": "Are you ready for Frasier in Space? What if we told you that it would star Donald Glover's Lando Calrissian? That's right, another day, another installment in the ongoing drama that is \"what will the next Star Wars spin-off film be?\" Today's guest is none other than Donald Glover himself. Glover recently sounded off on the Lando spin-off rumors to Entertainment Weekly during their Entertainment Weekly Radio show on SiriusXM.", "image": {"identifier": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/glover-lando.jpg", "width": 1200, "height": 680}}, "twitter": {"card": "summary_large_image", "url": "https://www.syfy.com/syfywire/donald-glover-sounds-off-on-the-lando-spin-off-rumors", "title": "Donald Glover sounds off on the Lando spin-off rumors", "description": "Are you ready for Frasier in Space? What if we told you that it would star Donald Glover's Lando Calrissian? That's right, another day, another installment in the ongoing drama that is \"what will the"}, "article": {"publisher": "https://www.facebook.com/Syfy", "tag": "Solo: A Star Wars Story", "published_time": "2018-05-21T20:35:00-04:00", "modified_time": "2018-05-21T20:39:21-04:00"}, "FacebookShareMessage": "Donald Glover would be up for more Lando", "TwitterShareMessage": "The Star Wars #Lando spin-off is not official by any means, but @donaldglover could be interested", "author": "Brian Silliman", "msapplication-TileColor": "#e1ff00", "msapplication-TileImage": "https://www.syfy.com/sites/syfy/themes/wired/favicons/mstile-144x144.png", "msapplication-config": "https://www.syfy.com/sites/syfy/themes/wired/favicons/browserconfig.xml", "theme-color": "#e1ff00", "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=5, user-scalable=yes", "format-detection": "telephone=no", "apple-mobile-web-app-title": "syfy.com"}, "movies": [], "publish_date": 1526949300.0, "source": "http://www.syfy.com", "summary": ""}