{"url": "https://www.independent.co.uk/life-style/fashion/beauty-essentials-festival-season-face-wipes-dry-shampoo-glitter-a8298476.html", "text": "With Coachella underway our attention has turned to those few days of festival fun that await us, whether it’s a weekend at Wilderness, Glastonbury or further afield.\n\nBut thanks to late nights, copious amounts of booze and nowhere to shower, festivals don’t always lend themselves to the bouncy hair and glowing skin that Kate Moss would have you believe they do. Instead, slumming it is all part of the experience and as such your beauty bag is bound to take a hit. The key here is to pack lightly and keep your look simple with long-wearing products that can take you from day to night.\n\nHere is our list of must-have beauty buys that you’ll actually need this festival season.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nDry Shampoo\n\nWith nowhere to wash your locks, beat the grease and cheat your way to achieving salon-worthy hair with the help of a dry shampoo.\n\nA product which has earned a bad reputation over the years for leaving your tresses coated in a chalky, flaky residue, luckily a new generation of products has pretty much changed the hair game. Case in point: Sam McKnight’s Lazy Girl.\n\nThis dry shampoo, while pricier than some, is perfect for making your ’do last longer as it absorbs excess oil while simultaneously creating volume, texture and hold. It also smells heavenly, with notes of green leaf, watery flowers, cedar, frankincense and juniper wood.\n\nFace Wipes\n\nVery rarely will we advocate using face wipes but festivals are one of those occasions when the need for convenience dominates. That being said, it’s important to remember that not all wipes are created equal.\n\nOne of our favourites is Clinique’s Take The Day Off Face and Eye Cleansing Towelettes, which are saturated with gentle micellar liquid that promises to instantly refresh your complexion. So whether you’re dancing the night away or getting stuck in the mud you can rely on these handy towels to get rid of any festival-related grub in one quick sweep.\n\nWaterproof Mascara\n\nFrom unexpected downpours to getting emotional mid-ballad as you watch the main stage, your eye makeup needs to ward off the panda effect. As such, only a waterproof formula will do.\n\nFor full, fluttery lashes that promise to stay put all day and night we recommend investing in Too Faced’s Better Than Sex Waterproof Mascara, which uses a peptide-enriched formula to thicken, lengthen and curl. In just a few coats, your eyes will look bigger, brighter and more defined than ever before.\n\nCC Cream\n\nWearing a full face of makeup is a no-go as festivals call for a pared-back beauty routine. The answer? A CC cream that evens out your complexion and feels super-light on the skin.\n\nOur favourite is It Cosmetics’ Your Skin But Better CC Cream, which brightens, hydrates, protects, evens skin tone, fights wrinkles and instantly diffuses the appearance of fine lines, all without being too heavy. It’s also SPF 50, so you can be safe in the knowledge that on the off-chance there happens to be glorious weather, your skin will be protected.\n\nGlitter\n\nThere are very few occasions when, as a grown-up, it’s acceptable to wear glitter, and one of those is at festivals. Perfect for wearing on your cheekbones, eyelids or even to sprinkle onto your roots to disguise greasy hair, we love NYX’s Face & Body Glitter which comes in a spectrum of 12 dazzling shades.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/10/18/festival-beauty-0.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/10/18/festival-beauty-0.jpg", "keywords": [], "authors": ["Sarah Young"], "canonical_link": "https://www.independent.co.uk/life-style/fashion/beauty-essentials-festival-season-face-wipes-dry-shampoo-glitter-a8298476.html", "title": "The beauty essentials to pack this festival season", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/fashion/beauty-essentials-festival-season-face-wipes-dry-shampoo-glitter-a8298476.html", "title": "The beauty essentials to pack this festival season", "description": "Travel light, keep makeup simple and hey, it’s a festival, so ramp up the glitter", "updated_time": "2018-04-14T06:21:01+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/10/18/festival-beauty-0.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8298476"}, "description": "With Coachella underway our attention has turned to those few days of festival fun that await us, whether it’s a weekend at Wilderness, Glastonbury or further afield.", "keywords": "Fashion and Beauty, Beauty Products, 2018 festivals, Fashion, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Fashion and Beauty", "published_time": "2018-04-13T17:20:45+01:00", "modified_time": "2018-04-14T06:21:01+01:00", "section": "Fashion", "author_name": "Sarah Young", "content_type": "story", "word_count": 615, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 0, "external_link_count": 5}, "twitter": {"title": "The beauty essentials to pack this festival season", "description": "With Coachella underway our attention has turned to those few days of festival fun that await us, whether it’s a weekend at Wilderness, Glastonbury or further afield.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1523636445.0, "source": "https://www.independent.co.uk", "summary": ""}