{"url": "www.newidea.com.au/jennifer-aniston-pregnant-and-in-hiding", "text": "But sources say there’s another huge reason for her wanting to lie low – problems with Brad Pitt, who friends have confirmed would be the father of her child.\n\nIt’s believed Brad and Jen – who rekindled their fairytale romance after Jen’s marriage to Justin Theroux ended earlier this year – have been on the rocks in recent weeks because of Brad’s controversial relationship with Neri Oxman.\n\nLast month reports surfaced that Brad had been caught getting cosy with the beautiful young architect, leaving Jen feeling insecure and concerned about their relationship.\n\nAdded to this is the fact Jen’s also under immense pressure during her bitter divorce from Justin Theroux, from whom she split in February, and it’s a difficult time for the actress.\n\n‘She’s under a lot of stress at the moment, so... all these questions about a surprise pregnancy are the last thing she wants,’ adds the source.\n\n‘Not only is she going through a messy divorce, she’s having problems with Brad. Ever since his friendship with Neri went public, she’s been doubting their relationship and wondering whether he is serious about building a new life with her.\n\n‘Brad is desperately trying to convince Jen that they’re just friends and that he’s committed but Jen just isn’t buying it.\n\n‘She’s very wary of him – after all, it feels like only yesterday that he cheated on her with Angelina and destroyed their marriage.\n\n‘While Jen is hopeful that she and Brad will work things out, she’s also preparing herself for the fact that she may have to raise this baby alone. She has always said that she would be happy to be a single mother if that’s how everything worked out,’ reveals the insider.\n\nAfter her split from Justin earlier, People magazine reported that having kids was always part of her plan during their marriage.\n\n‘She had been sad it never happened,’ a source told the magazine. ‘But it never consumed her.’\n\nBut since their separation, Jen has realised that her window for having a child is closing fast, making this baby buzz a beautiful surprise.\n\n‘This could be a dream come true for her, and she’s not going to let troubles with Brad ruin it. If she winds up alone, that’s absolutely fine with her. All she wants is a baby.’\n\nOver the years, Jen has always dreamed of having a child, so the pregnancy is clearly everything to her.\n\nIn the past, she has lashed out at suggestions that she chose her Hollywood career over becoming a mum: ‘This continually is said about me: that I was so career-driven and focused on myself; that I don’t want to be a mother and how selfish that is,’ she told Allure.\n\nDenying that was the case, she said: ‘No. Even saying it gets me a little tight in my throat.’\n\nFor the full story, and to see more exclusive pictures of Jen's baby bump, see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg", "http://www.newidea.com.au/media/26858/jennifer-aniston-pre.jpg"], "top_img": "http://www.newidea.com.au/media/26858/jennifer-aniston-pre.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/jennifer-aniston-pregnant-and-in-hiding", "title": "Jennifer Aniston's shock news: Pregnant and in hiding", "meta_data": {"language": "en-us", "description": "After years of baby heartbreak for Jennifer Aniston, these are the photos that will shock the world.", "news_keywords": "Jennifer Aniston, Jennifer Aniston pregnant and in hiding, Jennifer Aniston pregnant, Jen Aniston, Jen Aniston pregnant, Jennifer Aniston is pregnant, Jennifer Aniston is hiding, Brad Pitt, Justin Theorux, Jen raising a baby on her own, Aniston, Jen Aniston latest, celebrity babies, celebrity single mums, celebrity news, celeb news, latest celebrity news", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/jennifer-aniston-pregnant-and-in-hiding", "title": "Jen's shock news: Pregnant and in hiding", "description": "After years of baby heartbreak for Jennifer Aniston, these are the photos that will shock the world.", "image": {"identifier": "http://www.newidea.com.au/media/26858/jennifer-aniston-pre.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Jennifer Aniston's shock news: Pregnant and in hiding", "description": "After years of baby heartbreak for Jennifer Aniston, these are the photos that will shock the world.", "image": "http://www.newidea.com.au/media/26858/jennifer-aniston-pre.jpg", "url": "https://www.newidea.com.au/jennifer-aniston-pregnant-and-in-hiding"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1525641108.489, "source": "http://www.newidea.com.au", "summary": ""}